[
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/11/2022",
        "dateOfIncident": "02/11/2022",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451553,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "The 2003 Subaru Forester Sub Frame is rusted.  I live in Illinois.",
        "vin": "JF1SG63673G"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/31/2021",
        "dateOfIncident": "12/30/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445737,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "Safety Recall: WVX34  NHTSA Campaign: 11V464000  The front lower passenger side control arm completely rusted in half. It occurred while parking vehicle, fortunately not driving at high speed. The recall was previously completed by Subaru dealership in Ann Arbor, Michigan, in 2011. According to service records, they had been treated with anti-corrosion coating... I purchased the vehicle from a family member of the original owner, weeks ago, December 2021. It had been serviced regularly by the dealership and now has 162,000 miles.  This structural failure of the lower control arm could have been extremely disastrous if driving at speed on the road or highway!  I contacted my local dealership in Traverse City, MI, and was told by the service advisor the recall had been completed and would not be covered again for subsequent replacement.  My vehicle is undrivable and Subaru is not standing behind their parts or workmanship.",
        "vin": "Jf1sg63673h"
    },
    {
        "components": "STEERING,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/17/2021",
        "dateOfIncident": "05/11/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11417380,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I bought the 2003 Forrester off Craig's list While driving the car the steering is very loose and sways on the road . I noticed a small it was funny I could not identify it. I woke latter that night with a headache at the base of my skull and was extremely dizzy and nausea. I felt that way. Through out. The day. I drove it a short. distance the next day with the windows down. I begin hearing a grinding. Thumping noise in the rear . tites or brakes .bur it sounded like it was going to fall apart.  The inside of the car had a oily dust all over it. And the funny smell. I looked. At exhaust. Pipe to see. How it looked and I put my finger in what was coming. Our. And it was dark oil. I have not driven the car since. I found out the name on the tittle is not who sold me the car. He lied to me about every thing. He said buyers remorse. I believe the car unsafe to drive I could have bern killed.",
        "vin": "JF1SG63613H"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/08/2021",
        "dateOfIncident": "02/08/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395139,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN AMBIENT AIR TEMPERATURE IS COLD (BELOW ABOUT 20-30 F), THE VEHICLE GIVES OFF A STRONG GASOLINE SMELL. THIS IS CAUSED BY THE FUEL RAIL CONTRACTING TO THE POINT THAT SOME FUEL IS SPRAYED ONTO THE ENGINE COMPARTMENT. OBVIOUSLY, THIS IS A FIRE RISK.",
        "vin": "JF1SG63633H"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/08/2021",
        "dateOfIncident": "02/08/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395140,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEAD GASKET FAILED IN A MANNER WHICH CAUSED ENGINE OIL TO LEAK ONTO THE HOT EXHAUST MANIFOLD.  A STRONG BURNING ODOR IS PRESENT AFTER THE ENGINE WARMS UP COMPLETELY.",
        "vin": "JF1SG63633H"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "02/02/2021",
        "dateOfIncident": "02/01/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394379,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Ningbo shuwu Import & Export Co.,ltd",
                "productMake": "HIKARI TECHNOLOGY",
                "productModel": "LED HEADLIGHT BULB",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "I HAVE A COMPLAINT ABOUT THE PROPOSED RECALL REMEDY FOR NHTSA ID: 21E002000 .    THE NOTICE SAYS, \"NINGBO WILL NOTIFY DISTRIBUTORS, AND OWNERS, AND WILL REPLACE THE BULB WITH HALOGEN BULBS, FREE OF CHARGE.\"    THIS OFFERED REPLACEMENT OF THEIR DEFECTIVE LED BULB WITH A HALOGEN BULB IS NOT AN ACCEPTABLE RECALL REMEDY BECAUSE LED BULBS ARE FAR SUPERIOR TO HALOGEN BULBS.  ESPECIALLY LED BULBS LAST MUCH LONGER AND DRAIN MUCH LESS POWER FROM THE CAR'S ELECTRICAL SYSTEM THAN HALOGEN BULBS.    I ORIGINALLY BOUGHT THEIR LED BULBS BECAUSE OF THESE ADVANTAGES AND REPLACING THEM WITH INFERIOR HALOGEN BULBS DEFEATS THE PURPOSE OF HAVING BOUGHT LED BULBS TO BEGIN WITH.",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/09/2020",
        "dateOfIncident": "11/08/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11373776,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT'S DAUGHTER OWNS A 2003 SUBARU FORESTER. THE CONTACT STATED THAT WHILE HIS DAUGHTER WAS DRIVING 30 MPH, THE VEHICLE BEGAN TO SWAY FROM SIDE TO SIDE WITHOUT WARNING WHILE MAKING AN ABNORMAL METALLIC GRINDING SOUND. HIS DAUGHTER PULLED OVER AND CALLED HIM FOR ASSISTANCE UPON ARRIVAL, HE NOTICED THAT THE PASSENGER'S SIDE FRONT TIRE WAS NOT FACING FORWARD. THE CONTACT THEN INSPECTED THE VEHICLE AND DISCOVERED THAT THE FRONT PASSENGER'S SIDE TIRE WAS DETACHED FROM THE CONTROL ARM. THE CONTACT ALSO DISCOVERED THAT THE CV SHAFT WAS ALSO DETACHED FROM THE TRANSMISSION, WHICH RESULTED IN OIL LEAKING ONTO THE CROSS MEMBER. DUE TO THE FAILURE, THE CONTACT SLOWLY DROVE THE VEHICLE TO HIS RESIDENCE. UPON INVESTIGATION, THE CONTACT DISCOVERED NHTSA CAMPAIGN NUMBER: 11V464000 (SUSPENSION) WHICH HE LINKED TO THE FAILURE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND INFORMED THE CONTACT THAT THE RECALL REMEDY WAS ALREADY PERFORMED ON THE VEHICLE. THE CONTACT WAS REFERRED TO A LOCAL DEALER AND NO FURTHER ASSISTANCE WAS OFFERED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 190,000.*DT*JB*DT  THE CONSUMER PROVIDED PHOTOS AND DOCUMENTS. *TR*DT",
        "vin": "JF1SG65693H"
    },
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "08/28/2019",
        "dateOfIncident": "08/09/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11252119,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY MOTHER WAS PULLING HER CAR OUT OF THE GARAGE WHEN IT SUDDENLY ACCELERATED & SHOT DOWN THE DRIVEWAY, ACROSS THE STREET, THRU THE NEIGHBOR'S HOUSE AND LANDED IN THEIR BACKYARD. THE CAR JUST MISSED MY FATHER IN THE DRIVEWAY AND THE NEIGHBORS IN THEIR HOUSE. THE INSURANCE ADJUSTER SAID THE CAR WAS AIRBORNE WHEN IT WENT THRU THE FRONT DOOR BASED ON THE DAMAGE TO THE FRONT DOOR & THE SKID MARKS ON THE TILE IN THE HALLWAY. THE AIR BAGS DIDN'T DEPLOY. THE CAR IS A TOTAL LOSS. A FEW MONTHS PRIOR TO THIS MY MOTHER WAS PARKING THE CAR WHEN IT SUDDENLY ACCELERATED. IT CROSSED THE SIDEWALK AT THE STORE & HIT ANOTHER CAR. AT THE TIME SHE THOUGHT THAT HER FOOT MUST HAVE SLIPPED OFF THE BRAKE. MY FATHER DROVE IT A FEW WEEKS AFTER THAT & SAID IT WANTED TO ACCELERATE WHILE HE WAS STOPPED AT A RED LIGHT WITH HIS FOOT ON THE BRAKE. THE FAILURE MILEAGE WAS APPROX. 72,000.",
        "vin": "JF1SG65683H"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/15/2019",
        "dateOfIncident": "04/05/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11220275,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT SUBFRAME ON THE DRIVER AND PASSENGER SIDE RUSTS AWAY CAUSING FAILURE. COULD RESULT IN LOSS OF CONTROL OF VEHICLE AND COULD INJURE PASSENGERS. TURNING OR HITTING BUMPS COULD CAUSE IT TO SNAP DUE TO EXTRA FORCE.",
        "vin": "JF1SG65663H"
    },
    {
        "components": "SUSPENSION",
        "crash": true,
        "dateComplaintFiled": "11/01/2018",
        "dateOfIncident": "10/20/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11144642,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 SUBARU FORESTER. THE CONTACT STATED THAT WHILE HIS DAUGHTER WAS DRIVING AT 65 MPH, THERE WAS AN ABNORMAL NOISE WHICH EMITTED FROM THE PASSENGER'S SIDE FRONT SUSPENSION OF THE VEHICLE. THE CONTACT STATED THAT THE VEHICLE BECAME UNCONTROLLABLE, GOING FROM THE RIGHT LANE TO THE EXTREME LEFT LANE, DOWN AN EMBANKMENT INTO ONCOMING TRAFFIC. THE CONTACT STATED THAT THERE WAS NO OTHER VEHICLE INVOLVED. NO INJURIES WERE SUSTAINED. THE CONTACT STATED ON INSPECTING THE VEHICLE, THE CONTACT BECAME AWARE THAT THE PASSENGER'S SIDE FRONT LOWER CONTROL ARM FRACTURED WHICH CAUSED THE SEPARATION OF THE WHEEL FROM THE SUSPENSION. THE FRACTURE CAUSED DAMAGE TO THE INSIDE WHEEL WELL OF THE VEHICLE. THE VEHICLE WAS TOWED TO THE RESIDENCE. MILLER SUBARU (1592 NJ-38, LUMBERTON, NJ 08048, (609) 267-4000) WAS CONTACTED AND NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT DIAGNOSED. THE VEHICLE WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 11V464000 (SUSPENSION). THE CONTACT STATED THAT THE VEHICLE WAS REPAIRED BUT WAS NOT GIVEN PROOF THAT THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS CONTACTED AND NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 122,000.",
        "vin": "JF1SG63613H"
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/17/2018",
        "dateOfIncident": "08/10/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11120592,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 SUBARU FORESTER. THE CONTACT NOTICED EXTENSIVE RUST, CORROSION, AND HOLES AROUND THE FRONT FRAME OF THE VEHICLE. AN INDEPENDENT MECHANIC REPLACED THE FRONT FRAME, AND THE PASSENGER AND DRIVER SIDE CONTROL ARMS. IN ADDITION, THE REAR FRAME AND DRIVER AND PASSENGER SIDE CONTROL ARMS WERE ALSO INSPECTED WITH THE EXPECTATION THAT THOSE PARTS HAD ALSO DETERIORATED AND MAY NEED TO BE REPLACED. THE VEHICLE WAS NOT DIAGNOSED BY A DEALER. THE CONTACT WAS UNCERTAIN IF THE VEHICLE WAS INCLUDED OR EXCLUDED FROM NHTSA CAMPAIGN NUMBER: 11V464000 (SUSPENSION) AND WAS NOT INCLUDED IN NHTSA ACTION NUMBER: PE11011 (SUSPENSION). THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VIN AND FAILURE MILEAGE WERE NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/23/2018",
        "dateOfIncident": "03/13/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11081121,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER SIDE FRONT LOWER CONTROL ARM SEPARATED AT THE WELD SEAM WHILE MY DAUGHTER WAS DRIVING THE CAR. THE PASSENGER SIDE FRONT TIRE SWUNG REARWARD AND OUTWARD BECAUSE THE FRONT PORTION OF THE LOWER CONTROL ARM SEPARATED FROM THE REST OF THE CONTROL ARM. THIS PULLED THE CAR OFF THE ROAD BUT LUCKILY SHE WAS TRAVELING AT A SLOW SPEED ON A SIDE ROAD ON HER WAY TO GET ON THE INTERSTATE AND WAS ABLE TO GET THE CAR STOPPED BEFORE CRASHING. HAD THIS HAPPENED AT ANY NORMAL ROAD SPEED SHE WOULD LIKELY HAVE DIED FROM A COMPLETE LOSS OF CONTROL OF THE CAR AT A HIGH RATE OF SPEED. THERE WAS A RECALL IN 2011 ON THESE CARS FOR THIS VERY CONDITION. MY CAR SHOWS \"COMPLETE\" IN THEIR SYSTEM FOR THIS RECALL BUT IT WAS EITHER NOT ACTUALLY COMPLETED OR THE REPLACEMENT PARTS ARE EQUALLY AS DANGEROUS AND NEED TO BE RECALLED AGAIN. I NOTIFIED SUBARU OF AMERICA AND TOOK THE CAR TO A SUBARU DEALERSHIP FOR THEM TO REVIEW BUT SUBARU OF AMERICA WAS NOT CONCERNED SAYING IT SHOWED COMPLETE SO THERE WAS NOTHING THEY COULD DO. SINCE THIS HAS HAPPENED TO ME I HAVE FOUND OTHERS ONLINE WHO HAD SUBARU DEALERS COMPLETE THE RECALL WITHOUT CHANGING SEVERELY CORRODED LOWER CONTROL ARMS JUST LIKE MINE. I AM AFRAID THAT OTHER PEOPLE OR THEIR CHILDREN ARE IN DANGER OF LOSING THEIR LIVES DUE TO SUBARU'S NEGLIGENCE.     MANUFACTURER: SUBARU OF AMERICA, INC. MFR'S REPORT DATE: SEP 06, 2011    NHTSA CAMPAIGN ID NUMBER: 11V464000 NHTSA ACTION NUMBER: PE11011    COMPONENT: SUSPENSION:FRONT:CONTROL ARM:LOWER ARM    POTENTIAL NUMBER OF UNITS AFFECTED: 295,123  THIS IS SUBARU'S SAFETY RECALL NUMBER WVX-34.",
        "vin": "JF1SG65633H"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/05/2018",
        "dateOfIncident": "01/05/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11060857,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL LEAKS FROM THE FUEL LINES AROUND THE ENGINE WHEN IT'S COLD.",
        "vin": "JF1SG65643H"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/04/2018",
        "dateOfIncident": "12/23/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11058454,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL LINE LEAKING UNDER 20 DEGREE TEMPS, SMELLS STRONGLY OF GAS INSIDE AND OUTSIDE OF THE VEHICLE WHILE IDOLING AS WELL AS DRIVING",
        "vin": "JF1SG63623H"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/29/2017",
        "dateOfIncident": "12/01/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11057291,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 SUBARU FORESTER. THE CONTACT STATED THAT WHILE OPERATING THE VEHICLE DURING COLD WEATHER, AN ODOR OF FUEL WAS PRESENT INSIDE THE VEHICLE. THE FAILURE WOULD ONLY OCCUR IN TEMPERATURES BELOW 25 DEGREES. THE VEHICLE WAS TAKEN TO NEIL HUFFMAN SUBARU DEALER LOCATED AT 4916 DIXIE HWY, LOUISVILLE, KY 40216 WHO TIGHTEN AND RE-CLAMPED THE FUEL LINES BUT THE FAILURES CONTINUED TO OCCURRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 114,000.  *TT  *TR",
        "vin": "JF1SG63643H"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/03/2017",
        "dateOfIncident": "05/26/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10992972,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS ORIGINALLY RECALLED IN 2011/2012 FOR NHTSA CAMPAIGN ID NUMBER: 11V464000 NHTSA ACTION NUMBER: PE11011. AT TIME, DEALER CONDUCTED PUNCH TEST AND DETERMINED LOWER CONTROL ARM TO \"PASS\" AND USED SOME TYPE OF ANTI-CORROSION SPRAY. FAST FORWARD TO 2017 AND LOWER CONTROL ARMS HAVE \"FAILED\" PUNCH TEST WITH SIGNIFICANT CORROSION. I ONLY DETECTED THIS FAILED, AND POTENTIALLY LIFE THREATENING CONDITION OF VEHICLE, BY PERSONALLY INSPECTING UNDER CARRIAGE PRIOR TO GIVING VEHICLE TO 16 YEAR-OLD SON AS FIRST CAR. I CAN ONLY IMAGINE HOW MANY OF THESE SUBARU FORESTERS THAT WERE PREVIOUSLY, AND QUITE CONVENIENTLY DETERMINED TO PASS BY PUNCH TEST, ARE OUT THERE ON THE STREETS AND HIGHWAYS WITH POTENTIAL SERIOUS CONSEQUENCES TO THE UNKNOWING OWNERS OF THESE VEHICLES. I RESPECTFULLY SUBMIT THAT SUBARU SHOULD NEVER HAVE BEEN GIVEN THE OPTION TO \"PUNCH\" TEST THESE LOWER CONTROL ARMS AND SHOULD HAVE BEEN MADE TO REPLACE THESE CRITICAL PARTS. I WOULD LIKE TO SEE SUBARU ADDRESS THE ISSUE. TO DATE, I HAVE CONTACTED SUBARU OF AMERICA AND HAVE BEEN DENIED ANY REMEDY, NOR ALLOWED TO TALK TO A SUPERVISOR.",
        "vin": "JF1SG63663H"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "05/01/2017",
        "dateOfIncident": "04/28/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10981767,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING DOWN THE ROAD AND LEFT FRONT WHEEL LOCKED UP CAR WENT OUT OF CONTROL AND ENDED UP IN A DITCH. LUCKY WAS ONLY DRIVING 35 MPH AND NOT OUT ON THE FREEWAY. THIS HAPPENED ON A RURAL ROAD WITH LIMITED TRAFFIC. LEFT FRONT LOWER CONTROL ARM BROKE AND WHEEL CAME UP AGAINST THE INNER FENDER AND CAUSING LOSS OF CONTROL. THIS BROKE THE CV AXLE IN HALF AND ALSO BROKE THE TIE ROD ENDS. BOTH WHEELS POINTED OUTWARD   FOUND A RECALL 11464000 AND IT WAS NEVER COMPLETED ON THE CAR. JUST BOUGHT THE CAR IN PA 2 WEEKS AGO.",
        "vin": "JF1SG63653H"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/14/2017",
        "dateOfIncident": "03/11/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10965952,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 SUBARU FORESTER. WHILE DRIVING AT A LOW SPEED, A LOUD NOISE WAS HEARD COMING FROM THE FRONT OF THE VEHICLE. UPON EXITING THE VEHICLE, THE CONTACT FOUND NO DAMAGE. UPON RE-ENTERING THE VEHICLE AND DEPRESSING THE ACCELERATOR PEDAL, THE VEHICLE FAILED TO MOVE. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE FRONT LOWER CONTROL ARM WAS FRACTURED. IN ADDITION, THE FRONT PASSENGER SIDE LOWER CONTROL ARM AND SWAY BAR LINK WERE SEVERELY RUSTED. THE VEHICLE WAS REPAIRED. THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 11V464000 (SUSPENSION). THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 162,000.  ..UPDATED 05/09/17 *BF  UPDATED 05/17/2017*JS",
        "vin": "JF1SG656X3H"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/07/2017",
        "dateOfIncident": "01/05/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10940304,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE WEATHER TURNS COLD THERE THE SMELL OF GASOLINE IN THE CABIN IT HAPPENS WHEN THE CAR IS IN IDLE MODE WHEN DRIVING THE SMELL DISSIPATES BUT YOU CAN STILL SMELL IT FAINTLY   I NOTICED IT LAST YEAR I WENT TO THE DEALERSHIP IN SEPTEMBER 2016 AND THEY NOTICED A POOLING OF GASOLINE  BUT THEY NOTICE ANYTHING BECAUSE THE WEATHER WAS WARM  SO THEY TIGHTENED THEY TIGHTENED THE ENGINE TO THE CHASSIS",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/06/2017",
        "dateOfIncident": "01/02/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10940238,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THREE YEARS AGO, WE STARTED TO NOTICE A FUEL SMELL WHEN DRIVING OUR 2003 SUBARU FORESTER ON VERY COLD DAYS (BELOW 20 DEGREES).  WE TOOK IT TO THE LOCAL SUBARU DEALER FOR SERVICE.  THEY COULDN'T FIND A SPECIFIC LEAK, BUT THEY TIGHTENED THE CLAMPS AROUND THE FUEL LINES.  WE CONTINUED TO NOTICE THE SMELL AND TOOK THE CAR TO OTHER SERVICE CENTERS TO SEE IF ANOTHER MECHANIC COULD FIND THE SOURCE OF THE ODOR.  WE RECENTLY TOOK THE DARK BACK TO THE SUBARU DEALER AND WERE INFORMED THAT THE FUEL LINES NEED TO BE REPLACED AT A COST OF $700.  WE DID SOME RESEARCH ONLINE AND FOUND MANY SUBARU OWNERS COMPLAINING OF SIMILAR ISSUES ON FORESTER AND OTHER SUBARU MODELS MANUFACTURED IN THE EARLY 2000S.  OTHER OWNERS REPORTED THAT THIS IS A MANUFACTURING DEFECT WITH THE CAR.  GIVEN THE SAFETY RISK OF LEAKING FUEL, WE URGE NHTSA TO INVESTIGATE.  *TR",
        "vin": "JF1SG63663H"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/17/2016",
        "dateOfIncident": "10/23/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10926595,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 SUBARU FORESTER. WHILE THE VEHICLE WAS UNDERGOING A ROUTINE OIL CHANGE, THE CONTACT WAS INFORMED THAT THE SUBFRAME WAS COMPLETELY RUSTED. THE DEALER DIAGNOSED THAT THE SUBFRAME NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 119,000.",
        "vin": "JF1SG65693H"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/12/2016",
        "dateOfIncident": "10/12/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10915550,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 SUBARU FORESTER. WHILE ATTEMPTING TO REVERSE AT 5 MPH, THE VEHICLE FAILED TO MOVE. THE CONTACT DISCOVERED THAT THE FRONT LOWER CONTROL ARM WAS FRACTURED. THE VEHICLE WAS TOWED TO THE CONTACT'S RESIDENCE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 170,000. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/05/2016",
        "dateOfIncident": "04/22/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10863463,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE HIGHWAY, GOING STRAIGHT, WHEN SUDDENLY MY CAR STARTED ACCELERATING AT FULL SPEED. I CHECKED AND MADE SURE MY FOOT WAS ON THE BREAK INSTEAD OF THE GAS, WHICH IT WAS. THE CAR PROCEEDED TO MOVE FORWARD EVEN WITH BOTH OF MY FEET AND ALL OF MY WEIGHT ON THE BREAK, AND IT STARTED ACCELERATING AGAIN BECAUSE THE BREAK COULD NOT STOP IT OR HOLD ON. I PULLED TO THE SIDE OF THE ROAD AND THREW THE CAR IN PARK EVEN THOUGH IT WAS STILL GOING 15 MPH AND CLIMBING. EVEN IN PARK, THE ENGINE WAS GOING AS HARD AS IT COULD GO. I HAVE NOT DRIVEN THE CAR SINCE.",
        "vin": "JF1SG65643H"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/11/2016",
        "dateOfIncident": "02/01/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10825616,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS GETTING NEW TIRES PLACED ON MY VEHICLE WHEN MY MECHANIC NOTICED THAT MY CONTROL ARMS AS WELL AS THE SUBFRAME WAS RUSTED OUT. I CONTACTED SUBARU WHO STATED THERE WAS A RECALL ON THE CONTROL ARMS FOR RUSTING OUT BUT NOT ON THE SUBFRAME. WHEN THE VEHICLE WAS BROUGHT TO SUBARU DEALERSHIP TO GET CONTROL ARMS PLACE ON A MECHANIC FROM THE DEALER SHIP CONTACTED ME. HE STATED THAT THE SUBFRAME WAS IN BAD SHAPE AND THAT IF THEY WERE INSPECTING THE VEHICLE THEY COULD NOT PASS THE INSPECTION PER THE LEVEL OF RUST AND CORROSION OF THE SUBFRAME. THEY STATED THAT BOTH THE FRONT AND REAR SUBFRAME WOULD HAVE TO BE REPLACED/FIXED. MY MECHANIC HAS NEVER SEEN A SUBFRAME CORRODE SO BADLY IN SUCH A SHORT PERIOD OF TIME. THE LAST THING ON A CAR TO GO SHOULD BE THE SUBFRAME AND FRAME OF THE VEHICLE. THERE IS OBVIOUSLY A SAFETY ISSUE WITH THIS AND I AM REALLY SURPRISED THERE IS NO RECALL IN REF TO THIS. I AM NOT SURE HOW THEY DON'T KNOW THIS IS AN ISSUE WHEN THEY KNOW THERE WAS AN ISSUE WITH THE CONTROL ARMS.",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/30/2016",
        "dateOfIncident": "01/11/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10823244,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "LAST WINTER ON COLD DAYS I NOTICED STRONG FUEL SMELL COMING INTO INTERIOR CABIN OF CAR, ATTRIBUTED IT TO DIRTY AIR FILTER, CHANGED IT AND WEATHER GOT NICE SO SMELL WAS GONE. NOW IT'S JANUARY AGAIN AND COLD TEMPS HAVE ARRIVED, NOTICED THE SMELL AGAIN WORSE THAN EVER.  WHILE TAKING CAR FOR OIL CHANGE THE TECHNICIAN TOLD ME I HAVE A FUEL LEAK AND THAT IS WHY THE CAR SMELLS LIKE GAS.  NOW I WON'T DRIVE MORE THAN 10 MILES FEARFUL THAT I MAY WIND UP IN A ROLLING FIREBALL.  SINCE THERE A MULTITUDES OF COMPLAINTS ONLINE REGARDING THIS, I THINK SUBARU OF AMERICA NEEDS TO DO 1 THING..RECALL AND REPLACE AT NO CHARGE TO OWNERS. IT SMELLS WHEN IT IS STARTED, SMELLS DURING INITIAL DRIVE AND FOR QUITE SOME TIME -- DRIVING WITH WINDOWS DOWN AT 30 DEGREES AND BELOW IS DIFFICULT, I DID IT DURING OUR BLIZZARD TOO.  AREA AROUND ENGINE REEKS OF FUEL AS WELL.   I ALREADY HAD TO REPLACE HEAD GASKETS ONLY TO FIND OUT THAT THERE WAS A RECALL ON THOSE FOR THE PRIOR FEW YEARS WHICH MY MODEL WASN'T COVERED UNDER. INSTALLED NEW MUFFLER SO THAT'S NOT IT EITHER.",
        "vin": "JF1SG63653H"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/10/2016",
        "dateOfIncident": "01/10/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10819216,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "EVERYONE THE TEMPERATURE GETS BELOW FREEZING THERE IS A TERRIBLE GASOLINE SMELL THAT FILLS THE CABIN OF THE CAR. IT IS ALMOST TO THE POINT WHERE YOU CANNOT DRIVE THE CAR AND IT CAUSES HEADACHES. THIS HAPPENS WHEN STARTING THE CAR AND WHILE DRIVING IT.",
        "vin": "JF1SG65623H"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/28/2015",
        "dateOfIncident": "12/14/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10816427,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 SUBARU FORESTER. THE CONTACT STATED THAT WHILE THE VEHICLE WAS IN FOR ROUTINE MAINTENANCE, THE CONTACT WAS NOTIFIED THAT THE FRONT SUSPENSION HAD SEVERE CORROSION AND NEEDED TO BE REPLACED. THE CONTACT STATED THAT THE LOWER CONTROL ARMS WAS CORRODED. THE VEHICLE WAS PREVIOUSLY REPAIRED UNDER NHTSA CAMPAIGN NUMBER: 11V464000 (SUSPENSION) HOWEVER, THE FAILURE RECURRED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 70,000.",
        "vin": "JF1SG65623G"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/28/2015",
        "dateOfIncident": "07/18/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10777985,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "INSPECTION OF VEHICLE IN JULY 18,2003 REQUIRED REPLACEMENT OD BOTH SUBFRAME BARS DUE TO SEVERE RUST.      SECOND INCIDENT INVOLVED SEVERE LOSS OF CONTROL OF VEHICLE WHILE DRIVING IN HEAVY TRAFFIC.  LOWER CONTROL ARM, AND DRIVERS SIDE AXLE BROKE, AND BENT WHICH CAUSED VEHICLE TO HOP, JUMP, LOSS OF STEERING.  STOPPED BY RUNNING ALONG SIDE OF CURB.  HAD TO REPLACE AXLE AND LOWER CONTROL ARM DUE TO SEVERE RUST.  MECHANIC SAID PARTS WERE BACK ORDER FOR MONTHS.  WAS NOT ABLE TO REPLACE SO HE RESHAPED A 2002 SUBARU ASSEMBLY TO RETURN MY VEHICLE, AFTER 11 DAYS ON HIS LIFT.    I AM 73 YRS. OLD AND HAVE CHRONIC ANXIETY ISSUES.  AM STILL AFRAID TO DRIVE THIS VEHICLE BECAUSE PASSENGER SIDE ALSO LOOKS RUSTY.",
        "vin": "JF 1SG63623"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/14/2015",
        "dateOfIncident": "11/03/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10763615,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 SUBARU FORESTER. WHILE REVERSING AT APPROXIMATELY 5 MPH, THE FRONT DRIVER SIDE WHEEL FRACTURED WITHOUT WARNING. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE FRONT DRIVER SIDE LOWER CONTROL ARM FRACTURED AND NEEDED TO BE REPLACED. THE CONTACT MENTIONED THAT THE FAILURE OCCURRED AFTER THE VEHICLE WAS SERVICED UNDER NHTSA CAMPAIGN NUMBER: 11V464000 (SUSPENSION). THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 111,000.",
        "vin": "JF1SG63683H"
    },
    {
        "components": "SUSPENSION,STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/01/2015",
        "dateOfIncident": "09/01/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10760826,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TODAY I WAS AT MY MECHANICS TO REPLACE A MUFFLER. AFTER RAISING THE CAR UP ON THE RACK HE NOTICED DESTRUCTIVE RUST THAT WAS COVERING AND INUNDATING THE K FRAME AND FRONT LOWER CONTROL ARMS (TRANSVERSE LINKS). IN SEPTEMBER OF 2012 I WAS AT GARY LANG SUBARU (ILLINOIS) FOR AN UNRELATED ISSUE. THE SAFETY RECALL FOR MY VEHICLE , WVX-34, REQUIRED AN INSPECTION AND REPAIRS, AND IF NECESSARY, REPLACEMENT OR CORROSION TREATMENT OF THE LOWER CONTROL ARMS (TRANSVERSE LINK). ACCORDING TO SUBARU OF AMERICA, THAT RECALL WAS \"COMPLETED\". THE SUBARU OPERATOR (KAYLA) COULD NOT ELABORATE ON THE TERM \"COMPLETE\". NO MENTION OF ANY SPECIFIC ACTION WAS REPORTED. TODAY, DURING THE INSPECTION OF SAID AREA, MY MECHANIC INDICATED THAT NO PROOF EXISTED OF EITHER CORRECTIVE ACTION, EITHER UNDERCOATING OR MECHANICAL REPAIR OR REPLACEMENT. THIS IS A SAFETY CONCERN, AND AT SOME POINT IT IS POSSIBLE THAT LOSS OF CONTROL WILL FOLLOW IF THE LOWER CONTROL ARM BREAKS. I WILL PURSUE THE SUBARU DEALER FOR REPAIRS BUT HAVE NO IDEA IF THEY WILL ASSUME RESPONSIBILITY.",
        "vin": "JF1SG65653G"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/05/2015",
        "dateOfIncident": "05/01/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10723665,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WE PURCHASED THIS CAR NEW AND MAINTAINED IT ACCORDING TO THE MANUFACTURER'S MAINTENANCE SCHEDULE.  HOWEVER, AROUND 75,000 MILES THE HEAD GASKETS STARTED LEAKING.  AFTER EACH USE OF THE CAR, OIL WOULD LEAK ONTO THE EXHAUST MANIFOLD AND PRODUCE A BURNT OIL SMELL IN THE GARAGE; NOT GOOD.  THE LEAK REMAINED LIMITED AND OUR SERVICE TECHNICIAN (AAA-APPROVED), ADVISED US TO NOT MAKE ANY REPAIRS RIGHT AWAY, BUT TO MONITOR THE LEAK.     THE LEAKING BECAME PROGRESSIVELY WORSE AND AFFECTED BOTH THE LEFT AND RIGHT SIDE OF THE BOXER CYLINDER HEADS.  AT 90,000 MILES, THE LEAKS REQUIRED A FULL HEAD GASKET REPAIR, NECESSITATING EXTRACTION OF THE ENTIRE ENGINE.  WHILE THIS WORK WAS DONE, TIMING BELT, WATER PUMP AND OTHER UNRELATED MAINTENANCE ISSUES WERE PERFORMED.      THE MAIN COMPLAINT WE HAVE IS WITH THE PREMATURE FAILURE OF THIS BOXER ENGINE'S HEAD GASKETS.  SUBARU *KNOWS* THERE IS A PROBLEM AS IT RECOMMENDS AN COOLANT ADDITIVE FOR OLDER ENGINES IN AN ATTEMPT TO POSTPONE THE HEAD GASKET PROBLEMS.     AND A QUICK GOOGLE SEARCH REVEALS THAT MANY THOUSANDS OF SUBARU OWNERS HAVE HAD HEAD GASKET PROBLEMS, YET SUBARU OF AMERICA (SOA) HAS NEVER ISSUED A RECALL.  IF THE BOXER ENGINE DESIGN IS PRONE TO HEAD GASKET PROBLEMS, AS IT APPEARS TO BE IN SUBARUS, AND FAILURES HAPPEN WELL BEFORE 100,000 MILES, SUBARU SHOULD STAND BEHIND ITS DESIGN AND COMPENSATE OWNERS FOR THESE EXPENSIVE FAILURES.      OUR REPAIR COST NEARLY $4,000, WITH NO GUARANTEE THAT IT WON'T HAPPEN AGAIN.    WE BELIEVE SOA SHOULD ISSUE RECALL FOR A FAULTY ENGINE DESIGN, AND DEVELOP A HEAD GASKET THAT WILL STAND THE TEST OF TIME!  SOA CONTINUES TO BUILD THIS SAME ENGINE INTO ITS CURRENT MODELS, AND THE PURCHASERS OF THESE VEHICLES WILL EACH DISCOVER THE HEAD GASKET PROBLEM, WHEN WARRANTIES HAVE EXPIRED AND REQUIRE EXPENSIVE REPAIRS.  IF THESE PROBLEMS HAD LED TO CRASHES SOA BE FORCED TO ISSUE A RECALL.",
        "vin": "JF1SG63633G"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/23/2015",
        "dateOfIncident": "04/22/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10712386,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 SUBARU FORESTER. WHILE DRIVING APPROXIMATELY 35 MPH, THE ACCELERATOR PEDAL WAS DEPRESSED AND A GRINDING NOISE EMITTED OUTSIDE THE VEHICLE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC, WHO INFORMED THAT THE FRONT PASSENGER SIDE SUBFRAME COMPLETELY RUSTED. IN 2012, THE VEHICLE WAS REPAIRED UNDER NHTSA CAMPAIGN NUMBER: 11V464000 (SUSPENSION) AND A RUSTPROOF SOLUTION WAS APPLIED TO THE FRONT LOWER CONTROL ARMS. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED FOR THE MOST RECENT FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 120,000.",
        "vin": "JF1SG65663H"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/03/2015",
        "dateOfIncident": "12/01/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10691717,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "FIRST EVENT WAS IN DECEMBER 2014, LONG ISLAND, NY: AFTER DRIVING FOR ABOUT 3 MILES, STOPPED WITH CAR SHUT OFF FOR ABOUT 30 MINUTES, WHEN RESTARTING, THERE WAS A VERY STRONG FRESH/RAW GAS ODOR IN THE CAR.  SICKENING ODOR.  THIS HAPPENS SPORADICALLY.  THE LOCAL SUBARU DEALER DID A SMOKE TEST, SAID THEY FIXED IT BY TIGHTENING CLAMPS ON FUEL RAIL ON 2/11/15.  THE ODOR CONTINUES SPORADICALLY.  NOW, MARCH 3, 2015, THEY WANT TO REPLACE HOSES ON FUEL RAILS.  MILEAGE IS JUST OVER 92,200.  *TR",
        "vin": "JF1SG636X3H"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/22/2015",
        "dateOfIncident": "12/01/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10689801,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ON WINTER DAYS, WHERE TEMPERATURES ARE NOT UNUSUALLY LOW FOR A NORTHERN STATE, THE FUEL LINES ON THE FORESTER WILL SHRINK AND CONTRACT. THE RESULT IS THAT FUEL WILL LEAK OUT OF THE LINE RESULTING IN TWO THINGS, FUEL VAPORS IN THE CABIN AND FUEL PUDDLING ON THE ENGINE. FUEL PUDDLING ON THE ENGINE REPRESENTS ON OBVIOUS SAFETY HAZARD IN THE EVENT OF A FIRE. THE HEAVY FUEL VAPORS AND ODOR IN THE CABIN CAUSED ME TO BECOME NAUSEOUS AND LIGHT HEADED. IN ORDER TO DRIVE HOME SAFELY, THE WINDOWS HAD TO BE OPENED ALMOST COMPLETELY. LUCKILY THEY WERE NOT FROZEN UP, WHICH IS ALSO COMMON IN WINTER MONTHS. THERE HAVE ALSO BEEN SEVERAL DAYS WHERE WIND CHILL ALONE COULD RESULT IN FROST BITE IN ONLY A FEW MINUTES. I COULD NOT HAVE ROLLED DOWN MY WINDOWS SAFELY ON THOSE DAYS OR IN SIMILAR TEMPS BECAUSE OF THE ADDED VEHICLE SPEED. SOA IS AWARE THAT THIS IS A PROBLEM, BUT REFUSES TO CORRECT THE ISSUE OR ADMIT THAT IT APPLIES TO MOST OF ITS MODELS. THE PROBLEM EVEN CONTINUES ON LATER MODELS.    THIS IS A WELL KNOWN ISSUE, SEE THIS THREAD THAT SPANS SEVERAL YEARS (CONTINUING TODAY): HTTP://WWW.SUBARUFORESTER.ORG/VBULLETIN/F87/SMELL-GAS-COLD-STARTS-41319/    THE LINES AND PROBLEM ARE ALMOST IDENTICAL TO THE IMPREZA ISSUE, WHICH RESULTED IN SUBARU SERVICE BULLETIN NUMBER 09-36-03.  *TR",
        "vin": "JF1SG65643H"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/16/2015",
        "dateOfIncident": "01/01/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10683580,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "VERY STRONG GAS SMELL IN VEHICLE CABIN DURING COLD WEATHER.  *TR",
        "vin": "JF1SG656X3H"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/09/2015",
        "dateOfIncident": "12/08/2011",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10682078,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 SUBARU FORESTER. THE CONTACT STATED THAT THE VEHICLE WAS TAKEN TO THE DEALER FOR NHTSA CAMPAIGN NUMBER: 11V464000 (SUSPENSION). THE CONTACT STATED THAT THE DEALER COATED THE CONTROL ARMS, BUT THE CONTROL ARMS WERE RUSTED THROUGH. THE DEALER STATED THAT THE CONTROL ARMS NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 92,000.",
        "vin": "JF1SG63623H"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/08/2015",
        "dateOfIncident": "02/08/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10682025,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "BAD RAW FUEL ODOR IN CABIN IN COLD WEATHER, HAS BEEN HAPPENING FOR WEEKS.  WENT ONLINE, FOUND TONS OF SIMILAR COMPLAINTS, SUBARU OF AMERICA HAS NOT ISSUED A RECALL FOR THE 2003 FORESTER, EVEN THOUGH THIS IS A VERY COMMON AND DANGEROUS SAFETY PROBLEM.  *JS",
        "vin": "JF1SG65613H"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/16/2015",
        "dateOfIncident": "08/04/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10672937,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 - SUBARU - FORESTER - BODY HARDWARE, FENDER, STRUCTURAL COMPONENTS & RAILS, LOWER FRAME LEFT IS COMPLETELY ROTTED THROUGH.  THERE WAS A RECALL ON THE SUPPORT STRUT BESIDE IT BUT NONE ON THIS.  THIS IS A MAJOR CRASH PROTECTION COMPONENT AS IT CONNECTS THE BUMPER TO THE FRAME.  I TALKED TO THE DEALER ABOUT IT AND THEY SAID THERE IS NO RECALL SO IT IS MY PROBLEM.  CLEARLY THE STEEL THAT WAS USED WAS SUBJECT TO EXCESSIVE CORROSION IN SALTY/HUMID ROAD CONDITIONS AND SHOULD HAVE BEEN INCLUDED AS PART OF THE ORIGINAL RECALL ON THE STRUT.  THE OTHER SIDE (RIGHT) IS IN GOOD CONDITION, INDICATING DEFECTIVE MATERIALS IN THIS PART.     *TR",
        "vin": "JF1SG63663H"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/09/2015",
        "dateOfIncident": "01/08/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10671351,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "IN VERY COLD TEMPERATURES THE INTERIOR OF MY VEHICLE IS OVERCOME WITH FUEL FUMES.  IT HAPPENS AT IDLE AND LOW SPEEDS, DOES GO AWAY ONCE WE ARE DRIVING FOR A FEW MINUTES OVER 30 MPH.  IT IS SO BAD WE HAD TO DRIVE WITH WINDOWS OPEN IN 5 DEGREE WEATHER.  DEFINITELY COMING IN THROUGH THE HEAT VENTS, HOWEVER, SHUTTING THE HEAT OFF DID NOT ELIMINATE THE PROBLEM.  THIS IS MY FIRST WINTER WITH THE CAR AND DIDN'T HAVE THIS HAPPEN UNTIL THE LAST FEW DAYS, WHEN THE TEMPS HAVE BEEN CONSISTENTLY BELOW 30 DEGREES F. I'VE READ NUMEROUS OTHER COMPLAINTS OF THIS, NOT SURE WHY THERE IS NO RECALL/SERVICE BULLETIN BUT WOULD LIKE TO KNOW THE SOLUTION TO THE ISSUE.  IT CAN'T BE SAFE TO BREATHE THESE FUMES!  WOULD LIKE TO KNOW THE SOLUTION TO THIS PROBLEM, AS WE OTHERWISE LOVE THIS VEHICLE!  *TR",
        "vin": "JF1SG63673G"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/09/2015",
        "dateOfIncident": "01/09/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10671386,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TWO FRONT SUB FRAMES HAVE TO BE REPLACED DUE TO RUST AND THIN METAL.  *TR",
        "vin": "JF1SH65673H"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/08/2015",
        "dateOfIncident": "01/06/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10670993,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN TEMPERATURE DROPS TO LOW DOUBLE DIGITS (TEENS OR BELOW) THE CAB OF THE CAR BEGINS TO SMELL OF GASOLINE.  I HAVE HAD IT INSPECTED BY A MECHANIC AND THEY CANNOT FIND A LEAK ANYWHERE IN THE FUEL LINE.  IT GOES AWAY WHEN THE TEMPERATURE MOVES BACK TO WARMER TEMPERATURES.  *TR",
        "vin": "JF1SG636X3H"
    },
    {
        "components": "STRUCTURE,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/05/2015",
        "dateOfIncident": "01/01/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10670261,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SON WAS DRIVING FROM NEW JERSEY.  SUDDENLY THE FRONT HOOD OPENED AND CRASHED INTO THE WINDSHIELD.  HE WAS ABLE TO MOVE OVER THREE LANES TO STOP THE CAR.  THE WINDSHIELD WAS CRACKED.  THIS WAS A HOOD REPLACEMENT DONE LAST SPRING AFTER A DEER RAN ACROSS THE VEHICLE.  THE LATCH HAS NOT BEEN A PROBLEM UNTIL THIS TRIP.  ON THE WAY TO NEW JERSEY, MY SON NOTICED THAT THE HOOD PARTIALLY OPENED.  HE STOPPED THE CAR AND MADE SURE THAT THE HOOD WAS TIGHTLY SHUT.  THE SAME REPAIR SHOP IS INSTALLING ANOTHER HOOD AND REPLACING THE WINDSHIELD.  THERE IS NO COLLISION INSURANCE ON THE VEHICLE (SUBARU FORESTER 2003).  MY TWO GRANDSONS WERE PASSENGERS IN THE BACK SEAT.  MY SON'S FIANCEE WAS A PASSENGER IN THE FRONT SEAT.  THE ONLY CRASH WAS THE  BREAKING OF THE WINDSHIELD FROM THE HOOD.    *TR",
        "vin": "JF1SG65653H"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/30/2014",
        "dateOfIncident": "12/30/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10669202,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "A RUBBER HOSE CONNECTING TWO METAL GAS LINES HAS STARTED TO LEAK. THIS IS DUE TO THE COLD WEATHER. SUBARU ISSUED A RECALL FOR THIS ON THE WRX MODELS OF THE SAME YEAR. THIS ENGINE IS THE SAME ENGINE AS IN THE WRX. IT IS THE 2.5 N/A. WHY ARE OUR MOTORS NOT BEING FIXED AS WELL? THIS IS A MAJOR FIRE HAZARD. IT IS NEAR THE IGNITION SYSTEM AND ABOVE THE EXHAUST PIPE.    *JS",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/02/2014",
        "dateOfIncident": "11/10/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10661503,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "VERY STRONG FUEL SMELL WHEN COLD WEATHER.  *JS",
        "vin": "JF1SG63673H"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/19/2014",
        "dateOfIncident": "11/19/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10659175,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "IN FREEZING WEATHER A VERY STRONG SMELL OF GASOLINE FILLS THE CAR. I HAVE YOUNG CHILDREN THAT RIDE IN THIS VEHICLE AND IT'S A HEALTH AND SAFETY HAZARD.   *TR",
        "vin": "JF1SG656X3H"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/14/2014",
        "dateOfIncident": "11/11/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10655002,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN TEMPERATURE IS LESS THAN 32, THE INSIDE OF THE CAR SMELLS LIKE GAS.  IT GETS WORSE WHEN THE HEAT IS TURNED ON.  FUMES ARE OVERWHELMING.    *TR",
        "vin": "JF1SG63623H"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/12/2014",
        "dateOfIncident": "11/12/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10654595,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "COLD WEATHER FUEL LINE LEAK.  *TR",
        "vin": "JF1SG65693H"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/30/2014",
        "dateOfIncident": "09/27/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10640252,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE DRIVING ON THE INTERSTATE TRAVELING ABOUT 70 MPH WHEN MY HUSBAND NOTICED THE BACK WINDOW HAD A GREASY FILM THAT THE WIPER ONLY MADE WORSE.  WE PULLED OFF THE HIGHWAY TO A GAS STATION TO TAKE A LOOK AND  NOTICED SMOKE BILLOWING FROM THE HOOD.  AFTER WAITING A FEW MINUTES HE RAISED THE HOOD TO MORE SMOKE.  HAVING JUST HAD AN OIL CHANGE TWO DAYS PRIOR, I RECALLED THAT THE SERVICE PERSON MENTIONED SLIGHT TRANSMISSION AND OIL LEAKS THAT WERE NOT MAJOR CONCERNS AND THE CAR WAS SAFE TO DRIVE AND COULD BE ADDRESSED LATER.  TURNS OUT THERE WAS A HOLE IN THE PIPING DIRECTLY UNDERNEATH THE BATTERY, WHICH WAS CAUSED BY BATTERY ACID DRIPPING DIRECTLY ONTO THE METAL PIPING CAUSING THE AUTOMATIC TRANSMISSION FLUID TO LEAK OUT.   AFTER REMOVING THE BOLTS FROM THE PLASTIC APRON UNDERNEATH THE CAR TO TAKE A BETTER LOOK, IT APPEARED TRANSMISSION FLUID HAD BEEN LEAKING FOR A WHILE.  AFTER POURING SEVERAL QUARTS OF TRANSMISSION FLUID INTO THE CAR WE WERE ABLE TO SLOWLY DRIVE IT TO THE NEAREST SERVICE GARAGE (ABOUT 5 MILES), WHERE WE GOT A DIAGNOSTIC DONE.  APPARENTLY THIS PROBLEM IS NOT A NEW ONE TO SUBARU AS A SERVICE BULLETIN WAS RELEASED FOR THIS PARTICULAR ISSUE (THOUGH THEY STATED IT COULD BE FROM CORROSION DUE TO ROAD SALT OR SALT WATER, NOT BATTERY ACID).  A REPLACEMENT AT OIL COOLER PIPING KIT AND FOAM PACKING MUST BE INSTALLED TO PREVENT CORROSION DAMAGE.  THE BATTERY PLACEMENT DIRECTLY OVER THE PIPING IS WHAT CONTRIBUTED TO THE HOLE IN THE PIPING, CAUSING A DANGEROUS SITUATION THAT COULD HAVE LED TO A FIRE UNDERNEATH THE CAR.  APPARENTLY SUBARU HAS REDESIGNED THE LOCATION OF THE BATTERY IN RELATION TO THE AT FLUID PIPING IN THEIR LATER MODEL CARS SO IT WAS A CONCERNING ISSUE THAT WARRANTED THIS CHANGE.  THE GARAGE MANAGER FELT IT SHOULD HAVE BEEN A RECALL ISSUE AS IT COULD HAVE LED TO THE VEHICLE CATCHING FIRE.  *TR",
        "vin": "JF1SG63663H"
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/11/2014",
        "dateOfIncident": "09/05/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10632518,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON CHANGING THE OIL IN MY 2003 SUBARU FORESTER I NOTICED THAT MY SUB FRAME IS TOTALLY ROTTED OUT. I DON'T KNOW HOW MY CAR HAS EVEN STAYED TOGETHER ITS SO BAD. I LOOKED THE PROBLEM UP ONLINE AND I FOUND THAT IT IS A MAJOR ISSUE WITH SUBARU CARS. I CALLED SUBARU TO SEE IF THEY COULD HELP TO GET IT FIXED AND THEY SAID ITS A COSMETIC ISSUE AND THEY WILL NOT HELP ME. BUT THEY DID SAY THEY WILL OFFER ME $500 TOWARDS THE PURCHASE OF A NEW SUBARU. I ASKED IF THEY WILL APPLY THE $500 TO FIXING MY CURRENT SUBARU AND HE TOLD ME NO. I AM A SINGLE MOTHER THAT DEPENDS ON MY CAR 100% AND I CAN'T AFFORD THE REPAIR IN THE FIRST PLACE, BUT SUBARU WILL GIVE ME $500 TOWARD THE PURCHASE OF A NEW CAR.  *TR",
        "vin": "JF1SG63643H"
    },
    {
        "components": "STEERING,SUSPENSION,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/31/2014",
        "dateOfIncident": "06/11/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10617956,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING AT 55 MPH WHEN MY RIGHT FRONT CONTROL ARM SNAPPED. I LOOKED TO ENSURE NO VEHICLES WERE COMING, AND MADE THE DECISION TO TURN LEFT TO GET BACK ON THE ROAD WITH ALL FOUR TIRES AS I COULD ONLY TURN LEFT. I COULD NOT CONTROL THE VEHICLE,  AND THE VEHICLE TURNED SIDE WAYS AND THEN ROLLED THREE CONSECUTIVE TIMES LANDING ON ITS WHEELS FACING  SOUTH. I WAS TRANSPORTED TO THE HOSPITAL . ON THE WAY TO THE HOSPITAL IN THE AMBULANCE THE DRIVER HAD TO STOP, BECAUSE I WAS THROWING UP CONVULSIVELY WHILE BEING STRAPPED TO A BACKBOARD AND I THOUGHT I WAS GOING TO DIE OF NOT BEING ABLE TO BREATH DUE TO MY AIRWAY BEING FILLED WITH VOMIT. I SUSTAINED THE FOLLOWING INJURIES: 2 FORMS OF VERTIGO WHICH I STILL HAVE, A SHOULDER INJURY WHICH I WAS IN A SLING FOR SIX WEEKS, SEVERE MUSCLE INJURIES IN MY BACK AND NECK, I NOW HAVE SEVERE MUSCLE SPASMS AND CRAMPS THROUGHOUT MY WHOLE BODY, LOSS OF MEMORY, AND SEVERE CONTUSIONS THROUGHOUT MY WHOLE BODY, AND ALSO A RIGHT LEG INJURY WHICH AFFECTS MY WALKING CAPABILITY, PTSD AND SEVERE FLASHBACKS OF MY ACCIDENT WITH ME ROLLING OVER AND OVER AGAIN, BECAUSE I WAS CONSCIOUS THROUGH THE WHOLE ACCIDENT. THERE WAS AN OPEN RECALL ON THE LOWER CONTROL ARMS ON  MY VEHICLE WHICH WAS NEVER REPAIRED. THE SUBURU RECALL CAMPAIGN # IS WVX-34, AND THE NHTSA CAMPAIGN NUMBER IS 11V-464.   THE NECESSARY REPAIRS WERE NEVER PERFORMED.  THE AIRBAG NHTSA COMPLAINT NUMBER I FILED FOR THE AIRBAGS NOT DEPLOYING IS 10598597. THERE WERE 22 OTHER REPORTS TO THE NHTSA REGARDING THE AIRBAGS NOT DEPLOYING DUE TO THE  WIRING HARNESS ATTACHED TO THE DRIVERS SEAT BEING NOT LONG ENOUGH, THERE ARE SEVERAL COMPLAINTS TO THE NHTSA. THE FEDERAL TRADE COMMISSION IS IN THE PROCESS OF INVESTIGATING MY ACCIDENT ALSO. THE FEDERAL TRADE COMMISSION REFERENCE NUMBER IS [XXX].    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR...UPDATED 08/12/15 *BF",
        "vin": "JF1SG63623H"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "06/16/2014",
        "dateOfIncident": "05/24/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10598199,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "SUBMISSION FROM CONSTITUENT RE DEFECTIVE CROSSBAR.  *SMD  THE CONSUMER STATED HE HAD TO REPLACE, THE  LUGGAGE RACK, BECAUSE THE CROSSBAR WAS BENT AND BOWED. THE FIRST TIME, HE USED THE CROSSBAR WAS MAY 24, 2014. THE PLASTIC CLAMP THAT HELD THE LUGGAGE RACK TO THE TOP OF THE VEHICLE BROKE OFF WHILE DRIVING, WHICH CAUSED THE LOAD HE WAS CARRYING TO FALL OFF ON THE INTERSTATE. FORTUNATELY, THE WIND BLEW EVERYTHING TOWARD THE EMERGENCY SHOULDER. THE VEHICLE, LUGGAGE RACK CROSSBARS AND OTHER PERSONAL BELONGINGS WERE SEVERELY DAMAGED. *JB",
        "vin": "JF1SG63633H"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/16/2014",
        "dateOfIncident": "06/11/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10598597,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 SUBARU FORESTER. THE CONTACT STATED WHILE DRIVING APPROXIMATELY 55 MPH AND ATTEMPTING TO AVOID HITTING AN ANIMAL HE LOST CONTROL OF THE VEHICLE AND IT ROLLED OVER THREE TIMES AND CRASHED. THE AIR BAGS FAILED TO DEPLOY. A POLICE REPORT WAS FILED. THE VEHICLE WAS DESTROYED. THE CONTACT WAS TRANSPORTED TO A HOSPITAL. THE DETAILS OF THE INJURIES WERE UNKNOWN. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE AND CURRENT MILEAGE WERE 126.000.",
        "vin": "JF1SG63623H"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/28/2014",
        "dateOfIncident": "05/13/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10594571,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT CRADLE ARMS AND REAR CROSS MEMBERS ARE RUSTED TO THE POINT WHERE THE VEHICLE IS UNSAFE TO DRIVE DUE TO POSSIBLE SNAPPING.   *TR",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/11/2014",
        "dateOfIncident": "07/02/2012",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10587646,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS DRIVING THE CHECK ENGINE LIGHT CAME ON FOR THE FIRST TIME - IT IS NOW ON CONTINUOUSLY DUE TO FUEL CAP. I PULLED OVER AT A SERVICE STATION ONLY TO REALIZE MY OIL WAS NEXT TO EMPTY. I PROMPTLY FILLED AND CONTINUED THE FINAL HALF HOUR TO MY DESTINATION. UPON ARRIVAL I INSPECTED THE ENGINE FROM UNDER THE HOOD & BELOW THE CAR. IT WAS AT THIS TIME I NOTICED BUILD UP AND FLUID AROUND BOTH HEAD GASKETS. INITIALLY THERE WAS OIL RESIDUE ONLY, NOW, 18 MONTHS LATER I HAVE COOLANT AND OIL LEAKAGE & CANNOT AFFORD TO SPEND THE $1800 I HAVE BEEN QUOTED TO REPLACE THE HEAD GASKETS. VERY DISAPPOINTED IN SUBARU FOR NOT HANDLING THIS IN A BETTER WAY. MY BROTHER HAS THE SAME CAR (YEAR MAKE & MODEL) AND HAS SIMILAR ISSUES AT FEWER MILES. MY PARENTS HAVE A 2008 OUTBACK AND HAD THEIR HEAD GASKETS FAIL AT 54,000 MILES. UNACCEPTABLE. I ENJOY EVERYTHING ABOUT MY SUBARU EXCEPT FOR THE EXCESSIVE AMOUNT IT WILL COST TO FIX SUCH A COMMON DESIGN FLAW.  *TR",
        "vin": "JF1SG65663H"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/15/2014",
        "dateOfIncident": "02/10/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10564526,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 FORESTER 2.5XS IN ALBERTA, CANADA (OWNED SINCE DEC 2004). SAME ISSUE AT 221,000 KILOMETERS: WE HAVE BEEN NOTICING VERY STRONG FUEL SMELL FOR SEVERAL MONTHS NOW (WHEN IT'S COLD OUTSIDE). THE CAR IS CURRENTLY AT THE DEALERSHIP FOR REPAIRS. AS A LOT OF OWNERS NOTED HERE AND ON OTHER NUMEROUS WEB SITES, THE PROBLEM IS WIDESPREAD NOW. OTHERWISE, IT'S BEEN THE BEST CAR WE'VE HAD AND WE STILL LOVE IT. HOPEFULLY SUBARU WILL NOTICE THESE NUMEROUS COMPLAINTS AND WILL STAY BEHIND ITS REPUTATION.",
        "vin": "JF1SG65623H"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/10/2014",
        "dateOfIncident": "01/13/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10563722,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "RECENTLY NOTICED A STRONG SMELL OF PURE GASOLINE WHEN IT IS COLD OUTSIDE.  THE SMELL ISN'T SO BAD UNTIL YOU TURN ON THE HEATING SYSTEM.  NOT LONG AFTER, YOU HAVE TO DRIVE WITH THE WINDOWS DOWN IN ORDER TO BREATH FRESH AIR.  *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/08/2014",
        "dateOfIncident": "02/02/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10563471,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTICED THE SAME PROBLEM LAST YEAR ALSO AT ABOUT 134000 MILES.  WHEN THE OUTSIDE TEMPERATURE DROPS BELOW 20 DEGREES WOULD BE MY BEST GUESS, THE WHOLE CAB OF THE CAR FILLS WITH GASOLINE FUMES.  PRETTY POWERFUL SMELL.  I NOTICE ONLINE IN MANY, MANY PLACES THAT SUBARU IS HAVING THIS ISSUE.  THEY ARE ONLY FIXING WRX MODELS UNDER A RECALL.  THAT IS MY UNDERSTANDING.  UNFORTUNATELY, I DO NOT HAVE A WRX.    I WILL PAY TO HAVE THIS FIXED, THOUGH SUBARU SHOULD STEP UP TO ALL MODELS WITH THIS VERY DETRIMENTAL ISSUE.  THE DEALER IS ACTING A LITTLE SUSPICIOUS DENYING THEY KNOW ABOUT THE PROBLEM.  SEEMS LIKE THEY SHOULD KNOW ABOUT ALL ISSUES THAT ARE SO PROMINENT ON THE INTERNET.    MOST ARTICLES POINT TO FUEL LINES AT INTAKE MANIFOLD ARE FAILING.  FAILING WOULD DEMAND TSB.  *TR",
        "vin": "JF1SG65613H"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/07/2014",
        "dateOfIncident": "02/06/2012",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10563334,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING COLD WEATHER, (LATEST INCIDENT OCCURRED AT 15 DEGREES F), THERE IS A STRONG FUEL ODOR INSIDE THE VEHICLE WHILE THE VEHICLE IS RUNNING COMING FROM THE AIR VENTS INSIDE THE VEHICLE. AFTER STOPPING THE VEHICLE INSIDE OUR GARAGE THE STRONG FUEL ODOR CONTINUES UNTIL GRADUALLY LESSENING. A VISUAL INSPECTION DOES NOT REVEAL AN OBVIOUS FUEL LEAK.   OTHER SUBARU MODELS WERE RECALLED FOR A SIMILAR PROBLEM AND AN ONLINE SEARCH SUGGESTS THIS IS NOT AN ISOLATED EVENT TO MY PARTICULAR VEHICLE.  *TR",
        "vin": "JF1SG65663H"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "02/05/2014",
        "dateOfIncident": "10/24/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10562998,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "FIRESTONE",
                "productModel": "FR380",
                "productYear": "9999",
                "size": "P215/60R16",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 SUBARU FORESTER EQUIPPED WITH FIRESTONE TIRE FR380, SIZE P215-60-R16. THE CONTACT STATED THAT THE TIRES BECAME PREMATURELY WORN, OUT-OF-ROUND AND EXHIBITED TREAD AND BELT SEPARATION. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE TIRES WERE REPLACED. THE FAILURE MILEAGE OF THE TIRES WAS 53,000 AND THE VEHICLE FAILURE MILEAGE WAS 160,000.",
        "vin": "JF1SG65673H"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/30/2014",
        "dateOfIncident": "01/03/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10562159,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE OUTSIDE TEMP DROPS BELOW 15 DEGREES FAHRENHEIT THERE IS A STRONG SMELL OF GASOLINE IN THE PASSENGER COMPARTMENT UNTIL THE ENGINE WARMS UP. TURNS OUT ITS FROM LEAKING FUEL LINES UNDER THE HOOD. THIS IS A KNOWN COMMON PROBLEM BY SUBARU WITH SEVERAL OF THERE CARS.  *TR",
        "vin": "JF1SG65683H"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/30/2014",
        "dateOfIncident": "01/13/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10562186,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "VERY STRONG ODOR OF GASOLINE IN THE CABIN RIGHT AFTER STARTUP AND THROUGHOUT SHORT TRIPS, ESPECIALLY WITH HEATER ON. SEEMS TO HAPPEN MOST OFTEN WHEN OUTSIDE TEMPERATURES ARE NEAR OR BELOW THE FREEZING MARK. DID NOT EXPERIENCE BEFORE THIS WINTER, NOW OCCURS DAILY. PLEASE INVESTIGATE THIS PROBLEM BEFORE SOMEONE GETS HURT OR KILLED! IF SUBARU KNOWS THAT THERE IS A SAFETY PROBLEM WITH THE FUEL SYSTEM, OWNERS SHOULD NOT HAVE TO PAY FOR REPAIRS.   *TR",
        "vin": "JF1SG65623H"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/29/2014",
        "dateOfIncident": "01/24/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10562074,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "STRONG SMELL OF GASOLINE UNDER HOOD WHEN STARTING CAR COLD. AUTO REPAIR CENTER FOUND LEAKING FUEL LINE. TIGHTENED CLAMPS. THEN THE FOLLOWING WINTER, 1.24.14 AGAIN SMELLED RAW FUEL SMELL WHEN STARTED ENGINE COLD. AUTO REPAIR DID A PRESSURE TEST OF FUEL SYSTEM AND TRACED LEAKS TO FUEL RAIL ON TOP OF ENGINE/ LEFT CYLINDER HEAD INJECTOR RAIL. AUTO CENTER OWNER SAID HE HAD 7 SUBARU OWNERS WITH THE SAME ISSUE IN THE LAST FEW DAYS WITH THE EXTREME COLD TEMPERATURES.  *TR",
        "vin": "JF1SG65603G"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/28/2014",
        "dateOfIncident": "01/21/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10561792,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I START MY 2003 SUBARU FORESTER IN VERY COLD WEATHER THERE IS A STRONG FUEL SMELL IN THE CABIN OF THE CAR COMING THROUGH THE VENTS. I KNOW THAT NHTSA ISSUED A TSB ON 2002-2004 SUBARU WXT MODELS  BUT DID NOT INCLUDE THE FORESTER, OUTBACK, AND LEGACY OF THOSE YEARS, WHY? IT IS THE SAME FUEL PROPULSION LAYOUT AND THE RUBBER HOSE CONNECTION AT THE STEEL LINE IS WHERE THE LEAK HAPPENS IN COLD WEATHER. I HAVE HAD THIS PROBLEM SERVICED 4 OF THE 5 PAST YEARS AND HAD INJECTORS REPLACED WHEN NOW I KNOW IT IS ACTUALLY THE RUBBER HOSE SHRINKS BACK IN COLD WEATHER THUS THE GAS DRIPS AND POOLS ON THE MANIFOLD. THE WHOLE FUEL LINE SYSTEM NEEDS TO BE REPLACED. I STRONGLY BELIEVE THAT YOU SHOULD HAVE A TSB FOR ALL 2002 - 2004 SUBARU MODELS THAT USE THE SAME FUEL PROPULSION LAYOUT AS THE 2002 - 2004 WXT DID.    IF YOU GOOGLE '2003 SUBARU FORESTER GAS SMELL' YOU WILL SEE HUNDREDS OF COMPLAINTS AND QUESTIONS ABOUT THIS ISSUE, I AND ALL THE OTHER OWNERS OF THESE 2002 ' 2004 MODEL SUBARU'S SHOULD NOT HAVE TO PAY CONTINUOUSLY FOR REPAIRS THAT WILL KEEP ON HAPPENING EVERY WINTER UNTIL THE LINES ARE REPLACED. WHEN WILL THE RECALL HAPPEN? ARE YOU GOING TO WAIT UNTIL A CHILD / FAMILY DIES FROM A CAR EXPLOSION OF AN UNKNOWING FAMILY DRIVING DOWN THE ROAD WHEN THE CAR CATCHES FIRE OR EXPLODES BECAUSE OF THIS PROBLEM? IF YOU LIVED IN A HOUSE WITH A GAS LEAK YOU WOULD GET IT FIXED RIGHT AWAY, WOULDN'T THIS BE THE SAME ABOUT YOUR CAR?    THIS NEEDS TO BE DONE A.S.A.P.  *TR",
        "vin": "JF1SG63673H"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/28/2014",
        "dateOfIncident": "01/20/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10561917,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS PAST WEEK, WITH THE TEMPERATURES HERE IN NEW JERSEY DIPPING INTO THE TEENS, I SMELLED THE DISTINCT ODOR OF GASOLINE IN MY 2003 SUBARU FORESTER IN MY DRIVEWAY BEFORE I HIT THE ROAD.  THE SMELL WAS SO STRONG, I HAD TO TURN BACK HOME AS MY CHILDREN WERE NOT FEELING WELL FROM THE SMELL. THIS HAD  HAPPENED BEFORE, BUT NEVER TO THIS DEGREE. I WENT TO THE SUBARU SERVICE DEPARTMENT AND WAS TOLD THAT THEY HAD RECEIVED MANY CALLS ABOUT THIS SAME ISSUE. HE INDICATED THAT THE COLD WEATHER CAUSED THE LINES TO CONTRACT AND ALLOWED GASOLINE TO LEAK ONTO THE ENGINE. HE SAID THAT THE AS THE WEATHER WARMED UP, THE LINES WOULD EXPAND AGAIN, THUS MINIMIZING THE PROBLEM. HOWEVER, HE SAID THAT THE ONLY WAY TO CORRECT THE PROBLEM WAS TO HAVE THE LINES CHANGED. WHEN I ASKED IF IT WAS A HAZARD TO CONTINUE DRIVING THE VEHICLE UNTIL I COULD HAVE THE LINES REPLACED, HE SUGGESTED THAT I LIMIT MY DRIVING SINCE GASOLINE DRIPPING ONTO A HOT ENGINE WAS DANGEROUS.  I ASKED IF THERE WAS A RECALL FOR THE LINES, AND HE STATED NO. SINCE THIS IS A DANGEROUS SITUATION AND NOT EVIDENT IN LATER MODELS OF SUBARU, I THINK THAT OTHER OWNERS SHOULD BE MADE AWARE.   *TR",
        "vin": "JF1SG65643H"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/25/2014",
        "dateOfIncident": "01/17/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10561439,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING VEHICLE IN EXTREMELY COLD WEATHER NOTICE STRONG FUEL SMELL COMING  IN CAR.  *TR",
        "vin": "JF1SG636X3H"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/22/2014",
        "dateOfIncident": "01/01/2012",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10561034,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED 2003 SUBARU FORESTER FROM DEALER IN MARCH OF 2011. DEALER REFUSED TO PROVIDE SERVICE RECORDS. STRONG RAW FUEL ODORS COMING INTO CABIN WHEN OUTSIDE TEMPERATURE IS BELOW 40 DEGREES. REMNANTS OF ODOR LAST SEVERAL DAYS AFTER WARMER TEMPERATURES RETURN. RECEIVED ESTIMATE FROM DEALER OF SEVERAL HUNDRED DOLLARS TO TEAR CAR APART TO FIND OBVIOUS FUEL LINE LEAK PLUS COST TO FIX LEAK (LABOR AND PARTS.)  THIS YEAR I HAVE NO OTHER CAR TO DRIVE AND MUST GET TO MY TWO JOBS. RESULT OF  20 TO 30 MILES A DAY IN THE COLD TO GET TO WORK IS EXTREME FATIGUE, PERSISTENT COUGH, NAUSEA AND SEVERE HEADACHE. PHYSICIAN HAS ORDERED LUNG CT AS XRAY SHOWS UNIDENTIFIABLE ABNORMALITY.   *TR",
        "vin": "JF1SG636X3H"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/21/2014",
        "dateOfIncident": "01/17/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10560750,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 SUBARU FORESTER. THE CONTACT STATED THAT THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC FOR UNRELATED REPAIRS WHEN THEY NOTICED THAT THE FRONT LOWER CONTROL ARM WAS FRACTURED. THE VEHICLE WAS PREVIOUSLY REPAIRED UNDER NHTSA CAMPAIGN ID NUMBER 11V464000 (SUSPENSION), HOWEVER THE REMEDY DID NOT CORRECT THE FAILURE. THE VEHICLE WAS CURRENTLY BEING REPAIRED BY THE DEALER. THE MANUFACTURER WAS NOTIFIED OF THE PROBLEM. THE APPROXIMATE FAILURE MILEAGE WAS 80,000. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/21/2014",
        "dateOfIncident": "11/07/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10560752,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 SUBARU FORESTER. THE CONTACT STATED THAT THERE WAS A STRONG GASOLINE ODOR INSIDE OF THE VEHICLE. THE VEHICLE WAS TAKEN TO THE DEALER FOR INSPECTION WHERE THEY STATED THAT THEY COULD NOT DETERMINE THE CAUSE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 170,000.",
        "vin": "JF1SG65653H"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/09/2014",
        "dateOfIncident": "02/13/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10559281,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "AT COLD TEMPERATURES, FUEL LEAKING SOMEWHERE FROM VEHICLE, CAUSING STRONG ODOR INSIDE AND OUT OF CABIN. CONCERNED THAT THIS AMOUNT OF FUEL COULD BE HAZARDOUS TO BREATHE AND/OR CAUSE RISK FOR FIRE. NEED MORE PROACTIVE RESPONSE FROM SUBARU ON THIS MATTER, AT THIS POINT 26 OF 115 COMPLAINTS FOR THIS MAKE/MODEL/YEAR ARE FOR THIS ISSUE.  *TR",
        "vin": "JF1SG65613H"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/08/2014",
        "dateOfIncident": "10/01/2012",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10559069,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE'S A NOXIOUS SMELL OF GASOLINE ENTERING THE CABIN DURING COLD WEATHER. IT DISSIPATES WHEN DRIVING, BUT COMES RIGHT BACK WHEN IDLE. THIS WENT AWAY DURING THE SUMMER, BUT HAS RETURNED FOR THE WINTER OF 2013/14.  *TR",
        "vin": "JF1SG656X3H"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/07/2014",
        "dateOfIncident": "01/06/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10558867,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN STARTING MY CAR IN VERY COLD TEMPERATURE THERE IS A VERY STRONG RAW GASOLINE SMELL IN THE CABIN. AFTER DRIVING THE CAR TO A DOCTOR'S APPOINTMENT MY HUSBAND CHECKED UNDER THE HOOD AND SAW SMOKE. IT IS CURRENTLY PARKED. THIS HAS HAPPENED FOR THREE DAYS IN OUR CURRENT COLD WEATHER.  *TR",
        "vin": "JF1SG65693H"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/07/2014",
        "dateOfIncident": "11/16/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10558933,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2003 FORESTER HAS RECENTLY BEEN EXPERIENCING EXTREMELY STRONG SMELLS OF FUEL WHEN DRIVING IN THE COLD WEATHER. INHALING FUEL VAPORS ARE VERY DANGEROUS, HERE ARE SIDE EFFECTS ASSOCIATED WITH INHALATION OF FUMES: INHALING GASOLINE FUMES BRINGS CONCENTRATED HYDROCARBONS INTO YOUR LUNGS AND BLOODSTREAM. SOME OF THE INGREDIENTS IN GASOLINE ARE EXTREMELY TOXIC AND ARE MUTAGENS. LIVER DAMAGE AND PERMANENT BRAIN DAMAGE ARE POSSIBILITIES.     THE SIDE EFFECTS CAUSED BY THE INHALATION OF GASOLINE CAN RANGE FROM CENTRAL NERVOUS SYSTEM (CNS) DEPRESSION, WHICH CAN INCLUDE: EYE AND THROAT IRRITATION, MILD OR PRONOUNCED DIZZINESS, HEADACHE, LACK OF APPETITE, DROWSINESS AND IN-COORDINATION. IN MORE SERIOUS CIRCUMSTANCES, IT CAN CAUSE UNCONSCIOUSNESS, PULMONARY EDEMA, AND DEATH.      SUBARU SHOULD ISSUE A RECALL AND ADDRESS THE ISSUE!!  *TR",
        "vin": "JF1SG65633H"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,STRUCTURE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/07/2014",
        "dateOfIncident": "11/10/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10558941,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 FORESTER HAS EXTREMELY STRONG AROMAS OF FUEL WHEN STARTING & DRIVING IN COLD WEATHER. FUEL VAPORS ARE VERY DANGEROUS, HERE ARE SIDE EFFECTS OF INHALATION: INHALING GASOLINE FUMES BRINGS CONCENTRATED HYDROCARBONS INTO YOUR LUNGS AND BLOODSTREAM. SOME OF THE INGREDIENTS IN GASOLINE ARE EXTREMELY TOXIC AND ARE MUTAGENS. LIVER DAMAGE AND PERMANENT BRAIN DAMAGE ARE POSSIBILITIES.   THE SIDE EFFECTS CAUSED BY THE INHALATION OF GASOLINE CAN RANGE FROM CENTRAL NERVOUS SYSTEM (CNS) DEPRESSION, WHICH CAN INCLUDE: EYE AND THROAT IRRITATION, MILD OR PRONOUNCED DIZZINESS, HEADACHE, LACK OF APPETITE, DROWSINESS AND IN-COORDINATION. IN MORE SERIOUS CIRCUMSTANCES, IT CAN CAUSE UNCONSCIOUSNESS, PULMONARY EDEMA, AND DEATH.  SUBARU SHOULD ISSUE A RECALL AND ADDRESS THE ISSUE, BECAUSE THEY INSTALLED A DEFECTIVE PRODUCT!   *TR",
        "vin": "JF1SG65633H"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/06/2014",
        "dateOfIncident": "01/02/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10558579,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "IN BELOW FREEZING COLD WEATHER MY 2003 SUBARU FORESTER SMELLS LIKE GASOLINE INSIDE THE CABIN.   *TR",
        "vin": "JF1SG636X3H"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/03/2014",
        "dateOfIncident": "12/02/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10558415,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE TEMPERATURE GOES BELOW FREEZING, THERE IS THE ODOR OF FUEL IN THE CABIN OF THE CAR.  *TR",
        "vin": "JF1SG6564H7"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/31/2013",
        "dateOfIncident": "12/30/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10558036,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD MY VEHICLE SERVICED AT RAMSEY SUBARU AND WAS TOLD THE FRONT SUB FRAME IS RUSTED AND NEEDS TO BE REPAIRED.  IT SEEMS MORE LIKE THE THIN CHEAP METAL IS THE PROBLEM.  THIS IS A BIG SAFETY PROBLEM AND THEY TOLD ME THE WARRANTY IS ONLY GOOD FOR 5 YEARS.  *TR",
        "vin": "JF1SG65673H"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/23/2013",
        "dateOfIncident": "12/23/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10557095,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE WEATHER IS BELOW 20 DEGREE THE FUEL LINES LEAK CAUSING THE CAB TO FULL WITH GASOLINE FUMES.  THIS SMELL CAUSES HEADACHES A NAUSEA FOR THE DRIVER AND PASSENGERS. THE SMELL BEGINS TO SUBSIDE AFTER THE FUEL LINES HAVE WARMED UP AND EXPANDED.   *TR",
        "vin": "JF1SG65693H"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/17/2013",
        "dateOfIncident": "12/17/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10556307,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 FORESTER HAS HEAVY  SMELLS OF FUEL WHEN STARTING IN COLD WEATHER ONLY.  THIS WAS PREVENT LAST WINTER AND HAS RETURNED THIS WINTER.  FUEL VAPORS ARE VERY DANGEROUS.      SUBARU SHOULD ISSUE A RECALL AND ADDRESS THE ISSUE.  *TR",
        "vin": "JF1SG63623H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/08/2013",
        "dateOfIncident": "12/07/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10555207,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIR BAG WARNING LIGHT ON MY SUBARU FORESTER IS ON YET AGAIN.  IT HAS DONE THIS SEVERAL TIMES.  IN READING ONLINE THERE ARE WIRED BROUGHT TOGETHER AT A CONNECTOR THAT WHEN BOTH ENDS ARE PUSHED TOGETHER THEN THE AIRBAG WARNING LIGHT WILL GO OUT.  JUST USING GOOGLE ONLINE TO SEARCH I HAVE COME ACROSS DOZENS OF COMPLAINTS.  AS THIS IS A VEHICLE SAFETY COMPONENT, SUBARU SHOULD REPAIR THIS AT NO COST.  WHY SUBARU COULD NOT HAVE IMPLEMENTED A MUCH MORE SECURE, RELIABLE CONNECTOR FOR SUCH A CRITICAL SAFETY SUBSYSTEM IS BAFFLING AS A MORE RELIABLE CONNECTOR SHOULD NOT COST BUT A COUPLE OF DOLLARS MORE.  SUBARU SHOULD BE REPAIRING THIS AT NO CHARGE TO VEHICLE OWNERS.  *TR",
        "vin": "JF1SG65633H"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/27/2013",
        "dateOfIncident": "11/25/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10553958,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON STARTING AND RUNNING THE VEHICLE IN TEMPERATURES BELOW FREEZING (32 DEGREES F), THE FUEL LINES NEAR THE INTAKE MANIFOLD IN THE ENGINE BAY LEAK GASOLINE, TRANSMITTING AN UNBURNT FUEL SMELL TO THE CABIN VIA THE HVAC SYSTEM AND BLOWER FAN. THESE FUMES ARE TOXIC AND THEREFORE HAZARDOUS TO MOTORIST AND PASSENGER HEALTH. ALSO, FUEL DRIPPING NEAR A HOT INTAKE MANIFOLD IS A FIRE HAZARD. THE LINES APPEAR CORRODED IN SPOTS AND THE FUEL LEAK IS VISIBLE AND APPARENT. THERE IS NO RECALL FOR THIS ISSUE. HOWEVER, BASED UPON THE INSPECTION, THE APPARENT FUEL LEAK IN SUCH CLOSE PROXIMITY TO THE HOT ENGINE IS A MAJOR HAZARD FOR THE MOTORIST OF THE FORESTER AND OTHER MOTORISTS ON THE ROAD - THIS ISSUE SHOULD BE RESOLVED AND SUBARU SHOULD ANNOUNCE A RECALL ON ALL (2003) FORESTER MODELS.  *TR",
        "vin": "JF1SG63633H"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/26/2013",
        "dateOfIncident": "11/22/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10553887,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS IS LEAKING IN THE ENGINE AS A RESULT OF COLD WEATHER. STRONG GAS SMELL. WHY DID SUBARU USE FUEL LINES THAT CONTRACT IN COLD WEATHER? THIS SHOULD BE THE SUBJECT OF A RECALL BY SUBARU.  *TR",
        "vin": "JF1SG63653H"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/24/2013",
        "dateOfIncident": "11/23/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10553602,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS IS LEAKING IN THE ENGINE AS A RESULT OF COLD WEATHER.  STRONG GAS SMELL.  WHY DID SUBARU USE FUEL LINES THAT CONTRACT IN COLD WEATHER?  THIS SHOULD BE THE SUBJECT OF A RECALL BY SUBARU. ONLINE RESEARCH CLEARLY DEMONSTRATES THAT HIS IS A WIDESPREAD PROBLEM.  *TR",
        "vin": "JF1SG65693G"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "09/20/2013",
        "dateOfIncident": "03/16/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 1,
        "numberOfInjuries": 1,
        "odiNumber": 10544615,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "(ALL) THE AIR BAGS FAILED. THE PASSENGER SIDE REAR, (FELL) OUT OF THE CARRIER. THE DRIVERS AUTO LOCK ON THE SEATBELT FAILED, THE REAR STORAGE COVER POPPED (OUT) OF ITS HOLDERS, FLEW TO THE FRONT (V'ED), HITTING HER IN THE RT TEMPLE, AS SHE (BOUNCED) BACKED AND FORTH HITTING THE DASH AND CENTER POST DRIVERS DOORS.   GEICO (GAVE) ME THE CAR INCASE SUBARU WANTED TO SEND AN INVESTOR. CALLED THEM AT THEIR CORP. #. THREATENED TO SUE ME IF I WENT PUBLIC. HAD TO HIRE A LAWYER IN FAIRBANK.    TWO RIVERS WOMAN KILLED IN COLLISION    PUBLISHED MARCH 17, 2005   BY    [XXX]  , STAFF WRITER A VEHICLE COLLISION CLAIMED A WOMAN'S LIFE NEAR 10 MILE CHENA HOT SPRINGS ROAD ABOUT 5 P.M. WEDNESDAY.   [XXX], OF TWO RIVERS DIED AFTER SHE LOST CONTROL OF HER SUBARU ON THE SLIPPERY ROAD, VEERED INTO THE ONCOMING LANE AND WAS STRUCK BY A COMMERCIAL VAN.   \"HER VEHICLE WAS SPINNING OUT OF CONTROL,\" SAID ALASKA STATE TROOPER [XXX].   [XXX], WHO WAS DRIVING EAST, STARTED FISHTAILING AND VEERED INTO THE WESTBOUND LANE.   THE VAN DRIVER, 51-YEAR-OLD [XXX], WAS DRIVING WEST.    [XXX] DIED FROM HEAD INJURIES. THE CRASH IS STILL UNDER INVESTIGATION.   [XXX]WITH HIS THREE GRANDDAUGHTERS WHEN THE ACCIDENT OCCURRED IN FRONT OF HIS HOUSE.   \"I JUST HEARD THIS GOD-AWFUL COMMOTION,\"[XXX] SAID. \"I HEARD IT, BUT I DIDN'T SEE IT.\"   HE USHERED THE THREE CHILDREN, WHO HAD BEEN SLEDDING ON A SNOW BERM, INTO THE HOUSE AND RAN OUT TO THE ROAD.      [XXX]  PINNED IN VEHICLE. NO PULSE, WASN'T BREATHING.   EMERGENCY RESPONDERS HAD TO PRY OFF THE SUBARU'S PASSENGER SIDE DOOR AND CUT THE SEAT BELT TO FREE.  THE COLLISION INFLATED THE VAN'S AIR BAGS AND[XXX] SUSTAINED ONLY MINOR INJURIES, OFFICIALS SAID.      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,AIR BAGS,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "09/03/2013",
        "dateOfIncident": "09/09/2011",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10537652,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2013 SUBARU.  CONSUMER WRITES IN REGARDS TO BRAKE PROBLEMS.  *SMD  THE CONSUMER STATED ALMOST FROM THE MOMENT, HE PURCHASED THE VEHICLE, HE AND HIS WIFE EXPERIENCED PROBLEMS WITH THE BRAKES. THE CONSUMER STATED ON TWO OCCASIONS, HIS WIFE EXPERIENCED A SLOW BRAKE RESPONSE. THE CONSUMER STATED THE FIRST TIME THE INCIDENT HAPPENED, HIS WIFE WAS DRIVING DOWNHILL AND WHEN SHE ATTEMPTED TO APPLY THE BRAKE, THE VEHICLE WOULD NOT STOP, WHICH RESULTED IN AN ACCIDENT. HIS WIFE SUFFERED A BACK INJURY. THE SECOND TIME THE INCIDENT HAPPENED, HIS WIFE WAS DRIVING AGAIN, AND THE BRAKES DID NOT RESPOND. CONSEQUENTLY, HIS WIFE HAD ANOTHER ACCIDENT. THE CONSUMER ALSO STATED THE AIR BAGS DID NOT DEPLOY IN EITHER ACCIDENT.  UPDATED 04/04/14*LJ",
        "vin": "JF1SG63663H"
    },
    {
        "components": "VISIBILITY,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/18/2013",
        "dateOfIncident": "07/16/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10525666,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR VIEW MIRROR (SELF-DIMMING WITH COMPASS) BECAME CLOUDY AND DISCOLORED.  UNABLE TO CLEARLY VIEW ACTIVITY BEHIND VEHICLE.  THIS IS, ACCORDING TO INTERNET RESEARCH, A COMMON DEFECT IN THE SUBARU REAR VIEW MIRRORS IN THE ERA OF (APPROXIMATELY) 2003-2008.  NO RECALL HAS BEEN RECEIVED.  AN E-MAIL TO SUBARU LAST EVENING EXPLAINING THIS PROBLEM WAS ANSWERED BY TELLING ME TO ORDER A NEW MIRROR FROM A LOCAL DEALER.  THEY NEED TO INVESTIGATE THE DEFECT AND PROVIDE NEW MIRRORS. IT'S AN IMPORTANT SAFETY ISSUE AND MUST BE CORRECTED BY SUBARU IMMEDIATELY.  *TR",
        "vin": "JF1SG65653H"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/12/2013",
        "dateOfIncident": "07/10/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10524573,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 SUBARU FORESTER. THE CONTACT STATED THAT THE VEHICLE WAS PLACED INTO PARK AND SUDDENLY ACCELERATED. THE CONTACT DEPRESSED THE BRAKES UNTIL HE WAS ABLE TO SHIFT INTO NEUTRAL AND STOP THE VEHICLE.  THE CONTACT TOOK THE VEHICLE TO THE DEALER HOWEVER, THE DEALER WAS UNABLE TO DETERMINE WHAT CAUSED THE FAILURE. THE VIN WAS NOT AVAILABLE. THE FAILURE AND THE CURRENT MILEAGES WERE 89,500.  *TR",
        "vin": ""
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/10/2013",
        "dateOfIncident": "03/04/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10502241,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE HAD TO REPLACE LEFT FRONT WHEEL BEARING FOUR TIMES IN THE LAST SIX MONTHS.  EACH TIME, IT WAS STATED BY THE MECHANIC TO BE A FAULTY WHEEL BEARING, BUT BECAUSE OF THE NUMBER OF INSTANCES, A QUESTION HAS BEEN RAISED OF POSSIBLE OTHER SOURCE.  *TR",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/28/2013",
        "dateOfIncident": "01/17/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10494888,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY 2003 SUBARU FORESTER AND NOTICED A STRONG ODOR OF GASOLINE COMING FROM MY VENTS, INCREASING WHEN I TUNED ON MY HEAT. AT FIRST I THOUGHT I WAS BEHIND A CAR USING  DIESEL FUEL.  THE TEMPERATURE OUTSIDE WAS 11 DEGREES F.  I BROUGHT MY CAR INTO THE SUBARU DEALER WHEN ON THE SECOND DAY IT INCREASED AND I HAD TO OPEN THE WINDOWS TO FOR VENTILATION AS THIS WAS MAKING  ME FEEL LIGHT HEADED AN ILL.  I WAS TOLD BY THE PERSON IN REPAIR THAT AN EMPLOYEE OF SUBARU HAD COME IN ALSO THAT DAY WITH THE SAME COMPLAINT. MY CAR WAS FOUND TO HAVE LEAKS IN THE GAS LINES. I WAS TOLD HIS HAPPENS IN COLD WEATHER.  SINCE SUBARU ADVERTISES THEIR VEHICLES AS THE COLD WEATHER VEHICLES I FIND THIS TOTALLY UNACCEPTABLE.  THIS IS A SAFETY HAZARD AND FEEL THEIR SHOULD BE A RECALL, SINCE THEY HAVE RECALLED SOME OF THEIR OTHER VEHICLES FOR THIS VERY SAME REASON.  THIS IS VERY FRIGHTENING TO SAY THE LEAST.  I WAS TOLD IT WILL COST 750.00 TO REPAIR.  I FEEL HIS IS A DEFECT AND MAJOR SAFETY HAZARD AND SHOUED BE A RECALL BEFORE SOMEONE GETS SERIOUSLY INJURED IF THEY HAVE NOT ALREADY.  *TR",
        "vin": "JF1SG63683H"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/25/2013",
        "dateOfIncident": "01/21/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10494764,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN WEATHER IS COLD, THERE IS A STRONG SMELL OF FUEL INSIDE THE CAR.  HAPPENS ON ANY MORNING WHEN TEMPERATURE IS BELOW FREEZING.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/24/2013",
        "dateOfIncident": "01/24/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10494578,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTED AND DROVE VEHICLE APPROX. 1 MILE IN 20 DEGREE WEATHER WHEN I BEGAN TO SMELL AN EXTREMELY STRONG RAW GASOLINE ODOR. THE PASSENGER COMPARTMENT WAS INUNDATED WITH THE ODOR. I CHECKED FOR LEAKS BUT DID NOT SEE ANY(IT WAS AT NIGHT). I SLOWLY DROVE HOME WITH MY PASSENGER-SIDE WINDOWS OPEN. HAVEN'T DRIVEN THE VEHICLE SINCE....  *TR",
        "vin": "JF1SG65653H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/04/2013",
        "dateOfIncident": "04/04/2012",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10491465,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 SUBARU FORESTER. THE CONTACT STATED THAT THE AIR BAG WARNING LIGHT ILLUMINATED ON THE INSTRUMENT PANEL. THE VEHICLE WAS TAKEN TO THE DEALER FOR INSPECTION WHERE THEY ADVISED THAT THE OCCUPANCY SENSORS NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED AND STATED THAT THE VEHICLE WAS NOT INCLUDED IN THE RECALL. THE FAILURE MILEAGE WAS 95,000.",
        "vin": "JF1SG65603H"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/10/2012",
        "dateOfIncident": "11/08/2010",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10487891,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 SUBARU FORESTER. THE CONTACT STATED THAT WHEN THE FUEL TANK WAS FULL, THE VEHICLE WOULD EMIT AN OVERPOWERING GASOLINE ODOR INTO THE INTERIOR CABIN. THE VAP VALVE WAS REPLACED BY A SERVICE CENTER BUT DID NOT CORRECT THE PROBLEM. THE CONTACT VERIFIED THAT THERE WAS NOT A FUEL LEAK PRESENT. THE VEHICLE WAS NOT FURTHER REPAIRED. THE FAILURE MILEAGE WAS 90,000 AND THE CURRENT MILEAGE WAS 113,000.   UPDATED 01/18/13*LJ UPDATED 1/25/2013 *JS",
        "vin": "JF1SG63693G"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/15/2012",
        "dateOfIncident": "08/15/2012",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10470754,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PARKING AT THE OFFICE, THE CAR SUDDENLY ACCELERATED. I WAS ABLE TO STOP IT BY BRAKING HARD. THERE WAS NO RUG OBSTRUCTING THE ACCELERATOR OR BRAKES. I WARE A SIZE 7 SHOE, THEREFORE THERE IS NO POSSIBILITY OF PRESSING BOTH PEDALS AT THE SAME TIME. IT WAS SCARY. *TR",
        "vin": "JF1SG65633H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/19/2012",
        "dateOfIncident": "05/01/2012",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10466580,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG LIGHT REMAINS ON. AFTER 3 ATTEMPTS TO REPAIR IN THE SHOP, STILL REMAINS ON. *TR",
        "vin": "JF1SG636X3H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/21/2012",
        "dateOfIncident": "06/21/2012",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10462559,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 SUBARU FORESTER.  PASSENGER SIDE AIRBAG LIGHT ON.  DEALER STATED  THAT AIRBAG ON PASSENGER SIDE HARNESS WIRES WERE CORRODED AND REQUIRED  HARNESS REPAIR.  SUBARU PARENT COMPANY SAID THERE IS ONLY A 30000 MILE WARRANTY ON THE AIRBAG WIRES....    THIS IS A DESIGN DEFECT AND SAFETY ISSUE.  SHOULD BE COVERED U DER 100,000  WARRANTY.  *TT",
        "vin": "JF1SG65623H"
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/18/2012",
        "dateOfIncident": "10/01/2011",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10462062,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 SUBARU FORESTER. THE CONTACT STATED THAT WHILE THE VEHICLE WAS BEING INSPECTED, IT WAS DISCOVERED THAT THE FRONT PASSENGER WHEEL ASSEMBLY WAS FOUND SEVERELY CORRODED. THE VEHICLE WAS REPAIRED. THE FRONT WHEEL ASSEMBLY WAS REPLACED. THE FAILURE MILEAGE WAS 180,000 AND THE CURRENT MILEAGE WAS 183,000.    UPDATED 7/9/12 *CN  THE RIGHT SIDE FRAME ASSEMBLY WAS RUSTED AND CORRODED. UPDATED 07/10/12",
        "vin": "JF1SG65643H"
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/06/2012",
        "dateOfIncident": "11/29/2011",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10454345,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 SUBARU FORESTER.THE CONTACT STATED THAT THE VEHICLE WAS REPAIRED UNDER NHTSA CAMPAIGN ID NUMBER: 11V464000 (SUSPENSION: FRONT: CONTROL ARM: LOWER ARM) WHEN THE CONTACT WAS ADVISED THAT THE FRONT END OF THE SUB-FRAME WAS CORRODED. THE MANUFACTURER ADVISED THE CONTACT THAT THE FAILURE WAS NOT COVERED UNDER THE RECALL. THE VEHICLE WAS NOT REPAIRED FOR THE FRAME ISSUE. THE FAILURE MILEAGE WAS 157,000 AND CURRENT MILEAGE WAS 160,000.  UPDATED 05/08/12*LJ",
        "vin": "JF1SG65623H"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/02/2012",
        "dateOfIncident": "03/28/2012",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10453867,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WE TOOK OUR 2003 SUBARU FORESTER IN TO THE DEALERSHIP FOR AN OIL CHANGE AND WAS TOLD THAT THE FRAME OF THE CAR WAS IN \"SERIOUS\" CONDITION AND NEEDED TO BE REPLACED.  A PHOTO WAS TAKEN AND SENT TO THE DISTRICT MANAGER FOR HIS REVIEW.      WE REPLACED THE CONTROL ARMS ON OUR OWN IN DECEMBER 2011.  TOOK THE CAR IN TO OUR DEALERSHIP IN JANUARY 2012 FOR RECALL OF CONTROL ARMS AND NOTHING WAS SAID ABOUT THE FRAME AT THAT TIME.      MECHANIC STATED YOU CAN PUT YOUR FINGER INTO THE HOLE IN THE FRAME OF THE CAR.  FORESTER WAS NEVER DRIVEN OFF-ROAD AND WAS DRIVEN SOLELY IN THE CITY.      THE FRAME SHOULD NOT HAVE RUSTED OUT THROUGH NORMAL WEAR AND TEAR.  WINTER THIS YEAR WAS VERY MILD.     PLEASE INVESTIGATE THIS AS FRAMES ON CARS SHOULD NOT DEVELOP HOLES.  *TR",
        "vin": "JF1SG65613H"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/02/2012",
        "dateOfIncident": "04/01/2006",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10450053,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 SUBARU FORESTER. THE CONTACT STATED THAT THE ENGINE EXHIBITED A LOUD, UNUSUAL NOISE WHEN THE VEHICLE WAS FIRST STARTED OR WHEN DRIVING. THE VEHICLE WAS TAKEN TO THE DEALER. THE DEALER INSPECTED THE ENGINE AND ADVISED THAT THE ENGINE MANUFACTURE WAS A FACTORY DEFECT AND WOULD NEED TO BE REPLACED. THE ENGINE WAS REPLACED BUT THE HEAD GASKET THEN BEGAN LEAKING. THE MANUFACTURER WAS MADE AWARE OF THE DEFECT AND DENIED ASSISTANCE WITH REPAIRS TO THE VEHICLE BECAUSE THE WARRANTY HAD EXPIRED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 26,279 AND THE CURRENT MILEAGE WAS 83,300.  UPDATED 04/05/12*LJ     UPDATED 06/13/2012   *JS",
        "vin": "JF1SG63603H"
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/01/2012",
        "dateOfIncident": "02/29/2012",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10449967,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 SUBARU FORESTER . THE CONTACT STATED THAT HE RECEIVED NOTIFICATION OF NHTSA CAMPAIGN ID NUMBER: 11V464000. (SUSPENSION: FRONT:CONTROL ARM:LOWER ARM) AND THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER FOR REPAIRS. THE DEALER ADVISED THE CONTACT THAT THE REPAIR COULD NOT BE PERFORMED BECAUSE THE SUB FRAME WAS RUSTED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND THE CURRENT MILEAGE WAS 69,000.   UPDATED 03/28/12*LJ  THE CONSUMER STATED AFTER CONTACTING SUBARU OF AMERICA, THEY AGREED TO COVER ALL COSTS ASSOCIATED WITH THE REPAIR, INCLUDING THE REPLACEMENT OF THE SUBFRAME. UPDATED 03/30/12*JB",
        "vin": "JF1SG65603H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/13/2011",
        "dateOfIncident": "05/29/2011",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10406111,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2003 SUBARU FORESTER AND HAVE HAD AN ONGOING PROBLEM WITH THE AIR BAG LIGHT COMING ON.  SOMETIMES IT COMES ON AND GOES OFF BY ITSELF.  MOST RECENTLY, IT WENT OFF AFTER I CHANGED THE PASSENGER SEAT POSITION.  I HAVE BEEN ADVISED THAT IT IS DUE TO THE AIRBAG SENSORS UNDER THE FRONT SEATS BEING JOSTLED OR DETACHED EITHER BY CHANGING SEAT POSITIONS OR SLIDING SOMETHING DOWN ALONGSIDE THE SEAT (LIKE A MAGAZINE OR NEWSPAPER.)  I'VE HAD THE SENSOR ON THE PASSENGER SIDE FIXED AT CONSIDERABLE COST TO ME.  IT'S ANNOYING AND CLEARLY A DESIGN PROBLEM THAT SHOULD BE REMEDIED BY THE DEALER AT NO CHARGE.  *TR",
        "vin": "JF1SG63603G"
    },
    {
        "components": "AIR BAGS,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "06/08/2011",
        "dateOfIncident": "06/01/2011",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10405578,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "64669AC260MU",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "AIR BAG LIGHT HAS BEEN  ON FOR ABOUT A MONTH. IT WENT OUT ONCE FOR A BIT BUT HAS BEEN ON SINCE. I HAD ONE SERVICE DEPT. SAY THE PROBLEM WAS IN THE PASSENGER SIDE AIR BAG SENSOR. THS SUBARU DEALERSHIP SAID IT WAS THE AIR BAG SENSORS UNDER FRONT SEATS.- CAUSED BY CHANGING THE POSITION OF THE SEATS FREQENTLY AND MADE THE WIRES BREAK. I HAVE 88.000 MILES ON MY CAR. I AM THE ONLY DRIVER SO I DO NOT CHANGE MY SEAT POSITION OFTEN. THERE WAS NOTHING NOTED AT TIME OF PURCHASE ABOUT LIMITING CHANGE OF SEAT POSITION. THIS IS ACTUALLY REDICULOS. THEY STATED  IT WOULD COST $370 TO FIX AND THEY HAD PACKET PARS AVAILABLE AND COULD EASILY  REPLACE THEM. THEY STATED THIS IS AN UNCOMMON PROBLEM - IF SO UNCOMMON PROBLEM WHY DID THEY HAVE TO COME UP WITH THESE REPLACEMENT PACKETS? I READ THEY REENGINEERED THIS PART FOR THE NEXT YEAR MODEL. I DID SOME CHECKING AND FOUND SERVERAL COMPLAINTS FROM OTHER OWNERS OF 2003 FORESTERS WITH THE SAME PROBLEM BUT NOT ENOUGHT COMPLAINTS TO FORCE A RECALL. .  IT IS A DEFINITE \"COMMON\" PROBLEM. IN THE END THE DEALERSHIP CHARGED ME $150 AND REPLACED ONLY ONE SENSOR WHICH RESOLVED THE PROBLEM. I'VE READ THAT SUCH \"SAFETY PARTS\" SHOULD BE REPLACED AT NO COST? IS THIS TRUE? THEN I THINK I AM OWED A REFUND I AM PRINTING OUT A FEW OF THE SAME COMPLAINTS AND ALSO THE STATEMENT THAT THIS REPAIR SHOULD COST NOTHING AS IT IS A SAFETY ISSUE. COULD YOU PLEASE ADVISE.  *TR",
        "vin": "JF1SG63633H"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/09/2011",
        "dateOfIncident": "03/09/2011",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10389662,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 SUBARU FORESTER ~114K MILES.  DURING PASSING (~70 MPH)ENGINE HAS STALLED 2X IN PAST WEEK.  AFTER COMING TO FULL STOP AND TURNING KEY IN IGNITION FULL \"OFF\", CAR RESTARTS WITH NO DIFFICULTY WILL TAKE TO DEALER THIS WEEK.  HAD BATTER INSTALLED ~ 2 MONTHS AGO.  *TR",
        "vin": "JF1SG65663G"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/03/2011",
        "dateOfIncident": "12/01/2006",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10386335,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 SUBARU FORESTER. THE CONTACT STATED THAT WHEN STARTING THE VEHICLE IN COLD WEATHER TEMPERATURES, THE VEHICLE WOULD EXHIBIT AN UNUSUALLY OVERPOWERING GASOLINE FUEL ODOR FROM THE INTERIOR. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER FOR DIAGNOSIS YET THEY WERE UNABLE TO DIAGNOSE THE FAILURE. THE VEHICLE WAS NOT UNDER RECALL AND WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 35,000.",
        "vin": "JF1SG65673H"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/17/2011",
        "dateOfIncident": "06/01/2010",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10383098,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WE'RE THE OWNERS OF A 2003 SUBARU FORESTER (ABOUT 90 000 MILES). FOR AT LEAST 6 MONTHS AFTER WE FILL THE GAS TANK, WE DETECT GAS FUMES NEAR THE REAR WHEELS - EXTERIOR ONLY. AS THE TANKS LEVEL GOES DOWN, THE SMELL WILL GO AWAY. WE ARE NOT OVER-FILLING; IN FACT WE WILL FILL BEFORE THE PUMP \"CLICKS OFF\". THERE IS NO DRIPPING OF GAS AND OUR MECHANIC HAS CHECKED FOR LEAKS/OVERFLOWS ETC AND HAS FOUND NOTHING. OBVIOUSLY SOMETHING IS WRONG AND WE ARE NOT THE ONLY OWNERS WHO HAVE COMPLAINED ABOUT THIS EXTERIOR SMELL (IT SEEMS TO HAVE BEEN VERY PREVALENT IN THE 2002 MODEL). THE DEALER HAS BEEN NO HELP. WE HOPE NHTSA CAN HELP US. THANKS.  *TR",
        "vin": "JF1SG63693G"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/24/2011",
        "dateOfIncident": "01/24/2011",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10378535,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PREVIOUS NIGHT WAS -17, I DIDN'T DRIVE THE CAR ALL DAY. AT 6:30 PM I DROVE THE CAR FOR 1/2HOUR, ALL WAS WELL. 2 HOURS LATER (-3 DEGREES) I GOT IN THE CAR AND DROVE 15 MIN AT WHICH TIME I CAME TO A STOP SIGN AND TURNED RIGHT ONTO ANOTHER ROAD AND THE SMELL OF GAS INSIDE THE CAR BEGAN. I LOOKED UP THE  SYMPTOMS ONLINE AND FOUND I'M NOT THE ONLY ONE.  NO ACTION HAS BEEN TAKEN. *TR",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "12/25/2010",
        "dateOfIncident": "12/14/2010",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10372377,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "HANKOOK TIRE MFG. CO.",
                "productMake": "HANKOOK",
                "productModel": "HANKOOK",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "I PURCHASED AND HAD INSTALLED 8 NEW HANKOOK TIRES FOR TWO VEHICLES AT L&M TIRE & WHEEL 185 W. KING ST. ABBOTTSTOWN, PA. 17301, 7172590567. THEY DID NOT RECORD THE TYPE OF VEHICLES, MILEAGE OF THE VEHICLES OR MY ADDRESS. ALL THAT WAS WRITTEN ON THE RECEIPT WAS MY NAME AND PHONE NUMBER. THIS INFORMATION WOULD NOT BE SUFFICIENT FOR ME TO BE NOTIFIED IF THERE WERE A RECALL OF THESE TIRES. THIS SHOULD BE A REQUIREMENT TO PROTECT THE PUBLIC. IF IT IS A REQUIREMENT WHAT AGENCY IS RESPONSIBLE FOR ENFORCING THE RETENTION OF THIS INFORMATION? *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/15/2010",
        "dateOfIncident": "11/22/2010",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10371528,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONTAL IMPACT WHILE STRIKING A DEER AT THIS SPEED SHOULD HAVE DEPLOYED BOTH AIR BAGS.  THE AIR BAG LIGHT SOMETIMES WOULD REMAIN ON, BUT MOSTLY IT WAS OFF.  FROM WHAT I HAVE FOUND THROUGH OTHER COMPLAINTS IS THAT THIS YEAR VEHICLE IS KNOWN FOR THIS ISSUE, BUT A RECALL HAS NOT BEEN ISSUED.  IS IT GOING TO TAKE A DEATH TO FORCE SUBARU TO CORRECT THIS ISSUE? THE OTHER ISSUE FOUND WHILE REPAIRING THE VEHICLE IS THAT BOTH HEAD GASKETS ARE SEEPING COOLANT, THE DRIVERS SIDE IS SEEPING MORE JUST LIKE THE RECALL DESCRIBES ON 1999-2002 MODELS.  EVEN THOUGH THIS A 2003 IT WAS PURCHASED IN THE FALL OF 2002, SUBARU FAILED TO CONTACT ME AND ADVISE ME TO ADD THE $1.44 COOLANT ADDITIVE TO SAVE THE HEAD GASKETS.  HOW IS A CONSUMER SUPPOSED TO KNOW THESE LITTLE DETAILS?  NOW THE VEHICLE HAS TOO MANY MILES FOR THEM TO CARE, STICKING ME WITH THE ESTIMATED $2000 REPAIR.",
        "vin": "JF1SG65673G"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/13/2010",
        "dateOfIncident": "12/13/2010",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10370352,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 SUBARU FORESTER XS - FUEL SMELL IN CABIN DURING COLD WEATHER.  SIMILAR TO THE MANY POSTS  OUT THERE, THERE IS AN UNBEARABLE SMELL OF GAS IN THE CABIN OF MY CAR.  I HAVE TO ROLL WINDOWS DOWN IN THE FREEZING WEATHER TO CONTINUE TO DRIVE.  I'VE READ IT IS DUE TO CONTRACTING FUEL LINES THAT THEN LEAK.  FIRE HAZARDS ARE OBVIOUS, BUT THE NOXIOUS GAS IS ENOUGH TO AT LEAST DISTRACT YOUR DRIVING IF NOT KNOCK YOU UNCONSCIOUS.    I WILL VISIT MY DEALER THIS WEEK TO COMPLAIN. *TR",
        "vin": "JF1SG65683H"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "04/21/2010",
        "dateOfIncident": "04/17/2010",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10326824,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 SUBARU FORESTER. WHILE PULLING OUT OF THE DRIVEWAY, THE VEHICLE SUDDENLY BEGAN TO ACCELERATE UP TO 35 MPH AFTER THE CONTACT RELEASED THE ACCELERATOR PEDAL. THE VEHICLE CRASHED INTO A TREE AND WAS TOTALED. THE CONTACT WAS INJURED AS A RESULT OF THE CRASH. THE VEHICLE HAD NOT BEEN INSPECTED AT THE TIME OF THE COMPLAINT. THE FAILURE MILEAGE WAS APPROXIMATELY 71,000.",
        "vin": "JF1SG63683H"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "03/08/2010",
        "dateOfIncident": "09/20/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10317697,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2003 SUBARU FORESTER. WHILE DRIVING AT SPEEDS OF LESS THAN 20 MPH AND ENTERING HER DRIVEWAY, THE VEHICLE ABNORMALLY ACCELERATED AT A RAPID SPEED. THE VEHICLE CRASHED INTO HER HOME CAUSING CONSIDERABLE DAMAGES TO THE VEHICLE AND HER HOME. THE AIRBAGS DID NOT DEPLOY AT THE TIME OF IMPACT, HOWEVER SHE DID NOT SUSTAIN ANY INJURIES. THE MANUFACTURER WAS NOT CONTACTED AND REPAIRS WERE PAID BY HER INSURANCE COMPANY. ON A SEPARATE OCCASION, WHILE DRIVING AT SPEEDS OF LESS  THAN 15 MPH AND ENTERING HER DRIVEWAY FROM THE MAIN STREET, THE VEHICLE AGAIN ABNORMALLY ACCELERATED AT A RAPID RATE OF SPEED, CRASHING INTO THE REAR WALL OF HER HOME. THE VEHICLE DID NOT STOP AND PROCEEDED TO CRASH INTO HER GARAGE AND INTO THE REAR WALL OF A NEIGHBORING HOME. SHE DID NOT RECALL IF SHE ATTEMPTED TO DEPRESS THE BRAKE PEDAL AT THE TIME BECAUSE THE INCIDENT HAPPENED WITHIN A MATTER OF SECONDS. THE POLICE WERE CALLED TO THE SCENE AND A REPORT WAS FILED ACCORDINGLY. THE VEHICLE WAS DESTROYED. THE NIGHT BEFORE THE INCIDENT THE VEHICLE WAS TAKEN IN FOR REGULAR SCHEDULED MAINTENANCE. SHE WAS NOT ADVISED THAT THERE WERE ANY ISSUES WITH THE VEHICLE. THE INITIAL FAILURE MILEAGE WAS UNKNOWN, HOWEVER THE MILEAGE WAS 49,000 WHEN THE VEHICLE WAS DESTROYED. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "02/26/2010",
        "dateOfIncident": "02/22/2010",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10314538,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MONDAY, FEBRUARY 22, 2010, I HAD AN INCIDENT OF \"UNINTENDED ACCELERATION\" ON POOKS HILL ROAD AND WISCONSIN AVENUE.  I WAS STOPPING FOR A RED LIGHT WHEN I PUT ON THE BRAKES AND THE CAR ACCELERATED INSTEAD OF SLOWING AND STOPPING.  TO AVOID HITTING THE CAR IN FRONT OF ME, I SWERVED INSTEAD TO MY RIGHT INTO A SNOW BANK.  IT WAS APPROXIMATELY 2:45 P.M.   I WAS DRIVING A SUBARU FORESTER \"ALL WHEEL DRIVE\" 2003 VEHICLE.  DESPITE THE ALL WHEEL DRIVE, I COULD NOT GET OUT OF THE ICY SNOW BANK AND HAD TO BE TOWED OUT BY AAA.  IT WAS A FRIGHTENING EXPERIENCE.  *TR",
        "vin": "JF1SG65613H"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/31/2010",
        "dateOfIncident": "01/29/2010",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10303426,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2003 SUBARU FORESTER HAS A FUEL LEAK SMELL THAT ENTERS THE CAR INTERIOR.. IT'S NOT A RICH FUEL MIXTURE EXHAUST SMELL, IT'S THE SMELL OF RAW FUEL INSIDE THE CABIN. IT COMES AND GOES. I SEE ONLINE OTHERS ARE HAVING THIS PROBLEM. SUBARU SHOULD BE HELD ACCOUNTABLE AND FORCED TO HAVE A RECALL TO FIX THE PROBLEM ONCE AND FOR ALL. *TR",
        "vin": "JF1SG63653H"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/03/2010",
        "dateOfIncident": "11/25/2009",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10297928,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A SUBARU FORRESTER WITH 38 K MILES IN AUGUST.  DURING THE THANKSGIVING HOLIDAY, I NOTICED A RUBBING NOISE, CONSISTENT AND LOUDER WHILE TURNING IN THE REAR PASSENGER SIDE OF THE VEHICLE.  WARRANTY FROM THE DEALERSHIP ONLY LASTED ONE THOUSAND MILES AND THEY TOLD ME TOUGH LUCK.  A FRIEND WHO IS A \"SUBARU GUY\" TOLD ME I HAD A BAD BEARING, AND TO BE CAREFUL, IT WAS A COMMON PROBLEM THAT COULD GET WORSE QUICK.  IT DID, AND I HAVE HAD MY VEHICLE PARKED FOR THE PAST FEW WEEKS AS THE NOISE LOUD ONE DAY AND THE WHEEL WAS ACTUALLY LOOSE.  THE VEHICLE IS CURRENTLY IN THE SHOP, HAVING THE REAR WHEEL BEARING REPLACED.  THE COST OF THE REPAIR IS 390 DOLLARS, POSSIBLY 150 MORE IF THE MECHANIC FINDS OUT THAT A CAP OR SEAL FOR THE AXLE IS PITTED AND NEEDS REPLACEMENT.  I HAVE NEVER DRIVEN THE CAR IN ANY EXTREME CIRCUMSTANCES, MOSTLY FOR A THIRTY MILE HIGHWAY COMMUTE TO WORK, NO STOP AND GO OR ANY SORT OF EXTRAORDINARY DRIVING.  I HAD HEARD NOTHING BUT GOOD THINGS ABOUT SUBARU, BUT THIS IS NO GOOD AS THE WHEEL SEEMED TO HAVE LOOSENED TO A POINT OF DANGER AND I HAD IT TOWED IN TO THE SHOP. *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/28/2009",
        "dateOfIncident": "07/23/2009",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10282174,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CHECK ENGINE LIGHT CAME ON AND I BROUGHT MY CAR TO MY LOCAL SUBARU DEALER. THE SERVICE TECHNICIAN EXAMINED THE CAR AND DETERMINED THAT THE ENGINE LIGHT HAD COME ON BECAUSE OF A PROBLEM WITH MY AIRBAG.  HOWEVER, UPON EXAMINATION,  HE WAS UNABLE TO FIND ANYTHING WRONG WITH THE AIRBAG AND THE ENGINE LIGHT WENT OFF.  I WAS THEN TOLD NOT TO WORRY ABOUT IT SINCE IT WAS PROBABLY NOTHING. LUCKILY, THE MANAGER OVERHEARD THE CONVERSATION AND REMEMBERED A SERVICE BULLETIN (#17-07-04) THAT HAD BEEN ISSUED BY SUBARU REGARDING THIS VERY PROBLEM FOR 2003 SUBARU FORESTERS.  HE EXPLAINED TO ME THAT OXIDATION ON THE CONTACTS IN THE WIRING HARNESS FOR THE AIRBAG SENSOR WAS CAUSING THE AIRBAG LIGHT TO COME ON AND THAT I NEEDED TO HAVE THE NECESSARY WORK COMPLETED (PER THE SERVICE BULLETIN) OR ELSE THE AIRBAGS MIGHT NOT ACTIVATE IN AN EMERGENCY.    SINCE THIS IS A PROTECTED PART LOCATED INSIDE THE VEHICLE I FEEL THAT IT WAS NOT DESIGNED APPROPRIATELY TO RESIST OXIDATION AND THAT SUCH A FACTORY DEFECT COULD POTENTIALLY RESULT IN A VERY SERIOUS SAFETY ISSUE TO OWNERS OF THIS MODEL SUBARU CAR.  (WE HAVE A 2001 FORESTER WITH 112,000 MILES AND HAVE NEVER EXPERIENCED ANY PROBLEM OF THIS NATURE.)  I LOOKED ONLINE AND FOUND NUMEROUS SIMILAR COMPLAINTS ' ALL RELATED TO THE 2003 FORESTER AND ONLY TO THE 2003 FORESTER.  IN FACT, THERE IS A COMPLAINT ON THE NATIONAL HIGHWAY TRANSPORTATION SAFETY ASSOCIATION WEBSITE HTTP://WWW-ODI.NHTSA.DOT.GOV/CARS/PROBLEMS/COMPLAIN/COMPLAINTSUMMARY.CFM?ODI_ID=10' DATING BACK TO 2005, INVOLVING A DEATH WHEN THE AIR BAGS IN A 2003 FORESTER FAILED TO ACTIVATE.    BASED UPON ALL THE SIMILAR COMPLAINTS FOR THIS VERY MODEL CAR THAT I SEE ONLINE, I AM CONCERNED THAT THIS COULD POTENTIALLY BE A SERIOUS SAFETY ISSUE.  WHEN I CALLED SUBARU TO EXPLAIN MY CONCERN, THEY REIMBURSED ME FOR THE COST OF THE REPAIR, WHICH WAS $186.47.  HOWEVER, I FEEL THAT I NEED TO ADVISE THIS ASSOCIATION OF THE MATTER AS WELL SINCE I FEAR THIS COULD BE MORE WIDESPREAD THAN IS NOW KNOWN. *TR",
        "vin": "JF1SG63613G"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/26/2009",
        "dateOfIncident": "08/21/2009",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10281824,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2003 SUBARU FORESTER - PURCHASED NEW - CURRENTLY HAS 55,000 MILES ON IT.  IT WAS LAST SERVICED 3 MONTHS AGO.  AT THAT TIME, NOTHING WAS MENTIONED ABOUT COOLANT PROBLEMS OR LEAKS.  LAST WEEK, ON THE TURNPIKE, THE RPM NEEDLE STARTED SWINGING WILDLY AND I LOST POWER.  I MANAGED TO GET TO THE SHOULDER OF THE TURNPIKE AND SHUT DOWN AND BY THAT TIME SMOKE WAS POURING OUT FROM THE ENGINE. THE PROBLEM DIAGNOSED IS THAT THE COOLANT HAD LEAKED AT THE HEAD GASKETS - A PROBLEM THAT I AM NOW LEARNING SUBARU HAS KNOWN ABOUT FOR SOME TIME.  I HAVE TO REPLACE THE ENGINE AT A COST OF AT LEAST $2600.  I WAS NEVER CONTACTED BY SUBARU OR THE DEALERSHIP TO INFORM ME THAT  THIS MAY BE A PROBLEM ALTHOUGH I CONSISTENTLY HAVE RECEIVED NOTIFICATIONS ABOUT REPURCHASING AN EXTENDED WARRANTY.  OBVIOUSLY, A 2003 VEHICLE WITH 55,000 MILES ON IT HAS NOT BEEN DRIVEN EXCESSIVELY.  COMMENTS I HAVE HEARD ARE THAT \"YOU'RE STILL BREAKING IN THE ENGINE\". *TR",
        "vin": "JF1SG65683H"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/08/2009",
        "dateOfIncident": "02/19/2009",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10268187,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A NEW SUBARU FORESTER XS IN JULY 2003 AND HAD IT SERVICED REGULARLY AT NOW DEFUNCT SUBARU DEALERSHIPS. WHILE I WAS DRIVING ONE DAY, THE CAR SUDDENLY OVERHEATED.  THE FOREIGN AND DOMESTIC AUTO SERVICE MECHANIC I WAS ABLE TO REACH SHOWED ME THAT THE ENGINE WAS LEAKING COOLANT IN 3 PLACES, REQUIRING A COSTLY REPAIR OF THE HEAD GASKET.  I LEARNED FROM HIM THAT THIS HEAD GASKET FAILURE WAS A COMMON   PROBLEM WITH SUBARUS.  I HAD  THE CAR UNDER WARRANTY WITH SUBARU  FOR 60,000 MILES.  AT NO TIME WAS I NOTIFIED BY THE DEALER FROM WHOM I   PURCHASED THE CAR OR BY ANY SUBARU SERVICE CENTER, THAT SPECIAL COOLANT WAS REQUIRED TO MITIGATE THIS DEFECT.  I HAD THE CAR REPAIRED AT A COST OF OVER $2,000. *TR",
        "vin": "JF1SG65653H"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/20/2009",
        "dateOfIncident": "01/18/2009",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10259419,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CABIN HAS STRONG FUEL SMELL WHEN STARTING IN THE MORNING.  THE SMELL IS LIKE SOMEONE POURED A CUP OF FUEL ON THE FRONT SEAT.  THE DEALER STATED THERE WAS AN ISSUE WITH THE FUEL LINE LEAKING.  MANY OTHER SUBARU OWNERS ARE COMPLAINING ABOUT THIS ISSUE ON THE SUBARU OWNER WEBSITES.   *TR",
        "vin": "JF1SG63613H"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/16/2009",
        "dateOfIncident": "01/16/2009",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10255356,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TODAY, I STARTED MY 2003 SUBARU FORESTED, AND LET THE CAR RUN WITH THE HEAT ON FOR ABOUT 15 MINUTES WHILE I SCRAPED THE FROST OFF OF MY WINDOWS.  WHEN I OPENED THE DOOR TO GET IN, THE CABIN WREAKED OF GAS FUMES.    THIS IS THE THIRD TIME THIS HAS HAPPENED.  ONCE EACH IN JAN 2006 AND JAN 2007 I REPORTED THIS TO THE DEALERSHIP.  IN 2006 THEY ATTEMPTED TO REPLACE THE CLAMPS, IN '07 THEY REPLACED SOME HOSES.  APPARENTLY THESE FIXES ARE STILL NOT SUFFICIENT TO SOLVE THE PROBLEM.    THE ONLY CURRENT SOLUTION TO THE PROBLEM IS TO OPERATE THE CAR AT WARM TEMPERATURES OR LET IT WARM UP BEFORE DRIVING.  THE GAS FUMES ARE STILL GETTING IN TO THE CABIN WHEN IT IDLES, THOUGH. *TR",
        "vin": "JF1SG63613H"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/09/2009",
        "dateOfIncident": "10/11/2008",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10254368,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD REGULAR SERVICE DONE TO MY CAR AT CLAY SUBARU OF NORWOOD MASSACHUSETTS.  THE REPRESENTATIVE STATED THAT THE MECHANIC NOTICED SOME OIL SEEPAGE FROM THE HEAD GASKET.  THEY RECOMMENDED THAT I GET THE HEAD GASKETS REPLACED WITHIN A YEAR.  SINCE THAT TIME I HAVE MONITORED THE OIL LEVEL AND HAVE HAD TO REPLACE ABOUT A QUART IN BETWEEN REGULAR OIL CHANGE INTERVALS.  I AM CONCERNED BECAUSE I KNOW THIS REPRESENTS MAJOR ENGINE WORK.  THEY QUOTED THAT IT WOULD COST ABOUT $2,000.00 TO REPLACE THE HEAD GASKETS.  THE CAR ONLY HAD ABOUT 115,000 MILES ON IT.  IT IS A 2003 SUBARU FORESTER THAT I PURCHASED NEW IN DEC 2002. *TR",
        "vin": "JF1SG63653G"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/04/2009",
        "dateOfIncident": "12/15/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10253756,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "EXHAUST/FUEL SMELL IN INTERIOR CAB DURING USE IN COLD WEATHER/ USE OF HEATER IN 2003 SUBARU FORESTER. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/25/2008",
        "dateOfIncident": "11/15/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10252787,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "STRONG FUEL SMELL INSIDE THE CABIN DURING COLD WEATHER.  IT GETS SO BAD AT TIMES THAT IT CAUSES IRRITATION IN MY THROAT AND A BURNING SENSATION IN MY EYES. IT ALSO LEAVES A FOUL TASTE IN MY MOUTH THAT LASTS WELL AFTER I EXIT THE VEHICLE. *TR",
        "vin": "JF1SG63613H"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "11/12/2008",
        "dateOfIncident": "07/13/2006",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10248588,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRIC LOCKS--THE TAILGATE--EVEN THOUGH I HAD THE EXTRA WARRANTY I STILL HAD TO PAY 182.00 TO REPLACE THE LOCK BECAUSE IT WAS NOT THE LOCK IT WAS THE LATCH INSIDE THE LOCK THAT DID NOT WORK.  WHAT A RIP OFF.  I ALSO HAD DOGS IN THE CAR AND IT WAS HOT WHEN THE LOCK WOULD NOT WORK.  BECAUSE THERE IS NO KEY TO OPEN THE TAILGATE WHEN DOGS ARE IN CRATES YOU CANNOT OPEN THE DOOR!  SUBARU WOULD NOT COVER THE LOCK, EVEN THOUGH THE WARRANTY SAID IT COVERS LOCKS. THIS IS DANGEROUS  FOR THOSE OF US WHO USE A CRATE TO SAFELY TRANSPORT OUR DOG. THE CAR WAS SCRATCHED IN ORDER TO REMOVE DOGS FROM THE BACK DOORS GETTING CRATES IN A POSITION TO ALLOW DOORS TO BE OPENED. *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/28/2008",
        "dateOfIncident": "10/06/2008",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10246929,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 SUBARU FORESTER.  THE CONTACT STATED THAT HIS VEHICLE IS EXPERIENCING THE SAME WIRING HARNESS FAILURE AS STATED IN THE RECALL FOR THE 2006 MODELS.  THE DEALER OFFERED TO REPAIR IT AT THE CONTACT'S EXPENSE.  THE NHTSA CAMPAIGN ID NUMBER WAS UNKNOWN.  THE FAILURE AND CURRENT MILEAGES WERE 72,000.",
        "vin": "JF1SG63643H"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/23/2008",
        "dateOfIncident": "09/20/2008",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10243272,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 SUBARU FORESTER.  WHILE DRIVING APPROXIMATELY 65 MPH, THE FRONT HOOD RELEASED UNEXPECTEDLY.  THE CONTACT WAS ABLE TO CONTROL AND DIRECT THE VEHICLE TO THE SIDE OF THE ROAD.  THE POLICE ARRIVED TO ESCORT THE VEHICLE OFF THE HIGHWAY, WHICH WAS A STATE REGULATION, AND FILED A REPORT.  THE VEHICLE WAS TOWED TO AN AUTHORIZED DEALER FOR REPAIR.  THE CONTACT STATED THAT THE FAILURE WAS RELATED TO THE TWO BOLTS THAT ATTACHED THE HOOD.  THE FAILURE AND CURRENT MILEAGES WERE 130,000.",
        "vin": "JF1SG65633H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/06/2008",
        "dateOfIncident": "09/06/2008",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10241195,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG WARNING LIGHT ILLUMINATES WHEN DRIVERS SEAT IS MOVED.  IT APPEARS THAT THE ELECTRICAL CONNECTOR BENEATH THE DRIVERS SEAT IS DEFECTIVE.  I HAVE FOUND MANY COMPLAINTS ON THE INTERNET OF THIS PROBLEM FOR THE 2003 SUBARU FORESTER.  IT IS AN OBVIOUS MANUFACTURING DEFECT.  WHY NO RECALL?  THIS IS A SERIOUS PROBLEM WITH THE CARS SRS. *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/28/2008",
        "dateOfIncident": "07/17/2008",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10235978,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 60 MPH WITH CRUISE CONTROL ENGAGED, I ENTERED TOWN LIMITS AND PRESSED SWITCH TO DE-ACTIVATE CRUISE CONTROL; NOTHING HAPPENED; DEPRESSED BRAKE PEDAL; NOTHING HAPPENED- CAR DID NOT SLOW DOWN; FRANTICALLY TRIED EVERYTHING SEVERAL TIMES MORE USING CLUTCH, BRAKE AND EMERGENCY BRAKE.  HAD TO TAKE A TURN AT HIGH SPEED TO AVOID A TRACTOR TRAILER STOPPED AT LIGHT; CAR EVENTUALLY STOPPED AFTER MAKING THE TURN AND YANKING UP EMERGENCY BRAKE. *TR",
        "vin": "JF1SG63603G"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/19/2008",
        "dateOfIncident": "05/14/2008",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10228226,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTICED ANTI-FREEZE ODOR AFTER VEHICLE HAD BEEN RUN AND TURNED OFF.  DID NOT SEE ANY LEAKS.  PROBLEM CONTINUED SEVERAL WEEKS BEFORE NOTICING SEVERAL LEAK SPOTS ON GARAGE FLOOR, SO MADE APPOINTMENT WITH MECHANIC WHO KNEW IMMEDIATELY IT WAS A HEAD GASKET PROBLEM.   WE PURCHASED THE CAR NEW IN OCTOBER, 2002 AND HAVE MAINTAINED IT ACCORDING TO THE MAINTENANCE SCHEDULES.  THE VEHICLE HAD 52,000 MILES ON IT WHEN WE SPENT $1300 TO REPAIR A PROBLEM THAT SUBARU OF AMERICA KNEW ABOUT AND HAS KNOWN ABOUT FOR SOME TIME.   WE NEVER RECEIVED ANY NOTICE OR RECALL OF ANY KIND RELATING TO THIS PROBLEM.  SUBARU OF AMERICA SHOULD MAKE SOME SORT OF RESTITUTION TO ITS CUSTOMERS FOR THIS MANUFACTURERS DEFECT.  *TR",
        "vin": "JF1SG63653H"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/07/2008",
        "dateOfIncident": "02/01/2008",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10223572,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "SUBARU",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SPEEDOMETER DOESN'T WORK.  *TR",
        "vin": "3GNFK16Z73G"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/26/2008",
        "dateOfIncident": "03/03/2008",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10222830,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 SUBARU FORESTER PROBLEMS WITH CYLINDER HEAD GASKET. CONSUMER STATES THERE ARE SEVERAL INTERNET COMPLAINTS ABOUT THIS DEFECT. SHE STATES THAT THE ESTIMATE COST FOR REPAIR IS ABOUT $1500.00 TO $1600.00 DOLLARS.  *KB",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/25/2007",
        "dateOfIncident": "11/01/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10209852,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG LIGHT WOULD COME ON AND STAY ON FOR A FEW DAYS AND THEN GO OFF.  THIS CONDITION WOULD OCCUR AT RANDOM, WITH NO WARNING.  FINALLY THE LIGHT STAYED ON LONG ENOUGH FOR ME TO GET IT TO THE DEALER.  SUBARU DEALER INDICATED THAT THE WIRING HARNESS UNDER THE DRIVER'S SEAT FOR THE AIRBAG SENSOR HAD OXIDIZED CONTACTS LEADING TO A FAILURE OF THE AIRBAG SYSTEM.  DEALER COULD NOT EXPLAIN WHY CONTACTS \"INSIDE\" CAR IN A PROTECTED AREA COULD \"OXIDIZE\", BUT INDICATED THAT THEY HAD LEARNED FROM SERVICE BULLETINS THAT THIS WAS A KNOWN PROBLEM WITH CARS IN THE NORTHEAST.  WIRING HARNESS PART COST $17.13 BUT THE LABOR TO REPLACE WAS $207.13  FAILURE OF SUCH A CRITICAL PART DUE TO SIMPLE OXIDATION, ESPECIALLY WHERE THE PART IS PROTECTED INSIDE THE VEHICLE SUGGESTS THAT THE PART WAS NOT DESIGNED APPROPRIATELY TO RESIST OXIDATION/CORROSION.  THIS IS A SAFETY ISSUE THAT COULD RESULT IN A FAILURE OF THE AIRBAG SYSTEM WITH POSSIBLE INJURY.  *TR",
        "vin": "JF1SG656X3H"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/24/2007",
        "dateOfIncident": "08/30/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10203929,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 SUBARU FORESTER.  WHILE PERFORMING A ROUTINE INSPECTION AND OIL CHANGE, THE MECHANIC NOTICED THAT THE ROTORS WERE CRACKED.  THE MECHANIC REPLACED THE ROTORS.  THE DEALER AND MANUFACTURER WERE NOTIFIED AND THEY STATED THAT THE FAILURE WAS CAUSED BY WEAR.  THE CURRENT AND FAILURE MILEAGES WERE 40,000.   UPDATED 11/07/07  *TR",
        "vin": "JF1SG65693H"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "07/26/2007",
        "dateOfIncident": "07/26/2006",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10197597,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 SUBARU FORESTER.  THE CONSUMER STATED WHEN SHE PLACED THE VEHICLE IN REVERSE THE VEHICLE ACCELERATED RAPIDLY . THE CONSUMER HIT A POLE THE CONSUMER STATED THE BRAKES DID NOT WORK. THE VEHICLE CONTINUED TO REV AND ACCELERATED AND CRASHED INTO A GATED DISPLAY OF PROPANE TANKS AND AN ICE-CREAM MACHINE.  THE CONSUMER STATED SHE WAS GOING TO THE DEALER BECAUSE HER CRUISE CONTROL WAS NOT WORKING. UPDATED *LJ",
        "vin": "JF1SG63643H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/23/2007",
        "dateOfIncident": "07/23/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10197275,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 SUBARU FORESTER.  THE CONTACT BOUGHT A USED CAR FROM A SUBARU DEALER, WHICH HAS A LIMITED WARRANTY FOR 90 DAYS.  SHE DISCOVERED THAT THERE ARE NO AIR BAGS IN THE VEHICLE ALONG WITH A NON-WORKING INSTRUMENT CLUSTER.  THE COST TO REPAIR OR INSTALL THE AIR BAGS IS $1,200.  SHE STATED THAT THE DEALER MISREPRESENTED THE VEHICLE REGARDING THE AIR BAGS.  THE CURRENT AND FAILURE MILEAGES WERE 52,000.",
        "vin": "JF1SG63613H"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/18/2007",
        "dateOfIncident": "07/17/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10196664,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 SUBARU FORESTER.  WHILE DRIVING 35 MPH, THE VEHICLE FAILED TO COME TO A COMPLETE STOP WHEN THE BRAKE PEDAL WAS DEPRESSED.  THE CONTACT STATED THAT WHEN HE RELEASED THE BRAKE PEDAL, THE VEHICLE ACCELERATED WITHOUT HIM DEPRESSING THE ACCELERATOR PEDAL.  THE DEALER STATED THAT THE THROTTLE PLATE WAS STUCK OPEN.  AS OF JULY 18, 2007, THE VEHICLE HAS NOT BEEN REPAIRED.  THE CURRENT AND FAILURE MILEAGES WERE 42,878.  UPDATED 09/18/07  *TR",
        "vin": "JF1SG63653H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/18/2007",
        "dateOfIncident": "07/17/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10196698,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER PICKINGTHE CAR UP FROM AN OIL CHANGE I NOTICED THE AIR BAG LIGHT WAS ON. I DROVE THE CAR BACK TO DEALERSHIP, AND TECHNICIAN TOLD ME THAT FROM ADJUSTING THE SEAT THE  WIRES HAD BECOME BENT/LOOSE, AND THEY WOULD HAVE TO TAKE OUT SEAT AND RESOLDER THE WIRES SO THE AIRBAGS COULD FIRE PROPERLY. ARE YOU SUPPOSED TO BE ABLE TO ADJUST YOUR SEATS?  *AK",
        "vin": "JF1SG63623H"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "07/02/2007",
        "dateOfIncident": "06/29/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10195139,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "LATCHES ON THE FORRESTER CANNOT BE OPENED UNLESS YOU HAVE A KEY FOB.  THERE IS NO WAY TO ACCESS THE TAILGATE WITHOUT THE BATTERY OPERATED FOB.  IF YOU HAVE A CHILD THAT GETS INTO THE CAR WITHOUT YOUR KNOWLEDGE, OR IF THERE IS AN ACCIDENT AND THE DOORS WILL NOT OPEN FROM THE SIDE.  HOW WILL YOU GET OUT THE BACK--THERE IS NO WAY TO EVEN ACCESS WITH A KEY FROM THE OUTSIDE.  IF YOU ARE IN AN ACCIDENT AND YOU LOOSE TRACK OF YOUR FOB TOO BAD, YOU CAN'T GET OUT FROM THE BACK.  I MYSELF CARRY DOGS IN CRATES IN THE BACK OF THE FORRESTER.  HAD I REALIZED THAT WHEN I HAVE CRATES, OR ANY OTHER LARGE ITEM IN BACK YOU DO NOT HAVE ACCESS TO THE BACK, I WOULD HAVE NEVER PURCHASED THE CAR.  I BELIEVE THIS IS A SAFETY ISSUE.  I CALLED THE DEALER AND ASKED HOW TO OPEN THE BACK OF THE CAR AND THEY SAID YOU HAVE TO REMOVE A PANEL.  IF YOU ARE ON FIRE--YOU HAVE TO WAIT TO GET THE PANEL OFF TO GET THE DOOR OPEN, BUT IF YOU CAN'T GET TO THE BACK BECAUSE OF DOG CRATES, BABY CARRIAGES, CRIBS, PLAYPENS ETC.  HOW WOULD YOU GET OUT.  I WOULD LIKE TO GIVE A WRITTEN HARD COPY REPORT.       2.  SUBARU KNOWS THERE IS A PROBLEM WITH THE HEADGASKET? MANIFOLD GASKET THAT THERE IS A DEFECT.  WHEN IT GOES BAD, YOU MAKE THE FIX IT WILL NEVER HAPPEN AGAIN--WHY DOES THE OWNER HAVE TO FOOT THE BILL WHEN I WAS TOLD, BY THE MECHANIC, THAT IN FACT SUBARU KNOWS THIS AND IT IS ONLY A MATTER OF TIME BEFORE THE GASKET WILL GO, BUT ONCE YOU MAKE THE CORRECTION IT WILL NEVER HAPPEN AGAIN.  *TR",
        "vin": "JF1SG65623H"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/06/2007",
        "dateOfIncident": "02/05/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10184384,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MONDAY NIGHT, 5 FEB. 2007, WHEN I PARKED MY CAR IN THE GARAGE IT SMELLED STRONGLY OF GASOLINE.  I CHECKED UNDER THE HOOD AND THE ODOR SEEMED TO BE COMING FROM THE PASSENGER SIDE OF THE ENGINE COMPARTMENT.  I DID NOT SEE ANY GASOLINE LEAKING.  THE STRENGTH OF THE ODOR SEEMS TO BE RELATED TO THE COLD WEATHER (15-20 DEG. F).  THAT MONDAY WAS THE FIRST TIME THAT I HAD EVER NOTICED THE SMELL OF GASOLINE EMANATING FROM THE ENGINE COMPARTMENT.  THE ODOR WAS SO INTENSE THAT I DECIDED TO PARK THE CAR OUTSIDE AS A PRECAUTION.  I DROVE THE CAR TUESDAY MORNING AND PARKED IT IN THE GARAGE AND IT SMELLED OF GAS AGAIN.  AS THE OUTSIDE TEMPERATURE HAS INCREASED, THE INTENSITY OF THE SMELL HAS DECREASED.  DURING VERY COLD WEATHER SMALL AMOUNTS OF GASOLINE SEEMED TO BE LEAKING FROM ONE OF THE FUEL LINES OR ESCAPING FROM THE ENGINE.  ON 9 FEBRUARY, I BROUGHT THE CAR TO DEALER (HERITAGE SUBARU, OWINGS MILLS, MD) SERVICE DEPARTMENT AND ASKED THEM TO INVESTIGATE THE CAUSE OF THE GASOLINE SMELL.  THE DEALER REPLACED THREE SHORT RUBBER FUEL HOSES (P/N 807707130) FROM THE ENGINE COMPARTMENT.  THE REPLACED HOSES SHOWED NO SIGN OF WEAR, HOLES, CUTS, ABRASIONS ETC., BUT THE DEALER SERVICE REPRESENTATIVE INDICATED THAT FUEL HAD PERMEATED THE HOSE MATERIAL ALLOWING FUMES AND POSSIBLY SMALL AMOUNTS OF FUEL TO ESCAPE.  THIS PROBLEM APPEARS TO BE A DEFECT IN MATERIAL OR DESIGN SINCE THE CAR IS ONLY 3.5 YEARS OLD AND THE REPLACED HOSES SHOW NO SIGNS OF WEAR (I.E., OLD AND NEW HOSES APPEAR ON THE OUTSIDE TO BE IDENTICAL).  I HAVE THE OLD HOSES AND CAN PROVIDE THEM FOR INSPECTION.  *JB",
        "vin": "JF1SG63643H"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/11/2007",
        "dateOfIncident": "01/27/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10182280,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DEALER ADVISED THE HEAD GASKET IS LEAKING COOLANT AND RECOMMENDED REPAIR WHICH WILL REQUIRE EXTENSIVE LABOR. VEHICLE ONLY HAS 69,000 MILES. VEHICLE WAS PURCHASED 20 NOV 2002 AND HAD A 60,000 MILE/5 YEAR POWER TRAIN WARRANTY. SERVICING WAS DONE ON A REGULAR BASIS AND VEHICLE HAS NOT BEEN DRIVEN EXCESSIVELY.   *NM",
        "vin": "JF1SG65643H"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/06/2007",
        "dateOfIncident": "02/06/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10181794,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL LINE FAILED, LEAKING FUEL IN ENGINE COMPARTMENT.  *JB",
        "vin": "JF1SG65603H"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/10/2007",
        "dateOfIncident": "01/02/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10178337,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* - THE CONTACT OWNS A 2003 SUBARU FORESTER.  THE VEHICLE'S FAILURE OCCURRED ON FOUR OCCASIONS.  THE MECHANIC STATED THAT THE HEAD GASKET NEEDED TO BE REPLACED.  THE CONTACT CALLED A SUBARU DEALER AND NORTH AMERICAN SUBARU.  THE CONTACT STATED THAT WHEN THE VEHICLE'S  MILEAGE EXCEEDED 100,000 IT REQUIRED A NEW HEAD GASKET.  THE CONTACT WAS ADVISED THAT THE PREVIOUS INCIDENT WAS A LEAK IN THE RADIATOR, WHICH WAS REPAIRED AND THE CONTACT SUSPECTED  THE HEAD GASKET WAS THE CAUSE OF THE PREVIOUS LEAK.  THE SECOND INCIDENT WAS A COOLANT LEAK WHICH WAS ALSO REPAIRED, WHICH OCCURRED TWO DAYS AFTER THE ORIGINAL REPAIR.  THE VEHICLE WAS TOWED TO THE DEALER ANDWAS CURRENTLY BEING REPAIRED.",
        "vin": "JF1SG63603H"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/17/2006",
        "dateOfIncident": "12/16/2006",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10176336,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TOOK FORESTER INTO SUBARU DEALER FOR 3K OIL CHANGE; WAS TOLD THAT ALMOST ALL OF MY ANTI-FREEZE WAS GONE AND THAT THE HEAD GASKETS WERE LEAKING, NEEDING REPLACEMENT AT $1500.  MILES ON VEHICLE:  78K, PURCHASED 6/02 NEW, ALL MAINTENANCE PERFORMED AT DEALER PER SCHEDULE.  AT THIS TIME, I'M LOOKING INTO WEBSITES TO IDENTIFY IF THIS IS A PROBLEM THAT'S SYSTEMIC WITH THIS VEHICLE, AND LOOKING INTO ALTERNATIVE SOURCES TO FIX VEHICLE TO REDUCE COST.  *JB",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/07/2006",
        "dateOfIncident": "10/05/2006",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10170184,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECENTLY HAD AN UNCOMFORTABLE AND POTENTIALLY DANGEROUS INCIDENT WITH MY 2003 FORESTER, AT, OF ALL PLACES, THE LOCAL TOYOTA DEALERSHIP.  I HAD STOPPED TO DISCUSS A SERVICE APPOINTMENT.  UPON LEAVING, MY FORESTER WOULD NOT START, BUT EXHIBITED SYMPTOMS OF INITIALLY FUEL STARVATION, AND THEN POOR IGNITION; IT RAN FOR 1/2-1 MINUTE, MISSING FREQUENTLY AND THEN WOULD DIE; WITHIN A FEW MINUTES, IT WOULD NOT RUN AT ALL, SUGGESTING EITHER COMPLETE FUEL OR IGNITION FAILURE.  THE TOYOTA SERVICE DEPARTMENT CLOSED AT 6, AND THEIR SUGGESTION WAS TO TOW THE FORESTER TO THE NEARLY SUBARU DEALERSHIP, ONE BLOCK AWAY.  AND SUGGEST THAT NEXT TIME I GET A RAV4.  THE SUBARU SERVICE DEPARTMENT CLOSED AT 5:30, OF COURSE, AND THERE WERE ONLY SALESPEOPLE PRESENT.  THEIR SUGGESTION WAS TO ALSO TOW THE CAR TO THE SERVICE DEPARTMENT. FINALLY, THE SALES MANAGER SUGGESTED THAT IT MIGHT BE THE SECURITY SYSTEM.  OF COURSE, MY FORESTER DID NOT HAVE THAT OPTION, BUT HE SAID THAT HE UNDERSTOOD MOST OF THE CIRCUITRY EXISTED, AND THAT CERTAIN COMBINATIONS OF LOCKING/UNLOCKING THE DOOR WITH THE KEY, OR THE DOOR SWITCH, COULD ACTIVATE THE IGNITION CUTOFF.  HE TOLD ME TO SHUT ALL THE DOORS AND THEN LOCK/UNLOCK THE DOORS TWICE WITH THE REMOTE.  I WALKED BACK, DID THAT, AND THE FORESTER STARTED.  AFTER DRIVING BACK AND THANKING HIM, I CAREFULLY READ BOTH THE OWNER'S MANUAL AND THE SEPARATE MANUAL FOR THE REMOTE/SECURITY SYSTEM.  THERE IS NO MENTION OF THIS POTENTIAL PROBLEM.    LUCKILY, THIS HAPPENED IN DAYLIGHT, WITHIN WALKING DISTANCE OF THE SUBARU DEALER, AND THERE ALSO HAPPENED TO BE SOMEONE THERE WHO COULD SUGGEST A CURE.    1)  IS THIS A KNOWN FAULT IN THE SYSTEM?   2)  IF KNOWN (AND THE MANAGER SAID HE HAD HEARD OF SEVERAL CASES) WHY IS THERE NOT SOME DESCRIPTION OF THE PROBLEM AND THE SIMPLE SOLUTION.  *JB",
        "vin": "JF1SG63693G"
    },
    {
        "components": "AIR BAGS,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/14/2006",
        "dateOfIncident": "09/14/2006",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10168258,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THE AIR BAG LIGHT ILLUMINATED.  THE DEALERSHIP DETERMINED THE HARNESS ASSEMBLY UNDERNEATH THE FLOOR BOARD WAS NOT LONG ENOUGH TO MAINTAIN A CONNECTION AND RECOMMENDED A KIT BE INSTALLED.  AFTER THE KIT WAS INSTALLED, THE AIR BAG LIGHT WENT OFF.",
        "vin": "JF1SG65643H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/21/2006",
        "dateOfIncident": "07/15/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10166138,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 FORESTER FOR PAST 2 YEARS THE AIR BAG LIGHT STAYS ON AFTER STARTING ABOUT ONCE A MONTH. SUBARU TECHNICIAN FOUND THAT THE AIR BAG CONNECTOR UNDER DRIVERS SEAT WAS LOOSE AND HE PLUGGED IT BACK IN. THAT FIXED IT FOR ABOUT A MONTH. SINCE THEN WHEN LIGHT COMES ON I HAVE TO REACH UNDER SEAT FROM REAR FOOT AREA AND WIGGLE BOTH PLUGS, AIR BAG LIGHT GOES OUT AND WORKS FOR ABOUT A MONTH THEN I HAVE TO REPEAT THE PROCEDURE. I DO NOT LIKE THE IDEA OF MY AIRBAG BEING DISABLED BY A LOOSE PLUG. WHAT IF I WAS IN AN ACCIDENT AFTER THE PLUG LOOSENED BUT BEFORE I RESTARTED MOTOR (APPARENTLY COMPUTER ONLY CHECKS AIR BAG CIRCUIT EACH TIME CAR IS STARTED AND LIGHT DOES NOT COME ON WHEN CONNECTOR BECOMES LOOSE).  *JB",
        "vin": "JF1SG65683H"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/11/2006",
        "dateOfIncident": "07/10/2006",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10162089,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 SUBARU FORESTER PURCHASED MAY 2003  1.  BRAKES DID NOT FEEL CORRECT - LOW BRAKE PEDAL  2.  MADE APPOINTMENT AT AAA AUTO MARK CAR CARE CENTER FOR BRAKES TO BE CHECKED  3.  AAA AUTO MARK CAR CARE CENTER PERSON SAID THAT OUR MASTER CYLINDER WAS LEAKING AND  NEEDED TO BE REPLACED.  OUR VEHICLE MILEAGE - 18046 - AND EVEN THAT THE CAR WAS OUT OF WARRANTY (36 MONTHS MAXIMUM), THEY CONTACTED THE LOCAL SUBARU BUT SUBARU SAID SEEING THE CAR WAS OUT OF THE 36 MONTH WARRANTY PERIOD, SUBARU WOULD NOT PAY FOR THE PART OR REPAIR.  4. WE HAD TO HAVE THE VEHICLE REPAIRED SO AAA AUTO MARK CAR CARE CENTER PURCHASED THE PARTS NEEDED (1- MASTER CYLINDER, 2 WHEEL CYLINDERS) AND REPLACED THEM.  WE ASKED FOR AND RECEIVED THE OLD PARTS.  5.  MY HUSBAND AND I HAVE HAD MANY CARS OVER MANY YEARS AND NEVER HAVE HAD TO REPLACE A MASTER CYLINDER EVEN THOUGH THE MILEAGE DRIVEN ON THE CARS WAS MUCH HIGHER THAN 18046 ON THE SUBARU.  *NM",
        "vin": "JF1SG63633H"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "07/11/2006",
        "dateOfIncident": "03/16/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 1,
        "numberOfInjuries": 1,
        "odiNumber": 10162162,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MARCH 16TH 2006. 5:00 PM. IT HAD SNOWED EARLIER THAT DAY. WITNESS CLAIMS THE 2003 SUBARU FORESTER SLID IN A CURVE INTO AN ON COMING LANE. UNIT SPUN AROUND AND WAS HIT IN THE LEFT REAR CORNER(TAIL LIGHT SECTION) SHOVING THE REAR BODY PANEL AND QUARTER PANEL INSIDE THE UNIT BEHIND THE REAR PASSENGER SEAT. LEFT REAR TIRE WAS TORN FROM THE UNIT. THE REAR SHADE COVER (CARGO AREA) FLEW OUT OF IT'S HOLDERS NOW BENT IS A  (V-SHAPE) AND HIT MY WIFE IN HER RIGHT TEMPLE, ADDING TO THE HEAD TRAUMA SHE RECEIVED WHEN THE SEAT BELTS FAILED AND THE AIR BAGS FAILED. HER FOREHEAD HIT THE STEERING WHEEL, THE LEFT BACK PART OF THE HEAD WAS CRUSHED HITTING THE HINGE PILLAR AND RIGHT TEMPLE WAS BRUISED FROM THE REAR CARGO COVER. IN SECONDS, LEFT HER BLEEDING TO DEATH IN THIS UNIT.   I CALLED SUBARU CORP. IN MARCH TO INFORM THEM OF THE ACCIDENT (JUST) IN CASE THEY WANTED TO INVESTIGATE. (NOT INTERESTED) (VERY RUDE)  I STILL HAVE THE UNIT HERE IF YOU WOULD LIKE TO CHECK IT OUT. IT'S (SUPPOSE) TO BE THE SAFEST UNIT ON THE ROAD?  *JB",
        "vin": "JF1SG65643H"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/14/2006",
        "dateOfIncident": "04/14/2006",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10155374,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED THERE WAS A PINING NOISE IN THE ENGINE, WHEN THE VEHICLE WAS FIRST STARTED IN COLD WEATHER.  THE NOISE STOPPED AFTER TWO MINUTES.  THE DEALERSHIP DETERMINED THIS WAS NORMAL OPERATING CONDITIONS, ALTHOUGH THERE WAS A SERVICE BULLETIN INSTRUCTING TO REPLACE THE PISTONS.",
        "vin": "JF1SG63613H"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "02/28/2006",
        "dateOfIncident": "02/26/2006",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10151477,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE DRIVING AT 35 MPH ON A GRAVEL ROAD A DEER RAN OUT IN FRONT OF THE VEHICLE.  THE CONTACT TAPPED THE BRAKE PEDAL TO MISS THE DEER; THIS IN TURN CAUSED THE CONTACT TO LOSE CONTROL.  THE VEHICLE HIT A DOUBLE POST HEAD ON, THEN SLID DOWN AN EMBANKMENT AND STOOD ON ITS NOSE.  IT THEN FLIPPED ONTO THE DRIVER'S SIDE, ROLLED ONTO ITS TOP AND THEN RESTED ON ITS WHEELS.   SEAT BELTS WERE IN USE, BUT DID NOT RESTRAIN THE OCCUPANT.  FRONTAL AND SIDE  AIRBAGS  DID NOT DEPLOY, INJURIES WERE SUSTAINED.  THE INSURANCE COMPANY INSPECTED THE VEHICLE, BUT THEY COULD NOT DETERMINE WHY THE AIR BAGS DID NOT DEPLOY.  THE VEHICLE WAS TOTALED, THE MANUFACTURER HAS BEEN CONSULTED. *AK",
        "vin": "JF1SG63653G"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "07/15/2005",
        "dateOfIncident": "07/07/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10130186,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 SUBARU FORESTER SPEED CONTROL MALFUNCTION.   *MR   WHILE BACKING OUT OF THE PARKING SPACE, THE VEHICLE SUDDENLY TOOK OFF IN AN UNCONTROLLABLE MANNER AND STRUCK TWO PARKED VEHICLES THAT WERE 10 FEET AWAY.  ONE OF THE VEHICLE'S HIT ANOTHER CAUSING DAMAGE.  *SC  *JB",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/13/2005",
        "dateOfIncident": "04/05/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10117512,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE BACKING OUT OF A PARKING SPACE THE VEHICLE ACCELERATED.  NO IMPACT REPORTED.  *AK   THE PROBLEM HAD NOT BEEN COMPLETELY CORRECTED.  THE CONSUMER ALMOST HIT A PEDESTRIAN IN A PARKING LOT DUE TO THIS PROBLEM.  WHEN BACKING OUT, THE VEHICLE STARTED OUT SLOW BUT WOULD THEN SURGE IN REVERSE.  THE BRAKES FELT SPONGY.  THE FRONT BRAKE PADS WERE STICKING TO THE SLIDERS.  THE PADS WERE REMOVED AND THE CORROSION WAS CLEANED.  THE VEHICLE ACCELERATED LIKE IT WAS IN CRUISE AND WHEN THE CONSUMERS FOOT WAS TAKEN OFF OF THE GAS, THE SPEED WOULD REMAIN THE SAME.   *SC  *JB",
        "vin": "JF1SG63683H"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "05/13/2005",
        "dateOfIncident": "03/01/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10121565,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "PROBLEMS WITH FUSES ON THE 2003 SUBARU FORESTER.   *MR   THE CONSUMER NOTICED A BLOWN FUSE AND THAT THE CONTROL OF HER REAR VIEW MIRRORS WERE NOT WORKING.  THE CONSUMER ALSO NOTICED WHILE IN THE PROCESS OF REPLACING FUSE #4, THE LABEL AND MANUAL STATED  \"2003 FORESTER MANUAL\" A8070BE/MSA5M0304A-PAGE 12-6) DIFFERED IN AMPERAGE FOR NOT ONLY THE #4 BUT ALSO #8 (ABS SOLENOID).  THE CONSUMER PROMPTLY CHANGED THE FUSES TO 20 AMPS EACH.  THE CONSUMER WAS INFORMED THAT THE MANUAL WAS WRONG AND THAT THE LABEL WAS RIGHT.  THE CONSUMER PROMPTLY CHANGED BACK TO THE 15 AND 30 AMP FUSES.  THE CONSUMER REQUESTED CLARIFICATION IN WRITING FROM SUBARU ABOUT THE PROPER AMPERAGE AND OFFICIAL NOTIFICATION TO OWNERS WHO HAVE THE SAME MANUAL.   *SC",
        "vin": "JF1SG63663H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/02/2005",
        "dateOfIncident": "12/29/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10108982,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN AT A STOP BOTH THE LEFT AND RIGHT FRONT AXLES BROKE. THIS HAPPENED TWICE. WHEN TAKEN TO GET SERVICED CONSUMER WAS TOLD THAT  IT WAS DUE TO THE SNAP RINGS.*AK  CONSUMER HAS BOTH AXLE ASSEMBLIES.   *TT",
        "vin": "JF1SG63643H"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "02/16/2005",
        "dateOfIncident": "12/27/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10107426,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE SHOT FORWARD WHEN PUT IN REVERSE CAUSING IT TO HIT THE FRONT DOOR OF A STORE. THE OWNER THEN PLACED THE VEHICLE IN DRIVE  AND THE VEHICLE SHOT IN REVERSE, WHILE ACCELERATING FORWARD, THE CONSUMER ALMOST HIT A HOUSE. OWNER WILL CONTACT THE MANUFACTURER.   *JB  CAUSE NOT YET DETERMINED.    *TT",
        "vin": "JF1SG636338"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/02/2005",
        "dateOfIncident": "02/02/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10108438,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "SUBARU",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTICED PINGING NOISE FROM ENGINE.  SUBARU REPLACED BLOCK. ABOUT A YEAR LATER, HAD PINGING NOISE AGAIN, AND CAR WAS STALLING AFTER COLD NIGHT, FIRST THING IN THE MORNING. SUBARU SAID THEY DIDN'T NOTICE ANY PROBLEM, BUT I HAVE A FEELING I'LL BE GETTING ANOTHER BLOCK IN A YEAR OR SO.*AK",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "01/09/2005",
        "dateOfIncident": "09/13/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10106021,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WINDSHIELD HAS REQUIRED THREE REPLACEMENT SINCE THE PURCHASE OF THE CAR. THE FIRST TWO REPLACEMENTS RESULTED IN NOISE EMANATING FROM THE TOP-CENTER OF THE WINDSHIELD BY THE REAR VIEW MIRROR. THE THIRD REPLACEMENT OF THE WINDSHIELD INVOLVED THE DEALERSHIP, AND THE RESULT SO FAR HAS BEEN POSITIVE. ALTHOUGH, IN ORDER FOR THE INSTALLER TO INSURE THAT THE NOISE WAS HALTED, HE HAD TO APPLY MORE PRESSURE WHEN SETTING THE WINDSHIELD AS WELL AS USE A HIGH PERFORMANCE SEALANT. THE RESULT OF THESE PROCEDURES WILL RESULT IN THE NEXT WINDSHIELD REPLACEMENT, WHEN IT BECOMES NECESSARY, TO BE A DIFFICULT ONE AND WITH NO GUARANTEE THAT THE NOISE WILL NOT COME BACK! *AK",
        "vin": "JF1SG65673H"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/23/2004",
        "dateOfIncident": "11/23/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10100396,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ROTOR PREMATURELY WORN.  CAR WAS PURCHASED 10/03.  ROTORS HAVE HAD TO BE TURNED TWICE SINCE PURCHASE DATE.  *JB",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/05/2004",
        "dateOfIncident": "11/04/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10099507,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE PASSENGER SEAT IS RECLINED THE CAR SEAT PINCHES THE CABLE THAT CONNECTS THE VOLTAGE THAT OPERATES THE AIR BAGS. WHEN THE CABLE IS PINCHED IT DEACTIVATES THE AIR BAGS, PREVENTING THEM FROM DEPLOYING. CONSUMER TOOK THE VEHICLE TO THE DEALER, WHO WAS ASKING $600.00   FOR REPAIRS OF A MANUFACTURER'S DEFECT. *AK",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/08/2004",
        "dateOfIncident": "10/05/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10095511,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONSUMER HIT HER GARAGE DOOR WITH THE VEHICLE BREAKING THE REAR HATCH WINDOW. HOWEVER, WHEN THE GLASS BROKE, IT BROKE INTO  PIECES AND DID NOT DISINTEGRATE. THE GLASS COMPANY CAME OUT AND EXPLAINED TO HER THAT THE GLASS HAD NOT GONE THROUGH THE PROPER PROCESSING, AND THAT IT WAS NOT SAFE. PLEASE PROVIDE ANY FURTHER INFORMATION.  *JB",
        "vin": "JF1SG63663H"
    },
    {
        "components": "CHILD SEAT",
        "crash": false,
        "dateComplaintFiled": "10/06/2004",
        "dateOfIncident": "09/07/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10095278,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Britax Child Safety, Inc.",
                "productMake": "BRITAX",
                "productModel": "BRITAX",
                "productYear": "9999",
                "type": "Child Seat"
            }
        ],
        "summary": "UPON CONTACTING THE MANUFACTURER  ON SEPTEMBER 7, 2004 CONSUMER WAS TOLD THERE WAS A RECALL, AND THAT SHE WOULD RECEIVE THE REPLACEMENT ADJUSTOR STRAP. HOWEVER, BRITAX DID NOT SEND THE REPLACEMENT. CONSUMER MADE ANOTHER CALL TO BRITAX, AND THERE WAS NO INDICATION THAT SHE EVER CALLED.  SAFETY SEAT INFORMATION: MARATHON, SERIAL# E9L06057760, BATCH#503780, MANUFACTURED IN 03-17-03. *AK",
        "vin": "JF1SG65673G"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "09/13/2004",
        "dateOfIncident": "09/13/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10091893,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DEALERSHIP REPLACED THREE TIMES THE WINDSHIELD DUE TO CRACKS.  *AK",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/09/2004",
        "dateOfIncident": "06/09/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10080671,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 SUBARU FORESTER - MANUAL TRANSMISSION.  PERIODIC CLUTCH SHUDDER WHEN DRIVING.*AK",
        "vin": ""
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "07/06/2004",
        "dateOfIncident": "07/01/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10081850,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "KEYLESS ENTRY REMOTE BECAME INOPERATIVE.*MR  THE CONSUMER STATED 80 TO 90% OF THE TIME THE KEYLESS DID NOT WORK.  THE SYSTEM WAS REPLACED TWICE WITH AN AFTERMARKET SYSTEM. THE SECOND SYSTEM HAS ONLY FAILED ONCE.  *JB   *SC",
        "vin": "JF1SG65643H"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/30/2004",
        "dateOfIncident": "06/29/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10079074,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Yokohama Tire Corporation",
                "productMake": "YOKOHAMA",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TIRE EXPLOSION WHILE DRIVING ON FREEWAY.  NO ACCIDENT ENTAILED.  TIRE SHOWS GOOD TREAD LEFT, AND NO APPARENT SOURCE OF PUNCTURE, HITTING ROAD HAZARD OR ANY OTHER DAMAGE.  TIRE WILL BE REPLACED . TIRE WAS STOCK ON NEW (2003 SUBARU FORESTER) VEHICLE WITH APPROX 20,000 MILES.  TIRE IS A YOKOHAMA GEOLANDER 900, P215/60R 94H WITH SERIAL NUMBER ON IT: C6288U-16.  I AM CONCERNED BECAUSE THE OTHER THREE TIRES ARE SAME TYPE.  WONDERING IF ANY DEFECTS LED TO FAILURE?*AK",
        "vin": ""
    },
    {
        "components": "VISIBILITY,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "06/14/2004",
        "dateOfIncident": "03/06/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10075374,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "type": "Child Seat"
            }
        ],
        "summary": "A ROCK HIT MY WINDSHIELD AND WITHIN 5 MIN THERE WAS A CRACK ACROSS THE ENTIRE BOTTOMOF THE GLASS, RADIATING DOWN INTO THE HEATING ELEMENT.  $975.   NE YEAR LATER, ANOTHER ROCK HIT THE WINDSHIELD AND ANOTHER CRACK RESULTED IN EXACTLY THE SAME POSITION.  IS THERE A FLAW IN THE SUBARU GLASS? I WILL HAVE THIS ONE REPLACED WITH AFTER MARKET GLASS WITHOUT THE HEATING ELEMENT. $632 .  *AK",
        "vin": "JF1SG65633H"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/21/2004",
        "dateOfIncident": "04/21/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10068644,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE ROTORS FAILED AT 15,000 MILES.  CONSUMER STATED THAT  2,000 MILES LATER THE ROTORS NEEDED TO BE REPLACED AGAIN. *AK",
        "vin": ""
    },
    {
        "components": "VISIBILITY,AIR BAGS,LATCHES/LOCKS/LINKAGES,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/10/2003",
        "dateOfIncident": "09/23/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10044678,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE POSED A SERIOUS SAFETY PROBLEM BECAUSE THE VEHICLE ONLY HAD ONE KEY HOLE, BUT HAD FIVE DOORS, THE CONSUMER WAS ABLE TO ACCESS THE VEHICLE THROUGH THE DRIVERS SIDE DOOR/KEY HOLE.  ONCE THE CONSUMER WAS IN THE VEHICLE A LOCK PAD ON THE DOOR ALLOWED FOR ENTRY THROUGH THE OTHER DOORS, OR A KEY REMOTE.  THE CONSUMER'S LOCK PAD ALSO DIDN'T WORK TEMPORARILY SO THE CONSUMER COULDN'T OPEN THE HATCH.  THE MANUFACTURER AND THE DEALER HAD NOT BEEN NOTIFIED OF THE PROBLEMS.   *JB   THE REMOTE ENTRY DEVICE DID NOT WORK TEMPORARILY SO THE CONSUMER HAD TO GAIN ACCESS WITH THE KEY TO THE ONLY HOLE ON THE DRIVER'S DOOR, BUT THEN THE POWER LOCKS FAILED SO THE CONSUMER HAD NO WAY TO OPEN THE HATCHBACK.  THERE WAS NO RELEASE FOR THE VEHICLE.  THE AIR BAG LIGHT WAS ON AND NEEDED A NEW HARNESS TO RE-FIX THE PROBLEM AND THE ODOMETER ALONG WITH THE SPEEDOMETER FAILED IMMEDIATELY AFTER THE CONSUMER HAD TAKEN OWNERSHIP.   *SCC  THE CONSUMER ALSO STATED THERE WAS A PROBLEM WITH THE POWER WINDOWS *JB",
        "vin": "JF1SG63653H"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/24/2003",
        "dateOfIncident": "11/24/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10047507,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CLUTCH JITTER; STARTED IMMEDIATELY: CLUTCH WAS REPLACED UNDER WARRANTY AT 11,900 MILES. SPOKE WITH COUSIN IN CANADA WHO BOUGHT THE SAME CAR THE SAME DAY. ALREADY HAS REPLACED CLUTCH ONCE AND IS HAVING TROUBLE AGAIN WITH JITTER.   VEHICLE STALLS FREQUENTLY UPON COLD START. COMPUTER WAS REMOVED FROM VEHICLE AND SENT BACK TO FACTORY TO BE RECALIBRATED AT 11,900.   *LA",
        "vin": "JF1SG636X3G"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/30/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10041973,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER NOTICED WHILE TRAVELING AIR BAG INDICATOR LIGHT STAYED  ON. DEALER HAD BEEN CONTACTED, TECHNICIAN COULD NOT DUPLICATE PROBLEM. *AK",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/29/2003",
        "dateOfIncident": "09/23/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10041821,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "HAD STARTED TO BRAKE IN ORDER SLOW DOWN VEHICLE AND FELT THE BRAKE PEDAL GOING TO THE FLOOR.  VEHICLE FAILED TO STOP RIGHT AWAY. HAD BEEN IN CONTACT WITH DEALERSHIP CONCERNING BRAKES. PROBLEM HAD NOT BEEN RESOLVED.*AK",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/24/2003",
        "dateOfIncident": "09/23/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10040509,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE VEHICLE WAS IN NEUTRAL IT SHUT DOWN, THEN VEHICLE ROLLED BACKWARDS. *AK",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "09/21/2003",
        "dateOfIncident": "08/09/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10039256,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2003 SUBARU FORESTER AND I WAS PULLING IN A PARKING SPOT AT A HORSE FARM,  WITH MY FOOT ON THE BRAKE AND THE CAR JUST ACCELERATED AND I HIT A TREE. I HAVE TRIED TO CONTACT SUBARU OF AMERICA AND THEY HAVE NOT CALLED ME BACK.  MY DEALER HAS REPLACED THE COMPUTER BUT IS NOT ABLE TO STATE THIS WILL RESOLVE THE PROBLEM. I HAVE PUT $305 FOR CAR RENTAL $250 DEDUCTIBLE FOR INSURANCE OUT OF MY POCKET NOT TO ALSO INCLUDE A DAY OF WORK MISSED DUE TO TRYING TO STOP CAR WITH BOTH FEET ON BRAKE AND BANGED BOTH KNEES. ALSO I CAN NOT EXPRESS THE FEAR THAT THIS HAS PUT IN ME BECAUSE THEY HAVE NOT GIVEN ME ANY REASONS OR ANSWERS. THEY JUST IGNORED THE WHOLE ISSUE . I DO KNOW OTHER SUBARU'S HAVE HAD THIS PROBLEM. MY FAMILY HAS BEEN BUY THESE CARS SINCE THE 80'S. I WOULD HAVE SWORN BY THIS COMPANY UNTIL NOW. I CAN NOT BELIEVE THEY WOULD DENY SUCH AN ISSUE. ARE THEY WAITING FOR SOMEONE TO BECOME SERIOUSLY HURT. I NOW CRY AT THE COMMERCIAL THAT STATES THE FORESTER IS THE SAFEST SUV. I TRUST MY DEALER BUT HOW CAN I BE SURE IF THEY REPLACED THE PROPER PARTS IF SUBARU WILL NOT EVEN ACKNOWLEDGE THE PROBLEM. MY DEALER HAS TRIED TO GO ABOVE AND BEYOND BUT CAN NOT STATE THAT REPLACEMENT WILL BE RESOLUTION. I DON'T FEEL MY INSURANCE OR MYSELF SHOULD BE PUT OUT DO TO A MECHANICAL PROBLEM THAT HAS BEEN BROUGHT TO THEIR ATTENTION BEFORE. I AN SCARED TO DEATH EVERY TIME I GET BEHIND THE WHEEL OF THIS CAR AND ANY OTHER CAR AT THIS TIME.*JB",
        "vin": "JF1SG636X3H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/21/2003",
        "dateOfIncident": "08/07/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10033278,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MANUAL TRANSMISSION.  CLUTCH SHUDDERS (CHATTERS) IN 1ST AND SOMETIMES 2ND GEAR.  PROBLEM OCCURS AFTER CAR HAS NOT BEEN USED FOR A WHILE (SUCH AS OVERNIGHT), AND ESPECIALLY IN THE MORNING.  CAR WAS BOUGHT USED WITH 14,000 MILES, AND HAD THIS PROBLEM FROM WHEN IT WAS BOUGHT.  DEALER REPLACED CLUTCH ASSEMBLY WHICH APPEARS TO HAVE REMEDIED THE PROBLEM.*AK",
        "vin": "JF1SG636X3G"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/30/2003",
        "dateOfIncident": "07/30/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10030465,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CLUTCH CHATTER, 1ST AND 2ND GEAR. 18000 MILES ON VEHICLE.  *AK",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/28/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10031286,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THERE IS A VERY LOUD BANGING NOISE COMING FROM THE RIGHT REAR TIRE.  VEHICLE WAS TOWED TO DEALER, DEALER IS REPLACING THE BEARINGS. *AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/24/2003",
        "dateOfIncident": "07/18/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10029067,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN STARTING THE ENGINE FIRST THING IN THE MORNING, THE ENGINE FUMBLES THEN STALLS.*AK",
        "vin": ""
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "07/22/2003",
        "dateOfIncident": "07/22/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10029898,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING ON THE HIGHWAY WITHOUT PRIOR THE DRIVER SIDE SEAT INTERMITTENTLY GO FORWARD AND BACKWARDS.  PLEASE FILL IN ADDITIONAL INFORMATION DEALER IS AWARE OF THE PROBLEM.",
        "vin": "JF1SG636738"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,PARKING BRAKE",
        "crash": false,
        "dateComplaintFiled": "06/11/2003",
        "dateOfIncident": "06/11/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10022861,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE EMERGENCY BRAKE WAS ENGAGED, CONSUMER DROVE THE VEHICLE, AND BURNED OTHER PART OF THE REAR  BRAKE SYSTEM. DEALER REPLACED DRUM AND WHEEL CYLINDER. *AK",
        "vin": "JF1SG63623H"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "05/03/2003",
        "dateOfIncident": "05/01/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10016975,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT PASSENGER SEAT LOOSE WHEN BRAKING, SEAT MOVES FORWARD. WHEN STEPPING ON GAS PEDAL SEAT TRAVELS BACKWARD.    *JB",
        "vin": "JF1SG63673H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/18/2003",
        "dateOfIncident": "02/01/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10017140,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONSUMER RECEIVED RECALL 02V282000.  THE VEHICLE HAS BEEN TAKEN TO THE DEALER FOR 4 DIFFERENT REPAIR APPOINTMENTS.  ON 3 DIFFERENT INSTANCES THE SERVICE TECHNICIAN WAS NOT AVAILABLE ONCE CONSUMER ARRIVED FOR APPOINTMENT.  ONE 1 OCCASION, CONSUMER CAME IN FOR SATURDAY APPOINTMENT AND WAS TOLD RECALL REMEDY COULD NOT BEEN PERFORMED ON SATURDAY.  NOW,  CONSUMER WILL NOT BE ABLE TO BRING VEHICLE BACK FOR ANOTHER 3 MONTHS.   *NLM",
        "vin": "JF15G63683H"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "03/20/2003",
        "dateOfIncident": "01/15/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10010778,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 SUBARU FORESTER FRONT DOOR LOCK MECHANISMS ARE DEFECTIVE.  JANUARY, 2003 - PASSENGER DOOR WOULD NOT LATCH AND HAD TO TIE IT SHUT.  DEALER REPAIRED IT PROMPTLY.  MARCH 2003 - DRIVERS DOOR WOULD NOT OPEN - HAD TO CRAWL ACROSS THE SHIFTER TO GET OUT.  MANIPULATED INSIDE LOCK LEVER AND EVENTUALLY FREED UP MECHANISM.  THIS WOULD NOT BE SAFE IN AN EMERGENCY.*JB",
        "vin": "JF1SF65682H"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/17/2003",
        "dateOfIncident": "02/14/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10011889,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERMITTENT STALLING. *JB. *AK",
        "vin": "JF1SG63673G"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/06/2003",
        "dateOfIncident": "03/06/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10008519,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MANUAL CLUTCH CHATTERS. MAINLY 1ST AND 2ND GEAR, ONLY AFTER SITTING FOR LONG PERIODS OF TIME (6-12 HRS). STARTED EARLY, AROUND 7,000 MILES.  FIRST TIME I COMPLAINED ABOUT IT, SUBARU SAID THAT I WASN'T DRIVING IT PROPERLY.  3RD TIME I REPORTED IT (AT 15,000 MI), SUBARU ACKNOWLEDGED THE PROBLEM AND THEY ARE NOW GOING TO REPLACE THE CLUTCH. THEY SAID THAT THEY WOULD NOT REPLACE IT WITH A HEAVIER DUTY CLUTCH SO THE PROBLEM MAY OCCUR AGAIN.     *JB",
        "vin": "JF1SG65663G"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/12/2003",
        "dateOfIncident": "02/04/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10005753,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "HEATER AND DEFROSTER FAILURE",
        "vin": "JF1SG63623H"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/26/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8023388,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER CALLED COMPLAINING ABOUT HAVING PROBLEMS WITH THE BRAKES . ALSO STATES THAT WHILE SHE IS DRIVING AND STEPS ON THE BRAKE PAD THE BRAKE PAD FEELS LIKE IF SOMETHING IS ABSORBING THE PAD. DEALER WAS CONTACTED AND STATED THAT IS NORMAL BECAUSE A NEW BRAKE SYSTEM. TS",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/21/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 566337,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HILL-HOLDER FEATURE ON THE MANUAL TRANSMISSIO ACTIVATES WHILE BACKING INTO A PARKING SPACE AND UTILIZING THE FOOT BRAKE--AS A RESULT IN ORDER TO RESUME BACKING UP TOO MUCH FORCE ON THE ACCELERATOR PEDAL MUST BE USED CAUSING THE VEHICLE TO LURCH BACKWARD",
        "vin": "JF1SG65693G"
    },
    {
        "components": "AIR BAGS,SEATS",
        "crash": false,
        "dateComplaintFiled": "06/26/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8012678,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "SUBARU REPLACED REGULAR SEATS WITH LEATHER AFTER MARKET SEATS.  ALSO,  SUBARU STATED THAT SIDE IMPACT AIR BAGS IN REAR MAY NOT DEPLOY PROPERLY.  PLEASE DESCRIBE DETAILS.*AK",
        "vin": "JF1SG656X3H"
    }
]