[
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/22/2019",
        "dateOfIncident": "02/01/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11181970,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS RECALLED IN APPROXIMATELY 2009 FOR A FUEL LEAK WHICH COULD CAUSE AND ENGINE FIRE. I KNOW BECAUSE I'VE OWNED THIS CAR I BOUGHT IT NEW IN 2003.  THE PROBLEM HAS REOCCURRED.  TO FIX IT, THE INTAKE MANIFOLD HAD TO BE REMOVED AND 3 SHORT FUEL LINES HAD TO BE REPLACED.  WORK WAS DONE BY ALPINE AUTOMOTIVE IN LAKE ZURICH, ILLINOIS.  I'VE REACHED OUT TO SUBARU WHO SAY THEY KNOW OF NO ISSUE.  HOWEVER, I FOUND AN ARTICLE  PUBLISHED IN 2009 IN US NEWS & WORLD REPORT, SAYING THAT THE WARRANTY FOR THIS ISSUE WAS BEING EXTENDED BY 12 YEARS , WHICH PUTS THE CAR STILL IN WARRANTY FOR THIS ISSUE..  *BF",
        "vin": "JF1GG29653G"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/17/2018",
        "dateOfIncident": "01/02/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11063189,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL LEAKING ONTO MY ENGINE BLOCK COULD RESULT IN MY CAR ENGULFING IN FLAMES, NO RECALL FOR IT ON MY CAR BUT I SEE IT EVERYWHERE AND IT'S A SUPER COMMON PROBLEM. THE CABIN OF THE CAR ALWAYS SMELLS LIKE GAS USUALLY IN THE COLD, BUT WHEN I SMELL THE ENGINE IT SMELLS BADLY OF RAW GASOLINE.",
        "vin": "JF1GD29653G"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/16/2017",
        "dateOfIncident": "11/09/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11015766,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 SUBARU WRX. THE CONTACT NOTICED A STRONG FUEL ODOR INSIDE THE VEHICLE. THE VEHICLE WAS TAKEN TO BYERS AIRPORT SUBARU (LOCATED AT 401 N HAMILTON RD, COLUMBUS, OH 43213). THE DEALER WOULD NOT REPAIR THE VEHICLE PER NHTSA CAMPAIGN NUMBER: 09V468000 (FUEL SYSTEM, GASOLINE). THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND DEMANDED THE DEALER TO REPAIR THE VEHICLE; HOWEVER, THE VEHICLE WAS NOT REPAIRED. THE CONTACT WAS ADVISED THAT THE RECALL HAD EXPIRED AND HE WOULD HAVE TO PAY FOR THE REPAIR. THE FAILURE MILEAGE AND VIN WERE UNKNOWN.  UPDATED 10/24/17*LJ UPDATED 10/25/2017*JS",
        "vin": "JF1GD29663G"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/04/2015",
        "dateOfIncident": "10/30/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10788271,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN IT GET COLD OUT, THE FUEL LINE STARTS LEAKING AND THERE IS THE SMELL OF GAS IN THE CAR.  THERE HAS BEEN A LIMITED RECALL FOR THIS ISSUE DEPENDING ON WHERE THE VEHICLE WAS PURCHASED.  I LIVE IN A STATE NOT INCLUDED IN THE RECALL AREA.  THIS DOESN'T CHANGE THE FACT THAT IT IS A SERIOUS SAFETY ISSUE AND THE MANUFACTURER SHOULD CORRECT IT NO MATTER WHAT STATE I LIVE IN (ILLINOIS).  THIS IS CLEARLY A MANUFACTURER'S DEFECT AND ASK THAT THEY FIX THIS ISSUE.",
        "vin": "JF1GG29683H"
    },
    {
        "components": "STEERING,VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "06/12/2015",
        "dateOfIncident": "09/20/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10725033,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DREAM CAR DEMOLISHED IN SPLIT SECOND. COULD HAVE VERY EASILY DIED AS WELL AS MY PASSENGER. I LOOKED UP THE RECALLS WHEN I GOT THE CAR AND IT WAS NOT LISTED YET, THE STEEL FRONT CONTROL ARMS IN THE SNOW BELT STATES RUST OUT AND CAUSE THE VEHICLE TO LOOSE CONTROL AND OR CRASH. WELL IT DID BOTH TO ME AS WELL AS EXCELERATE MY CAR. I WAS ON A DATE THAT NIGHT FOR THE FIRST TIME IN A WHILE. AND ON OUR WAY HOME, WE WERE COMING AROUND A SLIGHT BEND, I WAS GOING PROBABLY 35-40 MPH AND RIGHT WHEN I TURNED THE STEERING WHEEL GOING AROUND THE BEND I HEARD A CRACK/THUD NOISE AND INSTANTLY I SWEAR ON MY DADS GRAVE THAT THE CAR ACCELERATED, IT WAS OBVIOUSLY OUT OF CONTROL, I COULD NOT STOP THE CAR IT KEPT GOING THE SAME WAY AS THE TURN, AND HIT AN EMBANKMENT ABOUT 3 1/2 FEET TALL THE FRONT DOOR OPENED SOMEHOW WHEN I HIT. IT BENT THE COMPLETE DOOR UP AND LOOKED LIKE A LAMBORGHINI DOOR. LUCKILY WE HAD ARE SEAT BELTS ON! THE CAR THE PROCEEDED TO FLIP ON TO ITS ROOF. BACK, FRONT SIDE WINDOWS BLOWN OUT. BOTH UPSIDE DOWN IN AWE. MADE SURE SHE WAS OK. SHE WAS CUT UP ON HER ARM AND HAD SEATBELT MARKS. AS FOR ME I KNOW I HIT MY HEAD BAD BUT I DON'T EVEN REMEMBER, IT HAPPENED SO FAST AND UNPREDICTABLE! I HAD THAT CAR PAID OFF. LOVED IT SO MUCH BUT I'M VERY DISAPPOINTED I WAS NEVER AWARE OF THE RECALL. I LOOKED UP MY VIN THE DAY OR SO AFTER, AND IT SAID THE CONTROL ARMS WERE NEVER REPLACED. A MONTH OR SO LATER I CHECK AGAIN, AND IT SAYS THEY WERE FIXED.. NOW COME ON, THAT'S A LITTLE WEIRD AND CONVIENENT IF I SO HAPPENED TO SUE SUBARU. I ALSO HAD MY CAR AT A LOCAL SUBARU DEALER 3 MONTHS BEFORE FOR A OVERALL MAINTENANCE CHECK AND LOOK OVER... WHY DID THEY NOT KNOW, WHY DID THEY NOT EVEN SEE THE CORROSION. I WAS SO IN SHAMBLES AFTER THE WRECK, THAT WHEN THE INSURANCE GUY CAME TO LOOK AT MY CAR IT WAS TOTALED OBVIOUSLY. I TRIED POINTING OUT WHAT HAPPENED, HE REALLY COULD OF CARED LESS.",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/07/2015",
        "dateOfIncident": "01/07/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10670820,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "IN COLD WEATHER THE FUEL LINES LEAK ON THE 2003 SUBARU IMPREZA WRX!  THERE WAS A LIMITED RECALL IN CERTAIN NORTHERN STATES, HOWEVER IT GETS COLD IN MANY STATES WHERE THERE WAS NO RECALL.  THE CAR HAS BECOME DANGEROUS TO DRIVE B/C I CAN SMELL THE GAS WHICH MEANS THERE IS THE DANGER OF IGNITION.  SUBARU KNOWS OF THIS ISSUE AND SHOULD ISSUE A RECALL FOR ALL CARS AFFECTED.    *TR",
        "vin": "JF1GG29653G"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/04/2014",
        "dateOfIncident": "02/03/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10562885,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THE MORNING OF FEB 3, 2014 I STARTED MY CAR AND IT SMELLED VERY STRONGLY OF RAW GAS. I TURNED OFF THE CAR AND HAD IT TOWED TO MY LOCAL REPAIR SHOP. THE TOW COST $84.70.     I FOUND OUT LATER THAT MORNING THAT SUBARU ISSUED A RECALL BEGINNING DECEMBER 31, 2009 FOR 2002 AND 2003 SUBARU WRXS WHERE THE FUEL LINE LEAKS IN EXTREME COLD. UNFORTUNATELY, THE RECALL INCLUDED ONLY 16 STATES, AND OFFERED AN EXTENDED WARRANTY TO THE OTHER 34 STATES NOT NAMED IN THE RECALL (I RESIDE IN ONE OF THE 34 FOR THE \"EXTENDED WARRANTY\").     I PROMPTLY PHONED SUBARU OF AMERICA AND MY LOCAL DEALERSHIP, WEBSTER GROVES SUBARU ABOUT THE ISSUE. THE SERVICE DEPARTMENT EMPLOYEE, [XXX], ADVISED ME TO DRIVE MY VEHICLE OVER TO HAVE IT CHECKED OUT. CONSIDERING THIS IS TALKING ABOUT RAW GAS AND AT LEAST ONE FIRE HAS BEEN REPORTED IN RELATION TO THE RECALL, I DO NOT AGREE WITH THIS SUGGESTION. BOTH SUBARU OF AMERICA AND THE DEALERSHIP AFFIRMED THAT THE CAR WOULD HAVE TO BE TAKEN TO A DEALERSHIP TO SEE IF IT MIGHT BE CONSIDERED FOR THE RECALL. AFTER DIRECTLY TELLING [XXX] I WILL NOT DRIVE THE VEHICLE SINCE IT IS DANGEROUS (THE RECALL EVEN STATES THAT IT IS DANGEROUS!), SHE AGREED TO CALL HER DISTRICT MANAGER THEN RETURN MY CALL.     THIS IS NOT THE WHOLE OF MY CONCERN. WE HAVE HAD COLDER WEATHER ALL OVER THE UNITED STATES THIS YEAR AND I AM VERY CONCERNED ABOUT THIS ISSUE. I WAS NOT NOTIFIED OF THE EXTENDED WARRANTY OR THE ISSUE BY SUBARU, AND I GATHER OTHER INDIVIDUALS WERE NOT AS WELL AND THEIR SAFETY COULD BE AT RISK. WHILE IT WOULD BE IDEAL FOR SUBARU TO PAY FOR THE NECESSARY REPAIRS TO MY VEHICLE, I ULTIMATELY HOPE THEY WILL NOTIFY ALL 2002 AND 2003 SUBARU WRX OWNERS OF THIS POTENTIAL HAZARD FOR THE SAFETY OF EVERYONE! THIS IS NOT JUST A SMALL OPTIONAL RECALL, BUT ONE THAT COULD CAUSE SERIOUS HARM TO DRIVERS, THEIR PASSENGERS AND FELLOW DRIVERS.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/24/2010",
        "dateOfIncident": "06/19/2010",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10339906,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 SUBARU WRX. THE CONTACT STATED THE VEHICLE BEGAN LEAKING OIL FROM THE AVCS LINE AND WOULD LEAK ONTO THE MANIFOLD, CREATING A FIRE HAZARD. THE MANUFACTURER ADVISED THERE WERE NO RECALLS FOR THE FAILURE AND ANY REPAIRS WOULD BE THE CONTACT'S EXPENSE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGES WERE APPROXIMATELY 31,000.",
        "vin": "JF1GD29643G"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/06/2010",
        "dateOfIncident": "01/05/2009",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10298393,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL LINE LEAKS RAW GASOLINE FUMES INTO PASSENGER COMPARTMENT AND OUTSIDE OF VEHICLE DURING COLD WEATHER. GAS FUMES ARE OVERPOWERING INSIDE THE VEHICLE, AND POSSIBLY CREATES A SERIOUS SAFETY HAZARD OF FIRE/ EXPLOSION. *TR",
        "vin": "JF1GG29643H"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/25/2009",
        "dateOfIncident": "08/15/2009",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10293620,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "OCCASIONALLY MY WRX SMELLS LIKE RAW GAS. THREE TIMES WHEN I HAVE BEEN DRIVING TO MT. LEMON, UP A VERY STEEP ROAD, I HAVE HAD A VERY STRONG (UNBEARABLE) GAS SMELL ENTER THE CAR. I TOOK IT INTO THE DEALER AND WAS TOLD THAT I AM JUST \"OVERFILLING THE TANK,\" HOWEVER, I NEVER TRY TO FILL THE TANK BEYOND THE AUTOMATIC SHUTOFF POINT ON THE GAS PUMP. I HAVE ALSO SMELLED GAS OCCASIONALLY WHEN DRIVING BUT NEVER AS STRONG AS WHEN I DRIVE TO MT. LEMON. *TR",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "11/17/2009",
        "dateOfIncident": "02/15/2009",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10292632,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Kumho Tire Co., Inc.",
                "productMake": "KUMHO",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "THERE HAS BEEN NO ACCIDENT OR CRASH. THIS IS AN ONGOING SAFETY PROBLEM WITH A MODEL OF TIRES. THE TIRES ARE KUMHO SPT 225/45R-17.     THESE TIRES HAVE SERIOUS DIRECTIONAL STABILITY ISSUES. THEY MAKE THE CAR VERY SCARY TO DRIVE IN CROSS WINDS. IN CORNERS, THE CAR ALWAYS FEELS LIKE IT IS SQUIRMING AROUND AND YOU NEVER REALLY KNOW WHAT DIRECTION IT IS GOING TO GO. I'VE ALIGNED THE CAR TWICE, BOTH TIMES ADDING MORE REAR TOE IN TO INCREASE STABILITY. THIS HAS HAD ALMOST NO EFFECT. I'VE TRIED A NUMBER OF DIFFERENT TIRE PRESSURES. HIGHER PRESSURES (ABOVE 40PSI) HELP, BUT DO NOT FIX THE PROBLEM. I'VE USED SEVERAL OTHER TYPE AND BRAND OF TIRES ON THE CAR AND NEVER HAD ANY STABILITY ISSUES WITH ANY OF THEM. THERE IS NO PROBLEM WITH ANY OF THE COMPONENTS IN THE SUSPENSION SYSTEM.     I'VE SPENT OVER ONE MONTH WITH KUMHO TRYING TO RESOLVE THIS PROBLEM WITH THE TIRES. IN THAT TIME, I HAVE RECEIVED A SINGLE ONE SENTENCE RESPONSE TO MY E-MAILS. KUMHO HAS REPEATEDLY NOT RETURNED THE MAJORITY OF MY PHONE CALLS TO RESOLVE THIS PROBLEM. APPARENTLY THEY DO NOT THINK THERE IS A PROBLEM WITH THE TIRES, AS THEY HAVE ABSOLUTELY NO INTEREST IN HELPING TO FIGURE OUT THE PROBLEM OR EVEN LOOKING AT THE TIRES. *TR",
        "vin": "JF1GD29623G"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/12/2009",
        "dateOfIncident": "11/05/2008",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10291926,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 SUBARU WRX, RAW FUEL SMELL IN CABIN BEFORE ENGINE IS WARM AND COOLANT TEMPERATURES ARE WARM. HAPPENS INFREQUENTLY BUT WOULD LIKE TO GET RID OF THE SMELL. SEEMS LIKE IT'S A POPULAR PROBLEM FOR THE CARS IN THIS PRODUCTION RANGE. FIRST NOTICED IT ON THE DATE SHOWN BUT OCCURS MORE OFTEN WHEN TEMPERATURES ARE BELOW 50F. *TR",
        "vin": "JF1GD29613G"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/29/2009",
        "dateOfIncident": "12/10/2008",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10290208,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2003 SUBARU WRX WAGON.  AS TEMPERATURES APPROACH FREEZING THE  FUEL LINES ON THE PASSENGER SIDE OF THE ENGINE BEGIN TO LEAK, HEAVILY, DURING COLD START UP.  THIS CAUSES RAW FUEL SMELL TO ENTER THE CABIN AS WELL AS CREATING A POTENTIALLY HAZARDOUS SITUATION WITH RAW FUEL OPENLY POOLING ON THE ENGINE. SUBARU AND THEIR DEALERS ARE AWARE OF THE SITUATION AND IT IS FIXABLE, HOWEVER IT REQUIRES REMOVAL OF THE INTAKE MANIFOLD - A VERY LABOR INTENSIVE JOB - WHICH MAKES IT A COSTLY REPAIR FOR THE CONSUMER TO BEAR.  I ACQUIRED THE CAR LAST YEAR AND THE PROBLEM OCCURRED THROUGHOUT LAST WINTER AND HAS RECURRED ALREADY ONCE THIS FALL. *TR",
        "vin": "JF1GG296X3G"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/13/2009",
        "dateOfIncident": "01/10/2009",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10261738,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I WOULD LIKE TO FILE THIS COMPLAINT AFTER READING ALL OF THE COMPLAINTS RELATED TO THE SAME PROBLEM I AM HAVING WITH MY 2003 SUBARU WRX. VERY STRONG RAW GASOLINE FUMES INSIDE THE PASSENGER COMPARTMENT DURING COLD WEATHER STARTUP. I AM THE ORIGINAL OWNER OF THIS CAR. THIS PROBLEM JUST STARTED THIS WINTER. YES SUBARU OF AMERICA IT'S HAPPENING ON THE 2003 MODELS ALSO. I WOULD APPRECIATE SOME DIRECTION AS HOW TO PROCEED WITH THIS DEVELOPING SAFETY PROBLEM WITH MY CAR. THANK YOU. *TR",
        "vin": "JF1GD29643G"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/17/2009",
        "dateOfIncident": "02/16/2009",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10258934,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TOOK MY VEHICLE IN FOR ROUTINE MAINTENANCE WHEN IT WAS FOUND TO HAVE A SIGNIFICANT GAS LEAK.  SPECIFICALLY THE FUEL RAIL HAD SOMETHING LIKE 16 LEAKS.  WHILE I NEVER HAD AN ENGINE FIRE THE POSSIBILITY FOR THAT HAPPENING WAS VERY REAL.  THIS IS MY FAMILY CAR, WHICH I TRANSPORT MY CHILDREN IN.  FROM READING OTHER EXPERIENCES ABOUT THIS I HAVE FOUND IT TO BE A FLAW IN DESIGN WITH THE 2003 SUBARU WRX.  I WOULD HOPE THAT SUBARU WOULD VALUE ITS CUSTOMERS SAFETY AND MAKE A SAFETY RECALL ABOUT THIS ISSUE. *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/07/2008",
        "dateOfIncident": "12/04/2008",
        "fire": true,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10251008,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2003 SUBARU WRX. MY CAR STARTED TO SMELL LIKE SOMETHING WAS BURNING A FEW DAYS AGO IN THE ENGINE BAY. I HAVE ALSO NOTICED THAT WHEN THE TEMPERATURE GOES BELOW 30 DEGREES THE INSIDE CABIN STARTS TO STRONGLY SMELL LIKE RAW FUEL. THE VAPORS CAN CAUSE HARMFUL AND EVEN DEADLY CONSEQUENCES. I HAVE DONE SOME RESEARCH ON THIS ISSUE AND IT SEEMS THAT ITS A WIDELY COMMON ISSUE WITH SUBARU WRX'S FROM 2002 TO 2004. I TOOK THE CAR TO A MECHANIC SHOP AND GOT THE CAR EXAMINED. THE MECHANIC TOLD ME THAT THE CLAMPS THAT HOLD THE GAS LINES INTACT WERE VERY LOOSE. HE SAID THAT THE DURING HIGH FUEL PRESSURE THE FUEL LINES COULD SEPARATE AND CAUSE A ENGINE FIRE. I HAVE CALLED SUBARU OF AMERICA AND THEY TOLD ME THERE'S A BULLETIN ON THIS ISSUE. IT SEEMS THAT THIS CAN BE A VERY DANGEROUS SAFETY ISSUE, AND IT SOUNDS TO ME THAT SUBARU OF AMERICA IS NOT WILLING TO REPAIR THE $500 ISSUE. I HAVE NOTICED THAT THERE WAS ANOTHER FUEL ISSUE WITH ANOTHER SUBARU MODEL (NHTSA CAMPAIGN ID NUMBER:  03V303000). THE SUBARU OUTBACK HAD A RECALL BECAUSE THERE WAS A LOOSE CLAMP AT THE FILLER CAP THAT COULD HAVE CAUSED A FUEL LEAK. WHY IS THERE NO RECALL FOR THE FUEL LEAK IN THE WRXS? THE LEAK HAPPENS VERY CLOSE TO THE ENGINE. ANY TYPE OF HEAT OR IGNITION COULD CAUSE A FIRE OR EVEN DEATH! PLEASE RESEARCH THIS ISSUE AS IT COULD BECOME A VERY DANGEROUS PROBLEM! *TR",
        "vin": "JF1GD29603G"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/18/2008",
        "dateOfIncident": "11/01/2006",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10242845,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM WRITING WITH RESPECT TO THE INVESTIGATIONS CONCERNING FUEL LEAKS IN THE 2002-2003 MODELS OF THE SUBARU IMPREZA WRX MODELS.  I PURCHASED A WRX IN FEBRUARY OF 2003.  LIKE OTHER REPORTS, MY CAR INITIALLY EMITTED A FUEL ODOR ONLY ON COLD DAYS.  I TOOK THE CAR TO MY LOCAL SUBARU DEALERSHIP, BEL AIR SUBARU, TO HAVE THE PROBLEM INVESTIGATED.  THEY INFORMED MY THAT I HAD A FAULTY FUEL LINE, REPLACED THE FUEL LINE, AND CHARGED ME $800.00.  THE FOLLOWING WEEK I STILL SMELLED FUEL.  I TOOK THE CAR BACK TO THE DEALERSHIP; THEY INFORMED ME THAT THEY COULD NOT FIND ANOTHER LEAK.  I WAS TOLD BY THE SALES MANAGER TO \"WAIT FOR THE PROBLEM TO FULLY MANIFEST ITSELF.\"  IN THE MEANTIME, I RESEARCHED THE ISSUE ON YOUR WEBSITE.  MY INTERPRETATION OF THE REPORT WAS THAT THIS WAS NOT A SAFETY CONCERN, SO I INITIALLY DROPPED THE ISSUE.  HOWEVER, AS THE PROBLEM PROGRESSED, THE FUEL LEAK BEGAN TO OCCUR EVEN IN WARM WEATHER AND EVEN WHEN THE ENGINE WAS WARM.  NOW, APPROXIMATELY 18 MONTHS FROM THE INITIAL REPAIR, I AM BEING TOLD BY THE DEALERSHIP THAT I HAVE A LEAK IN MY FUEL HOSES.  THE DEALERSHIP INSISTS THAT THIS IS A SEPARATE REPAIR ISSUE THAT DID NOT EXIST WHEN THEY LOOKED AT THE CAR THE FIRST TIME.  AGAIN, I HAVE BEEN QUOTED A PRICE OF $800.00 TO HAVE THE PROBLEM FIXED.  I AM RELUCTANT TO SPEND $800.00 MORE DOLLARS TO TRY TO ELIMINATE THE FUEL LEAK AFTER THE RESULTS I GOT LAST TIME.  IN LIGHT OF THE FACT THAT THE FUEL LEAKS IN THESE VEHICLES PROGRESS TO A LEAK THAT IS NO LONGER SIMPLY A COLD WEATHER PROBLEM, IS THIS NOW CONSIDERED A SAFETY ISSUE?  SUBARU HAS BEEN UNHELPFUL IN HELPING ME SOLVE THIS DILEMMA.  CAN YOU HELP?   *TR",
        "vin": "JF1GD29663G"
    },
    {
        "components": "STEERING,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/20/2008",
        "dateOfIncident": "08/19/2008",
        "fire": true,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10239073,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I PULLED INTO A PARKING SPACE, THE ENGINE DIED AND FLAMES ABOUT 2' TALL SHOT OUT FROM BETWEEN THE HOOD AND COWL AND OUT OF THE INTERCOOLER INLET IN THE CENTER OF THE HOOD. THE FLAMES WERE FOLLOWED BY ABOUT 10 SECONDS OF A HUGE SMOKE CLOUD. IT TOOK ME ABOUT 90 SECONDS TO GET A FIRE EXTINGUISHER AND GET THE FIRE PUT OUT.     I EXAMINED THE DAMAGE. THE PRESSURE SIDE POWER STEERING HOSE WAS RUBBING AGAINST THE SHEET METAL HEAT SHIELD OVER THE TURBOCHARGER. AFTER A WHILE, THE RELATIVE MOTION AND HEAT RUBBED A HOLE IN THE POWER STEERING HOSE. THE POWER STEERING HOSE THEN PUMPED POWER STEERING FLUID ALL OVER THE TURBOCHARGER, EXHAUST MANIFOLD, HEAT SHIELDS, HOOD, FIREWALL, ETC. WHEN THE POWER STEERING FLUID HIT THE HEAT SHIELDS AND EXHAUST, IT STARTED BURNING AND THIS CAUSED THE FIRE.     I HAVE NOT FINISHED REPAIRING THE VEHICLE YET SO I DON'T KNOW THE COMPLETE EXTENT OF THE DAMAGE. AT THIS POINT, AT LEAST THE POWER STEERING HOSE AND FLUID NEED TO BE CHANGED.     THE PRESSURE SIDE POWER STEERING HOSE HAS NO BRACKETS TO HOLD IT IN POSITION WITHIN ABOUT 1' OF THE TURBOCHARGER HEAT SHIELD. THE OUTSIDE OF THE HOSE IS RUBBER. THERE IS NO HEAT SHIELD OVER IT. IT IS GUARANTEED TO RUB AGAINST THE HEAT SHIELD AND FAIL THIS WAY. THE POWER STEERING RETURN HOSE ALSO HAS NO BRACKETS WITHIN 1' OF THE TURBOCHARGER HEAT SHIELD, BUT IT DOES AT LEAST HAVE A CORRUGATED ALUMINUM HEAT SHIELD OVER IT.  *TR",
        "vin": "JF1GD29623G"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/14/2008",
        "dateOfIncident": "07/01/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10214827,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CRUISE CONTROL UNIT ON MY CAR WILL CAUSE THE THROTTLE TO REMAIN OPEN, EVEN IF THE CRUISE IS TURNED OFF. THIS CAN RESULT IN ANYTHING FROM HIGHER THAN NORMAL IDLE TO RANDOM INSTANCES OF WIDE OPEN, UNCONTROLLED ACCELERATION. THE CAR HAS BEEN TO 2 DIFFERENT SUBARU DEALERS FOR A TOTAL OF 7 TIMES OVER THE COURSE OF 5 YEARS, AND THE PROBLEM HAS YET TO BE RESOLVED. ALL APPLICABLE TSB'S AND RECALLS HAVE BEEN PERFORMED, BUT PROBLEM STILL OCCURS.   *TR",
        "vin": "JF1GD29623G"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/16/2007",
        "dateOfIncident": "03/30/2006",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10188063,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SIDE FLOOR MAT WILL NOT STAY IN METAL ROD DESIGNED TO KEEP THE MAT FROM GOING FORWARD.  MAT SLIDES UNDERNEATH THE PETALS AND HAS WORN THE UPHOLSTERY ON THE FLOOR AS WELL.  PROBLEM HAS NOT BEEN FIXED AS I DO NOT HAVE THE MONEY TO GET IT REPAIRED.    *JB",
        "vin": "JF1GG296X3G"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/31/2007",
        "dateOfIncident": "01/31/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10181274,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2003 SUBARU IMPREZA WRX WAGON. ON COLD MORNINGS (LIKE TODAY: 3F), THERE IS A RAW FUEL SMELL IN THE PASSENGER COMPARTMENT. I'VE TALKED TO OTHER IMPREZA OWNERS THAT HAVE EXPERIENCED THE SAME PROBLEM, APPARENTLY THERE IS A DESIGN FLAW INVOLVING A FLEXIBLE FUEL HOSE CONNECTING THE RIGID FUEL LINES. I'VE JUST TRIED CONTACTING SUBARU OF AMERICA (SOA) REGARDING THIS PROBLEM, BUT THEY SEEM TO BE FIGHTING MANY OWNERS ON COVERING THIS OBVIOUS SAFETY ISSUE.",
        "vin": "JF1GG29663G"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/28/2007",
        "dateOfIncident": "01/28/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10180944,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "RAW FUEL SMELL IN PASSENGER COMPARTMENT OF 2003 SUBARU IMPREZA WRX, A KNOWN PROBLEM ON 2002 SUBARU IMPREZA WRX WITH FUEL PIPES/HOSES/CLAMPS.  DEALERS DENY THERE IS A  PROBLEM FOR 2003 MODELS.  *NM",
        "vin": "JF1GG29643H"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/27/2007",
        "dateOfIncident": "01/25/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10180870,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "STRONG GAS SMELL IN THE CABIN ON A COLD DAY PROBABLY A GAS LEAK.  STRONGER WHEN VEHICLE IS STOP.   SMELL ENOUGH TO GET A GOOD HEADACHE AND DIZZY.  *NM",
        "vin": "JF1GD29613G"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/25/2007",
        "dateOfIncident": "01/18/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10180758,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS SMELL COMING THROUGH AIR VENTS OF 2003 SUBARU WRX WHEN VEHICLE IS STOPPED WITH OUTSIDE AIR VENTS OPEN.  PROBLEM IS INTERMITTENT.  NHTSA HAS A SIGNIFICANT NUMBER OF COMPLAINTS OF THIS SAME PROBLEM IN 2002-2003 WRX MODELS, AND A SIGNIFICANT NUMBER OF INTERNET AUTOMOTIVE WEBSITES DISCUSS THIS PROBLEM.  SINCE GASOLINE IS FLAMMABLE, AND AUTOMOBILE FIRES ARE DANGEROUS, I AM REQUESTING NHTSA TO REOPEN ITS FILE ON THIS MATTER AND TO ISSUE A RECALL SINCE NHTSA HAS ALREADY FOUND THAT A FUEL HOSE ON THE ENGINE, IN CLOSE PROXIMITY TO THE EXHAUST MANIFOLD, IS LEAKING.     *JB",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "12/11/2006",
        "dateOfIncident": "12/11/2006",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10175870,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN USING WINDSHIELD WIPERS IN THE RAIN, DRIVER SIDE WINDSHIELD WIPER ARM SLIDES PAST AREA OF WINDSHIELD AND GETS STUCK ON SIDE PILLAR.  THIS HAS HAPPENED FIVE TIMES ON THE SAME TRIP WHILE DRIVING AT SPEEDS OVER 50 M.P.H. ON FREEWAY.  WINDSHIELD WIPERS THEN BECOME INOPERABLE UNTIL WIPER ARM IS FREED FROM SIDE PILLAR. FREEING WIPER ARM REQUIRED DRIVING TO NEAREST FREEWAY EXIT IN THE RAIN WITH INOPERABLE WINDSHIELD WIPERS. CHECKED TIGHTNESS OF WIPER ARM AND WAS FOUND TO BE TIGHT AND SECURE.  HOWEVER, WIPER ARM WAS FOUND TO HAVE A LOT OF \"PLAY\" IN IT.    *JB",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/11/2006",
        "dateOfIncident": "02/24/2006",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10152452,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "1. FUEL LEAKS FROM THE FUEL RAIL WHEN DRIVING IN COLD WEATHER.  2. FUEL LEAKS FROM FUEL RAIL AND RUBBER FUEL LINE THAT IS POSITIONED UNDER THE INTAKE MANIFOLD WHILE OPERATING IN COLD CLIMATE.  THIS CONDITION CAUSES FUEL TO LEAK ON TO THE HOT ENGINE CAUSING SMOKE TO RISE FROM UNDER THE HOOD AND POSSIBLY IGNITE RAW FUEL, IT ALSO CAUSES THE PASSENGER COMPARTMENT TO FILL WITH A STRONG GAS SMELL.  3. CORRECTION-REPLACEMENT OF FUEL RAIL AND RUBBER FUEL LINE AS INDICATED IN THE CAR MAKERS SERVICE BULLETIN. OLD PART NOT AVAILABLE.  *NM",
        "vin": "JF1GD29673G"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/01/2005",
        "dateOfIncident": "11/28/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10144178,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL LEAKAGE IN ENGINE COMPARTMENT OF MY 2003 SUBARU WRX IMPREZA. THERE WAS A BULLETIN ON 2002 MODELS. I HAVE HAD FUEL LEAKAGE WHEN TEMPERATURES ARE BELOW 32 DEGREES. SUBARU SAYS THAT MY YEAR DOES NOT QUALIFY FOR REPAIR. BUT THIS SEEMS TO BE THE SAME PROBLEM PREVIOUSLY REPORTED IN EARLIER MODELS.*JB",
        "vin": "JF1GG29663G"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/04/2005",
        "dateOfIncident": "09/30/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10138435,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "IN MY 2003 SUBARU IMPREZA WRX, ON MULTIPLE OCCASIONS, WHEN I HIT A SMALL BUMP IN THE ROAD (COULD BE AN EXPANSION JOINT IN A BRIDGE OR A CRACK IN THE ROAD SURFACE THAT HAS BEEN PATCHED) WHILE BRAKING, THE ABS KICKS IN AND DOES NOT ALLOW ME TO BRAKE.  AFTER ABOUT ONE SECOND HAS PASSED, THE ABS TURNS OFF AND I GRIND TO A HALT.  I HAVE LARGER-THAN-STOCK, HIGH PERFORMANCE TIRES, AND ON DRY PAVEMENT, THE STOCK BRAKES ARE NOT CAPABLE OF APPLYING ENOUGH PRESSURE TO LOCK UP THE BRAKES.  BUT IF I HIT A SMALL HICCUP IN THE ROAD, THE ABS TURNS ON AND DOES NOT ALLOW ME TO APPLY ANY SIGNIFICANT AMOUNT OF BRAKING POWER.  AS SOON AS IT DISENGAGES, THE INCREASE IN BRAKING POWER IS QUITE SIGNIFICANT.  I HAVE YET TO BE IN AN ACCIDENT AS A RESULT OF THIS DEFECT, BUT I HAVE LEARNED TO LEAVE EXTRA DISTANCE BETWEEN MYSELF AND THE CAR IN FRONT OF ME.  SUBARU IS DOING A \"VOLUNTARY RECALL\" TO FIX THIS PROBLEM AFTER AN INVESTIGATION BY YOUR ORGANIZATION.  I FIND IT ASTOUNDING THAT YOU WERE UNABLE TO REPLICATE THIS PROBLEM.  IF THIS IS THE CASE, THEN I STRONGLY URGE YOU TO REVISE THE METHODS YOU USE TO DEVELOP AN EXPERIMENT.  THIS IS AN OBVIOUS PROBLEM.  IT IS RELATIVELY EASY TO REPLICATE.  IF YOU ARE UNABLE TO REPLICATE IT, THEN YOU HAVE NOT DEVELOPED AN EXPERIMENT TO EFFECTIVELY TEST FOR THIS DEFECT.  *JB",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/19/2005",
        "dateOfIncident": "09/25/2002",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10136989,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKING SYSTEM IN THE VEHICLE MALFUNCTIONS UNDER THE FOLLOWING CONDITIONS. WHEN THE VEHICLE IS CROSSING OVER A SHARP TRANSITION (BREAK IN PAVEMENT, TRAIN TRACKS OR CHOPPY ROUGH PAVEMENT) IN THE ROAD AND UNDERGOING LIGHT TO MODERATE BRAKING, THE VEHICLE STOPS DECELERATING FOR ABOUT 1/2 TO 1 SECOND AND THE BRAKE PEDAL DROPS VERY CLOSE TO THE FIREWALL. THIS IS VERY DIFFICULT TO REPRODUCE, BUT DOES HAPPEN ABOUT ONCE EVERY COUPLE OF WEEKS. WHEN IT HAPPENS, IT SCARES THE HELL OUT OF THE DRIVER. THE AMOUNT OF TIME THAT BRAKING FORCE GOES TO ZERO VARIES. ON ONE OCCASION, I CAME VERY CLOSE TO REAR ENDING A CAR IN FRONT OF ME BECAUSE OF THE PROBLEM. I ALSO DRIVE A NON ABS EQUIPPED VEHICLE (87 FORD MUSTANG) OVER THE SAME ROADS. THE WRX STOPPING DISTANCE OVER THIS PART OF ROADWAY, WHERE THE FAILURE OCCURS AT 25 MPH, IS AT LEAST ONE CAR LENGTH GREATER THAN THE MUSTANG OVER THE SAME PART OF ROAD. ON SMOOTH ROADS, THE WRX WILL EASILY STOP IN LESS DISTANCE THAN THE MUSTANG. THERE ARE TWO THINGS THAT MAKE THIS BEHAVIOR SO DANGEROUS. 1) THAT IT SCARES THE DRIVER SO BADLY WHEN IT HAPPENS. 2) THAT THE BRAKING CAPABILITY OF THE CAR VARIES UNPREDICTABLY.     APPARENTLY NHTSA HAS ALREADY CLOSED THEIR INVESTIGATION INTO THIS ISSUE. I FOUND IT ON YOUR WEBSITE UNDER EA03024. THERE IS ONLY A BRIEF DESCRIPTION ON YOUR WEBSITE OF THE OUTCOME, BUT BASICALLY IT LOOKS LIKE \"NO PROBLEM FOUND\". THIS PROBLEM MAY BE DIFFICULT TO REPRODUCE, BUT I ASSURE YOU THAT IT IS VERY REAL. DRIVERS ARE NOT IMAGINING THE PROBLEM.     THE SUBARU DEALERSHIP AND SOA (SUBARU OF AMERICA) HAVE DENIED THAT THERE IS ANY PROBLEM. ONE OF THE MECHANICS AT THE DEALERSHIP COMMENTED TO ME THAT WRXS HAVE THIS PROBLEM, BUT SINCE THE DEALERSHIP DOESN'T HAVE ANY CONTROL OVER THE ABS SYSTEM THEY ARE FORCED TO DENY THAT THERE IS A PROBLEM.    SINCE SUBARU WON'T ADMIT TO THE PROBLEM, THE ONLY SOLUTION TO IT HAS BEEN TO DISABLE THE ABS BY REMOVING ITS POWER FUSE IN THE CAR. AT LEAST NOW I KNOW WHAT THE CAR IS GOING TO DO.   *JB",
        "vin": "JF1GD29623G"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "03/07/2005",
        "dateOfIncident": "03/07/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10113597,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE ACCELERATED SUDDENLY WITHOUT WARNING.  THE CONSUMER WAS UNABLE TO MAINTAIN CONTROL OF THE VEHICLE AND COLLIDED INTO ANOTHER VEHICLE.  NO INJURIES TO REPORT.  THE VEHICLE WAS TOWED TO THE DEALER FOR INSPECTION.  PLEASE PROVIDE ADDITIONAL INFORMATION.  *JB",
        "vin": "JF1GD296X4G"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/08/2005",
        "dateOfIncident": "02/07/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10111075,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER WAS SHIFTING TO SECOND GEAR WHEN ALL OF A SUDDEN HE HEARD A POP, AND WAS UNABLE TO CHANGE GEARS, PREVENTING THE VEHICLE FROM MOVING. TOOK VEHICLE TO DEALER  FOR CHECKUP, AND RESULTS SHOWED THAT SECOND GEAR WAS BROKEN, AND NEEDED TO BE REPLACED.*AK",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/25/2005",
        "dateOfIncident": "01/22/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10107854,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER A COLD WEEKEND THE INSIDE OF THE CABIN SMELLS OF RAW FUEL.  I SEE THE MANUFACTURER HAS A TSB FOR FIXING THIS IN THE NORTH AND CANADA, BUT NO MENTIONS OF IT IN THE SOUTH.  ALSO, THEY SAY IT HAPPENS IN 02 VEHICLES, BUT I HAVE AN 03 AND IT JUST STARTED.  *NM",
        "vin": "JF1GD296X3G"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "10/20/2004",
        "dateOfIncident": "10/19/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10096093,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TAKING A RIGHT HAND UPHILL TURN OVER A BUMP, ABS APARENTLY ACTIVATED AND STOPPED BRAKING FUNCTIONS.  I WAS UNABLE TO SLOW DOWN OR STOP AND HIT A CURB, CAUSING SEVERE DAMAGE TO CAR.   I HAD PREVIOUSLY HAD ISSUES WITH ABS ACTIVATING WHEN IT WAS NOT SUPPOSED TO IN MODERALTY LIGHT RAIN, WHICH WAS WHAT THE WEATHER WAS LIKE DURING THIS INCIDENT.",
        "vin": ""
    },
    {
        "components": "AIR BAGS,SEATS",
        "crash": true,
        "dateComplaintFiled": "09/20/2004",
        "dateOfIncident": "09/20/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10091377,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "FOLLOW-UP ON PREVIOUS COMPLAINT NUMBER: 04V342000.DRIVER WAS RESTRAINED BY A SEAT BELT.  MEDICAL COMPLAINTS:  2 CERVICAL VERTABRAE FRACTURES, PATELLA (KNEE) FRACTURE AND PNUEMOTHORAX.*AK",
        "vin": "JF1GD29633G"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "08/05/2004",
        "dateOfIncident": "10/01/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10086277,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST HAD THE CAR IN WITH 6600 MILES FOR AN OIL CHANGE AND THEY PERFORMED THE 7500 MILE CHECK UP AND FOUND NOTHING WRONG WITH THE CAR. THAT AFTERNOON I FIRST NOTICE THE BRAKES FEEL SOFT AND NOT SLOW THE CAR I SHOOK IT OFF THINKING I FELT IT WRONG. I NOTICED IT 2 DAYS LATER AGAIN AND DECIDED I SHOULD GET IT BACK TO THE DEALER BUT BEFORE I COULD I LOST THE BRAKES AS I WAS TURNING A CORNER AND WENT OVER A CURB THROUGH A SING BEFORE I GOT IN CONTROL AND TURNED OUT OF THE GRASS I WAS IN. I HAD BODY WORK DONE AND SOME FRONT SUSPENSION COMPONENTS REPLACED BUT NOTHING DONE TO BRAKES NO ONE FOUND ANYTHING WRONG. MY INSURANCE COMPANY SAID THEY WOULD HAVE IT INSPECTED AND I NEVER HEARD ANYTHING FROM THEM. THAT WAS OCTOBER OF 2003 AND THE PROBLEM IS HAPPENING AGAIN. I HAVEN'T HAD IT BACK TO DEALER YET I AM WAITING TIL I CAN CAUSE THE PROBLEM CONSISTENTLY SO THEY KNOW THERE IS A PROBLEM. AFTER HEARING OTHERS PROBLEMS WITH DEALERS SAYING IT'S FINE FOR THEM I WANT TO MAKE SURE I CAN PROVE IT FOR THEM.*AK",
        "vin": "JF1GD29623G"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/08/2004",
        "dateOfIncident": "08/10/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10080598,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2003 SUBARU WRX SEDAN WITH A MANUAL TRANSMISSION AND QUITE OFTEN WHEN SHIFTING GEARS 2ND,3RD,4TH AND ESPECIALY IN 5TH GEAR IT TENDS TO NOT SHIFT IN GEAR(GETS STUCK) AND GRINDS FROM TIME TO TIME. THIS SCARES ME WHEN I GET ON THE EXPRESSWAY AND I HAVE TO SHIFT GEARS TO GET IN THE FLOW OF TRAFFIC I'M AFFRAID THAT ITS GOING TO STICK AND CAUSE A ACCIDENT (IT HAS GOTTEN STUCK IN TRAFFIC AND HAVE ALMOST HAD A ACCIDENT). IT HAPPENS DURING NORMAL DRIVEING CONDITIONS EVEN WHEN I SHIFT FRON NEUTRAL TO REVERSE IT WILL GRIND. IT HAS BEEN A PROBLEM SINCE I BOUGHT THE CAR IN 6-27-03 I'VE TAKEN THE CAR TO THE DEALERSHIP AND ASKED FOR ON OF THEIR TECHNICIAN DROVE MY CAR AND SAID THAT THERE IS NOTHING WRONG WHEN SHIFTING GEARS. THE CAR HAS NO MODIFICATIONS.  *AK",
        "vin": "JF1GD29633G"
    },
    {
        "components": "SEATS",
        "crash": true,
        "dateComplaintFiled": "06/19/2004",
        "dateOfIncident": "04/26/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10078471,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE AT A FULL STOP, I WAS STRUCK FROM BEHIND (THE OTHER VEHICLE WAS TRAVELING        ( 20MPH?) IN MY 2003 SUBARU WRX WAGON- RESULTING IN THE COLLAPSE OF THE DRIVER'S SEAT BACK AND IN DAMAGE TO THE SEAT RECLINER MECHANISM AND THE 'SEAT FRAME' (THE BODY SHOP'S TERM).  *AK",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/11/2004",
        "dateOfIncident": "04/12/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10072419,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2003 SUBARU WRX 5 SPEED WAGON.  I HAVE BEEN EXPERIENCING A DISTRESSING AND REPEATABLE LOSS OF BRAKING UNDER CERTAIN CIRCUMSTANCES.  THIS PROBLEM HAS OCCURRED MORE THAN ONCE SO THE PARTICULAR DATE DOESN'T SEEM THAT RELEVANT, BUT I WAS FORCED TO CHOSE ONE BELOW.    THE CIRCUMSTANCES ARE AS FOLLOWS:  UNDER AGGRESSIVE BRAKING, A SMALL BUMP IN THE ROAD SEEMS TO CAUSE THE ABS SYSTEM TO ACTIVATE THEREBY DECREASING BRAKE SYSTEM PRESSURE AND BRAKING MOMENT.   I AM CERTAIN THAT THIS IS NOT A NORMAL IMPLEMENTATION OF THE ABS SYSTEM AND AM CONCERNED THAT I MAY EXPERIENCE THIS IN AN EMERGENCY SITUATION.    I HAVE DRIVEN MANY VEHICLES WITH AND WITHOUT ABS AND HAVE NEVER EXPERIENCED THIS SORT OF FAILURE OR PREMATURE ACTIVATION OF THE SYSTEM BEFORE.  I PURCHASED THE VEHICLE IN APRIL OF 2003 AND HAVE EXPERIENCED THE PROBLEM MULTIPLE TIMES DURING THE YEAR I HAVE OWNED THE VEHICLE.  I CAN\u0019T BE CERTAIN, BUT IT MAY BE THE CASE THAT THIS ONLY HAPPENS WHEN THE CAR IS IN GEAR WITH THE CLUTCH ENGAGED AND OF COURSE NO PRESSURE ON THE ACCELERATOR PEDAL.    I HAVE NOTICED THAT THERE IS AN INVESTIGATION UNDER WAY REGARDING THIS ISSUE, AND I AM HOPEFUL THAT MY INFORMATION WILL HELPFUL IN ONE WAY OR ANOTHER.  I AM AVAILABLE FOR FURTHER INPUT AND WOULD WELCOME ANY INFORMATION REGARDING PROGRESS RELATED TO THIS ISSUE.  THANK YOU IN ADVANCE FOR YOUR ATTENTION TO THIS ISSUE.    SINCERELY,  MICHAEL PALLOTTA",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/06/2004",
        "dateOfIncident": "05/06/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10068404,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE ABS UNNECESSARILY ENGAGES AND INCREASES THE STOPPING DISTANCE WHEN TIRES ROLL OVER BUMPS, WAVY PAVEMENT OR HOLES. IT REQUIRES QUICK RELEASE OF BRAKE PEDAL AND REENGAGEMENT TO DEACTIVATE ABS AND BE ABLE TO STOP ADEQUATELY. POTENTIAL FOR ACCIDENT IF STOPPING DISTANCE IS LONGER THAN REQUIRED STOPPING DISTANCE. I CAN REPLICATE THE PROBLEM CONSISTENTLY WHEN DRIVING OVER RAIL CROSSINGS.",
        "vin": "JF1GD29603G"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "04/29/2004",
        "dateOfIncident": "01/22/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10068040,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I SEEM TO BE HAVING THE SAME PROBLEM THAT IS BEING INVESTIGATED CURRENTLY BY YOU. THE NHTSA # IS: EA03024    I WAS INVOLVED IN AN ACCIDENT IN WHICH MY ABS BRAKES OF MY 2003 SUBARU IMPREZA WRX DID NOT ENGAGE. I APPLIED THE BRAKES JUST LIKE I NORMALLY DO AND THE BRAKE SANK VERY QUICKLY, AND THEN SUPPLIED VERY LITTLE BRAKING POWER. THE PERFORMANCE OF MY BRAKES WAS VERY VERY POOR COMPARED TO WHAT THEY USUALLY FELT LIKE. THIS HAPPENED WHILE I WAS DRIVING AT A SPEED OF APROXIMATELY 45MPH.    THIS RESULTED IN AN ACCIDENT. I RAN INTO THE BACK OF ANOTHER PERSON. THIS WAS OF COURSE DEEMED MY FAULT. THIS ACCIDENT HAPPENED IN LATE JANUARY THIS YEAR (2004). THE CAR WAS REPAIRED, BUT I HAVE EXPERIENCED THE PROBLEM ON TWO OTHER OCCASIONS SINCE THEN. LUCKILY I WAS ABLE TO STEER AROUND THE CARS IN FRONT OF ME AND TRY APPLYING THE BRAKES AGAIN TO MAKE THEM WORK CORRECTLY.",
        "vin": "JF1GD29693G"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/20/2004",
        "dateOfIncident": "04/01/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10067480,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 65 MPH DRIVER LOST CONTROL OF THE VEHICLE AND ROLLED OVER SEVERAL TIMES. UPON IMPACT,  DUAL AIRBAGS DID NOT DEPLOY. DRIVER SUSTAINED SEVERE BACK AND NECK INJURIES. *AK",
        "vin": "JF1GD29623G"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/17/2004",
        "dateOfIncident": "02/14/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10058312,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CRACKED WINDSHIELD -- IT HAPPENED WITH A SMALL PEBBLE.  *JB",
        "vin": "JF1GD29633G"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "02/13/2004",
        "dateOfIncident": "02/12/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10057135,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING TO WORK THIS YESTERDAY (2/12/04) MORNING, AND WAS JUST CROSSING AN INTERSECTION. I WAS GOING ABOUT 15MPH, AND SAW THE CAR IN FRONT OF ME HIT THERE BREAKS. I PUSHED DOWN THE PEDAL, AND TO MY HORROR, IT SEEMED TO GO ALL THE WAY TO THE FLOOR WITHOUT MY CAR STOPPING AT ALL. NEXT THING I KNEW, I HAD REAR-ENDED A BUICK (WHICH AS AN ASIDE SUFFERED NOTHING WORSE THAN A SCRATCHED BUMPER, COMPARED TO MY FOLDED HOOD, RUINING FRONT BUMPER, AND OTHER TWISTED METAL).I HAVE ABOUT 15K MILES ON THE CAR, AND HAVE NOT EXPERIENCED THIS PROBLEM BEFORE. THIS IS MY FIRST ACCIDENT IN ALMOST 15 YEARS OF DRIVING, AND DON'T REALLY KNOW HOW TO PROCEDE. I CALLED MY LOCAL SUBARU DEALER, WHO SAID HE HAD NO IDEA OF SUCH A PROBLEM. WHEN THE POLICE OFFICER WAS ASKING ME WHAT HAPPENED JUST AFTER THE ACCIDENT, I DESCRIBE THE PEDAL TO THE FLOOR FOR HIM, AND HOPEFULLY HE'LL INCLUDE MY STATEMENT IN THE REPORT. *AK",
        "vin": "JF1GD29623G"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/21/2004",
        "dateOfIncident": "01/19/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10054622,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2003 SUBARU IMPREZA WRX STATION WAGON WITH AN AUTOMATIC TRANSMISSION.  THE INCIDENT ON JANUARY 19, 2004 IS ONLY ONE OF AT LEAST FIVE EXAMPLES OF THE PROBLEM DETAILED BELOW.  *AK    HERE IS THE RECURRING PROBLEM: WHENEVER I BRAKE AT RELATIVELY LOW SPEEDS (UNDER 30MPH AS FAR AS I REMEMBER) OVER EVEN MILDLY BUMPY SURFACES, THE BRAKE PEDAL DEPRESSES COMPLETELY TO THE FLOOR AND THE CAR DOES NOT BRAKE.  THE CAR WILL NOT BEGIN BRAKING UNTIL I REALIZE WHAT IS GOING ON, RELEASE THE BRAKE PEDAL, AND THEN HEAVILY DEPRESS THE BRAKE PEDAL AGAIN.  I ALMOST HIT ANOTHER CAR BECAUSE OF THIS ISSUE ON JANUARY 19, 2004.  THIS IS VERY BAD, BUT EVEN WORSE IS WHAT HAS HAPPENED IN THE PAST -- I LIVE IN SOUTHERN CALIFORNIA AND SOME OF THE PEDESTRIAN CROSSWALKS IN MY AREA UTILIZE RAISED, WHITE-PAINTED CONCRETE SURFACES TO HIGHLIGHT THE CROSSWALK.  THIS RAISED, UNEVEN SURFACE HAS TRIGGERED THE BRAKE PROBLEM I'M DESCRIBING SEVERAL TIMES IN THE PAST.  THIS IS VERY SCARY SINCE MY CAR MIGHT STRIKE A PEDESTRIAN IN THE CROSSWALK BECAUSE OF ITS INABILITY TO BRAKE SMOOTHLY ON UNEVEN SURFACES.    I HAVE OWNED SEVERAL ABS-EQUIPPED CARS IN THE PAST, AND NONE HAVE EXHIBITED THIS SCARY BEHAVIOR.  AFTER READING ON A SUBARU OWNER'S INTERNET SITE THAT MANY OTHER OWNERS HAVE THIS PROBLEM, I CONTACTED A SUBARU DEALER ABOUT THE ISSUE.  I WAS TOLD THAT THIS IS NORMAL FOR ABS-EQUIPPED CARS.  I FIND THIS EXTREMELY SCARY AND VERY HARD TO BELIEVE.",
        "vin": "JF1GG296X3H"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "01/19/2004",
        "dateOfIncident": "01/17/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10054435,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE FAILURE.   *CB",
        "vin": "JF1GG29653G"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/01/2003",
        "dateOfIncident": "12/01/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10048945,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "LOSS OF BRAKING AT LOW SPEEDS ON ROUGH SURFACES. WHEN BRAKING ON AN UNEVEN PATCH ON THE ROADWAY AT APPROX 15MPH ABS SEEMED TO BE ACTIVATED HENCE REDUCING BRAKING EFFECTIVENESS. ALSO NOTICED THE PROBLEM AFTER RUNNING OVER A GENTLE SPEED BUMP AT SIMILAR SPEED. THIS SECOND INSTANCE CAUSED WHAT FELT LIKE A TOTAL LOSS OF BRAKING.*AK",
        "vin": "JF1GG296X3G"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/13/2003",
        "dateOfIncident": "10/07/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10046840,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS PROBLEM HAS OCCURRED 3 TIMES TO DATE.    THIS IS THE TYPICAL SITUATION:  I WAS DRIVING AT A LOW RATE OF SPEED, AROUND 25, COMING UP TO A STOP SIGN. A SECOND OR SO AFTER I APPLIED THE BRAKES I WENT OVER SOME SMALL BUMPS ON DRY PAVEMENT AND IT FELT LIKE ABS WAS COMING ON, THE PEDAL DROPPED, BUT THEN IT WENT WAY DOWN AND IT WASN'T PULSING. NO MATTER HOW HARD I PRESSED, IT DIDN'T SEEM TO HELP.  *LA",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/12/2003",
        "dateOfIncident": "09/01/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10046805,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "SUBARU IMPREZA WRX SEDAN, 2003.  ANTI-LOCK BRAKE ACTIVATION UNDER MINIMAL LIFT CONDITIONS (SUCH AS GOING OVER MINOR BUMPS IN ROADS, PARKING RAMPS, ETC.)  HAVE HAD SEVERAL EPISODES OF ANTI-LOCK ACTIVATION LEADING TO LOSS OF BRAKING FORCE AND EXTENDED BRAKING DISTANCES.  PROBLEM RESOLVED WITH REMOVAL OF ABS FUSE, BUT THEN I HAVE NO ABS EVER.  *LA",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/24/2003",
        "dateOfIncident": "10/15/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10043535,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "EARLY ABS ACTIVATION ON ROUGH OR UNEVEN SURFACES (MAN HOLE COVERS, ETC.) AND FOLLOWING THIS A HUGE LOSS OF BRAKING FORCE.  ALMOST LIKE THE BRAKES COMPLETELY FAILED UNTIL THE PEDAL IS RELEASED AN REAPPLIED WHICH CAN TAKE SEVERAL SECONDS.  THIS IS  NOT GOOD WHEN THE CAR IN FRONT OF ME JUST STOPPED.  *LA",
        "vin": "JF1GG29663G"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/24/2003",
        "dateOfIncident": "04/01/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10043540,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "OVERLY SENSITIVE ABS AND PROLONG ABS INTERVENTION.  LOSS OF STOPPING POWER.  SMALL BUMPS IN ROAD CAUSING ABS TO ACTIVATE AND STAY PULSING TOO LONG.  *LA",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/10/2003",
        "dateOfIncident": "08/26/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10037676,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "POTENZA RE92",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "WHILE DRIVING  AT 70 MPH AND WITH NO WARNING  REAR RIGHT TIRE TREAD SEPARATED AND CAUSED THE TIRE TO BLOWOUT. THE CONSUMER HAD TO PULL OVER.  THE DEALER HAS BEEN NOTIFIED. *AK   *PH   *NLM",
        "vin": "JF1SS296X3S"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "08/26/2003",
        "dateOfIncident": "06/25/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10033514,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ABS FAILED.  DRIVING ON ROAD, GOT CUT OFF, STEPPED ON BRAKE PEDAL.  PEDAL DROPPED TO FLOOR, CALIPERS SEEMED TO RELEASE AFTER A SECOND CAUSING NO LOSS IN SPEED.  REAR ENDED DRIVER IN FRONT OF ME.  STOPPING DISTANCE MORE THAN DOUBLED.   *NLM",
        "vin": "JF1GD29623G"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "08/26/2003",
        "dateOfIncident": "01/14/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10036626,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "SUBARU WRX WAGON, 2003.  WHILE ATTEMPTING TO SLOW FOR A CORNER ON A WELL GROOMED, DRY, GRAVEL ROAD THE ABS SYSTEM OF THE CAR INITIATED A MODE THAT WOULD NOT ALLOW THE CARS BRAKES TO FUNCTION AT ALL.  DURING THE EPISODE (WHICH HAS BEEN AND CAN BE RECREATED) PEDAL PRESSURE AND PEDAL HEIGHT WAS MAINTAINED AS DURING NORMAL BRAKING OPERATIONS.  THE BRAKES WOULD NOT WORK DESPITE THE FACT THAT I WAS STANDING WITH BOTH FEET ON THE BRAKE PEDAL.  I AM IN THE PROCESS OF DISCONNECTING MY ABS AND SUBARU NA CLAIMS THAT I'M NUTS.  *NLM",
        "vin": "JF1GG29613G"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "08/19/2003",
        "dateOfIncident": "08/17/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10033096,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "COMING AROUND CORNER ON A HILL DRIVER WAS IN MIDDLE OF ROAD AVOIDING POTHOLE I SWERVED AND BRAKED THEN SWERVED BACK. WHEN I SWERVED BACK MY BRAKE PEDAL HIT THE FLOOR AND I PROCEDED TO DRIVE ONTO SOMEONES FRONT LAWN. THE ABS SHOULDNT HAVE DONE THAT.*AK",
        "vin": "JF1GD29623G"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "08/07/2003",
        "dateOfIncident": "08/07/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10031003,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WINSHIELD CHIPPED DURING HIGHWAY DRIVING.   *PH",
        "vin": "JF1GD29673G"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/28/2003",
        "dateOfIncident": "05/15/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10030250,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 SUBARU WRX SEDAN - WHEN STOPPING ON SLIGHTLY BUMPY SURFACES THE ABS BRAKE SYSTEM BECOMES INEFFECTIVE. THE DRIVER MUST LET OFF THE BRAKES AND REAPPLY IN ORDER TO GET ANY EFFECTIVE BRAKING. THIS IS DANGEROUS. I CAN REPEAT IT AT KNOWN PLACES ON MY DRIVE TO WORK EVERYDAY. I COMPENSATE. IF I HAD KNOWN I WOULD NOT HAVE BOUGHT THE CAR. THIS NEEDS TO BE \"FIXED.\"*AK",
        "vin": "JF1GD29613G"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/16/2003",
        "dateOfIncident": "11/05/2002",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10028374,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN BRAKING OVER ROUGH SURFACES ON DRY PAVEMENT THE VEHICLE ENGAGED THE ANTI-LOCK BRAKING SYSTEM CAUSING SUDDEN LOSS OF BRAKING THAT WAS NOT RESTORED UNTIL THE BRAKE PEDAL WAS RELEASED AND RE-APPLIED.  THIS HAPPENED WITHOUT A LARGE AMOUNT OF BRAKING FORCE BEING CALLED FOR.*AK",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/10/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10022749,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE ACCELERATING VEHICLE STARTED MAKING LOUD NOISE AND WOULD NOT GAIN ANY SPEED. VEHICLE WAS SERVICED, TECHNICIAN NOTICED THAT  TRANSMISSION NEEDED TO BE REPLACED. *AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/09/2003",
        "dateOfIncident": "05/03/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10022688,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE CHECK  LIGHT CONTINUES TO STAY ON. DEALER IS  UNABLE TO DUPLICATE THE PROBLEM. *AK",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/04/2003",
        "dateOfIncident": "03/01/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10008400,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ABS FAILED.  BRAKE PEDAL WOULD SINK TO FLOOR WHEN ROAD IS BUMPY.  TAKES A VERY LONG DISTANCE TO STOP THE CAR.  2 NEAR-MISS INCIDENTS ALREADY.  CAR IS BRAND NEW 2003 WRX.  IT HAS 500 MILES ON IT.  *NLM",
        "vin": "JF1GD29683G"
    }
]