[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/02/2004",
        "dateOfIncident": "07/12/2003",
        "fire": false,
        "manufacturer": "TRAVEL SUPREME, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10074686,
        "products": [
            {
                "manufacturer": "TRAVEL SUPREME, INC.",
                "productMake": "TRAVEL SUPREME",
                "productModel": "MOTORHOME",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "MARATHON",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "IN JUNE 2003 I BOUGHT A 2003 TRAVEL SUPREME EXPRESS 5TH WHEEL TRAILER. THIS RV TRAILER HAD 6 NEW GOODYEAR MARATHON P235/80R16 LOAD RANGE\"D\" TIRES. WITH LESS THAN 1000 MILES ON THEM I HAD THE FIRST OF 3 TIRE FAILURES. THE FIRST INDICATION OF A PROBLEM WAS A 4 INCH BUBBLE ON THE OUTSIDE SIDE WALL. A SHORT TIME AFTER THE DISCOVEY OF THE BUBBLE THE TIRE BLEW OUT. THE TIRE WAS REMOVED AND REPLACED WITH ANOTHER TIRE OF THE SAME BRAND AND SPECIFICATIONS. NO THOUGHT OF DEFECTIVE TIRES YET! LESS THAN 1500 MILES LATER I EXPERIENCED ANOTHER TIRE FAILURE. THE TIRE WAS REMOVED AND REPLACED WITH INDENTICAL TIRE AGAIN. NOW I HAVE BEGINNINGS OF DOUBTS ABOUT SAFETY AND QUALITY OF TIRES. I FINISHED MY SUMMER TRAVELS IN OCTOBER 2003 WITH APPROXIMATELY, TO THE BEST OF MY ABILITY TO CALCULATE. LESS THAN 8000 MILES ON THE ORIGINAL 4 REMAINING TIRES.                                                                                           THIS YEAR, MAY 2004, I REMOVED MY RV FROM STORAGE FOR ANOTHER TRIP. LESS THAN 50 MILES FROM HOME I HAVE ANOTHER, 3RD, TIRE FAILURE. ANOTHER BUBBLE ON THE OUTSIDE SIDE WALL. I RETURN HOME AND TAKE THE RV TO THE LOCAL GOODYEAR TIRE DEALER TO REPLACE THE TIRE. I HAVE ASKED GOODYEAR FOR SAFETY TO REPLACE THE REMAINING 3 ORIGINAL TIRES AT NO EXPENSE TO ME BUT AS YET THEY ARE ONLY WILLING TO PRORATE THE TIRES BASED ON THE REMAINING TREAD DEPTH ON THE TIRES. I BELIEVE THE TIRES ARE DEFECTIVE AND ARE A CONTINUING SAFETY HAZARD. I WILL HAPPILY PROVIDE ANY OTHER INFORMATION REQUESTED.*AK",
        "vin": ""
    }
]