[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/07/2021",
        "dateOfIncident": "11/07/2021",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439636,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S40",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "Engine light stays on. I have had 2 mechanics check it out.  They don't know why the light is on. I am very concerned about the fuel line problem.",
        "vin": "YV1VS27503F"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/07/2018",
        "dateOfIncident": "11/26/2018",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11156873,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S40",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR STRUT/SHOCKS CONTINUE TO BREAK/CRACK OVER AND OVER. I HAVE GONE THROUGH 3 NEW STRUTS AND SHOCKS AND THEY CONTINUE TO BREAK. I ALSO HAVE GONE TO THE JUNKYARD AND ALL OF THE S40 AND V40'S HAVE ALL OF THEIR STRUTS/SHOCKS BROKEN. I'VE WITNESSED OVER 6 S40 OR V40'S LIKE THIS NOW. MY CAR HAS FAILED INSPECTION BECAUSE OF THIS AND IT IS A SAFETY CONCERN.  IT SEEMS THIS IS A COMMON ISSUE ON EVERY S40 AND V40 FROM THE YEARS 2001-2004.  IT'S ABSOLUTELY RIDICULOUS THAT THESE STRUTS/SHOCKS CONTINUE TO BREAK. THERE SHOULD DEFINITELY BE A RECALL.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/31/2018",
        "dateOfIncident": "01/30/2018",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11066109,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S40",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "PRIOR TO LATEST INCIDENT, THE CAR HAD OCCASIONALLY GONE INTO \"LIMP\" MODE, STICKING IN 3RD GEAR BUT DRIVABLE. THAT PROBLEM WOULD GO AWAY AFTER A DAY OR SO. LOCAL SHOP COULDN'T FIND ANYTHING DEFINITIVE. BIGGER PROBLEM WAS YESTERDAY EVENING'S LOSS OF THROTTLE CONTROL AND MULTIPLE ELECTRICAL ISSUES. IDLE THROTTLE SETTING (EG STOPPED AT LIGHTS) BECAME UNSTABLE, OCCASIONALLY REVVING UPTO TO ~2000RPM.  MOMENTS LATER ON SUBURBAN DIVIDED MAIN STREET, THROTTLE STUCK AT ~2200RPM WHICH MEANT I WAS DOING 45MPH (STRAIGHT LINE) WITHOUT ANY PRESSURE APPLIED TO GAS PEDAL. SLOWED ON THE BRAKES UNTIL I SHIFTED INTO NEUTRAL AT WHICH TIME EVERYTHING DIED (ELECTRICAL) AND CAME TO A STOP, SHORT OF TRAFFIC LIGHTS. TIME OF INCIDENT APPROX 8PM EST (DARK), ROADWAY FULLY LIT THANKFULLY. CAR WAS PUSHED OFF STREET. SOME ELECTRICS CAME BACK ON WHEN TRIED BUT FULL CHRISTMAS TREE LIGHTS (IE EVERYTHING) ACROSS ENTIRE DASH. TOWED HOME. REMOVED IGNITION KEY (WAS INSERTED TO ENSURE STEERING WAS UNLOCKED) BUT RADIATOR COOLING FAN REMAINED ON (ENGINE HADN'T RUN FOR 2.5 HOURS BY THAT TIME). PULLED A FUSE UNDER THE HOOD TO STOP IT DUMPING THE BATTERY.    CAR IS NO YOUNGSTER, MANUF 2003 IN NETHERLANDS, PURCHASED SECOND HAND IN 2005 WITH APPROX 20,000 MILES ON THE CLOCK. CURRENTLY AT 108,000 ISH.    OTHER ISSUES WITH CAR (NOT SAFETY RELATED) MEANS I WONT BE HAVING IT FIXED GIVEN ITS AGE AND GENERAL COSMETIC CONDITION. IT WILL BE DONATED FOR SCRAP.",
        "vin": "YV1VS27543F"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/08/2013",
        "dateOfIncident": "02/09/2012",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10496925,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S40",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I RETURNED TO MY CAR AND FOUND THAT I COULD NOT TURN THE IGNITION SWITCH AND AS A RESULT OF THE SECURITY SYSTEM MY CAR WAS TOTALLY INOPERATIVE.  THE CAR HAD TO BE TOWED TO THE NEAREST DEALER, WHERE IT WAS DIAGNOSED WITH A BROKEN IGNITION SWITCH, SPECIFICALLY THE DEVICE THAT READS THE CHIP IN THE KEY HAS FAILED AND WILL NOT ACCEPT ANY KEY.  CURRENTLY THE CAR HAS BEEN SITTING AT THE DEALER FOR OVER 4 WEEKS.  BECAUSE THE KEYS AND SWITCHES ARE MATCHED WE CANNOT GET AN AFTER-MARKET REPLACEMENT SWITCH.  FURTHER, THE PARTS ARE BACK ORDERED AT THE DEALER, BACK ORDERED AT VOLVO NORTH AMERICA, BACK ORDERED AT VOLVO IN SWEDEN, AND THEY CANNOT EVEN GET ME A DATE WHEN THE PART MIGHT BE AVAILABLE.  AS AN RELIABILITY ENGINEER, THE IGNITION SWITCH FAILURE WOULD BE CLASSIFIED AS A CRITICALITY 1, SINGLE POINT FAILURE, IN OTHER WORDS IT RESULTS IN LOSS OF VEHICLE.  THERE IS NO INDICATION OF PENDING FAILURE, AND NO WAY TO MITIGATE THE PROBLEM IF IT OCCURS.  YOU ARE STRANDED WHERE EVER THE CAR WAS LAST PARKED. AND WORSE, IN THIS CONDITION THE CAR HAS NO RESALE VALUE, EXCEPT MAYBE AT A \"CHOP SHOP\", SO I CANNOT EVEN TRADE IT IN FOR A NEW CAR.  *TR",
        "vin": "YV1VS29553F"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/29/2012",
        "dateOfIncident": "06/29/2012",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10463577,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S40",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 VOLVO S40. THE CONTACT STATED THAT WHILE SITTING AT A TRAFFIC STOP, THE VEHICLE ACCELERATED ABNORMALLY. THE CONTACT HAD HIS FOOT ON THE BRAKE PEDAL AND THEN HAD TO SHIFT INTO NEUTRAL TO GET THE VEHICLE TO SLOW DOWN. THE CONTACT PULLED THE VEHICLE OVER, SHUT OFF AND TRIED TO RESTART THE ENGINE BUT IT FAILED. THE VEHICLE WAS TOWED TO A DEALER FOR INSPECTION BUT THE CAUSE OF THE FAILURE WAS UNKNOWN. THE MANUFACTURER WAS NOTIFIED AND THEY INFORMED THE CONTACT THAT THERE WERE NO RECALLS FOR THE FAILURE. THE FAILURE MILEAGE WAS 94,000. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/10/2010",
        "dateOfIncident": "12/02/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10369952,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S40",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2003 VOLVO S40 HAS BEEN DRIVEN FEWER THAN 70,000 MILES.  ALL VOLVO RECOMMENDED SERVICE HAS BEEN PERFORMED BY CERTIFIED MECHANICS AND IS DOCUMENTED.    MY VOLVO DEALER DETERMINED THAT THE TRANSMISSION HAD TO BE REPLACED.  IT IS NOT AT ALL REASONABLE TO HAVE A CATASTROPHIC TRANSMISSION FAILURE AT ONLY 70, 000 MILES.   I FEEL VOLVO SHOULD BE RESPONSIBLE FOR AT LEAST THE COST OF THE REPLACEMENT TRANSMISSION.     IN ADDITION TO THE COST AND INCONVENIENCE, THIS TRANSMISSION FAILURE PRESENTED A HAZARD THAT COULD HAVE RESULTED IN A SERIOUS ACCIDENT.     MY VOLVO WAS BEING DRIVEN ON A FRONTAGE ROAD WITH THE INTENTION OF ENTERING A FREEWAY.  WHEN THE TRANSMISSION STARTED TO SLIP, A RIGHT TURN WAS MADE FROM THE FRONTAGE ROAD TO A 4-LANE ROAD IN AN ATTEMPT TO AVOID HIGH SPEED TRAFFIC.  THE TRANSMISSION WENT TO NEUTRAL DURING THE TURN AND THE VOLVO COASTED TO A STOP JUST PAST THE CORNER IN THE RIGHT LANE OF THIS BUSY ROAD.    FORTUNATELY, A POLICE CAR WAS JUST A HUNDRED FEET AWAY, SAW THE VOLVO STOP IN THE TRAFFIC LANE AND PULLED IN BEHIND THE STOPPED VOLVO WITH LIGHTS FLASHING TO WARN ONCOMING TRAFFIC.      ONLY THE PROXIMITY OF THE POLICE CAR AVOIDED BEING HIT FROM THE REAR BY VEHICLES TRAVELING IN THE LANE WHERE THE VOLVO STOPPED.  THE POLICE CALLED FOR A TOW TRUCK.    I HAVE DETERMINED THAT THIS TYPE OF TRANSMISSION FAILURE HAS BEEN REPORTED MANY TIMES BETWEEN 2003 AND THE PRESENT AND FEEL IT SHOULD BE CONSIDERED FOR A SAFETY RECALL. *TR",
        "vin": "YV1VS275X3F"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, OTHER,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/09/2010",
        "dateOfIncident": "07/02/2010",
        "fire": true,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10348314,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S40",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING WHEN THE CAR START TO ACCELERATED BY ITSELF, ACCEL PEDAL WENT TO THE FLOOR.  I COULD NOT KEEP A CAR EVEN   BY THE HAND BRAKE, SO AS IT WAS JUMPING AHEAD.  THEN THE CAR BEGAN TO BLOW BLACK AND WHITE SMOKE OUT UNDER THE HOOD. SOME HOW I TURN OFF THE ENGINE, TOOK THE KEY AND RUN AWAY FROM THE CAR IN THE MIDDLE OF THE TRAFFIC ROAD.  GREEN  LIQUID UNDER THE CAR. IT DIED ON THE ROAD. POLICE CAME, THE CAR TOWED.  AFTER SEVERAL DAYS OF CHECKOUT :  T/3.8 CHECKOUT AND REPLACED T-STAT, TEMP SENSOR, T-STAT HOUSING GASKET;  BG COOLANT FLUSH ;  PCV;  ENGINE VENT;  ENGINE MECHANICAL;  BG POWER STEERING; BG  BRAKE  AFTER A WEEK I GOT THE SAME--JUMPING, NOT STABLE, ACCEL PEDAL GOES  TO THE FLOOR.  INTERNAL SHORT IN CYL 3 AND 2 COIL AND FOULED SPARKPLUGS  T/1.5 REPLACED COIL PACK FOR CYL 3 AND 2 AND REPLACED SPARKPLUGS. *TR",
        "vin": "YV1VS27503F"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/09/2010",
        "dateOfIncident": "02/12/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10317937,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S40",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Michelin North America, Inc.",
                "productMake": "BF GOODRICH",
                "productModel": "215/50ZR1690Y G-FORCE T/A KDW DIR TL07",
                "productYear": "9999",
                "size": "215/50R16",
                "type": "Tire"
            }
        ],
        "summary": "INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6)    ON FEB 12, I HAD A PERIODIC MAINTENANCE DONE AT THE DEALERSHIP AND THEY ADVISED ME THAT MY TIRES WERE BAD.  I HAD ONLY HAD THE TIRES A SHORT WHILE SO I BROUGHT THE CAR TO WHERE I BOUGHT THEM (SEARS) AND WAS ADVISED THAT THE TREAD WAS GOOD BUT THERE WAS ROT BETWEEN THE TREAD.  THE TIRES ARE BF GOODRICH TRACTION T/A TIRES (MY MODEL P21550V16) AND WERE SOLD NATIONWIDE BY SEARS.  BF GOODRICH DID GIVE ME A 45% CREDIT BUT I FEEL THESE TIRES ARE DANGEROUS SINCE I WAS TOLD THEY COULD SHRED AT ANY TIME (SOUNDED LIKE FIRESTONE ALL OVER AGAIN).  BF GOODRICH NO LONGER MAKES TRACTION T/A TIRES BUT SINCE THE TIRES ARE 60,000 MILE TIRES AND I ONLY GOT 35,000 ON THEM AND HAD THEM LESS THAN 3 YEARS I THOUGHT YOUR AGENCY SHOULD INVESTIGATE FOR A POSSIBLE RECALL.  MANY PEOPLE COULD BE DRIVING AROUND ON THEM WITHOUT KNOWING HOW DANGEROUS AND HAZARDOUS THEY ARE.  I INITIALLY SENT A LETTER TO YOUR AGENCY USING THE ADDRESS FROM THE WEBSITE BUT IT CAME BACK AS NOT ENOUGH INFORMATION PROVIDED.  I HOPE  THIS EMAIL WILL BE AS EFFECTIVE.  THE TIRES WERE NOT CHEAP TIRES AND THEY WERE PROPERLY INFLATED AND ROTATED SO I NEVER THOUGHT THEY WOULD LAST SUCH A SHORT TIME (I PURCHASED THEM  ON 4/22/07).  I EXPECT OTHER PEOPLE WILL FEEL THE SAME AND MAY NOT BE AS LUCKY AS ME TO FIND OUT THAT THESE TIRES ARE BAD AND EXTREMELY DANGEROUS.  I HAVE ALSO SENT THIS INFORMATION TO THE RI ATTORNEY GENERAL'S OFFICE.  ANY ADDITIONAL INFORMATION THAT YOU REQUIRE MAY BE OBTAINED BY CALLING MY CELL AT [XXX] *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/21/2007",
        "dateOfIncident": "12/21/2007",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10212492,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "VOLVO",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ANGLE GEAR REPLACEMENT ON A 2003 VOLVO XC90 AWD.  *TR",
        "vin": "YV1CZ59H931"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/04/2007",
        "dateOfIncident": "08/20/2007",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10205035,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "VOLVO",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "1.  THERE IS A WHOOPING CRANE  SOUND WHEN I STEP ON THE FOOT FEED AND THEN RELEASE.  THE DEALER SAID IT WAS REPAIRED AND THEN WHEN I DROVE IT HOME IT WAS STILL MAKING THE NOISE.  AFTER NO RESPONSE FROM MY COMPLAINT TO THEM I STOPPED THE PAYMENT VIA AE AND HAVE STILL HEARD NOTHING.  I THINK I PUT THE WRONG YEAR OF MY VEHICLE IN THE BEGINNING AND IF I TRY TO GO BACK I LOOSE EVERYTHING.  IT IS A 2003 XC90 PURCHASED IN 12/02.  THANK YOU FOR ANY HELP YOU CAN GIVE.  IF YOU CAN'T HELP, PLEASE AT LEAST SEND ME AN EMAIL AND TELL ME SO.  THANKS.  2.  ANOTHER PROBLEM THAT STARTED IN JULY 2006 IS A KNOCKING NOISE COMING FROM UNDERNEATH THE VEHICLE.  AFTER NUMEROUS TRIPS TO THE DEALER I WAS TOLD A NEW BOX  FOR THAT PARTICULAR ITEM AND IT WOULD COST $2800.00 TO REPAIR.  BUT THEY COULD NOT GUARANTEE THAT WOULD FIX THE PROBLEM.  MY XC90 HAD A 4 YR OR 50,000 WARRANTY.  THIS PROBLEM STARTED IN JULY 2006 WITH 41800 MILES.  I TOOK POSSESSION OF THE CAR IN 12/02 SO MY MATH SAYS THE WARRANTY EXPIRED 12/06 AND THAT MEANS IT WAS STILL UNDER WARRANTY WHEN THIS WAS FIRST NOTICED.  I HAVE HAD THE VEHICLE IN AT LEAST  EVERY 4 MONTHS FOR SERVICE AND EACH TIME COMPLAINED ABOUT IT.  ALSO I HAD IT IN AT LEAST 5 TIMES FROM JUNE THRU JULY 2007 WITH NO SATISFACTION.  NOW THEY DON'T EVEN ANSWER MY EMAILS OR RETURN MY PHONE CALLS.  I HAVE CONTACTED THE CONSUMER COMPLAINT DEPARTMENT OF VOLVO AND THEY HAVE NEVER ANSWERED ME.  I AM AT A LOSS AS TO WHAT TO DO.  THIS CAR WAS PURCHASED AT POWER VOLVO OF CERRITOS (THEN IT WAS CALLED VOLVO OF CERRITOS)  PLEASE HELP ME!   *TR",
        "vin": "YV1CZ91H831"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/19/2007",
        "dateOfIncident": "03/01/2007",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10185527,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S40",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2003 S40 HAS BEEN SLIPPING GEAR BETWEEN 3RD AND 4TH GEAR AND OCASSIONAL HARD SHIFT BETWEEN 2ND AND 3RD GEAR. THE CAR ONLY HAS 49000 MILES. I HAVE GONE TO THE DEALER AND THEY SAID, THERE IS NO SOFTWARE UPDATE FOR THE TCM (TRANSMISSION CONTROL MODULE)AND IT NEEDS TO BE REPLACED. COST $800. THIS GEAR SLIP MAKES DRIVING VERY BOTHERSOME AND DANGEROUS ON OCCASION. IF YOU NEED TO SPEED UP TO GET OUT OF THE WAY, THE SLIP CAUSES THE CAR TO LOSE POWER. FEW SECONDS MAKES A DIFFERENCE BETWEEN LIFE AND DEATH.  I HAVE TAKEN THE CAR TO ANOTHER IMPORT REPAIR SHOP AND HAD THEM REPLACE THE TCM. WHICH DID NOT HELP THE ISSUE. THEN I TOOK THE CAR BACK TO THE DEALER AND ASKED TO DO ANOTHER DIAGNOSTIC TO SEE IF THE TCM IS THE ISSUE OR NOT. THEY SAID, THE TCM COULD NOT BE FUNCTIONING PROPERLY. THEY WANT ME TO REPLACE THE TCM THROUGH THEM AND SEE IF IT WILL RESOLVE THE PROBLEM, OTHERWISE IT WILL BE A TRANSMISSION ISSUE.  I HAVE RESEARCHED ON THE WEB AND THROUGH MULTIPLE FORUMS, THERE HAVE HUNDREDS OF ISSUES RELATED TO TCM AND TRANSMISSION ON THESE MODELS. I DO NOT UNDERSTAND HOW CAN A CAR HAVE TCM OR TRANSMISSION ISSUE WITH ALL IT'S FACTORY RECOMMENDED SERVICE DONE AS SCHEDULED.",
        "vin": "YV1VS27513F"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/11/2006",
        "dateOfIncident": "12/09/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10175880,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S40",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "GOT A CHECK ENGINE LIGHT ON AND TRIED TO GET A FULL DIAGNOSTIC TEST DONE, BUT THE POWER CONTROL MODULE WAS NOT COMMUNICATING WITH VEHICLE.   *JB",
        "vin": "YV1VS29553F"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/21/2005",
        "dateOfIncident": "12/10/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10126023,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S40",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION SLIPS BETWEEN GEARS 2ND AND 3RD",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/23/2004",
        "dateOfIncident": "04/22/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10071409,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S40",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATED THAT BANRIDGE VOLVO WILL NOT HONOR THE RECALL DEALING WITH THE FUEL RAIL. CONSUMER  TOOK THE VEHICLE TO THE DEALERSHIP ON 04/22/2004. *AK",
        "vin": "YV1VS27513F"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/09/2004",
        "dateOfIncident": "05/10/2003",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10065869,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S40",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FOLLOWING IS A SYNOPSIS OF ORIGINAL E-MAIL I SENT TO VOLVO CARS OF NORTH AMERICA FOR YOUR RECORDS.  *AK  -------------------------------------------------------------------------------------------------    I FINALLY HAD MY 2003 VOLVO S40 SERVICED FOR EXCESSIVE BUMPY RIDE PROBLEM THAT I\u0019VE COMPLAINED ABOUT SINCE THE TIME I BOUGHT IT FROM HOWARD ORLOFF IN MAY 2003.   I\u0019M APPALLED TO LEARN THAT FOLKS AT HOWARD ORLOFF LEFT THE SPRING SPACERS IN PLACE ALONG THE FRONT SUSPENSION WHEN THEY SOLD ME THE CAR; AND AFTER SEVERAL COMPLAINS (OF WHICH YOU FOLKS HAVE ALL THE RECORDS OF MY E-MAIL COMMUNICATIONS) AND TEN MONTHS, VOLVO OF LISLE FINALLY FIGURED THE ISSUE OUT. I DON\u0019T KNOW WHAT KIND OF DAMAGE THIS MAY HAVE CAUSED TO MY CAR FOR ALL THESE MANY MONTHS.    AS OF WRITING THIS MESSAGE, MY CAR IS DANGEROUS AND PRECARIOUS MORE THAN EVER. AFTER ALMOST LITTLE OVER A WEEK OF DRIVING SINCE I GOT MY CAR BACK, THE CAR\u0019S RIDE IS WORST THAN EVER; THE STEERING WHEEL HAS BECOME EXTREMELY SENSITIVE AND DOES NOT AFFORD CONTROL OF THE CAR; QUITE OFTEN DASHBOARD ICONS FLASH AS I HIT EVEN THE SLIGHTEST BUMP ON THE ROAD; THE REAR RIGHT WHEEL SEEMS TO GET AIRBORNE WHILE THE LEFT FRONT END STAYS DIPPED INTO THE PAVEMENT. BEFORE VOLVO OF LISLE ADDRESSED THE SPRING SPACER PROBLEM, THE CD-PLAYER KEPT SKIPPING THE TRACK INCLUDING THE TUNER MODE CHANGED FROM CD TO TAPE OR AM/FM MODE 3 OR 4 TIMES SOLELY DUE TO THE CAR HITTING A BUMP WHILE DRIVING. AT THIS RATE, I\u0019M AFRAID IT IS GOING TO CAUSE MORE DAMAGE TO TIRES, WHEEL RIMS, ELECTRICAL SYSTEM, ENGINE AND OTHER INTERIOR AND EXTERIOR COMPONENTS OF MY CAR.  I\u0019M DEFINITELY CONCERNED AND EVEN SCARED ABOUT THE SAFETY OF MY FAMILY AND MYSELF ALONG WITH OTHERS ON THE ROAD WHEN DRIVING THIS CAR.  IN LIGHT OF THE SAME RECURRING PROBLEM, VOLVO SHOULD REPLACE MY CAR WITH A NEW ONE AT NO EXTRA COST TO ME.  I LOOK FORWARD TO HEARING FROM YOU BY MONDAY, APRIL 12, 2004 OR SOONER.",
        "vin": "YV1VS27583F"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "02/09/2004",
        "dateOfIncident": "02/09/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10057746,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S40",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER INDICATED THAT THE ISOFIX GUIDE THAT THE MANUFACTURER SENT FOR  RECALL  03V284000  COULD NOT FIX  THE PROBLEM.  *AK",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "01/05/2004",
        "dateOfIncident": "12/12/2003",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10052437,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S40",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "MICHELIN TIRE CORP.",
                "productMake": "MICHELIN",
                "productModel": "MXV4",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TO WHOM IT MAY CONCERN:I WOULD LIKE TO REPORT A COMPLAINT THAT ONE OF THE MICHELIN TIRES ON MY NEW VOLVO S40 (BOUGHT ON JAN 25, 2003: [XXX]) BLEW OUT WHILE I WAS DRIVING TO WORK. FORTUNATELY, I WAS NOT IN AN ACCIDENT AS I WAS DRIVING AT ABOUT 25MPH. ON THE SAME DAY FRIDAY (DEC 12, 03) I CONTACTED THE VOLVO DEALER WITH A REQUEST TO FIX THIS PROBLEM. THEY REFUSED TO EVALUATE THE TIRE AND ONLY TOLD ME TO CALL MICHELIN. ON DEC 15, 03,  I CALLED MICHELIN AND WAS TOLD THAT VALLEY FORGE TIRE AND AUTO CENTER WAS THE CLOSEST CERTIFIED MICHELIN DEALER IN MY AREA. I MADE AN APPOINTMENT WITH THEM AND WENT THAT DAY. THEIR REPRESENTATIVE TOLD ME THAT THIS TIRE WAS NOT FAULTY, AND COULD NOT BE COVERED UNDER WARRANTY. I HAD TO REPLACE THE TIRE ANYWAY BECAUSE I WAS GOING TO EUROPE, AND I NEEDED THE CAR TO GET TO THE AIRPORT IN NEW JERSEY. (I WAS IN PENNSYLVANIA AT THAT TIME) AFTER I RETURNED FROM MY VACATION, I CONTACTED AN EXPERT AND WAS TOLD THAT THE BLOWOUT WAS THE FAULT OF THE MANUFACTURER BECAUSE: 1. ON THE INSIDE LAYER OF THE TIRE THE RUBBER WAS PEELING (THE RUBBER WAS COMING OFF OF THE TIRES LIKE SCALES) 2. IN ANOTHER PLACE ALSO ON THE INSIDE OF THE TIRE THE WHITE THREADS THAT MAKE UP THE TIRE UNDER THE RUBBER WERE SHOWING, I WAS TOLD THAT THE TIRE WOULD HAVE BLOWN OUT IN THIS POINT IF NOT IN THE OTHER. IN THIS SITUATION I WOULD LIKE TO REPLACE ALL FOUR OF MY TIRES THIS WEEK TO GOODYEAR. PLEASE ADVISE ME HOW YOU PLAN TO DEAL WITH THIS SITUATION.  I BOUGHT A NEW CAR AND SPECIFICALLY THE VOLVO BECAUSE I WAS PLANNING TO DO A LOT OF DRIVING THIS YEAR AND NEEDED A SAFE AND RELIABLE CAR. I TRUSTED VOLVO\u0019S REPUTATION FOR SAFETY AND RELIABILITY, BUT NOW I AM VERY DISAPPOINTED.   [XXX].  *AK  UPDATED 07/30/2012  *JS    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6)",
        "vin": "YV1VS29503F"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/13/2003",
        "dateOfIncident": "07/19/2003",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10033856,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S40",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 VOLVO S40 EXPERIENCED MECHANICAL FAILURE OF THE ENGINE FUEL LINE. *MR   *CB",
        "vin": "YV1VS29533F"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/15/2003",
        "dateOfIncident": "06/27/2003",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10026090,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S40",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM CURRENTLY DRIVING A 2003 VOLVO S40.  IT HAS BEEN EXPERIENCING A TRANSMISSION SLIP BETWEEN 2ND AND 3RD GEARS.  I HAD TAKEN THE CAR BACK TO THE DEALER FOR TWO TIMES DUE TO THE ABOVE PROBLEM.  THE ONLY THING THEY DID WAS UPGRADING THE PROGRAM, WHICH IT DID NOT HELP AT ALL.  THE MAJOR PROBLEM IS I ALMOST GOT IN A MAJOR ACCIDENT ON 6/27/2003 WHILE I WAS MAKING A LEFT TURN AND THE CAR LOST POWER IN THE MIDDLE OF THE ROAD.  THE ON COMING TRAFFIC BARELY MISSED RUNNING INTO MY VOLVO.  THIS TRANSMISSION SLIPPING USUALLY LAST FOR 2 TO 3 SECS AND THIS LOST OF POWER CAN PUT ME INTO MAJOR ACCIDENT EASILY.  I ASKED VOLVO TO TAKE MY CAR BACK, BUT THEY SAID THEY COULD NOT REPRODUCE THE PROBLEM WHILE THE CAR WAS IN THE SHOP, THE TURTH IS, THE PROBLEM DOES NOT HAPPEN EVERYDAY.  I AM EXTREMLY MAD THAT VOLVO DOES NOT CARE ABOUT THE LIFES OF THEIR CUSTOMERS.  IN FACT, THIS IS A KNOW PROBLEM EVEN VOLVO HAS A TECH NOTE FOR THIS.  BUT I GUESS AS LONG AS THEY CANNOT REPRODUCE THE PROBLEM, THEY DONT CARE EVEN WE ARE TAKING ABOUT POTENTIAL MAJOR ACCIDENTS HERE.  PLEASE HELP.  THANKS.*AK",
        "vin": "YV1VS27563F"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/04/2003",
        "dateOfIncident": "05/01/2003",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10016992,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S40",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION SLIPS FROM 2ND TO 3RD FROM TIME TO TIME. ADDITIONALLY, THE CAR SHIFTS HARSHLY FROM 3RD TO 2ND GEAR.  *JB",
        "vin": "YV1VS29593F"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "04/02/2003",
        "dateOfIncident": "03/31/2003",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10015004,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "VOLVO",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SIDE MIRRORS FAILED TO STAY IN THE POSITION THEY WERE SET IN, WHICH MADE IT DIFFICULT TO SEE WHILE DRIVING.   *JB",
        "vin": ""
    }
]