[
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/11/2022",
        "dateOfIncident": "11/29/2021",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456300,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2003 Volvo S80. The contact received a notification for NHTSA Campaign Number: 21V766000 (Air Bags). The dealer had been notified about the recall and an appointment was made for the recall repair. The contact then received a call that the appointment was cancelled due to parts not yet being available. The manufacturer was also notified of the recall and also stated that parts were unavailable. The contact stated that the manufacturer had exceeded a reasonable amount of time for the repair. The contact had not experienced a failure. Parts distribution disconnect.",
        "vin": "yv1ts92d431"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/16/2021",
        "dateOfIncident": "12/16/2021",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444009,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "The vehicle has a recall and Volvo told me I have to drive 8 hours to another state to get it fixed by the closest dealership.  I cannot do that - I need to have it fixed locally",
        "vin": "YV1TS91ZX31"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/07/2021",
        "dateOfIncident": "06/02/2021",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419916,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "Within a week of purchasing the vehicle from a dealer, I discovered that the fuel tank has a leak, so its currently unsafe to drive.  I found out about the leak when I brought it to an independent mechanic for service.  I see that other vehicles of this model and year had been recalled for fuel leaks, so I wanted to report the issue.",
        "vin": "yv1ts92d631"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/13/2016",
        "dateOfIncident": "09/10/2016",
        "fire": true,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10915723,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2003 VOLVO S80. WHILE PARKED, THE BATTERY COMPARTMENT CAUGHT FIRE WITHOUT WARNING. THE FIRE DEPARTMENT EXTINGUISHED THE FIRE AND FILED A REPORT. THERE WERE NO INJURIES. THE VEHICLE WAS NOT DIAGNOSED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS UNKNOWN. THE VEHICLE WAS DESTROYED.",
        "vin": "YV1TS92D931"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/14/2016",
        "dateOfIncident": "02/22/2016",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10849576,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 VOLVO S80. THE CONTACT SMELLED FUEL INSIDE THE VEHICLE. IT WAS DIAGNOSED THAT THE FLANGE WAS CRACKED ON THE FUEL PUMP. THE MANUFACTURER WAS NOTIFIED. THE VIN WAS NOT AVAILABLE. THE APPROXIMATE FAILURE MILEAGE WAS 112,000.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/19/2016",
        "dateOfIncident": "11/07/2015",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10820957,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  THE DASHBOARD LIGHTS ARE NOT WORKING AT ALL.  I JUST BOUGHT THE CAR 2 MONTHS AGO.  WITHOUT THE DASHBOARD LIGHTS NOT WORKING, IT IS VERY DANGEROUS. I CAN NOT SEE HOW MANY MPH I AM GOING, AND CAN'T TELL HOW MUCH GAS I HAVE. ALSO AT NIGHT, IT IS COMPLETELY BLACK IN THE DASHBOARD AND IS VERY DANGEROUS. THIS HAPPENS DAY AND NIGHT. IT HAPPENED AS SOON AS I DROVE IT OFF THE LOT. I CALLED THE DEALER, AND THEY DID NOT WANT TO TAKE CARE OF IT. I PURCHASED THE CAR AT MICHELE MOTORS, LOCATED ON RT.88, BRICK, NJ.",
        "vin": "YV1TS92D131"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/25/2013",
        "dateOfIncident": "06/23/2013",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10521782,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR SHOWS EXACT SYMPTOMS OF THE VEHICLES INVOLVED IN  NHTSA RECALL # 09V483. RECALL INVOLVED CARS IN THE HOT WEATHER STATES OF US. AT THE TIME OF THE ORIGINAL RECALL I HAVE RESIDED IN THE MASSACHUSETTS WHICH WAS NOT INCLUDED IN THE INITIAL RECALL. I HAVE MOVED TO ARIZONA IN THE SUMMER OF 2010 AND NOW MY CAR IS SMELLING GAS AS RECALLED VEHICLES. TRIED TO CONTACT VOLVO DEALERS AND THY ARE STATING SINCE MY VIN IS NOT IN THE DATABASE OF RECALLED VEHICLES THEY WILL NOT PERFORM REPAIR ( UNLESS I WILL PAY FULL PRICE OF COURSE ).  *TR",
        "vin": "YV1TS92D531"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/28/2013",
        "dateOfIncident": "01/15/2013",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10495014,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER INFORMATION MODULE (DIM) ORIGINALLY STARTED DROPPING OUT AND RETURNING MULTIPLE TIMES DURING A TRIP,  NOW IT IS GOING OUT COMPLETELY AFTER ROUGHLY 15 MILES, NO CLUSTER GAUGES OR DASH LIGHTS.  WILL COME BACK ON AFTER COOL DOWN TIME OF ROUGHLY 2-3 HOURS.   NO SPEEDOMETER, TACH, GAS OR TEMP GAUGES.  SIGNAL LIGHTS WORK, BUT NO DASH INDICATORS.  *TR",
        "vin": "YV1TS91Z331"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/08/2012",
        "dateOfIncident": "12/01/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10447163,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 VOLVO S80. THE CONTACT WAS DRIVING APPROXIMATELY 60 MPH WHEN THERE WAS A SUDDEN REDUCTION IN ACCELERATION. THE ENGINE RPMS RACED CONTINUOUSLY.  THE VEHICLE HAD NOT BEEN DIAGNOSED OR REPAIRED FOR THE FAILURE. THE MANUFACTURER WAS NOTIFIED OF THE DEFECT. THE APPROXIMATE FAILURE MILEAGE WAS 123,000.",
        "vin": "YV1TS92D531"
    },
    {
        "components": "SERVICE BRAKES, ELECTRIC",
        "crash": false,
        "dateComplaintFiled": "10/24/2010",
        "dateOfIncident": "10/01/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10362161,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I KEEP GETTING ABS MODULE FAILURE ON VOLVO S80; EVERY TIME WE TAKE OUR CAR TO VOLVO DEALER, THEY COME UP WITH SOME MODULE FAILURE DIAGNOSIS. SEEMS LIKE A VOLVO GENERIC ISSUE WITH ABS MODULE FAILURE MESSAGE.     WE HAVE TRIED CONTACTING VOLVO ABOUT THIS AND THEY REALLY DID NOT HELP US. THEY HAVE ASKED ME TO TALK TO THE SERVICE MANAGER AT THE LOCAL VOLVO DEALERSHIP. HOWEVER SERVICE MANAGER HAS TOLD US THAT THIS IS NOT A TYPICAL VOLVO AND ASKED TO GET RID OF OUR CAR. PLEASE HELP. *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/12/2010",
        "dateOfIncident": "08/05/2009",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10335976,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 VOLVO S80 T6 - GM TRANSMISSION  NOTICED TRANSMISSION SHIFTING ODDLY BUT NO CODES.  CODES CAME AFTER CLIMBING HILL, TOOK TO VOLVO DEALER. CODE (DTC) 0053 PRESSURE SWITCH LOCK UP.  VOLVO SAYS REPLACE TRANSMISSION.   SOFTWARE UPGRADED - DID NOT FIX.    DECLINED.  TRANSMISSION SHIFTS ODDLY, CAR REV'S AND WON'T SHIFT WHERE IT NEEDS TO CAUSING TROUBLE WITH ACCELERATION AND DECELERATION.      THERE IS A CONSISTENT PROBLEM WITH VOLVO'S EARLY 90'S GM TRANSMISSIONS. *TR",
        "vin": "YV1TS91Z531"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/14/2009",
        "dateOfIncident": "07/06/2009",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10276822,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2003 VOLVO AND TWICE I HAVE HAD TO HAVE THE FRONT LENS ON THE HEAD :LIGHT  REPLACED, NOT BECAUSE IT WAS DAMAGED BY AN ACCIDENT BUT BECAUSE WHEN WATER HITS IT THE LENS CRACKS  ( IT HAPPENS WHEN THE AUTO  HAS BEEN RUNNING OR SITTING OUT OUTSIDE ) I BELIEVE THERE IS SOME KIND OF DEFECT IN THE LENS .  THIS IS NOT A CHEAP EXPENSE, I HAVE PAID OVER $500.00 EACH TIME I HAVE IT REPAIRED. THE VOLVO DEALER I GO TO DOES NOT SEEM TO CARE TO INVESTIGATE THIS, BUT I AM GETTING TIRED OF PAYING FOR SOMETHING THAT IS NOT MY FAULT. *TR",
        "vin": "YV1TS92D631"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/08/2008",
        "dateOfIncident": "06/02/2008",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10230258,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "HI, JUST HAD TO HAVE MY FUEL PUMP REPLACED TO THE TUNE OF WELL OVER A THOUSAND DOLLARS. COST AND PROBLEM FALL IN TO THE \"UNREAL\" CATEGORY. HARD TO BELIEVE THAT SOMETHING AS SIMPLE AS A FUEL PUMP HAS EVOLVED INTO A PIECE OF EQUIPMENT THAT APPARENTLY AS COMPLICATED AS SOMETHING THAT IS VITAL TO THE LAUNCH OF THE SHUTTLE. OH FOR THE DAYS WHEN A FUEL PUMP WAS ACTIVATED BY THE CAM SHAFT, HELD ON TO THE ENGINE WITH TWO BOLTS, COST FIVE DOLLARS, TOOK ABOUT TEN MINUTES TO REPLACE AND SELDOM FAILED. ACCORDING TO THE STEALERSHIP THAT DID MY WORK,  IN ORDER TO GET TO THE FUEL PUMP, THEY HAD TO REMOVE THE REAR SEAT TO GET TO THE FUEL PUMP? I HAVEN'T HAD TIME TO SURVEY THE TOTAL AMOUNT OF DAMAGE THEY DID IN DOING THIS, BUT DO KNOW THAT THE HEADLINER AND STEERING WHEEL ARE COVERED WITH GREASY HAND PRINTS AND AFTER THREE DAYS THERE IS STILL A STRONG ODOR OF GASOLINE IN THE CAR. MY VOLVO IS AN 03 S80 WITH ONLY 45,000 MILES ON IT. IS THIS TYPICAL OF VOLVO DEPENDABILITY AND EXCELLENCE? GUESS I'M GOING TO HAVE TO GO JAPANESE.  COMMENTS PLEASE.  *TR",
        "vin": "YV1TS92D531"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/21/2007",
        "dateOfIncident": "12/21/2007",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10212492,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "VOLVO",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ANGLE GEAR REPLACEMENT ON A 2003 VOLVO XC90 AWD.  *TR",
        "vin": "YV1CZ59H931"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/24/2007",
        "dateOfIncident": "09/20/2007",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10206798,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER PURCHASING A VOLVO S80 IN APRIL 2003 FROM VOLVO NORTH SCOTTSDALE, MY WIFE (WHO DRIVES THE CAR) BEGAN EXPERIENCING A FUEL INJECTION PROBLEM.  EACH TIME THE CAR WAS ROUTINELY SERVICED AT VOLVO NORTH SCOTTSDALE, SHE COMPLAINED OF THE PROBLEM, BUT THE DEALER FAILED TO REPAIR IT.  AFTER TIRING OF THE DETERIORATING SERVICE QUALITY AT VOLVO NORTH SCOTTSDALE, MY WIFE BEGAN HAVING THE CAR SERVICED AT POWELL VOLVO, TO WHOM SHE CONTINUED TO COMPLAIN OF THE FUEL INJECTION PROBLEM.  THAT DEALER ALSO FAILED TO REPAIR THE PROBLEM.  WHEN THE WARRANTY EXPIRED, MY WIFE HAD THE VEHICLE SERVICED AT AN INDEPENDENT MECHANIC, SWEDISH AUTO WERKS, TO WHOM SHE ALSO COMPLAINED OF THE FUEL INJECTION PROBLEM.  AT THIS TIME, THE CAR HAD BEEN DRIVEN 35,990 MILES. BY THIS TIME, SHE WAS ALSO EXPERIENCING AN INTERMITTENT SLOW/LONG CRANK STARTING THE CAR, WHICH WAS THOUGHT TO BE DUE TO A FAILING BATTERY.  SHE COMPLAINED OF THIS ALSO TO SWEDISH AUTO WERKS.  SWEDISH AUTO WERKS DIAGNOSED THE CAUSES OF THE PROBLEM AS NOT ONLY A FAILING BATTERY BUT ALSO A CRACKED FUEL PUMP HOSE NIPPLE.  IN ADDITION TO A NEW BATTERY, IT INSTALLED A NEW FUEL PUMP ASSEMBLY AT A COST OF $821.97.  THE CAR NOW RUNS VERY WELL.  IN A SUBSEQUENT CONVERSATION WITH ANOTHER VOLVO OWNER, MY WIFE LEARNED AND HAS SINCE CONFIRMED THAT THIS FUEL PUMP PROBLEM HAS BEEN RECURRENT WITH THE VOLVO S SERIES SINCE AL LEAST 2002-03 AND THAT VOLVO KNOWS OF IT.  MY WIFE ALSO LEARNED THAT THERE HAS BEEN A \"SILENT RECALL\" PROMPTED BY THIS PROBLEM--I.E., IF THE PROBLEM IS RECOGNIZED BY A VOLVO DEALER, VOLVO WILL FIX IT AT NO COST TO THE OWNER.   NEITHER VOLVO NORTH SCOTTSDALE NOR POWELL VOLVO IDENTIFIED THE PROBLEM DESPITE MY WIFE'S REPEATED COMPLAINTS TO THEM.  BY OCTOBER 4, 2007 LETTER AND ATTACHED COPY OF THE REPAIR INVOICE TO VOLVO CUSTOMER CARE CENTER, I REQUESTED REIMBURSEMENT.  IN REPLY, VOLVO DENIED MY REQUEST, STATING THAT THERE HAD BEEN NO RECALL.  THE DATE BELOW IS WHEN THE REPAIR WAS MADE.    *TR",
        "vin": "YV1TS92D731"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/04/2007",
        "dateOfIncident": "08/20/2007",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10205035,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "VOLVO",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "1.  THERE IS A WHOOPING CRANE  SOUND WHEN I STEP ON THE FOOT FEED AND THEN RELEASE.  THE DEALER SAID IT WAS REPAIRED AND THEN WHEN I DROVE IT HOME IT WAS STILL MAKING THE NOISE.  AFTER NO RESPONSE FROM MY COMPLAINT TO THEM I STOPPED THE PAYMENT VIA AE AND HAVE STILL HEARD NOTHING.  I THINK I PUT THE WRONG YEAR OF MY VEHICLE IN THE BEGINNING AND IF I TRY TO GO BACK I LOOSE EVERYTHING.  IT IS A 2003 XC90 PURCHASED IN 12/02.  THANK YOU FOR ANY HELP YOU CAN GIVE.  IF YOU CAN'T HELP, PLEASE AT LEAST SEND ME AN EMAIL AND TELL ME SO.  THANKS.  2.  ANOTHER PROBLEM THAT STARTED IN JULY 2006 IS A KNOCKING NOISE COMING FROM UNDERNEATH THE VEHICLE.  AFTER NUMEROUS TRIPS TO THE DEALER I WAS TOLD A NEW BOX  FOR THAT PARTICULAR ITEM AND IT WOULD COST $2800.00 TO REPAIR.  BUT THEY COULD NOT GUARANTEE THAT WOULD FIX THE PROBLEM.  MY XC90 HAD A 4 YR OR 50,000 WARRANTY.  THIS PROBLEM STARTED IN JULY 2006 WITH 41800 MILES.  I TOOK POSSESSION OF THE CAR IN 12/02 SO MY MATH SAYS THE WARRANTY EXPIRED 12/06 AND THAT MEANS IT WAS STILL UNDER WARRANTY WHEN THIS WAS FIRST NOTICED.  I HAVE HAD THE VEHICLE IN AT LEAST  EVERY 4 MONTHS FOR SERVICE AND EACH TIME COMPLAINED ABOUT IT.  ALSO I HAD IT IN AT LEAST 5 TIMES FROM JUNE THRU JULY 2007 WITH NO SATISFACTION.  NOW THEY DON'T EVEN ANSWER MY EMAILS OR RETURN MY PHONE CALLS.  I HAVE CONTACTED THE CONSUMER COMPLAINT DEPARTMENT OF VOLVO AND THEY HAVE NEVER ANSWERED ME.  I AM AT A LOSS AS TO WHAT TO DO.  THIS CAR WAS PURCHASED AT POWER VOLVO OF CERRITOS (THEN IT WAS CALLED VOLVO OF CERRITOS)  PLEASE HELP ME!   *TR",
        "vin": "YV1CZ91H831"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/05/2006",
        "dateOfIncident": "12/29/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10147035,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "AN S80, 2003 NEW, LOST THE RIGHT FRONT WHEEL WHEN THE BALL JOINT FAILED AT 27,000 MILES. VOVLVO REPLACED THE RIGHT AND LEFT FRONT BALL JOINTS UNDER WARRANTY. THEY SAID THIS HAPPENS SOMETIMES. HAD WE NOT BEEN ON A LOCAL ROAD TRAVELLING 20 MPH THERE COULD HAVE BEEN SERIOUS INJURY.     THE STEERING PROBLEM HAS EXISTED SINCE 3/05. THE VOVLO DEALERSHIP SAID, IN MARCH OF 2005  THE STEERING PROBLEM WAS DO TO A LOOSE HOSE CONNECTION WHICH THEY CORRECTED. THE CAR CONTINUED TO STEER, FROM TIME TO TIME,  LIKE IT WAS PLANING.     CROWN VOLVO OF CHAPEL HILL NC IS THE DEALER. THEY HAVE OFFERED TO TAKE OVER THE LAST TWO LEASE PAYMENTS IF I BUY A NEW VOLVO.  *NM",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/31/2005",
        "dateOfIncident": "02/04/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10122509,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CARRIER BIKE RACK AND 2 BIKES FLEW OFF THE ROOF OF A S-80 VOLVO(2003) WHILE DRIVING ON THE FLORIDA TURNPIKE.LUCKILY NO ONE  WAS CLOSE BEHIND AND I WAS ABLE TO REMOVE THE WRECKAGE FROM THE HIGHWAY.I COMPLAINED TO VOLVO BUT THEY CLAIMED THAT IT WAS MY FAULT.NOTHING WAS REPLACED.SOMEWHERE IN THE MANUAL IT SAYS TO CHECK THE RACK.THERE IS NO WARNING LABEL ON RACK AND AS IT IS ENCLOSED THERE IS NO EVIDENT WAY TO SECURE.THERE ARE  FINGERS IN THE SLOT ON TOP OF THE CAR BUT THE ROOF MATERIL IS SO FLIMSY THAT IT APPEARED TO HAVE ENOUGH GIVE SO THAT THE ROOF RACK COULD DISENGAGE.VOLVOS ATTITUDE ISS THAT THE DRIVER MUST CONSTATANTLY CHECK THE ROOF RACK. IF THIS IS SO THE LEAST THEY COULD DO IS PUT A WARNING LABEL ON SAME.I AM FOTUNATE NO ONE WAS INJURED BUT I THINK THERE IS A SERIOUS PROBLEM.I HAD A VERY LIGHT LOAD BUT I SEE VOLVOS WITH HEAVY BOXES ON THEM AND I SHUDDER TO THINK WHAT MIGHT HAPPEN.",
        "vin": "YV1TS92D131"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": true,
        "dateComplaintFiled": "05/25/2005",
        "dateOfIncident": "05/20/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10122130,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "RE: 2003, VOLVO S80.  I HAD JUST PULLED INTO A PARKING SPACE AT MY PRESCHOOL SON'S SCHOOL, I WENT TO SHIFT GEARS AND TAKE MY FOOT OFF THE BRAKE AND MY CAR HAD A SUDDEN ACCELERTATION CAUSING ME TO BE WITHOUT CONTROL OF MY CAR FOR OVER 50 FEET, HITTING A TREE, 3 SHRUBS AND A 3000 LB. ROCK.  MY PRESCHOOLER AND I SUSTAINED MINOR INJURIES BUT MY CAR IS TOTALLED. MY CAR IS IN AN AUTO BODY SHOP AWAITING INSURANCE APPROVAL FOR A TOTALLED CAR. MY SON IS TRAUMATIZED AND I WAS SHAKEN UP FOR DAYS.  I AM CONCERNED THAT THERE WAS A MACHANICAL FAILURE BUT I HAVE NOT RECEIVED A CALL BACK FROM VOLVO ABOUT AN INVESTIGATION.  I WOULD LIKE TO REQUEST A FORMAL INVESTIGATION INTO THIS.",
        "vin": "YV1TS91Z331"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/20/2004",
        "dateOfIncident": "03/19/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10063566,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE APPLYING THE BRAKES, A LOUD NOISE WAS HEARD COMING FROM THE FRONT WHEEL. CONSUMER  SHIFTED THE GEAR INTO DRIVE AND THEN REVERSE AND THE LOUD NOISE WAS HEARD AGAIN.  THE CONSUMER DROVE THE VEHICLE TO THE DEALER FOR INSPECTION AND  THE MECHANIC COULD NOT DUPLICATE THE PROBLEM. *AK   *JB",
        "vin": "YV1TS92D831"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/19/2004",
        "dateOfIncident": "03/19/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10063560,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE APPLYING BRAKES A LOUD NOISE WAS HEARD COMING FROM THE FRONT WHEEL.  CONSUMER SHIFTED THE GEAR IN REVERSE AND THE NOISE RECURRED.   CONSUMER DROVE THE VEHICLE  TO DEALER FOR INSPECTION, BUT MECHANIC WAS UNABLE TO RESOLVE THE PROBLEM. *AK",
        "vin": "YV1TS92D831"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/27/2004",
        "dateOfIncident": "01/27/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10055885,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AND TURNING LEFT, THE CONSUMER HEARD A NOISE  LIKE METAL RUBBING TOGETHER COMING FROM THE STEERING WHEEL.  THE VEHICLE WAS TAKEN TO THE DEALER AND THEY REPLACED THE BELTS, HOSES AND A TUBE. PLEASE PROVIDE FURTHER INFORMATION.   *JB",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/29/2003",
        "dateOfIncident": "11/26/2003",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10051289,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DEAR [XXX]. ,HIS IS TO NOTIFY ABOUT THE FAILURE OF THE VEHICLE S80 ON THE HIGHWAY AND THE  DIFFICULTY WE ARE FACING WITH THE DEALER THAT SOLD THE CAR TO US.    I, [XXX]  HAS BOUGHT THE CAR WITH WIN # [XXX],   FROM DARRELL WALTRIP VOLVO IN FRANKLIN TN ON 11/01/03. ON 11/26/03 THE VEHICLE   SUDDENLY STOPPED AND IT WAS TAKEN TO THE DEALER. AFTER A WEEK WE WERE TOLD THE   GAS INDICATOR IS BROKEN. MY ATTEMPTS TO GET A WRITTEN REPORT ABOUT THE CAUSE FOR   THE VEHICLE FAILURE HAVE BEEN UNSUCCESSFUL.     THE EVENT WAS VERY TRAUMATIC TO MY WIFE WHO WAS DRIVING THE VEHICLE AT THAT   TIME. SHE WAS 9 MONTHS PREGNANT AND DUE TO DELIVER THE FOLLOWING WEEK. WITH THE   SHOCK SHE HAS GONE THROUGH SHE IS SCARED TO DRIVE THE VEHICLE. THE GENERAL   MANAGER [XXX] RESPONSE WAS THAT \" PEOPLE CAN HAVE SHOCK EVEN WITH   A FLAT TYRE\".  WE APPRECIATE YOUR INTERVENTION AND RESPONSE IN THIS MATTER.  *AK      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "YV1TS92D241"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/09/2003",
        "dateOfIncident": "09/09/2003",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10037510,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2000 VOLVO S80--THE AUTOMATICE STABILIZING SYSTEM AND ABS BRAKING SYSTEM FAILURE LIGHTS COME ON INTERMITTENTLY.  OUR MECHANIC (VOLVO EXPERT, BUT NOT EMPLOYED BY A DEALERSHIP) SAYS THIS IS A COMMON FAULT IN THE S-80S WHEN THEY REACH 50,000 MILES.  THE DEALERSHIP IS CLAIMING IT IS A $1000 REPAIR--BECAUSE THE CAR HAS 60,000 MILES AND IS OUT OF WARRANTY.      THIS APPEARS TO BE A SUBSTANTIAL SOFTWARE CONTROL DESIGN PROBLEM THAT SHOULD NOT BE OCCURRING AND IS QUITE DANGEROUS UNLESS IT IS REPAIRED PROPERLY.*AK",
        "vin": "YV1TS94D2Y1"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/01/2003",
        "dateOfIncident": "08/30/2003",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10037000,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A VOLVO S80 IN JANUARY 2003. BOTH OF THE HEADLIGHT GLASS ASSEMBLIES HAVE CRACKED FROM NO APPARENT IMPACT. THE FIRST WAS IN APRIL, AND THE SECOND IN AUGUST. I BELEIVE THERE IS A HEADLIGHT ASSEMBLY DEFECT. I LIVE IN A VERY HOT CLIMATE, AND THE HEAT MAY CRACK THE GLASS. *AK",
        "vin": "YV1TS92DX31"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "04/02/2003",
        "dateOfIncident": "03/31/2003",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10015004,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "VOLVO",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SIDE MIRRORS FAILED TO STAY IN THE POSITION THEY WERE SET IN, WHICH MADE IT DIFFICULT TO SEE WHILE DRIVING.   *JB",
        "vin": ""
    }
]