[
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/28/2020",
        "dateOfIncident": "01/10/2018",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326325,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "C70",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 VOLVO C70. THE CONTACT STATED THAT THE VEHICLE EXPERIENCED INTERMITTENT FAILURES WHILE STARTING AND DRIVING THE VEHICLE. THE CONTACT STATED THAT IN WARMER WEATHER, THE GEAR SHIFTER FAILED TO SHIFT AS DESIGNED. THE VEHICLE WAS TAKEN TO LEIKIN MOTOR COMPANIES (38750 MENTOR AVE #1, WILLOUGHBY, OH 44094), TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THE TRANSMISSION AND IGNITION NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 90,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/30/2012",
        "dateOfIncident": "08/29/2012",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10473005,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "C70",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE KEY WON'T TURN FOR THE IGNITION. THIS IS A KNOWN PROBLEM WITH THE DEALERSHIP BUT VOLVO WON'T RECOGNIZE THE PROBLEM. THE COST TO FIX THIS AT THE DEALERSHIP IS APPROX 800 DOLLARS. MY FEAR IS THAT THIS PROBLEM WILL LEAVE U STRANDED AND MORE IMPORTANTLY I FEAR THIS WILL PROGRESS AND LOCK THE STEERING WHEEL WHILE YOU ARE DRIVING.  *TR",
        "vin": "YV1NC63D33J"
    },
    {
        "components": "ELECTRICAL SYSTEM,INTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/21/2011",
        "dateOfIncident": "06/01/2009",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10383915,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "C70",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 C70 CONV.  CAR BATTERY GOES DEAD MULTIPLE TIMES. CHANGED BATTERY AND IT CONTINUES TO HAPPEN. DETAILED CHECK DISCOVERED A SHORT IN THE PASSENGER SUN VISOR. PLASTIC PIVOT SHAFT HAS TORQUED OFF AND CAUSED A SHORT IN THE WIRES EMBEDDED IN THE SHAFT THAT POWER THE VISOR LIGHT. REPLACEMENT SUN VISOR COSTS AROUND $200 AND THE WEAK SHAFT IS THE SAME, SO FAILURE WILL MOST LIKELY HAPPEN AGAIN. SHAFT NEEDS TO BE REDESIGNED TO ALLOW FOR GREATER TORQUE WHEN LOWERING THE SUN VISOR. REMOVAL OF THE BULB IN THE AFFECTED VISOR ELIMINATED THE BATTERY DRAIN. POTENTIAL FIRE HAZARD.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/02/2009",
        "dateOfIncident": "02/17/2009",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10260420,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "C70",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION/RADIATOR FAILURE.  COOLANTS MIXING WITH EACH OTHER AND CAUSING TRANSMISSION TO SLIP IN AND OUT OF GEAR AT LOWER SPEEDS. DEALER SAYS $5000.00 TO REPAIR/REPLACE BOTH TRANNY AND RADIATOR. I HAD TAKEN MY 2003 VOLVO C-70 CONVERTIBLE IN 6 MONTHS PRIOR COMPLAINING OF A LOW WHIRRING NOISE WHICH THEY COULD NOT DETECT OR WOULD NOT DETECT. I ASKED ABOUT WARRANTY/OR SECRET WARRANTY AND THEY SAID THERE WERE NONE AND THAT VOLVO WOULDN'T PAY FOR REPAIR, THEY ALSO STATED THAT THIS HAS BEEN HAPPENING QUITE A BIT. CONSUMERS ARE FOOTING THE BILL FOR THIS MANUFACTURE DEFECT. *TR",
        "vin": "YV1NC63D43J"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/21/2007",
        "dateOfIncident": "12/21/2007",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10212492,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "VOLVO",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ANGLE GEAR REPLACEMENT ON A 2003 VOLVO XC90 AWD.  *TR",
        "vin": "YV1CZ59H931"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/04/2007",
        "dateOfIncident": "08/20/2007",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10205035,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "VOLVO",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "1.  THERE IS A WHOOPING CRANE  SOUND WHEN I STEP ON THE FOOT FEED AND THEN RELEASE.  THE DEALER SAID IT WAS REPAIRED AND THEN WHEN I DROVE IT HOME IT WAS STILL MAKING THE NOISE.  AFTER NO RESPONSE FROM MY COMPLAINT TO THEM I STOPPED THE PAYMENT VIA AE AND HAVE STILL HEARD NOTHING.  I THINK I PUT THE WRONG YEAR OF MY VEHICLE IN THE BEGINNING AND IF I TRY TO GO BACK I LOOSE EVERYTHING.  IT IS A 2003 XC90 PURCHASED IN 12/02.  THANK YOU FOR ANY HELP YOU CAN GIVE.  IF YOU CAN'T HELP, PLEASE AT LEAST SEND ME AN EMAIL AND TELL ME SO.  THANKS.  2.  ANOTHER PROBLEM THAT STARTED IN JULY 2006 IS A KNOCKING NOISE COMING FROM UNDERNEATH THE VEHICLE.  AFTER NUMEROUS TRIPS TO THE DEALER I WAS TOLD A NEW BOX  FOR THAT PARTICULAR ITEM AND IT WOULD COST $2800.00 TO REPAIR.  BUT THEY COULD NOT GUARANTEE THAT WOULD FIX THE PROBLEM.  MY XC90 HAD A 4 YR OR 50,000 WARRANTY.  THIS PROBLEM STARTED IN JULY 2006 WITH 41800 MILES.  I TOOK POSSESSION OF THE CAR IN 12/02 SO MY MATH SAYS THE WARRANTY EXPIRED 12/06 AND THAT MEANS IT WAS STILL UNDER WARRANTY WHEN THIS WAS FIRST NOTICED.  I HAVE HAD THE VEHICLE IN AT LEAST  EVERY 4 MONTHS FOR SERVICE AND EACH TIME COMPLAINED ABOUT IT.  ALSO I HAD IT IN AT LEAST 5 TIMES FROM JUNE THRU JULY 2007 WITH NO SATISFACTION.  NOW THEY DON'T EVEN ANSWER MY EMAILS OR RETURN MY PHONE CALLS.  I HAVE CONTACTED THE CONSUMER COMPLAINT DEPARTMENT OF VOLVO AND THEY HAVE NEVER ANSWERED ME.  I AM AT A LOSS AS TO WHAT TO DO.  THIS CAR WAS PURCHASED AT POWER VOLVO OF CERRITOS (THEN IT WAS CALLED VOLVO OF CERRITOS)  PLEASE HELP ME!   *TR",
        "vin": "YV1CZ91H831"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "04/02/2003",
        "dateOfIncident": "03/31/2003",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10015004,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "VOLVO",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SIDE MIRRORS FAILED TO STAY IN THE POSITION THEY WERE SET IN, WHICH MADE IT DIFFICULT TO SEE WHILE DRIVING.   *JB",
        "vin": ""
    }
]