[
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/04/2011",
        "dateOfIncident": "02/01/2011",
        "fire": false,
        "manufacturer": "Winnebago Industries, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10380230,
        "products": [
            {
                "manufacturer": "Winnebago Industries, Inc.",
                "productMake": "WINNEBAGO",
                "productModel": "ADVENTURER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 WINNEBAGO ADVENTURER. WHILE DRIVING APPROXIMATELY 55 MPH THE CONTACT FELT A VIBRATION IN THE VEHICLE. THE CONTACT PULLED OVER TO THE SIDE OF THE ROAD AND INSPECTED THE VEHICLE. THE CONTACT DID NOT FIND ANY PROBLEMS. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE THE MECHANIC STATED THAT THE REAR CALIPERS LOCKED UP AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE CONTACT RECEIVED RECALL NOTICE NHTSA CAMPAIGN ID NUMBER: 03V060000, SERVICE BRAKES, HYDRAULIC:SWITCHES:BRAKE WARNING. THE MANUFACTURER ADVISED THE CONTACT THAT WHEN THE PARTS BECAME AVAILABLE HE WOULD BE NOTIFIED. THE MANUFACTURER WAS CONTACTED AFTER THE FAILURE OCCURRED AND STATED THEY WOULD NOT REIMBURSE THE CONTACT FOR THE REPAIRS BECAUSE THEY WERE NOT DONE BY AN AUTHORIZED DEALER. THE VEHICLE WAS REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 29,849.",
        "vin": "5B4MP67G423"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/05/2010",
        "dateOfIncident": "10/08/2009",
        "fire": false,
        "manufacturer": "Winnebago Industries, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10306740,
        "products": [
            {
                "manufacturer": "Winnebago Industries, Inc.",
                "productMake": "WINNEBAGO",
                "productModel": "ADVENTURER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE EXPERIENCED BRAKE DRAG FOR A THIRD TIME ON MY MOTOR HOME AND AM FILING A THIRD COMPLAINT.  TRAVEL WAS ON LEVEL ROADS IN URBAN AREA TRAFFIC (LOW SPEED STOP AND GO) WHEN THE FRONT BRAKES BEGAN TO DRAG.  I FOUND A SAFE PLACE TO PULL OFF THE ROAD SURFACE AND HAD TO WAIT HOURS FOR THE BRAKES TO COOL DOWN.  I WAS ABLE TO PROCEED HOME BY BEING VERY CAUTIOUS WITH APPLYING BRAKES AND AVOIDING ANY CONGESTED AREAS.  I HAD THE WORKHORSE AUTHORIZED SERVICE CENTER INSPECT THE BRAKES AND THEY FOUND NO EXTERNAL CAUSE FOR THE DRAG (CORRODED SLIDES, ETC.)  ROTORS WERE REPLACED AFTER THE FIRST OCCURRENCE (MAR 2009) AND BRAKE FLUID WAS CHANGED TO MAKE SURE MOISTURE RETENTION WAS NOT A PROBLEM.  I HAVE BEEN FORCED TO PAY FOR ALL OF THE WORK TO DATE - WORKHORSE IS NOT INSPECTING THEIR BRAKES AFTER PROBLEMS HAVE BEEN EXPERIENCED AS STATED IN YOUR \"DEFECT INVESTIGATION EA07016 DEALERS WILL INSPECT AND REPLACE THE NECESSARY COMPONENTS FREE OF CHARGE\"  THE OWNER IS RESPONSIBLE FOR ALL DIAGNOSTIC CHARGES. *TR",
        "vin": "5B4MP67G933"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/12/2009",
        "dateOfIncident": "08/11/2009",
        "fire": false,
        "manufacturer": "Winnebago Industries, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10280197,
        "products": [
            {
                "manufacturer": "Winnebago Industries, Inc.",
                "productMake": "WINNEBAGO",
                "productModel": "ADVENTURER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 WINNEBAGO ADVENTURER RV.  THE CONTACT STATED THAT THE CALIPER ON THE FRONT BRAKES LOCKED UP.  WORKHORSE CHASSIS ISSUED RECALL NUMBER 50901-C AND STATED THAT THE PARTS WOULD NOT BE AVAILABLE UNTIL THE FALL OF 2009.  THE CONTACT WAS ADVISED TO BRING IN THE VEHICLE FOR A BRAKE REPLACEMENT IF ANY FAILURES BEGAN TO OCCUR.  THE CONTACT TOOK THE VEHICLE TO THE DEALER, BUT THEY CURRENTLY DO NOT WANT TO REPLACE THE BRAKES.  THE FAILURE MILEAGE WAS 18,000.",
        "vin": "5B4MP67G933"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/25/2009",
        "dateOfIncident": "01/19/2009",
        "fire": false,
        "manufacturer": "Winnebago Industries, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10256254,
        "products": [
            {
                "manufacturer": "Winnebago Industries, Inc.",
                "productMake": "WINNEBAGO",
                "productModel": "ADVENTURER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2003 WINNEBAGO ADVENTURER 38G WITH WORKHORSE CHASSIS HAD A REAR BRAKE FAILURE THAT WAS IDENTICAL TO BRAKE FAILURES COVERED BY A WORKHORSE RECALL THROUGH THE 2002 MODELS.  AFTER CONSIDERABLE CORRESPONDENCE WITH WORKHORSE & FINALLY WITH WINNEBAGO, WORKHORSE RELUCTANTLY AGREED TO PAY 1/2 OF THE COST.  ON JANUARY 19, 2009, THE FRONT BRAKES FAILED ON THIS SAME MOTOR HOME.  I AM NOW LOOKING AT OVER $2,000 IN REPAIRS.  IT IS SUPPOSE TO BE COMPLETED BY COGGIN CHEVROLET AT THE AVENUES, JACKSONVILLE, FL. ON MONDAY, JANUARY 26, 2009.  MIRACULOUSLY, WE WERE ONLY ABOUT 5 MILES FROM COGGIN WHEN THE FRONT BRAKES FAILED.  THEY OTHERWISE WOULD HAVE CAUGHT ON FIRE PRIOR TO GETTING TO COGGIN.  THE FRONT BRAKES WERE SO HOT THAT THE BRAKE SENSORS WERE MELTED.  THE COGGIN (WORKHORSE) MECHANIC SAID THIS HAS HAPPENED ON OTHER 2003 WINNEBAGO ADVENTURER 38G MOTOR HOMES. *TR",
        "vin": "5B4MP67G933"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/01/2008",
        "dateOfIncident": "11/01/2008",
        "fire": false,
        "manufacturer": "Winnebago Industries, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10250408,
        "products": [
            {
                "manufacturer": "Winnebago Industries, Inc.",
                "productMake": "WINNEBAGO",
                "productModel": "ADVENTURER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 WINNEBAGO ADVENTURER.  WHILE DRIVING 40 MPH, THE BRAKE CALIPERS BEGAN TO STICK WHEN THE BRAKE PEDAL WAS DEPRESSED.  THE FAILURE CAUSED OTHER BRAKING ISSUES.  THE VEHICLE WAS TAKEN TO A REPAIR SHOP AND THE MECHANIC STATED THAT THE HEAT FROM THE BRAKES WAS OVER 1,000 DEGREES.  THE REPAIR WOULD COST APPROXIMATELY $4,000.  THE CONTACT IS CONTEMPLATING ON WHETHER OR NOT TO REPAIR THE VEHICLE.  THE FAILURE MILEAGE WAS 40,000.",
        "vin": "5B4MP67GX23"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/15/2008",
        "dateOfIncident": "11/05/2007",
        "fire": false,
        "manufacturer": "Winnebago Industries, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10234383,
        "products": [
            {
                "manufacturer": "Winnebago Industries, Inc.",
                "productMake": "WINNEBAGO",
                "productModel": "ADVENTURER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING ON THE HIGHWAY I COULD NOT GO ANY FASTER THAN 40 MPH.  THE ABS WARNING LIGHT THEN LIT UP ON THE INSTRUMENT PANEL OF MY MOTORHOME WITH A WORKHORSE W-20 CHASSIS.  I THEN BEGAN TO SMELL BURNING BRAKES. I THEN SLOWED AND TRAVELED A MILE OR SO TO THE NEAREST EXIT. WHILE ON THE EXIT RAMP I LOST ALL BRAKES, THE PEDAL GOING TO THE FLOOR. AS I WAS NOT GOING VERY FAST, I USED THE TRANSMISSION TO SLOW DOWN AND PULL ONTO THE SHOULDER. THE VEHICLE WAS THEN TOWED TO A LOCAL WINNEBAGO DEALER WHERE IT WAS NECESSARY FOR THEM TO REPLACE ALL CALIPERS AND PADS, REAR ABS SENSORS, AND BRAKE FLUIDS AS IT HAD BOILED THE SYSTEM. A ZERK FITTING WAS ALSO INSTALLED INTO THE BRAKE BAR. AFTER READING NUMEROUS OTHER COMPLAINTS ABOUT SIMILAR INCIDENTS I THOUGHT IT BEST TO FILE A COMPLAINT.  *TR",
        "vin": "5B4MP67G733"
    },
    {
        "components": "TRAILER HITCHES",
        "crash": false,
        "dateComplaintFiled": "06/26/2008",
        "dateOfIncident": "04/24/2008",
        "fire": false,
        "manufacturer": "Winnebago Industries, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10232856,
        "products": [
            {
                "manufacturer": "Winnebago Industries, Inc.",
                "productMake": "WINNEBAGO",
                "productModel": "ADVENTURER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 WINNEBAGO ADVENTURER TOW-BAR RECEIVER BECAME UNBOLTED ON THE LEFT SIDE WHILE DRIVING. CONSUMER STATES THAT THE TOW BAR WAS ALSO BENT BACKWARD AND DOWN SINCE THE RIGHT SIDE WAS STILL SECURELY BOLTED.  *KB  THE OWNER OF THE WELDING SHOP STATED THE BOLTS WERE NEVER TIGHTENED PROPERLY. *JB",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/30/2008",
        "dateOfIncident": "03/28/2005",
        "fire": true,
        "manufacturer": "Winnebago Industries, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10216487,
        "products": [
            {
                "manufacturer": "Winnebago Industries, Inc.",
                "productMake": "WINNEBAGO",
                "productModel": "ADVENTURER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 WINNEBAGO ADVENTURER.  WHILE DRIVING APPROXIMATELY 40 MPH AND DEPRESSING THE BRAKE PEDAL, THE CONTACT SMELLED A STRONG BURNING ODOR.  THE DEALER REPAIRED HIS VEHICLE ACCORDING TO NHTSA CAMPAIGN ID NUMBER 03V060000 (SERVICE BRAKES, HYDRAULIC:SWITCHES:BRAKE WARNING).  FIFTEEN MONTHS LATER, THE ABS WARNING LIGHT ILLUMINATED ON THE INSTRUMENT CONTROL PANEL ACCOMPANIED BY THE BURNING ODOR.  HE TOOK THE VEHICLE BACK TO THE DEALER AND THEY REPAIRED THE FRONT HUB SEALS, BRAKE PADS, AND ABS SENSORS.  ONE YEAR LATER, WHILE ATTEMPTING TO APPLY PRESSURE TO THE BRAKES, THE BRAKE PEDAL EXTENDED COMPLETELY TO THE FLOOR WITHOUT STOPPING THE VEHICLE.  THE CONTACT TOOK THE VEHICLE TO THE DEALER AND THEY FLUSHED OUT THE BRAKE FLUID AND INSTALLED TWO NEW BRAKE SENSORS.  THE POWERTRAIN, ENGINE SIZE, AND NUMBER OF CYLINDERS WERE UNKNOWN.  THE FAILURE MILEAGE WAS 20,634 AND CURRENT MILEAGE WAS 40,396.",
        "vin": "5B4MP67G633"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/15/2007",
        "dateOfIncident": "10/08/2007",
        "fire": false,
        "manufacturer": "Winnebago Industries, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10205700,
        "products": [
            {
                "manufacturer": "Winnebago Industries, Inc.",
                "productMake": "WINNEBAGO",
                "productModel": "ADVENTURER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 WINNEBAGO ADVENTURER 203WFG35U.  WHILE DRIVING APPROXIMATELY 50 MPH UNDER DRY CONDITIONS, THE VEHICLE BEGAN TO DECELERATE ON ITS OWN.  THE CONTACT STATED THAT HE COULD FEEL THE VEHICLE DOWNSHIFTING AND HE BEGAN TO SMELL SOMETHING BURNING.  NEXT, THE ABS LIGHT, WARNING BUZZER, AND BRAKE LIGHT ILLUMINATED.  HE PULLED OFF THE ROAD AND NOTICED THAT THE REAR TIRES WERE TOO HOT TO TOUCH DUE TO THE BRAKES LOCKING UP.  THE VEHICLE WAS TAKEN TO THE DEALER AND THEY STATED THAT THERE WAS EXTENSIVE DAMAGE TO THE ROTORS, CALIPERS, BRAKE PADS, AND HOSES DUE TO THE HEAT.  THE CURRENT AND FAILURE MILEAGES WERE 37,000.",
        "vin": "5B4MP67GX33"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "08/12/2006",
        "dateOfIncident": "06/18/2006",
        "fire": false,
        "manufacturer": "Winnebago Industries, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10165305,
        "products": [
            {
                "manufacturer": "Winnebago Industries, Inc.",
                "productMake": "WINNEBAGO",
                "productModel": "ADVENTURER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SIDE WINDOWS ON MY 2003 WINNEBAGO ADVENTURER HAVE FOGGED UP, LIMITING VISIBILITY AND BEGUN TO LEAK.  THESE WINDOWS WERE THERMO-PANED GLASS.  *JB",
        "vin": "5B4MP67G333"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "09/16/2005",
        "dateOfIncident": "05/06/2005",
        "fire": false,
        "manufacturer": "Winnebago Industries, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10136768,
        "products": [
            {
                "manufacturer": "Winnebago Industries, Inc.",
                "productMake": "WINNEBAGO",
                "productModel": "ADVENTURER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR THE THIRD STRAIGHT YEAR I HAVE HAD TO TAKE IT MY 2003 WINNEBAGO ADVENTURER TO AN AUTHORIZED WORKHORSE SERVICE CENTER BECAUSE THE DASHBOARD AIR CONDITIONING WASN'T COOLING. EACH TIME THE REFRIGERANT WAS GONE,  THEY SAID NO LEAKS COULD BE FOUND AND THEY JUST RECHARGED THE SYSTEM. THEY SAID THE \"O\" RINGS MIGHT BE DRYING UP OVER WINTER AND THEN THE REFRIGERANT IS LOST.   I HAVE CONTACTED GENERAL MOTORS BECAUSE MUCH OF THE AIR CONDITIONING IS MOUNTED ON THEIR ENGINE. THEY TOLD ME IN A PHONE CONVERSATION THAT WORKHORSE HAS TO RECTIFY THE PROBLEM.    I THEN E-MAILED WORKHORSE WITH MY PROBLEM. THIS IS THE RESPONSE I RECEIVED FROM THEM:     THANK YOU VERY MUCH FOR YOUR EMAIL AND FOR CONTACTING WORKHORSE CUSTOM CHASSIS. WORKHORSE SUPPLIES THE CONDENSER, COMPRESSOR AND DRYER, WINNEBAGO SUPPLIES THE REST OF THE A/C. YOU MIGHT ALSO TRY CONTACTING WINNEBAGO. FOR OUR TECHNICAL ASSISTANCE GROUP (WORKHORSE), PLEASE FEEL FREE TO CALL 877 246.    NEXT I CONTACTED WINNEBAGO, AFTER ALL, IT IS THEIR NAME ON THE SIDE OF THE MOTOR HOME. MY RESPONSE FROM THEM WAS THAT THERE WAS NOTHING THEY COULD DO AND TOLD ME TO CONTACT WORKHORSE.  *NM",
        "vin": "5B4MP67G533"
    },
    {
        "components": "STEERING,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "11/05/2004",
        "dateOfIncident": "11/01/2004",
        "fire": false,
        "manufacturer": "Winnebago Industries, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10101463,
        "products": [
            {
                "manufacturer": "Winnebago Industries, Inc.",
                "productMake": "WINNEBAGO",
                "productModel": "ADVENTURER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONSUMER FEELS THAT THE COOLING SYSTEM INSTALLED BY THE WORKHORSE FACTORY IS INADEQUATE.  *NM  THE CONSUMER STATED THAT WORKGORSE SHOULD DO THE UPGRADE FREE OF CHARGE.  THE CONSUMER ALSO STATED THAT THE NEW WORKHORSE LEATHER STEERING WHEEL FOR BETTER GRIP SHOULD BE INSTALLED FREE OF CHARGE.  *TC",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/13/2004",
        "dateOfIncident": "09/23/2004",
        "fire": false,
        "manufacturer": "Winnebago Industries, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10096716,
        "products": [
            {
                "manufacturer": "Winnebago Industries, Inc.",
                "productMake": "WINNEBAGO",
                "productModel": "ADVENTURER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "03 V 060 000/BRAKE SYSTEM WARNING INDICATOR:THE DEALER WAS UNABLE TO HONOR THE RECALL BECAUSE NO PARTS WERE AVAILABLE.  *JB",
        "vin": "5B4MP67G123"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/07/2004",
        "dateOfIncident": "06/07/2004",
        "fire": false,
        "manufacturer": "Winnebago Industries, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10075802,
        "products": [
            {
                "manufacturer": "Winnebago Industries, Inc.",
                "productMake": "WINNEBAGO",
                "productModel": "ADVENTURER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER COMPLAINED ABOUT  BRAKE PROBLEM.  WHEN  APPLYING THE BRAKES, SOMETIMES THEY WORKED,  AND SOME TIMES THEY DIDN'T OPERATE PROPERLY.  ALSO, AT TIMES HAD TO PUMP THEM.  SHE TOOK VEHICLE TO SEVERAL DEALERS, AND ONE DEALER ROTATED THE DRUMS, AND   FOUND NO PROBLEM. CONSUMER STATED THAT SHE WILL TAKE THE VEHICLE TO THE MANUFACTURER.*AK",
        "vin": "5B4MP67G243"
    },
    {
        "components": "STEERING,SUSPENSION,ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "12/16/2003",
        "dateOfIncident": "05/21/2003",
        "fire": false,
        "manufacturer": "Winnebago Industries, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10050579,
        "products": [
            {
                "manufacturer": "Winnebago Industries, Inc.",
                "productMake": "WINNEBAGO",
                "productModel": "ADVENTURER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "REF: 10042704.  NVS 216 GMH. NEW MOTOR HOME WITH NUMEROUS SAFETY ISSUES.  THE FOLLOWING ITEMS HAVE NOT BEEN FIXED:  ALIGNMENT, TRAVEL DIRECTION (TRACKS TO THE RIGHT WHEN GOING DOWN THE ROAD), BANGING IN THE FRONT END, ELECTRONIC PROBLEMS IN DASH, TAIL PIPE INSTALLED INCORRECTLY, EASY CHAIR THAT CONTINUOUSLY ROCKS AND IS DISTRACTING.  THE FOLLOWING ITEMS HAVE  BEEN REPAIRED:  HOLE IN DUST CAP ON LEFT FRONT WHEEL, WATER IN LEFT FRONT HEAD LIGHT, SOUND ON BACK UP MONITOR, FLORESCENT LIGHT COVERS FALLING OFF, BROKEN CUPBOARD LATCH, GAS LEAK ON GENERATOR, RUSTY LP GAS LINES, AND CLAMPS BROKEN ON LP GAS LINES. I HAVE BEEN TRYING FOR MONTHS TO GET A \"NEW\" MOTOR HOME PROPERLY REPAIRED.  SOME OF THE ITEMS ARE APPEARANCE RELATED BUT MOST OF THEM ARE SAFETY ISSUES.  I WILL ENCLOSE COPIES OF FILES THAT INCLUDE LISTS OF ISSUES AND SOME THINGS THAT HAVE BEEN DONE TO ATTEMPT REPAIRS.  I BELIEVE THIS MOTOR HOME SHOULD NOT BE USED FOR LONG DISTANCE TRAVEL UNTIL PROPERLY REPAIRED.  MY FAMILY AND FRIENDS FEEL I WAS TAKEN ADVANTAGE OF.  FOR ME TO GET OUT OF THIS SITUATION, I WILL HAVE TO SELL OR TRADE TO ANOTHER UNSUSPECTING CONSUMER JUST AS HAPPENED TO ME.  IF THIS HAD BEEN A USED MOTOR HOME, I WOULD HAVE THOUGHT IT HAD BEEN IN AN ACCIDENT.  THE STRESS TO MY FAMILY AND ME AND THE DISAPPOINTMENT EXPERIENCED BY US AND OUR GRANDCHILDREN ARE INDESCRIBABLE.  WE PLANNED ON TRAVELING TO THE SOUTH THIS WINTER BUT HAVE DECIDED NOT TO CHANCE THE TRAVEL WITH THIS MOTOR HOME.*AK",
        "vin": "5B4MP67G733"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/21/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Winnebago Industries, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10042704,
        "products": [
            {
                "manufacturer": "Winnebago Industries, Inc.",
                "productMake": "WINNEBAGO",
                "productModel": "ADVENTURER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WILLIAM COUCH VS. WINNEBAGO INDUSTRIES.*MR     CONSUMER ONLY USED THE MOTORHOME FOR TWO WEEKS AFTER PURCHASE. THE REST OF THE TIME IT WAS AWAITING REPAIRS. THE VEHICLE HAD OVER 30 SAFETY AND QUALITY ISSUES. CONSUMER SENT IN A CD AND PICTURES TO THE CEO; NUMEROUS EMAILS TO THE EMPLOYEES AND THE CONSUMER HAS HEARD NOTHING. CONSUMER WANTS THE MOTORHOME REPLACED PLUS REIMBURSE EXPENSES OR REFUND MONEY AND REIMBURSE EXPENSE AND TRADE IN VALUE OF ORIGINAL MOTORHOME.    *PH   *NLM",
        "vin": "5B4MP67G733"
    }
]