[
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/14/2022",
        "dateOfIncident": "10/31/2021",
        "fire": true,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447460,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2003 Workhorse W22. The contact stated that upon stopping the motorhome in her driveway, her husband discovered a bluish-black color smoke emitting from underneath the vehicle. The rear passenger side brake caliper had caught fire and the contact's husband was able to extinguish the fire with a water hose. The fire department was not called and a report was not filed. The contact stated that the brake and ABS warning lights had illuminated on the instrument panel after the failure. The contact's husband took pictures of the damage and showed them to an independent mechanic. The mechanic then informed the contact's husband of NHTSA Campaign Number: 09V110000(SERVICE BRAKES, HYDRAULIC) which he linked to the failure. The mechanic contacted then notified the manufacturer of the failure but received no assistance. The contact also made multiple attempts to reach the manufacturer but had no success. The vehicle had yet to be repaired. The failure mileage was approximately 54,000.",
        "vin": "5b4mp67g133"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/14/2018",
        "dateOfIncident": "07/29/2010",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11111288,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "NAVISTAR IS  RECALLING.....THERE'S A RECALL TO REPLACE ALL FOUR CALIPERS BUT THEY WON'T REPLACE THE ROTORS  ALL FOUR OF THEM ARE CRACKED FROM OVERHEATING BECAUSE OF THE CALIPERS  HANGING UP .   THIS RECALL IS FOR A WORKHORSE W22  CHASSIS.",
        "vin": "5B4MP67G533"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/25/2016",
        "dateOfIncident": "06/04/2016",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10876563,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR CALIPERS WERE REPLACED ON RECALL WITH REBUILT CALIPERS. AFTER LESS THAN 500  MILES THE RIGHT REAR CALIPER BLEW OUT ALL BRAKE FLUID RESULTING IN COMPLETE LOSS OF  BRAKES. THIS HAPPENED 40 MILES FROM HOME ON A STATE ROAD.",
        "vin": "5B4MP67G133"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE,EXTERIOR LIGHTING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/22/2011",
        "dateOfIncident": "06/01/2009",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10440813,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 NEWMAR MOUNTAIN AIRE MOTORHOME ON A 2003 WORKHORSE W22 CHASSIS. CONSUMER WRITES IN REGARDS TO WORKHORSE BRAKE SYSTEM RECALL *TGW  THE CONSUMER STATED IN MAY OF 2009, HE RECEIVED AN INTERIM NOTICE WARNING ABOUT A POSSIBLE PROBLEM WITH THE WORKHORSE SYSTEM. THE NOTICED STATED THERE WAS A POSSIBILITY OF THE BRAKES STICKING, BURNING AND THE ABS LIGHT ILLUMINATING.  IT FURTHER STATED THAT IF THE SYMPTOMS SHOULD APPEAR, THAT THE DRIVER SHOULD PULL OVER AND EXAMINE THE WHEELS FOR EXCESSIVE HEAT AND CONTACT A WORKHORSE SERVICE CENTER. IN JUNE 2009 THE CONSUMER WAS ABOUT 100 MILES INTO HIS TRIP, WHEN HE EXPERIENCED OVER HEATING OF THE BRAKES AND THE ABS LIGHT ILLUMINATED. HE PULLED OVER AND CALLED THE NUMBER LISTED ON THE RECALL. ARRANGEMENTS WERE MADE TO HAVE THE RV TOWED TO A SERVICE CENTER, THE SERVICE CENTER MADE TEMPORARY REPAIRS TO THE RV AND FOUND THERE WAS ALSO A RECALL ON THE CATALYTIC CONVERTER, WHICH WAS ALSO REPLACED. IN JANUARY 2010, THE CONSUMER BEGAN TO NOTICE A SLIGHT LOSS OF POWER AND HE COULD HEAR A MUFFLED SOUND OF BACK FIRING THROUGH THE EXHAUST WHENEVER HE DROVE UP AN UPGRADE AND/OR HARD ACCELERATING. IN JUNE OF 2010, HE RETURNED THE RV TO THE SERVICE CENTER, TO HAVE THEM CHECK THE BACK FIRING AND SEVERAL OTHER ITEMS THAT NEEDED TO BE REPAIRED OR REPLACED, BUT THEY WERE UNABLE TO FIND A PROBLEM. IN OCTOBER 2011, THE RV BEGAN TO SLOW DOWN AND SMOKE STARTED EMITTING OUT OF THE LEFT EXHAUST. THE RV WAS TOWED TO A SERVICE CENTER. A DIAGNOSTIC TEST REVEALED THE CATALYTIC CONVERTERS WERE CLOGGED UP AND BLEW OUT THE MUFFLERS. THE SERVICE CENTER ALSO FOUND THE SPARK PLUGS NEEDED TO BE REPLACED. THE CONSUMER ALSO STATED OVER THE LAST FIVE YEARS, THE FUEL PUMP, SERPENTINE BELT, HEATER VALVE, SPEEDOMETER, DASH PANEL CLUSTER LIGHTS AND TURN SIGNAL/ DIMMER SWITCH ALL HAD TO BE REPLACED. *JB",
        "vin": "5B4MP67G433"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/26/2011",
        "dateOfIncident": "05/06/2011",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10403448,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 WORKHORSE W22 CHASSIS. CONSUMER WRITES TO INQUIRE ABOUT RECALLS *TGW  THE CONSUMER STATED THE ANTI-LOCK BRAKE LIGHT ILLUMINATED TWICE AND THE REPAIR SHOP REPLACED THE WHEEL SENSORS.  ALSO, THE FRONT BRAKE PADS AND ROTORS WERE REPLACED.  THE CONSUMER STATED HE RECEIVED A PENDING RECALL NOTICE FOR THE BRAKES. HE CONTACTED THE DEALER TO MAKE AN APPOINTMENT, BUT WAS INFORMED IT WOULD BE MONTHS BEFORE THE REPAIRS COULD BE MADE. *JB",
        "vin": "5B4MP67G533"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/24/2011",
        "dateOfIncident": "09/12/2007",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10403092,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 WORKHORSE HORSE CHASSIS. CONSUMER WRITES IN RESPONSE TO A DENIAL OF REIMBURSEMENT  FOR REPLACEMENT OF CALIPER ASSEMBLY. *TGW  THE CONSUMER STATED ALL OF THE REPAIRS MADE FROM SEPT 2007 THROUGH JULY 2008 PRIOR TO AN SAFETY RECALL NOTICES FROM WORKHORSE.  ON SEPTEMBER 12, 2007, BOTH FRONT WHEEL SEALS WERE LEAKING AND HAD TO BE REPLACED. WORKHORSE DENIED THE CLAIM, BECAUSE THEY WERE ONLY CONSIDERING REPAIRS MADE AFTER NOVEMBER 16, 2007 FOR REIMBURSEMENT. ON A SEPARATE OCCASION, WHILE ENROUTE TO HIS SUMMER HOME, THERE WAS A BURNING ODOR AND SMOKE COMING FROM THE WHEEL. THE MECHANIC REMOVED THE BURNED ABS SENSOR AND REPLACED THE HUB CAPS AND SEALS. *JB",
        "vin": "5B4MP67G433"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/11/2011",
        "dateOfIncident": "03/01/2011",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10389488,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 WORKHORSE W22 CHASSIS. CONSUMER WRITES REGARDING WORKHORSE WARRANTY AND SAFETY RECALL *TGW  THE CONSUMER EXPERIENCED BRAKE PROBLEMS WHILE ON A TRIP. THE CONSUMER WAS INFORMED BY THREE DEALERS THAT IT WOULD BE SEVERAL WEEKS BEFORE HE COULD RECEIVE SERVICE. THE CONSUMER FINALLY FOUND A SERVICE CENTER AND MADE AN APPOINTMENT FOR THE FOLLOWING WEEK.  THE CONSUMER BELIEVED HE WAS CHARGED FOR REPAIRS THAT SHOULD HAVE BEEN COVERED IN THE RECALL. HE LEARNED THE PROBLEM WITH THE ABS AND EMERGENCY BRAKE LIGHTS WAS A PROBLEM THAT OCCASIONALLY OCCURRED WHEN THE RECALL WORK WAS PERFORMED.  THE CONSUMER IS REQUESTING REIMBURSEMENT FOR THE ABS, EMERGENCY BRAKE LIGHTS AND BUZZER NOT GOING OUT.  *JB",
        "vin": "5B4MP67G133"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/10/2011",
        "dateOfIncident": "09/01/2007",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10389288,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 WORKHORSE W22 CHASSIS. CONSUMER WRITES IN REGARDS TO BAD BRAKES *TGW  THE CONSUMER STATED HE/SHE FIRST EXPERIENCED FRONT BRAKE FAILURE IN SEPT 2007. THE FRONT BRAKES LOCKED UP WHICH CAUSED THE BRAKES TO OVERHEAT.  THE FRONT CALIPERS, BRAKE PADS, FRONT INNER SEALS, FRONT OUTER HUB COVERS AND ROTORS HAD TO BE REPLACED. ALSO, THE RIGHT FRONT WHEEL SPEED SENSOR WAS DEFECTIVE AND HAD TO BE REPLACED AS WELL . THE SECOND TIME WAS IN APRIL 2008 WHEN THE REAR CALIPERS SEIZED AND DAMAGED THE ROTORS AND PADS.  THE BRAKES WERE REPLACED UNDER AN EXTENDED WARRANTY. THE CONSUMER STATED HE/SHE RECEIVED A REFUND CHECK FOR THE REAR BRAKES ONLY. THE CONSUMER STATED SINCE A RECALL WAS ISSUED, ALL OF HIS/HER MONEY SHOULD BE REFUNDED INCLUDING MONEY FOR THE COMPONENTS THAT WERE DAMAGE AS A RESULT OF THE FAILED BRAKES. *JB",
        "vin": "5B4MP67G833"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/18/2011",
        "dateOfIncident": "08/10/2010",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10383849,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "SAFETY RECALL 51101-C. BRAKE CALIPERS FAILED AND BURNED UP THE ENTIRE BRAKING AND ABS SYSTEM. WORKHORSE IS REFUSING TO PAY $4,600 CASH I PAID TO REPAIR THE DAMAGE",
        "vin": "5B4MP67G133"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/26/2011",
        "dateOfIncident": "01/01/2009",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10378810,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 ALEGRO RECREATIONAL VEHICLE WITH A WORKHORSE W22 CHASSIS. THE LIQUID SCREEN CRYSTAL DISPLAY FAILED, HE WAS NOT ABLE TO READ THE MILEAGE, SPEED, GEAR, OR ANY OTHER INFORMATION ON THE SCREEN. THE RECREATIONAL VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 24,000 AND THE CURRENT MILEAGE WAS 28,669.",
        "vin": "5B4MP67G933"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/20/2011",
        "dateOfIncident": "08/01/2007",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10375901,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER WRITES IN REGARDS TO SAFETY RECALL 51101-C WORKHORSE CUSTOM CHASSIS BOSCH BRAKE CALIPER *TGW  THE CONSUMER STATED WHEN HE APPLIED THE BRAKE GENTLY TO STOP FOR TRAFFIC, THE RIGHT FRONT BRAKE LOCKED UP AND WOULD NOT RELEASE. HE DROVE SLOWLY ALMOST AT FULL THROTTLE TO THE CAMPGROUND WITH SMOKE EMITTING FROM THE WHEEL BEARING. THE BRAKE ROTOR, CALIPER AND ABS SENSOR HAD TO BE REPLACED. WORKHORSE STATED THE CONSUMER WAS NOT ELIGIBLE FOR REIMBURSEMENT AS THE REPAIRS WERE NOT MADE BETWEEN NOVEMBER 16, 2007 AND JUNE 15, 2009. *JB",
        "vin": "5B4MP67GX33"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/20/2011",
        "dateOfIncident": "01/03/2011",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10375899,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 RV. ATTORNEY WRITES ON BEHALF OF CONSUMERS REGARDING FAULTY BRAKES AND RECALL. *TGW  AN INSPECTION OF THE RV REVEALED EXTREME CRACKING DAMAGE HAD BEEN CAUSED TO THE ROTORS WHICH WAS A DIRECT RESULT OF THE FAULTY BRAKE CALIPERS.  THE CONSUMER WAS INFORMED THAT THE RECALL DID NOT COVER ADDITIONAL DAMAGE THAT HAD BEEN CAUSED TO THE ROTORS BY THE FAULTY CALIPERS. THE CONSUMER HAD TO PAY FOR THE ROTORS, PADS AND BRAKE LINES. ALSO, THE ABS WAS SERVICED TWICE PRIOR TO THE RECALL.  *JB",
        "vin": "5B4MP67GX33"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/14/2011",
        "dateOfIncident": "10/21/2010",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10376714,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 WORKHORSE W22. THE CONTACT STATED THAT THE VEHICLE WAS BEING SERVICED FOR REPAIRS UNDER NHTSA CAMPAIGN ID NUMBER: 09V110000 (SERVICE BRAKES, HYDRAULIC) WHEN HE WAS INFORMED BY THE TECHNICIAN THAT ALL FOUR ROTORS WERE FRACTURED AND THE VEHICLE WAS DEEMED AS UNSAFE TO DRIVE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS CONTACTED AND ADVISED THE CONTACT THAT THE FAILURE WAS COMMON AND THEY WERE UNABLE TO PROVIDE ANY ASSISTANCE. THE APPROXIMATE FAILURE MILEAGE WAS 50,983.     UPDATED 03/15/11  *BF  UPDATED 06/03/11",
        "vin": "5B4MP67G633"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/12/2011",
        "dateOfIncident": "01/10/2011",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10376408,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 WORKHORSE W-22. THE CONTACT STATED THAT HE RECEIVED A RECALL NOTICE FOR RECALL 09V110000 (SERVICE BRAKES, HYDRAULIC). THE VEHICLE WAS REPAIRED ACCORDING TO THE RECALL AND THE CONTACT WAS INFORMED THAT THE ROTORS HAD CRACKED DUE TO THE HEAT GENERATED FROM THE FAILED CALIPERS. THE DEALER STATED THAT EVEN THOUGH THE ROTORS WERE A PART OF THE BRAKING SYSTEM, THEY WOULD NOT BE REPAIRED UNDER THE RECALL. THE FAILURE MILEAGE WAS 42,000.",
        "vin": "5B4MP67G323"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/23/2010",
        "dateOfIncident": "10/04/2010",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10372792,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER WRITES REGARDING SAFETY RECALL 51101-C INVOLVING THE BOSCH SERVICE BRAKE CALIPER *TGW  THE CONSUMER EXPERIENCED PROBLEMS WITH THE BRAKES WHILE ON A TRIP. WHEN THE CONSUMER ARRIVED AT THE DEALER, HE WAS INFORMED IT WOULD BE SEVERAL WEEKS BEFORE SERVICES COULD BE PERFORMED.  THE CONSUMER THEN DECIDED TO SCHEDULED AN APPOINTMENT AT ANOTHER ESTABLISHMENT. THE REPAIR WAS SHOP WAS ABLE TO FINISH THE BRAKE RECALL WORK. HOWEVER, THEY WERE UNABLE TO GET THE ABS AND EMERGENCY BRAKE LIGHT AS WELL AS THE WARNING BUZZER TO OUT.  THE NEXT DAY, THE REPAIR SHOP WAS ABLE TO RECTIFY THE PROBLEM. THE CONSUMER WAS CHARGE FOR THAT REPAIR.  THE CONSUMER BELIEVED IT SHOULD HAVE BEEN COVERED UNDER THE RECALL AS WELL. *JB",
        "vin": "5B4MP67G133"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/10/2010",
        "dateOfIncident": "06/10/2008",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10370010,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 W-22 WORKHORSE CHASSIS MOTOR HOME. CONSUMER STATES THAT HE HAD A RECALL FOR THE BRAKES AND ENDING UP PAYING FOR THE REPAIR. HE FEELS THAT WORKHORSE SHOULD HAVE PAID SINCE THE PART WAS UNDER RECALL.  *KB  THE CONSUMER STATED THE ABS LIGHT ILLUMINATED. THE RV WAS TAKEN TO A REPAIR SHOP AND THEY TURNED THE LIGHT OFF AND ADVISED THE CONSUMER TO COME BACK IN A FEW DAYS FOR A FULL INSPECTION. THE CONSUMER RETURNED A FEW DAYS LATER FOR A REAR BRAKE INSPECTION. THE REPAIR SHOP INFORMED THE CONSUMER THE REAR BRAKES HAD BECOME VERY HOT AND BURNED AND WOULD NEED TO BE REPLACED. WHEN THE PARTS ARRIVED, THE CONSUMER WENT BACK TO THE SHOP TO HAVE THE REAR BRAKES REPLACED. TWO YEARS AFTER HAVING THE REAR BRAKES REPLACED, THE ABS LIGHT ILLUMINATED AGAIN AND THE CONSUMER BEGAN HEARING STRANGE SOUNDS AND THE RV DROVE A LITTLE DIFFERENTLY. WHEN THE CONSUMER WAS ABLE TO PULL OVER, HE LOOKED UNDER THE RV AND SMELLED A STRANGE ODOR AND THE BRAKES WERE EXTREMELY HOT. THE CONSUMER WAS ABLE TO SAFELY DRIVE THE RV TO A REPAIR SHOP, ONCE THE BRAKES COOLED DOWN. THE REPAIR SHOP DETERMINED THE FRONT BRAKES HAD SEIZED AND OVERHEATED AND NEEDED TO BE REPLACED. THREE MONTHS LATER, THE  CALIPERS WERE REPLACED. *JB",
        "vin": "5B4MP67GX33"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/06/2010",
        "dateOfIncident": "08/08/2005",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10370018,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 WORKHORSE CHASSIS. COURTESY COPY OF A LETTER FROM JAMES M. WALKER SUBMITTED TO WORKHORSE CUSTOM CHASSIS RE RECALL CAMPAIGN NUMBER 51101 *TGW  THE CONSUMER STATED THE RECALL WORK PERFORMED. THE DEALER REPLACED THE FAULTY CALIPERS AT NO CHARGE, BUT FOUND TWO ROTORS CRACKED BEYOND REPAIR AND TWO OF THEM REQUIRED RESURFACING, ALL DUE TO HEAT PROBLEMS CAUSED BY THE FAULTY CALIPERS.  THE CONSUMER IS REQUESTING REIMBURSEMENT FOR THE DAMAGED ROTORS. IN AUGUST 2005 ALL FOUR ROTORS HAD TO BE REPLACED DUE TO HEAT RELATED PROBLEMS CAUSED BY FAULTY CALIPERS. THE PADS WERE ROUTINE MAINTENANCE, BUT THE SEALS FAILED AND WERE SUBSEQUENTLY REPLACED. THE CONSUMER IS ALSO REQUESTING REIMBURSEMENT FOR THOSE ROTORS.  *JB",
        "vin": "5B4MP67G033"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/03/2010",
        "dateOfIncident": "10/11/2010",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10368981,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 W22 WORKHORSE CHASSIS. CONSUMER WRITES TO REQUEST A WORKHORSE REIMBURSEMENT *TGW  THE CONSUMER IS REQUESTING REIMBURSEMENT AS A RESULT OF HAVING THE CALIPERS REPLACED. THE REPAIR FACILITY RECOMMENDED THE REPLACEMENT OF THREE ROTORS WHICH WERE CRACKED.  THE CONSUMER STATED THERE WAS A DISTINCT BRAKE BURNING SMELL, THE ABS LIGHT ILLUMINATED FOR EXTENDED PERIODS OF TIME, AND THERE WERE AT LEAST THREE TIMES THE BRAKING SYSTEM LOST ITS EFFECTIVENESS. *JB",
        "vin": "5B4MP67GX33"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/19/2010",
        "dateOfIncident": "10/11/2010",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10367509,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 WORKHORSE W22 CHASSIS. CONSUMER WRITES TO SEEK AN EXPLANATION AS TO WHY THE RECALL DID NOT COVER THE REPLACEMENT OF THE LEFT FRONT AND LEFT REAR ROTOR, PADS, OIL SEAL AND SPEED SENSOR *TGW  THE CONSUMER STATED THE RIGHT FRONT SIDE OF THE RV WAS COVERED UNDER RECALL, BUT NOT THE LEFT SIDE. *JB",
        "vin": "5B4MP67G033"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/17/2010",
        "dateOfIncident": "11/01/2010",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10366292,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER WRITES REGARDING WORKHORSE RECALL *TGW  THE CONSUMER WAS DENIED REIMBURSEMENT. ACCORDING TO WORKHORSE, THE WORK INVOICE DID NOT REFERENCE A PROBLEM CONCERNING CALIPER FAILURE AND THEY FURTHER STATED THE CONSUMER DID NOT TAKE THE RV TO AN AUTHORIZED SERVICE CENTER FOR THE BRAKE FAILURE. THE CONSUMER STATED THE BRAKE SYSTEM LOCKED UP COMPLETELY AND BEGAN SMOKING PROFUSELY WHILE THE RV WAS BEING DRIVEN DURING RUSH HOUR TRAFFIC.  THE BRAKE DISCS WERE SEVERELY WARPED AND THE CALIPERS WERE COMPLETELY INOPERATIVE. *JB  UPDATED 01/05/11. *JB  UPDATED 01/13/11. *JB",
        "vin": "5B4MP67G833"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/15/2010",
        "dateOfIncident": "11/11/2010",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10365690,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 WORKHORSE NEWMAN MOUNTAINEER WITH A W22 CHASSIS. THE CONTACT STATED THAT THE VEHICLE WAS TAKEN TO THE DEALER FOR REPAIRS UNDER NHTSA CAMPAIGN ID NUMBER: 09V110000 (SERVICE BRAKES, HYDRAULIC) WHEN THE DEALER DISCOVERED THAT THE CALIPERS HAD OVERHEATED AND FRACTURED ALL FOUR ROTORS. THE DEALER REPLACED THE ROTORS.  THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE AND CURRENT MILEAGE WAS 53,521.",
        "vin": "5B4MP67G833"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/12/2010",
        "dateOfIncident": "11/12/2005",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10365475,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 DAMON INTRUDER. ON A 2003 WORKHORSE W22 CHASSIS.  UPON EXITING THE VEHICLE, THE CONTACT SMELLED A BURNING ODOR FROM THE BRAKE AREA. THE FAILURE OCCURRED AFTER LONG DISTANCE DRIVES. THE VEHICLE WAS BEING SERVICED FOR RECALL 09V110000 (SERVICE BRAKES, HYDRAULIC) WHEN THE CONTACT WAS INFORMED THAT THE ROTORS WERE CRACKED. THE VEHICLE WAS REPAIRED.  THE FAILURE MIEAGE WAS 32,490  UPDATED 01/21/11  *BF  UPDATED 04/15/11",
        "vin": "5B4MP67G133"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/05/2010",
        "dateOfIncident": "10/12/2010",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10364180,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 WINNEBAGO ITASCO SUN CRUISER EQUIPPED WITH A  2003 WORKHORSE W22 CHASSIS. THE CONTACT STATED THAT RECALL FOR THE BRAKE CALIPERS (WORKHORSE RECALL) CAUSED DAMAGE WITHIN THE BRAKE PADS AND BRAKE HUBS. THE CONTACT CALLED THE MANUFACTURER WHO STATED THAT THEY WOULD ONLY REPAIR THE BRAKE CALIPERS AND THE OTHER COMPONENTS WERE NORMAL WEAR AND TEAR. THE VEHICLE HAD NOT BEEN REPAIRED. THE CURRENT AND FAILURE MILEAGES WERE APPROXIMATELY 28,000.  UPDATED 02/09/11*LJ   UPDATED 11/03/11  *BF  UPDATED 11/29/2011 *LN",
        "vin": "5B4MP67G333"
    },
    {
        "components": "SERVICE BRAKES, AIR",
        "crash": false,
        "dateComplaintFiled": "10/25/2010",
        "dateOfIncident": "05/28/2009",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10362202,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 FLEETWOOD BOUNDER EQUIPPED WITH A 2003 WORKHORSE W22. THE CONTACT STATED THAT THE PASSENGER SIDE REAR BRAKE LOCKED UP WHILE HE WAS DRIVING APPROXIMATELY 50 MPH. HE WAS ABLE TO REVERSE AND SLAM ON THE BRAKE PEDAL WHICH FREED THE BRAKE. THE VEHICLE WAS TAKEN TO HIS RESIDENCE AND PARKED IT. HE RECEIVED A RECALL NOTICE FOR RECALL 09V198000 (SERVICE BRAKES, AIR) AND WAS TOLD THAT THE MANUFACTURER WOULD INFORM HIM WHEN THE PARTS FOR REPAIR WERE AVAILABLE. WHEN HE TOOK THE VEHICLE IN FOR REPAIR, THE DEALER STATED THAT THEY COULD NOT REPAIR THE VEHICLE BECAUSE THE ROTORS AND BRAKE LINES WERE RUSTED AND NEEDED TO BE REPLACED. THEY WOULD NOT REPAIR THE CALIPERS DUE TO THE OTHER RUSTED PARTS. THE CONTACT WAS GIVEN ANOTHER NUMBER TO A CONTACT WITH THE MANUFACTURER AND HE WAS AWAITING A CALLBACK. THE VIN WAS UNAVAILABLE. THE CURRENT MILEAGE WAS APPROXIMATELY 11,000. THE FAILURE MILEAGE WAS APPROXIMATELY 10,800.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/18/2010",
        "dateOfIncident": "01/28/2010",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10360873,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 WORKHORSE W22 CHASSIS. CONSUMER WRITES REGARDING WORKHORSE RECALL *TGW  THE CONSUMER STATED THE BRAKES WERE REPLACED ON JANUARY 28, 2010. EIGHT MONTHS LATER, THE RV WAS BACK AT THE REPAIR SHOP FOR MORE BRAKE WORK. WHEN THE CONSUMER ARRIVED HOME FROM A TRIP, THERE WAS A RECALL NOTICE IN THE MAIL REGARDING THE BRAKES.  THE FRONT AND REAR CALIPERS WERE REPLACED, AS WELL AS THE ROTORS AND PADS. *JB",
        "vin": "5B4MP67G833"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/08/2010",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10359795,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 WORKHORSE W22 CHASSIS. CONSUMER WRITES REGARDING PROBLEMS WITH BRAKES *TGW  THE CONSUMER STATED THERE WAS BURNING BRAKE SMELL COMING FROM THE RIGHT FRONT PASSENGER SIDE OF THE RV AND THE BRAKE PEDAL TRAVELED TO THE FLOOR TWICE.  THE CONSUMER STATED HE HAS WAITED OVER A YEAR FOR THE RECALL TO BE PERFORMED. *JB  THE CONSUMER STATED THE RECALL WAS BEING LIMITED TO A BOSCH PART. UPDATED 12/22/10*JB",
        "vin": "5B4MP67G333"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/22/2010",
        "dateOfIncident": "02/23/2007",
        "fire": true,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10356949,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 REX HALL AERBUS MOTOR HOME, WITH A WORKHORSE W22 CHASSIS.  WHILE DRIVING 60 MPH HE ENGAGED THE BRAKES AND BEGAN TO SMELL SOMETHING BURNING. THE CONTACT STATED HE PULLED INTO AN RV CAMP GROUND AND INSPECTED THE VEHICLE. THE VEHICLE WAS DRIVEN TO AN AUTHORIZED DEALER, THE DEALER REPLACED ALL FOUR BRAKE CALIBERS. HE STATED THE MANUFACTURER WAS REFUSING TO REIMBURSE HIM FOR THE REPAIRS SINCE HIS VEHICLE WAS NOT PART OF THE FIRST RECALL. HE REFERENCE RECALL 09V110000, SERVICE BRAKES, HYDRAULIC AND STATED HE RECEIVED THIS RECALL RECENTLY. THE CONTACT STATED HE HAS NOT HAD THE ABOVE RECALL REPAIR PERFORMED. THE FAILURE MILEAGE WAS 20,000 AND THE CURRENT MILEAGE WAS 22,800.",
        "vin": "5B4MP67G733"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/21/2010",
        "dateOfIncident": "04/09/2009",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10356753,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 WINNEBAGO BRAVE WITH A WORKHORSE W22 CHASSIS.  THE CONTACT STATED THAT HE RECEIVED THE FIRST RECALL NOTICE FOR THE BRAKES ABOUT ONE YEAR AGO; NHTSA CAMPAIGN ID NUMBER 09V110000 AND THEN RECEIVED A SECOND ONE A FEW WEEKS AGO. HE CONTACTED THE DEALER AND THE PARTS ARE NOT AVAILABLE.  HE STATED THAT IT WOULD  COST HIM $200 PER WHEEL TO HAVE THE BRAKES REPAIRED AT HIS OWN EXPENSE. THE FAILURE AND CURRENT MILEAGES WERE APPROXIMATELY 24,000.",
        "vin": "5B4MP67GX33"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/21/2010",
        "dateOfIncident": "10/13/2009",
        "fire": true,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10356838,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 WINNEBAGO ADVENTURER 38L WITH A  WORKHORSE W22 CHASSIS. WHILE DRIVING APPROXIMATELY 60 MPH HE ENGAGED THE BRAKES AND SMELLED SOMETHING BURNING. HE PULLED OVER INTO A REST AREA UNTIL THE VEHICLE COOLED OFF. HE STATED THAT THE ABS LIGHT CAME ON AND STAYED ON.  THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER. THE DEALER CLEANED AND REMOVED ALL OF THE WHEEL SENSORS.  A MONTH LATER THE ABS LIGHT CAME ON AGAIN. THE VEHICLE WAS TAKEN BACK TO THE SAME DEALER WHO REMOVED AND CLEANED ALL OF THE ABS SENSORS, THE CALIPERS AND ROTORS. TWO NEW REAR SENSORS WERE ALSO INSTALLED. LESS THAN A MONTH LATER, THE ABS LIGHTS ILLUMINATED AGAIN. THE VEHICLE WAS NOT REPAIRED. THE CONTACT REFERENCED RECALL 09V110000, SERVICE BRAKES, HYDRAULIC. THE CONTACT STATED THAT THE VEHICLE HAD NOT BEEN USED SINCE APRIL 2010. THE FAILURE MILEAGE WAS 21,000 AND THE CURRENT MILEAGE WAS 23,700.",
        "vin": "5B4MP67G833"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/01/2010",
        "dateOfIncident": "03/29/2010",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10353251,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 WORKHORSE W22. THE VEHICLE WAS INCLUDED IN THE RECALL ASSOCIATED WITH NHTSA CAMPAIGN ID NUMBER 09V110000, SERVICE BRAKES, HYDRAULIC.  WHILE DRIVING AT APPROXIMATELY 35 PRESSURE WAS APPLIED TO THE BRAKE PEDAL AND THE PEDAL DEPRESSED TO THE FLOOR.  REPEATED PRESSURE WAS APPLIED TO THE BRAKE PEDAL TO GET THE VEHICLE TO STOP.  THE VEHICLE WAS PULLED OVER AND SHUT OFF.  AFTER WAITING APPROXIMATELY 45 MINUTES THE VEHICLE BEGAN TO OPERATE AS NORMAL.  THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHERE HE WAS INFORMED THE VEHICLE DID NOT MEET THE CRITERIA OF THE RECALL ASSOCIATED WITH NHTSA CAMPAIGN ID NUMBER 09V110000, SERVICE BRAKES, HYDRAULIC, SO IT WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 29,000 AND THE CURRENT MILEAGE WAS 30,000.",
        "vin": "5B4MP67G633"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/17/2010",
        "dateOfIncident": "04/04/2010",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10350079,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 WORKHORSE W-22 CHASSIS.  THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN ID NUMBER: 09V110000 (SERVICE BRAKES-HYDRAULIC) APPROXIMATELY ONE YEAR AGO. HE WAS ADVISED THAT THE PARTS NEEDED TO MAKE RECALL REPAIRS WERE NOT AVAILABLE. SINCE THE INITIAL RECALL LETTER, THE CONTACT RECEIVED THREE ADDITIONAL NOTICES AND WHEN CONTACTING THE MANUFACTURER, HE WAS ADVISED THAT THE PARTS HAD NOT BECOME AVAILABLE.  THE CONTACT STATED THE VEHICLE WAS INOPERABLE DUE TO THE RECALL, WHICH WAS NOT BEING ADDRESSED WITHIN A REASONABLE TIME FRAME, AS STATED IN THE RECALL. THE VEHICLE WAS NOT REPAIRED.  THE FAILURE MILEAGE AND CURRENT MILEAGES WERE APPROXIMATELY 9,272.  UPDATED 11/16/10. *LJ",
        "vin": "5B4MP67G633"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/03/2010",
        "dateOfIncident": "04/20/2010",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10347648,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 34' CLASS A, PACE ARROW MOTOR HOME ON A 2003 WORKHORSE W22 CHASSIS. CONSUMER WRITES REGARDING BRAKES AND RECALL *TGW  THE CONSUMER STATED HE NOTICED A DRAG ON THE WHEELS WHILE DRIVING. BY THE TIME HE REACHED HIS DESTINATION, THERE WAS A BAD ODOR COMING FROM THE RV. THE CONSUMER THEN DISCOVERED THE RIGHT FRONT WHEEL WAS VERY HOT. THE CONSUMER TOOK THE RV TO THE DEALER. UPON INSPECTION, THE DEALER STATED THE BRAKES CHECKED OUT FINE. FIVE DAYS LATER THE ABS LIGHT ILLUMINATED AND THE BRAKE PEDAL BECAME HARD TO PRESS. WHEN HE REACHED HIS DESTINATION, THE BRAKE PEDAL ALMOST WENT TO THE FLOOR.  THE CONSUMER TOOK THE RV TO A REPAIR SHOP. ACCORDING TO THE INVOICE, THE REAR BRAKE PADS AND ABS WERE REPLACED. HOWEVER, THE ABS LIGHT ILLUMINATED AGAIN. THE CONSUMER ALSO STATED WHEN THE BRAKES WERE APPLIED AT TIMES, IT SEEMED AS THOUGH A ROTOR WAS WARPED. THE CONSUMER BELIEVED IT WAS CAUSED WHEN THE RIGHT FRONT BRAKE PAD FROZE, BUT NO ONE MENTIONED THERE WAS A PROBLEM WHEN IT FIRST OCCURRED.  *JB",
        "vin": "5B4MP67G433"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/02/2010",
        "dateOfIncident": "12/03/2009",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10346864,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 WORKHORSE W-22. THE CONTACT STATED  SHE RECEIVED NOTIFICATION OF NHTSA RECALL CAMPAIGN ID NUMBER: 09V110000 (SERVICE BRAKES, HYDRAULIC) IN MAY 2009. SHE RECEIVED A SECOND NOTICE DECEMBER 2009. THE MANUFACTURER WAS CONTACTED AND ADVISED THE CONTACT THAT THE PARTS NEEDED TO MAKE THE REPAIRS WERE NOT YET AVAILABLE. THE CONTACT ATTEMPTED ON SEVERAL OCCASIONS TO HAVE THE VEHICLE REPAIRED UNDER THE RECALL BUT WAS TOLD BY THE MANUFACTURER THAT THE NHTSA WAS THE CAUSE OF THE DELAY IN THE REPAIRS. THE VEHICLE WAS NOT REPAIRED AND ONE YEAR AFTER RECEIVING THE RECALL NOTICE, THE MANUFACTURER WAS STILL UNABLE TO PROVIDE AN ESTIMATED TIME OF WHEN THE PARTS WOULD BECOME AVAILABLE. THE VEHICLE BECAME INOPERABLE DUE TO THE FAULTY BRAKES. THE FAILURE AND CURRENT MILEAGES WERE APPROXIMATELY 22,000.  UPDATED  01/24/11 *BF  UPDATED 02/03/11.*JB",
        "vin": "5B4MP67GX33"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/14/2010",
        "dateOfIncident": "07/11/2010",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10343169,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS 2003 FOREST RIVER WINDSONG RV ON A 2003 WORK HORSE CHASSIS. THE CONTACT STATED WHILE DRIVING AT 55 MPH, THE W22FRONT BRAKES BEGAN SMOKING. THE CONTACT MOVED OFF THE ROADWAY TO ALLOW THE BRAKES TIME TO COOL. THE MANUFACTURER ADVISED THEY WERE AWARE OF THE FAILURE AND WERE WORKING ON A REMEDY TO CORRECT THE FAILURE. THERE WAS AN OPEN RECALL ON THE VEHICLE (09V110000: SERVICE BRAKES, HYDRAULIC) YET THERE WAS NOT A REPAIR AVAILABLE TO CORRECT THE FAILURE. THE CONTACT WAS CONCERNED THAT THE FAILURE COULD POTENTIALLY CAUSE A CRASH.  THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 14,000 AND THE CURRENT WAS UNKNOWN. UPDATED 10/28/10. *LJ  UPDATED 10/28/10",
        "vin": "5B4MP67G333"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/07/2010",
        "dateOfIncident": "05/19/2009",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10341889,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 WORKHORSE W22. THE CONTACT STATED THAT SHE CALLED THE DEALER TO MAKE AN APPOINTMENT REGARDING   NHTSA CAMPAIGN ID NUMBER: 09V110000 SERVICE BRAKES HYDRAULIC.  SHE WAS INFORMED THAT THE PARTS WERE NOT AVAILABLE. THEY DID NOT OFFER HER ANY TIME FRAME AND STATED THAT THEY WOULD NOTIFY HER BY MAIL WHEN SHE SHOULD BRING THE VEHICLE IN TO BE REPAIRED. THE FIRST RECALL NOTICE WAS RECEIVED IN MAY 2009. SHE HAS RECEIVED TWO ADDITIONAL IDENTICAL RECALL NOTICES; HOWEVER, THE PARTS ARE NOT AVAILABLE.   THE CONTACT HAS EXPERIENCED BRAKE FAILURE SINCE THE RECALL NOTICES WERE RECEIVED. THE FAILURE AND CURRENT MILEAGES WERE 22,000.",
        "vin": "5B4MP67G233"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/30/2010",
        "dateOfIncident": "06/21/2008",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10340773,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 WORKHORSE W22.  THE CONTACT STATED THAT APPROXIMATELY TWO YEARS AGO WHILE TRAVELING IN WARM WEATHER WITH A HALF OF TANK OF GAS OR LESS, AT VARIOUS SPEEDS THE VEHICLE WOULD  STALL. THE MANUFACTURER WAS CONTACTED AND THEY STATED THEY WERE AWARE OF THE FAILURE, HOWEVER THERE WAS NO RECALL.  THE MANUFACTURER STATED THEY HAVE A REMEDY FOR THE FAILURE, WHICH WAS TO RELOCATE THE FUEL CANISTER TO THE OUTSIDE THE CANISTER.  THE COST OF THE REPAIRS WOULD BE APPROXIMATELY $2,000.00, AT THE CONTACT'S EXPENSE.  THE VEHICLE IS CURRENTLY BEING REPAIRED BY REPLACING A NEW FUEL PUMP AND RELOCATING THE FUEL PUMP.  THE FAILURE MILEAGE WAS APPROXIMATELY 18,000.  THE CURRENT MILEAGE IS APPROXIMATELY 32,000.     THE VIN WAS UNAVAILABLE. UPDATED 10/27/10.*LJ",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/22/2010",
        "dateOfIncident": "06/22/2010",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10339447,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 WINNEBAGO ADVENTURER RV ON 2003 WORKHORSE W22 CHASSIS. THE CONTACT STATED HER VEHICLE WAS INCLUDED WITH NHTSA CAMPAIGN ID NUMBER: 09V110000 (SERVICE BRAKES, HYDRAULIC). THE MANUFACTURER WAS CONTACTED SEVERAL TIMES TO MAKE AN APPOINTMENT FOR REPAIRS AND THE CONTACT WAS REPEATEDLY INFORMED THAT THE PARTS WERE NOT YET AVAILABLE. THE CONTACT STATED THE PARTS HAVE BEEN UNAVAILABLE FOR OVER ONE YEAR.  UPDATED 08/13/10. *LJ  UPDATED 08/23/10*JB",
        "vin": "5B4MP67G133"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/21/2010",
        "dateOfIncident": "07/11/2009",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10336992,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER WRITES REGARDING SAFETY RECALL FOR 2003 W22 WORKHORSE CHASSIS*TGW  WHILE ON A TRIP, THE ABS LIGHT ILLUMINATED AND WHEN THE CONSUMER APPLIED THE BRAKE, IT WENT TO THE FLOOR. THE CONSUMER TOOK THE RV TO THE NEAREST REPAIR SHOP TO HAVE THE BRAKES CHECKED.  THE REPAIR SHOP MADE THE NECESSARY BRAKE REPAIRS. THE CONSUMER SENT IN THE REPAIR BILL. HOWEVER, WORKHORSE DENIED THE CLAIM STATING THE REPAIR WAS MADE TO THE ABS SENSOR AND WAS NOT ATTRIBUTED TO A CALIPER MALFUNCTION.  THE CONSUMER STATED HE IS STILL EXPERIENCING BRAKE PROBLEMS *JB",
        "vin": "5B4MP67G633"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/14/2010",
        "dateOfIncident": "06/02/2008",
        "fire": true,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10336207,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 WORKHORSE W22 RV. THE CONTACT STATED  THAT HE RECEIVED NOTIFICATION OF NHTSA CAMPAIGN ID NUMBER: 09V110000 (SERVICE BRAKES, HYDRAULIC) IN 2009 AND RECEIVED A SECOND NOTICE SHORTLY AFTER STATING THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REPAIR. THE CONTACT TOOK THE VEHICLE TO AN AUTHORIZED DEALER FOR REPAIRS, WHICH WOULD INCLUDE REPLACING THE ROTORS, BRAKE FLUID, SEALS, AND OTHER PARTS. THE MANUFACTURER STATED THERE WERE NO FAILURES WITH THE CALIPERS THEREFORE; REPAIRS WOULD BE DONE AT THE OWNERS EXPENSE. THE CONTACT DID NOT FEEL SAFE DRIVING THE VEHICLE. THE FAILURE MILEAGE WAS APPROXIMATELY 18,700.",
        "vin": "5B4MP67G533"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/11/2010",
        "dateOfIncident": "03/15/2010",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10335860,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 WINNEBAGO BRAVE WITH A WORKHORSE W22 CHASSIS MOTOR HOME. WHILE DRIVING AT APPROXIMATE SPEEDS OF 55-60 MPH, THE CONTACT APPLIED THE BRAKES BUT THEY WOULD NOT ENGAGE. HE STATED HE PULLED OVER AND ALLOWED THE VEHICLE TO COOL OFF BEFORE PROCEEDING. THE CONTACT HAD PREVIOUSLY INQUIRED WITH THE MANUFACTURER ABOUT NHTSA CAMPAIGN ID NUMBER: 09V110000 (SERVICE BRAKES, HYDRAULIC) BUT HE WAS TOLD THAT THE PARTS NEEDED TO MAKE REPAIRS WERE NOT AVAILABLE. THE FAILURE AND CURRENT MILEAGES WERE 24,000.",
        "vin": "5B4MP67G633"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/08/2010",
        "dateOfIncident": "02/01/2009",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10334895,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 W22 WORKHORSE CHASSIS. CONSUMER REPORTS BRAKE CALIPER PROBLEMS *TGW  IN FEBRUARY 2009 THE ABS SENSORS WERE SERVICED DUE TO THE LIGHT ILLUMINATING.  THE CONSUMER STATED HE THEN RECEIVED A RECALL NOTICE REGARDING THE BRAKES, DESPITE BEING TOLD THE BRAKES WERE IN GOOD CONDITION. WHILE DRIVING, THE CONSUMER STARTED TO HEAR A LOW SQUEAL AT LOW SPEED BRAKING. THE CONSUMER STATED AFTER READING THE MANUAL HE CONCLUDED THAT THE SQUEALING WAS NOT A MAJOR PROBLEM.  BEFORE TAKING A TRIP, THE CONSUMER DECIDED TO HAVE THE BRAKES INSPECTED. UPON INSPECTION, THE MECHANIC FOUND THAT ONE OF THE PADS HAD WORN DOWN TO THE BARE METAL. WHICH IN TURN, HAD SCORED AND PITTED THE ROTOR TO THE POINT WHERE IT NEEDED TO BE REPLACED. ALL THE OTHER PADS WERE IN GOOD SHAPE. ALSO WHEN THE MECHANIC CHECKED THE BRAKE FLUID RESERVOIR IT CONTAINED A GELLED SUBSTANCE. HE SAID THE FLUID WAS FINE, BUT QUESTIONED WHY THE RESERVOIR FLUID HAD A GELLED LIKE CONSISTENCY.",
        "vin": "5B4MP67G933"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/08/2010",
        "dateOfIncident": "03/09/2008",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10335185,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS 2003 DAMON INTRUDER RV. THE VEHICLE WAS EQUIPPED WITH A WORKHORSE CHASSIS W22. WHILE THE CONTACT WAS DRIVING APPROXIMATELY 5 MPH, BACKING INTO A PARKING SPACE, THE BRAKES FAILED WITHOUT WARNING. THE EMERGENCY BRAKES WERE ENGAGED TO STOP THE VEHICLE. THE VEHICLE WAS TOWED TO AN AUTHORIZED DEALER FOR DIAGNOSIS AND REPAIRED FOR THE FAILURE. THE BRAKES AND COMPUTERIZED SYSTEM WERE REPLACED AT AN ESTIMATED COST OF $5,000. ALSO, THE CALIPERS WERE REPLACED ON A SEPARATE OCCASION. THERE WAS A RECALL UNDER THE NHTSA CAMPAIGN ID NUMBER 09V110000 (SERVICE BRAKES, HYDRAULIC. HOWEVER, THE PART WAS UNAVAILABLE FOR THE RECALL REMEDY REPAIR. THE CONTACT HAD CONCERN OF THE LENGTHY PERIOD OF TIME AND UNCERTAINTY OF THE PART AVAILABILITY FOR THE REPAIR. THE FAILURE MILEAGE WAS 18,000.   UPDATED 11/15/10 *CN  THE CONSUMER STATED THE RV WAS REPAIRED ON OCTOBER 2010. UPDATED 11/26/10*JB",
        "vin": "5B4MP676733"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/25/2010",
        "dateOfIncident": "11/04/2007",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10332139,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 WORKHORSE W22 RV. THE CONTACT STATED HE RECEIVED APPROXIMATELY SIX DIFFERENT RECALL AND INTERIM RECALL LETTERS FOR BRAKE FAILURES IN HIS VEHICLE (NHTSA CAMPAIGN ID NUMBER 09V110000: SERVICE BRAKES, HYDRAULIC). IN NOVEMBER 2008, THE CONTACT PHONED THE MANUFACTURER AS HE WAS ADVISED IN THE RECALL LETTER AND WAS INFORMED THAT THE PARTS NEEDED TO COMPLETE RECALL REPAIRS WERE NOT YET AVAILABLE. TWO YEARS AFTER RECEIVING THE INITIAL RECALL LETTER; THE MANUFACTURER WAS STILL STATING THAT THE PARTS WERE NOT YET AVAILABLE. THE CONTACT BELIEVED THE RECALL WAS NOT BEING HANDLED IN A REASONABLE TIME FRAME WHEN DEALING WITH A CONFIRMED SAFETY DEFECT. THE FAILURE MILEAGE WAS APPROXIMATELY 25,000 AND THE CURRENT MILEAGE WAS APPROXIMATELY 30,000.",
        "vin": "5B4MP67G433"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/24/2010",
        "dateOfIncident": "05/16/2010",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10331925,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONTACT OWNS A 2003 WORKHORSE W22.  THE CONTACT STATED THAT WHILE TRAVELING DOWN THE HIGHWAY AT APPROXIMATELY 40MPH THE CALIPER BEGAN TO LOCK UP AND THE VEHICLE BEGAN TO SHIMMY.  UPON ARRIVING AT THEIR DESTINATION THE BRAKES FAILED TOTALLY.  WORKHORSE WAS NOTIFIED AND THE OWNER WAS TOLD TO DRIVE THE VEHICLE 100 MILES TO HAVE IT REPAIRED.  THE OWNER HAS RECEIVED THE RECALL NOTICE FOR NHTSA CAMPAIGN ID NUMBER: 09V110000 IN MAY 2009, BUT PARTS  ARE STILL NOT AVAILABLE.  WORKHORSE ADVISED THE OWNER THAT HE NEEDED TO CALL EVERY DAY TO CHECK ON THE PARTS.  THE OWNER IS UNABLE TO DRIVE THE VEHICLE BECAUSE  THE VEHICLE HAD NOT BEEN REPAIRED.  THE FAILURE AND CURRENT MILEAGE IS APPROXIMATELY 47,500.",
        "vin": "5B4MP67G023"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/21/2010",
        "dateOfIncident": "05/09/2010",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10331612,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 GEORGIE BOY CRUISE MASTER. THE VEHICLE WAS EQUIPPED WITH A WORKHORSE CHASSIS W22. THE CONTACT RECEIVED A RECALL NOTIFICATION UNDER NHTSA CAMPAIGN ID NUMBER 09V110000 (SERVICE BRAKES, HYDRAULIC). THE RECALL REPAIR PART WAS UNAVAILABLE. THE CONTACT HAD NOT EXPERIENCED THE FAILURE, HOWEVER WAS DISPLEASED TO KNOW THE PART WAS UNAVAILABLE FOR A SIGNIFICANT PERIOD OF TIME. THERE WAS A CONCERN OF THE POTENTIAL SAFETY HAZARD. THE CURRENT MILEAGE WAS APPROXIMATELY 45,000. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/04/2010",
        "dateOfIncident": "05/04/2010",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10329551,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 WORKHORSE CHASSIS 2003. CONSUMER STATED HE EXPERIENCED BRAKE FAILURE AND REQUESTS REIMBURSEMENT *TGW  PRIOR TO RECEIVING A RECALL NOTICE, THE RV HAD BEEN REPAIRED SEVERAL TIMES DUE TO THE BRAKES OVERHEATING AND THE CALIPERS BECOMING STUCK.  THE CONSUMER STATED HE SUBMITTED ALL OF THE INVOICES, BECAUSE WORKHORSE STATED THEY WOULD REIMBURSE HIM, BUT NOW THEY ARE REFUSING TO REIMBURSE HIM. *JB",
        "vin": "5B4MP67G933"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/04/2010",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10328536,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 WORKHORSE W22 CHASSIS. CONSUMER IS UPSET THAT HE WAS NOT REIMBURSED FOR HIS RV REPAIRS. *GR  PRIOR TO THE RECEIVING THE RECALL NOTICE, THE CONSUMER HAD TO REPLACE TWO ABS SENSORS DUE TO HEAT DAMAGE. THE CONSUMER STATED THE RV HAD BEEN PARKED FOR FIVE MONTHS PRIOR TO THE BRAKE FAILURE. THE ABS SENSORS FAILED BECAUSE THE BRAKE CALIPERS WERE STUCK IN THE APPLIED POSITION WHICH CAUSED THE BRAKE PADS TO DRAG ON THE ROTORS AND HEAT UP. AS HE WAS DRIVING, A SIGNAL ON THE DASH SOUNDED AND THE ABS LIGHT ILLUMINATED AND HE FELT THE BRAKE PEDAL BECOME SOFT AND THEN IT WENT TO THE FLOOR. WHEN THE CONSUMER EXITED THE RV, THERE WAS A VERY DISTINCT BRAKE BURNING SMELL COMING FROM THE TWO REAR WHEELS. WORKHORSE DENIED THE CLAIM CITING THERE WAS NO INDICATION OF EXCESSIVE HEAT FOUND NOR WAS IT DUE TO A CALIPER MALFUNCTION.  *JB",
        "vin": "5B4MP67G533"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/29/2010",
        "dateOfIncident": "10/01/2009",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10328496,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER EXPERIENCED A FAILURE WITH LEFT FRONT BOSCH CALIPER. 2004 WINNEBAGO ON A 2003 W22 WORKHOUSE CUSTOM CHASSIS   *GR  THE CONSUMER STATED THE LEFT FRONT CALIPER FAILED TO THE EXTENT THAT IT WAS BASICALLY DESTROYED WHILE THE OTHER ROTORS WORKED AS NORMAL.  *JB",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/19/2010",
        "dateOfIncident": "05/01/2009",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10326314,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*-THE CONTACT OWNS A 2003 WORKHORSE W22 CHASSIS. THE CONTACT STATED THAT IN MAY 2009 HE RECEIVED HIS FIRST RECALL LETTER. A LETTER REGARDING THE RECALL WAS RECEIVED IN DECEMBER 2009 WHICH STATED THE PARTS FOR THE RECALL REMEDY WERE BEING MANUFACTURED. THE SENSORS, CALIPERS AND ROTOR WERE REPAIRED AT THE OWNER EXPENSE. THE MANUFACTURER REIMBURSED FOR THE CALIPER REPAIR. HOWEVER, THE MANUFACTURER REFUSED TO REIMBURSE FOR THE SENSOR OR ROTOR SERVICE REPAIR. THE FAILURE MILEAGE WAS 43,000. THE CURRENT MILEAGE WAS 44,000.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/14/2010",
        "dateOfIncident": "12/14/2009",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10316507,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 W22 WORKHORSE CHASSIS WITH DEFECTIVE BRAKES WITH A RECALL.  *KB  THE CONSUMER STATED WHEN HE ARRIVED AT HIS DESTINATION, HE SMELLED A BURNING ODOR. THE DASHBOARD DID NOT SHOW ANY WARNING LIGHTS. ALSO, AT THE SAME TIME THE BRAKE PEDAL WENT TO THE FLOOR. THE NEXT DAY, THE RV WAS TOWED TO A REPAIR FACILITY. THE CONSUMER WAS INFORMED THE MASTER CYLINDER, CALIPERS, ALL THE BRAKE LINES, HOSES,  AND WHEEL CYLINDERS NEEDED TO BE REPLACED BECAUSE THE BRAKE FLUID BECAME SO HOT, IT DESTROYED ALL OF THE COMPONENT'S.  WHEN THE CONSUMER ARRIVED HOME,  THERE WAS A SAFETY RECALL NOTICE IN THE MAIL. THE CONSUMERS CLAIM FOR REIMBURSEMENT WAS DENIED.  WORKHORSE STATED THE DOCUMENTS THE CONSUMER PROVIDED DID NOT INDICATE THERE WAS DAMAGE TO THE CALIPERS, ROTORS AND PADS.  *JB",
        "vin": "5B4MP67G333"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/17/2010",
        "dateOfIncident": "05/18/2009",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10320394,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 WORKHORSE W22 RECREATIONAL VEHICLE. THE CONTACT STATED THE BRAKES ON THE VEHICLE WERE EXHIBITING FAILURE. THE FRONT LEFT BRAKES ON THE RV CONTINUED TO FAIL THE MOST. HE RECEIVED NOTIFICATION OF A RECALL CAMPAIGN (NHTSA CAMPAIGN ID NUMBER 09V110000: SERVICE BRAKES: HYDRAULIC) AND UPON CONTACTING THE MANUFACTURER, WAS UNABLE TO RECEIVE ANY ASSISTANCE. THE RECALL WAS ISSUED APRIL 2009 AND TO DATE, THE MANUFACTURER HAS NOT YET HONORED THE RECALL. THE CONTACT ALSO STATED THE VEHICLE WAS PULLING TO THE RIGHT WHEN OPERATING AND WOULD INCREASE STOPPING DISTANCE. THE MANUFACTURE WAS CONTACTED AND ADVISED THEY WERE NO LONGER HONORING THE RECALL. THE CONTACT WAS CONCERNED WITH HIS SAFETY IN THE VEHICLE. THE FAILURE MILEAGE WAS 38,000 AND THE CURRENT MILEAGE WAS 45,000.",
        "vin": "5B4MP67G633"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/03/2010",
        "dateOfIncident": "01/07/2010",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10314365,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 WINNEBAGO ADVENTURER.(2003 WORKHORSE W22 CHASSIS) CONSUMER REQUESTS REIMBURSEMENT FOR REPAIRS TO THE BRAKES BEFORE RECEIPT OF RECALL NOTICE.  *TGW  THE CONSUMER STATED THE ABS LIGHT WOULD COME ON AND GO OFF PERIODICALLY. ALSO, THERE WERE UNUSUAL SOUNDS COMING FROM THE BRAKES WHEN THEY WERE APPLIED AS WELL AS A MUSHY FEEL. IN ADDITION, FROM TIME TO TIME THE LEFT REAR WHEEL WOULD OVERHEAT. THE CONSUMER TOOK THE RV TO A REPAIR SHOP WHERE HE WAS INFORMED THE RV WOULD NEED A COMPLETE BRAKE JOB; WHICH INCLUDED PADS, ROTORS AND CALIPERS.  *JB  THE CONSUMER RECEIVED REIMBURSEMENT FOR THE BRAKE REPAIRS ON HIS RV. UPDATED 06/17/10. *JB",
        "vin": "5B4MP67G933"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/26/2010",
        "dateOfIncident": "12/12/2009",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10314601,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 DOLPHIN NATIONAL WORKHORSE CHASSIS   W-22. HE RECEIVED AN INTERIM LETTER DECEMBER 2009 STATING HIS RECREATIONAL VEHICLE (RV) WAS UNDER RECALL (NHTSA CAMPAIGN ID NUMBER: 09V110000, SERVICE BRAKES, HYDRAULIC), HOWEVER THE PARTS WERE NOT YET AVAILABLE. TWO MONTHS LATER, HE CONTACTED THE MANUFACTURER TO INQUIRE ABOUT THE PARTS AND IF THEY WERE YET AVAILABLE. THE MANUFACTURER COULD NOT BE CONTACTED. HE ALSO INQUIRED VIA EMAIL AND LEFT SEVERAL MESSAGES, WITH NO RESULTS. HE HAD EXPERIENCED BRAKE FAILURE TWICE BEFORE HE RECEIVED THE RECALL LETTER PERTAINING TO THE SERVICE BRAKES. THE CONTACT WAS UNABLE TO RECEIVE RECALL REPAIRS WITHIN A REASONABLE TIME-FRAME. THE FAILURE MILEAGE WAS APPROXIMATELY 13,000 AND THE CURRENT WAS 15,000.",
        "vin": "5B4MP67G823"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/28/2010",
        "dateOfIncident": "12/16/2009",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10302849,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 WINNEBAGO ADVENTURER(WORKHORSE W22) SAFETY RECALL 50901-C.  *NJ  THE ABS SENSOR LIGHT WOULD ILLUMINATE AND GO OUT PERIODICALLY.  THE RV WAS INSPECTED BY 2 DIFFERENT DEALERSHIPS. BOTH INDICATED THAT THEY COULD NOT FIND ANYTHING WRONG WITH THE SENSORS. ALSO, THERE WAS AN UNUSUAL SOUND COMING FROM THE BRAKES WHEN THE BRAKE PEDAL WAS APPLIED AS WELL AS SOME SOFTNESS IN THE BRAKES OVER THE PAST FEW MONTHS. IN ADDITION, FROM TIME TO TIME, THE LEFT REAR WHEEL OVERHEATED. THE CONSUMER RECEIVED AN INTERIM RECALL NOTICE, BUT HAD NOT HEARD ANYTHING ELSE ABOUT A FIRM DECISION AS TO WHAT WORKHORSE WAS GOING TO DO TO FINALIZE AND FIX THE PROBLEMS. WHILE DRIVING, THE LEFT REAR WHEEL BEGAN TO OVERHEAT. THE RV WAS TAKEN TO A WORKHORSE SERVICE CENTER. UPON INSPECTION, THE CONSUMER WAS INFORMED THE RV NEEDED A COMPLETE BRAKE JOB, INCLUDING PADS, ROTORS AND CALIPERS. THE CONSUMER RECEIVED ANOTHER RECALL IN WHICH THE INTERIM RECALL HAD BEEN UPDATED AND THE RECALL POINTED OUT THE RELATED SYMPTOMS AND WARNING SIGNS THAT THE CONSUMER HAD ALREADY EXPERIENCED. *JB",
        "vin": "5B4MP67G933"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/11/2010",
        "dateOfIncident": "09/01/2009",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10298986,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS 2003 GULF STREAM SUN VOYAGER RV. THE VEHICLE WAS EQUIPPED WITH A 2003 WORKHORSE CHASSIS W22. THE CONTACT WAS DRIVING APPROXIMATELY 40 MPH ON NORMAL ROAD CONDITIONS WHEN THE \"ANTI-LOCK BRAKE SYSTEM\" (ABS) WARNING LIGHT INDICATOR ILLUMINATED ON THE INSTRUMENT PANEL. THE WARNING INDICATOR REMAINED ILLUMINATED UNTIL THE ENGINE WAS TURNED OFF. THERE WAS PRESSURE APPLIED TO THE BRAKE PEDAL, FOLLOWED BY NO POWER RESPONSE. THE VEHICLE SLOWED DOWN AFTER SEVERAL ATTEMPTS TO ACCELERATE. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER FOR INSPECTION WHERE A TEMPORARY REPAIR WAS PERFORMED ON THE VEHICLE. THE CONTACT RECEIVED RECALL CAMPAIGN ID NUMBER 09V110000, SERVICE BRAKES, HYDRAULIC IN MAY, 2009 WHICH WAS PRIOR TO THE BRAKE FAILURE; HOWEVER, THE VEHICLE WAS NOT REPAIRED DUE TO THE PART BEING UNAVAILABLE. THERE WERE CONCERNS OF THE SAFETY RISKS INVOLVED AND THE UNCERTAINTY OF THE AVAILABILITY OF THE PART. THE VIN WAS REJECTED FROM THE SYSTEM WHICH WILL BE UPDATED UPON RECEIPT OF THE COMPLAINT FORM. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/04/2010",
        "dateOfIncident": "04/04/2009",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10298176,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 FOREST RIVER WINDSONG RV WORKHORSE  CHASSIS W22.  THE CONTACT WAS DRIVING APPROXIMATELY 55 MPH ON NORMAL ROAD CONDITIONS AND SUDDENLY, THE BRAKES BEGAN TO DRAG AND THERE WAS A STRONG BURNING ODOR.  THE DRIVER PULLED OVER TO THE SIDE OF THE ROAD, INSPECTED THE VEHICLE AND OBSERVED THAT  THE FRONT DRIVER SIDE TIRE WHEEL AREA EXHIBITED EXCESSIVE HEAT.  A RECALL NOTIFICATION LETTER WAS RECEIVED ON MAY 23, 2009 UNDER NHTSA CAMPAIGN ID NUMBER 09V110000 (SERVICE BRAKES, HYDRAULIC).  THERE WERE CONCERNS OF THE SAFETY RISKS INVOLVED AND THE UNCERTAINTY OF THE AVAILABILITY OF THE  RECALL PART. THE FAILURE MILEAGE WAS 16,800. THE CURRENT MILEAGE WAS 17,449.         UPDATED 1/28/10 *CN  UPDATED 02/03/10.*JB",
        "vin": "5B4MP67G433"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/30/2009",
        "dateOfIncident": "05/01/2009",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10297559,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 WORKHORSE W22 CHASSIS RV. SHE RECEIVED RECALL NOTICE NUMBER 09V110000(SERVICE BRAKES, HYDRAULIC). 6 MONTHS LATER THE REMEDY REFERENCED IN THE RECALL REMAINED UNAVAILABLE. THE CURRENT MILEAGE WAS UNDER 7576.    THE CONSUMER'S HUSBAND TOOK THE RV TO BE INSPECTED AND AFTER LEAVING THE DEALERSHIP, THE BRAKES FAILED. UPDATED 01/29/10  THE CONSUMER STATED THE RV HAS BEEN OUT OF COMMISSION FOR OVER A YEAR. THE CONSUMER STATED WORKHORSE OFFERED A TEMPORARY FIX THAT THEY MAY OR MAY NOT PAY FOR.  UPDATED 04/08/10.*JB  UPDATED 05/26/10.*JB",
        "vin": "5B4MP67G833"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/17/2009",
        "dateOfIncident": "02/09/2003",
        "fire": true,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10296224,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 REXHALL REXAIR RV, WITH A WORKHORSE CHASSIS W22.  WHILE DRIVING APPROXIMATELY 60 MPH HE SMELLED A BURNING ODOR FROM THE BRAKES.  DURING BRAKE APPLICATION, THE PEDAL WENT TO THE FLOOR, BUT THE VEHICLE WOULD NOT STOP.    THE FAILURE OCCURRED INTERMITTENTLY.  THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER FOR INSPECTION.  HIS VEHICLE IDENTIFICATION NUMBER WAS EXCLUDED FROM RECALL CAMPAIGN ID NUMBER 09V110000 (SERVICE BRAKES, HYDRAULIC).  NO REPAIRS WERE MADE.  THE FAILURE MILEAGE WAS 3,000.  THE CURRENT FAILURE MILEAGE WAS 42,000.",
        "vin": "5B4MP67G333"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/14/2009",
        "dateOfIncident": "12/14/2009",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10295589,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 WORKHORSES CHASSIS W22. HE RECEIVED RECALL NOTICE # 09V110000 (SERVICE BRAKES, HYDRAULIC). HE CONTACTED THE MANUFACTURER IN REFERENCE TO A RECENT BRAKE FAILURE. WHILE DRIVING 65 MPH HE EXPERIENCED BRAKE DRAG ALONG WITH THE ABS WARNING LIGHT ILLUMINATED ON THE INSTRUMENT CONTROL PANEL. A REPRESENTATIVE FROM THE DEALER STATED THAT ALTHOUGH IDENTICAL SYMPTOMS WERE PRESENT, HE WOULD HAVE TO PAY A DIAGNOSTIC FEE PRIOR TO SERVICE. NO REPAIRS  WERE MADE. THE FAILURE AND CURRENT MILEAGES WERE NOT APPLICABLE.      UPDATED 01/1410 *BF  THE CONSUMER STATED WHILE DRIVING THE ABS LIGHT ILLUMINATED AND THERE WAS A SMELL OF BRAKES BURNING AND THE BRAKE PAD WAS WEAK AND HAD TO BE PUMPED TO GET THE RV TO STOP. THE WHEEL SPEED SENSOR WAS LOOSE AND MELTED AGAINST THE ROTOR. UPDATED 01/20/10.*JB",
        "vin": "5B4MP67G823"
    },
    {
        "components": "SERVICE BRAKES, ELECTRIC",
        "crash": false,
        "dateComplaintFiled": "11/24/2009",
        "dateOfIncident": "11/24/2009",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10293469,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WE DROVE 300 MILES AND FELT THE REAR CALIPERS HANGING UP ON 3 OCCASIONS.  AS SOON AS WE GOT ON THE INTERSTATE, WE FELT THE MTRHOME HAD NO POWER, AS IF THE BRAKES WERE BEING APPLIED AND THEN SMELLED BURNING BRAKE ODOR.  STOPPED AT THE FIRST REST AREA IN A COUPLE OF MILES, LET THEM COOL FOR 2 HOURS, THEN THEY DID RELEASE AND AS LONG AS WE WERE ON THE INTERSTATE NOT USING BRAKES, WE WERE FINE.  AS SOON AS WE GOT OFF THE INTERSTATE TO GO TO THE RV PARK, WITHIN 2 MILES, THE BRAKES ONCE AGAIN HEATED UP BUT NOT ENOUGH TO CAUSE DAMAGE.  NEXT DAY WE CONTINUED ON THE INTERSTATE WITH NO PROBLEMS UNTIL WE EXITED IN OCALA.  AGAIN, WE DROVE A FEW MILES TO A PARK AND PARKED FOR THE NIGHT.  NEXT DAY, DROVE LESS THAN A MILE TO OUR WORKHORSE SERV CTR TO HAVE IT CHECKED.  THEY COULD FIND NO DAMAGE TO THE BRAKES SO WERE UNABLE TO AUTHORIZE REPLACEMENT OF THE REAR CALIPERS PER SAFETY RECALL 50901-C.  WE, HOWEVER, BEING FAMILIAR WITH THE SYMPTOMS, I.E., SMELL OF BURNING BRAKES, LOSS OF POWER, KNOW THAT THEY WERE IN FACT INTERMITTENTLY HANGING UP.  WE OPTED TO REPLACE THE REAR CALIPERS AT OUR EXPENSE($435) SINCE WE DO NOT WANT TO BE STRANDED ON THE SIDE OF THE ROAD AGAIN AS WE HAVE IN THE PAST ON 3 OCCASIONS.  WE HAVE REPLACED ALL 4 CALIPERS, 4 ROTORS, BRAKE PADS & FRONT BRAKE LINES AT OUR EXPENSE.  WE REQUESTED REIMBURSEMENT ON THE PREVIOUS ISSUES IN JULY, BUT HAVE NOT RECEIVED A RESPONSE.  WE CHANGED THE FLUID AND LUBED THE SLIDES PRIOR TO OUR RECENT TRIP.  SINCE WE HAVE HAD BRAKE FAILURES ON 8/18/08, 8/21/08 AND 12/4/08 AND 11/24/09 WE KNOW WHAT IT FEELS LIKE TO PUSH THE BRAKE PETAL AND HAVE IT GO ALL THE WAY TO THE FLOOR AND NOT STOP. WE FEEL THAT WE ARE BEING  PENALIZED BECAUSE WE ARE CONSCIENTIOUS DRIVERS AND DO NOT CONTINUE DRIVING UNTIL THE CALIPERS ARE SO HOT THEY BURN UP THE WHOLE BRAKE ASSEMBLY. IT SEEMS THAT ONLY THE IRRESPONSIBLE DRIVERS WHO CONTINUE DRIVING UNTIL THE BRAKES ARE TOAST GET REPLACEMENT CALIPERS FROM WH.  THIS IS A SAFETY ISSUE THAT IS NOT BEING ADDRESSED. *TR",
        "vin": "5B4MP67G933"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/08/2009",
        "dateOfIncident": "10/26/2009",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10291384,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ON OCT 26, 2009, I EXPERIENCED TOTAL BRAKE FAILURE ON 2003 WINNEBAGO MOTOR HOME AT 18,000 MILES. AFTERWARD, I DISCOVERED THE CHASSIS, MANUFACTURED BY WORKHORSE, A DIVISION OF NAVISTAR, IS UNDER A RECALL. NHTSA CAMPAIGN ID NUMBER :  09V110000  MY MOTOR HOME IS UNSAFE TO DRIVE, (STICKING, OVERHEATING BRAKE SYSTEM) AND THE ABS (AUTOMATIC BRAKE SYSTEM) WARNING LIGHT IS ON TELLING ME THERE IS A PROBLEM. WORKHORSE REFUSES TO FIX THE BRAKES TO MAKE IT SAFE TO DRIVE. THEIR POSITION SEEMS TO BE DUAL, 'WAIT UNTIL WE HAVE THE 'FIX' READY, SOMETIME NEXT YEAR.' AND, AT THE SAME TIME, SAYING 'THE STICKING BRAKE SITUATION IS YOUR FAULT.' THIS DUAL STATEMENT SEEMS TO BE THE \"LINE\" THEY ARE FEEDING TO ALL OF US, AT THIS TIME. IT IS OUTRAGEOUS!  ACCORDING TO THEIR REPRESENTATIVES THE RECALL 'FIX' WILL NOT BE AVAILABLE UNTIL SOMETIME NEXT YEAR'..MAYBE.  I AM ALSO CONCERNED NAVISTAR AND/OR WORKHORSE COULD ENTER BANKRUPTCY BEFORE THIS ISSUE IS ADDRESSED.   THERE ARE THOUSANDS OF US OUT HERE WITH WORKHORSE CHASSIS, MINE IS A WORKHORSE W22, HAVING NEARLY IDENTICAL ISSUES WITH UNSAFE BRAKES. THE SYMPTOM IS THE BRAKE PEDAL GOES TO THE FLOOR RESULTING IN NO BRAKES WITH LITTLE OR NO PRIOR WARNING. AFTER THAT WE DISCOVER THE BRAKES HAVE BEEN STUCK IN THE PARTIALLY APPLIED POSITION WHICH RESULTED IN TREMENDOUS HEAT BEING GENERATED. THAT, IN TURN CAUSES THE BRAKE FLUID TO BOIL. WHEN BRAKE FLUID BOILS IT TURNS TO A GAS. ONCE THIS HAS HAPPENED THE MOTOR HOME HAS NO BRAKES!   WORKHORSE, A DIVISION OF NAVISTAR IS DOING LITTLE IF NOTHING AT THIS TIME TO REMEDY THIS VERY DANGEROUS SITUATION AND APPARENTLY HAS TAKEN THE POSITION THAT THE COST TO REMEDY 50,000 MOTOR HOMES WITH DEFECTIVE BRAKES OUTWEIGHS THE RISK OF PUTTING THEIR CUSTOMER'S LIVES IN JEOPARDY. THIS IS OUTRAGEOUS! PLEASE BE AWARE THAT I WILL BE POSTING THIS ALERT TO YOUR DEPT ON THE RV FORUMS ON THE INTERNET. YOU ARE HEREBY NOTIFIED OF THIS DANGEROUS SITUATION. *TR",
        "vin": "5B4MP67G733"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/07/2009",
        "dateOfIncident": "05/01/2009",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10291298,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "IN MAY 2009 I RECEIVED NOTIFICATION FROM WORKHORSE CUSTOM CHASSIS THAT OUR MOTORHOME WAS INVOLVED IN SAFETY RECALL 50901-C. THE INFORMATION AVAILABLE TODAY FROM THEIR CUSTOMER SERVICE AND WEBSITE IS THE VERY SAME AS IT WAS IN BACK IN MAY ( PROBLEM IDENTIFIED, PARTS NOT AVAILABLE). I FIND IT HARD TO BELIEVE THAT IN SEVEN MONTHS WORKHORSE HASN'T BEEN ABLE TO RESOLVE THIS SAFETY PROBLEM OR PROVIDE THOSE AFFECTED WITH MORE UP TO DATE INFORMATION ON THE ACTIONS BEING TAKEN. WE LIVE IN OUR MOTORHOME FULL-TIME AND HAVE STOPPED TRAVELING BECAUSE WE HAVE EXPERIENCED SOME OF THE IDENTIFIED PROBLEMS ( ABS LIGHT COMING ON AND MUSHY BRAKES) AS MANY OF US CAN'T GET ANY STRAIGHT ANSWERS FROM WORKHORSE, CAN NHTSA PROVIDE AN UPDATE? *TR  UPDATED IVOQ 07/15/10.*JB",
        "vin": "5B4MP67G433"
    },
    {
        "components": "SERVICE BRAKES, ELECTRIC",
        "crash": false,
        "dateComplaintFiled": "11/03/2009",
        "dateOfIncident": "08/15/2009",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10290759,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "REGARDING THE BOSCH BRAKE RECALL, I EXPERIENCED NO BRAKES WHEN THEY OVERHEATED IN AUGUST, 2009. THE BRAKE PEDAL WENT TO THE FLOOR WHEN APPLIED. THANKFULLY I WAS NEAR MY DESTINATION AND CONTACTED A REPAIRMAN THAT INFORMED ME THAT ONCE THEY COOLED DOWN, THE BRAKES WOULD WORK AGAIN AND THEY DID.     MY PROBLEM IS THAT I RECENTLY CONTACTED WORKHORSE WHO ADVISED THAT THEY STILL DO NOT THE PARTS TO CORRECT MY RECALL THAT I RECEIVED BACK IN THE EARLY SPRING OF 2009. WHAT'S UP WITH THAT? AM I TO CONTINUE TO RISK MY FAMILY'S LIFE, AS WELL AS OTHERS ON THE ROAD, WHILE THEY OFFER NO DEFINITE SOLUTION? MAYBE A LARGE LAWSUIT AFTER AN ACCIDENT WILL GET THEIR ATTENTION, YOU THINK? *TR",
        "vin": "5B4MP67G523"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/14/2009",
        "dateOfIncident": "05/13/2004",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10287388,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 WORKHORSE W22. THE CONTACT STATED THAT THE BRAKES WERE REPLACED FOUR TIMES. THE BRAKE PEDAL WOULD STICK TO THE FLOOR, FAIL TO STOP THE VEHICLE AND EXHIBIT A BURNING SMELL WHEN THE BRAKE PEDAL WAS ENGAGED. NHTSA CAMPAIGN #09V110000, SERVICE BRAKES, HYDRAULIC WAS RELATED TO THE FAILURE; HOWEVER, HE RECEIVED NO ASSISTANCE FROM THE DEALER. THE MANUFACTURER REFUSED ASSUME THE REPAIR COST ON THREE OCCASIONS; HOWEVER, THE MANUFACTURER ASSUMED RESPONSIBILITY FOR THE MOST RECENT FAILURE. THE MANUFACTURER ALSO STATED THAT IF THE CONTACT SUBMITS INVOICES FOR THE FIRST THREE REPAIRS, THEY WOULD REIMBURSE HIM; HOWEVER, THEY DENIED REIMBURSEMENT AFTER THEY RECEIVED THE INVOICE. THE BRAKES HAVE CONTINUED TO FAIL; ALTHOUGH, THERE WERE FOUR ATTEMPTS TO REPAIR THEM. THE CURRENT MILEAGE WAS APPROXIMATELY 53,400. THE FAILURE MILEAGE WAS 5,000.      UPDATED 11/03/09 *BF  THE CONSUMER STATED THE BRAKE FAILURE HAPPENED WITH NO WARNING AND WHILE THE RV WAS MOVING. UPDATED 11/04/09.*JB",
        "vin": "5B4MP67G433"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/28/2009",
        "dateOfIncident": "09/10/2007",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10285411,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER WANTS TO BE REIMBURSED FOR THE REPAIR FOR THE WORKHORSE CHASSIS SAFETY RECALL 50901-C ON A 2003 GULF STREAM SUN VOYAGER.   *NJ  THE CONSUMER STATED SHE EXPERIENCED SIGNIFICANT BRAKE PROBLEMS ON 2 OCCASIONS. THE ABS LIGHT ILLUMINATED AND THE REAR BRAKES, CALIPERS AND SEALS WERE REPLACED. *JB",
        "vin": "5B4MP67G133"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/28/2009",
        "dateOfIncident": "05/17/2009",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10285413,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WORKHORSE SAFETY RECALL 50901-C.   *NJ  THE CONSUMER STATED WHILE DRIVING THERE WAS A STRONG ODOR OF BURNING RUBBER. THE CONSUMER STOPPED TO INSPECT THE RV AND DISCOVERED BOTH WHEEL HUBS WERE VERY HOT. THE RV WAS TAKEN TO A REPAIR SHOP  WHERE IT WAS DISCOVERED THE RIGHT REAR CALIPER WAS HANGING. BOTH CALIPERS WERE REPLACED. THE CONSUMER WAS INFORMED THAT SOME OR ALL OF THE EXPENSES MAY NOT BE COVERED BY THE RECALL. *JB",
        "vin": "5B4MP67G733"
    },
    {
        "components": "STEERING,SERVICE BRAKES, HYDRAULIC,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/03/2009",
        "dateOfIncident": "09/03/2009",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10283230,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER RECEIVED SAFETY  RECALL 50901-C FOR WORK HORSE CHASSIS.  CONSUMER STATES THAT HIS MOTOR HOME HAS MANY PROBLEMS.   *NJ  THE CONSUMER STATED THE BRAKES HAVE BEEN A MAJOR PROBLEM SINCE PURCHASING THE RV AND THEY ONLY WORKED NORMAL ABOUT 70-80% OF THE TIME. THE CONSUMER STATED HE PURCHASED ALL OF THE CALIPERS AT HIS EXPENSE, BECAUSE NO ONE WANTED TO TAKE RESPONSIBILITY FOR THE PROBLEM AND NOW A RECALL HAS  BEEN ISSUED.  THE POWER STEERING LEAKED AT THE WELD OF THE REAR HOUSING, AND THE CRUISE CONTROL WAS REPAIRED TWICE, BUT IT NEVER STAYED FIXED. *JB",
        "vin": "5B4MP67G633"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/20/2009",
        "dateOfIncident": "02/01/2007",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10281091,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES THAT HIS 2004 WINNEBAGO ITASCA SUNCRUISER HAD BRAKE PROBLEMS.  *NJ  THE RV IS A 2003 WORKHORSE W22 CHASSIS.  THE CONSUMER RECEIVED A RECALL NOTICE IN MAY 2009.  A MONTH AFTER PURCHASING THE RV, HE NOTICED THAT AFTER STOPPING AT A TRAFFIC LIGHT IT TOOK MORE GAS TO GET THE MOTORHOME TO MOVE. A SHORT TIME LATER, HE COULD SMELL THE BRAKES GETTING HOT. THE CONSUMER PULLED OVER AND DISCOVERED THE LEFT FRONT WHEEL WAS EXTREMELY HOT.  IN AUGUST OF 2008 THE CONSUMER FELT THE BRAKES DRAGGING AND GETTING HOT.  HE THEN FOUND THE RIGHT REAR BRAKE WAS THE PROBLEM. HE ALLOWED IT TO COOL DOWN AND THEN PROCEEDED ON HIS WAY. THE CONSUMER THEN NOTICED THE ABS LIGHT HAD ILLUMINATED. THE CONSUMER STATED HE TOOK A TRIP THAT WAS LESS THAN 150 MILES AND THE LEFT FRONT CALIPER LOCKED UP. *JB",
        "vin": "5B4MP67G533"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/18/2009",
        "dateOfIncident": "10/12/2007",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10281068,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 HOLIDAY RAMBLER  HAS A PROBLEM WITH THE BRAKES.   *NJ  THE CONSUMER HAS A 2003 WORKHORSE W22 CHASSIS. THE BRAKES HAVE FAILED 4 TIMES. THE CALIPERS WERE REPLACED, BUT THE BRAKES AND ROTORS WERE NOT REPLACED.  THE BRAKES AND ROTORS OVERHEATED DUE TO THE FAULTY CALIPERS AND THE BRAKE PADS WERE WORN. THE CONSUMER TOOK THE RV TO THE DEALER AND THEY FOUND THE RIGHT REAR SPEED SENSOR OPEN AND BOTH REAR CALIPERS PISTON SEALS HAD MELTED. THEY REPLACED THE REAR CALIPERS, BUT NOT THE FRONT ONES OR THE SPEED SENSORS.   THEE CONSUMER ALSO STATED THE PEDAL WOULD GO DOWN TO THE FLOOR AND THE BAS LIGHT ILLUMINATED. THE CONSUMER WAS THEN INFORMED THE BRAKE FLUID WAS CONTAMINATED AND NEEDED TO BE FLUSHED. AFTER 2 YEARS OF COMPLAINING, THE CONSUMER FINALLY RECEIVED A RECALL NOTICE REGARDING THE BRAKES. *JB",
        "vin": "5B4MP67G633"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/23/2009",
        "dateOfIncident": "06/25/2009",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10278105,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 NEWMAR MOTORHOME WITH W-22 WORKHORSE CHASSIS.   1. I WAS DRIVING IN FRANKFORT, KY, WITH NO HILLS TO SPEAK OF AND ONLY LIGHT BRAKE USAGE. I WAS NOT PULLING A TOWED VEHICLE AND HAVE NEVER PULLED SUCH.  2. LEFT FRONT BRAKE CALIPER LOCKED CAUSING THE WET BEARING SEAL TO LOOSE ALL OIL. WHEEL WAS SO HOT IT WOULD BURN MY HAND WHEN I TOUCH IT. HAD NO BRAKES. THERE WAS A DISTINCTIVE BURNT BRAKE PAD SMELL. MOTORHOME TOWED NEXT MORNING TO GEORGETOWN, KY.   3. AFTER TWO WEEKS, LEFT FRONT CALIPER WAS REPLACED AT WORKHORSE'S EXPENSE. I HAD TO PAY FOR BRAKE FLUID AND BLEEDING THE BRAKES.  THE CALIPER SLIDE PINS HAD BEEN LUBRICATED ACCORDING TO WORKHORSE'S RECOMMENDATIONS TWO MONTHS PRIOR. *TR",
        "vin": "5B4MP67GX33"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/20/2009",
        "dateOfIncident": "06/06/2009",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10277437,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 WORKHORSE W22 CHASSIS.  THE CONTACT RECEIVED A RECALL NOTICE FOR NHTSA CAMPAIGN ID NUMBER 09V110000.  HE WAS INFORMED THAT THE PARTS FOR THE REPAIR WERE UNAVAILABLE.  WHILE DRIVING 15 MPH, THE BRAKES FAILED WHEN THE BRAKE PEDAL WAS DEPRESSED.  THE MANUFACTURER STATED THAT THE VEHICLE COULD NOT BE REPAIRED BECAUSE THE RECALL WAS INTERIM.   THE FAILURE AND CURRENT MILEAGES WERE 18,000.  UPDATED 08/14/09. *LJ  THE REAR BRAKES WERE DRAGGING AND BOILING WITH FLUID.  UPDATED 08/14/09.*JB",
        "vin": "5B4MP67G233"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/16/2009",
        "dateOfIncident": "07/10/2008",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10276960,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 WORKHORSE W22 CHASSIS.  WHILE DRIVING APPROXIMATELY 55 MPH, THE CONTACT NOTICED SMOKE COMING FROM THE VEHICLE.  UPON FURTHER INSPECTION, HE NOTICED THAT THE BRAKE DISC AND WHEEL CYLINDERS FAILED.  HE REPLACED THE UNIT, BUT SHORTLY AFTERWARDS, THE BRAKING SYSTEM LOCKED WHILE DRIVING.  THE DEALER STATED THAT THEY DID NOT HAVE THE PARTS TO REPAIR THE VEHICLE.  THE VEHICLE HAS NOT YET BEEN REPAIRED.  THE FAILURE MILEAGE WAS 20,000 AND CURRENT MILEAGE WAS 30,000.    UPDATED 11/23/09  *BF  THE REAR ROTORS WERE BROKEN AND THE RIGHT FRONT HUB SEAL WERE LEAKING. UPDATED 11/24/09",
        "vin": "5B4MP67G833"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/25/2009",
        "dateOfIncident": "08/01/2007",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10274944,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE FAIL. *TR",
        "vin": "5B4MP67G933"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/24/2009",
        "dateOfIncident": "05/26/2009",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10274799,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "26 MAY 2009 - WHILE DRIVING MY 2004 NATIONAL DOLPHIN (WORKHORSE W-22) MOTORHOME FROM COCOA BEACH, FL TOWARD MY DESTINATION, HOME, I ENCOUNTERED A STRONG PULL OF THE VEHICLE TO THE RIGHT. STOPPING AND MAKING AN INSPECTION OF THE FRONT WHEELS REVEALED THE RIGHT HUB WAS VERY HOT AND A SMELL OF HOT BRAKES.  I CAREFULLY MADE MY WAY TO THE NEXT CAMPGROUND; THERE I WAS ABLE TO CONTACT AN RV REPAIR SERVICE.  WITH THEIR MOBILE SERVICE THEY CAME TO THE CAMPGROUND AND MADE AN INSPECTION.  THEIR FINDING REVEALED THAT A CALIPER, BRAKE PADS AND BRAKE LINE HAD GOTTEN VERY HOT AND WAS DAMAGED.  THEIR RECOMMENDATION WAS THE REPLACEMENT OF THESE PARTS PLUS THE ABS SENSOR, AND FOR SAFETY, REPLACE THE SAME PARTS TO THE OTHER FRONT WHEEL.  I WAS STRANDED AT THIS CAMPGROUND WHILE PARTS WERE ORDERED AND SHIPPED.  29 MAY 2009 - THE RV SERVICE COMPANY MADE THE REPAIRS AT THE CAMPGROUND WITH THEIR MOBILE SERVICE AT A COST OF $1147.40. *TR  THE CONSUMER STATED HE RECEIVED A DECEMBER 2009 UPDATED NOTICE REGARDING THE DEFECTIVE BRAKES WHICH STATED A FINAL REMEDY HAD BEEN DETERMINED. HOWEVER, WHEN HE CALLED WORKHORSE CUSTOM CHASSIS TO GET A CURRENT UPDATE, THEY DIDN'T HAVE ONE.  UPDATED 03/08/10",
        "vin": "5B4MP67G233"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/20/2009",
        "dateOfIncident": "06/17/2009",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10274425,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTICED DURING A RECENT TIRE CHANGE THAT 3 OUT OF 4 ROTORS HAD RADIAL CRACKS COMPLETELY THROUGH THE DISK.  ONE ON EACH ROTOR AND TWO ON THE RIGHT FRONT.  NO CRACKS WERE NOTED ON THE RIGHT REAR.  THESE CRACKS ARE ONLY ON THE OUTER DISK.  NO OTHER CRACKS WERE FOUND WITH THE EXCEPTION OF LIGHT SURFACE CRACKS ON ALL INNER AND OUTER ROTORS. *TR",
        "vin": "5B4MP67G723"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/01/2009",
        "dateOfIncident": "05/23/2008",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10272499,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 GEORGIE BOY CRUISE MASTER WITH A 2003 WORKHORSE W22.  THE CONTACT NOTICED BRAKE FAILURE WITHIN THE CHASSIS.  AFTER STOPPING THE VEHICLE REPEATEDLY, THE FRONT CALIPERS WOULD DRAG AND BUILD UP HEAT.  THE BRAKE PEDAL SEEMED SPONGY AND WOULD EXTEND ALL THE WAY TO THE FLOOR, BARELY STOPPING THE VEHICLE.  THE CONTACT RECEIVED A RECALL NOTICE FOR NHTSA CAMPAIGN ID NUMBER 09V110000, BUT ONLY RECEIVED RECORDED MESSAGES WHEN HE CALLED THE MANUFACTURER.  THE CURRENT MILEAGE WAS 15,449 AND FAILURE MILEAGE WAS APPROXIMATELY 15,200.",
        "vin": "5B4MP67G433"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/27/2009",
        "dateOfIncident": "12/20/2008",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10270093,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 WORKHORSE W22.  WHILE DRIVING BETWEEN 45-50 MPH ON NORMAL ROAD CONDITIONS, THE BRAKE PEDAL EXTENDED TO THE FLOOR WITHOUT RESISTANCE WHEN PRESSURE WAS APPLIED.  THE  BRAKES BEGAN TO LOCK UP WITHOUT WARNING.  THE VEHICLE WAS DRIVEN WITH CAUTION AND PARKED FOR AN EXTENDED PERIOD OF TIME.  THE FAILURE RECURRED ON A SEPARATE OCCASION.  THE FAILURE OCCURRED WHENEVER THE VEHICLE WAS IN OPERATION.  THE VEHICLE HAS NOT BEEN REPAIRED.  NHTSA CAMPAIGN ID NUMBER 09V110000 (SERVICE BRAKES, HYDRAULIC) WAS REFERENCED; HOWEVER, THE REPAIR PART WAS UNAVAILABLE DUE TO A MASSIVE BACK ORDER.  THE TECHNICIAN STATED THAT THE PART WOULD BE UNAVAILABLE UNTIL FALL OF 2009.  THE VIN WAS UNAVAILABLE.  THE FAILURE MILEAGE WAS 30,000 AND THE CURRENT MILEAGE WAS UNKNOWN.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/26/2009",
        "dateOfIncident": "05/16/2008",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10269903,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 WORKHORSE W22 CHASSIS.  WHILE THE VEHICLE WAS IDLING, THE CONTACT SMELLED A STRONG BURNING ODOR.  WHEN THE BRAKE PEDAL WAS DEPRESSED, HE EXPERIENCED REDUCED BRAKING CAPABILITY AND THE ABS WARNING INDICATOR ILLUMINATED ON THE INSTRUMENT PANEL.  HE TOOK THE VEHICLE TO A LOCAL REPAIR SHOP AND HAD THE ABS SENSOR REPLACED DUE TO OVERHEATING.  THE CONTACT RECEIVED A RECALL NOTICE FOR NHTSA CAMPAIGN ID NUMBER 09V110000 (SERVICE BRAKES, HYDRAULIC) AND IMMEDIATELY CALLED THE MANUFACTURER.  A REPRESENTATIVE STATED THAT A CORRECTIVE REMEDY HAD NOT BEEN DEVELOPED; THEREFORE, THEY COULD NOT REPAIR THE VEHICLE.  THE FAILURE STILL PERSISTS.  THE FAILURE AND CURRENT MILEAGES WERE NOT APPLICABLE.    UPDATED 5/28/09 *CN  THE CONSUMER STATED ONCE HE GOT ON THE HIGHWAY, THE SMELL SEEMED TO DISSIPATE, BUT WHEN HE CAME TO A STEEP  GRADE AND APPLIED THE BRAKES THE PEDAL WENT TO THE FLOOR AND THE ABS LIGHT ILLUMINATED. THE CONSUMER WAS ABLE TO GET THE VEHICLE TO THE SIDE OF THE ROAD. AFFTER THE RV SAT FOR AN 1/2 THE SMELL WENT AWAY, BUT THE ABS LIGHT STAYED ON. UPDATED 05/29/09.*JB",
        "vin": "5B4MP67G833"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/25/2009",
        "dateOfIncident": "05/03/2008",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10269845,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WE OWN 2003 RV ON A WORKHORSE CHASSIS.  WE JUST RECEIVED FROM WORKHORSE SAFETY RECALL 50901C INTERIM NOTICE.  IN MAY 2008 OUR REAR BRAKES LOCKED UP IN OCALA, FL WHILE ENROUTE TO OUR HOME IN RI.  SEVERE OVERHEATING WITH BRAKE BURNING SMELL, BRAKES DRAGGING AND THE BRAKES BECAME SUDDENLY MUSHY WHEN APPLIED, WE DID NOT REALIZE IT WAS OUR BRAKES BECAUSE OUR WINDOWS WERE CLOSED.  WHEN THE ABS LIGHT CAME ON I IMMEDIATELY PULLED OVER, DISCOVERED THE REAR HUBS WERE VERY HOT.  WE WERE TOWED TO A WHEEL AND BRAKE FACILITY NEAR I 75 WHERE IT WAS DETERMINED THERE WAS EXTENSIVE DAMAGE FROM THE HEAT.  REPLACED WERE BEARINGS IN THE DIFFERENTIAL, CALIPERS, ROTORS. PADS.  WE HAVE CONTACTED THE REPAIR FACILITY TO MAIL US A COMPLETE LIST OF REPAIRS.  WE HAD 23 DAYS LEFT ON A FIVE YR. EXTENDED WARRANTY THAT PAID OVER $1700 AND WE PAID OUT OF POCKET OVER $2100 THAT WAS NOT COVERED BY THE INSURANCE FOR SOME REASON.  THIS YR, APRIL 2009, WE AGAIN TRIED TO DRIVE THE RV HOME FROM CENTRAL FL AND MADE IT 20 MILES UP US27 WHEN AGAIN WE NOTICED THE BURNING SMELL, PULLED OVER, AND THIS TIME THE FRONT HUBS WERE VERY HOT SO WE RETURNED THE RV TO THE CAMPGROUND AND MAKE PLANS TO HAVE THE FRONT BRAKES FIXED WHEN WE RETURN IN THE FALL.  WE DID NOT FEEL THERE WAS ANY HOPE FOR US UNTIL WE GOT THE RECALL NOTICE THE OTHER DAY HERE IN RI. *TR",
        "vin": "5B4MP67G723"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/21/2009",
        "dateOfIncident": "10/28/2008",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10269632,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 MONACO COACH LAPALMA MOTOR HOME.  WHILE DRIVING APPROXIMATELY 40 MPH, THE CONTACT SMELLED SOMETHING OVERHEATING ON HIS VEHICLE.  HE PULLED THE MOTOR HOME OVER TO INSPECT IT, BUT FOUND NO FAILURES.  TWO MILES LATER, THE BRAKE PEDAL BECAME MUSHY AND EXTENDED TO THE FLOOR.  THE VEHICLE VEERED TO THE RIGHT.  THE CONTACT ALLOWED THE VEHICLE TO COOL DOWN.  HE RESTARTED THE VEHICLE AND DROVE TO HIS DESTINATION.  BY THIS TIME, THERE WAS COOLANT LEAKING FROM THE MOTOR AND OIL LEAKING FROM THE BEARINGS.   THE MECHANIC STATED THAT THE WHEEL BEARINGS MAY HAVE BEEN DEFECTIVE.  IT WAS DISCOVERED THAT THE ABS SENSORS WERE WELDED AND THE FRONT PASSENGER SIDE BRAKE WAS DEFECTIVE.  THE MECHANIC REPLACED THE PASSENGER SIDE BRAKE CALIPERS AND ALL OF THE RELATED HOSES.  THE FLUIDS, HUB BEARINGS, AND ABS SENSORS WERE ALSO REPLACED.  THE CONTACT RECEIVED A RECALL NOTICE FOR THE FAILURES AFTER THE VEHICLE WAS REPAIRED.  THE NHTSA CAMPAIGN ID NUMBER WAS UNAVAILABLE.  THE FAILURE MILEAGE WAS 25,000 AND CURRENT MILEAGE WAS 26,300.     UPDATED 06/08/09  *BF  THE CONSUMER STATED THE FIRST TIME THEY STOPPED WAS TO PUT STABIL IN THE GAS TANK FOR THE WINTER. ABOUT 2 MILES  LATER, THEY SMELLED AN ODOR AND STOPPED THE COACH. ABOUT 1 MILE BEFORE REACHING THEIR DESTINATION, THE BRAKES WERE PULLING AND THERE WAS NOT MUCH PEDAL AND THE ABS  LIGHT ILLUMINATED. THE CALIPER, HOSE AND WHEEL SPEED SENSOR WERE REPLACED. UPDATED 06/18/09.*JB",
        "vin": "5B4MP67G433"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/22/2009",
        "dateOfIncident": "04/18/2009",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10266413,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*- THE CONTACT OWNS A 2003 W22 WORKHORSE CHASSIS. WHILE DRIVING THE CHASSIS STARTED TO PULL TO THE RIGHT AND A LOT NOISE WAS HEARD COMING FROM THE BRAKES WHEN APPLY. THE CONTACT MADE AN APPOINTMENT WITH THE DEALERSHIP TO DIAGNOSE THE BRAKES. THE DEALERSHIP STATED THAT THE ABS SYSTEM HAD MALFUNCTIONED DUE TO THE EXTREME HEAT FROM THE BRAKE CALIPERS BEING APPLIED TO THE ROTORS.  THE CONTACT FOUND A RECALL VIA THE INTERNET BUT HIS VEHICLE DID NOT FALL INTO THE RECALL PARAMETERS. THE VEHICLE IS CURRENTLY AT THE DEALERSHIP AWAITING REPAIRS. THE CURRENT MILEAGE WAS 28,392 AND FAILURE MILEAGE 28,382.",
        "vin": "5B4MP67G933"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/06/2009",
        "dateOfIncident": "03/10/2005",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10264237,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 WORKHORSE W22 TRAILER.  WHILE DRIVING 50 MPH, THE CONTACT SMELLED A BURNING ODOR COMING FROM THE FRONT END OF THE VEHICLE.  THE VEHICLE BEGAN TO PULL TO THE RIGHT WHEN THE BRAKES WERE APPLIED.  HE PULLED THE VEHICLE OVER AND NOTICED THAT THE FRONT BRAKES WERE VERY HOT.  THE VEHICLE WAS TAKEN TO THE DEALER AND THEY DETERMINED THAT THE FRONT BRAKE CALIPERS AND SEALS FAILED.  THE VEHICLE WAS REPAIRED.  FOUR YEARS LATER, WHILE DRIVING 50 MPH, THE CONTACT SMELLED A STRONG BURNING ODOR COMING FROM THE REAR OF THE VEHICLE.  HE EXITED THE VEHICLE TO INSPECT THE FAILURE AND NOTICED THAT THE REAR BRAKES WERE VERY HOT.   THE CONTACT IS IN THE PROCESS OF TAKING THE VEHICLE TO THE DEALER FOR INSPECTION AND NOTIFYING THE MANUFACTURER.  THE FAILURE MILEAGE WAS 13,548 AND CURRENT MILEAGE WAS 27,835.   UPDATED 5/7/09 *CN  UPDATED 05/12/09.*JB",
        "vin": "5B4MP67G223"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/25/2009",
        "dateOfIncident": "10/10/2006",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10263059,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 FLEETWOOD PACE ARROW RECREATIONAL VEHICLE ON A 2003 WORKHORSE .  THE CONTACT STATED THAT THE PLASTIC FRONT WHEEL BEARINGS AND THE FRONT DISC BRAKES OVERHEATED.  IN ADDITION, THE DEALER DISCOVERED THAT THE REAR BRAKES ALSO FAILED.  THE VEHICLE HAS NOT YET BEEN REPAIRED.  THE FAILURE MILEAGE WAS 11,119 AND CURRENT MILEAGE IS 12,536.     UPDATED 04-23-09 *BF  THE CONSUMER STATED THE FRONT AXLE PLASTIC OIL CUPS, INNRE AXLE SEALS, ROTORS AND BRAKE PADS WERE DESTROYED BY HEAT. DURING AN VISUAL INSPECTION, IT WAS APPARENT THAT THE REAR BRAKES WERE NOT WORKING DUE TO LACK OF CONTACT BETWEEN THE BRAKE PADS AND ROTORS.  THE RV HAS NOT BEEN REAPIRED DUEE TO AN ONGOING INVESTIGATION BY THE CONSUMER.  UPATED 05/01/09. *JB",
        "vin": "5B4MP67G543"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/28/2009",
        "dateOfIncident": "02/02/2009",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10260291,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ABS LIGHT CAME ON AND I WENT TO HAVE THE VEHICLE SERVICED. THE SERVICE TECH SHOWED ME THE ROTORS AND CALIPERS. THEY WERE BADLY CRACKED AND OVERHEATED. COST $4700 TO REPAIR. WOULD NOT WARRANTY THEM BECAUSE THE COMPUTER CODE SAID I WAS RIDING THE BRAKES. \"FALSE\". THEY INSTALLED A ZERK FITTING ON THE SHAFT TO THE BELL CRANK WITHOUT DOCUMENTING IT. *TR",
        "vin": "5B4MP67G033"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/13/2009",
        "dateOfIncident": "02/12/2009",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10258581,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 WORKHORSE CHASSIS W22.  WHILE DRIVING APPROXIMATELY 25 MPH, THE BRAKE PEDAL EXTENDED TO THE FLOOR WHEN THE BRAKE PEDAL WAS DEPRESSED.  THE RISK OF A CRASH WAS INCREASED.  THE CONTACT IS IN THE PROCESS OF HAVING THE VEHICLE INSPECTED TO DETERMINE THE CAUSE OF THE FAILURE.  HE FILED A COMPLAINT WITH THE MANUFACTURER.  THE FAILURE AND CURRENT MILEAGES WERE NOT APPLICABLE.",
        "vin": "5B4MP67G133"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/21/2009",
        "dateOfIncident": "01/21/2009",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10255879,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKES ON MY 2003 WORKHORSE CHASSIS OVERHEAT. THEY ALSO SHUDDER WHEN GOING DOWN A HILL WHILE BRAKING. *TR",
        "vin": "5B4MP67G533"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/12/2009",
        "dateOfIncident": "07/10/2006",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10254719,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE FAILURE. *TR",
        "vin": "5B4MP67G433"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/07/2009",
        "dateOfIncident": "11/07/2005",
        "fire": true,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10254096,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 WORKHORSE W22.  WHILE SPORADICALLY DEPRESSING THE BRAKE PEDAL, THE VEHICLE FAILED TO STOP.  UPON FURTHER INSPECTION, THE CONTACT NOTICED THAT THE BRAKE FLUID WAS BUBBLING DUE TO EXCESSIVE HEAT EXPOSURE.  HE TOOK THE VEHICLE TO THE DEALER BECAUSE THREE OF THE ABS WHEEL SENSORS BURNED OFF AND TWO OF THE ABS SEALS FAILED.  THE TECHNICIAN REPLACED THE BRAKE CALIPERS AND THE SEALS AT MORE THAN $1,000.  THE MANUFACTURER WOULD NOT ASSIST BECAUSE THERE WAS NO RECALL.  THE FAILURE AND CURRENT MILEAGES WERE NOT APPLICABLE.     UPDATED 03/27/09  *BF  THE CONSUMER STATED ON 2 SEPARATE OCCASIONS, HE HAD TO PULL OVER AND WAIT FOR THE BRAKES TO COOL OFF. THE THIRD TIME, THE BRAKES SEIZED. THE CALIPER WAS REPLACED. UPDATED 04/01/09. *JB",
        "vin": "5B4MP67G933"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/06/2008",
        "dateOfIncident": "12/04/2008",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10250954,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 12/4/08 AS WE WERE TRAVELING IN OUR 2003 ALLEGRO BAY MOTORHOME IN STOP AND GO TRAFFIC NEAR MOBILE, AL WE ONCE AGAIN FOR NO APPARENT REASON, STARTED TO SMELL BRAKES BURNING.  WITH 26,482 MILES ON OUR COACH, THIS IS OUR THIRD BRAKE FAILURE EVENT IN LESS THAN FOUR MONTHS.  I PULLED OVER AS SOON AS POSSIBLE AND CHECKED THE TEMPERATURE OF ALL BRAKE ASSEMBLIES WITH MY INFRARED THERMOMETER WHICH I NOW KEEP AVAILABLE.  THE BRAKE CALIPER ON THE FRONT DRIVER'S SIDE MEASURED APPROX. 450 DEGREES.  I ALLOWED THE BRAKES TO COOL, THEN PROCEEDED TO THE NEAREST WORKHORSE REPAIR FACILITY (APPROX. 12 MILES).   THEY REPLACED BOTH FRONT CALIPERS, BRAKE LINES, PADS AND FLUID.  AT MY REQUEST, THEY ALSO CHECKED AND LUBRICATED THE REAR CALIPERS FOR A TOTAL COST OF $1,005.80.  THE REPAIR FACILITY KEPT THE OLD PARTS. *TR",
        "vin": "5B4MP67G933"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/22/2008",
        "dateOfIncident": "08/18/2008",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10239389,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING IN OUR RV FOR NO APPARENTLY REASON, WE SUDDENLY BEGAN TO SMELL BURNING BRAKES, THEN THE STEERING BEGAN TO SHIMMY AND VIBRATE.  WHEN THE BRAKE WAS APPLIED THE VIBRATION INCREASED.  I IMMEDIATELY PULLED OFF AT A SAFE AREA, UNHOOKED MY TOW VEHICLE AND WENT FOR ASSISTANCE.  ALL FOUR ROTORS AND BRAKE PADS WERE REPLACED AT A COST OF $2209.89.  THIS IS THE FIRST TIME WE HAVE EXPERIENCED ANY PROBLEMS WITH OUR BRAKES AND IT HAPPENED SUDDENLY WITH NO WARNING.  THE OLD PARTS WERE SENT BACK AS \"CORE\" PARTS BY THE REPAIR FACILITY.  WE ARE NOW AWARE OF NHTSA EA07-016 INVOLVING BOSCH BRAKE CALIPERS OVERHEATING, CAUSING THE ROTORS TO GO BAD AND BELIEVE OUR WORKHORSE CHASIS WHICH DOES HAVE THIS BRAND OF CALIPERS HAS EXPERIENCED THE SAME PROBLEM AS WAS DESCRIBED IN THIS BULLETIN.  UPON COMPLETION OF THIS REPAIR, WE PROCEEDED ON OUR TRIP.  ABOUT 75 MILES FARTHER, WE AGAIN SMELLED BRAKES BURNING.  WE PULLED OFF THE ROAD AS FAST AS WE COULD AND CALLED OUR ROADSERVICE.  THE PASSENGER SIDE FRONT BRAKE WAS SMOKING.  THEY SENT OUT A MOBILE REPAIR TECH WHO REMOVED THE TIRE/WHEEL, REMOVED THE CALIPER AND LUBRICATED THE CALIPER SLIDE.  THE CALIPER SEEMED TO BE WORKING NORMALLY, HOWEVER, WE ARE AT A LOSS AS TO WHAT ACTUALLY CAUSED OUR PROBLEM AND ARE CONCERNED THAT THE CAUSE HAS NOT BEEN ADDRESSED AND IT WILL REOCCUR.  *TR",
        "vin": "5B4MP67G933"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/13/2008",
        "dateOfIncident": "08/17/2004",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10238092,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES LOCKING UP AND BURNING THE ROTORS ON A 2003 W22 MOTORHOME CHASSIS.  *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/06/2008",
        "dateOfIncident": "05/27/2008",
        "fire": true,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10237192,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 WORKHORSE CHASSIS W22.  WHILE DRIVING APPROXIMATELY 35 MPH, THE FRONT BRAKES LOCKED AND THE BRAKE PEDAL EXTENDED COMPLETELY TO THE FLOOR.  AS A RESULT, THE BRAKE UNIT BEGAN OVERHEATING AND THE VEHICLE BEGAN TO SMOKE.  THE CONTACT TOOK THE VEHICLE TO THE DEALER, BUT THEY COULD NOT IDENTIFY A SOLUTION OR PROVIDE A REMEDY.  AS OF AUGUST 6, 2008, THE VEHICLE HAS NOT BEEN PROPERLY REPAIRED.  THE FAILURE MILEAGE WAS 16,000 AND CURRENT MILEAGE WAS 24,130.",
        "vin": "5B4MP67GX33"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/23/2008",
        "dateOfIncident": "05/29/2008",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10232047,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES FAILED COMPLETELY ON MY 2003 SOUTHWIND MOTORHOME  (WORKHORSE CHASSIS)  WITH ONLY 10.000 MILES.  *TR",
        "vin": "5B4MP67G223"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/10/2008",
        "dateOfIncident": "11/10/2007",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10230426,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FIRST INCIDENT WE WERE ON OUR WAY TO FLORIDA.  I WAS DRIVING THE VEHICLE DOWN A STEEP GRADE IN TENNESSEE.  I APPLIED THE BRAKES HARDER THAN USUAL AND FELT A RUMBLE IN THE VEHICLE.  WHEN I WAS ABLE TO PULL OFF THE HIGHWAY SAFELY, THE RUMBLE WAS GONE.  I PROCEEDED TO FLORIDA AND PARKED MY RV FOR 2 WEEKS AND THEN MOVED TO ANOTHER RV PARK FOR THE MONTH OF DECEMBER WITHOUT INCIDENT.  ON JANUARY 1, 2008 I MOVED THE RV TO ANOTHER RV PARK ABOUT 35 MILES AWAY.  WHILE I WAS DRIVING I HAD TO APPLY THE BRAKES HARDER THAN USUAL BECAUSE OF A SIGNAL LIGHT CHANGE.  SHORTLY AFTER THAT I SMELLED A HOT SMELL AND FELT THE RUMBLE IN THE BRAKES WHILE BRAKING, AS IN THE FIRST INCIDENT.  I PULLED OFF THE ROAD AT A SERVICE STATION TO ASSESS THE PROBLEM AND MY REAR BRAKE WAS SMOKING.  AFTER EXAMINING THE BRAKE AREA I DISCOVERED THAT THE BRAKE WAS STUCK IN THE ON POSITION.  BY THIS TIME I WAS ONLY ABOUT A MILE FROM THE RV PARK SO I FREED UP THE BRAKES AND LET THEM COOL BEFORE PROCEEDING.  THE SERVICE PERSON THAT REPAIRED MY BRAKES STATED THAT THE CALIPERS WERE RUSTED TO THE POINT THAT THEY STUCK WHEN APPLIED HARD.  WHILE AT THE RV PARK, ANOTHER RV PULLED IN WITH THE SAME PROBLEM.  HE ALSO HAD THE SAME CHASSIS AS I HAVE.  SO AFTER RETURNING HOME FOR THE SUMMER I WENT ON TO THE RV.NET SITE AND READ THEIR FORUM REGARDING BRAKE ISSUES AND WAS ASTOUNDED AS TO THE NUMBER OF OWNERS THAT HAD THE SAME ISSUE AS I HAD.  I HAVE OWNED MANY RV'S IN MY DAY AND HAVE NEVER EXPERIENCED THIS KIND OF ISSUE.  I BELIEVE THAT THERE IS A SAFETY ISSUE REGARDING THE MANUFACTURER.  *TR",
        "vin": "5B4MP67G233"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/04/2008",
        "dateOfIncident": "12/31/2007",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10229929,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 WORKHORSE CHASSIS W22.  WHILE DRIVING APPROXIMATELY 10 MPH, THE ABS WARNING LIGHT ILLUMINATED ON THE INSTRUMENT CONTROL PANEL AND THE CRUISE CONTROL FAILED.  THE CONTACT NOTICED THAT THE CALIPERS IN THE BRAKE SYSTEM OVERHEATED.  THE DEALER STATED THAT HIS VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN ID NUMBER 04V084000 (SERVICE BRAKES, HYDRAULIC).  THE CONTACT WOULD HAVE TO PAY $3,000 TO REPAIR THE VEHICLE.  THE MANUFACTURER WOULD NOT PROVIDE ASSISTANCE BECAUSE HIS YEAR WAS EXCLUDED FROM THE RECALL.  THE FAILURE MILEAGE WAS 20,000 AND CURRENT MILEAGE WAS 23,000.  THE PROBLEM WOULD ALSO LEAD TO WHEEL LOCK-UP UPDATED 06/25/08",
        "vin": "5B4MP67GX33"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/22/2008",
        "dateOfIncident": "05/09/2008",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10228698,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD CALIPERS AND PADS REPLACED ONCE BEFORE. AND NOW MY BRAKES ARE SURGING REALLY BAD.  *TR",
        "vin": "5B4MP67G423"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/06/2008",
        "dateOfIncident": "04/10/2008",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10226793,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 W22 WORKHORSE CHASSIS  BRAKE FAILURE ABS SYSTEM DAMAGED DUE TO OVER HEATING OF ROTORS ON ALL FOUR WHEELS.  *TR",
        "vin": "5B4MP67G933"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/23/2008",
        "dateOfIncident": "03/03/2008",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10225459,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT BRAKES HAVE LOCKED UP TWICE ON THIS WORKHORSE W22 CHASSIS.  THE FIRST TIME THEY WERE PATCHED UNDER WARRANTY.  HOWEVER, THE CALIPERS WERE NOT REPLACED AND THEY FAILED AGAIN ONE YEAR LATER.  WORKHORSE REFUSED TO PAY FOR THE REPAIR EVEN THOUGH THEY KNOW FROM THEIR PAST EXPERIENCE THAT ALL THE CALIPERS THEY USED OVER A PERIOD OF YEARS ARE BAD.  THIS IS A SAFETY HAZARD AND HAD I NOT RECOGNIZED THE PROBLEM AND STOPPED THERE COULD HAVE BEEN A MAJOR FIRE IN THE MOTORHOME IN WHICH MY WIFE AND I WERE RIDING.  THEIR FAILURE TO EVEN ACKNOWLEDGE THE PROBLEM, EVEN THOUGH THERE IS A CURRENT NHTSA INVESTIGATION, SEEMS ALMOST CRIMINAL.  IS SOMEONE GOING TO HAVE TO DIE BEFORE THEY ARE FORCED TO PAY FOR THEIR MISTAKES.    EARLIER IN THE LIFE OF THIS RV THE REAR BRAKES LOCKED UP AND THE PADS DID INDEED CATCH ON FIRE BUT I WAS ABLE TO STOP AND EXTINGUISH THEM BEFORE THE VEHICLE WAS BURNED.    I WOULD LIKE FOR WORKHORSE TO ACKNOWLEDGE THEIR PROBLEM AND REPAY ME THE $1,177.37 THAT I HAD TO PAY TO FIX THEIR PROBLEM.  *TR",
        "vin": "5B4MP67G833"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/02/2008",
        "dateOfIncident": "09/27/2003",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10223172,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 WORKHORSE W22.  THE CONTACT STATED THAT WHEN HE APPLIED THE BRAKES, THEY WOULD DRAG AFTER BEING RELEASED.  THE FAILURE OCCURRED WHILE DRIVING 15 MPH.  HE ALSO STATED THAT THE BRAKES WOULD SQUEAK AND GRIND AND BECAME WORN DUE TO RELEASING IMPROPERLY.  WORKHORSE CONFIRMED THAT THE VIN WAS INCLUDED IN NHTSA CAMPAIGN ID NUMBER 04V084000 (SERVICE BRAKES, HYDRAULIC); HOWEVER, THEY WOULD NOT REPAIR THE VEHICLE.  THE PURCHASE DATE, ENGINE SIZE, AND NUMBER OF CYLINDERS WERE UNKNOWN.  THE CURRENT MILEAGE WAS 30,000 AND FAILURE MILEAGE WAS 3,000.",
        "vin": "5B4LP57G823"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/27/2008",
        "dateOfIncident": "11/09/2005",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10222484,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "RAPID (EXCESSIVE) BRAKE PAD WEAR BY 32,000 MILES AND MOSTLY INTERSTATE DRIVING. EVIDENCE OF DRAGGING CALIPER AS SEEN BY THE UNEVEN OUTER PAD WEAR ON ALL FOUR WHEELS. OVERHEATING AND SURFACE CRACKING ON ROTORS. TOO FREQUENT ABS SENSOR REPLACEMENT.    INSPECTION AT AUTHORIZED WORKHORSE SERVICE CENTER DISCOVERED ROTORS SEVERELY CRACKED THROUGH.    GIVEN TYPE OF DRIVING AND LEVEL OF MOTOR HOME OWNER EXPERIENCE, BRAKE PARTS SHOULD BE EXPECTED TO WEAR EVENLY AND LAST CONSIDERABLY LONGER THEN MILEAGE POSTED ABOVE. GIVEN NUMBER OF INTERNET BASED SIMILAR COMPLAINTS, I BELIEVE ROOT CAUSE OF MALFUNCTION OF BRAKE SYSTEM WAS NOT IDENTIFIED AND ADDRESSED. CALIPERS SHOULD HAVE BEEN REPLACED AND WEREN'T.  LOW MILEAGE OR LACK OF USAGE CANNOT BE ARGUED IN THIS CASE ,  AS WORKHORSE CONTENDS IS A MAJOR FACTOR.  *TR",
        "vin": "5B4MP67G733"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/25/2008",
        "dateOfIncident": "01/14/2008",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10219071,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAD BRAKE FAILURE 3 TIMES IN 36K MILES. ADDITIONALLY, AXLE SEALS HAVE BEEN REPLACED 3 TIMES DUE TO EXCESSIVE HEAT FROM BRAKES. BRAKES AND SEALS HAVE ALL BEEN REPLACED 3 TIMES. SPOKE TO WORKHORSE NUMEROUS TIMES, WAS TOLD THERE IS NO MAINTENANCE TO DO ON BRAKES, JUST HAVE THEM INSPECTED TWICE A YEAR, AND HAVE THEM REPLACED IF STICKING, EVEN IF IT IS EVERY 10K MILES @ $2,000 PER REPAIR.  *TR",
        "vin": "5B4MP67G923"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/07/2008",
        "dateOfIncident": "06/03/2005",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10217319,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "RE: NHTSA ACTION NUMBER : EA07016 : ---  WORKHORSE CUSTOM CHASSIS RECALL NUMBER 50401-C, NHTSA RECALL NOL 04V-084 FOR THE BOSCH ZOPS BRAKE PROBLEM WAS COMPLETED TO MY 2003 HOLIDAY RAMBLER VACATIONER, MODEL  36DBD MOTORHOME. -     WHILE VACATIONING AND  WITH JUST 2000 MILES +/- LATER MY RIGHT REAR BRAKES CALIPER LOCKED-UP, THE SMELL OF SMOKE CAME IN THE MOTORHOME AND  THEN WHEN I WENT TO APPLY THE BRAKES, THEY WENT ALL THE WAY TO THE FLOOR. GOOD THING I WAS ABLE  TO PULLED OVER ONTO THE SIDE OF THE HWY TO AVOID HAVING AN ACCIDENT. AFTER A WHILE WHEN THEY COOLED DOWN, I PUMPED THE BRAKES AND THEY SEEM TO BE WORKING OK. I WAS  ABLE TO SLOWLY PROCEED TO MY CAMPGROUND.  TOOK THE MOTORHOME TO AN AUTHORIZE WORKHORSE DEALER AND THEY REPLACE THE CALIPER ,PADS, SENSOR AND ROTOR. WORKHORSE DID COVERED THE EXPENSES FOR THIS REPAIRS.   AT 11,000 MILES +/- LATER AFTER THE RECALL WORK WAS COMPLETED, THE RIGHT FRONT WHEEL SPEED SENSOR WENT BAD AND HAD TO BE REPLACED.   NOW 18,000 MILES +/- LATER AFTER THE RECALL WAS COMPLETED, THE LEFT REAR BOSCH CALIPER  HUNG-UP, OVERHEATED AND I HAD TO HAVE THE CALIPER, PADS, SENSOR AND ROTOR REPLACED. I THEN CONTACTED WORKHORSE CUSTOM CHASIS ABOUT REIMBURSING THE EXPENSES I INCURRED AND THEY DECLINED. -   I'M VERY AFRAID THAT THE REMINDER OF THE ORIGINAL BOSCH CALIPERS COULD LOCK-UP, FAIL  AND CAUSE ME TO HAVE AN ACCIDENT.  ALL REPAIR WORK WAS DONE AT AN AUTHORIZE WORKHORSE CUSTOM CHASSIS SHOP.  -  PER THE VIN RECORDS THE LEFT WHEEL SPEED SENSOR WAS CHANGED OUT AT 42 MILES ON MOTORHOME--  PURCHASED MOTORHOME FROM PRIVATE OWNER  -  MILEAGE AT TIME OF  PURCHASED: 13,700  -  MOTORHOME MFG DATE: 8/02  -  WORKHORSE CUSTOM CHASSIS MFG. DATE 6/02.  *TR",
        "vin": "5B4MP67G423"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/11/2008",
        "dateOfIncident": "10/05/2007",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10215027,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 MONACO LAPALMA WITH 2003 WORKHORSE W22 CHASSIS. WITH DEFECTIVE FRONT ROTORS. CONSUMER STATES THAT THE RV BEGAN TO EXPERIENCE A VIBRATION. THE CONSUMER WAS INFORMED IT WAS BECAUSE THE ROTORS HAD EXCESSIVE HEAT WHICH CAUSED THEM TO CRACK.  *KB     UPDATED 03/16/10   *BF  THE CONSUMER STATED THE HE EXPERIENCED WHAT WAS DESCRIBED IN THE RECALL THAT WAS ISSUED. *JB  UPDATED 03/26/10.*JB  WORKHORSE INFORMED THE CONSUMER HIS WARRANTY HAD EXPIRED PRIOR TO THE REPAIR FOR WHICH THE CONSUMER IS SEEKING REIMBURSEMENT. WORKHORSE FURTHER STATED THE RV WAS BUILT SEPTEMBER 3, 2002 WHICH MEANT HIS CHASSIS WAS NOT INCLUDED IN THE RECALL.  UPDATED 04/20/10  THE CONSUMER ALSO STATED THE ABS SENSORS HAD TO BE REPLACED. UPDATED 07/28/10*JB",
        "vin": "5B4MP67G833"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/30/2007",
        "dateOfIncident": "09/15/2007",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10204502,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE THE SAME PROBLEM WITH MY 2003 WORKHORSE CUSTOM CHASSIS MOTORHOME AS INFORMATION IN  NHTSA ACTION NUMBER PE07032.  *TR",
        "vin": "5B4MP67G333"
    },
    {
        "components": "STEERING,SERVICE BRAKES, HYDRAULIC,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "09/27/2007",
        "dateOfIncident": "08/01/2007",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10204241,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Brake Parts Inc.",
                "productMake": "BRAKE PARTS",
                "productModel": "DISC BRAKE ROTOR",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "I HAVE A WORKHORSE CHASSIS WITH A BRAKE PROBLEM.  SOUNDS LIKE ACTION # PEO732. I NOTICED DURING A TRIP TO FLORIDA IN APRIL THAT THE BRAKES SMELLED HOT AT THE REAR OF MOTORHOME DURING REFUELING.  DURING MY TRIP TO SALT LAKE CITY AUGUST 1ST, 2007.  MY BRAKE PEDAL WOULD GO TO THE FLOOR AND NOT COME BACK UP OR RELEASE THE BRAKES,  I USED MY TOES TO BRING PEDAL BACK UP. IN UTAH I HAD A DIAGNOSTIC CENTER LOOK AT THE PROBLEM, THEY DETERMINED IT TO BE A BAD BOOSTER PUMP.  THEY REPLACED THE PUMP AND PEDAL WOULD COME BACK UP AND RELEASE THE BRAKES, BUT STILL HAD A SOFT PEDAL. WHEN I GOT HOME (ARLINGTON TEXAS)  BRAKES WERE NOT RELEASING PROPERLY.  I CALLED WORKHORSE AND THEY TOLD ME WHERE TO TAKE THE MOTOR HOME FOR SERVICE. MOTOR HOME HAS BEEN IN THE SHOP FOR OVER 30 DAYS, THEY HAVE REPLACED THE POWER STEERING GEAR BOX, AND THE BOOSTER PUMP AGAIN.  THEY TOLD ME THE MOTOR HOME WAS READY,  NOTHING UNDER WARRANTY, I PAID THEM $4,558.85. WHEN I GOT IN THE MOTOR HOME THE BRAKE PEDAL WENT TO THE FLOOR, ALSO WOULD NOT START, WHICH WAS PROBABLY THE PEDAL NOT COMMING BACK UP AND LEAVING THE BRAKE LIGHTS ON.  TECHNICIANS ARE BLEEDING THE BRAKES AND CHECKING IT OUT AGAIN.  SEEMS WORKHORSE IS NO HELP IN RESOLVING THE PROBLEM.  I AM NOW OUT THE $4,558.85 AT SOUTHWESET INTERNATIONAL TRUCKS HERE IN ARLINGTON TEXAS PLUS $1,089.25 FOR WORK ON BRAKES IN UTAH. AND I STILL DON'T HAVE A DRIVABLE MOTOR HOME.  *TR",
        "vin": "5B4KP57G633"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/20/2007",
        "dateOfIncident": "06/28/2007",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10203588,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ABS, HYDRAULIC, CALIPER, ROTOR AND ALL BRAKE COMPONENTS. *TR",
        "vin": "5B4MP67G633"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/18/2007",
        "dateOfIncident": "09/13/2007",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10203394,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT BRAKE FAILURE ON W22 RV CHASSIS, HAVE BEEN INFORMED THAT ALL 4 BRAKES NEED TO BE REPLACED AT 32,000 MILES.  *TR",
        "vin": "5B4MP67G933"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/16/2007",
        "dateOfIncident": "07/06/2007",
        "fire": true,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10203128,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "RIGHT FRONT BRAKE CALIPER LOCKED UP IN HEAVY TRAFFIC. HAD FIRE, WAS ABLE TO EXTINGUISH WITH ONBOARD EXTINGUISHER. MOTOR HOME WAS TOWED AND TAKED TO A WORKHORSE SERVICE CENTER. GEORGIA COMMERCIAL VEHICLES IN MARIETTA, GA. THEY REPLACED ONE CALIPER, ONE CRACKED  ROTOR, RIGHT FRONT TURNED ROTOR ON LEFT FRONT. REPLACED BRAKE PADS FRONT AND REAR.  TOTAL COST $937.51  CONTINUED ON OR TRIP BUT NOTICED ON GOING PROBLEMS WITH BRAKES BUT NO LOCKUP. UPON RETURN TO LEESBURG, FL. TOOK MH. TO NICHOLS DIESEL IN EUSTIS, FL . ANOTHER WORKHORSE SERVICE CENTER. THEY THE HAD TO REPLACE BOTH FRONT CALIPERS, TURNED THE NEW ROTOR ON THE RIGHT FRONT, RREPLACED THEROTOR ON LEFT FRONT, CRACKED. REPLACED BRAKE PADS ON FRONT.COST $1278.99. SENT LETTERS TO WORKHORSE BUT NO RESPONSE.  CALLED WORKHORSE AND WAS TOLD THAT THE MOTORHOME WAS OUT OF WARRANTY AND NOT SUBJECT TO A RECALL EVER THOUGH IT HAD ONLY  28,554 MILES OF USE. THEY THIS WAS NORMAL. AFTER LOOKING ON THE INTERNET I DON'T THINK SO.  WE WERE LUCKY THAT.  *TR",
        "vin": "5B4MP67G933"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/10/2007",
        "dateOfIncident": "08/03/2007",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10202366,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ALL BRAKE CALIPERS WERE LUBED/INSPECTED ACCORDING TO MFR'S SPEC AT 26,174 MILES. ONE MONTH LATER, AT 26780 MILES, THE LF CALIPER WAS FOUND TO BE DRAGGING, CAUSING OVERHEATED BRAKE, & REQUIRED THE MOTORHOME TO BE TOWED. THE LF CALIPER PINS/BOOTS WERE REPLACED & ALL CALIPER PINS RE-LUBED/INSPECTED. APPROX ONE MONTH LATER AT 27610 MILES, THE RF CALIPER WAS DRAGGING, CAUSING OVERHEATING & STEERING PULLING RIGHT.  AT THAT POINT I DIRECTED THAT THE LEFT & RIGHT FRONT CALIPERS BE REPLACED, AT CONSIDERABLE EXPENSE, BUT A NECESSARY SAFETY ITEM. MOTORHOME VEHICLE IS 2003 WINNEBAGO ADVENTURER 38G ON A 2003 WORKHORSE W-22 CHASSIS.  ALL WEIGHTS ARE WITHIN SPECS (NOT OVERLOADED).  *JB  *UPDATED 12/12/2007  *BF  UPDATED 12/12/07  *TR",
        "vin": "5B4MP67G933"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/21/2007",
        "dateOfIncident": "06/13/2007",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10200403,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE PEDAL FELL TO FLOOR WHEN ATTEMPTING A STOP WITHOUT ANY WARNING.  ABS OR BRAKE LIGHT NEVER CAME ON.  CARRIED TO SHOP AND FOUND REAR BRAKES HAD FAILED TO RELEASE, HEATING CALIPERS, PADS AND SENSORS. ALL HAD TO BE REPLACED.  WORKHORSE REFUSED TO REFUND  PAYMENT EVEN THOUGH HISTORY OF THESE VEHICLES PROVE THERE IS   A MANUFACTURER DEFECT RELATING TO THE CALIPERS.  THIS IS A DEFINITE SAFETY PROBLEM. UPON NOTIFICATION TO WORKHORSE THEY DID NOT EVEN ACKNOWLEDGE THE SAFETY HAZARD WITH THE NUMBER OF THIS SPECIFIC VEHICLE STILL IN SERVICE, IT IS ONLY A MATTER OF TIME BEFORE  A SERIOUS ACCIDENT OCCURS. JH   *TR  THE CONSUMER STATED A RECALL WAS PERFORMED ON VEHICLES MADE IN 2001-2003 BUT THE CONSUMER'S VIN WAS NOT INCLUDED IN THE RECALL. THE CONSUMER STATED WANTED TO BE REIMBURSED FOR REPAIRS.  UPDATED 09/11/07  *TR",
        "vin": "5B4MP67G833"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/10/2007",
        "dateOfIncident": "07/17/2007",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10199094,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL CORNER ? JANUARY 2005  WORKHORSE CUSTOM CHASSIS HAS ANNOUNCED NHTSA RECALL 04V084000, WHICH AFFECTS CERTAIN WORKHORSE W SERIES GASOLINE-POWERED CHASSIS MADE BETWEEN AUGUST 10, 2000, AND JULY 29, 2002. THE POTENTIAL NUMBER OF CHASSIS AFFECTED IS 10,235. THESE CHASSIS WERE USED BY SEVERAL MOTORHOME MANUFACTURING COMPANIES. TO DETERMINE WHETHER YOUR COACH IS INCLUDED IN THIS RECALL, CHECK THE FOLLOWING VEHICLE IDENTIFICATION NUMBERS (VIN). ONLY THE LAST EIGHT DIGITS OF THE FULL 17-DIGIT VIN ARE GIVEN. ALL CHASSIS INVOLVED HAVE VINS THAT BEGIN WITH 5B4.    CHASSIS MODEL YEAR 2001 ? 13325068 TO 13337849  CHASSIS MODEL YEAR 2002 ? 23336034 TO 23356051  CHASSIS MODEL YEAR 2003 ? 33354476 TO 33356806    ON SOME W20 AND W22 MOTORHOME CHASSIS BUILT BY WORKHORSE AND EQUIPPED WITH BOSCH ZERO OFFSET PIN SLIDE (ZOPS) BRAKE CALIPERS, THE CALIPER CAN HANG IN THE PARTIAL APPLY POSITION AND CAUSE THE BRAKE PADS TO DRAG ON THE ROTOR SURFACE. OVERHEATING MAY OCCUR, CAUSING DAMAGE TO THE BRAKE COMPONENTS AND AFFECTING BRAKING PERFORMANCE. THE PROBLEM ALSO COULD CAUSE THE BRAKE SYSTEM'S ANTI-LOCK FEATURES TO BE LOST IF THE HEAT DAMAGES THE ANTI-LOCK WHEEL SENSOR.  *JB",
        "vin": "5B4MP67G933"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/06/2005",
        "dateOfIncident": "08/09/2005",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10130438,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  WHEN PUSHING ON THE BRAKES THEY WENT  TO THE FLOORBOARD.  THE VEHICLE HAD NOT BEEN TAKEN TO THE DEALERSHIP YET.  THE MANUFACTURER STATED IT COULD BE TAKEN TO  DEALERSHIP ON AUGUST 14, 2005.   THE CONSUMER  LOOKED AT THE VEHICLE AND  FOUND FLUID LEAKING  FROM UNDER THE TIRES.  HE WAS NOT SURE WHAT KIND OF FLUID IT WAS.  THIS HAPPENED ONCE ON JULY 26, 2005 AND IT HAPPENED AGAIN ON JULY 27, 2005.  CONSUMER  PULLED OVER AND PARKED THE VEHICLE.  *AK  THE ABS LIGHT ILLUMINATED AND THE VEHICLE WAS TAKEN TO THE AUTHORIZED REPAIR FACILITY AND THE BRAKES WERE REPAIRED.  THE DEALER EXPLAINED THAT THE CALIPER SLIDE PIN HAD SEIZED CAUSING THE ROTORS TO HEAT UP.  TEN MINUTES AFTER THE REPAIRS WERE MADE THE ABS LIGHT ILLUMINATED AGAIN.  *NM",
        "vin": "5B4MP67G033"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "08/04/2005",
        "dateOfIncident": "07/19/2005",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131587,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE PEDAL WENT TO FLOOR WHEN A SHORT OCCURRED IN THE ABS SYSTEM. THE BRAKES DIDN'T FUNCTION AT ALL UNTIL I PUMPED THEM A SECOND TIME. THE HAPPEN THREE TIMES BEFORE I COULD GET OFF THE HIGHWAY TO SAFE PLACE. *JB",
        "vin": "5B4MP67G433"
    }
]