[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/11/2009",
        "dateOfIncident": "04/23/2008",
        "fire": false,
        "manufacturer": "4-Star Trailers, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10283652,
        "products": [
            {
                "manufacturer": "4-Star Trailers, Inc.",
                "productMake": "4-STAR TRAILERS",
                "productModel": "HORSE TRAILER",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNIROYAL TIRE CO.",
                "productMake": "UNIROYAL",
                "productModel": "LAREDO",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "BLOW OUT OF UNIROYAL LT235 85R16 TIRES ON HORSE TRAILER WITH NO SIGNS OF WEAR. SECOND BLOW OUT WAS THIS YEAR. I FEEL THERE IS A PROBLEM WITH THIS TIRE AS THIS IS A COMMON PROBLEM. TIRES WERE INFLATED PROPERLY. REPLACED ALL 4 TIRES WITH A DIFFERENT BRAND. *TR",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/07/2008",
        "dateOfIncident": "05/17/2008",
        "fire": false,
        "manufacturer": "4-Star Trailers, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10237354,
        "products": [
            {
                "manufacturer": "4-Star Trailers, Inc.",
                "productMake": "4-STAR TRAILERS",
                "productModel": "HORSE TRAILER",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "B.F. GOODRICH TIRE CO.",
                "productMake": "B.F.GOODRICH",
                "productModel": "LT23585R1610",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "NEW TIRES PURCHASED ON OCTOBER 5, 2007 COMPLETELY FAILED LESS THAN 7 MONTHS LATER IN MAY 2008. YOUR SYSTEM DOES NOT HAVE THE OPTION OF SELECTING THE CORRECT TIRE MANUFACTURER SO I ENTERED THE INFORMATION AS CLOSE TO THE CORRECT DATA AS POSSIBLE. PARKHOUSE TIRE, INC. PURCHASED THE TIRES AND I DO NOT KNOW THE MFG. *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/26/2007",
        "dateOfIncident": "12/20/2005",
        "fire": false,
        "manufacturer": "4-Star Trailers, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10183491,
        "products": [
            {
                "manufacturer": "4-Star Trailers, Inc.",
                "productMake": "4-STAR TRAILERS",
                "productModel": "HORSE TRAILER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*- THE CONTACT  TOOK HIS 2004 KIEFER BUILT HORSE TRAILER TO DEALER TO GET A TIRE REPLACEMENT  AND WAS INFORMED THAT THERE WAS SOMETHING WRONG WITH THE AXLE.  AFTER THE TIRE WAS REPLACED HE TOOK THE VEHICLE TO GRAND CHAMPION AND THEY INFORMED HIM THAT THE TIRE NEEDED BALANCING.  GRAND CHAMPION  TOLD THE CONTACT THAT THE TIRE WAS BALANCED WHEN THE TIRE COMPANY REPLACED THE TIRE.  THE CONTACT  TOOK THE VEHICLE IN ABOUT 4-6 MONTHS LATER AND WAS INFORMED THAT THE SAME TIRE WAS WEARING AGAIN.  HE THEN TOOK THE VEHICLE BACK TO GRAND CHAMPION , AND WAS INFORMED THAT THERE WAS NOTHING WRONG WITH THE VEHICLE.  THE CONTACT INFORMED GRAND CHAMPION THAT THE TIRE COMPANY TOLD HIM THAT THERE WAS A PROBLEM WITH  THE AXLE, WHICH WAS THE CAUSE OF THE TIRE WEARING OUT SO FAST.  THE CONTACT STATED THAT 4 MONTHS LATER WHILE DRIVING HE CAME TO A STOP AND GOT OUT OF THE VEHICLE AND SAW SMOKE COMING FROM THE WHEEL.  HE PULLED OVER TO A PARKING LOT AND THE WHEEL CAME OFF THE VEHICLE.  HE CONTACTED GRAND CHAMPION ,AND WAS VERY UPSET.  HE STATED THAT HE HAD HORSES ON THIS VEHICLE AND THERE COULD HAVE BEEN A CRASH IF HE HADN'T NOTICED THE SMOKE FROM THE BACK OF THE VEHICLE.  GRAND CHAMPION INFORMED THE CONTACT THAT HE NEEDED TO GET THE VEHICLE BACK TO THEM.  THE CONTACT DID GET THE VEHICLE BACK TO THE DEALERSHIP, AND THEY HAD THE TRAILER FOR 3-4 WEEKS AND INFORMED THE CONTACT THAT THEY REPLACED THE AXLE ON THE VEHICLE BUT THEY DID NOT REPLACED THE FENDER. *AK",
        "vin": "1DVGH18294S"
    }
]