[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/08/2007",
        "dateOfIncident": "07/04/2007",
        "fire": false,
        "manufacturer": "American IronHorse Motorcycle Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10198825,
        "products": [
            {
                "manufacturer": "American IronHorse Motorcycle Company",
                "productMake": "AMERICAN IRONHORSE",
                "productModel": "TEXAS CHOPPER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "GREETINGS,    MY SPEEDO/TACH ALL-IN-ONE UNIT ON MY 2004 AMERICAN IRONHORSE TEXAS CHOPPER MOTORCYCLE HAS FAILED TWO SEPARATE TIMES OVER THE LAST YEAR FOR UNKNOWN MECHANICAL/ELECTRICAL PROBLEMS.  IN OCT. 2007, I HAD TO REPLACE THE MY ORIGINAL UNIT THROUGH AIH FOR A NEW SPEEDO/TACH HEAD UNIT FOR APPROX. $900.00.  ON MY SECOND RIDE OF THIS SEASON, MY \"NEW\" UNIT COMPLETELY FAILED AGAIN RESULTING IN THE PROFESSIONAL RECOMMENDATION THROUGH AIH OF ANOTHER NEW UNIT AGAIN.  I HAVE HAD SEVERAL FRIENDS AND AIH PROFESSIONALS EXPRESS THEIR OPINION ON AIH'S R&D PITFALLS WITH THIS OLD SPEEDO/TACH SETUP/SYSTEM!  ADDITIONALLY, I HAVE SENT NUMEROUS EMAILS TO AIH TO CORRECT MY UNIQUE PROBLEM WITH NO RESPONSE AND/OR ACKNOWLEDGEMENT IN REF. TO THEIR ASSISTANCE AND A POSSIBLE GOOD-FAITH WARRANTY.  YOUR AGENCY IS MY LAST HOPE, PLEASE HELP IF YOU CAN...CHAD E. WILLIAMS  *TR",
        "vin": "5L5TX044X41"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/22/2006",
        "dateOfIncident": "02/22/2006",
        "fire": false,
        "manufacturer": "American IronHorse Motorcycle Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10150893,
        "products": [
            {
                "manufacturer": "American IronHorse Motorcycle Company",
                "productMake": "AMERICAN IRONHORSE",
                "productModel": "TEXAS CHOPPER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT OWNS A 2004 IRONHORSE TEXAS CHOPPER MOTORCYCLE AND DISCOVERED THE SPEEDOMETER STOPPED WORKING WITHOUT WARNING.  THE MOTORCYCLE WAS SEEN BY THE DEALER AND THE SPEEDOMETER WAS REPLACED.  AFTER THE MOTORCYCLE WAS WASHED, THE SPEEDOMETER STOPPED WORKING.  THE DEALER AGAIN REPLACED THE SPEEDOMETER.  AFTERWARDS, THE MOTORCYCLE WAS WASHED AND THE SPEEDOMETER STOPPED WORKING.  THE MOTORCYCLE WAS SEEN BY THE DEALER FOR ANOTHER REPLACEMENT OF THE SPEEDOMETER.  THE DEALER WAS UNABLE TO DETERMINE IF WATER WAS THE CAUSE OF THE FAILURE, BUT WAS AWARE OF A NEW DESIGN EFFORT BY THE MANUFACTURER.  *AK",
        "vin": "5L5TX044041"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/02/2005",
        "dateOfIncident": "11/01/2004",
        "fire": false,
        "manufacturer": "American IronHorse Motorcycle Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131180,
        "products": [
            {
                "manufacturer": "American IronHorse Motorcycle Company",
                "productMake": "AMERICAN IRONHORSE",
                "productModel": "TEXAS CHOPPER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE ATTEMPTED TO HAVE THE FOLLOWING CONDITION FIXED AT MY   DEALERSHIP, BUT THE NEW SWITCH THEY PUT IN HAD THE SAME PROBLEM.  BELOW IS A COPY OF THE CORRESPONDENCE I SENT TO THE MFG.   I HAVE A CONCERN ABOUT THE HI BEAM LAMP SWITCH ON MY 04 TX CHOPPER.    THE 2005 AIH'S DO NOT HAVE THIS PROBLEM AND I ASSUMED IT HAS BEEN FIXED, AND MY HARLEY DAVIDSON DID NOT OPERATE LIKE THIS.  I AM BECOMING FRUSTRATED AND THIS IS MY LAST ATTEMPT TO RECTIFY BEFORE CONTACTING THE DOT.  I WORK IN THE AUTOMOTIVE INDUSTRY AND FEEL THIS ISSUE HAS POTENTIAL SAFETY AND LEGAL IMPLICATIONS.  MY OLD DEALERSHIP WAS AMERICAN CYCLE MART IN WATERFORD, MI AND I AM RELOCATING TO THE INDIANAPOLIS AREA. I WILL DO MY BEST TO DESCRIBE MY CONCERN HERE:  WHEN YOU SWITCH UP TO HIGH BEAMS, THE TRANSITION IS CLEAN AND AS   EXPECTED. THE ISSUE IS WHEN SWITCH DOWN TO LOW BEAMS.  IF YOU PARTIALLY DEPRESS THE BUTTON, BUT NOT FAR ENOUGH TO REACH THE  TRANSITION WHERE IT CLICKS OVER TO LOW, THE HEADLIGHT GOES OUT   COMPLETELY.  THE MAIN REASON I NOTICED IS DUE TO WEARING HEAVY GLOVES DURING COLDER  WEATHER (I JUST TOOK DELIVERY OF THE BIKE THIS NOVEMBER) THAT PREVENTED  ME FROM FULLY ACTUATING THE SWITCH IMMEDIATELY.  MY HEADLIGHT WAS OFF ONLY  FOR A MOMENT, BUT THAT MOMENT IS SCARY TRAVELING AT 70 MPH IN TOTAL  DARKNESS. I AM SURE THAT PROPER OPERATION SHOULD BE EITHER HI OR LOW BEAM ONLY,  AND NO  \"OFF\" CONDITION.  IT SEEMS THAT THE SWITCH CONTACT ACTION IS NOT IN   TIME WITH THE SPRING DETENT (IT SHOULD NOT BREAK CONTACT TO THE \"HI\" CIRCUIT UNTIL THE PAST THE SWITCH DETENT AND THE \"LOW CONTACT IS STARTING TO  CLOSE.) THE WORSE CASE SCENARIO SHOULD BE THAT BOTH HI AND LOW ARE AT THE SAME  TIME FOR A BRIEF INSTANT.  IF I CLICK TO LOW WITH A SOLID AND QUICK ACTION, THE LIGHT PAUSE IS NOT  SO PERCEPTIBLE.  BUT, I MUST MAKE A CONSCIOUS EFFORT TO DO SO.  *JB",
        "vin": "5L5TX044941"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "03/29/2005",
        "dateOfIncident": "03/16/2005",
        "fire": false,
        "manufacturer": "American IronHorse Motorcycle Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10115990,
        "products": [
            {
                "manufacturer": "American IronHorse Motorcycle Company",
                "productMake": "AMERICAN IRONHORSE",
                "productModel": "TEXAS CHOPPER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "REF:  MY 2004 AMERICAN IRONHORSE TEXAS CHOPPER W/ 111 S&S ENGINE      I AM WRITING YOU TO INFORM YOU OF A PRESISTENT PROBLEM THAT I AM EXPERIENCING WITH MY \"HIGH DOLLAR\" FACTORY PRODUCED MOTORCYCLE.  THE BIKE IS CONSTANTLY STALLING AT LOW RPM'S AND AT PROLONGED RED LIGHT SIGNALS.  THE BIKE WILL CUT OFF WITH NO ANTICIPATED SIGN, BUT WILL START RIGHT BACK UP ONCE THE START BUTTON IS PUSHED.  THIS WILL HAPPEN SEVERAL TIMES DURING A 200-300 MILE RIDE!  I HAVE TO \"FLUTTER\" THE THROTTLE TO KEEP IT FROM STALLING AND FROM IT SHUTTING OFF ON ME.  I BELIEVE THAT THIS IS A NATIONWIDE PROBLEM WITH THIS YEAR, MAKE, AND MODEL OF MOTORCYCLE.  I HAD RECENTLY COME ACROSS ANOTHER RIDER WHO IS EXPERIENCING THE SAME TYPE OF SAFETY-RELATED ISSUE.  THE INTERNET SITE IS...  HTTP://WWW.POWERSPORTSNETWORK.COM/ENTHUSIASTS/QUESTION_LIST.ASP?VEH=7800&QUEST=12411    HE STATES  \"MY 2004 TEXAS CHOPPER STALLS CONSTANTLY - TWENTY TIMES ON A 23 MILE RIDE BACK TO THE DEALER. THE DEALER CHANGED THE PUCK AND IGNITOR BUT THAT DIDN'T HELP - THE NEW PARTS WERE ALSO DEFECTIVE - IT STILL KEPT STALLING WHEN THE MECHANIC TEST RODE IT. APPARENTLY THIS HAS HAPPENED ON ANOTHER 2004 TEXAS CHOPPER AS WELL. DOES ANYONE ELSE HAVE THIS PROBLEM AND IF SO WHAT DID YOU HAVE DONE TO FIX IT?\" DAVE - 03/30/2004         CAN YOU PLEASE LOOK INTO THIS FOR ME.  I TRULY BELIEVE THAT THIS IS A SAFETY MATTER IN TERMS OF GETTING REARENDED AT \"STOP TO START\" INTERSECTIONS AND/OR THE BIKE SHUTTING OFF WHILE IN TRANSIT IN 1ST OR 2ND GEAR CAUSING A PERSONAL INJURY COLLISION.  THANK YOU FOR YOUR TIME AND PROFESSIONAL CONSIDERATION IN THIS MATTER...CHAD",
        "vin": "5L5TX044X41"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/09/2004",
        "dateOfIncident": "04/04/2004",
        "fire": false,
        "manufacturer": "American IronHorse Motorcycle Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10065852,
        "products": [
            {
                "manufacturer": "American IronHorse Motorcycle Company",
                "productMake": "AMERICAN IRONHORSE",
                "productModel": "TEXAS CHOPPER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "NEW MOTORCYCLE HAS 9 MONTH OLD BATTERY THAT FAILED, CAUSING VEHICLE TO STOP RUNNING WITHOUT WARNING, VEHICLE HAS NO WARNING LIGHT OR GUAGE TO INDICATE FAILED BATTERY FACTORY WILL NOT RESPOND TO COMPLAINT. VEHICLE WAS SOLD WITHOUT WARRANTY INFORMATION OR OWNERS MANUAL BEING AVAILABLE AT THE TIME.  *AK",
        "vin": "5L5TX044341"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/16/2004",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "American IronHorse Motorcycle Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10063250,
        "products": [
            {
                "manufacturer": "American IronHorse Motorcycle Company",
                "productMake": "AMERICAN IRONHORSE",
                "productModel": "TEXAS CHOPPER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "NHTSA RECALL 03V521000  CONCERNING BRAKE ROTORS.   CONSUMER CONTACTED THE DEALER ON FEBRUARY 2,2004, AND THE DEALER ORDERED THE PARTS TO PERFORM  RECALL REPAIRS.   DEALER INFORMED THE CONSUMER THAT PARTS WOULD ARRIVE BY MARCH 15,2004.  THE PARTS WERE STILL NOT AVAILABLE.*AK",
        "vin": "5L5TX044841"
    }
]