[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/30/2018",
        "dateOfIncident": "07/28/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11114564,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Hankook Tire America Corp.",
                "productMake": "HANKOOK",
                "productModel": "VENTUS S1 NOBLE 2",
                "productYear": "9999",
                "size": "255/50R20",
                "type": "Tire"
            }
        ],
        "summary": "HANKOOK TIRES, VENTUS S1 NOBLE 2 SPLITTING OUTSIDE SIDEWALL, CAUSED TO DEPRESSURE TIRE, WHICH CAUSED TO CRACK TIRE ON THE INNER SIDEWALL SUBSEQUENTLY LED TO MANUFACTURER CLAIM BLAME ON MY VEHICLE. THE TIRE MODEL IS UNDER A RECALL, BUT IN DIFFERENT SIZE, BUT IDENTICAL WALLS, MANUFACTURING PROCESS. MY VEHICLE'S TIRE SIZE 235/40/R18. RECALLED:  VENTUS S1 NOBLE2 '245/45R18 96W', '245/40R19 94W', '275/35R19 96W  PROPER TIRE PRESSURE WAS MAINTAINED AND CHECKED WEEKLY FOR 3YEARS, SINCE THE VEHICLE WAS PURCHASED.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/24/2017",
        "dateOfIncident": "10/20/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11036013,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER ENGINE COOLS DOWN, TIMING CHAIN RATTLE CAN BE HEARD UPON STARTING THE CAR. CHAIN RATTLE MEANS THAT PLASTIC GUIDES OR ADJUSTERS ARE WORN, AND MIGHT GO ANY SECOND. SPOKE WITH AUDI REP ONLINE, WHICH ADVISES ME THAT THIS IS NORMAL, AND EXPECTED. KNOWING BASICS OF ENGINES AND TRANSMISSION, I DIDN'T BELIEVE THAT SOMETHING IS \"LIFE TIME\" AND IS NOT SERVICEABLE, ESPECIALLY IF IT'S PLASTIC (WHICH TENDS TO SHRINK AND EXPAND DEPENDING ON TEMPERATURES, AND THEN HAS FRACTURES WHICH SNAPS). TWO DIFFERENT INDEPENDENT LICENSED AUDI SHOPS CONFIRMED THAT THE GUIDES AND ADJUSTERS HAS TO BE REPLACED IN ORDER TO PREVENT CATASTROPHIC ENGINE FAILURE. CHAIN SKIPPING A TOOTH MIGHT MEAN BENT VALVES, SCORED CYLINDER WALLS AND THE LIST GOES ON. WHAT IS LIFETIME, SHOULD BE COVERED BY AUDI. IF IT'S PROMISED TO BE LIFETIME AND NEEDS NO SERVICE, SHOULDN'T BREAK. IF IT BREAKS THAT ONLY MEANS DESIGN FLAWS, WHICH ARE OBVIOUS IN THIS ENGINE. YES, CAR ISN'T NEW, BUT THE PARTS WERE LIFETIME, SO I'M EXPECTING THEM TO LAST UNTIL ENGINE IS WORN OUT, NOT THE PARTS THAT ARE LIFETIME. IF NHTSA WILL DO FULL SCALE INVESTIGATION. WILL BE OBVIOUS THAT LARGE AMOUNT OF S4'S RANGING FROM 2004 TO 2007 ARE AFFECTED. EVEN 10% IS LARGE NUMBER, CONSIDERED THE COSTS OF FIXING WHAT IS \"LIFETIME\" ACCORDING TO AUDI, AND WHEN IT FAILS THEY LEAVE THEIR DESIGNS FLAWS FOR YOU TO FIGURE OUT. HOPEFULLY JUSTICE CAN BE BROUGHT TO LIGHT AS TO WHAT AUDI TRIES TO TURN IT'S BACK TO. SYMPTOMS: CHAIN RATTLE UPON START. CHAIN RATTLE DOESN'T GO AWAY WHILE DRIVING. CHECK ENGINE LIGHT, LOSS OF POWER OR CATASTROPHIC ENGINE FAILURE.",
        "vin": "WAUPL68E94A"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/17/2016",
        "dateOfIncident": "05/15/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10865507,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "XENON HEADLAMPS WIRING ALL CORRODED AND BARE WITH NO INSULATION LEFT.  CHECK WITH AUDI AND THEY SAID OUR VEHICLE AND VIN IS NOT PART OF ANY RECALL.  YET RCORRD-05V096-4498 IN YOUR DATABASE SHOWS A MOFIFICATION LETTER FROM VW TO INCLUDE OUR VIN. THERE IS NO RECORD ACCORDING TO AUDI SERVICE SHOPS THAT SHOW ANY RECALL WORK DONE TO OUR HEADLIGHTS.  I HAVE ATTACHED A PICTURE THAT SHOWS THE DETERIATION OF THE ELECTRICAL WIRING AND HEADLAMPS TO OUR 2004 AUDI S4.  WOULD APPRECIATE SOME ASSISTANCE TO HAVING OUR HEADLAMPS REPLACED FOR SAFETY REASONS.",
        "vin": "WUARL48HX4K"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/10/2015",
        "dateOfIncident": "07/15/2015",
        "fire": true,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10747523,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 AUDI S4. WHILE DRIVING AT NIGHT, THE LOW BEAM HEAD LAMPS FAILED TO ILLUMINATE WITHOUT WARNING. WHILE ATTEMPTING TO THE HEAD LAMP BULBS, THE CONTACT NOTICED THAT THE WIRING WAS BURNED AND DAMAGED. THE DEALER AND THE MANUFACTURER WERE NOTIFIED OF THE FAILURE, BUT THE VIN WAS NOT INCLUDED IN ANY RECALLS. THE APPROXIMATE FAILURE MILEAGE WAS 79,000.",
        "vin": "WUARL48HX4K"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/17/2014",
        "dateOfIncident": "12/15/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10666999,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SATURDAY MORNING 12/15/2014 START MY CARD AND HEARD  A RATTLE NOISE ON THE ENGINE, FIRST TIME IT MAKE THAT NOISE SINCE I BOUGHT IT. ON MY WAY TO WORK I STARTED HEARING THE RATTLE NOISE AGAIN BUT THIS TIME IT WAS LOUDER I WAS DRIVING AROUND 40 MPH WHEN THIS HAPPENED. THE CAR STARTED VIBRATING AND KEPT MAKING THE RATTLE NOISE ON THE ENGINE. I JUST BOUGHT THIS CAR NOT EVEN A WEEK AGO, AND ALREADY STARTED HAVING ENGINE PROBLEMS. I TOOK IT TO THE MECHANIC AND FOUND OUT THE  ENGINE MIGHT NEED TO BE REPLACE SOON, SINCE THAT'S  A COMMON  PROBLEM WITH THIS CARS AND THAT THAT'S ONE OF THE SIGNS THAT THE ENGINE MIGHT GO BAD SOON.  *TR",
        "vin": "WAUPL68E74A"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/14/2014",
        "dateOfIncident": "10/03/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10622265,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "AUDI CLAIMS THAT THE TIMING CHAIN ON THOSE VEHICLES ARE LIFETIME AND DOES NOT NEED TO BE SERVICE.  UNFORTUNATE THE TIMING CHANGE TENSIONERS ARE MADE OF PLASTIC WHICH THE WEAR OUT AT ABOUT 50K MILES, CAUSING A START UP RATTLE AND EVENTUALLY ENGINE EXPLOSION FROM THE CHAIN COMING OF THE GUIDES AND DESTROYING THE ENTIRE ENGINE AND CAUSING A MASSIVE ACCIDENT AT HIGH SPEED. HUNDREDS OF PROBLEMS LIKE THIS ONE ARE REPORTED ONLINE FROM THOUSANDS OF PEOPLE EVEN YOUTUBE VIDEOS.  NOT TO MENTION THAT EVERY TIME YOU BRING YOUR VEHICLE AND COMPLAINT TO AUDI THE CLAIM THAT THE RATTLE IS NORMAL; JUST TO FIND OUT THAT  IS THE FIRST CLUE OF FUTURE ENGINE FAILURE.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING,SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/16/2012",
        "dateOfIncident": "12/15/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10451955,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 AUDI S4. THE CONTACT WAS DRIVING 25 MPH WHEN THE STEERING WHEEL FAILED AND BECAME STIFF AND HARD TO TURN. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSTIC TESTING WHO CONFIRMED THERE WAS A PUNCTURED HOSE CAUSING THE STEERING TO FAIL. THE CONTACT ALSO MENTIONED ON A SEPARATE OCCASION  THAT HE HEARD A SQUEALING NOISE AFTER THE BRAKES WERE DEPRESSED. THE FAILURE CAUSED THE BRAKES TO MALFUNCTION WHEN THEY WERE APPLIED. THE DEALER STATED THE BRAKES NEEDED TO BE REPLACED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 112,000 AND THE CURRENT MILEAGE WAS 114,000.",
        "vin": "WAUPL68E24A"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/02/2012",
        "dateOfIncident": "02/01/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10446471,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 AUDI S4. CONSUMER STATES VEHICLE FAILED WHILE DRIVING, ENGINE, POWER BRAKES AND STEERING LOCKED UP *TGW  THE DEALER INFORMED THE CONSUMER, THE VEHICLE HAD SUFFERED CATASTROPHIC ENGINE FAILURE, WHICH WAS  MOST LIKELY DUE TO THE FAILURE OF THE TIMING CHAIN OR ADJUSTERS.  THE CONSUMER WAS QUOTED A PRICE OF $24,000 FOR THE REPAIRS. THE CONSUMER HAS SINCE LEARNED IT WAS A RELATIVELY COMMON PROBLEM FOR HIS MODEL AND YEAR.  THE SPECIFIC MECHANICAL FLAW SEEMED TO BE THAT THE TIMING CHAIN COORDINATED THE ACTION BETWEEN THE PISTONS AND THE VALVES. THE TIMING CHAIN WAS SUPPORTED BY SEVERAL PLASTIC GUIDES. THE GUIDES PUSHED AGAINST THE CHAIN BY THE ADJUSTERS. *JB",
        "vin": "WAUPL68E64A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/13/2012",
        "dateOfIncident": "12/22/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10443757,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2004, AUDI, S4 WHICH I PURCHASED USED FROM MY BROTHER, WHO BOUGHT IT NEW. I BOUGHT THIS CAR FROM HIM WITH 45,000 MILES ON IT. AT 55,000 MILES THE CAR HAD CATASTROPHIC ENGINE FAILURE. 5,000 MILES OVER THE WARRANTY PERIOD! THE MECHANIC THAT IS REPAIRING THE DAMAGE SAID IF ONE MORE COMPONENT WOULD HAVE BROKE IT COULD HAVE CAUSED ME TO LOSE CONTROL OF THE VEHICLE AND CRASH. THE ENGINE AND TRANSMISSION HAD TO BE REMOVED FROM THE VEHICLE TO BE REPAIRED. I CONTACTED AUDI OF U.S.A. TO,1. ALERT THEM OF THIS PROBLEM AND POSSIBLE SAFETY ISSUE, 2. BECAUSE THE CAR IS ONLY 5,000 MILES OVER THE WARRANTY AND IT HAD SUCH MASSIVE FAILURE I BELIEVE IT ONLY REASONABLE  TO ASK FOR SOME HELP IN THE COST OF REPAIRS. THE REPAIR COST ARE GOING TO BE BETWEEN 4,000 AND 5,000 DOLLARS. 3. I WORK IN QUALITY ASSURANCE FOR A COMPANY AND I REALLY WANTED TO SPEAK WITH THEIR QUALITY ASSURANCE AND ALERT THEM TO THIS BIG PROBLEM. IT IS CRUCIAL THEY (AUDI) UNDERSTAND THE PROBLEM. THE REPS AT AUDI OF U.S.A. THAT I SPOKE WITH WOULD NOT HELP (EXCEPT TO LISTEN, THEY ARE GOOD AT THAT), AND WERE NOT COOPERATING WITH ME IN THE PROCESS OF TRYING DESPERATELY TO ALERT THEIR QUALITY PEOPLE OF THIS FAILURE THAT OCCURRED TO MY CAR. I BELIEVE I WAS COMPLETELY IGNORED AND I NEED TO FIND OUT HOW I CAN EFFECTIVELY REPORT THIS. NOT ONLY TO AUDI BUT ALSO OTHER PEOPLE WHO OWN THE SAME VEHICLE. THIS IS A MAJOR ISSUE THAT NEEDS TO BE MADE PUBLIC. THANK YOU.  *TR",
        "vin": "WAUPL68E04A"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/21/2010",
        "dateOfIncident": "11/20/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10371992,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 AUDI S4 CONVERTIBLE - 40K - REAR WINDOW OF CONVERTIBLE TOP HAS SEPARATED FROM TOP  - APPEARS TO BE GLUE, ATTACHMENT METHOD FAILURE.  CALLED AUDI OF AMERICA REQUESTING ASSISTANCE, V. NICE -  WANTED TO INITIATE CONVERSATION / INSPECTION 'AT DEALER LEVEL'.  LOCAL DEALER LOOKS AT IT AND QUOTE $4350 TO REPLACE ENTIRE ROOF.  DISCUSSIONS BETWEEN AUDI OF AMERICA AND DEALER APPARENTLY ENSURE WHERE 'LEVEL OF PARTICIPATION' TO ASSIST IS DISCUSSED.  WE HAD PREVIOUSLY PURCHASED A NEW S4 AT THIS DEALER IN 2000 AND TRIED TO PURCHASE S4 CONVERTIBLE FROM THEM IN 2007.  WE HAD OWNED 10 (TEN) VWS PRIOR.  FURTHER,  ASST SVC MGR AT AUDI OF TYSONS CORNER ADVISED THAT I SHOULD HAVE GARAGED MY VEHICLE, PROBLEM WOULD NOT BE FAILURE OF ADHERING PROPERTY, BUT CLEARLY NOT MAINTAINED PROPERLY BY ME.  MY REQUEST FOR ASSISTANCE WAS REFUSED BY THE DEALER BECAUSE OF 'DEALER LOYALTY'.   AUDI OF AMERICA SAID THEY COULD NOT OFFER ANY HELP EITHER.  I SEE ON THIS SITE THAT MANY HAVE HAD THIS PROBLEMS WITH 03 CONVERTIBLE PRODUCTS AND PRIOR TO READING THOUGHT THAT THIS ISSUE IS SOMEWHAT IF NOT ENTIRELY THE RESPONSIBILITY OF AUDI - AFTER ALL - SHOULD WE ANTICIPATE REPLACING AN ENTIRE ROOF FOR ALMOST $5000 AT ONLY SIX YEARS ????   AS A HUMOROUS ENDNOTE - THE DEALER CALLED ME TODAY - WE HAD LOOKED AT CARS WHILE THERE - THEY WANT ME TO COME BY - TEST DRIVE AND BUY :-)  *TR",
        "vin": "WUARL48H64K"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/08/2010",
        "dateOfIncident": "01/30/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10307525,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "IN JANUARY 2009 I ATTEMPTED TO CHANGE THE RIGHT FRONT TIRE ON MY 2004 AUDI S4. I USED THE CAR JACK THAT COMES WITH THE CAR. AFTER LIFTING THE CAR UP ON THE PROPER POSITION (AS EXPLAINED IN THE AUDI USERS MANUAL) THE CAR JACK BROKE APART UNDER THE WEIGHT OF THE CAR. THE GROUND IN MY GARAGE IS EVEN AND MADE OUT OF CONCRETE AND THE AUTOMATIC TRANSMISSION WAS IN P AND THE EMERGENCY BRAKE WAS FULLY APPLIED SO THAT MOVEMENT OF THE CAR WHILE LIFTED WAS IMPOSSIBLE. THE AUDI DEALER I COMPLAINED TO REPLACED THE CAR JACK AND FIXED THE DAMAGE ON THE RIGHT LOWER SIDE OF MY CAR WITHOUT ANY CHARGES. TWO WEEKS AGO I HAD A FLAT ON THE RIGHT FRONT SIDE OF MY CAR AGAIN COMING UP INTERSTATE I 55 FROM CAPE GIRARDEAU MO. WHEN USING THE NEW CAR JACK (SAME MODEL) THAT THE AUDI DEALER HAD GIVEN ME AFTER THE PRIOR INCIDENT. AND AS YOU PROBABLY GUESSED THE SAME HAPPENED AGAIN. THIS TIME I WAS ON THE SIDE OF THE ROAD BUT THE CIRCUMSTANCES WERE NOT MUCH DIFFERENT. AFTER I STOPPED THE CAR, I SELECTED PARK ON THE AUTOMATIC TRANSACTION AND APPLIED THE EMERGENCY CAR BRAKE. AFTER LOOSENING UP THE BOLTS I PLACED THE CAR JACK AS EXPLAINED IN AUDIS USER MANUAL UNDER THE CAR ON THE FRONT RIGHT SIDE AND LIFTED THE CAR UP. THEN I ATTEMPTED TO TAKE OF THE TIRE WHEN THE JACK SUDDENLY GAVE IN AS DONE IN THE FIRST SITUATION EXPLAINED ABOVE. FORTUNATELY THE CAR DROPPED WITH THE ROTOR ONTO THE INSIDE OF THE RIM OF THE TIRE I WAS ABOUT TO PULL OF. I HAD TO CALL A FRIEND WHO WAS BRINGING ME A DIFFERENT CAR JACK SO I COULD PUT ON THE SPARE TIRE. LATER I FOUND OUT THAT THE RIGHT ROTOR WAS SLIGHTLY DAMAGED AFTER DROPPING ONTO THE INSIDE OF THE TIRE RIM. NOBODY WAS HURT BUT I TRULY BELIEVE THAT THIS CAR JACK IS DANGEROUS AS IT DOESNT SEEM TO BE MADE TO CARRY THE WEIGHT OF MY CAR. I WORKED FOR BMW AS A LICENSED CAR MECHANIC IN THE PAST AS WELL WAS A MAINTENANCE CREW CHIEF WORKING ON FIGHTER JETS WELL CAPABLE OF CHANGING A TIRE; IF THIS HAPPENS TO ME THEN I BELIEVE IT CAN HAPPEN ANYTIME TO ANYBODY USING THIS CAR JACK",
        "vin": "WUARL48H94K"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/03/2010",
        "dateOfIncident": "11/25/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10297853,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE FAILURE GOING 45MPH DUE TO BROKEN VALVE SPRING. FAULTY PART DOCUMENTED IN 5/2005 USA TODAY BUT AUDI WILL NOT REPAIR. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/09/2009",
        "dateOfIncident": "11/18/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10295044,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR ENGINE WAS MISFIRING - WAS INFORMED A FAULTY COIL PACK WAS CAUSING THE ISSUE. ONE WEEK LATER THE MISFIRES STARTED AGAIN. TWO MORE COIL PACKS WERE REPLACED. 2 WEEKS LATER ANOTHER MISFIRING EPISODE. CAR DIED AT INTERSECTION SO WAS TOWED IN FOR INSPECTION. CAMSHAFT ADJUSTER/CAM GUIDES HAD FAILED. PARTS WERE REPLACED FOR 5K AND THEN 2 WEEKS LATER CYLINDER 3 FAILED WHEN VALVE AND PISTON INTERACTED - CAR DIED AGAIN ON THE HIGHWAY. CAR ENGINE IS GOING TO NEED TOTAL ENGINE REPLACEMENT. *TR",
        "vin": "WAUPL68E44A"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/07/2009",
        "dateOfIncident": "11/29/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10294801,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "SEE THE NHTSA ODI COMPLAINTS: 10267048, 10263937, 10262201, 10261864, 10261281, AND 10294798.    MY SECOND EXPERIENCE WITH THE CATASTROPHIC ENGINE FAILURE OF THE \"CAM CHAIN TENSIONER\" COMPONENTS WAS IN NOV OF 2009 ON THE BANK 1 CAM. FAULT CODE \"SET POINT NOT REACHED (OVER-RETARDED).\" WITH MISFIRES TO ALL CYLINDERS ON BANK 1 - LESS THAN ONE YEAR FROM THE SAME FAILURE ON BANK 2 (SEE NHTSA ODI COMPLAINT #10294798). THERE WAS APPROXIMATELY 70,000 MILES ON THE ODOMETER. AS I MENTIONED BEFORE, ALTHOUGH THE S4 IS A LOW VOLUME CAR THE 4.2L ENGINE IS USED IN MANY OF THEIR PRODUCTS; AND IF THIS COMPLAINT VENUE ANY INDICATION THE ENGINE APPEARS TO SUFFER A HIGH PERCENTAGE OF EXPENSIVE AND DANGEROUS FAILURES. THE COST TO DROP THE ENGINE AND TRANSMISSION IN ORDER TO MAKE THE REPAIR WAS ANOTHER ~$4,500. *TR",
        "vin": "WAUPL68E04A"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/07/2009",
        "dateOfIncident": "12/15/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10294798,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "SEE THE NHTSA ODI COMPLAINTS: 10267048, 10263937, 10262201, 10261864, AND 10261281    MY FIRST EXPERIENCE WITH THE CATASTROPHIC ENGINE FAILURE OF THE \"CAM CHAIN TENSIONER\" COMPONENTS WAS IN DEC OF 2008 ON THE BANK 2 CAM. FAULT CODE \"SET POINT NOT REACHED (OVER-RETARDED).\" WITH MISFIRES TO ALL CYLINDERS ON BANK 2 - ALL BUT RENDERING THE VEHICLE UNABLE TO DRIVE. THERE WAS APPROXIMATELY 54,000 MILES ON THE ODOMETER. THOUGH OUT OF WARRANTY I CONTACTED AUDI TO NO AVAIL. I AM SORELY DISAPPOINTED IN AUDI FOR ENGINEERING SUCH SHODDY DESIGN, AND NOT STANDING BY THEIR PRODUCT. IN FACT CRISWELL AUDI CHARGED $300 FOR AN ECU UPDATE THAT DID NOTHING. ALTHOUGH THE S4 IS A LOW VOLUME CAR THE 4.2L ENGINE IS USED IN MANY OF THEIR PRODUCTS; AND IF THIS COMPLAINT VENUE ANY INDICATION IT APPEARS TO SUFFER A HIGH PERCENTAGE OF EXPENSIVE AND DANGEROUS FAILURES. THE COST TO DROP THE ENGINE AND TRANSMISSION IN ORDER TO MAKE THE REPAIR WAS ~$4,500. *TR",
        "vin": "WAUPL68E04A"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "07/26/2009",
        "dateOfIncident": "05/20/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10278368,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 S4 WIPERS STOP WORKING (STOP IN THE MIDDLE OF WINDSHIELD) IN RAIN,  MOTOR WORKS SEEMS AS SOMETHING SIZED, IN SOME SITUATIONS MAY CAUSE BIG DAMAGE AND INJURY. *TR",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "07/26/2009",
        "dateOfIncident": "06/16/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10278370,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE IN RAIN ALL WINDOWS FOGGING UP FROM INSIDE, UNABLE TO DEFOG,  THE A/C WILL NOT TURN ON, CHECKED FOR LEAKS - NO LEAKS OBSERVED, SPORADICALLY THE A/C TURNS ON AND OFF,  VERY COMMON PROBLEM IN CARS FROM THIS YEAR, MAY CAUSE DAMAGE AND INJURY. *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/31/2009",
        "dateOfIncident": "12/02/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10272456,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2004 S4 WHICH CRUNCHES WHEN SHIFTING INTO 2ND AND 3RD GEAR. AUDI REPLACED THE SYNCHROS BUT THE PROBLEM STILL PERSISTS. I HAVE RETURNED TO THE DEALERSHIP NUMEROUS TIMES BUT THEY KEEP TELLING ME ITS NORMAL. THE CRUNCHES OCCURS EVERYTIME I DRIVE IT AND ALSO MAKE IT DIFFICULT TO GET INTO GEAR. THE VEHICLES RPMS WILL SOMETIMES STICK, KEEPING THE VEHICLE MOVING WHEN NOT UNDER ACCELERATION.",
        "vin": "WAUPL58E34A"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/28/2009",
        "dateOfIncident": "04/22/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10267048,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 44,000 MILES MY CAR HAS CATASTROPHIC FAILURE DUE TO DEFECTIVE PARTS. IT IS A SAFETY ISSUE AS I STATED ABOVE BECAUSE MANY PEOPLE EXPERIENCE THE ENGINE REVVING UP. THE TRANSMISSION CAN ALSO BE A SAFETY ISSUE BECAUSE IT TYPICALLY HAPPENS UNDER HARD BRAKING WHICH ALL OF YOU KNOW IF YOU ARE IN GEAR YOU SLOW DOWN BETTER IF ALL OF A SUDDEN YOU POP OUT OF GEAR YOU CAR DOES NOT HAVE AS MUCH HOLDING YOU BACK. *TR",
        "vin": ""
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "04/24/2009",
        "dateOfIncident": "03/12/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10266569,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR SEAT BELT BUCKLE HAS INTERIOR DEFECTS AFTER 33,000 MILES.  CAR IS OUTSIDE OF WARRANTY DUE TO YEAR OF VEHICLE.  THE FEMALE RECEPTOR OF THE BUCKLE HAS SOME OF THE INNER MECHANISM HANGING OUTSIDE OF THE LIP OF THE BUCKLE, MUCH DIFFERENT THAN THE OTHER BUCKLE NEXT TO IT WHICH IS IN NORMAL WORKING ORDER. *TR",
        "vin": "WUARL48H34K"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/02/2009",
        "dateOfIncident": "11/14/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10263937,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "CATASTROPHIC ENGINE FAILURE AND SEIZE AT 70MPH.    PREVIOUS THE FAILURE, AUDI REPLACED BENT VALVES DUE TO TIMING CHAIN TENSIONER FAILURE.  LESS THAN 300 MILES FROM NEW HEADS BEING INSTALLED, THE ENGINE FAILED COMPLETELY. *TR",
        "vin": "WAUPL68EX4A"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/17/2009",
        "dateOfIncident": "03/13/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10262201,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I GOT IN MY CAR THIS PAST FRIDAY TO LEAVE FOR WORK AND THEN MY CAR STARTS RUMBLING AND SOUNDS LIKE WHAT CAN BEST BE DESCRIBED AS A MUSCLE CAR. I ONLY LIVE A MILE FROM MY OFFICE SO I DRIVE MY CAR IN. WHILE DRIVING IT SEEMS LIKE THE CAR HAS LOST LOW END POWER AND IS STILL IDLING WITH A RUMBLE. WHEN I GET TO WORK I POP THE HOOD AND NOTICE THE ENTIRE MOTOR SHIFTING BACK AND FORTH AND MY BUDDY SEES MY EXHAUST IS MOVING UP AND DOWN. SO I DECIDE TO GET IT TO THE LOCAL GARAGE THAT HAS WORKED ON MY CAR BEFORE. HE IS ONLY ABOUT 2 BLOCKS DOWN FROM MY OFFICE. WHEN I PULL OUT FROM MY PARKING LOT THE CAR THROWS A CEL AND ABOUT 500 FT FROM THE GARAGE IT STARTS FLASHING. SO I COAST THE CAR INTO THE GARAGE AND GET THE CODES READ. THEY'RE COMING UP AS CYL. 4, 5, 6, AND 7 MISFIRES AND P0021 CAM TIMING ADJUST BANK 2 NOT REACHED. SO THE MECHANIC CLEARS THE CODES AND TAKES THE CAR AROUND THE BLOCK AND ONCE AGAIN THE CEL COMES ON AND THIS TIME IT SAYS CYL. 1,3,7, AND 8 MISFIRING AND THE P0021 CODE FOR THE CAM TIMING AND ALSO A NEW CODE P1317 BANK 2 CAM/CRANK ANGLE SENSOR WRONG COMBO OF ECU'S....TO MAKE A LONG STORY SHORT THE CAR WAS TOWED OVER 100 MILES AWAY TO THE NEAREST AUDI DEALER AND WAS DIAGNOSED AS HAVING A FAULTY CAM TENSIONER. THE WHOLE MOTOR NEEDS TO BE REMOVED AND TORE APART AND THE TENSIONER REPLACED. THE BILL IS $6286.18. MY CAR IS A 2004 AUDI S4 WITH ONLY 67,000 MILES ON IT AND I JUST PURCHASED IT ABOUT 5 MONTHS AGO. IT IS NOT UNDER WARRANTY. *TR",
        "vin": "WAUPL68E74A"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/15/2009",
        "dateOfIncident": "07/11/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10261864,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I DRIVE A 2004 AUDI S4.  MY CAR SUFFERED A MAJOR FAILURE.  THE MOTOR FAILED DUE TO A DESIGN BY AUDI AND THAT IS UNACCEPTABLE.  THE CAR FAILED DUE TO THESE PLASTIC GUIDES THAT AUDI USES AS TIMING CHAIN GUIDES.  THE GUIDES ARE NEVER SUPPOSED TO BE SERVICED ALTHOUGH WHEN THEY FAIL YOU HAVE TO PAY AT LEAST 4 THOUSAND DOLLARS TO GET THEM REPLACED BECAUSE THE MOTOR NEEDS TO BE PULLED TO REPLACE THEM.  THEY ARE ON THE BACK OF THE MOTOR SO THERE IS NO WAY TO KNOW WHEN IT IS GOING TO HAPPEN.  WHEN THE TIMING CHAIN TENSIONER OR THE GUIDES FAIL IT CAN AND WILL RESULT IN A MAJOR MOTOR FAILURE.  IF THE MOTOR NEEDS TO BE REBUILT IT WILL COST AT LEAST $10,000.  LUCKILY I HAD AN EXTENDED WARRANTY AND IT WAS COVERED, BUT I WOULD STILL LIKE TO NOTE THAT THIS IS UNACCEPTABLE AND AUDI SHOULD BE DOING SOMETHING BECAUSE THIS IS NOT A FAILURE THAT ONE WOULD EXPECT ON A 4 YEAR OLD CAR. *TR",
        "vin": "WAUPL68E84A"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/10/2009",
        "dateOfIncident": "02/22/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10261478,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 AUDI S4, BUILD DATE 09/03 :   1.  24 AUG 06- 16,500 MILES- A/C STOPPED WORKING- REPLACED ENTIRE A/C SYSTEM (COMPRESSOR, HOSES, PIPES, DRIER, RESTRICTOR) UNDER WARRANTY.  2.  10 APR 07- 23,253 MILES- CAR WON?T START- STARTER REPLACED UNDER WARRANTY. PEALING SHIFT KNOB (CHROME SURROUND WAS PEALING AND THE EDGES WERE LIKE A RAZOR BLADE), REPLACED UNDER WARRANTY. CENTER CONSOLE LATCH BROKEN- REPLACED UNDER WARRANTY.  3. 22 FEB 08- 31,992 MILES- ENGINE REPLACED DUE TO FAULTY VALVE SEAT.  SEAT BROKE ALLOWING VALVE TO BE SUCKED INTO CYLINDER AND THEN PUNCHED OUT THE SIDE OF THE BLOCK. ENGINE REPLACED UNDER WARRANTY.  4.  10 SEP 08- 37,448 MILES- A/C STOPPED WORKING. HIGH PRESSURE SWITCH REPLACED UNDER WARRANTY. *TR",
        "vin": "WAUPL68E24A"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/09/2009",
        "dateOfIncident": "02/12/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10261281,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2004 AUDI S4 THAT HAD CATASTROPHIC FAILURE AT ONLY 40,000 MILES DUE TO DEFECTIVE PARTS.  THE CAR HAS A PROBLEM WHERE A TENSIONER I AM TOLD ALLOWS THE MOTOR TO REV UP EVEN WHEN YOUR FOOT IS NOT ON THE GAS PEDAL AND IT CAUSES DAMAGE TO THE MOTOR.  THIS HAS HAPPENED TO MANY OWNERS, MOST WERE UNDER WARRANTY BECAUSE THIS PART FAILS AT SUCH A LOW MILEAGE, IN SOME CASES UNDER 100 MILES.  NOT ONLY DOES THIS CAUSE UN SAFE SITUATIONS FOR THE DRIVER AS THE ENGINE CAN HAVE THIS REV UP HAPPEN MULTIPLE TIMES BEFORE THE ENGINE FAILS, IT ALSO CAUSES REPAIRS THAT ARE VERY VERY COSTLY AND NOT WORTH WHILE.  WHEN I TOOK MY CAR TO THE DEALERSHIP THEY ALSO DISCOVERED THAT MY TRANSMISSION IS NEEDING TO BE COMPLETELY REPLACED.  THIS IS ALSO DUE TO DEFECTIVE METALS USED IN THE SYNCROS IS WHAT I AM TOLD.  AUDI HAS NO DESIRE TO CORRECT THE PROBLEM EVEN THOUGH THEY HAVE ADMITTED NONE OF THE PROBLEMS ARE DUE TO ABUSE BUT RATHER WEAK PARTS.  EVEN THOUGH I AM OUT OF WARRANTY THAT SHOULD NOT MAKE A DIFFERENCE WHEN THEY HAVE HAD SO MANY OF THE SAME EXACT CASES REPAIRED TO DATE.  MY KBB VALUE IS 23,500 AND THE REPAIR COST WOULD BE AROUND $17,500. *TR",
        "vin": "WAUPL68E04A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/09/2009",
        "dateOfIncident": "02/05/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10261380,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2004 AUDI S4 THAT IS SLIPPING OUT OF SECOND GEAR... IT IS A KNOWN SECOND GEAR SYNCHRO PROBLEM THAT AUDI IS IGNORING.  I HAVE CALLED AUDI OF AMERICA, AND THEY ADMIT THERE IS AN ISSUE BUT STILL OFFER NO HELP. THE ISSUE STARTED AT 55,000 MILES WHICH IS 5K MILES OUT OF WARRANTY. *TR",
        "vin": "WAUPL68E14A"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,EXTERIOR LIGHTING,VISIBILITY,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/27/2007",
        "dateOfIncident": "11/07/2004",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10212985,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 AUDI S4. WHEN THE WEATHER WAS COLD AND THE CONTACT TOOK HIS FOOT OFF OF THE ACCELERATOR, THE VEHICLE WOULD NOT SLOW DOWN. THE DEALER COULD NOT DUPLICATE THE PROBLEM. THE CURRENT MILEAGE WAS ABOUT 75,000 MILES AND THE FAILURE MILEAGE WAS LESS THAN 5,000 MILES. UPDATED 01/24/08.  *LJ  THE BRAKE LIGHTS WOULD COME ON AND GO OFF. THE REAR VIEW MIRROR FELL OFF. THE COOLING FAN WOULD STAY ON AT ALL TIMES. THE DEALER REPLACED A FAULTY FAN MODULE.  UPDATED",
        "vin": "WAUPL68E14A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/14/2007",
        "dateOfIncident": "07/24/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10199548,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE AN AUDI S4 CONVERTIBLE THAT HAS BEEN TO THE DEALERSHIP MULTIPLE TIMES FOR THE SAME SAFETY ISSUE.  THE AIRBAG SYSTEM HAS BEEN DEFECTIVE AND THE REPAIRS DO NOT SEEM TO BE TAKING HOLD WHEN THEY DO THEM.  SO FAR THERE FORTUNATELY HAS NOT BEEN A NEED TO USE THE AIRBAG SYSTEM, HOWEVER ITS UNAVAILABILITY IS A MAJOR CAUSE FOR CONCERN.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/16/2007",
        "dateOfIncident": "11/20/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10178832,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "S4",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER COUPLING ON POWER STEERING MOTOR FAILED RESULTING IN LOSS OF STEERING AS I WAS DRIVING....DEALER LATER INFORMED ME THAT THIS WAS A DEFECT THAT HAD BEEN CORRECTED BUT I DID NOT SEE A RECALL POSTED.  *NM",
        "vin": ""
    }
]