[
    {
        "components": "STEERING,POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/17/2022",
        "dateOfIncident": "03/15/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457074,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "was leaving my and steering wheel locked up.",
        "vin": "JH4CL96844C"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/11/2022",
        "dateOfIncident": "12/18/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447114,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2004 ACURA TSX I PURCHASED FROM THE ORIGINAL OWNER BACK ON MAY OF 2018 WITH 55000 ORIGINAL MILES. THE CAR RUNS LIKE NEW IT WAS WELL TAKEN CARE OF WITH THE ORIGINAL OWNER ALL SERVICES AND INSPECTIONS WERE UP TO DATE AS/ CARFAX REPORT. THE CAR SINCE I'VE OWNED I PUT 19000 MILES WITH ALL SERVICE AND INSPECTIONS UP TO DATE SO THE VEHICLE HAS NOW 74000 MILES. 3 WEEKS AGO THE AUTOMATIC TRANSMISSION STARTED TO SHIFT ROUGH. THE FLUIDS AND FILTER WERE REPLACED AT 60000 MILES SO ITS NOT THE FLUID THATS DIRTY. I TOOK IT TO 3 DIFFERENT MECHANICS INCLUDING MY STATE INSPECTION MECHANIC  AND THEY TOLD ME THE TRANSMISSION NEEDS TO BE REPLACED BECAUSE IT'S STARTING TO GO BAD. I WAS ALSO TOLD THESE TRANSMISSIONS CAME FAULTY IN A LOT OF HONDA CARS AND HONDA WAS TO REPLACE THEM AT NO COST. MY QUESTION IS IF MY CAR FALLS INTO THIS WARRANTY ISSUE BECAUSE I KNOW THE YEAR OF CAR IS OLD BUT THE CAR LOOKS AND RUNS LIKE NEW. PLEASE LET ME KNOW WHAT CAN BE DONE TO SOLVE THIS MATTER MAYBE THERE IS A RECALL THAT I'M NOT AWARE OF AND MAYBE IT CAN BE REPAIRED THRU THE MANUFACTURER SINCE THIS IS A VERY EXPENSIVE AND COSTLY ISSUE TO TAKE CARE OF ON MY OWN. I CAN BE REACHED AT [XXX] IF YOU NEED FURTHER INFORMATION THANK YOU.  [XXX] (OWNER)  INFORMATION Redacted PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "JH4CL96884C"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/02/2021",
        "dateOfIncident": "10/13/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442376,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "This vehicle was taken in for a recall for a corrosive ECM.  1 hour prior to taking this vehicle in my assigned service writer gave me a call, your vehicle is ready for pick up. I was advised due to their visual inspection of the ECM( Electronic control module)(electrical computer) not having corrosion, they will not change the unit but they have decided to replace the cover on the unit.  I've filed a concerning complaint to Acura headquarters due to  my knowledge of cars to have it on file what was told to me before receiving the vehicle.  Due to my knowledge a faulty ECM can trigger numerous faults within the vehicles performance.Prior to bringing the vehicle to the dealership, I've been experiencing heavy misfires, poor radio connection, no interior lights and triggered headlights. I've replaced the necessary mechanics that would normal be the cause of these issues and the problem was still existing. The last option was the ECM,which fueled my search of a recall on these models for a faulty ECM. A few weeks later I've contacted another dealership in hopes they would take care of the problem, the representative was polite and reassured me the recall was suppose to be replaced with a new unit under manufacturer policy. However this could not be done because the previous dealer has marked the vehicle as a completed task.  So I filed another complaint and have not received any further notice regarding my concern.  A few weeks later I had the vehicle diagnosed and realized the ECM was never replaced nor removed out of the vehicle for inspection. Pictures and video where taken of this unit,as you can see the build up of dirt and dust from its original installment back in 2004. Later reading the review of that specific dealership, I've learned their has been numerous complaints regarding poor service at that locations service department.",
        "vin": "Jh4cl96854c"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/15/2021",
        "dateOfIncident": "09/01/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436972,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "Power Steering Hose Leak. I took my vehicle in to have the oil changed and mechanics noticed a power steering leak. The mechanic looked up any recalls on my vehicle and noted this was a previous recall. Upon searching, 2010 there was a bulletin that went out, and the car was taken in 2010 and inspected and released. Upon further searching the other day there was a 2018 release and update of the same bulletin, which I never received. Regardless of it being inspected in 2010 and being cleared to drive, it seems this issue ultimately ended up happening, just now, instead of 2010. When I contacted Acura they said there are no current vin associated recalls on my vehicle. My issue is, just because it was 10 years ago w/no issue doesn’t mean the issue doesn’t exist today, which it does. I’ve gotten no help from Acura on this. Any information you can provide would be appreciated. Thank you.",
        "vin": "JH4CL96814C"
    },
    {
        "components": "SUSPENSION,ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/27/2021",
        "dateOfIncident": "08/26/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430707,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "My headlights always flicker and turn off everytime i drive within 5 minutes of driving. it gets really bad when i drive in cold/wet weather and i’ve replaced the bulbs a good 5 times. Something is wrong with my suspension i think? my VSC and warning light always automatically come and stay on and my car makes a noise everytime i turn/reverse. My car continues to start smoking when i drive, especifically on hot days and multiple mechanics have said i have a severe oil leak/power steering leak and i’ve gone to 3 within the last 6 months. So i’m not sure what to do and i seen the recalls on all of the things i listed above for my model of car just not specifically for my vin number. please help.",
        "vin": "JH4CL96844C"
    },
    {
        "components": "STEERING,SUSPENSION,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/06/2021",
        "dateOfIncident": "03/14/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415482,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY CAR AND ALL OF A SUDDEN IT WAS HARD TO STEER THE CAR",
        "vin": "JH4CL96884C"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/30/2021",
        "dateOfIncident": "12/30/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390747,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN DRIVING MY CAR A NUMBER OF TIMES AND ESPECIALLY WHEN ITS BEEN RAINING MY CAR WOULD TURN OFF AND THE LIGHTS WOULD START FLASHING AND THE VSA CONTROL LIGHTS WOULD COME ON. IT SCARED THE LIFE OUT OF ME. ITS HAPPENED ON THE HIGHWAY A FEW TIMES AND REGULAR DRIVING ON THE ROADS.  I HAVE ALSO BEEN DRIVING AND DEPRESSED THE ACCELERATOR AND THE ACCELERATOR SEEMED TO STAY PRESSED DOWN. THE CAR WAS IN MOTION. THERE MUST BE ELECTRICAL ISSUES, ALSO MY RADIO TENDS TO STOP WORKING AND THEN COMES ON RANDOMLY WHEN IT FEELS LIKE IT.  I HAVE ASKED HONDA BEFORE AND THEY SAID THERE WAS NO RECALLS. THERE SEEMS TO MANY ELECTRICAL PROBLEMS CONNECTED TO THE VSA. I ALSO FOUND AT TIMES THE CARPETS WET IN THE FRONT AND THE CAR DOESN'T LEAK THAT I KNOW OF.  I WISH ACURA WOULD HONOR THEIR RECALLS AND NOT PUT PEOPLES LIVES IN DANGER. IF SOMETHING DOES HAPPEN. I WANT IT DOCUMENTED AND THERE WILL BE ACTION TAKEN IF THEY DO NOT FIX MY ISSUES.",
        "vin": "JH4CL96884C"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/21/2020",
        "dateOfIncident": "06/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350669,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 ACURA TSX. THE CONTACT STATED THAT THE VEHICLE STARTED HOWEVER, FAILED TO ACCELERATE WHILE DRIVING WITH THE CHECK ENGINE AND THE VEHICLE ASSIST WARNING LIGHTS ILLUMINATED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THAT THE ECU NEEDED TO BE REPLACED. THE TECHNICIAN RECOMMENDED, PURCHASED AND REPAIRED VEHICLE WITH A USED ECU, DUE TO THE AGE OF THE VEHICLE. THE CONTACT STATED THAT THE VEHICLE'S PERFORMANCE IMPROVED AFTER THE REPAIRS HOWEVER, THE WARNING LIGHTS REMAINED ILLUMINATED. THE TECHNICIAN THEN TOLD THE CONTACT THAT THE VEHICLE WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 13V093000 (ENGINE AND ENGINE COOLING, ELECTRICAL SYSTEM) AND TOLD THE CONTACT TO CALL THAT MANUFACTURER. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND STATED THAT THE USED ECU VOIDED THE RECALL. THE CONTACT WAS ALSO TOLD THAT THE VEHICLE HAD NOT BEEN SERVICED BY AN ACURA DEALER SINCE 2012, TO WHICH THE CONTACT STATED THAT HIS SON TOOK THE VEHICLE TO AN UNKNOWN DEALER FOR NHTSA CAMPAIGN NUMBER: 10V174000 (STEERING) AND NHTSA CAMPAIGN NUMBER: 04V429000 (EXTERIOR LIGHTING) RECALL REPAIRS IN 2011 AND 2012 RESPECTIVELY. THE CONTACT STATED THAT HE WAS NOT NOTIFIED OF ANY OTHER RECALLS AND THAT SINCE THE WARRANTY EXPIRED, HE UTILIZED THE SERVICES OF AN INDEPENDENT MECHANIC, TO CUT COSTS.  THE VEHICLE WAS REPAIRED.  THE FAILURE MILEAGE WAS 118,000.",
        "vin": "JH4CL96894C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/14/2020",
        "dateOfIncident": "07/13/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11339282,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 ACURA TSX: I SAT IN MY CAR IDLE FOR ABOUT 15 MINUTES TO EAT. WHEN I PUT MY CAR IN REVERSE TO BACK OUT OF A PARKING SPOT, THE PASSENGER SIDE CURTAIN AND SEAT AIRBAGS SUDDENLY DEPLOYED. WITHIN 5 SECONDS THE DRIVER SIDE DEPLOYED. THESE CREATED THE LOUDEST NOISE I HAVE EVER HEARD IN MY ENTIRE LIFE. I QUICKLY PUT THE CAR BACK IN PARK AND JUMPED OUT AS THE CAR WAS FILLED WITH A DUSTY CLOUD. THIS CAR HAS BEEN SERVICED AT AN ACURA DEALERSHIP EVERY 5,000 - 6,000 MILES SINCE I HAVE OWNED IT.",
        "vin": "JH4CL96864C"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/02/2020",
        "dateOfIncident": "04/29/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323008,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I DRIVING THE CAR, EITHER STREET OR HIGHWAY , THE CAR SLOWS DOWN OR LOSE HORSEPOWER. I COULD BE DOING 60 ON THE HIGHWAY AND THE CAR STALLS ON IT'S OWN ALMOST SHUTTING DOWN.",
        "vin": "JH4CL96814C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/15/2019",
        "dateOfIncident": "11/14/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11280411,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 11/14/2019 TOOK MY CAR INTO BRADSHAW ACURA DEALER SHIP FOR THE ECM/ PCM CORROSIN RECALL #13-014 AND THEY REFUSE TO DUE THE RECALL EVEN THO MY ECU HAS CORROSIN ON IT AND EXPLAINED TO THE SERVICE ADVISOR CORY THAT I WAS DRIVING THE CAR AND IT STALLED OUT. TOOK THE CAR TO MY MECHANIC AND EVERTING IS IN GOOD AND WORKING CONDITION BUT WHEN HE LOOKED AT THE ECU AND SAW ALL THE CORROSION. ON IT HE SAID THIS HAS TO BE THE PROBLEM AND I TOLD THE SERVICE ADVISOR THIS AND THEY REFUSE TO DO THE RECALL AND REPLACE THE PCM",
        "vin": "JH4CL968X4C"
    },
    {
        "components": "STEERING,AIR BAGS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/15/2019",
        "dateOfIncident": "03/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11196431,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR LEAKING POWER STEERING FLUID AND SMOKING UNDERNEATH ENGINE, KEEP HAVING PROBLEMS WITH THE BRAKING SYSTEM AND I SAW RECALLS ON 2004 -2008 MODELS AND AIR BAG ICON ALWAYS ON",
        "vin": "JH4CL96804C"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/02/2018",
        "dateOfIncident": "04/22/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11115452,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PROBLEM: WHEN IT IS HOT THE CAR START LOSING POWER, AND VSA LIGHT COMES UP. THEN THE GAUGE CLUSTER START DOING INTERMITTENT SHUTDOWNS OF THE RPM AND SPEEDOMETER GAUGES. ADDITIONAL TO THAT, THE A/C SHUT DOWN AND BLOW HOT AIR.     ACURA DIAGNOSTIC: JOHN EAGLE ACURA HAD THE CAR TO CHECK THE PROBLEM. DURING THE TEST IN HOT TEMPERATURE, THEY FOUND THERE IS A PROBLEM OF ECU COMMUNICATION IN THE F-CAN. THERE ARE 3 MAIN THINGS THAT COMMUNICATE WITH ECU THOUGH THE F-CAN: ONE IS THE GAUGE CLUSTER WHICH I REPLACED, THE SECOND WAS THE VSA MODULATOR WHICH WAS DISCONNECTED TO TEST, AND THE THIRD ONE WAS THE RADIO SYSTEM THAT WAS ALSO DISCONNECTED, AND THE RESULTS WERE THE SAME (DAMAGED). ACCORDING TO ACURA ENGINEERS, AFTER PROCEEDING WITH ALL THESE STEPS THE SOLUTION IS REPLACING ELECTRONIC CONTROL UNIT (ECU).    ACURA FAKE RECALL: LAST DECEMBER I TOOK MY CAR TO AN ACURA DEALER BECAUSE THERE WAS A BULLETIN FOR A RECALL FOR ACURA TSX; THIS RECALL WAS ABOUT ECU CORROSION AND IT SPECIFICALLY SAY THAT IT IS GOING TO BE DETAILED CHECKED AND TESTED AND IF ANY PROBLEM WAS PRESENTED IT COULD ALSO BE REPLACED WITHOUT NO COST. WELL, WHAT THEY DID WAS PUT A PIECE OF PLASTIC COVER ON TOP OF THE ECU TO COVER THE CORROSION THAT THE ECU ALREADY HAD, AND 4 MONTH LATER THESE PROBLEMS COME UP. THEREFORE, I CALLED ACURA AND ASK THEM TO MAKE A FOLLOW UP OF THIS RECALL AND WHAT THEY ANSWER WAS THAT THE RECALL WAS ALREADY DONE, AND THEY CANNOT DO THE RECALL TWICE AND THAT THEY FEEL REALLY SORRY.     CONCLUSION: ACURA DO NOT WANT TO ASSUME ANY RESPONSIBILITY FOR THEIR PROBLEMS AND THEY WANT TO STILL HIDING PROBLEMS THAT THEY HAVE WITH THEIR VEHICLES.    PLEASE SEE ATTACHED ACURA DIAGNOSTIC.    I WOULD REALLY APPRECIATE YOUR HELP IN THIS MATTER TO AVOID OTHER PERSONS GETTING THIS HORRIBLE EXPERIENCE.",
        "vin": "JH4CL96974C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/27/2018",
        "dateOfIncident": "07/01/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11114175,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SAFETY RESTRAINT LIGHT STAYS ON AT 155,000 MILES. FOR AIRBAGS",
        "vin": "JH4CL96934C"
    },
    {
        "components": "STEERING,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/22/2018",
        "dateOfIncident": "04/17/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11097249,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 ACURA TSX. WHILE DRIVING 35 MPH, THE STEERING WHEEL SEIZED AND AN ABNORMAL NOISE WAS HEARD. THE CONTACT STATED THAT THE STEERING WHEEL BECAME DIFFICULT TO MANEUVER. THE AIR BAG WARNING INDICATOR ILLUMINATED SPORADICALLY WHILE DRIVING, WHICH WAS A SAFETY CONCERN. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC, BUT WAS NOT DIAGNOSED OR REPAIRED. THE CONTACT WAS INFORMED OF NHTSA CAMPAIGN NUMBER: 10V174000 (STEERING), WHICH WAS STILL AN OPEN RECALL ON THE CONTACT'S VEHICLE. THE DEALER AND MANUFACTURER WERE NOT CONTACTED. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "JH4CL96824C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/30/2018",
        "dateOfIncident": "03/15/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11065879,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER AIRBAG DEPLOYED WHILE DRIVING AT A SPEED OF 35 MPH",
        "vin": "JH4CL96884C"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/01/2017",
        "dateOfIncident": "07/01/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11012205,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MY STEERING IS HARD",
        "vin": "JH4CL96854C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/01/2017",
        "dateOfIncident": "01/18/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10957846,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING UP TO ORLANDO AT PROBABLY 80 MPG AND PASSENGER CURTAIN AND PASSENGER SEAT AIR BAG DEPLOYED BY ITSELF ......IT REALLY SCARED ME BUT THER WAS NO DAMAGE TO EXTERIOR BUT THE INSIDE ROOF AND LEATHER SEAT WHERE DAMAGED.....",
        "vin": "JH4CL95994C"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/29/2016",
        "dateOfIncident": "08/16/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10899247,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING AND SERVICE ENGINE LIGHT CAME ON AND ENGINE SHUT OFF, HAD TO COAST TO SIDE OF 4 LANE ROAD, AND WON'T RESTART, HAD TOWED TO BIG AL'S @ 1408 N GEORGE WASHINGTON HWY. CHESAPEAKE, VA. 23323. PHONE # (757)485-9117. MECHANIC VINNEY DID SEVERAL TEST, AND REPORTED IT WAS THE ECM UNIT OR HOUSING WAS BAD AND MADE A COPY OF THE RECALL ON 2004-2008 ACURA TSX, SINCE IT WAS WHAT THE CODES INDICATED. ACURA MANUFACTURING SAID THIS CAR IS NOT ON RECALL, THE CAR DID JUST CUT OFF, JUST AS ON NHTSA CAMPAIGN # 13V093000. WOULD LIKE TO SEE IF IT IS RELATED TO RECALL.",
        "vin": "JH4CL96944C"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/11/2016",
        "dateOfIncident": "07/13/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10895002,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "CENTER STACK HVAC LIGHTS HAVE STOPPED WORKING. I'VE READ COUNTLESS THREADS & FORUMS THAT STATE THIS IS A KNOWN ISSUE.IT DOES POSE A SAFETY ISSUE, I'M NOT SURE WHY THIS HAS NOT BEEN RECALLED YET. THE WARRANTY WAS EXTENDED, HOWEVER, NO ONE WAS NOTIFIED & I PURCHASED THIS CAR AFTER THE WARRANTY PERIOD EXPIRED FOR THE CENTER CONSOLE LIGHTS. THEY STOPPED WORKING AT 106K MILES.    IN THE DAYTIME OR DARK YOU CANNOT READ THE CLIMATE CONTROL OR RADIO CONTROL OR CLOCK DISPLAY. YOU CONSTANTLY FIDGET IN THE DARK TRYING TO SEE IF YOU'RE PRESSING THE PROPER BUTTON TO DEFROST WINDOWS OR TURN THE HEAT OR AIR ON. TAKING YOUR EYES OFF THE ROAD TO FIDGET WITH YOUR BROKEN RADIO IS THE SAME THING AS TAKING YOUR EYES OFF THE ROAD FOR A CELL PHONE. WHY IS THIS NOT A RECALL YET?    ONLY OPTION IS TO PAY OUT OF POCKET $1200 FOR A KNOWN FAULT IN THEIR DESIGN. PART TO REPLACE YOURSELF HAS BEEN DISCONTINUED. RECALL NEEDED.",
        "vin": "JH4CL96854C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/16/2016",
        "dateOfIncident": "06/06/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10874678,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA AIRBAG: THE 2004 TSX ACURA SIDE AIRBAG INFLATED WHILE THE CAR PARKED. AS SOON AS MY SON ENTERED THE CAR HE SAID IT SOUNDED LIKE SOMEONE THREW A BRICK AT THE WINDOW. AND THEN THE AIRBAG DEFLATED HITTING HIM ON THE SIDE OF HIS FACE. IT FRIGHTENED HIM.  HE DROVE IT TO KAREN RADLEY ACURA DEALERS AND THEY TOLD HIM IT WAS NOT A DEFECT.  I SPOKE TO THE GENTLEMAN AND SAID IT HAD TO BE A DEFECT BECAUSE NOTHING CAUSED IT TO DEFLATE. I HAVE PICTURES TO SHOW THERE WAS NO IMPACT. THE DEALERSHIP WANT TO CHARGE ME $3100 FOR THE REPAIR WORK.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/09/2016",
        "dateOfIncident": "06/07/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10873365,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL   UPON GETTING IN THE VEHICLE I SIMPLY SAT IN THE DRIVER SEAT, AND CLOSED THE DOOR. AS SOON AS THE DOOR SHUT CLOSED, THE DRIVER SIDE CURTAIN AIR BAG DEPLOYED HITTING ME IN THE HEAD NECK AND SHOULDER AREA. TRIGGERING ME TO HAVE MUSCLE SPASMS IN MY BACK, SEVERE HEAD ACHE, AND TO BE DISORIENTED AFTER BEING STRUCK SO ABRUPTLY AND WITH OUT WARNING.  THE VEHICLE WAS STILL PARKED, I HAD NOT EVEN HAD AN OPPORTUNITY TO PUT THE KEYS IN THE IGNITION. THE CAR HAS NOT BEEN IN AN ACCIDENT, THERE WAS NO DAMAGE TO THE VEHICLE, IR ANY REASON FOR THE AIRBAG TO DEPLOY. I TOOK THE CAR TO THE DEALERSHIP TO HAVE THIS MANUFACTURER DEFFECT FIXED. AT THE DEALER I WAS TOLD THAT THEY WILL NOT COVER IT AS A MANUFACTURER DEFFECT, AND WILL COST ME $3100.00 TO FIX. THE DEALERS WORDS TO ME WERE, \"AIR BAGS DO NOT JUST DEPLOY ON THEIR OWN.\" UPON FURTHER INVESTIGATION OF MY OWN IVE FOUND AT LEAST 25 OTHER COMPLAINTS OF PEOPLE WITH THE SAME MAKE AND YEAR MODEL WITH SIMILAR AIR BAG ISSUES.",
        "vin": "JH4CL96884C"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "04/08/2016",
        "dateOfIncident": "03/07/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10854324,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIRBAG OR SRS LIGHT IS CONSTANTLY ON INDICATING THAT IT WILL NOT DEPLOY IN AN ACCIDENT. THIS HAPPENS AFTER STARTING THE ENGINE. THE REASON APPEARS TO BE A FAILED ELECTRICAL COMPONENT IN THE SEAT BELT BUCKLE. THIS IS A MAJOR SAFETY ISSUE THAT IS AND HAS BEEN FACED BY A LOT OF TSX OWNERS. CONTACTED ACURA BUT THEY WILL NOT COVER ANYTHING, EITHER TO REPLACE THE COMPONENT OR EVEN TO DIAGNOSE THE EXACT ISSUE. THEIR POSITION IS: SEAT BELTS STILL WORK AND SO IT IS NOT A DEFECT. NOTE THAT THE AIRBAGS STILL WON'T DEPLOY WITH THIS PARTS DEFECT. THE DEALER CONCURS WITH ACURA. SINCE THIS IS A KNOWN AND WIDESPREAD REPORTED SAFETY ISSUE, ACURA SHOULD BE ASKED TO ISSUE A RECALL.",
        "vin": "JH4CL96914C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/29/2015",
        "dateOfIncident": "07/24/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10744557,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 ACURA TSX. WHILE AT A STOP LIGHT, THE PASSENGER SIDE CURTAIN AIR BAG DEPLOYED. THE VEHICLE WAS TOWED TO THE DEALER FOR DIAGNOSTIC TESTING. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 140,000.",
        "vin": "JH4CL96844C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/23/2015",
        "dateOfIncident": "07/14/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10736077,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN A NORMAL STREET AT 5:00PM WITH THE FRONT WINDOWS DOWN. WITH NO PRIOR INDICATION OR WARNINGS THE SIDE IMPACT AIR BAG DEPLOYED WITH A DISORIENTING \"POP\", VIOLENTLY PUNCHING ME IN THE LEFT ARM. THIS CAUSED MY CAR TO SWERVE, BUT I WAS ABLE TO MAINTAIN CONTROL AND AVOIDED ANY ACCIDENTS. BY ALL ACCOUNTS, I WAS LUCKY; THIS COULD HAVE BEEN MUCH WORSE.  *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/21/2015",
        "dateOfIncident": "02/05/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10735491,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 ACURA TSX. WHILE DRIVING AT VARIOUS SPEEDS, THE BRAKE WAS DEPRESSED MULTIPLE TIMES IN ORDER TO SLOW DOWN THE VEHICLE. THE VEHICLE STABILITY ASSIST WARNING LIGHT WAS ILLUMINATED. THE FAILURE RECURRED CONSTANTLY. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC, WHERE IT WAS DIAGNOSED THAT THE BRAKE MASTER CYLINDER NEEDED TO BE REPLACED. THE VEHICLE WAS SERVICED BUT THE REMEDY FAILED TO REPAIR THE ISSUE. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VIN WAS UNKNOWN. THE APPROXIMATE FAILURE MILEAGE WAS 160,000.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/18/2015",
        "dateOfIncident": "01/15/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10695070,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 ACURA TSX. WHILE DRIVING APPROXIMATELY 20 MPH, THE VEHICLE FAILED TO ACCELERATE AND THE INSTRUMENT PANEL ILLUMINATED. IN ADDITION, THE CONTACT STATED THAT THE VEHICLE STALLED. THE VEHICLE WAS TAKEN TO A DEALER. THE TECHNICIAN DIAGNOSED THAT THE ELECTRONIC CONTROL UNIT AND POWER TRAIN CONTROL MODULE NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND STATED THAT THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 13V093000 (ELECTRICAL SYSTEM, ENGINE AND ENGINE COOLING). THE FAILURE MILEAGE WAS 108,000.",
        "vin": "JH4CL96844C"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/08/2014",
        "dateOfIncident": "10/06/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10643219,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING RACK IS POPPING LOUDLY AND RAPIDLY GOING OUT. CAR IS BARELY 100K. I'VE SEEN SEVERAL REPORTED CASES WHERE THE STEERING RACK REQUIRES REPLACING IN THIS MODEL VEHICLE AND ALL CASES WERE AT OR BELOW 100K. THIS IS CERTAINLY A SAFETY ISSUE AND SEVERAL ACURAS HAVE THIS ISSUE AND THERE ARE A FEW RELATED TSBS FOR POWER STEERING, BUT NO RECALL OR FURTHER ACTION HAS BEEN TAKEN TO DATE. THIS IS AN EXPENSIVE ISSUE THAT REQUIRES ATTENTION. NO VEHICLE'S STEERING OR RELATED PARTS SHOULD FAIL SO SOON. IT'S UNREALISTIC TO HOPE FOR A VEHICLE THAT LASTS FOREVER, BUT A RECALL WARRANTY TO 150K SHOULD BE ISSUED.   *TR",
        "vin": "JH4CL958X4C"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/01/2014",
        "dateOfIncident": "06/09/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10607386,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "IT WAS 930 AT NIGHT I WAS DRIVING MY CAR HOME TO DROP OFF GOING ON VACATION ..MY CAR STARTED STALLING OUT AND ALL LIGHTS WENT OUT.. AS I BRAKE MY CAR JUMPED 3 TO 5 FEET.. IT WAS LIKE THE BRAKES SURGED .. LIGHTS FLASHING .. VERY DANGEROUS BECAUSE IF I WOULD OF BEEN ON MY WAY TO WORK ON FREEWAY I COULD OF BEEN IN A DANGEROUS ACCIDENT.. THE CAR DID NOT STOP WHEN APPLIED THE BRAKE INSTEAD IT ACTED LIKE I WAS PUSHING THE ACCELERATOR... I HAD TO SHUT CAR  OUT PUT IN NEUTRAL AND HAVE IT PUSHED IN MY GARAGE TO PREVENT GOING THROUGH WALL... I NEVER HEARD OF A ALTERNATOR DOING THIS.. MY CAR WAS JUST AT DEALERSHIP APROX 3 WKS BEFORE THAT FOR A RECALL .. (STALLING )   THEY SAID IT WAS NOT RELATED TO THAT...  *TR",
        "vin": "JH4CL96834C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/15/2014",
        "dateOfIncident": "05/15/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10588530,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "CENTER STACK LIGHTS OUT (RADIO, HEATER/AC UNIT) ACCORDING TO INTERNET RESEARCH MANY OTHER 2004 AND 2005 TSX OWNERS ARE EXPERIENCING THIS PROBLEM,  ALTHOUGH ACURA HAD ISSUED A SERVICE BULLETIN, AND SUPPOSEDLY INCREASED WARRANTY PERIOD TO 100K OR 7 YEARS, THERE WAS NO NOTIFICATION TO OWNERS. MY 2004 TSX BEGUN EXPERIENCING THE PROBLEM AT 120K SO THE EXTENDED WARRANTY WOULDN'T HAVE HELPED CONSUMERS EXPERIENCING THIS PROBLEM AFTER 100K MILES.  *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/13/2014",
        "dateOfIncident": "02/28/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10588163,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "SLID ON GRAVELS IN THE ROAD  HIT A FENCE   FRONT END DAMAGE REPLACE  BUMPER HEADLIGHT HOOD AND DRIVER PANEL REPLACED UNDERNEATH PROTECTIONS IN FRONT END OF CAR    AIRBAG LIGHT STAYS ON CONTINUALLY  CALLED DEALER SHIP SAID WAS NOT A RECALL ON THIS SAFETY ISSUE.  *TR",
        "vin": "JH4CL96884C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/13/2014",
        "dateOfIncident": "11/06/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10588172,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERIOR LIGHTING FOR RADIO AND TEMP CONTROL AND CLOCK SOME TIME THE WHOLE PANEL GOES OFF  BUT CONTROL LIGHTS FOR THE TEMPERATURE AND THE RADIO BUTTON LIGHTS HAVE NEVER CAME BACK ON SINCE THEY WENT OFF A COUPLE OF YEARS AGO  WE WERE TOLD THIS WAS A RECALL FOR THIS  CAR BUT THE DEALERSHIP REFUSES  TO FIX IT  OR ACKNOWLEDGE A RECALL   THIS COULD EASILY BE A SAFETY ISSUE WILL DRIVING AT NIGHT AND IS VERY FRUSTRATING.  *TR",
        "vin": "JH4CL96884C"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/30/2013",
        "dateOfIncident": "02/18/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10554202,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONSOLE LIGHTS (LIGHTS IN THE CENTER) WENT OUT IN 2009, WHICH IS A SAFETY CONCERN AS YOU NEED TO ATTEMPT TO READ THE CONTROLS VIA THE OVERHEAD LIGHT WHILE DRIVING, CAUSING A HUGE DISTRACTION. WE TOOK IT TO THE DEALER AND THEY WANTED $150 JUST TO DIAGNOSIS IT. RECENTLY WE LEARNED THAT ACURA EXTENDED WARRANTY SOME YEARS BACK TO FIX IT HOWEVER WE WERE NEVER NOTIFIED (WE ARE THE ORIGINAL OWNERS). NOW WE HAVE PASSED THE EXTENDED WARRANTY TIME (7 YEARS). WE FEEL IT'S A SAFETY CONCERN AND SHOULD HAVE BEEN NOTIFIED ABOUT THE ISSUE BY ACURA AND THAT AS SUCH ACURA SHOULD STILL BE LIABLE TO FIX THE PROBLEM. THANK YOU  *TR",
        "vin": "JH4CL96814C"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/08/2013",
        "dateOfIncident": "10/09/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10551483,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 ACURA TSX. THE CONTACT STATED THAT THE VSA WARNING LAMP ILLUMINATED WHICH MADE THE ABS SYSTEM ENGAGE ABNORMALLY. THE CONTACT MENTIONED THAT HE ATTEMPTED TO ENGAGE THE BRAKES BUT IT FAILED TO STOP THE VEHICLE. THE VEHICLE WAS NOT TAKEN TO THE DEALER. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 96,000 AND THE CURRENT MILEAGE WAS 101,274.",
        "vin": "JH4CL95894C"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "04/30/2013",
        "dateOfIncident": "03/22/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10510140,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING AT 45MPH AND HIT A POT WHOLE, INSTANTLY MY DRIVERS SIDE AIR BAGS DEPLOYED IN MY SEAT AND SIDE WINDOW PANEL.   *TR",
        "vin": "JH4CL96884C"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/29/2013",
        "dateOfIncident": "04/10/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10510004,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "CENTER DASHBOARD LIGHTS / CLIMATE CONTROL LIGHTS BLINKS AND GOES OFF AND STAYS OFF WHILE DRIVING. *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/21/2013",
        "dateOfIncident": "10/31/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10493688,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "HID BULB CANNOT BE REPLACED. MOISTURE IN THE HOUSING UNIT.  *TR",
        "vin": "JH4CL95974C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/27/2012",
        "dateOfIncident": "11/27/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10486249,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 ACURA TSX. THE CONTACT STATED THAT THE LIGHTING IN THE INSTRUMENT PANEL AND THE CENTER CONSOLE FAILED. THE CONTACT STATED THAT WHILE DRIVING VARIOUS SPEEDS, EVERY SINGLE ELECTRICAL COMPONENT FAILED WITHOUT WARNING.  THE VEHICLE WAS TAKEN TO A DEALER FOR INSPECTION WHERE THEY ADVISED THE CONTACT THAT THE CIRCUIT BOARD NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 100,000.",
        "vin": "JH4CL96874C"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/25/2012",
        "dateOfIncident": "08/01/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10482210,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 ACURA TSX. THE CONTACT STATED THAT SHE NOTICED THAT HER VEHICLE WAS LEAKING OIL. THE CONTACT STATED THAT THE DRIVER WAS PUTTING 2 QUARTS OF OIL IN THE VEHICLE APPROXIMATELY 2 TIMES A DAY. THE VEHICLE WAS TAKEN TO HER MECHANIC FOR DIAGNOSIS. THE TECHNICIAN ADVISED HER THAT THE BEARINGS IN THE TRANSMISSION WERE LOOSE AND THE TRANSMISSION NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS CONTACTED AND THEY OFFERED NO ASSISTANCE. THE FAILURE MILEAGE WAS APPROXIMATELY 147,000. THE CURRENT MILEAGE WAS APPROXIMATELY 148,000.   UPDATED 4/4/13 *CN",
        "vin": "JH4CL96874C"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/14/2012",
        "dateOfIncident": "06/20/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10465625,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIR CONDITIONING COMPRESSOR STOPPED WORKING. ACURA WILL NOT DISCUSS THE PROBLEM WITH ME SINCE THERE IS A CLASS ACTION SUIT FOR THIS ONGOING PROBLEM FOR THIS YEAR AND MODEL.WE UNDERSTAND THAT WE CAN GET 60%.   BACK IF WE FIX IT A ACURA OR HONDA DEALERSHIP.IF THEY ARE AWARE OF THIS MALFUNCTION FOR THIS YEAR AND MODEL  THEY SHOULD PAY THE WHOLE COST. WE HAVE HAD 5 HONDA CARS AND HAVE BEEN VERY LOYAL CUSTOMERS.   *TR",
        "vin": "JH4CL96834C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/28/2012",
        "dateOfIncident": "04/03/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10456767,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG WARNING LIGHT COMES ON INTERMITTENTLY INDICATING SIDE AIR BAG.  DOES NOT INDICATE WHICH SIDE. HAPPENS WITH OR WITHOUT PASSENGER.    INTERNET SEARCH REVEALED SEVERAL MENTIONS OF THE SAME.  THERE ARE NO TSBS. *TR",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/29/2012",
        "dateOfIncident": "02/24/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10449701,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 ACURA TSX. WHILE PARKED, THE CONTACT NOTICED THAT THE TAIL LIGHTS WERE NOT ILLUMINATING. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSTICS WHERE THE TECHNICIAN STATED THERE WAS A RECALL UNDER NHTSA CAMPAIGN ID NUMBER: 04V429000 (EXTERIOR LIGHTING:TAIL LIGHTS) IN WHICH THE VEHICLE WAS INCLUDED. AFTER INSPECTING THE VEHICLE THE TECHNICIAN STATED THE VEHICLE WOULD NOT BE COVERED UNDER THE RECALL BECAUSE THE PART HAD BEEN TAMPERED WITH AND DAMAGED BECAUSE OF INADEQUATE PROTECTION. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 140,000.",
        "vin": "JH4CL96884C"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "02/28/2012",
        "dateOfIncident": "02/15/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10449645,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR TIRE & RUBBER CO",
                "productModel": "EAGLE GT II",
                "productYear": "9999",
                "size": "P275/60R15",
                "type": "Tire"
            }
        ],
        "summary": "GOODYEAR EAGLE RESPONSEEDGE TIRES WORE DOWN TO THE WEAR BARS IN LESS THAN 32000 MILES.  SEEMS THE TIRE RATING FOR THIS TIRES IS OFF BY AT LEAST 40%. I WAS TOLD BY GOODYEAR THAT IT HAS NO MILEAGE WARRANTY.  AMAZING A SIMPLE INTERNET SEARCH PROVIDES THE DOC.  YOUR FORM DOES NOT LIST THIS TIRE AS AN OPTION.  *TR",
        "vin": "JH4CL96864C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/28/2011",
        "dateOfIncident": "09/24/2011",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10427747,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 ACURA TSX. THE CONTACT STATED THAT WHILE DRIVING 30 MPH THE VEHICLE STALLED AND THE VSA LAMP, CHECK ENGINE LAMP AND AN ERROR MESSAGE DISPLAYED ON THE INSTRUMENT PANEL. THE VEHICLE WAS TOWED TO A LOCAL REPAIR SHOP, WHO DIAGNOSED THAT THE CAM SHAFT AND TIMING CHAIN WERE DEFECTIVE. THE CONTACT WAS ADVISED TO CONTACT AN AUTHORIZED DEALER. THE VEHICLE WAS TAKEN TO THE DEALER, WHO WAS UNABLE TO DIAGNOSE THE FAILURE, BUT STATED THAT THE TIMING CHAIN MAY HAVE BEEN STRETCHED. THE CONTACT WAS ADVISED TO REPLACE THE ENGINE. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGES WERE 125,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/05/2011",
        "dateOfIncident": "09/03/2011",
        "fire": true,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10423784,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "FIRE UNDER THE HOOD WHILE DRIVING AROUND 40 MPH ABOUT 5 MILES FROM HOME. HEARD A SQUEAKY SOUND AROUND THE STEARING WHEEL MINUTES EARLIER.   I DO NOT KNOW WHAT COMPONENET FAILED BUT HAD A RECALL SOMETIME AGO THAT WAS REPAIRED. HAD OIL CHANGE EXACTLY A WEEK EARLIER.  NO BODY INJURED.  *TR",
        "vin": "JH4CL96994C"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "08/09/2011",
        "dateOfIncident": "07/27/2011",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10418214,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 ACURA TSX.   THE CONTACT WAS DRIVING 15 MPH WHEN THE AIR CONDITIONER COMPRESSOR EXPLODED. THE DEALER DIAGNOSED THAT THE COMPRESSOR WOULD NEED REPLACING, AS THE AIR CONDITIONER WAS NO LONGER OPERABLE.  THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE AND THE VEHICLE WAS NOT REPAIRED.  THE FAILURE MILEAGE WAS 59,900 AND THE CURRENT MILEAGE WAS 60,000. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/27/2011",
        "dateOfIncident": "07/01/2011",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10415924,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 ACURA TSX. CONSUMER SENT CORRESPONDENCE RELATED TO POWER STEERING FLUID LEAK AND SAFETY RECALL *TGW  THE CONSUMER STATED UNFORTUNATELY THE SAFETY RECALL NOTICE SHE RECEIVED ARRIVED SIX MONTHS TOO LATE. *JB  THE CONSUMER NEVER STATED IF THE VEHICLE CAUGHT ON FIRE. CONSUMER DID NOT RETURN PHONE CALL.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/01/2011",
        "dateOfIncident": "01/17/2011",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10379874,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 ACURA TSX PASSENGER SIDE CURTAIN AND SEAT AIRBAGS DEPLOYED WITH NO COLLISION OR CONTACT, BOTH ACURA DEALERSHIP, INDEPENDENT DEALER AND USAA INSURANCE VERIFIED YET NEITHER ACURA OR INSURANCE WILL PAY FOR REPAIRS. AIRBAGS DEPLOYED WHILE MAKING A RIGHT HAND TURN FROM A COMPLETE STOP. NO EVIDENCE OF IMPACT OR DAMAGE ANYWHERE ON VEHICLE TO INCLUDE UNDERCARRIAGE. SIMILAR COMPLAINTS ON NHTSA AND ON THE INTERNET FOR THIS YEAR, MAKE AND MODEL.  *LN",
        "vin": "JH4CL96884C"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "01/10/2011",
        "dateOfIncident": "09/16/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10376132,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS INVOLVED IN A SIX VEHICLE ACCIDENT IN WHICH I REAR ENDED ANOTHER VEHICLE GOING AT A SPEED OF ABOUT 55 MPH, I HAD MAJOR FRONT END DAMAGE WHICH LED TO MY CAR BEING TOTALED.  DURING THE ACCIDENT, MY PASSENGER SEAT AIRBAG DEPLOYED (WITH NO ONE SITTING IN THE SEAT) AND MY DRIVER SIDE AIRBAG DID NOT DEPLOY.  THE SEAT BELT EXTENDED SO FAR THAT I HIT MY CHEST AGAINST THE STEERING, WHICH TELLS ME IT DID NOT LOCK.  I NOTIFIED HONDA CONCERNING THIS ISSUE, THEY HAD AN INSPECTOR COME OUT, JUST TO TELL ME THAT MY CAR WAS \"SMART, BUT STUPID\" THAT IT IS NOT UP TO SAFETY CODE FOR TODAY, BUT IT WAS AT THE TIME IT WAS RELEASED IN 2004!  THIS IS COMPLETELY ABSURD TO ME.  I'VE OBTAIN OTHER OPINIONS IN THE MATTER AND THEY AGREE AS WELL.  AFTER READING OTHER COMPLAINTS CONCERNING THIS PROBLEM, I BELIEVE THIS SHOULD HAVE BEEN INVESTIGATED FURTHER.  NOT SIMPLY SWEPT UNDER THE RUG OR THE STATEMENT MADE \"THE CAR DID WHAT IT WAS SUPPOSE TO DO\".  OBVIOUSLY IT DID NOT.  PEOPLE COULD HAVE BEEN KILLED.  AND I WILL BE GOING FURTHER WITH MY COMPLAINT.",
        "vin": "JH4CL96884C"
    },
    {
        "components": "ELECTRICAL SYSTEM,INTERIOR LIGHTING,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "12/22/2010",
        "dateOfIncident": "12/12/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10372138,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "CENTRE STACK LIGHTS OUT (RADIO, HEATER/AC UNIT)  ACCORDING TO INTERNET RESEARCH MANY OTHER 2004 AND 2005 TSX OWNERS ARE EXPERIENCING THIS PROBLEM.  THE PROBLEM APPEARS TO BE A KNOWN DEFECT IN THE PRINTED CIRCUT BOARD.  ALTHOUGH ACURA HAD ISSUED A SERVICE BULLETIN, AND SUPPOSEDLY INCREASED WARRENTY PERIOD FTO 100K OR 7 YEARS, THERE WAS NO NOTIFICATION TO OWNERS.  MY 2004 TSX BEGUN EXPERIENCING THE PROBLEM AT 123K, SO I'M OUT OF WARRANTY, AND WILL MOST LIKLY HAVE TO FORK OVER $2,400 TO HAVE THE CENTER STACK REPLACED.  THE NHTSA NEEDS TO INVESTIGATE THIS MATTER AND FORCE ACURA TO REPLACE FOR FREE AS THE PROBELM APPEARS TO PRESENT ITSELF SHORTLY AFTER THE WARRANTY PERIOD.  *TR",
        "vin": "JH4CL96814C"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/10/2010",
        "dateOfIncident": "11/18/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10370204,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING I NOTICE THAT THE POWER STEERING STARTED TO GET STIFF.  WHILE DRIVING FURTHER THERE WAS NO POWER STEERING AT ALL.  TURNING WAS EXTREMELY HARD.   THE HOSE WAS JUST REPLACED DUE TO A RECALL, 3 MONTHS LATER POWER STEERING PUMP WAS SEALED DUE TO A LEAK, A MONTH LATER POWER STEERING WENT OUT.  THIS WAS LEAST EXPECTED ESPECIALLY WHEN HAVING THOSE SERVICES DONE WHICH POSES A SAFETY ISSUE.  I TOOK IT TO THE ACURA DEALERSHIP AND TOLD ME THAT STEERING RACK IS LEAKING FROM SEALS AND NEED TO BE REPLACED.  I DON'T THINK THIS TYPE OF MALFUNCTION SHOULD HAPPEN TO A CAR OF THIS AGE AND MILEAGE.",
        "vin": "JH4CL96874C"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/10/2010",
        "dateOfIncident": "12/01/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10370229,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 ACURA TSX. CONSUMER WRITES REGARDING A SMALL POWER STEERING LEAK *TGW",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,INTERIOR LIGHTING,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "11/04/2010",
        "dateOfIncident": "04/01/2008",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10364052,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "08L14-E09-200",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "I BOUGHT MY 2004 ACURA TSX CAR IN JAN 2008 A FEW MONTHS LATER AFTER I BOUGHT IT  THE INTERIOR LIGHTING OF MY RADIO AND A/C BUTTONS WERE NOT TURNING ON ANYMORE MY WARRANTY WAS ALREADY OVER AND EVER SINCE I HAVE BEEN TRYING TO FIND A SOLUTION OR A RECALL.  *TR",
        "vin": "JH4CL96814C"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/02/2010",
        "dateOfIncident": "01/15/2007",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10363671,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 ACURA TSX.  THE CONTACT WAS DRIVING APPROXIMATELY 40 MPH WHEN THE VEHICLE WOULD NOT SHIFT INTO MANUAL TRANSMISSION AND BEGIN EXHIBITING A LOUD, ABNORMAL NOISE. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER AND THE DEALER ADVISED THE CONTACT THAT THE TRANSMISSION WOULD NEED REPLACING. THE CONTACT STATED THAT THE TRANSMISSION WAS REPLACED THREE YEARS PRIOR AT 62,000 MILES. HE ALSO STATED THAT THE RADIO HAD FAILED AND WOULD NEED TO BE REPLACED FOR THE SECOND TIME AND THE AIR CONDITIONER ALSO NEEDED REPLACING FOR THE THIRD TIME.  THE VEHICLE WAS NOT REPAIRED. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 62,000 AND THE CURRENT WAS 118,000.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/30/2010",
        "dateOfIncident": "09/10/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10358408,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 ACURA TSX. WHILE DRIVING APPROXIMATELY 5 MPH, THE VSC AND CHECK ENGINE LIGHTS ILLUMINATED ON THE INSTRUMENT PANEL. THE VEHICLE THEN LOST SOME POWER SO THE CONTACT PULLED OVER. THE VEHICLE WAS SHUT OFF AND RESTARTED BUT THE CHECK ENGINE STAYED ILLUMINATED. THE VEHICEL WAS TAKEN TO A REPAIR SHOP BUT THE MECHANIC COULD NOT DIAGNOSE THE FAILURE AS THE CHECK ENGINE LIGHT WAS NO LONGER ILLUMINATED. 10 DAYS LATER, THE FAILURE OCCURRED AGAIN. THE VEHICLE WAS TAKEN BACK TO THE REPAIR SHOP WHERE THE CONTACT WAS INFORMED THAT THE APP SENSOR NEEDED TO BE REPLACED. THE VEHICLE HAD NOT BEEN REPAIRED. THE CURRENT AND FAILURE MILEAGES WERE APPROXIMATELY 96,000.   UPDATED 03/31/11",
        "vin": "JH4CL96824C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/21/2010",
        "dateOfIncident": "09/18/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10356721,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 ACURA TSX 61K MILES, COOLING SYSTEM FAILED COMPLETELY. I WAS JUST DRIVING LOCALLY WHEN I NOTICED A RATTLING NOISE. ON SOME INVESTIGATION I FOUND OUT THAT THE NOISE COMES ONLY WHEN THE A/C IS TURNED ON. TOOK IT TO A DEALER (POHANKA ACURA, CHANTILLY VA) AND THEY SAID SOME PART WITHIN A/C COMPRESSOR HAS EXPLODED AND THERE ARE METAL PIECES ALL OVER THE A/C SYSTEM AND THAT THE ENTIRE A/C SYSTEM NEEDS TO BE REPLACED AT A COST OF $4500.    THERE HAVE BEEN SIMILAR COMPLAINTS ALL OVER THE INTERNET FOR THE 2004 ACURA TSX'S. I PUT ON VERY LESS MILES ON THE CAR PER YEAR AND MAINTAINED IT PERFECTLY (PERIODIC MAINTENANCE, REGULAR OIL CHANGES). HOW CAN ACURA NOT ISSUE A RECALL OR ASSIST OWNERS WITH THIS PROBLEM? THE DEALER SAID THAT THEY COULDN'T DO ANYTHING TO ASSIST WITH THE REPAIR, NOR WOULD THEY TALK TO ACURA TO EXPLAIN MY SITUATION. I JUST SPENT ABOUT $750 TO REPLACE A FAILER SENSOR TO MAKE THE AIR BAG CHECK LIGHT GO AWAY.    I DID NOT EXPECT THIS FROM ACURA! I'M GOING TO MAKE SURE ALL MY FRIENDS ARE WARNED ABOUT THE POOR QUALITY OF ACURA ENGINEERING AND CUSTOMER SERVICE. THE TRICK PART OF IT IS THAT EVERYTHING FALLS APART RIGHT AFTER THE WARRANTY PERIOD (50K) IS OVER. WELL, ACURA HAS GOT BRIGHT ENGINEERING MINDS TO MAKE THE PARTS LAST FOR 50K MILES. *TR",
        "vin": "JH4CL968X4C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/26/2010",
        "dateOfIncident": "08/14/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10352191,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 ACURA TSX A/C STOPPED BLOWING COLD AIR. BROUGHT IT INTO ACURA AND THEY SAID THE AC COMPRESSOR SEIZED/ FROZE AND SHATTERED AND CONTAMINATED THE WHOLE AC SYSTEM COST OF REPAIR $3600.00 ESTIMATE. HUNDREDS OF FORUMS AND OTHER 04 TSX WITH THE SAME PROBLEM. SOME PEOPLE SAYS ACURA IS PAYING FOR PARTS IF THE CUSTOMER PAYS FOR LABOR. BUT NOT EVERYBODY GETTING THAT SAME OFFER? *TR",
        "vin": "JH4CL96874C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/28/2010",
        "dateOfIncident": "07/22/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10345827,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A KNOWN DEFECT WITH ACURA 2004 TSX A/C COMPRESSOR GRENADING AND CONTAMINATING THE COMPLETE A/C SYSTEM.      THERE ARE NO REAL EVENTS THAT LEAD UP TO THE FAILURE, YOU WILL SUDDENLY HEAR A GRINDING SOUND COMING FROM THE A/C THEN IT GOES OUT WITHOUT WARNING.    INSTEAD OF ACURA ADDRESSING THE PROBLEM THAT HAS AFFECTED THOUSANDS ACROSS THE COUNTRY, THEY PURSUE GOODWILL DISCOUNTS ON BEHALF OF THE CUSTOMER WHICH NEVER COVER THE FULL COST OF THE ISSUE WHICH IS USUALLY AROUND $4000 TO FIX.    YOU ARE BASICALLY AT THE MERCY AT THE COMPANY ON WHETHER THEY WILL COVER ANY PORTION OF THE COST WHICH IS AT NO FAULT TO THE CONSUMER.    THE FACT THAT A RECALL HAS NOT BEEN ISSUED FOR THIS IS ASTOUNDING CONSIDERING IF ONE DOES A SIMPLE GOOGLE SEARCH TO SEE HOW COMMON A PROBLEM THIS IS, YOU WILL FIND THOUSANDS OF PEOPLE THAT HAVE HAD THE SAME ISSUE.  THIS ISSUE IS A TICKING TIME BOMB THAT WILL EVENTUALLY HAPPEN TO ANYONE WITH THIS MAKE AND MODEL.  ITS NOT A MATTER OF IF IT WILL HAPPEN BUT WHEN WILL IT HAPPEN. *TR",
        "vin": "JH4CL96804C"
    },
    {
        "components": "ELECTRICAL SYSTEM,INTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/15/2010",
        "dateOfIncident": "06/01/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10343533,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 ACURA TSX RADIO AND HEATER CONSOLE LIGHTS WENT OUT IN 2009. *TR",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "07/09/2010",
        "dateOfIncident": "01/10/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10342329,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MY ACURA TSX 2004 HAS AN ISSUE WITH THE AIR CONDITIONING AND FAN.  THE FAN NO LONGER BLOWS AIR AND IS NOT ABLE TO BLOW AIR ON THE WINDOWS IN ORDER TO DE-FOG IT WHEN THE WEATHER IS COLD.  THERE WAS MAJOR DIFFICULTY IN DRIVING AND COULD HAVE CAUSED ACCIDENTS IF I HAD NOT PULLED TO THE SIDE AND CLEANED THE WINDOWS EVERY 10 MINUTES. AND NOW THAT IT IS SUMMER, THE TEMPERATURES IN THE CAR REACH ABOVE 110 DEGREES F BECAUSE I LIVE IN LAS VEGAS.  THERE ARE MANY OTHER CONSUMERS WITH THE PROBLEM WITH THIS SPECIFIC MODEL/YEAR.      THIS IS THE THREAD: HTTP://TSX.ACURAZINE.COM/FORUMS/SHOWTHREAD.PHP?T=679576. *TR",
        "vin": "JH4CL96844C"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/22/2010",
        "dateOfIncident": "06/18/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10339585,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 ACURA TSX. SHE STATED THAT WHILE  DRIVING 20 MPH, THE ENGINE STALLED WITHOUT WARNING AND ALL POWER WAS LOST. THE CONTACT BELIEVED THE FAILURE WAS DIRECTLY RELATED TO NHTSA CAMPAIGN ID NUMBER: 07V097000 (FUEL SYSTEM, GASOLINE: DELIVERY: FUEL PUMP) HOWEVER WHEN CONTACTING THE MANUFACTURER, SHE WAS TOLD HER VIN WAS NOT INCLUDED. THE VEHICLE WAS NOT TAKEN TO THE DEALER FOR DIAGNOSTIC TESTING OR REPAIRS. THE FAILURE AND CURRENT MILEAGES WERE 143,000.",
        "vin": "JH4CL96814C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/14/2010",
        "dateOfIncident": "11/15/2008",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10336301,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE FREEWAY WITH THE AIR CONDITIONER ON, A LOUD NOISE CAME FROM THE ENGINE COMPARTMENT AND THE AIR FROM THE AIR CONDITIONER WAS NO LONGER COOLED. I TOOK IT TO A MECHANIC WHO INSPECTED IT AND  TOLD ME THAT THE AIR CONDITIONER CONDENSER EXPLODED, SENDING OUT SHARDS OF METAL. *TR",
        "vin": "JH4CL95804C"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/09/2010",
        "dateOfIncident": "10/04/2005",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10335421,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 ACURA TSX. WHEN THE VEHICLE WAS PURCHASED, THE CONTACT WAS ADVISED TO CHANGE THE ROTORS DUE TO WARPING. THE CONTACT HAD THE ROTORS REPLACED. THE CONTACT STATED THAT THE ROTORS HAD BECOME WARPED AGAIN. THE CONTACT TOOK THE VEHICLE TO AN INDEPENDENT MECHANIC WHO INFORMED HER THAT THE ROTORS WERE WARPED AND NEEDED TO BE REPLACED. THE CONTACT WAS ALSO ADVISED THAT THE HYDRAULIC SYSTEM WAS FAILING. THE CURRENT AND FAILURE MILEAGES WERE APPROXIMATELY 81,000.",
        "vin": "JH4CL96874C"
    },
    {
        "components": "INTERIOR LIGHTING,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "06/08/2010",
        "dateOfIncident": "06/07/2006",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10335171,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE RESEARCHED MY PROBLEM TO FIND THAT THIS IS COMMON WITH THE ACURA.  APPARENTLY THERE WAS A DEFECT IN THE AUDIO SYSTEM THAT CAUSES THE LIGHTS ON THE TEMPERATURE CONTROL PANEL LOCATED IN THE CENTER DASH TO GO OUT.  THE WARRANTY WAS EXTENDED BUT UNFORTUNATELY THE PUBLIC WAS UNAWARE AND THEN WHEN THE PROBLEM ACTUALLY OCCURS IT IS \"TOO LATE\" TO HAVE IT COVERED FREE OF CHARGE AND WAY TO EXPENSIVE FOR MOST TO AFFORD.  NO LIGHTS WORK AND THIS IS EXTREMELY DANGEROUS WHILE TRYING TO ADJUST TEMPERATURE OR RADIO WHILE DRIVING.  THE ONLY THING THAT LIGHTS UP IS THE WINDOW ON THE RADIO, NO BUTTONS.  YOU HEAR THE HORROR STORIES OF TEXTING WHILE DRIVING WELL THIS ACURA MALFUNCTION IS JUST AS DANGEROUS.  I LOVE MY CAR AND WITH ACURA'S REPUTATION YOU WOULD THINK THAT THEY WOULD FIX THE PROBLEM.  THERE IS A HUGE NUMBER OF THESE CARS WITH THIS PROBLEM OUT THERE, THE PUBLIC JUST IS NOT AWARE OF YOUR WEBSITE TO ADDRESS SAFETY ISSUES.  AN INVESTIGATION TO ACURA OWNERS WOULD BE A WISE DECISION.  UPON RESEARCHING THIS ISSUE ON THE INTERNET THE PROBLEM THAT SEEMS TO FOLLOW THE DASH LIGHTS NOT WORKING IS THE CD PLAYER QUITS.  THAT HAS NOW HAPPENED WITH MY VEHICLE AND THE DISCS ARE STUCK IN THE PLAYER.  THIS IS SUPPOSED TO BE A HIGH END CAR AND IT IS NOT FAIR TO THE CONSUMER THAT ACURA DOESN'T FIX THIS ISSUE UNDER A SAFETY RECALL.   AFTERALL, WHAT IS MORE COSTLY A NEW AUDIO SYSTEM THAT SUPPOSEDLY WILL FIX ALL PROBLEMS OR MY DEATH BECAUSE OF A SAFETY ISSUE THAT ACURA FAILED TO FIX WHEN THE KNEW THAT FAR MORE THAN A FEW CARS HAD EXACT SAME ISSUE.  I HAVE SAVED ALL MY RESEARCH AND ATTEMPTS TO HAVE THE SAFETY ISSUE FIXED.  OPERATING THIS VEHICLE AT NIGHT IS A HUGE DANGER WHEN YOU CAN'T SAFELY OPERATE THE COMPONENTS THAT CAME ON YOUR CAR BECAUSE OF THIS ISSUE.  I HOPE THAT YOU MAY BE ABLE TO SOLVE MANY ACURA OWNERS WORST WORRY...LOSS OF LIFE WHILE TRYING TO ADJUST THE TEMPERATURE SO YOU FAMILY IS COMFORTABLE WHILE TRAVELING.  *TR",
        "vin": "JH4CL95834C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/04/2010",
        "dateOfIncident": "08/20/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10334570,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A DEFECT WITH A/C COMPRESSORS ON 2004 ACURA TSXS.  A PIECE OF THE COMPRESSOR, WHICH HOLDS THE COMPRESSOR CLUTCH, IS BREAKING OFF, RESULTING IN DEBRIS BEING SHOT THROUGH THE A/C SYSTEM, OR FALLING OFF COMPLETELY.  THE RESULT IS THAT THE A/C DOESN'T WORK, AND MOST OF THE ENTIRE A/C SYSTEM HAS TO BE REPLACED, COSTING DRIVERS ANYWHERE FROM  $1800 TO $4000, DEPENDING ON THE EXTENT OF THE PROBLEM.    THIS IS NOT AN ISOLATED INCIDENT.  THERE ARE MANY HAVING THIS SAME PROBLEM.  IT IS RELEGATED TO 04 MODEL YEAR ACURA TSXS.  ACURA CUSTOMER SERVICE CLAIMS THAT THERE ARE NO DOCUMENTED CASES.  HOWEVER, MY LOCAL ACURA DEALERSHIP SAYS THAT THIS HAS DEFINITELY OCCURRED BEFORE ON MULTIPLE OCCASIONS.  I CAN PROVIDE IMAGES AND COPIES OF WORK ORDERS TO PROVE THAT THIS IS NOT AN ISOLATED INCIDENT. *TR",
        "vin": "JH4CL96814C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/11/2010",
        "dateOfIncident": "04/20/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10329858,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING ON THE HIGHWAY AND MY AIR CONDITIONER JUST STOPPED BLOWING OUT COLD AIR.  TOOK IT TO THE ACURA DEALER WAS  TOLD THAT THE AIR CONDITIONING COMPRESSOR NEEDED TO BE REPLACED. *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "05/05/2010",
        "dateOfIncident": "05/02/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10328981,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 5:00 PM, MAY 2, 2010, WHILE DRIVING AT 65 MPH ON INTERSTATE 5 FREEWAY (NORTH BOUND) IN LOS ANGLES AREA, THE DRIVER-SIDE SIDE-AIRBAG, CURTAIN-AIRBAG, AND SEATBELT PRE-TENSIONER WAS DEPLOYED WITH NO REASON.  LIGHT TRAFFIC AND CLEAR WEATHER. THERE WAS NO INJURY OR ACCIDENT INVOLVED. THE CAR IS 2004 ACURA TSX MODEL AND MILEAGE IS ABOUT 108,000 MILES. THE CAR WAS TOWED TO GLENDALE ACURA AND CONTACTED ACURA CUSTOMER SERVICE.  THE DEALERSHIP SENT PICTURES TO ACURA CUSTOMER SERVICE.  ACURA CUSTOMER SERVICE REPRESENTATIVE CLAIMS THAT THEIR ENGINEERING DEPARTMENT DETERMINED (BASED ON THE PICTURE THE DEALERSHIP PROVIDED) THAT IS ROAD DAMAGE (SCRATCHES AND DENTS) UNDERSIDE OF THE CAR AND THE SENSOR MAY REACTED DUE TO THE DAMAGE.  THEREFORE ACURA WILL NOT FIX THE DAMAGE (REPLACE AIRBAG...) AND WILL NOT RELEASE THE PICTURE. *TR",
        "vin": "JH4CL95834C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/06/2010",
        "dateOfIncident": "11/13/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10323983,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 ACURA TSX AIR CONDITIONER COMPRESSOR FAILURE. *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/30/2010",
        "dateOfIncident": "03/04/2006",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10322870,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "BACKLIGHTING OF RADIO AND HVAC BUTTONS NO LONGER WORKS.  THIS ACTUALLY BECAME AN ISSUE AND WAS CHECKED/DIAGNOSED BY THE ACURA DEALER ON MARCH 4, 2006.  AT THAT TIME THEY INDICATED IT WAS OUT OF WARRANTY (MILEAGE=65,693) AND THE OWNER CHOSE NOT TO HAVE THE REPAIR DONE SINCE IT WAS NOT COVERED.  ACURA SUBSEQUENTLY ISSUED A TECHNICAL SERVICE BULLETIN TO ADDRESS THIS ISSUE AND EXTENDED THE WARRANTY FOR THE FAULTY PCB TO 100,000 MILES.  HOWEVER, THEY STILL CLAIM MY VEHICLE IS NOT COVERED BECAUSE IT IS NOW BEYOND THAT 100,000 MILE LIMIT.  THIS, EVEN AFTER THEY DIAGNOSED THE PROBLEM INITIALLY AT WELL UNDER THE 100,000 MILE LIMIT OF THAT EXTENDED WARRANTY.  THEY CLAIM THIS IS BECAUSE I AM THE SECOND OWNER, BUT THAT WARRANTY STAYS WITH THE CAR, NOT THE OWNER AND THIS HAS BECOME A REAL SAFETY ISSUE FOR OUR TEENAGE SON WHO TAKES HIS EYES OFF THE ROAD FAR TOO LONG TRYING TO FIND THE RIGHT BUTTON ON THAT UNLIT CONSOLE.",
        "vin": "JH4CL96894C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/02/2010",
        "dateOfIncident": "11/15/2008",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10315885,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE FREEWAY WITH THE AIR CONDITIONER ON, A LOUD NOISE CAME FROM THE ENGINE COMPARTMENT AND THE AIR FROM THE AIR CONDITIONER WAS NO LONGER COOLED.  A MECHANIC TOLD ME THAT THE AIR CONDITIONER CONDENSER EXPLODED. *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION,WHEELS,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "02/09/2010",
        "dateOfIncident": "08/10/2008",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10308075,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "08L14-TA1-200",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "REAR CAMBER PROBLEM. EVEN LESS THAN 40,000 MILES, TOE ANGLE IS OUT OF SPECIFICATION. IT CAUSES UNEVEN WEAR OF REAR TIRES, AND SHORTENS TIRE LIFE-CYCLE. HOWEVER, CAMBERS IS NOT ADJUSTABLE, IT REQUIRES REPLACEMENT AND ALIGNMENT. THIS PROBLEM IS A WELL KNOWN ISSUES FOR TSX OWNERS, AND DEALERS KNOW THE ISSUE (SERVICE BULLETIN #06-007), BUT ACURA DENIES WARRANTY SERVICE. *TR",
        "vin": "JH4CL96864C"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/13/2009",
        "dateOfIncident": "12/01/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10295490,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "ON NOVEMBER 28, 2009 I NOTICED THERE WAS A BURNING SMELL COMING FROM THE MOTOR OF MY 2004 ACURA TSX.  WHEN I RAISED THE HOOD, I FOUND LIQUID LEAKING ON THE TOP LEFT CORNER OF MY MOTOR.  I HAVE A 4 CYLINDER TSX.  I IMMEDIATELY CHECKED MY OIL AND FOUND I WAS LOW SO I THOUGHT THE HOSE WAS PART OF MY OIL DELIVERY SYSTEM (BECAUSE I AM NOT FAMILIAR WITH THE MOTOR AREA OF MY VEHICLE). I IMMEDIATELY MADE AN APPOINTMENT WITH MY SERVICE GARAGE (NOT AN ACURA DEALER BUT WORKED FOR ACURA FOR MANY YEARS) AND HE TOLD ME MY OIL WAS NOT A PROBLEM, THAT IT WAS THE POWER STEERING HOSE THAT WAS LEAKING FLUID ON MY MOTOR.  HE ALSO TOLD ME THAT THERE HAD BEEN A RECALL ON THE TLS FOR THE SAME PROBLEM  UPON HIS RECOMMENDATION, I CALLED MY LOCAL ACURA DEALER AND TALKED TO THE SERVICE REPRESENTATIVE JIMMY THOMAS ON DECEMBER 1 AND HE TOLD ME THERE WAS NOTHING HE COULD DO FOR ME OTHER THAN ORDER THE PART AND REPLACE IT CHARGING FULL PRICE OF LABOR AND PARTS.  MY ACURA IS ONE OF HIGHER MILEAGE THAN USUAL (126,000) BECAUSE IT WAS USED BY A PHARMACEUTICAL REPRESENTATIVE BEFORE I OWNED IT BUT ANYHOW I STILL BELIEVE MY HOSE WAS PROBABLY MADE FROM THE SAME DEFECTIVE MATERIAL THAT THE TLS WERE.  I CALLED THE CUSTOMER SERVICE REPRESENTATIVE FOR ACURA AND TALKED WITH ANDREA (WHO ALSO TOLD ME SHE WAS THE MANAGER ON DUTY) AND SHE KEPT REPEATING TO ME THAT SINCE MY MODEL WAS NOT PART OF THE RECALL, I WAS FULLY RESPONSIBLE FOR ALL COSTS RELATED TO THIS REPAIR ESPECIALLY SINCE MY CAR WAS OUT OF WARRANTY AND IT WAS A \"HIGH MILEAGE\" CAR.   I OWNED A 1997 ACURA 2.5TL BEFORE THIS ONE AND TRADED IT IN ON THIS ONE WHEN IT HAD 230,000 MILES ON IT AND I NEVER HAD ONE DAY TROUBLE OUT OF IT SO I DIDN'T NOT TAKE THAT AS A CORRECT RESPONSE.  I ASKED HER WOULDN'T IT BE BETTER FOR ACURA TO PAY A SMALL FEE NOW INSTEAD OF LARGER FEE IF SOMETHING SHOULD HAPPEN BECAUSE OF THIS DEFECT AND SHE KEPT REPEATING TO ME THAT MY MODEL HAD NOT BEEN RECALLED AND IT WOULD BE MY RESPONSIBILITY.  SO I AM REGISTERING THIS COMPLAINT. *TR",
        "vin": "JH4CL96834C"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/26/2009",
        "dateOfIncident": "11/25/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10293642,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER SIDE HEAD LIGHT MALFUNCTION. HEAD LIGHT WORKS ON AND OFF; DOES NOT TURN ON SOMETIMES. SOME DAYS IT WORKS, SOME DAYS IT NEVER DOES.  PROBLEM APPEARS TO BE RELATED TO RAINY/DUMP WEATHER. DEALER DID NOT ACKNOWLEDGE THAT IT IS WIRING ISSUE AND RECOMMENDED THAT THE HOLE SYSTEM BE CHANGED AND IT COST ME $909. 00. THEY DID NOT GIVE ME THE OLD PART. *TR",
        "vin": "JH4CL96994C"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "11/08/2009",
        "dateOfIncident": "11/06/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10291372,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS ON A HEAD ON COLLISION IN MY 2004 ACURA TSX AND THE DRIVER SIDE AIRBAG DID NOT GO OFF. I (THE DRIVER) WAS THE ONLY PERSON IN THE CAR. SOMEHOW THE PASSENGER SIDE AIRBAG DEPLOYED BUT NOT THE DRIVER SIDE AIRBAG, THE REASON FOR CONCERN ARE TWO, FIRST WITH NOT ENOUGH WEIGHT ON THE PASSENGER SEAT, THE AIRBAG SHOULD NOT HAVE GONE OFF, (WHAT IF THERE WAS A SMALL CHILD SEATING THERE), AND ALSO THE DRIVER SIDE AIRBAG SHOULD HAVE GONE OFF. ALSO THE DRIVER SIDE SEATBELT DID NOT PROTECT ME AND IT FAILED TO PROVIDE ANY RESTRAINT AND NOW IS BROKEN. *TR",
        "vin": "JH4CL96864C"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/08/2009",
        "dateOfIncident": "11/07/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10291411,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE POWER STEERING HOSE HAS A LEAK.  THE POWER STEERING FLUID IS DRIPPING ALL OVER THE PLACE.  I CAN SMELL BURNING OIL EVERYTIME I STOP.  LAST TIME I SAW SMOKE.  THE SMOKE WAS FROM THE POWER STEERING FLUID DRIPPING ONTO THE EXHAUST MANIFOLD. *TR",
        "vin": "JH4CL96814C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/11/2009",
        "dateOfIncident": "04/01/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10264973,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "ACURA TSX 2004. TURNED ON THE AC WHILE DRIVING, NOTHING BUT WARM AIR WAS COMING IN.  RESEARCHED ON-LINE FOR \"04 TSX AIR CONDITIONER BROKEN\" AND TO MY SURPRISE, THERE HAVE BEEN OTHER 04 TSX OWNERS WITH THE SAME ISSUE/PROBLEM - AN ACURA SERVICE ADVISOR  HAS INDICATED THAT THERE HAVE A NUMBER OF FOLKS HAVING THE SAME ISSUE WITH THE SAME VEHICLE AND THAT THE TOTAL COST IS APPROX. $4000.00.   TOOK THE VEHICLE TO THE DEALER, AND WAS INFORMED THAT THE ENTIRE AC UNIT NEEDS TO BE REPLACED - AC COMPRESSOR FAILURE CAUSED METAL SHAVINGS TO BE SPREAD THROUGH THE SYSTEM - TOTAL COST APPROX. $4500.00.   CONTACTED ACURA CLIENT SERVICES (HTTP://WWW.ACURA.COM/CLIENTSERVICES.ASPX), BUT HAVE BEEN INFORMED THAT THERE IS NOTHING THAT THEY CAN DO TO ASSIST ME. *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/11/2009",
        "dateOfIncident": "01/01/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10264972,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "ACURA 2004 TSX OWNER.  JUST RECENTLY DISCOVERED THIS SITE; BUT AS WITH THE OTHER COMPLAINTS, I HAVE ALSO EXPERIENCE THE VEHICLE TO VIBRATE/SHIMMY WHILE APPLYING THE BRAKES.  I HAVE TAKEN THIS TO THE DEALER, 1ST WHEN I HAD 12,000 MILES, AND BEING A NAIVE 1ST TIME CAR OWNER, I HAD TO PAY TO REPLACE THE BRAKES (APPRX. $300.00) FOR A BRAND NEW CAR!  I THEN EXPERIENCED THIS AT APPROX. 25,000 MILES, AND AGAIN HAD TO PAY $300.00 FOR A NEW SET OF BRAKES.   THIS IS AN ISSUE WITH ACURA - AND AS STATED BY OTHERS ON THIS DATABASE, IT MAY BE POSSIBLE THAT THIS COULD LEAD TO POSSIBLE INJURY DUE TO BRAKE MALFUNCTION. *TR",
        "vin": ""
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "03/25/2009",
        "dateOfIncident": "03/25/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10263022,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER DRIVER'S SEAT SHIFTS DURING HARD BREAKING/ACCELERATION. SEAT SHIFTS FORWARD AND BACK LESS THAN AN INCH. THIS CAN BE TROUBLESOME WHEN ACCELERATING AND IT CAUSES MY FOOT TO SLIP OFF OF THE CLUTCH AND JUMP SUDDENLY. COULD CAUSE ME TO INVOLUNTARILY SLAM INTO THE CAR IN FRONT OF ME. I HAVE HAD MULTIPLE DEALERS LOOK AT THIS AND THEY HAVE ALL TOLD ME IT IS BECAUSE OF THE WAY THE SEAT WAS DESIGNED AND THEY ARE UNABLE TO FIX IT. A MOVING SEAT DOES NOT FEEL SAFE. *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/16/2009",
        "dateOfIncident": "01/30/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10258889,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTED CAR ONE NIGHT AND CLOCK, RADIO AND TEMPERATURE CONTROL LIGHTS ALL WERE OUT. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/25/2009",
        "dateOfIncident": "01/10/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10256253,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOOK MY 04 ACURA TSX IN FOR A ELECTRONIC RECALL OF THE RADIO DASH LIGHT.  THIS REQUIRED A NEW CIRCUIT BOARD.  DURING THAT SAME VISIT I GOT MY TRANSMISSION FLUID FLUSHED.  A WEEK AFTER THE SERVICE WAS DONE MY CHECK ENGINE LIGHT CAME ON.  I TOOK MY CARE TO THE SHOP IMMEDIATELY.  WAS TOLD MY \"TIMING CHAIN TENSIONER\" HAS GONE BAD AND THE REPLACEMENT WOULD COS $1,600 +.  MY CAR ONLY HAD 64K MILES AND VERY WELL MAINTAINED.  I DID SOME ONLINE RESEARCH AND FOUND MANY OTHERS WITH THIS PROBLEM ON CARS WITH LOW MILES (50K TO 65K MILES).  THIS IS VERY DISAPPOINTING THAT I HAVE A HONDA PRODUCT AND IT REQUIRES $1600 WORTH OF REPAIRS WITH THIS LOW OF MILES.  FINDING MANY OTHERS ONLINE WITH THE SAME PROBLEM MAKES ME THINK THIS SHOULD BE SOME SORT OF RECALL ON THE MANUFACTURES PART.  PLEASE HELP. *TR",
        "vin": "JH4CL96934C"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/04/2009",
        "dateOfIncident": "11/08/2008",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10253760,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN APPLYING BRAKES, THEY TRAVEL LOWER AND FEEL SOFTER THAN NORMAL AND ARE NOT RESPONSIVE.  BRAKES WILL LOSE TRACTION, CAUSING THE CAR TO ROLL WHEN STOPPED.  AT A NATIONAL BRAKE REPAIR SERVICE PROVIDER, I WAS TOLD THAT THEY COULD FLUSH THE BRAKE SYSTEM (WHICH TEMPORARILY IMPROVED THE ISSUE FOR ABOUT A WEEK), BUT AIR WAS GETTING INTO THE BRAKE SYSTEM DUE TO A FAULTY VSA MODULATOR.  ACURA DOES NOT ALLOW SELL THESE PARTS OUTSIDE OF THEIR OWN SERVICE PROVIDERS AND HAS NOT ISSUED A RECALL FOR THIS POTENTIALLY DANGEROUS ISSUE WITH THIS VEHICLE.  I AM SUBMITTING THIS COMPLAINT IN HOPES THAT THIS COULD PREVENT ANY FUTURE ACCIDENTS. *TR",
        "vin": "JH4CL96914C"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "12/02/2008",
        "dateOfIncident": "10/28/2008",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10250510,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 ACURA TSX.  WHILE DRIVING APPROXIMATELY 10 MPH IN A PARKING LOT, THE CONTACT HEARD A LOUD NOISE COMING FROM THE INSTRUMENT PANEL.  THE CONTACT PARKED THE VEHICLE AND PROCEEDED TO LOCK THE POWER DOORS BEFORE EXITING; HOWEVER, THE DOOR LOCKING MECHANISM WOULD NOT WORK.  SHE COULD NOT LOCK THE DOORS FROM INSIDE THE VEHICLE AND HAD TO MANUALLY LOCK THEM FROM THE OUTSIDE.  IN ADDITION, THE TRUNK LOCKING MECHANISM WAS INOPERATIVE AND COULD ONLY BE ACTIVATED WITH THE TRUNK RELEASE.  THE PASSENGER SIDE TAIL LIGHT FAILED TO OPERATE AND THE DRIVER'S SIDE DOOR CHIME WAS INOPERATIVE.  THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER AND THEY STATED THAT THE FAILURE WAS RELATED TO THE TRUNK WIRING HARNESS.  THE TECHNICIAN DISCOVERED NHTSA CAMPAIGN ID NUMBER 04V429000 (EXTERIOR LIGHTING:TAIL LIGHTS ).  THE VEHICLE WAS REPAIRED, BUT THE FAILURE RECURRED.  THE RECALL REMEDY HAS NOT CORRECTED THE FAILURE.  THE VEHICLE WAS SCHEDULED FOR ANOTHER REPAIR.  THE VIN WAS UNKNOWN.  THE FAILURE MILEAGE WAS 58,000 AND CURRENT MILEAGE WAS 60,000.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/26/2008",
        "dateOfIncident": "08/13/2008",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10249925,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2004 ACURA TSX. MY AC BLEW OUT ON ME WHEN I WAS DRIVING HOME FROM WORK. I ONLY HAD AROUND 60,000 MILES AT THAT TIME. THE DEALER WANTED TO CHANGE THE WHOLE AC UNIT. COMPRESSOR, HOSES, CONDENSER, AND FLUSH THE SYSTEM OUT. THEY KNOW ABOUT THE AC FAILURE AS MANY ACURA TSX WERE REPORTED WITH THIS PROBLEM AND NOT OFFERING ANY RECALL ON IT. IT'S AN EXPENSIVE REPAIR TO FIX. THEY QUOTED ME $3,000.00 FOR THE FULL REPAIR. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/24/2008",
        "dateOfIncident": "05/16/2008",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10249742,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR CONDITIONER COMPRESSOR FAILED AND CAME APART CONTAMINATING THE ENTIRE A/C SYSTEM.  BECAUSE OF THIS, THE ENTIRE A/C SYSTEM HAD TO BE REPLACED. *TR",
        "vin": "JH4CL96994C"
    },
    {
        "components": "INTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/13/2008",
        "dateOfIncident": "11/13/2008",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10248692,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "AS MANY HAVE BEEN COMPLAINING ABOUT. CENTRE STACK LIGHTS HAVE GONE OUT AND I AM NOT UNDER WARRANTY!  WHY SHOULD ANY TSX OWNER HAVE TO PAY FOR THIS, OBVIOUSLY WIDE SPREAD, PROBLEM!?    2004   ACURA TSX    ONLY SOLUTION ACURA OFFERS IS TO REPLACE CONSOLE! *TR",
        "vin": "JH4CL95804C"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "03/13/2008",
        "dateOfIncident": "03/12/2008",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10220989,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN BRAKING, THE DRIVER'S SEAT SLIDES FORWARD (ABOUT 1/4 OF AN INCH).  THIS HAS BEEN A CONSTANT PROBLEM SINCE THE VEHICLE WAS NEW.  THE DEALER HAS LOOKED AT THE PROBLEM AND STATED THAT IT IS WITHIN NORMAL SPECIFICATIONS.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM,AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "01/07/2008",
        "dateOfIncident": "12/19/2007",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10214016,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 ACURA TSX.  WHILE ACCELERATING BETWEEN 35-75 MPH, THE ENGINE STALLED WITHOUT WARNING.  THE VEHICLE WOULD RESTART WITHIN 1-10 MINUTES.  THE DEALER WAS UNABLE TO DUPLICATE OR REPAIR THE FAILURE.  THERE WAS A RECALL FOR THE 2005 ACURA TSX; NHTSA CAMPAIGN ID NUMBER 07V097000 (FUEL SYSTEM, GASOLINE:DELIVERY:FUEL PUMP).  THE FAILURE MILEAGE WAS 76,400 AND CURRENT MILEAGE WAS 77,000.    UPDATED 01/29/08  *BF  THE DEALER REPLACED THE FUEL PUMP RELAY AND CAM SHAFT SENSOR. THE AIR BAG LIGHT ILLUMINATED OCCASIONALLY, THE BATTERY WAS REPLACED. THE SEAT BELT BUCKLE WAS REPLACED.  UPDATED",
        "vin": "JH4CL95814C"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/14/2007",
        "dateOfIncident": "12/04/2007",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10211913,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "IN A LIGHT FRONTAL COLLISION THE FRONT PASSENGER AIRBAG DEPLOYED BUT THE DRIVER'S SIDE BAG DID NOT DEPLOY.  *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/19/2007",
        "dateOfIncident": "09/12/2007",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10203491,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY 2004 ACURA TSX ON ROUTE 29 IN GAINESVILLE VA, IT IS A MAJOR 4 LANE DIVIDED HIGHWAY.  WHILE SLOWING DOWN TO MAKE A LEFT HAND TURN ONTO A SIDE STREET, THE CAR STALLED IN THE MIDDLE OF THE SOUTHBOUND LANES.   I ATTEMPTED TO RESTART THE ENGINE WITH NO LUCK, THE LIGHTS IN THE CAR REMAINED ON, BUT THE ENGINE WOULD NOT START.  THE CAR IS BLACK AND THIS INCIDENT OCCURRED AT 5:30 AM.  I HAD TO GRAB MY NEWBORN INFANT FROM THE BACK SEAT AND RUN FROM THE CAR BECAUSE IT WOULD NOT START AND CARS WERE TRAVELING 60 MPH IN THE SOUTHBOUND LANE HEADED DIRECTLY FOR MY CAR, WHICH COULD HAVE CAUSED A SERIOUS ACCIDENT.  *JB",
        "vin": "JH4CL96854C"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "04/17/2007",
        "dateOfIncident": "12/01/2005",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10188172,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 ACURA TSX.  WHILE DRIVING 50 MPH THE VEHICLE DROVE TO THE LEFT LANE WHEN THE BRAKE PEDAL WAS DEPRESSED.  THE ROAD CONDITIONS WERE CLEAR.  THE DEALER WAS UNABLE TO DIAGNOSE THE FAILURE.  THE FAILURE AND CURRENT MILEAGE WERE 50,000.  *AK",
        "vin": "JH4CL96874C"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/12/2007",
        "dateOfIncident": "10/01/2006",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10182360,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MY REAR CHAMBERS ON MY 2004 ACURA TSX HAD TO BE REPLACED DUE TO PROBLEMS.  I NOTICED OTHER PEOPLE ARE ALSO COMPLAINING ABOUT HAVING TO REPLACE THESE EARLY IN THEIR CAR HISTORY. THE DEALERSHIP DID NOT TELL ME HOW LONG MINE HOW BEEN OUT BUT I ESTIMATE THAT IT WAS PROBABLY ABOUT 50,000 MILES BECAUSE THAT IS WHEN MY REAR TIRES STARTED WEARING OUT PREM.  *NM",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/31/2007",
        "dateOfIncident": "01/28/2007",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10181208,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MY REAR SUSPENSION CAMBER WAS REPORT OFF BY 3 DEGREES AND BROKEN AT 39K MILES. THEY CLAIMED THAT THE CAR COULD HAVE FAILED WHILE DRIVING BUT THE CAR HAS NEVER DROVE ANY DIFFERENT SINCE I BOUIGHT IT 6 MONTHS PRIOR TO DISCOVERY OF MISS ALIGNMENT.   *NM",
        "vin": "JH4CL96984C"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/26/2006",
        "dateOfIncident": "12/20/1984",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10176930,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "ACURA TSX MANUAL TRANSMISSION FAILED AT 56K. THE PROBLEM CAUSED A LOUD KNOCKING NOISE COMING FROM THE TRANSMISSION CASE WHILE IN GEAR. NOISE GOES AWAY WHEN CLUTCH IS PRESSED IN. I AM 6K OVER MY WARRANTY AND THE DEAL IS STILL GOING TO COVER THE REPLACEMENT OF A NEW TRANSMISSION WHICH THEY QUOTED AT $4500.00 TO REPLACE. I WILL BE RESPONSIBLE FOR COVERING THE COST OF THE CLUTCH $400. I READ ONE OTHER INSTANCE WHERE THE SAME PROBLEM HAPPENED WITH A TSX OWNER.  *JB",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/28/2006",
        "dateOfIncident": "06/23/2006",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10160943,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MY WAY TO WORK, I STARTED HEARING A NOISE IN THE DRIVETRAIN.  I CHECKED THE CAR OVER THE NEXT MORNING AND TOOK IT TO THE DEALERSHIP.  THEY'RE TELLING ME THE CARRIER BEARINGS AND DIFFERENTIAL BEARINGS ARE WORN OUT IN THE MANUAL TRANSMISSION -- AFTER ONLY 54K MILES?!  THEY'RE NOT COVERING IT UNDER WARRANTY.  I'M BEING TOLD IT IS NOT A \"WARRANTY ITEM.  *JB",
        "vin": "JH4CL95824C"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "06/14/2006",
        "dateOfIncident": "05/14/2004",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10159820,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVERS SEAT IS LOOSE. DRIVERS SEAT SHIFTS TO LEFT OR RIGHT DURING CORNERING.  *JB",
        "vin": "JH4CL96804C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/03/2006",
        "dateOfIncident": "12/12/2005",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10158893,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE WAS DRIVING ALONG AND HIT A PIECE OF METAL ON THE HIGHWAY AND HAD A BLOW OUT BUT MAINTAINED CONTROL OF THE VEHICLE AND THE PASSENGER SIDE CURTAIN AIR BAG AND PASSENGER SEAT AIR BAG BOTH DEPLOYED.  *NM",
        "vin": "JH4CL96874C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/16/2006",
        "dateOfIncident": "05/16/2006",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10157662,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED ALL OCCUPANTS OF THE VEHICLE ARE HAVING SYMPTOMS ASSOCIATED WITH WHAT IS BELIEVED TO BE CARBON MONOXIDE POISONING FROM THE VEHICLE.  THE OCCUPANTS ARE HAVING HEADACHES AND COUGHING.  THESE SYMPTOMS DISSIPATE WHEN THE VEHICLE IS NOT BEING OCCUPIED.  THE DEALERSHIP CANNOT DUPLICATE THE PROBLEM.  *AK",
        "vin": "JH4CL96864C"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "03/24/2006",
        "dateOfIncident": "03/24/2006",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10153654,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 ACURA TSX DRIVER'S SEAT MOVEMENT -   DURING NORMAL DRIVING AND STOPPING, DRIVER'S SEAT WILL FREQUENTLY SHIFT OR MOVE APPROXIMATELY .25\"-.50\"  AFTER SEVERAL MONTHS OF EXPERIENCING THIS, VEHICLE WAS TAKEN TO  ACURA DEALER (ARIZONA) AND INSPECTED. VEHICLE WAS RETURNED WITHOUT REPAIR WHERE ISSUE WAS DIAGNOSED AS ACCEPTABLE.  ON SEVERAL OCCASIONS THERE HAS BEEN SUFFICIENT SEAT MOVEMENT TO CAUSE DRIVER TO TEMPORARILY LOSE CONTACT WITH CLUTCH (MANUAL TRANSMISSION MODEL) DUE TO FOOT SLIPPING OFF CLUTCH PEDAL.  THIS CREATES A HAZARDOUS CONDITION WHERE IT CAN BE DIFFICULT TO FULLY MAINTAIN COMPLETE CONTROL OF THE VEHICLE. SITUATION IS EXTREMELY TROUBLESOME DURING CONGESTED STOP AND GO FREEWAY DRIVING WHERE VEHICLE DYNAMICS CAUSE ISSUE TO REOCCUR ON A FREQUENT BASIS.  *JB",
        "vin": "JH4CL95974C"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/15/2006",
        "dateOfIncident": "12/01/2005",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10147816,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RIGHT REAR WHEEL BEARING FAILED AT 55,000 MILES.  WHEEL BEARINGS SHOULD NOT FAIL AT 55,000.  *JB",
        "vin": "JH4CL95834C"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/15/2006",
        "dateOfIncident": "01/09/2006",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10147817,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CLUTCH FAILED AT 56,000.  I HAVE DRIVEN A CLUTCH FOR 24 YEARS.  THE CLUTCH LASTED OVER 125,000 MILES IN MY LAST VEHICLE.  I ALSO HAVE EXPERIENCE DRIVING TRUCKS WITH MANUAL TRANSMISSION.  THE DEALER WOULD NOT SUPPORT ANY WARRANTY SINCE THE CLUTCH IS A \"WEAR PART\".*JB",
        "vin": "JH4CL95834C"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/14/2005",
        "dateOfIncident": "12/12/2005",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10145216,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2004 ACURA TSX 6 SPEED HAS EXCESSIVELY DRIFTED LEFT ON CROWNED HIGHWAYS SINCE THE CAR WAS NEW.  IF I LET GO OF THE STEERING WHEEL IT WILL CHANGE LANES IN LESS THAN 2 SECONDS.  I HAD THE DEALERSHIP PERFORM A 4 WHEEL ALIGNMENT BUT THE PROBLEM STILL PERSISTS.  *NM",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/26/2005",
        "dateOfIncident": "10/21/2005",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10140861,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "1) ON 10/21/05, I WAS DRIVING ON THE FWY AT APPROX. 65 MPH AND MY SIDE CURTAIN & DRIVER SEAT AIRBAGS DEPLOYED FOR NO APPARENT REASON. 2) I DID NOT  SEE ANY DEBRIS ON THE ROAD OR FEEL ANYTHING HIT MY CAR UNDERNEATH THE FRAME, HOWEVER, ACCORDING TO ACURA AND AMERICAN HONDA, A FREQUENCY SENSOR DETECTED A LOUD NOISE THAT CAUSED THE AIRBAGS DEPLOY. IT IS OBVIOUS THERE IS A DEFECT WITH EITHER THE AIRBAG ITSELF OR THE SENSORS. 3) TUSTIN ACURA (IN TUSTIN, CA) REFUSED TO COVER MY AIRBAGS UNDER MY WARRANTY AND MADE ME GO THROUGH MY INSURANCE TO GET IT FIXED. IT IS NOW BEING CONSIDERED AN AT FAULT \"COLLISION\" WHEN I DIDN'T SEE WHAT THEY SAY I MUST HAVE HIT AND I DID NOT FEEL OR HEAR ANY IMPACT. THE SENSOR IS OBVIOUSLY TOO SENSITIVE AND THEREFORE IT SEEMS TO BE A DEFECT, BUT STILL AMERICAN HONDA REFUSES TO COVER IT.  *NM",
        "vin": "JH4CL968X4C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/25/2005",
        "dateOfIncident": "10/07/2005",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10140803,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAGS DEPLOY  BECAUSE A PIECE OF WOOD HIT UNDER THE CAR, OIL LEAK",
        "vin": "JH4CL96814C"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/14/2005",
        "dateOfIncident": "09/09/2005",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10136473,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "AT ABOUT 19,000 MILES, MY CLUTCH BEGAN SLIPPING. I NOTICED BEFORE THIS THAT IT WAS OCCASIONALLY DIFFICULT TO ENGAGE FIRST GEAR, AND OFTEN THE TRANSMISSION WOULD GRIND WHEN SHIFTING INTO REVERSE. I BROUGHT THE CAR TO DEALER, (ACURA OF GREENWICH, GREENWICH, CT.) AND WAS TOLD THE CLUTCH WAS BAD, AND HAD TO BE REPLACED, AND WAS DAMAGED BY OVERHEATING, AS A RESULT OF MY IMPROPER DRIVING. I HAVE OWNED EIGHT MANUAL TRANSMISSION CARS IN MY OVER 30 YEARS OF DRIVING, AND NEVER HAD A CLUTCH FAIL BEFORE AT LEAST 60,000 MILES. MY DRIVING STYLE IS VERY CONSERVATIVE. I HAVE NEVER ABUSED THE CLUTCH. I HAVE CHECKED SEVERAL ACURA/TSX FORUMS ON THE INTERNET, AND THE HARD SHIFTING AND GRINDING IN REVERSE, AS WELL AS PREMATURE CLUTCH FAILURE, IS MENTIONED BY MORE THAN A FEW OWNERS. FORTUNATELY, MY DEALER WAS VERY FAIR, AND REPLACED THE CLUTCH AS GOODWILL. HOWEVER, THE PROBLEM HAS BEEN MENTIONED IN AN ACURA SERVICE DEPT. MAGAZINE AS WELL. IT APPEARS SEVERAL OWNERS HAVE NOT BEEN AS LUCKY AS ME, AND HAD TO SPEND BIG MONEY. I BELIEVE THERE SHOULD BE TSB ISSUED REGARDING THIS PROBLEM, AS THIS DOES APPEAR TO BE A DEFECT IN SOME TSX VEHICLES.   *JB",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/17/2005",
        "dateOfIncident": "06/10/2005",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10133233,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THE EVENING OF JUNE 10TH, 2005, THE ENGINE IN MY ACURA 2004 TSX BLEW OUT. CAR HAD APPROXIMATELY 11,000 MILES ON IT,A D WAS PURCHASED BRAND-NEW IN SEPTEMBER 2004 FROM RALLYE ACURA AT 1750 NORTHERN BOULEVARD, ROSLYN, NY, 11576.  AS A RESULT, THE ENTIRE ENGINE HAD TO BE REPLACED.  IT WAS NOTED BY STEVE GREINER IN THE RALLYE ACURA SERVICE DEPT. THAT THE BLOWN ENGINE WAS BY NO MEANS AS THE RESULT OF MY DRIVING.  HE STATED THAT AS THE CAR HAD A COMPUTER THAT DOCUMENTS THE EVENTS, AND IT WAS CLEAR THAT THERE WAS SOME SORT OF DEFECT IN THE ENGINE THAT WAS PRESENT WHEN THE CAR WAS PURCHASED BY MYSELF.  AND THE EVENTS WERE NOT THE RESULT OF MY DRIVING BEHAVIOR AND ALSO NOT THE RESULT OF ANYTHING ON THE HIGHWAY THAT MAY HAVE BOUNCED UP UNDER THE ENGINE.  THE CAR WAS GIVEN BACK TO ME ON JUNE 29TH, 2005, AFTER BEING OUT OF SERVICE FOR 19 CALENDAR DAYS, BY THE RALLYE ACURA SERVICE DEPARTMENT.  SUBSEQUENT TO THIS, IT WAS NOTED ON JULY 9TH, 2005, THAT THE TSX WAS LEAKING OIL.  THE CAR WAS BROUGHT BACK TO THE RALLYE ACURA DEALERSHIP, ONLY TO BE TOLD THAT THERE WAS A PART MISSING THAT HAD NOT BEEN INSTALLED WHEN THE ENGINE WAS REPLACED.  IT WAS NOT UNTIL 8:30AM AUGUST 3RD, 2005, THAT I WAS TO BRING THE CAR BACK IN FOR REPAIRS.  WHEN I ARRIVED BACK AT 4PM LATER THAT AFTERNOON (WHICH WAS THE ORIGINAL SCHEDULED PICKUP TIME ON THAT SAME DAY) TO PICK UP THE VEHICLE, I WAS TOLD THAT THE PART HAD BEEN PUT INTO THE CAR, BUT THAT IT WAS STILL LEAKING OIL.  THE CAR REMAINED THERE FROM AUGUST 3RD THROUGH AUGUST 4TH, 2005.  LEAVING THE CAR OUT OF SERVICE FOR AN ADDITIONAL TWO CALENDAR DAYS.  AS OF AUGUST 17TH, IT IS TOO EARLY TO TELL IF THERE WILL BE NO FURTHER OIL LEAKS AND/OR PROBLEMS.  I WAS TOLD BY MR. GREINER IN THE RALLYE ACURA SERVICE DEPT. THAT THEY DID NOT UNDERSTAND WHY THE ENGINE HAD BLOWN AND THAT IT WOULD HAVE TO BE SENT TO THE FACTORY.  THERE, THE ENGINE WOULD BE TAKEN APART IN ORDER TO DETERMINE WHAT CAUSED THE DAMAGE.*AK",
        "vin": "JH4CL96864C"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "05/02/2005",
        "dateOfIncident": "04/05/2004",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10119407,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "ACURA TSX 2004 DRIVER SEAT SLIDES BACK TO FRONT DURING HEAVY BREAKING OR DOWN SHIFTING. SEAT SHIFT IS ABOUT 1-2 INCHES AND HAS A SPRING LIKE EFFECT. ALSO DRIVER SEAT SHIFTS SLIGHTLY SIDE TO SIDE DURING TURNS.  DEALER STATES MOVEMENT IS NORMAL FACTORY SPECIFICATIONS. TO MY KNOWLEDGE FROM READING ONLINE FORUMS, THERE ARE HUNDREDS IF NOT THOUSANDS OF TSX CARS THAT HAVE THIS PROBLEM. NO TSB CREATED TO THIS DATE. CAR IS BEING TAKEN IN FOR FOURTH TIME TO ATTEMPT TO ADDRESS PROBLEM. I SENSE THAT IN THE RIGHT SITUATION, THIS SEAT SHIFT PROBLEM MAY CAUSE FOOT TO SLIP OFF BRAKE AND CAUSE AN ACCIDENT.",
        "vin": "JH4CL95964C"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/11/2005",
        "dateOfIncident": "09/05/2004",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10116730,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "IN APRIL 2004 HONDA ISSUED A RECALL FOR THE TRANSMISSION BEING OUT OF SPEC (TSB 124722).   THREE MONTHS AFTER PURCHASE I HAD TO TAKE MY CAR TO THE DEALER TO HAVE OTHER WARRANTY WORK PERFORMED.  I WAS THEN NOTIFIED THAT THERE WAS A RECALL ON THE TRANSMISSION.  *AKALTHOUGH I DID HAVE A DEALER LOANER CAR, I WAS WITH OUT MY CAR FOR 3 WEEKS.  I PURCHASED MY TSX IN JUNE OF 2004, 2 MONTH AFTER THE RECALL.  THE VEHICLE VIN SHOULD HAVE BEEN CHECKED BEFORE SALE FOR ANY OUTSTANDING RECALLS.  EITHER IT WAS NOT CHECKED OR I WAS NOT TOLD!  IF I WAS AWARE OF THE RECALL I WOULD HAVE REQUIRED IT TO BE FIXED BEFORE SALE.  PERHAPS IT WAS NOT MADE KNOWN TO ME, BECAUSE I WOULD HAVE REQUESTED A DIFFERENT VEHICLE OUTSIDE OF THE RECALL VIN RANGE.",
        "vin": "JH4CL96894C"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "04/11/2005",
        "dateOfIncident": "07/25/2004",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10116732,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "MICHELIN NORTH AMERICA",
                "productMake": "MICHELIN",
                "productModel": "11R245",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "WHILE TRAVELING ON THE INTERSTATE AT APPROXIMATELY 65 MPH, I RAN OVER SOME ROAD DEBRIS WHICH CAUSED MY TIRE TO BLOW OUT.  I DID CHECK MY OWNERS MANUAL AND ACURA DOES NOT WARRANTY THEIR $240 TIRES FOR THAT KIND OF FAILURE.  I THEN CHECKED MY MICHELIN WARRANTY BOOKLET, WHICH ALSO STATED THAT KIND OF FAILURE WAS NOT WARRANTEED.  THE NEAREST TIRE STORE DID NOT HAVE MY TIRE IN STOCK, SO I HAD TO PUT A NON-OEM TIRE ON MY CAR.  WHILE AT THE DETROIT AUTO SHOW DURING INDUSTRY PREVIEW DAY, I NOTICED A MICHELIN BOOTH.  I INQUIRED ABOUT MY TIRE FAILURE.  MICHELIN STATED THAT I SHOULD HAVE CONTACTED THEM AT THE TIME OF THE BLOW OUT.  I STATED, I READ THEIR BOOKLET AND IT WAS NOT COVERED UNDER WARRANTY.  THEY TOOK MY NAME AND NUMBER AND SAID SOMEONE WOULD CONTACT ME.  WITH IN ONE WEEK I RECEIVED A CALL FROM MICHELIN.  THEY INSTRUCTED ME TO PURCHASE A NEW MICHELIN TIRE TO MATCH MY OTHER 3 TIRES AND SEND THEM THE BILL.  WITH IN ONE WEEK I RECEIVED A CHECK.  IF THEY WANT TO BE CONTACTED AND WILL REIMBURSE ME FOR TIRES, THEY SHOULD PUT THAT IN THE WARRANTY BOOKLET.  *AK",
        "vin": "JH4CL96894C"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "04/10/2005",
        "dateOfIncident": "04/10/2005",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10116693,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "HELLO:  WHILE \"SPRING CLEANING\" MY 2004 ACURA TSX, I WAS CLEANING UP CHANGE ETC. UNDER THE SEATS.  I HAD TO MOVE THE DRIVER'S SIDE SEAT FORWARD AND UP TO CLEAN/VACUUM BETTER.(POWER SEAT).*AK  I IMMEDIATELY NOTICED THAT THE WIRING HARNESS UNDER THE DRIVER'S SEAT WAS DAMAGED.  THE ELECTRICAL TAPE PROTECTING THE HARNESS HAD BEEN RUBBED OFF,EXPOSING THE WIRE(S).  THE RUBBING IS A RESULT OF A POORLY POSITIONED HARNESS. THE SEAT FRAME RUBS ON THIS HARNESS WHEN THE SEAT IS MOVED BACK AND FORTH. (I TESTED THIS MYSELF,AND TOOK DIGITAL PICTURES AS WELL)  IT IS NO DOUBT A MATTER OF TIME BEFORE BARE WIRES ARE EXPOSED,CAUSING A SHORT CIRCUIT OR POSSIBLE WORSE,FIRE (?)...THE WIRES WOULD COME INTO CONTACT WITH THE SEAT FRAME!!!   THIS IS SIMPLY A RESULT OF POOR HARNESS POSITIONING AT THE FACTORY ETC..........",
        "vin": "JH4CL96874C"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "03/25/2005",
        "dateOfIncident": "01/08/2005",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10114757,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2004 ACURA TSX.  IT HAS A POWER DRIVERS SEAT.  WHENEVER I BRAKE A LITTLE HARDER THAN NORMAL OR WHEN I BRAKE SUDDENLY, THE DRIVERS SEAT MOVES FORWARD.  I TALKED TO MY LOCAL ACURA DEALER AND THEY SAID THIS IS NORMAL.  I DO NOT CONSIDER A SEAT THAT MOVES FORWARD WHEN YOU BRAKE TO BE SAFE.*AK",
        "vin": "JH4CL95844C"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "03/10/2005",
        "dateOfIncident": "03/10/2005",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10113880,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER'S SIDE SEAT SLIDES FORWARD/BACK ON ITS RAIL WHEN IT SHOULD BE LOCKED IN.*AK",
        "vin": "JH4CL96864C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/18/2005",
        "dateOfIncident": "01/05/2005",
        "fire": true,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10107235,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING. FIRE STARTED UNDERNEATH THE VEHICLE. THE VEHICLE WAS COMPLETELY BURNT INSIDE. CONSUMER STATED THE O-RING WAS NOT SEATED PROPERLY AND  ALL THE OIL  LEAKED COMPLETELY OUT OF THE VEHICLE. CONSUMER CONTACTED THE DEALERSHIP AND MANUFACTURER. *AK  THE OIL WAS CHANGED 2 DAYS BEFORE THE FIRE OCCURRED.    *TT",
        "vin": ""
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "01/10/2005",
        "dateOfIncident": "11/26/2004",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10106071,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER'S SEAT MOVES FORWARD AND BACKWARD DURING ACCELERATION AND BRAKING. ALSO, MOVES FROM SIDE TO SIDE WHILE CORNERING.  DEALER NOTED THE FOLLOWING \"TEST DROVE VEHICLE.  DUPLICATED CONCERN.  AS OF THIS MOMENT, ACURA IS STILL WORKING ON SOLUTION TO CONCERN.  NO CORRECTIONS MADE AT THIS TIME\".*AK",
        "vin": "JH4CL959X4C"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/07/2005",
        "dateOfIncident": "11/19/2004",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10105958,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR ENDED ANOTHER VEHICLE AT 25 MPH AND MY PASSENGER AIRBAG DEPLOYED WITHOUT ANYONE BEING IN THE PASSENGER SEAT. MY AIRBAG DIDN'T DEPLOY. I SUFFERED A WHIPLASH AS A RESULT. THE COLLISION WAS HEAD ON AND I FEEL MY AIRBAG SHOULD HAVE DEPLOYED. ACURA SAYS THE CAR BEHAVED THE WAY IT SHOULD HAVE, BUT I  FEEL THAT EXPLANATION IS INSUFFICIENT. I HAVE SPOKEN TO EXPERTS IN THE AREA AS WELL AND THEY FEEL LIKE ME THAT THE AIRBAG SHOULD HAVE DEPLOYED. IT IS MY FIRM BELIEF THAT THIS VEHICLE IS DEFECTIVE.*AK",
        "vin": "JH4CL96924C"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "01/04/2005",
        "dateOfIncident": "12/08/2004",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10105731,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2004 ACURA TSX WITH 25,000 MILES.  BEGINNING LAST MONTH, MY DRIVER SEAT BEGAN TO MOVE FORWARD AND BACKWARD WHILE BRAKING, OR ACCELERATING.  I FEEL IT IS VERY UNSAFE FOR A DRIVER SEAT TO MOVE AT ALL DURING DRIVING.*AK   I CONTACTED THE ACURA DEALERSHIP WHO INSPECTED MY VEHICLE AND INDIATED THE SEAT MOVEMENT WAS NORMAL.  I SUBSEQUENTLY CONTACTED ACURA CLIENT SERVICES, AND THEY TOO INDICATED THE SEAT MOVEMENT AS NORMAL.  NO FURTHER ACTIONS HAVE BEEN TAKEN.  I CAN PROVIDE YOU WITH THE LETTER I FAXED TO ACURA CLIENT SERVICES, AS WELL AS A COPY OF MY INVOICE FROM THE ACURA DEALERSHIP, OR ANY OTHER INFORMATION YOU REQUIRE.",
        "vin": "JH4CL969X4C"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/29/2004",
        "dateOfIncident": "11/19/2004",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10101737,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER REAR ENDED A VEHICLE AT 25 MPH.   UPON IMPACT,  PASSENGER'S SIDE AIR BAG DEPLOYED AND THE DRIVER SIDE DID NOT.*AK",
        "vin": ""
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "11/25/2004",
        "dateOfIncident": "10/28/2004",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10100526,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2004 ACURA TSX AND I WERE INVOLVED IN A FRONT COLLISION (THE FRONT OF MY CAR HIT THE REAR END OF A CAR IN FRONT OF ME.  THE FRONT LEFT SIDE OF MY TSX STRUCK THE RIGHT REAR SIDE OF A LATE MODEL CHEVY IMPALA.  THE IMPACT SET OFF MY PASSENGER SIDE AIRBAG, BUT NOT MY DRIVER SIDE AIRBAG.  I WAS DRIVING AND STRUCK MY HEAD ON THE STEERING WHEEL OF MY TSX.  THE SEAT BELT DID NOT CATCH ME AND AIRBAG DID NOT DEPLOY.  I SUSTAINED A CONCUSSION FROM THE INCIDENT AND FEEL THAT MY AIRBAG SHOULD DEPLOY. EVERY AUTO EXPERT, INCLUDING MY ACURA DEALER, SAID MY AIRBAG SHOULD HAVE DEPLOYED OR MY SEAT BELT SHOULD HAVE CAUGHT ME.  ACURA (THE CORPORATION) REFUSES TO EVEN INVESTIGATE THE MATTER, SAYING THAT THE CAR PERFORMED AS IT SHOULD HAVE.  I DON'T BELIEVE THIS IS TRUE AT ALL.*AK",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/14/2004",
        "dateOfIncident": "11/08/2004",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10098809,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "1) CAR WITH 9000K DEVELOPS MECHANICAL SOUND WITH DECELERATING  2) TOOK IN CAR TO DEALER FOR RECALL ON WIRE IN TRUNK AND THEY FOUND PROBLEM WITH TRANSMISSION.  I FOUND OUT FROM SERVICE REP THAT THEY HAD ANOTHER OF THE CAR IN THEIR SHOP FOR THE SECOND TIME WITH A SECOND TRANSMISSION PROBLEM. A FRIEND ALSO HAD A TRANSMISSION PROBLEM.    3) DEALER IS REPLACING TRANSMISSION. I WOULD LIKE TO LOOK INTO LEMON LAW AS THE WEB SEEMS TO INDICATE PROBLEMS WITH THIS CAR AND I HAVE 3 EXAMPLES OF THE PROBLEM.*JB",
        "vin": "JH4CL95864C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/28/2004",
        "dateOfIncident": "08/16/2004",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10088721,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "(1) DRIVING ON THE NEW JERSEY TURNPIKE I UNINTENTIONALLY RAN OVER A SMALL PIECE OF SHREDDED TIRE, IT FELT LIKE I HIT A POTHOLE  (2) AS A RESULT THE PASSENGER SIDE-CURTAIN AIRBAG DEPLOYED, NO DAMAGE TO THE EXTERIOR DAMAGE TO THE VEHICLE BUT IT DAMAGED THE CAR'S INTERIOR CEILING AND PASSENGER SEATS.  (3) CURRENTLY IN THE REPAIR SHOP FOR INTERIOR DAMAGE BY THE SIDE CURTAIN AIRBAG FALSE DEPLOYMENT.  *JB",
        "vin": "JH4CL96804C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/18/2004",
        "dateOfIncident": "08/18/2004",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10089209,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 40 MPH  DROVE OVER SOME DEBRIS IN THE ROAD AND PASSENGER SIDE CURTAIN AIR BAG DEPLOYED INADVERTENTLY.  PASSENGER SUSTAINED  SHOULDER BRUISES DUE TO THE FORCE OF THE AIR BAG. *AK",
        "vin": "JH4CL95854C"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "07/09/2004",
        "dateOfIncident": "06/01/2004",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10080684,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER'S SEAT MOVES IN MY CAR WHEN HEAVY BRAKING IS DONE.  THIS HAS BEEN GOING ON FOR THE PAST 2 MONTHS OR SO.  MY CAR HAS 13,000 MILES ON IT.  *AK",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/02/2004",
        "dateOfIncident": "07/01/2004",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10079213,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "MICHELIN TIRE CORP.",
                "productMake": "MICHELIN",
                "productModel": "MXM",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "PURCHASED FROM JAY WOLFE ACURA, KANSAS CITY, MO:  2004 ACURA TSX, 2700 MILES, PURCHASED 6/7/04.  NO POTHOLES, CRACKS, CURBS, ETC. HIT WITH VEHICLE.  DEALER STATED THAT I MUST HAVE HIT SOMETHING IN ROAD ANYWAY. *AK  FAILURE:  FRONT PASSENGER SIDWALL BLOWOUT AT RIM--FRONT END OUT OF ALIGNMENT; FRONT PASSENGER RIM DAMAGED DUE TO BLOWOUT AND MOVING CAR INTO SAFE LOCATION;  REAR PASSENGER BUBBLE AND START OF TIRE SEPARATION AT RIM--REAR END IN ALIGNMENT.  (DO NOT UNDERSTAND HOW REAR COULD BE IN ALIGNMENT IF A POTHOLE WAS HIT)  CORRECTION:   $825.00--REPLACED 2 TIRES; REPLACED 1 ACURA RIM; 1 FOUR WHEEL ALIGNMENT PLUS SHOP FEES AND TAXES.",
        "vin": "JH4CL96964C"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/27/2004",
        "dateOfIncident": "05/06/2004",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10074404,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE VEHICLE WAS MOVING AT A LOW SPEED AND THE GEARS WERE BEING CHANGED TO A LOWER GEAR, A GRINDING NOISE WAS HEARD COMING FROM THE TRANSMISSION.   PLEASE PROVIDE ANY ADDITIONAL INFORMATION.    *NM",
        "vin": "JH4CL96884C"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "05/15/2004",
        "dateOfIncident": "04/08/2004",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10072652,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SEAT SHIFTS FORWARD IN RAIL UNDER HARD BRAKING. BEEN TO DEALER TWICE. FIRST TIME DEALER SAID CALLED ACURA TECH HOTLINE AND TOLD THIS IS NORMAL. SECOND TIME CLAIMED NORMAL ALSO.*AK",
        "vin": "JH4CL96984C"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "04/30/2004",
        "dateOfIncident": "04/29/2004",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10068085,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER'S SEAT MOVES FORWARD ABOUT ONE INCH UPON MODERATE BRAKING. THE DRIVER'S SEAT ALSO MOVES LATERALLY LEFT ABOUT HALF AN INCH UPON TURNING RIGHT.   *LA",
        "vin": "JH4CL96834C"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "04/28/2004",
        "dateOfIncident": "04/24/2004",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10068003,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVERS SEAT MOVES FORWARD WHEN BRAKING TO A STOP AND WILL MOVE BY PUSHING AND PULLING WHILE STOPPED",
        "vin": "JH4CL95844C"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "04/16/2004",
        "dateOfIncident": "04/16/2004",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10066283,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER'S SEAT MOVES FORWARD WHEN HARD BRAKING. REPORTED PROBLEM TO DEALER, WHICH CLAIMED NOTHING IS WRONG. REPORTED PROBLEM TO ACURA CLIENT SERVICES, WHO CLAIMED THE MOVEMENT IS MANDATED BY FEDERAL SAFETY STANDARDS.*AK",
        "vin": "JH4CL96974C"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "04/13/2004",
        "dateOfIncident": "02/06/2004",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10066059,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVERS SEAT SLIDES FORWARD UNDER HARD BRAKING.",
        "vin": "JH4CL96924C"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "04/08/2004",
        "dateOfIncident": "12/03/2003",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10065754,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVERS SEAT MOVES/SLIDS WHEN BRAKING AND TURNING CORNERS. VERY ANNOYING, UNCOMFORTABLE AND HAD A NEAR ACCIDENT.*AK",
        "vin": "JH4CL95914C"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "04/08/2004",
        "dateOfIncident": "11/01/2003",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10065771,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER'S SEAT SHIFTS FORWARD UPON BREAKING, AND LEFT TO RIGHT WHEN TURNING AT ANY SPEED. THIS PROBLEM WAS IN CONJUNCTION WITH A BROKEN PLASTIC PANEL IN THE SEAT BASE, WHICH WAS SUBSEQUENTLY FIXED ON THE THIRD REPAIR. SEAT SHIFT WAS FINALLY FIXED AFTER THE THIRD REPAIR. NOW, 4 WEEKS LATER, THE PROBLEM IS BACK. PLASTIC PANEL FIRST BROKE WITH SEAT SHIFT, ONE WEEK AFTER PURCHASE, 10/06/03. IT WAS IN REPAIR FOUR TIMES, WITH THE ENTIRE SEAT HAVING BEEN SWAPPED OUT WITH THAT OF A LOANER CAR. AT SIX MONTHS, I HAVE APPROX. 2800 MILES, AND THE SEAT SHIFT IS GETTING GRADUALLY WORSE AGAIN.*AK",
        "vin": "JH4CL96874C"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "03/23/2004",
        "dateOfIncident": "03/01/2004",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10063745,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "SEAT MOVES DURING HARD TURNS AND BRAKING.*AK",
        "vin": "JH4CL96994C"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "02/24/2004",
        "dateOfIncident": "02/20/2004",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10058867,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRIC DRIVERS SEAT SHIFTS 1 TO 2 INCHES FORWARD DURRING MODERATE TO HARD BREAKING. I HAVE ALREADY BROUGHT THE CAR IN ONE TIME TO FIX IT.  IT WAS FINE FOR ABOUT TWO MONTHS, BUT THE PROBLEM HAS RETURNED.  IT FEELS VERY UNSAFE.     *AK",
        "vin": "JH4CL96824C"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "02/20/2004",
        "dateOfIncident": "02/20/2004",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10058551,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "ENTIRE SEAT MOVES 1/4 TO 1/2 INCH WHEN YOU APPLY THE BRAKES.  *AK",
        "vin": "JH4CL96944C"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "12/30/2003",
        "dateOfIncident": "12/25/2003",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10051385,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SEAT ROCKS LEFT AND RIGHT WHEN TURNING.  DRIVER SEAT SLIDES FORWARD 1 TO 2 INCHES UPON HEAVY BREAKING.",
        "vin": "JH4CL96834C"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/22/2003",
        "dateOfIncident": "12/15/2003",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10051870,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PROCEEDING TO ENTER THE INTERSTATE TRANSMISSION FAILED, CAUSING THE DRIVER TO PULL OFF THE HIGHWAY.  THE DRIVER HAD THE VEHICLE TOWED TO THE DEALER. *AK",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/04/2003",
        "dateOfIncident": "10/03/2003",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10041215,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ACTUAL CAPACITY OF THE FUEL TANK ON A 2004 HONDA ODYSSEY MAY NOT BE THE SAME AS STATED IN THE OWNERS MANUAL:  THE OWNERS MANUAL OF A 2004 HONDA ODYSSEY STATED 20 GAL TANK CAPACITY. BUT DURING MY FIRST WEEK OF DRIVING THIS 2004 ODYSSEY - THE LOW FUEL LIGHT INDICATOR LIT UP AT 194 MILES AFTER DRIVING AWAY FROM THE DEALERSHIP.  I RE-FUELED THE VEHICLE WITH A TOTAL OF 15.43 GAL WILL PUT THE TANK METER TO FULL.  QUESTION: DOES THE LOW FUEL INDICATOR LIGHT COME ON WHEN THERE IS ABOUT 4.53 GAL OF GAS STILL IN THE TANK. OR IT THE TANK CAPACITY IS LESS THAN WHAT HONDA STATED IN THE OWNER'S MANUAL.  *LA",
        "vin": ""
    }
]