[
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/09/2019",
        "dateOfIncident": "07/09/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11230513,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "TT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR JERKS VIOLENTLY AUDI DEALERSHIP STATE THEY WILL NOT FIX THIS ISSUE ALTHOUGH MY CAR FALLS UNDER THIS CAMPAIGN HTTPS://STATIC.NHTSA.GOV/ODI/RCL/2004/RCRIT-04V007-5629.PDF  AUDI CAMPAIGN JA (04V-007)  DIRECT SHIFT AUTOMATIC TRANSMISSION REPLACE DUAL CLUTCH",
        "vin": "TRUTC28N941"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/25/2018",
        "dateOfIncident": "09/04/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11131158,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "TT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAGS NOT WORKING DUE CAR SITTING AND BATTERY RUNNING LOW.  LOW BATTERY TRIGGERED CODE 65535 WHICH MAKES ALL THE AIRBAGS IN THE VEHICLE INOPERATIVE.",
        "vin": "TRUUT28N941"
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/24/2018",
        "dateOfIncident": "11/10/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11097849,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "TT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL SENSOR NOT WORKING PROPERLY; WHILE HAVING GAS, ONCE TANK METER READS 1/2, THE ENGINE SHOT-DOWN, INCORRECTLY TELLING THAT THE TANK IS EMPTY.  SAME ISSUES WITH THE CATHALYTIC CONVERTER SYSTEM.  ENGINE'S TRANSMISSION WEARING FAST; PUSHING BACK AND FORT WHILE ACCELERATING.",
        "vin": "TRUSC28N241"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/04/2018",
        "dateOfIncident": "03/09/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11091952,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "TT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS SENSOR AND WATER / COOLANT PUMPS/ EXAUST SYS..: CAR WAS IN MOTION...; TAKEN TO REPAIR-SHOP...  HIFGH COST.",
        "vin": "TRUSC28N241"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/10/2017",
        "dateOfIncident": "02/24/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10984780,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "TT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MECHATRONIC FAILURE,  TAKING A MICHIGAN UTURN CAR WENT INTO LIMP MODE CROSSIMG THE STREET ,ALMOST T BONED BY 2 DIFFERENT CARS, CALLED AUDI THEY WANT ME TO BUY A NEW UNIT FOR A CRAZY AMOUNT OF MONEY AND A LONG WAITING PERIOD, CALLED EVERYONE I COULD FOR HELP BUT SEEMS THERE IA SOME SORT OF COVER UP OR NEGLECT WHEN IT COMES TO THIS SPECIFIC CAR AND PROBLEM, SOMEBODY IS GOING TO GET SERIOUSLY HURT IF THERE ISNT A RECALL SOON, IM ONE OF HUNDEREDS THAT HAVE RAN INTO THIS SAME PROBLEM, BOUGHT THE CAR STILL MAKING PAYMENTS AT 61007 MILES AND THIS HAPPEND AT 72361 MILES.",
        "vin": "TRUWF28N041"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/23/2014",
        "dateOfIncident": "12/12/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10668033,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "TT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FIRST WEEK OF DEC 2014, I HAD BEEN HEARING A SPORADIC, WHOOTING NOISE FROM THE FLOOR OF MY AUDI TT 2004 (49,000 MILES).  I BROUGHT MY VEHICLE INTO THE DEALERSHIP ON 12/05/14.  ASIDE FROM SOME OTHER NON-CRITICAL REPAIRS, THE DEALERSHIP COULD NOT FIND A CAUSE FOR THE NOISE AND IT WAS RELEASED.  AS I WAS DRIVING THE VEHICLE BACK TO THE DEALERSHIP ON 12/12/14 TO PICK UP MY OTHER VEHICLE, I HAD SIGNIFICANT ISSUES.  I WAS DRIVING ALONG NORTH AVE AT 35 - 40 MPH IN RUSH-HOUR TRAFFIC.  AS I WAS DRIVING, THE VEHICLE SUDDENLY SHIFTED INTO NEUTRAL AND BEGAN TO RAPIDLY SLOW.  IN AN EFFORT TO AVOID A SERIOUS REAR-END COLLISION, I QUICKLY ENGAGED THE HAZARD LIGHTS AND SLOWED TO A STOP. ONCE STOPPED, I SHIFTED INTO PARK (NOT CERTAIN IF IT ACTUALLY SHIFTED TO PARK AT THIS POINT), SHUT OF THE ENGINE, AND RE-STARTED.  FORTUNATELY, THE VEHICLE MADE IT SAFELY TO THE DEALERSHIP WITHOUT ANOTHER INCIDENT THAT DAY.  THE FOLLOWING WEEK ON 12/15/14, THE DEALER RAN DIAGNOSTICS ON THE VEHICLE.  THEY NOTED A FAULT IN THE TRANSMISSION, BUT COULD NOT DETERMINE THE CAUSE AND AFTER RUNNING 10 MILES, NOTED THAT IT WAS RUNNING WELL.  IN AN EFFORT TO CONTINUE TROUBLESHOOTING, THE DEALER USED MY VEHICLE TO RUN ERRANDS.  AS THEY TURNED ONTO OGDEN AVE (WESTMONT, IL), THEY HAD THE SAME PROBLEM WITH THE VEHICLE SHIFTING SPONTANEOUSLY INTO NEUTRAL.  I DO NOT KNOW THE FULL DETAILS OF THAT INCIDENT, BUT CAN IMAGINE IT WAS ALSO A CLOSE CALL AS OGDEN AVE IS A BUSY, FOUR-LANE ROAD.  THE OFFICIAL DIAGNOSIS WAS THAT IT NEEDS A MECHATRONICS UNIT REPLACEMENT. I AM GRATEFUL THAT THIS INCIDENT DID NOT HAPPEN ON THE HIGHWAY AND THAT I WAS NOT DRIVING IN FRONT OF A MORE AGGRESSIVE DRIVER (WHO MAY HAVE OTHERWISE COLLIDED WITH MY VEHICLE). I BELIEVE THIS IS A SERIOUS SAFETY CONCERN AS IT OCCURS WHILE THE VEHICLE IS IN MOTION, IT OCCURS ON A SPORADIC BASIS, AND IT IS EVIDENTLY UNDETECTABLE AT THE DEALERSHIP.    *TR",
        "vin": "TRUWF28NX41"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/04/2012",
        "dateOfIncident": "11/30/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10487274,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "TT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRANSMISSION SLIPS VIOLENTLY BETWEEN 2 ND AND 3 RD GEAR. THERE WAS A COMPLETE LOSS OF POWER WITH THE PEDAL DOWN COMPLETELY. AFTER RESEARCH HAVE DISCOVERED THAT THE DESIGN OF THESE TRIPTONIC TRANSMISSIONS WHICH CAN BE SWITCHED FROM MANUAL TO AUTOMATIC ARE FAULTY AND COSTLY TO REPAIR. I AM CONSIDERING A VALVE BODY REPLACEMENT WHICH MAY OR MAY NOT FIX THE PROBLEM. AUDI DOES NOT STAND BEHIND THEIR PRODUCT. THIS IS A COMMON PROBLEM AMONG AUDI OWNERS.  *TR",
        "vin": "TRUTC28N441"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/30/2012",
        "dateOfIncident": "07/26/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10468347,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "TT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE FREEWAY, THE TRANSMISSION SUDDENLY WENT TO NEUTRAL. WITH NO POWER AND AT 70MPH, I WAS FORCED INTO AN UNSAFE MANEUVER, CUTTING DRIVERS OFF IN ORDER TO GET ONTO THE SHOULDER LANE.    I WAS TOWED TO A NEARBY AUDI DEALERSHIP AROUND 11:00PM. 3 BUSINESS DAYS LATER, THEY CALLED ME WITH THE RESULTS; THE MECHATRONICS (TRANSMISSION COMPUTER) WAS FAULTY AND WAS ESTIMATED TO COST $2800 FOR THE REPAIR.    THIS ISSUE WITH VW'S DSG TRANSMISSION IS WIDESPREAD AS OWNERS AT VARIOUS MILEAGES HAVE REPORTED BROKEN MECHATRONICS UNITS. MY VEHICLE HAS 65K MILES AND REPLACING A TRANSMISSION AT THAT MILEAGE IS ABSURD. *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/29/2012",
        "dateOfIncident": "05/22/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10459864,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "TT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 AUDI TT1.8 COUPE. THE CONTACT STATED WHILE DRIVING 45 MPH, THE VEHICLE WOULD JERK IN BETWEEN GEARS AND STALL. AFTER THE FAILURE, THE VEHICLE COULD NOT BE SHIFTED IN OR OUT OF ANY GEAR. BY TURNING THE ENGINE OFF AND THEN RESTARTING, THE FAILURE WOULD CORRECT ITSELF BUT WOULD RECUR AFTER SEVERAL MINUTES. THE VEHICLE WAS TAKEN TO THE DEALER WHO ADVISED THE CONTACT THAT THEY NEEDED TO REPLACE THE TRANSMISSION. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE WHO OFFERED TO BUY THE VEHICLE BACK BUT THE CONTACT REFUSED. THE FAILURE MILEAGE WAS 70,000.",
        "vin": "TRUSC28N241"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/20/2012",
        "dateOfIncident": "04/18/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10455918,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "TT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "FAILED ENGINE TEMPERATURE GAUGE DIAGNOSED BY AUDI TECHNICIAN AS A FAILED INSTRUMENT CLUSTER; THE CLUSTER HAS TO BE REPLACED OR ALL GAUGES MAY FAIL WITHOUT WARNING.           *JS",
        "vin": "TRUTC28N241"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/24/2012",
        "dateOfIncident": "01/18/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10449261,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "TT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MECHATRONIC VALVE CONTROL MODULE FAILURE    GOING INTO NEUTRAL OR CHANGING DOWN AT HIGHWAY CRUISE.    MOST DANGEROUS OCCURRENCE: SLIPPING CLUTCH AND NOT ENGAGING FIRST GEAR PROPERLY. I WAS NEARLY HIT BY A CAR TRAVELING AT 60MPH WHILE LIMPING ACROSS AN INTERSECTION. COULD HAVE BEEN FATAL.  *TR",
        "vin": "TRUWF28N041"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/01/2011",
        "dateOfIncident": "04/01/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10393925,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "TT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2004 AUDI TT 3.2 DSG WITH ABOUT 106,000 MILES ON IT, WHEN EVER I TURN THE CAR ON AND SHIFT INTO GEAR THE CAR WILL JUST SIT THERE WITH THE GEAR LIGHTS ON THE INSTRUMENT CLUSTER BLINKING. I HAVE NO REVERSE GEAR, THE CAR CAN MOVE IN DRIVE BUT MAKES A GRINDING NOISE, I MIGHT HAVE TO RESTART THE CAR 20 TIMES BEFORE THE CAR DECIDES TO WORK RIGHT AND GO INTO REVERSE AND DRIVE NORMALLY... ALSO THERE IS A STRONG OILY SMELL COMING FROM THE ENGINE COMPARTMENT. THE CAR GETS SERVICED AND CHECKED NORMALLY AND THIS JUST STARTED ALL OF A SUDDEN.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/27/2011",
        "dateOfIncident": "11/28/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10384683,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "TT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "IN NOVEMBER OF 2010, I WAS DRIVING IN MY 2004 1.8 AUDI TT AT APPROXIMATELY 45 MILES PER HOUR.  WITHOUT WARNING, THE CAR LOST ALL POWER IN THE MIDDLE OF THE ROAD.  FORTUNATELY, THE CAR LOST POWER AT 1:00 AM OR I MAY HAVE BEEN EASILY HIT/KILLED BY THE HEAVY FLOW OF DAYTIME TRAFFIC.  AS IT TURNS OUT, THERE WAS AN IGNITION COIL RECALL ON MY VEHICLE.  I NEVER RECEIVED NOTICE OF SUCH RECALL AND AS A RESULT, WAS PUT IN DANGER BY OPERATING A VEHICLE WITH A KNOWN DEFECT AND SUFFERED OVER TWO THOUSAND DOLLARS IN RELATED REPAIR EXPENSE.  THE MECHANIC AT AUDI TOLD ME MY FUEL PUMP, COLLANT TEMP SENSOR, CRANK SENSOR AND IGNITION COIL NEEDED TO BE REPLACED.  HE WAS QUITE SURPRISED THE THE PREVIOUS AUDI DEALERSHIP DID NOT CORRECT THE RECALL DURING ROUTINE SERVICE.  MY VEHICLE WAS PERFECTLY MAINTAINED, SERVICED BY AN AUDI DEALERSHIP AND HAD APPROXIMATELY 32,000 MILES.  FAILURE OF AUDI TO NOTIFY ME OF THE RECALL AND FAILURE OF THE AUDI DEALERSHIP TO CORRECT THE IGNITION COIL DURING ROUTINE SERVICE COULD HAVE RESULTED IN GRAVE INJURY.  BOTH AUDI CORP AND THE INDIVIDUAL AUDI DEALERSHIP DISPLAYED A CARELESS DISREGARD FOR MY SAFETY AND ANY OTHERS WHO MAY HAVE BEEN IMPACTED BY MY VEHICLE FAILURE.  *TR",
        "vin": "TRUTC28N241"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/27/2011",
        "dateOfIncident": "11/28/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10384684,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "TT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "IN NOVEMBER OF 2010, I WAS DRIVING IN MY 2004 1.8 AUDI TT AT APPROXIMATELY 45 MILES PER HOUR.  WITHOUT WARNING, THE CAR LOST ALL POWER IN THE MIDDLE OF THE ROAD.  FORTUNATELY, THE CAR LOST POWER AT 1:00 AM OR I MAY HAVE BEEN EASILY HIT/KILLED BY THE HEAVY FLOW OF DAYTIME TRAFFIC.  AS IT TURNS OUT, THERE WAS AN IGNITION COIL RECALL ON MY VEHICLE.  I NEVER RECEIVED NOTICE OF SUCH RECALL AND AS A RESULT, WAS PUT IN DANGER BY OPERATING A VEHICLE WITH A KNOWN DEFECT AND SUFFERED OVER TWO THOUSAND DOLLARS IN RELATED REPAIR EXPENSE.  THE MECHANIC AT AUDI TOLD ME MY FUEL PUMP, COOLANT TEMP SENSOR, CRANK SENSOR AND IGNITION COIL NEEDED TO BE REPLACED.  HE WAS QUITE SURPRISED THAT THE PREVIOUS AUDI DEALERSHIP DID NOT CORRECT THE RECALL DURING ROUTINE SERVICE.  MY VEHICLE WAS PERFECTLY MAINTAINED, SERVICED BY AN AUDI DEALERSHIP AND HAD APPROXIMATELY 32,000 MILES.  FAILURE OF AUDI TO NOTIFY ME OF THE RECALL AND FAILURE OF THE AUDI DEALERSHIP TO CORRECT THE IGNITION COIL DURING ROUTINE SERVICE COULD HAVE RESULTED IN GRAVE INJURY.  BOTH AUDI CORP AND THE INDIVIDUAL AUDI DEALERSHIP DISPLAYED A CARELESS DISREGARD FOR MY SAFETY AND ANY OTHERS WHO MAY HAVE BEEN IMPACTED BY MY VEHICLE FAILURE.  *TR",
        "vin": "TRUTC28N241"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/11/2010",
        "dateOfIncident": "12/09/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10369978,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "TT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR WAS HAVING ELECTRICAL PROBLEMS, APPEAR RELATED TO INSTRUMENT CLUSTER FAILURE. I SCHEDULED WITH AUDI TO EVALUATE FAULTY GAS GAUGE AND RADIO STAYING ON AFTER KEY REMOVED. ANYHOW, BEFORE I COULD GET IT INTO AUDI, THE CAR WHILE DRIVING JERKED VIOLENTLY AND THEN WOULD NOT SHIFT GEARS. IT WAS LUCKY I WAS NOT GOING VERY FAST AS I WAS ON WINDY ROADS WITH CLIFFS. I COULD HAVE BEEN SERIOUSLY INJURED OR DEAD HAD THE CAR LOST CONTROL. THERE HAVE BEEN RECALLS ON THE DSG AND CLUTCH ASSEMBLY FOR MY MODEL CAR, BUT THEY DON'T SHOW UP ON MY RECORD WITH AUDI. THE CAR THEN WOULD NOT ENGAGE GEARS FOR A FEW RESTARTS, SUDDENLY IT WAS FINE AND WOULD DRIVE BUT I HAD IT TOWED DUE TO RISK FACTORS AND UNCERTAINTY. I BELIEVE THESE ARE RELATED EVENTS AND THEY TELL ME I NEED A NEW TRANSMISSION. THIS CAR HAS ONLY 45K MILES AND I'M NOT SURE IT IS A MECHANICAL FAILURE AT TALL. IT IS STRANGE THAT ALL OF THESE EVENTS COINCIDED AND SUSPECT PROBLEMS WITH COMPUTER COMMUNICATION BETWEEN TRANNY AND INSTRUMENT CLUSTER. THEY ARE NOT HELPING ME RESOLVE THIS AND DENYING INSTRUMENT CLUSTER PROBLEM. SAYING THERE IS NOTHING WRONG BUT THE GAS GAUGE IS NOT WORKING AND THIS IS A CLASSIC SIGN OF INSTRUMENT CLUSTER FAILURE WHICH LED TO THE LAWSUIT. *TR",
        "vin": "TRUUF28N041"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/15/2010",
        "dateOfIncident": "11/12/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10365669,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "TT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 AUDI TT 3.2 DSG TRANSMISSION, 75823 MILES. 2ND TIME THAT THE TRANSMISSION HAS DISENGAGED FROM THE ENGINE IN THE PASS SEVERAL MONTHS.THE BOTH TIMES THAT IT HAS HAPPENED IS WHEN INITIALLY THE CAR IS FIRST STARTED UP. I DRIVE SEVERAL FEET, STOP AND THEN ACCELERATE AGAIN AND THE CAR DOES NOT MOVE. WHEN ACCELERATING BY USING THE GAS PEDAL, THE ENGINE REVS TO HIGHER RPMS BUT DOES NOT MOVE OR THE TRANSMISSION DOES NOT ENGAGE. I TURN THE IGNITION OFF AND THEN RESTART THE CAR AGAIN AND CAR OPERATES NORMALLY WITH NO PROBLEMS. NO ENGINE MANAGEMENT LIGHT COMES ON TO INDICATE A PROBLEM. I CALLED THE DEALERSHIP THE FIRST TIME AND IT WAS INDICATED THAT THE CAR SOFTWARE SYSTEM WILL GET A HICCUP ON OCCASION AND THIS WAS NORMAL. I HAVE NEVER EXPERIENCE THIS PROBLEM (OR THE OCCASIONAL HICCUP) SINCE OWNING THE CAR WITH 5,500 MILES ON THE ODOMETER UNTIL RECENTLY. *TR",
        "vin": "TRUWF28N641"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/15/2010",
        "dateOfIncident": "11/03/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10365797,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "TT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "OPERATING VEHICLE AT NORMAL SURFACE STREET AND HIGHWAY CONDITIONS - DSG TRANSMISSION DISENGAGES PUTTING VEHICLE INTO NEUTRAL AND ELIMINATING ALL POWER TRAIN RESPONSE.  THIS FAILURE HAS OCCURRED TWICE WITHIN THE FIRST FIVE DAYS OF OPERATION -   1 @ SURFACE COASTING AS APPROACH TO INTERSECTION - THEN ACCELERATE - SYSTEM INITIATED A AUTO SHIFT SEQUENCE THAT RESULTED IN NEUTRAL, AND REQUIRED SYSTEM (IGNITION ) RESTART.  2@ FREEWAY COASTING AS APPROACHING SLOWER VEHICLE - THEN ACCELERATE - SYSTEM INITIATED A AUTO SHIFT SEQUENCE THAT RESULTED IN NEUTRAL, AND REQUIRED SYSTEM (IGNITION ) RESTART.  NO REPAIR HAS BEEN DONE TO CORRECT ISSUE - STILL WORKING WITH DEALER. *TR",
        "vin": "TRUWF28N441"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/03/2010",
        "dateOfIncident": "08/20/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10363934,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "TT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 AUDI TT 3.2 LITER, DSG TRANSMISSION, 32,000 MILES. AT RANDOM TIMES, THE ENGINE WOULD SUDDENLY DISCONNECT FROM THE DRIVETRAIN FOR A FEW SECONDS, A SERIOUS SAFETY ISSUE WHEN MERGING ONTO A FREEWAY, OR CROSSING A BUSY STREET. THIS OCCURRED MANY TIMES OVER A PERIOD OF WEEKS, UNTIL I STOPPED DRIVING THE CAR BECAUSE OF SAFETY CONCERNS. AN ERROR CODE SHOWED A SPEED SENSOR FAILURE, BUT REPLACING THE SENSOR DID NOT FIX THE PROBLEM. ULTIMATELY I HAD TO HAVE THE MECHATRONIC UNIT IN THE TRANSMISSION REPLACED TO FIX THE PROBLEM, AT A COST OF ABOUT 3,200 DOLLARS. I HAVE THE DEFECTIVE MECHATRONIC UNIT IN MY POSSESSION.    *TR",
        "vin": "TRUUF28NX41"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/30/2010",
        "dateOfIncident": "03/28/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10322767,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "TT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "RECENTLY PURCHASED AN AUDI TT 3.2 V6 2004 DSG MODEL.  51K ON THE CLOCK.  WHILST DRIVING ALONG THE MOTORWAY SUDDENLY THE CAR SEEMS LIKE ITS BEEN THROWN INTO NEUTRAL AND A SUDDEN LOSS OF POWER. NO WARNING, NO ENGINE MANAGEMENT LIGHT, NOTHING.  THIS KEEPS HAPPENDING SPORADICALLY APPROX TWICE A DAY AND ACCORDING TO AUDI IT SEEMS AS THOUGH IM GOING TO HAVE TO COUGH UP FOR A NEW GEARBOX WHICH I DEEM TO BE TOTALLY UNACCEPTABLE. SURELY THIS MUST REQUIRE AUDI TO REVIEW THE DSG GEARBOX.???",
        "vin": "TRUZZZ8N141"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/25/2010",
        "dateOfIncident": "02/09/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10314047,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "TT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "AUDI TT DSG TRANSMISSION FAILS AND THE CAR LOSES ALL ABILITY TO ACCELERATE.  THIS HAS HAPPENED IN TRAFFIC.  ALL TRANSMISSION DISPLAY LIGHT FLASH RAPIDLY (PRDNS) WHILE THE CAR WILL NOT MOVE WITHOUT TURNING OFF THE IGNITION & RESTARTING THE ENGINE.  PROBLEM HAS OCCURRED A COUPLE OF YEARS AGO AND NOW TWICE IN 1 WEEK.  APPEARS TO BE A SAFETY HAZARD AS FAILURE CAN OCCUR IN TRAFFIC & VEHICLE IS WITHOUT POWER UNLESS IGNITION IS TURNED OFF AND THEN ON AGAIN.  GOOGLE SEARCH REVEALS A GREAT NUMBER OF THESE INCIDENTS.  WHILE AUDI HAS ISSUED EXTENDED GUARANTEES ON NEWER AUDI TTS AND SOME VW PRODUCTS WITH THIS TRANSMISSION, THEY HAVE APPARENTLY NOT ADDRESSED THE ISSUE FOR OWNERS OF OLDER TTS WITH DSG TRANSMISSION LIKE MYSELF.   HAVE 2 VIDEOS SHOWING FLASHING DISPLAY. *TR",
        "vin": "TRUUF28N141"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/06/2010",
        "dateOfIncident": "12/30/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10298504,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "TT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 AUDI TT ROADSTER DSG/MECHATRONIC UNIT FAILURE.  ENGINE SHIFTED INTO 1ST GEAR ON 294 NORTHBOUND WHILE DRIVING 55 MPH IN THE CENTER LANE!  LOST ALL POWER AND PRAYED THAT I COULD GET TO THE SHOULDER WITHOUT BEING HIT.  ROAD THE SHOULD IN 1ST GEAR WITH HAZARDS ON UNTIL I COULD EXIT AND LIMP MY WAY TO THE DEALER.  ESTIMATED REPAIR $25000.00  I HAVE BEEN UNEMPLOYED SINCE SEPT 2009.  MAYBE I SHOULD HAVE BEEN HIT AND KILLED!  JUST PUT $710.00 IN REAR BRAKES AND NEW WIPERS ON.  THIS REPAIR IS INSANE.  THE UNIT SHOULD BE RECALLED.  I COULD HAVE LOST MY LIFE AS WELL AS MY PASSENGER WHICH WAS MY MOTHER!  NO WARNING OF ANY KIND TO ALERT YOU THAT SOMETHING IS GOING TO HAPPEN.  VERY VERY SCARY!!! *TR",
        "vin": "TRUUF28N941"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/27/2009",
        "dateOfIncident": "07/27/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10278431,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "TT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "AUDI TT 3.2 WITH DSG GEARBOX. AFTER STARTING A JOURNEY THE GEARBOXFAILED AND WENT OUT OF GEAR. COULD ONLY RE-ENGAGE GEAR BY TURNING ENGINE OFF AND RESTARTING. RETURNED VEHICLE TO AUDI DEALER FOR INVESTIGATION AND GEARBOX PARAMETERS FOUND NORMAL BUT WITH UNEXPLAINED OVERTEMP REGISTERED.  FURTHER DRIVING LEAD TO OCCASIONAL NEUTRAL SELF SELECTING AND ALSO PULSING OF ENGINE INDICATING A GEAR SLIPPAGE. FURTHER VISIT TO DEALERSHIP FOR DSG OIL CHANGE DID NOT IMPROVE FAULT. FURTHER DEALERSHIP DIAGNOSIS HAS LEAD TO MECHTRONIC UNIT HAVING SUSPECTED INTERNAL FAULT. I AM CURRENTLY AWAITING AUDI DECISION ON WARRANTY CLAIM TO HELP WITH THE 2500 REPAIR BILL. *TR",
        "vin": "TRUZZZ8N341"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "04/15/2008",
        "dateOfIncident": "10/03/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10224624,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "TT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "FAILURE OF FUEL GAUGE.  *TR",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/27/2006",
        "dateOfIncident": "06/08/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10160891,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "TT",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "CONTITOURING",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "DT*: THE CONTACT STATED A SMALL EXPLOSION WAS HEARD AS THE REAR DRIVER SIDE TIRE BLEW ON JUNE 8, 2006. THIS INCIDENT OCCURRED WHILE TRAVELING ALONG THE INTERSTATE HIGHWAY AT 70 MPH. IT WAS A CLEAR HOT DAY; THE VEHICLE WAS TRAVELING ON STRAIGHT LEVEL PAVEMENT AND THERE WAS NO DEBRIS WAS SEEN IN THE ROAD. A POLICE REPORT WAS FILED. PICTURES OF THE TIRES WERE TAKEN AFTER THE VEHICLE WAS REMOVED FROM THE SCENE. THE VEHICLE WAS TAKEN TO A TIRE STORE FOR A REPLACEMENT TIRE AND THE MANAGER WAS INSPECTED THE REMAINING TIRES. ALL TIRES WERE FOUND TO HAVE SEVERE CRACKS IN BOTH INTERIOR AND EXTERIOR SIDEWALLS. ALL TIRES WERE REPLACED. THE ORIGINAL DEALER WAS IMMEDIATELY NOTIFIED OF THE PROBLEM BECAUSE THE VEHICLE'S TIRES HAD BEEN INSPECTED THE MONTH BEFORE THE BLOW OUT. THE DEALER DETERMINED THE CRACKS WERE NOT NOTICEABLE ON THE TIRES AT THE TIME OF INSPECTION.  UPDATED 7/11/2006 - THE MANUFACTURER WAS CONTACTED AND INFORMED THE CONSUMER THAT THEY WERE NOT INTERESTED IN THE PROBLEM.  *NM",
        "vin": "TRUTC28N041"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/28/2005",
        "dateOfIncident": "08/27/2004",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10112288,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "TT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "VOLKSWAGEN OF AMERICA DBA AUDI OF AMERICA INITIATED A RECALL ON MY CAR, ALLEGING THERE WERE \"DEFECTIVE WELDS\" IN A SEAM ON THE CLUTCH.  THE RECALL IS DOCUMENTED UNDER RECALL CAMPAIGN \"JA\".  AUDI SENT ME NOTICE THAT THEY WERE GOING TO REPLACE THE CLUTCH.    AUDI OF AMERICA SENT A NOTICE TO THEIR DEALERS PERFORMING THE RECALL WORK, THAT THERE WAS, \"ADDITIONAL CORRECTIVE ACTION\" THEY WANTED PERFORMED TO THE CAR DURING THE RECALL.  THEY DID NOT DISCLOSE THIS ACTION TO ME OR OBTAIN MY PERMISSION TO PERFOM THE \"ADDITIONAL CORRECTIVE ACTION\".    WHEN MY CAR WAS RETURNED TO ME, THE DEALER, APPARENTLY UNDER INSTRUCTION FROM AUDI OF AMERICA, DISABLED AN ELECTRONIC FEATURE OF THE CAR, ELECTRONIC LAUNCH CONTROL, THAT WAS OPERATING PRIOR TO TAKING THE CAR IN FOR THE RECALL.  AUDI OF AMERICA AND THE DEALER DID THIS WITHOUT MY KNOWLEDGE OR CONSENT.  AUDI OF AMERICA REFUSES TO RESTORE THE FEATURE TO THE CAR, OR PROVIDE ANY EXPLANATION JUSTIFYING THEIR ACTION.",
        "vin": "TRUWF28N841"
    }
]