[
    {
        "components": "STEERING,SERVICE BRAKES,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/06/2017",
        "dateOfIncident": "01/23/2016",
        "fire": false,
        "manufacturer": "Diamond Coach Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10993388,
        "products": [
            {
                "manufacturer": "Diamond Coach Corporation",
                "productMake": "DIAMOND COACH",
                "productModel": "E350",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "SEE ATTACHED 2 DOCUMENTS",
        "vin": "1FBSS31L95H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/30/2008",
        "dateOfIncident": "01/06/2004",
        "fire": false,
        "manufacturer": "Diamond Coach Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10229275,
        "products": [
            {
                "manufacturer": "Diamond Coach Corporation",
                "productMake": "DIAMOND COACH",
                "productModel": "E350",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MY REDMAN POWER STAND-UP WHEEL CHAIR FALLS FORWARD WHEN GOING UP INTO A STANDING POSITION. OTHER OWNERS OF THIS PARTICULAR CHAIR HAVE THE SAME PROBLEM. THE CHAIR ALSO TIPS BACKWARDS GOING UP A RAMP INTO A VAN, ALSO THE RAMP TO THE HOUSE. THE CHAIR WAS DELIVERED INCOMPLETE THREE TO FOUR MONTHS AFTER PROMISED DATE OF DELIVERY. RECEIVED THE MISSING PARTS TWELVE MONTHS AFTER I PAID FOR THE CHAIR. FIRST CHANCE TO TRY IT OUT. I WENT TO ARBITRATION COURT, THE COMPANY WAS ORDERED TO REFUND MY MONEY AND PICK UP THE CHAIR.  THAT WAS MAY 5TH 2006. THEY HAVE YET TO DO SO BUT THEY PUT FULL PAGE ADS IN THE DISABLE MAGAZINES. I CAN'T TRADE IT IN BECAUSE THEY DON'T WANT IT.  I TRIED GIVING IT AWAY BUT THE DEALERS AND THERAPIST ADVISED PARTIES NOT TO USE THE REDMAN STAND-UP CHAIR BECAUSE THEY ARE TOO DANGEROUS.  ONE LADY IN TEXAS RECEIVED HER NEW CHAIR, PAID FOR BY MEDICARE AND THE FIRST TIME SHE USED IT, IT FELL FORWARD.  REDMAN OFFERED TO REPAIR THE NEW CHAIR FOR $4,100.  THEY QUOTED ME $4,100 TO REPAIR THE STAND-UP AND ANOTHER $4,100 TO MAKE IT RECLINE AS THE BROCHURE STATED AND THEY PROMISED ME IT WOULD.  *TR",
        "vin": "SRX10700020"
    }
]