[
    {
        "components": "STRUCTURE,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "12/01/2011",
        "dateOfIncident": "09/02/2011",
        "fire": false,
        "manufacturer": "Exiss Aluminum Trailers, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10437985,
        "products": [
            {
                "manufacturer": "Exiss Aluminum Trailers, Inc.",
                "productMake": "EXISS",
                "productModel": "HORSE TRAILER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 EXISS SPORT TRAILER. THE CONTACT STATED THAT THE SCREWS TO THE REAR SADDLE POST BECAME LOOSE, CAUSING THE SADDLE BAR TO DETACH FROM THE VEHICLE AND BURST THROUGH THE REAR DOOR. THE CONTACT WAS STRUCK IN THE FACE BY THE SADDLE RACK HOLDING THREE SADDLES APPROXIMATELY 300 LBS. OF TOTAL WEIGHT.  SUSTAINED INJURIES.  THE CONTACT SPOKE WITH THE MANUFACTURER AND THE PARTS FOR THE REPAIR WERE SENT TO THE CONTACT. THE TRAILER WAS REPAIRED AT THE MANUFACTURER'S EXPENSE. THE FAILURE MILEAGE WAS NOT AVAILABLE.  UPDATED 01/20/12*LJ  UPDATED 03/16/12     UPDATED 05/12/2012   *JS",
        "vin": "4LAAH222145"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/18/2007",
        "dateOfIncident": "03/21/2007",
        "fire": false,
        "manufacturer": "Exiss Aluminum Trailers, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10196711,
        "products": [
            {
                "manufacturer": "Exiss Aluminum Trailers, Inc.",
                "productMake": "EXISS",
                "productModel": "HORSE TRAILER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "7/22/06 , WE PULLED OUR EXISS SPORT 407 HORSE TRAILER UP TO OUR PROPERTY IN FLAGSTAFF.  WE ARRIVED AT 10 AM  AND  DISCONNECTED THE TRAILER.  AT  11 PM THE TRAILER FELL DOWN ONTO THE BED OF THE  TRUCK, DAMAGING THE BED.  THE JACK COLLAPSED.  3/21/07 WHEN WE GET HOME FROM AN OUTING WE DISCONNECTED THE TRAILER AND  RAISED IT OFF THE TRUCK.  JUST AS I WALKED OUT FROM UNDER THE NOSE OF THE TRAILER FROM PUTTING THE LIGHT CORD AS THE TRAILER FELL TO THE GROUND AND MISSED HITTING ME BY 5-6 INCHES.  AT 10 PM, I RAISES THE TRAILER UP WITH A 2 TON FLOOR JACK SO I CAN ATTEMPT TO SECURE IT IN THE PROPER POSITION.  THE NEXT MORNING, I FOUND  3 PIECES OF WHAT APPEARED  TO BE ALUMINUM, BUT  WAS AN EPOXY TYPE PRODUCT.   3 WEEKS AGO I TOOK THE TRAILER TO A DEALER IN PHOENIX, AND FOUND  A 4TH PIECE WHEN WE LEFT TO  PICK  IT UP.  IT APPEARED  THAT WHEN THE TRAILER WAS BEING MANUFACTURED SOMEONE MESSED UP IN DRILLING HOLES TO ATTACH THE JACK AND TRIED TO PLUG THEM WITH THIS COMPOUND . I HAVE PHOTOS OF THE DAMAGE TO THE TRUCK, THE JACK AND THESE PIECES THAT CAME OFF THE TRAILER.  EXISS IS REFUSED  TO PAY FOR THE DAMAGE TO THE TRAILER, STATING THAT IT WAS  OUT OF WARRANTY, ONLY ORIGINAL OWNER WAS COVERED. WE BOUGHT THIS TRAILER IN JUNE 2006, IT WAS DELIVERED ON JUNE 23, 2006 TO US)  CURRENTLY, THE TRAILER WAS  STILL AT THE DEALER, WHO  WAS  TRYING THE BEST TO GET IT FIXED  THROUGH EXISS,  AND WE HAD NO TRAILER TO USE FOR BUSINESS. WE SHOW HORSES.   THE  FIRST  TIME IT HAPPENED WE WERE WILLING TO THINK THERE WAS AN OUTSIDE POSSIBILITY THAT WE DID SOMETHING WRONG , ALTHOUGH WE ALWAYS CHECK AND DOUBLE CHECK THE TRAILER, EACH AND EVERY TIME IT WAS  CONNECTED, AND DISCONNECTED.  AFTER THE SECOND  INCIDENT THAT ALL BUT COULD HAVE KILLED ME, WE KNEW IT WASN'T OUR FAULT.  THIS LEFT  ME WITH A TRAILER THAT  WAS UNSAFE TO LEAVE UNCONNECTED TO A VEHICLE, RENDERING THE TRAILER COMPLETELY USELESS AS THE MAIN SUPPORT BEAM  IN A STATE THAT HAS GREATLY COMPROMISED THE STRUCTURAL INTEGRITY OF THIS TRAILER.*AK",
        "vin": ""
    }
]