[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/15/2021",
        "dateOfIncident": "10/17/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440429,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "Unknown the four wheel drive was out when I purchased it I didn't realize until later that day when I drove it and tried to engage it. It no longer works and it is a safety hazard to even try and turn on it doesn't engage and makes a noise and catches in some sort of way I believe it may have affected the transmission as well. My safety and the safety of others could be at risk if I try and use the four wheel drive and it's needed for hazardous road conditions in my area like snow and ice",
        "vin": "1d7hg42k04s"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/04/2020",
        "dateOfIncident": "11/04/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11373056,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLES DRIVE SHAFT FELL OFF WHILE MAKING A STOP AT A RED LIGHT, THE PINON NUT HAD COME LOOSE. IT WAS TOWED TO A MECHANIC'S SHOP, MY DAD CAME AND REATTACHED IT. IT STILL MADE A WHIRRING SOUND, AT FIRST I WAS ON THE WAY TO THE MECHANIC FOR WHAT I THOUGH WAS A PINON SEAL LEAK.",
        "vin": "1D7HG42N84S"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/13/2020",
        "dateOfIncident": "05/09/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309021,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANS SHIFT SOLENOID CONTROL PACK CODE POPPED UP AND DOES NOT SHIFT SMOOTHLY AT ALL",
        "vin": "1D7HG48N54S"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/23/2018",
        "dateOfIncident": "02/16/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11112957,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "SHIFTER WILL MOVE WITHOUT KEY IN IGNITION. WILL ROLE IN ANY DIRECTION  IN ANY POSITION BUT PARK.  CAN REMOVE KEY FROM IGNITION WHILE RUNNING.  WHILE IT'S STILL RUNNING WITH KEY OUT CAN SHIFT AND DRIVE.  OTHER TIMES WHEN I GO TO START ENGINE THE KEY WON'T TURN.  I HAVE TO HIT THE END OF THE KEY WITH THE PALM OF ONE HAND WHILE THE OTHER TURNS IT.  REPLACED THE BALL JOINTS THE FIRST OF THIS YEAR AND VEHICLE ONLY HAD 87000 MILES AT THE TIME.  CHANGED BRAKES AND HAD TO HAVE ROTOR TURNED. DRIVER SIDE BRAKE CALIPER PLUNGER HAD MULTIPLE PIECES BREAK OFF GETTING STUCK BETWEEN BREAK PAD AND REMAINING PIECES OF PLUNGER CASTING THE VEHICLE TO PULL LEFT WHILE DRIVING.  WHEN APPLYING THE BREAK IT PULL SO HARD IT CAUSED ME TO START GOING  INTO ANOTHER LANE BARELY MISSING THE SIDE OF ANOTHER VEHICLE.",
        "vin": "1D7GG16K84S"
    },
    {
        "components": "VISIBILITY,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/06/2018",
        "dateOfIncident": "01/02/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11100125,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 DODGE DAKOTA. WHILE THE VEHICLE WAS PARKED, THE REAR PASSENGER SIDE WINDOW BECAME DISLODGED FROM THE VEHICLE, FELL TO THE GROUND, AND SHATTERED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC AND IT WAS DIAGNOSED THAT THE WINDOW REGULATOR FAILED. THE REGULATOR WAS REPLACED AND THE FAILURE WAS REMEDIED. THE LOCAL DEALER (ROB LAMBDIN'S UNIVERSITY DODGE RAM IN DAVIE, FL) AND THE MANUFACTURER WERE BOTH NOTIFIED OF THE FAILURE, BUT NO ASSISTANCE WAS OFFERED. THE CONTACT INDICATED THAT OVER THE YEARS, THE FAILURE OCCURRED ON FOUR SEPARATE OCCASIONS ON THE FRONT DRIVER'S SIDE WINDOW, THREE TIMES ON THE REAR DRIVER'S SIDE WINDOW, THREE TIMES ON THE REAR PASSENGER SIDE WINDOW, AND THREE TIMES ON THE FRONT PASSENGER SIDE WINDOW. THE FAILURE MILEAGE WAS 10,000.",
        "vin": "1D7HL38N44S"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/14/2018",
        "dateOfIncident": "02/02/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11093647,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STEERING IS VERY HARD TO TURN EITHER LEFT OR RIGHT AT MOST TIMES.  FEELS AS IF THE POWER STEERING HAS FAILED, BUT HAD IT INSPECTED BY MECHANIC AND SAYS POWER STEERING PUMP AND BELTS ARE FINE.  THIS DIFFICULTY IN STEERING IS ALSO ACCOMPANIED BY A GRINDING TYPE OF NOISE IN THE STEERING COLUMN BEHIND THE STEEING WHEEL.  IT HAS BECOME MORE THAN JUST AN OCCASIONAL ANNOYANCE BUT RATHER A MORE PERMANENT SAFETY ISSUE SINCE MY WIFE IS NO LONGER ABLE TO USE THE TRUCK BECAUSE OF THE DIFFICULTY WITH THE STEERING. PLEASE ADVISE ON WHAT MAY BE THE CAUSE AND IF THE MANUFACTURER IS AWARE OF SIMILAR PROBLEMS WITH OTHER DAKOTA PICK UPS AND IF THEY HAVE ISSUED A RECALL IN THE PAST TO REMEDY THE PROBLEM.  I AM HOPING TO HAVE THIS RESOLVED QUICKLY SINCE I FEAR IT MAY ONLY LEAD TO SOME TRAGIC OR CATASTROPHIC RESULT.  THANK YOU",
        "vin": "1D7HG38K945"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "12/18/2017",
        "dateOfIncident": "11/01/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11055280,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 DODGE DAKOTA. WHEN THE HEATER WAS ACTIVATED, THERE WAS NO AIR FLOW DISTRIBUTED INTO THE VEHICLE. THE LOCAL DEALER WAS NOT CONTACTED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE AND ADVISED THE CONTACT TO TAKE THE VEHICLE TO THE LOCAL DEALER AT HIS OWN EXPENSE. THE FAILURE MILEAGE WAS 97,448.",
        "vin": "1D7FL46K54S"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "06/08/2017",
        "dateOfIncident": "05/19/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10994034,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER HEADLIGHT QUIT WORKING. I WENT TO THE STORE TO REPLACE IT THINKING IT HAD BURNT OUT. WHEN I REPLACED THE LIGHT IT DID NOT WORK STILL AND THE OLD HEADLIGHT STILL HAD BOTH FILAMENTS PROVING IT WAS STILL GOOD. I TOOK THE TRUCK TO THE DEALERSHIP AFTER BOTH HEADLIGHTS QUIT WORKING ON ME WHEN I WAS OUT AT NIGHT DRIVING LESS THAN A 10TH OF A MILE FROM HOME. I MANAGED TO NOT GET IN AN ACCIDENT. THE DEALERSHIP TOLD ME THAT THE CTM AND HEAD LIGHT SWITCH WERE BAD HOWEVER THE CTM WAS A \"OBSOLETE\" PART AND THEY WERE UNABLE TO GET ME ONE. AFTER THEY RELEASED MY TRUCK BACK TO ME  TO DRIVE AS I PLEASE, I WAS ABLE TO PURCHASE AN OLDER CTM FROM A 2003 4X4 AUTOMATIC DAKOTA 4.7L. NOW MY LIGHTS WORK AND I HAVE A \"GUARANTEE\" FROM THE EBAY SELLER THAT IT WILL WORK FOR 6 MONTHS.     I HAVE A SERIOUSLY DANGEROUS VEHICLE AND I CAN NOT TRUST MY HEADLIGHTS WILL NOT GO OUT AT ANY TIME SO I CAN NOT DRIVE IT AT NIGHT IN GOOD CONFIDENCE OR MORAL CONSCIENCE.        THE DEALERSHIP LILITHIA DODGE OF ROSEBURG OREGON HAS RECORD OF MY TRUCK BEING IN THEIR POSSESSION FOR MULTIPLE DAYS BEFORE RELEASING IT BACK INTO MY POSSESSION WITHOUT DOING ANYTHING BUT A DIAGNOSTICS TEST.",
        "vin": "1D7HG48N34S"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/28/2017",
        "dateOfIncident": "03/03/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10969091,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEATER BLOWER RESISTOR KEEPS BURNING UP. I HAVE REPLACED THE RESISTOR VARIOUS TIMES AND IT KEEPS BURNING UP. I REPLACED THE BLOWER MOTOR AND THE RESISTOR KEEPS BURNING UP. I HAD THE VEHICLE CHECKED FOR AN ELECTRICAL SHORT CIRCUIT AND IT HAS NONE. THE WIRING TO THE RESISTOR ALSO BURNS UP. I CHECKED THE INTERNET AND THERE ARE NUMEROUS REPORTS AND COMPLAINTS OF THE SAME PROBLEM WITH MANY OWNERS OF THE SAME TYPE OF VEHICLE. IN ONE OF THE CASES THE RESISTOR CAUSE A FIRE INSIDE THE VEHICLE AND THE VEHICLE BURNED DOWN. THIS PROBLEM HAS BEEN OCCURRING ON THESE VEHICLES FOR A LONG TIME AND IT HADN'T BEEN REPORTED TO THE MANUFACTURER. I AM AFRAID THAT SOMEDAY THE VEHICLE WILL CATCH ON FIRE BECAUSE OF THIS ISSUE. I KEEP ON REPLACING THE RESISTOR AND THE HARNESS EVERY TIME IT BURNS AND I'VE ALSO REPLACED THE BLOWER MOTOR. I CAN'T SEEM TO GET ANSWER FROM ANYONE FROM DODGE OR CHRYSLER ON THIS PROBLEM. AT THE TIME THAT THE RESISTOR BURNED DOWN THE VEHICLE WAS RUNNING ON THE CITY STREETS AT 30 MPH. IT HAS HAPPENED VARIOUS TIMES ON THE SAME RUNNING SENARIO.",
        "vin": "1D7HL48N44S"
    },
    {
        "components": "EXTERIOR LIGHTING,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "03/24/2017",
        "dateOfIncident": "03/06/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10968286,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "SPORT UTILITY",
                "productYear": "1994",
                "type": "Equipment"
            }
        ],
        "summary": "DRIVING ON A RAINY NIGHT AND HEADLIGHTS AND WIPERS QUIT WORKING ALL AT ONCE.  CENTRAL TIMER MODULE FAILED AND SHUT THE LIGHTS AND WIPERS OFF AS WELL AS INTERIOR LIGHTS AND DOOR LOCKS.  ALMOST DIDN'T GET VEHICLE STOPPED WITHOUT WRECKING.  LEFT VEHICLE AND CAME BACK DURING DAYLIGHT AND DROVE TO REPAIR SHOP. WHERE LOCATED THE ISSUE WAS A FAILED CENTRAL TIMER MODULE.  CONTACTED DODGE AND SAID ITS OUT OF WARRANTY?  ITS NOT ABOUT WARRANTY OR NOT IT COULD HAVE THE POTENTIAL FOR A FATALITY.  STILL HAVE THE OLD CTM IF ANYONE IS INTERESTED IN LOOKING INTO THE MATTER.  WHY WOULD HEADLIGHTS BE RAN THROUGH A MODULE LIKE THIS JUST ASKING FOR TROUBLE.",
        "vin": "1D7HG48N94S"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/10/2016",
        "dateOfIncident": "05/23/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10934333,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG LIGHT CAME ON TOOK IT TO DEALER THEY SAID IT WAS CLOCK SPRING WENT BAD ,I HAD IT REPLACED WITH NEW ONE . I HAD TO BRAKE FAST TO AVOID HITTING AND AIR BAG CAME ON AGAIN.  THESE THINGS COST 100.00 WHAT IS UP WITH THAT?",
        "vin": "1D7HG42N74S"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/22/2016",
        "dateOfIncident": "10/15/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10927591,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I STARTED MY VEHICLE AND COULD NOT GET MY HEADLIGHTS TO TURN ON. ALL CONNECTIONS AND BULBS WERE CHECKED BY A MECHANIC AND THE PROBLEM HAS BEEN TRACED TO THE CTM (CENTRAL TIMING MODULE). THESE UNITS ARE ON NATIONWIDE BACK ORDER.  THIS IS A SERIOUS SAFETY ISSUE AND A SERIOUS REPLACEMENT ISSUE IF PEOPLE ARE LOSING THEIR HEADLIGHTS AND THE PART IS ON AN UNKNOWN BACK ORDER SITUATION.",
        "vin": "1D7HG38N14S"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/16/2016",
        "dateOfIncident": "11/07/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10926505,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE VEHICLE IS PARKED AND ENGINE RUNNING, I NOTICE SMOKE AND BURNING SMELL OF PLASTIC COMING FROM BLOWER FAN MOTOR UNIT.   PLEASE TELL ME IS THERE ANY TECHNICAL SERVICE BULLETINS ON THIS PROBLEM AND HAVE YOU RECEIVED ANY OTHER COMPLAINTS ON THIS PROBLEM FROM OTHERS.  ENGINE SIZE 3.7L V6.",
        "vin": "1D7GL32KX4S"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/08/2016",
        "dateOfIncident": "07/07/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10883633,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WIRING TO BLOWER MOTOR RESISTOR GETS SO HOT IT MELTS THE WIRE COVERING AND THE PIGTAIL.  IN THE LAST 2 YEARS, HAVE REPLACED THE PIGTAIL 3 TIMES, THE WIRING ONCE, THE RESISTOR TWICE, THE BLOWER MOTOR ONCE, AND THE WHOLE FAN UNIT ONCE.  JUST BURNT UP AGAIN WHILE AIR CONDITIONER WAS RUNNING.  IT HAS ALSO BURNT UP WHILE USING THE HEATER IN WINTER.",
        "vin": "1D7HG48N24S"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/16/2016",
        "dateOfIncident": "07/02/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10865050,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2004 DODGE DAKOTA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V313000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "1D7HE48N55S"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/27/2016",
        "dateOfIncident": "09/18/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10861675,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 DODGE DAKOTA. WHILE DRIVING AT ANY SPEED, THE DRIVER SIDE AIR BAG LIGHT ILLUMINATED ON AND OFF. THE VEHICLE WAS TAKEN TO THE DEALER, BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 52,000.",
        "vin": "1D7HG48N34S"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/13/2015",
        "dateOfIncident": "08/11/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10781713,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "ISSUE WITH THE STEERING, APPEARED TO BE A PROBLEM WITH THE PUMP.  OCCURRED AT ABOUT 50K MILES, 6 YRS.  WHILE DRIVING THE STEERING WOULD GET HARD LIKE THE PUMP HAD FAILED, AND THEN WITHOUT WARNING, WOULD RETURN TO THE POWER ASSIST AND OVER STEER DUE TO THE PRESSURE I WAS ALREADY EXERTING.  THIS TOOK PLACE AT ALL SPEEDS AND UNDER CITY AND HIGHWAY CONDITIONS.  VERY DISCONCERTING.  AFTER ABOUT A WEEK OF THIS I TOOK IT TO THE DEALER.  THEY DETERMINED IT WAS A FAILING FLUID CONTROL VALVE IN THE POWER STEERING PUMP AND REPLACED IT.  IT WAS COVERED UNDER THE EXTENDED WARRANTY I HAD PURCHASED BUT WOULD HAVE COST OVER $1500.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/06/2015",
        "dateOfIncident": "04/15/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10780230,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 DODGE DAKOTA. WHILE DRIVING APPROXIMATELY 5 MPH, THE GEAR SHIFTED INTO NEUTRAL WITHOUT WARNING. THE CONTACT COASTED THE VEHICLE TO THE SIDE OF THE ROAD. THE VEHICLE WAS NOT TAKEN TO A LOCAL DEALER OR AN INDEPENDENT MECHANIC FOR DIAGNOSTIC TESTING DUE TO COST. THE FAILURE RECURRED AND THE CONTACT UNPLUGGED THE SERVO MOTOR. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 159,000.",
        "vin": "1D7HG38N04S"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/08/2015",
        "dateOfIncident": "05/13/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10762291,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "SMELL OF BURNT WIRE/PLASTIC. BLOWER CONTROL SWITCH WOULD NOT WORK (BLOWER MOTOR WOULD NOT RUN). BLOWER MOTOR RESISTOR AND PIGTAIL CONNECTION WERE MELTED AND FUSED TOGETHER. THIS WAS IN 2010, IT IS NOW 2015 AND I JUST HAD THE SEVENTH RESISTOR PUT IN WITH THE FIFTH PIGTAIL. THE TIME BEFORE THIS LAST NIGHTMARE, I ALSO HAD THE BLOWER MOTOR REPLACED IN CASE IT WAS THE CAUSE OF THE RESISTOR AND PIGTAIL CONNECTION ISSUES.",
        "vin": "1D7GL32K44S"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/10/2015",
        "dateOfIncident": "08/10/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10747448,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 DODGE DAKOTA. WHILE ACCELERATING AT A LOW SPEED, THE CONTACT HEARD AN ABNORMAL NOISE COMING FROM THE REAR OF THE VEHICLE. IN ADDITION, WHILE A STOP, THE VEHICLE OVERHEATED AND THE TEMPERATURE GAUGE INCREASED. THE FAILURE RECURRED ON NUMEROUS OCCASIONS. THE VEHICLE WAS TAKEN TO MULTIPLE INDEPENDENT MECHANICS, WHO DIAGNOSED THAT THE FRONT, UPPER AND LOWER BALL JOINTS, STRUTS, CONTROL ARMS, IDLE ARMS, CONTROL ARM BUSHINGS NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 130,000.",
        "vin": "1D7HL48N94S"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/03/2015",
        "dateOfIncident": "02/07/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10745690,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT MY DODGE DAKOTA BRAND NEW FROM A DEALER. I STARTED TO HAVE PROBLEMS WITH IT ALMOST IMMEDIATELY AFTER PURCHASE. I'LL BRIEFLY LIST THESE FAILURES. WHILE DRIVING IN VERY COLD WEATHER (WINTER). I WAS DRIVING WITH THE HEATER ON, A LARGE VOLUME OF ENGINE COOLANT CAME POURING OUT OF THE DASHBOARD HEATER VENTS. THIS WAS REPAIRED BY THE DEALER. WITHIN THAT SAME YEAR THE FUEL GAUGE AND CHECK ENGINE LIGHT WOULD COME ON WHENEVER THE GAS TANK BECAME HALF EMPTY. AT THIS POINT THE FUEL GAUGE WOULD DROP TO ZERO FUEL, CORRECTS WHEN GAS CAP IS TIGHTENED OR FUEL IS ADDED. PLASTIC PIECE BROKE OFF IN TRANSMISSION AT ~ 52,000 MILES, I HAD IT REPLACED AND NOW HAVE A CRACK IN EXHAUST MANIFOLD WHICH CAUSED THERMOSTAT FAILURE, WATER PUMP FAILURE AND LEAKING OF ALL OF THE ENGINE COOLANT. UNABLE TO WELD THE MANIFOLD AND MECHANIC HAD TO INSTALL HEAT SHIELD TO PREVENT ALL OF THIS FROM HAPPENING AGAIN. NOW WHEN I START THE VEHICLE IS SOUNDS LIKE IT MIGHT EXPLODE! THIS HORRENDOUS NOISE SOFTENS AFTER A FEW MINUTES. I DON'T RUN THE HEATER ANYMORE AS I SMELL A VERY STRONG ODOR OF EXHAUST FUMES WHEN HEATER FAN IS ON. VEHICLE OCCASIONALLY SHUTS OFF WHEN IDLING AT ~500RPM.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/18/2015",
        "dateOfIncident": "01/07/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10684139,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERMITTENT STEERING. SOMETIMES WHEN TURNING LEFT OR RIGHT, STEERING WILL NOT RETURN TO CENTER . NOW THIS DOES NOT HAPPEN ALL THE TIME. SOMETIMES IT WILL HAPPEN THEN AFTER DRIVING AWHILE IT WILL CLEAR UP. BUT THIS HAS BEEN AN ONGOING PROBLEM. CHECKED POWER STEERING FLUID,AIR PRESSURE. LOOKED AT OTHER FORUMS FOR THIS COMMON PROBLEM. CONSENSUS IS THE STEERING RACK AND/OR THE INTERMEDIATE SHAFT. WENT AND HAD STEERING RACK AND LOWER SHAFT REPLACED AND IT CURED THE PROBLEM ABOUT 97 PERCENT.  DODGE SHOULD HAVE A RECALL FOR SAFETY REASONS AS THIS COULD INVOLVE FATALITIES .   *TR",
        "vin": "1D7HG42N54S"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/01/2015",
        "dateOfIncident": "01/07/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10680384,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "GOT IN VEHICLE AND STARTED TO DRIVE WHEN I NOTICED MAKING A TURN THE  STEERING WHEEL WOULD NOT RETURN TO CENTER. THE STEERING WAS REAL HEAVY LIKE THE POWER STEERING WAS FAILING. CHECKED POWER STEERING FLUID-IT WAS OKAY,TIRE PRESSURE WAS OK. AS I CONTINUED TO DRIVE THE STEERING GOT BETTER. SINCE THAT INCIDENT THE PROBLEM WITH THE STEERING COMES AND GOES. I WENT ON THE WEB AND FOUND OUT HOW MANY MORE 2004 DODGE DAKOTA TRUCK OWNERS ARE HAVING THE SAME PROBLEM. THE STEERING PROBLEM SEEMS TO BE IN THE INTERMEDIATE SHAFT AND/OR THE STEERING RACK. THERE SHOULD BE A RECALL FOR THIS SAFETY PROBLEM OR A CLASS ACTION. ALSO THE 2004 DAKOTA BALL JOINTS WENT OUT AT 60000 MILES AT MY EXPENSE. THERE WAS A RECALL FOR 2003 DAKOTA BALL JOINTS BEING BAD BUT NOT 2004. I HAD BOUGHT A 1993 DAKOTA  BRAND NEW AND BOUGHT THE 2004 DAKOTA BRAND NEW BUT I MIGHT HAVE TO RECONSIDER GOING TO ANOTHER MAKE IF THE STEERING DOES NOT GET REMEDIED BY DODGE.  *TR",
        "vin": "1D7HG42N54S"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "12/15/2014",
        "dateOfIncident": "06/28/2007",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10664214,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SEAT RECLINE WHEN DRIVING.  *TR",
        "vin": "1D7HL38K14S"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/12/2014",
        "dateOfIncident": "10/06/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10654496,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 DODGE DAKOTA. THE CONTACT STATED THE AIR BAG LIGHT ILLUMINATED. THE FAILURE RECURRED ON NUMEROUS OCCASIONS. THE VEHICLE WAS TAKEN TO A DEALER. THE TECHNICIAN DIAGNOSED THAT THE AIR BAGS NEEDED TO BE REPLACED. THE FAILURE HAD NOT BEEN REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE APPROXIMATE FAILURE MILEAGE WAS 63,000.",
        "vin": "1D78G48N34S"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/14/2014",
        "dateOfIncident": "06/02/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10644600,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STEERING IS HARD WHEN THE VEHICLE IS COLD. . WHEN YOU TURN THE STEERING WHEEL IS STIFF  AND HARD TO TURN AND DOES NOT GO BACK TO A NEUTRAL POSITION. YOU HAVE TO MANUALLY TURN THE STEERING WHEEL BACK TO STRAIGHTEN IT OUT. WHEN THE VEHICLE IS DRIVEN FOR A HOUR THE STEERING IMPROVES. I HAVE SEEN MANY OTHER COMPLAINTS ABOUT THE SAME PROBLEM WITH THE SAME VEHICLE. IT IS A SAFETY HAZARD.  *TR",
        "vin": "1D7HL48K64S"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/06/2014",
        "dateOfIncident": "09/12/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10641720,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 DODGE DAKOTA. WHILE DRIVING APPROXIMATELY 65 MPH, THE DRIVER SIDE WINDOW OPENED INDEPENDENTLY AND THE GLASS BECAME STUCK IN THE DOWN POSITION. THE DEALER DIAGNOSED THAT THE REGULATOR FAILED. THE VEHICLE WAS REPAIRED TWICE, BUT THE FAILURE RECURRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 46,803.",
        "vin": "1D7HL48N34S"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/06/2014",
        "dateOfIncident": "09/04/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10631271,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUCK T-BONED ANOTHER AT ~25MPH.  NEITHER AIRBAG DEPLOYED CAUSING BROKEN HAND TO DRIVER.  *TR",
        "vin": "1D7HG42N54S"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/03/2014",
        "dateOfIncident": "10/01/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10607964,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "PAINT PEELING, RUST ON REAR FENDERS AND OTHER SPOTS.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/01/2014",
        "dateOfIncident": "05/14/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10595424,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING WAS LOOSE AT FIRST BUT BECAME VERY HARD TO TURN AT ANY SPEED.CHANGED THE RACK,WITH SAME PROBLEM. I THAN CHANGED THE STEERING PUMP WITH LITTLE TO NO SUCCESS.  *TR",
        "vin": "1D7GL42K64S"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/13/2014",
        "dateOfIncident": "04/01/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10588245,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTICED  A PROBLEM WITH THE POWER STEERING ON MY 2004 DODGE DAKOTA AT THE BEGINNING OF APRIL.  THE STEERING IS STIFF AND HARD TO TURN.  IT REQUIRES ASSISTANCE TO BRING THE STEERING WHEEL BACK TO CENTER. IT DOESN'T MATTER WHAT SPEED YOU ARE GOING.  IT SEEMS TO GET BETTER AFTER ABOUT 30 MINUTES OF DRIVING BUT AFTER SITTING FOR A WHILE THE PROBLEM IS BACK.  I BOUGHT THE TRUCK LAST YEAR AS A SECOND VEHICLE AND NOW REGRET DOING SO.  I HAVE HAD THE TRUCK TO THE DEALERSHIP TWICE.  4/14/14 THEY REPLACED THE LOWER BALL JOINTS, FRONT ROTORS AND POWER STEERING PUMP.  THAT DID NOT FIX THE PROBLEM. 4/24/14 THEY REPLACED THE STEERING RACK.  $2,300.00 LATER THE PROBLEM STILL EXISTS.  IT IS GOING BACK TO THE DEALERSHIP 5/14/14 BUT I HAVE MY DOUBTS THE PROBLEM WILL BE FIXED AFTER READING OTHER COMPLAINTS ONLINE.  I HAVE CONTACTED CHRYSLER ABOUT THIS AND HAVE BEEN ASSIGNED A CASE MANAGER. I AM WAITING TO HEAR WHAT THEY HAVE TO SAY. I DO NOT WISH TO SPEND ANYMORE MONEY TRYING TO FIX A DESIGN FLAW IN THEIR STEERING COMPONENTS. THE STEERING POSES A SAFETY ISSUE AND I DO NOT FEEL COMFORTABLE DRIVING IT VERY FAR.  *TR",
        "vin": "1D7GG36N14S"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/19/2014",
        "dateOfIncident": "04/12/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10583700,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "AT VARIOUS TIMES THE BRAKES SEEM TO LOCK UP WHEN COMING TO A STOP QUICKLY.   THIS NEVER HAPPENS WHEN BRAKING NORMALLY, ONLY WHEN NEEDING TO BRAKE QUICKLY   AND HARD. ALSO HAPPENS AT TIMES DURING NORMAL BRAKING, BUT THEN NEEDING TO ACCELERATE, THEN BRAKING AGAIN QUICKLY. THIS IS DANGEROUS IN WET WEATHER AS THE BRAKES LOCK MOMENTARILY AND THE TIRES HYDROPLANE, IT APPEARS TO BE THE REAR BRAKES DOING THIS, THEY RELEASE QUICKLY BUT THE MOMENTARY LOCK-UP IS DANGEROUS. I TOOK IT TO A MECHANIC WHO DIDN'T FIND A CAUSE FOR THIS, BUT SAID MAYBE THE ABS WAS PERIODICAL FAILING, AS IT ONLY HAPPENS SPORADICALLY; BUT USUALLY WHEN NEEDING TO BRAKE HARD AS IN AN EMERGENCY. I'VE NEVER RECEIVED ANY RECALL ORDERS ON MY VEHICLE AND HAVE LIVED AT SAME ADDRESS SINCE PURCHASE OF VEHICLE.   *TR",
        "vin": "1D7GL12K74S"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/19/2014",
        "dateOfIncident": "09/18/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10583702,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HORN STOPPED WORKING, I TOOK IT TO A NON-DEALER MECHANIC WHO FOUND THE HORNS THEMSELVES OPERATIONAL WHEN APPLYING AN EXTERNAL RELAYED VOLTAGE TO THEM AND NO FUSES BLOWN, HE THOUGHT IT MAY BE A SHORT IN SYSTEM. HORN WOULD NOT WORK ON MANY OCCASIONS, THEN ONE DAY IT WORKED, THE NEXT DAY IT DID NOT. A COUPLE OF MONTHS LATER IT WOULDN'T WORK, I HAVE A TILT STEERING WHEEL SO I MOVED IT TO AN UPRIGHT POSITION, THE HORN STARTED WORKING, I PUT THE TILT WHEEL BACK DOWN AND IT STILL WORKED. THE NEXT DAY THE HORN WOULDN'T WORK EVEN IF MOVING THE TILT STEERING UP OR DOWN. IT SEEMS AS IF THERE MAY BE AN INTERMITTENT SHORT OF SOME KIND IN THE WIRING FOR THE HORN IN THE STEERING COLUMN. IT HAS AN AIR BAG SO IT ISN'T AN EASY INVESTIGATION. I HAVEN'T TAKEN IT TO A DEALER AS CHRYSLER WAS CLOSING OUTLETS AND I HAVEN'T FOUND ONE TO USE YET.  *TR",
        "vin": "1D7GL12K74S"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/26/2014",
        "dateOfIncident": "02/17/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10565972,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL-      THE CONTACT OWNS A 2004 DODGE DAKOTA. THE CONTACT STATED WHILE DRIVING 65 MPH, THE STEERING WHEEL BECAME DIFFICULT TO TURN. THE VEHICLE WAS TAKEN TO THE DEALER FOR INSPECTION WHERE THEY STATED THE RACK AND PINION NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED BUT THE FAILURE RECURRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 160,000.   RK",
        "vin": "1D7GL42N84S"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/27/2013",
        "dateOfIncident": "01/21/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10522021,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 DODGE DAKOTA. THE CONTACT STATED THAT WHEN THE ENGINE WAS COLD, THE POWER STEERING ASSIST WOULD FAIL AND THE STEERING WHEEL WOULD SEIZE. IN WARMER TEMPERATURES, THE STEERING WHEEL WOULD EASILY MOVE FROM SIDE TO SIDE BUT WOULD EXHIBIT DIFFICULTIES IN RETURNING TO A STRAIGHT POSITION.  THE CONTACT TOOK THE VEHICLE TO A MECHANIC AND THEY WERE UNABLE TO FIND A PROBLEM WITH THE STEERING. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 100,000 AND THE CURRENT MILEAGE WAS 120,000.  *TR",
        "vin": "1D7HG38N74S"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/31/2013",
        "dateOfIncident": "05/26/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10514510,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 DODGE DAKOTA. THE CONTACT STATED THAT WHILE DRIVING 15 MPH OVER A RAILROAD TRACK, THE FRONT DRIVER'S SIDE DROPPED ABNORMALLY. THE VEHICLE WAS TAKEN TO THE DEALER FOR INSPECTION WHERE THEY STATED THAT THE UPPER AND LOWER BALL JOINTS NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 94,480.",
        "vin": "1D7HG48N64S"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/29/2013",
        "dateOfIncident": "04/26/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10509812,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STEERING IN MY 2004 DODGE DAKOTA TRUCK WOULD GET STIFF WHILE TURNING AND THEN WOULD TURN EASY THEN BACK TO STIFF. IT IS VERY HARD TO CONTROL THE TRUCK WHILE MAKING TURNS. THE STEERING IS LIKE VERY UNSTABLE AND COULD CAUSE AN ACCIDENT. ARE THERE ANY RECALLS ON THIS ISSUE I SEE THAT THERE IS ALOT OF THIS HAPPENING TO THESE TRUCKS?  *TR",
        "vin": "1D7HG12K74S"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/12/2012",
        "dateOfIncident": "12/11/2012",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10488118,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 DODGE DAKOTA. THE CONTACT STATED THAT SHE STARTED THE VEHICLE AND NOTICED THAT CHECK ENGINE LIGHT ILLUMINATED ON THE INSTRUMENT PANEL. THE CONTACT TOOK THE VEHICLE TO THE DEALER FOR INSPECTION WHERE THEY STATED THAT THE FUEL TANK FAILED AND BEGAN TO LEAK GASOLINE FUEL. THE CONTACT WAS ADVISED THAT THE FUEL TANK NEEDED REPLACING. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 39,000.",
        "vin": "1D7GL42K94S"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/24/2012",
        "dateOfIncident": "11/24/2012",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10485917,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PARKED MY BLOWER MOTOR WIRING TO THE RESISTOR JUST WENT. THIS IS THE 4TH TIME IT HAS DONE THIS. NOW I AM WITH OUT A TRUCK AND ITS SNOWING AND COLD SO IT US INOPERABLE! I HAVE SEEN PLENTY OF OTHER PEOPLE WITH THE SAME PROBLEM I AM HAVING! THANK GOD I WAS NOT DRIVING WITH MY KIDS IN THE TRUCK WHEN IT WENT. THE WIRING MELTED SO THERE IS NOTHING I CAN DO TO REPLACE THE RESISTOR SO I HAVE TO REPLACE THE WHOLE WIRE HARNESS. THIS IN NOT THE FIRST TIME THIS HAS HAPPENED IN THESE TRUCKS! SOMETHING NEEDS DONE BEFORE SOMEONE GETS KILLED OVER THIS. *TR",
        "vin": "1D7HG48N44S"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/19/2012",
        "dateOfIncident": "10/19/2012",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10481196,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "A GOOD FRIEND OF MINE HAS THE EXACT SAME TRUCK AND HIS WHOLE TIRE FELL OFF GOING DOWN THE HIGHWAY. HE THANK  GOD DID NOT GET HURT OR HURT ANYONE ELSE IN THE PROSESS. HE TOLD ME THAT IN 2004 THEIR WAS A RECALL ON THE BALL JOINTS OF THIS VEHICLE. I BOUGHT MY TRUCK FROM A PRIVATE OWNER AND DO NOT HAVE A RECALL NOTICE OF MY OWN, IS THERE A WAY NOW THAT I AM THE 2ND OWNER OF THIS VEHICLE THAT I CAN STILL HAVE THIS RECALL BE TAKEN CARE OF AT A DEALERSHIP BEING THAT IT  IS UNDER 10 YEARS WITHIN THE RECALL TIME LIMIT. I DON'T WANT TO HAVE WHAT HAPPENED TO MY FRIEND HAPPEN TO ME. THANK YOU.  *TR",
        "vin": "1D7GG16K04S"
    },
    {
        "components": "SUSPENSION",
        "crash": true,
        "dateComplaintFiled": "08/02/2012",
        "dateOfIncident": "05/11/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10468980,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 DODGE DAKOTA 4X4. WHILE DRIVING APPROXIMATELY 10 MPH, THE CONTACT ATTEMPTED TO MAKE A TURN THEN UNEXPECTEDLY THE FRONT DRIVER'S SIDE WHEEL COLLAPSED DUE TO A FRACTURED BALL JOINT. THE VEHICLE CRASHED INTO A CEMENT POST IN A PARKING LOT. THERE WERE NO PERSONAL INJURIES. THE VEHICLE WAS TOWED TO THE CONTACT'S RESIDENCE. THERE WAS A RECALL ASSOCIATED WITH NHTSA CAMPAIGN ID NUMBER 04V596000 (SUSPENSION:FRONT:CONTROL ARM:UPPER BALL JOINT); HOWEVER THE VIN WAS NOT INCLUDED. THE VEHICLE HAD NOT BEEN REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 100,000.",
        "vin": "1D7HG38N84S"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/20/2012",
        "dateOfIncident": "02/15/2012",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10448580,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "ON FEB.15, 2012 WAS DRIVING AND WENT TO MAKE A TURN AND THE AFTER A QUARTER OF THE WAY INTO THE CURVE THE STEERING LOCKED UP AND BECAME VERY HARD TO TURN, CAUSING ME TO ALMOST HIT THE CAR SETTING AT THE LIGHT. AND SINCE THAT TIME THE STEERING IS HARDEST TO TURN WHEN COLD AND EASIER WHEN WARM. THE STEERING WHEN IT IS COLD IS STIFF WHEN YOU ARE A QUARTER THE WAY INTO THE CURVE AND THEN RELEASES THEN HARD AGAIN ALL IN THE SAME TURN, MAKING IT VERY DANGEROUS BECAUSE IT MAKES YOUR VEHICLE SWERVE AND BECOME RECKLESS. DODGE NEEDS TO ISSUE A RECALL ON THE DEFECTIVE STEERING PARTS. I HAVE BEEN TOLD IT BECAUSE OF POOR DESIGN AND LACK OF LUBRICATION POINTS CAUSING THE FAILURE. PLEASE MANDATE THAT THEY ISSUE A RECALL ON THIS VEHICLE FOR THIS PROBLEM, THANK YOU VERY MUCH.  *TR",
        "vin": "1D7HL38N44S"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/09/2012",
        "dateOfIncident": "10/03/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10447336,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "AROUND OCTOBER STARTED HAVING TROUBLE WITH STEERING WOULD BE TIGHT THEN LOOSEN UP IF IT WAS WARM. WHEN IT GOT COLDER IT GOT VERY HARD TO STEER. CHANGED THE RACK THEN EVERY TIME YOU WOULD TURN IT WOULD PULL TIGHT AND LET LOOSE AND MAKE TRUCK SWERVE. FIGURED MOST HAVE GOTTEN A DEFECTIVE PART CHANGED STEERING RACK AGAIN. SAME PROBLEM DECIDED TO CHANGE STEERING PUMP THIS TIME. SO MUCH FOR THAT IT DIDN'T HELP EITHER NOW I HAVE A WHINING NOISE ON TOP OF THE TIGHT STEERING. I HAVE ALREADY PUT ALOT OF MONEY INTO IT AND NOTHING SEEMS TO BE WORKING!!!!!!!!!  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/30/2012",
        "dateOfIncident": "01/30/2012",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10445953,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "BEGAN TO EXPERIENCE HEAVY, DIFFICULT STEERING, ESPECIALLY WHEN COLD, AND METALLIC CLUNKING OR GRINDING NOISES WHEN TURNING TIGHTLY AT LOW SPEEDS ACCOMPANIED BY POWER STEERING PUMP WHINE ON A 2004 DODGE DAKOTA 4.7L V8 4X4 QUAD CAB.  STEERING HAS ALSO BECOME ABNORMALLY HEAVY AT NORMAL DRIVING SPEEDS WITH DIFFICULTY CENTERING STEERING WHEEL AND REDUCED POWER STEERING ASSIST.  INSPECTION OF STEERING COMPONENTS REVEALED SEVERE RUST ON STEERING INTERMEDIATE SHAFT UPPER U JOINT CAUSED BY ROAD SALT AND MOISTURE, WHICH RESULTED IN STEERING DIFFICULTY AND STRAIN ON POWER STEERING SYSTEM.  THIS CONDITION IS EXTREMELY DANGEROUS DUE TO THE EXTRA EFFORT REQUIRED TO STEER THE VEHICLE.  LUBRICATING THE JOINT WITH GREASE TEMPORARILY ALLEVIATES THE ISSUE, BUT PROBLEM RETURNS AFTER A PERIOD OF TIME AND WILL REQUIRE EVENTUAL REPLACEMENT OF UPPER/LOWER INTERMEDIATE SHAFT(S) AT A PARTS COST OF APPROXIMATELY $226, PLUS LABOR.  INTERNET RESEARCH REVEALS THIS IS A WIDELY OCCURRING ISSUE ON THIS GENERATION OF DAKOTA PICKUP CAUSED BY POOR DESIGN (LACK OF LUBRICATION, NO PROTECTION FROM THE ELEMENTS, AND INADEQUATE RUST PROOFING) OF A CRITICAL STEERING COMPONENT, WHERE FAILURE CAN RESULT IN A SERIOUS SAFETY HAZARD BY MAKING THE VEHICLE MORE DIFFICULT TO STEER, AND THUS CHRYSLER GROUP LLC SHOULD BE HELD LIABLE FOR REPAIR COSTS OF THIS COMPONENT.   *TT",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/20/2012",
        "dateOfIncident": "05/15/2011",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10444695,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS THE SECOND TIME THIS HAS HAPPENED AN BEEN REPLACED...NOW IM GOING WITHOUT A HEATER BECAUSE THE BLOWER MOTOR RESISTOR STARTED SPARKING AN THE SMELL OF BURNING RUBBER AN MELTED PLASTIC FILLED THE CAB OF THE VEHICLE SO I QUICKLY PULLED OVER TO AVOID A ACCIDENT AN I REACHED UNDER TO THE TO WHARE THE RESISTOR IS LOCATED AN IT WAS SCORTCHING HOT TO THE TOUCH. IT LOOKS LIKE IT HAD STARTED TO CATCH FIRE. ARE YOU GUYS GOING TO WAIT UNTIL SOMEONE DIES OR GETS SERIOUSLY INJURED FOR THERE TO BE A RECALL ON THIS...THIS IS A SERIOUS SAFTEY ISSUE WITH ATLEAST 298 PEOPLE WITH THE SAME PROBLEM AND THATS JUST ONE WEBSITE, I HAVE CONCRETE INFORMATION TO BACK THIS MESSAGE SO PLEASE DONT JUST IGNORE THIS.  *TT",
        "vin": "1D7GL12K94S"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/16/2012",
        "dateOfIncident": "12/20/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10443932,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "NO POWER STEERING ASSIST IN COLD TEMPERATURES. WITH FIRST START UP THE TRUCK TURNS VERY HARD. EVEN AFTER DRIVIG FOR SEVERAL MILES TRUCK IS STILL HARD TO STEER AND YOU CONSTANTLY HAVE TO CORRECT IT.  *TR",
        "vin": "1D7HG32N94S"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/24/2011",
        "dateOfIncident": "04/01/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10432606,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUCK HAS BECOME VERY HARD TO STEER.  LIKE THE POWER STEERING HAS FAILED.  WHEN GOING INTO A TURN IS VERY HARD TO TURN AND  WHEN COMING BACK IT STICKS AND HAVE TO TURN HARD ON THE WHEEL.  THIS COMES AND GOES,  SEEMS TO WORK FINE WHEN THE WEATHER IS HOT OUT AND SEEMS TO FAIL WHEN THE WEATHER IS COOL OR COLD.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/24/2011",
        "dateOfIncident": "08/01/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10432648,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING WENT OUT AND TOOK IT IN TO FLUSH THE FLUID.  DIDN'T DO ANYTHING BUT WAS TO GIVE IT A FEW HUNDRED MILES.  I WAITED TO SEE WHAT WAS GOING TO HAPPEN AND AFTER 1 MONTH AND NOTHING CHANGING I REPLACED THE FLUID AGAIN WITH SOME CORRECTION FLUID.  DIDN'T WORK, THEN ANOTHER MONTH LATER THE STEERING RELEASED BACK TO NORMAL IN THE MIDDLE OF THE TURN.  TWO WEEKS LATER THE POWER STEERING BECAME INTERMITTENT AND SOMETIMES IN THE SAME TURN.  AT THIS POINT I SEARCHED DEEPER ON THE INTRANET AND FOUND MULTIPLE COMPLAINTS ABOUT DODGE DAKOTA STEERING AND MANY THAT WERE SPECIFIC TO A 2004 DAKOTA AND MORE THAN A HANDFUL THAT HAD ABOUT 70K MILES LIKE MINE.  AFTER SPRAYING PENETRATING OIL ON THE U-JOINT WITH A SHORT TERM CORRECTION, I'M CONVINCED THAT I NOW HAVE ONE OF THESE FAULTY STEERING SHAFTS.   *TR",
        "vin": "1D7HG48N14S"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/06/2011",
        "dateOfIncident": "10/01/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10429018,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING BECAME INCONSISTENT.  VEHICLE WAS VERY DIFFICULT TO TURN , BUT WOULD BECOME OCCASIONALLY EASIER MAKING IT DIFFICULT TO CONTROL GOING INTO AND OUT OF TURNS.  DEALER REPLACED INTERMEDIATE STEERING SHAFT AT A COST OF $420.  THIS FIXED PROBLEM.  *TR",
        "vin": "1D7HG48N54S"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/07/2011",
        "dateOfIncident": "08/23/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10424106,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A  2004 DODGE DAKOTA. THE CONTACT STATED WHILE MAKING A TURN THE STEERING WHEEL LOCKED IN THE DIRECTION THE VEHICLE WAS TURNING. THE VEHICLE WAS NOT TAKEN TO THE DEALER, BUT THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT  MILEAGE WAS 140,000.",
        "vin": "1D7GG16K14S"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "08/26/2011",
        "dateOfIncident": "08/25/2005",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10421643,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 DODGE DAKOTA.  THE CONTACT STATED THE THE WIRE CONNECTED TO THE HEATER BLOWER MELTED AND THE CONTACT WAS CONCERNED WITH THE POTENTIAL OF A FIRE.  THE DEALER REPAIRED THE FAILURE NUMEROUS TIMES, BUT THE FAILURE RECURRED.  THE MANUFACTURER WAS NOTIFIED OF THE FIALURE BUT DENIED ANY ASSISTANCE WITH REPAIRS.  THE VEHICLE WAS IN THE PROCESS OF ANOTHER REPAIR.  THE FAILURE MILEAGE WAS 18,000 AND THE CURRENT MILEAGE WAS 59,000.",
        "vin": "1D7HG12K44S"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/09/2011",
        "dateOfIncident": "07/09/2011",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10418199,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 DODGE DAKOTA. WHILE DRIVING APPROXIMATELY 30 MPH, THE CONTACT NOTICED THAT THE AIR CONDITIONER AND HEAT BLOWER FAN FAILED TO FUNCTION. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSTICS WHERE THE CONTACT WAS ADVISED THAT THE RESISTOR NEEDED TO BE REPLACED BECAUSE THE WIRING WAS MELTED. THE VEHICLE WAS REPAIRED. THE FAILURE RECURRED AFTER REPAIRS. THE VEHICLE WAS NOT FURTHER REPAIRED. THE VIN WAS NOT AVAILABLE. THE APPROXIMATE FAILURE MILEAGE WAS 75,000.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/02/2011",
        "dateOfIncident": "01/01/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10416746,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS 2004 DODGE DAKOTA. THE CONTACT STATED THAT WHILE DRIVING 10 MPH, THE STEERING WHEEL BECAME INCREASINGLY DIFFICULT TO TURN. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER AND THE DIAGNOSIS STATED THAT THE INTERMEDIATE STEERING SHAFT FAILED. THE FAILED COMPONENT WAS REPLACED AND THE VEHICLE WAS REPAIRED.THE MANUFACTURER WAS NOTIFIED. THE FAILURE AND CURRENT MILEAGES WERE 74,000. THE VIN WAS UNKNOWN.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/26/2011",
        "dateOfIncident": "06/26/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10415140,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 DODGE DAKOTA. THE CONTACT STATED THAT WHILE TURNING AT APPROXIMATELY 35 MPH, THE STEERING WHEEL LOCKED UP AND WAS VERY DIFFICULT TO TURN. THE VEHICLE WAS TOWED TO AN AUTHORIZED DEALER WHERE THE CONTACT WAS INFORMED THAT THE INTERMEDIATE STEERING SHAFT NEEDED TO BE REPLACED, BUT THE PARTS NEEDED TO BE ORDERED FIRST. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND FILED A CLAIM ON THE CONTACTS BEHALF. THE CONTACT WAS AWAITING A RESPONSE. THE FAILURE MILEAGE WAS 72,000.",
        "vin": "1D7HG42N74S"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "05/25/2011",
        "dateOfIncident": "10/01/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10402695,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 DODGE DAKOTA. THE CONTACT STATED THE WINDSHIELD WIPERS WOULD NOT FUNCTION WHENEVER THE VEHICLE WAS OPERATED UNDER RAINY WEATHER CONDITIONS. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHERE THE MULTI-FUNCTION SWITCH AND VARIOUS FUSES WERE REPLACED. THE FAILURE CONTINUED TO OCCUR. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND THE CONTACT WAS INFORMED THAT THE VEHICLE WAS NOT INCLUDED IN THE RECALL ASSOCIATED WITH NHTSA CAMPAIGN ID NUMBER 04V216000 (VISIBILITY:WINDSHIELD WIPER/WASHER). THE FAILURE MILEAGE WAS 70,676 AND THE CURRENT MILEAGE WAS 73,328.",
        "vin": "1D7HL38K44S"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/09/2011",
        "dateOfIncident": "01/01/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10399547,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 DODGE DAKOTA. THE CONTACT STATED THE  STEERING WHEEL WOULD BECOME STIFF WHILE DRIVING AT VARIOUS SPEEDS. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHERE THEY INFORMED THAT THE STEERING MECHANISM FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGES WERE 52,000.   UPDATED 06/03/11 *BF  UPDATED 06/13/11",
        "vin": "1D7HG38K44S"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/26/2011",
        "dateOfIncident": "04/15/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10397459,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING GOES LOOSE-STIFF-LOOSE-STIFF WHILE TURNING.  *TR",
        "vin": "1D7HG48N94S"
    },
    {
        "components": "VISIBILITY,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "04/11/2011",
        "dateOfIncident": "04/10/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10395501,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "SPORT UTILITY",
                "productYear": "1994",
                "type": "Equipment"
            }
        ],
        "summary": "2004 DODGE DAKOTA QUAD CAB:  HAS POWER WINDOWS. ON A TRIP FROM MONTROSE CO. TO DENVER CO. PUT DOWN THE 3 PASSENGER WINDOWS. WHEN TRIED TO PUT THEM BACK UP WOULD NOT GO BACK UP. HAD TO PHYSICALLY PULL WINDOWS UP AND DUCK TAPE THEM....AND HOPED THEY WOULD NOT COME DOWN ON TRIP BACK HOME...IT WAS RAINY, SNOWY COLORADO WEATHER. I FEEL THIS IS UNSAFE BECAUSE OF CHILDREN IN THE TRUCK AND CONSTANTLY WATCH FOR WINDOWS TO GO BACK DOWN. I CAN HEAR THE POWER MOTORS WORKING BUT THE WINDOWS WILL NOT MOVE. HAS ANYONE ELSE HAD THIS PROBLEM?   THANKS FOR YOUR HELP.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/13/2011",
        "dateOfIncident": "11/20/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10389977,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2004 DODGE DAKOTA BEGAN HAVING STEERING ISSUES LAST FALL WHICH BECAME INCREASINGLY WORSE OVER THE FOLLOWING WEEKS. THE POWER STEERING SEEMED TO HAVE STOPPED WORKING. WHEN I MADE A  TURN IT WAS STIFF, THEN LOOSE, THEN STIFF AGAIN AS YOU CRANKED THE STEERING WHEEL. THIS WOULD CAUSE ME TO APPLY MORE PRESSURE TO TURN THE TRUCK, THEN THE STEERING WHEEL WOULD SUDDENLY LOOSEN UP, CAUSING YOU TO SWERVE.  THIS CAUSED ME ENOUGH CONCERN ABOUT MY SAFETY THAT I HAD A MECHANIC TAKE A LOOK. HE FIRST THOUGHT THE PROBLEM WAS WITH THE POWER STEERING FLUID SO HE FLUSHED OUT THE SYSTEM. PROBLEM PERSISTED. HE THEN REPLACED THE STEERING RACK. JERKY/STIFF STEERING CONTINUED TO OCCUR. AFTER READING ON A DODGE FORUM ABOUT THIS ISSUE HE TRIED THE \"TEMPORARY FIX\" OF LUBRICATING THE LOWER U-JOINT ON THE INTERMEDIATE ROD AND THIS SEEMS TO HAVE RETURNED THE STEERING TO A NORMAL STATE. HOWEVER, MY MECHANIC FEELS THIS IS A TEMPORARY FIX AND FEELS THE ROD SHOULD BE REPLACED. PREFERABLY WITH A ROD THAT HAS GREASE FITTINGS.  APPARENTLY THERE IS A DESIGN FLAW WITH THIS MAKE AND MODEL WHICH DODGE IS AWARE OF, BUT HAS FAILED TO ISSUE A RECALL FOR. PLEASE LOOK INTO THIS MATTER.  *TR",
        "vin": "1D7HG48N64S"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/23/2011",
        "dateOfIncident": "02/16/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10384170,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DAKOTAS STEERING HAS RECENTLY BECOME VERY JERKY. WHILE TURNING THE WHEEL, IT GETS STIFF, LOOSE, STIFF, LOOSE, STIFF, LOOSE IN ONE FULL TURN OF THE WHEEL. THROUGH SEARCHING FORUMS ON THE INTERNET, I DECIDED TO TEST A THEORY THAT IT WAS THE INTERMEDIATE SHAFT/ROD AND THE U JOINT ATTACHED TO IT WAS NOT LUBRICATED ENOUGH. AFTER GREASING UP THE JOINT, THE PROBLEM MOMENTARILY STOPPED, BUT THEN RETURNED. THIS JOINT DOES NOT HAVE ANY GREASE FITTINGS AND SHOULD BE REPLACED WITH ONES WITH FITTINGS. THE PROBLEM OCCURRED AFTER WINTER COMING INTO THE WARMER WEATHER WHERE THERE WERE A LOT OF PUDDLES WHICH MOST LIKELY GOT ON THE INTERMEDIATE SHAFT AND JOINTS CAUSING IT TO DRY OUT AND CREATE THIS PROBLEM.  *TR",
        "vin": "1D7GL42N04S"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/31/2010",
        "dateOfIncident": "06/12/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10373612,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING ON MY 2004 DODGE DAKOTA BECAME HARD TO STEER WON'T RETRACT HAVE TO DO IT BY HAND. ABOUT SIX MONTHS BEFORE THIS STARTED HAPPENING I HAD WENT TO GET A ALIGNMENT AND WAS TOLD MY UPPER AND LOWER BALL JOINTS NEEDED REPLACED. WE BOUGHT THIS TRUCK NEW AND IT HAS WORN OUT EVERY FRONT TIRE THAT HAS EVER BEEN ON IT. 4 SETS BY 100,000 MILES THIS BEGAN TO HAPPEN AT 25,000 MILES THERE SHOULD BE A RECALL ON THE FRONT END, NO VEHICLE SHOULD HAVE BAD BALL JOINTS AT 85,000 MILES OR SOONER BECAUSE I THOUGHT IT WAS WEARING TIRES OUT BECAUSE IT NEEDED A ALIGNMENT!!!! I HAVE NOT REPAIRED IT , WE ONLY DRIVE IT AROUND TOWN, I AM WAITING FOR CHRYSLER TO RECALL THIS. I SEE ON THIS SITE THAT SEVERAL OTHERS ARE HAVING THE SAME PROBLEM. I WOULD HOPE CHRYSLER DON'T WAIT UNTIL PEOPLE ARE KILLED OR INJURED LIKE TOYOTA DID!!!! *TR",
        "vin": "1D7HL38N64S"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/13/2010",
        "dateOfIncident": "04/15/2009",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10360329,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE INTERMEDIATE STEERING SHAFT WITHTHE UNIVERSAL JOINTS STARTED TIGHTENING UP TO THE POINT WHERE I ALMOST COULDN'T STEER IT THEN WHEN IT LET LOOSE THE STEERING WAS VERY ABRUPT IT STARTED AROUND 100 K MILES AND I UNDERSTAND THINGS WEAR OUT .BUT AREN'T THOSE SUPPOSED TO BE LIFE OF VEHICLE LUBRICATED??????  I LOVE MY TRUCK  ITS BEEN WONDERFUL BUT IF SOMEONE THAT WAS NOT AS STRONG AS ME ....AND THIS HAPPENED   I HAD THE REPAIR DONE AND IT WAS AONLY AROUND 300-400 BUCKS  SO ITS NOT HORRIBLE BUT IT WAS SCARY NOT BEING ABLE TO STEER MY TRUCK.....THE MECHANIC SAID THAT THIS IS COMMON???? HE SEES IT ALOT ON THIS MODEL TRUCK.....  I JUST THOUGH THAT I ALSO HAVE A 89 HOINDA CIVIC AND HAVE NEVER HAD A PROBLEM WITH THE STEERING..... *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "09/12/2010",
        "dateOfIncident": "09/01/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10355067,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "HEATER/AC BLOWER MOTOR WIRING MELTS CAUSING FAILURE OF DEFROSTER, HEATER, A/C, PREMATURE FAILURE OF BLOWER MOTOR RESISTOR, ETC.  THIS MAY EVEN CAUSE A FIRE IF THE WIRES HAPPEN TO BE TOUCHING COMBUSTIBLES IN THE PASSENGER FOOTWELL WHEN THEY MELT.  DODGE HAS RELEASED A KIT TO REPAIR THIS EXTREMELY COMMON PROBLEM.  SEE MOPAR # 5017124AC.  THIS SHOULD BE A MANDATORY RECALL, NOT A FIX OFFERED AT OWNER'S EXPENSE.  THIS IS A SAFETY ISSUE BECAUSE:    1. WINDSHIELD MAY FOG UP REDUCING VISIBILITY AND LEADING TO ACCIDENT.  2. WIRING GETS HOT ENOUGH TO MELT INSULATION AND CONNECTOR AND COULD EASILY CAUSE A FIRE IN THE PASSENGER COMPARTMENT.  *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/04/2010",
        "dateOfIncident": "05/20/2007",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10347182,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CLOCK SPRING ON MY 2004 DODGE DAKOTA IS BAD.  THIS CONTROLS THE AIR BAG AND HORN.  THE HORN IS REQUIRED FOR NYS INSPECTION.  THIS PART IS NOT CURRENTLY AVAILABLE UNTIL NOVEMBER.  IN THE MEAN TIME, I HAVE NO DRIVER AIR BAG AND A VEHICLE I CAN'T GET INSPECTED. *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/02/2010",
        "dateOfIncident": "02/08/2009",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10346899,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 DODGE DAKOTA. THE CONTACT STATED THE VEHICLE WAS TAKEN TO A LOCAL REPAIR FACILITY FOR AN ALIGNMENT WHEN THE CONTACT WAS INFORMED THAT THE LOWER BALL JOINTS WERE SEVERELY WORN TO THE POINT WHERE THEY WERE UNABLE TO PERFORM AN ALIGNMENT. THE LOWER BALL JOINTS WERE CAUSING THE TIRES TO WEAR UNEVENLY. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 85,000 AND THE CURRENT MILEAGE WAS APPROXIMATELY 97,700.",
        "vin": "1D7HG38N04S"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/28/2010",
        "dateOfIncident": "01/15/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10345965,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 DODGE DAKOTA. WHILE ATTEMPTING A TURN AT APPROXIMATELY 10 MPH, THE STEERING WHEEL LOCKED AND THE CONTACT HAD TO UTILIZE EXTREME BODILY FORCE IN ORDER TO MOVE THE STEERING WHEEL. THE CONTACT STATED THE FAILURE WOULD OCCUR INTERMITTENTLY. THE VEHICLE WAS NOT TAKEN TO THE DEALER FOR DIAGNOSTIC TESTING OR REPAIRS. THE CONTACT THE CONTACT WAS ABLE TO TEMPORARILY REPAIR THE VEHICLE BY LUBRICATING THE UNIVERSAL JOINT. HE STATED HE WOULD HAVE TO SPRAY THE UNIVERSAL JOINT EVERY 1,500 TO 2,000 MILES. THE FAILURE MILEAGE WAS 130,000 AND THE CURRENT MILEAGE WAS 165,000.",
        "vin": "1D7HL48K54S"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "06/16/2010",
        "dateOfIncident": "02/06/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10336559,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2004 DODGE DAKOTA QUAD CAB AND I HAVE ALSO HAD PROBLEMS WITH THE WINDOW REGULATOR ON THE DRIVERS SIDE. I HOWEVER HAVE CHANGED IT MYSELF TWICE IN THE PAST YEAR AND IT WAS ABOUT 95-100$ EACH TIME AND FINALLY DECIDED THAT THE LAST TIME THAT IT WENT OUT THAT I WASN'T GOING TO FIX IT UNTIL DODGE CAME UP WITH A BETTER DESIGN ON IT SO I NOW HAVE A PAIR OF C-CLAMP VICE GRIPS HOLDING MY WINDOW UP. IT IS BAD THAT I CANT ROLL THE WINDOW DOWN BUT ATLEAST I KNOW THAT I DON'T HAVE TO WORRY ABOUT IT FALLING DOWN AND THE INSIDE GETTING WET OR VANDALIZED. *TR",
        "vin": "1D7HC48K54S"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/03/2010",
        "dateOfIncident": "03/22/2010",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10334394,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 DODGE DAKOTA. THE CONTACT STATED THERE WAS SMOKE COMING FROM UNDER THE DASHBOARD AREA. UPON FURTHER INSPECTION, THE CONTACT FOUND THAT THE RESISTOR THAT CONTROLS THE HEATER AND BLOWER HAD OVERHEATED, BURNED AND FAILED. THE CONTACT INSTALLED A NEW RESISTOR HOWEVER, IT ALSO BURNED AND FAILED. HE PURCHASED A NEW RESISTOR AND CONTACTED THE DEALER WHO ADVISED HIM THAT THEY WERE HAVING PROBLEMS WITH THE RESISTOR AND THAT IT WOULD CONTINUE TO FAIL AT A RAPID PACE. THE MANUFACTURER ADVISED HAVING THE DEALER PERFORM DIAGNOSTIC TESTING AT HIS EXPENSE. THE CONTACT DECLINED. THE VEHICLE WAS NOT FURTHER REPAIRED AND THE NEW RESISTOR WAS NOT INSTALLED. THE FAILURE MILEAGE WAS 69,000.",
        "vin": "1D7HL38KX4S"
    },
    {
        "components": "VISIBILITY,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "05/18/2010",
        "dateOfIncident": "05/18/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10331091,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Dorman Products, Inc.",
                "productMake": "DORMAN",
                "productModel": "86689B",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "I OWN 2 DODGE/CHRYSLER PRODUCTS, IN THE 6 YEARS I HAVE HAD THESE CARS I HAVE HAD TO REPAIR THE ELECTRIC WINDOW CABLES 9 TIMES AT A COST OF $250.00 EACH TIME. I HAVE ASKED THE LOCAL DEALERS WHY THEY KEEP BREAKING AND I AM TOLD THAT THEY USE PLASTIC PIECES THAT DON'T HOLD UP. THESE PRODUCTS ARE SUPPOSED TO CARRY A LIFETIME WARRANTY WHICH NONE OF THE DEALERS WILL HONOR. I AM NOT THE ONLY PERSON COMPLAINING ABOUT THIS PROBLEM. I SPOKE TO THE MECHANIC IN MY HOME TOWN AND HE SAID THEY REPLACE AT LEAST 5 TO 6 OF THESE CABLES A DAY.    WHY IS CHRYSLER ALLOWED TO USE THESE PRODUCTS WITH NO CONSEQUENCES? THE SAFETY ISSUE IS THE CABLES SNAP WHILE YOU ARE DRIVING AND THE WINDOWS FALL DOWN INTO THE TRACKS. IF YOU ARE IN BAD WEATHER YOU HAVE NO CHANCE OF FIXING THIS TYPE OF PROBLEM.    HOW CAN I GO ABOUT GETTING CHRYSLER TO RECALL THESE PRODUCTS AND MAKE THERE SUPPLIER ACCOUNTABLE? THINK ABOUT DRIVING ALONG AND YOUR WINDOW JUST FALLING DOWN TO THE TRACK AND THERE IS NOTHING YOU CAN DO ABOUT IT. NO LOCKING YOUR CAR FOR SAFETY, NO PROTECTING YOURSELF FROM THE ELEMENTS, NO WAY TO FIX THE PROBLEM BUT SHELL OUT MORE MONEY FOR A PRODUCT THAT WILL ALWAYS FAIL!!!!!!!!!!!! *TR",
        "vin": "2MEFM75W8WX"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/15/2010",
        "dateOfIncident": "12/13/2009",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10319657,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 DODGE DAKOTA. THE STEERING WHEEL WAS DIFFICULT TO TURN WHEN THE CONTACT WAS DRIVING APPROXIMATELY 55 MPH. THE VEHICLE CONTINUED WITH CAUTION. THE CONTACT STATED THAT THE FAILURE WAS CONTRIBUTED TO THE STEERING WHEELS INTERMEDIATE SHAFT. THE FAILURE RESULTED IN PREMATURE WEAR TO THE EXHAUST SYSTEM. THE PART WAS ORDERED BY AN AUTHORIZED DEALER. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE WHICH THERE WAS NO RESOLUTION. THE FAILURE MILEAGE WAS 60,000.",
        "vin": "1D7HG48N84S"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/02/2010",
        "dateOfIncident": "12/17/2009",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10315611,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 DODGE DAKOTA. THE DRIVER STATED THAT HE WAS DRIVING 40 MPH THROUGH A GREEN LIGHT WHEN ANOTHER VEHICLE PULLED IN FRONT OF HIM AND CRASHED INTO HIS VEHICLE. THE AIR BAGS DID NOT DEPLOY. THE CENTER AND THE RIGHT SIDE OF HIS VEHICLE WERE DESTROYED. THE FRONT END AND THE FRAME WAS REPLACED. THE DRIVER AND THE PASSENGER WERE INJURED. THE VIN WAS NOT AVAILABLE. THE CURRENT AND FAILURE MILEAGES WERE 78,000.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/28/2010",
        "dateOfIncident": "02/04/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10315005,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2004 DODGE DAKOTA HAS STEERING PROBLEMS. AFTER TAKING IT TO A DODGE DEALER AND LEAVING IT FOR TWO DAYS THEY ARE UNABLE TO TELL ME WHAT THE PROBLEM IS. THE VEHICLE IS VERY HARD TO STEER. FLUID IS NOT LEAKING, I HAVE DAYS THAT THE STEERING IS BETTER THAN OTHER DAYS..BUT FOR THE MOST PART THE STEERING IS GETTING HARDER EVERYDAY. I FEEL THAT IT IS GETTING VERY UNSAFE TO DRIVE,YET I CANNOT GET AN ANSWER TO WHAT IS CAUSING THE PROBLEM. AFTER SEARCHING THE INTERNET AND THIS FORUM, I HAVE FOUND THAT THERE ARE MANY OTHER 2004 DAKOTA OWNERS WITH THE SAME PROBLEM. INFACT THERE WAS A RECALL ON THE 2000 TO 2003 DAKOTAS FOR THE SAME PROBLEM. YET THE 2004 HAS THE SAME STEERING DESIGN. I THINK THE 2004 DAKOTA SHOULD HAVE BEEN INCLUDED IN THAT RECALL. PLEASE HELP!! AS I CAN'T SEEM TO GET ANY ANSWERS TO WHAT IS CAUSING THIS STEERING PROBLEM. *TR",
        "vin": "1D7GL32K54S"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/13/2010",
        "dateOfIncident": "11/16/2009",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10310139,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2004 DODGE DAKOTA QUAD CAB 4X4 WITH THE MAGNUM ENGINE. IT HAS ROUGHLY 59,000 MILES ON IT. SOMETIME WITHIN THE PAST 3,000 MILES THE STEERING BEGAN TO GET STIFF. IT WAS A GRADUAL THING, SLOWLY GETTING WORSE UNTIL NOW I'M CONCERNED ABOUT IT FROM A SAFETY STANDPOINT. THE EXACT SYMPTOMS AT THIS POINT ARE THAT THE STEERING WILL GET STIFF THEN SMOOTH THEN STIFF THEN SMOOTH, DEPENDING ON THE POSITION OF THE WHEEL DURING A TURN. AFTER RESEARCHING THIS PROBLEM ONLINE FOR THIS PARTICULAR MODEL AND YEAR, IT IS APPARENTLY EITHER THE UPPER OR LOWER U-JOINT ON THE STEERING COLUMN. I HAVE NOT CONFIRMED THIS, BUT WANTED TO LEND MY WEIGHT TO THE OBVIOUSLY HUGE NUMBER OF DODGE DAKOTA/DURANGO OWNERS WHO HAVE HAD THIS EXACT SAME PROBLEM. *TR",
        "vin": "1D7HG48N54S"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/07/2010",
        "dateOfIncident": "02/05/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10307136,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "ON FEBRUARY 5, 2010 AT APPROXIMATELY SIX PM ON MY WAY TO WORK I WAS INVOLVED IN A HEAD ON COLLISION. DUE TO THE SNOW ON THE ROAD I WAS NOT ABLE TO CONTROL MY VEHICLE, THUS LEADING TO THE ACCIDENT. THE FRONT AIRBAGS IN MY 2004 DODGE DAKOTA DID NOT DEPLOY. THE OTHER VEHICLE INVOLVED IN THE ACCIDENT A HONDA CRV THEIR FRONT AIRBAGS DEPLOYED. AFTER DOING SOME RESEARCH I HAVE FOUND THAT CHRYSLER HAS HAD PREVIOUS ISSUES WITH AIRBAGS  FAILING TO DEPLOY, THIS IS A SERIOUS SAFETY ISSUE AND I WOULD LIKE TO SPEAK WITH A REPRESENTATIVE TO DISCUSS HOW THIS SITUATION CAN BE HANDLED.  *TW",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/22/2009",
        "dateOfIncident": "12/20/2009",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10296734,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE READ SO MANY OF THESE SAME ISSUES THAT I AM HAVING WITH MY 2004 DODGE DAKOTA.  THE STEERING IS LOCKING UP AND VERY HARD TO TURN.  I'VE TAKEN IT INTO A DEALERSHIP 3 TIMES NOW, AND THEY HAVE REPLACED POWER STEERING PUMP, CHECKED MY RACK AND PINION, AND ALL OTHER OPTIONS AND THE PROBLEM IS STILL OCCURRING.  VERY SCARY. JUST HAD A BABY AND DON'T KNOW WHAT TO DO AT THIS POINT WHERE NO ONE KNOWS WHAT THE PROBLEM IS.   I HAVE READ UP SO MANY OF THESE SAME COMPLAINTS AND THEY ARE ALL THE SAME AS WHAT I AM EXPERIENCING.  THERE HAS GOT TO BE A PROBLEM AND SHOULD BE RECALLED.  VERY HARD TO TURN WHEEL AND GO STIFF LOOSE STIFF LOOSE.  PLEASE ADVISE.  THANK YOU. *TR",
        "vin": "1D7HL38K84S"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/11/2009",
        "dateOfIncident": "12/11/2009",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10295320,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A NEW 2004 DODGE DAKOTA PICKUP IN 2004. EVERY YEAR FOR INSPECTION, I HAVE NEEDED SEVERAL BALL JOINTS REPLACED. I WAS TOLD THIS PAST YEAR THAT I WAS REALLY CLOSE TO HAVING THE BALL JOINTS COMPLETELY BREAK OFF, WHICH OBVIOUSLY IS A MAJOR SAFETY CONCERN FOR ME, ESPECIALLY SINCE THEY HAVE NEEDED REPLACED EVERY YEAR. *TR",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "11/16/2009",
        "dateOfIncident": "11/15/2009",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10292316,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SON WAS ON HIS WAY TO THE DOCTOR FOR AN INJECTION IN HIS 2004 DODGE DAKOTA. WHILE DRIVING AT ABOUT 45 MPH, HE TURNED ON THE PARKING LIGHTS AND THE WINDSHIELD WIPERS CAME ON ALL BY THEMSELVES. HE HAD NOT TURNED ON THE WINDSHIELD WIPER SWITCH.  HE STOPPED THE TRUCK AND TURNED OFF THE IGNITION. ASSUMING THAT IT WAS A TEMPORARY GLITCH IN THE SYSTEM HE STARTED THE ENGINE AGAIN AND TURNED ON THE AIR CONDITIONING SYSTEM. AT THAT TIME THE ENTIRE LIGHTING SYSTEM WENT CRAZY. THE HEADLIGHTS BEGAN FLASHING ON AND OFF, THE EMERGENCY WARNING SYSTEM BEGAN TO WORK AND THE DIRECTIONAL LIGHTS BEGAN TO BLINK ON THEIR OWN. BETWEEN FLASHES OF THE EMERGENCY LIGHTS A DIRECTIONAL LIGHT WOULD ELIMINATE. AGAIN THE WINDSHIELD WIPERS BEGAN TO OPERATE ON THEIR OWN AGAIN. THIS COULD HAVE BEEN A VERY DANGEROUS SITUATION IF THIS HAD HAPPENED ON A BUSY HIGHWAY AFTER DARK. WE ARE WAITING TO GET A DEALER TO LOOK AT THE PROBLEM AT THIS TIME.        AGAIN THIS COULD HAVE HAD A DISASTROUS ENDING IF HE HAD BEEN DRIVING AFTER DARK AND ON A BUSY HIGHWAY OR STREET. *TR",
        "vin": "1D7GG16K14S"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/22/2009",
        "dateOfIncident": "09/01/2009",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10284860,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING HIGH PRESSURE SIDE HOSE P/N 52110348AE. HOSE IS LEAKING AND THE PART IS ON NATIONAL BACKORDER. DO NOT WANT TO BE STRANDED ON THE HIGHWAY WHEN THE STEERING GOES OUT OR HAVE A POSSIBLE ACCIDENT DUE TO NO STEERING. *TR",
        "vin": "1D7HG12K94S"
    },
    {
        "components": "STEERING,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "09/21/2009",
        "dateOfIncident": "07/17/2009",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10284824,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "I CAN HARDLY STEER MY TRUCK ANYMORE EVEN AFTER REPLACING A POWER STEERING PUMP WHICH I WAS TOLD WAS THE PROBLEM. IT TURNED OUT THAT THE PUMP WAS FINE AND AFTER RESEARCHING THIS VERY COMMON PROBLEM ON THE WEB I AM FINDING OUT THAT THE STEERING ISSUES ARE ACTUALLY DUE TO A FAULTY INTERMEDIATE SHAFT.  WHAT DOES A GIRL HAVE TO DO TO GET DODGE TO CORRECT THIS NATIONWIDE PROBLEM? IT'S SEEMS ONLY FAIR THAT A RECALL BE INITIATED ASAP. I GUESS MY ONLY RESORT IS TO LUBE THE SHAFT FOR NOW UNTIL DODGE FINALLY ACKNOWLEDGES HOW MANY THEY HAVE '!@#$%. *TR",
        "vin": "1D7HG38K54S"
    },
    {
        "components": "STEERING,SUSPENSION,SERVICE BRAKES, HYDRAULIC,PARKING BRAKE",
        "crash": false,
        "dateComplaintFiled": "09/21/2009",
        "dateOfIncident": "02/12/2009",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10284825,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2004 DAKOTA QUAD 4X4 WITH 78K MILES ON IT. I BOUGHT THE TRUCK NEW AND HAVE TAKEN CARE OF IT. MOST OF THE MILES ARE HIGHWAY AND IT HAS NOT BEEN DRIVEN OFF ROAD. SINCE ITS NO LONGER UNDER WARRANTY I GOT ONLINE TO RESEARCH A DIY SOLUTION. I FOUND THAT MANY OF THE PROBLEMS I HAVE HAD AND ARE HAVING ARE NOT JUST BEING EXPERIENCED BY MYSELF BUT OTHER DAKOTA OWNERS.   1) STEERING ISSUES  THE STEERING WHEEL BECOMES EXTREMELY HARD TO TURN AT TIMES BOTH GOING INTO AND COMING OUT OF A TURN. THIS STARTED HAPPENING IN FEB 2009 WITH 71K ON IT. IT IS MUCH MORE PREVALENT IN COLD WEATHER. I WAS UNABLE TO DRIVE THE TRUCK UNTIL THE WEATHER WARMED UP. (I HAVE NOT HAD THIS FIXED YET.)  2) BRAKE ISSUES   27K I HAD TO HAVE THE FRONT ROTORS AND THE REAR DRUMS TURNED AND NEW PADS AND SHOES INSTALLED AND HAD THE BRAKE FLUID CHANGED.  46K I HAD TO HAVE NEW FRONT ROTORS AND PADS ALONG WITH THE BRAKE FLUID CHANGED  77K REAR BRAKES BEGAN MAKING NOISE. THE PARKING BRAKE PAD HAD FALLEN OFF. I NOW NEED NEW REAR DRUMS AND SHOES AND PARKING BRAKE SHOE. ( I HAVE NOT HAD THIS FIXED YET)  3)SUSPENSION  77K I NEED A FRONT UPPER BALL JOINT PROBABLY DUE TO EXCESS STRAIN FROM THE DEFECTIVE STEERING. ( I HAVE NOT HAD THIS FIXED YET). *TR",
        "vin": "1D7HG38N94S"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES, HYDRAULIC,WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/09/2009",
        "dateOfIncident": "08/23/2009",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10283378,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, HEARD CLUNKING NOISE THAT SEEMED TO COME FROM UNDER THE VEHICLE.  THE OUTSIDE OF THE VEHICLE APPEARED NORMAL, INCLUDING THE WHEELS.  I CHECKED UNDER HOOD AND UNDER FRONT END AND FOUND NOTHING BROKEN, MISSING OR LEAKING AND CONTINUED DRIVING.  THE LEFT FRONT WHEEL LATER FELL OFF  WITH ALL STUDS SHEARED OFF.  ALSO, ONE LUG NUT ON THE RIGHT FRONT WHEEL WAS MISSING AND SEVERAL OTHERS WERE FOUND TO BE LOOSE, WITH SEVERAL STUDS CRACKED.  BOTH WHEELS HAD BEEN PROPERLY INSTALLED AND TIGHTEN SOME MONTHS EARLIER.  TO CORRECT, THE LEFT FRONT WHEEL WAS REPLACED.  ALL STUDS ON BOTH FRONT WHEELS AND ALL LUG NUTS WERE REPLACED.  ALSO, THE FRONT BRAKE ROTORS AND PADS WERE REPLACED BECAUSE THE VEHICLE FELL ONTO THE LEFT FRONT ROTOR.*TR",
        "vin": "1D7HG42N74S"
    },
    {
        "components": "STEERING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/21/2009",
        "dateOfIncident": "07/23/2007",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10277629,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 DODGE DAKOTA.  THE CONTACT STATED THAT THE STEERING LOCKS WHILE DRIVING.  HE TOOK THE VEHICLE TO THE DEALER THREE DIFFERENT TIMES AND THEY REPLACED THE POWER STEERING PUMP, WHICH DID NOT CORRECT THE FAILURE.  HE THEN TOOK THE VEHICLE TO AN AUTHORIZED AUTOMOTIVE ENGINEER AND WAS INFORMED THAT THE UNIVERSAL JOINT THAT GOES INTO THE YOKE WAS BENT WHEN IT SHOULD BE STRAIGHT.  THE DEALER FINALLY REPAIRED THE VEHICLE, BUT THE CONTACT DOES NOT FEEL SAFE DRIVING THE VEHICLE.  THE FAILURE MILEAGE WAS 34,000 AND CURRENT MILEAGE WAS 47,017.       UPDATED 8/27/09 *CN  UPDATED 09/09/09 *JB",
        "vin": "1D7HL48N24S"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/20/2009",
        "dateOfIncident": "07/20/2009",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10277511,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STEERING IN MY 2004 DODGE DAKOTA IS VERY TIGHT. IT TAKES ALL MY STRENGTH TO TURN A CORNER. THEN JUST WHEN I GET THE WHEEL TURNED IT GETS VERY LOOSE AND I AM OVER STEERING. BUT TO TURN THE WHEEL BACK IT IS TIGHT AGAIN. THIS IS VERY DIFFICULT TO DRIVE AS WELL AS DANGEROUS. I HAVE READ HUNDREDS OF COMPLAINTS ABOUT THIS VERY SAME PROBLEM WITH THE DODGE DAKOTA'S. THE PROBLEM SEEMS TO LIE WITH AN INTERMEDIATE SHAFT IN THE STEERING. THIS NEEDS TO BE RECALLED AND FIXED BEFORE SOMEONE IS KILLED! IT IS ALMOST IMPOSSIBLE TO DRIVE MY TRUCK! *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/20/2009",
        "dateOfIncident": "07/01/2009",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10277521,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 DODGE DAKOTA  INTERMEDIATE STEERING SHAFT. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/09/2009",
        "dateOfIncident": "05/19/2009",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10276253,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "EXHAUST LEAK ON 2004 DODGE DAKOTA. *TR",
        "vin": "1D7GL32N04S"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/08/2009",
        "dateOfIncident": "06/05/2009",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10276067,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 DODGE DAKOTA.  WHILE DRIVING 55 MPH, THE STEERING BECAME VERY STIFF WHEN MAKING VARIOUS TURNS.  IT FELT AS IF THE POWER STEERING WAS FAILING.  THE FAILURE LASTED FOR A WEEK BEFORE THE CONTACT FINALLY WENT TO A MECHANIC.  HE WAS INFORMED THAT THE INTERMEDIATE STEERING SHAFT FAILED.  THE DEALER HAS NOT YET BEEN NOTIFIED.  THE VEHICLE HAS NOT BEEN REPAIRED BECAUSE THE NECESSARY PART IS ON BACKORDER.  THE REPAIR WILL BE MADE AT THE CONTACT'S EXPENSE.  THE FAILURE MILEAGE WAS 94,000 AND CURRENT MILEAGE WAS 94,550.",
        "vin": "1D7HL48N34S"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/08/2009",
        "dateOfIncident": "06/27/2009",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10276107,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 DODGE DAKOTA - POWER STEERING VERY STIFF.    THIS IS VERY DANGEROUS. *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/03/2009",
        "dateOfIncident": "06/15/2009",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10275731,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 DODGE DAKOTA LOSES POWER STEERING INTERMITTENTLY.  IT CUTS IN AND OUT WHILE DRIVING. *TR",
        "vin": "1D7HG48N24S"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/23/2009",
        "dateOfIncident": "05/20/2009",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10274788,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "1. NORMAL DRIVING (4 YEARS 95,000 MILES)  2. THE STEERING IS UNPREDICTABLE AND VERY STIFF.  I HAVE A VERY HARD TIME TURNING THE VEHICLE WITH TWO HANDS ON THE WHEEL.  THE STIFFNESS IS SPORADIC AND CHOPPY.  IT MAKES THE TRUCK MUCH MORE DIFFICULT TO CONTROL AND IS A SERIOUS SAFETY ISSUE.  3.  GREASING THE TWO U-JOINTS ON THE INTERMEDIATE SHAFT SOLVED THE PROBLEM.  A GREASE TIP ON BOTH JOINTS WOULD PERMANENTLY SOLVE THE PROBLEM. *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/01/2009",
        "dateOfIncident": "04/24/2009",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10267427,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING NORMALLY I NOTICED A KNOCK IN THE FRONT END WHILE I JUST WENT DOWN THE STREET, THOUGHT IT MIGHT BE A BALL JOINT OR TIE ROD.  THEN ONE DAY WHILE DRIVING DOWN THE HIGHWAY THE STEERING BECAME CLOSE TO IMPOSSIBLE.  VERY JERKY AND IT FELT GUMMY.  I HAD THE RACK REPLACED AS SUGGESTED BY THE \"5-STAR DEALER\" AND THAT ONLY FIXED THE NOISE, NOT THE STEERING ISSUE.  READ ONLINE ABOUT IT BEING THE INTERMEDIATE STEERING SHAFT AND U-JOINTS, SO I SPRAYED THEM WITH LUBRICANT AND AM GOING TO SEE HOW THE TRUCK RUNS LATER.    SOME OF THOSE ENGINEERS REALLY NEED TO DESIGN GREASED FITTINGS INTO THE VEHICLE. *TR",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/10/2009",
        "dateOfIncident": "02/10/2009",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10261385,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT USED 2004 DODGE DAKOTA QUAD CAB IN DEC 2008 ALMOST TWO MONTHS LATER I NOTICED THE PASSENGER AND DRIVERS FLOORBOARD IS WET. TOOK IT BACK TO THE CHRYSLER DEALER AND THEY SAID THEY TOOK THE INTERIOR OUT AND DRIED IT THEN TOOK THE TRUCK TO A BODY SHOP TO GET THE LEAK FIXED BUT COULD NOT TELL ME EXACTLY WHERE THE LEAK IS LOCATED. I WOULD LIKE DODGE TO ADDRESS THIS PROBLEM AS I HAVE HEARD OF MANY PROBLEMS LIKE THIS WITH DODGE DAKOTAS. TOO MUCH MONEY FOR A TRUCK TO HAVE A PROBLEM. THE TRUCK SMELLS OF MOLD AND I HAVE WASTED MY MONEY AND HAVE NO WHERE TO TURN AT THIS POINT. *TR",
        "vin": "1D7HL48NX4S"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/09/2009",
        "dateOfIncident": "02/16/2009",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10261367,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING VERY TIGHT FOUND THAT INTERMEDIATE SHAFT FREEZING UP  POOR DESIGN CAUSE ACCIDENT DUE TO LACK OF STEERING RESPONSE WITH SPRAY OIL FREED UP DEALER SAID SHOULD REPLACE KNUCKLES ON SHAFT. *TR",
        "vin": "1D7HG48N64S"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/04/2009",
        "dateOfIncident": "02/10/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10260663,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING VERY TIGHT - TAKES TWO HANDS TO TURN STEERING WHEEL - READ DODGE FORUM AND FOUND THAT THE INTERMEDIATE SHAFT WAS FREEZING UP.  I SOAKED WITH PENETRATING SPRAY OIL AND IT IMMEDIATELY FREED UP. NOW CONCERNED THAT THE KNUCKLES ARE WEAKENED AND SHOULD BE REPLACED.  POOR DESIGN THAT MAY CAUSE AN ACCIDENT DUE TO LACK OF STEERING RESPONSE. *TR",
        "vin": "1D7HG48NX4S"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/12/2009",
        "dateOfIncident": "12/29/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10254678,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING BEGAN TO FEEL LOOSE AND HEARD A CLUNK INFRONT END. BALL JOINTS WERE BAD AND HAD TO BE REPLACED. AFTER WORK WAS COMPLETED STILL  HAD STEERING ISSUES. DEALER SAID THAT IT WAS NORMAL, LOCAL MECHANIC FOUND THAT THE INTERMEDIATE STEERING SHAFT WAS FAILING. WHEN IT WAS REMOVED TO BE REPLACED THE LOWER U-JOINT CAME APART. IMAGINE THAT HAPPENING AT 55 MPH. *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/12/2009",
        "dateOfIncident": "01/03/2009",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10254722,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I STARTED HAVING DIFFICULTY TO STEERING MY VEHICLE.  AS EACH DAY PASSED IT BECAME MORE AND MORE DIFFICULT TO TURN THE STEERING WHEEL.  IT FELT AS IF IT HAD NO STEERING WHEEL FLUID.  AND BY JANUARY I COULD BARELY TURN THE WHEEL AT ALL.  I COULD BARELY MAKE A TURN.  THIS OCCURRED EVERY DAY AND I WAS AFRAID I WAS GOING TO HAVE AN ACCIDENT.  I CHANGED THE STEERING FLUID AND THE TIRES THINKING THAT WAS THE PROBLEM.  BROUGHT IT TO THE DEALER LAST WEEK WHO REPLACED THE STEERING SHAFT.  I HAVE NEVER HEARD OF A STEERING SHAFT FAILURE BEFORE IN A VEHICLE. *TR",
        "vin": "1D7HG38N24S"
    },
    {
        "components": "STEERING,SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/08/2009",
        "dateOfIncident": "12/01/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10254328,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "GROANING OCCURS WHENEVER THE VEHICLE MOVES IN REVERSE AND THE WHEEL IS TURNED ONE ROTATION LEFT.  ALSO RECENTLY, A LOUD SQUEAL HAS OCCURRED ON FORWARD VEHICLE MOVEMENT.  I AM CONCERNED WITH SIMILAR COMPLAINTS OF BALL JOINT FAILURE AND VEHICLE SAFETY. *TR",
        "vin": "1D7HG12K44S"
    },
    {
        "components": "STEERING,WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/03/2009",
        "dateOfIncident": "12/23/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10253694,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE HIGHWAY, STEERING WHEEL FELT A LITTLE LOOSE.  LUCKILY ONLY WHILE BACKING INTO A PARKING SPOT - THE STEERING WHEEL FELL OFF INTO LAP.  THE METAL BRACKET WAS CRACKED.  CAR WAS BROUGHT TO A DEALERSHIP AND A NEW PART WAS ORDERED, CURRENTLY WAITING TO BE FIXED.  DEALERSHIP DOES NOT SEEMED CONCERNED, NOR CAN THEY DETERMINE IF IT'S A MANUFACTURING DEFAULT.  A CLAIM WAS STARTED WITH THE CHRYSLER CORPORATE OFFICE.  WILL HAVE TO SEE IF RETRIBUTION WILL BE MADE.  TRUCK HAS 125K MILES, HOWEVER REGULAR MAINTENANCE HAS BEEN PERFORMED.  NO OTHER ISSUES OCCURRED PREVIOUSLY.  A 9-MONTH PREGNANT WIFE AND HUSBAND COULD HAVE BEEN KILLED IF THIS HAPPENED ON THE HIGHWAY.  DODGE SHOULD INVESTIGATE BEFORE A TRAGIC ACCIDENT OR DEATH OCCURS. *TR",
        "vin": "1D7HG48N14S"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/16/2008",
        "dateOfIncident": "12/14/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10252051,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING AT 35 MPH VALVE SPRING BROKE LOSING ALL COMPRESSION IN CYLINDER #1. *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/11/2008",
        "dateOfIncident": "03/15/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10248518,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST READ ABOUT THE STEERING PROBLEMS BEING EXPERIENCED ON THE 2004 DODGE DAKOTA CLUB CAB MODELS. I HAVE TWICE EXPERIENCED THE SAME PROBLEM . ONCE UNDER WARRANTY AND ONCE AT MY OWN EXPENSE. THE STEERING JUST FREEZES UP AND THE WHEEL CANNOT BE TURNED WITH OUT A LOT OF EFFORT. WHEN YOU ROUND A CORNER, IT DOES NOT RECOVER AND YOU MUST TURN THE WHEEL BACK YOURSELF TO HAVE THE VEHICLE CONTINUE ON A STRAIGHT COURSE AFTER THE TURN. BOTH TIMES I WAS REQUIRED TO HAVE THE \"MIDDLE STEERING SHAFT\" REPLACED. APPARENTLY THERE IS A TOP,MIDDLE AND LOWER STEERING SHAFT  AND BOTH TIMES AT DIFFERENT REPAIR FACILITIES IT WAS DIAGNOSED AS THE MIDDLE SHAFT THAT HAD FAILED. IT COMPLETELY FREEZES UP ON YOU. *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/03/2008",
        "dateOfIncident": "08/01/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10247518,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 DODGE DAKOTA POWER STEERING GOES STIFF, LOOSE, STIFF, LOOSE, ETC.  THERE IS OBVIOUSLY SOMETHING WRONG AND JUDGING BY THE COMPLAINTS I'VE RESEARCH ON THE INTERNET MANY MORE PEOPLE ARE DEALING WITH THIS SAME ISSUE.  IT IS PUTTING PEOPLE'S LIVE IN DANGER AND A RECALL NEEDS TO BE ISSUES ASAP. *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/29/2008",
        "dateOfIncident": "09/18/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10247199,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "1) NOTHING OUT OF THE ORDINARY, JUST REGULAR DRIVING  2) ITS VERY HARD TO STEER SOMETIMES, ITS LIKE STIFF-LOOSE-STIFF-LOOSE WHEN I TURN EITHER LEFT OR RIGHT.  THIS HAS BEEN AN ONGOING PROBLEM AND GUYS ON DODGEFORUM.COM HAVE PINPOINTED THE PROBLEM BUT DEALERS WONT CHANGE THE PART, THEY WANT TO CHANGE THE POWER STEERING PUMP WHEN THE PROBLEM IS IN THE INTERMEDIATE ARM, ITS EXPENSIVE TO FIX AND WHY SHOULD WE PAY FOR A MANUFACTURER DEFECT?  THE CONSEQUENCES UNFORTUNATELY CAN BE DEADLY.  SOMETIMES ITS IMPOSSIBLE TO STEER OR MAKE A QUICK TURN, IF SOMEONE CUTS YOU OFF AND YOU CANT TURN, WELL BAD THINGS CAN HAPPEN.  3)I CANNOT GET THE PART (INTERMEDIATE ARM) BECAUSE THEY ARE ON BACKORDER, COINCIDENCE?? *TR",
        "vin": "1D7FL16K54S"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/08/2008",
        "dateOfIncident": "09/30/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10244876,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 DODGE DAKOTA.  WHILE DRIVING APPROXIMATELY 55 MPH, THE ENGINE WARNING INDICATOR ILLUMINATED ON THE INSTRUMENT PANEL.  IMMEDIATELY FOLLOWING, THE VEHICLE LOST POWER AND WAS TOWED TO THE DRIVER'S RESIDENCE.  APPROXIMATELY TWO WEEKS LATER, THE VEHICLE WAS TOWED TO THE DEALER AND THEY STATED THAT A NEW ENGINE WAS NEEDED DUE TO OIL SLUDGE BUILD UP.  THE VEHICLE HAS NOT BEEN REPAIRED.  THE MANUFACTURER STATED THAT THE FAILURE WAS NOT UNDER WARRANTY.  THE VIN WAS UNKNOWN.  THE CURRENT AND FAILURE MILEAGES WERE 50,000.",
        "vin": ""
    },
    {
        "components": "STEERING,SUSPENSION,SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/17/2008",
        "dateOfIncident": "04/12/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10242546,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "FROM THE VERY BEGINNING I KEPT HEARING NOISES FROM THE BRAKES AND FRONT END. THIS WAS GOING INTO THE 2ND YEAR OF OWNERSHIP. MY DODGE DAKOTA HAS BEEN IN THE SHOP AT LEAST 15 TIMES FOR THE SAME THING. THEY HAVE REPLACED THE STEERING PARTS, SWAY BAR, BRAKES ROTORS, CALIBER AND STILL MAKE A A MOANING GROANING NOISE WHEN EVER I TURN OR GO OVER BUMPS. *TR",
        "vin": "1D7HL48K34S"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/12/2008",
        "dateOfIncident": "05/21/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10237838,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRANSMISSION IN MY 2004 DODGE DAKOTA SLT IS A PIECE OF CRAP.  FIRST I HAD TO REPLACE THE VALVE BODY AT 53,000 MILES, NOW THE TORQUE CONVERTER TRIES TO LOCK TOO SOON (AT 30 MPH), WHICH RESULTS IN THE TRUCK SHUDDERING BETWEEN 30 AND 40 MPH.  IT ONLY OCCURS UNDER LIGHT ACCELERATION.  HEAVY ACCELERATION KEEPS THE CONVERTER FROM LOCKING.  *TR",
        "vin": "1D7HL48K24S"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/11/2008",
        "dateOfIncident": "07/27/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10237741,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE HAVING MY TIRES ROTATED AT SEARS, THE TECH INFORMED ME THAT THE BALL JOINTS ON MY 2004 DODGE DAKOTA WERE VERY BADLY WORN, BOTH UPPER AND LOWER.  THE VEHICLE HAS ONLY 54,000 MILES AND IS DRIVEN ALMOST EXCLUSIVELY ON PAVEMENT.  I CONTACTED THE DEALER, LITHIA DODGE OF ROSEBURG OREGON, I SPOKE WITH SERVICE MANAGER PHIL TYLER AND LOT MANAGER WAYNE KNOWLES, AND DODGE CORPORATE, BUT BOTH REFUSED TO DISCUSS THE ISSUE FURTHER.  *TR",
        "vin": "1D7HG38K04S"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/07/2008",
        "dateOfIncident": "07/15/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10237380,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERMITTENT HARD STEERING. SEEMS LIKE THE POWER STEERING STOPS WORKING. HAD THE POWER STEERING UNIT REPLACED BUT THAT DIDN'T SOLVE THE PROBLEM. I DID SOME RESEARCH AND FOUND MANY PEOPLE HAVING SAME PROBLEM. SEEMS TO BE THE U-JOINTS ON THE STEERING SHAFT. HAVE TO REPLACE SHAFT.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/18/2008",
        "dateOfIncident": "07/14/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10234830,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING ERRATIC AND CHOPPY. STEERING WHEEL FAILS TO CENTER SMOOTHLY WHEN RELEASED. STEERING IS HARD AT TIMES. WHEEL STAYS IN TURNED DIRECTION UNLESS MANUALLY TURNED TO CORRECT. *TR",
        "vin": "1D7HG48N84S"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/14/2008",
        "dateOfIncident": "05/01/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10234273,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING WHEEL WOULD STIFFEN AS IF THERE WERE NO POWER STEERING ABILITY. WHEN HE TURNS THE STEERING WHEEL, IT DOES NOT TURN BACK UNLESS HE DOES IT MANUALLY.  THIS IS A SAFETY ISSUE BECAUSE IT COULD LEAD TO THE STEERING WHEEL DISCONNECTING FROM THE RACK UNIT. I BELIEVE THAT THE CAUSE OF THE FAILURE IS THE LOWER STEERING INTERMEDIATE SHAFT. IF I SPRAY THE U JOINTS OF THE STEERING SHAFT WITH WD 40 OR PB BLASTER IT STEERS GREAT, BUT WEARS OFF WHEN YOU LEAST EXPECT IT!! NOW TRUCK HAS 57,000 MILES. HAS HAD THIS PROBLEM SINCE I HAVE HAD IT.  *TR",
        "vin": "1D7HG32N84S"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/20/2008",
        "dateOfIncident": "06/08/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10231862,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 DODGE DAKOTA.  THE CONTACT STATED THAT THE STEERING WHEEL WOULD STIFFEN AS IF THERE WERE NO POWER STEERING ABILITY.  WHEN HE TURNS THE STEERING WHEEL, IT DOES NOT TURN BACK UNLESS HE DOES IT MANUALLY.  THE FAILURE BEGAN APPROXIMATELY ONE WEEK AGO.  THE CONTACT FEELS THIS IS A SAFETY ISSUE BECAUSE IT COULD LEAD TO THE STEERING WHEEL DISCONNECTING FROM THE RACK UNIT.  HE BELIEVES THAT THE CAUSE OF THE FAILURE IS THE LOWER STEERING INTERMEDIATE SHAFT.  THE CURRENT AND FAILURE MILEAGES WERE 43,000.",
        "vin": "1D7HG42N14S"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/08/2008",
        "dateOfIncident": "06/03/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10230291,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "CAN HEAR A POPPING NOISE FROM RIGHT FRONT END WHEN GOING INTO DRIVEWAYS OR MAKING RIGHT TURNS. ON 6/4/08 TOOK VEHICLE INTO DEALER AND THEY STATED THE UPPER CONTROL ARMS WERE WORN OUT  AS WELL AS THE SHOCKS. 1500$ LATER THEY REPLACED THE UPPER CONTROL ARMS, SHOCKS, AND A FULL ALIGNMENT. ALL OF THIS AT ONLY 37K MILES!  AS SOON AS I GOT THE VEHICLE HOME THE NOISE IS STILL THERE ALBEIT LESS NOTICEABLE. TOOK VEHICLE BACK TO SAME DEALER ON 6/6/08 AND NOISE COULD NOT BE HEARD AND DEALERS MECHANIC STATED IT WAS SAFE TO DRIVE AND TO BRING IT BACK IF THE NOISE IS REPRODUCIBLE. BE READING OTHER COMPLAINTS AND SUSPECT THAT THE LOWER CONTROL ARMS ARE BAD OR GOING BUT DEALER SAID THEY WERE OK. SOMETHING IS WRONG WHEN SO MANY PEOPLE ARE HAVING THEIR FRONT ENDS GO OUT AT SUCH LOW MILES. PLEASE CONTACT ME SO WE CAN GET THIS FIXED THROUGH A RECALL. DEALER SAID HE KEPT THE BROKEN PARTS.  *TR",
        "vin": "1D7HL38N34S"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/04/2008",
        "dateOfIncident": "05/15/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10229971,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "IN REFERENCE TO ODI COMPLAINT 10224785...  I HAVE EXPERIENCED THE SAME FAILURE ON MY VEHICLE TWICE.  IT IS THE SAME MAKE AND MODEL, THAT BEING 04' DAKOTA.  I BELIEVE THE ISSUE IS KNOWN TO DODGE AS THEY HAVE A VERY SMALL NOTATION IN THE OWNER'S MANUAL IN REFERENCE TO THE STEERING SHAFT.  AT PRESENT THIS FAILURE SEEMS TO OCCUR EVERY 2ND SPRING (AFTER SPRING THAW AND WET ROADS), AND IN MY OPINION IT'S DUE TO A LACK OF GREASE FITTINGS ON THE STEERING LINKAGE.  AFTERMARKET REPLACEMENT PARTS HAVE THESE \"GREASE TIPS\", HOWEVER THE STANDARD DODGE SUPPLIED PARTS DO NOT.  IT IS AN EXTREME SAFETY ISSUE AS IT OCCURS WITHOUT WARNING AND SIMULATES THE FEELING OF COMPLETE POWER STEERING LOSS.  PERSONALLY IT ALMOST RESULTED IN 2 ACCIDENTS, HOWEVER I WAS ABLE TO CORRECT MY VEHICLE BEFORE ANY ONCOMING TRAFFIC BECAME INVOLVED.  AS I AM CANADIAN I HAVE FILED A REPORT WITH TRANSPORT CANADA, HOWEVER FELT IT IMPORTANT TO REPORT TO ODI AS WELL.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/15/2008",
        "dateOfIncident": "10/25/2007",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10227887,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 DODGE DAKOTA.  WHILE DRIVING AT ANY SPEED, THE POWER STEERING FAILED AND DOES NOT ALLOW THE CONTACT TO TURN THE VEHICLE IN ANY DIRECTION.  THERE WERE NO WARNING INDICATORS PRIOR TO THE FAILURE.  THE FAILURE OCCURS EVERYTIME THE VEHICLE IS DRIVEN.  THE VEHICLE HAS NOT BEEN DIAGNOSED BY THE DEALER.  THE CURRENT MILEAGE WAS 62,000 AND FAILURE MILEAGE WAS 59,000.",
        "vin": "1D7HG48N14S"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/03/2008",
        "dateOfIncident": "04/28/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10226549,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE INVOLVED IN A TOTAL LOSS AND AIRBAGS DID NOT DEPLOY....  *TR",
        "vin": "1D7HG12K34S"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/17/2008",
        "dateOfIncident": "04/16/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10224785,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM REPORTING THE PREMATURE FAILURE OF THE INTERMEDIATE STEERING SHAFT RESULTING IN LOSS OF STEERING.  MY METICULOUSLY MAINTAINED 2004 DODGE DAKOTA QUAD CAB EXHIBITED INTERMITTENT BINDING OF THE STEERING MAKING THE VEHICLE EXTREMELY DIFFICULT TO STEER.  THE CHRYSLER DEALERSHIP CONFIRMED MY SUSPENSION THAT IT WAS THE INTERMEDIATE STEERING SHAFT THAT WAS BINDING DUE TO ?RUST? AND REPLACED THE COMPONENT AT A COST TO ME OF $310.00 PARTS AND LABOR.  THIS COMPONENT HAD SURFACE RUST ONLY ON A SEALED NON-GREASY FITTING AND SHOULD NOT HAVE FAILED WITH A VEHICLE LESS THAN 4 YEARS OLD WITH ONLY 58,000 MILES OF USE.  I CONTACTED CHRYSLER DIRECTLY TO ADDRESS THIS SERIOUS SAFETY ISSUE AND THEY INDICATED THERE WAS NOTHING THEY COULD DO SINCE THE VEHICLE WAS OUT OF WARRANTY.  *TR",
        "vin": "1D7HG48N54S"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/03/2008",
        "dateOfIncident": "03/14/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10223309,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 DODGE DAKOTA.  THE FRONT PASSENGER SIDE AIR BAG SENSOR HAS BEEN RECALIBRATED ONE TIME.  WHEN A PASSENGER OR OBJECT IS SEATED IN THE SEAT, THE AIR BAG LIGHT DIMS.  THE DEALER STATED THAT THE SENSOR NEEDED TO BE RECALIBRATED EACH TIME THE FAILURE OCCURRED, ACCORDING TO A FEDERAL LAW.  THE DEALER CHARGED $100 FOR EACH RECALIBRATION.  THE POWERTRAIN AND FAILURE MILEAGE WERE UNKNOWN.  THE CURRENT MILEAGE WAS 27,129. UPDATED 06/09/2008.  *LJ",
        "vin": "1D7HW48N05S"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/29/2008",
        "dateOfIncident": "02/23/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10219674,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR TRUCK IS A 2004 DODGE DAKOTA WITH 40,000 MILES ON IT.  MY HUSBAND WAS PULLING OUT OF A PARKING SPACE, GETTING READY TO GET ONTO I-95 AND THE FRONT PASSENGER SIDE WHEEL FELL OFF.  THESE SAME VEHICLES WERE RECALLED FOR 2000-2003 BUT NOT 2004.  IF THE WHEEL HAD FALLEN OFF ONCE ON I-95 AT 75 MPH MY HUSBAND OR SOMEONE ELSE COULD HAVE BEEN SERIOUSLY INJURED OR WORSE.  THIS WAS A BALL JOINT PROBLEM. $1300 LATER BOTH SIDES ARE REPLACED.  CHRYSLER SAYS THERE IS NO RECALL AND IF THERE IS A FUTURE RECALL THEN WE MAY BE REIMBURSED.  WE WILL NEVER BUY A CHRYSLER PRODUCT AGAIN.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/29/2008",
        "dateOfIncident": "01/22/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10216356,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "CLUTCH FAILED, VEHICLE WOULD NOT START UNLESS PUSH STARTED, WAS ABLE TO DRIVE AND SHIFT NORMALLY.  VEHICLE FUNCTIONED NORMALLY UPUNTILL THE FAILURE.  BROUGHT VEHICLE TO DEALER.  THE PEDAL ROD WAS BENT, AFTER TAKING MY VEHICLE TO THE DEALER I WAS TOLD THAT THE CLUTCH MASTER AND SLAVE \"FELL APART IN THEIR HANDS\"  THIS IS A PART THAT DOES NOT FAIL, SHOULD NOT FAIL.  THIS VEHICLE IS ONLY 3.5 YRS OLD.  TO MAKE MATTERS WORSE THERE ARE NO AVAILABLE PARTS TO REPAIR THIS VEHICLE.  TO QUOTE THE SERVICE MANAGER \"THERE COULD HAVE BEEN A RUN ON THE PARTS\"  I BELIEVE THIS WARRENTS LOOKING INTO TO SEE IF THIS IS A FAULTY PART.  *CN",
        "vin": "1D7HG48N84S"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/28/2007",
        "dateOfIncident": "11/28/2007",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10210184,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TEMP GAUGE WILL PEG FOLLOWED BY CHECK ENGINE LIGHT.  P# IS 0118--EXCESS VOLTAGE FROM SENSOR.  4 DIFFERENT DEALERSHIPS HAVE ATTEMPTED TO FIX THIS PROBLEM. CALLS CHRYSLER AND THEY WERE NO HELP AT ALL.  *TR",
        "vin": "1D7HG48N44S"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "11/12/2007",
        "dateOfIncident": "01/04/2007",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10208672,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2004 DODGE DAKOTA QUAD CAB. THE PROBLEM IS THERE IS NOT ENOUGH HEIGHT FOR MY OLDEST SON'S CAR SEAT TO FIT CORRECTLY AND ALSO THE SEAT BELTS WILL NOT TIGHTEN UP ENOUGH TO MAKE THE SEAT SIT TIGHTLY. MY YOUNGEST SON'S CAR SEAT IS WEDGED BEHIND THE PASSENGER SEAT BECAUSE THERE IS NOT ENOUGH SPACE FOR IT TO SIT AND THE SEAT BELTS WON'T TIGHTEN UP ON IT EITHER.  *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/31/2007",
        "dateOfIncident": "10/31/2007",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10207571,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 20K MY 2004 DAKOTA TRUCK NEEDS NEW BRAKES AND ROTORS.  DEALERSHIP SAID THEY ARE BLUE FROM GETTING TOO HOT.  MY 1999 DAKOTA JUST HAD NEW BRAKES AND ROTORS AND STILL HAD PLENTY OF PAD ON THEM AT 84K.  *TR",
        "vin": "1D7GL42N54S"
    },
    {
        "components": "SUSPENSION,FUEL SYSTEM, GASOLINE,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/21/2007",
        "dateOfIncident": "12/08/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10200246,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN BRAKING FOR A STOP, WITH THE GAS TANK BETWEEN HALF AND FULL, THERE IS A  LOUD \"THUMPING\" NOISE A FEW SECONDS AFTER BEGIN STOPPED. THE ORIGINAL GAS TANK HAS BEEN REPLACED BUT THE NOISE STILL EXISTS. PER THE DEALER, 2005 AND LATER MODELS THIS PROBLEM HAS BEEN CORRECTED. WHY CAN THIS NOT BE CORRECTED ON THE 2004 MODELS? *TR  THE CONSUMER STATED IT IS TO HIS UNDERSTANDING THAT THIS IS AN ONGOING PROBLEM WITH THE GAS TANK ON 2004 DODGE DAKOTA'S. THE CONSUMER IS QUESTIONING WHY THE LATER MODELS WERE CORRECTED AND NOT THE MODEL HE POSSESS WHICH HAS THE SAME DEFECT? THE DEALER STATED KNOCKING NOISE ON FLOOR THE VEHICLE WAS PLACED ON A LIFT AND THE AXLE NUTS WERE RE-TORQUED. WATER LEAKED OVER THE ACCELERATOR PEDAL, AND THE HOLE WAS SEALED. THE DEALER STATED CLICKING NOISE  CAME FROM THE REAR WHEN COMING TO A STOP.  UPDATED 09/05/07 *TR  UPDATED 09/06/07. *JB",
        "vin": "1D7HG42KX4S"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/16/2007",
        "dateOfIncident": "06/15/2007",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10199868,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 DODGE DAKOTA.  WHILE DRIVING AT VARIOUS SPEEDS, THE STEERING WHEEL BECOMES DIFFICULT TO MANEUVER.  THE CONTACT REPLACED THE RACK AND PINION HIMSELF.  THERE HAVE BEEN NO OTHER FAILURES SINCE THE REPAIR.  THE CURRENT MILEAGE WAS 48,000 AND FAILURE MILEAGE WAS 46,000.",
        "vin": "1D7HG38N84S"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/28/2007",
        "dateOfIncident": "06/26/2007",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10194831,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER MAKING A TURN THE DRIVER'S SIDE TIE ROD SEPARATED FROM THE STEERING LINK,BOTH THE TIE ROD AND THE STEERING LINK WERE STRIPPED OUT,LOSS OF STEERING LUCK WOULD HAVE IT THERE WAS NO TRAFFIC NEXT TO ME AND MY SPEED WAS SLOW ABLE TO GET VEHICLE OFF ROAD WITH THE PASSENGER SIDE STEERING STILL ATTACHED,HAD THE TRUCK TOWED TO A SHOP WHERE THE LINK AND THE TIE ROD WERE REPLACED,AFTER INSPECTION THE MECHANIC SUGGESTED THE PASSENGER SIDE BE DONE DUE TO WEAR NOT AS BAD.*AK",
        "vin": "1D7HG38K54S"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/25/2007",
        "dateOfIncident": "04/07/2007",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10191704,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER'S SIDE VIEW MIRROR (MANUALLY OPERATED)FROZEN IN POSITION.  ATTEMPTS TO ADJUST RESULTED IN CRACKED MIRROR GLASS.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/24/2007",
        "dateOfIncident": "05/03/2007",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10191688,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RECALL ISSUE ON MY VEHICLE WAS NOT CORRECTED AND NOW AS A RESULT OF TEH SERVICE DEPT ERRO MY CAR IS NOW OVER-HEATINGA ND TEHY REFUSE TO TAKE RESPONSIBLITY AND REPAIR THE ISSUE, THEY STATED IT HAS NOTHING TO DO WITH TEH RECALL EVEN THE IT CLEARLY STATED THAT TEH CLUSTER OF MY VEHICLE COULD OVER HEAT AND RESULT IN AN INSTRUMENT PANEL FIRE.",
        "vin": "1D4HB48NX4F"
    },
    {
        "components": "ELECTRICAL SYSTEM,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "03/29/2007",
        "dateOfIncident": "03/28/2007",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10186524,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "SPORT UTILITY",
                "productYear": "1994",
                "type": "Equipment"
            }
        ],
        "summary": "ON 3/25, MY TRUCKS INSTRUMENT PANEL STARTED TO MALFUNCTION. ALL OF MY WARNING LIGHTS CAME ON AND MY ODOMETER QUIT WORKING. IT SAID \"NO BUS\". I CONTACTED SAVANNAH DODGE ABOUT THE ISSUE ON 3/26, 7:45 AM. AN APPOINTMENT FOR 2:00 WAS SCHEDULED. UPON DROPPING THE TRUCK OFF, I WAS TOLD THAT MY TRUCK WOULD BE DIAGNOSED AND READY FOR ME THE NEXT MORNING.  MY RECEIPT ALSO STATES THAT THE PROMISED COMPLETION DATE WOULD BE 3/27. ON 3/27, I CALLED SAVANNAH DODGE AT 2:00 PM TO CHECK ON THE STATUS OF MY TRUCK. I WAS TOLD BY A SERVICE MEMBER THAT ** WAS OUT ON LUNCH AND THAT MY CALL WOULD BE RETURNED.  MY CALL WAS NEVER RETURNED SO I CALLED BACK AT 3:00 P.M. ** TOLD ME THAT THEY WERE HAVING A MAJOR PROBLEM WITH THE WIRING OF MY STEREO SYSTEM. SHE ASKED WHEN IT WAS INSTALLED.  I TOLD HER THAT IT WAS INSTALLED 1.5 YEARS AGO, AND SHE TOLD ME THAT THE PROBLEM WAS AFTERMARKET SPEAKER WIRES WERE SPLICED INTO A FACTORY WIRING HARNESS AND THIS WAS A COMMON PROBLEM THAT OCCURRED OVER TIME. SHE ALSO SAID THAT THE ONLY FIX WAS TO REPLACE IT WITH THE ORIGINAL FACTORY HARNESS. I THEN TOLD THEM TO GO AHEAD AND FINISH THE JOB AND I WOULD BE UP TO PICK IT UP THAT EVENING. THEY INFORMED ME THAT THIS WAS NOT AN OPTION. THEY HAD TO WAIT ON PARTS (NEW FACTORY HARNESS) TO ARRIVE AND IT WOULD BE AVAILABLE 3/28 (ONE DAY AFTER THE PROMISED DATE). AFTER RECEIVING THE TRUCK AND LOOKING AT THE BILL, IT STATES NO NEW WIRING HARNESS WAS USED AND THEY REWIRED THE AFTERMARKET WIRES. I CALLED AND QUESTIONED ** ABOUT THE ISSUE AND HE BECAME FURIOUS. HE TOLD ME THAT SAVANNAH DODGE WOULD NEVER SERVICE MY VEHICLE AGAIN AND I WOULD NEVER BE ALLOWED TO STEP ON THEIR PROPERTY AGAIN. AFTER DRIVING IN MY VEHICLE, THE WARNING LIGHTS ARE OFF, HOWEVER THERE ARE THREE NEW PROBLEMS. THE RADIO DOESN'T FUNCTION PROPERLY. ALSO, MY WINDSHIELD WIPERS DO NOT WORK AND WAS TOLD THEY WOULDN'T BE FIXED. ALSO, ALL OF MY SPARE FUSES ARE MISSING. THIS IS A THEFT ISSUE, AND ** DID IN FACT TELL ME OVER THE PHONE THAT THEY TOOK MY FUSES. *JB",
        "vin": "1D7GL12K44S"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/23/2007",
        "dateOfIncident": "03/14/2007",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10186017,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004/DODGE TRUCK/DAKOTA, REAR CALIPERS FAILED BY SEIZING. HAD TO REPLACE BOTH OF THEM BEFORE EVEN REPLACING THE BRAKE PADS. TOTAL MILEAGE ON THE TRUCK  WAS 45,518.*AK",
        "vin": ""
    },
    {
        "components": "SUSPENSION,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/03/2007",
        "dateOfIncident": "06/20/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10184097,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "VIBRATING AT SPEEDS GREATER THAN 50 MPH.   SPOKE TO DODGE REFERENCE #15238936  THE VEHICLE CONTINUES TO VIBRATE AFTER MULTIPLE ATTEMPTS TO REPAIR TRUCK AT DEALERS. TIRES BALANCED AND ROTATED, THEN TIRES REPLACED, BRAKES REPLACED, SHOCKS REPLACED. SWAPPED RIMS. SERVICED TRANSMISSION, REPLACED DRIVESHAFT AND U JOINTS. PRESSURE BALANCE THE TIRES. REPLACED AXEL BEARINGS AND POSSIBLY THE AXEL. REPLACED RING GEAR AND PINION AND ALL BEARINGS. MULTIPLE ALIGNMENTS.*JB",
        "vin": "1D7HL48N24S"
    },
    {
        "components": "POWER TRAIN,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "02/24/2007",
        "dateOfIncident": "01/29/2007",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10183398,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "SPORT UTILITY",
                "productYear": "1994",
                "type": "Equipment"
            }
        ],
        "summary": "TRANSMISSION DEFECT, WILL NOT GO INTO FOURTH AND THIRD GEAR AFTER INITIAL COLD START, TRUCK JERKS AND MAKES NOISE.   *NM",
        "vin": "1D7GL32K14S"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/03/2007",
        "dateOfIncident": "02/02/2007",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10181494,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TIE ROD ON THE PASSENGER'S SIDE FRONT SUSPENSION IS SEPARATING FROM THE STEERING RACK.  TIE ROD BOOT IS TWISTED AND VEHICLE MAKES A LOUD KNOCKING AND CLICKING NOISE WHILE TURNING.  DEALER SERVICE MECHANIC STATED THE STEERING RACK WAS SEPARATING AND A GEAR BOX NEEDED REPLACEMENT AS WELL.  FAILURE OF TIE ROD COULD RESULT IN STEERING FAILURE AND LOSS OF VEHICLE CONTROL.  NEEDS REPLACEMENT, BUT WAS INFORMED AN ENTIRE STEERING RACK AND GEAR BOX MUST BE REPLACED.  *NM",
        "vin": "1D7HG38N74S"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/03/2007",
        "dateOfIncident": "02/02/2007",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10181491,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "EXCESSIVE MOVEMENT IN FRONT SUSPENSION OF 2004 DODGE DAKOTA QUAD CAB 4X4, SIDE TO SIDE LATERAL MOVEMENT AND STEERING DIFFICULTY.  DODGE SERVICE DEPARTMENT FOUND EXCESSIVE PLAY IN LOWER BALL JOINTS ON BOTH RIGHT AND LEFT WHEELS AND STEERING RACK COMING APART AT TIE ROD.  FAILURE OF BALL JOINTS CAN CAUSE WHEEL TO DETACH FROM VEHICLE WITHOUT WARNING.  PREVIOUS MODEL YEARS HAVE BEEN RECALLED FOR UPPER BALL JOINTS WITH SAME ISSUE.  PARTS MUST BE REPLACED.  *NM",
        "vin": "1D7HG38N74S"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/10/2007",
        "dateOfIncident": "11/01/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10178301,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* - THE CONTACT STATED IN NOVEMBER 2005 WHILE TOWING A BOAT ON A BRIDGE  THE BRAKES FAILED.  HE WAS ABLE TO STOP THE VEHICLE BY USING THE  EMERGENCY BRAKES.  THE CONTACT TOOK THE VEHICLE TO A DODGE DEALER,  AND THEY REPLACED THE BRAKE  LINE AND CALIPER.   THE VEHICLE APPEARED TO BE FINE UNTIL DECEMBER 2006 WHEN HE HEARD A SCRAPING NOISE.  THE CONTACT TOOK THE VEHICLE TO A FIRESTONE DEALER, AND WAS TOLD IT  HAD TWO DIFFERENT CALIPERS ON IT, ONE WHICH BELONGED TO A DODGE RAM 1500.  THE VEHICLE WAS TOWED TO THE DODGE DEALER.  THE CONTACT BELIEVED THE DODGE DEALER REPLACED THE CALIPER WITH AN INCORRECT CALIPER DURING THE BRAKE LINE REPLACEMENT. THE CONTACT STATED THE  DODGE DEALER WOULD NOT VERIFY THIS.  THE CONTACT HAD NEW CALIPERS AND A ROTOR PLACED ON THE VEHICLE.  THE CONTACT STATED THE VEHICLE HAD UNDER 36,000 MILES ON IT AT THE TIME OF FAILURE BECAUSE IT WAS COVERED UNDER THE WARRANTY.  THE CONTACT HAS THE OLD PARTS, PICTURES AND REPAIR INVOICES. *AK  UPDATED 02/06/07. *JB",
        "vin": "1D7HL38N34S"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/01/2007",
        "dateOfIncident": "12/27/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10177444,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2004 DODGE DAKOTA CLUB CAB HAS POPPING NOISES EMITTING FROM THE FRONT SUSPENSION WHEN MANEUVERING AT LOW SPEEDS.  I'VE HAD THIS CHECKED AT 2 DIFFERENT DEALERS.  THE FIRST VISIT RESULTED IN A \"COULD NOT DUPLICATE\" ANSWER.  THE SECOND VISIT I WAS TOLD THE NOISES WERE PERFECTLY NORMAL NOISES COMING FROM THE STEERING RACK AS THE FLUID MOVES THROUGH THE SYSTEM.  THE NOISES HAPPEN WHEN I STEER AT LOW SPEEDS AND THE WEIGHT OF THE TRUCK SHIFTS FORM SIDE TO SIDE.  THE FRONT END ALIGNMENT HAS ALTERED AND THE TIRES ARE WEARING UNEVENLY.  *NM",
        "vin": "1D7HL48N94S"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/12/2006",
        "dateOfIncident": "12/11/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10175953,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "SQUEALING SOUND COMING FROM LEFT FRONT WHEEL.  JACKED UP VEHICLE TO INSPECT AND WHEEL WAS WOBBLING BACK AND FORTH.  TOOK IT TO DEALER AND LEARNED THAT THE BEARINGS NEEDED TO BE REPLACED ON BOTH FRONT WHEELS.  VEHICLE HAS 38,000 MILES AND HAS BEEN DRIVEN ALMOST ENTIRELY ON PAVED ROADS.  *JB",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": true,
        "dateComplaintFiled": "12/08/2006",
        "dateOfIncident": "12/05/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10175623,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MY TRUCK HAD BEEN MAKING THE NOTORIOUS SQUEAKING SOUNDS FROM THE FONT END THAT THE DODGE DAKOTA HAS BEEN KNOWN FOR OVER THE PAST FEW YEARS.  I KNEW NOTHING OF THE BALL JOINT PROBLEMS WITH THIS VEHICLE UNTIL MY FIANCE WAS IN AN ACCIDENT WITH THE TRUCK.  THE ACCIDENT THAT OCCURRED WAS FAULTED TO MY FIANCE'S FAULT.  WHEN SPEAKING WITH HER, SHE STATED THAT SHE WAS UNABLE TO STEER THE TRUCK AND THEREFORE STRUCK THE OTHER CAR 'WHILE GOING AROUND THE CORNER'.  WHEN SHE STOPPED THE VEHICLE AFTER THE ACCIDENT, SHE FOUND THE TRUCK LOWERED TO THE GROUND ON THE FRONT DRIVERS SIDE DUE TO THE WHEEL ASSEMBLY POPPING OFF THE TRUCK.  BY 'POPPING OFF' I MEAN THAT THE LOWER BALL JOINT POPPED OUT OF ITS LOCATION AND THE RIVETS HOLDING THE TOP OF THE SPINDLE POPPED OUT OF THERE POSITION.  YES I SAID POPPED.  THERE WERE NO RIPPING OF PARTS ETC, THE ASSEMBLY JUST POPPED OFF THE TRUCK.  THIS ACCIDENT OCCURRED AT A LOW SPEED GOING THROUGH A TURN.  THIS IS THE EXACT ENACTMENT THAT CHRYSLER HAS STATED THAT THE WHEEL WOULD FALL OFF IF THE PART FULL MALFUNCTIONED.  CHRYSLER HAS BEEN USING THE SAME PARTS IN THE 04 DAKOTA TRUCK AS THAT USED IN THE 00-03.  WHY IS THE PART NOT BEING CORRECTED?  WHY IS CHRYSLER NOT TAKING CONTROL OF THIS ISSUE AND RESOLVING THE ISSUE WITH A RECALL?  CHRYSLER IS PUTTING LIVES AT RISK EVERYDAY THAT THEY ARE NOT RECALLING THIS PART AND CORRECTING THE ISSUE.  IS IT GOING TO TAKE THE DEATH OF AN INDIVIDUAL CAUSED BY THIS FAILING PART FOR THEM TO STEP UP AND ADMIT THEY HAVE MESSED UP?  WE CANT WAIT FOR THIS.  START SAVING THE LIVES AT RISK NOW BY GETTING THIS RECALL STARTED AND GETTING ALL OF THE DAKOTA FIXED.  IF IT IS NOT DONE NOW, EACH INDIVIDUAL THAT HAS THE POWER TO GET IT DONE, IS PUTTING MANY LIVES AT RISK.    WHAT SHOULD WE AS DODGE DAKOTA OWNERS DO TO GET THIS ISSUE RESOLVED AND PROTECT OUR FAMILIES?  *NM",
        "vin": "1D7HG48N74S"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/21/2006",
        "dateOfIncident": "09/08/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10169116,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER WOULD LIKE REIMBURSEMENT FOR REPAIRS TO THERE 2004 DODGE DAKOTA SPORT. *KB  THE RADIATOR FAILED AND RESULTED IN THE VEHICLE OVERHEATING.   THE REAR DIFFERENTIAL FAILED.  THE RIGHT FRONT AXLE, AXLE SHAFT ASSEMBLY WAS WORN.  ELECTRIC ENGINE COOLING FAN FAILED WHICH DAMAGED THE NEW RADIATOR.  *NM",
        "vin": "1B7GG2AN4YS"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/03/2006",
        "dateOfIncident": "06/27/2006",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10164283,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAGS DID NOT DEPLOY DURING A HEAD-ON COLLISION WITH ANOTHER VEHICLE. AT ABOUT 70 MPH IMPACT, YOU THINK THERE WOULD BE SOME KIND OF PROTECTION.  *JB",
        "vin": "1D7HG38N34S"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/08/2006",
        "dateOfIncident": "10/28/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10161873,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 DODGE DAKOTA PICKUP 4X4 HAD CLUNKING FROM FRONT SUSPENSION. REPLACED UPPER BALL JOINT.  *JB",
        "vin": "1D7HG48NX4S"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/29/2006",
        "dateOfIncident": "06/01/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10161056,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "ROTORS WARPED / DAMAGED. BRAKE ROTORS ARE SEVERELY WARPED. BRAKE PADS HAVE MORE THAN 35% LIFE AND THE DEALERSHIP CANNOT GIVE ANY EXPLANATION WHY THE ROTORS ARE DAMAGED. I CALLED DODGE CORPORATION CUSTOMER SERVICE AND THEY WILL NOT HELP. VEHICLE MAINTAINED ONLY AT DODGE DEALERSHIPS AND ALL SERVICE HAS BEEN PERFORMED ACCORDING TO DODGE RECOMMENDATION SINCE PURCHASED NEW.  *NM",
        "vin": "1D78G38N34S"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/09/2006",
        "dateOfIncident": "04/22/2006",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10157130,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS INVOLVED IN A CAR ACCIDENT ON 4/22/06. I WAS DRIVING 55 MPH AND A DELIVERY TRUCK PULLED OUT IN FRONT OF ME. I HIT THE TRUCK ON HIS DRIVER SIDE AND SMASHED MY HOLE FRONT END IN. TRUCK WAS ALMOST TOTALED. MY AIR BAGS NEVER DEPLOYED. IF IT WASN'T FOR THE SEAT BELT MY INJURIES COULD HAVE BEEN WORSE THEN WHIP LASH. MY TRUCK IS IN THE PROCESS NOW OF BEING FIXED. NO ONE IS GIVING ME ANSWERS TO WHY THE BAGS DIDN'T DEPLOY. I CALLED THE DODGE MANUFACTURER AND FILED A COMPLAINT. NEVER HEARD A THING. THIS IS VERY DANGEROUS NOT TO HAVE THE AIR BAGS DEPLOY. MY MAIN WORRY IS THAT WHEN MY TRUCK IS FIXED AND IF I EVER HAVE ANOTHER ACCIDENT WILL THE AIR BAGS WORK? PLEASE HELP! *JB",
        "vin": "1D7HG48NX4S"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/17/2006",
        "dateOfIncident": "11/05/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10155509,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CRUISE CONTROL ON MY 2004 DODGE DAKOTA QUAD CAB ACCELERATES GOING DOWN HILL. I'VE HAD IT TO THE DEALER WHO INDICATES THIS IS A COMMON PROBLEM WITH THIS VEHICLE AND SIMILARLY EQUIPPED DURANGOS. THEY TELL ME THAT THERE IS NO FIX. I, THEN, CONTACTED DAIMLER CHRYSLER CUSTOMER ASSISTANCE AND RECEIVED A CALL FROM A NICE LADY WHO TOLD ME THAT DODGE WAS NOT AWARE OF THE PROBLEM AND REFERRED ME TO ANOTHER DODGE DEALERSHIP. I CONTACTED THEM. THEY SUGGESTED THAT I GO BACK TO THE ORIGINAL DEALER AND FIND OUT IF THEY HAD CONTACTED DEALER SUPPORT. THEY DID AND WERE TOLD THAT DODGE IS INDEED AWARE OF THE PROBLEM BUT ISN'T GOING TO FIX IT. I CONTACTED DAIMLER CHRYSLER CUSTOMER ASSISTANCE AND RECEIVED AN APOLOGY, BUT NO INDICATION THAT THEY WILL DO ANYTHING TO IMPROVE THE SAFETY OF MY VEHICLE.  *JB",
        "vin": "1D7HG38N54S"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/04/2006",
        "dateOfIncident": "03/29/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10154505,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WARPING OF FRONT BRAKE ROTORS ON DODGE DAKOTA QUAD CAB WITH 16,000 MILES. *JB",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/23/2006",
        "dateOfIncident": "02/23/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10151022,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE DRIVING AROUND A CURVE AT 55 MPH, THE VEHICLE WENT OFF THE ROAD AND DOWN INTO A DITCH.  THE AIRBAGS DID NOT DEPLOY.  THERE WAS DAMAGE TO THE BUMPER, GRILL, AND DRIVER SIDE TURN SIGNAL.  THERE WAS PRIOR BRAKING.  THE CONTACT WAS WEARING A SEATBELT, BUT SUSTAINED MINOR INJURIES WHEN HITTING THE STEERING WHEEL.  A POLICE REPORT TAKEN AT THE SCENE.  THE VEHICLE WAS TOWED TO AN INDEPENDENT REPAIR SHOP.  THERE HAS BEEN NO INSPECTION TO THE AIRBAGS.",
        "vin": "1D7HL48NX4S"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/04/2006",
        "dateOfIncident": "06/07/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10146860,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 DODGE DURANGO.  VEHICLE STALLS, NO SPUTTERING.  WHILE ACCELERATING THE VEHICLE HAS SHUT OFF WITHOUT ANY WARNING.  THE STEERING WHEEL LOCKS UP. YOU CANNOT GET THE KEY OUT OF THE IGNITION FOR A COUPLE OF MINUTES.  THE TRUCK DID RESTART BOTH TIMES AFTER BEING PUT IN PARK.  *NM",
        "vin": "1D4HB58D14F"
    },
    {
        "components": "STEERING,SUSPENSION,SERVICE BRAKES, HYDRAULIC,FUEL SYSTEM, GASOLINE,POWER TRAIN,ELECTRICAL SYSTEM,EXTERIOR LIGHTING,VISIBILITY,STRUCTURE,SEATS,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "12/07/2005",
        "dateOfIncident": "12/24/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10144718,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "C BODY",
                "productYear": "1969",
                "type": "Equipment"
            }
        ],
        "summary": "I AM LOOKING FOR ALL PEOPLE THAT ARE WILLING TO SPEAK TO MY ATTORNEY ABOUT PROBLEMS THEY ARE HAVING WITH THEIR 04 DAKOTA'S. I HAVE HAD CLUNKING NOISE COMING FROM FRONT END, WHIRLING NOISE AT IDLING GETS LOUDER WHEN BLINKER ON, WINDOWS MAKE CLUNKING NOISE WHILE ROLLING UP OR DOWN, SEVER E SHAKING WHILE BRAKING ( WARPED ROTORS), TRANSMISSION LEAKING, AND THE LIST GOES ON. I AM IN THE MIDDLE OF LEMON LAW AND IT TOOK ME A LONG TIME TO BE ABLE TO FIND AN ATTORNEY. THIS ONE IS EXCELLENT.*JB",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/28/2005",
        "dateOfIncident": "05/15/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10143849,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2004 DODGE DAKOTA 4 DOOR CAB 2 WHEEL DRIVE TRUCK. THE BRAKES FAILED AT LESS THAN 12,000 MILES. THEY WERE REPLACED BY THE DEALER AND FAILED AGAIN LESS THAN 8,000 MILES LATER. I HAD TO PAY FOR THAT FAILURE. THE SYMPTOMS WERE SHIMMY/SHAKE WHEN THE BRAKES WERE APPLIED. I HAD NOT MADE ANY PANIC STOPS AND MOST OF THE DRIVING HAD BEEN ON INTERSTATE OR STATE HIGHWAYS. *NM",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/22/2005",
        "dateOfIncident": "07/25/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10143435,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: CONTACT STATED WHEN APPLYING THE BRAKES  A NOISE WAS COMING FROM THE STEERING WHEN MAKING A RIGHT OR LEFT HAND TURN. HE CONTACTED THE DEALER, WHO REPLACED THE STEERING COLUMN AND THE CONNECTOR PART TWICE. WHEN DRIVING THE VEHICLE WITHOUT TOUCHING THE BRAKE  DID  NOT HEAR THE NOISE.  *AK  UPDATED 12/7/2005.  THE DEALER REPLACED THE UPPER SHAFT PER THE STAR HOTLINE AND THE STEERING INTERMEDIATE SHAFT.  THE CONSUMER STATED THAT THE PROBLEM IS MORE PREVALENT IN WARM/HOT WEATHER.  *NM",
        "vin": "1D7GL12K64S"
    },
    {
        "components": "STEERING,SUSPENSION,TIRES",
        "crash": false,
        "dateComplaintFiled": "11/07/2005",
        "dateOfIncident": "03/22/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10141985,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE CONSUMER STATED THAT THERE WAS A SHIMMY/VIBRATION IN THE FRONT SUSPENSION.  THE VEHICLE WAS TAKEN TO THE DEALER THREE SEPARATE TIMES FOR INSPECTION AND REPAIR.  THE RACK AND PINION, FRONT SHOCKS AND ALL FOUR TIRES HAD BEEN CHANGED.  THE PROBLEM STILL EXIST.  THE CONSUMER HAD BEEN IN CONTACT WITH THE MANUFACTURER.  *AK  (12/05/05)  THE VEHICLE HAD BEEN TO THREE DIFFERENT DEALERS WITH NO RESULTS.  *SC",
        "vin": "1D7HL48N34S"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/05/2005",
        "dateOfIncident": "11/05/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10141814,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "HERE'S WHAT I SUBMITTED TO THE DODGE WEBSITE:  LAST NIGHT I RETURNED FROM MY DODGE DEALERSHIP AFTER HAVING NEW BRAKE PADS AND NEW ROTORS INSTALLED. THE VEHICLE IS DRIVING FINE AND THE BRAKES ARE OPERATING PERFECTLY. THE ASSISTANT SERVICE MANAGER, WES, WAS HELPFUL AND PROFESSIONAL.  HOWEVER, I DON'T THINK SPENDING $900 ON NEW ROTORS SHOULD BE REQUIRED AFTER TWO YEARS OF OPERATION AND LESS THAN 50,000 MILES. I AM METICULOUS ABOUT MAINTENANCE AND TIRE ROTATION. I DO NOT RIDE THE TRUCK HARD AND ALL OF MY DRIVING IS COUNTRY, NOT CITY, MILEAGE.  EVEN YOUR DODGE PERSONNEL COULD NOT GIVE ME ANY REASON WHY THIS WOULD HAPPEN SO SOON. I AM NOT A CERTIFIED MECHANIC, BUT I BELIEVE THERE IS SOMETHING SERIOUSLY WRONG WITH EITHER THE DESIGN OF THE BRAKES OR THE MATERIALS OR COMPONENTS USED IN THE BRAKE DESIGN.    I BOUGHT A NEW '91 DODGE DAYTONA AND SAID I WOULD NEVER BUY ANOTHER DODGE DUE TO PROBLEMS AND MAINTENANCE COSTS. IN 2003, I THOUGHT I WOULD GIVE DODGE ANOTHER SHOT AND BOUGHT A NEW LOADED, DAKOTA TRUCK. REST ASSURED, THIS WILL BE THE LAST DODGE VEHICLE I EVER OWN.  SINCERELY,  WILLIAM WILSON.  *JB",
        "vin": "1D7HG48N64S"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/04/2005",
        "dateOfIncident": "11/01/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10141758,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ELECTRICAL SYSTEM KEEPS MALFUNCTIONING.  THE FUEL GAUGE DOESN'T WORK RIGHT AND THE TEMPERATURE HAND SOMETIMES IS ON HOT AS SOON AS YOU CRANK THE TRUCK.  THE CHECK ENGINE LIGHT KEEPS COMING ON TOO.  IT HAS BEEN WORKED ON 3 TIMES SINCE I BOUGHT IT A YEAR AGO.    *NM",
        "vin": "1D7HL38K44S"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/24/2005",
        "dateOfIncident": "12/16/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10140596,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TOOK DELIVERY OF TRUCK ON 6/24/04 WITH 341 MILES AT DELIVERY.   NOT EVEN SIX MONTHS LATER, 12/16/04 IN FOR SERVICE DUE TO VIBRATION WHILE BRAKING.  THEY REPLACED BOTH FRONT BRAKE ROTORS AND PADS, MILEAGE 12,031.  A LITTLE OVER SIX MONTHS LATER, 6/27/05 IN FOR SERVICE AGAIN, FOR THE SAME VIBRATION WHILE BRAKING.  AGAIN THEY REPLACED BOTH FRONT ROTORS, MILEAGE 25,033.  WE WERE TOLD BY THE DEALER THAT CHRYSLER WILL NOT WARRANTY THEM AGAIN, THIS WAS THE LAST TIME THEY WOULD WARRANTY THE BRAKES.  ABOUT THREE WEEKS AGO, AT APPROXIMATELY 33,000 MILES NOTICED THE VIBRATION AGAIN.  CALLED THE DEALER AND WE WERE TOLD WE WOULD HAVE TO CALL THE (800) NUMBER AND SEE WHAT THEY SAID.  FIRST SPOKE WITH MATT, THEN WAS TRANSFERRED TO DON IN OUT OF WARRANTY DEPARTMENT (WHEN CALLING THE 800 NUMBER) I WAS TOLD THAT IF IT WAS CAUSED BY THE CALIPERS THEY WOULD PAY TO REPAIR THE CALIPERS AND ROTORS, HOWEVER IF IT WAS DUE TO THE ROTORS ONLY, WE WOULD BE RESPONSIBLE FOR PAYING FOR THE REPAIR.  ASKED ABOUT THE LEMON LAWS, AS THIS IS THE THIRD TIME IN FOR THE SAME REPAIR SINCE OWNING THE TRUCK.  I'VE NEVER HEARD OF SOMEONE HAVING THIS MUCH TROUBLE WITH BRAKES.  THIS NOT NORMAL WEAR AND TEAR, BRAKES SHOULD LAST LONGER THAN 12, 0000 MILES.  WAS FURTHER TOLD BY DON, THAT I WOULD HAVE TO CONTACT MY STATE ATTORNEYS OFFICE TO DEAL WITH THE LEMON LAW ISSUE.  IN LOOKING AT THE LEMON LAW BOOK THAT I WAS PROVIDED UPON DELIVER OF MY TRUCK IT STATES I SHOULD CONTACT CHRYSLER/DODGE IN WRITING BY MAIL OR CONTACT THROUGH WEBSITE.  THIS IS NOT MY FIRST DODGE TRUCK, BUT AFTER THIS ORDEAL I AM STARTING TO THINK IT WILL BE MY LAST, WITH THE PROBLEM I'VE BEEN HAVING WITH THIS BRAKE ISSUE.  *JB",
        "vin": "1D7HG42N64S"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/28/2005",
        "dateOfIncident": "08/27/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10134415,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2004 DODGE DAKOTA WITH 19,000 MILES.  BRAKE ROTORS ARE WARPED BEYOND REPAIR. BRAKE PADS STILL LOOK BRAND NEW THOUGH.  DAIMLER CHRYSLER AND DEALER IS AWARE OF PROBLEMS WITH SEVERAL OWNERS COMPLAINING OF ROTORS, YET NOTHING IS BEING DONE.  THIS NEEDS TO BE RECALLED.  *JB",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/22/2005",
        "dateOfIncident": "08/18/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10133758,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: 2004 DODGE DAKOTA PICKUP - THE AIR BAGS DID NOT DEPLOY IN AN ACCIDENT WHILE DRIVING ON US HIGHWAY 27 AT 55 MPH CONSUMER'S VEHICLE WAS CUT OFF FROM THE NORTH BOUND LANE TO THE SOUTH BOUND LANE.  DID NOT STOP IN THE FAST LANE AND CAME OVER INTO TO THE SLOW LANE WHERE CONSUMER'S VEHICLE WAS TRAVELING.   FRONT END CLIPPED OTHER VEHICLE'S  REAR END. UPON IMPACT. THE MAN THAT  VEHICLE  HIT WAS TAKEN TO THE HOSPITAL. DID  NOT KNOW THE OUTCOME OF HIS CONDITION   THE VEHICLE IS IN AN AUTO BODY SHOP.  INDICATOR LIGHT DID NOT COME ON BEFORE THE ACCIDENT.   THERE WAS ONE INJURY,  AND A POLICE REPORT WAS TAKEN.  *AK.",
        "vin": ""
    },
    {
        "components": "STEERING,SUSPENSION,VISIBILITY,STRUCTURE,SEATS,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "08/11/2005",
        "dateOfIncident": "03/04/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10132505,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  2004 DODGE, DAKOTA.  THE CONSUMER STATED   STEERING HAS BEEN REPLACED THREE TIMES AND IT WAS STILL  DEFECTIVE.   THE IDLER ARMS WERE REPLACED ONCE.  THE CONSUMER STATED THAT  A MONTH AFTER PURCHASE THE VEHICLE MADE A CLICKING NOISE ON THE FRONT PASSENGER SIDE.  SHE REPEATEDLY TOOK THE VEHICLE TO DEALER, AND HAD THE IDLER ARMS REPLACED.  THE VEHICLE WOULD CLICK WHEN THE STEERING WHEEL WAS TURNED, IT  WAS REPLACED THREE TIMES AND PROBLEM RECURRED.  THE CONSUMER  FILED A COMPLAINT WITH THE MANUFACTURER.  ALSO,  POWER STEERING PUMP, THE RADIO, AND   THE KNEE PANEL HAS BEEN REPLACED TWICE.  IN ADDITION,  THE REAR SHOCKS  AND SPRINGS/ THE REAR WINDOW REGULATOR/DRIVER'S SIDE SEAT/THE CLOCK DRIVER'S SIDE DOOR HANDLE,  ROOF JOINT MOLDING WERE  REPLACED.  THE VEHICLE WAS PURCHASED NEW WITH 800 MILES ON IT.*AK",
        "vin": "1D7HL38N14S"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/02/2005",
        "dateOfIncident": "01/01/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131065,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS MY 2ND SUBMISSION (ODI #10116332); NO RESULT FIRST TIME.  THE CRUISE CONTROL ON MY 2004 DODGE DAKOTA QUAD CAB TRUCK ACCELERATES GOING DOWNHILL.  I HAVE HAD IT INTO THE DEALERSHIP FOUR TIMES NOW, THEY CAN'T FIND WHAT IS WRONG, AND SAY IT \"PERFORMS AS DESIGNED\".  IT'S SUPPOSED TO ACCELERATE GOING DOWNHILL?!  *NM",
        "vin": "1D7HL38N64S"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/02/2005",
        "dateOfIncident": "07/30/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131078,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JULY 30TH 2005, 2004 DODGE DAKOTA TIE RODS PULLED APART WHILE MAKING A TURN FROM A COMPLETE STOP. TRUCK HAS 14500 MILES ON IT. CHRYSLER REFUSES TO COVER UNDER WARRANTY.  *NM",
        "vin": "1D7HG12K94S"
    },
    {
        "components": "STEERING,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "07/26/2005",
        "dateOfIncident": "07/26/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10130025,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "THE TRUCK HAS BEEN IN THE SHOP NUMEROUS TIMES FOR THE SAME PROBLEMS. I HAVE A GROANING NOISE IN THE STEERING WHEEL THAT DODGE CAN NOT SEEM TO FIX. IT ALREADY HAS A LEAKING A/C SYSTEM AT 47000 MILES. ALSO, THE A/C SYSTEM WIL NOT GET COLD UNLESS IT IS NIGHT TIME. IT ALSO JUST HAS WAY TO MANY SQUEAKS, AND MAKES ME FEEL VERY UNSAFE IN THE VEHICLE.  THE WIPER CONTROL MODULE NEEDS REPLACING",
        "vin": "1D7GL12K54S"
    },
    {
        "components": "SERVICE BRAKES, AIR",
        "crash": false,
        "dateComplaintFiled": "07/15/2005",
        "dateOfIncident": "06/10/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10128853,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 DODGE DAKOTA WITH 14,000 MILES TRUCK <1YEAR OLD FRONT BRAKE ROTORS WARPED NOT COVERED BY CHRYSLER FROM SEARCHING THE INTERNET IT APPEARS THIS IS AN ON GOING PROBLEM AS NUMERIOUS OTHER  INDIVIDUALS HAVE REPORTED THE SAME PROBLEM IN DODGE DAKOTA TRUCKS.  ROTORS SOULD NOT WARP IN 14,00 MILE S UNDER NORMAL DRIVING CONDITIONS. THIS APPEARS TO BE A MATERIAL DEFECT IN THE ROTORS. I HAVE REPLACED BRAKES NUMERIOUS TIMES ON OTHER VEHICLES I HAVE OWNED AND NEVER HAD THIS OCCUR WITH SO FEW MILES.",
        "vin": "1D7GL12KX4S"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/22/2005",
        "dateOfIncident": "04/06/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10118286,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2004 DODGE DAKOTA SLT FROM ELK GROVE DODGE, ELK GROVE, CALIFORNIA, ENGINE STARTED OVERHEATING, FIRST TWO TIMES THEY COULDN'T FIND THE PROBLEM, THE THIRD TIME WAS A BROKEN RADIATOR HOSE AND THE FOURTH TIME REPLACED BOTH CYLINDER HEADS AS HEADS ARE CRACKED DUE TO OVERHEATING. THEY FOUND COOLANT ON SPARK PLUGS. *JB",
        "vin": "1D7HG48N34S"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/04/2005",
        "dateOfIncident": "01/01/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10116332,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CRUISE CONTROL ON MY 2004 DODGE DAKOTA QUAD CAB TRUCK ACCELERATES GOING DOWNHILL.  I HAVE HAD IT INTO THE DEALERSHIP 3 TIMES NOW, THEY CAN'T FIND WHAT IS WRONG, AND THE LAST TIME THEY SAID IT \"PERFORMED AS DESIGNED\".  IT'S SUPPOSED TO ACCELERATE GOING DOWNHILL?  NEVER HAVE HAD ONE DO THAT BEFORE.*AK",
        "vin": "1D7HL38N64S"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/02/2005",
        "dateOfIncident": "02/28/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10113276,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES WHEN STOPPING AT A LIGHT THE VEHICLE IDLES LOW , 500 RPMS,  AND ATTEMPTS TO STALL. DEALER STATES THAT THERE IS  A DEFECT.  *AK",
        "vin": "1D7HL38N94S"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/01/2005",
        "dateOfIncident": "08/05/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10112373,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A 2004 DODGE DAKOTA QUAD CAB IN JANUARY OF '04 AND IN AUGUST OF THAT YEAR I NOTICED THE DRIVERS SIDE FRONT BUCKET SEAT HAD RUST ON THE FRAME. I TOOK THE TRUCK TO HUBLER DODGE OF INDIANAPOLIS AND THE FIRST THING THEY SAID THAT IT IS NOT A WARRANTY ITEM. NOTHING WAS DONE AT THIS TIME, THEN IN AUGUST OF 2004, I NOTICED THE PASSENGER FRONT BUCKET SEAT HAD SURFACE CORROSION. I TOOK IT BACK TO HUBLER AND THEY SAID THEY COULD REPLACE THE SEATS AFTER JANUARY 7, 2005. THIS WAS SO THEY WOULD NOT NEED APPROVAL FROM THEIR DISTRICT MANAGER TO OK THE WORK. DUE TO MY SCHEDULE I TOOK THE TRUCK INTO THEM IN FEB. '05 AND WAS TOLD ONLY THE FRAMES HAD BEEN REPLACED. I INSPECTED THEM, AND THEY HAD SURFACE RUST ON THEM ALSO. THE SERVICE MANAGER LOOKED AT IT AND SAID WHAT DO YOU WANT ME TO DO ABOUT IT. I ASKED TO HAVE THE DISTRICT MANAGER CALL, AND I WAS TOLD THAT HE WOULD. ABOUT 1 WEEK WENT BY AND NOTHING FROM HUBLER. I WENT IN TO HUBLER, AND WAS TOLD THAT HE JUST GOT OFF THE PHONE WITH THE DM. ATER MUCH DISCUSSION AND MISINFORMATION FROM HUBLER, I WAS TOLD THAT IS HOW THE FRAMES COME FROM THE FACTORY AND THAT SURFACE RUST IS OK AND WILL NOT POSE A PROBLEM. THEY WOULD NOT LET ME SPEAK TO THE STORE MANAGER AND/OR OWNER, NOR WOULD THEY GIVE ME A DIRECT NUMBER TO THE DISTRICT MANAGER. I HAD THIS DOCUMENTED AND LEFT THE ESTABLISHMENT. I HAVE PICTURES OF THE FRAME IF NEEDED.  *JB",
        "vin": "1D7HG38K04S"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/28/2005",
        "dateOfIncident": "09/05/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10109191,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS LEANING TO THE RIGHT, AND WHEN DRIVING  AT ANY SPEED IT PULLED TO THE RIGHT.  VEHICLE WAS TAKEN TO THE  DEALER, WHO  WAS UNABLE TO RESOLVE THIS PROBLEM.*AK",
        "vin": "1GCEK14T9XE"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "01/24/2005",
        "dateOfIncident": "09/07/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10091484,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, IN INCLEMENT WEATHER THE WINDSHIELD WIPERS WOULD COME ON AND GO OFF ON THEIR OWN. THE DEALER WAS AWARE THIS IT WAS AN INTERMITTENT PROBLEM.  THE MECHANIC INFORMED THE CONSUMER THAT THIS VEHICLE WAS NOT ON RECALL.   *JB   *SC",
        "vin": "1D7GL42K94S"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/15/2005",
        "dateOfIncident": "05/01/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10111016,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL CAMPAIGN :  THE VEHICLE'S BALL JOINTS FAILED PRIOR TO RECALL NOTIFICATION 04V-596.  *NM  THE VEHICLE' S BALL JOINTS, RACK AND PINION STEERING AND OUTER TIRE RODS ALSO HAD TO BE REPLACED.  THE CONSUMER REQUEST REIMBURSEMENT.  *NM",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/14/2005",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10108580,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONSUMER OWNS A 2004 DAKOTA 4X4.  THE CONSUMER'S VEHICLE HAS THE SAME BALL JOINT PROBLEM AS DESCRIBED IN THE RECALL FOR THE 2000-2003 MODELS.  THE CONSUMER WANTS TO KNOW  WHY THE MANUFACTURER EXCLUDED 2004 DAKOTA .   *BF  *NM   *SC  *TC *JB",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/12/2005",
        "dateOfIncident": "01/03/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10107341,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER WANTS TO KNOW  WHY ARE THE 2004 MODELS BEING EXCLUDING  WHEN THE PROBLEM  EXISTED IN THE 2004, DODGE DAKOTA THEY HAVE THE SAME BALL JOINTS PROBLEMS.    *BF",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/02/2005",
        "dateOfIncident": "01/01/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10104941,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "NO ACCIDENT.  *JB",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/30/2004",
        "dateOfIncident": "07/30/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10105554,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT END  EXPERIENCED SEVERE SHAKING WHILE DRIVING. CONSUMER TOOK VEHICLE TO DEALER FOR CHECK UP, AND RESULTS SHOWED THAT THE ROTORS WERE MANUFACTURED INCORRECTLY. VEHICLE'S WEIGHT WAS MORE THAN WHAT THE FRONT ROTORS COULD SUPPORT.*AK",
        "vin": "1D7HG12K04S"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/27/2004",
        "dateOfIncident": "12/27/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10105353,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "A  KNOCKING NOISE WAS COMING FROM THE FRONT OF THE VEHICLE.  CONSUMER DROVE  THE VEHICLE TO THE DEALER, AND  MECHANIC DETERMINED THAT THE LEFT AND RIGHT UPPER BALL JOINTS NEEDED TO BE REPLACED. *AK",
        "vin": "1D7GL12K64S"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES, HYDRAULIC,POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/26/2004",
        "dateOfIncident": "04/18/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10104512,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT DAKOTA NEW JAN,04 AT 10000,15000,AND 18000ROTORS WERE REPLACED FOR SHAKE IN TK WHEN BRAKING STILL HAS PROBLEM FRONT HUBS AND BEARINGS REPLACED HAS POPPING NOISE IN FRONT END  WHEN TURNING SOMETIMES WHEN APPLYING BRAKES TRUCK PULLS TO LEFT FRONT DRIVESHAFT AND DRIVER WINDOW REGULATER HAS BEEN REPLACED ALSO 2 SENSORS IN TRANS REPLACED.TEMPERATURE GUAGE WENT ALL THE WAY TO HOT 1 TIME WHEN TRUCK WAS STARTED. WISH DODGE WOULD JUST BUY IT BACK.MY FIRST AND LAST DODGE EVER.  *AK",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/25/2004",
        "dateOfIncident": "04/01/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10104495,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A 2004 DODGE DAKOTA 3/20/04 AND EVER SINCE IT WAS NEW IT HAS MADE A \"POPPING\" OR A \"SCRAPING\" NOISE WHEN I TURN. I MADE COMPLAINTS TO THE DEALER AT THE 3,000 MI AND 7,000 MI OIL CHANGES BUT THE DEALER TELLS ME THEY CAN'T FIND ANYTHING. NOW I SEE THAT 2003 AND PREVIOUS DAKOTA'S HAVE BEEN RECALLED FOR BALL JOINT SERVICE I AM WONDERING. I HAVE NOT DROVE MY DAKOTA SINCE OCTOBER CAUSE I DON'T FEEL SAFE DRIVING IT. *AK",
        "vin": "1D7GG36N74S"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/23/2004",
        "dateOfIncident": "12/23/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10104379,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2002 DODGE DAKOTA [XXX]. I NOW HAVE 40,000 MILES ON IT. MY FRONT BRAKES (DISC) NEEDED TO BE REPLACED THREE TIMES DUE TO PULSATING. THIS PULSATING IS ATTRIBUTED TO ROTORS WARPING. THE ROTOR WARPING IS CAUSED BY TOO MUCH HEAT FRICTION IN THE FRONT BRAKING SYSTEM. AS A RESULT, THE ROTORS WARP CAUSING A SUBSTANTIAL LOSS IN BRAKING POWER. THE BALL JOINTS AND CONTROL ARMS WERE ALSO REPLACED UNDER WARRANTY BECAUSE THEY WERE 'LOOSE' AND THEY MADE A CLUNKING SOUND OFTEN. SINCE THE PARTS WERE REPLACED, THE SAME SOUND STILL OCCURS LEADING ME TO BELIEVE THAT THE OEM PARTS ARE FAULTY. I DO NOT USE THIS VEHICLE FOR MEDIUM OR HEAVY LOADS AT ANY TIME; I DO, HOWEVER, USE THIS VEHICLE UNDER NORMAL DRIVING CONDITIONS IN THE CAPACITY OF A PASSENGER VEHICLE.*AK UPDATED 07/24/2012  *JS    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6)",
        "vin": "1B7GL32NX2S"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": true,
        "dateComplaintFiled": "12/22/2004",
        "dateOfIncident": "08/21/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10101939,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STALLED WHILE DRIVING AT ANY SPEED. SOMETIMES IT TOOK 10 MINUTES, SOMETIMES 2 HOURS BEFORE VEHICLE WILL RESTART. VEHICLE WAS SERVICED BY THE DEALERSHIP SIX TIMES.  DIAGNOSTIC TEST WAS DONE, BUT NO ENGINE FAILURE CODE WAS FOUND.  NO PARTS WERE REPLACED. THEY ONLY REFLASHED THE ENGINE, BUT THIS FAILED TO CORRECT THE PROBLEM.*AK  THE VEHICLE STALLED CAUSING AN ACCIDENT.  *NM",
        "vin": "1D7HG12K04S"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/15/2004",
        "dateOfIncident": "12/09/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10102994,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM CONCERNED THE 2004 DODGE DURANGO AND DAKOTA ARE NOT BEING INVESTIGATED. THEY HAVE THE SAME BALL-JOINTS!!. ALSO DODGE KNOW ABOUT THE BALL JOINT PROBLEM IN 2003 BUT CONTINUE INSTALLING THE BALL-JOINTS DURING THE 2004 PRODUCTION RUN.*AK",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/15/2004",
        "dateOfIncident": "10/19/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10103824,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE VEHICLE IS COLD TRANSMISSION IS NOT DISCONNECTING FROM THE ENGINE.  ONCE THE VEHICLE WARMS IT RUNS OKAY.  CONSUMER STATED THAT THE VEHICLE WILL BE LEFT OVERNIGHT AT THE DEALERS TO SEE IF THEY CAN DUPLICATE THE PROBLEM.*AK",
        "vin": "1D7HL48N54S"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/14/2004",
        "dateOfIncident": "06/30/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10103747,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING SHOOK SEVERELY WHILE DRIVING AT 62 MPH, AND THE VEHICLE VIBRATED WHEN GOING UP A SLIGHT INCLINE. VEHICLE HAD BEEN TO THE DEALER ON SEVERAL OCCASIONS, AND THEY ARE UNABLE TO LOCATE THE CAUSE OF THE PROBLEM.*AK",
        "vin": ""
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/13/2004",
        "dateOfIncident": "12/13/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10103697,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER WAS MAKING A RIGHT TURN  A LOUD KNOCKING NOISE WAS HEARD COMING FROM THE FRONT.  CONSUMER DROVE VEHICLE TO THE DEALER, AND  MECHANIC DETERMINED THAT THE RACK AND PINION,AND BOTH FRONT DRIVER'S SIDE AND PASSENGER'S SIDE UPPER BALL JOINTS NEEDED TO BE REPLACED.*AK",
        "vin": "2B3HD46R1YH"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/08/2004",
        "dateOfIncident": "12/08/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10103384,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING VEHICLE STALLED. CONSUMER NOTICED THAT WHILE THE VEHICLE WAS RUNNING THE RMPS ACCELERATED THE SPEED.  THEN,  VEHICLE STALLED.  CONSUMER HAD THE VEHICLE TOWED TO THE DEALER FOR INSPECTION, AND MECHANIC DETERMINED THAT THE PROBLEM COULD NOT BE DUPLICATED.  CONSUMER INFORMED THE MECHANIC THIS PROBLEM OCCURRED MORE THAN ONCE, AND HAD NOT BEEN RESOLVED.  *AK",
        "vin": "1D7HL32X83S"
    },
    {
        "components": "SUSPENSION,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/27/2004",
        "dateOfIncident": "07/13/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10100605,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION SLIPS, RATTLING IN THE FRONT SUSPENSION OF THE VEHICLE. TOOK THIS TRUCK BACK TO OUTTEN COUNTY CHRYSLER NUMEROUS TIMES AND THEY WOULD NOT FIX ANY OF THE PROBLEMS.*AK",
        "vin": ""
    },
    {
        "components": "STEERING,SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/16/2004",
        "dateOfIncident": "07/26/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10100058,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "GOT DODGE DAKOTA 4X2 BRAND NEW. BRAKES SQUEALED AFTER 6,000 MILES, FIXED UNDER WARRANTY. AT 12,000 MILES THERE WAS A LOUD CLUNKING NOISE WHILE TURNING, TAKEN TO DEALERSHIP, SAID IT WAS FIXED. IT WAS NOT FIXED. AT 14,000 MILES, BOTH TIE RODS SNAPPED WHILE MAKING A TURN FROM A COMPLETE STOP. FIXED UNDER WARENTY. NOW AT 15,000 MILES, THE CLUNKING NOISE IS BACK WHILE BRAKES ARE APPLIED AND MAKING TURN. THESE CARS ARE NOT SAFE TO DRIVE.  *AK",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/15/2004",
        "dateOfIncident": "11/15/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10099998,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION HESITATES TO SHIFT GEARS.*AK",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/03/2004",
        "dateOfIncident": "11/01/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10099359,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN VEHICLE HAS 3/4 TANK OF GAS. WHEN SLOWING DOWN THERE IS A THUMPING NOISE COMING FROM REAR UNDERNEATH VEHICLE.  *BF  WHEN BRAKING AND COMING TO A STOP A DELAY THEN A THUMP SOUND COMES FROM THE BACK WALL OF THE TRUCK.   1ST GAS TANK STARTED THIS OVER HALF OF A TANK.  TANK WAS REPLACED AND NOW YOU HEAR THE THUMP WHEN THE TANK IS AT 3/4 FULL.  *TC",
        "vin": "1D7HG38N94S"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/21/2004",
        "dateOfIncident": "08/23/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10096148,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 DODGE DAKOTA QUAD CAB 4X4, PURCHASED 8/16/04. CURRENTLY 2,200 MILES ON THE VEHICLE. WITHIN THE FIRST WEEK OF OWNERSHIP, THE VEHICLE DEVELOPED RATTLING OR CLUNKING NOISES IN THE FRONT END WHEN TRAVELING OVER BUMPS. ADDITIONALLY, THE VEHICLE IS OUT OF ALIGNMENT, AND PULLS TO THE LEFT WHEN BRAKING. TIRE WEAR (ALTHOUGH VERY SLIGHT @ 2,200 MILES IN NOT SYMMETRICAL BETWEEN LH FRONT TO RH FRONT TIRE). I WILL BE TAKING THE TRUCK INTO THE DEALERSHIP @ 3,000 MILES TO HAVE THEM LOOK AT THE FRONT END, AS WELL AS THE ALIGNMENT.",
        "vin": "1D7HG38N14S"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/28/2004",
        "dateOfIncident": "08/20/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10093237,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2004 DODGE DAKOTA CREW CAB WITH ABOUT 6,000 MILES ON IT.  FOR SEVERAL MONTHS IT HAS BEEN MAKING A CRUNCHING SOUND FROM THE FRONT END ON TIGHT TURNS.  I AM AWARE OF WIDESPREAD UPPER BALL JOINT PROBLEMS ON OTHER DAKOTAS.  THE DODGE DEALER SAYS THERE IS NOTHING WRONG, BUT THE NOISE IS PERSISTENT, AND THERE MUST BE SOMETHING WRONG.*AK",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/23/2004",
        "dateOfIncident": "08/30/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10093114,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN BRAKE ROTORS HEAT UP THE STEERING WHEEL SHAKES. AT FIRST SHAKING  IS MINOR NOT ALWAYS NOTICEABLE. BUT AS BRAKES HEAT AND COOL STEERING WHEEL SHAKE BECOMES  WORSE AND HAPPENS EVERY TIME BRAKES ARE APPLIED. SEVERE STEERING WHEEL SHAKE BECOMES DIFFICULT TO CONTROL WHEN BRAKING. CHRYSLER STATES NOT A WARRANTY ITEM AS BRAKES ONLY COVERED FOR 12,000 MILES AND MY COMPLAINT IS AN ISOLATED INCIDENT.   *JB",
        "vin": "1D7HG38N14S"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,EXTERIOR LIGHTING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/20/2004",
        "dateOfIncident": "03/24/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10092810,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "CRUISE CONTROL WOULD ENGAGE ITSELF INTERMITTENTLY WHILE DRIVING AT HIGH SPEED. VEHICLE HAD BEEN TO THE DEALER ON TWO SEPARATE OCCASIONS, AND THEY WERE UNABLE TO LOCATE CAUSE OF THE PROBLEM.  ALSO, A  LOUD POPPING SOUND WAS HEARD  WHILE BRAKING.  DEALER WAS NOTIFIED. DEALER REPLACED BOTH ROTORS AND BRAKE LIGHT 4 TIMES DUE TO MOISTURE BUILD UP. HOWEVER,  PROBLEM RECURRED. *AK",
        "vin": "1D7HG38N44S"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/17/2004",
        "dateOfIncident": "07/16/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10092572,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN SLOWING DOWN  BRAKE PEDAL PULSATED, AND THE STEERING WHEEL VIBRATED VIOLENTLY. *AK",
        "vin": "1D7HG12KX4S"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/13/2004",
        "dateOfIncident": "06/08/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10091891,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER HAVING THE VEHICLE REPAIRED FOUR TIMES, WHILE DRIVING  AT 65  MPH  VEHICLE  SHUTS DOWN.  ALSO, THE GEAR DROPPED INTO LOWER GEAR  AND BUCKED.  *AK",
        "vin": "1D7FL16K74S"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/17/2004",
        "dateOfIncident": "07/22/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10087044,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "FROM DAY 1 WHEN I PULLED OFF OF THE DEALERS LOT, THE TRUCK WILL STALL AFTER COMING TO A COMPLETE STOP OR RIGHT AFTER ENGINE HAS BEEN CRANKED UP.  WILL NOT SHUT COMPLETELY OFF BUT WHEN PULLING OFF FROM A STOPPED POSITION IF WOULD ACT AS ONLY ONE PISTON IS FIRING.  HAVE CARRIED  THE VEHICLE INTO THE DEALERSHIP APPROXIMATELY  8 TIMES THE FIRST THREE MONTHS.  ONLY AFTER DIAMLER CHRYSLER SENT A REPRESENTATIVE DOWN THEY DID A TEMPORARY FIX BY REPLACING THE O2 SENSORS.  THAT WORKED FOR ABOUT 8 MONTHS.  NOW THE PROBLEM IS BACK AGAIN.   *JB",
        "vin": "1D7HG38X33S"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/08/2004",
        "dateOfIncident": "08/05/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10086407,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 10/22/03 I HAD UPPER AND LOWER LEFT SIDE BALL JOINTS REPLACED DUE TO NOISE AND VIBRATION WITH MILEAGE UNDER 32100 MILES. ON 7/20/04 THE REAR UNIVERSAL JOINT HAD TO BE REPLACED AT 37821 MILES. ALL REPAIRS 100% MY COST. HERE WE ARE AGAIN AT 38340 MILES; NOISE, CLUNKING, AND VIBRATION IN THE FRONT SUSPENSION. BACK TO THE DEALER.*AK",
        "vin": "1B7GG22NXYS"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "08/06/2004",
        "dateOfIncident": "07/30/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 1,
        "numberOfInjuries": 0,
        "odiNumber": 10087400,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER  WENT OFF THE ROAD.  THE FACTS WERE UNKNOWN.  CONSUMER  HIT AN EMBANKMENT AND VEHICLE  ROLLED OVER. CONSUMER  WAS WEARING A SEAT BELT, AND  THE AIR BAGS FAILED DEPLOYED.   INSURANCE COMPANY STATED THAT   CAUSE OF  CONSUMER'S DEATH  WAS SUFFOCATION BY EITHER THE  SEAT BELT OR THE AIR BAG.*AK",
        "vin": "1D7GG16K54S"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/02/2004",
        "dateOfIncident": "07/20/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10083168,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WE JUST BOUGHT A NEW 2004 DODGE DAKOTA QUAD CAB.  WE HAVE JUST OVER 2000 MILES ON IT, MOSTLY EXPRESSWAY MILES  GOING TO WORK.  A FEW WEEKS AGO MY GIRLFRIEND (WHO IA A DAIMLER-CHRYSLER EMPLOYEE) PULLED OUT OF HER PARKING SPACE AT WORK TO GO HOME AND GOT ABOUT 20 FEET AND THE DRIVERS FRONT WHEEL FELL OFF IN FRONT OF THE OTHER EMPLOYEES GOING HOME.  THERE WAS NO NUT ON THE UPPER BALL JOINT, BUT THE PIN WAS STILL IN PLACE.  AND THE FOLLOWING SATURDAY AFTER THE INCIDENT SHE FOUND THE NUT (NOT BROKE) LYING ON OUR GARAGE FLOOR, RIGHT WHERE WE PARKED THE TRUCK.  SHE COULD HAVE BEEN KILLED ON THE EXPRESSWAY GOING TO WORK THAT DAY, OR KILLED SOMEONE ELSE.  AFTER THE TOW TRUCK DRIVER GOT THERE AFTER 4 HOURS (HE GOT LOST), HE PULLED THE DAKOTA UP WITH CHAINS ON THE FLATBED TOW TRUCK WHILE THE TRUCK WAS IN PARK.  THEN WHEN HE GOT TO ADRIAN DODGE IN ADRIAN MICHIGAN (WHERE WE BOUGHT THE TRUCK) HE BACKED UP TO ANOTHER TOW TRUCK, HOOKED UP THE DAKOTA WITH CHAINS AND PULLED IT OFF WHILE STILL IN PARK.  ALSO HE DID SOME DAMAGE TO THE FENDER FLARE.  WE TOOK PICTURES OF THE TRUCK BEFORE IT WAS TOWED.  THERE WAS NO BODY DAMAGE.  WE WANTED A NEW TRUCK, BECAUSE WE ONLY MADE ONE PAYMENT AND IT WAS A FACTORY DEFECT, BUT ADRIAN DODGE SAID THAT CHRYSLER SAID NO, THEY WOULD REPAIR THE DAMAGED ONE.  THEY SAID IT WAS A FACTORY DEFECT, AND BECAUSE WE BOUGHT IT WITH A EMPLOYEE DISCOUNT THEY COULDN''T DO ANYTHING FOR US.  WE ARE VERY ANGRY ABOUT THIS.  I THINK IT WAS NEGLIGENCE ON THEIR PART, BECAUSE SHE DROVE TO WORK WITHOUT THAT NUT ON THE TRUCK.  AND BECAUSE THEY TOWED IT ON AND OFF THE TOWTRUCK, IT COULD POSSIBLY MESS UP THE TRANSMISSION.   THEY FIXED OUR TRUCK AND WE HAVE IT BACK. *AK",
        "vin": "1D7HG38N94S"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/26/2004",
        "dateOfIncident": "03/23/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10082717,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TOOK DELIVERY OF 2004 DODGE DAKOTA SLT ON MARCH 5, 2004  WITHIN ONE MONTH, NEEDLE PEGGED AT HOT AND CHECK ENGINE LIGHT CAME ON UPON FIRST START UP OF DAY.  COMPUTER RESET ITSELF WHEN TRUCK WAS SHUT OFF AND THEN RESTARTED.  NO FURTHER PROBLEMS REMAINDER OF DAY.  HOWEVER, PROBLEM PERSISTED.  TOOK TRUCK INTO FRESNO DODGE FOR SERVICE-1ST TIME, MARCH 23: SENSOR WAS RESET; 2ND TIME IN SHOP, APRIL 10: SENSOR REPLACED; 3RD TIME IN SHOP, MAY 19: COMPUTER REPLACED-VEHICLE IN SHOP FOR 17 DAYS.  4TH TIME, JUNE 6: FRESNO DODGE PLACED DIAGNOSTIC COMPUTER COPILOT IN DASH; WE PUSHED BUTTON ON DIAGNOSTIC COMPUTER WHEN PROBLEM PRESENTED AGAIN ON JUNE 27.  HAVE NOT HEARD ONE WORD FROM FRESNO DODGE.  PROBLEM PRESENTED AGAIN ON JULY 26.*AK",
        "vin": "1D7HL48KX4S"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "06/02/2004",
        "dateOfIncident": "06/02/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10075569,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER INDICATED THAT TIRE PRESSURE STICKER PROVIDED WRONG INFORMATION. ALSO, THE MANUAL INSTRUCTION DID NOT PROVIDE  THE RIGHT PSI PRESSURE ON THE FRONT AND REAR TIRES. DEALER ADMITTED THERE WAS SOMETHING WRONG WITH THE INSTRUCTIONS.  *AK",
        "vin": "1D7HG48NX4S"
    },
    {
        "components": "STEERING,TIRES",
        "crash": false,
        "dateComplaintFiled": "05/14/2004",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10073649,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING WHEEL LOCKED WHILE TOWING BEHIND A RECREATIONAL MOTOR HOME. THIS CAUSED THE FRONT TIRES TO DRAG SIDEWAYS WHILE BEING DRIVEN AROUND A CURVE. *AK",
        "vin": "1D7HG48N84S"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/27/2004",
        "dateOfIncident": "04/27/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10067906,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION,DAY 1 LEAKING,REPLACED REAR TAIL AND SEAL, STILL LEAKING,THEN REPLACED THE YOKEAND UNIVERSIL,PROBLEM WITH LEAK SOLVED,NOW TRANSMISSION SHIFTS IREGULAR,HARD THUMPING NOISE COMEING FROM TRANSMISSION,LOUD CRACKING CRUNCHING NOISE COMING FROM SOME WHERE, DEALER SAYS ITS IN TRANSMISSION,DEALER DONT NOW PROBLEM, WANT TO LOOK IN TRANSMISSION, ALSO WHENRESUMEING TO SPEED IN SET CRUZ CONTROL,VIOLENT DOWN SHIFTING 5 MILES PER HOUR BEFORE SET SPEED,GOIG TO DEALER TO HAVE A LOOK AT AGAIN .  *AK",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "04/20/2004",
        "dateOfIncident": "03/10/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10063524,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "GT",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "WHEN ROLLING OVER A PIECE OF WOOD IN THE ROAD RIGHT REAR TIRE BLEW OUT.  NO INJURES REPORTED. *AK   CONSUMER ALSO LEARNED THAT HE COULDN'T PURCHASE TIRES ON VEHICLE , ONLY PASSENGER SIDE TIRES ARE AVAILABLE.  *LA",
        "vin": "1D7GG16K14S"
    },
    {
        "components": "SUSPENSION,TIRES",
        "crash": false,
        "dateComplaintFiled": "04/19/2004",
        "dateOfIncident": "11/02/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10067357,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "B.F. GOODRICH TIRE CO.",
                "productMake": "B.F.GOODRICH",
                "productModel": "10002012",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "PASSENGER'S SIDE FRONT TIRE WOBBLED WHILE DRIVING. AS A RESULT, THE STEERING WHEEL SHOOK VIOLENTLY. *AK",
        "vin": "1D7HG48N64S"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/31/2004",
        "dateOfIncident": "03/31/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10064246,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A BRAND NEW 2004 DAKOTA THAT HAS A BALL JOINT SQUEAK STARTING ALREADY AT JUST OVER 4000 MILES. THE LOCAL GARAGE I TOOK IT TO TELLS ME THAT IT IS THE START OF THE BALL JOINT PROBLEMS THAT DAKOTA'S ARE NOTORIOUS FOR.  MY SHORT INVESTIGATION ON THE INTERNET TURNED UP ALL KINDS OF DISCUSSION AND EXPENSIVE HORROR STORIES.  MY SON HAS A 2002 DAKOTA WHICH HAS HAD THE BALL JOINTS REPLACED 3 TIMES ALSO.      OBVIOUSLY, THIS IS A MAJOR DESIGN FLAW AND A SIGNIFICANT SAFETY HAZARD.  ACCORDING TO THE ARTICLE ON CBS, IF THESE AREN'T TAKEN CARE OF, THEY WILL SEPARATE AND THE WHEEL COMES OFF.  REPLACEMENT OF THESE PARTS BY DAIMLERCHRYSLER IS NOT ENOUGH.  DAIMLERCHRYSLER NEEDS TO REDESIGN THESE AND THE NHTSA NEEDS TO INSIST THAT THEY RECALL THE EFFECTED VEHICLES AND REPLACE THE BALL JOINTS WITH THE REDESIGNED PARTS.    AND SOON,  AS FAR AS I'M CONCERNED THIS PROBLEM IS VERY MUCH THE SAME AS THE FORD TIRE PROBLEM.  LET'S NOT WAIT UNTIL ALL THE LOSS OF LIFE THAT WAS EXPERIENCED WITH THAT PROBLEMS BEGINS WITH THE DODGE DAKOTA'S AND DURANGO'S.  I DON'T THINK THE NHTSA WANTS THAT ON THEIR CONSCIENCE.    PLEASE LET ME KNOW WHAT YOUR INVESTIGATION HAS FOUND AND WHAT RECOMMENDATION THE NHTSA WILL BE MAKING AND IN WHAT TIME FRAME.  I WOULD LIKE TO GET MY BALL JOINTS FIXED WITH NON-DEFECTIVE, CORRECTLY DESIGNED PARTS.    THANK YOU.    GORDON LANKER    RE: EA03 - 023.  *AK",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/31/2004",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10065342,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BALL JOINTS HAS ALREADY STARTED TO SQUEAK ON THE CONSUMERS NEW TRUCK.  THE CONSUMER WOULD LIKE THEM REPLACED WITH NON-DEFECTIVE PARTS.  *PH   *NM",
        "vin": ""
    },
    {
        "components": "STEERING,SUSPENSION,SERVICE BRAKES, HYDRAULIC,FUEL SYSTEM, GASOLINE,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/22/2004",
        "dateOfIncident": "03/17/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10063654,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "LOUD THUNKING NOISE COMES FROM THE TRANSMISSION WHEN ATTEMPTING TO STOP. REP FROM CHRYSLER STATED THIS WAS COMING FROM THE GAS TANK . THERE IS A VIBRATION BETWEEN 30-45 MPH COMING FROM THE DRIVE TRAIN. REP STATED THIS WAS \"NORMAL\".THERE IS ALSO A LOUD WHIRRING NOISE COMING FROM THE FUEL PUMP. REP ALSO STATES THIS IS NORMAL.BEARING NOSIE IS COMING FROM THE POWER STEERING PUMP. MY 2004 DODGE DAKOTA SXT HAS BEEN TO THE DEALER 5 TIMES AND THE DEALER STILL CANNOT FIX. THE REP FROM CHRYSLER STATED THIS IS THE \"BEST\" TRUCK DODGE HAS EVER BUILT. I'D HATE TO SEE THE WORST! SO FAR THE DEALER HAS REPLACED THE AC CONDENSER, COMPLETE RACK & PINION STEERING SYSTEM,  COMPLETE DRIVE SHAFT, REAR DIFFERENTIAL HOUSING, REAR SWAYBAR LINKS, THE BRAKES SHUDDER WHEN ATTEMPTING TO STOP , LEFT FRONT BRAKE SQUEAL, FRONT END NEEDED ALIGNING AFTER RACK & PINION STEERING REPLACEMENT . TRANSMISSION FLUID LEAKING FROM TAIL SHAFT SEAL.    *AK",
        "vin": "1D7GL12K54S"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/22/2004",
        "dateOfIncident": "01/15/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10054685,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "STOPPED AT TRAFFIC LIGHT, HAD VEHICLE OUT OF GEAR *MANUAL TRANSMISSION*, AFTER LIGHT CHANGED, PUT INTO GEAR, TRUCK LURCHED THEN WAS THROWN OUT OF GEAR, MAKING A LOUD GRINDING SOUND. IT HAS HAPPEND 3 TIMES SINCE THEN. DEALER SAYS TRANSMISSION IS JUST NEW BUT IT HAS 1000 MILES ON IT.",
        "vin": "1D7GL12K74S"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/12/2003",
        "dateOfIncident": "11/29/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10049661,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "CLICKING OR TAPPING NOISE  COMING FROM ENGINE COMPARTMENT. TRUCK RETURNED TO DEALER WITH NO SATISFACTION TO DATE. MECHANICS STATE IT MAY BE THE TIMING CHAIN AND SERVICE ADVISOR STATES THEY HAVE TO WAIT ON A REPRESENTATIVE TO COME CHECK THE VEHICLE BEFORE THEY CAN STATE WHAT IS WRONG WITH MY VEHICLE. I HAVE NO PROBLEM WITH THIS SYSTEM HOWEVER THEY STATE THE REPRESENTATIVE CANNOT ARRIVE BEFORE AFTER THE NEW YEAR. A MONTH IN A TRUCK THAT I CANNOT TAKE ON CHRISTMAS VACATION. DEALER HAS INFORMED ME TO KEEP OPERATING THE VEHICLE REGARDLESS OF THE CLICKING NOISE.*AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/04/2003",
        "dateOfIncident": "11/29/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10050034,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE CONSUMER TRIES TO ACCELERATE INTO TRAFFIC, THE ENGINE REVSUP BUT THE VEHICLE DOES NOT MOVE.  THERE HAVE BEEN SEVERAL OCCASIONS THAT THE CONSUMER WOULD TRY TO PASS A SLOW MOVING VEHICLE, ONLY TO HAVE THE RPM'S TO INCREASE BUT THE VEHICLE WOULD NOT ACCELERATE.  THIS PROBLEM HAS HAPPENED THREE TIMES IN THE PAST.  THE DEALER TRIED TO FIND THE PROBLEM, BUT WAS UNABLE TO.  THE MANUFACTURERS IS NOT AWARE OF THE PROBLEM.    *PH",
        "vin": "PLEASE PROV"
    }
]