[
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/22/2022",
        "dateOfIncident": "03/02/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457900,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving in nampa around 5pm when my truck lost power my fuel peddle had 0 response tried to pull off the road almost had an accident because truck died losing steering power and brakes was hard to push truck had lost the voltage board in the ficm. Upon going over forums this is a major common issue amongst many ford owners. I also have a ground short from unknown location not sure as to what has caused this but assuming it has to do with the wiring harnesses to the ficm.  I feel Ford should be in repair of this due to the large amount of issues across the nation of 6.0 owners but this is a very dangerous situation for owners. Not having steering control in such a large truck is extremely dangers.  Previous owner had same issue and replaced the ficm and said it shouldn’t ever be an issue I feel there is a wiring issue that needs to be addressed.",
        "vin": "1ftnx21p64e"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/12/2021",
        "dateOfIncident": "01/02/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387696,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE LOSES ALL POWER-STALLS AND LOSES FUNCTION WHEN IDLING. HAS OCCURRED WHEN EXITING FREEWAY WAY AND IN A REGULAR NEIGHBORHOOD STREETS. NEED TO RESTART AFTER STALL.",
        "vin": "1FTNW21P74E"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/11/2021",
        "dateOfIncident": "07/01/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387536,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 FORD F-250. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, THE VEHICLE STALLED WITH SEVERAL UNKNOWN WARNING LIGHTS DISPLAYED ON THE INSTRUMENT PANEL. RECENTLY, THE CONTACT STATED THAT AFTER EXPERIENCING THE FAILURE, THE VEHICLE FAILED TO RESTART. DUE TO THE FAILURE, THE CONTACT HAD THE VEHICLE TOWED TO HIS RESIDENCE. THE CONTACT THEN CALLED AN INDEPENDENT MECHANIC TO HIS HOME WHO INFORMED HIM THAT THE FUEL INJECTION CONTROL MODULE NEEDED TO BE REPLACED. NEITHER THE DEALER NOR THE MANUFACTURER WERE NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 130,000.",
        "vin": "1FTNW21P64E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/16/2020",
        "dateOfIncident": "12/04/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383705,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "SPARK PLUG BLEW OUT.  REPAIR ESTIMATE $1300.  FORD APPARENTLY KNEW ABOUT THE ISSUE AND SETTLED IN A CLASS ACTION LAWSUIT.  THEY DID NOT INFORM OWNERS OF THE POTENTIAL PROBLEM, SO I FEEL THEY ARE STILL CULPABLE FOR THE DAMAGES.",
        "vin": "1FTNF21L44E"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/08/2020",
        "dateOfIncident": "12/12/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353879,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "AT HIGHWAY SPEEDS, BETWEEN 70-80, THE FRONT RIGHT WHEEL VIBRATES/SHAKES VIOLENTLY AT FIRST IT IS MINOR, BUT GET'S WORSE AND WORSE AS IT FORCES THE TIRE OUT OF BALANCE.  THIS PROBLEM HAS BEEN REPORTED TO FORD MANY TIMES. THEY SAY THEY CANNOT FIND A PROBLEM. THE PROBLEM FIRST OCCURRED AT  30,387 MILES. THEY COULD NOT FIND THE PROBLEM. ANOTHER DEALERSHIP, AT 36999 MILES, REPLACED THE STEERING DAMPENER, BUT IT DID NOT FIX THE PROBLEM. THEN, THEY TORQUED THE  PITMEN ARM AND DECLARED THE PROBLEM FIXED. THE PROBLEM RETURNED BUT THE DEALERSHIPS CONTINUED TO STATE IT WAS A TIRE BALANCING PROBLEM. AFTER NEW TIRES WERE PURCHASED AT 50,252 MILES, THE PROBLEM PERSISTED. AT 56,013 MILES, THE PROBLEM WAS AGAIN REPORTED TO FORD. THEY STATED THEY COULD NOT BALANCE ONE OF THE 'NEW' TIRES. I TOOK THE VEHICLE TO DISCOUNT TIRE, WHICH SOLD ME THE TIRES AND USES THE SAME BALANCING MACHINE AS FORD. THEY REPLACED THE TIRE AND BALANCED THEM AGAIN. THE TECHNICIAN AT DISCOUNT TIRE TOLD ME THAT  HAD SEEN THE PROBLEM BEFORE (WHERE HE COULD NOT MAINTAIN BALANCE). THE ONLY FIX WAS TO INSTALL DUAL STEERING STABILIZERS. AFTER RESEARCHING THE INTERNET, IT WAS DISCOVERED THAT THIS ACTUALLY WAS THE FIX. AS IT TURNS OUT, TO INSTALL DUAL STABILIZERS, THE TRUCK MUST HAVE A 2\" LEVELING KIT INSTALLED TO ALLOW THE BRACKET TO FIT WITHOUT HITTING THE FRAME WHEN BUMPS ARE HIT.",
        "vin": "1FTNW21P14E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/04/2020",
        "dateOfIncident": "06/17/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343206,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 FORD F-250. THE CONTACT STATED THAT WHILE DRIVING AT 40 MPH, THE VEHICLE LOSS MOTIVE POWER AND STALLED WITHOUT WARNING. THE CONTACT COASTED THE VEHICLE OVER TO THE SHOULDER OF THE ROADWAY. THE VEHICLE WAS RESTARTED AND RESUMED NORMAL VEHICLE OPERATION. THE FAILURE RECURRED 4 TIMES. THE VEHICLE WAS NOT TAKEN TO BE DIAGNOSED NOR REPAIRED. A DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 180,000.",
        "vin": "1FTNX21P44E"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/02/2019",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11277681,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CALIBER SUDDENLY BROKE AND I HAD NO BRAKES.  ALL OF THE BRAKE FLUID LEAKED OUT.",
        "vin": "1FTNW21P94E"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/02/2019",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11277683,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING IN TOWN AND WHEN I GOT OUT OF THE TRUCK I NOTICED BRAKE FLUID ON THE GROUND.  EXAMINING THE BRAKES I SAW THAT THE BRAKE CALIBER WAS LEAKING.",
        "vin": "1FTNX21P04E"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/28/2019",
        "dateOfIncident": "08/15/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11271433,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "REDUCED POWERED UNDER A GRADE/LOAD. REDUCED ACCELERATION. BOGS DOWN, CANNOT REACH SPEEDS HIGHER THAN 40-45 MPH, UP HILL.",
        "vin": "1FTNW21P24E"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/17/2019",
        "dateOfIncident": "10/11/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11269219,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 FORD F-250. THE CONTACT STATED THAT A CONE FRACTURED IN THE FUEL PICKUP SENDER UNIT. THE FAILURE RECURRED NUMEROUS TIMES. ALSO, THE VEHICLE STALLED WHILE DRIVING WITHOUT WARNING. THE CONTACT COASTED TO THE SIDE OF THE ROAD AND THE VEHICLE WOULD NOT RESTART. THE CONTACT STATED THAT THE VEHICLE WAS TOWED MORE THAN ONCE TO GRIECO FORD OF DELRAY BEACH (3000 S FEDERAL HWY, DELRAY BEACH, FL 33483, (561) 278-0303) WHERE IT WAS DIAGNOSED THAT THE CONE DISINTEGRATED IN THE FUEL TANK AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE TECHNICIAN REPLACED THE CONE UNIT, FUEL FILTER, FUEL LINES, AND INJECTOR. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND PROVIDED CASE NUMBER: CAS-24538661. THE FAILURE MILEAGE WAS APPROXIMATELY 59,000.",
        "vin": "1FTNW21PX4E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/21/2019",
        "dateOfIncident": "06/07/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11221790,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 FORD F-250. WHILE DRIVING APPROXIMATELY 65 MPH, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS PULLED OVER TO THE SIDE OF THE ROAD AND RESTARTED. THE FAILURE RECURRED THREE TIMES. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC TO BE DIAGNOSED, BUT THE CAUSE OF THE FAILURE COULD NOT BE DETERMINED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND REFERRED THE CONTACT TO NHTSA. THE DEALER WAS NOT CONTACTED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 296,000.",
        "vin": "1FTNW21P24E"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/31/2019",
        "dateOfIncident": "04/01/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217074,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 FORD F-250. WHILE DRIVING 40 MPH, THE VEHICLE STALLED AND IT TOOK NUMEROUS ATTEMPTS TO RESTART. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE DEALER WAS NOT NOTIFIED. AN INDEPENDENT MECHANIC DIAGNOSED THE VEHICLE, BUT WAS NOT ABLE TO LOCATE THE CAUSE OF THE FAILURE. THE MANUFACTURER WAS NOTIFIED. THE VEHICLE WAS NOT REPAIRED. THE CONTACT STATED THAT THE FAILURE WAS SIMILAR TO WHAT WAS LISTED IN NHTSA CAMPAIGN NUMBER: 05V270000 (ELECTRICAL SYSTEM). THE FAILURE MILEAGE WAS 150,000. *BF*    'PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).'*JB",
        "vin": "1FTNX21PX4E"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/17/2019",
        "dateOfIncident": "05/16/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208303,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "EXPERIENCE STALLING WITHOUT WARNING WHILE DRIVING AND MAY OR MAY NOT RESTART. IT WILL ALSO STALL AFTER LETTING OFF THE THROTTLE WHEN APPROACHING A STOP AND OCCASIONALLY WHILE WHILE STOPPED AT A LIGHT. RPM'S WILL ALSO DROP TO 500 AND I HAVE NO THROTTLE RESPONSE, IF IT DOESN'T STALL COMPLETELY. THIS MAY OCCUR 4 OR MORE TIMES A DAY, THEN MAY NOT OCCUR AGAIN FOR A FEW DAYS OR WEEKS. THERE IS ABSOLUTELY NO TELLING WHEN IT WILL OCCUR, IT IS TO RANDOM TO IDENTIFY THE PROBLEM. NOW MY HORN AND CRUISE CONTROL HAVE STOPPED WORKING AS WELL, WHEN I REPLACE THE FUSE IT BLOWS IMMEDIATELY.    I HAVE REPLACED THE FICM, EBP SENSOR AND WIRING, FUEL PUMP AND STILL HAVE NOT RESOLVED THE PROBLEM. MY TRUCK IS NOT SAFE TO DRIVE. THIS HAS BEEN HAPPENING SINCE SHORTLY AFTER BUYING THE TRUCK IN 2018, BUT SEEMS TO BE GETTING WORSE AS THE TEMPERATURE WARMS UP. THE FOLLOWING RECALL NUMBER 05V270000 SOUNDS EXACTLY LIKE WHAT I AM EXPERIENCING, BUT DOES NOT SHOW A RECALL FOR MY TRUCK.",
        "vin": "1FTNW21P74E"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/05/2019",
        "dateOfIncident": "04/04/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11193970,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING GEAR BOX SPLINE SHAFT SNAPPED OFF AT THE PITMAN ARM CONNECTION WHILE DRIVING,CAUSING LOSS OF STEERING CONTROL.",
        "vin": "1FTNX21P94E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/02/2019",
        "dateOfIncident": "03/10/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183594,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2004 F 250 SUPER DUTY WITH THE 6.0 ENGINE  IT IS A KNOWN FACT THAT THE BOLTS THAT HOLD THE HEADS DOWN STREACH WHEN HOT LETTING WATER INTO THE OIL SYSTEM ITS ALL OVER THE INTERRNET ABOUT THE  6.O ENGINE THAT FORD PROVIDES THE ONLY FIX IS TO HAVE THE CAB REMOVED AND REPLACE THE BOLTS WITH STUDS THAT CAN TAKE THE HIGH TEMP THAT THE ENGINE PRODUCES THIS IS ONLY ONE OF THE PROBLEMS BUT THIS PROBLEM COST ME OVER 5000$ TO FIX SURE WOULD BE NICE FOR YOU ALL TO LOOK INTO THIS PRODUCT THAT FORD HAS BEEN USEING AND KNOWS THERES A PROBLEM WITH THAT ENGINE,,YOU GO TO TRADE IT IN AT FORD AND THEY SEE IT HAS A 6.0 ENGINE IN IT AND THE PRICE DROPS ,WAY ,WAY TO MUCH FOR A TRUCK THAT SOLD NEW FOR 45000$ , I FOUND MY TRUCK LEAKING WATER IN THE DRIVE WAY SETTING STILL NO REASON FOR IT TO START LEAKING ,,I HAVE THE BILLS FROM FORD DEALER WHERE I HAD IT FIXED IF NEEDED PLEASE LOOK INTO THIS ENGINE ITS NOT RIGHT TO PUT SO MUCH MONEY INTO A TRUCK THAT HAS THIS PROBLEM THAT NOT ONE OTHER ENGINE FORD HAS DOES WHAT THE 6.0 DOES ,ALSO BAD EGR IT HAS TO BE BY PASSED THIS STUFF SHOULD NOT HAPPEN ALSO SHOWED WATER IN GAS EMPTYED THE CANTAINER AND THEN GAS GAUGE STOPS WORKING AND GAS LIGHT STAYS ON ALL THE TIME ,,,,NEVER BUY FORD",
        "vin": "1FTNW21P74E"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/28/2018",
        "dateOfIncident": "02/01/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11104520,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVERS SIDE DOOR LATCH WILL NOT LATCH CLOSED AFTER OPENING THE DOOR FROM THE INSIDE. IN ORDER FOR THE DOOR TO LATCH IN THE CLOSED POSITION I HAVE TO REOPEN THE DOOR FROM THE OUTSIDE THEN AND ONLY THEN WILL THE DOOR STAY CLOSED.",
        "vin": "1FTNX21L44E"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/06/2018",
        "dateOfIncident": "06/03/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11100217,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "MICHELIN NORTH AMERICA",
                "productMake": "BF GOODRICH",
                "productModel": "ALL TERRAIN TAK02",
                "productYear": "9999",
                "size": "LT265/75/R16",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 FORD F-250 EQUIPPED WITH BF GOODRICH ALL TERRAIN TAK02 TIRES, SIZE: LT265/75/R16. WHILE DRIVING 75 MPH, THE REAR PASSENGER TIRE TREAD SEPARATED. THE DEALER AND MANUFACTURER WERE NOT MADE AWARE OF THE FAILURE. THE TIRE AND VEHICLE FAILURE MILEAGE WAS 100,600.",
        "vin": "1FTNW21PX4E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/14/2017",
        "dateOfIncident": "06/01/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11046164,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "FAULTY EXHAUST MANIFOLD BOLTS BREAK OFF AND CAUSE EXCESSIVE NOISE, EXHAUST ENTERS THE DRIVERS CABIN, VEHICLE WILL NOT PASS EMISSIONS INSPECTION AND IS EXPENSIVE TO REPAIR. I HAVE 4 FORD VEHICLES WITH THIS PROBLEM. FIRST INCIDENT WAS AT AROUND 50,000 MILES AND 48 MONTHS AFTER PURCHASE. FORD REFUSED TO MAKE REPAIRS UNDER ANY PORTION OF THE FACTORY WARRANTY. THEY CLAIM LIFETIME EMISSIONS WARRANTY DOESN'T COVER IT, NOR THE 100,000 POWERTRAIN WARRANTY. I HAVE SPENT OVER $8000.00 MAKING REPAIRS TO THESE EXHAUST MANIFOLDS.",
        "vin": "1FTNF21LX4E"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "07/24/2017",
        "dateOfIncident": "07/09/2017",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11010238,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE FREEWAY THE ACCELERATOR GOT STUCK CAUSING US TO HAVE AN ACCIDENT.  AS THE TRUCK INCREASED IN SPEED MY HUSBAND STOMPED ON THE BREAK AND THE TRUCK WAS ONLY GAINING SPEED.  WE PLACED THE TRUCK ON PARK AND THE TRUCK EVENTUALLY CAME TO A STOP CAUSING THE TRUCK AN IMMEDIATE STOP AND FORCED US DOWN A HILL.  THE TRUCK WAS TOTALED BECAUSE WE WERE PULLING A 5TH WHEEL.",
        "vin": "1FTNW20S24E"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/27/2017",
        "dateOfIncident": "11/24/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10968613,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD REPLACED DRIVE SHAFT TWICE AND UNIVERSALS TWICE. EVERY COUPLE OF MONTHS THE FRONT END STARTS TO SHAKE AND THESE PARTS HAVE TO BE REPLACED.",
        "vin": "1FTNW21L04E"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/08/2017",
        "dateOfIncident": "02/18/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10950382,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER SIDE, FACTORY INSTALLED, RUNNING BOARD BROKE INTO THREE PIECES. TWO OF THE PIECES FELL OFF THE VEHICLE CAUSING MY WIFE TO FALL TO THE PAVEMENT IN THE YUBA CITY, CA POST OFFICE PARKING LOT.  MY WIFE WAS INJURED IN THE FALL.",
        "vin": "1FTNX20P14E"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/26/2016",
        "dateOfIncident": "09/20/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10919225,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "COMPLETE LOSS OF BRAKING DUE TO A BROKEN REAR BRAKE LINE. OCCURRED AFTER PULLING/ PARKING A 12000 LB 5TH WHEEL RV.  BREAK ATTRIBUTED TO RUST BY FORD SERVICE DEPT.",
        "vin": "1FTNW21P64E"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/06/2016",
        "dateOfIncident": "09/30/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10914316,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 FORD F-250. WHILE DRIVING APPROXIMATELY 45 MPH, THE VEHICLE STALLED AND THE CHECK ENGINE WARNING INDICATOR ILLUMINATED. THE CONTACT HAD TO MANEUVER THE VEHICLE TO THE SHOULDER. AFTER APPROXIMATELY HALF AN HOUR, THE VEHICLE RESTARTED, BUT STALLED AGAIN SIX MILES LATER. THE VEHICLE WAS TOWED TO THE CONTACT'S RESIDENCE. THE VEHICLE WAS DIAGNOSED BY AN INDEPENDENT MECHANIC WHO STATED THAT THE CLOGGED INJECTOR PUMPS FAILED AND NEEDED REPLACEMENT. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VIN WAS INVALID. THE APPROXIMATE FAILURE MILEAGE WAS 195,000.",
        "vin": "1F2NX21T74E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/16/2016",
        "dateOfIncident": "04/15/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10907261,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 FORD F-250. WHILE DRIVING VARIOUS SPEEDS, THE VEHICLE STALLED IN THE MIDDLE OF THE ROAD WITHOUT WARNING. THE VEHICLE WAS TAKEN TO A LOCAL DEALER AND THE FUEL INJECTION CONTROL MODULE WAS REPLACED, BUT THE FAILURE RECURRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 103,000.",
        "vin": "1FTNX21PX4E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/01/2016",
        "dateOfIncident": "07/27/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10892003,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 FORD F-250. WHILE DRIVING VARIOUS SPEEDS, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS ABLE TO RESTART. THE VEHICLE WAS TAKEN TO A DEALER WHERE THE FAILURE WAS UNDETERMINED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 82,000.",
        "vin": "1FTNX21P64E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/07/2016",
        "dateOfIncident": "05/22/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10873006,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE THIRD FROM THE FRONT ON THE PASSENGER SIDE SPARK PLUG BLEW OUT AND A HELI COIL WAS REPLACED AND AFTER UNDER 500 MILES IT BLEW OUT AGAIN NOW THEY ARE REPLACING A SECOND HELI COIL AND I AM WORRIED ON IF IT WILL HOLD AND HOW DEPENDABLE IT WILL BE. SECOND I AM WONDERING IF THERE IS ANY COMPENSATION FROM FORD MOTOR CO. FOR THE EXPENSES OF THIS PROCEDURE AND IF ANY HEAD WORK/REPLACEMENT IS NEEDED AND WHOM WOLUD BE RESPONSABLE FOR THE COST.",
        "vin": "1FTNW21L34E"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/02/2016",
        "dateOfIncident": "01/07/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10862465,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 FORD F-250. THE CONTACT STATED THAT THE GAUGES ON THE DASHBOARD BECAME INOPERATIVE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 151,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/12/2015",
        "dateOfIncident": "11/07/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10789981,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 FORD F-250. WHILE DRIVING 50 MPH WITHOUT WARNING, THE VEHICLE STALLED. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC FOR DIAGNOSTIC TESTING. THE CONTACT WAS INFORMED THAT THE VEHICLE WAS UNDER RECALL. THE VEHICLE WAS PREVIOUSLY REPAIRED UNDER NHTSA CAMPAIGN NUMBER: 05V270000 (ELECTRICAL SYSTEM) HOWEVER, THE FAILURE RECURRED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 225,000. UPDATED 1/21/2016 *SS  *TR",
        "vin": "1FTNW21P24E"
    },
    {
        "components": "STEERING,FUEL SYSTEM, GASOLINE,POWER TRAIN,ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/05/2015",
        "dateOfIncident": "09/05/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10779797,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 FORD F-250. THE CONTACT STATED THAT THE FUEL LINES WERE SEVERELY CORRODED AND WERE LEAKING. AS A RESULT, THE TRANSMISSION FAILED WHILE DRIVING AT 40 MPH, CAUSING THE CONTACT TO USE EXCESSIVE FORCE IN ORDER TO DRIVE THE VEHICLE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE CONTACT REPLACED THE POWER STEERING FUEL LINE, ONE BRAKE LINE, AND ONE TRANSMISSION FUEL LINE.  THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 180,000.  UPDATE 01/13/16 MA",
        "vin": "1FTNF21L24E"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/14/2015",
        "dateOfIncident": "06/20/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10733944,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 FORD F-250. WHILE DRIVING AT ANY SPEED, THE VEHICLE WOULD STALL WITHOUT WARNING. THE FAILURE RECURRED NUMEROUS TIMES. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 05V270000 (ELECTRICAL SYSTEM). THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 184,000.",
        "vin": "1FTNW21P14E"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/10/2015",
        "dateOfIncident": "07/02/2015",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10733270,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 FORD F-250. WHILE DRIVING 45 MPH IN RAINY CONDITIONS, THE WINDOW WIPERS WERE ACTIVATED AND A STRONG BURNING ODOR AND SMOKE EMITTED INSIDE THE CABIN. THE VEHICLE WAS MANEUVERED TO THE SIDE OF THE ROAD. THE CONTACT INSPECTED UNDERNEATH THE HOOD AND NOTICED THE WIPER MOTOR WAS COMPLETELY BURNED. THERE WERE NO FLAMES PRESENT. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC, WHO CONFIRMED THAT THE WIPER MOTOR WOULD NEED TO BE REPLACED. THERE WAS A RECALL FOR NHTSA CAMPAIGN NUMBER: 01V258000 (VISIBILITY); HOWEVER, THE REMEDY CONSISTED OF REPLACING THE WIPER MOTOR GEAR CASE COVER. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 215,000.",
        "vin": "1FTNX21S8YE"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/27/2015",
        "dateOfIncident": "06/24/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10730811,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "B.F. GOODRICH TIRE CO.",
                "productMake": "B.F.GOODRICH",
                "productModel": "ALL-TERRAIN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "WHILE DRIVING WEST BOUND ON INTERSTATE HIGHWAY 80 EAST OF IMLAY, NV AT APPROXIMATELY 70 MPH IN LANE #2, THE LEFT REAR TIRE LOST ABOUT 80-85% OF IT'S TREAD IN ABOUT 10 SECONDS, EXTENSIVELY DAMAGING THE UNDERSIDE WHEEL WELL AREA NEAR THE TIRE AND THE BODY OF THE VEHICLE.  CONTROL OF THE VEHICLE WAS NEVER LOST, ALTHOUGH THERE WAS VEERING FROM SIDE TO SIDE AND VIOLENT LOUD BANGING AS THE TREAD PIECES WERE HITTING THE VEHICLE.  THE REMAINING TIRE CARCASS DID NOT LOSE AIR PRESSURE, AND WE MANAGED TO SAFELY COME TO A STOP ON THE RIGHT HIGHWAY SHOULDER.  AFTER STOPPING AND DETERMINING THE EXTENT OF DAMAGE TO THE VEHICLE AND THAT THE TIRE WAS NOT FLAT, WE SLOWLY DROVE ABOUT ONE MILE TO THE NEXT EXIT, LEFT THE HIGHWAY AND CHANGED THE TIRE.  THE 4 TIRES HAD ALL BEEN PROPERLY INFLATED AND HAD ABOUT 11,045 MILES ON THEM SINCE ALL FOUR WERE PURCHASED IN 2012.  THE TIRES ARE B F GOODRICH, LT265 / 75R16, \"RUGGED TERRAIN T/A\".   THE VEHICLE IS A 2004 FORD F-250 SUPER CAB 4X4 PICKUP TRUCK.",
        "vin": "1FTNX21P24E"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/20/2015",
        "dateOfIncident": "02/10/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10689658,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING THE VEHICLE 20MPH LOST ALL POWER TO ENGINE, LEFT WITHOUT POWER STEERING, BRAKES OR CONTROL OF VEHICLE.  PULLED OVER AND TRIED TO START VEHICLE,  IT DID NOT START, BUT AFTER A FEW MINUTES IT RESTARTED.  THIS HAS HAPPENED THREE TIMES IN FEBRUARY 2015.  I CONTACTED FORD MOTOR COMPANY, WAS ASSIGNED A  CASE NUMBER.  SHE CHECKED ON NHTSA RECALL 05V270000.  SHE STATED THAT THE REPAIRS TO THIS VEHICLE HAVE ALREADY BEEN COMPLETED AND THAT I WAS NOW ON MY OWN IN REGARDS TO REPAIRS.  WHILE DOING RESEARCH, I HAVE FOUND OUT THAT PEOPLE ARE STILL HAVING SOME PROBLEMS REGARDING THIS ISSUE.  FORD SEEMS TO HAVE WASHED THEIR HANDS OF THIS ISSUE OF RESPONSIBILITY REGARDING THEIR VEHICLES. THIS IS WHY I AM FILING A CASE.  *TR",
        "vin": "1FTNW21P94E"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/02/2015",
        "dateOfIncident": "10/06/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10669681,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 FORD F-250. THE CONTACT STATED THAT THE VEHICLE STALLED SEVERAL TIMES. THE VEHICLE WAS ABLE TO RESTART, BUT THE FAILURE PROGRESSED. THE VEHICLE WAS NOT DIAGNOSED. THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 05V270000 (ELECTRICAL SYSTEM). THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": "1FTNW20P64E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, DIESEL,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/04/2014",
        "dateOfIncident": "03/06/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10618762,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE ACCELERATES SPORADICALLY ON ITS OWN.  ENGINE OCCASIONALLY DIES AT STOP LIGHTS.  MUST KEEP BRAKE PEDAL FIRMLY PUSHED AT STOP AS ENGINE WILL SUDDENLY ACCELERATE.  I HAVE ALREADY REPLACED THE TURBO.  THE DEALER SAYS IT COULD BE MANY DIFFERENT THINGS WRONG.  THE 2003-2007 DIESELS ARE NOTORIOUS FOR BAD TURBO, FUEL INJECTORS AND A HEAD BOLT PROBLEM THAT REQUIRES REMOVING THE CAB.  I PURCHASED THIS TRUCK NEW AND IT NOW HAS 39000 MILES ON IT.  THIS IS A SERIOUS SAFETY CONCERN.  *TR",
        "vin": "1FTNW21P54E"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/01/2014",
        "dateOfIncident": "05/31/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10595396,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE EXPERIENCED CATASTROPHIC BRAKE FAILURE WHILE MANEUVERING IN DRIVEWAY. REAR STEEL BRAKE LINE FAILED DUE TO INSTALLATION ERROR WHICH CAUSED IT TO WEAR THROUGH ON A FRAME MOUNTED FASTENER. I WAS UNDER THE IMPRESSION THAT VEHICLE BRAKING SYSTEMS WERE \"2 CHANNEL\" IN THAT IF A CATASTROPHIC FAILURE WAS EXPERIENCED THAT ONLY HALF OF THE SYSTEM WOULD BE AFFECTED. MY EXPERIENCE YESTERDAY HAS CAUSED MUCH CONCERN FOR OTHER OWNERS OF THIS TYPE OF VEHICLE. IN MY OPINION, ALL BRAKE LINES SHOULD BE MANUFACTURED FROM STAINLESS STEEL AS IT APPEARS THE FUEL LINES CURRENTLY ARE. I FEEL THIS IS A SERIOUS DEFICIENCY THAT SHOULD BE ADDRESSED. THANKFULLY, MY EXPERIENCE OCCURRED AT A SLOW RATE OF SPEED. IF IT HAD OCCURRED AT ROAD OR HIGHWAY SPEED, I MAY NOT HAVE BEEN ABLE TO FILE THIS COMPLAINT.  *TR",
        "vin": "1FTNX21L14E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/04/2014",
        "dateOfIncident": "05/04/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10586466,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "SPARK PLUG NUMBER 3 BLEW OUT OF THE ALUMINUM CYLINDER HEAD.  *TR",
        "vin": "1FTNW21L24E"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/25/2014",
        "dateOfIncident": "02/01/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10574666,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 FORD F-250. THE CONTACT STATED THAT WHILE EXITING A DRIVEWAY, THE VEHICLE STALLED. THE VEHICLE WAS ABLE TO BE RESTARTED AFTER STALLING ON MORE THAN OCCASION. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER, WHO WAS UNABLE TO DIAGNOSE THE FAILURE. THE VEHICLE WAS THEN TAKEN TO AN INDEPENDENT MECHANIC, WHO ALSO WAS UNABLE TO DIAGNOSE THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 15000.",
        "vin": "1FTNW21P74E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/23/2013",
        "dateOfIncident": "08/13/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10544959,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 FORD F-250 TDI. THE CONTACT STATED THAT WHILE DRIVING 55 MPH, WHITE SMOKE STARTED TO EMIT OUT OF THE EXHAUST PIPE. THE VEHICLE WAS TAKEN TO THE DEALER. THE TECHNICIAN DIAGNOSED THAT THE VEHICLE HAD BLOWN A HEAD GASKET. AS A RESULT, THE COOLER, EGR, AND HEAD GASKET NEEDED TO BE REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS REPAIRED. THE FAILURE MILEAGE WAS 75,961 AND THE CURRENT MILEAGE WAS 76,000.   UPDATED 11/19/13*CN UPDATED 12/2/2013 *JS",
        "vin": "1FTNX21P44E"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/17/2013",
        "dateOfIncident": "03/06/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10543979,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 FORD F-250 TDI. THE CONTACT STATED THAT WHILE DRIVING 10 MPH UPHILL AND TOWING A BOAT, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS TAKEN TO THE DEALER. THE TECHNICIAN WAS UNABLE TO DIAGNOSE THE FAILURE BUT STATED THAT HE FOUND PERMATEX GASKET MATERIAL IN THE FUEL SYSTEM, CAUSING THE INJECTOR O-RING TO BLOW. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 140,000 AND THE CURRENT MILEAGE WAS 1637,000.",
        "vin": "1FTNW21P44E"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/06/2013",
        "dateOfIncident": "01/01/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10523485,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "FORD F SERIES AND SUPER DUTY PICKUPS WITH 5.4 ENGINES.  MY 2004 FORD F-250 HAS AN ISSUE WITH LEAKING EXHAUST MANIFOLDS.  WHEN LOOKING INTO THIS FURTHER WHILE GETTING PRICING, I FOUND OUT THAT THIS WAS NOT AN ISOLATED ISSUE AND THAT IT WAS A COMMON OCCURRENCE DUE TO A MISTAKE IN MATERIAL USED FOR THE EXHAUST MANIFOLD BOLTS.  SO COMMON THAT AFTERMARKET SUPPLIERS ARE MAKING REPLACEMENT KITS FOR THE PROBLEM.  THE EXHAUST MANIFOLD ATTACHING STUDS WERE MADE OUT OF A METAL THAT QUICKLY RUSTS OUT CAUSING THE FAILURE.  AFTER THE FAILURE, I BEGAN TO NOTICE EXHAUST GASES ENTERING THE CAB OF THE VEHICLE THROUGH THE CLIMATE CONTROL, WHICH ITS FRESH AIR INTAKE IS IN THE GENERAL DIRECTION OF THE EXHAUST MANIFOLD.  I ALSO QUESTION THE EMISSIONS STANDARDS BECAUSE OF THE EXHAUST LEAK NOT TO MENTION THE POTENTIAL FIRE RISK FROM HEATED GASES AND FLAMES ENTERING THE ENGINE COMPARTMENT.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/02/2013",
        "dateOfIncident": "11/10/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10522838,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 FORD F-20. THE CONTACT STATED THAT THERE WAS A RECURRING FAILURE WITH THE EGR VALVE COOLER. THE TURBO ENGINE ALSO FAILED AND AS A RESULT, CAUSED DAMAGE TO THE ENGINE HEADS WHICH RESULTED IN A STALLING FAILURE. IN ADDITION, THE FUEL LEVEL GAUGE WOULD NOT PROVIDE ACCURATE FUEL LEVEL READINGS.  THE FAILURE WAS REPORTED TO THE MANUFACTURER. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 1,500 AND THE CURRENT MILEAGE WAS 43,322.   *TR",
        "vin": "1FTNW21P44E"
    },
    {
        "components": "STRUCTURE,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/28/2013",
        "dateOfIncident": "06/28/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10522247,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 FORD F-250. THE CONTACT STATED THAT THE BRAKES FAILED. AFTER INSPECTING THE VEHICLE, THE CONTACT DISCOVERED THAT THE FRAME RAIL AND UNDERCARRIAGE WERE COMPLETELY RUSTED. IN ADDITION, THE EXHAUST MANIFOLD WAS CORRODED AND THERE WERE FUMES ENTERING THE CABIN OF THE VEHICLE. THE REAR PLATES FOR THE PARKING AND EMERGENCY BRAKES WERE ALSO COMPLETELY RUSTED. THE VEHICLE WAS NOT TAKEN TO THE DEALER FOR INSPECTION OR REPAIRS. THE MANUFACTURE WAS MADE AWARE OF THE FAILURE. THERE WERE NO RECALLS FOR THE VEHICLE. THE FAILURE AND THE CURRENT MILEAGE WAS 59,000.    *TR",
        "vin": "3FTNF21L74M"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/13/2013",
        "dateOfIncident": "05/13/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10511783,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 FORD F-250. THE CONTACT STATED THAT HILE DRIVING 50 MPH, THE VEHICLE BEGAN TO LOSE POWER. THE VEHICLE WAS TOWED TO A DEALER FOR DIAGNOSIS AND THE TURBO WAS REPLACED. THE FAILURE WAS A RECURRING ISSUE AND WAS REPLACED A TOTAL OF FOUR TIMES. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE BUT OFFERED NO ASSISTANCE. THE FAILURE MILEAGE WAS 800 AND THE CURRENT MILEAGE WAS 56,000.",
        "vin": "1FTNW21P64E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL,ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/28/2012",
        "dateOfIncident": "12/24/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10490409,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE HAS BEING STALLING WHILE DRIVING AT 1ST START UP IN THE MORNING FOR OVER 3 WEEKS. THE PROBLEM IS NOW GETTING DAILY. I UNDERSTAND THERE IS A RECALL 05S34 THAT HAS THIS PROBLEM WITH THE FORD DIESELS. MY VEHICLE IN CURRENTLY BROKEN DOWN ABOUT 60 MILES FROM MY HOME. THE AUTO REPAIR SHOP THINKS ITS A HIRING HARNESS TO THE FICM.  *TR",
        "vin": "1FTNW21PX4E"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/29/2012",
        "dateOfIncident": "08/15/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10472917,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 FORD F-250. THE CONTACT STATED THAT THE VEHICLE WOULD NOT START. THE VEHICLE WAS TOWED TO DEALER FOR DIAGNOSIS WHERE THE STATED THAT THEY NEEDED TO REPLACE THE HEAD GASKET. THE VEHICLE WAS REPAIRED BUT THE VEHICLE STILL WOULD NOT START. THE DEALER THEN ADVISED THE CONTACT THAT THE FUEL MODULE NEEDED TO BE REPLACED. THE VEHICLE WAS NOT FURTHER REPAIRED. THE MANUFACTURER WAS CONTACTED BUT PROVIDED NO ASSISTANCE, STATING THAT THE VEHICLE WAS NOT UNDER RECALL. THE FAILURE AND THE CURRENT MILEAGE WAS 173,000.",
        "vin": "1FTNW21P44E"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/04/2012",
        "dateOfIncident": "05/28/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10457495,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 FORD F-250. WHILE TRAVELING 60 MPH, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THE CONTACT WAS INFORMED THAT THE FUEL INJECTION CONTROL MODULE NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE CURRENT AND FAILURE MILEAGES WERE 126,000.",
        "vin": "1FTNW20P94E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/20/2012",
        "dateOfIncident": "04/10/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10455899,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "HAD MISS FIRES IN ENGINE THIS TRUCK HAS NEVER SHOWN CHECK ENGINE LIGHT WHILE DRIVING DOWN ROAD AT 70 MPH THE ENGINE STARTED MISSING CHECK ENGINE LIGHT NEVER CAME ON??? TOOK TRUCK TO SHOP .THE ENGINE MELTED THE TIP OFF A SPARK PLUG IN SIDE THE CYLINDER ,IT DESTROYED THE CYLINDER WALL HAVE TO REPLACE ENGINE.ASKED THE TECH WHAT CAUSED THIS HE SAID ENGINE WAS RUNNING TO LEAN THIS TRUCK HAS NEVER SHOWED CHECK ENGINE LIGHT  AND THERE WAS NO TROUBLE CODES FOR TECH TO READ??? SOMETHING IS NOT RIGHT WITH THE COMPUTER SYSTEM IN THIS TRUCK.    *JS",
        "vin": "1FTNW21L84E"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "03/22/2012",
        "dateOfIncident": "03/12/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10452659,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 FORD F-250 . THE CONTACT NOTICED THAT THE REAR CENTER SEAT BELT BUCKLE WAS NOT CONNECTED TO THE SEAT. THE VEHICLE WAS TAKEN TO THE DEALER FOR INSPECTION AND THE SEAT BELT WAS CONNECTED. THE FAILURE AND THE CURRENT MILEAGE WAS 55,000.   UPDATED 05/08/12*LJ  THE CONSUMER STATED THE SEAT BELT RECEIVED WAS ONLY CONNECTED BY A PLASTIC RING HOLDING IT TO ANOTHER RECEIVER.  THE DEALER CUT A HOLE IN THE CARPET TO FIND WHERE IT SHOULD HAVE BEEN CONNECTED.",
        "vin": "1FTNW21P24E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/26/2012",
        "dateOfIncident": "01/25/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10445516,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 FORD F-250 DIESEL. THE CONTACT STATED THAT WHILE DRIVING 15 MPH, EXCESS SMOKE EMITTED FROM THE EXHAUST PIPE. THE DEALER WAS NOTIFIED AND STATED THAT THE EGR COOLER MIGHT BE DEFECTIVE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND OFFERED NO ASSISTANCE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGES WERE 86,100.  UPDATED 02/27/12*LJ  UPDATED 02/27/12",
        "vin": "1FTNF21P54E"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/18/2012",
        "dateOfIncident": "09/15/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10444317,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "ABOUT 9/15/2010 THE VEHICLE, WHILE STOPPED AT A RED LIGHT FAILED TO ACCELERATE WHEN LIGHT CHANGED AND THE GAS PEDAL WAS DEPRESSED.  THE TRUCK THEN STALLED AND TOOK UP TO 5 MINUTES TO RESTART.  THE INCIDENT DID NOT REPEAT FOR SEVERAL MONTHS.  THE NEXT INCIDENT THE TRUCK FAILED TO ACCELERATE AFTER SLOWING TO NEAR STOP AT A YIELD AT A HIGHWAY CROSSING NEARLY CAUSING AN ACCIDENT.  REPLACED FUEL FILTER AND HAD A TUNE UP ALTHOUGH IT HAD RECENTLY BEEN DONE AND IT DIDN'T HAPPEN AGAIN FOR A FEW WEEKS.  AFTER A FEW WEEKS OF HARD DRIVING WITH NO INCIDENCE THE TRUCK AGAIN FAILED TO ACCELERATE ON HIGHWAY ENTRANCE RAMP NEARLY CAUSING ANOTHER ACCIDENT.  AFTER PULLING OVER AND TURNING OFF THE ENGINE AND RESTARTING IT DROVE ON THE HIGHWAY FINE, BUT STALLED WHEN EXITING THE HIGHWAY.  THE LATEST INCIDENT, DRIVING ON THE HIGHWAY THE TRUCK DROVE FINE, UNTIL EXITING.  IT FAILED TO RESPOND TO PRESSURE ON THE GAS PEDAL AND STALLED LEAVING A WOMAN AND CHILD ON THE SIDE OF THE ROAD FOR 2 HOURS WAITING FOR A TOW.  DURING THAT TIME IT WOULD NOT START.  TOWED TO DEALERSHIP AND AFTER HAVING THE VEHICLE FOR A WEEK, THEY STATED THEY PULLED CODES SHOWING FUEL INJECTOR WAS BAD, EGR VALVE STICKING, NEEDS SOME SORT OF WIRING HARNESS, TURBO NEEDS CLEANING AND SOME SORT OF CHIP TOTAL COST OVER $2000.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/15/2011",
        "dateOfIncident": "12/09/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10440061,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 FORD F-250. THE CONTACT WAS DRIVING WITH THE CRUISE CONTROL ACTIVATED AT 65 MPH WHEN THE VEHICLE SURGED FORWARD ABNORMALLY. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THE DEALER CONFIRMED THAT THE ICP SENSOR NEEDED TO BE REPLACED. THE MANUFACTURER WAS CONTACTED AND THE VEHICLE WAS REPAIRED. THE FAILURE AND THE CURRENT MILEAGES WERE 124,298.",
        "vin": "1FTNW21P84E"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/06/2011",
        "dateOfIncident": "12/01/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10438809,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR BRAKE BACKING PLATES RUSTED OUT.  QUICK SEARCH ON THE INTERNET REVEALED THAT THIS IS A COMMON PROBLEM ON 2000-2008 FORD TRUCKS.   PARKING BRAKE COMPONENTS ARE MOUNTED TO BACKING PLATE.  LOSS OF PARKING BRAKES AND POSSIBLE DAMAGE TO REAR ABS IF THE PARKING BRAKE COMPONENTS SEPARATE FROM MOUNTS.",
        "vin": "1FTNW21P84E"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/17/2011",
        "dateOfIncident": "10/01/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10429912,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Cooper Tire & Rubber Co.",
                "productMake": "DEFINITY",
                "productModel": "DEFINITY DAKOTA AT",
                "productYear": "9999",
                "size": "LT285/75R17",
                "type": "Tire"
            }
        ],
        "summary": "2004 FORD F-250. CONSUMER WRITES IN REGARDS TO  THE DEFINITY DAKOTA A/T SYSTEM FAILURE *TGW  THE CONSUMER STATED ON FOUR SEPARATE OCCASIONS THE TIRES FAILED FROM AN OUT-RIGHT BLOW OUT OR THE CONDITION WHERE THE TIRE HAD STARTED TO BULGE AND DEFORM OR SPLIT WHICH CAUSED TREAD SEPARATION. ONE INCIDENT LEFT THE FENDER ON THE VEHICLE DISTORTED AND SHIFTED OUT OF PLACE AS WELL AS SOME TRIM DAMAGE. THE MOST RECENT INCIDENT OCCURRED WHERE THE TIRE HAD BECOME SO MIS-SHAPED AND DISTORTED THAT WHEN THE MECHANIC PULLED THE TIRE OFF THE TRUCK, HE COULD NOT ROLL THE TIRE. THE TIRE HAD SERIOUS STRUCTURAL DAMAGE. *JB",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "08/16/2011",
        "dateOfIncident": "07/20/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10419752,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PROBLEM BEGAN IN JULY 2011.  I OWN AND BOUGHT NEW, A 2004 F-250 SUPER DUTY CREW CAB FOUR-WHEEL DRIVE TRUCK WITH A 6.0 LITER ENGINE.  THE PROBLEM STARTED WITH HARD COLD STARTS.  WHEN IT DID START AFTER THREE TO FOUR ATTEMPTS, THE ENGINE RAN EXTREMELY ROUGH.  AFTER A FEW MINUTES, IT WOULD EVENTUALLY LEVEL OFF.  THROUGHOUT THE DAY, THE ENGINE WOULD START AND STOP WITHOUT ANY PROBLEMS.  BUT AFTER BEING PARKED OVERNIGHT, THE TRUCK WOULD BE HARD TO START.  THIS CONTINUED FOR SEVERAL WEEKS.  ON THE EVENING OF AUGUST 11, 2011, AFTER THE ENGINE WAS OFF FOR ONLY THREE HOURS, IT WAS HARD TO START.  THE ENGINE WOULD LOPE, IT WOULD NOT LEVEL OFF FOR A FEW MINUTES AND BLEW BLACK SMOKE OUT THE EXHAUST.  EVENTUALLY, IT DID LEVEL OFF AND DROVE HOME.  I DID NOT ATTEMPT TO START IT UP AGAIN UNTIL THE MORNING OF AUGUST FIFTEEN.  IT WOULD NOT START.  WHEN I TURNED THE KEY, IT CRANKED, ACTED LIKE IT WAS GOING TO START, THEN BACK TO JUST CRANKING.  I ATTEMPTED SEVEN TIMES AND STOPPED CONCERNED I WOULD DRAIN THE BATTERY, DAMAGE THE STARTER, OR SOME OTHER PART.  I CONTACTED THE DEALER.  IT HAD TO BE TOWED TO THEIR SERVICE CENTER.  THEY RAN DIAGNOSTICS AND DETERMINED IT WAS THE FICM (FUEL INJECTOR CONTROL MODULE)  AND WAS GOING TO COST ME $1,300 TO FIX.  THIS IS OUR ONLY SOURCE OF TRANSPORTATION, SO I RELUCTANTLY GAVE THEM THE GO AHEAD TO FIX IT.  THE DAY IT WENT IN FOR SERVICE IT ONLY HAD 55,079 MILES.  I DON'T UNDERSTAND.  THIS TRUCK IS ONLY SEVEN YEARS OLD.  I HESITATED IN SWITCHING TO DIESEL, BUT AFTER RESEARCHING AND LISTENING TO FRIENDS AND RELATIVES ABOUT THE LOWER FUEL COSTS, LOWER MAINTENENCE, HIGHER PERFORMANCE, I SWITCHED.  I AM DISAPPOINTED THAT IN ONLY SEVEN YEARS, I'M HAVING TO SPEND OVER A THOUSAND DOLLARS TO REPLACE A PART THAT CANNOT BE REPAIRED.  POOR DESIGN OR POOR QUALITY?  AMERICAN MADE CARS AND TRUCKS USED TO BE BUILT TO OUTLAST THEIR OWNERS.  THIS EVENT HAS QUESTIONED MY TRUST IN THE \"BUILT FORD TOUGH\" STATEMENT.  RECALL SHOULD BE THE WORD FOR THIS SITUATION.*KB",
        "vin": "1FTNW21PX4E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/06/2011",
        "dateOfIncident": "07/01/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10411072,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 FORD F250. CONSUMER STATES FAULTY ICP SENSOR OR FAULTY EGR VALVE *TGW  THE REVERSE PLANET GEAR IN THE TRANSMISSION WAS REPLACED. THE EGR VALVE REPLACED THREE TIMES, THE EGR COOLER, OIL COOLER WERE ALL REPLACED. THE R&R TURBO INTAKE WAS REPLACED TWICE, THE TURBO INNER COOLER, WIRING HARNESS ON THE ENGINE, TRANSFER CASE, FICM MODULE WERE REPLACED. THE ALTERNATOR AND BATTERY WERE REPLACED THREE TIMES, THE VALVE ASSEMBLY, HIGH PRESSURE AND REGULAR OIL PUMPS WERE REPLACED AND A NEW EGR SHIELD WAS INSTALLED. THE VEHICLE ALSO STALLED WHILE DRIVING DOWN THE INTERSTATE.  *JB",
        "vin": "1FTN21P64ED"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/02/2011",
        "dateOfIncident": "04/07/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10398468,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 FORD F-250. THE CONTACT STATED WHILE STOPPED THE VEHICLE WOULD INTERMITTENTLY SURGE FORWARD MOMENTARILY. THE CONTACT ALSO STATED THE ACCELERATOR PEDAL WOULD NOT ALWAYS RESPOND WHEN PRESSURE WAS APPLIED TO IT AND THE VEHICLE WOULD INTERMITTENTLY STALL WHILE DRIVING AT ANY SPEED. THE FAILURE WAS NOT DIAGNOSED. THE MANUFACTURER STATED THAT THE CONTACT WAS INFORMED THAT THE VEHICLE WAS NOT INCLUDED IN THE RECALL ASSOCIATED WITH NHTSA CAMPAIGN ID NUMBER 05V270000 (ELECTRICAL SYSTEM:WIRING). THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGES WERE 76,000.",
        "vin": "1FTNW21P74E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/30/2010",
        "dateOfIncident": "12/29/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10373477,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 FORD F-250. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 40 MPH APPROACHING AN INTERSECTION THE VEHICLE SUDDENLY STALLED. HE HAD TO COAST THE VEHICLE ONTO THE SIDE OF THE ROAD IN ORDER TO RESTART IT. THE FAILURE OCCURRED INTERMITTENTLY FOR TWO YEARS. THE VEHICLE WAS INSPECTED BY A DEALER WHO INFORMED THE CONTACT THAT HE NEEDED TO REPLACE THE TURBO IN THE G-VALVE INSIDE OF THE ENGINE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 104,000.",
        "vin": "1FTSW31P24E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/29/2010",
        "dateOfIncident": "11/29/2009",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10368223,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD F-250. THE CONTACT STATED THAT THE EGR COOLER AND TURBO FAILED WHICH CAUSED SMOKE TO BE EMITTED. THE DEALER STATED THAT THE EGR COOLER NEEDED TO BE REPLACED. THE MANUFACTURER HAD NOT BEEN NOTIFIED. THE VEHICLE WAS BEING REPAIRED. THE VIN WAS UNAVAILABLE. THE CURRENT MILEAGE WAS APPROXIMATELY 150,000. THE FAILURE MILEAGE WAS APPROXIMATELY 100,000.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/28/2010",
        "dateOfIncident": "10/04/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10362829,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 FORD F-250. AFTER STARTING THE VEHICLE, THE CONTACT NOTICED WHITE SMOKE WAS EMITTED FROM THE EXHAUST PIPE. ALSO WHEN DRIVING ANY SPEED, THE CONTACT NOTICED THAT THE VEHICLE WOULD SUDDENLY DECELERATE. THE VEHICLE HAD NOT BEEN INSPECTED OR REPAIRED. THE CURRENT AND FAILURE MILEAGES WERE APPROXIMATELY 184,000.",
        "vin": "1FTNW20P34E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/13/2010",
        "dateOfIncident": "10/01/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10360289,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 FORD F-250. THE CONTACT STATED THAT TWO OF THE BOLTS THAT HOLD THE PULLEY ON THE ENGINE BROKE OFF AND THE TWO OTHER BOLTS WERE LOOSE. THE FAILURE CAUSED THE FRONT ENGINE COVER TO BREAK AND WHEN THE ENGINE BECAME WARM IT SHUT DOWN. THE DEALER STATED THAT THIS HAD BEEN A PROBLEM AND THAT THEY WOULD HAVE TO REBUILD IT PIECE BY PIECE BECAUSE THE PART WAS ON NATIONAL BACK ORDER. THE FAILURE MILEAGE AND CURRENT MILEAGES WERE 86000.",
        "vin": "1FTNW20P54E"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/30/2010",
        "dateOfIncident": "09/15/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10322775,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 FORD F-250. THE CONTACT STATED THAT WHILE DRIVING AT SPEEDS OF 65 MPH AND HIGHER, THE VEHICLE WOULD CONTINUOUSLY STALL. THE CONTACT STATED THAT THE FAILURE WAS CAUSED BY THE MAIN WIRING HARNESS RUBBING AGAINST THE INJECTOR CONTROL MODULE CAUSING A SHORTAGE. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHERE A NEW WIRING HARNESS AND INJECTOR MODULE WERE INSTALLED. THE FAILURE MILEAGE WAS 158,000 AND THE CURRENT MILEAGE WAS 170,000.",
        "vin": "1FTNW21P54E"
    },
    {
        "components": "STEERING,FUEL SYSTEM, DIESEL,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/29/2010",
        "dateOfIncident": "02/28/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10322680,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 FORD F-250 EQUIPPED WITH A DIESEL ENGINE. THE CONTACT WAS DRIVING AT APPROXIMATELY 65 MPH, WHEN THE VEHICLE SUDDENLY SHUT OFF COMPLETELY WITH NO POWER STEERING. HE WAS ABLE TO GET THE VEHICLE SAFELY TO THE SIDE OF THE ROAD AND HAD IT TOWED TO A REPAIR SHOP. THE MECHANIC AT THE REPAIR SHOP REPLACED THE WIRING HARNESS AND ONE OF THE FUEL INJECTORS. HOWEVER, THE WIRING HARNESS SHORTED OUT AGAIN AND A FUEL INJECTOR IN ANOTHER AREA BLEW. THE CONTACT THEN TOOK THE VEHICLE TO THE DEALERSHIP WHERE HE WAS INFORMED THAT THE WIRING HARNESS AND THE FUEL INJECTION MODULE HAD FAILED. HE WAS ALSO ADVISED TO REPLACE THE WIRING HARNESS AND THE MODULE. THE CURRENT AND FAILURE MILEAGES WERE APPROXIMATELY 170,000.",
        "vin": "1FTNW21P54E"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/08/2009",
        "dateOfIncident": "09/06/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10283137,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 FORD F250.  AFTER APPROACHING A STOP SIGN, THE CONTACT ATTEMPTED TO ACCELERATE AND THE VEHICLE FAILED TO MOVE;  HOWEVER, SHE WAS ABLE TO DRIVE IN REVERSE AND THEN FORWARD WITHOUT ANY HESITATION. THE VEHICLE HAS NOT BEEN DIAGNOSED BY THE DEALER.  THERE WERE NO PRIOR WARNING SIGNS. THE CURRENT AND FAILURE MILEAGES WERE 165000.",
        "vin": "1FTNX21P94E"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/23/2009",
        "dateOfIncident": "04/19/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10266529,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 FORD F250. THE ENGINE FAILED TO START AFTER SEVERAL ATTEMPTS.  THERE WERE NO PRIOR WARNINGS. THE VEHICLE WAS TOWED TO AN AUTHORIZED DEALER FOR A DIAGNOSTIC TEST.  THE TECHNICIAN STATED THE FAILURE WAS DUE TO VIBRATION OF THE WIRING HARNESS SHORTAGE.  THE CONTACT IS AWARE OF THE SAFETY RISK INVOLVED.  THE VEHICLE HAS NOT BEEN REPAIRED. THE FAILURE MILEAGE WAS 151,000 AND THE CURRENT MILEAGE WAS 151,300.  THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "STEERING,SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/03/2008",
        "dateOfIncident": "12/03/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10250621,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 FORD F250.  WHILE DRIVING AT ANY SPEED, THE VEHICLE LOST POWER AND THE ENGINE COMPLETELY SHUT OFF IN THE MIDDLE OF THE ROAD.  THE ROAD CONDITIONS AND WEATHER WERE NOT A FACTOR.  THE VEHICLE WOULD OCCASIONAL TAKE TEN MINUTES OR LONGER BEFORE IT WOULD RESTART.  THE VEHICLE BECAME VERY DIFFICULT TO STEER AND LOST ALL POWER STEERING AND BRAKING ABILITY.  THE FAILURES ALWAYS OCCUR WITHOUT WARNING.  THE DEALER STATED THAT THE INJECTOR CONTROL PRESSURE (ICP) SENSOR WAS THE CAUSE OF THE FAILURE.  THE VEHICLE WAS NOT INCLUDED IN THE RECALL.  THE FAILURE MILEAGE WAS 100,000.",
        "vin": "1FTNW21P04E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/09/2008",
        "dateOfIncident": "06/06/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10233655,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TURBO IN MY FORD PICKUP HAS BEEN REPLACED TWICE.  I HAVE SPOKEN TO OTHER PEOPLE THAT HAVE HAD THE SAME PROBLEM.  MY PICKUP IS A 2004 F250 WITH A TURBO DIESEL ENGINE . *TR",
        "vin": "1FTNX20P44E"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/18/2008",
        "dateOfIncident": "04/05/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10224936,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 FORD F250.  WHILE DRIVING ON TWO SEPARATE OCCASIONS, THE VEHICLE SHUT OFF WITHOUT WARNING.  THE VEHICLE RESTARTED APPROXIMATELY TEN MINUTES LATER AND HAD TO BE TOWED.  NHTSA CAMPAIGN ID NUMBER 05V270000 (ELECTRICAL SYSTEM:WIRING) WAS REFERENCED.  THE VEHICLE WAS DIAGNOSED BY A MECHANIC.  THE SPEED AND FUEL SYSTEM WERE UNKNOWN.  THE CURRENT MILEAGE WAS 27,150 AND FAILURE MILEAGE WAS 27,140.    UPDATED 5/19/08  *CN  UPDATED 05/19/08",
        "vin": "1FTNW21P94E"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/17/2007",
        "dateOfIncident": "08/16/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10200303,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Cooper Tire & Rubber Co.",
                "productMake": "COOPER",
                "productModel": "DISCOVERER ATR",
                "productYear": "9999",
                "size": "225/75R15",
                "type": "Tire"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 FORD F250.  WHILE DRIVING 55MPH, THE REAR PASSENGER SIDE TIRE BLEW OUT.  THE TIRES BRAND IS COOPER/ATV, SIZE 225/75R15.  THE DOT#3D0RC8D4905. THE REMAINING THREE TIRES HAVE CRACKS PRESENT.  THE CONTACT NOTICED THAT THE VEHICLE WASN'T MAKING PROPER CONTACT WITH THE ROAD  PRIOR TO THE TIRE FAILURE.  THE TIRE WAS REPLACED WITH THE SPARE.  THE COOPER DEALER ADVISED HER TO FILE A COMPLAINT.  THE CONTACT CAN PROVIDE THE TIRE IF NEEDED. THE CURRENT AND FAILURE MILEAGE WERE 30000. THE FAILURE IS RELATED TO RECALL#06T016000.",
        "vin": "1FTNF21L24E"
    },
    {
        "components": "TIRES",
        "crash": true,
        "dateComplaintFiled": "05/29/2007",
        "dateOfIncident": "01/02/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10191961,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "PRO COMPETITION TIRE COMPANY",
                "productMake": "PRO COMPETITION TIRE",
                "productModel": "PRO COMP XTREME A/T",
                "productYear": "9999",
                "size": "35X12.50R17",
                "type": "Tire"
            }
        ],
        "summary": "PRO COMP TIRE ON MY FORD F250 WHILE DRIVING ON HIGHWAY 10 WEST BOUND, I BEGAN TO FEEL AN EXTREME VIBRATION ON THE FRONT LEFT OF MY VEHICLE, THEN A LOUD BANG, AND THE FRONT TIRE WAS TOTALLY BLOWN, WENT OFF THE ROAD INTO THE CENTER MEDIAN, AND THE TRUCK LUCKILY DIDN'T FLIP, BUT THERE WAS MORE THAN $6000 IN DAMAGE TO THE VEHICLE. *TR",
        "vin": "1FTNW21P54E"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "05/29/2007",
        "dateOfIncident": "05/13/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10191964,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "PRO COMPETITION TIRE COMPANY",
                "productMake": "PRO COMPETITION TIRE",
                "productModel": "PRO COMP XTREME A/T",
                "productYear": "9999",
                "size": "35X12.50R17",
                "type": "Tire"
            }
        ],
        "summary": "TIRE SEPARATION ON HIGHWAY OF A NEWLY INSTALLED REPLACEMENT PRO COMP TIRE. *TR",
        "vin": "1FTNW21P54E"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/21/2006",
        "dateOfIncident": "08/10/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10166156,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THE VEHICLE HAD THE SAME PROBLEMS AS DEFINED IN NHTSA RECALL #05V270000, BUT THE MANUFACTURER STATED THE VEHICLE WAS NOT INCLUDED IN THE RECALL DUE TO THE VIN.  THE VEHICLE LOST POWER AND DID NOT ACCELERATE ON TWO DIFFERENT OCCASIONS.  THE SECOND OCCASION THE VEHICLE STALLED AND WAS NOT ABLE TO BE RESTARTED.  THE SERVICE DEALER COULD NOT LOCATE THE PROBLEM.",
        "vin": "1FTNW21PX4E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/31/2006",
        "dateOfIncident": "07/31/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10163958,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE DRIVING 35MPH OR LESS, THE ENGINE REVS FOLLOWED BY A SUDDEN DECREASE.  THE VEHICLE WAS INSPECTED BY A DEALER WHO PERFORMED A DIAGNOSTIC TEST WHICH PRODUCED NO FAILURE CODES.  THE SERVICE DEPARTMENT WAS UNABLE TO DUPLICATE THE PROBLEM.",
        "vin": "1FTNX21P04E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/13/2006",
        "dateOfIncident": "10/15/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10152643,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 FORD F250 SUPER DUTY, ENGINE SHUTS OFF AND ON DRIVING DOWN THE HIGHWAY, LOSE POWER STEERING AND BRAKES. VERY UNSAFE VEHICLE WHEN THIS HAPPENS. THIS HAS OCCURRED 7 SEPARATE TIMES. ONCE AFTER RECALL DONE THUS RECALL DID NOT FIX THE PROBLEM. LEERY TO DRIVE NOW. LESS THAN 100 DRIVEN  SINCE.  *JB",
        "vin": "1FTNW21P74E"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/31/2006",
        "dateOfIncident": "12/25/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10149122,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE DRIVING AT 40 MPH IN SLICK UNFAMILIAR TERRAIN, THE VEHICLE WAS INVOLVED IN A CRASH WITH NO DEPLOYMENT OF THE AIRBAGS.  WHILE ATTEMPTING TO CROSS A BRIDGE THE CONCRETE WAS CLIPPED BY THE VEHICLE.  THE CONTACT OVER CORRECTED AND PRECEDED TO LOOSE CONTROL OF THE VEHICLE.  IT FLIPPED ONCE AND LANDED UPSIDE DOWN IN A STREAM.  THE CONTACT SUSTAINED MINOR INJURIES TO THE NECK.  HOWEVER, THE INSURANCE COMPANY EXAMINED THE VEHICLE AND DEEMED IT TOTALED.  THERE WAS ADDITIONAL PROPERTY DAMAGE TO THE BRIDGE AND THE POLICE FILED A REPORT AT THE SCENE.    UPDATED 02/28/06*JB",
        "vin": "1FTNW21P74E"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/17/2006",
        "dateOfIncident": "08/01/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10147960,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONSUMER STATED WHEN DEPRESSING THE BRAKE PEDAL THE VEHICLE LOST ALL STEERING. THE VEHICLE WAS TAKEN TO THE DEALERSHIP. THE DEALERSHIP RAN DIAGNOSTICS TEST ON THE VEHICLE; THE PROBLEM WAS UNABLE TO BE DUPLICATED. THE VEHICLE WAS DRIVEN FOR TWO MONTHS AND THE CONSUMER WAS STILL EXPERIENCING THE SAME PROBLEMS WITH THE STEERING. THE VEHICLE WAS TAKEN BACK TO THE DEALERSHIP A SECOND TIME, AGAIN THE VEHICLE UNDER WENT A DIAGNOSTICS TEST. AT THIS TIME THE BALL JOINTS WERE REPLACED. AFTER TAKEN THE VEHICLE FROM THE DEALERSHIP THE VEHICLE WAS STILL LOSING ALL STEERING WHEN APPLYING THE BRAKE PEDAL. THE THIRD TIME THE VEHICLE WAS TAKEN BACK THE DEALERSHIP COULD NOT FIND ANYTHING WRONG WITH THE VEHICLE, WHILE DRIVING, THE CONSUMER LOST STEERING  POWER AGAIN. *JB",
        "vin": "1FTNW21P54E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/15/2005",
        "dateOfIncident": "12/01/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10142792,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE CONTACT STATES WHILE TRYING TO ACCELERATE THE TURBO ON THE VEHICLE WILL NOT ALLOW THE VEHICLE TO MOVE; IT WILL CREEP FORWARD BUT WILL NOT ACCELERATE. ALSO, IF YOU ARE PULLING WEIGHT WITH THE VEHICLE IT WILL ACTUALLY MOVE BACKWARDS. THIS PROBLEM OCCURS ON A DAILY BASIS. THE DEALERSHIP HAS REPLACED THE TURBO AND THIS WILL CORRECT THE PROBLEM FOR ABOUT A MONTH AND THEN THE PROBLEM WILL REOCCUR. THEY ARE UNABLE TO COME UP WITH A REMEDY TO CORRECT THIS DEFECT. THE SERVICE MANAGER EXPLAINED TO HIM THE ONLY REPAIR IS TO CONTINUE TO REPLACE THE TURBO.  *NM",
        "vin": "1FTNW21P34E"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "09/15/2005",
        "dateOfIncident": "03/01/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10136555,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THE VEHICLE SHOOK  ALL OVER THE ROAD AND IT  MISFIRED. IT VIBRATED AND RUMBLED. IT WAS NOT A PROBLEM DUE TO THE BALANCING OR ALIGNMENT.  IT WAS SOMETHING WITHIN THE ENGINE.  TOOK THE  VEHICLE TO THE DEALER, AND THE PROBLEM WAS STILL NOT FIXED. ALSO, HAD A  BRAKE ROTOR PROBLEM. TOOK  THE VEHICLE THREE DIFFERENT TIMES FOR THE ROTORS. HAD TO PAY OUT OF POCKET TO HAVE THE BRAKES FIXED.  THESE PROBLEMS STARTED ON  MARCH 1, 2004. THE BACK WINDOW WAS LEAKING WATER.  TOOK VEHICLE TO THE DEALER,  AND THAT WAS NOT FIXED.  THE CONSUMER  FILED A LEMON LAW  COMPLAINT.  *AK",
        "vin": "1FTPW12544K"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/19/2005",
        "dateOfIncident": "08/01/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10134507,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 FORD F250 HAS A DEFECTIVE STEERING BOX.  *MR  *SC",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/15/2005",
        "dateOfIncident": "10/12/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10132922,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE VEHICLE WAS TAKEN TO REPAIR SHOP 8 TIMES FOR STALLING. EACH TIME THE DEALER DID SOMETHING AND IT CONTINUED TO  STALL. THEY REPLACED THE PROCESSOR, WIRING HARNESS, AND A NUMBER OF OTHER THINGS. THIS STARTED OCT 12,2004. *AK",
        "vin": "1FTNX21P74E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/11/2005",
        "dateOfIncident": "05/13/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10132517,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE CONSUMER STATED  THAT  2004 FORD F250 INTERMITTENTLY ON THE ROAD.  THIS HAS HAPPENED ABOUT 20 TIMES. THE DEALER FIXED THE TRUCK AND WHEN THE CONSUMER PICKED  UP VEHICLE IT  STILL STALLED. THE TRUCK WAS PUT ON  A DIAGNOSTIC MACHINE ONCE AND THE TRUCK PULLED UP 9 CODES. THE PARTS REPLACED WERE THE VALVE AND MODULATOR, EGR VALVE AND GASKET, REPROGRAMMED AUTOMATIC TRANSMISSION CONTROL MODULE ( PCM), AND ROAD TESTED. THE VEHICLE THEN SURGED ON THE ROAD TEST. THE DEALER FOUND THAT EGR VALVE WAS STUCK, AND IT WAS REPLACED. THE DEALER FELT  THAT IT MAY BE THE WIRING HARNESS.*AK",
        "vin": "1FTNW21P24E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/26/2005",
        "dateOfIncident": "07/12/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10128412,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: CONTACT STATES: 2000 FORD F250.  THE VEHICLE HAS 31,000 MILES ON IT AND HAS BEEN IN THE SHOP SEVERAL TIMES FOR THE SAME THING.  THE VEHICLE WILL DIE WHILE DRIVING DOWN THE HIGHWAY. IT WILL DIE WHILE YOU ARE STOPPED AT A RED LIGHT. THE DEALER CANNOT FIND THE PROBLEM. THEY HAVE REPLACED THE EGR VALVE WHICH IS PART OF THE ENGINE 4-5 TIMES. THE PROBLEM STILL EXITS. THE MANUFACTURER SAID THEY COULD FIX IT. THEY HAVE BEEN WORKING ON IT SINCE IT HAD 3,000 ON IT.  VEHICLE IS STILL UNDER WARRANTY. AT PRESENT IT HAS 31,000 ON IT AND IS STILL HAVING THE SAME PROBLEM. THE CONSUMER IS CONCERNED FOR HIS SAFETY. THE CONSUMER SAID THE DEALER OR THE MFR CANNOT GIVE HIM ANY REASON WHY THE CAR KEEPS DYING ON THE HIGHWAY.  THEY CANNOT SPECIFICALLY IDENTIFY WHAT IS CAUSING THE PROBLEM.   *NM",
        "vin": "1FTNW20P44E"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "06/27/2005",
        "dateOfIncident": "09/04/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10126780,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE VEHICLE AT RANDOM SPEEDS THE VEHICLE LOSES POWER, SPUTTERS AND BEGINS TO STALL. THE VEHICLE HAS NOT EVER STALLED COMPLETELY, BUT LOSS OF POWER IS A SAFTEY HAZARD. THE VEHICLE HAS BEEN IN THE SHOP OVER SEVEN TIMES TO DATE WITH 2 RECALLS BEING COMPLETED. WITHIN ONE WEEK OF RECALLL COMPLETION THE SAME PROBLEM CONTINUES TO EXIST.THIS PROBLEM BEGAN AT ONLY 9,000 MILES ON THE VEHICLE.AND HAS CONTINUED TO BE A PROBLEM TO DATE(25,000 MILES).",
        "vin": "1FMNU44P44E"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/10/2005",
        "dateOfIncident": "03/15/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10120109,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES:  THEY WERE TRAVELING TRANSMISSION WENT OUT.  TOOK VEHICLE TO THE DEALER, REBUILT TRANSMISSION AND GOT BACK ON THE ROAD. DRIVING LESS THAN  1000 MILES AND THE TRANSMISSION WENT OUT AGAIN. BEFORE BEING REBUILT THE VEHICLE WOULDN'T SHIFT INTO OVERDRIVE, AND THEN AFTER BEING REBUILT SHIFTED HARD AND THEN EVERYTHING WENT OUT.*AK  A NEW TRANSMISSION WAS INSTALLED AND NOW THE VEHICLE RUNS PROPERLY.    *TT",
        "vin": "1FTNX21P34E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/08/2005",
        "dateOfIncident": "04/17/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10124578,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE TRUCK KEEPS SHUTTING DOWN  FOR NO REASON.  IT SHUTS DOWN WITHOUT WARNING ON THE HIGHWAY.   *AK   ON OTHER OCCASIONS THE STALLING WOULD OCCUR ON UPGRADES WHILE PULLING THE FIFTH WHEEL.   THE ACCELERATOR PEDAL WOULD NOT RESPOND WHEN GOING ABOVE 70 MPH.  THE (ICP SENSOR) WAS FOUND TO HAVE A FAULTY CONNECTOR.   *SC",
        "vin": "1FTNW20P74E"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/07/2005",
        "dateOfIncident": "04/06/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10117623,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN ACCELERATING TO 60 MPH  VEHICLE HESITATES THEN DECELERATES TO 30 MPH.  *AK",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/10/2005",
        "dateOfIncident": "03/01/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10114913,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE  EXPERIENCED SUDDEN ACCELERATION. WHEN DRIVING AND COMING TO A STOP VEHICLE WILL STALL WITH A ROUGH IDLE, AND THE RPMS WILL INCREASE TO 2500 RPMS, CAUSING THE VEHICLE TO SURGE FORWARD. DRIVER MUST APPLY THE BRAKES, AND THE VEHICLE WILL SHUT DOWN COMPLETELY. OWNER TOOK THE VEHICLE TO THE DEALER. HOWEVER, THE PROBLEM WOULD NOT DUPLICATE ITSELF. *AK",
        "vin": "1FTNW21P94E"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/10/2005",
        "dateOfIncident": "03/08/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10113922,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "LOW IDLE SURGING AND STALLING WITH LOSS OF POWER STEERING.  *AK",
        "vin": "1FTNW21P14E"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/01/2005",
        "dateOfIncident": "10/13/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10111524,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING  AT ANY SPEED VEHICLE STALLED. CONSUMER HAD THE VEHICLE TOWED. DEALERSHIP WAS NOTIFIED, BUT DID NOT RESOLVE THE PROBLEM. *AK  THE CONSUMER MULTIPLE FAILURES  DUE TO REMOTE START, FUEL SENSORS, AND FUEL COMPONENTS.  THE CONSUMER STATED THAT WHEN THE VEHICLE STALLS IT LOOSES ALL POWER.  *TC",
        "vin": "1FTNX21P24E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/18/2005",
        "dateOfIncident": "10/13/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10107322,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE STALLS UNEXPECTEDLY AT VARIOUS SPEEDS. TAKEN TO THE DEALER FOR THE FIFTH TIME, BUT THE CAUSE IS STILL UNDETERMINED.  *NM   *NM  THE CONSUMER STATED THAT THE VEHICLE WAS TAKEN TO THE DEALER 8 TIMES BECAUSE OF THE SHUTTING OFF AND THE SURGING.   *TC",
        "vin": "1FTNW21P04E"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/17/2005",
        "dateOfIncident": "02/16/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10111675,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS ON THE ROAD WHEN ALL OF A SUDDEN IT WENT FROM DRIVE TO NEUTRAL ON ITS OWN. OWNER WILL TAKE TO DEALER FOR CHECKUP.   *NM",
        "vin": "FILL IN"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/14/2005",
        "dateOfIncident": "02/01/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10110527,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I WORK FOR SECURITY AT A NUCLEAR PLANT.  WE HAVE TWO 2004 FORD, F250 PICKUPS.  I AND SEVERAL OTHER PEOPLE HAVE HAD A PROBLEM WITH THE BRAKE PEDAL AND ACCELERATOR PEDAL.  WE WEAR MILITARY STYLE BOOTS, IF YOU MOVE YOUR FOOT FROM THE ACCELERATOR TO THE BRAKE AND STILL HAVE YOUR FOOT PARTIALLY OVER THE ACCELERATOR YOUR SHOE WILL COME IN CONTACT WITH THE ACCELERATOR PEDAL BEFORE THE BRAKE PEDAL IS DEPRESSED FAR ENOUGH TO APPLY THE BRAKE.  MYSELF AND SEVERAL OTHER PEOPLE HAVE HAD A NEAR MISS BECAUSE OF THE VEHICLE LUNGING FORWARD BEFORE THE BRAKE ENGAGES.*AK",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/24/2005",
        "dateOfIncident": "01/17/2005",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10108783,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER WAS PARKING THE VEHICLE AND WITHOUT WARNING THE VEHICLE CAUGHT FIRE FROM THE ENGINE.  THE FIRE DEPARTMENT WAS CALLED OUT TO EXTINGUISHED THE FIRE. THE DRIVER SUSTAINED INJURIES TO BOTH LEGS AND WAS TRANSPORTED BY AMBULANCE TO THE HOSPITAL.  THE VEHICLE WAS TOWED AND TOTALED BY THE INSURANCE COMPANY.  PLEASE PROVIDE ADDITIONAL INFORMATION.   *JB",
        "vin": "1FTNW20L34E"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/18/2005",
        "dateOfIncident": "01/07/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10107498,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING IN THE MOUNTAINS AT 25 MPH, RAINY CONDITIONS,  THE VEHICLE LOST TRACTION, STRUCK THE MOUNTAIN SIDE AND ROLLED OVER. THE AIR BAGS DID NOT DEPLOY.  THE VEHICLE WAS TOWED.   *JB",
        "vin": "1FTNW21P34E"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/12/2005",
        "dateOfIncident": "01/01/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10111184,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONSUMER EXPERIENCED SUDDEN ACCELERATION AND ABOUT 30% OF THE TIME THE VEHICLE WOULD NOT SLOW DOWN ONCE THE CONSUMER'S FOOT WAS REMOVED FORM THE ACCELERATOR.  *NM",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/06/2005",
        "dateOfIncident": "01/06/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10106967,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING  VEHICLE STALLED. CONSUMER  RESTARTED THE VEHICLE,  AND DROVE  IT HOME. CONSUMER   WILL CONTACT THE DEALER FOR AN APPOINTMENT. *AK",
        "vin": "1FTNW21P84E"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/06/2005",
        "dateOfIncident": "11/09/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10106973,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TURNING RIGHT OR LEFT CONSUMER HEARD A LOUD POPPING NOISE COMING FROM THE FRONT.  SUDDENLY, THE VEHICLE VIBRATED UNCONTROLLABLY. VEHICLE WAS TAKEN TO THE DEALER FOR INSPECTION, BUT  MECHANIC WAS UNABLE TO DUPLICATE THE PROBLEM.  *AK",
        "vin": ""
    },
    {
        "components": "STRUCTURE,CHILD SEAT",
        "crash": true,
        "dateComplaintFiled": "12/28/2004",
        "dateOfIncident": "12/22/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10105412,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Evenflo Company, Inc.",
                "productMake": "EVENFLO",
                "productModel": "CHILD SAFETY SEAT",
                "productYear": "9999",
                "type": "Child Seat"
            }
        ],
        "summary": "THE CONSUMER WAS DRIVING THROUGH A PATCH OF BLACK ICE, LOST CONTROL OF THE VEHICLE AND ROLLED OVER 6 TIMES. THE DRIVER ALSO HAD A CHILD STRAPPED INTO AN EVENFLO CHILD SAFETY SEAT. DURING THE ROLL OVER, THE CHILD WAS EJECTED FROM THE CHILD SEAT EVEN THOUGH THE SEAT WAS PROPERLY RESTRAINED. NO INJURIES WERE REPORTED.  PROVIDE FURTHER DETAILS.  *JB",
        "vin": "1FTNW21P54E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/28/2004",
        "dateOfIncident": "09/26/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10105442,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE STALLED UNEXPECTEDLY AT DIFFERENT SPEEDS. THE CONSUMER TOOK THE VEHICLE TO THE DEALER 3 TIMES, BUT RESULTS SHOWED THE CAUSE WAS UNDETERMINED.    *JB....*AK",
        "vin": "1FTNW21P84E"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/27/2004",
        "dateOfIncident": "10/19/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10105306,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE SUDDENLY STALLED UPON PULLING UP TO AN INTERSECTION. VEHICLE WAS THEN TOWED TO A DEALERSHIP FOR INSPECTION, AND DEALERSHIP INDICATED THAT FUEL  INJECTION CLIP  BROKE AND FELL APART, AND THE HIGH PRESSURE OIL SIDE WAS LEAKING.  THE  BROKEN CLIP WAS REPLACED.  A SERVICE PERSON TEST DROVE THE  VEHICLE AND  IT STALLED AGAIN. CONSUMER TRADED THE VEHICLE IN BECAUSE THE DEALERSHIP WAS UNABLE TO CORRECT THE PROBLEM.*AK",
        "vin": ""
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "12/21/2004",
        "dateOfIncident": "10/04/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10097852,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT AND REAR SEAT BELTS WOULD NOT STAY LOCKED IN THE BELT BUCKLE AND WOULD RELEASE.  THE DEALERSHIP REPAIRED THE PROBLEM ONCE, BUT THE CONSUMER WAS STILL HAVING THE SAME PROBLEM.   *AK   *SC",
        "vin": "1FTNW20P74E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/09/2004",
        "dateOfIncident": "04/06/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10103433,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WOULD RUN FOR A WHILE AND THEN STALL.  THE DEALER HAS SERVICED THE VEHICLE NUMEROUS TIMES.  THE SENSORS HAVE BEEN CHANGED BUT THE PROBLEM CONTINUED.  *JB",
        "vin": "1FTNX21P34E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/07/2004",
        "dateOfIncident": "08/11/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10102332,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 FORD EXCURSION: THE ENGINE FAILS DURING OPERATION OF THE VEHICLE AT VARIOUS SPEEDS WHICH ELIMINATES POWER BRAKES, STEERING. THIS IS SO DANGEROUS, WE WERE ALMOST HIT FROM BEHIND BY A 18 WHEELER, THE ENGINE FAILED WHILE EXITING A RAMP ON I-95 AT 55 MPH. I HAD TO PLACE THE TRUCK IN NUETRAL, BRAKE, TURN AND RESTART THE TRUCK WITHOUT FLIPPING OVER THE EDGE OF THE RAMP. THE ENGINE IDLES AT DIFFERENT RPMS, THE VEHICLE WILL JERK FORWARD WHILE BRAKING MAKING IT VERY DANGEROUS IN PARKING LOTS WITH PEDESTRIANS WALKING IN FRONT OF THE TRUCK.I ALMOST HIT AN ELDERLY WOMAN WALKING IN FRONT OF THE TRUCK. IT IS NOT SAFE FOR CHILDREN TO BE AROUND THIS VEHICLE. THIS HAS HAPPENED SINCE 04/2004. THE DEALER HAS ATTEMPTED TO REPAIR THE TRUCK FOUR TIMES WITHOUT SUCCESS.THEY HAVE REPLACED DIFF SENSORS AND RE-CALIBRATED FUEL COMPUTER. *AK",
        "vin": "1FMSU43P64E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/06/2004",
        "dateOfIncident": "12/06/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10103178,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING/IDLING THE EXHAUST FUMES SEEP INTO THE PASSENGER COMPARTMENT. AS A RESULT, THE FUMES IRRITATE CONSUMER'S EYES.*AK",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/05/2004",
        "dateOfIncident": "11/01/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10099937,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "POTENTIALLY FATAL FLAW WITH 2004 FORD F-250.  CONTINUALLY SERIOUS PROBLEMS WITH  MISSING, STUTTERING AND STOPPED. LOOSE PLUG TO THE INJECTOR MODULE.   *BF   ONE OF THE WIRING HARNESSES MAY BE BADLY CHAFFED INSIDE THE CABLE COVERING.  A VISUAL INSPECTION WOULD NOT DISCOVER THE PROBLEM.  THE CONSUMER FELT THAT THE HARNESS HAD GONE BAD WHEN IT WAS INSTALLED.   THE CONSUMER ALSO ADDED THAT THERE LIVES WERE IN SERIOUS DANGER NUMEROUS TIMES AND SHOULD BE COMPENSATED FOR THIS PROBLEM AND STRESS.   *SC  SEE ALSO 10099269 AND 10097155.  *DSY",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/05/2004",
        "dateOfIncident": "11/01/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10101011,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING VEHICLE STALLED. WHEN IT SHUT DOWN LOST POWER AT 35-45 MPH.  PROBLEM  STILL RECURRED.   *BF   THE VEHICLE WOULD SURGE, WOULD BE GIVEN NO WARNING, BUT THE CHECK ENGINE LIGHT WOULD COME ON.   *SC",
        "vin": "1FTNW20P24E"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/02/2004",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10099269,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "FAX RE DEFECTIVE WIRING HARNESS FOR 2004 FORD F-250 PICKUP, REQUEST A DEFECT INVESTIGATION.   *BF  THE CONSUMER'S VEHICLE WOULD CUT OFF WHILE DRIVING.  UPON INSPECT THE TECHNICIAN FOUND SEVERAL FRAYED WIRES IN THE HARNESS.  THE TECHNICIAN TAPED THE HARNESS IN THE AREA WHERE THE WIRING WAS FRAYED BECAUSE THEY DID NOT HAVE A REPLACEMENT HARNESS.  *NM  SEE ALSO ODI 10097155 AND 10099937.  *DSY",
        "vin": ""
    },
    {
        "components": "STEERING,TIRES",
        "crash": true,
        "dateComplaintFiled": "10/27/2004",
        "dateOfIncident": "10/01/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10099079,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUCK FAILED TO RESPOND TO STEERING. ATTEMPTING TO CORRECT FOR RIGHT DRIFT TRUCK CROSSED OVER LEFT SHOULDER CAUSING DAMAGE.  *BF  VEHICLE FAILED TO RESPOND TO STEERING WHILE CONSUMER DROVE AROUND A CURVE AT 35 MPH.  AFTER INSPECTING THE VEHICLE THE CONSUMER FOUND THAT THE RIGHT FRONT HUB LOCKING TAB WAS POSITIONED IN LOCK WHILE THE LEFT FRONT WAS FREE.  THE TIRES WERE MARKED ON THE SIDEWAYS AS M & S (MUD AND SNOW) TIRES WERE OVER INFLATED FOR THE LOAD CONDITION.   WHILE ATTEMPTING TO CORRECT THFOR THE RIGHT DRIFT THE TRUCK CROSSED OVER TO THE LEFT SHOULDER CROSSING THE TWO LANE ROAD HITTING A FENCE AND ON THE SUBSEQUENT CROSSOVER HIT A BERM AND ROLLED ACROSS THE HIGHWAY ENDING UP WITH THE RIGHT SIDE IN A DITCH.   *TC",
        "vin": "1FTNX21L54E"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/19/2004",
        "dateOfIncident": "10/12/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10097122,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE STOPPED AT A RED LIGHT THE VEHICLE ACCELERATED WITHOUT WARNING. NO IMPACT REPORTED. THE PART HAS BEEN REPAIRED SIX TIMES, HOWEVER THE PROBLEM STILL EXIST.  PLEASE PROVIDE ADDITIONAL INFORMATION.  *JB",
        "vin": "1FTNW21P34E"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/19/2004",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10097155,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "REQUEST NHTSA & FORD ISSUE RECALL TO CORRECT ELECTRICAL WIRING HARNESS ON FORD 2004 F-250.  *BF  THE VEHICLE STALLED SEVERAL TIME AFTER THE VEHICLE WAS PURCHASED.  THE VEHICLE WAS TAKEN TO SEVERAL FORD DEALERSHIPS FOR REPAIR.  THE VEHICLE WAS TAKEN TO ANOTHER DEALERSHIP WHERE THE TECHNICIAN NOTICED FRAYED WIRING IN THE WIRING HARNESS.  THE TECHNICIAN RE-INSULATED THE WIRING AND THE PROBLEM HAS NOT RECURRED.  *NM  SEE ALSO ODI 10099269 & 10099937. *DSY",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/20/2004",
        "dateOfIncident": "09/20/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10092806,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT ANY SPEED VEHICLE STALLED. THIS CAUSED LOSS OF STEERING AND BRAKES. DEALER  INSPECTED VEHICLE SEVERAL TIMES.  *AK",
        "vin": "1FTNW21P54E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/08/2004",
        "dateOfIncident": "09/08/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10091638,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS DRIVING POORLY WHILE ACCELERATING AND HESITATED. CONSUMER NOTICED THE CHECK ENGINE LIGHT FLASHED ON, THEN FLASHED OFF.  CONSUMER DROVE VEHICLE TO THE DEALER FOR INSPECTION.  THE PROBLEM COULD NOT BE DUPLICATED.  *AK",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/23/2004",
        "dateOfIncident": "06/15/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10089491,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DEPRESSING THE BRAKE PEDAL ACCELERATOR PEDAL STUCK. THIS CAUSED THE RPMS TO RACE AT A HIGH RATE. DEALERSHIP WAS NOTIFIED, BUT DID NOT RESOLVE THE PROBLEM.  *AK",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/18/2004",
        "dateOfIncident": "08/16/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10089153,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 50 MPH THE VEHICLE WAS INVOLVED IN A HEAD ON COLLISION. THE DUAL AIR BAGS DID NOT DEPLY. AS A RESUL, DRIVER SUSTAINED HEAD INNJUIRES.  *AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/12/2004",
        "dateOfIncident": "08/02/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10087771,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING WITH THE CRUISE CONTROL ON, THE ENGINE AND POWER STEERING FAILED.  THE DEALER STATES IT WAS A COMPUTER DEFECT.  *JB",
        "vin": "1FTNX21P94E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/10/2004",
        "dateOfIncident": "07/12/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10086585,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 F250 KING RANCH.  I HAVE HAD THE TRUCK SINCE APRIL 8.  AROUND THE MIDDLE OF JULY IT STARTED HESITATING AND STALLING.  IT WOULD HESITATE WHILE GOING AT ANY SPEED, AT ANY TIME, WHETHER GOING DOWN THE ROAD OR SITTING STILL.  WHILE THE MOTOR IS RUNNING, IT WILL COMPLETELY LOSE POWER, AS IF YOU HAD TAKEN YOUR FOOT COMPLETELY OFF OF THE GAS PEDAL.  AFTER A FEW SECONDS IT WILL REGAIN POWER, AS IF YOU PUT YOUR FOOT BACK ON THE GAS PEDAL.  SEVERAL OF THESE OCCURRENCES HAVE BEEN VERY CLOSE CALLS FOR CRASHES AND COULD HAVE BEEN LIFE THREATENING IF NOT FOR OTHER ALERT DRIVERS.  AFTER \"REPAIRING\" THE TRUCK THE FIRST TIME, I NO MORE THAN GOT IT HOME BEFORE IT WAS DOING THE SAME THING AGAIN.  AFTER ORDERING SOME MORE PARTS AND \"REPAIRING\" THE TRUCK THE SECOND TIME, IT STARTED SHAKING VIOLENTLY AFTER FIRST STARTING AND WHILE IDLING.  IT ALSO GAINED A LOUD SCRUBBING/THUMPING SOUND SOMEWHERE IN THE FRONT HALF OF THE VEHICLE.  IT IS NOW BACK IN THE SHOP FOR THE THIRD TIME IN LESS THAN 1 MONTH.  I HAVE HAD MY TRUCK FOR A TOTAL OF 4 DAYS OUT OF THE LAST 21 AND AM VERY AFRAID OF HAVING AN ACCIDENT IF THEY \"REPAIR\" THE PROBLEM AGAIN.",
        "vin": "1FTNW21P14E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/09/2004",
        "dateOfIncident": "07/25/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10087540,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING  60 MPH IN AN INCLINE THE DRIVER HEARD A LOUD POPPING NOISE COMING FROM  THE FRONT.  SUDDENLY THE VEHICLE STALLED AND RESTARTED ON ITS OWN.  CONSUMER CONTACTED THE DEALER TWICE, AND WAS INFORMED THAT THE PROBLEM COULD NOT BE DUPLICATED.  *AK",
        "vin": "1FTNW21P84E"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/30/2004",
        "dateOfIncident": "07/10/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10082997,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 F-250 KING RANCH FX4 WITH 6.0L DIESEL ENGINE, ALL STOCK CONDITION AS ORDERED AND RECEIVED ON FEBRUARY 11, 2004.  DEALER MADE PROGRAMMING CHANGE TO THE PCM ON JULY 12, 2004, BUT VEHICLE HAS NOT RUN CORRECTLY SINCE PROBLEMATIC SYMPTOMS BEGAN ON 7/10/04.  SYMPTOMS INCLUDE:  (1) LACK OF POWER AND STUDDERING FROM 600 RPM TO 1,200 RPM FOLLOWED BY A SUDDEN AND UNPROVOKED INCREASE IN POWER.  (2) RHYTHM TIC INCREASES AND DECREASES (SURGING) OF APPROXIMATELY 2,000 RPM IN THE TURBOCHARGER AT CRUISE (EVEN WHILE ON CRUISE CONTROL).  (3) \u001cCHECK ENGINE\u001d LIGHT REMAINS ON.   THE CONTINUOUS SURGING OF THE TURBOCHARGER WILL RESULT IN A PREMATURE FAILURE OF THE TURBINE FOLLOWED BY FATIGUE AND EVENTUAL FAILURE OF THE TRANSMISSION.*AK",
        "vin": "1FTNW21P74E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/29/2004",
        "dateOfIncident": "07/28/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10083722,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING AT AN UNDETERMINED SPEED VEHICLE STALLED. THIS CAUSED THE DRIVER TO DRIFT TO THE SIDE OF THE ROAD. CONSUMER WAS ABLE TO RESTART THE VEHICLE, AND DROVE IT TO THE DEALERSHIP FOR INSPECTION. THE CONSUMER STATED THAT VEHICLE HAD BEEN TO THE DEALER ON FOUR OCCASIONS, BUT PROBLEM RECURRED.  *AK",
        "vin": "1FTNX21P44E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/29/2004",
        "dateOfIncident": "07/28/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10083780,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 60 MPH  VEHICLE SHUT DOWN. AS A RESULT,  POWER STEERING AND BRAKES FAILED. *AK",
        "vin": "1FTNW20P84E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/26/2004",
        "dateOfIncident": "03/21/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10080060,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE STALLED THREE TIMES WHILE GOING 55 MPH WITH THE CRUISE CONTROL ACTIVATED.  THE VEHICLE STALLED ONCE WHILE BEING DRIVEN AT 30 MPH WITH THE OVERDRIVE TURNED OFF.  THE DEALER ATTEMPTED TO REPAIR THE VEHICLE ON FOUR OCCASIONS, BUT WAS UNSUCCESSFUL.   *AK   *SC",
        "vin": "1FTNW21P44E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/23/2004",
        "dateOfIncident": "03/07/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10083767,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "FORD F250 ENGINE STOPPED AND VEHICLE LOST POWER STEERING AND BRAKES.*MR  WHILE DRIVING DOWN A STEEP HILL WITH THE CRUISE CONTROL SET THE VEHICLE STALLED WHICH RESULTED IN NO POWER STEERING OR BRAKES.  THE DRIVER MANAGED TO PUT THE VEHICLE IN NEUTRAL AND RESTART IT.  THE VEHICLE WAS TAKEN TO THE DEALER WITH THE SERVICE DEPT WAS CLOSED.  THE CONSUMER SPOKE TO THE SERVICE MANAGER WHO INDICATED THAT IF THE SERVICE ENGINE LIGHT WASN'T STILL ILLUMINATED THAT THEY COULDN'T DETERMINE THE PROBLEM.  TWELVE DAYS LATER THE CONSUMER EXPERIENCED THE SAME TYPE OF FAILURE.  THE VEHICLE WAS TAKEN BACK TO THE DEALER AND LEFT THERE FROM 11 AM TO 5:30 PM.  THE DEALER WAS UNABLE TO DETERMINE THE PROBLEM ALTHOUGH THEY DID PERFORM VARIOUS OTHER UPDATES.  THE VEHICLE WAS TAKEN TO ANOTHER DEALER WHO WAS ALSO UNABLE TO DETERMINE THE CAUSED.  THE TECHNICIAN CALL FORD TECH SERVICE WHO ADVISED HIM THAT THEY WERE AWARE OF THE PROBLEM BUT CURRENTLY HAD NO SOLUTION OR TIMER FRAME FOR RESOLVING THE PROBLEM.  THE CONSUMER IS REQUESTING HIS MONEY BACK SINCE THE DEALER NOR THE MANUFACTURER CAN PROVIDE A SOLUTION IN A TIMELY MANNER.  *NM  SEE ODI 10067096 ALSO.  *DSY",
        "vin": "1FTNW21P54E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/22/2004",
        "dateOfIncident": "06/02/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10083518,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 55 MPH, THE VEHICLE STALLED WITHOUT WARNING.  THE CONSUMER WAS UNSUCCESSFUL AT TRYING TO RESTART THE VEHICLE. THE CONSUMER TOOK THE VEHICLE TO THE MECHANIC, HOWEVER THE PROBLEM COULD NOT BE DUPLICATED.  *JB",
        "vin": "1FTNX21P54E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/21/2004",
        "dateOfIncident": "06/28/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10082357,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT 2004 F250 CREW KING RANCH DIESEL IN JAN. 04. VEHICLE IDLES DOWN AND DIES WHILE DRIVING AT SPEED LIMIT. WITH FOOT ON BRAKE AT INTERSECTIONS OR STOP LIGHTS VEHICLE ACCELERATES ON IT'S OWN. WHILE ACCELERATING VEHICLE WILL DIE, THEN RESTART AND LUNGE FORWARD WITH ACCELERATION. HAS HAPPENED 5 TIMES SINCE PURCHASE. DEALER HAS BEEN UNABLE TO RESOLVE. FORD MOTOR HAS BEEN UNCOOPERATIVE TO ANY OF MY CALLS TO CONSUMER RELATIONS. DEALERSHIP IS DOING THEIR BEST, FORD WILL NOT ADMIT PROBLEMS WITH THIS ENGINE AND SYSTEM. TRUCK HAS BEEN WITH DEALER 2 WEEKS WITHOUT RESOLVE.  *LA",
        "vin": "1FTNW21P44E"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/14/2004",
        "dateOfIncident": "07/12/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10081091,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE SURGES FORWARD WITH NO PRESSURE ON GAS PEDAL. WHILE STOPPED VEHICLE JUMPER FORWARD THEN STALLED. DEALER WAS UNABLE TO DUPLICATE WITHOUT ERROR CODE AND RETURNED VEHICLE. AT HIGHWAY SPEED OF 55 AND 1200 RPMS VEHICLE LURCHED FORWARD. VEHICLE THEN BEGAN TO LURCH AND STALL WEEKLY. UNABLE TO DUPLICATE AT DEALERSHIP. AFTER DEALERSHIP DROVE VEHICLE OVER 100 MILES THEY THINK ITS THE WIRING HARNESS AND ADVISED TO HAVE IT REPLACED. THEY HAD NO PREVIOUS KNOWLEDGE OF ANY SUCH INCIDENTS.*AK",
        "vin": "1FTNW20P64E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/06/2004",
        "dateOfIncident": "07/06/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10081412,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING VEHICLE STALLED. CONSUMER RESTARTED VEHICLE AND DROVE IT TO THE DEALER FOR INSPECTION.   MECHANIC TOLD CONSUMER THAT THE PROBLEM COULD NOT BE DUPLICATED.  CONSUMER INFORMED THE MECHANIC THAT THIS PROBLEM  OCCURRED MORE THAN ONCE, AND  HAD NOT BEEN RESOLVED.  *AK",
        "vin": "1FTNW21P24E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/04/2004",
        "dateOfIncident": "06/29/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10079258,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "SUDDEN AND COMPLETE ENGINE FAILURE (FOLLOWED BY REDUCED STEERING AND BRAKING). *AK",
        "vin": "1FTNX21P04E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/23/2004",
        "dateOfIncident": "05/02/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10079867,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE'S ENGINE HAS SHUT DOWN WITHOUT WARNING FOUR TIMES.   *MR   THE FUSES AND PARKING LIGHTS WERE REPLACED.  THE THEFT ALARM WAS DISABLED.   *SC    *JB",
        "vin": "1FTNW21P84E"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/08/2004",
        "dateOfIncident": "06/03/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10075923,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATED WHILE DRIVING  DRIVER SIDE WINDOW  SHATTERED. DEALERSHIP SAID THAT THEY WILL REPAIR THE GLASS, BUT WILL NOT REPAIR THE BODY DAMAGE WHICH WAS CAUSED FROM THE EXPLODING GLASS. CONSUMER WANTED TO SEND PHOTO COPIES TO SUPPORT THE CASE.  *AK",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, DIESEL,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/07/2004",
        "dateOfIncident": "05/01/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10074959,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 FORD F250 SUPER DUTY KING RANCH.  AFTER REFLASH TO REPAIR AN IDLE PROBLEM TRUCK DEVELOPED THREE VERY DANGEROUS CONDITIONS.    1. CRUISE STALLED - GOING DOWN HILL AT APPROX 55-58 THE TRUCK WILL STALL WITHOUT WARNING.  NO POWER STEERING OR BRAKES.  REPRODUCABLE ON DEMAND.  2. DOWNSHIFT LOCKUP - TRUCK WILL LOCKUP REAR TIRES IN EXCESS OF 30 FEET IF TOW/HAUL MODE IS USED.  ON FIRST OCCASION  IT ALMOST CAUSED A MAJOR ACCIDENT ON HIGHWAY, CAME WITHIN INCHES OF A HEAD ON WITH A LARGE DUMP TRUCK WHILE TOWING A BOAT. REPRODUCABLE ON DEMAND.  3.  COAST STALL.  INTERMITTENTLY STALLS USUALLY AT OFF RAMPS AFTER CRUISE HAS BEEN RELEASED.  EXTREMLY DANGEROUS TO TAKE OFFRAMPS IN SUCH A LARGE VEHILCE WITH NO POWER.*AK",
        "vin": "1FTNW21PX4E"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/20/2004",
        "dateOfIncident": "03/23/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10064675,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONSUMER OWNED A NEW 2004 FORD, F250 WITH A 6.0 LITER DIESEL ENGINE. ON MARCH 7, 2004 WHILE DRIVING AT 65 MPH AND WITHOUT ANY WARNING, THE VEHICLE LOST PRESSURE. THE VEHICLE WAS TAKEN TO THE DEALER AND THE  SERVICE TECHNICIAN DETERMINED THAT ONE OF THE FUEL INJECTORS MALFUNCTIONED. TWO DAYS LATER WHILE DRIVING ON THE HIGHWAY ANOTHER FUEL INJECTOR FAILED, WHICH CAUSED  WATER TO  LEAK  ONTO ONE OF THE PISTONS,  THEREFORE  THE ENGINE WAS BURNING WATER. THE DEALER INDICATED THAT THEY WERE AWARE OF THE PROBLEM.   *AK   *SC  *JB",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/12/2004",
        "dateOfIncident": "05/08/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10072497,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "NEW FORD F-250 WITH ONLY 80 MILES STOPPED SUDDENLY IN THE MIDDLE OF TRAFFIC.  THE VEHICLE HAS BEEN WITH THE DEALER FOR A WEEK AND IT HASN'T BEEN REPAIRED.",
        "vin": "1FTNW21P54E"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/11/2004",
        "dateOfIncident": "03/08/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10061625,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE EXPERIENCED POWER SURGES WITH NO LOAD IN THE TRAILER.  THIS WOULD OCCUR ON LESS OF AN INCLINE WITH A STRONGER SURGE.  THE PROBLEM WAS INTERMITTENT AND WOULD GO TO BASE IDLE WHICH OCCURED OFTEN BUT NOT ALWAYS BEFORE THE POWER SURGE.  THE \"GLOW LIGHT\" AND FUEL LIGHT WOULD COME ON.   *AK   *SC  *JB",
        "vin": "1FTNW21P64E"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/11/2004",
        "dateOfIncident": "04/08/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10067096,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN ENGAGED IN CRUISE CONTROL  ENGINE MALFUNCTIONED. AS A RESULT,  POWER STEERING AND POWER BRAKES FAILED.  *AK    CRUISE CONTROL WAS SET AT 35 MPH.  THEN WHEN VEHICLE WAS RUNNING DOWNHILL, CONSUMER ALLOWED THE VEHICLE TO INCREASED SPEED UP TO 40 MPH; HOWEVER, AT THAT POINT THE ENGINE MALFUNCTIONED WHICH ALSO LED TO THE LOSS OF POWER STEERING AND POWER BRAKES.  ANOTHER INCIDENT OCCURRED WHEN CONSUMER WAS DRIVING AT 52 MPH IN A HAIRPIN CURVE.  *LA  SEE ODI 10083767 ALSO.  *DSY",
        "vin": "1FTNW21P54E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/19/2004",
        "dateOfIncident": "01/31/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10067373,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "6.DIESEL ENGINE SHUT DOWN AT HIGHWAY SPEED. *AK",
        "vin": "1FTNW21P14E"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/12/2004",
        "dateOfIncident": "04/07/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10065964,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE SHUTS-OFF WHILE DRIVING.  ON THREE SEPARATE INSTANCES, ENGINE SHUT-OFF FOR 1~2 SECONDS WHILE DRIVING, THEN RESTARTED.  ON ANOTHER OCCASION, ENGINE CONTINUED RUNNING, BUT LOST ALL ACCELRATION ABILITY.  REGARDLESS OF HOW HARD ACCELARATOR WAS DEPRESSED, TRUCK WOULD NOT ACCELERATE.*AK",
        "vin": "1FTNW21P54E"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/30/2004",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10065246,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING VEHICLE WANDERED FROM SIDE TO SIDE, AND HAD ALMOST HIT A GUARD RAIL.  VEHICLE WAS TAKEN TO THE DEALER, WHO  STATED THAT VEHICLE 0WAS IN NORMAL OPERATION.  VEHICLE WAS TAKEN TO A VEHICLE SPECIALIST, WHO MADE A MINOR ADJUSTMENT TO THE STEERING SYSTEM,  BUT SUGGESTED THAT  VEHICLE WAS VERY DANGEROUS AND SHOULD NOT BE DRIVEN.  *AK",
        "vin": "1FTNF21L54E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/17/2004",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10063350,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "OIL WAS LEAKING FROM THE ENGINE.  VEHICLE WAS TAKEN TO THE DEALER, WHERE THE MECHANIC REPLACED THE REAR MAIN SEAL, BUT  OIL CONTINUED TO LEAK. *AK",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/11/2004",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10063059,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING  VEHICLE STALLED.  CONSUMER RESTARTED VEHICLE  AND DROVE IT  TO THE DEALER FOR INSPECTION, AND  MECHANIC WAS NOT ABLE TO DUPLICATE OR RESOLVE THE PROBLEM. *AK",
        "vin": "1FTNW21P14E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/01/2004",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10061079,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN TURNING ON THE AIR CONDITIONER OR HEATER STRONG DIESEL FUMES ENTER THE PASSENGER CABIN.  DEALER WILL REPLACE THE FLEX PIPE ON THE BACK OF THE ENGINE FROM THE MANIFOLD.*AK",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "02/19/2004",
        "dateOfIncident": "01/16/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10055687,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "WRANGLER",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "WHEN THE CONSUMER WENT USE THE SPARE TIRE, HE DISCOVERED THE TIRE WAS TOO SMALL FOR THE VEHICLE, WHICH CAUSED THE VEHICLE TO RIDE ABNORMAL.  *AK  *JB",
        "vin": "1FTNW21P64E"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "02/18/2004",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10059244,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "GENERAL TIRE & RUBBER CO.",
                "productMake": "GENERAL",
                "productModel": "GENERAL",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "WHILE DRIVING CONSUMER NOTICED VEHICLE  WAS RIDING ROUGH. CONSUMER INSPECTED VEHICLE, AND NOTICED DRIVER'S SIDE TIRE HAD A BUBBLE. DEALERSHIP REPLACED TIRE. TWO WEEKS LATER, LEFT SIDE TIRE BEGAN TO BUBBLE.  GENERAL TIRES 2585R16. *AK",
        "vin": "FILL IN"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/02/2004",
        "dateOfIncident": "01/01/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10056333,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER PURCHASED A 2004 FORD F250 6.0 DIESEL TRUCK IN AUGUST 2003 AND HAS HAD NOTHING BUT PROBLEMS SINCE THEN.  ENGINE REVS UP WHILE IN GEAR AT A STOP AND VEHICLE LURCHES INTO TRAFFIC.  *JB",
        "vin": "1FTNW21P24E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/28/2004",
        "dateOfIncident": "01/09/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10055973,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 30 MPH VEHICLE STALLED. CONSUMER MANAGED TO PULL OVER AND RESTARTED  VEHICLE. *AK",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/21/2004",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10055503,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE AT A COMPLETE STOP VEHICLE LURCHED FORWARD INTO TRAFFIC. *AK",
        "vin": "1FTNW21P54E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/05/2004",
        "dateOfIncident": "01/05/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10053371,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STALLED WHILE DRIVING AT VARIOUS SPEEDS. CONDITIONS FORCED DRIVER TO PULL THE VEHICLE OFF THE ROAD. UNABLE TO RESTART UNTIL 30-60 -SECONDS LATER. DEALER  INSPECTED  VEHICLE ON SEVERAL OCCASIONS, BUT  WAS UNABLE TO  RESOLVE THE PROBLEM.  *AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/05/2004",
        "dateOfIncident": "01/05/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10053403,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER  PURCHASED A 2004 FORD TRUCK IN NOVEMBER 2003, AND HAD NOTHING BUT PROBLEMS SINCE THEN.    THIS VEHICLE SHUT OFF WHILE  DRIVING DOWN THE STREET/ ON THE HIGHWAY OR  WHILE BEING ON A  CURB. CONSUMER TOOK  VEHICLE TO DEALER/MECHANIC SHOP 3 TIMES, BUT PROBLEM WAS NOT RESOLVED.  *AK",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/10/2003",
        "dateOfIncident": "11/10/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10046697,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT ANY SPEED THE ACCELERATOR PEDAL STICKS INTERMITTENTLY. DEALER INSPECTED  THE PROBLEM ON SEVERAL OCCASIONS, BUT WAS UNABLE TO SOLVE THE PROBLEM.  *AK  THIS PROBLEM OCCURRED ABOUT ONCE EVERY 100 MILES.  ABOUT 30% OF THE TIME WHEN LETTING OFF THE ACCELERATOR, THE ENGINE FAILS TO DECREASE RPM'S WITHIN 5 OR 5 SECONDS.  ABOUT 10% OF THE TIME THE ENGINE WOULD INCREASE  RPM'S, USUALLY 100 TO 250 RPM, BUT OCCASIONALLY UP TO 600 RPM'S.  *NM",
        "vin": "1FTNF21L24E"
    }
]