[
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/06/2014",
        "dateOfIncident": "12/23/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10558711,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 FORD F-450 SD. THE CONTACT STATED THAT THE VEHICLE SUDDENLY STALLED. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS FOUND THAT THE FUEL TANK LINING HAD FAILED. THE VEHICLE WAS BEING REPAIRED. THE MANUFACTURER WAS CONTACTED AND INFORMED THE CONTACT THAT THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER 05V270000 (ELECTRICAL SYSTEM). THE FAILURE MILEAGE WAS APPROXIMATELY 71,000.",
        "vin": "1FDXW46P54E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "11/03/2013",
        "dateOfIncident": "10/17/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10550664,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "SERVICE FUEL TANK",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "10/17/13 I WAS DRIVING ON THE INTERSTATE WITH A LOAD OF CATTLE RUNNING FINE AND JUST LOST POWER GOING ON THE INTERSTATE GOING FROM 65 TO 10 MILES AN HOUR. TRAFFIC ZIPPING BY. I THOUGHT IT WAS THE FUEL FILTERS BUT IT DONE THE SAME AFTER I CHANGED THEM. I TOOK IT TO A GARAGE AND HE SAID HE THE TANK LINER WAS COMING APART NOW IT MESSED UP MY INJECTORS, AND I THINK FORD SHOULD HAVE A RECALL ON SOMETHING LIKE THAT BEFORE SOMEONE GETS KILLED OR SEVERLY HURT!!!!  IT IS IN THE SHOP NOW AND I THINK FORD SHOULD PAY SOMETHING ON THIS.  *TR",
        "vin": "1FDXX47P24E"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/03/2012",
        "dateOfIncident": "11/01/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10483254,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE LOOSES POWER, NO ACCELERATION, OCCURS MOST FREQUENTLY UNDER HEAVY LOAD OR HIGH ACCELERATION DEMAND, TOLD BY FORD DEALER THE PROBLEM IS CAUSED BY DE-LAMINATING FUEL TANK RESULTING IN FUEL TANK COATING ENTERING THE FUEL SYSTEM AND OBSTRUCTING DIESEL FUEL FLOW TO MOTOR WHEN HIGH DEMAND FOR DUEL OCCURS. NEAR COLLISION AT FREEWAY SPEEDS AND WAS VERY DANGEROUS TO PULL OVER WHEN THERE WAS NO SHOULDER.    FORD DEALER STATES THE  COST TO REPAIR IS OVER $3,500.00 AND OPEN ENDED DEPENDING ON WHETHER THE FUEL TANK COATING ENTERED THE MOTOR OR INJECTORS. THEY WANT TO START BY REPLACING THE HARNESS, FUEL TANK AND FUEL PUMP AND GO FROM THERE. FORD REFUSES TO HONOR THIS CLEAR MANUFACTURING DEFECT.  *TR",
        "vin": "1FDXF46P34E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "02/21/2012",
        "dateOfIncident": "01/16/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10448794,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "AT APPX. 80,000 MILES ON OUR 2004 F450 SD FUEL TANK DELAMINATED CAUSING FUEL SYSTEM FAILURE WHICH RESULTED IN SUDDEN LOSS OF POWER.  WE HAVE ALWAYS PURCHASED HIGH QUALITY DIESEL FROM REPUTATABLE GAS STATIONS (CHEVRON, SHELL). VEHICLE REPAIRED AT FORD AND HAD CONTACTED FORD MOTOR COMPANY REGARDING REIMBURSEMENT OF COST AND WAS DECLINED.  *TR",
        "vin": "1FDXW47P54E"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/25/2012",
        "dateOfIncident": "01/17/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10445180,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUCK FAILS TO MAINTAIN SPEED (ACTS FUEL STARVED) AND IS AT RISK OF STALLING IN TRAFFIC. VEHICLE HAS BEEN MAINTAIN COMPLETELY AT FORD DEALERSHIP AND HAS HAD NO AFTERMARKET ADJUSTMENTS. AFTER TAKING THIS TRUCK TO THE FORD DEALER (PARR FORD IN BREMERTON, WA) WE HAVE BEEN NOTIFIED THAT THE FUEL TANK IS DELAMINATING AND CAUSING PARTICLES TO CLOG THE FUEL SYSTEM.  AS WE HAUL A LARGE TRAILER WITH THIS VEHICLE (AS I'M SURE OTHER CONSUMERS DO AS WELL) THIS CAN RESULT IN A CATASTROPHIC OUTCOME AS STALLING RESULTS IN LACK OF STEERING ABILITIES AND CAN LEAVE VEHICLE VULNERABLE IN TRAFFIC. FORD NEEDS TO RECOGNIZE THIS ISSUE IMMEDIATELY AND CORRECT VEHICLES CURRENTLY ON THE ROAD AT THEIR COST.  *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "11/28/2011",
        "dateOfIncident": "03/23/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10437565,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 FORD F-450.  THE CONTACT STATED THAT THE VEHICLE STALLED WHILE DRIVING 55 MPH. THE CHECK ENGINE LIGHT ILLUMINATED AFTER THE FAILURE OCCURRED. THE VEHICLE WAS TOWED TO THE DEALER WHERE THE DEALER PERFORMED A DIAGNOSTIC THAT LOCATED THE FAILURE AS THE FUEL LINER DELAMINATING. THE DEALER REPLACED THE FUEL TANK AND THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE AND THE CURRENT MILEAGE WAS 200,000.   UPDATED 01/11/12",
        "vin": "1FDXF46P24E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "07/15/2011",
        "dateOfIncident": "07/01/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10412436,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 F-450 SD.  WHILE DRIVING, THE CONTACT STATED THAT THE VEHICLE WOULD LOOSE POWER AND WOULD STALL INTERMITTENTLY.  THE DEALER DIAGNOSED THAT THERE WAS DELAMINATION FOUND IN THE FUEL TANK LINING, WHICH WAS FLAKING OFF AND CAUSING A LEAK IN THE FUEL FILTER AND FUEL PUMP.  THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE.  THE VEHICLE WAS REPAIRED.  THE FAILURE MILEAGE WAS UNAVAILABLE AND THE CURRENT MILEAGE WAS 34,000.",
        "vin": "1FDXF46P44E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "05/24/2011",
        "dateOfIncident": "05/02/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10403298,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 FORD F450 AMBULANCE. CONSUMER STATES DEFECTIVE OF THE FUEL TANK *TGW  THE CONSUMER STATED AS A RESULT OF A SERIOUS STRUCTURAL DEFECT OF THE FUEL TANK, THE VEHICLE STALLED DURING SEVERAL EMERGENCY CALLS.  THE COATING IN THE INTERIOR DIESEL FUEL TANK CORRODED AND COLLECTED AS SEDIMENT, WHICH EXTRACTED INTO THE FUEL SYSTEM.  THE FUEL LINE BECAME CLOGGED AND DAMAGED THE FUEL PUMP AND VALVES. *JB   UPDATED 03/01/12 *BF  UPDATED 03/16/12  UPDATED 04/18/12",
        "vin": "1FDXF47P24E"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/18/2010",
        "dateOfIncident": "05/25/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10339085,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 FORD F-450. SHE STATED THAT WHILE  DRIVING AT UNKNOWN SPEEDS, THE ENGINE STALLED.  THE VEHICLE WAS TOWED TO A LOCAL REPAIR FACILITY WHERE IT WAS DIAGNOSED FOR INJECTOR CONTROL PRESSURE, SENSOR CONNECTOR FAILURE. THE CONTACT BELIEVED THE FAILURE WAS ASSOCIATED WITH NHTSA RECALL CAMPAIGN ID NUMBER: 05V270000 (ELECTRICAL SYSTEM: WIRING). THE MANUFACTURER ADVISED THAT THE INFORMATION SHE HAD FOUND WAS A TECHNICAL SERVICE BULLETIN AND NOT A RECALL. THE MANUFACTURER WOULD NOT PROVIDE ANY ASSISTANCE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGES WERE 41,498.",
        "vin": "1FDXE45P34H"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "06/01/2010",
        "dateOfIncident": "03/21/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10334111,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL TANK DELAMINATION. TRUCKS STARTED RUNNING BAD, WOULD EVENTUALLY STOP. HAS LEFT ME AND MY EMPLOYEES STRANDED SEVERAL TIMES, SOMETIMES IN UNSAFE TRAFFIC AREAS. NEW FUEL TANKS INSTALLED, FUEL PUMPS INJECTORS PUT IN NEW. ENTIRE FUEL SYSTEM CLEANED. JUST UNDER $5000.00 EACH TIME. FORD SAYS BIOFUEL IS THE CAUSE. NEVER HAVE USED BIOFUEL IN ANYTHING. *TR",
        "vin": "1FDXW46P94E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "03/16/2010",
        "dateOfIncident": "03/16/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10319740,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "LTR FWD FM (VA) RE DEFECT FUEL INJECTION AND AIR INDUCTION SYSTEM FOR A 2004 FORD F-450 MEDIUM DUTY TRUCK.  *TGW  THE CONSUMER STATED A FEW MONTHS AFTER PURCHASING THE TRUCK, HE BEGAN HAVING A RECURRING PROBLEM WITH THE TRUCK LOOSING POWER. THE CONSUMER BELIEVED THE PROBLEM WAS ASSOCIATED WITH THE FUEL INJECTION AND AIR INDUCTION SYSTEM FOR THE TURBO CHARGER. ON 4 OCCASIONS, WHILE DRIVING UP A MOUNTAIN, HE EXPERIENCED A SUDDEN LOSS OF POWER THAT WAS CAUSED BY THE TRUCK GOING FROM 65 MPH TO LESS THAN 10 MPH IN A MATTER OF SECONDS. *JB",
        "vin": "1FDXW47P74E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "03/05/2010",
        "dateOfIncident": "02/24/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10317140,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 FORD F-450 SUPER DUTY. TRUCK WAS RUNNING AS IF IT WAS RUNNING OUT OF FUEL, GOT TO A STOP LIGHT AND THE TRUCK STALLED. GOT THE TRUCK TO RESTART. THAT EVENING I HAD THE FUEL FILTERS CHANGED THINKING THAT WAS THE PROBLEM, THEN THE TRUCK RAN FINE. TWO DAYS LATER THE TRUCK DID THE SAME THING, AND I WAS DRIVING AT 25MPH, TRUCK WOULD NOT RUN ANY FASTER,  THEN THE TRUCK STALLED IN THE MIDDLE OF A TWO LANE ROAD. THE TRUCK AT THIS TIME DID NOT RESTART. I HAD TO GET THE TRUCK TOWED. I GOT ADVICE FROM A MECHANIC AND HE DRAINED THE TANK AND HE FOUND SILVER FLAKES IN THE TANK. I CALLED UNIVERSAL FORD IN RICHMOND VIRGINIA AND THEY HAD IT TOWED THERE TO LOOK AT THE TRUCK, AND THE TECHNICIAN VERIFIED THAT THE TANK WAS CONTAMINATED FROM THE TANK DUE TO DELAMINATION OF THE INTERIOR OF THE TANK. FORD MOTOR COMPANY SAID THAT THE COST WAS $783.93 FOR PARTS AND $258.10 FOR LABOR, FOR A TOTAL OF $1042.03 AND FORD MOTOR WAS WILLING TO PAY ONLY $312.00. THIS IS ONLY FOR A TANK REPLACEMENT, NOT THE FILTERS, FUEL PUMP OR INJECTORS IF THESE PARTS ARE CONTAMINATED. I REFUSED THE SERVICE, ON THE FACT THAT THE SERVICE MANAGER SAID THAT THIS WILL PROBABLY HAPPEN AGAIN WITH THE NEW TANK AS WELL. I HAVE FOUND SOMEONE THAT CAN FIX MY TANK FOR LESS MONEY, BUT I WOULD LIKE RESULTS AND THIS NEEDS TO BE ADDRESSED BEFORE SOMEONE DOES GET KILLED, IF THEY HAVEN'T ALREADY. FORD IS SAYING TO MY KNOWLEDGE THAT THIS IS THE LOW-SULFUR DIESEL FUEL AND NOT THERE FUEL TANKS. I HAVE CONTACTED A LAWYER AND HE IS DEALING WITH OTHER CLIENTS WITH THE SAME ISSUE. *TR",
        "vin": "1FDXW46P94E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "02/04/2010",
        "dateOfIncident": "11/24/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10305820,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 FORD F-450. WHILE THE CONTACT WAS DRIVING 65 MPH HE NOTICED THICK WHITE SMOKE COMING FROM THE EXHAUST PIPE AND MOMENTS LATER THE VEHICLE SUDDENLY SHUT OFF. THE VEHICLE WAS TAKEN TO THE DEALERSHIP WHERE THEY REPLACED THE EGV VALVE, COMPUTER, AND 6 INJECTORS; HOWEVER, THE FAILURE CONTINUED TO OCCUR. THERE WERE NO PRIOR WARNINGS. THE CURRENT AND FAILURE MILEAGES WERE 69,122.    UPDATED 04/01/10  UPDATED 10/05/10",
        "vin": "1FDXW46P64E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "11/16/2009",
        "dateOfIncident": "11/16/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10292330,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2004 FORD F-450 HAS A FUEL TANK CORROSION/DELAMINATION PROBLEM.  FORD REFUSES TO FIX THE DEFECT.  THE DELAMINATION IS CAUSING A CLOGGING OF THE FUEL SYSTEM WHICH CAUSES THE ENGINE TO SHUT DOWN WHILE DRIVING.    I HAVE CHANGED THE INJECTORS AND CHANGE/CLEAN THE FUEL FILTERS REGULARLY    I HAVE READ ONLINE THE COMPLAINTS OF NUMEROUS OTHER OWNERS OF THE SAME TYPES OF TRUCK. *TR",
        "vin": "1FDXF46P14E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/03/2009",
        "dateOfIncident": "10/02/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10290826,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 FORD F-450 HAD ROTTING OIL PAN.  IT WAS DETERMINED BY FORD THAT THE CAUSE WAS FROM \"ENVIRONMENTAL ISSUES.\"  VEHICLE WAS ONLY USED ON-ROAD AT ALL TIMES AND THERE WAS NO REASON AFTER FOUR YEARS THAT THE OIL PAN SHOULD HAVE ROTTED OUT BECAUSE OF \"ENVIRONMENTAL ISSUES.\"  WE ARE LOCATED IN CONNECTICUT, NOWHERE NEAR SALT WATER.  IT COST OUR COMPANY $1,500 TO REPLACE THE PAN AND RELATED ITEMS.  WE DID HAVE A THREE-YEAR EXTENDED WARRANTY ON THE VEHICLE; HOWEVER, WE FEEL AN OIL PAN SHOULD NOT \"ROT\" AFTER FOUR YEARS OF NORMAL WEAR AND TEAR ON THE VEHICLE.  *TR",
        "vin": "1FDXF47P34E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "10/14/2009",
        "dateOfIncident": "10/12/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10287358,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR 2004 FORD F450 DIESEL TRUCK LOST POWER WHEN DRIVING ON THE HIGHWAY. WE TOOK IT TO FORD AND THEY TOLD US THE LINER IN THE FUEL TANK WAS COMING APART AND THEY WANTED $2100 TO REPLACE THE TANK. I SAW ON SEVERAL WEB SITES THAT THIS IS A COMMON PROBLEM THAT FORD IS WELL AWARE AND REFUSES TO TAKE RESPONSIBILITY FOR. I SAW OVER 1,000 BLOGS FROM PEOPLE WHO HAVE HAD THE SAME PROBLEM AND FORD TELLS THEM IT IS THE FUEL THEY ARE GETTING AND NOT A DEFAULT IN THE TANK DESIGN. I BELIEVE THEY SHOULD OWN UP TO THEIR MISTAKE AND RECALL THESE TANKS INSTEAD OF MAKING MONEY OFF OF REPLACING THEM. *TR",
        "vin": "1FDXF46P04E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "04/14/2009",
        "dateOfIncident": "04/07/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10265195,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DIESEL FUEL TANK ON MY 2004 FORD F450 IS DELAMINATING ON THE INSIDE OF THE TANK AND CAUSING FUEL CONTAMINATION WITH METALIC PARTICLES. IF THIS CONDITION HAD GONE UNDISCOVERED IT WOULD HAVE RESULTED IN FAILURE OF THE INJECTOR PUMP AND ULTIMATLY THE ENGINE ITSELF.  THIS IS A SERIOUS FACTORY DEFECT WITH DRIVER/PASSENGER SAFETY IMPLICATIONS FOR ALL LATE MODEL  FORD SUPER DUTY TRUCKS. FORD SHOULD BE FORCED TO RECALL THESE TRUCKS AND REPLACE THE DEFECTIVE TANKS REENGINEERED FUEL TANKS. *TR",
        "vin": "1FDXW46P04E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "01/14/2009",
        "dateOfIncident": "01/13/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10254967,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE 2 2005 FORD F450'S THAT BOTH HAVE HAD FUEL TANK DELAMINATION. I HAVE TALKED WITH THE DEALER AT LENGTH ABOUT THE SITUATION. OFF THE RECORD THE SERVICE ADVISOR ACKNOWLEDGED THAT THIS IS A HUGE PROBLEM AND THERE IS NO PROMISE THE NEW TANKS WILL NOT HAVE THE SAME PROBLEMS. AFTER SEARCHING ONLINE MESSAGE BOARDS I HAVE FOUND THAT THE PROBLEM IS WIDESPREAD. BASICALLY THE FUEL TANK THAT THE MANUFACTURER CHOSE TO USE WHEN BUILDING THE TRUCK WILL NOT HOLD UP TO THE FUEL TYPE THAT THE MANUFACTURER REQUIRES TO BE USED IN THE TRUCK. *TR",
        "vin": "1FDXF46P15E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "12/31/2008",
        "dateOfIncident": "12/26/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10253328,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS COMPLAINT STEMS FROM PROBLEMS EXPERIENCED WITH MY 2004 FORD F-450 DIESEL POWERED TRUCK.    I PURCHASED THIS 2004 FORD NEW TRUCK IN LATE 2004. AT PRESENT, THE ODOMETER READS  APPROXIMATELY 63,000 MILES. I EXPERIENCE LOSS OF POWER AT VARIOUS INTERVALS WHICH CAUSES THE VEHICLE TO SLOW DOWN AND POWER IS LIMITED TO A FEW MILES-PER-HOUR.     I HAVE RETURNED THE TRUCK TO FORD FOR REPAIR NUMEROUS TIMES AND FORD HAS NOT BEEN ABLE TO REPAIR THE PROBLEM. FORD HAS REPLACED THE TURBO TWO TIMES, THE WIRING HARNESS, THE EGR AND OTHER PARTS IN THE ATTEMPT TO REPAIR THE PROBLEM. I RETURNED THIS TRUCK TO FORD AGAIN ON 12-26-2008. THE SERVICE DEPARTMENT REMOVED THE FUEL FILTER AND THEY FOUND THAT THE LAMINATION OR LINING OF THE FUEL TANK HAS SEPARATED FROM THE METAL WHICH MAKES UP THE FUEL TANK. THIS APPEARS AS A FLAKY SILVER SUBSTANCE WHICH CLOGGED THE FUEL FILTER AND LINES AND IS VERY EXPENSIVE TO REPAIR.     I HAVE RESEARCHED THIS FAILURE ON THE INTERNET AND IT APPEARS THAT THERE ARE HUNDREDS OF COMPLAINTS WHICH POINT TO THE SAME FAILURE OF THE FORD FUEL TANK, ESPECIALLY ON DIESEL POWERED VEHICLES. A SAMPLING OF THE INTERNET POSTS CAN BE VIEWED AT HTTP://WWW.FINISHING.COM/442/19.SHTML.     IT APPEARS THAT FORD HAS TAKEN THE POSITION THAT THE PROBLEM IS DUE TO THE FUEL THAT IS USED IN THE NORMAL OPERATION OF THE VEHICLE. I DO NOT BELIEVE THIS STATEMENT TO BE TRUE. I BELIEVE THERE IS A MANUFACTURERS DEFECT IN THE APPLICATION OF THIS LAMINATE OR, THAT THE LAMINATE IS NOT OF CORRECT MATERIAL FOR THE INTENDED PURPOSE. THE BOND WHICH HOLDS THE LAMINATE TO THE STEEL FUEL TANK IS BREAKING DOWN AND CAUSING THE VEHICLE TO MALFUNCTION.    I URGE YOU TO INVESTIGATE THIS MATTER IMMEDIATELY. I KNOW YOUR DEPARTMENT IS AWARE OF THIS PROBLEM BECAUSE I HAVE READ YOUR RESPONSE IN NUMEROUS INTERNET CHAT ROOMS AND I URGE YOU TO ACT IMMEDIATELY TO DEMAND FORD RECALL AND MAKE RIGHT THESE MANUFACTURER DEFECTS.     THANK YOU FOR YOUR PROMPT ATTENTION TO THIS MATTER. *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "08/27/2008",
        "dateOfIncident": "08/25/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10239947,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A COMPLAINT ABOUT THE FUEL TANK IN MY 2004 F-450, THE TRUCK WAS LOSING  POWER AND DRIVING LIKE A PLUGGED FUEL FILTER AND AFTER CHANGING FUEL FILTERS MANY TIMES I HAD FOUND A \"GREY FLAKE LIKE\" MATERIALS IN BOTH FILTERS. I DECIDED TO TAKE TRUCK TO FORD DEALER IN LINCOLN, NE TO HAVE LOOKED AT AND FIXED. THEY CALLED BACK TELLING ME THE FUEL TANK LINING WAS BAD IN THE FUEL TANK AND NEEDED TO BE REPLACED AT MY EXPENSE. IT ALSO CAUSED ONE INJECTOR TO GO BAD(HOPEFULLY NOT MORE) AND A \"NOZZLE ASSEMBLY\". THEY CHARGED ME TO DISPOSE OF THE 25(OR SO) GALLONS OF FUEL, AND CHARGED ME FOR NEW FUEL. THE TOTAL BILL WAS $2066.23. THEY SAID THEY TALKED TO FORD AND FORD WOULD NOT WARRANTY ANYTHING. IN LOOKING ON INTERNET THERE ARE MANY PEOPLE WITH SAME PROBLEM. THE TANK HAS A LINER IN IT THAT HAS DISSOLVED CAUSING THE PROBLEMS. I AM THE ORIGINAL OWNER, TRUCK HAS 32000 MILES AND SHOULD NOT!  NEED A FUEL TANK AFTER 4 YEARS.  I HAVE OLD FUEL TANK. THANKS, CHRIS KEMS. *TR",
        "vin": "1FDXW47P74E"
    },
    {
        "components": "STEERING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/22/2008",
        "dateOfIncident": "04/15/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10225361,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING BRACKET BOTTOMS OUT WHEN TRUCK IS TURNED TO THE RIGHT ALL THE WAY...CAUSING IT TO BREAK STEERING BRACKET THAT IS MADE ONTO FRONT REAR HOUSING.  *TR",
        "vin": "1FDXW47P94E"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/08/2007",
        "dateOfIncident": "08/01/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10198822,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "GENERAL AMERI",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 FORD F450.  THE VEHICLE HAS CONTINENTAL GENERAL TIRES, SIZE 22590R19.5.  WHILE DRIVING 55 MPH, THE CONTACT HEARD A LOUD A POP AND THE VEHICLE PULLED TO THE LEFT.  HE NOTICED THAT THE TREAD ON THE DRIVER SIDE FRONT TIRE SEPARATED.  THE DEALER INSPECTED THE TIRE, BUT THEY WOULD NOT PROVIDE THE CAUSE OF FAILURE. THE ADDITIONAL TIRE DETAILS ARE UNAVAILABLE. THE CURRENT AND FAILURE MILEAGES WERE 43,000.  UPDATED 02/01/08.   *LJ  THE CONSUMER'S VEHICLE SUFFERED DAMAGE FROM THE TIRE FAILURE.",
        "vin": "1FDXF46P53E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/10/2006",
        "dateOfIncident": "07/10/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10162020,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THE VEHICLE OVERHEATED AND CONSUMED EXCESSIVE AMOUNTS OF WATER.  THE ENGINE HAS BEEN REPLACED ONCE.  THERE HAVE ALSO BEEN NUMEROUS PROBLEMS WITH THE VEHICLE'S TRANSMISSION WHICH HAS BEEN ALSO REPLACED DUE TO A BOLT COMING LOOSE RESULTING IN THE ENGINE BLOWING TWO HEAD GASKETS.  THE DEALERSHIP WAS ALERTED HOWEVER NO INSPECTIONS HAVE BEEN MADE. THE MANUFACTURER WAS ALSO ALERTED.",
        "vin": "1FDXW46P24E"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "07/18/2005",
        "dateOfIncident": "06/18/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10129223,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE VEHICLE STALLED  INTERMITTENTLY AT IDLING SPEEDS .  THIS SOMETIMES OCCURRED 20 MINUTES AFTER DRIVING.   WHEN VEHICLE STALLED ALL POWER WAS LOST, INCLUDING BRAKES AND POWER STEERING.  TO VEHICLE TO DEALER,  WHO IS UNABLE TO RESOLVE ANY CONCERNS,  BUT BLAMED THIS ISSUE ON THE FAULTY FUEL INJECTION PROGRAMMING.  THERE WAS  A RECALL ON THIS VEHICLE CONCERNING  THE FUEL INJECTION SYSTEM.  VEHICLE WAS INCLUDED IN THE RECALL, AND  RECALL REPAIR WORK HAS BEEN PERFORMED TWICE WITHOUT SUCCESS.  *AK",
        "vin": "1FDXF47P24E"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/06/2005",
        "dateOfIncident": "06/30/2005",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10127604,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: CONSUMER STATES HER 2004 FORD F450 CAUGHT ON FIRE WHILE IN OPERATION.  SMOKE WAS COMING FROM UNDER THE HOOD BEFORE THE FIRE.  THE VEHICLE WAS LAST SERVICED ON APRIL 11, 2005.  THE FIRE DEPARTMENT DID RESPOND.  THE ENGINE COMPARTMENT AND CAB  MELTED.  THEREFORE, THERE WAS NO INVESTIGATION AS TO  WHY THIS OCCURRED.  THIS WAS NOT THE CONSUMERS PERSONAL VEHICLE, BUT IT BELONGED TO HER EMPLOYER, AND THEY WERE  AWARE THAT SHE WAS FILING THE COMPLAINT.  GEM AIR DISTRIBUTORS LEASED THE VEHICLE.   THE MILEAGE WAS NOT EXACT, THE MAINTENANCE LOG WAS INSIDE THE VEHICLE WHEN IT CAUGHT ON FIRE.*AK",
        "vin": "1FDXF46P84E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/05/2005",
        "dateOfIncident": "07/05/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10127487,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "PAID FOR A EXSTENDED WARRENTY FORD WILL NOT FIX MY TRUCK",
        "vin": "1FDXF46P74E"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "06/13/2005",
        "dateOfIncident": "06/12/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10125181,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  FORD 450 2004,A   BRAKING SYSTEMPROBLEM.  CONSUMER TOOK  VEHICLE  TO  FORD DEALERSHIP  AND THEY REPAIRED PRESSURE RELEASE VALVE.  CONSUMER FOUND THAT THE VEHICLE WAS STILL DRIPPING BRAKE FLUID EVEN AFTER TAKING TO DEALERSHIP, CONSUMER TOOK TO THE DEALERSHIP AGAIN, DEALERSHIP SAID THEY COULD FIND NO PROBLEM.  CONSUMER NOTICED RED FLUID STILL DRIPPED.   DEALER SAID IT WAS RESIDUAL FLUID WHICH CONTINUED TO DRIP   FOR TWO WEEKS. PROBLEM STOPPED.  THEN WHEN CONSUMER HAD TO MAKE A SUDDEN STOP  THE BRAKES WOULD NOT WORK.*AK",
        "vin": "1FDXF46P64E"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/13/2005",
        "dateOfIncident": "08/23/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10125183,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  FRONT END VIBRATION OCCURRED IN FRONT  RIGHT AXLE AFTER CONSUMER PURCHASED THE VEHICLE.  CONSUMER WAS DRIVING BETWEEN 50-70 MPH WHEN THIS OCCURRED, CONSUMER TOOK VEHICLE  BACK TO DEALER, AND  THEY REPLACED BOTH OF THE FRONT WHEELS  AND THE RIM, THE ORIGINAL PROBLEM OCCURRED EVEN MORE SEVERE.  *AK",
        "vin": "1FDXF46P64E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "05/27/2005",
        "dateOfIncident": "04/08/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10122302,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "OPERATING IN ROUTE TO  A MEDICAL EMERGENCY CALL. REMOVED FOOT FROM ACCELERATOR TO APPLY BRAKES, WHEN RETURNED TO THROTTLE; ENGINE REMAINED AT IDLE.  HAD TO DISPATCH ANOTHER AMBULANCE TO THE CALL.  TOWED THE IUNIT TO  A LOCAL DEALER. DEALER HAS REPLACED THE THROTTLE SENSOR. UNKNOWN IF RETAINED OLD PART.",
        "vin": "1FDXF46P04E"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/06/2005",
        "dateOfIncident": "04/11/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10117744,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE EXPERIENCED SUDDEN ACCELERATION. WHILE DRIVING  AT APPROXIMATELY 40 MPH VEHICLE SURGED FORWARD. THE ENGINE REVVED, AND  DRIVER PUT ONE FOOT ON THE CLUTCH AND THE OTHER ON THE BRAKE. THE VEHICLE WAS USED FOR HAULING WHICH INCREASED  ITS DANGER. OWNER TOOK  VEHICLE TO THE DEALER, BUT WAS INFORMED THAT THERE WAS NO SOLUTION TO THE PROBLEM.  *AK  THIS HAS BEEN A PROBLEM FOR 1 YEAR, CONSUMER HAVE DROVE THIS PICKUP THIS WAY.  WAS TOLD BY FORD TO DRIVE IT LIKE YOU STOLEN IT AND DRIVE IT LIKE A NASCAR .  CONSUMER FEEL THIS WAS NOT GOOD INFORMATION.   *BF",
        "vin": "1FDXW47P14E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/03/2005",
        "dateOfIncident": "12/08/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10112477,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 F-450 6.0 DIESEL IN SHOP 15 TIMES, HOSES BURN REPLACE AND BURNS AGAIN ,TRUCK SHAKES REAL BAD . OIL LEAKS , RADIATOR HOSES LEAKS ,GLOW PLUGS,BAD INJECTORS ,WIRES RUBS MOTOR SHUTS TRUCK OFF,INSTRUMENT PANEL BATTERY LIGHT COMES ON AND OFF AND THEN STAYS ON. LOSES POWER.  *JB",
        "vin": "1FDXW47P74E"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/25/2005",
        "dateOfIncident": "11/15/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10108829,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERMITTENTLY WHEN APPLYING THE BRAKES, THE BRAKE PEDAL FELT SPONGY/SOFT. ALTHOUGH THE VEHICLE WOULD STOP, THE BRAKE PEDAL WAS NOT FEELING HARD AS IT SHOULD AND MAY CAUSE A LOSE OF BRAKING IF THIS CONDITION CONTINUES ON. THE VEHICLE HAS BEEN TO THE DEALER. THE DEALER INFORMED THE CONSUMER THAT THE CONDITION WAS A NORMAL CHARACTERISTIC OF THIS VEHICLE.",
        "vin": "1FDXX47P74E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/01/2004",
        "dateOfIncident": "08/12/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10093425,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED 2004 FORD F-450 DEISEL TRUCK 5/31/04 - FIRST HAD AT DALE JARRETT FORD IN MONROE, NC IN JULY REGARDING PROBLEM WITH TURBO BUT HAVE NO DOCUMENTATION FOR FIRST VISIT -   8/12/04  DALE JARRETT FORD EXAMINED TRUCK FOR LOSS OF POWER AND PROBLEM WITH TURBO - RESULT:   OPERATING TO SPECS ACCORDING TO SERVICE DEPT.   8/27/04 EXAMINED BY DALE JARRETT FORD AGAIN FOR LACK OF POWER AND PROBLEM WITH TURBO  - RESULT:   REPLACED TURBO KIT AND CORE RETURN, TRUCK OPERATING TO SPECS ACCORDING TO SERVICE RECORD  8/31/04 EXAMINED BY HARRELSON FORD, CHARLOTTE, NC FOR LOSS OF POWER   - RESULT:  PCM REPRGRAMMED   9/2/04 HARRELSON FORD EXAMINED TRUCK FOR LACK OF POWER ON ACCELERATION, POWER COMES BACK UP TO SOME EXTENT AFTER PERIOD OF TIME HAS LAPSED  - RESULT:  REPLACED EXHAUST BACK PRESSURE SENSOR AND VGT CONTROL VALVE   9/21/04  EXMAINED BY HARRELSON FORD FOR COMPLETE LOSS OF POWER WHILE DRIVING, WILL RESTART AFTER PERIOD OF TIME HAS LAPSED BUT HAPPENS CONTINUALLY  - RESULT:  RECORDER/MONITOR INSTALL, REPLACED EGR VALVE   9/24/04 CONSULTED WITH HARRELSON FORD SERVICE DEPT REGARDING SAME, CONTINUOUS PROBLEM, HAS NOW BECOME A SAFETY ISSUE BECAUSE TRUCK LOSES POWER ON HIGHWAY NEXESSITATING PULLING OVER INTO BREAKDOWN LANE TO WAIT FOR POWER TO COME BACK UP ENOUGH TO DRIVE TRUCK AGAIN, ADVISED HARRELSON SERVICE DEPT THAT I WOULD BE RESEARCHING LEMON LAWS IN NC TO RESOLVE PROBLEM   - WOULD LIKE FORD TO PURCHASE BACK AND/OR REPLACE WITH 2005 MODEL  .  *AK",
        "vin": "1FDXW46P64E"
    }
]