[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/09/2021",
        "dateOfIncident": "07/31/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387317,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "CASUAL DRIVER. NOTICED ACCELERATION AND COASTING/ROLLING WERE SLUGGISH.  MECHANIC NOTED BRAKE AREA TEMP ON FRONT DRIVER'S SIDE WAS OVER 400 DEGREES.  THE BRAKES ON THAT WHEEL WOULD NOT RELEASE COMPLETELY AND CAUSED CONTINUOUS FRICTION PRODUCING OVERHEATING. (I NOTICED I AM NOT THE ONLY ONE TO SUBMIT THIS BRAKE PROBLEM TO THIS BOARD. )  THE MECHANIC REPLACED THE TOTAL FRONT BRAKES AND MASTER CYLINDER SYSTEM.  COST OVER $1100 TO DO THIS BACK IN 2013.  IT IS NOW JAN 2021 AND I STILL HAVE LESS THAN 50,000 MILES ON MY BABY MUSTANG.",
        "vin": "1FAFP44634F"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/27/2020",
        "dateOfIncident": "03/03/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351676,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "NEVER KNOW WHEN CAR IS FULLY GAS UP ALWAYS PUT GAS IN AT 1/4 TO 1/2 TANK, WILL OVERFILL IF NOT VERY CAREFULLY SO REALLY JUST PUT NO MORE THAN 10 TO 15 DALLAS NEVER SHOWS FULL. DO NOT WANT TO OVERFLOW ON ME FOR ONE TWO IT'S BAD FOR MY BABY #1 MUSTANG",
        "vin": "1FAFP406X4F"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "12/01/2019",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11283074,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "BACK ON MARCH 1, 2016 I BELIEVE I WAS COMING TO A STOP LIGHT I APPLIED MY FOOT ON THE BREAK AND THE CAR SEEM TO WANNA KEEP INCHING FORWARD INCHING FORWARD I HAD AT THIS TIME CONTINUED TO PRESS DOWN ON THE BREAK AS SOON AS I KNEW IT I WAS IN THE MIDDLE OF THE STREET PRACTICALLY DURING A RED LIGHT AND WAS SIDESWIPED. AFTER LOOKING UNDER TO SEE WHAT WAS CAUSING THAT IT SEEMS TO BE MY GAS PEDAL WAS HUNG UP ON A PIECE OF CARPETING ON THE FLOOR OF THE CAR CAUSING MY GAS PEDAL TO BECOME STUCK TO THAT CARPET I HAD TO CUT THE PIECE OF CARPETING AWAY FROM THAT TO STOP THAT FROM DOING THAT LATER TO FIND OUT THERE HAD BEEN A RECALL WHEN I TOOK MY CAR FOR THE RECALL THEY TOLD ME THAT IT WAS ONLY ON SPECIFIC MUSTANGS I DON'T KNOW WHY IF MY CAR WAS HAVING THE SAME ISSUE THE POLICE OFFICER SAID HE WAS NOT GIVING ME A TICKET BECAUSE HE DIDN'T FEEL THAT I WAS AT FAULT BUT YET MY INSURANCE WENT UP AND PAID THE OTHER DRIVER FOR DAMAGES.  BECAUSE IT'S BEEN THREE YEARS I WILL DO MY BEST TO GET THE PAPERWORK TOGETHER",
        "vin": "1FAFP44654F"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "10/20/2019",
        "dateOfIncident": "03/01/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11269598,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS PEDAL GOT CAUGHT ON A PIECE OF CARPET WHICH CAUSED MY CAR TO ENTER INTO AN INTERSECTION ON A RED LIGHT AND CAUSED ME TO HAVE AN ACCIDENT. WHICH THEN MADE MY INSURANCE JUMP. I REMEMBER THIS DAY VERY WELL IT WAS THE DAY BEFORE MY BIRTHDAY I CAME UP TO THE RED LIGHT AND STOPPED THE CAR SEEM TO WANT TO KEEP MOVING FORWARD AS I PUT MY FOOT ON THE BREAK IT WAS STILL A RED LIGHT MY CAR WAS MOVING FORWARD CARS WERE BEEPING AT ME AS I KEPT INCHING INTO THE MIDDLE OF THE STREET MY CAR WAS HIT IN THE REAR PASSENGER SIDE BY ANOTHER MUSTANG. I EXPLAIN TO THE POLICE OFFICER THAT WHAT SEEM TO HAPPEN WAS MY CARPET SEEM TO HAVE GOTTEN CAUGHT ON THE GAS PEDAL. AFTER LATER LEARNING THAT THERE WAS A RECALL FOR THAT PARTICULAR PROBLEM IT WASN'T  RE CALLING UNDER MY VIN. TO THIS DAY I HAVE AN ACCIDENT MARK ON MY INSURANCE WHICH MADE MY BILL GO UP I DON'T THINK THAT THIS IS FAIR CONSIDERING THAT IT WAS NOT MY FAULT I TRIED SHOWING THE INSURANCE COMPANY THAT THERE WAS A RECALL BUT IT WASN'T RECALLING UNDER MY VIN NUMBER",
        "vin": "1FAFP44654F"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/18/2019",
        "dateOfIncident": "04/13/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11197105,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "ABS BRAKE LIGHT IS ON THIS IS UNSAFE IN WET OR SNOWY CONDITIONS",
        "vin": "1FAF40634F2"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/26/2018",
        "dateOfIncident": "11/22/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11154012,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 FORD MUSTANG. WHILE DRIVING 25 MPH, THE ACCELERATOR PEDAL BECAME CAUGHT IN THE FLOORMAT AND CAUSED THE VEHICLE TO ACCELERATE. THE CONTACT HAD TO SHIFT INTO NEUTRAL TO STOP THE VEHICLE. THE DEALER AND MANUFACTURER WERE NOT CONTACTED. THE FAILURE MILEAGE WAS 169,865.",
        "vin": "1FAFP40674F"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "11/15/2018",
        "dateOfIncident": "03/01/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11151685,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "BACK IN 2016 I WAS INVOLVED IN AN ACCIDENT IN WHICH MY GAS PEDAL SEEMED TO HAVE GOT HUNG UP ON THE CARPET WHICH CAUSED MY GAS PEDAL TO ACCELERATE A LITTLE WHEN I WAS AT A RED LIGHT CAUSING ME TO HAVE AN ACCIDENT.. I WAS COMING TO A STOP AT A RED LIGHT WHEN THE PEDAL SEEMED TO HAVE GOT STUCK. I HAD MY FOOT ON THE BRAKE BUT THE CAR SEEMED TO WANT TO CONTINUE TO MOVE I JUST THOUGHT MY ACCELERATOR WAS SET A LITTLE HIGH UNTIL SAW THAT THE PEDAL WAS GETTING CAUGHT ON THE CARPET.",
        "vin": "1FAFP44654F"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "09/04/2018",
        "dateOfIncident": "09/01/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11124281,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 FORD MUSTANG. WHILE ATTEMPTING TO DRIVE OFF FROM A PARKING SPACE, THE VEHICLE ACCELERATED FROM 0 TO APPROXIMATELY 40 MPH. AS A RESULT, THE VEHICLE CRASHED INTO THE FRONT DRIVER'S SIDE OF ANOTHER VEHICLE THE AIR BAGS DID NOT DEPLOY. A POLICE REPORT WAS FILED. THERE WERE NO INJURIES. THE VEHICLE WAS DAMAGED, BUT WAS NOT TOWED. THE CAUSE OF THE FAILURE WAS NOT DIAGNOSED. THE DEALER AND MANUFACTURER WERE NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 171,000.",
        "vin": "1FAFP40474F"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/17/2017",
        "dateOfIncident": "07/16/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11006037,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SPARK PLUGS HAVE A TENDENCY TO BLOW OUT.   AN EXPLOSION MAKES THE PLUG STRIP THE THREADS AND DO DAMAGE TO THE HEAD.   THERE IS ALSO POTENTIAL FOR FIRE AS FUEL VAPOR IS THEN RELEASE DIRECTLY INTO THE ENGINE COMPARTMENT.",
        "vin": "1FAFP42X84F"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/20/2017",
        "dateOfIncident": "01/19/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10946801,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG GT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT BRAKES DRAG OR FREEEZE UP CAUSING EXTREME HEAT OR ACTUALLY STOP VEHICLE.  CAR HAS 18,000 MILES.  FRONT CALIPERS HAVE BEEN REBUILT TWICE.  FIRST FAILURE AT TEN YEARS,THEN FAILED AFTER APX 3 YEARS. THE PROBLEM IS THE PHENOLIC PISTONS SWELL AFTER TIME OR DUE TO LOSE OF LUBRICATION.  THEY CHANGE DIMENSION AND STICK IN THE CALIPER.  THIS IS THE 3 RD VEHICLE WITH THE SAME PROBEM.   81 FORD F150, 98 FORD F150 FRONT DISK BRAKES.  BOTH AFTER THE VEHICLE HAD BEEN ON THE ROAD ABOUT 10 YEARS.  WHEN PISTONS HAVE BEEN REPLACED WITH METAL PISTONS I HAVE HAD NO MORE ISSUES WITH THE FRONT BRAKES. THE MUSTANG HAS NO METAL PISTON AVAILABLE AND HAD TO BE REBUILT WITH AFTER MARKET PHENOLIC PISTONS.  THEY FAILED AGAIN PROBABLY BECAUSE OF LACK OF LUBRICATION OF BOOT AND PISTON.  SOMEHOW I FEEL THIS IS A CHRONIC FAILURE AND HAPPENS A LOT WITHOUT ANYBODY BEING  AWARE THAT TIME AND OR HEAT AFFECT THE PHENOLIC PISTON AND CAUSE BRAKE FAILURE.THIS FAILURE IS STRICTLY VEHICLE RELATED AND NOT DUE TO ANY EXTERNAL  CAUSES EXCEPT TIME, HEAT, OR LUBRICATION. I FEEL THE WEIGHT OF THE NON METALLIC  PISTON DOESN'T  COMPENSATE FOR THE COST OF THE BRAKE FAILURE THAT IT CAUSES.  I'VE BEEN TOLD BY FORD THAT THE PHENOLIC PISTONS WERE SELECTED TO SAVE WEIGHT.",
        "vin": "1FAFP45X94F"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/04/2016",
        "dateOfIncident": "11/29/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10924215,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2004 FORD MUSTANG. WHILE DRIVING APPROXIMATELY 15 MPH, A VEHICLE RAN A RED LIGHT AND CRASHED HEAD ON INTO THE CONTACT'S VEHICLE. THE CONTACT'S VEHICLE WAS TURNED SIDEWAYS AND CRASHED INTO A POLE. THE FRONTAL AIR BAGS FAILED TO DEPLOY. THE CONTACT WAS PINNED INSIDE THE VEHICLE. THE FIRE DEPARTMENT PRIED THE DOOR OPEN TO RESCUE THE CONTACT. THE CONTACT WAS TRANSPORTED IN AN AMBULANCE TO THE HOSPITAL, BUT NO INJURIES WERE REPORTED. A POLICE REPORT WAS FILED. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 14V802000 (AIR BAGS) IN DECEMBER OF 2015. THE VEHICLE WAS DESTROYED AND TOWED. THE APPROXIMATE FAILURE MILEAGE WAS 105,000.",
        "vin": "1ZVFT80N455"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/02/2016",
        "dateOfIncident": "02/28/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10839547,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE IN AN ACCIDENT ON 2-28-2016 AND WAS HIT FROM THE SIDE AND PUSHED INTO A DITCH WHILE PASSING A FORD 250 HE TURNED INTO US WHILE DRIVING 50 MPH. THE AIRBAGS DID NOT GO OFF.",
        "vin": "1FAFP406X4F"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/22/2015",
        "dateOfIncident": "07/05/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10811771,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 FORD MUSTANG. THE CONTACT STATED THAT HEADLAMPS FAILED TO RESPOND INTERMITTENTLY. THE FAILURE RECURRED SEVERAL TIMES. THE VEHICLE WAS NOT TAKEN TO BE DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 110,000. THE VIN WAS NOT PROVIDED.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/01/2015",
        "dateOfIncident": "01/03/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10807717,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR AT LEAST 5 YEARS THE CONVERTIBLE TOP LEAKS WATER INTO THE BACK OF THE CAR WHEN THE TOP FOLDS DOWN INTO THE BACK OF THE CAR,  THEN THIS WATER LEAKS ONTO THE BACK FLOOR BOARDS.  AFRAID IT IS GOING TO ROT OUT THE FLOOR BOARDS.  THIS NEEDS TO BE TAKEN CARE OF. I KNOW OF MANY FORD MUSTANGS THAT DO THIS.",
        "vin": "1FAFP44694F"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/31/2015",
        "dateOfIncident": "04/06/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10722477,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG GT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER STARTING ENGINE, SPARK PLUG EJECTED FROM BLOCK AND EXPLODED.  ENGINE WAS IMMEDIATELY SHUT DOWN AND HAULED TO A REPAIR MECHANIC.  COST OF REPAIR WAS $2,400 AND VEHICLE WAS IN SHOP FOR 5 DAYS.  EXPLOSION WAS LOUD AND COULD HAVE CAUSED AN ACCIDENT WITH THE SHOCK OF THE LOUD NOISE.",
        "vin": "1FAFP45X44F"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "08/04/2014",
        "dateOfIncident": "07/21/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10618681,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER SIDE FRONT SEAT BELT RETRACTS ONLY AND WILL NOT EXTEND, SO THEREFORE IS NON-FUNCTIONAL.   THIS IS NOT A CASE OF TWISTED BELT, AS WE HAVE ACCESSED THE PART AND ENSURED \"FLAT\" WIND.   MY SON JUST BOUGHT CAR.  PRIOR OWNER SAYS IT NEVER WORKED FOR SEVERAL YEARS.   DRIVER'S SIDE SEAT BELT IS ALSO BARELY FUNCTIONAL.   BOTH PRESENT MAJOR SAFETY HAZARDS TO OCCUPANTS.   LOOKING ON-LINE THIS SEEMS TO BE A WELL KNOWN PROBLEM WITH THE MANUFACTURER'S DESIGN WHICH SHOULD BE CORRECTED.   *TR",
        "vin": "1FAFP40684F"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/28/2012",
        "dateOfIncident": "01/01/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10477368,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 FORD MUSTANG. THE CONTACT STATED THAT THE VEHICLE WOULD NOT START. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THE FAILURE COULD NOT BE REPLICATED HOWEVER, THE DEALER MADE REPAIRS TO THE VEHICLE.  THE CONTACT WAS UNSURE OF WHAT REPAIRS WERE PERFORMED. THE FAILURE RECURRED SEVERAL TIMES AFTER THE REPAIRS WERE COMPLETED. THE MANUFACTURER WAS CONTACTED. THE FAILURE AND THE CURRENT MILEAGES WERE UNAVAILABLE.",
        "vin": "1FAFP40604F"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/17/2012",
        "dateOfIncident": "05/08/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10465996,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2004 FORD MUSTANG. THE CONTACT STATED THAT WHILE DRIVING, A LOUD NOISE WAS HEARD COMING FROM UNDER THE VEHICLE. THE CONTACT TOOK THE VEHICLE TO A REPAIR SHOP WHERE THEY ADVISED THAT THE AIR COMPRESSOR CONDENSATION DRIPPED ONTO THE EXHAUST PIPE AND THE EXHAUST PIPED NEEDED TO BE RE-WELDED. THE VEHICLE WAS REPAIRED. THE CONTACT NOTIFIED THE MANUFACTURER AND WAS ADVISED THAT THERE WERE NO RECALLS FOR THE VEHICLE OR THE FAILURE. THE FAILURE MILEAGE WAS 75,000.",
        "vin": "1FAFP44674F"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/22/2012",
        "dateOfIncident": "11/08/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10462718,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 FORD MUSTANG. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS AND ENGAGING THE ACCELERATOR PEDAL, THE PEDAL WOULD BECOME STUCK. AS A RESULT, THERE WAS AN INCREASE IN ENGINE RPMS.THE CONTACT MENTIONED THAT SHE WOULD HAVE TO KICK AT THE PEDAL OR ENGAGE THE BRAKES IN ORDER TO RELEASE THE ACCELERATOR FROM BEING STUCK. THE VEHICLE WAS NOT TAKEN TO THE DEALER. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 65,000 AND THE CURRENT MILEAGE WAS 70,000.    UPDATED 8/31/12 *CN  UPDATED 09/10/12. *JB",
        "vin": "1FAFP40694F"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "05/21/2012",
        "dateOfIncident": "05/19/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10459078,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Cooper Tire & Rubber Co.",
                "productMake": "COOPER",
                "productModel": "MASTERCRAFT SENSYS 01",
                "productYear": "9999",
                "size": "205/55R16",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 FORD MUSTANG. THE CONTACT HAS A COOPER MASTER-CRAFT SENSYS01 TIRE, SIZE 205/65R15, DOT #2402 THAT FAILED. WHILE DRIVING 70 MPH THE DRIVERS SIDE FRONT TIRE TREAD SEPARATED CAUSING DAMAGE TO THE WHEEL WELL, THE FRONT BUMPER AND LOOSENED THE ROCKER PANEL. THE VEHICLE MERGED ONTO THE EMERGENCY LANE IN ORDER FOR HIM TO INSTALL THE SPARE TIRE. THE DEALER NOR  MANUFACTURER WERE NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 64,000.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/20/2012",
        "dateOfIncident": "03/19/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10452320,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG GT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I STARTED THE CAR UP TO DRIVE OUT OF THE GROCERY PARKING LOT AND THE CAR WAS SPUTTERING.  WHEN I PULLED ONTO THE MAIN HIGHWAY IT SPUTTERED AND COMPLETELY STOPPED RUNNING.  I COASTED TO THE SIDE OF THE ROAD WHERE IT FAILED TO RESTART.   *KB",
        "vin": "1FAFP42X94F"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/14/2012",
        "dateOfIncident": "03/14/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10451577,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG GT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MULTIPLE OCCASIONS THE NUMBER FIVE SPARK PLUG KEEPS BLOWING OUT OF THE HEAD. THE CAR HAS MOTORCRAFT SPARK PLUGS AND ARE TORQUED TO THE FACTORY SPECIFICATIONS. WHILE LOOKING INTO THE PROBLEM ONLINE I FOUND OUT THAT IM NOT THE ONLY PERSON HAVING THIS PROBLEM. THE CRAZY THING IS THAT ITS IS ONLY HAPPENING WITH THE NUMBER FIVE PLUG.  *TR",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/22/2012",
        "dateOfIncident": "06/01/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10444764,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "EVERY TIME IT RAINS, UNDERNEATH THE PASSENGER SEAT INTO THE BACK PASSENGER SIDE FLOORBOARD IS FLOODED WITH WATER.  *TR",
        "vin": "1FAFP45X34F"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/19/2011",
        "dateOfIncident": "09/18/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10426002,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "SEPTEMBER 18, 2011:  WHILE EXITING AN INTERSTATE, I BEGAN TO GO AROUND THE CLOVERLEAF OF MY EXIT, LESS THAN 15 MPH, AND THE BACK END OF MY MUSTANG VERY QUICKLY FISHTAILED SPINNING ME ALL THE WAY AROUND. I ENDED UP FACING THE PEOPLE BEHIND ME, WHO FORTUNATELY WERE GOING AS SLOWLY AS I WAS.  FORTUNATELY I WAS ABLE TO STOP JUST SHORT OF HITTING A CONCRETE BARRIER WALL.  THERE WAS A VERY LIGHT RAIN, AND THE ROADS WERE WET.  I HAVE ALL NEW TIRES.  I'VE HAD THIS PROBLEM SINCE WE PURCHASED THE VEHICLE, AND HAVE FISH-TAILED BEFORE, BUT NEVER SPUN COMPLETELY AROUND.  COMPLETELY TERRIFYING.  *KB",
        "vin": "1FAFP40604F"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/19/2011",
        "dateOfIncident": "03/18/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10420145,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 FORD MUSTANG. THE CONTACT STATED THE HEADLIGHTS WERE VERY DIM AND THE HIGH BEAMS HAD TO BE USED IN ORDER TO SEE AT NIGHT. THE CONTACT REPLACED THE LENS AND ADDED HIGH INTENSITY LIGHT BULBS, BUT THE FAILURE WAS NOT CORRECTED. THE CONTACT SPOKE WITH THE MANUFACTURER AND STATED THE LIGHTS WERE NOT COVERED BY THE WARRANTY AND THERE WAS NO RECALL. THE FAILURE MILEAGE WAS 63,125 AND THE CURRENT MILEAGE WAS 71,000.  UPDATED 09/29/2011 *LN  *TR",
        "vin": "1FAFP44624F"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/28/2011",
        "dateOfIncident": "07/01/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10384838,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG GT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE LIGHT AND TRACTION CONTROL LIGHT AND ABS LIGHT INTERMITTENT..THEN ON CONSTANTLY...HASN'T BEEN FIXED TOO EXPENSIVE...IN WET WEATHER, SLIPPERY, ICY WEATHER TIRES SPIN BECAUSE TRACTION CONTROL DOES NOT WORK...ABS CONTROL MODULE WENT BAD...THOUSANDS OF PEOPLE HAVE BLOGS AND FORUMS COMPLAINING ABOUT THIS PART...I WILL POST THIS WEBSITE WITH HOPES THEY ALL COMPLAIN!  *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/17/2010",
        "dateOfIncident": "04/13/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10371079,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 FORD MUSTANG. THE REAR AXLE HOUSING WAS CORRODED AND RUSTED WHICH THE CONTACT NOTICED AFTER A ROUTINE MAINTENANCE. THE CONTACT CALLED THE DEALER WHO STATED THERE WERE NO RECALLS.  THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 15,000.  UPDATED 04/08/11",
        "vin": "1FAFP40654F"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/30/2010",
        "dateOfIncident": "09/06/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10358377,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "IN 2004 MY MOM BOUGHT A NEW 2004 FORD MUSTANG WITH THE 3.9 V-6 MOTOR AND WITHIN A COUPLE OF  MONTHS IT STARTED TICKING REAL LOUD WHEN YOU FIRST START IT UP. COME TO FIND OUT IT WAS A PASSENGER SIDE EXHAUST LEAK THAT JUST GOT WORSE, AND AT THE SAME TIME HER ENGINE STARTED MAKING LOUD CHIRPING AND CRAZY NOISES TO FIND OUT IT WAS THE CAM POSITIONING SENSOR THAT WENT OUT. WELL SHE PAID ABOUT $550.00 TO GET THE SENSOR FIXED BUT SHE COULDN'T AFFORD THE EXHAUST TO.SO STILL TO THIS DAY SHE DRIVES HER NICE LOOKING MUSTANG CAREFULLY AROUND TOWN THAT SOUNDS LIKE ITS READY TO DIE, AND I WOULDN'T TRUST DRIVING THAT THING 10 MILES OUT OF TOWN. IT MIGHT NOT BE AN EYE SORE BUT IT SURE IS AN EAR SORE, AND IS STRESSING YEARS OFF MY OLD BROKE MOTHERS LIFE. WE'VE ALWAYS BEEN A FORD FAMILY AND MY DAD RETIRED FROM FORD PROVING GROUNDS. BUT THAT IS THE SORRIEST FORD WE'VE  EVER SEEN.OH YEAH, PLUS THE AUTOMATIC TRANSMISSION NEVER SHIFTED RIGHT FROM DAY 1, AND SHE HAS HAD TO REPLACE THE ALTERNATOR, BATTERY ,A PULLEY, THE SERPENTINE BELT ETC.AND IT HAS A LOT OF RATTLES AND ROAD NOISE,AND IT JUST BARELY MADE 60,000 MILES. *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,VEHICLE SPEED CONTROL,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "07/17/2010",
        "dateOfIncident": "04/28/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10343764,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG GT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TOP OF THE CLUTCH PEDAL ASSEMBLY WHEN DEPRESSED AND RELEASED RUBS THE WIRING HARNESS TO THE BRAKE SWITCH, NEUTRAL SAFETY SWITCH AND OTHERS SHORTING OUT THE BRAKE LIGHTS AND MAKING THE CRUISE CONTROL INOPERABLE. IT WORKS FOR A WHILE BUT THEN IT BLOWS THE FUSE AGAIN AND SOMEONE HAS TO STOP ME AND TELL ME MY BRAKE LIGHTS DON'T WORK. THE DEALER HAS REPLACED ONE OF THE WIRES FOR THE BRAKE SWITCH WHICH IS IN THAT SAME WIRING HARNESS AND SAYS THE PROBLEM IS FIXED BUT SOONER OR LATER IT WILL RUB THE REST OF THE WIRES BARE TOO. I HAVE ALSO REPLACED THE BRAKE SWITCH A COUPLE TIMES BECAUSE WHEN IT SHORTS OUT IT MELTS IT IF THE FUSE DOESN'T BLOW RIGHT AWAY. I AM AFRAID ONE TIME SOMEONE WILL REAR END ME OR I WILL GET A TICKET. *TR",
        "vin": "1FAFP42X24F"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "07/16/2010",
        "dateOfIncident": "04/01/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10343559,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG GT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER SIDE SEATBELT RETRACTOR COMPLETELY FAILED; MY PASSENGERS ARE NOT ABLE TO BUCKLE THEIR SEATBELT. *TR",
        "vin": "1FAFP42X74F"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/15/2010",
        "dateOfIncident": "04/13/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10319950,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG GT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS 2004 MUSTANG GT. THE DEALER CONFIRMED THAT THE CRUISE CONTROL DEACTIVATION SWITCH CAUSED THE FUSE FOR THE BRAKE LIGHTS TO BURN OUT, WHICH MADE THE BRAKE LIGHTS INOPERABLE.  THE FUSE WAS  REPLACED CONTINUOUSLY AND IT CONTINUED TO FAIL.  THE FAILURE MILEAGE ON THE VEHICLE WAS 26000 AND THE CURRENT MILEAGE WAS 35000.    UPDATED 06/03/10*BF  THE CONSUMER STATED THE BRAKE LIGHTS WORK, BUT NOT THE CRUISE CONTROL HAS STOPPED WORKING ALTOGETHER. UPDATED 06/10/10.*JB",
        "vin": "1FAFP42X24F"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/11/2009",
        "dateOfIncident": "11/10/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10291901,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR STALLING WHILE IDLING AND DECELERATING. *TR",
        "vin": ""
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "09/08/2009",
        "dateOfIncident": "09/07/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10283316,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "IF YOU RECLINE THE SEAT BACK, AND THE SEATBELT IS THROUGH THE PLASTIC LOOP ATTACHED TO SEAT, IT LOOSES TENSION AND FAILS TO RESTRAIN YOU. THIS CAN CAUSE SERIOUS INJURY DURING AN ACCIDENT. *TR",
        "vin": "1FAFP40424F"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/19/2009",
        "dateOfIncident": "08/16/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10280951,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 FORD MUSTANG. WHILE DRIVING 10MPH, A VEHICLE PROCEEDED THROUGH A TRAFFIC LIGHT AND CRASHED INTO THE FRONT PASSENGER SIDE OF HER VEHICLE.  THERE WERE NO INJURIES SUSTAINED; HOWEVER, SHE STATED THAT THE AIR BAGS ARE DEFECTIVE SINCE THE IMPACT FROM THE CRASH SHOULD HAVE CAUSED THEM TO DEPLOY. THE DEALER HAS NOT DIAGNOSED THE FAILURE. THE CURRENT AND FAILURE MILEAGE WAS 80,000.",
        "vin": "1FAFP40604F"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/27/2009",
        "dateOfIncident": "06/01/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10275107,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "A FEW WEEKS AGO, I HAD TO DRIVE ACROSS TOWN TO PICK UP MY SISTER FROM WORK (IRONICALLY, SHE WAS HAVING A CAR PROBLEM.) I STOPPED FOR AN ACCIDENT, AND I NOTICED THE HEADLIGHTS GETTING DIMMER AND DIMMER. I LOOKED AT THE BATTERY GAUGE AND SAW THAT THE CAR WAS DYING. SINCE I WAS IN THE MIDDLE LANE, I KIND OF OF PANICKED AND SHUT THE CAR OFF, FIGURING I COULD LET IT SIT WITHOUT RUNNING FOR A COUPLE OF MINUTES TO GIVE IT A CHANCE TO GET IT'S ACT TOGETHER. WHEN I SAW THE TRAFFIC BEGIN TO INCH FORWARD I TRIED TO TURN THE CAR BACK ON, BUT IT WOULDN'T BUDGE. I DIDN'T EVEN HEAR THE STARTER TURN. IT WAS COMPLETELY DEAD! I PUT ON MY BLINKERS, AND THOSE FIZZLED OUT WITHIN MINUTES, TOO.     SO  I WAS, STUCK ON THE MIDDLE LANE OF THE HIGHWAY WITH A DEAD BATTERY. I TRIED TO GET SOMEONE'S ATTENTION FOR HELP BUT PEOPLE JUST STARED AND INCHED FORWARD WITH THE REST OF THE TRAFFIC. THE RIGHT LANE AND MY LANE STARTED MOVING AT REGULAR SPEED SO NOW THERE WERE CARS AND SEMIS WHIZZING BEHIND AND PAST ME. FINALLY SOME GUY STEPPED OUT AND HELPED ME PUSH MY CAR TO THE EDGE OF THE ROAD. HE TRIED TO JUMP IT BUT IT STILL WOULDN'T START.     A COP PULLED UP AND HELPED ME JUMP THE CAR WITH SOME HEAVY DUTY CABLES. THIS WAS WEEKS AGO AND THE CAR HAS BEEN FINE SINCE. I HAD THE ALTERNATOR, BATTERY AND EVERYTHING ELSE CHECKED AT THE SHOP RIGHT AWAY AND NOTHING WAS WRONG. I'VE ALREADY HAD MY ALTERNATOR REPLACED TWICE SINCE I BOUGHT THE CAR TWO YEARS AGO, THE LAST TIME BEING IN FEBRUARY. SO  IT JUST GIVES OUT WHEN IT FEELS LIKE IT. I EVEN HAD THE BELT REPLACED A FEW MONTHS AGO, SO THAT'S NEW TOO. IT'S DOES THIS PERIODICALLY AND ONLY WHEN I'M DRIVING, AND NOBODY CAN FIGURE OUT WHY. *TR",
        "vin": "1FAFP44494F"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/19/2009",
        "dateOfIncident": "04/18/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10265983,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG GT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2004 MUSTANG WITH A 4.6 DOHC ENGINE. LAST NIGHT THE SPARK PLUG BLEW OUT OF THE HEAD. THE HEAD NOW NEEDS TO BE REPAIRED BY USING A HELICOIL OR SOMETHING SIMILAR. THIS IS A HUGE PROBLEM WITH THE FORD MODULAR ENGINES, CAUSED BY POOR DESIGN. AT LEAST 75% OF THE PEOPLE I KNOW WHO OWN FORDS WITH MODULAR ENGINES HAVE HAD THIS PROBLEM. *TR",
        "vin": "1FAFP42R64F"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "12/28/2008",
        "dateOfIncident": "12/25/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10252951,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "EAGLE LS",
                "productYear": "9999",
                "size": "P225/60R16",
                "type": "Tire"
            }
        ],
        "summary": "EAGLE LS BACK  SIDE RIGHT TIRE BLEW OUT SEPARATED FROM THREAD AROUND WHOLE TIRE 4 HOLES IN TIRE SPEED WAS 40MPH THANKS GOD NO RAIN DIDN'T RUN OVER ANYTHING THE THREAD SEPARATED FROM AROUND THE WHOLE TIRE WITH 4 HOLES NO WARNING TIRES IN GREAT SHAPE. *TR",
        "vin": "1FAFP40624F"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/14/2008",
        "dateOfIncident": "10/13/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10245444,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "EAGLE LS",
                "productYear": "9999",
                "size": "P225/60R16",
                "type": "Tire"
            }
        ],
        "summary": "1. FRONT DRIVER SIDE TIRE FLATTENED ON THE WAY TO WORK...I FILLED IT UP AND PROCEEDED TO WORK AND HAD HELP CHANGING TIRE IN PARKING LOT.    2. ALL 4 VALVE STEMS WERE LEAKING ON MY TIRES  3. REPLACED 2 BACK TIRES AND FIXED VALVES ON 2 FRONT TIRES. *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/23/2008",
        "dateOfIncident": "03/07/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10222080,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 FORD MUSTANG REAR BRAKE CALIPER/PISTON FAILURE. THE FAILURE RESULTED IN A NEAR FIRE ON THE RIGHT REAR OF THE VEHICLE. END RESULTS IN REPLACEMENT OF THE ROTOR, CALIPER, AND BRAKE PADS. THE LEFT REAR BRAKE SYSTEM WAS UNAFFECTED.  *TR",
        "vin": "1FAFP44444F"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/29/2008",
        "dateOfIncident": "01/28/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10219762,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG GT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON HIGHWAY AT 50 MPH AND HIT BLACK ICE AND LOST CONTROL.  KNOCKED DOWN A 6*6 INCH SIGN POST  .  CONTACT POINT WAS RIGHT FRONT BUMPER.  FRAME WAS BENT, MASSIVE FRONT END DAMAGE .  CAR WAS WRITTEN OFF.  NEITHER AIR BAG DEPLOYED. WHIPPING FORWARD ACTION CAUSED A BROKEN BACK.  SINGLE VEHICLE ACCIDENT AND LONE  OCCUPANT.  *TR",
        "vin": "1FAFP45X84F"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "01/04/2008",
        "dateOfIncident": "01/03/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10213686,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "EAGLE LS",
                "productYear": "9999",
                "size": "P225/60R16",
                "type": "Tire"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 FORD MUSTANG.  THE VEHICLE HAS GOODYEAR EAGLE LS, SIZE P225/55/R16 (NA) TIRES.  WHILE DRIVING APPROXIMATELY 55 MPH, THE SIDEWALL OF THE PASSENGER REAR TIRE BLEW OUT WITHOUT WARNING.  THE CONTACT PULLED OFF THE ROAD AND AAA REPLACED THE TIRE.  THE TIRE PRESSURE WAS NORMAL.  THE POWERTRAIN WAS UNKNOWN.  THE CURRENT AND FAILURE MILEAGES WERE 50,000.",
        "vin": "1FAFP40624F"
    },
    {
        "components": "PARKING BRAKE,POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "12/27/2007",
        "dateOfIncident": "12/12/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10213004,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS PARKED ON HILL WHILE IDLING WITH PARKING BRAKE ON, WHEN THE CAR ROLLED DOWN THE HILL, RESULTING IN OVER $5,000.00 IN DAMAGES. THE BREAK HANDLE WAS STILL IN THE UP POSITION.  *TR",
        "vin": "1FAFP42X94F"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "12/23/2007",
        "dateOfIncident": "10/24/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10212603,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG GT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWNED A 2004 MUSTANG, MACH I PKG, WITH A SHAKERHOOD/COBRA JET, POLICE INTERCEPTOR/ 5 SPEED: $40,000.00 VEHICLE. IT HYDROPLANED DURING A RAIN STORM HERE IN GEORGIA ON THE ABOVE DATE.  IT CAUSED ME TO GO DOWN A 26 FOOT RAVEEN AND I HIT A SEWER CAUSING MY VEHICLE TO GO INTO A VERTICAL POSITION STRIKING A TREE. SEAT BELTS WERE WORN.  I WAS NOT SPEEDING; THIS HAS BEEN PROVEN BY THE TOWING COMPANY.  WHEN AIR BORN IF YOU TURN THE KEY THE LAST MPH WILL APPEAR.  IT SHOWED 30MPH.  BESIDES, I WAS IN 2ND OR 3RD  GEAR WHICH RUNS MAX AT 30MPH/SPEED LIMIT POSTED 35MPH FOR THAT AREA.  I REMEMBER THE (R) REAR OF MY VEHICLE SLIP/SWING TO THE (R) CAUSING ME TO GO OFF THE ROAD AND DOWN THIS RAVEEN.  IT WAS TOTALED.  I NOW SUFFER FROM MANY INJURIES; YET, THE MOST SERIOUS INJURY IS A BRAIN INJURY.  MY BRAIN HAS SEPARATED FROM MY FRONTAL LOBE. I SPOKE TO MANY MUSTANG OWNERS AND THIS IS NOT THE FIRST TIME THAT A MUSTANG OWNER HAS ENCOUNTERED HYDROPLANING AND BECOMING INVOLVED IN A SEVERE TRAFFIC ACCIDENT.  I HAD MY TRACTION BUTTON ENGAGED AND STILL WHEN HITTING WET GRASS IT MADE NO DIFFERENCE.   I'M COMPLAINING AND CONCERNED. I INTEND TO TAKE THIS TO THE TOP IF NEEDED.  *TR",
        "vin": "1FAFP42R54F"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/05/2007",
        "dateOfIncident": "08/07/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10205063,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 FORD MUSTANG.  THE CONTACT STATED THAT THE TAIL PIPE WAS PROTRUDING TOO FAR FROM THE VEHICLE, WHICH CAUSED A MASSIVE INJURY TO HIS SON'S ARM.  THE TAIL PIPE IS CUT IN A 2.9 INCH EDGE INSTEAD OF BEING ROUNDED.  HE BELIEVED THAT IT SHOULD BE FURTHER BACK (APPROXIMATELY ONE INCH) TO AVOID INJURIES.    THE FAILURE MILEAGE WAS 12500 AND CURRENT MILEAGE WAS 15,600 UPDATED 01/11/08.  *LJ  UPDATED*JB",
        "vin": "1FAFP44664F"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "09/10/2007",
        "dateOfIncident": "09/09/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10202346,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT'S DAUGHTER OWNS A 2004 FORD MUSTANG COBRA.  WHILE DRIVING 25 MPH, THE CONTACT REMOVED HIS FOOT FROM THE ACCELERATOR PEDAL AND THE VEHICLE CONTINUED TO DRIVE FORWARD.  HE STATED THAT THE PEDAL WAS STUCK TO THE FLOOR.  THE VEHICLE DROVE OVER A CURB AND, CRASHED INTO A FENCE AND A POLE, AND THEN DROVE DOWN A SLIGHT EMBANKMENT.  THE CONTACT RECEIVED RECALL NOTICE NUMBER 06S43, WHICH COULD NOT BE IDENTIFIED.  THE CURRENT AND FAILURE MILEAGES WERE 65,000.",
        "vin": "1FAFP49Y74F"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/04/2007",
        "dateOfIncident": "07/25/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10198490,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG GT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING HIGHWAY SPEED 68 MPH WHEN A CAR CROSSED THE MEDIAN 30 FEET IN FRONT OF ME AND I HAD A TOTAL LOSS HEAD ON COLLISION WITH NO AIR BAG.....   IT FAILED TO OPEN ?  *JB",
        "vin": "1FAFP42X64F"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/11/2007",
        "dateOfIncident": "06/01/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10193214,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG GT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 FORD MUSTANG CUSTOMER BELIEVES THAT THE CAR IS A LEMON**CC  THE CONSUMER PURCHASED A USED VEHICLE AND THE DEALERSHIP FAILED TO DISCLOSE TO HIM THAT THE VEHICLE HAD PREVIOUSLY BEEN IN AN ACCIDENT. THE VEHICLE HAD MAJOR MECHANICAL PROBLEMS AS A RESULT OF THE ACCIDENT. *JB",
        "vin": "1FAFP42R64F"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/20/2007",
        "dateOfIncident": "03/19/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10185621,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING UNIT WAS EXCESSIVELY NOISY AND DISTRACTING... LOCKS UP ON HARD TURN.  DEALER SAYS NATURE OF THE BEAST, WON'T REPLACE IT. COMPLAINED 3 TIMES, CAR JUST WENT OUT OF WARRANTY... SEVERAL HUNDRED LOCAL POLICE CRUISERS HAVE HAD THEIR POWER STEERING REPLACED, BY DEALER AFTER \"NEGATIVE PUBLICITY ON TV...DEALERS ATTEMPT TO MAKE YOU OUT AS STUPID, AND KEEP OBFUSCATING TILL YOU JUST GO AWAY. *AK",
        "vin": "1FAFP40604F"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/18/2007",
        "dateOfIncident": "01/12/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10179074,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "FOLLOWING A FRONTAL ACCIDENT AT 40 MPH NEITHER FROM AIR BAG DEPLOYED FROM MY 2004 FORD MUSTANG, VIN [XXX].  *NM    UPDATED 07/11/2012 *JS    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6)",
        "vin": "1FAFP42R44F"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/27/2006",
        "dateOfIncident": "12/25/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10177142,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "A FEW DAYS PRIOR MY CAR MADE A SQUEALING NOISE WHEN I STOPPED. ON DEC 25, 2006 I WAS TRAVELING DOWN A RESIDENTIAL STREET WHEN MY AXLES SHIFT AND MY CAR TIRES LOCKED UP, IT WAS APPROXIMATELY 1/8 MILE FROM MY HOME. THE STEERING WHEEL WAS SHIFTED APPROXIMATELY 90 DEGREES.  *JB",
        "vin": "1FAFP42R94F"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "09/15/2006",
        "dateOfIncident": "09/12/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10168352,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG GT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 FORD MUSTANG GT CONVERTIBLE. FRONT RIGHT BRAKE FAILURE. WHILE DRIVING TO WORK AT 5:00 AM THE PAVEMENT WAS DAMP FROM RAIN I TRIED TO APPLY THE SERVICE BRAKES TO SLOW THE VEHICLE PRIOR TO EXITING FROM ONE FREEWAY TO THE OTHER. THERE WAS A LOUD NOISE FROM THE RIGHT FRONT AND A SCRAPING NOISE. I TRIED TO APPLY THE BRAKES AGAIN AND THE PEDAL WENT TO THE FLOOR. AS I WAS DRIVING AT FREEWAY SPEEDS, I DOWN SHIFTED INTO THE NEXT LOWER GEAR WHERE THE REAR OF THE CAR SPIN OUT AND ACROSS 4 LANES OF THE FREEWAY I WAS TRYING TO ENTER AND INTO THE MEDIAN STRIP.  AS AN AUTOMOTIVE ENGINEER I BEGAN THE INVESTIGATION AT THE SCENE. WHAT I FOUND WAS AS FOLLOWS: THE RETAINING BOLTS FOR THE BRAKE CALIPER FAILED CAUSING THE BRAKE CALIPER TO FALL OFF AND HANG BY THE FLEXIBLE BRAKE HOSE. ONCE THE BRAKE CALIPER WAS LOOSE, THE PISTONS WERE FORCED OUT OF THEIR BORE BY THE HYDRAULIC PRESSURE THEREFORE CAUSING THE PEDDLE TO GO TO THE FLOOR.  THE VEHICLE HAS ONLY 24622 MILES ON THE ODOMETER AND HAS NOT HAD BRAKE SERVICE HOWEVER THE CALIPERS WERE SPRAY PAINTED (NOT REMOVED) BLACK TO PREVENT CORROSION AND FAILURE DUE TO BEING STORED OUTSIDE DURING THE WINTERS. BECAUSE THE CALIPERS HAVE BEEN PAINTED THE SERVICE MANAGER HAS REFUSED TO REPAIR AS HE FEELS THE BRAKES HAVE BEEN TAMPERED WITH.  I RESEARCHED THE ISSUE FURTHER AND FOUND THAT THE BOLTS AND CALIPER ASSEMBLY ARE INVERTED DELTA SAFETY RELATED COMPONENTS AND THE BOLTS SHOULD HAVE LOCK PATCH (THREAD LOCKING) TO PREVENT THEM FROM BACKING OUT.  I ALSO LEARNED FROM SOURCES WITHIN FORD THAT THIS HAS BEEN AN ISSUE ACROSS THE VEHICLE OFFERINGS FROM FORD AS THERE WERE COST REDUCTIONS THAT MODIFIED THE PARTS AND THE SUPPLIER FOR THE COMPONENTS CHANGED. THE VEHICLE IS IN STORAGE RIGHT NOW AND AVAILABLE FOR YOUR REVIEW.  *JB",
        "vin": "1FAFP45XX4F"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/26/2006",
        "dateOfIncident": "06/08/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10160785,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "EAGLE",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THERE WERE TWO SEPARATE BLOWOUTS ON SAME TYPE OF TIRE WHILE DRIVING AT 80 AND 50 MPH. THE WEATHER CONDITIONS WERE DRY AND NO DEBRIS WAS ON THE ROAD. THERE WERE NO REPORTS FILED OR PICTURES TAKEN.  UPDATED 7/25/2006 - GOODYEAR EAGLE ZR TIRES.  *NM",
        "vin": "1FAFP42R54F"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/18/2006",
        "dateOfIncident": "04/16/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10155565,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT IMPACT 35-40 MPH AIRBAGS NEVER DEPLOYED. *JB",
        "vin": "1FAFP45X44F"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/01/2006",
        "dateOfIncident": "02/20/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10151578,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MY ACCELERATOR PEDAL GOT STUCK UNDER MY CARPET AND ALMOST CAUSED ME TO WRECK!!  *NM",
        "vin": ""
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/13/2006",
        "dateOfIncident": "10/23/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10150189,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I BROUGHT THIS CAR ON 07/07/04. AT THREE MONTHS THAT I BROUGHT THE CAR I NOTICE THAT THE CAR WASN'T DRIVING RIGHT THE CAR DOESN'T STAY STRAIGHT ON THE ROAD. I GOES SIDEWAYS AS I DRIVE. I TRIED TO FIX THE CAR MANY TIMES AND IT STILL DRIVES THE SAME WAY. ALSO THE HOOD IS NOT PUT ON PROPERLY.  I WANT TO CANCEL THE PURCHASE OF THIS CAR. IS GIVING ME TO MANY PROBLEMS AND IT IS JUST COSTING ME MORE MONEY.  *NM",
        "vin": "1FAFP40654F"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/22/2006",
        "dateOfIncident": "11/07/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10148327,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "ANTI-LOCKING BRAKING SYSTEM (ABS) AND TRACTION CONTROL FAILED. THE SERVICE LIGHT WENT ON AND I IMMEDIATELY TOOK THE CAR IN FOR REPAIR. THE FIRST REPAIR TOOK PLACE BETWEEN NOV. 11, 2005 AND NOV. 18, 2005. THE SAME PROBLEM OCCURRED IN DECEMBER 2005. THE SECOND REPAIR TOOK PLACE BETWEEN DEC. 21, 2005 AND DEC. 30, 2005. THE SAME SYSTEMS FAILED A THIRD TIME. (JAN. 21, 2006) I AM IN THE PROCESS OF MAKING ANOTHER APPOINTMENT. ON THE FIRST REPAIR, THEY REPLACED PART # FMC 2R3Z 2C219 CA (CONTROL) ALSO FMC 2R3Z 2C219 CA (CORE CHG) DURING THE NEXT REPAIR THEY REPLACED PART # FMC F7ZZ  2C204 AB (SENSOR ASY). DURING THESE REPAIRS, THE DOWN TIME ON MY VEHICLE HAS BEEN A TOTAL OF 4 DAYS AND COUNTING. THE LAST INCIDENT ON JAN. 21, 2006 WAS FRIGHTENING. THE ABS SYSTEM WAS ENGAGING DURING NORMAL BRAKING. (STOPPING AT A LIGHT) I COULD FEEL THE SYSTEM TURNING ON AND OFF. I FELT AS IF THE CAR MIGHT NOT STOP. I TURNED AROUND AND WENT HOME. I FEEL THE CAR IS NOT SAFE TO DRIVE. I DO NOT HAVE ANY OF THE ORIGINAL PARTS FOR INSPECTION.  *NM",
        "vin": "1FAFP42X44F"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/19/2006",
        "dateOfIncident": "01/17/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10148149,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "IN THE MORNING, AFTER DRIVING MY CAR APPROXIMATELY 10 MINUTES, (BEFORE ENTERING THE FREEWAY ON RAMP) THE ENGINE JUST SHUT OFF.  I WAS ABLE TO TURN THE KEY TO THE OFF POSITION, AND WHILE STILL MOVING (IN SECOND OR THIRD GEAR) I WAS ABLE TO RESTART THE CAR ON THE FIRST ATTEMPT.  I DID USE THE VEHICLE MID-DAY WITHOUT ANY MISHAPS.  LATER THAT EVENING AFTER DRIVING HOME APPROXIMATELY 40 MINUTES, (AFTER EXITING THE FREEWAY) THE ENGINE SHUT OFF AGAIN (WHILE IN THIRD GEAR).  I WAS ABLE TO AGAIN TURN THE KEY TO THE OFF POSITION, AND WHILE IN MOTION I WAS ABLE TO RESTART THE CAR ON THE FIRST ATTEMPT.  ON THE DRIVE HOME THAT EVENING AND THE NEXT MORNING THERE WERE NO FURTHER MISHAPS.  I CONTACTED THE FORD DEALER THAT EVENING, AND WAS ADVISED TO BRING IN THE CAR THE NEXT MORNING.  I WAS NOT ADVISED TO HAVE IT TOWED OR THAT IT WOULD BE UNSAFE TO OPERATE.  THE MECHANICS DROVE THE VEHICLE FOR 12 MILES, AND WERE UNABLE TO DUPLICATE THE MOTOR TURNING OFF.  THEY ADVISED ME THAT THEY HAD THOROUGHLY CHECKED THE CAR, BUT WERE UNABLE TO FIND ANYTHING WRONG, AND THE CAR WAS READY TO BE PICKED UP.  I WAS EXPRESSED MY CONCERN REPEATEDLY ABOUT DRIVING EVERYDAY ON THE FREEWAY TO THEIR REPRESENTATIVE, BUT WAS OFFERED NO EXPLANATION AS TO WHY THE ENGINE JUST TURNED OFF.  AT THIS POINT I CONTINUE TO BE CONCERNED ABOUT THE SAFETY OF DRIVING THIS VEHICLE.  *JB",
        "vin": "1FAFP40654F"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/09/2006",
        "dateOfIncident": "06/01/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10147210,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "POPPING/ METALLIC SOUND SIMILAR TO SOUND WHEN CRUNCHING A SODA CAN, A METALLIC POPPING SOUND FROM PASSENGER FLOOR BOARD AREA.  DOES IT UNDER VARIOUS CONDITIONS, AND ONCE DID IT WHEN JUST GETTING INTO VEHICLE BEFORE STARTING, SEEMS TO BE LOAD RELATED AND SOME SORT OF STRESS RELIEF, BODY MOVEMENT SEEMS TO CAUSE IT. WAS CONFIRMED ON TEST DRIVE WITH A TECHNICIAN. THEY ATTEMPTED TO TIGHTEN FRONT SUSPENSION PARTS (TOURQUED ??) TRIED A POWER STEERING/RACK TSB WITH SOME SORT OF BRACKET ON RACK HOSES..... NO CHANGE, EXACT SAME NOISE, EVEN THOUGH FORD DOES NOT KNOW WHAT IT IS, THEY CLAIM IT IS NOT SAFETY RELATED.....  POP CONTINUES  .... VALUE OF CAR CONSIDERABLE LESSENED DUE TO NOISE ... SO ATTEMPTS TO SELL IT ARE IN VAIN...   FORD HAS NOTHING BUT EXCUSES. *JB",
        "vin": "1FAFP40684F"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "01/07/2006",
        "dateOfIncident": "07/06/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10147162,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "LOOSE CARPETING HANGING DOWN FROM ACCELERATOR PEDAL CAUSES SHOE TO GET STUCK AND COME OFF FORCING ACCELERATOR TO FLOOR, CAUSED CRASH INTO STRUCTURE.  *NM",
        "vin": "1FAFP42X54F"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/06/2005",
        "dateOfIncident": "12/06/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10144570,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN ACCELERATING AT FULL THROTTLE ACCELERATOR PEDAL GETS STUCK. THIS CAN BE A BIG PROBLEM SINCE SEVERE ENGINE DAMAGE DUE TO EXCESSIVE ENGINE RPM'S CAN OCCUR AND CAN CAUSE COLLISION DUE TO CAR ACCELERATING UNCONTROLLABLY. THE ONLY WAY TO CONTROL THIS WAS SHUTTING OFF THE IGNITION BUT THAT IN ITSELF CAN BE A DANGER SINCE SHUTTING OFF THE IGNITION CAUSES LOSS OF POWER STEERING AND HYDRAULIC BRAKES WHICH CAN MAKE THE VEHICLE EXTREMELY DIFFICULT TO STEER AND BRAKE, POTENTIALLY CAUSING AN ACCIDENT.  *JB",
        "vin": "1FAFP48Y64F"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "12/06/2005",
        "dateOfIncident": "11/01/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10145381,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 FORD GT MUSTANG WOULD NOT START AFTER SHORT TRIPS OR AFTER IT HAD BEEN SITTING FOR AN EXTENDED PERIOD OF TIME.  *TS ***NO ANSWER REQUIRED***  THE VEHICLE WOULD ALSO SUDDENLY STALL WHILE BEING DRIVEN.  AFTER THE VEHICLE SAT FOR ABOUT 10-15 MIN IT COULD BE RESTARTED.  THE VEHICLE WAS TAKEN TO THE DEALER WHO INDICATED THE PROBLEM WAS WITH THE ANTI THEFT DEVICE.  AFTER  THAT REPAIR THE VEHICLE CONTINUED TO EXPERIENCE PROBLEMS.  THE VEHICLE WAS TAKEN BACK TO THE DEALER BUT SINCE THEY WERE UNABLE TO DUPLICATE THE PROBLEM THEY DIDN'T FIX ANYTHING.  *NM",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "11/30/2005",
        "dateOfIncident": "01/29/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10144011,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THE CONTACT STATES THE CRUISE CONTROL CAN BE SET BY PRESSING THE COAST BUTTON, AS WELL AS THE SET BUTTON.  THE COAST BUTTON IS LOCATED ON THE STEERING WHEEL WHERE  THE CONTACT  HAND RESTS WHILE DRIVING.  HE FOUND THIS AFTER  WIFE WAS IN AN ACCIDENT.  THE VEHICLE WOULD NOT SLOW DOWN WITH HER FOOT OFF OF BOTH THE BRAKE AND ACCELERATOR PEDALS.  THE CONTACT'S VEHICLE REAR ENDED ANOTHER  VEHICLE, AND A POLICE REPORT WAS TAKEN.  THE VEHICLE WAS TAKEN TO THE DEALERSHIP, ONCE HE FOUND THE CRUISE CONTROL ACTIVATED, AND THIS WAS  HOW THE VEHICLE  WAS MANUFACTURED.  *AK     UPDATE 1/4/2006 - *NM",
        "vin": "1FAFP45X54F"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/02/2005",
        "dateOfIncident": "11/02/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10141590,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I DOWN SHIFTED MY CAR AND FLOORED THE GAS PEDAL AND THE PEDAL CAUGHT ON THE CARPET.  I COULD NOT GET IT TO RELEASE AND HAD TO SHUT OFF THE IGNITION ON THE FREEWAY, PULLED OVER, AND PARK THE CAR TO FIX THE PROBLEM.  SPEED OF 100+MPH WAS REACHED.  *JB",
        "vin": "1FAFP49Y64F"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/29/2005",
        "dateOfIncident": "10/07/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10141209,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS PROCEEDING THROUGH INTERSECTION ON A LEFT HAND TURN LANE DRIVING IN THE WRONG GEAR FOR THE SPEED AT WHICH I WAS GOING(20 MPH), I DOWN SHIFTED INTO SECOND GEAR AND THE GAS PEDAL WAS STUCK TO THE FLOOR FOR A HALF A BLOCK HEADING TOWARDS THE NEXT INTERSECTION THAT HAD A RED LIGHT FOR ME. I COULDN'T STOP THE CAR SO I TURNED THE KEY OFF. AFTER LOOKING AT THE PEDAL I NOTICED THE CARPET DOESN'T FIT RIGHT LIKE IT'S SHORT AND MY GAS PEDAL ARM IS EXTREMELY WEAK AND BENDS TOWARDS THE TRANSMISSION SCRAPING THE CARPET THROUGH THE RANGE OF UP/DOWN MOTION. I THINK THE CARPET IS HALF THE PROBLEM THE OTHER HALF IS THE GAS PEDAL ARM. THE RIGHT SIDE OF THE  GAS PEDAL RUBS THE CARPET. I PULL THE PEDAL OFF OF THE CARPET EVERY SO OFTEN WITHIN DAYS THE PEDAL IS RUBBING IT AGAIN. *JB",
        "vin": "1FAFP48YX4F"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/29/2005",
        "dateOfIncident": "07/12/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10141210,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS PEDAL GOT STUCK UNDER CARPET.  I WAS PASSING SOMEONE AND THE GAS PEDAL GOT STUCK.  I NEARLY WRECKED, BUT WAS ABLE TO PULL OVER.  FOUND THE PROBLEM , HAD TO CUT THE CARPET SO IT WOULDN'T HAPPEN AGAIN. IT IS APPALLING THAT A POORLY DESIGNED CARPET COULD CAUSE POTENTIAL DEATHS.  FIX THIS!*JB",
        "vin": "1FAFP49YX4F"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/20/2005",
        "dateOfIncident": "10/17/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10140294,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING ON OPEN FREEWAY AT APPROXIMATELY 7:30PM ON 10/17/05 WHEN DRIVER HEARD LOUD \"POP\". SHORTLY AFTERWARD, DRIVERS VISION WAS OBSCURED THROUGH BACK WINDOW ON THE FORD MUSTANG CONVERTIBLE. WHEN DRIVER ARRIVED HOME HE NOTICED THAT THE REAR WINDOW WAS COMPLETELY SHATTERED AND THERE WAS NO EVIDENCE OF ANY OBJECT STRIKING THE VEHICLE. DRIVER TOOK VEHICLE TO FORD DEALERSHIP FOR REPAIRS AND WAS TOLD THAT FORD DID NOT CONSIDER IT A DEFECTIVE PART. WHEN DRIVER NOTIFIED HIS INSURANCE CARRIER, HE WAS INFORMED THAT THEIR GLASS INSTALLER WAS AWARE OF THE SPONTANEOUS REAR WINDOW EXPLOSIONS OCCURRING IN THE 2002-2004 MODEL YEAR OF MUSTANGS. DRIVER IS HAVING DEALER REPLACE THE DEFECTIVE EQUIPMENT AND REPLACED PARTS WILL NOT BE AVAILABLE.  *JB",
        "vin": "1FAFP45X54F"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/19/2005",
        "dateOfIncident": "10/13/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10140244,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DAUGHTER WAS DRIVING MY 2004 FORD MUSTANG , WHEN LIGHT TURNED GREEN UPON ACCELERATION THE GAS PEDAL STUCK( BECAUSE OF CARPET) CAUSING HER TO LOOSE CONTROL OF THE CAR AS SHE WAS MAKING A LEFT TURN ON WET PAVEMENT .  SHE HIT ANOTHER VEHICLE TOTALING THE CAR AND SHE WAS ALSO HURT WHEN HER FACE HIT STEERING WHEEL BECAUSE AIRBAG DID NOT DEPLOY.  *NM",
        "vin": "1FAFP40634F"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/29/2005",
        "dateOfIncident": "08/26/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10134887,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THE CALLER'S  SON PULLED INTO A GAS STATION WHEN BOTH FRONT AIR BAGS DEPLOYED. HE WAS GOING ABOUT 2 MPH, AND HE DID NOT HIT ANYTHING. AIR BAGS DEPLOYED WITHOUT WARNING. DEALER CUT THE AIRBAG OUT OF THE STEERING WHEEL, AND THEY PUT THE PASSENGER'S  SIDE AIR BAG BACK IN. THE DIAGNOSTIC SAID THERE WAS NOTHING WRONG WITH THE VEHICLE. CALLER WAS TOLD THAT THERE WERE SCRAPES ON THE BOTTOM OF THE VEHICLE AND THAT MIGHT HAVE CAUSED THE AIR BAGS TO DEPLOY. THIS WILL NOT BE COVERED BY THE WARRANTY. THE CALLER SAID THE VEHICLE HAS NOT BEEN IN ANY ACCIDENTS. MANUFACTURER SIDED WITH DEALER AND SAID SHE WILL HAVE TO PAY FOR REPAIRS.*AK  *NM",
        "vin": "1FAFP42X94F"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "09/28/2005",
        "dateOfIncident": "09/22/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10138010,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  2004 FORD MUSTANG.  THE CONSUMER  STATED THAT  WHILE TRAVELING 15-20 MPH THE BRAKES DID NOT LET GO, THE ROAD WAS WET.    THIS HAPPENED ON SEPTEMBER 22,2005.  VEHICLE  HIT A CURVE, NO ONE WAS INJURED.  THE CONSUMER  STATED THIS HAS HAPPENED A COUPLE  OF TIMES BEFORE.  THE CONSUMER  TOOK VEHICLE TO DEALER,AND  VEHICLE IS   CURRENTLY IN REPAIR SHOP BEING FIXED.  DEALER TOLD THE CONSUMER  THEY WERE WAITING TO HEAR BACK FROM FORD.  THEY COULD NOT DO ANYTHING UNTIL FORD  CALLED THE DEALERSHIP BACK.  THERE WAS PROPERTY DAMAGE TO VEHICLE, INCLUDING  RIMS, FRONT BUMPER,  AND ALIGNMENT. *AK",
        "vin": "1FAFP40624F"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/01/2005",
        "dateOfIncident": "08/19/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10135106,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE ACCELERATING MY GAS PEDAL GOT STUCK UNDER MY CARPET AND MY ENGINE RPM'S SHOT UP AND MY ENGINE ALMOST BLEW BECAUSE I COULDN'T GET MY GAS PEDAL UNSTUCK, I FINALLY  HAD TO CUT MY ENGINE OFF SO MY ENGINE WOULDN'T BLOW;I WAS FORTUNATE THAT THE FREEWAY WAS CLEAR AND NO CARS IN FRONT OF ME.  *NM",
        "vin": "1FAFP48Y34F"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/30/2005",
        "dateOfIncident": "06/08/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10134761,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 MUSTANG -  I HAD JUST PURCHASED MY MUSTANG  THE ACCELERATOR PEDAL STUCK CAUSING INABILITY TO CONTROL MY SPEED ON THE HIGHWAY, RESULTING IN A TICKET . THE NEXT TIME THE ACCELERATOR  PEDAL STUCK  WAS ON CITY STREETS .TOOK CAR TO FORD DEALERSHIP FOR INSPECTION.  *NM",
        "vin": "1FAFP44604F"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/30/2005",
        "dateOfIncident": "08/28/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10134847,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY 2004 MUSTANG COBRA, THE GAS PEDAL BECAME STUCK AT WIDE OPEN THROTTLE.  I SHIFTED THE CAR INTO NEUTRAL AND IT BOUNCED OFF THE REDLINE FOR ABOUT 3 SECONDS BEFORE I TURNED THE CAR OFF.  I NEARLY GOT INTO AN ACCIDENT TRYING TO STOP THE CAR.  I FOUND THE GAS PEDAL TO BE STUCK AGAINST THE UNDERSIDE OF THE EDGE OF THE FLOORS CARPET.  NOW I DON'T KNOW IF SOMETHING IS BROKEN ON MY CAR.  IT HAS LESS THAN 5,000 MILES ON IT AND IS JUST OVER A YEAR OLD.  SOMEONE IS GOING TO GET KILLED FROM THIS, AND IT IS DEFINITELY A DESIGN FLAW WITH THE CAR AS I KNOW FROM INTERNET FORUMS IT HAS HAPPENED TO MANY PEOPLE.  *JB",
        "vin": "1FAFP48Y94F"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "08/22/2005",
        "dateOfIncident": "09/20/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10133704,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE OWNER WAS GOING TO LEAVE DRIVEWAY IT TOOK THREE TIMES TO GO INTO GEAR. THEN, WHEN IT WENT INTO GEAR, IT WENT ABOUT 10-20 FEET BY ITSELF AND CRASHED INTO THE OWNER'S HOUSE. THE OWNER NEVER HAD  FOOT ON THE GAS PEDAL. THE OWNER HAD FOOT ON THE BRAKES THE WHOLE TIME. THE OWNER SUSTAINED SHOULDER INJURY. HAD ABOUT $400  IN HOME REPAIRS, ABOUT $6000 IN CAR REPAIR, AND DOCTOR BILLS AS A RESULT OF ACCIDENT. THE OWNER CALLED FORD,  WHO SAID IT MUST BE AN UNUSUAL ACCIDENT, AND THEY HAD NEVER HEARD OF THIS PROBLEM. *AK",
        "vin": "1FAFP40464F"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "08/18/2005",
        "dateOfIncident": "03/11/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10133379,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PROBLEMS I AM HAVING WITH MY 2004 MUSTANG COBRA IS THE GAS PEDAL GETTING STUCK UNDER THE CARPET AND UNDER THE REMOVABLE FLOOR MAT AT WOT AND AN ANNOYING VIBRATION AT HIGHER HIGHWAY SPEEDS.  NOTHING SCARIER THAN HAVING YOUR CAR CONTINUE TO ACCELERATE AFTER YOU GET OFF THE GAS AND THE TRAFFIC AHEAD IS STOPPED AND YOU ARE APPROACHING TRIPLE DIGIT SPEEDS.  I HAVE HAD TO DEPRESS THE CLUTCH AND PUT THE TRANSMISSION INTO NEUTRAL, WHILE LETTING THE MOTOR OVER REV AND HIT THE REV-LIMITER, UNTIL I CAN DISLODGE THE PEDAL.  THIS A VERY DANGEROUS SITUATION ON SUCH A HIGH PERFORMANCE VEHICLE MAKING WELL OVER 400 RWHP.  THE OTHER PROBLEM IS A CONTINUED VIBRATION I HAVE SINCE THE TRANSMISSION WAS REPLACED.  AT SPEEDS NEAR 80 MPH THE VIBRATION BEGINS AND WILL GET PROGRESSIVELY WORSE, SOUNDING LIKE THE REAR GLASS IS GOING TO VIBRATE OUT OF THE CAR.  THE DEALER HAS REPLACED THE DRIVESHAFT, BUT I SUSPECT THE PINION ANGLE IS INCORRECT AND CAUSING A BINDING CONDITION IN THE REAR END, WHICH CAN LEAD TO PREMATURE BEARING FAILURE IN THE REAR END.  *NM",
        "vin": "1FAFP48YX4F"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/13/2005",
        "dateOfIncident": "08/07/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10132714,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "1) WE PURCHASED A 2004 FORD MUSTANG CONVERTIBLE. THE VEHICLE WAS PARKED IN OUR GARAGE.  THE EXHAUST TAIL PIPE HAS A POOR DESIGN DUE TO THE DESIGN CUT ON THE END WHICH LEAVES TWO SHARP POINTED EDGES LIKE THE END OF KNIVES.  THE POINTS ARE LOCATED APPROXIMATELY 1 INCH PAST THE BUMPER.  ALL OTHER VEHICLES WE HAVE SEEN HAVE ROUNDING TAIL PIPE ENDS AND THE ENDS ARE FLUSH WITH THE BUMPER OR UNDER THE VEHICLE.  2) THE FAILURE OF THE DESIGN OF THE EXHAUST TAIL PIPE  WITH THE SHARP RAZOR CUTS LEAVING TWO POINTED KNIFE LIKE ENDS AND PLACED PAST THE BUMPER IN THE MANUFACTURING PROCESS RESULTED IN MY THREE YEAR OLD HAVING A MASSIVE UPPER ARM INJURY REQUIRING SURGERY AFTER FALLING BEHIND THE 2004 FORD MUSTANG.  AS HE FELL HIS RIGHT SHOULDER SLID DOWN PAST THE BUMPER AND THE POINTED SHARP EDGE STICKING PAST THE END OF THE BUMPER TORE INTO HIS ARM ABOVE THE ELBOW TO THE VERY TOP OF HIS SHOULDER.  THE INJURY REQUIRED MANY HOURS OF SURGERY AND WE HOPE NO OTHER CHILD WILL HAVE TO GO THROUGH THIS MEANINGLESS DESIGN FLAW BY FORD MOTOR COMPANY AND THEIR OEM MANUFACTURE 3) WE HAVE TRIED TO CORRECT THE PROBLEM BY ASKING THE FORD DEALER FOR ASSISTANCE WHICH WAS REFUSED AND REPORTED THE INJURY TO FORD EXECUTIVE OFFICES IN MICHIGAN.  DUE TO NON-RESPONSE BY FORD WE HAVE PLACED A NORMAL SAFE ROUNDED TAIL PIPE EXTENSION ON THE VEHICLE.  THE ROUNDING TAIL PIPE IS USED IN ALL OTHER VEHICLES THAT WE HAVE SEEN.  THE EXHAUST TAIL PIPE HAS NOT BEEN RECALLED AT THIS TIME ON THE FORD MUSTANGS FOR 2004 AND 2005 WHICH ARE THE SAME DESIGN AND PLACEMENT. *JB",
        "vin": "1FAFP44664F"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/12/2005",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10133417,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER INQUIRY REGARDING RECALLS OR DEFECTS RELATING TO THE 2004 FORD MUSTANG.  *MR  *NM",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/04/2005",
        "dateOfIncident": "08/04/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131595,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2004 MUSTANG COBRA AND THE GAS PEDAL GOT STUCK WHILE I WAS ON THE FREEWAY. I HAD TO PUT THE CAR IN NEUTRAL AND SHUT OFF THE CAR. I ALMOST GOT IN AN EXTREMELY SEVERE CAR ACCIDENT AND THINK THAT FORD SHOULD HAVE A CLASS ACTION LAW SUIT FILED AGAINST THEM OR THERE SHOULD BE A RECALL ON THIS PROBLEM. EVIDENTLY THERE ARE MANY OTHERS THAT HAVE EXPERIENCED THE SAME PROBLEM.  *JB",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/01/2005",
        "dateOfIncident": "07/30/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10130881,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE READ ABOUT THIS ISSUE FROM OTHER 2003/2004 COBRA OWNERS AND DID NOT THINK IT WAS A PROBLEM FOR ME AFTER INSPECTING MY CAR.  HOWEVER, ON JULY 30, 2005 I EXPERIENCED AN ISSUE WHERE THE ACCELERATOR WAS STUCK ON THE FLOOR AT FULL THROTTLE.  THIS HAPPENED ON A CITY STREET AND COULD HAVE CAUSED A SERIOUS ISSUE IF I DID NOT HAVE A LARGE OPEN SPACE TO PULL OFF.  I WAS FORCED TO KILL THE IGNITION AND STOP THE CAR.  AS I AM SURE YOU KNOW WHEN DOING THIS YOU LOSE ALL POWER STEERING AND BRAKING SO IT IS NOT A SAFE OR EASY TASK TO BRING THE VEHICLE TO A STOP.  IN ORDER TO RESOLVE THE ISSUE IT REQUIRED ME REACHING DOWN AND YANKING UP ON THE PEDAL WITH CONSIDERABLE FORCE TO REMOVE IT FROM THE CARPET WHERE IT WAS EMBEDDED.  WHILE MOST ISSUES WITH CARS CAN BE OVER LOOKED THIS IS POSSIBLY A VERY BAD ACCIDENT WAITING TO HAPPEN.  *NM",
        "vin": "1FAFP48Y04F"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN,TIRES",
        "crash": false,
        "dateComplaintFiled": "07/28/2005",
        "dateOfIncident": "03/14/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10130407,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE CONSUMER STATES THAT  2004 FORD MUSTANG WAS HAVING MECHANICAL PROBLEMS. THE TRANSMISSION FLUID WAS GUSHING OUT AND THE VEHICLE WAS TAKEN TO A DEALERSHIP FOR REPAIRS. THE DEALERSHIP FIXED THE TRANSMISSION FLUID PROBLEM.  THE NEXT PROBLEM WAS  OIL LEAKING. THE VEHICLE HAS BEEN IN THE DEALERSHIP TWICE FOR REPAIRS AND IT WAS STILL LEAKING OIL. THE OWNER CONTACTED FORD  FOR HELP. FORD HAD THE CAR TAKEN TO THE DEALERSHIP THAT FORD RECOMMENDED.  THE PROBLEM IS STILL NOT FIXED. THE DEALERSHIP SAYS THAT THE OIL IS LEAKING FROM THE ENGINE. THE TRANSMISSION HAD TO HAVE A SEAL REPLACE A LINE, AND THE ENGINE IS STILL LEAKING. THE OWNER SAYS THAT HE CAN NOT DRIVE THE DRIVE BECAUSE IT WILL BLOW UP THE ENGINE. THE OWNER REFUSED TO DRIVE THE CAR WHEN HE FOUND ALL THESE PROBLEMS, SO HE DIDN'T BURN THE CAR UP. THERE HAVE BEEN TWO DIFFERENT DEALERSHIPS THAT HAVE WORKED ON THE CAR. THE OWNER SAID THAT THE DEALERS HAD CLAIMED TO FIX THE CAR, BUT DID  NOT FIX IT. THE CAR ALSO HAS HAD A TIRE PROBLEM THAT THE OWNER HAD TO REPLACE. THE DEALERSHIP SAID THAT IT WAS WEAR AND TEAR. THE CAR HAS LESS THAN 800 MILES ON IT.  *AK",
        "vin": "1FAFP40644F"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/27/2005",
        "dateOfIncident": "04/07/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10130360,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MY GAS PEDAL HAS GOTTEN STUCK DURING WIRDE OPEN THROTTLE ON MY 2004 MUSTANG SVT COBRA.  THE DEALER TRIED TO ADJUST THE GAS PEDAL, BUT THE ISSUE OCCURED AGAIN ON SEVERAL OCCASSIONS.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/24/2005",
        "dateOfIncident": "05/01/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10129831,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY 2004 SVT COBRA, I WAS IN A 55MPH ZONE AND WENT TO PASS A GUY.  MY ACCELERATOR GOT STUCK ON THE CARPET AND WOULD NOT COME UP, I WAS FORCED TO SHUT THE CAR DOWN AND PULL OFF TO THE SIDE TO FIGURE OUT WHAT WAS WRONG.  THIS HAS HAPPENED ON 3-4 OCCASIONS WHILE I REVVED MY ENGINE ALSO, I HAVE SINCE CUT THE CARPET ALL AROUND THE GAS PEDAL SO IT WILL NO LONGER STICK.  MIKE ZILINSKI",
        "vin": "1FAFP48Y14F"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/22/2005",
        "dateOfIncident": "11/04/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10129775,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE ACCELERATOR GOT STUCK, I APPLIED THE BRAKES WHEN THE CAR SPEND OUT OF CONTROL AND HIT THE CURVE, THE ACCELERATOR WAS RUNNING WHEN I TURNED THE CAR OFF.  THIS CAUSE THE UPPER AND LOWER CONTROLS TO BREAK ALONG WITH THE DIFFERENTIAL AND BRAKES.",
        "vin": "1FAFP42X94F"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/20/2005",
        "dateOfIncident": "08/20/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10129399,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2004 MUSTANG COBRA.  MONTHS AFTER PURCHASING THE CAR, TWICE I HAD THE CARPET NEAR THE GAS PEDDLE INTERFERE WITH THE OPERATION OF THE GAS PEDDLE.  ONCE IT DID NOT ALLOW THE GAS PEDDLE TO RETURN TO ITS NORMAL POSITION WHEN MY FOOT WAS REMOVED.  THE SECOND TIME THE CARPET FOUND ITS WAY UNDER THE GAS PEDDLE AND DID NOT ALLOW FOR PROPER USE OF THE GAS PEDDLE UNTIL THE CARPET WAS REMOVED TO ITS NORMAL POSITION.  CAUSE SEEMS TO BE THAT THE CARPET DOES NOT STAY ATTACHED TO THE TABS THAT ARE TO HOLD IT IN PLACE.",
        "vin": "1FAFP48Y44F"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "07/19/2005",
        "dateOfIncident": "03/01/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10129341,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE HAD NUMEROUS INSTANCES OF THE GAS PEDAL STICKING AND HAVING A PROBLEM WITH VIBRATION. MY 2004 FORD MUSTANG GT ALSO HAS PROBLEMS WITH TURNING OVER WHEN WARM. THE CAR HAS TO BE CRANKED MANY TIMES BEFORE IT WILL START. HAVE HAD THE INTO THE FORD DEALER OVER 5 TIMES FOR THE SAME PROBLEMS WITH NO RESOLUTION.",
        "vin": "1FAFP45X04F"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/18/2005",
        "dateOfIncident": "07/11/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10129056,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE CARPET  ABOVE THE GAS PEDAL  GETS CAUGHT IN THE GAS PEDAL. IT FOLDS BACK TOWARD THE GAS PEDAL. HE IS GOING TO CALL A DEALER TO SEE IF THEY WILL CORRECT THE PROBLEM. HIS CAR IS STILL UNDER WARRANTY. *AK",
        "vin": "1FAFP40654F"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/18/2005",
        "dateOfIncident": "07/17/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10129218,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS PEDAL STUCK WITH THROTTLE OPEN. CARPET (NOT THE FLOOR MAT, BUT THE CARPET) HAD COME UNHOOKED FROM ITS HOLD DOWN SYSTEM AND WAS JAMMED UNDER THE THROTTLE KEEPING IT OPEN.",
        "vin": "1FAFP48Y44F"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/17/2005",
        "dateOfIncident": "06/01/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10129012,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "COMPLAINT ON MY 2004 FORD MUSTANG GT (ORGINAL OWNER OF BOTH). VEHICLE HAS PROBLEMS RELATING TO THE POSITION OF THE CARPET AROUND THE ACCELERATOR PEDAL. AFTER MINIMAL USE OF THE VEHICLE (5000 MILES OR AROUND 3-5 MONTHS OF USE) A LARGE HOLE DEVELOPED ON THE RIGHT SIDE OF THE ACCELERATOR PEDAL. IF THE  ACCELERATOR IS DEPRESSED FULLY OR ALMOST FULLY THE SIDE OF YOUR SHOE CAN CATCH ON THE HOLE LONG ENOUGH TO POSE A SAFTEY HAZARD OF NOT BEING ABLE TO TAKE YOUR FOOT IMMEADATLY OFF THE ACCELERATOR PEDAL. I HAVE HAD THIS HAPPEN ON SEVERAL OCCASIONS, AND HAVE TO BE VERY CONCIOUS OF MY FOOT POSITION ON THE ACCELERATOR PEDAL WHEN DRIVING TO PREVENT THIS PROBLEM NOW THAT I AM AWARE OF IT. FORD DEEMS THIS PROBLEM AS NORMAL WEAR AND TEAR ON THE CAR AND WILL NOT COVER REPLACEMENT OF THE CARPET UNDER MY BUMPER TO BUMPER WARRENTY. PICTURES ARE AVAILABLE, PLEASE CONTACT AND I WILL FORWARD THEM TO YOU.",
        "vin": "1FAFP42X04F"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/17/2005",
        "dateOfIncident": "07/01/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10129029,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CARPET ON MY 2004, V6, MUSTANG COUPE IS ROLLING DOWN FROM UNDER THE DASH AREA AND INTERFERING WITH DEPRESSING THE CLUTCH ALL THE WAY AND INTERFERING WITH THE GAS PEDAL.",
        "vin": "1FAFP40434F"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/17/2005",
        "dateOfIncident": "07/11/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10129035,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "CARPET HUNG ACCELERATOR CAUSING VEHICLE TO RUN AT OPEN THROTTLE TILL I SWITCHED IT OFF AND COASTED TO A STOP! I HAVE CUT CARPET, TAPED IT DOWN AND MADE SURE IT CLEARED THE ACCELERATOR PEDAL.",
        "vin": "1FAFP48Y74F"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/15/2005",
        "dateOfIncident": "05/27/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10128903,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY 2004 MUSTANG COBRA, AT ACCELERATION MY GAS PEDAL GOT STUCK UNDER THE CARPET, CAUSING THE CAR TO ACCELERATE A FULL THROTTLE. I SHUT THE CAR OFF IMMEDATELY TO AVOID BLOWING THE ENGINE AND/OR CRASHING.",
        "vin": "1FAFP48Y74F"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/14/2005",
        "dateOfIncident": "03/15/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10128709,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2004 FORD MUSTANG COBRA.  I HAVE HAD THE ACCELERATOR PEDAL BECOME STUCK UNDER THE CARPET ON MORE THAN ONE OCCASION.  ONE OF THE EVENTS HAPPENED WHILE I WAS ON A DYNO-JET TESTING HORSEPOWER, AND IT WAS CAPTURED ON VIDEO.  THE OTHER EVEN HAPPENED WHILE DRIVING, AND I WAS NEARLY KILLED.  I JUST HAPPENED TO THINK FAST AND SWITCH THE KEY OFF.  I HAVE FIXED THIS BY CUTTING AWAY A SECTION OF CARPET UNDER THE PEDAL.  I AM NOT HAPPY WITH THIS SOLUTION BECAUSE THIS IS A LIMITED PRODUCTION CAR, AND CUTTING CARPET IS NOT A THING THAT I WANTED TO DO.  BUT I WAS AFRAID THAT IF I DID NOT DO THIS I WOULD BE INJURED OR KILLED THE NEXT TIME IT HAPPENED.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/14/2005",
        "dateOfIncident": "07/15/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10128752,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE CONTACT OWNS A 2004 FORD MUSTANG. SHE IS CALLING IN RESPONSE TO THE INVESTIGATION NUMBER PE05038. THE CONTACT STATES THAT THE VEHICLE SOUNDS LIKE IT IS REVVING TOO MUCH WHILE CHANGING GEARS BECAUSE THE RPM'S STAY UP TO HIGH. THE CONTACT HAS CHECKED WITH THE DEALERSHIP BECAUSE THEY THOUGHT SOMETHING WAS WRONG WITH THE CAR WHEN THEY FIRST PURCHASED IT,  AND THEY TOLD HIM IT WAS THE NATURE OF THIS CAR. THE DEALERSHIP MUST HAVE SPOKEN WITH FORD IN THE ENGINEERING DEPARTMENT.   ALSO, THEY WROTE A LETTER TO FORD AND CONTACTED THEM AS WELL ABOUT THIS PROBLEM. *AK",
        "vin": "1FAFP4049WF"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/14/2005",
        "dateOfIncident": "06/29/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10128779,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON CITY STREETS, MY ACCELERATOR HAS BECOME STUCK IN THE CARPETING TWICE CAUSING TEMPORARY INABILITY TO CONTROL SPEED.  I TRIED TO GLUE THE CARPET DOWN MYSELF, BUT THERE WAS NOT ENOUGH \"GIVE\" IN IT TO CORRECT THE PROBLEM.",
        "vin": "1FAFP48Y24F"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/13/2005",
        "dateOfIncident": "07/12/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10128544,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2004 FORD MUSTANG V6 40TH ANNIVERSARY EDITION, VIN [XXX].    THE CARPET IS COMING UP ON THE DRIVERS SIDE & PASSENGER SIDE.  THE CARPET IS INTERFERING WITH BOTH BRAKING AND ACCELERATION PEDALS. *JS    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6)",
        "vin": "1FAFP40494F"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "07/13/2005",
        "dateOfIncident": "06/13/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10128546,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE CONSUMER STATED THAT BECAUSE OF HIS CARPET, HIS ACCELERATOR STICKS AND THE BRAKE HANGS ON THE CARPET AS WELL. THE DEALER REFUSED TO LOOK AT IT UNTIL THE VEHICLE WAS RECALLED. THE MANUFACTURER STATED THE SAME THING. THE CONSUMER HIT A POLE AND CAUSED MINOR DAMAGE TO POLE AND HIS VEHICLE.",
        "vin": "1FAFP40494F"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/13/2005",
        "dateOfIncident": "06/01/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10128592,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS PEDAL HAS GOTTEN STUCK UNDER CARPET A FEW TIMES, AT FIRST I THOUGHT IT WAS THE FLOOR MAT DOING IT BUT AFTER LOOKING MORE CLOSELY IT APPEARS TO BE THE CARPET OR THE WAY IT WAS INSTALLED THATS CAUSING IT.",
        "vin": "1FAFP42R94F"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/13/2005",
        "dateOfIncident": "05/12/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10128602,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY 04 MACH 1, THE GAS PEDAL GOT STUCK UNDER THE CARPET TWICE. THE FIRST TIME THE CAR REACHED AN ESTIMATED SPEED OF AROUND 125 MPH BEFORE I SHUT IT DOWN AND PULLED OVER. THE SECOND TIME I KNEW WHAT HAPPENED AND REACHED DOWN AND LIFTED THE PEDAL UP TO FREE IT. THESE ARE PRETTY DANGEROUS SITUATIONS. I'M GOING TO TAKE IT TO THE DEALER AND SEE WHAT THEY SAY.",
        "vin": "1FAFP42R94F"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/13/2005",
        "dateOfIncident": "06/11/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10128635,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 MUSTANG - ACCELERATOR PEDAL STUCK AT FULL THROTTLE MULTIPLE TIMES. APPEARS TO BE CAUSED BY PEDAL COMPONENT STICKING UNDERNEATH CARPET.",
        "vin": "1FAFP48Y64F"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/13/2005",
        "dateOfIncident": "07/02/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10128650,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THE ACCELERATOR BECAME STUCK ON THE CONSUMERS 2004  MUSTANG SVT COBRA WHILE DRIVING AT A LOW SPEED.  WHEN THE CONSUMER APPLIED THE BRAKES AND TRIED PLACING THE VEHICLE IN NEUTRAL, THE THROTTLE WAS WIDE OPEN AND THE ENGINE REVVED UP.  THE CONSUMER SIMPLY TURNED OFF THE ENGINE AND PULLED OVER.  THE CONSUMER HAD TO MANUALLY LIFT  THE  ACCELERATOR PEDAL AFTER STOPPING THE VEHICLE.  THE CONSUMER DID NOT TAKE THE VEHICLE TO THE DEALER, HE IS WAITING TO SEE WHAT FORD IS GOING TO DO ABOUT THIS.  THE  HAS  CONTACTED THE FORD MANUFACTURER WHO SAID THE CONSUMER NEEDED TO MAKE APPOINTMENT WITH THE DEALERSHIP BUT DENIED THERE WAS EVEN AN ISSUE.  *JB",
        "vin": "1FAFP48Y34F"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/13/2005",
        "dateOfIncident": "03/02/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10128668,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 MUSTANG COBRA BOUGHT NEW ONE MONTH PRIOR.  DRIVING DOWN A QUIET ROAD, WENT FULL THROTTLE FOR SHORT DURATION, THROTTLE STUCK, I HAD TO TURN OFF THE IGNITION.  ACCELLERATOR PEDAL WAS STUCK UNDER THE CARPET.  TOOK IT TO THE DEALER, THEY SAID THEY FIXED IT, AND IT HAPPENED AGAIN UNDER THE SAME CIRCUMSTANCES.  THE DEALER FINALLY CUT THE CARPET AND SCREWED IT TO THE FLOORPAN (THE REPAIR IS NOT VISIBLE) AND IT HASN'T HAPPENED SINCE.",
        "vin": "1FAFP48Y24F"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/11/2005",
        "dateOfIncident": "07/10/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10128248,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE GAS PEDAL ON MY 2004 FORD COBRA STUCK ALL THE WAY DOWN AND ALMOST CREATED AN ACCIDENT. I WAS VERY FORTUNATE TO HAVE NOT BEEN INJURED OR TO INJURE SOMEONE ELSE. FORD, THIS SHOULD BE A FACTORY RECALL PERIOD.",
        "vin": "1FAFP48Y24F"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "07/08/2005",
        "dateOfIncident": "06/30/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10127902,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2004 MUSTANG COBRA WITH 18000 MILES ON THE ODOMETER.  THE ISSUE I HAVE IS THE THE GAS PEDAL GETTING STUCK UNDER THE CARPET OF THE CAR (NOT THE REMOVABLE FLOOR MAT, BUT THE CAR ACTUAL CARPET).  WHEN THIS HAPPENS THE GAS PEDAL IS STUCK TO THE FLOOR, WHERE I THEN AM FORCED TO TURN OFF THE CAR AT SPEEDS OF 70 -80 MILES AN HOUR, EXTREMELY DANGEROUS.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/29/2005",
        "dateOfIncident": "05/26/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10126983,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 FORD SVT COBRA MUSTANG    THE THROTTLE PEDAL WILL HANG UP ON THE CARPET WHEN AT FULL THROTTLE.  WHEN THE THROTTLE HANGS, THE ENGINE WILL REV UNTIL REDLINE, AND THEN THE REV LIMITER WILL SET IN.  TO STOP THE CAR, THE DRIVER MUST KILL THE IGNITION SWITCH (BEING CARFUL NOT TO TURN IT SO FAR AS TO LOCK THE STEERING WHEEL) AND BRING THE CAR TO A STOP WITHOUT POWER BRAKES AND POWER STEERING.  WITH OVER 390HP IN THE SVT COBRA, A STUCK THROTTLE WILL CAUSE THIS VEHICLE TO APPROACH OTHERS AT A VERY RAPID PACE.      TO FIX THE PROBLEM, A 3\"X3\" PIECE OF CARPET MUST BE CUT FROM THE FLOOR BENEATH THE ACCELERATOR PEDAL.",
        "vin": "1FAFP48Y14F"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/23/2005",
        "dateOfIncident": "05/13/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10126419,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD A DEER ACCIDENT ON MY WAY TO WORK & WRECKED MY 2004 FORD MUSTANG CONVERTIBLE & THE AIRBAGS DID NOT DEPLOY & I TOOK THE ENTIRE FORCE OF THE ACCIDENT. I FLIPPED END OVER END & ROLLED IT ONCE OR TWICE & HIT THE RIGHT FRONT BUMPER ON A CONCRETE SLAP & FLIPPED BACK ON THE WHEELS  &  DESTROYED THE FRONT END & COMPLETELY TOTALED THE CAR!  I HAVE SEVERE HEAD TRAMA, WHIPLASH, INJURED BACK, NECK & SHOULDERS & AM IN PHYSICAL THERAPY 3X'S A WEEK & LOTS OF PAIN & INFLAMATION RX'S.  FORD MOTOR DOESN'T SEEM TO WANT TO GIVE ME ANY ANSWERS & I'VE CONTACTED 4 DIFFERENT LAWYERS & NONE OF THEM WANT TO TAKE FORD ON TO INVESTIGATE WHAT HAS HAPPENED & I CAN'T GET ANY HELP SO I THOUGHT I'D ASK FOR YOUR HELP & ANY INFORMATION YOU CAN PROVIDE ME WITH WOULD BE GREATLY APPRECIATED.",
        "vin": "1FAFP45X84F"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "06/17/2005",
        "dateOfIncident": "08/15/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10125569,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "SECOND TIME THIS HAPPENED...THROTTLE PEDAL STUCK UNDER CARPET OF VEHICLE CAUSING VEHICLE TO ACCELERATE CONTINUOUSLY, AND HIT REV LIMITER WHILE I WAS HEADING TOWARDS STOPPED TRAFFIC.  CUT ENGINE TO STOP THROTTLE, BUT WITHOUT POWER BRAKES AND STEERING IT WAS MORE THAN FRIGHTENING.  PULLED TO SIDE OF ROAD AND HAD TO FORCE CARPET UP IN ORDER TO FREE THROTTLE.  TOOK IT TO THE DEALER AND THEY STATED \"OH, WE HAVE SEEN A LOT OF THESE WITH COBRAS\".",
        "vin": "1FAFP49Y94F"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/16/2005",
        "dateOfIncident": "06/15/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10125548,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING THE CAR ON DRAGSTRIP AND THE   GAS PEDAL STUCK UNDERNEATH THE CARPET AT FULL THROTTLE  I AM NOT REFERRING TO A MAT, THE ACTUAL CARPET  I CALLED MY FORD DEALER AND THEY HAVE NO SPECFIC FIX  I AM CUTTING A SLIT IN THE CARPET AND GLUEING IT DOWN  IF THIS HAPPENED ON THE HIGHWAY, WHO KNOWS?",
        "vin": "1FAFP48Y04F"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/05/2005",
        "dateOfIncident": "05/23/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10124246,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "A STUCK WIDE OPEN THROTTLE OCCURRED WHILE DRIVING MY 2004 FORD SVT COBRA MUSTANG... FORTUNATELY I AM AN EXPERIENCED DRIVER WITH SOME AUTO RACING IN MY BACKGROUND... I WAS ABLE TO QUICKLY PUSH IN THE CLUTCH(ENGINE WAS BOUNCING OFF THE REV LIMITER AT THIS POINT), AND TURN OFF THE KEY...  THE COBRA MUSTANG HAS HYDRO-BOOST POWER BRAKES AND POWER STEERING SO AT THIS POINT, STEERING EFFORT AND BRAKE PEDAL EFFORT \"WENT THROUGH THE ROOF\"(WERE VERY HIGH).  SINCE I AM AN ENTHUSIASTIC SUPPORTER AND BUYER OF FORD PRODUCTS I WOULD LIKE TO SEE A RECALL ON THIS VERY COMMON PROBLEM... BEFORE SOME ONE LESS EXPERIENCED GETS KILLED!!!  THESE ARE VERY POWERFUL CARS!!! THINGS HAPPEN EXTREMELY FAST WHEN THE PEDAL IS DOWN!!!    THE CAUSE OF THIS STUCK THROTTLE IS A PARTIAL BENDING OF THE ACCELERATOR PEDAL, AND THE CONTACT WITH AND STICKING UNDER OF THE CARPET BY THE PEDAL.    A STUCK WIDE OPEN THROTTLE IN ANY CAR IS VERY DANGEROUS!!!  A STUCK WIDE OPEN THROTTLE IN THIS PARTICULAR CAR IS INSANE!!!    TO CORRECT THE PROBLEM AS SOON AS I ARRIVED HOME I TRIMMED THE CARPET THAT WAS CONTACTING THE THROTTLE WHEN DOWN... SO THAT IT WOULD NO LONGER TOUCH AT ALL.    PLEASE NOTE---> AT FIRST I THOUGHT THAT THE FLOOR MAT HAD CAUSED THE PROBLEM.  I WAS WRONG... WHILE STILL POSSIBLE IF DISLODGED FROM IT'S ANCHOR POINT... IT WAS NOT WHAT WAS STICKING THE PEDAL... IT WAS THE CARPET, WHICH WAS SHAPED POORLY AND RETAINED EVEN WORSE IN THAT CRITICAL THROTTLE AREA.  PLEASE NOTIFY THE PROPER AUTHORITIES AS TO THE POTENTIAL FOR EXTREME CONSEQUENCES THIS DEFECT PRESENTS.    PLEASE NOTE THAT THE DATE IN THE DATE FIELD IS A GUESS SINCE THIS OCCURRED OVER A YEAR AGO...  I AM FILING NOW BECAUSE I HAVE READ ABOUT NUMEROUS OTHER INSTANCES OF THIS OCCURRING AND I FIND IT VERY TROUBLING.",
        "vin": "1FAFP48Y84F"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/04/2005",
        "dateOfIncident": "06/03/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10124193,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE GAS PEDAL GETS STUCK UNDER THE CARPET CAUSING THE CAR TO REV AT HIGH RPM'S AND SHUTTING THE CAR OFF WHILE DRIVING.",
        "vin": "1FAFP48Y54F"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/03/2005",
        "dateOfIncident": "05/29/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10124049,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2004 FORD MUSTANG COBRA.  ON THE DAY LISTED BELOW, I ENTERED A VERY BUSY FREEWAY IN PHOENIX AND HAD TO GIVE FULL THROTTLE IN THIRD GEAR IN ORDER TO MERGE INTO AN OPENING.  WHEN I WENT TO RELEASE THE THROTTLE AS I MOVED INTO THE OPENING, THE THROTTLE STAYED AT THE WIDE OPEN POSITION WITH THE PEDAL STILL TO THE FLOOR.  I HAD TO PUSH THE CLUTCH IN, HIT THE BRAKES HARD, AND SHUT THE ENGINE OFF TO AVOID HITTING THE CAR IN FRONT OF ME.  IT WAS CLOSE.  THEN I HAD TO NEGOTIATE A SAFE EXIT TO THE SIDE OF THE ROAD.  WHAT I FOUND WAS THE THROTTLE PEDAL WAS STUCK UNDER A PIECE OF THE CARPETING.    I HAVE FOUND THIS IS NOT AN UNCOMMON OCCURANCE IN THIS MODEL.  (MUSTANG)  I CAN PROBABLY GIVE YOU THE NAMES OF 25 PEOPLE WHO HAVE SUFFERED THIS PROBLEM.      PLEASE!!  THIS IS A HUGE SAFETY ISSUE.  PLEASE DO WHAT YOU CAN TO RESOLVE THIS PROBLEM.  AGAIN, THIS IS NOT AN UNCOMMON PROBLEM AND I WOULD BE HAPPY TO DIRECT YOU TO A FORUM WHERE YOU CAN SEE MANY INSTANCES OF THIS.    THANK YOU FOR YOUR TIME.",
        "vin": "1FAFP49Y24F"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/03/2005",
        "dateOfIncident": "05/16/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10124052,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE ACCELLERATING CAR, GAS PEDAL GOT STUCK UNDER CARPET, SO I IMMEDIATELY SHIFTED INTO NEUTRAL, CAR BEGAN TO BOUNCE OFF OF REV. LIMITER UNTIL I FINALLY GOT GAS PEDAL UNSTUCK.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/03/2005",
        "dateOfIncident": "03/15/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10124154,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS PEDAL GETS CAUGHT ON THE CARPET AND STICKS AT FULL THROTTLE.",
        "vin": "1FAFP48YX4F"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/20/2005",
        "dateOfIncident": "05/19/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10121676,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS MAKING A TURN AROUND A CORNER FROM A STOP GOING AT APPROXIMATELY 7-10 MPH WHEN MY 2004 FORD MUSTANG STARTED GOING OUT OF CONTROL, PULLING TO THE RIGHT INTO ANOTHER LANE AND HEADING IN THE DIRECTION OF THE CURB, I TRIED TO REGAIN CONTROL OF THE VEHICLE BUT THE VEHICLE SEEMED TO BE PULLING FROM THE BACK, IT EVENTUALLY ENDED UP DOING A 180 DEGREE TURN INTO THE OTHER LANE , FORTUNATELY THERE WAS NO ONCOMING TRAFFIC IN THAT LANE.  ROAD CONDITIONS WERE DRY AND NORMAL.  I TOOK THE VEHICLE TO THE DEALERSHIP AFTER CONTACTING THE FORD MOTOR COMPANY ADDRESSING THE FACT THAT THE VEHICLE HAD A DEFINITE PROBLEM, AS THIS WAS THE THIRD SUCH INCIDENT OF THE VEHICLE LOSING CONTROL.  IN THE FIRST TWO INCIDENTS THE VEHICLE HAD STARTED AGAIN GOING OUT OF CONTROL FROM AROUND A CORNER, BUT THE CONDITION WAS WET SO I IGNORED IT. I FEARED THAT THERE WAS A GREATER PROBLEM HOWEVER, WHEN GOING AROUND A CURVE AT BELOW THE POSTED SPEED LIMIT IT ALSO STARTED PULLING FROM THE BACK HEADING INTO THE OTHER LANE.  FORTUNATELY IN THE OTHER TWO INCIDENTS I WAS ABLE TO PREVENT THE VEHICLES FROM TOTALLY LOSING CONTROL AND DOING WHAT IT HAD DONE ON THIS DAY.  THE FORD GILLESPIE DEALERSHIP LOCATED AT 7111 N.W LOOP 410 SAN ANTONIO TEXAS SAID THAT THEY WERE UNABLE TO DUPLICATE THE PROBLEM AFTER 12 MILES OF DRIVING AND HAVE SAID THAT THEREFORE THERE WAS NO PROBLEM.  I BELIEVE THAT THERE IS DEFINITELY SOMETHING WRONG WITH THE VEHICLE HANDLING AROUND CURVES AND CORNERS, AND THIS IS A REAL AND LEGITIMATE SAFETY ISSUE FOR ME.",
        "vin": "1FAFP44634F"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/19/2005",
        "dateOfIncident": "03/03/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10118930,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING SERVICE ENGINE LIGHT CAME ON.  THE GEAR SHIFT LEVER VIBRATED, ALL THE FLUID LEVERS WENT TO EMPTY, AND VEHICLE COASTED TO A STOP.  VEHICLE WAS SERVICED TWICE BY THE DEALERSHIP FOR THIS PROBLEM IN WHICH THE CLAMP WAS REPLACED.  HOWEVER,  PROBLEM RECURRED.*AK",
        "vin": "1FAFP406X4F"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/12/2005",
        "dateOfIncident": "04/11/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10116832,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE  MANUAL TRANSMISSION.  WHEN YOU PUT IT IN REVERSE IT WOULD NOT GO BACKWARD. I TOOK IT TO THE DEALER, WHEN I GOT THE CAR BACK, SECOND GEAR GRINDED VERY BADLY.  I DID NOT HAVE THIS PROBLEM WHEN I INITIALLY TOOK THE CAR IN. THEY KEPT TELLING ME TO DRIVE THE CAR AND IT WOULD WORK, IT WAY OUT. IT DID NOT WORK ITS WAY OUT, AND I TOOK IT BACK IN FOR REPAIRS. THEY HAD THE CAR 9 DAYS. AFTER I PICKED THE CAR UP, A FEW DAYS LATER I REALIZED THE REVERSE LIGHTS WERE NOT WORKING, I TOOK IT BACK TO THE DEALER AND THEY SAID IT WAS A FUSE . A FEW WEEKS LATER I REALIZED IT WAS OUT AGAIN, THEY AGAIN SAID IT WAS A FUSE, AND THEY SAID IT WAS NOT WORKING BECAUSE OF MY AFTERMARKET RADIO. I DECIDED TO JUST DROP THE CAR OFF IN THE DEALERS AFTER HOUR DROP BOX TO MAKE THEM LOOK AT IT  BECAUSE OF THE REVERSE LIGHTS NOT WORKING. IT TURNS OUT THE CIRCUIT BREAKER AND SWITCH WERE BROKEN AND HAD TO BE REPLACED. I JUST RECEIVED THE CAR BACK TODAY AND NOW THE \"CHECK ENGINE\" LIGHT IS ON. I NOTICED THIS BEFORE I EVEN GOT OUT OF THE DEALER'S LOT. THE CHECK ENGINE LIGHT WAS NOT ON WHEN I TURNED THE CAR IN. I TURNED THE CAR AROUND AND THE DEALER TOLD ME THEY WERE TO BUSY AND COULD NOT TAKE THE CAR BACK SO I DO NOT KNOW WHY THE CHECK ENGINE LIGHT IS ON. ALL OF THESE COMPLAINTS ARE IN REGARDS TO THE TRANSMISSION. I HAVE NO IDEA WHAT THE CHECK ENGINE LIGHT IS FROM BECAUSE THEY WILL NOT TAKE THE CAR IN UNTIL SUNDAY. *AK",
        "vin": "1FAFP40494F"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/16/2005",
        "dateOfIncident": "01/01/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10110639,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR BRAKES GRAB AND GRIND IF WET, WORSE IN REVERSE. *AK",
        "vin": ""
    },
    {
        "components": "PARKING BRAKE",
        "crash": false,
        "dateComplaintFiled": "01/18/2005",
        "dateOfIncident": "01/06/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10106576,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "(1) COLD WEATHER IN MICHIGAN.  DRY CAR, NO ADDITIONAL FROZEN WATER ON VEHICLE.  (2) PARKING BRAKE DOES NOT RELEASE WHEN FREEZING TEMPERATURES EXIST.  UNABLE TO MOVE IN REVERSE WITHOUT HEAVY ACCELERATION.  FREE PLAY IN PARKING BRAKE HANDLE EVENTUALLY GOES AWAY AFTER SITTING ( 3 - 10 MINUTES ), OR DRIVING FORWARD WITH THE VEHICLE FOR ROUGHLY .5 MILE.  (3) DEALER COULD NOT VERIFY CONCERN, I SCHEDULED AN APPOINTMENT AGAIN TO LOOK AT THIS PROBLEM, BUT WAS UNABLE TO KEEP THE APPOINTMENT.  NO SERVICE BULLETINS IN REGARD TO THIS PROBLEM.  I AM NOT CURRENTLY USING PARKING BRAKE AS I DON'T WISH TO BREAK ANYTHING, OR PREMATURELY WEAR ANYTHING OUT.    THIS VEHICLE WAS A FLEET VEHICLE PURCHASED WITH 17,210 MILES ON IT.  DEALER IS VERY CORDIAL, AND APPEARS TO BE VERY KNOWLEDGEABLE, BUT HAS NOT HAD THIS PROBLEM PRESENTED TO THEM PREVIOUSLY.  NO SERVICE BULLETIN FROM FORD REGARDING THIS PROBLEMI PREVIOUSLY SUBMITTED A COMPLAINT (ODI ID NUMBER : 10106576), AND HAVE SINCE TAKEN THE VEHICLE BACK TO THE DEALER FOR SERVICE. IT APPEARS THAT THE SERVICE WORK THEY HAVE SINCE PERFORMED HAS FIXED THE PROBLEM (HOPEFULLY FOR GOOD). THE FOLLOWING WARRANTY SERVICES WERE PERFORMED:    \"REPLACE BOTH REAR E-BRAKE CABLES, REPLACE REAR BRAKE PADS DUE TO HOT SPOTS AND RT REAR INNER AND OUTER PADS HEAT CRACKED.  USE ON CAR BRAKELATHE MACHINE BOTH REAR ROTORS BEFORE SPEC .550 AFTER CUT SPEC. .530  INSTALL 4 NEW STAINLESS SLIDES, LUBE COMPLETE ASSEMBLY AND ROAD TEST. ALL OK\"  .   *NM",
        "vin": "1FAFP40674F"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/12/2005",
        "dateOfIncident": "11/05/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10107250,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 5-60 MPH STEERING WHEEL WOULD PULL TO THE RIGHT.  DEALERSHIP WAS NOTIFIED, BUT DID NOT RESOLVE THE PROBLEM.  *AK",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/23/2004",
        "dateOfIncident": "08/21/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10088447,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY 2004 FORD MUSTANG GT CONVERTIBLE WITH THE TOP DOWN AND THE BOOT FASTENED AS INSTRUCTED IN THE OWNER'S HANDBOOK, THE BOOT DETACHED AND FLEW INTO TRAFFIC.  THIS HAS HAPPENED ON TWO OCCASIONS.*AK",
        "vin": "1FAFP45XX4F"
    },
    {
        "components": "SEATS",
        "crash": true,
        "dateComplaintFiled": "08/06/2004",
        "dateOfIncident": "07/19/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10087369,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER'S VEHICLE WAS INVOLVED IN A FOUR CARS REAR END COLLISION IN  WHICH THE DRIVER'S SEAT TOTALLY COLLAPSED BACKWARD. CONSUMER SUSTAINED INJURIES, AND WAS TRANSPORTED BY AMBULANCE TO A LOCAL HOSPITAL.  *AK",
        "vin": "1FAFP40694F"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/23/2004",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10083705,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MALFUNCTION IN DEPLOYMENT OF THE AIR BAGS ON 2004 FORD MUSTANG.*MR  THE VEHICLE WAS INVOLVED IN A SINGLE CAR ACCIDENT IN WHICH THE VEHICLE HIT THE GUARDRAIL.  THE AIR BAGS DID NOT DEPLOY.  *NM",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/04/2004",
        "dateOfIncident": "05/01/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10073606,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE WAS NO INDICATOR LIGHT WHEN THE CRUISE CONTROL WAS ENGAGED.  DEALER STATED THAT THIS WAS THE WAY VEHICLE WAS DESIGNED.   *AK   THE DEALER DID NOT ADVISE THE CONSUMER OF THE PROBLEM.  *SC *JB",
        "vin": "1FAFP44604F"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/22/2004",
        "dateOfIncident": "04/22/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10068689,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN CONSUMER  APPLIED THE CLUTCH PEDAL IT CAUSED THE ENGINE TO RISE  UP FROM 100 TO 3000 RPMS.  VEHICLE WAS TAKEN TO THE DEALER, AND   FLOOR MANAGER DETERMINED THERE WAS  SOMETHING WRONG WITH CAR.  HOWEVER, THE MANUFACTURER INDICATED NOTHING WAS WRONG WITH THE VEHICLE. *AK",
        "vin": "1FAFP40674F"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/24/2004",
        "dateOfIncident": "12/28/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10058850,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "GAP ON LOWER PASSENGER DOOR.  EXCESSIVE ROAD NOISE WHERE CONVERTABLE TOP MEETS PILAR ON PASSENGER SIDE.*AK",
        "vin": "1FAFP45X54F"
    },
    {
        "components": "STEERING,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/20/2004",
        "dateOfIncident": "06/18/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10059455,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT ANY SPEED HEARD A GRINDING SOUND COMING FROM THE STEERING COLUMN.  THE NOISE SOUNDED LIKE THERE WAS NO FLUID IN THE RESERVOIR WHEN IT WAS ACTUALLY FULL.  DEALER EXAMINED THE VEHICLE, AND CLAIMED THAT THE STEERING WAS WORKING NORMALLY.  *AK POWER STEERING WILL LOCK UP AND WILL NOT BE ABLE TO STEER VEHICLE, THIS COULD CAUSE AN ACCIDENT. ALSO, PROBLEM WITH REAR DEFROSTER.  CONSUMER BELIEVED THAT THERE SHOULD BE A RECALL OF ALL VEHICLES 1999 AND UP.  *AK",
        "vin": "1FAFP44664F"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/05/2004",
        "dateOfIncident": "12/10/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10056619,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR BRAKES 2004  MAKES A NOISE WHEN WET  IDLE IS TO HIGH WHEN YOU PUSH IN CLUTCH.  *JB",
        "vin": "1FAFP42R04F"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/26/2004",
        "dateOfIncident": "12/27/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10054938,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "REPEATED INTERMITTENT FUEL SMELL DURING OPERATION OF VEHICLE IN INTERIOR COMPARTMENT.  *LA",
        "vin": "1FAFP42X64F"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "01/15/2004",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10054177,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEAD REST ONLY ADJUST UP TO ONE INCH.  THE CONSUMER IS CONCERNED THAT ANYONE WHO DRIVES THESE VEHICLES WILL NOT HAVE THE PROPER HEAD RESTRAINT PROTECTION IN THE EVENT OF A CRASH.  PLEASE PROVIDE ANY ADDITIONAL INFORMATION.  *NM",
        "vin": "2FPFP44694F"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/29/2003",
        "dateOfIncident": "10/28/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10043868,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A 2004 FORD MUSTANG ON 9/15/03.  THE REAR DIFFERENTIAL WAS FAULTY, CAUSING ME TO TAKE IT TO THE DEALERSHIP TO BE REPLACED ON 10/28/03.  THE REAR END WHINES AND IS WOBBLY WHILE MAKING ANY TURNS, LEFT OR RIGHT.*AK",
        "vin": "1FAFP42X54F"
    }
]