[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/09/2016",
        "dateOfIncident": "02/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10825172,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 FORD F-550 SD. WHILE DRIVING APPROXIMATELY 55 MPH, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE RESTARTED; HOWEVER, THE FAILURE RECURRED APPROXIMATELY ONE MILE LATER. THE VEHICLE DID NOT RESTART AND WAS TOWED TO THE CONTACT'S JOB. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE WIRING HARNESS WAS FAULTY, MELTED, AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STATED THAT THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 05V270000 (ELECTRICAL SYSTEM). THE APPROXIMATE FAILURE MILEAGE WAS 155,862.",
        "vin": "1FDAF57P04E"
    },
    {
        "components": "STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "10/13/2015",
        "dateOfIncident": "09/07/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 4,
        "odiNumber": 10781529,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 FORD F-550 SUPER DUTY. WHILE THE LINK WAS IN THE AIR WITH A WORKER LOCATED IN THE BUCKET, THE LINK FRACTURED WITHOUT WARNING. THE WORKER'S BUCKET CAME DOWN WITH FORCE CAUSING INJURY TO HIS HEAD, BACK, AND PELVIC AREA. THE WORKER RECEIVED MEDICAL ATTENTION. THE VEHICLE WAS NOT DIAGNOSED. THE CONTACT STATED THAT THE VIN WAS INCLUDED IN AN EQUIPMENT MANUFACTURER RECALL FOR A LINK FAILURE, BUT THE CONTACT DID NOT RECEIVE A NOTIFICATION. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE AND RECALL NUMBER WERE NOT AVAILABLE.",
        "vin": "1FDAF57P84E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "02/25/2013",
        "dateOfIncident": "02/13/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10499917,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRUCK IN QUESTION IS A 2004 FORD F-550 DIESEL. UPON DEPRESSING GAS PEDAL, TRUCK STALLED AND NO LONGER WORKED PROPERLY.  TRUCK WAS TOWED TO LOCAL FORD DEALER WHERE IT WAS DETERMINED THAT THE FUEL TANK WAS SUFFERING FROM RUST INSIDE THE TANK.  BASED ON THE WORK DONE, RUST PARTICLES THAT FORMED INSIDE THE TANK WERE FORCED THROUGH THE FUEL PUMP AND FILTER DAMAGING BOTH AND CAUSING AN ISSUE WITH THE FUEL INJECTORS.  I CALLED FORD DIRECTLY TO ASK ABOUT ANY RECALLS FOR THIS ISSUE AND THEY TOLD ME THERE WAS NO RECALL CURRENTLY FOR THIS PROBLEM.  THEY SAID THE TRUCK WAS OUT OF WARRANTY AND THERE WAS NOTHING THEY COULD DO ABOUT THE $3000 BILL FROM THEIR INDEPENDENT DEALER.      I FIND IT HARD TO BELIEVE THAT A TRUCK THAT IS NOT USED FOR PLOWING AND ONLY HAS 36,000 MILES WOULD SUFFER SUCH A CATASTROPHIC FAILURE.  THE REPLACEMENT TANK WAS MADE OF SOME TYPE OF PLASTIC NOT THE OEM METAL TANK THAT WAS ORIGINALLY USED ON THE TRUCK WHICH MADE ME QUESTION THE DEALER. THEY SAID THEY HAD SEEN THIS HAPPEN ON TANKS OF THIS MODEL QUITE OFTEN SO THEY REPLACED THEM WITH A PVC MODEL.  UPON FURTHER DISCUSSIONS THROUGH BLOGS AND OTHER ONLINE RESOURCES I WAS ABLE TO FIND A FEW OWNERS OF THE SAME TRUCKS THAT HAD SIMILAR PROBLEMS.  THESE DISCUSSIONS PROMPTED ME TO FILE THIS CLAIM.  *TR",
        "vin": "1FDAF56P84E"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/10/2012",
        "dateOfIncident": "05/15/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10470140,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 FORD F-550 SD. WHILE DRIVING APPROXIMATELY 45 MPH THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS TOWED TO THE DEALER FOR DIAGNOSTICS WHERE THE TECHNICIAN STATED THAT THE TURBO CHARGER WOULD HAVE TO BE REPLACED. AFTER THE REPAIR THE FAILURE CONTINUED. THE VEHICLE WAS TAKEN BACK TO THE DEALER A SECOND TIME WHERE THE FUEL PUMP WAS REPLACED BUT TO NO AVAIL. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC FOR DIAGNOSTIC TESTING. THE MECHANIC STATED THAT THE LAMINATION OF THE FUEL TANK WAS PEELING AND ENTERING THE FUEL SYSTEM AND THE ENGINE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 45,000.",
        "vin": "1FDAF57P14E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/12/2012",
        "dateOfIncident": "07/02/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10466085,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 F550 DIESEL. CONSUMER STATES VEHICLE HAS A FAULTY HEAD-GASKET *TGW  THE CONSUMER STATED THE TRUCK WOULD ONLY RUN FOR 20 MINUTES BEFORE IT OVERHEATED. THE CONSUMER WAS INFORMED IT COST CLOSE TO 10,000 TO FIX THE TRUCK. *JB",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/01/2012",
        "dateOfIncident": "05/30/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10460223,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 FORD F-550 SD. WHILE DRIVING APPROXIMATELY 5 MPH, THE ENGINE STALLED WITHOUT PRIOR WARNING. THE VEHICLE FAILED TO RESTART AND IT WAS TOWED TO AN INDEPENDENT MECHANIC WHO STATED THE FAILURE WAS CONTRIBUTED TO THE HIGH PRESSURE OIL PUMP. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE PROBLEM. THE APPROXIMATE FAILURE MILEAGE WAS 30,000.   UPDATED 8/8/12 *CN    UPDATED 08/15/2012 *JS",
        "vin": "1FDAW57P86E"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/09/2012",
        "dateOfIncident": "07/27/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10454492,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL-THE CONTACT OWNS 2004 FORD F550 SUPER DUTY. THE CONTACT STATED THAT THE FUEL TANK LINING FAILED AND WAS REPLACED TWICE. THE FAILURE WAS NOT CORRECTED HOWEVER AND THE FUEL TANK LINING REPEATEDLY FAILED, CONTAMINATING THE FUEL SYSTEM UPON EACH RECURRENCE. THE FAILURE WAS NOT REPAIRED. THE MANUFACTURE ADVISED THE CONTACT THAT THE FUEL LINING FAILURE WAS NOT A MANUFACTURING DEFECT. THE FAILURE MILEAGE WAS 47,000 AND THE CURRENT MILEAGE WAS 117,000.  KMJ",
        "vin": "1FDAF56P54E"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/09/2012",
        "dateOfIncident": "04/10/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10454588,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 F550 TRUCKS HAVE THE INSIDE GAS TANKS PAIN OR LINEN, PEELING OR DELAMINATING.  THIS CAUSE THE MOTOR TO STALL. BECAUSE ALL THE LITTLE PIECES OF PAINT GOING TO THE INJECTORS.FOR 3 YEARS (2009-2010 AND 2011) IN A ROW, WE NEED TO FIX THE PROBLEM OURSELVES COSTING US $3,500 EVERY TIME -THIS YEAR IS THE SAME PROBLEM.  LAST YEAR I CALL FORD MOTOR CO, AND THEY TOLD ME THAT WERE NOT ENOUGH COMPLAINTS TO MAKE A RECALL.  BUT IF YOU CHECK GOGGLE.COM AND GO TO 2004 F550 COMPLAINT'S PAGE YOU WILL SEE HUNDREDS AND HUNDREDS OF COMPLAINTS.  WE BOUGHT THE TRUCK ON DEC 2004 AND PAID FOR IT $56,000- DOLLARS, WAS NOT A CHEAP TRUCK.  ALSO, I WERE TALKING TO A LOT OF F550'S OWNERS ( MOST OF THEM LANDSCAPERS)AND THEY HAD OR HAVE THE SAME PROBLEM.  SO..........FORD CO IS WASHING THE HANDS,  AND NOT DOING A RECALL ON THIS.  *TR",
        "vin": "1FDAF57P14E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "01/05/2012",
        "dateOfIncident": "12/21/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10442595,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE (2004 DIESEL F550 TRUCK) WAS TRAVELING ON I-405 DURING RUSH HOUR TRAFFIC WHEN THE VEHICLE STALLED.  DEALER SAYS THAT THE PAINT/LAMINATE INSIDE THE FUEL TANK IS CORRODING AND PIECES OF DEBRIS ARE BEING FED INTO THE FUEL SYSTEM CAUSING SUDDEN STALLING OF VEHICLE.  NO OFF-ROAD DIESEL HAS EVER BEEN USED IN THE TANKS--STANDARD DIESEL FUEL ONLY.   *TR",
        "vin": "1FDAX57P94E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/18/2011",
        "dateOfIncident": "03/29/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10420003,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 F-550 SD. WHILE DRIVING APPROXIMATELY 60 MPH, THE CONTACT NOTICED STEAM COMING FROM THE ENGINE. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSTICS WHERE THE TECHNICIANS ADVISED THAT THE TURBO HAD OVER BOOSTED AND CAUSED THE ENGINE TO FAIL. THE ENGINE WAS REPLACED AND AFTER THE REPAIRS, THE CONTACT NOTICED WHITE SMOKE FROM THE EXHAUST PIPE AND AN ANTI-FREEZE SMELL EMITTING FROM THE VEHICLE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC. THE MECHANIC STATED THAT THE INNER COOLER HAD TO BE REPLACED AND THE HEAD GASKET EXHIBITED A LEAK. THE INNER COOLER WAS REPLACED. THE APPROXIMATE FAILURE MILEAGE WAS 6,500.    UPDATED 10/05/11",
        "vin": "1FDAX57P74E"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/15/2011",
        "dateOfIncident": "03/20/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10419489,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "PROBLEM 1: IN 2004 I PURCHASED A NEW FORD F-550 WITH THE GASOLINE V10. ABOUT ONE MONTH AFTER OWNING THE TRUCK THE THROUGH-OUT BEARING ON THE CLUTCH STARTED MAKING NOISE AND HAS DONE SO. THIS YEAR WITH ONLY 49,000 MILES ON THE TRUCK NOW IT DOES NOT WANT TO GO INTO GEAR SOMETIMES.BY THE TIME I CONTACTED MY DEALER HE SAID THAT THE TRUCK WAS OFF WARRANTY. DID THEY SELL CHEAP BEARINGS IN THESE TRUCKS, BECAUSE MY LAST F350 I HAD FOR 14 YEARS WITHOUT ANY PROBLEMS.  PROBLEM 2: EVER SINCE I HAVE OWNED THIS TRUCK. WHEN YOU ARE SITTING AT A LIGHT AND GET READY TO GO. ALL OF A SUDDEN THE ENGINE SHUTS DOWN FOR ABOUT 2 SECONDS AND THEN GOES.  *TR",
        "vin": "1FDAF56S54E"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/04/2011",
        "dateOfIncident": "06/16/2011",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10417113,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2004 FORD F-550.  THE CONTACT STATED THAT THE VEHICLE WOULD NOT START.  THE DEALER DIAGNOSED THAT THE FUEL INJECTOR WIRE WAS MELTING ON THE ENGINE. THE VEHICLE WAS REPAIRED AND RECURRED.  THE MANUFACTURER WAS NOTIFIED, BUT DENIED ANY ASSISTANCE WITH REPAIRS. THE FAILURE MILEAGE WAS 116,000 AND THE CURRENT MILEAGE WAS 121,164.",
        "vin": "1FDAF57P74E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "06/10/2011",
        "dateOfIncident": "06/01/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10405893,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 1997 FORD F-550 SUPER DUTY. THE CONTACT STATED THE VEHICLE WOULD STALL WHILE DRIVING AT VARIOUS SPEEDS. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHERE THE CONTACT WAS INFORMED THE VEHICLE WAS STALLING DUE TO DELAMINATION OF THE FUEL TANK. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS UNKNOWN AND THE CURRENT MILEAGE WAS 144,250.",
        "vin": "1FDLE40F7VH"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "01/05/2011",
        "dateOfIncident": "11/23/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10374731,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "SUDDEN POWER LOSS TRAVELING AT HIGHWAY SPEEDS RESULTING IN ENGINE SHUTTING DOWN AND NOT BEING ABLE TO BE RESTARTED. *TR",
        "vin": "1FDAF57PX4E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, DIESEL,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/05/2011",
        "dateOfIncident": "08/17/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10374870,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "04 FORD F550 SD DUMP TRUCK WAS BOUGHT NEW ON 12/04.. IN APRIL 2005 TRANSMISSION LEAKED FLUID WHILE IN PARK AND TRUCK WAS TOWED TO DEALER. THE DEALER CLAIMED CAUSE OF PROBLEM WAS DUE TO LOOSE BOLTS ON TRANS CASE. TRANSMISSION CONTINUED TO SLIP BUT DEALER COULD NOT FIND PROBLEM. FEBRUARY 2006, APPROXIMATELY 16,000 MILES ON TRUCK,  TRANSMISSION COMPLETELY FAILS. TRUCK TOWED TO DEALERSHIP AND NEW TRANSMISSION INSTALLED. ON JUNE 2008 (APPROXIMATELY 56,000 MILES) WHILE DRIVING ON MAJOR HIGHWAY, TRUCK BEGINS TO LOSE POWER AND BLACK SMOKE POURS OUT OF MUFFLER. THE TRUCK WAS DRIVEN TO LOCAL DEALERSHIP AND DIAGNOSED WITH A BLOWN TURBO. FORD DID NOT COVER COST OF REPAIR. I  PAID $4,500.00 OUT OF POCKET TO REPLACE TURBO. AUGUST 2009 (APPROXIMATELY 68,000 MILES) AGAIN WHILE DRIVING ON MAJOR HIGHWAY, TRUCK LOSES POWER AND STALLS. TRUCK WAS TOWED TO FORD DEALERSHIP  AND DIAGNOSED WITH CLOGGED INJECTORS  DUE TO DETERIORATING GAS TANK.  DEALER ADVISED ME THAT ALL 8 INJECTORS WOULD HAVE TO BE REPLACED AND NEW FUEL PUMP INSTALLED. THE TOTAL COST OF REPAIRS WOULD BE $4,300.00 AND IT WOULD NOT BE COVERED BY FORD. I WAS INCENSED TO SAY THE LEAST...AFTER GETTING A SECOND OPINION, I PAID AN ADDITIONAL $475.00 AND HAD THE TRUCK TOWED TO ANOTHER FORD DEALERSHIP WHICH MADE THE REPAIRS WITHOUT ANY COST TO ME. THE FUEL TANK WAS NOT REPLACED EVEN THOUGH IT WAS THE CAUSE OF THE PROBLEM. I REPLACED THE TANK AND PAID $750.00 OUT OF POCKET...DECEMBER 27, 2010 (96,000 MILES) WITHOUT WARNING, TRANSMISSION BEGINS TO SLIP. I CONTACTED THE FORD DEALERSHIP THAT MADE THE LAST REPAIRS. I WAS TOLD THE TRANSMISSION WAS OUT OF WARRANTY AND WOULD NOT BE COVERED BY FORD. IT WOULD COST $4,200.00 TO REPLACE. I TOOK TRUCK TO A LOCAL TRANSMISSION REPAIR SHOP AND PAID $3,000.00 TO REBUILD TRANSMISSION. ITS OBVIOUS THAT FORD DOES NOT BACK UP THEIR PRODUCT. I WILL NEVER BUY ANOTHER FORD AGAIN!!!! *TR",
        "vin": "1FDAX56P94E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "09/03/2010",
        "dateOfIncident": "08/31/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10353775,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 FORD F-550 SUPERDUTY.  WHILE DRIVING  APPROXIMATELY 35 MPH THE VEHICLE STALLED.  IT WAS TOWED TO ANOTHER LOCATION WHERE THE DRIVER WAS ABLE TO GET IT RESTARTED.  THE VEHICLE WAS THEN TAKEN TO AN AUTHORIZED DEALER WHERE THE DRIVER WAS INFORMED THE FUEL TANK WAS DE-LAMINATING DUE TO RUST AND CORROSION.  IT WAS NOT REPAIRED.  THE FAILURE AND CURRENT MILEAGES WERE 80,978.",
        "vin": "1FDAF56PX4E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "08/06/2010",
        "dateOfIncident": "12/15/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10347608,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 FORD F-550 SD. THE CONTACT  STATED THE VEHICLE WOULD INTERMITTENTLY LOSE POWER WHEN DRIVING AT VARIOUS SPEEDS. ON ONE OCCASION THAT THE FAILURE OCCURRED, THE CONTACT SHUT OFF THE ENGINE AND WHEN RESTARTING, HE WAS ABLE TO DRIVE A VERY SHORT DISTANCE BEFORE THE FAILURE RECURRED. THE VEHICLE WOULD NOT ACCELERATE PAST 5 MPH. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHERE THE CONTACT WAS INFORMED THAT THE FUEL PUMP, FILTERS, FUEL TANK AND EIGHT FUEL INJECTORS WOULD NEED TO BE REPLACED BECAUSE THE FUEL TANK WAS RUSTED. THE MANUFACTURER ADVISED THE FAILURE OCCURRED BECAUSE THE CONTACT FAILED TO KEEP THE FUEL TANK FULL. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 27,120 AND THE CURRENT MILEAGE WAS APPROXIMATELY 46,000.",
        "vin": "1FDAF57P64E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "05/10/2010",
        "dateOfIncident": "05/07/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10329666,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WE OWN A FLEET OF FORD DIESEL ENGINE TRUCKS WHICH CONTINUE TO EXPERIENCE FUEL DELIVERY PROBLEMS. THE PROBLEM IS ENGINE CUT-OFF AND SURGING AND HARD STARTING. FORD SAYS NOT THEIR PROBLEM AND CHARGES US. I DON'T THINK WE HAVE THE ONLY ONES. TOYOTA IS NOT THE ONLY COMPANY NOT DEALING WITH THIS PROBLEM. THINK ONLY THE GOVERNMENT WILL MAKE THEM FIX IT. *TR",
        "vin": "1FDAF56PX4E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/30/2010",
        "dateOfIncident": "04/29/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10328229,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WE PURCHASED A FORD F550 6.0L DIESEL TRUCK NEW IN 2004 AND HAVE BEEN THE ONLY ONES TO DRIVE IT AND HAVE DONE PROPER CARE AND MAINTENANCE OF THIS VEHICLE.  IT HAS LESS THAN 40,000 MILES ON IT.  THE VEHICLE WOULD NOT START FOR NO REASON ON APRIL 29, 2010 NECESSITATING IT BEING TOWED TO THE LOCAL FORD DEALERSHIP.  THEY DIAGNOSED A BAD FICM (FUEL INJECTION CONTROL MODULE) AND REPLACED IT.  I HAVE FOUND THERE WAS A RECALL ON THIS VEHICLE FOR THIS PROBLEM, CAMPAIGN NUMBER 05V270000 ON 6/10/05.  DUE TO THE LOW MILES AND PROPER CARE OF THIS VEHICLE I AM WONDERING IF THIS PROBLEM IS RELATED TO THAT RECALL.  WE USE THIS IN OUR WORK AND HAD THE FICM GONE OUT WHILE WE WERE DRIVING IT WITH A LOAD OF CHIPS IT COULD HAVE POTENTIALLY BEEN EXTREMELY HAZARDOUS. *TR",
        "vin": "1FDAF57P54E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "04/27/2010",
        "dateOfIncident": "11/20/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10327739,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL INJECTOR PROBLEMS 3 TIMES, VEHICLE BROKE DOWN,FUEL TANK PROBLEMS, VEHICLE WILL STALL OR START RUNNING SO BADLY THAT U COULDN'T GO, AND OTHER VEHICLES WOULD ALMOST HIT MY VEHICLE, COULD NEVER TELL WHEN IT WAS GOING TO HAPPEN DEFECTIVE FUEL TANK....? *TR",
        "vin": "1FDAF56P14E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "03/22/2010",
        "dateOfIncident": "11/20/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10321313,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2004  F550 FORD TRUCK IN 2005 WITH 13,000 ORGINIAL MILES.  I STATRTED HAVING PROBLEMS AT 40,000 MILES WHEN THE WARRANTY RAN OUT.  I HAVE TWO MAJOR PROBLEMS:  (1)  THE LINER IN THE FUEL TANK SEPARATED FROM THE TANK AND WENT THROUGH THE FUEL SYSTEM.  I HAD TO REPLACE THE TANK, INJECTORS, AND INJECTOR PUMP.  (2) THE HEAD GASKETS BLEW AND THE TRUCK HAS NO POWER.  I PLAN ON REPAIRING THE GASKETS THIS WEEK.  WHEN DRIVING AT ANY SPEED, THE TRUCK SUDDENLY STOPS.  I HAVE CONTACTED MY DEALER AND WENT THROUGH THEIR ASSISTANCE PROGRAM. THEY DID NOT HELP WITH THE REPAIRS.  I HAVE CONTACTED  FORD'S CUSTOMER COMPLAINT DIVISION AND EXPERIENCED THE SAME RESULTS.  I SPOKE WITH SEVERAL FORD MECHANICS AND THE ABOVE TWO ITEMS ARE ONGOING MAJOR PROBLEMS.    I AM LOOKING FOR IMMEDIATE ASSISTANCE WITH REPAIRING THE 6.0 DIESEL ENGINE. THE VEHICLE IS UNSAFE TO DRIVE AND A HAZARD TO OTHER DRIVERS ON THE ROAD.  THIS IS A SEVERE HIGHWAY SAFETY ISSUE.  PLEASE CONTACT ME AS SOON AS POSSIBLE TO RESOLVE THESE PROBLEMS.  THANKS.  [XXX]  PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).*CC",
        "vin": "1FDAW57P04E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "03/04/2010",
        "dateOfIncident": "06/23/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10316599,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 FORD F550 SD. THE CONTACT WAS DRIVING APPROXIMATELY BETWEEN 45- 55 MPH. THE ENGINE STALLED WITHOUT WARNING. THE ENGINE FAILED TO RESTART. THE VEHICLE WAS TOWED TO AN AUTHORIZED DEALER. THE FAILURE WAS CONTRIBUTED TO THE FUEL INJECTOR WHICH WAS REPLACED ON THREE SEPARATE OCCASIONS. THE FAILURE CONTINUED WITH NO RESOLUTIONS.  THE FAILURE MILEAGE WAS 25,000. THE CURRENT MILEAGE WAS 184,602.  UPDATED 12/08/10. *LJ  THE RADIATOR HOSE WAS REPLACED.  UPDATED 12/13/10",
        "vin": "1FDAF56P34E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "09/25/2009",
        "dateOfIncident": "09/24/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10285295,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DISCOVERED MY F550 SUPERDUTY 6.0 DIESEL AT 94000 MILES WITH 8 MONTHS OVER ITS WARRANTY HAD AN EXHAUST LEAK COMING FROM BOTH SIDES OF ITS 6.0 LITER DIESEL ENGINE EXHAUST MANIFOLDS.  THESE FUMES WERE COMING INTO THE PASSENGER COMPARTMENT AT IDLE.  AT THE SAME MILEAGE, DEALER DISCOVERED THAT ENGINE HAD OIL IN COOLANT AND THAT ITS ENTIRE PASSENGER SIDE INJECTORS WERE MALFUNCTIONING ALONG WITH THE FUEL PUMP AND ITS REGULATOR.  EXCESSIVE FUEL IN ENGINE, RUNNING VERY LEAN COULD CAUSE ENGINE TO CEASE WHILE DRIVING.  DEALER ADVISED THAT OIL IN COOLANT IS COMMON FOR THESE ENGINES AND THAT THIS CAUSES A OTHER MALFUNCTIONS SUCH AS HEAD GASKETS TO GO.  THE EXHAUST MANIFOLDS WERE REPAIRED AT APPROX. $1172.  THE OTHER ENGINE WORK WAS NOT REPAIRED AS OF YET DUE TO IT COSTING APPROX. $4240.  THE HEAD GASKET WORK WOULD COST ANOTHER $6000.  FORD SAID IT WOULD NOT COVER THE REPAIRS BECAUSE I WAS THE SECOND OWNER.  BBB COMPLAINT FILED AND IN SEARCH FOR CLASS ACTION LAW SUIT TO COVER REPAIRS ONLY.  *TR",
        "vin": "1FDAX57P84E"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/22/2009",
        "dateOfIncident": "06/16/2009",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10274619,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 FORD F550.  TWO HOURS AFTER THE VEHICLE WAS PARKED, IT CAUGHT FIRE.  THE CONTACT STATED THAT IT WAS AN ELECTRICAL FIRE INSIDE THE CAB THAT DID NOT SEEM TO AFFECT THE ENGINE.  THE FIRE WAS NOT REPORTED TO THE FIRE DEPARTMENT OR POLICE.  THE CONTACT USED WATER AND A FIRE EXTINGUISHER TO EXTINGUISH THE FLAMES.  THE VEHICLE HAS NOT BEEN TAKEN TO A DEALER OR MECHANIC AND HAS NOT LEFT THE SCENE OF THE FIRE.  THE CURRENT AND FAILURE MILEAGES WERE 50,000.",
        "vin": "1FDAW56P54E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "02/17/2009",
        "dateOfIncident": "12/12/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10259143,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN TWO 2004 FORD F-550 AND ONE 2003 F-550 SUPERDUTY TRUCKS. INTERIOR FUEL TANK COATING IS DE-LAMINATING AND RUSTING AT AROUND 100,000 MILES.  VEHICLES STOP WITHOUT ANY WARNING. SILVERY MATERIAL IN WATER SEPARATOR AND FUEL FILTERS. I KNOW OF SEVERAL VEHICLE OWNERS THAT HAVE THIS SAME PROBLEM AND FORD WILL DO NOTHING. MY VEHICLES STOP SUDDENLY IN HEAVY TRAFFIC AND WE WERE LUCKY NO ONE WAS INJURED. I HAVE REPLACED THE 2003 AND ONE 2004 TANK ASSEMBLY.  OTHER 2004 IS SHOWING SILVERY RESIDUE ALSO. I KNOW OF A DEALER IN ST LOUIS MO., THAT HAS REPLACED MANY TANKS FOR CUSTOMERS WITH THE SAME PROBLEM. THIS IS A DEFECTIVE TANK COATING AND FORD SHOULD BE HELD RESPONSIBLE. IT IS MY UNDERSTANDING THEY (FORD) HAVE KNOWN OF THIS ISSUE SINCE 2005 AND WILL DO NOTHING. DO PEOPLE NEED TO BE HURT/KILLED BEFORE ACTION IS TAKEN? IS FORD STILL MAKING THESE TANKS WITH THE DEFECTIVE COATING, IF SO THEY SHOULD BE STOPPED ASAP BEFORE SOMEONE GETS KILLED BECAUSE A VEHICLE STALLS WITHOUT WARNING. THERE IS A TSB ON THE FUEL TANK VENT, MY VEHICLES HAVE BEEN TO FORD DEALERS AND THIS WAS NEVER BROUGHT TO MY ATTENTION. DO I HAVE TO ALWAYS ASK IF THERE IS A RECALL, TSB OR WHATEVER OR AM I AT FORD'S MERCY. SMACKS OF A COVER UP AND WILLFUL NEGLIGENCE.  *TR",
        "vin": "1FDAF56FX3E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "02/04/2009",
        "dateOfIncident": "02/02/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10257485,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 FORD MODEL 5500 F SERIES DUMP TRUCK WITH 43,000 MILES             DIESEL FUEL TANK DELAMINATION & DAMAGE CAUSED TO MOTOR. *TR",
        "vin": "1FDAF57P14E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "01/16/2009",
        "dateOfIncident": "01/04/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10255280,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 FORD F550 44K MILES TRUCK STOPPED RUNNING DEALER TOLD ME THAT THE FUEL TANK IS RUSTING FROM THE IN SIDE OUT. DEALER TOLD ME THAT THEY CHANGED OUT ABOUT 50 TANKS SO FAR AND FORD WOULD NOT COVER IT . FORD IS SAY ITS A FUEL PROBLEM. THIS FUEL PROBLEM IS NOT AFFECTING CHEVY TRUCK FUEL TANKS. THE MECHANIC LET ME LOOK IN SIDE OLD TANK YOU CAN SEE DEBRIS FLOATING IN TANK. FORDS FAILURE TO FIX THIS COST ME $2370. AND THE WORST PART THEY PUT THE SAME TANK IN NEW ONE BUT THE SAME. DEALER SAID I SHOULD LOOK FOR A AFTER MARKET TANK ONLINE THAT WHAT OTHER CUSTOMER ARE DOING. I READ ON LINE 75,000 TANK FAILURE SO FAR. FORD NEED TO ADMIT THEIR IS A PROBLEM. *TR",
        "vin": "1FDAF57P34E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "01/09/2009",
        "dateOfIncident": "11/17/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10254343,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "NOVEMBER 2008, OUR FORD TRUCK BROKE DOWN DUE TO FUEL PROBLEMS. TRUCK WAS TOWED IN AND FUEL FILTER WAS CHECKED. TINY SILVER FLAKES CLOGGED THE FILTER. MECHANIC ALERTED US THAT FORD IS HAVING A PROBLEM WITH THEIR FUEL TANK LINERS SEPARATING, AND THAT THEY ARE NOT TAKING CLAIM ON IT. TRUCK FILTER WAS CHANGED AND IT RAN FINE FOR ABOUT A MONTH.. WE PULLED THE FUEL FILTER AGAIN ONLY TO FIND \"FLAKES\" IN THE FILTER AGAIN. SEARCHED ON THE INTERNET SHOWED COUNTLESS PEOPLE HAVING THE SAME PROBLEM, AND HAVING TO DISH OUT THOUSANDS IN REPAIR COSTS ONLY TO HAVE IT HAPPEN AGAIN TO THEM. NO REPLACEMENT AVAILABLE ON THE MARKET THAT WILL SOLVE THE PROBLEM FOR GOOD, EVERYONE IS FORCED TO BUY FORDS REPLACEMENT. ALSO NO ONE KNOWS IF THIS WILL RESULT IN FAILURE OF THE FUEL FILTER AND INJECTORS DOWN THE ROAD AFTER THE WARRANTY ON THESE ITEMS RUNS OUT. *TR",
        "vin": "1FDAF56P44E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "12/01/2008",
        "dateOfIncident": "12/01/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10250420,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "CURRENTLY OWN A 2004 FORD F550 DUMP TRUCK WITH THE FUEL TANK DELAMINATING. FORD IS NOT WILLING TO ACCEPT RESPONSIBILITY FOR THIS FAILURE. HELP !!! *TR",
        "vin": "1FDAF56P94E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "04/24/2008",
        "dateOfIncident": "02/12/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10225623,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE A FORD 2004 F550  DUMP  OF WHICH THE FUEL TANK IS FLAKING AND CLOGGING UP  THE FILTERS  AND STALLING THE TRUCK OR NOT EVEN STARTING. FORD  DOES NOT WANT ANY RESPONSIBILITY FOR THIS REPAIR. I KNOW WE ARE NOT THE ONLY ONES OUT THERE WITH THIS PROBLEM ONLY WANT TO KNOW HOW LONG  FORD GETS AWAY WITH THIS  BEFORE SOMEONE STEPS UP  AND DOES SOMETHING . THIS REPAIR RUNS ANYWHERE FROM 1,800.00 TO 2,000.00 DOLLARS  ,I GUESS THIS IS JUST ANOTHER WIN FOR THE BIG GUYS AND SCREWING FOR US.  *TR",
        "vin": "1FDAF56P24E"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/28/2008",
        "dateOfIncident": "01/28/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10216260,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "1. DRIVER COMPLAINED OF NOISE IN FRONT END AND POOR HANDLING OF VEHICLE.  AFTER INSPECTION IT WAS FOUND THAT THE TRACK BAR MOUNT ON THE SPRING PAD WAS BROKEN.  2. TRACK BAR MOUNT BROKEN. POOR HANDLING (WANDERING) OF VEHICLE.  3. TRACK BAR MOUNT WAS WELDED AND BOXED FOR ADDED SUPPORT.  *CN",
        "vin": "1FDAF57P04E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/03/2007",
        "dateOfIncident": "08/02/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10198366,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 FORD F550.  THE CONTACT HAD THE HEAD GASKET REPLACED IN HIS VEHICLE TWO WEEKS AGO.  THE REPAIR COST $800.  IN AUGUST OF 2002, WHILE DRIVING 55 MPH, THE ENGINE FAILED WITHOUT WARNING.  HE STATED THAT THERE HAVE BEEN MULTIPLE ENGINE RELATED FAILURES OVER THE FOUR YEARS THAT HE HAS OWNED THE VEHICLE SUCH AS THE HOSES, PLANETARY GEAR, O-RING WAS REPLACED THREE OR FOUR TIMES, HEAD GASKETS, WIRING HARNESS FOR THE INJECTORS, INJECTORS, HIGH PRESSURE OIL PUMP, CLUTCH FAN, EGR COOLER, OIL COOLER, TURBO SYSTEM, OXYGEN SENSOR, EXHAUST SENSOR, AND LOWER RADIATOR HOSE.  THE CURRENT MILEAGE WAS 58,000 AND FAILURE MILEAGE WAS 6,000. UPDATED 01/02/08. *LJ",
        "vin": "1FDAF57P74E"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/12/2007",
        "dateOfIncident": "03/08/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10184880,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS A COMPLAINT ABOUT A 2004 FORD F-550 FOUR WHEEL DRIVE WITH A ONE MAN AERIAL DEVICE INSTALLED ON IT. ON MARCH 8TH 2007 OUR LINEMEN HAD BROUGHT THIS TRUCK INTO OUR SHOP TO UNLOAD TOOLS BEFORE THE TRUCK WAS TAKEN TO OUR NEAREST FORD DEALER TO HAVE A U-JOINT FIXED, BEFORE LEAVING THE SHOP THEY NOTICED THAT THE LEFT REAR DUAL WAS ALMOST READY TO FALL OFF THE TRUCK. UPON FURTHER EXAMINATION WE DISCOVERED THAT ALL THE LUG NUTS WERE EITHER MISSING, BROKE OFF OR FINGER TIGHT. WE HAD THE TRUCK TOWED TO THE LOCAL FORD DEALER , WE HAD TO HAVE BOTH RIMS REPLACED, THE REAR HUB , ALL THE STUDS AND WHEEL LUG NUTS REPLACED. THE RIGHT REAR DUAL WAS CHECKED AND FOUND TO BE LOOSE BUT NO DAMAGE WAS FOUND AT THIS TIME. LUCKY FOR OUR LINEMEN THAT THEY WERE IN THE SHOP WHEN THIS PROBLEM WAS DISCOVERED. THEY REPORTED HEARING SOME NOISE COMING FROM THE TRUCK BUT THOUGHT IT WAS THE U-JOINT GETTING WORSE. WE HAVE HEARD OF LOTS OF PROBLEMS WITH THE FORD F-550 WITH REAR DUALS AND WE FEEL THIS NEEDS TO BE CHECKED OUT MORE CLOSELY WITH FORD.   *JB",
        "vin": "1FDAF57P14E"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/22/2007",
        "dateOfIncident": "01/02/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10183245,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* - THE CONTACT  OWNS  A 2004 FORD F550.  THE CONTACT STATED THAT APPROXIMATELY 1 YEAR  THE VEHICLE HAD  AN ELECTRICAL SHORT., TOOK THE VEHICLE TO BE REPAIRED AND THAT VERY SAME DAY HAD  PROBLEMS WITH THE TRANSMISSION SLIPPING.  THE CONTACT STATED THAT APPROXIMATELY ONE YEAR LATER IN JANUARY 2007 THE TRANSMISSION WOULD NOT ENGAGE, AND ONE  COULD DRIVE DOWN THE ROAD AND THE TRANSMISSION WOULD JUST STOP WORKING.   THE TRUCK WAS CURRENTLY IN THE REPAIR SHOP, AND IT HAS TAKEN FORD OVER A WEEK TO DIAGNOSE THE PROBLEM.   THE CURRENT DIAGNOSIS SHOWED THAT ALL 4 SOLENOIDS IN THE TRANSMISSION NEEDED TO BE REPLACED.  THE CONTACT STATED THAT THE TRANSMISSION NEEDS TO BE TOTALLY REPLACED.  THE CONTACT STATED THAT NEITHER SPEED NOR THE WEATHER WERE FACTORS.    *AK  THE DEALER STATED PERFORMED THE RECALL PERTAINING TO FUEL INJECTOR CONTROL MODULE WIRING AND CHARGED AIR COOLER DUCT.  *TR",
        "vin": "1FDAF56P34E"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/19/2006",
        "dateOfIncident": "09/11/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10168701,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A NEW MOTORHOME BUILT ON A FORD CHASSIS AND FOUND ONE OF THE WHEELS (STEEL RIM) TO BE THE WRONG SIZE.  IT IS UNDER-RATED IN WEIGHT CARRYING CAPACITY FOR THE SIZE OF THE VEHICLE.  FORD IS REFUSING TO CORRECT THIS SAFETY DEFECT.  *NM",
        "vin": "1F6NF535640"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/17/2006",
        "dateOfIncident": "07/07/2006",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10165792,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JULY 7 2006 AT 8:00AM I WAS NOTIFIED BY OUR BRANCH MANAGER IN THE HARTFORD CT AREA THAT ONE OF OUR TRUCKS WAS TOTALED DUE TO FIRE THAT BURNED DOWN THE TRUCK OVERNIGHT. OUR DRIVER PARKED THE TRUCK AT HIS DRIVEWAY AT HONE AT 10:00PM, AND THE FIRE TOOK PLACE AT 2:00AM, 4 HOURS AFTER HIS ARRIVAL HOME. I WENT TO SEE THE TRUCK AND MET THE FIRE MARSHAL OF THE TOWN OF COLCHESTER CT WHERE THE DRIVER RESIDES. THE TRUCK WAS COMPLETELY BURNED, AND ACCORDING TO THE FIRE MARSHALL THE FIRE STARTED AT THE TURBO UNIT OF THE TRUCK. THIS WAS A 2004 FORD F550 CAB-CHASSIS TRUCK VIN NUMBER [XXX] WITH 28,000 MILES. IT WAS UNDER THE 3 YEARS 36,000 MILES WARRANTY OF FORD. I CONTACTED FORD AND THEY HAD AN INDEPENDENT ENGINEERING COMPANY THAT CAME TO EXAMINE THE TRUCK. A REPORT ON THEIR FINDING WAS ISSUED TO FORD. BASED ON THIS REPORT FORD ISSUED A LETTER TO ME ON AUGUST 11 2006. THEY CLAIMED THAT NO MANUFACTURING DEFECT WAS VERIFIED, AND THEREFORE FORD IS NOT RESPONSIBLE FOR THE FIRE. BASED ON THESE FINDING FORD CLOSED THIS CASE. IT IS VERY CLEAR TO ANYONE WHO LOOKED AT THE TRUCK.  *NM  UPDATED 07/12/2012 *JS    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6)",
        "vin": "1FDAF56P64E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "02/17/2006",
        "dateOfIncident": "02/09/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10150497,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "FOLLOW UP TO ORIGINAL COMPLAINT  I HAD ORIGINALLY THOUGHT THAT A MISSED RECALL REPAIR WAS THE REASON FOR THE ENGINE STALLING...AND NOT RESTARTING.  AFTER HAVING THE VEHICLE TOWED AND INSPECTED BY HUB CITY FORD...THE MECHANICS FOUND SLIME IN BOTH FUEL TANKS.  THE SLIME HAD CLOGGED THE FUEL SYSTEM AND CAUSED THE MOTOR TO STOP.  HUB CITY FORD'S PERSONNEL WERE ALL AS SURPRISED AS I WAS.  THEY WERE HELPFUL IN SHOWING EXTRA ATTENTION TO THIS...AND HAVE REPAIRED IT ALL.  I BELIEVE THE SLIMY SUBSTANCE HAD BEEN PUT IN BEFORE THEY HAD IT...AND BEFORE I BOUGHT IT.  POSSIBLY DURING THE PREVIOUS OWNERSHIP.  THIS IS TO CLOSE THIS COMPLAINT. I AM SATISFIED WITH ALL HUB CITY FORD HAS TAKEN CARE OF FOR ME...WITH GREAT CARE.  THE SALES PERSON I BOUGHT IT WITH...MR. BILL BOUDRIER...THE SERVICE MGR....MR. CARROLL AND THE TECH'S.  THANK YOU. *JB",
        "vin": "1FDAW56P64E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, DIESEL,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/10/2006",
        "dateOfIncident": "02/10/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10149993,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING A FORD F-550 THAT I BOUGHT USED ON 01-25-06 FROM HUB CITY FORD IN LAFAYETTE, LA...THE ENGINE LOST POWER AND STALLED ON A 65 MPH. HWY (HWY 90).  APPARENTLY...THERE IS GOOD CAUSE TO BELIEVE THAT AN IGNORED RECALL ON THIS SPECIFIC TRUCK IS THE EXACT REASON FOR THIS DANGEROUS FAILURE. NOT TO MENTION THE NOW LOST INCOME FROM IT BEING IN THE WAITING LINE AT HUB CITY FORD...WHERE I HAD IT TOWED.  I WAS PROMISED THAT ALL WAS INSPECTED AND IN GOOD WORKING ORDER PRIOR TO DRIVING THE TRUCK OFF THE LOT. WELL...IT WASN'T.  I CHOSE TO SEE IF THERE WERE ANY RECALL ISSUES WITH THIS TRUCK'S VIN NUMBER AT THE FORD RECALLS WEBSITE...  YES...THIS WAS WHAT I SAW:  RECALLS RESULTS :   BE ADVISED THAT THIS SYSTEM TRACKS SAFETY AND EMISSION RECALLS FOR WHICH VEHICLES ARE SUBJECT TO REPAIR IN THE UNITED STATES. FOR MORE INFORMATION ON FORD MOTOR COMPANY RECALLS OR CONCERNS YOU MAY BE HAVING WITH YOUR VEHICLE, PLEASE CONTACT YOUR DEALERSHIP DIRECTLY.  BELOW YOU WILL FIND INFORMATION REGARDING YOUR AFFECTED VEHICLE.  RECALLS LISTED     2004 FORD F-550 [XXX]     05E15  EXHAUST PRESSURE SENSOR REPLACEMENT, ON-BOARD DIAGNOSTIC SYSTEM AND ENGINE CONTROL MODULES RECALIBRATION   FROM YOUR WEBSITE HERE:  MAKE : FORD MODEL : F550 SUPER DUTY YEAR : 2004   MANUFACTURER : FORD MOTOR COMPANY     NHTSA CAMPAIGN ID NUMBER : 05V270000  MFG'S REPORT DATE : JUN 07, 2005   COMPONENT: ELECTRICAL SYSTEM:WIRING   POTENTIAL NUMBER OF UNITS AFFECTED : 180104   SUMMARY:    CERTAIN PICKUP TRUCKS, SPORT UTILITY VEHICLES AND VANS EQUIPPED WITH 6.0L DIESEL ENGINES MAY EXPERIENCE STALLING WITHOUT WARNING WHILE DRIVING AND MAY OR MAY NOT RESTART.    CONSEQUENCE:    SHOULD THE ENGINE STALL, A VEHICLE CRASH COULD OCCUR.   REMEDY:    DEALERS WILL UPGRADE THE FUEL INJECTION CONTROL MODULE (FICM) WIRE HARNESS OR REPLACED, AND/OR HAVE A NEW INJECTION CONTROL PRESSURE (ICP)) SENSOR CONNECTOR INSTALLED FREE OF CHARGE. THE RECALL BEGAN ON JULY 22, 2005.    FORD RECALL NO. 05S34. *NM  UPDATED 07/17/2012 *JS     INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6)",
        "vin": "1FDAW56P64E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/27/2005",
        "dateOfIncident": "10/24/2005",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10140931,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUCK WAS TAKEN TO DEALER FOR OVERHEATING PROBLEM.  ON THE FIRST TRIP OUT WITH THE TRUCK AFTER BEING PICKED UP FROM THE DEALERSHIP, THE TRUCK OVERHEATED AND CAUGHT FIRE.  EXTENSIVE DAMAGE AND NEITHER DEALERSHIP OR FORD WANT TO INVESTIGATE SOURCE OF FIRE.  TRUCK WAS UNDER WARRANTY AT THE TIME OF THE INCIDENT.  *NM",
        "vin": "1FDAF57PX4E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/06/2005",
        "dateOfIncident": "06/10/2005",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10138758,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LOSS VEHICLE IS A 2004 FORD F-550 CHASSIS WITH A TOW BODY, WHITE IN COLOR. A 7.3 LITER POWER STROKE TURBO DIESEL ENGINE POWERS THE VEHICLE. THE VEHICLE ID NUMBER IS [XXX]. MACK TOWING OWNS THE TRUCK IN MIAMI, FLORIDA. THE VEHICLE WAS BEING DRIVEN WHEN THE OPERATOR NOTICED THE VEHICLE LOSING POWER AND THEN STALLED. HE THEN NOTICED SMOKE AND SAW FIRE UNDER THE HOOD IN THE ENGINE COMPARTMENT. EXAMINATION OF THE EXTERIOR REVEALED THAT THE FIRE ORIGINATED IN THE ENGINE COMPARTMENT, PROGRESSED TO THE EXTERIOR CAUSING FIRE DAMAGE TO THE HOOD AND BOTH FENDERS. FURTHER EXAMINATION OF THE EXTERIOR REVEALED THAT PRIOR TO THIS EVENT EXTERIOR WAS IN OVERALL GOOD CONDITION ALL WINDOW GLASS WAS BROKEN AND MELTED DUE TO THE FIRE. THE FRONT TIRES AND WHEELS WERE ALSO PRESENT AND DAMAGED BY FIRE. THE REAR TIRES AND WHEELS WERE IN GOOD CONDITION. THE TIRE TREAD DEPTH ON THE REAR TIRES WAS 7/32 WHILE THE FRONT WAS LESS. NO COMPONENTS WERE NOTED AS BEING MISSING FROM THE EXTERIOR OF THE VEHICLE. EXAMINATION OF THE INTERIOR OF THIS VEHICLE REVEALED THAT THE FIRE, WHICH ORIGINATED IN THE ENGINE COMPARTMENT, PROGRESSED INTO THE INTERIOR TOTALLY DESTROYING IT. NO COMPONENTS WERE NOTED AS MISSING. EXAMINATION OF THE ENGINE COMPARTMENT AND THE BURN PATTERNS NOTED THAT THE POINT OF ORIGIN WAS THE RIGHT SIDE FIREWALL OF THE ENGINE COMPARTMENT. EXAMINATION OF THE WIRING  FOUND IN THIS AREA NOTED MANY AREAS OF DAMAGE WHICH MAY HAVE CONTRIBUTED TO OR BEEN CAUSED BY THE FIRE. THE POINT OF ORIGIN OF THE FIRE WAS AT THE POSITION WHERE THE ELECTRIC BLOWER FAN, MOTOR AND SHROUD HAD BEEN BEFORE THE FIRE, BUT WERE MISSING AT THE MOMENT OF THE EXAMINATION.. THIS SPOT WAS THE MOT HEAVILY DAMAGED POINT OF THE ENTIRE VEHICLE. EXAMINATION OF THE ENGINE AND TRANSMISSION FOUND NO SIGNS OF ANY OIL LEAKS THAT CONTRIBUTED  OR TO BE CAUSED BY THE FIRE. ALL OTHER CAUSES WERE ELIMINATED AS A CAUSE FOR THIS FIRE.  *JB UPDATED 07/18/2012 *JS    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6)",
        "vin": "1FDAF56P94E"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/12/2005",
        "dateOfIncident": "06/22/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10128269,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  PURCHASED NEW FORD 2004 F550 TRUCK IN JULY 2004 AND VEHICLE HAD TO BE SERVICES FOR TRANSMISSION PROBLEMS ON SEPTEMBER 2004, NOVEMBER2004, DECEMBER 2004, MAY 2005 AND  JUNE 2005.  ALL INSTANCES, TRANSMISSION WAS NOT SHIFTING GEARS AND TURBO BLEW OUT. THE TRANSMISSION PROBLEMS OCCURRED UNDER 1400 MILES AND THE SPEED WHEN ALL INCIDENTS HAPPENED WAS 40-45 MPH. TRUCK WAS SERVICED BY FORD DEALER IN ALL INCIDENTS.  TRUCK WOULD WORK FOR TWO OR THREE WEEKS THEN STARTED HAVING PROBLEMS SUCH AS VIBRATION AND A LOAD NOISE WHILE DRIVING.   *NM",
        "vin": "1FDAF56P94E"
    },
    {
        "components": "FUEL SYSTEM, OTHER,POWER TRAIN,ELECTRICAL SYSTEM,AIR BAGS,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/09/2005",
        "dateOfIncident": "07/01/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10132084,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THE VEHICLE SURGED AND ACCELERATED ON ITS OWN.  THIS  HAPPENED THIS HAS HAPPENED  A T LEAST  50 TIMES OR MORE.  WHILE  DRIVING 43 MPH VEHICLE SHUT DOWN. HAD TO SLAM ON THE EMERGENCY BRAKE AND PULL IT TO THE CURB.  ALSO, WHILE DRIVING AT 38 MPH OR 1100 RPMS THERE WAS    VIBRATION COMING FROM THE ENGINE.  IT FELT LIKE IT WAS COMING RIGHT FROM CONSUMER'S FEET.  IT FELT  LIKE TRANSMISSION DISENGAGED.  THEN, AFTER 10-15 SECONDS IT FELT LIKE IT KICKED BACK IN.  THERE WAS A LOUD POP WHEN THIS HAPPENED.  THE VEHICLE WAS BURNING MORE FUEL THAN IT DID WHEN FIRST PURCHASED IT.  SOMETIMES THE WATER AND FUEL LIGHTS CAME ON.  THE DEALER TOLD HIM THAT WHEN THIS HAPPENED  HE SHOULD PULL OVER. BUT WHEN HE DOES THERE IS NO WATER IN THE FUEL.  THE FUEL GAUGE WILL COMPLETELY GO TO LOW THEN COME BACK UP AFTER ABOUT 10-15 MILES.    ALSO, THE AIR BAG LIGHT WILL COME ON.  WHEN HE TAKES VEHICLE TO THE DEALER THEY USUALLY GO THROUGH THE WHOLE VEHICLE,  SPECIFICALLY THE ELECTRICAL SYSTEMS.  THE DEALERSHIP TRIED BUT FAILED TO FIX THESE PROBLEMS.  HAD TAKEN  THE VEHICLE TO A VARIETY OF DEALERSHIPS MULTIPLE TIMES.  THE TURBO, TRANSMISSION  AND WIRING WAS REPLACED.  THE DEALER TOLD THE CONSUMER THAT THE VEHICLE HAD NOT BEEN CODED WHEN HE PURCHASED IT.  *AK",
        "vin": "1FDAF56P44E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/13/2005",
        "dateOfIncident": "11/01/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10128618,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THE CONSUMERS 2004 FORD F550 SD STALLED.   THE DEALER WAS UNABLE TO DUPLICATE THE CONSUMERS CONCERN. *JB",
        "vin": "1FDAX57P14E"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/22/2005",
        "dateOfIncident": "02/08/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10119055,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE STALLED WITHOUT WARNING WHILE DRIVING. WHEN THIS OCCURRED THE VEHICLE WOULD LOSE BRAKING POWER. GVW IS 17500 MAKING IT VERY DIFFICULT TO CONTROL THE VEHICLE WHEN IT STALLS. THE  VEHICLE HAS BEEN SERVICED SEVERAL TIMES IN WHICH THE  HARNESS HAS BEEN REPLACED, BUT THE FAILURE STILL EXISTS.  *JB",
        "vin": "1FDAW57P34E"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/02/2005",
        "dateOfIncident": "03/01/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10113759,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONSUMER'S 2004 FORD F550 HAS HAD THREE SETS OF BATTERIES SINCE PURCHASED.  THE CONSUMER BELIEVES THE VEHICLE HAS AN ELECTRICAL PROBLEM.   *NM",
        "vin": "1FDAW57PX4E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/03/2004",
        "dateOfIncident": "10/05/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10095159,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE SHIFTING, THE TRANSMISSION  DOWN SHIFTED ON ITS OWN.  THE TRANSMISSION SURGED, AND THE VEHICLE BLEW OUT BLUE SMOKE.  THE CONSUMER DROVE VEHICLE TO THE  DEALER, AND THE MECHANIC DETERMINED THAT EBP SENSOR NEEDED TO BE REPLACED.   *AK   THE ENGINE LOADED UP WITH FUEL, SMOKE, SURGING WHEN DOWN SHIFTED WHEN THE BRAKE WAS APPLIED, AND SEVERE MISSING WHEN GEARS WENT DOWN TO FIRST, ALL OCCURRED AS THE VEHICLE WAS IN THE TOW HAUL POSITION.  WHEN THE PROBLEM OCCURRED ON ICE OR SNOW COVERED ROADS.   *SC",
        "vin": "1FDAW57P44E"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/03/2004",
        "dateOfIncident": "10/28/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10095520,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE CONSUMER APPLIED THE ACCELERATOR, THE VEHICLE LOST POWER. THE CONSUMER HAS BEEN HIT A TOTAL OF 3 TIMES DUE TO THIS PROBLEM. THE VEHICLE HAS BEEN TAKEN INTO THE DEALER A TOTAL OF FIFTEEN TIMES.  FORD TOLD THE CONSUMER THAT THE PROBLEM WAS HIS AND TO GO GET A LAWYER. PLEASE PROVIDE ANY FURTHER INFORMATION.  *JB  VEHICLE JERKS AT TIMES WHILE LOOSING POWER. THE CONSUMER FILED CASE WITH A LAWER.  *TC",
        "vin": "1FDAX57P94E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/21/2004",
        "dateOfIncident": "08/17/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10097370,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, THE VEHICLE STALLED. THE CONSUMER HAD THE VEHICLE TOWED.  PLEASE PROVIDE MORE INFORMATION. *JB",
        "vin": "1FDAF57P44E"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/19/2004",
        "dateOfIncident": "05/17/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10079949,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONSUMER STATED THE BRAKE AND ACCELERATOR PEDALS WERE DESIGNED TOO CLOSE. *AK  *SC  *JB",
        "vin": "1FDAF57564E"
    }
]