[
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "05/31/2013",
        "dateOfIncident": "05/31/2013",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10514452,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "SANDPIPER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MY COMPLAINT IS THAT DOMETIC WILL DO NOTHING TO REPAIR THE WELL KNOWN DEFECT FROM THE MANUFACTURE OF THEIR COOLING SYSTEMS CONCERNING THE PREMATURE FAILURE OF THE BOILER TUBE. FIRST OF ALL DOMETRIC ISSUED A RECALL BECAUSE OF FIRES THAT RESULTED WRONGFUL DEATH AND PROPERTY DAMAGE LAWSUITS. THEY CAME OUT WITH A PREVENTATIVE SOLUTION AFTER THE FACT (I'M NOT ALONE HERE) TO INSTALL A HIGH TEMP. CUT OUT SWITCH SO AS TO PREVENT THE UNIT FROM STARTING A FIRE. THIS MEASURE DID NOT DO ANYTHING TO ADDRESS THE PREMATURE FAILURE OF THE BOILER UNIT. THIS LEAVES THE OWNERS OF THEIR UNITS RESPONSIBLE FOR REPLACEMENT COST AND DOMETIC COMPLETELY GETS AWAY WITH A WELL KNOWN AND DOCUMENTED POORLY DESIGNED COOLING UNIT. WHEN ONE LISTENS TO THE RECORDING ON THE RECALL LINE  DOMETIC ADMITS THAT THERE WAS A DESIGN FLAW.   *TR",
        "vin": "4X4FSAN275C"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/22/2013",
        "dateOfIncident": "01/20/2013",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10493838,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "SANDPIPER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 FOREST RIVER SANDPIPER SPORT TRAILER. THE CONTACT STATED THAT WHILE DRIVING 30 MPH, THE ALL THREAD BOLT THAT HELD THE PROPANE TANKS BECAME UNSCREWED AT THE BASE OF THE FRAME. AS A RESULT, THE PROPANE TANKS BECAME LOOSE, ROLLED OFF THE VEHICLE AND UNDER THE TRAILER. THE CONTACT WAS ABLE TO MAINTAIN CONTROL OF THE VEHICLE. THE VEHICLE WAS NOT TAKEN TO THE DEALER. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE BUT DID NOT OFFER ANY ASSISTANCE SINCE THEY STATED THAT IT WAS SOMETHING THAT THE CONTACT NEEDED TO CONTINUOUSLY CHECK TO MAKE SURE IT WAS NOT BECOMING LOOSE. THE VEHICLE WAS NOT REPAIRED. THE VIN WAS NOT AVAILABLE. THE FAILURE AND CURRENT MILEAGE WAS 40,000.   UPDATED 2/12/13 *CN UPDATED 02/15/2013 *JS",
        "vin": ""
    }
]