[
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/03/2009",
        "dateOfIncident": "01/09/2007",
        "fire": false,
        "manufacturer": "FOUR WINDS INTERNATIONAL",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10290796,
        "products": [
            {
                "manufacturer": "FOUR WINDS INTERNATIONAL",
                "productMake": "FOUR WINDS",
                "productModel": "HURRICANE",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 FOUR WINDS HURRICANE MOTOR HOME. THE MOTOR HOME SHAKES VIOLENTLY AT ANY SPEED WHEN IT HITS A BUMP ON THE ROAD. THE DEALER BALANCED THE TIRES AND ALIGNED THE FRONT END; HOWEVER THE FAILURE WAS NOT CORRECTED. HE CONTACTED FORD. FORD TOLD HIM TO TAKE THE VEHICLE TO THE WEIGHT STATION TO MAKE SURE THE WEIGHT WAS BALANCE CORRECTLY. HE CONTACTED FOUR WINDS AND THEY TOLD HIM IT WAS NOT THEIR PROBLEM.  THE FAILURE MILEAGE WAS 20,411 AND THE CURRENT MILEAGE WAS 30,000.  THE MOTOR HOME WAS NOT REPAIRED.      UPDATED 12/09/09  *BF  THE CONSUMER STATED WHITLE DRIVING ON A ROUGH ROAD, THE RV WILL SOMTIEMS SHAKE VIOLENTLY AND THE ONLY WAY TO STOP IT, IS TO COME TO A COMPLETE STOP.",
        "vin": "1F6LF53S140"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "09/29/2009",
        "dateOfIncident": "12/16/2005",
        "fire": false,
        "manufacturer": "FOUR WINDS INTERNATIONAL",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10285671,
        "products": [
            {
                "manufacturer": "FOUR WINDS INTERNATIONAL",
                "productMake": "FOUR WINDS",
                "productModel": "HURRICANE",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A DEFECT SERVICE BULLETIN WHICH STATES THAT 2004 FOUR WINDS, HURRICANE MOTORHOMES ARE EQUIPPED WITH A 3 POINT SHOULDER HARNESS SEAT BELTS AND MAY HAVE A DEFECT. I HAD THE COACH IN ON JULY 18, 2006 AT MCMAHON'S RV IN COLTON, CA, PICKED IT UP ON AUG 2, 2006, WHEN I WAS THERE PICKING UP THE  COACH I WAS TOLD THE REPLACEMENT BELTS CAME IN TOO LATE TO BE INSTALLED, I ASK THEM IF I COULD TAKE THE BELTS AND HAVE THEM INSTALLED BY ANOTHER RV DEALER CLOSER TO ME, WAS TOLD NO, THE COACH IN FOR REPAIRS AGAIN AND ASK THEM IF THEY COULD ORDER THE BELTS AND GET THEM INSTALLED, THEY TOLD ME IT WAS A CAMPAIGN AND IT WAS EXPIRED, THERE IS NO EXPIRATION DATE ON MY NOTICES. DON'T UNDERSTAND WHY I CANNOT HAVE THESE BELTS REPLACED WHILE IT IS IN HAVING REPAIRS DONE. THE COACH IS AT MCMAHON'S IN IRVINE. PLEASE RESPOND AS SOON AS POSSIBLE, MY MH IS ALMOST DONE AND READY FOR ME TO PICK IT UP. *TR",
        "vin": "1FCNF53S730"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/17/2006",
        "dateOfIncident": "10/22/2004",
        "fire": true,
        "manufacturer": "FOUR WINDS INTERNATIONAL",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10172234,
        "products": [
            {
                "manufacturer": "FOUR WINDS INTERNATIONAL",
                "productMake": "FOUR WINDS",
                "productModel": "HURRICANE",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER COMPLAINT CONCERNING 2004 FOUR WINDS CLASS A HURRICANE RECALL ON BRAIDED FUEL SUPPLY LINE.  *TS  THE CONSUMER RECEIVED RECALL 04V249000 ON THE BRAIDED FUEL SUPPLY LINE.  A REPAIR FACILITY REPAIRED THE RECALLED PART.  AFTER THE PART WAS REPLACED THE VEHICLE CAUGHT ON FIRE.   *NM",
        "vin": "5B4MP67G543"
    }
]