[
    {
        "components": "SUSPENSION,STRUCTURE,WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/28/2014",
        "dateOfIncident": "06/09/2014",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10616805,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "WILDCAT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS 2004 FOREST RIVER WILDCAT 26FBS TRAVEL TRAILER SUFFERED FROM A FAILURE OF THE TRAILER FRAME, SPECIFICALLY WITH THE HANGER BRACKETS THAT SERVE AS THE ATTACHMENT POINT FOR TORSION AXLES TO THE TRAILER ITSELF. THE DAMAGE INITIALLY WENT UNNOTICED, BUT UPON ARRIVAL AT HOME I NOTICED THAT THE REAR-MOST TIRES OF THE TRAILER WERE NOT MAKING CONTACT WITH THE GROUND ON AN INCLINE.CLOSER INSPECTION OF THE TRAILER REVEALED THAT THE REAR MOST HANGER BRACKETS HAD BROKEN ON THE TRAILER (NOT THE AXLES THEMSELVES) AND THE AXLE HAD SPUN INTO A LOCKED POSITION, STILL ATTACHED BY THE FRONT TWO RETAINING BOLTS. THERE ARE A TOTAL OF FOUR ATTACHMENT BOLTS PER AXLE, THE RESULT WAS THAT THE AXLE ONLY REMAINED ATTACHED BY TWO BOLTS AND HANGERS. INSPECTION AND REPAIR  BY A CERTIFIED WELDER INDICATED THAT THE HANGER BRACKETS SUFFERED FROM WEAK WELDS AND THIS RESULTED IN THE FAILURE. ADDITIONALLY, THE WELDER REPAIRED ONE OF THE TWO REMAINING FUNCTIONING ATTACHED HANGER BRACKETS NOTING ITS WEAKNESS.   *JS",
        "vin": "4X4TWCB274V"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/25/2013",
        "dateOfIncident": "07/06/2013",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10531782,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "WILDCAT",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "MARATHON ST",
                "productYear": "9999",
                "size": "ST225/75R15",
                "type": "Tire"
            }
        ],
        "summary": "I PURCHASED FOUR NEW GOODYEAR MARATHON TRAILER TIRES (225/75/15 LOAD RANGE D) FOR MY FIFTH WHEEL CAMPER JUNE 2012.  TWO OF THE FOUR TIRES BLEW APART IN THE FIRST 1500 MILES.  THERE IS SOMETHING VERY WRONG WITH THESE TIRES.  THEY SHOULD NOT BE BLOWING APART WITH ALMOST NO USE AND WITHOUT ANY IMPACT DAMAGE FROM ROAD HAZARDS.  I HAVE READ MULTIPLE COMPLAINTS ONLINE WITH THESE SAME TIRES.  THIS IS VERY DANGEROUS AND IT NEEDS TO BE ADDRESSED SOON.  THESE TIRE FAILURES HAVE DAMAGED MY CAMPER BUT, I'M JUST GLAD IT DID NOT CAUSE A CRASH, INJURY, OR DEATH. *TR",
        "vin": "4X4FWCD294V"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/16/2010",
        "dateOfIncident": "04/07/2010",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10326061,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "WILDCAT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2004 FIFTH WHEEL TRAILER.  I HAVE NOTICED THE WEB OF THE FRAME CRACKING OVER THE SHACKLE MOUNTS FOR SOME TIME AND HAVE BEEN KEEPING A CLOSE EYE ON IT.  I HAVE JUST NOTICED NOW THAT THE FRAME IS BROKEN UP NEAR THE HITCH AND CAN NO LONGER BE TOWED WITH OUT REPAIR.  I HAVE NOT, IN MY OPINION, ABUSED THIS TRAILER OR USED IT OUTSIDE IT'S INTENDED USE.  I AND OTHERS, ARE FORTUNATE THAT I NOTICED THE BROKEN FRAME BEFORE IT CAUSED AN ACCIDENT. *TR",
        "vin": "4X4FWCD274T"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/18/2008",
        "dateOfIncident": "10/16/2008",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10252219,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "WILDCAT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM AN OWNER OF A 2004 WILDCAT, 28? FIFTH WHEEL. DURING A TRIP I NOTICED ONE OF THE TIRES WAS WORN TO THE CORD ON THE INSIDE EDGE, WHILE STILL HAVING TREAD ON THE OUTSIDE. IF THIS HAD NOT BEEN NOTICED, I?M SURE THAT WITHIN THE NEXT 100 MILES I WOULD HAVE BEEN CHANGING A TIRE ON THE SIDE OF THE ROAD WITH RUBBER FROM THE TIRE EVERYWHERE. THE TIRE WAS CHANGED AND TRIP CONTINUED.  UPON RETURN, I DISCUSSED THE ISSUE WITH THE SERVICE MANAGER AT THE RV DEALER AND HE REFERRED ME TO A SPECIALIST SHOP THAT HAD THE EQUIPMENT TO CHECK THE SUSPENSION. IT WAS FOUND THAT THE ?TOE IN? ON BOTH AXLES WERE OUT BY 1/2 INCH AND THE PROBLEMS WERE OUTSIDE THE SPRING HANGERS (SPINDLE TO AXLE ALIGNMENT). PRIOR TO MAKING THE REPAIRS, I CONTACTED AL-KO KOBER BECAUSE THERE HAD BEEN SOME DISCUSSION ON THE INTERNET (RV.NET) ABOUT DEFECTIVE AXLES BEING MANUFACTURED IN THAT TIMEFRAME.  THE INFORMATION ON THE AXLE STATED (MODEL T52 3, DATE 25?03, SLR 373MM, 5200 LBS). THEIR RESPONSE WAS THAT  THEY DID NOT HAVE A RECALL, AXLES WERE OUT OF WARRANTY (2 YEARS) BUT THEY DID REPLACE DEFECTIVE AXLES IF:   1.THE AXLES WERE SHIPPED TO THEM  2.THEY VERIFIED THAT THE AXLES WERE DEFECTIVE  3.THEY WOULD SHIP NEW AXLES.   OF COURSE, THIS DID NOT INCLUDE LABOR, TIRES, TRAVEL TIME OF HAULING TRAILER TO DEALER, SUSPENSION SHOP, OR ANY OTHER COMPONENTS ASSOCIATED WITH THE AXLES.    SINCE THE ABOVE RESPONSE WAS VERY ?IFFY? AND TIME CONSUMING AND SINCE I HAD THE TRAILER AT THE SUSPENSION SHOP, I CHOSE TO UPGRADE AXLES TO 6,000# AND THE SPRINGS TO SIX LEAVES VS THE FOUR THAT WAS THE STANDARD EQUIPMENT.  WHEN THE ?TOE IN? ON THE NEW AXLES WAS CHECKED, IT WAS WITHIN 1/16?. I HAVE DOCUMENTED THIS UNDER FOREST RIVER BECAUSE THERE IS NO PROVISION TO DOCUMENT AS AN ?AXLE? ISSUE. REFERENCE SIMILAR COMPLAINTS 10199333, 10174036, 10169948,10169990. *TR",
        "vin": "4X4FWCC2X4V"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "12/05/2008",
        "dateOfIncident": "12/03/2008",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10250809,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "WILDCAT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 FOREST RIVER FORESTER.  THE CONTACT RECEIVED A RECALL NOTICE REGARDING THE DOMETIC REFRIGERATOR.  HE WAS NOT SATISFIED WITH THE REMEDY TO REPAIR THE FAILURE BECAUSE IT CONSISTED OF PLACING A HEAT SHIELD OVER THE FAILED EQUIPMENT IN CASE A FIRE OCCURS.  HE FELT THAT THE ENTIRE REFRIGERATOR UNIT SHOULD BE REPLACED BECAUSE THE BOILER TUBES FAILED.  THE VEHICLE IS IN THE PROCESS OF BEING REPAIRED.  THE MANUFACTURER WAS NOT NOTIFIED.  THE VIN, NHTSA CAMPAIGN ID   UPDATED 01/08/09. *JB",
        "vin": "4X4FWCC244V"
    },
    {
        "components": "SUSPENSION,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/29/2008",
        "dateOfIncident": "09/01/2008",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10243755,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "WILDCAT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT AND REAR AXLES ON 2004 WILDCAT TRAILER HAVE AN ISSUE WITH RUST.   *NJ",
        "vin": "4X4TWCB244T"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/04/2008",
        "dateOfIncident": "07/27/2008",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10236844,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "WILDCAT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 FOREST RIVER TRAVEL TRAILER.  WHILE ACCELERATING AT 35 MPH, THE TRAILER FISHTAILED.  BOTH AXLES SEPARATED FROM THE TRAILER.  THE WELDING SHOP STATED THAT THERE WERE SUPPOSED TO BE FOUR BOLTS HOLDING THEM TOGETHER, BUT THREE HAD SHEARED AND THE STEEL USED WAS NOT THE APPROPRIATE THICKNESS TO SUPPORT A VEHICLE OF ITS CAPACITY.  THERE WERE ONLY TWO WELDS ON THE TRAILER.  THE WELDING SHOP HAS ATTEMPTED TO CONTACT THE MANUFACTURER ON SEVERAL OCCASIONS, BUT HAS NOT BEEN SUCCESSFUL.  THE FAILURE MILEAGE WAS UNAVAILABLE. UPDATED 09/24/08. *LJ  UPDATED 10/01/08. *JB",
        "vin": "4X4TWCE274V"
    },
    {
        "components": "STRUCTURE,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "03/26/2007",
        "dateOfIncident": "12/22/2006",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10186206,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "WILDCAT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*- THE CONTACT OWNS A 2007 FOREST RIVER WILDCAT,  27 RL SE, 5TH WHEEL TRAILER.  THE RV WAS PURCHASED IN DECEMBER 2006 AND SINCE THEN HE OBSERVED THAT THE ACTUAL WEIGHT WAS MORE THAN  THE WEIGHT LISTED ON THE STICKER.   THE  PICK UP TRUCK WAS UNABLE TO TOW THE RV.  THE CAB SCALES  WERE ACCURATE, AND ALSO INDICATED THAT THE STICKER WEIGHT  WAS INCORRECT.  FOREST RIVER, THE MANUFACTURER  AGREED TO MAIL HIM A CHECK AND REPURCHASE THE VEHICLE, HOWEVER, THE DEALER A WANTED  TO SELL HIM ANOTHER RV WHICH WEIGHED  LESS.  AND BELIEVED THAT THE COST SHOULD BE SHARED EQUALLY BETWEEN THE CONTACT, THE MANUFACTURER, AND THE DEALER. THE CONTACT CURRENTLY DID  WANT TO PULL THE TRAILER BECAUSE IT WEIGHT TOO MUCH AND WAS A SAFETY RISK.  *AK",
        "vin": "4X4FWCC257V"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/10/2006",
        "dateOfIncident": "09/12/2006",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10170375,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "WILDCAT",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "WE WERE HAULER OUR 28' WILDCAT TRAVEL TRAILER ON OUR WAY TO RENO.  ABOUT 40 MILES SOUTH OF LONE PINE WE HAD A BLOW OUT ON THE RIGHT FRONT TRAILER TIRE.  THE ONE NEXT TO IT WAS SEPARATED ALSO. WHEN THE TIRE BLEW IT TOOK OUT THE FENDER SKIRT AND ALL THE INSULATION AND SKIN DIRECTLY ABOVE THE TIRE. I HAD TO PUT ON THE SPARE TIRE AND TRAVELED TO LONE PINE AT 45 MPH AND SPENT THE NIGHT THERE AS IT WAS TOO LATE TO GO TO THE TIRE STORE.  THE NEXT MORNING WE WENT TO MILLER TOWING AND TIRES IN LONE PINE AND GOT 5 NEW TIRES.  THE TECHNICIAN AT THE COUNTER DIDN'T EVEN SEE THE TRAILER YET AND ASKED ME IF WE HAD CARLISLE TIRES AND I TOLD HIM YES.  HE SAID THEY SEE THESE TIRES BLOW AND REPLACE THEM AT LEAST ONCE A WEEK.  WHEN WE RETURNED HOME I HAD TO ORDER A NEW FENDER SKIRT, AS OF TODAY IT HASN'T COME IN YET.  *NM",
        "vin": "4X4TWCZ2X4T"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/30/2006",
        "dateOfIncident": "09/22/2006",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10169643,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "WILDCAT",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TIRE BLEW ON 2004 FOREST RIVER WILDCAT 28BH FIFTH WHEEL.  2ND OF 3 TIRES IN 2 MONTHS.  DESTROYED UNDER CARRIAGE OF FIFTH WHEEL ABOVE WHEEL WHICH IS WHERE THE WATER HEATER IS LOCATED AND WATER PIPES GOING TOO IT.  AS USUAL DEALER AGAIN SAID IT WAS ROAD DAMAGE AND NOTHING HE COULD DO CARLISLE TIRES).  *NM",
        "vin": ""
    }
]