[
    {
        "components": "SUSPENSION,WHEELS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/03/2016",
        "dateOfIncident": "07/30/2016",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10892997,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "WORK AND PLAY",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2004 WORK AND PLAY.  I HAVE HAD REPEATED ISSUES WITH TIRES RUBBING, WHEEL BEARINGS, AND BRAKES.  I HAVE HAD MULTIPLE BREAKDOWNS AND HAVE HAD SEVERAL PEOPLE WORK ON THE CAMPER WITH VARYING RESULTS AND FIXES.  MY LATEST ADVENTURE LEFT ME IN CHATTANOOGA NEAR A CAMPING WORLD.  THE MECHANIC THERE CHECKED IT OUT AND SHOWED ME THE PROBLEM.  THE AXLES ON THIS TRAILER ARE TOO NARROW.  THIS IS THE ROOT CAUSE OF THE RUBBING, THE BEARINGS BEING STRESSED TO PREMATURE WEARING, AND ISSUES WITH BRAKES.  NOT TO MENTION DENTING THE INSIDE BOTTOM OF THE WHEEL WELLS FROM HITTING THE TOP OF THE BRAKE DRUM/AXLE ENDS.  I DON'T KNOW IF THIS IS AN ISOLATED CASE OR THAT IT IS A KNOWN ISSUE THAT I WAS NEVER NOTIFIED OF (SUCH AS A RECALL).  I AM AWARE THAT THE TRAILER IS AN OLDER MODEL, BUT IT IS NOT LIKE THE AXLES SHRINK OVER TIME.  THE CAMPER IS CURRENTLY AT THE CAMPING WORLD IN CHATTANOOGA TO BE PUT TOGETHER CORRECTLY AT  QUITE A COST TO ME. I HAVE HAD BLOW OUTS, A WHEEL FLEW OFF THE CAMPER, AND SOME INTERMITTENT BRAKE OUTAGES.  NEVER WAS  THERE INJURY IN ANY OF THESE INCIDENTS, BUT ONLY DUE TO MY DRIVING EXPERIENCE AND THE GOD IN HEAVEN ABOVE!  I EMAILED THIS TO THE COMPANY AS WELL SO THEY KNOW ABOUT IT AS WELL.  TO MY KNOWLEDGE THESE ARE THE ORIGINAL AXLES.  IN EVERY CASE I WAS DRIVING AT THE TIME FO THE PROBLEM,,,AT HIGHWAY.INTERSTATE SPEED.  THE DATE OF THE INCIDENT BELOW WAS JUST THE MOST RECENT EVENT.",
        "vin": "4X4TWPZ2X3K"
    }
]