[
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "02/09/2010",
        "dateOfIncident": "01/30/2010",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10308149,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "CEDAR CREEK",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Dometic Corporation",
                "productMake": "DOMETIC",
                "productModel": "RM2852",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "DOMETIC RV REFRIGERATOR MOD. NO. RM2852 (ALREADY UNDER RECALL CAMPAIGN ID 06E076000) TO INSTALL A HEAT SHIELD, DOES NOT ADDRESS THE DEFECTIVE COIL CRACKING, ONLY JUST DIVERTS THE FLAME FRONT IF AMMONIA IS RELEASED AND CATCHES FIRE. I HAVE EXPERIENCED A CATASTROPHIC FAILURE OF THE COIL RELEASING SO MUCH AMMONIA THAT IT IRRITATED MY EYES AND REQUIRED VENTING RV TO RID IT OF THE FUMES.  FORTUNATELY REFRIGERATOR WAS IN ELECTRIC MODE, NOT GAS SO NO FIRE. AFTER FINDING OUT ABOUT RECALL (WAS NEVER INFORMED OF BY DOMETIC AS REQUIRED UNDER TERMS OF RECALL) AND CONTACTING DOMETIC I WAS INFORMED BY THEIR REPRESENTATIVE THAT UNDER THE TERMS OF RECALL AGREED TO BY THEM AND THE NHTSA THEY WERE ONLY REQUIRED TO PROVIDE THE HEAT SHIELD FREE OF CHARGE, NOT REPLACE THE DEFECTIVE COILS.  ESPECIALLY IF YOUR UNIT IS OUT OF WARRANTY YOU ARE OUT OF LUCK TO GET COIL REPLACED AT NO CHARGE IF IT HAS FAILED BECAUSE OF CRACKED COIL. IT IS MY OPINION THAT THIS RECALL IS FLAWED, IN SO FAR AS IT HAS ALLOWED DOMETIC TO COVER-UP A DEFECTIVE PRODUCT WITHOUT BEING RESPONSIBLE FOR REPLACEMENT OF DEFECTIVE PART WHICH CAN RESULT IN POTENTIAL FIRE. I THEREFORE REQUEST THAT THE NHTSA RE-OPEN INVESTIGATION INTO THIS RECALL AND REQUIRE DOMETIC TO REPLACE DEFECTIVE PART(S), THE ENTIRE COIL ASSEMBLY, THAT WILL FAIL OR HAVE ALREADY FAILED CREATING THE FIRE HAZARD, WHICH CAN RESULT IN LOSS OF ENTIRE RV DUE TO FIRE AND POSSIBLE INJURY OR DEATH OF THE OCCUPANTS. *TR",
        "vin": "4X4FCRF204P"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/25/2008",
        "dateOfIncident": "09/02/2008",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10246697,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "CEDAR CREEK",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE 2004 CEDAR CREEK FIFTH WHEEL. THE BEDROOM UP FRONT HAS GLASS DOORS THAT GO TO THE BOTTOM OF THE FLOOR. MY 2 YEAR OLD GRANDSON TRIP AND FELL THROUGH THE GLASS DOOR. LUCKILY HE FELL BACKWARDS AND WAS NO SERIOUSLY HURT. I FELT HE  WOULD HAVE FALLEN HEAD FIRST THAT COULD HAVE BEEN DEADLY. I CONTACTED CEDAR CREEK AND THEY COULD CARE LESS.. THEY JUST SAID I HAD NO WARRANTY LEFT. I TOLD THEM IT WAS A SAFETY ISSUE , THEY NEVER REPLIED. ALSO THE IS A BUNKHOUSE MODEL DESIGNED FOR CHILDREN IN MIND.  *TR",
        "vin": "4X4FCRF204P"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/19/2008",
        "dateOfIncident": "09/08/2008",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10242982,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "CEDAR CREEK",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A CEDAR CREEK 5TH WHEEL CAMPER. WHEN I RETURNED HOME FROM A TRIP I NOTICED ALL THE WHEELS WERE TILTED INWARD AND THE TIRES WERE WORN TO THE STEEL CORE INSIDE. I CHECKED WITH THE MANUFACTURER AND HE SAID THERE WERE NO RECALLS. I FOUND ANOTHER PERSON ON THE INTERNET WITH THE SAME EXACT AXLE FAILURES AND REPLACED THEM. I BELIEVE A CHECK OF COMPANY RECORDS WILL FIND MANY CASES OF OWNERS OF THIS TYPE OF UNIT HAVING REPLACED THESE AXLES AT THEIR OWN EXPENSE. THIS IS A VERY IMPORTANT SAFETY ISSUE THAT SHOULD BE ADDRESSED ASAP. I HAVE BEEN A MECHANIC FOR 43 YEARS AND NEVER SAW AXLES FAIL LIKE THIS. *TR",
        "vin": "4X4FCRM244P"
    }
]