[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/25/2010",
        "dateOfIncident": "11/10/2008",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10322215,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "SOFTAIL",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS A FAILURE OF THE ELECTRONIC SECURITY SYSTEM ON A 2004 HD HERITAGE MOTORCYCLE. WE NOTICED AN ELECTRONIC FAILURE SEVERAL TIMES AND OVER THE COURSE OF ONE YEAR FOUND THAT IT OCCURRED ONLY AND CONSISTENTLY EVERY TIME WE PARKED IN THE IMMEDIATE VICINITY OF OVERHEAD HIGH TENSION LINES. WHILE ONLY AN INCONVENIENCE TO US, PERHAPS THIS WILL HELP IN THE TOYOTA INVESTIGATION.",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/09/2005",
        "dateOfIncident": "07/06/2005",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10128165,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "SOFTAIL",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER 500 MILES, WOBBLE WAS DISCOVERED IN HANDLEBARS BETWEEN 38 TO 42 MILES PER HOUR.  TAKEN TO DEALER WAS TOLD IT WAS TRAIT ON MODEL.  CALLED HARLEY, THEY TOLD ME TO TAKE IT TO ANOTHER DEALER OF MY CHOICE.  TOOK BACK TO DEALER WHERE PURCHASE WAS MADE.  THEY ADJUSTED STEERING HEAD BEARINGS.  PROBLEM SOLVE.  AFTER ANOTHER 500 MILES, SAME SITUATION OCCURRED.  WOBBLE IN FRONT END BETWEEN 38 TO 42 MILES PER HOURS.  TOOK BIKE BACK TO DEALER, ADJUSTED STEERING HEAD BEARINGS AND GREASED FRONT END.  PROBLEM SOLVED.  AFTER 1,000 MILES, WOBBLE COME BACK IN HANDLER BARS BETWEEN, 38 TO 42 MILES PER HOUR.  TOOK BACK TO THE DEALER.  DEALER SAID THERE WAS NOTHING WRONG WITH BIKE.  THAT WAS THE TRAIT OF HERITAGE SOFTAIL.  THEY RODE A NEW BIKE AND IT DONE THE SAME THING.  THE BIKE IS SAFE TO RIDE AND THERE IS NOTHING WRONG WITH IT.  CALLED HARLEY AND THEY SAID THE DEALER SAID THERE WAS NOTHING WRONG WITH THE BIKE.  I TOLD HARLEY THEY HAD FIXED THE BIKE ON TWO PREVIOUS ATTEMPTS.  HARLEY SAID SOMEONE WOULD CALL ME BACK WITHIN 30 MINUTES.  I CALLED GENERAL MANAGER AT THE DEALERSHIP AND HE SAID THAT HE WOULD DO EVERYTHING POSSIBLE TO FIX THE BIKE.  THIS IS THE FOURTH ATTEMPT TO CORRECT THE WOBBLE IN THE FRONT END.",
        "vin": "1HD1BJY174Y"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/05/2004",
        "dateOfIncident": "12/26/2003",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10095116,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "SOFTAIL",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE  STALLED INTERMITTENTLY.  DEALER STATED THE VEHICLE NEEDED NEW PIPES, AIR BREATHER AND CARBURETOR.*AK",
        "vin": "1HD1BJY114Y"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/28/2004",
        "dateOfIncident": "04/17/2004",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10075454,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "SOFTAIL",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT HIGH SPEEDS VEHICLE  SHOOK, CAUSING CONSUMER TO SLOW DOWN. CONSUMER CONTACTED DEALERSHIP ABOUT THIS ISSUE, HOWEVER, THE PROBLEM RECURRED.  *AK  THE BIKES WHEELS WERE UNSTABLE.  THE SOLID WHEELS CAUGHT WIND VORTICIES WHICH CAUSED THE VEHICLE TO BE UNSTABLE.  THE DEALER REFUSE TO CHANGE THE WHEELS.  *NM",
        "vin": "1HD1BXB344Y"
    }
]