[
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/23/2018",
        "dateOfIncident": "04/23/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11089663,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "SUDDEN ACCELERATION OF VEHICLE WHILE DRIVING ON ROAD AT REGULAR SPEED. THIS HAS HAPPENED NOW FOR THE THIRD TIME SINCE OCTOBER 2017. THE LATEST INCIDENT ON 4/23/2018.",
        "vin": "KMHDN46D14U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/15/2016",
        "dateOfIncident": "08/15/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10896007,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 HYUNDAI ACCENT. WHILE DRIVING 35 MPH, A SEVERE VIBRATION WAS FELT FROM THE REAR WHEELS. THE CONTACT PULLED THE VEHICLE OVER AND OBSERVED THAT THE REAR CONTROL ARM WAS SEVERELY CORRODED. THE VEHICLE WAS TOWED TO THE CONTACT'S RESIDENCE. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 95,000.  UPDATED 10/06/16*LJ  *TR",
        "vin": "KMHCG45C44U"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/30/2015",
        "dateOfIncident": "11/29/2015",
        "fire": true,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10807506,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  ON 11/29/2015 DRIVING ON PENNSYLVANIA TURNPIKE GOING 60-65 MPH VEHICLE IN FRONT STOPPED. IMPACT TOTALED CAR. HOOD CRUMBLED UP, HEADLIGHT WITH COMPLETE HOUSING DESTROYED, RADIATOR SPILLED FLUID, ENGINE CAUGHT ON FIRE AND MY HEAD HIT WINDSHIELD. NO WEATHER ISSUES. ACCIDENT OCCURRED  AROUND 12:30 PM. POLICE REPORT WAS FILED AND CAR TOWED. AIRBAGS DID NOT DEPLOY.",
        "vin": "KMHCG35C94U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/07/2015",
        "dateOfIncident": "04/09/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10747133,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 HYUNDAI ACCENT. THE CONTACT STATED THAT WHILE DRIVING AT APPROXIMATELY 35 MPH, THE POWER STEERING WARNING LIGHT ILLUMINATE.  THE CONTACT STATED THAT WHILE TURNING LEFT, THE STEERING WHEEL SEIZED. THE VEHICLE WAS TOWED TO THE DEALER WHERE AN UNKNOWN PART WAS REPLACED BUT THE FAILURE RECURRED. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "KMHCU5AE3EU"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/09/2015",
        "dateOfIncident": "07/07/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10732855,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2004 HYUNDAI ACCENT. WHILE DRIVING APPROXIMATELY 30 MPH, ANOTHER VEHICLE REAR ENDED THE CONTACT'S VEHICLE. THE AIR BAGS DEPLOYED; HOWEVER, THE CONTACT SUSTAINED BURNS ON THE ARM THAT REQUIRED MEDICAL ATTENTION. IT WAS UNKNOWN WHICH AIR BAG CAUSED THE INJURIES. THE VEHICLE WAS DESTROYED. A POLICE REPORT WAS FILED. THE APPROXIMATE FAILURE MILEAGE WAS 82,000.",
        "vin": "KMHCG45C94U"
    },
    {
        "components": "STEERING,AIR BAGS,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/09/2014",
        "dateOfIncident": "09/29/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10643710,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WIFE, 64,WAS DRIVING OUR ONE-OWNER 2004 HYUNDAI ACCENT GL ON PRIVATE ROAD APPROX 15 MPH WHEN AIRBAGS DEPLOYED WITHOUT ANY IMPACT OF ANY SORT TO VEHICLE.  WIFE WAS BADLY BRUISED ON ARMS AND FACE AND WINDSHIELD WAS SHATTERED BY PASSENGER SIDE AIRBAG COVER WHEN BAGS DEPLOYED.  WE WERE FORTUNATE THAT SHE WAS NOT ON BUSY STREET OR ON INTERSTATE AS THIS WOULD HAVE CERTAINLY RESULTED IN A WRECK WITH SEVERE BODILY INJURY OR POSSIBLE DEATH.  LOCAL HYUNDAI DEALERSHIP (PERKINS MOTORS, COLORADO SPRINGS) REFUSED TO DO ANYTHING.  HYUNDAI HQ CUSTOMER SERVICE COMMITTED TO \"SENDING US A PACKET OF PAPERWORK TO BE FILLED OUT AND RETURNED TO THEM BY US AND THEY WOULD GET BACK TO US IN 6 TO 8 WEEKS ONCE IT WAS RECEIVED TO SEE IF THEY WOULD DO ANYTHING.\"  NO ONE FROM HYUNDAI HAS EXPRESSED ANY INTEREST IN SEEING THE VEHICLE OR RESPONDING TO A POTENTIALLY VERY HAZARDOUS VEHICLE.  I AM VERY CONCERNED ABOUT THEIR LACK OF ANY SENSE OF OBLIGATION TO SEE WHAT WENT WRONG AND HOW IT MIGHT BE AVOIDED IN THE FUTURE.  THEIR ATTITUDE IS THAT IT'S OUR PROBLEM AND THE FACT THAT IT IS A MAJOR SAFETY ISSUE DOESN'T CONCERN THEM IN THE SLIGHTEST.    *TR",
        "vin": "KMHCG45C94U"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/28/2014",
        "dateOfIncident": "07/22/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10616749,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING OVER A SPEED BUMP THE DRIVER WAS DISTRACTED BY CHILDREN PLAYING IN STREET.  THE DRIVER VEERED RIGHT STRIKING A TELEPHONE POLE HEAD ON.  THE AIR BAGS FAILED TO DEPLOY.  DRIVER NOT SERIOUSLY INJURED, HOWEVER THE VEHICLE WAS TOTAL.   *JS",
        "vin": "KMHCG45C34U"
    },
    {
        "components": "STEERING,WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/25/2012",
        "dateOfIncident": "12/13/2004",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10476955,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 2,466 MILES, CAR PULLS TO RIGHT, AND IS DIFFICULT TO HOLD STEADY WHEN TURNING AT HIGH SPEEDS.  TAKEN TO BURLINGAME HYUNDAI DEALER FOR REPAIR. TIRES WERE ROTATED.  PROBLEM NOT RESOLVED.  AT 4,782 MILES CAR WAS BROUGHT IN AGAIN FOR STEERING DIFFICULTY, FEELS LIKE THERE IS A TIRE GOING FLAT.  FOUND THAT LEFT FRONT WHEEL WAS BENT. TIRES ROTATED AGAIN, BENT WHEEL ON LEFT REAR, REPLACEMENT PART ORDERED.  (UNDER WARRANTY) AT 5,393 MILES, CAR SHAKES AT ANY SPEED. BENT WHEEL WILL NOT BALANCE.  REPLACEMENT PART SUPPOSEDLY PUT ON CAR.  PROBLEM NOT RESOLVED.  AT 25,616 MILES CAR TAKEN TO SAN FRANCISCO HYUNDAI FOR MULTI-POINT INSPECTION.  DEALER RECOMMENDED 2 NEW TIRES AND ALIGNMENT. AT 25,797 MILES, CAR TAKEN TO ANOTHER SERVICE CENTER FOR ALIGNMENT AND NEW TIRES.  CUSTOMER WAS TOLD THAT ALL 4 TIRES WERE ROTTED AND ALIGNMENT WAS PERFORMED.  CUSTOMER WAS TOLD FOR THE FIRST TIME THAT THERE IS NO WAY TO ALIGN THE CAMBER OR CASTER ON THIS MAKE/MODEL CAR.  LEFT FRONT CAMBER WAS OUT OF SPECIFIED RANGE. (-0.9`) RIGHT REAR CAMBER WAS ALSO OUT OF SPECIFIED RANGE (-1.5`).  AT 28,060 MILES CUSTOMER RETURNED TO OTHER SERVICE CENTER FOR 2 ADDITIONAL TIRES AND INSTALLATION OF 4 CAMBER KITS.  AT THIS TIME IT WAS DISCOVERED THAT ONE OF THE TIRES WOULDN'T BALANCE DUE TO WHEEL BEING BENT.  SO THE BENT WHEEL WAS NEVER REPLACED BY THE DEALER!  *TR",
        "vin": "KMHCF35C74U"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/04/2011",
        "dateOfIncident": "11/01/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10380799,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEATER FAN IN THE CAR WOULD ONLY WORK ON HIGH SPEED. IT WAS A CONTINUAL OCCURRENCE, THEREFORE IT WAS DIFFICULT TO CONTROL THE INTERIOR HEAT AND DEFROSTER. IT WAS REPAIRED BY REPLACING THE SPEED CONTROL SWITCH.  THE MECHANIC SHOWED ME WHAT HAD FAILED ON THE SWITCH WERE TWO RECEPTACLES WHERE THE METAL WAS SHOULD HAVE BEEN SOLID BUT HAD GOTTEN SO HOT THAT IT HAD MELTED AND THERE WAS NO LONGER A CONNECTION.  I FELT COMPELLED TO REPORT THIS AS IT CONCERNED ME THAT IT MAY CAUSE A FIRE.  *TR",
        "vin": "KMHCG45C74U"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/30/2010",
        "dateOfIncident": "05/01/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10340819,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2004 HYUNDAI ACCENT.  FOR THE PAST 3 YEARS THE TRANSMISSION HAS HAD SIGNIFICANT ISSUES.  THE AUTOMATIC TRANSMISSION WILL RANDOMLY SLAM INTO A LOWER GEAR OR WILL GET STUCK IN A GEAR.  THIS CAUSES SAFETY ISSUES DURING WINTER DRIVING BECAUSE THE VEHICLE LURCHES FORWARD AT TIMES WHEN SHIFTING.  WHILE ATTEMPTING TO ENTER INTO TRAFFIC, THE CAR WILL BE STUCK IN 3 GEAR WHICH ALMOST HAS CAUSED AN ACCIDENT SEVERAL TIMES BY PULLING OUT TOO SLOW.  I HAVE HAD IT IN TWICE TO THE TRANSMISSION SHOP AND THEY COULD NOT DIAGNOSE THE PROBLEM WITHOUT AN ENGINE CODE.  THEY FLUSHED, FILLED AND PUT A NEW FILTER IN THE TRANSMISSION BUT THIS DID NOT HELP.  SOMETIMES THE CAR WILL WORK FINE FOR MONTHS OR A YEAR AT A TIME.  I HAVE RESEARCHED THE PROBLEM ON THE INTERNET AND THERE SEEMS TO BE MANY OWNERS THAT HAVE VOICED SIMILAR CONCERNS. *TR",
        "vin": "KMHCG35C14U"
    },
    {
        "components": "EQUIPMENT,EQUIPMENT ADAPTIVE/MOBILITY",
        "crash": false,
        "dateComplaintFiled": "02/12/2010",
        "dateOfIncident": "01/01/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10308873,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Kia Motors America",
                "productMake": "HYUNDAI",
                "productModel": "92101-0A000",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "I AM THE OWNER OF A 2004 HYUNDAI ACCENT. THERE IS A SMALL HOOK THAT HAS BECOME DETACHED FROM UNDERNEATH THE FLOORMAT ON THE DRIVER'S SIDE. THERE IS A SMALL HOLE IN THE FLOORMAT THAT IS SUPPOSED TO KEEP THE FLOORMAT IN PLACE. BECAUSE THE SMALL HOOK HAS BECOME DETACHED THE SMALL HOLE IN THE FLOORMAT SLIDES OF THE HOOK THEREBY CAUSING THE FLOORMAT TO MOVE FORWARD. I HAVE NOT EXPERIENCED ANY UNINTENDED ACCELERATION, BUT I THINK THIS COULD BECOME A PROBLEM. I DON'T KNOW IF THIS IS A SIMILAR PROBLEM TOYOTA HAS EXPERIENCE IN SOME OF THEIR VEHICLES, BUT I THOUGHT IT SHOULD BE BROUGHT TO YOUR ATTENTION. *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/30/2009",
        "dateOfIncident": "11/01/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10297515,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 HYUNDAI ACCENT PURCHASED JANUARY 2006.  WHILE DRIVING SHE HEARD A LOUD SCRAPING NOISE. AN INDEPENDENT MECHANIC STATED THAT THE ENTIRE LOWER CONTROL ARM FAILED BECAUSE THE BOLTS THAT KEPT THE LOWER CONTROL ARM SECURE BECAME LOOSE. THE MANUFACTURER WAS CONTACTED, BUT THEY REFUSED LIABILITY. REPAIRS WERE MADE AT THE OWNER'S EXPENSE. THE FAILURE MILEAGE WAS 92,000. THE CURRENT MILEAGE WAS 93,000.",
        "vin": "KMHCG45C14U"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "05/15/2009",
        "dateOfIncident": "02/22/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10268837,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 HYUNDAI ACCENT.  WHILE DRIVING 55 MPH IN THE RAIN, THE WINDSHIELD WIPERS LOOSENED AND DISCONNECTED FROM THE ARM.  THE DEALER TIGHTENED THE WIPER NUTS AND INSTRUCTED THE CONTACT TO NOT USE THE WIPERS DURING HEAVY RAIN OR SNOW BECAUSE THEY CANNOT MODIFY THE WIPERS EACH TIME THEY BECOME LOOSE.  THE CONTACT FEELS THAT THE WIPERS ARE UNSAFE BECAUSE THEY CAN BECOME LOOSE AT ANY TIME AND CAUSE LIMITED VISIBILITY WHILE DRIVING.  THE CURRENT MILEAGE WAS 34,000 AND FAILURE MILEAGE WAS 4,000. 2/21/10   UPDATED 03/02/10",
        "vin": "KMHCG35C44U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/31/2009",
        "dateOfIncident": "01/19/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10257064,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THE CAR BACK IN 2003 FROM A DEALERSHIP UP IN NEW YORK CITY. HYUNDAI OF MANHATTAN,I WAS EXPERIENCING PROBLEM. WITH THE CAR. THEN FIRST IN WAS WITH THE WIRING HARNESS.THAT AFFECT THE TRANSMISSION, AND THEN WITH THE CAR BLOWING OXYGEN SENSORS, AND THEN WITH THE MANIFOLD SYSTEMS  THE PROBLEMS WARE TAKEN CARE OF  THEN I HAVE MOVED TO RALEIGH,NORTH CAROLINA. FROM NYC BACK IN 9/2006, THEN I STARTED HAVING PROBLEMS WITH THE WIRING HARNESS,AGAIN. AND THE TRANSMISSION FAILED AND NEEDED TO BE REPLACED BACK IN 11/2007. THAT PROBLEM WAS TAKEN CARE OF  I HAVE BEEN GOING TO  HYUNDAI OF SOUTHERN STATE IMPORTS OF RALEIGH. FOR THE PAST COUPLE OF YEARS SINCE I HAVE BEEN HERE AND THEY  ARE VERY FAMILIAR WITH MY CAR  THE CAR WAS UNDER WARRANTY BACK THEN. UNTIL  I REACHED 71,226 MILES THE CARS WARRANTY 60,000 MILES TO 100,000 BUMPER TO BUMPER. TO MAKE A LONG STORY SHORT  THEY WAITED UNTIL MY WARRANTY EXPIRED TO TELL ME THAT MY  CARE WOULD NEED A.1,WIRING ASSY ENGINE TOTAL PRICE OF 930.53, 2,COVER ASSYROCKER 299,72.  THE POINT I AM TRYING TO GET AT IS THEY KNEW ALONG THAT THOSE COMPONENTS NEEDED TO BE REPLACED A LONG TIME AGO BUT THEY WAITED UNTIL MY WARRANTY WAS UP  TO PASS THE BUCK ON TO THE CONSUMER. INSTEAD OF  BEING RESPONSIBLE AND OF INTEGRITY  HYUNDAI MOTORS OF AMERICA NEEDS TO BE INVESTIGATED, CONCERNING THERE WARRANTY  CONCERNING THERE CUSTOMERS I AM OUTRAGED CONCERNING THIS MATTER .HOW WOULD YOU FEEL IF IT WAS YOU THE ECONOMY IS STALLED AND THIS COULDN'T HAVE HAPPENED AT A   MORE AWKWARD TIME THEN NOW. I AM AFRAID OF THIS CAR AND WOULD LIKE TO GET RID OF IT   BUT I OWE 8,000 MORE ON THE CAR AND I AM MAKING MY PAYMENT INSPITE OF  THE   ECONOMY. I FEEL RAPED AND  ABUSED. BY THIS PLEASE HELP ME BEFORE IT IS TO LATE. *TR",
        "vin": "KMHCG45C64U"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "10/22/2006",
        "dateOfIncident": "10/19/2006",
        "fire": true,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 10171547,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "AN ACCIDENT OCCURED (COLLISION) WITH MY 2004 HYUNDIA ACCENT. IMMEDIATELY A FIRE STARTED UNDER THE HOOD. THE FIRE BURNED THROUGH THE FIREWALL INTO THE FRONT SEAT OF THE CAR. THE GAS LINE SHUT OFF SHOULD HAVE PREVENTED THIS AND THE FIRE WALL SHOULD HAVE STOPPED IT. LUCKILY NO ONE WAS KILLED.  *NM",
        "vin": "KMHCG45C94U"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/10/2006",
        "dateOfIncident": "09/20/2006",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10170409,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE INBOARD PAD OF THE RIGHT FRONT BRAKE WORE OUT PREMATURELY. THIS CAUSED THE ROTOR TO BE DAMAGED. THE VEHICLE WAS MAINTAINED ACCORDING TO THE WARRANTY INSTRUCTIONS (BRAKE INSPECTION EVERY 7500 MILE AND ADJUSTED IF NECESSARY) UPON VISUAL INSPECTION  (MOST RECENT WAS 06-2006) THERE WAS NO EXCESSIVE WEAR OF THE PADS OR BINDING OF CALIPER OR ROTOR. I NOTICED THE BRAKES WERE GIVING RESISTANCE WHEN GOING FROM A STOP SO I SCHEDULED AN APPOINTMENT AT -RICK CASE HYUNDAI_ IN EUCLID, OH. THEY TOLD ME THAT THE BRAKES HAD TO BE \"REBUILT\" AND \"LUBRICATED \"EVERY 7500 MILES AND THAT THEY WOULD NOT REPAIR THE DAMAGE UNDER WARRANTY EVEN THOUGH I PROVIDED RECEIPTS SHOWING THAT THE REQUIRED WARRANTY INSPECTION/ADJUSTMENTS HAD BEEN MADE.    I SHOULD ADD THAT MY FRIEND (SCOTT RUDGE) HAS A 2003 ACCENT WHICH HAD EXACTLY THE  SAME PROBLEM AS MINE AT THE SAME MILEAGE (ABOUT 40,000). I BELIEVE THAT THIS IS CLEARLY A PROBLEM WITH EITHER THE DESIGN OR MANUFACTURE OF THE RIGHT FRONT CALIPER. *JB",
        "vin": "KMHCF35C94U"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/22/2006",
        "dateOfIncident": "08/18/2006",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10166206,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION FAILED TO GO INTO OVERDRIVE WHILE TRYING TO PASS, DECELERATED FROM 65 TO 35, WENT  IN NEUTRAL, THEN INTO A NORMAL GEAR.  *NM",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/23/2006",
        "dateOfIncident": "04/21/2006",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10158063,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "INVOLVED IN T-BONE TYPE COLLISION. I WAS STRUCK ON DRIVER'S SIDE ( T- BONE).WHILE PULLING OUT OF A DRIVEWAY. SHE WAS GOING AT LEAST 30-35 MPH. FRONT AND SIDE IMPACT AIR BAGS FAILED TO DEPLOY. MY HEAD STRUCK WINDOW. COLLISION RESULTED IN MY CAR BEING TOTALED.  *NM",
        "vin": "KMHCG35C14U"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/16/2006",
        "dateOfIncident": "03/15/2005",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10152854,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE DRIVING 55 MPH A VEHICLE PULLED OUT IN FRONT OF THE VEHICLE RESULTING IN A CRASH AND THE FRONTAL AIRBAGS DID NOT DEPLOY.  THE DRIVER WAS WEARING A SEATBELT AND SUSTAINED MINOR INJURIES.  A POLICE REPORT WAS FILED AT THE SCENE AND THE INSURANCE AGENCY DEEMED THE VEHICLE TOTALED.*AK",
        "vin": "KMHCG45C04U"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/07/2005",
        "dateOfIncident": "01/01/2005",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10138992,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "CLICKING NOISE COMING FROM REAR BRAKE DRUMS WHEN BRAKES ARE APPLIED WHEN VEHICLE IS MOVING FORWARD.  DEALERSHIP (RELIABLE IMPORTS, SPRINGFIELD, MO) UNABLE OR UNWILLING TO FIND OR DEAL WITH THE PROBLEM.  ON PERSONAL INSPECTION BY MYSELF, FOUND THAT WHEN ROTATING THE REAR WHEELS BY HAND WITH BRAKES PARTIALLY APPLIED, THE WHEEL/BRAKE DRUM WOULD GRAB AND THEN RELEASE IN THE SAME PLACE AS IT WAS ROTATED WITH AXLE ELEVATED OFF OF GROUND.  ONE SIDE (PASSENGER SIDE) SEEMS TO BE MORE AFFECTED THAN THE OTHER.  HYPOTHESIZE THAT THE BRAKE DRUMS ARE OUT OF ROUND, EGG SHAPED EITHER FROM NORMAL USAGE OR MANUFACTURING DEFECT.  ***NOTE: PROBLEM STARTED AND WAS REPORTED TO DEALERSHIP IN THE FIRST 12,000 MILES OF THE CARS LIFETIME, VEHICLE IS HAS NOW BEEN OWNED BY ORIGINAL OWNER FOR ONE YEAR.  HAS BEEN AT THE DEALERSHIP FOR THIS PROBLEM 4 TIMES, STILL UNABLE/UNWILLING TO CORRECT PROBLEM.  *NM",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/04/2005",
        "dateOfIncident": "08/02/2005",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131505,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION STARTED FAILING WITHIN THE FIRST 30 DAYS OF PURCHASE, EVER TIME IT WENT OVER 10 MPH IT LUGGED BACK AND THEN WENT FORWARD. BOUGHT THE CAR USED WITH 42K MILES AND THE SERVICE DEPARTMENT AT THE DEALERSHIP SAID THAT THEY WILL HAVE TO KEEL THE CAR TO REPLACE TRANSMISSION OR CHANGE A PART.",
        "vin": "KMHCG45C24U"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "05/27/2005",
        "dateOfIncident": "05/26/2005",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10122361,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "1) DRIVING ON A HILLY, TWISTY ROAD. WHILE APPROACHING A DOWNHILL TURN IN THE ROAD, THE CHECK ENGINE LIGHT CAME ON, THE TACH DROPPED TO \"0\" AND THE CAR SHUT OFF.  SINCE THE ENGINE WAS NO LONGER RUNNING, I LOST MY POWER STEERING AND POWER BRAKES SUDDENLY. I LOST CONTROL OF THE CAR AND WENT OFF THE ROAD, CRASHING INTO A GUARDRAIL.  2) DAMAGED PARTS: FRONT BUMPER, HEADLIGHT ASSEMBLY, CORNER LIGHT ASSEMBLY, RF FENDER, HOOD, UPPER RADIATOR CORE SUPPORT. POSSIBLY INNER FENDER ALSO? AIR BAGS DID NOT GO OFF, AND I WAS NOT INJURED.  I WAS ABLE TO RESTART THE CAR, AND THE CHECK ENGINE LIGHT WENT OUT AFTER ABOUT 10-15 SECONDS.  I HAVE BEEN ABLE TO OPERATE THE CAR NORMALLY EVER SINCE. I CONTACTED HYUNDAI AND AM WAITING FOR RESOLUTION AND REPAIRS.  3) NOTHING HAS BEEN DONE YET.",
        "vin": "KMHCG35C54U"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/29/2005",
        "dateOfIncident": "03/29/2005",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10116004,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE COMBINATION OF SMALL TIRES AND SOFT SUSPENSION CAUSES A SEVER BODY ROLL PROBLEM WITH MY 2004 HYUNDAI ACCENT.  IT GOT WORSE AS MY TIRES STARTED TO SHOW SOME WEAR.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "03/28/2005",
        "dateOfIncident": "01/19/2005",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10117297,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 HYUNDAI ACCENT EXPERIENCED TWO SEPARATE INCIDENTS OF BRAKE FAILURE, ONE RESULTING IN VEHICLE VEERING INTO A CREEK.*MR  *NM",
        "vin": "KMHCG35C14U"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/27/2005",
        "dateOfIncident": "01/27/2005",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10109103,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WILL NOT SHIFT GEARS. WHEN TAKEN TO GET SERVICED THE FIRST TIME CONSUMER WAS TOLD IT WAS DUE TO GAS FLOODING. THIS HAPPENED A SECOND TIME. WHEN TAKEN TO GET SERVICED AGAIN SHE WAS TOLD IT WAS DUE TO AIR ENTERING THE CLUTCH. CURRENTLY,  IT  HAPPENED A THIRD TIME.*AK",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/19/2004",
        "dateOfIncident": "11/19/2004",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10100207,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 ACCENT WENT OVER RAILROAD TRACKS HIT A BUMP AND AIRBAGS DEPLOYED,WENT TO DEALER HE SAID THE SENSOR ON BOTTOM OF CAR GOT SCRAPED THAT IS WHY THEY DEPLOYED,FACE,ARM AND CHEST BRUISES.*AK",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/05/2004",
        "dateOfIncident": "11/01/2004",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10101135,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONSUMER REQUESTED AN AIR BAG ON/OFF SWITCH BE INSTALLED IN THE VEHICLE.  *NM   THE CONSUMER HAD TO MOVE THE SEAT UP AS FAR AS IT COULD GO TO GET A BETTER VIEW OF THE ROAD. *TC",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/13/2004",
        "dateOfIncident": "08/15/2004",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10095702,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS INVOLVED IN AN ACCIDENT. I T-BONED A CAR THAT PULLED OUT IN FRONT OF ME GOING APPX. 35 MPH AND THE AIR BAGS DID NOT DEPLOY. *AK",
        "vin": "KMHCG35C74U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/11/2004",
        "dateOfIncident": "10/07/2004",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10095544,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "HYUNDAI ACCENT 2004. BOUGHT THE CAR LATE FEB 2004. CAR PULLS TO THE LEFT FROM DAY ONE. TOOK IT TO THE DEALER AND THEY DROVE IT AND ADMITS IT PULLS TO THE LEFT AND SAID IT IS JUST THE WAY THE ROAD GOES. PROBLEM GOT WORSE AND TOOK TO THE DEALER OCT. 2004. THEY KEPT THE CAR A DAY AND A HALF AND TRIED SEVERAL SOLUTIONS INCLUDING DIFFERENT TIRES ETC. STILL PULLS TO THE LEFT. THEY TOOK ME IN A NEW ACCENT AND SHOWED ME IT DOES THE SAME AND IT IS HOW THEY ARE MADE. WITH THE TORQUE STEERING AND A SMALL CAR IT DOES THAT AND IT IS BEYOND REPAIR.     *NM",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/21/2004",
        "dateOfIncident": "08/14/2004",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 10093953,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER'S SIDE IMPACT AIR BAG DID NOT DEPLOY AFTER BEING STRUCK. MANUFACTURER AGREED TO SEND A REPRESENTATIVE.*AK   *TC",
        "vin": "KMHCG35C74U"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/11/2004",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10073465,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING TRANSMISSION DOWN SHIFTED ON ITS OWN.  CONSUMER WAS ABLE TO MAINTAIN CONTROL OF THE VEHICLE ,AND DROVE THE VEHICLE TO THE DEALER FOR INSPECTION.  MECHANIC DETERMINED  THAT COMPUTER NEEDED TO BE RESET, AND RESET IT, BUT THE PROBLEM STILL OCCURRED.  *AK",
        "vin": "KMHCG35C14U"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/31/2004",
        "dateOfIncident": "03/31/2004",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10064250,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Kumho Tire Co., Inc.",
                "productMake": "KUMHO",
                "productModel": "KUMHO",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "I PURCHASED HYUNDAI ACCENT 4DR COUPE AND WAS SURPRISED AT THE INSTABILITY CAUSED BY THE TINY TIRES IT COMES EQUIPPED WITH.  I WAS FURTHER DISTURB WHEN I DISCOVERED THAT HYUNDAI WAS AWARE OF THIS PROBLEM AND PUT LARGER WHEELS AND TIRES ONT HE GT VERSION FO THIS CAR TO INCREASE STABILITY.  THE BASIC CAR IS DANGEROUS TO DRIVE ON WINDING ROADS AND VERY UNSTABLE IN EMERGENCY MANEUVERS WITH THE STANDARD WHEEL-TIRE COMBINATION.  HYUNDAI SHOULD REPLACE THE STANDARD WHEEL WITH LARGER MORE STABLE WHEELS AND TIRES AS THEY PUT ON THE GT VERSION.*AK",
        "vin": ""
    }
]