[
    {
        "components": "SUSPENSION,WHEELS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/15/2015",
        "dateOfIncident": "10/14/2008",
        "fire": false,
        "manufacturer": "Navistar, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10790457,
        "products": [
            {
                "manufacturer": "Navistar, Inc.",
                "productMake": "INTERNATIONAL",
                "productModel": "4300",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS TRUCK HAS BEEN LOCKING UP, THE  FRONT RIGHT WHEEL, FOR SEVERAL YEARS, THE FIRST TIME IT HAD 28,000 MILES , I HAVE REPLACED SENSORS, AND NOTHING HELPS, THE ABS LIGHT STAYS ON CONTINUALLY...EVERY TIME I DRIVE IT, IT IS THE SAME LOCK UP WHEEL....IT DOES THIS WHEN VEHICLE IS IN MOTION...",
        "vin": "1HTMMAAMX4H"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/01/2010",
        "dateOfIncident": "05/22/2010",
        "fire": false,
        "manufacturer": "Navistar, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10333995,
        "products": [
            {
                "manufacturer": "Navistar, Inc.",
                "productMake": "INTERNATIONAL",
                "productModel": "4300",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE INTERNATIONAL DT466E DIESEL MOTOR THAT HAS CYLINDER LINER O-RING SEALS THAT FAIL PREMATURELY CAUSING THE ANTIFREEZE TO BE LEAKED INTO THE OIL CAUSING THE BEARINGS IN THE MOTOR TO FAIL. THE DT MOTOR HAS BEEN AROUND SINCE THE 1960'S IN THE INTERNATIONAL HARVESTOR FARM TRACTORS AND HAVE NOT HAD THIS CONCERN. MY 2004 INTERNATIONAL 4300 TRUCK SLOWLY PUT THE ANTIFREEZE IN THE OIL AT 204,000 CAUSING SEVERE ENGINE DAMAGE. THE ESTIMATE FOR REPAIR IS APPROX $14,000 DOLLARS. MY CONCERN IS THAT THE MOTOR SHOULD OF GONE 500,000 MILES BEFORE IT NEEDED OPENED UP FOR A OVERHAUL. I CAN GET 200,000 MILES OUT OF A GAS MOTOR AND NOT OF SPENT $5,500 FOR THE SEMI GRADE DIESEL MOTOR. IF YOU SEARCH DT466E ENGINE PROBLEMS ON GOOGLE YOU WILL FIND MANY DISGRUNTLED DT OWNERS WHO CANT GET 250,000 MILES OUT OF THEIR DT BEFORE IT FAILS. INTERNATIONAL HAS GOODWILLED SOME REPAIRS PROVIDING THE PARTS TO OVERHAUL THE MOTOR(NOT MINE YET AND I HAVE CALLED THEM). IT SEEM FROM MY EXPERIENCE AS A CHEVROLET SERVICE MANAGER FOR 16 YEARS THAT ABOUT THE YEAR 2000 INTERNATIONAL MADE DESIGN CHANGES THAT INTRODUCED THIS PROBLEM TO WHAT USE TO BE A BULLET PROOF MOTOR. THE YEARS THAT ARE SEEING PREMATURE FAILURES ARE BETWEEN 2000-2007 ALL DT466E MOTORS. DUE TO THE SLOW DOWN IN THE ECONOMY I CAN NOT AFFORD TO SPEND $14,000 TO FIX IT OF $100,000 TO REPLACE IT. I JUST PAID OFF THIS TRUCK IN THE FIRST QUARTER OF THIS YEAR AND HOPED TO RUN IT A COUPLE OF YEARS WITHOUT A PAYMENT SO I COULD PUT MY DAUGHTER THRU COLLEGE. BUT NOW IM SETTING HERE WITH A TRUCK THAT WAS WORTH $40,000 IN RUNNING CONDITION WITH 200,000 MILES ON IT, TO HAVING A TRUCK SETTING IN MY YARD THAT'S NOW WORTHLESS TO ME AND WORTH ABOUT $15,000. INTERNATIONALS ACTIONS HERE ARE CAUSING GREAT FINANCIAL HARDSHIP ON THE SMALL BUSINESS OWNERS THAT HAVE PUT THEIR TRUST IN THIS MOTOR ONLY TO BE LET DOWN. WHILE YOU ARE AT IT LOOK AT THE FORD 6.0, 6.4 MOTORS THEY ALSO ARE BUILT BY INTERNATIONAL THAT HAVE A VARIETY OF DRIVEABILITY AND MECHANICAL CONCERNS. *TR",
        "vin": "1HTMMAAM34H"
    },
    {
        "components": "SERVICE BRAKES, AIR",
        "crash": false,
        "dateComplaintFiled": "03/16/2010",
        "dateOfIncident": "06/30/2003",
        "fire": false,
        "manufacturer": "Navistar, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10320169,
        "products": [
            {
                "manufacturer": "Navistar, Inc.",
                "productMake": "INTERNATIONAL",
                "productModel": "4300",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2004 INTERNATIONAL 4300. WHILE DRIVING APPROXIMATELY 40 MPH, THE BRAKE PEDAL WAS ENGAGED WHICH RESULTED IN THE VEHICLE MOVING INTO A SIDEWAYS DIRECTION. THE FAILURE OCCURRENCE WAS WHENEVER THE VEHICLE WAS IN OPERATION. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER FOR DIAGNOSTIC TESTING. THE VEHICLE WAS REPAIRED FOR THE MALFUNCTIONS,THE TYPE OF SERVICE REPAIRS PERFORMED WAS UNKNOWN. THE FAILURE CONTINUED TO OCCUR. THE FAILURE MILEAGE WAS 800. THE CURRENT MILEAGE WAS 12,000.",
        "vin": "1HTMMAAL64H"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/08/2008",
        "dateOfIncident": "01/07/2008",
        "fire": false,
        "manufacturer": "Navistar, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10217435,
        "products": [
            {
                "manufacturer": "Navistar, Inc.",
                "productMake": "INTERNATIONAL",
                "productModel": "4300",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "ABS LIGHT COMES ON AND THE HYDRAULIC BRAKES LOCK UP. THIS IS A RECURRING PROBLEM WITH THIS TRUCK. THE FIRST TIME THE ABS WENT OFF AND BRAKES RELEASED. THE SECOND TIME WAS IN SEPTEMBER 2006 WHEN THE ABS LIGHT STAYED ON. I HAD THE BRAKE LINES REPLACED AND THE SYSTEM RESET AND I ADDED AN EXHAUST BRAKES TO HELP WITH THE BRAKING. THIS COST ME AROUND $5,500. THE MILEAGE WAS ABOUT 10,200. JANUARY 7, 2008 THE ABS LIGHT CAME ON AND THE BRAKES LOCKED UP AGAIN, THIS TIME CAUSING MORE EXTENSIVE DAMAGE. THE ROTORS, CALIPERS, PADS, AND WHEEL  SENSORS,  HAVE TO BE REPLACED ON ALL WHEELS. THE ESTIMATE FROM THE DEALER THIS TIME IS ABOUT $5,500. I NOW HAVE 17,000 MILES ON THE TRUCK AND I AM AFRAID TO DRIVE IT. I HAVE CALLED CUSTOMER SERVICE AND FILED AN INCIDENT REPORT. I CAN NOT GET PAST CUSTOMER SERVICE. DESPITE PROMISES AND MY REPEATED CALLS, NO ONE WILL CALL ME BACK TO DISCUSS THIS PROBLEM. I HAVE SEARCHED THE INTERNET AND FOUND I AM NOT ALONE WITH THIS PROBLEM, EVENTUALLY SOMEBODY WILL BE KILLED DRIVING THESE TRUCKS.  *TR",
        "vin": "1HTMMAAM34H"
    }
]