[
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "04/01/2009",
        "dateOfIncident": "12/01/2008",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10263874,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "MONTANA",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Dometic Corporation",
                "productMake": "DOMETIC",
                "productModel": "RM2852",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 KEYSTONE FIFTH WHEEL RV TRAILER.  THE VEHICLE HAS A DOMETIC REFRIGERATOR, MODEL RM2852.  THE CONTACT RECEIVED A RECALL NOTICE FOR THE DOMETIC REFRIGERATOR.  DOMETIC STATED THAT THE REFRIGERATOR WAS OUT OF WARRANTY AND HE WOULD HAVE TO CALL A DEALER AND PAY FOR THE REPAIR.  CURRENTLY, THE TWO DOOR REFRIGERATOR DOES NOT WORK AT ALL.  COOLANT WAS LEAKING IN THE REAR OF THE REFRIGERATOR, WHICH IS LOCATED NEXT TO THE GAS LINE.  THE CONTACT HAD TO TURN OFF THE GAS LINE AND THEN TURN OFF THE REFRIGERATOR BEFORE A FIRE OCCURRED IN THE RV.   UPDATED 05/06/09.  *LJ  UPDATED 05/07/09",
        "vin": "4YDF340264D"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "10/06/2008",
        "dateOfIncident": "09/01/2008",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10244523,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "MONTANA",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Dometic Corporation",
                "productMake": "DOMETIC",
                "productModel": "RM2852",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 KEYSTONE MOUNTAINEER.  THE VEHICLE HAS A DOMETIC REFRIGERATOR, MODEL RM2852.  THE CONTACT RECEIVED A RECALL NOTICE FOR NHTSA CAMPAIGN ID NUMBER 08E032000 (EQUIPMENT) AND IMMEDIATELY CALLED THE MANUFACTURER.  HE WAS ADVISED TO HAVE HIS UNIT REPAIRED ACCORDING TO THE RECALL, WHICH STATED THAT DOMETIC WOULD INSTALL A SECONDARY BURNER HOUSING.  HE IS CONCERNED THAT THE REMEDY WOULD NOT PREVENT THE FAILURE, BUT RATHER CONTAIN IT IN THE EVENT THAT ONE OCCURS.  THE REFRIGERATOR HAS NOT YET BEEN REPAIRED.   UPDATED 11-19-08 *BF  UPDATED 11/20/08. *JB",
        "vin": "4YDT335204F"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "07/16/2008",
        "dateOfIncident": "04/29/2008",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10234569,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "MONTANA",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Dometic Corporation",
                "productMake": "DOMETIC",
                "productModel": "RM2852",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 KEYSTONE MONTANA.  THE VEHICLE HAS A DOMETIC REFRIGERATOR, MODEL RM2852.  THE CONTACT RECEIVED A RECALL NOTICE FOR NHTSA CAMPAIGN ID NUMBER 08E032000 (EQUIPMENT), WHICH MENTIONED A POTENTIAL FIRE HAZARD.  HE HAS BEEN ATTEMPTING TO HAVE THE REFRIGERATOR SERVICED EVER SINCE THE NOTICE WAS RECEIVED.  SEVERAL DEALERS REFUSED TO COOPERATE AND WOULD NOT ALLOW HIM TO SCHEDULE A REPAIR APPOINTMENT.  THE CONTACT IS CONCERNED THAT THE REFRIGERATOR COULD CATCH FIRE.  THE MANUFACTURER OF THE REFRIGERATOR HAS NOT BEEN NOTIFIED.  THERE HAD BEEN NO FAILURE TO DATE.  THE PURCHASE DATE AND PART NUMBER WERE UNKNOWN. UPDATE 09/10/08 *CW  THE CONSUMER STATED THE PROBLEM  HAS BEEN RESOLVED. UPDATED 09/11/08 *JB",
        "vin": "4YDT305274F"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/23/2006",
        "dateOfIncident": "10/14/2006",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10174126,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "MONTANA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MY FIFTH WHEEL TRAILER IS WEARING OUT ALL FOUR TIRES ON THE INSIDE EDGE.  WEAR SEVERE ENOUGH THAT I HAD TO USE SPARE ON ONE WHEEL, CAUSED HAVING TO CHANGE TIRE ON EDGE OF INTERSTATE HIGHWAY. THE AXLES WERE MANUFACTURED BYAL-KO.  THEY REFUSED TO DO ANYTHING AS THEY SAID THEY WERE OUT OF WARRANTY.  DURING INVESTIGATING I FOUND THAT THERE ARE MANY RV'S WITH THE SAME TROUBLE, ALL WITH AL-KO AXLES.  I AM REPLACING THE AXLES AT MY OWN COST. *JB",
        "vin": "4YDF288294D"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/23/2006",
        "dateOfIncident": "10/23/2006",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10171643,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "MONTANA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THE TIRES WERE WEARING PREMATURELY ON THE INSIDE.  THE VEHICLE WAS TAKEN TO THE DEALERSHIP, WHERE IT WAS DETERMINED THE AXLES WERE BENT.  THE AXLES WERE REPLACED. *AK",
        "vin": "4YDF367214D"
    },
    {
        "components": "SUSPENSION",
        "crash": true,
        "dateComplaintFiled": "08/23/2005",
        "dateOfIncident": "06/29/2005",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10127293,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "MONTANA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THE CONSUMER HAS A KEYSTONE MONTANA MOUNTAINEER TRAVEL TRAILER.  THE TRAILER HAD THROWN THE LEFT REAR TIRE IN FEBRUARY 2, 2005.  THERE WAS A BENT AXLE ON THE RIGHT REAR TIRE.  THE DEALER DID NOT KNOW WHY IT WAS BENT, BUT THOUGHT IT WAS LIKE THAT ALL ALONG.  THE TRAILER SWERVED BACK AND FORTH BECAUSE OF THE BENT AXLE.  ON JUNE 29, 2005 THE TRAILER HIT A GUARD RAIL.  THIS OCCURRED ON HIGHWAY 450N NEAR FRANKLINTON, LA.  WHEN HE CONTACTED KEYSTONE, THEY TOLD HIM THAT THEY KNEW WHY THE TIRE CAME OFF, BUT WOULD NOT GIVE HIM ANYMORE INFORMATION.  HE SPOKE WITH KIM DOOLEY AT KEYSTONE CUSTOMER SERVICE, AND SHE TOLD HIM, IF YOU WANT TO SUE US YOU COULD GO AHEAD AND SUE US.   THE CONSUMER TALKED TO THE LEGAL DEPARTMENT AND THE CONSUMER COULD  NOT PROVE THAT THE BENT AXLE CAUSED THE TRAILER TO SWERVE.  THERE WAS NO POLICE REPORT BECAUSE NO ONE WAS INJURED, AND THERE WERE NO OTHER PEOPLE INVOLVED.  THERE WAS NO WHERE TO PULL OVER ON THE ROAD.  KEYSTONE REFUSED TO HELP, BUT TOLD THE CONSUMER TO CONTACT HIS INSURANCE COMPANY.  THERE WAS DAMAGE TO THE TRAILER.  *AK  *SC",
        "vin": "4YDT335254F"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/07/2005",
        "dateOfIncident": "07/31/2005",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131859,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "MONTANA",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "I WAS PULLING A 2004 TRAVEL TRAILER THAT HAS ABOUT 3000 MILES ON IT.  TWO TIRES FAILED/SEPARATED AND BLEW OUT.  WHEN THE FIRST BLOW-OUT HAPPENED THE TRUCK I WAS PULLING THE TRAILER WITH BEGAN TO VIBRATE AND THEN WITHIN 2 SECONDS, BEFORE I COULD SLOW DOWN, A LOUD POP CAME FROM THE TRAILER AND BY THE TIME I STOPPED THE TIRE WAS SHREDDED.  I CHANGED THAT TIRE WITH THE SPARE.  30 MILES LATER ANOTHER TIRE BLEW.  THIS TIRE WAS LOCATED ON THE OPPOSITE SIDE OF THE TRAILER ON A DIFFERENT AXLE.  IT BLEW OUT WITH THE SAME TRUCK VIBRATION AND POP AS THE OTHER ONE.  THEN I LOOKED AT THE OTHER TIRES AND FOUND A THIRD TIRE WAS SEPARATING, THE TREAD WAS LIFTING AND WIRE CORDS WERE COMING OUT.  ALL 5 TIRES, INCLUDING THE SPARE WERE REPLACED.  THE TRAILER HAS BEEN DAMAGED BUT I HAVEN'T BEEN TO A RV DEALER FOR ESTIMATES AT THIS TIME.  I SEARCHED FOR COMPLAINTS BUT THIS TIRE BRAND ISN'T LISTED.  I KEPT THE OLD TIRES BECAUSE I FIGURED THE DEALER WOULD WANT TO SEE THE ORIGINAL TIRES AND DOT'S BEFORE THEY COULD BE WARRANTED IF A WARRANTY IS VALID.  THESE TIRES ARE MISSION BRAND TIRES - SIZES ST225/75R15.  THE DOT #'S ARE 1- WEHH 2735103 2510, 1- WEHH 2735103 2610, 1- WEHH 2735103 2504, AND 2- WEHH 2730504 03  THIS INCIDENT HAPPENED JULY 31ST WHEN WE WERE TRAVELING TO GRAND JUNCTION, CO.  THE WEATHER WAS HOT (100'F), AND SUNNY.  I HAVE READ NUMEROUS COMPLAINTS FROM OTHER PEOPLE ON THE RV.NET FORUM.  THEY ARE HAVING BLOW-OUTS AND TIRE SEPARATIONS THE SAME AS I HAVE.    *NM",
        "vin": "4YDT325294F"
    }
]