[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/23/2020",
        "dateOfIncident": "09/18/2020",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360696,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING WHILE DARK, HAD SMOKE SMELL FROM INSIDE CAB.  DRIVING IN DAYLIGHT LATER, AND SAW SMOKE COMING FROM BEHIND STEERING COLOMN.  SMOKE GOT MUCH WORSE, ENDANGERED DRIVING, AND COLUMN STARTED TO GET HOT.  PULLED OVER, AND NOTICED THE FOG LIGHTS WERE STILL ON DESPITE THE SWITCH, AND KEY BEING OFF.  PULLED THE FUSE, AND RELAY, THEN PROBLEM STOPPED.  I REMOVED THE TURN SIGNAL SWITCH ASSEMBLY, WHICH ALSO HOUSES THE HEAD LIGHTS AND FOG LIGHT SWITCHES, AND FOUND THE CONNECTOR OVERHEATED, AND SHORTED INTERNALLY.  WHILE WAITING FOR A REPLACEMENT SWITCH, THE TURN SIGNALS AND FLASHERS QUIT WORKING.  I TRIED A NEW FLASHER RELAY, BUT CAN ONLY ASSUME THE CONNECTOR IS THE MAIN FAULT, AS IT WAS PARTIALLY MELTED AND NOW BRITTLE FROM THE FIRE.  AFTER TROUBLE SHOOTING AND MULTIPLE TIMES INSTALLING AND REMOVING THE CONNECTOR, IT HAS BEGUN TO CRACK AND FALL APART, FURTHER DISABLING OTHER SWITCHES.  I'M CURRENTLY REPLACING THE CONNECTOR ONCE I AM ABLE TO LOCATE ONE.   MY MAIN CONCERN IS THIS COULD HAVE CAUSED A MAJOR DISTRACTION AND POSSIBLE CRASH WHILE DRIVING, AND EVEN MORE SO, THAT A FIRE COULD OCCUR WHILE THE VEHICLE IS PARKED, LIKE IN MY GARAGE WHILE I SLEEP!    EVERY THING ON THE JEEP IS STOCK, AND THE FOG LIGHTS ARE A OEM OPTION INSTALLED BY THE DEALER WHEN I BOUGHT IT NEW, FROM THE FACTORY.  I'VE DONE NO MAINTENANCE EXCEPT TO REPLACE THE TURN SIGNAL SWITCH WHEN THE FOG LIGHT SWITCH FAILED 40K MILES AGO.  THE CONNECTOR WAS FINE THEN, AND IT WAS ONLY A SWITCH FAILURE AT THAT TIME.  THE JEEP HAS 135K MILES ON IT CURRENTLY.  THE CURRENT TURN SIGNAL SWITCH WAS NOT AT FAULT SINCE I NOW KNOW THE CONNECTOR WAS WHAT WAS BURNING.   I'VE READ OF SEVERAL INCIDENCES ON JEEP FORUMS WHERE SOMETHING SIMILAR HAS HAPPENED, WITH EITHER THE CONNECTOR, OR THE TURN SIGNAL SWITCH.  I FEEL THIS IS A MULTIPLE SAFETY HAZARD, NOT ONLY WHILE DRIVING, BUT ALSO WHEN PARKED.",
        "vin": "1J4FA69S24P"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": true,
        "dateComplaintFiled": "03/11/2020",
        "dateOfIncident": "03/11/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11317552,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "HIT A REGULAR BUMP IN THE ROAD, AT 35 MILES PER HOUR ON A STRAIT STRETCH OF ROAD AND THE ATTACHMENT POINT FOR THE FRONT SUSPENSION PULLED AWAY FROM THE FRAME AND I LOST CONTROL OF THE JEEP, UPON FURTHER INSPECTION I DISCOVERED THAT THE ENTIRE CENTER SECTION OF THE FRAME IS RUSTED FROM THE INSIDE OUT ON BOTH SIDES, THE FRAME SHOULD BE THE LAST THING TO FAIL ON ANY VEHICLE, THIS JEEP HAS ONLY 65,000 MILES ON IT AND HAS NEVER BEEN OFF ROADED OR ABUSED. FOR A VEHICLE THAT IS KNOWN TO LAST 200K MILES PLUS TO HAVE FRAME FAILURE AT 65K MILES IS NOT ONLY NEGLIGENT ON CHRYSLERS BEHALF BUT IT ALSO POSES A REAL SAFETY HAZARD TO THE GENERAL PUBLIC, IMAGINE HOW MANY PEOPLE ARE DRIVING THESE JEEPS DOWN THE ROAD AT 70-80 MILES PER HOUR WITH A FRAME THAT COULD FAIL AT ANYTIME. THIS IS A KNOWN PROBLEM WITH THESE JEEPS AND CHRYSLER NEEDS TO BE FORCED TO DO SOMETHING ABOUT IT BEFORE MORE LIVES ARE LOST, IN 10 YEARS MANY OF THESE VEHICLES WILL STILL BE ON THE ROAD AND THE PROBLEM WILL ONLY GET WORSE. PLEASE HELP",
        "vin": "1J4FA39S54P"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/09/2020",
        "dateOfIncident": "03/08/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316948,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Michelin North America, Inc.",
                "productMake": "BF GOODRICH",
                "productModel": "31X10.50R15LT 109S AT TA KO LRC TLRWL07",
                "productYear": "9999",
                "size": "31X10.5/75R15",
                "type": "Tire"
            }
        ],
        "summary": "ON MARCH 8, 2020 WHILE DRIVING AT 75 MPH ON INTERSTATE 75, THE RIGHT REAR (RR) TIRE ON MY 2004 JEEP WRANGLER BLEW OUT.  THE TIRES WERE PURCHASED AT SAM'S CLUB IN MAY 2018.     THE VEHICLE HAD A MATCHING SET OF TIRES ALL PURCHASED AT THE SAME TIME (MAY 18) - BF GOODRICH ALL TERRAIN TA KO2.  SIZE 31 X 10.5 R15.  THE MILEAGE ON THE TIRE AT TIME OF BLOW OUT WAS ONLY 16,386 MILES.  IT IS VERY CLEAR FROM PHOTOGRAPHS THAT REAR TIRE TREAD SEPARATED FROM THE SIDEWALL.      WEATHER CONDITIONS AT TIME OF TIRE FAILURE WERE EXCELLENT - CLEAR, SUNNY, 57 DEG F.  ROADS WERE CLEAR AND DRY.  TIRE PRESSURE FOR REMAINING 3 TIRES WAS CHECKED IMMEDIATELY AFTER BLOW OUT OF RR, AND ALL 3 TIRES WERE FOUND TO BE SAME PRESSURE (35 PSI).      THE TIRE WAS MARKED DOT BF60_AT11_1118.    I AM AN AUTOMOTIVE ENGINEER WITH +30 YEARS OF EXPERIENCE IN AUTOMOTIVE DRIVELINE.  THE WAY THE TREAD SEPARATED CLEANLY FOR FULL 360 DEG FROM SIDEWALL ON FRONT OF TIRE CLEARLY LEAVES ME BELIEVING THERE IS A MANUFACTURING OR DESIGN DEFECT IN THESE TIRES.      I AM CONCERNED ABOUT THE SAFETY OF THIS BF GOODRICH ALL TERRAIN TA KO2 TIRE ON THE ROAD.",
        "vin": ""
    },
    {
        "components": "STEERING,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "01/01/2020",
        "dateOfIncident": "01/30/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11292490,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A RIGHT HAND DRIVE 2004 JEEP WRANGLER. THE RIGHT SEAT BELT LATCH IS ALWAYS STICKING CAUSING MY SEAT BELT TO COME LOOSE. THE STEERING WHEEL STARTS SHAKING VIOLENTLY WHEN REACHING SPEEDS ABOVE 50 MPH,IF YOU HIT A BUMP, OR IF IT'S WINDY OR AN 18 WHEELER PASSES YOU ON HIGHWAY, THE JEEP WILL ROCK SIDE TO SIDE LIKE IT'S GOING TO TURN OVER. IT'S VERY HARD TO CONTROL THE VEHICLE. I HAVE CHILDREN TO HAUL AROUND.",
        "vin": "1J4F449S64P"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "10/25/2019",
        "dateOfIncident": "08/01/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11271055,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER FRONT SEAT BELT JAMMED IN 2004 JEEP RUBICON.",
        "vin": "1J4FA69SX4P"
    },
    {
        "components": "STEERING,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "06/21/2019",
        "dateOfIncident": "06/20/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11221662,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2004 JEEP WRANGLER. THE CONTACT STATED THAT WHILE EXITING HER DRIVEWAY CARPORT GOING 10 MPH, WITHOUT WARNING THE VEHICLE ACCELERATED AND THE CONTACT COULD NOT CONTROL THE STEERING WHEEL WHICH SEIZED. THE CONTACT ATTEMPTED TO DEPRESS THE BRAKES WHICH FAILED CAUSING, THE CONTACT TO CRASH INTO THE CARPORTS POLE ALLOWING THE VEHICLE TO COME TO A COMPLETE STOP. NO EMERGENCY BRAKE WAS APPLIED. NO INJURIES, NO POLICE REPORT FILED, NO MEDICAL ATTENTION, NO DAMAGE'S TO THE VEHICLE, THE DEALER WAS NOT CONTACTED, AND NO DIAGNOSTIC TEST WAS PERFORMED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 130,000.",
        "vin": "1J4FA39S44P"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/19/2018",
        "dateOfIncident": "11/01/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11152612,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE WRANGLER REACHES APPROXIMATELY 55 MPH, IT BEGINS TO VIOLENTLY (AND TERRIFYINGLY) SHAKE UNCONTROLLABLY.  IT MAKES IT DIFFICULT TO MAINTAIN ANY CONTROL OF THE VEHICLE, AND WE HAVE HAD SEVERAL NEAR MISSES, BARELY AVOIDING ACCIDENTS.  WE HAVE REPORTED THIS FOR *YEARS* TO OUR AUTO REPAIR AND TIRE COMPANIES, HAD SEVERAL THINGS DONE IN A DESPERATE ATTEMPT TO REMEDY IT, INCLUDING 2 SETS OF TIRES, WITH NO SUCCESS.  WITH REPORTS OF THE \"DEATH WOBBLE\" NOW BECOMING WIDELY KNOWN, WE INSTANTLY KNEW THAT WE WERE NOT ALONE, AND THAT THIS IS A WIDESPREAD ISSUE THAT JEEP NEEDS TO ADDRESS.  THIS IS A HUGE SAFETY ISSUE.",
        "vin": "1J4FA59S94P"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/03/2017",
        "dateOfIncident": "05/01/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11043109,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE SHIFTS HARD FROM GEAR TO GEAR FOR FIRST 5 MINUTES OR SO OF DRIVING.  RANDOMLY THROWS 02 OR CPS CODES.  HAD ALL PARTS REPLACED MORE THAN ONCE. PCM REPLACED TWICE.  TWO MECHANICS CONFIRMED IT WAS A FAULTY PCM.  SHIFTING ETC, IS BETTER WHEN NEGATIVE BATTERY CABLE DISCONNECTED OVERNIGHT.  AFTER A FEW CYCLES, THE ISSUES RETURN.  PCMS ARE DEFECTIVE FROM THE FACTORY. MY MECHANIC CURRENTLY HAS TWO 2006 JEEPS WITH THE SAM PROBLEM.  LONG INVOLVED POST WITH MULTIPLE EXAMPLES DOCUMENTING ISSUES HERE:HTTP://WWW.WRANGLERFORUM.COM/F210/1ST-TO-2ND-HARD-SHIFTS-WHEN-COLD-2006-LJ-1755777.HTML.  VEHICLE IS UNPREDICTABLE UPON INITIAL ACCELERATION AS IT MAY BE IN 2ND GEAR WHILE STOPPED.  ALMOST HAD MULTIPLE ACCIDENTS.",
        "vin": "1J4FA44S26P"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/13/2017",
        "dateOfIncident": "10/01/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11033291,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MOUNTING BRACKET FOR REAR TRAILING ARM BECAME DETACHED FROM THE FRAME. DUE TOO CORROSION FROM THE INSIDE OUT. CAUSE VEHICLE TO BE UNSAFE AND UNABLE TO DRIVE. CONTACTED JEEP DEALER AND INSURANCE COMPANY WAS TOLD THAT THERE WAS NO COVERAGE OR ASSISTANCE IN REGARDS TO REPAIR. VEHICLE IS ONLY 13 YEARS OLD CAN'T BELIEVE JEEP/NHTSA WOULD NOT HAVE A RECALL ON FAILURE SUCH AS THIS. IT RENDERS MY VEHICLE WORTHLESS, UNSAFE, AND UNABLE TO DRIVE.",
        "vin": "IJ4FA49S84P"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/06/2017",
        "dateOfIncident": "01/15/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003414,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 JEEP WRANGLER. WHILE DRIVING 30 MPH AND ATTEMPTING TO SHIFT FROM FIRST TO SECOND GEAR, THE VEHICLE JERKED FORWARD WITHOUT WARNING. THE FAILURE RECURRED INTERMITTENTLY. ADDITIONALLY, WHILE DOWNSHIFTING, THE VEHICLE SHIFTED ROUGHLY AND JERKED FORWARD. THE VEHICLE DOWNSHIFTED INDEPENDENTLY WHILE STOPPED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THAT THE TRANSMISSION FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED, BUT THE FAILURE RECURRED. THE VEHICLE WAS TAKEN TO THE INDEPENDENT MECHANIC AGAIN WHO DIAGNOSED THAT THE TRANSMISSION FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED, BUT THE FAILURE RECURRED. THE CONTACT SPOKE TO LAKE ELSINORE CHRYSLER DODGE JEEP RAM (31400 AUTO CENTER DR, LAKE ELSINORE, CA 92530) WHO SCHEDULED AN APPOINTMENT, BUT THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND ESCALATED THE CASE IN AN ATTEMPT TO FIND A SOLUTION. THE APPROXIMATE FAILURE MILEAGE WAS 277,407.",
        "vin": "1J4FA39S04P"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/14/2017",
        "dateOfIncident": "06/16/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10995232,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "EXCESSIVE FRAME RUST, FROM THE INSIDE OUT. YOU DON'T NOTICE UNTIL THE HOLES SHOW UP.",
        "vin": "1J4FA39S24P"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/26/2017",
        "dateOfIncident": "02/16/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10957091,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TRAVELING ON THE HIGHWAY AT APPROXIMATELY 60 MPH WHEN WITHOUT ANY WARNING THE FRONT WHEELS BEGAN TO WOBBLE UNCONTROLLABLY.  I COULD NOT GET THE VEHICLE UNDER CONTROL UNTIL I SLOWED DOWN TO AROUND 20 MILES AN HOUR.  ONCE THE VEHICLE WAS UNDER CONTROL I WAS ABLE TO CAUTIOUSLY ACCELERATE BACK TO SPEED AND DID NOT EXPERIENCE ANY FURTHER TROUBLE.  THE INITIAL PROBLEM STARTED IN HEAVY TRAFFIC AND I WAS AFRAID OF BEING REAR ENDED BECAUSE OF MY QUICK DECELERATION TO BRING THE VEHICLE UNDER CONTROL.  THIS IS THE SECOND TIME THAT I HAVE EXPERIENCED THIS PROBLEM BOTH TIMES AT ABOUT 60 MPH AND STRAIGHT AND LEVEL ROADWAYS.  BOTH TIMES THE EXTREME WOBBLING WAS SUDDEN AND UNEXPECTED.",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/31/2016",
        "dateOfIncident": "10/22/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10920249,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DASHBOARD COVERING OVER PASSENGER SIDE AIRBAG IS EXTREMELY STICKY. MY CONCERN IS NOT JUST FOR APPEARANCE, BUT FOR PROTECTION OF THE AIRBAG ITSELF AND THE NEED TO CONTINUALLY CLEAN THE PASSENGER SIDE WINDSHIELD DUE TO A SLIGHT FILM PRODUCED FROM THE DECAYING VINYL DASHBOARD. THIS VEHICLE IS HOUSED IN A GARAGE IN FLORIDA.  *TR",
        "vin": "1J4FA49S84P"
    },
    {
        "components": "STEERING,SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/21/2016",
        "dateOfIncident": "07/21/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10887617,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER'S SIDE LOWER CONTROL ARM MOUNT ON OUR 2004 JEEP WRANGLER BROKE OFF FROM THE FRAME WHILE DRIVING. WHILE ACCELERATING ON A CITY STREET, THERE WAS A LOUD BANG NOISE FROM UNDERNEATH THE VEHICLE, AND THE JEEP BECAME EXTREMELY DIFFICULT TO CONTROL AND STARTED WANDERING ALL OVER THE ROAD.     UPON PULLING OVER AND LOOKING UNDERNEATH THE VEHICLE WE FOUND THAT THERE WERE EXTREME AMOUNTS OF RUST AND CORROSION INSIDE THE FRAME THAT WAS VISIBLE FROM THE OUTSIDE. THIS RUST CAUSED THE ENTIRE LOWER CONTROL ARM MOUNT TO BREAK OFF FROM THE FRAME.     ANOTHER ROT HOLE WAS FOUND FURTHER UP THE FRAME NEAR THE TRANSMISSION SKIDPLATE/CROSS-MEMBER ASSEMBLY AS WELL.",
        "vin": "1J4FA39S94P"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/02/2016",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10872156,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "CLOCKSPRING DEFECTIVE CAUSING NON AIRBAG DEPLOYMENT AND NON FUNCTIONING WARNING HORN.",
        "vin": "1J4FA49SX4P"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/25/2016",
        "dateOfIncident": "01/14/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10870793,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DEATH WOBBLE",
        "vin": "1J4FA39S64P"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/31/2016",
        "dateOfIncident": "11/12/2012",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10852771,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 JEEP WRANGLER. WHILE DRIVING 60 MPH OVER BUMPS IN THE ROAD, THE VEHICLE BOUNCED ALL OVER THE ROAD, THE FRONT END SHOOK VIOLENTLY, AND THE STEERING WHEEL BECAME DIFFICULT TO CONTROL. THE CONTACT STATED THAT THE BRAKE PEDAL HAD TO BE APPLIED TO REGAIN CONTROL OF THE VEHICLE. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE FRONT STEERING DAMPER NEEDED TO BE REPLACED. THE REPAIRS WERE PERFORMED, BUT THE FAILURE RECURRED SEVERAL TIMES. THE VEHICLE WAS TAKEN TO A DEALER A COUPLE MORE TIMES AND REPAIRED, BUT THE FAILURE RECURRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURES. THE FAILURE MILEAGE WAS 48,000.",
        "vin": "1J4FA49S44P"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/19/2016",
        "dateOfIncident": "03/11/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10850515,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 91,500 MILES THE PCM FAILED FOR A SECOND TIME.  I AM NOT CERTAIN WHEN THE FIRST FAILURE OCCURRED, BUT IT WAS SHOWN TO HAVE BEEN FLASHED PREVIOUSLY.  THIS ISSUE SURFACED IN THE FORM OF A STALL OUT AT A LIGHT.  WHEN ATTEMPTING TO ACCELERATE FROM AN IDLE POSITION THE ENGINE STALLED.  AFTER PARKING THE VEHICLE, TURNING OVER THE ENGINE WHILE SIMULTANEOUSLY GIVING IT GAS, THE VEHICLE TURNED OVER.  ACCORDING TO THREE DIFFERENT MECHANICS THIS IS A COMMON ISSUE AMONG '04 JEEP WRANGLERS THAT THEY HAVE ENCOUNTERED RECENTLY (12 YEARS AFTER MARKET AND 2 YEARS COMPLETELY OUT OF WARRANTY).  NO ONE CAN FIND A REPLACEMENT PCM BECAUSE THEY ARE NO LONGER MANUFACTURED, AND IT WAS CHRYSLER'S RECOMMENDATION THAT CUSTOMERS EXPERIENCING THIS ISSUE GO TO A SCRAP YARD TO FIND A REPLACEMENT (LIKELY TO HAVE THE SAME ISSUE).  AS A CUSTOMER I AM APPALLED THAT WE ARE AWARE OF THIS ISSUE AND THERE HAVE BEEN NO RECALLS.  DRIVING DOWN THE HIGHWAY MY BATTERY CHARGED TO 20 VOLTS AND COULD HAVE EXPLODED.",
        "vin": "1J4FA29184P"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/27/2016",
        "dateOfIncident": "12/29/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10822621,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 JEEP WRANGLER. THE CONTACT STATED THAT WHEN THE VEHICLE WAS TAKEN IN FOR ROUTINE MAINTENANCE, THE TECHNICIAN STATED THAT THE REAR PASSENGER SIDE HUB BEARING AND AXLE SEAL NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE FAILURE RECURRED AND WAS REPAIRED AT 41,846, 46,297, 52,000 AND 55,600 MILES. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 39,000.",
        "vin": "1J4FA49S54P"
    },
    {
        "components": "STEERING,SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "11/30/2015",
        "dateOfIncident": "11/28/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10807552,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE MOVING DOWN HIGHWAYS 40 TO 65MPH IVE NOTICED THAT WHENEVER I HIT POT HOLES OR BUMPS MY CAR IMEDIATELY GOES INTO A MAJOR WOBBLE LIKE I HAVE A FLAT TIRE, HOWEVER AS SOON AS I TAP MY BRAKE IT STOPS. MY FRIEND TOLD ME THIS IS A DEATH WOBBLE FACTORY RECALL BUT JEEP DEALERS TELL ME MY CAR VIN ISNT INCLUDED. WHY NOT SINCE IT HAS THE PROBLEM?!",
        "vin": "1J4FA59S84P"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/08/2015",
        "dateOfIncident": "09/01/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10762357,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "JEEP HAS NEVER BEEN OFF ROAD. HUSBAND NOTICED WHILE CHANGING OIL, FRAME ROT WAS VISIBLE IN FRONT OF VEHICLE. LATER TOOK TO LOCAL AUTOBODY SHOP THAT CONFIRMED FRAME IS ROTTED FROM INSIDE OUT.  RECOMMENDS NEW FRAME AND TO NOT DRIVE IT DUE TO SAFETY CONCERNS.  HE STATED THIS IS VERY COMMON IN JEEPS AND THAT I SHOULD FILE A VEHICLE SAFETY COMPLAINT.",
        "vin": "1J4FA49S84P"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/23/2015",
        "dateOfIncident": "08/23/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10758649,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "JEEP \"DEATH WOBBLE\" BETWEEN 50-60 MPH. I'VE CORRECTED ISSUE 3X OVER THE YEARS.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/26/2015",
        "dateOfIncident": "07/17/2009",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10743557,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS AT A COMPLETE STOP WITH MY FOOT ON THE BRAKE, AUTOMATIC TRANSMISSION IN DRIVE.  THE ENGINE STARTED TO RACE AT VERY HIGH R.P.M.'S FOR NO REASON.  I WAS ABLE TO KEEP THE VEHICLE FROM ACCELERATING WITH HARD BRAKE PRESSURE AND QUICKLY SHIFTED INTO NEUTRAL.  THE ENGINE RETURNED TO NORMAL IDLE AFTER SEVERAL SECONDS.  THIS HAS HAPPENED APPROXIMATELY 5 ADDITIONAL TIMES SINCE THEN FOR NO APPARENT REASON.  I CHECK FLOOR MATS, GAS PEDAL MOVEMENT AND EVEN ATTEMPTED TO APPLY PRESSURE TO BOTH THE GAS AND BRAKE PEDAL AT THE SAME TIME WHICH WAS IMPOSSIBLE.  THERE SEEMS TO BE NO COMMON FACTOR TO THESE INCIDENTS.  I HAVE NOT EXPERIENCED ANY WARNING LIGHTS OR CODES.",
        "vin": "1J4FA39S94P"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/23/2015",
        "dateOfIncident": "06/03/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10726915,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING DOWN THE HIGHWAY AT ANYWHERE ABOVE 40MPH AND HITTING A BUMP IN THE ROAD SENDS THE VEHICLE INTO A VIOLENT SHAKE/WOBBLE. THIS DOES NOT STOP UNTIL THE VEHICLE IS SLOWED DOWN TO BELOW 40.   THE JEEP IS COMPLETELY STOCK. NO LIFT, NO BIGGER TIRES.",
        "vin": "1J4FA69S84P"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "05/11/2015",
        "dateOfIncident": "04/27/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10715738,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 16 YEAR OLD DAUGHTER WAS DRIVING THE VEHICLE ON NORMAL DRY PAVEMENT WHEN THE CASTING THAT ANCHORS THE TIE ROD TO THE FRONT LEFT WHEEL SNAPPED OFF. THE VEHICLE VIOLENTLY PULLED TO THE RIGHT CAUSING IT TO GO OFF THE PAVED ROAD SURFACE AND CRASHING INTO A TREE. THE VEHICLE HAS THE ORIGINAL FACTORY SUSPENSION AND TO MY KNOWLEDGE HAS NEVER BEEN MODIFIED.",
        "vin": "1J4FA39SX4P"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/15/2014",
        "dateOfIncident": "07/28/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10664298,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 JEEP WRANGLER. THE CONTACT STATED THAT AFTER REFUELING THE VEHICLE, THERE WAS A STRONG FUEL ODOR COMING FROM THE FUEL TANK. THE CONTACT DISCOVERED THAT THERE WAS FUEL LEAKING FROM THE TOP OF THE FUEL TANK. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 98,000.   UPDATED 02/04/15*LJ      UPDATED 6/8/2015*JS",
        "vin": "1J4FA49S44P"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/14/2014",
        "dateOfIncident": "06/17/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10664147,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I DROVE TO THE GAS STATION  ONE MORNING FILLED MY GAS TANK  WHEN I GOT HOME AND PARKED  ON THE DRIVE WAY;  I GOT OFF THE JEEP I SMELLED GAS WHEN I LOOKED BACK  BEHIND THE JEEP I SAW GAS RUNNING DOWN FROM THE TOP OF THE GAS  TANK .                                                                                                                 [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "1J4FA49S44P"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/12/2014",
        "dateOfIncident": "06/09/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10663984,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 JEEP WRANGLER. WHILE DRIVING 20 MPH, THE ENGINE STALLED WITHOUT WARNING. THE VEHICLE WAS SHIFTED INTO PARK AND RESTARTED; HOWEVER, THE FAILURE RECURRED SEVERAL TIMES. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 114,000.",
        "vin": "1J4FA49S14P"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/28/2014",
        "dateOfIncident": "07/12/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10650906,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TEXTING DRIVER TURNED INTO MY LANE WITH NO CHANCE TO HIT BRAKES FOR ME WE HIT HEAD ON AT 35 MPH. THE CHEVY IMPALAS AIR BAGS WENT OFF OURS DID NOT . AFTER THE HARDEST HIT OR IMPACT OF MY LIFE WE ROLLED OVER AND LANDED ON THE PASSENGER SIDE WINDSHIELD AND ROLL CAGE , COLLAPSED ON MY WIFE'S HEAD TO LACERATE AND FRACTURE MY WIFE'S SCULL. HAD AIR BAGS WORKED I WOULDN'T HAVE GOTTEN A BROKEN NOSE ON BOTH CODES AND A FRACTURED CHEEK.",
        "vin": "MURRANOS"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/27/2014",
        "dateOfIncident": "09/22/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10639525,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "\"JEEP DEATH WOBBLE\"....VIOLENT SHAKING OF FRONT END CALLED......AFTER HIGHWAY BUMP OR UNEVEN ROAD SURFACE......HAD TO PULL OVER ONTO SHOULDER TO STOP IT..........   I HAVE HAD THIS FIXED NUMEROUS TIMES, WITH NEW TIRES, ALIGNMENT, AND IT KEEPS COMING BACK....  *TR",
        "vin": "1J4FA69S74P"
    },
    {
        "components": "SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/20/2014",
        "dateOfIncident": "07/14/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10637735,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING FRONT END STARTED TO SHAKE UNCONTROLLABLY,  HAD TO ALMOST COME TO A STOP TO GET IT STOP SHAKING.  *TR",
        "vin": "1J4FA39S94P"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/13/2014",
        "dateOfIncident": "07/01/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10622053,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 JEEP WRANGLER. THE CONTACT STATED THAT THE WELDING ON THE VEHICLE'S FRAME WAS DETERIORATING TO THE POINT OF POTENTIALLY DETACHING ON THE PASSENGER SIDE FLOOR PANELING. IN ADDITION, THE INTERIOR OF THE FLOOR WAS DETACHING FROM THE DRIVER SIDE AND THE FRONT PASSENGER SIDE. THE VEHICLE WAS TAKEN TO TWO PRIVATE MECHANICS WHO STATED THAT THE RUST AND CORROSION WAS EXCESSIVE AND THE PANELS NEEDED TO BE REPLACED AND WELDED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 84,500.",
        "vin": "1J4FA49S24P"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "07/28/2014",
        "dateOfIncident": "07/19/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10616809,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL- THE CONTACT OWNS A 2004 JEEP WRANGLER.  THE CONTACT STATED THE WHILE DRIVING 45 MPH DOWN A STEEP HILL WHEN THE BRAKES FAILED.  THERE WERE NO WARNING LIGHTS THAT ILLUMINATED ON THE INSTRUMENT PANEL. THE CONTACT VEERED THE VEHICLE TO THE RIGHT.  THE VEHICLE WAS WAS STEERED ALONG SIDE A FENCE, IN ORDER TO SLOW THE VEHICLE DOWN.  THE CONTACT CRASHED INTO A TREE IN ORDER TO STOP THE VEHICLE.  THE TWO FRONT AIR BAGS DID DEPLOY.  THERE WERE NO REPORTED INJURIES.  THE VEHICLE WAS TOTALED.  THE VEHICLE DID NOT HAVE COLLISION INSURANCE.  THE CONTACT DID NOT CONTACT THE MANUFACTURER TO INQUIRE ABOUT VIN NUMBER BEING INCLUDED IN THE RECALL.  THE FAILURE MILEAGE WAS 65,000. THE VIN WAS NOT PROVIDED.",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/09/2014",
        "dateOfIncident": "07/09/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10609263,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE BEGAN SHAKING VIOLENTLY AFTER HITTING A ROUGH SPOT ON THE INTERSTATE. HAD TO BRAKE HARD AND PULL OFF THE INTERSTATE TO REGAIN CONTROL. CHECKED OUT THE VEHICLE FOR ANYTHING OBVIOUSLY WRONG AND DID NOT FIND ANYTHING WHILE ON THE SIDE OF THE INTERSTATE. RETURNED HOME AT A SLOWER SPEED.  *TR",
        "vin": "1J4FA59S44P"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/12/2014",
        "dateOfIncident": "05/28/2014",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10597855,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE HAD BEEN DRIVEN FOR ABOUT 35 MINUTES AT APPROXIMATELY 70MPH ON THE INTERSTATE. THE VEHICLE UNEXPECTEDLY BEGAN TO PRODUCE A THICK WHITE SMOKE. THE VEHICLE WAS IMMEDIATELY PULLED OVER AND PLACED INTO PARK; THE VEHICLE WAS ALREADY ON FIRE UPON EXITING. THE GRASS BENEATH HAD CAUGHT ON FIRE AS WELL. THE HOOD BEGAN TO BLACKEN INDICATING A FIRE IN THE ENGINE COMPARTMENT CLOSE TO THE FIREWALL. THE ENTIRE INCIDENT TOOK PLACE IN ABOUT THIRTY SECONDS; FROM THE TIME IT BEGAN TO SMOKE TO THE TIME IT WAS ON FIRE BEGIN THE ENTIRE INCIDENT. A TRUCK DRIVER WITH A DRY CHEMICAL FIRE EXTINGUISHER PUT THE ENGINE FIRE OUT; AFTER LIFTING THE HOOD TO A BALL OF FIRE. THE ONLY INJURY BEGIN LIGHT BURNS FROM LIFTING THE HOOD. ESSENTIALLY, MY JEEP WRANGLER, WITH NO AFTERMARKET PARTS INSTALLED, BURST INTO FLAMES FOR NO APPARENT REASON.  *TR",
        "vin": ""
    },
    {
        "components": "SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "05/09/2014",
        "dateOfIncident": "05/07/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 1,
        "numberOfInjuries": 0,
        "odiNumber": 10587478,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2004 JEEP WRANGLER. THE CONTACT STATED THAT WHILE TRAVELING AT AN UNKNOWN SPEED, THE DRIVER ATTEMPTED TO AVOID CRASHING INTO A DEER AND LOST CONTROL OF THE VEHICLE. THE VEHICLE ROLLED OVER AND THE DRIVER'S SIDE SEAT BELT BECAME SEPARATED FROM THE BELT CLIP. THE DRIVER WAS EJECTED FROM THE VEHICLE AND SUFFERED FROM FATAL INJURIES. A POLICE REPORT WAS FILED OF THE INCIDENT. THE VEHICLE WAS TOWED TO THE CONTACT'S HOME AND HAD NOT BEEN INSPECTED TO DETERMINE THE CAUSE OF THE SEAT BELT FAILURE. THE APPROXIMATE FAILURE AND CURRENT MILEAGE WAS 80,000.  KMJ",
        "vin": "1J4FA29194P"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/03/2014",
        "dateOfIncident": "11/19/2012",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10577018,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I DROVE MY JEEP FROM HOME TO WORK ABOUT TWENTY MILES WITHOUT ANY PROBLEMS NO WARNING LIGHTS OR ANY VISIBLE PROBLEMS.  I SHUT IT OFF WENT INTO WORK ONLY TO LEARN IT HAD CAUGHT ON FIRE ABOUT THIRTY MINUTES AFTER BEING SHUT OFF ! THE HEATER MOTOR AND GLOVE BOX AREA IS WHERE THE FIRE STARTED. FIRE DEPARTMENT CALLED IT ELECTRICAL? CONTRACTED JEEP (CHRYSLER) ABOUT ANY RECALL OR TSB BUT WAS TOLD THERE WASN'T ANY! THIS SEEMS TO BE A MAJOR PROBLEM COMMON IN A WIDE YEAR RANGE OF WRANGLERS.  *TR",
        "vin": "1J4FA69S94P"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/04/2014",
        "dateOfIncident": "06/01/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10567359,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE HAS EXHIBITED THE \"DEATH WOBBLE\" ALMOST AS LONG AS I'VE HAD IT.  I PURCHASED THE VEHICLE BRAND NEW.  AT 50-55 MPH, THE FRONT-END SHAKES UNCONTROLLABLY.  SOMETIMES THE SHAKING IS INSTIGATED BY A BUMP - MOST OFTEN IT STARTS SIMPLY BY REACHING THE AFOREMENTIONED SPEED.  THE ONLY WAY TO STOP IT IS TO SLOW DOWN (WHICH IS NOT ALWAYS AN EASY OPTION AT HIGHWAY SPEEDS) OR PUT IT INTO 4WD WHILE MOVING.  I'VE TAKE IT TO MULTIPLE DEALERS AND MECHANICS, AND NO ONE HAS BEEN ABLE TO RECTIFY THE CONDITION.  WHILE IT DOESN'T HAPPEN EVERY SINGLE TIME I CROSS THE 50-55 MPH THRESHOLD, SHAKES MORE OFTEN THAN NOT.  IT'S TERRIBLY ALARMING, CERTAINLY UNSAFE, AND COMPLETELY APPROPRIATE FOR A RECALL AND COST-FREE FIX.",
        "vin": "1J4FA39S54P"
    },
    {
        "components": "STEERING,SUSPENSION,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/28/2013",
        "dateOfIncident": "04/30/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10537611,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MY JEEP WRANGLER SHAKES SPORADICALLY AT 45 MPH AS DESCRIBED IN PREVIOUS POSTS BY OTHERS. WHEN MY JEEP SHAKES IT IS VERY AGGRESSIVE AND I OFTEN HAVE TO APPLY MY BRAKES SUDDENLY TO EASE THE JOLTING OF MY VEHICLE. I HAVE ALMOST WRECKED MY JEEP A COUPLE TIMES, I HAVE SPRAINED MY WRIST, AND HAVE HAD BRUISES MERELY FROM MAINTAINING MY VEHICLE. I JUST TRADED IN MY OTHER CAR FOR THIS IN APRIL 2013 AND CAN'T AFFORD TO TRADE AGAIN. I AM VERY DISAPPOINTED. I CAN'T EVEN TAKE MY CHILDREN IN MY JEEP OR TOW MY CAMPER. ALL BECAUSE I CAN'T EVEN REASONABLY BEGIN TO FIX THE PROBLEMS THAT I PURCHASED WITH MY JEEP. I WISH I HAD KNOWN I WAS PURCHASING A DEATH TRAP BEFORE HAND. THERE IS A VERY GOOD REASON THESE LOW MILAGE JEEP'S HAVE MADE WAY TO USED CAR DEALERSHIPS.  *TT",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/07/2013",
        "dateOfIncident": "08/07/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10534019,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "HELLO I BOUGHT THE JEEP FROM A PRIVATE PARTY, IT HAS 72,150 MILES ON IT, AND WHEN I HIT A BUMP  IN THE ROAD EITHER DRIVER OR PASSENGER SIDE IT WILL SHAKE PRETTY GOOD. IT HAS NOT BEEN MODIFIED.  STOCK FACTORY TIRES AND RIMS NO LIFT KIT, I HAVE HAD SEVERAL JEEP MECHANIC  LOOK AT IT BUT STILL  NO ANSWERS TO THE PROBLEM, I AM A DISABLED VET 100% AND CAN NOT AFFORD THE GUESSING GAME  OF THIS MAY BE THE PROBLEM.    PLEASE HELP!  *TR",
        "vin": "1J4FA39S84P"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/06/2013",
        "dateOfIncident": "01/01/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10515405,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING THE WRANGLER DOWN ANY ROAD SURFACE THE WHEELS WILL START TO WOBBLE AND SHAKE VERY HARD LIKE YOU ARE LOOSING CONTROL. THEN YOU HAVE TO STOP QUICKLY INORDER TO KEEP YOUR CAR FROM DRIVING OFF THE ROAD.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/25/2013",
        "dateOfIncident": "09/01/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10513525,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING OVER 45 MPH, IF YOU HIT A SMALL BUMP OR EVEN UNEVEN PAVEMENT, THE JEEP SHAKES UNCONTROLLABLY UNTIL YOU EITHER SLAM ON THE BRAKES AND SLOW DOWN TO 10 MPH OR YOU HAVE TO COMPLETELY STOP, IF YOU ARE IN TRAFFIC, IT IS EXTREMELY DANGEROUS.  THE VEHICLE SHAKES AND THE TIRES BOUNCE UP AND OFF THE PAVEMENT.  THE STIRRING WHEEL SHAKES SO MUCH YOU CAN BARELY HANG ON TO IT.  VERY DANGEROUS!!  *TR",
        "vin": "1J4FA49S54P"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/12/2013",
        "dateOfIncident": "03/12/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10502589,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ONTO HIGHWAY. SPEEDING UP TO 35-40 MPH. JUST SHIFTED TO 4TH GEAR. WHOLE VEHICLE BEGAN WOBBLING VIOLENTLY. HAD TO ALMOST STOP IN THE MIDDLE OF THE HIGHWAY TO GET IT STOP SHAKING VIOLENTLY. VEHICLE BEHIND ME HAD TO SWERVE TO MISS ME. STEEP SHOULDER COULDN'T PULL OVER. I THINK THIS IS REFERRED TO AS THE \"DEATH WOBBLE\". HAVE READ ABOUT NUMEROUS COMPLAINTS OF THIS WITH JEEP WRANGLERS ON THE INTERNET AFTER THIS HAPPENED TODAY. I WISH I WOULD OF KNOWN OF THIS DANGEROUS PROBLEM BEFORE I BOUGHT THIS VEHICLE.  *TR",
        "vin": "1J4FA39S04P"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/12/2013",
        "dateOfIncident": "02/01/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10497853,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 JEEP WRANGLER. THE CONTACT STATED THAT THE VEHICLE WOBBLED OUT CONTROL WHEN DRIVEN OVER 45 MPH OR GREATER. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THE TIRES WERE BALANCED BUT THE FAILURE RECURRED. THE CONTACT ALSO REPLACED THE FRONT UNIVERSAL JOINTS, BRAKE, ROTORS, TRACK BAR, WHEEL BEARINGS, AND THE STEERING STABILIZER BUT WAS UNABLE TO CORRECT THE FAILURE. THE VIN WAS NOT AVAILABLE. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE.  THE APPROXIMATE FAILURE MILEAGE WAS 85,000 AND THE CURRENT MILEAGE WAS 115,000.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/31/2012",
        "dateOfIncident": "02/27/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10490585,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRANSMISSION WENT ON A WELL TAKEN CARE OF 2004 JEEP WRANGLER RUBICON WITH ONLY 55,000 MILES  TOOK IT IN AND THE MECHANIC SAID THAT ALL THE GEARS WERE STRIPPED IN THE TRANSMISSION.  *TR",
        "vin": "1J4FA69S34P"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/24/2012",
        "dateOfIncident": "11/06/2012",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10485896,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FIRST TIME I HAD DEATH WOBBLE WAS WHILE TOWING MY KAYAKS AND KAYAK TRAILER AFTER HITTING A BUMP.SINCE THEN I HAVE STOPPED DRIVING IT TILL I GET SOME CASH TO START DIVING IN TO FIND THE FIX.  *TR",
        "vin": "1J4FA39S74P"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/17/2012",
        "dateOfIncident": "05/16/2012",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10475583,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "IT SEEMS THAT FUEL PUMP IN CAR IS NOT WORKING APPROPRIATELY, EVERYTIME I DRIVE VEHICLE IT WANTS TO SHUT DOWN AND THE RADIO SHUTS DOWN OR COMES ON WHEN IT WANTS TOO.    *TR",
        "vin": "1J4FA49S04P"
    },
    {
        "components": "STEERING,SUSPENSION,POWER TRAIN,EQUIPMENT,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/11/2012",
        "dateOfIncident": "08/19/2012",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10474863,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 JEEP WRANGLER. CONSUMER WRITES IN REGARDS TO SEVERAL ISSUES FOUND DURING INSPECTION AFTER PURCHASE OF VEHICLE *TGW  THE CONSUMER STATED THE DAY SHE TEST DROVE THE VEHICLE, SHE NOTICED SOME PLAY IN THE STEERING, THE ENGINE SEEMED TO MISS A LITTLE, AND THE CD PLAYER IN THE RADIO SEEMED TO WORK WHENEVER IT WANTED TO.  THE NEXT DAY, THE CONSUMER NOTICED THE FRONT DIFFERENTIAL LEAKED AN OIL SPOT ON THE CONCRETE DRIVEWAY. THE CONSUMER TOOK THE VEHICLE TO A PRE-SALES ESTABLISHMENT AND THE INSPECTION REVEALED, THE REAR AXLES WERE LEAKING ON BOTH SIDES, THE PINION SEAL IN THE FRONT DIFFERENTIAL NEEDED TO BE REPLACED, THE FRONT TRACK BAR HAD PLAY, THE TRANSMISSION NEEDED A NEW PILOT BEARING; AS THERE WAS A NOISE WHEN ACCELERATING AND THE REAR SWAY BAR LINKS WERE LOOSE. *JB",
        "vin": "1J4FA49S24P"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/08/2012",
        "dateOfIncident": "07/05/2012",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10470922,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "A WEEK AFTER I PURCHASED THE VEHICLE I HIT A SMALL, SHARP BUMP IN THE ROAD AND THE VEHICLE FRONT END BEGAN TO SHAKE AND WOBBLE UNCONTROLLABLY. ONLY BY SLOWING DOWN TO 45 MPH WAS I ABLE TO GAIN CONTROL OF THE VEHICLE AGAIN.  THIS HAS HAPPENED NUMEROUS TIMES AFTER THIS.  I HAD THE TIRES BALANCED, ROTATED AND AN ALIGNMENT DONE ON IT.  THE WOBBLE HAPPENED AGAIN, SOMETIMES AT EVEN HIGHER SPEEDS AND SOMETIMES, NOT AT ALL. I TOOK IT TO AN AUTHORIZED CHRYSLER JEEP DEALER AND ACCORDING TO THEIR RECOMMENDATION, HAD A NEW STEERING STABILIZER, NEW SWAY BAR LINKS AND TIE ROD INSTALLED AND AGAIN HAD THE TIRES BALANCED AND AN ALIGNMENT DONE ON IT.  THE VEHICLE STILL EXHIBITS THE SAME BEHAVIOR.  I HAVE HAD IT HAPPEN THREE TIMES ON INTERSTATE HIGHWAYS AND LUCKY ENOUGH EACH TIME I WAS IN THE RIGHT LANE AND ABLE TO PULL OVER ONTO THE SHOULDER TO REDUCE SPEED AND GAIN CONTROL AGAIN. EACH TIME ON THE INTERSTATE MY SPEED WAS BETWEEN 60 AND 65 MPH.  THE LAST TIME IT HAPPENED I DROVE 20 MILES BACK HOME ON CITY STREETS IN ORDER TO KEEP MY SPEED BELOW 50 MPH.  THE \"DEATH WOBBLE\" DOES NOT HAPPEN BELOW 50 MPH ALTHOUGH I CAN SOMETIMES FEEL IT STARTING TO SHAKE AS I APPROACH THAT SPEED.  AS I HAVE HAD THE VEHICLE INSPECTED BY AN AUTHORIZED CHRYSLER DEALER, REPLACED THE RECOMMENDED PARTS AND HAVE DONE THE REQUIRED MAINTENANCE, I FEEL THAT THERE IS A SAFETY ISSUE BUILT INTO SOME OF THE VEHICLES LIKE MINE.  I THINK THIS NEEDS TO BE INVESTIGATED AS MANY JEEP WRANGLER OWNERS THAT I HAVE TALKED TO AND AUTHORIZED DEALERS ALSO WERE VERY FAMILIAR WITH THE TERM \"DEATH WOBBLE\" IN CONJUNCTION WITH JEEP WRANGLERS.  IN FACT, AS I WAS DESCRIBING THE PROBLEM TO ONE OF THE AUTHORIZED CHRYSLER JEEP DEALERS, HE INTERRUPTED ME BY SAYING, \"AH, THE \"DEATH WOBBLE\".  ONCE IT HAPPENS TO YOU, YOU KNOW THAT IT IS A VERY APT DESCRIPTION OF THE BEHAVIOR.",
        "vin": "1J4FA69S04P"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/17/2012",
        "dateOfIncident": "06/01/2012",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10467283,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TURNED ONTO THE COUNTY HIGHWAY AND AS I APPROACHED APPROXIMATELY 50 MPH, I HIT A BUMP IN THE ROAD AND THE FRONT END OF THE VEHICLE STARTED TO SHAKE VIOLENTLY.  HAD TO PULL OVER AND STOP FOR IT TO STOP.  I THEN PROCEEDED TO DRIVE.  ASKED MY MECHANIC IF HE COULD SEE ANYTHING THAT WOULD CAUSE THIS AND HE DIDN'T MENTION ANYTHING.  IT HAS HAPPENED SINCE THEN AS WELL ONE TIME BEING ON THE INTERSTATE DURING RUSH HOUR.  I WILL NOT DRIVE THE VEHICLE AS IT IS COMPLETELY UNSAFE.   I HAVE RESEARCHED THIS ONLINE AND THERE ARE MANY REPORTS OF THIS \"DEATH WOBBLE\" HAPPENING ON JEEPS ALL OVER THE COUNTRY.  NO ONE SEEMS TO KNOW WHAT THE PROBLEM IS OR THE FIX IS.",
        "vin": "1J4FA49SX4P"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/11/2012",
        "dateOfIncident": "10/31/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10466081,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2004 JEEP WRANGLER WHICH I PURCHASED FROM A JEEP DEALERSHIP IN 2006.  JUST WEEKS AFTER I BOUGHT IT, THE JEEP SHOOK UNCONTROLLABLY AT SPEEDS OF 45 MPH OR FASTER.  BRAKING DID NOT HELP.  I LITERALLY HAVE TO LET THE JEEP SLOW DOWN ON ITS OWN , SO THAT IT CAN RE-ADJUST ITSELF.  DRIVING OVER ANY KIND OF BUMP IN THE ROAD ALSO CAUSES THIS UNCONTROLLABLE SHAKING AT THE SAME SPEEDS.  I HAVE NOW OWNED THIS JEEP NOW FOR 6 YEARS , AND THE PROBLEM STILL EXISTS.  IN THIS TIME PERIOD, I HAVE REPLACED THE TRACK BAR TWICE. CHANGED THE SHOCKS, HAVE HAD COUNTLESS WHEEL BALANCING AND ALIGNMENTS, AND HAVE REPLACED THE STEERING STABILIZER.   MORE TIMES THAN NOT, THE SHAKING IS SO BAD, I HAVE TO PULL OFF THE HIGHWAY.  I LIVE IN THE LAKE TAHOE AREA AND EXPERIENCE THIS SHAKING EFFECT OFTEN TIMES WHILE DRIVING ON WINDING ROADS IN THIS AREA.  WHILE IM SURE THE DANGER FACTOR EXISTS FOR ANYONE OWNING A VEHICLE THAT DOES THIS, I AM VERY CONCERNED ABOUT HAVING MY JEEP SHAKE RELENTLESSLY ON THESE MOUNTAIN ROADS.",
        "vin": "1J4FA39S64P"
    },
    {
        "components": "STEERING,WHEELS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/21/2012",
        "dateOfIncident": "09/22/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10462538,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN A PROUD OWNER OF MY JEEP SINCE 2004 UNTIL TOWARDS THE END OF LAST YEAR WHEN I BEGAN TO EXPERIENCE PROBLEMS WITH A VIOLENT SHAKING WHEN I WAS DRIVING AT 55MPH AND WOULD HIT A BUMP.  I TOOK IT TO MY MECHANIC A FEW TIMES BUT THEY COULDN'T FIND ANYTHING WRONG WITH IT.  THEY CHECKED MY TIRES, THE BRAKES, ETC.  IT HAPPENED AGAIN AND AGAIN SO MY MECHANIC THOUGHT IT POSSIBLE NEEDED TO BE ALIGNED SO I TRIED THAT. THAT DIDN'T HELP EITHER.  THEN THE TIRES BECAME A TOPIC OF DISCUSSION SO I BOUGHT NEW TIRES AND STILL THE PROBLEM OCCURRED.  I RECENTLY TOOK IT IN AND HAD THE GEAR BOX TIGHTENED AND THE TIRES ROTATED AND AGAIN, NO FIXING THE PROBLEM.  MY JEEPS SHAKES SO VIOLENTLY AND GETS ME SO SCARED BECAUSE IT FEELS LIKE THE JEEPS TIRES ARE GOING TO FALL OFF THE JEEP AND CAUSE A MAJOR ACCIDENT AND INJURIES.  I SEARCHED THE INTERNET LOOKING TO SEE IF ANYONE ELSE HAS EVER HAD THIS PROBLEM AND SURE ENOUGH, I'M NOT ALONE.  I HAVE A YOUNG SON AND I USE MY JEEP AS OUR TRANSPORTATION AND MY SON IS GETTING READY TO GET HIS LICENSE AND IT'S SAD, BUT I WON'T LET HIM DRIVE OUR JEEP BECAUSE OF THIS PROBLEM.  CHRSLER NEEDS TO BECOME AWARE OF THIS PROBLEM AND SOMETHING SHOULD BE DONE FOR US JEEP OWNERS WHO ARE BEING AFFECTED BY THIS PROBLEM. IF I WOULD HAVE KNOWN OF THIS PROBLEM, I WOULD HAVE NEVER BOUGHT A JEEP.  I CAN'T AFFORD TO KEEP SPENDING ALL THIS MONEY TO TRY AND FIGURE OUT WHAT TO GET REPAIRED NOR CAN I AFFORD A NEW CAR.  CHRSLER NEEDS TO STEP UP TO THE PLATE AND FIX THESE JEEPS!  *TT",
        "vin": "1J4FA49S34P"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/16/2012",
        "dateOfIncident": "02/25/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10461972,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "VIOLENT SHAKING OF THE SUSPENSION WHEN I REACH ABOUT 55 MPH, USUALLY ON THE NYS THRUWAY. IN ORDER TO STOP THE SHAKE I NEED TO SLOW DOWN TO ABOUT 40 MPH.  VERY DANGEROUS AND UNNERVING, ESPECIALLY IN TRAFFIC. BROUGHT TO MY MECHANIC WHO STATED HE SAW NOTHING WRONG WITH MY VEHICLE. REPLACED AND BALANCED TIRES.  WAS FINE BUT THEN ,AS NOW , UNEXPECTEDLY GOES INTO CONVULSIONS.  I FEEL VERY UNCOMFORTABLE WHEN DRIVING MY VEHICLE, WHICH IS MY SOLE MODE OF TRANSPORTATION.  IS THERE A RECALL?  I AM NOT AWARE OF ANY.  WOULD REALLY LIKE TO RESOLVE THIS SITUATION.  THIS HAS BEEN GOING ON FOR SEVERAL YEARS. *JB",
        "vin": "1J4FA39S24P"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/14/2012",
        "dateOfIncident": "06/14/2012",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10461731,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT END SHAKES VIOLENTLY. THIS HAS HAPPENED BEFORE, USUALLY WHEN THE JEEP IS APPROACHING 50 MPH ON THE HIGHWAY. FEELS LIKE THE JEEP IS GOING TO EXPLODE. PUTTING ON THE BRAKES, AND PRAYING, AND DOWN SHIFTING FROM 5TH TO 4TH, AND PRAYING, AND EVENTUALLY SLOWING DOWN TO BELOW 40 IS THE ONLY THING THAT ALLOWS THE VEHICLE TO STOP SHAKING.  THIS APPARENTLY HAS BEEN REPORTED MANY, MANY TIMES, AND IS KNOWN AS THE \"DEATH WOBBLE\". IS THERE A GOVERNMENTAL COVER-UP ABOUT THIS? HOW IS THIS KNOWN ISSUE ALLOWED TO GO UN-ADDRESSED?",
        "vin": "1J4FA39S34P"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/02/2012",
        "dateOfIncident": "03/09/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10460367,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING WHEEL SHAKES, MOST RECENTLY MADE WHOLE VEHICLE SHAKE UNCONTROLLABLY. HAS NOT BEEN OFF ROAD OR ALTERED IN ANY WAY. LADY DRIVEN ONLY.  *TR",
        "vin": "RUSSELLVILL"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/01/2012",
        "dateOfIncident": "06/01/2012",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10460249,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THE ABOVE VEHICLE BACK IN10/2007 USED.  I NEVER HAD A PROBLEM WITH THE VEHICLE UNTIL RECENTLY THAT AS I WAS DRIVING, THE CAR WOULD TRY TO SHUT OFF AND THE SMELL OF GASOLINE WAS COMNG INTHRU THE VENTS.  IN THE LAST THREE WEEKS I HAVE SPENT CLOSE TO 600.00 DOLLARS IN TUNE UP, REPLACED COIL PACK AND THE FUEL INJECTOR AND STILL THE PROBLEM WAS NOT FIXED.  I TOOK MY CAR TO ANOTHER MECHANIC WHO DETERMINED THAT THE PROBLEM IS THE FUEL PUMP.  THE MECHANIC ASKED ME IF THERE WAS EVER A RECALL AND I DID A SEARCH AND LONG AND BEHOLD THERE WAS A RECALL, BUT THEY ARE TELLING ME THAT I DON'T QUALIFY.  PLEASE CAN SOMEONE HELP ME.    [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "1J4FA49S04P"
    },
    {
        "components": "STEERING,WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/23/2012",
        "dateOfIncident": "10/13/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10456201,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "SUDDEN ONSET OF VIOLENT FRONT END AND STEERING WHEEL VIBRATION, REQUIRING 2 HANDS TIGHTLY GRIPPING THE STEERING WHEEL TO COAX IT ONTO THE SHOULDER. 5 INCIDENTS IN 8 MONTHS AT 60MPH ON BOTH SMOOTH AND ROUGH PAVEMENT. NARROWLY MISSED SMASHING INTO A CEMENT BARRIER, TRACTOR TRAILER AND CAR DURING 3 OF THE 5 INCIDENTS.   *TR",
        "vin": "1J4FA39SX4P"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/13/2012",
        "dateOfIncident": "04/08/2012",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10455094,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A JEEP WRANGLER X 2004. I HAVE EXPERIENCED THE JEEP \"DEATH WOBBLE\" ON NUMEROUS OCCASSIONS IN THE PAST YEAR. THIS PAST SUNDAY BEING THE WORST. I HAVE HAD MY ENTIRE FRONT END REPLACED WITH NO RESULTS. I HAVE BEEN SEARCHING THE INTERNET FOR ANSWERS AND EVERY SUGGESTION THAT I HAVE FOUND HAS ALREADY BEEN DONE ON MY JEEP. WE HAVE SPOKEN WITH A JEEP MECHANIC THAT WE KNOW AND HE STATED THAT IT IS A \"KNOWN PROBLEM\" AND THEY DO NOT KNOW HOW TO FIX IT. AT THIS POINT I AM EXTREMELY FRUSTRATED AND I AM LOOKING FOR ANSWERS. I HAVE FOUND A WEBSITE FOR CONGRESSWOMAN ESHOO AND I AM AWARE OF THE REQUEST FOR AN INVESTIGATION INTO THIS MATTER. PLEASE, I HOPE THAT YOU ARE TAKING THIS MATTER VERY SERIOUSLY. THIS IS A VERY SCARY AND DANGEROUS PROBLEM THAT IS OCCURING IN JEEPS.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/12/2012",
        "dateOfIncident": "03/05/2012",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10451121,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "LIKE SO MANY, I'VE NOW EXPERIENCED THE INFAMOUS 'DEATH WOBBLE.'  THE VEHICLE STARTS TO VIOLENTLY SHAKE AFTER HITTING A BUMP AND BECOMES ESSENTIALLY UNABLE TO BE CONTROLLED. ALL YOU CAN DO IS BRAKE HARD AND HOPE TO STAY IN YOUR LANE/ON THE ROAD AS YOU DECELERATE.   AFTER SPENDING MANY HOURS ON THE INTERNET AND AT THE PLACE WHERE I PURCHASED IT, THINGS ARE NO BETTER.  THIS SEEMS LIKE AN OBVIOUS DESIGN FLAW AND RENDERS THE VEHICLE UNSAFE.  JEEP SEEMS TO HAVE NO INTEREST IN FIXING THE PROBLEM AND IT'S HARD TO BELIEVE THAT NOBODY HAS BEEN KILLED BECAUSE OF IT.  I WISH I HAD KNOWN ABOUT THIS AS I NOW HAVE AN UNSAFE AND UNUSABLE VEHICLE THAT NOBODY SEEMS TO KNOW HOW TO FIX.  THERE IS A TSB OUT REGARDING THIS ISSUE, BUT JEEP KEEPS THAT INFORMATION 'SECRET'.  I CANNOT IMAGINE WHY THERE HASN'T BEEN A RECALL, IF I KEEP DRIVING THIS VEHICLE, IT'S NOT A QUESTION OF 'IF' I'M GOING TO WRECK IT, IT'S A MATTER OF 'WHEN' IT'S GOING TO OCCUR.   *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/09/2012",
        "dateOfIncident": "01/05/2007",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10442882,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 JEEP WRANGLER. THE CONTACT WAS DRIVING APPROXIMATELY 55 MPH WHEN THE FRONT END OF THE VEHICLE BEGAN TO VIBRATE VIOLENTLY. THE FAILURE RECURRED WHENEVER DRIVING OVER A SLIGHT ROAD BUMP AT 55 MPH OR MORE. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER FOR DIAGNOSIS WHERE THE SWAY BAR LINK AND DAMPER WERE REPLACED HOWEVER, THE FAILURE PERSISTED. THE VEHICLE WAS TAKEN TO THE DEALER A SECOND TIME BUT THEY WERE UNABLE TO LOCATE THE MALFUNCTION. THE MANUFACTURER WAS NOT NOTIFIED OF THE PROBLEM. THE APPROXIMATE FAILURE MILEAGE WAS 30.",
        "vin": "1J4FA39S34P"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/28/2011",
        "dateOfIncident": "12/15/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10441551,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING PRESSURE HOSE DEVELOPS LEAKS AT THE CRIMPED CONNECTION. POWER STEERING FLUID CAN COME IN CONTACT WITH HOT ENGINE COMPONENTS.  *TR",
        "vin": "1J4FA49S94P"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/18/2011",
        "dateOfIncident": "07/15/2009",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10440323,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MULTIPLE INCIDENTS OF VIOLENT VIBRATION IN THE VEHICLE FRONT END, INCLUDING THE STEERING WHEEL AND FRONT WHEELS, ARE OCCURRING AFTER HITTING A MINOR POT HOLE IN THE ROAD.  INCIDENTS OCCUR AT HIGHWAYS SPEEDS, NORMALLY 45 - 55 MPH.  THE DRIVER MUST REDUCE SPEED TO NEAR ZERO IN ORDER TO RECOVER SAFE AND EFFECTIVE CONTROL OF THE VEHICLE.  THIS VEHICLE DEFECT APPEARS TO BE THE WELL-KNOWN AND MAJOR SAFETY ISSUE IN JEEP WRANGLER VEHICLES KNOWN AS \"THE DEATH WOBBLE\".  I PURCHASED THIS VEHICLE NEW FROM A JEEP DEALERSHIP AND HAVE HAD IT PROFESSIONALLY MAINTAINED PER THE MANUFACTURER'S INSTRUCTIONS SINCE THE DAY I BOUGHT IT.  MY SPOUSE AND I HAVE BOTH EXPERIENCED THIS DEFECT SEVERAL TIMES IN THE PAST FEW YEARS, MOST RECENTLY ON DECEMBER 15, 2011.  AT THIS POINT, WE'VE HAD THE VEHICLE INSPECTED SEVERAL TIMES AND REPLACED A NUMBER OF COMPONENTS ON THE VEHICLE, INCLUDING THE STEERING DAMPER, FOUR SHOCK ABSORBERS, AND ALL 4 TIRES.,  IN ADDITION, THE SUSPENSION HAS BEEN INSPECTED NUMEROUS TIMES IN THE PAST 3 YEARS.  GIVEN THE SHEAR NUMBER OF SIMILAR COMPLAINTS BY OTHER OWNERS, I FEEL THAT THIS IS AN OBVIOUS MANUFACTURER DEFECT THAT SHOULD BE ACKNOWLEDGED AND CORRECTED BY THE MANUFACTURER.  *TR",
        "vin": "1J4FA39S14P"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/07/2011",
        "dateOfIncident": "10/18/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10449868,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PROBLEM HAS OCCURRED SEVERAL TIMES SINCE OCT 18, 2011. THE JEEP EXPERIENCED THE \"DEATH WOBBLE\" WHEREBY THE JEEPS' WHEELS SUDDENLY BEGAN TO WOBBLE TO THE POINT THAT ONE ALMOST MUST SLOW DOWN IMMEDIATELY. THE CONDITION APPEARS TO BE QUITE COMMON WITH THE JEEP WRANGLER.   PORTABLE RECEIVED VIA U.S. MAIL. A PORTION OF THE COMPLAINT WAS ILLEGIBLE. 02/28/12  UPDATED 02/28/12 *BF",
        "vin": "1J4FA29194P"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/05/2011",
        "dateOfIncident": "01/21/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10428846,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING WOBBLES AT SPEEDS 40 TO 55MPH AND IS ESPECIALLY WORSE AFTER HITTING A BUMP. THIS HAPPENS EVERY DAY AND NOT ONCE IN A WHILE.   VERY SCARY WHEN YOU HAVE NO CONTROL BECAUSE IT SHAKES SO BAD. IT ACTUALLY GIVES YOU LITTLE OR NO CONTROL OVER THE VEHICLE. HAVE HAD TIRES BALANCED AND ROTATED THE STEERING DAMPER REPLACED. HAVE HAD IT LOOKED AT SEVERAL TIMES AND NO ONE REALLY KNOWS WHAT TO DO ABOUT IT. IT IS A LIFE AND DEATH SITUATION AND FEEL THAT NOTHING WILL BE DONE  ABOUT IT UNTIL SOMEONE IS ACTUALLY KILLED. LOOKING AT BLOGS THERE ARE MANY PEOPLE WHO EXPERIENCED THE SAME THING KNOWN AS THE DEATH WOBBLE. *TR",
        "vin": "1J4FA49S04P"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/25/2011",
        "dateOfIncident": "09/18/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10427084,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2004 WRANGLER RUBICON HAS A VIOLENT WOBBLE/SHAKE AT 55-60 MPH.  THE WOBBLE IS SO VIOLENT I HAVE TO IMMEDIATELY BRAKE AND IT STOPS AROUND 40.  I HAVE HAD IT ALIGNED AND BALANCED.  I WAS CONSIDERING POURING MORE INTO THE REPAIR BUT AFTER READING ALL OF THE COMPLAINTS I FELL IT IS NOT WORTH THE EFFORT.  THE JEEP IS STOCK AND I AM THE ORIGINAL OWNER.  I AM GOING TO APPROACH THE DEALER BUT SINCE IT IS OUT OF WARRANTY I HAVE THE FEELING IT IS GOING TO BE IN VAIN.  *TR",
        "vin": ""
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "09/11/2011",
        "dateOfIncident": "09/19/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10424673,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "SEATS BELTS ARE NOT RETRACTING AND THE BELTS ARE BEING SHUT INTO THE DOOR ON BOTH THE DRIVER AND PASSENGER SIDE OF THE JEEP. THE SAFETY BELTS ARE NO LONGER GOING TO PROVIDE THE SAFETY FOR THE RIDERS DUE TO THE BELT BEING SEVERED BY THE DOOR AND HINGE.  RETRACTORS NEED REPLACED IN THE JEEPS.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/11/2011",
        "dateOfIncident": "06/03/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10424675,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE MULTIFUNCTION SWITCH WITH THE FOG LIGHTS CUTS THE LIGHTS ON WHEN THE DRIVER DOES NOT PUT THE ON. WHEN THE VEHICLE IS SITTING STILL, THE FOG LIGHTS WILL FLIP ON, WHEN I APPLY THE SIGNAL LIGHT ON THE FOG LIGHT SWITCH POPS ON. I HAD TO REMOVE THE FUSE TO GET THE FOG LIGHTS OFF.  *TR",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "08/31/2011",
        "dateOfIncident": "04/07/2011",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10422740,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 JEEP WRANGLER. THE CONTACT STATED THE AIR CONDITIONING AND HEATING UNITS FAILED TO WORK INTERMITTENTLY. IN ADDITION, THE CONTACT WAS UNABLE TO DEFROST THE WINDOWS DURING THE WINTER MONTHS DUE TO THE FAILURE. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSTIC TESTING. THE DEALER FOUND THAT THERE WERE MELTED WIRES THAT CAUSED THE BLOWER MOTOR TO FAIL.  THE MANUFACTURER WAS CONTACTED, BUT THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 26,000 AND THE CURRENT MILEAGE WAS 144,000.",
        "vin": "1SABS0AG9B2"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/15/2011",
        "dateOfIncident": "08/10/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10419447,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT END OF MY 2007 JEEP WRANGLER UNLIMITED HAS DANGEROUS WOBBLE BETWEEN 50 AND 60 MILES PER HOUR. TIRES ARE GOOD, TIRES HAVE BEEN BALANCED BUT THE PROBLEM REMAINS. USUALLY TRIGGERED BY A BUMP IN THE ROAD. *TR",
        "vin": "1J4FA49S44P"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/12/2011",
        "dateOfIncident": "06/30/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10418644,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "FAILURE TO SHIFT AUTOMATIC TRANSMISSION INTO 1ST, 3RD, AND 4TH GEARS.  ONLY STAYS IN 2ND GEAR OR REVERSE.  WAS TOLD BY A DEALER THAT THE PCM WAS CAUSING THE MALFUNCTION.  REPLACED THE PCM AND THE TCM ALSO BLEW OUT.  THERE ARE ONLY 48000 MILES ON THIS VEHICLE AND IS TAKEN CARE OF WELL.  THERE SHOULDN'T BE ALL THE COMPUTERS GOING OUT ALL AT ONCE.  NO ONE SEEMS TO BE ABLE TO ASSIST FROM CHRYSLER.  UNFORTUNATE, SINCE THIS IS MY THIRD WRANGLER AND I HAVEN'T EVER HAD THIS MANY ISSUES WITH ANY VEHICLE EVER.  WAS A DIE-HARD FAN AND STOOD BY JEEP PRODUCTS.  NOW I WILL MAKE SURE EVERYONE KNOWS NOT TO PURCHASE THESE FAULTY VEHICLES.  HOPEFULLY AFTER $1050 IN REPAIRS THIS RESOLVES THE ELECTRICAL ISSUES....BUT SOMEHOW WON'T COUNT ON IT!!! BOOOOO TO JEEP!  YOU SHOULD BE ASHAMED OF YOURSELVES.  *TR",
        "vin": "1J4FA49SX4P"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/07/2011",
        "dateOfIncident": "07/10/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10417848,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "JEEP WRANGLER (2004) HAS THE STEERING SHAKE VIOLENTLY WHEN DRIVEN OVER 45MPH. NO DEALERSHIP OR GARAGE COULD RESOLVE THE PROBLEM. I SPENT OVER $2000 IN NEW TIRES ALL NEW STEERING COMPONENTS AND SUSPENSION AS WELL AS WHEELS TO FIX A PROBLEM THE COMPANY REFUSES TO ACKNOWLEDGE EXISTS SO THEY CAN CONTINUE TO SUPPORT THEIR UNIONS REDICULIOS COMMANDS WHILE PUTTING ME AND OTHER DRIVERS AT RISK.  *TT",
        "vin": ""
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES, HYDRAULIC,STRUCTURE,TIRES",
        "crash": false,
        "dateComplaintFiled": "07/29/2011",
        "dateOfIncident": "06/30/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10416303,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE A JEEP  2004 WRANGLER. AT 60 MPH. IT BEGINS TO WOBBLE VERY BADLY! HAVE PURCHASED NEW TIRES,BALANCING,FRONT STABILIZING BAR,NEW BRAKES & ROTORS,ALIGNMENT. STILL WOBBLES! MANY OTHER JEEP OWNERS ARE HAVING SAME PROBLEM & JEEP DEALERS CANNOT COME UP WITH A SOLUTION TO STOP THIS! IT HAPPENS EVERYTIME I HIT 60MPH! VERY SCARY!!!!! ALMOST FLIPPED ME OFF THE ROAD COMING DOWN THE MOUNTAINS!  *TR",
        "vin": "1J4FA49S74P"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/20/2011",
        "dateOfIncident": "07/01/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10413709,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 JEEP WRANGLER.  WHILE DRIVING OVER 55 MPH, THE CONTACT STATED THAT THE VEHICLE WOULD BEGIN TO SHAKE VIOLENTLY.  THE DEALER AND MANUFACTURER WERE NOTIFIED, BUT DENIED ASSISTANCE WITH REPAIRS TO THE FAILURE. THE VEHICLE WAS REPAIRED, BUT THE FAILURE RECURRED.  THE FAILURE MILEAGE WAS 25,000 AND THE CURRENT MILEAGE WAS 58,500.",
        "vin": "1J4FA49S64P"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/18/2011",
        "dateOfIncident": "07/18/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10413367,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 JEEP WRANGLER \"DEATH WOBBLE\" . OCCURS AT 45-55MPH. WHEEL BALANCE, TIRE ROTATION, STEERING STABILIZER/DAMPER-ALL REPAIRED, ADJUSTED OR REPLACED. THIS VEHICLE HAS 75,000 MILES AND BEGAN AROUND 45,000 MILES AND IS GETTING PROGRESSIVELY WORSE. THIS NEEDS TO BE ADDRESSED BY JEEP!  THE VEHICLE BEGINS TO WOBBLE AT AROUND 45PMH WHEN IT STRIKES A SLIGHT BUMP IN THE ROAD OR SOMETIMES WHEN NO PERCEIVED BUMP IN THE ROAD. THIS IS VERY DANGEROUS!   *KB",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/05/2011",
        "dateOfIncident": "07/05/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10410606,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 JEEP DOES A DEATH WOBBLE AT 40-60 MPH WHEN EVER IT HITS A BUMP. SUSPENSION IS DEFECTIVE. JEEP HAS HAD TONS OF COMPALINTS ON THIS.  *KB",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/29/2011",
        "dateOfIncident": "06/26/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10409402,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STOPPED RUNNING WHILE DRIVING LOCALLY. STEERING AND BRAKING BECAME DIFFICULT. COULD HAVE BEEN DANGEROUS AT HIGHER SPEED. DIAGNOSIS BY A LOCAL MECHANIC (SUPERIOR COLLISION & AUTO SERVICE, GARDNERVILLE, NV 775-782-2966) WAS AN INTERNAL SHORT IN THE FUEL PUMP MODULE WHICH CAUSED THE FUEL PUMP TO STOP OPERATING AND THE ENGINE TO QUIT. THE FUEL PUMP MODULE IS LOCATED INSIDE THE FUEL TANK, IN THE DIRECT PRESENCE OF GASOLINE AND GASOLINE VAPOR. UPON EXAMINING THE FUEL PUMP MODULE THE MECHANIC DETERMINED THAT THE WIRING LEADS TO THE PUMP UNIT HAD SHORTED AGAINST THE MODULE'S ALUMINUM HOUSING DUE TO CHAFING OF THE WIRING INSULATION ON THE EDGE OF THE HOUSING. THEY AND I BELIEVE THAT IF THIS SHORT HAD CAUSED A SPARK IT COULD HAVE IGNITED THE FUEL IN THE TANK, CAUSING AN EXPLOSION OR FIRE. I HAVE OWNED THIS VEHICLE SINCE NEW AND THIS PART HAD NEVER BEEN SERVICED OR REPLACED. IT WAS AS INSTALLED AT THE FACTORY. TO CORRECT THIS THE MECHANIC INSTALLED A NEW FUEL PUMP MODULE. HE SAID THE WIRING ON THE REPLACEMENT MODULE APPEARS TO HAVE BEEN ROUTED MORE CAREFULLY TO AVOID THIS PROBLEM. I HAVE THE FAULTY MODULE IN MY POSSESSION.  *TR",
        "vin": "1J4FA49S14P"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/07/2011",
        "dateOfIncident": "05/25/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10406390,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "SEVERE SHAKING (COINED DEATH WOBBLE) AT 55 MPH. THIS HAS HAPPENED (3) TIMES. I HAVE REPLACED STEERING DAMPENER, FRONT END ALIGNMENT, (4) NEW TIRES ALL WITHIN LAST WEEK. THERE ARE COUNTLESS COMPLAINTS FOR THIS SAME PROBLEM, YET NO RESOLUTION TO BE FOUND. THERE SEEMS TO BE WITH ALL OF THE COMPLAINTS A \"HEAD IN SAND\" MENTALITY HOPING THAT THIS WILL GO AWAY. I'M SHOCKED, AFTER THE EXPERIENCE OF TRYING TO GET VEH OFF OF HIGHWAY DURING THIS EVENT, THAT THERE HAVE NOT BEEN ANY FATALITIES.",
        "vin": "1J4FA49S64P"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/31/2011",
        "dateOfIncident": "01/01/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10403850,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 JEEP WRANGLER. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 40 TO 65 MPH, HE NOTICED THAT THE FRONT WHEELS WOULD WOBBLE VIOLENTLY. THE VEHICLE WAS INSPECTED BY THE DEALER AND THEY ADVISED HIM THAT THEY WERE UNABLE TO DIAGNOSE THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 31,500. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/09/2011",
        "dateOfIncident": "01/10/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10399538,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A USED 2004 JEEP WRANGLER 5 MONTHS AGO.  IT HAD ONLY 15K MILES ON IT.  SHORTLY AFTER PURCHASE IT BEGAN SHAKING VIOLENTLY BETWEEN THE SPEEDS OF 55-60, AND WHEN THERE ARE ROAD IMPERFECTIONS.  I HAD THE TIRES BALANCED.  NO FIX.  THE SHOP KEPT THE JEEP FOR THREE DAYS LAST WEEK AND CANNOT LOCATE THE SOURCE OF THE PROBLEM.  APPEARS THIS IS A \"DEATH WOBBLE\" ISSUE FROM THE STRONGLY-DOCUMENTED CASES IN JEEP WRANGLERS.  THERE APPEARS TO BE NO PERMANENT FIX.  THERE HAVE BEEN NO RECALLS THAT I CAN FIND.  I OWE FOR THIS VEHICLE THAT I CANNOT EVEN DRIVE!  *TR",
        "vin": "1J4FA59S94P"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/05/2011",
        "dateOfIncident": "04/18/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10399217,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2004 JEEP WRANGLER.  IT HAS WHAT I FOUND, LISTED ON THE INTERNET FORUMS, DESCRIBED AS A \"DEATH WOBBLE\".  THIS IS AN EXTREME SHAKING OF THE STEERING AT SPEEDS BETWEEN 55 AND 65. IT IS SO SEVERE THAT I HAD TO PULL OFF OF THE FREEWAY AND STOP BEFORE THE SHAKING WOULD STOP.   NO ONE SEEMS TO KNOW HOW TO PERMANENTLY SOLVE THE PROBLEM.  IT IS VERY DANGEROUS.  *TR",
        "vin": "1J4FA59S14P"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/24/2011",
        "dateOfIncident": "12/09/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10397790,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN TRAVELING WEST BOUND ON I-10 THROUGH PHOENIX, AFTER HITTING SLIGHT BUMP IN THE HIGHWAY, MY STEERING WHEEL BEGAN TO SHAKE VIOLENTLY FOR APPROXIMATELY 5 TO 10 SECONDS.  I IMMEDIATELY BEGAN TO SLOW DOWN AND THE POWERFUL WOBBLE SUBSIDED.  I HAD AN ADDITIONAL INCIDENT WITH POWERFUL SHAKING IN MY STEERING WHEEL ABOUT A MONTH LATER, AGAIN TRAVELING AT APPROXIMATELY 50 MPH ON AN INTERSTATE HIGHWAY.  THIS SUDDEN AND UNEXPECTED SHAKING OF THE JEEP'S FRONT END IS SCARY.",
        "vin": "1J4FA49S44P"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/10/2011",
        "dateOfIncident": "04/10/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10395410,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2004 WRANGLER RUBICON - ALL STOCK, AND HAVE BEEN EXPERIENCING WHAT I'VE JUST COME TO REALIZE IS THE DEATH WOBBLE FOR THE PAST 8+ MONTHS. I'VE REPLACED ALL 4 TIRES, HAD ALIGNMENT AND BALANCING, JUST TODAY HAD STEERING STABILIZER REPLACED TO NO AVAIL. THE WOBBLING CONTINUED ON THE WAY HOME FROM THE SHOP. ANYTIME I HIT A BUMP, THE FRONT END STARTS TO SHAKE VIOLENTLY AND I HAVE TO SLOW DOWN TO A NEAR STOP BEFORE I CAN PROCEED. THIS IS VERY UNSAFE AND SHOULD BE ADDRESSED BY JEEP. THIS IS MY DAILY RIDE TO WORK AND IT IS NOT SAFE!  *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/17/2011",
        "dateOfIncident": "02/17/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10383180,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT A 2004 JEEP WRANGLER OF AUGUST OF 2010.  THE JEEP HAD ABOUT 50,000 MILES.  ON FEBRUARY 17 I WAS COMING HOME AT ABOUT 52 MPH.  WHEN I GOT TO 55 HAD A TERRIBLE WOBBLE IN THE FRONT END.  TALKED TO SEVERAL PEOPLE WHO OWN JEEPS AND THEY REFERRED TO IT AS THE DEATH WOBBLE.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING,SUSPENSION,TIRES",
        "crash": false,
        "dateComplaintFiled": "12/30/2010",
        "dateOfIncident": "12/20/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10373505,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT TIRE SHIMMY SO BAD THAT IT CAN CAUSE THE CAR TO GO OUT OF CONTROL. WHEN A BUMP, POTHOLE OR RAILROAD TRACK IS DRIVEN OVER THAT FRONT TIRES WOBBLE AND SHIMMY SO BAD THAT IT IS DIFFICULT TO MAINTAIN CONTROL OF THE CAR. THERE HAVE BEEN NEW TIRES, WHEELS, ALIGNMENTS AND STEERING STABILIZERS INSTALLED BUT THAT HAS NOT STOPPED THE SHIMMY. THE CAR HAS 30,000 MILES ON IT.  *TR",
        "vin": "1J4FA49S84P"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/09/2010",
        "dateOfIncident": "10/20/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10369820,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 JEEP WRANGLER SPORT HAS AN EXTREME VIOLENT SHAKE CAUSING ENTIRE FRONT OF VEHICLE TO BOUNCE OFF THE GROUND AT SPEEDS BETWEEN 45 - 60 MPH.  *TR",
        "vin": "1J4FA49S04P"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/07/2010",
        "dateOfIncident": "07/04/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10359564,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 JEEP WRANGLER. THE CONTACT STATED THAT WHILE DRIVING 60 MPH, THE FRONT END OF THE VEHICLE BEGAN TO SHAKE VIOLENTLY. THE CONTACT PULLED OVER AND THE SHAKING STOPPED, BUT WHEN SHE CONTINUED ON, THE SHAKING BEGAN AGAIN. THE VEHICLE WAS TAKEN TO A LOCAL MECHANIC WHO STATED THAT THE FRONT STEERING BOX, BUSHINGS, AND CONTROL ARMS NEEDED TO BE REPLACED. THE VEHICLE HAD NOT BEEN REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 20,000 AND THE CURRENT MILEAGE WAS APPROXIMATELY 22,000.",
        "vin": "1J4FA39S34P"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/28/2010",
        "dateOfIncident": "09/28/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10358025,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2004 JEEP WRANGLER COLUMBIA EDITION.  I EXPERIENCE THE \"DEATH WOBBLE\" PHENOMENA THAT OTHERS IN THE COMPLAINT SECTION HAVE POSTED ABOUT.  I CAN NOT DRIVE MY VEHICLE BETWEEN 51-60 MPH WITHOUT IT OCCURRING.  WHEN IT OCCURS I MUST EITHER QUICKLY ACCELERATE ABOVE THIS RANGE OR SLOW DOWN BELOW IT (DEPENDING ON SPEED LIMIT IN AREA OF COURSE). JEEP DID REPLACE THE STEERING STABILIZER, WHICH FIXED THE PROBLEM, BUT ONLY FOR ABOUT 2-3 WEEKS. JEEP REALLY NEEDS TO RECALL THIS AND APPLY A PERMANENT FIX. THIS IS EXTREMELY DANGEROUS, WHEN IT HAPPENS THE VEHICLE FEELS LIKE THE FRONT TIRES WILL FLY OFF AT ANY MOMENT. I AM ENTERING TODAY'S DATE AS THE INCIDENT DATE AS THIS IS ONGOING, BUT HAS BEEN GOING ON FOR A LONG TIME NOW. *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/27/2010",
        "dateOfIncident": "09/27/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10357964,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2004 JEEP WRANGLER UNLIMITED HAS 94,000 MILES AND RECENTLY STARTED TO SPILL FUEL DURING REFUELING. WILE PUMPING GAS THE PUMP AUTO SHUT OFF WONT KICK IN .  *TR",
        "vin": "1J4FA49S54P"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/04/2010",
        "dateOfIncident": "09/04/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10353879,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE WHAT IS CALLED DEATH WOBBLE IN MY 2004 JEEP WRANGLER. AFTER READING ABOUT THIS PROBLEM IN VARIOUS FORUMS, I BELIEVE IT NEEDS TO BE ADRESSED. I HAVE DONE EVERYTHING THAT HAS BEEN SUGGESTED BY EXPERTS BUT STILL HAVE THE PROBLEM. THE JEEP HAS AROUND 30,000 MILES,AND IT HAS BEEN OFF ROAD,BUT SOME PEOPLE HAVE NOT BEEN OFFROAD AT ALL AND HAVE THE SAME PROBLEM. WITH MILEAGE I DON'T THINK THIS JEEP SHOULD BE CONSIDERED WARNOUT. THE PROBLEM IS STILL ONGOING. *TR",
        "vin": "1J4FA69S54P"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/03/2010",
        "dateOfIncident": "01/10/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10353650,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2004 JEEP WRANGLER HAS \"THE DEATH WOBBLE\".  AT APPROX. 45-50 MPH THE STEERING WHEEL JUST ABOUT SHAKES OUT OF MY HANDS.  THE DEALERSHIP WILL NOT EVEN CHECK IT OUT WITHOUT CHARGING ME BY THE HOUR WITH AN ESTIMATED 2 HR. INSPECTION.  IT'S ALL OVER THE INTERNET YET JEEP REFUSES TO ACKNOWLEDGE IT EXISTS.  I LOVE MY JEEP, IT'S THE 3RD ONE I'VE OWNED, BUT I WILL NEVER BUY ANOTHER ONE.  THE ONLY FIX SEEMS TO BE TO POUR MONEY IN MY VEHICLE UNTIL I GET THE RIGHT PART TAKEN CARE OF.  I CAN'T EVEN TRADE IT IN WHILE IT'S DOING THIS.  I'M STUCK AND I WANT SOME ACTION TAKEN BY JEEP! *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/03/2010",
        "dateOfIncident": "08/19/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10353830,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE MOVING ROCKS IN MY YARD, I PUT THE TRANSFER CASE IN LOW AND LOCKED THE AXLES, BOTH FRONT AND REAR. THE FRONT DRIVER SIDE U-JOINT EXPLODED, DAMAGING THE INNER AND OUTER AXLES. THE VEHICLE WAS UNDRIVABLE. I DO FAILURE ASSESSMENT FOR MY WORK AND HAVE DETERMINED INCORRECT HEAT TREATING OF THE CRITICAL DRIVE TRAIN COMPONENTS TO BE SUSPECT. THIS IS SUPPOSE TO BE A HEAVY DUTY VEHICLE. MOVING ROCKS IS HARDLY HEAVY DUTY. THERE ARE ALSO A LOT OF \"REPLACEMENT\" AXLES AVAILABLE ON THE AFTERMARKET THAT STATE THEY ARE \"MORE\" HEAVY DUTY THAN STOCK. A NEIGHBOR DOWN THE STREET EXPERIENCED THE SAME FAILURE PRIOR TO ME. MY VEHICLE MISSED THE WARRANTY BY 2,700 MILES BUT IS 2 YEARS UNDER. REPAIRS ARE EXPECTED TO BE $1,000 PLUS LABOR. *TR",
        "vin": ""
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/19/2010",
        "dateOfIncident": "06/19/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10350526,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2004 JEEP \"WRANGLER X\" SINCE IT WAS NEW AND HAVE EXPERIENCE THE \"DEATH WOBBLE \" ALMOST FROM THE BEGINNING. THE STEERING STABILIZER WAS REPLACED WHILE ON WARRANTY AND I HAVE REPLACED THAT ONE MYSELF. THE VEHICLE HAS @ 41,000 MI. AND THE PROBLEM IS GETTING WORSE. *TR",
        "vin": "1J4FA39S64P"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/16/2010",
        "dateOfIncident": "07/15/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10349673,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2004 JEEP WRANGLER UNLIMITED.  I HAVE BEEN THE ONLY OWNER OF THIS VEHICLE AND I HAVE PERSONALLY BE DEALING WITH THE INTENSE SHAKING OF THE STEERING WHEEL.  I HAVE RECENTLY TAKEN IT TO THE SHOP TO BE WORKED ON BECAUSE I COULD NOT PUT UP THE  \"DEATH WOBBLE\" THAT EVERYONE ELSE HAS BEEN TALKING ABOUT, AND SHOP THAT WORKED ON MY VEHICLE RECOMMENDED A STEERING STABILIZER THAT IT WAS WHAT WOULD FIX THE PROBLEM.  WELL IT WORKED FOR ABOUT A WEEK AND NOW THE JEEP IS DOING THE EXACT SAME THING.   NOTHING SEEMS TO MAKE IT GO AWAY.  THESE JEEPS THAT ARE HAVING PROBLEMS SUCH AS THIS ONE NEEDS TO HAVE A RECALL AND FIX THE TRUE PROBLEM.  THIS IS NOT GIVING JEEP A GOOD REPUTATION. *TR",
        "vin": "1J4FA49S64P"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/12/2010",
        "dateOfIncident": "08/12/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10349094,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "IGNITION LINKAGE ROD (IGNITION TO SWITCH) ON 2004 JEEP WRANGLER UNLIMITED & JEEP LIBERTY IS POORLY MADE OF WEAK POT METAL MATERIAL AND IS EASILY BROKEN. KEY WILL TURN TO ON POSITION (SOMETIMES) BUT CAN NOT ENGAGE SWITCH. LINKAGE ROD NEEDS TO BE MADE OF STRONGER MATERIAL OR BE MADE SLIGHTLY THICKER (WHICH WOULD ALSO REQUIRE A REDESIGN OF THE SWITCH'S RECEIVER HOLE)  TO BE ABLE TO HANDLE THE STRAIN OF TURNING THE IGNITION SWITCH. PART IS ALSO HOUSED BEHIND A REMOVABLE HOUSING AND IS MADE TO BE SERVICED (SHOWING THAT THE MANUFACTURER EXPECTED WARE) BUT PART IS NOT AVAILABLE FOR PURCHASE. THE ENTIRE STEERING COLUMN MUST BE REPLACED AT A DEALERSHIP AT AN EXPECTED COST OF $400-$600. THIS IS ONLY ONE SMALL PART THAT SHOULD COST AT MOST AROUND $20 AND IS MADE TO BE REPLACED WHEN THE INEVITABLE BREAKAGE OCCURS. DESPITE THE FREQUENCY OF THIS PROBLEM THE DEALERS SERVICE CENTER STILL CLAIM THAT THIS IS THE FIRST TIME THEY HAVE EVER HEARD OF SUCH A PROBLEM WHILE THE MAN IN THE PARTS DEPARTMENT WAS FAMILIAR ENOUGH WITH IT HE IDENTIFIED THE BROKEN PART BEFORE I COULD TELL HIM MYSELF WHAT IT WAS. HE EVEN ASKED IF I WAS THE SAME GUY THAT HAD BEEN IN LAST WEEK WITH THE SAME COMPLAINT, WHICH I AM NOT. FIRST TIME REPORTING A FAULTY PART, MY SITUATION ALONG WITH HUNDREDS OF REPORTS I HAVE READ ONLINE HAS CONVINCED ME THIS IS WORTHY OF A RECALL. *TR",
        "vin": "1J4FA49S04P"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/21/2010",
        "dateOfIncident": "07/21/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10344546,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 JEEP WRANGLER DEATH WOBBLE.  FRONT END SHAKES VIOLENTLY AFTER HITTING POTHOLES AT 45 TO 70 MILES AND HOUR. WILL NOT STOP UNLESS YOU COME TO ALMOST A STOP. THIS HAPPENS DAILY.  KEY IN JEEP DEATH WOBBLE INTO ANY SEARCH ENGINE OR YOUTUBE VIDEO FOR A LENGHTY LIST OF DISCUSSION ON THIS SUBJECT. I MYSELF HAVE NOT BEEN ABLE TO CORRECT IT PERMANENTLY WITH STABILIZERS, NEW TIRES, ALIGNMENT, WHEEL BALANCING AND STEERING COMPONENT TIGHTENING. THIS IS VERY DANGEROUS AND NEEDS TO BE LOOKED AT. THIS IS A STOCK JEEP, NO LIFT, STANDARD SIZE TIRES.  THIS IS NOT ONE INCIDENT, BUT AN ON-GOING PROBLEM FOR SEVERAL YEARS. NEW TIRES HAVE FIXED IT TEMPORARILY ONCE, NEW STEERING STABILZER FIXED IT TEMPORARILY ONCE, NEW SWAY BAR ALSO DID A SHORT TEMP FIX. I NEED A PERMANENT FIX AS DO MANY MANY OTHER JEEP OWNERS OUT THERE.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/18/2010",
        "dateOfIncident": "07/18/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10343837,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THREE YEARS AGO I BOUGHT A 2004 JEEP RUBICON WITH JUST UNDER 49,000 MILES ON IT IN MINT CONDITION FROM A LOCAL DEALER WITH AN EXTENDED WARRANTY, SOON AFTER THE JEEP STARTED THE DEATH WOBBLE, I HAVE TAKEN IT BACK TO THE DEALER NUMEROUS TIMES ONLY TO BE TOLD THEY CANT FIND A SINGLE PROBLEM, I TOOK IT TO BIG O TIRES AND THEY PUT NEW STEERING STABILIZER AND DRAG LINK, ONLY FIXED IT FOR ABOUT THREE MONTHS, THE JEEP JUST SITS NOW WITH BRAND NEW TIRES, NEW STABILIZER, AND NEW DRAG LINK, I HAVE JUST OVER 50,000 MILES ON IT, STILL MAKING PAYMENTS ON IT AND I CAN ONLY TRUST TO DRIVE IT TO THE MAIL BOX AND BACK. THE ONLY WAY TO GET IT UNDER CONTROL IS TO BRAKE TO A DEAD STOP BEFORE THE JEEP STOPS SHAKING. I DON'T KNOW WHAT TO DO TO GET THIS FIXED, I HAVE BEEN THINKING TO JUST STOP MAKING THE PAYMENTS AND LETTING IT GET REPOED?  WHAT SHOULD OR WHAT CAN BE DONE? *TR",
        "vin": "1J4FA69S64P"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/07/2010",
        "dateOfIncident": "06/07/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10334975,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "VIOLENT FRONT END WOBBLING EVERY TIME I HIT A BUMP IN THE ROAD, NO MATTER THE SIZE OF THE BUMP. TO STOP THE WOBBLING I HIT THE BRAKES AND IT STOPS UNTIL ANOTHER BUMP IS HIT. BALANCED AND ROTATED THE TIRES, REPLACED THE STEERING STABILIZER AND NEW TIRES, THIS HELPED FOR ABOUT THREE MONTHS AND NOW IT IS GETTING WORSE. *TR",
        "vin": "1J4FA49S54P"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/25/2010",
        "dateOfIncident": "05/25/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10332191,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHAT SEEMS TO BE A VERY COMMON PROBLEM WITH THE JEEP WRANGLER MODEL LINE IS A PROBLEM KNOWN THROUGHOUT THE COMMUNITY AS THE \"DEATH WOBBLE.\"  I PURCHASED A USED JEEP WRANGLER RUBICON ALMOST TWO YEARS AGO, AND HAVE BEEN EXPERIENCING THIS PROBLEM EVER SINCE.  MY JEEP, ALONG WITH MANY OTHERS LIKE IT, HAS ABSOLUTELY NO AFTERMARKET MODIFICATIONS, YET HAS A VERY DANGEROUS SYMPTOM WHICH MAKES ME SCARED TO DRIVE IT OVER 40 MPH.     THE \"DEATH WOBBLE\" CAN ONLY BE DESCRIBED AS AN INCREDIBLY VIOLENT SHAKE OF THE STEERING WHEEL FROM LEFT TO RIGHT AFTER GOING OVER A BUMP OR IMPERFECTION IN THE ROAD.  IT WILL USUALLY START OFF SLOWLY, BUT WITHIN HALF A SECOND THE ENTIRE FRONT END OF THE CAR IS SHAKING OUT OF CONTROL, AND ONLY STOPS WHEN THE VEHICLE IS BROUGHT TO A STOP.  WITH THE STEERING WHEEL SHAKING VIOLENTLY, IT IS VERY DIFFICULT TO MAINTAIN DIRECTIONAL CONTROL OF THE VEHICLE, WHICH AT HIGHWAY SPEEDS CAN BE VERY DANGEROUS.  ALSO, SINCE THE ONLY WAY TO STOP THIS PROBLEM IS TO SLOW DOWN RAPIDLY, THIS CREATES A VERY HAZARDOUS TRAFFIC SITUATION.  THIS PROBLEM HAS BEEN WELL DOCUMENTED THROUGHOUT THE HISTORY OF THE JEEP WRANGLER, AND CHRYSLER HAS ONLY ISSUED A TEMPORARY SOLUTION TO REPLACE THE STEERING STABILIZER.  I HAVE DONE THIS TWICE NOW, AND IT IS ONLY A BAND-AID TO MASK THE UNDERLYING PROBLEM, WHICH JEEP REFUSES TO ISSUE A RECALL OR PAY THE BILL TO FIX.  I AM LITERALLY SCARED TO DRIVE MY VEHICLE ON ANY HIGHWAY, AND I AM SURE THOUSANDS OF OTHER JEEP WRANGLER OWNERS OUT THERE ARE IN THE EXACT SAME POSITION I AM IN. *TR",
        "vin": "1J4FA69S34P"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/15/2010",
        "dateOfIncident": "04/15/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10325924,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2004 JEEP WRANGLER RUBICON. I'VE BEEN EXPERIENCING DEATH  WOBBLE, WHERE THE WHOLE FRONT END OF THE VEHICLE SHAKES VIOLENTLY AND WHEELS ACTUALLY WOBBLE.I HAVE REPLACED SHOCKS, STEERING STABILIZER, ROTATED AND BALANCED TIRES AND HAD THE FRONT END ALIGNED AND CHECKED BY A CAR DEALERS SERVICE DEPT.  THE WOBBLE LESSENS BUT STILL PERSISTS. IT OCCURS AT  40 MPH OR ABOVE. NO ONE HAS BEEN ABLE TO FULLY EXPLAIN A SURE FIX FOR THE PROBLEM. MY JEEP HAS BEEN VERY WELL MAINTAINED AND HAS 57,000 MILES. JEEP/CHRYSLER ARE NO HELP IN FIXING THIS POTENTIALLY DEADLY PROBLEM. *TR",
        "vin": "1J4FA69S94P"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/08/2010",
        "dateOfIncident": "02/15/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10317906,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS OVERFLOWS BEFORE FUEL NOZZEL SHUTS OFF WHEN FILLING TANK. *TR",
        "vin": "1J4FA39S74P"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/28/2010",
        "dateOfIncident": "02/27/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10314946,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2004 JEEP WRANGLER UNLIMITED KEEPS OVERFLOWING WITH FUEL AT THE PUMP. WHETHER THE JEEP IS FILLED FROM EMPTY OR PARTIALLY FULL IT DOES NOT MATTER. FUEL KEEPS SPITTING OUT OF THE FILLER NECK ONCE THE JEEP IS FULL. I AM TIRED OF GETTING FUEL ALL DOWN THE SIDE OF THE JEEP, ON THE GROUND, AND ON MYSELF. SOMETHING NEEDS TO BE DONE ABOUT THIS. *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/19/2010",
        "dateOfIncident": "02/18/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10311973,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "EVERY TIME I FUEL MY 2004 JEEP WRANGLER THE FUEL SPLASHES ALL OVER AROUND THE GAS CAP. I THINK THIS IS A MAJOR PROBLEM BECAUSE OF A CHANCE OF FIRE. ALOT OF JEEP WRANGLER OWNERS ARE HAVING THIS PROBLEM AND ITS ONLY A MATER OF TIME BEFORE A FIRE HAPPENS. *TR",
        "vin": "1J4FA49S24P"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/13/2009",
        "dateOfIncident": "01/05/2009",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10292081,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 JEEP WRANGLER. WHILE DRIVING APPROXIMATELY 10 MPH ON A SNOW COVERED ROAD SURFACE,  THE REAR END OF THE VEHICLE BEGAN TO SHIMMY.  NEXT WITHOUT WARNING THE VEHICLE STALLED. THE VEHICLE WAS TOWED TO AN AUTHORIZED DEALER FOR INSPECTION, AND THE REAR PASSENGER SIDE DRIVE SHAFT WAS REPLACED.  THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER ON TWO SEPARATE OCCASIONS FOR  THE IDENTICAL FAILURES.  THE VEHICLE WAS REPAIRED FOR THE MALFUNCTIONS.   THE FAILURE MILEAGE WAS 58,000.  THE CURRENT MILEAGE WAS 68,526.",
        "vin": "1J4FA49S54P"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "10/13/2009",
        "dateOfIncident": "06/21/2009",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10287250,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "BROKEN INTERIOR JEEP UNLIMITED 2004 HANDLE. CAN OPEN FROM OUTSIDE BUT NOT INSIDE. HAVE NO CHILDREN THAT WOULD HAVE PULLED AT IT,SO NOW I HAVE TO ROLL DOWN THE WINDOW TO GET OUT OF THE CAR? HAS NOT BEEN FIXED. *TR",
        "vin": "1J4FA49S74P"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/05/2009",
        "dateOfIncident": "08/05/2009",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10279522,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PROBLEM IS VIOLENT FRONT END VIBRATION WHEN VEHICLE IS OPERATED BETWEEN 45MPH-55MPH. THE VIBRATION IS SO INTENSE IT CAUSES THE STEERING WHEEL  AND FRONT END TO VIBRATE VIOLENTLY. THIS PROBLEM HAS OCCURRED NUMEROUS TIMES OVER 5 YEARS OF OPERATION AND ESPECIALLY AFTER TIRE CHANGES. I HAVE HAD 2 DIFFERENT SETS OF TIRES ON THIS JEEP WHICH WERE BALANCED AND HAVE CONTINUED TO HAVE THIS PROBLEM. IN THE PAST I OVERCAME THIS PROBLEM BY ROTATING THE TIRES UNTIL I FOUND THE TIRE ORIENTATION THAT GAVE THE LEAST AMOUNT OF VIOLENT VIBRATION  I HAD THOUGHT THAT I MAY HAVE HAD A HAIRLINE FRACTURE ON ONE OF THE RIMS BUT AFTER INSTALLING NEW RIMS AND THE THIRD SET OF TIRES THE PROBLEM IS BACK AND AS BAD AS EVER. OUT OF FRUSTRATION I TURNED TO THE INTERNET TO FIND OUT IF THEIR ARE ANY OTHER JEEP WRANGLER OWNERS EXPERIENCING THIS PROBLEM. TO MY SURPRISE AFTER READING SEVERAL INTERNET FORUMS ON JEEP WRANGLERS MANY DO . THIS PROBLEM EVEN HAS A NAME THE JEEP COMMUNITY HAS GIVEN IT THE \"DEATH WOBBLE\" !  THE PROBLEM SEEMS TO OCCUR IN THE 96-06 TJ BODY STYLE WHICH INCLUDES THE SAHARA,X AND SPORT EDITIONS. THERE ARE NUMEROUS POSSIBLE CAUSES AND REPAIRS THAT PEOPLE HAVE COME UP WITH BUT IT SEEMS AS NO ONE HAS PINPOINTED THE CORRECT REPAIR. THE RECOMMENDED REPAIRS SUGGEST THE TRACTION BAR AND STEERING STABILIZER ARE AT FAULT  BUT PEOPLE HAVE HAD MIXED RESULTS REPLACING THESE PARTS. IT APPEARS TO ME THAT THE PEOPLE AT JEEP MUST KNOW ABOUT THIS PROBLEM BUT HAVE FAILED THEIR CUSTOMERS AT REMEDYING THIS HAZARDOUS PROBLEM. *TR",
        "vin": "1J4FA39S04P"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/29/2009",
        "dateOfIncident": "04/22/2009",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10278617,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A 2004 JEEP WRANGLER ABOUT 6 MONTHS AGO AND 3 OF THE MONTHS THAT I HAVE OWNED THIS VEHICLE ITS HAS A SHAKE IN THE FRONT END KNOWN AS THE DEATH WOBBLE (GOOGLE DEATH WOBBLE)MY JEEP HAS 63,000 MILES ON IT AND NO WARRANTY, BOUGHT IT USED. WHEN I DRIVE THIS JEEP 40-55 MILES A HOUR AND IF I HIT A BUMP THE WHOLE FRONT END OF THE JEEP SHAKES OUT OF CONTROL, VERY DANGEROUS. MY JEEP WRANGLER HAS HAD NOTHING DONE TO IT (NO LIFTS OR ADDED PARTS ALL STOCK) I HAVE BROUGHT THIS JEEP TO A MECHANIC 1 MONTH AGO AND THIS FRIDAY IT WILL BE GOING BACK TO ANOTHER MECHANIC. WHEN MY JEEP FIRST DID THIS DEATH WOBBLE I DID SOME RESEARCH AND I WAS VERY SURPRISED HOW MANY PEOPLE HAVE RECEIVED THE SAME PROBLEM AS I DID. IS THERE ANYTHING I CAN DO? THIS JEEP SAT AT THE DEALERS LOT FOR 1 YEAR BEFORE HE SOLD IT, DID HE KNOW? MAYBE NOTHING WILL COME OUT OF THIS BUT I FEEL JEEP NEED TO RECALL THIS PROBLEM AND FIX IT CORRECT BEFORE SOMEONE GET HURT BAD. I HAVE TWO DAUGHTERS AND I WILL NOT LET THEM RIDE IN MY JEEP UNTIL I FIND THE CORRECT WAY TO FIX IT. MY JEEP HAS THIS PROBLEM AT LEAST 1 TIME A DAY. *TR",
        "vin": "1J4FA29104P"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "06/17/2009",
        "dateOfIncident": "06/14/2009",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10274139,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2004 JEEP WRANGLER WAS IN PARK AND RUNNING AND DRIFTED DOWN A HILL AND INTO ANOTHER PARKED VEHICLE CAUSING 4K WORTH OF DAMAGE TO MY JEEP AND WHO KNOWS HOW MUCH TO THE OTHER VEHICLE.  THERE IS A RECALL ON 2005 AND 2006 JEEP WRANGLERS FOR TRANSMISSION \"PARK\" PROBLEMS, I THINK THEY ARE MISSING A YEAR!  *TR",
        "vin": "1J4FA49SX4P"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/31/2009",
        "dateOfIncident": "03/24/2009",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10263767,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 JEEP WRANGLER.  TWO WEEKS AFTER PURCHASING THE VEHICLE, THE REAR DRIVER'S SIDE AXLE FAILED.  THE CONTACT TOOK THE VEHICLE BACK TO THE DEALER FOR THE REPAIRS, BUT THE FAILURE RECURRED THREE MONTHS LATER.  HE RETURNED THE VEHICLE TO THE DEALER TO REPAIR THE AXLE AND THE PUMPKIN.  THE DEALER HAS BEEN UNABLE TO DETERMINE THE CAUSE OF THE AXLE FAILURE.  THE CONTACT IS CONCERNED THAT THE AXLE WILL FAIL WHILE DRIVING AND CAUSE A CRASH.  THE VIN WAS UNKNOWN.  THE CURRENT MILEAGE WAS 60,000 AND FAILURE MILEAGE WAS 57,000.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/17/2009",
        "dateOfIncident": "03/16/2009",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10262094,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TURNING LEFT AT AN INTERSECTION AT 5 MPH, ENGINE STALLED.  THIS HAPPENED TWICE.  MECHANIC SCANNED ENGINE WITHOUT FINDING CAUSE. *TR",
        "vin": "1J4FA59S94P"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/06/2009",
        "dateOfIncident": "12/01/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10253954,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 JEEP RUBICON BALL JOINT FAILURE. *TR",
        "vin": "1J4FA69SX4P"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "12/22/2008",
        "dateOfIncident": "12/22/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10252590,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DAUGHTER EXPERIENCED BRAKE FAILURE IN HER 2004 JEEP WRANGLER CAUSING HER TO COAST THROUGH A STOP SIGN AND HIT AN ONCOMING CAR. UPON INSPECTION OF HER JEEP, THERE WAS A CLIP MISSING THAT SECURED THE CONNECTION OF THE BRAKE PEDAL ASSEMBLY TO THE ACTUATOR ROD THAT GOES INTO THE BRAKE BOOSTER/MASTER CYLINDER.  WITHOUT THE CLIP, THE TWO PARTS SEPARATED CAUSING COMPLETE BRAKE FAILURE. THIS CAR HAS NO HISTORY OF BRAKE REPAIR IN THAT AREA WHICH INDICATES A FAULTY CLIP OR A CLIP WAS NEVER INSTALLED FROM THE FACTORY. *TR",
        "vin": "1J4FA49S54P"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "11/18/2008",
        "dateOfIncident": "07/27/2008",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10249163,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 JEEP WRANGLER WAS PARKED & CAUGHT FIRE. *TR",
        "vin": "1J4FA69S54P"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/11/2008",
        "dateOfIncident": "11/10/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10248514,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MULTIFUNCTION LIGHT SWITCH HAS FAILED AFTER 60,000 MILES OF VEHICLE OPERATION. SYMPTOMS OF FAILURE ARE: FOG LIGHTS ENGAGE INTERMITTENTLY WHEN SIGNALING RIGHT-HAND TURNS OR WHEN DRIVING OVER ROUGH SURFACE ROADS.     AN ELECTRICAL \"POPPING\" NOISE CAN BE HEARD ORIGINATING FROM THE HEADLIGHT SWITCH STALK WHERE THE FOG LIGHT SWITCH RESIDES. ASSEMBLY WAS REMOVED AND INSPECTED FOR ANY PHYSICAL DAMAGE OR LOOSE WIRING CONTACTS, BUT NO EXTERNAL DEFECTS COULD BE OBSERVED. VEHICLE DOES NOT EXPERIENCE ANY SORT OF ABNORMAL USE OR ABUSE.     I BELIEVE THAT THIS IS A POSSIBLE FIRE HAZARD, AS NUMEROUS OTHER OWNERS HAVE COMPLAINED OF SWITCH FAILURE LEADING TO MELTED, BURNED WIRES AND CONNECTORS IN THE MULTIFUNCTION SWITCH WIRING HARNESS, AS WELL AS IN THE SWITCH ITSELF.    THIS PROBLEM IS IDENTICAL TO THAT PLAGUING MANY PT CRUISERS, WHICH USE THE SAME SWITCH ASSEMBLY AS THIS VEHICLE.    THE PROBLEM WILL MOST LIKELY REQUIRE REPLACEMENT OF THE MULTIFUNCTION SWITCH ASSEMBLY, BUT AS THE DESIGN SHOWS NO SIGNS OF UNDERGOING AN ENGINEERING REVISION SINCE INTRODUCTION, I BELIEVE THAT ANY REPLACEMENT PART WILL ULTIMATELY PRESENT THE SAME PROBLEM AFTER ONLY A MATTER OF TIME. *TR",
        "vin": "1J4FA49S54P"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/12/2008",
        "dateOfIncident": "09/10/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10241964,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING AND WHEN I STOPPED THE JEEP WOULD NOT GO INTO PARK. I FOUND A PIECE OF LEVEL GROUND TO STOP ON BUT THEN SINCE IT WOULD NOT GO INTO PARK, I COULD NOT TAKE THE KEY OUT OF THE IGNITION. I WAS VERY LUCKY THE DEALER WAS OPEN SO I COULD DRIVE IT THERE TO BE FIXED. THEY TOLD ME THE  CENTER PIN/SHAFT ON SHIFT ASSEMBLY WAS BROKE. I ASK IF THAT WASN'T A SAFETY PART AND WAS TOLD NO EVEN IF IT HAD BEEN, THE JEEP WAS OUT OF WARRANTY SO IT WOULD NOT MAKE A DIFFERENCE ANY WAY. THE LADY IN WRITE UP SAID THAT WAS THE SECOND ONE THEY HAD TO FIX. I BELIEVE THIS COULD BE A VERY DANGEROUS THING. THERE WAS NO WARNING THAT IT WAS GOING TO HAPPEN! I LIVE ON A HILL AND THERE WAS NO WAY I COULD GO HOME WITH IT NOT BEING ABLE TO PUT IT IN PARK, I COULD NOT EVEN GET OUT OF IT IN MY DRIVE WAY BECAUSE OF THE INCLINE. WHAT'S HAPPEN TO THE STEEL WITH WHICH THEY MAKE THE CAR PARTS TODAY? *TR",
        "vin": "1J4FA69S74P"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/07/2008",
        "dateOfIncident": "10/19/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10226929,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 JEEP WRANGLER.  THE CONTACT STATED THAT THERE WAS A MAJOR \"SHIMMY\" IN THE FRONT END OF THE VEHICLE.  WHILE DRIVING 50 MPH, THE CONTACT EXPERIENCED A LOT OF MOVEMENT IN THE FRONT END THAT CAUSED HIM TO LOSE CONTROL OF THE VEHICLE.  HE TOOK THE VEHICLE TO THE DEALER AND SUGGESTED AN ALIGNMENT.  THE VEHICLE WAS ALIGNED AND THE TIRES WERE BALANCED, BUT THIS DID NOT REMEDY THE FAILURE.  THE VEHICLE WAS OUT OF WARRANTY; THEREFORE, THE DEALER WOULD NOT REPAIR THE VEHICLE.  THE VIN WAS UNKNOWN.  THE CURRENT MILEAGE WAS 31,150 AND FAILURE MILEAGE WAS APPROXIMATELY 6,000.",
        "vin": ""
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "04/23/2008",
        "dateOfIncident": "01/23/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10225491,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SEAT BELT MECHANISM THAT RETRACTS THE SEATBELT IN THE 2004 JEEP WRANGLERS.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/17/2008",
        "dateOfIncident": "04/06/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10224788,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 JEEP WRANGLER EXPERIENCES SEVERE VIOLENT FRONT END SHIMMY/WOBBLE AT HIGHWAY SPEEDS.  SHIMMY OCCURS WHEN HITTING BUMPS ON HIGHWAY WHEN TRAVELING STRAIGHT AT 40 TO 70 MPH.  SHIMMY IS UNCONTROLLABLE AND ONLY CEASES WITH SLOWING DOWN.  *TR",
        "vin": "1J4FA69S94P"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "04/17/2008",
        "dateOfIncident": "02/06/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10224838,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING JEEP IN COLD WEATHER, THE WINDSHIELD SUDDENLY CRACKED FROM THE CENTER, BOTTOM OF GLASS TO THE PASSENGER SIDE OF THE GLASS. THE INNER PANE OF GLASS CRACKED. THERE WAS NOT ANY DAMAGE TO THE GLASS PRIOR TO THE BREAK. I WAS RUNNING THE DEFROSTER AT THE TIME AND THE AMBIENT TEMPERATURE WAS APPROX. 7 DEGREES F.  *TR",
        "vin": "1J4FA69S24P"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "01/23/2008",
        "dateOfIncident": "01/21/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10215733,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "BLEND DOOR BREAKAGE/FAILURE  HEATER,DEFROST,CONTROLS STOPPED WORKING. FLAW IN DESIGN OF INTERNAL PINS IN BLEND DOORS. REPAIRED FOR OVER $700 A YEAR AGO AND BROKEN AGAIN ALREADY. THOUSANDS OF COMPLAINTS ABOUT THIS ON JEEP OWNERS FORUMS.  *TR",
        "vin": "1J8GW58J04C"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/04/2007",
        "dateOfIncident": "12/01/2007",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10210840,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTOMATIC TRANSMISSION WOULD NOT SHIFT TO PARK - UNABLE TO REMOVE KEY FROM IGNITION - TAKEN TO THE JEEP DEALERSHIP AND TOLD THEM THE SAME PROBLEM WITH THE SAME TRANSMISSION 42RLE WAS RECALLED IN 2005 WRANGLERS AND I WANTED TO KNOW WHY THE 2004 WRANGLERS WERE NOT PART OF THE SAME RECALL WHEN WE ARE DEALING WITH THE SAME TRANSMISSION - THE VEHICLE HAS LESS THAN 22,000 MILES - THE 2005 WRANGLER RECALL NUMBER IS 05V460000: A/T PARKING PAWL SHAFT ANCHORING AND RECALL - A/T PARKING PAWL CUP PLUG DEFECT - SAFETY RECALL E14.  *TR",
        "vin": "1J4FA39S84P"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/13/2007",
        "dateOfIncident": "10/13/2007",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10208776,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 JEEP WRANGLER.  WHEN THE VEHICLE WAS STARTED, THE GEAR WOULD NOT SHIFT OUT OF PARK.  THE TOW TRUCK DRIVER WAS ABLE TO SHIFT THE VEHICLE OUT OF PARK.  THE VEHICLE WAS DRIVEN TO THE DEALER AND THEY STATED THAT A PART INSIDE THE LEVER FAILED.   THE FAILURE MILEAGE WAS 27,500 AND CURRENT MILEAGE WAS 28,000.  THE NYLON ROD WAS THE PART THAT FAILE INSIDE THE SHIFTER LEVER.",
        "vin": "1J4FA69S74P"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/12/2007",
        "dateOfIncident": "04/24/2007",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10208678,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I COULD NOT SHIFT THE AUTOMATIC TRANSMISSION TO PARK. THE SHIFTER WOULD GET STUCK IN REVERSE, RESULTING IN ME INADVERTENTLY MOVING BACKWARDS  WHEN TAKING MY FOOT OFF THE BRAKE- A VERY DANGEROUS CONDITION. TURNED THE ENGINE OFF, WAITED AND THEN WAS ABLE TO SHIFT INTO PARK.  THE NEXT DAY I ALSO COULD NOT SHIFT DOWN FROM PARK INTO GEAR.  HAD IT TOWED TO THE DEALER IN JEFFERSONVILLE IN, THEY SAID THE SHIFTER WAS BAD AND REPLACE IT AT A COST OF $ 325 TO ME.  AFTER DRIVING FOR A DAY I NOTICE THAT I DID NOT NEED TO PRESS THE BRAKE TO SHIFT OUT OF PARK.  TOOK IT BACK AND THEY SAID \"SORRY\"....AND FIX IT BUT THE INDICATOR STILL IS NOT RIGHT BUT I DON'T TRUST THEM.  IT SEEMS LIKE JEEP HAS 2 MAJOR SAFETY PROBLEMS WITH THE 2004 WRANGLER.  THE DEATH WOBBLE AND THE SHIFTER.  *TR",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "11/11/2007",
        "dateOfIncident": "11/09/2007",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10208618,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "JEEP GRAND CHEROKEE PASSENGER SIDE WINDOW REGULATOR FAILED. INTERNET GOOGLE SEARCH INDICATES THAT THIS IS AN ONGOING PROBLEM WHICH, UNDER CERTAIN CONDITIONS, COULD BE A SAFETY HAZARD. CHRYSLER NEEDS TO TAKE RESPONSIBILITY FOR A KNOWN MECHANICAL FAILURE WHICH IS VERY EXPENSIVE TO REPAIR. NUMEROUS REPORTS OF MULTIPLE FAILURES ON THE SAME JEEP VEHICLE.  *TR",
        "vin": "1J8GW48N24C"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/31/2007",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10208264,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 JEEP WRANGLER WITH A VIOLENT VIBRATION. CUSTOMER STATES THAT THE VIBRATION AND SHAKING BEGAN WHEN SHE WENT OVER SOME UNEVEN PAVEMENT ON THE HIGHWAY. MECHANIC DETERMINED THAT THE TRACK BAR AND STEERING DAMPER NEED TO BE REPLACED.  *KB  *JB",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/25/2007",
        "dateOfIncident": "09/01/2007",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10206850,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I COULD NOT SHIFT THE AUTOMATIC TRANSMISSION FROM \"IN GEAR\" TO PARK. THE SHIFTER WOULD GET STUCK IN REVERSE, RESULTING IN ME INADVERTENTLY MOVING BACKWARDS - A VERY DANGEROUS CONDITION. I ALSO COULD NOT SHIFT DOWN FROM PARK INTO GEAR. I HAD TO REMOVE THE PANEL AND MANUALLY MOVE THE ANCHOR FROM THE IN-GEAR POSITION TO PARK. I NOTIFIED MY DEALER OF THE PROBLEM AND THEY PERFORMED THE FOLLOWING: \"FOUND SHIFTER ASSEMBLE INTERNALLY DAMAGED. REMOVED AND REPLACED SHIFTER ASSEMBLE AND CHECKED OPERATION.\" THE COST OF THE REPAIR + LABOR WAS $483.27. THERE IS A RECALL/DEFECT FOR THE EXACT SAME PROBLEM IN THE 2005 WRANGLER. I OWN A 2004 MODEL. THE RECALL NUMBER FOR THE 2005 MODEL IS 05V460000.  *JB",
        "vin": "1J4FA39S94P"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/25/2007",
        "dateOfIncident": "08/08/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10206909,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 JEEP WRANGLER.  WHILE DRIVING AT VARIOUS SPEEDS, THE VEHICLE SHUTS OFF AND RESTARTS ON ITS OWN.  WHEN THE ENGINE SHUTS OFF, THE VEHICLE COMPLETELY LOSES POWER.  THE CONTACT TOOK THE VEHICLE TO THE DEALER FOR A DIAGNOSTIC TEST, BUT THE COMPUTER DID NOT REGISTER THE FAILURE.  THE VEHICLE HAS BEEN TO THE DEALER APPROXIMATELY FIVE TIMES.  THE CURRENT MILEAGE WAS 21,492 AND THE FAILURE MILEAGE WAS UNAVAILABLE.",
        "vin": "1J4FA69SX4P"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/04/2007",
        "dateOfIncident": "10/04/2007",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10205050,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "RIGHT REAR AXLE SEAL LEAKING FLUID ONTO BRAKE SHOES.  *TR  UPDATED 12/12/07.",
        "vin": "1J4FA29114P"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/13/2007",
        "dateOfIncident": "06/12/2007",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10199459,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2004 JEEP WRANGLER HAS DEVELOPED WHAT I LATER FOUND OUT IS KNOWN TO  JEEP DRIVERS AS THE \"DEATH WOBBLE.\"  AT HIGHWAY SPEEDS, THE FRONT END BEGINS TO SHAKE VIOLENTLY.  ONCE THE OSCILLATIONS START, THE VEHICLE BECOMES DIFFICULT TO STEER AND  MUST BE BROUGHT TO A FULL STOP FOR THEM TO GO AWAY.  VERY DANGEROUS ON THE FREEWAY SURROUNDED BY OTHER TRAFFIC.  THIS IS AN ENTIRELY UNMODIFIED, STOCK SUSPENSION WITH LESS THAN 20K MILES ON THE VEHICLE.  I TOOK IT TO THE DEALER, WHO COULD NOT FIND ANYTHING WRONG, BUT SUGGESTED I REPLACE THE POWER STEERING PUMP.  I HAD THE VEHICLE ALIGNED AND THE TIRES ROTATED, BUT THE PROBLEM CONTINUED.  THIS IS A MUCH MORE VIOLENT AND UNCONTROLLABLE SHAKE THAN WHAT IS CAUSED BY OUT OF BALANCE TIRES OR WARPED BRAKE ROTORS.  I TOOK THE JEEP TO A SHOP SPECIALIZING IN 4X4 SUSPENSION.  THEY MENTIONED THAT THE PROBLEM USUALLY OCCURS WHEN A VEHICLE IS IMPROPERLY LIFTED OR MODIFIED, BUT THEY HAD SEEN AN INCREASED INSTANCE OF LATER MODEL STOCK WRANGLERS EXPERIENCING IT.  THEY REPLACED THE BUSHINGS IN THE FRONT END COMPONENTS, BUT THE PROBLEM IS STILL THERE.  A SEARCH OF THE INTERNET SHOWS THAT MANY WRANGLER DRIVERS ARE HAVING THE SAME PROBLEM ON STOCK VEHICLES.  NO MECHANIC HAS BEEN ABLE TO FIND ANYTHING OBVIOUSLY WRONG, WHICH SUGGESTS A DESIGN DEFECT.  I AM SCARED TO DRIVE THIS CAR ON THE FREEWAY, AND CAN NOT IN GOOD CONSCIENCE SELL IT TO ANOTHER PERSON.   *JB",
        "vin": "1J4FA49S94P"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/04/2007",
        "dateOfIncident": "07/12/2007",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10198473,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THROW OUT BEARING AND NOISY TRANSMISSION I WAS TOLD AT THE DEALER WHEN I TOOK THIS 2004 JEEP WRANGLER IN FOR SERVICE, TOOK THE JEEP TO CANYONLANDS IN UTAH WHERE IT WOULDN'T GO INTO ANY GEAR AT ALL, HAD TO PULL IT HOME BEHIND A FRIENDS JEEP. THIS NEEDS TO BE ADDRESS AS A RECALL ISSUE! I WAS TOLD BY THE SERVICE DEPARTMENT REPRESENTATIVE TO TAKE MY JEEP SOMEPLACE ELSE FOR SERVICE REAL RUDELY. ALSO PAID FOR A 7 YEAR 70,000 MILE POWER TRAIN WARRANTY TRANSFER FROM ORIGINAL OWNER TO ME, THIS SAME DEALER ALSO SHOWED I PAID FOR NOTHING, SINCE IT WASN'T APPLICABLE EVEN THOUGH IT WAS SENT TO ME BY DAIMLER CHRYSLER.*JB",
        "vin": "1J4FA39S04P"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "05/22/2007",
        "dateOfIncident": "05/17/2007",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10191407,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR DOES NOT BLOW OUT OF THE VENTS OR FLOORS.  AIR ONLY BLOWS OUT OF THE DEFROSTER OR WINDSHIELD.  *AK",
        "vin": "1J4GW48SX4C"
    },
    {
        "components": "STEERING,SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/16/2007",
        "dateOfIncident": "04/15/2007",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10190908,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 JEEP WRANGLER SPORT GOES INTO A VIOLENT SHAKE WHEN DRIVING APPROXIMATELY  55 MPH.  I'VE READ ABOUT THE DEATH WOBBLE ON MORE THAN ONE WEB SITE OR BLOG.  I TOOK IT TO THE DEALER, AND THEY SAID IT WAS THE STEERING STABLIZER , BUT I BELIEVED THIS ONLY MASK, THE REAL PROBLEM.  I SPOKE TO A LOCAL 4X4 SHOP AND THEY SAID JEEP MADE THE LOWER CONTOL ARM TOO SHORT AND THIS PUSHED THE FRONT END DOWN AND THE ANGLES  WERE OFF.  ALSO, SAID THE AFTERMAKET REPLACEMENTS WERE APPROX 3/4\" LONGER THAN THE OEM.   MY JEEP WAS STOCK, NOT LIFTED.  THIS PROBLEM HAS CAUSED  THE TIRES TO CUP, BRAKES,  AND STEERING STABILIZER TO WEAR OUT EARLIER THAN NORMAL.  IT  WAS ONLY A MATTER OF TIME BEFORE SOMEONE GOT  KILLED OR INJURED.  *AK",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/13/2007",
        "dateOfIncident": "01/05/2007",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10190595,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HITS A BUMP WHILE DRIVING AND SHIMMIED ALMOST TO THE POINT OF HAVING TO STOP VEHICLE. THIS WAS ON A JEEP SAHARA 2004 MODEL WITH 40,000 MILES.I HAD WHEELS BALANCED OVER AND OVER AGAIN SINCE JANUARY.  *AK",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/02/2007",
        "dateOfIncident": "04/23/2007",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10189587,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOOK MY 2004 JEEP GRAND CHEROKEE BACK TO THE DEALER BROWN'S JEEP IN MEDFORD NY BECAUSE IT WOULD CONTINUOUSLY STALL AND THE YELLOW DASHBOARD LIGHT WOULD STAY ON. THE PROBLEM BEGAN AT APPROX 50,000 MILES AND THE DEALER NEW EXACTLY WHAT IT WAS; A THROTTLE SENSOR ON A CIRCUIT BOARD. THE SUV WOULD RACE AND BUCK AND WAS DIFFICULT TO CONTROL. IT SEEMED ODD THAT THEY NEW WHAT IT WAS RIGHT AWAY AND HAPPENED TO A RELATIVELY LATE MODEL VEHICLE. AND NOW I SAW AN ARTICLE IN THE NEWSPAPER ABOUT THE NHTSA INVESTIGATING STALLING OF JEEP SUVS. IT COST ME APPROX. $400-$500 OF THE $1150 I PAID FOR THE SERVICE VISIT ATTRIBUTABLE TO FIXING THE STALLING ISSUE. PERHAPS THE JEEPS YOU ARE INVESTIGATING ARE NOT THE ONLY YEARS INVOLVED. *TR",
        "vin": ""
    },
    {
        "components": "STEERING,SUSPENSION,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "04/30/2007",
        "dateOfIncident": "09/01/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10189286,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE GOES INTO A VIOLENT SHAKE (SHIMMY, VIBE, WOBBLE) WHEN THERE IS ANY CHANGE IN ROADWAY CONDITION (BUMP, LIP, HOLE, UNEVEN ROADWAY).  MY JEEP HAS NOT BEEN ALTERED IN ANYWAY.  I HAVE HAD THE TIRES ROTATED AND BALANCED.  IN ADDITION MY SEAT BELT ON THE DRIVERS SIDE AND FRONT PASSENGER BELT BOTH CATCH IN THE DOOR - THEY DO NOT RETRACT.  THIS HAS BEEN AN ONGOING PROBLEM FOR 5 MONTHS.  *AK",
        "vin": "1J4FA49S14P"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/05/2007",
        "dateOfIncident": "02/16/2007",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10184201,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL- THE CONTACT OWNS A 2004 JEEP WRANGLER EXTREME.  THE CONTACT'S DAUGHTER WAS  INVOLVED IN 2 CRASHES , AND THE AIRBAGS DID NOT DEPLOY EITHER TIME.  THE CONTACT STATED THAT BOTH OF THE ACCIDENTS HAPPENED WHEN THE ROAD CONDITIONS WERE SLIPPERY AND ICY.  *AK",
        "vin": "1J4FA39S54P"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/28/2006",
        "dateOfIncident": "06/09/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10177168,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "HIT A BUMP BETWEEN 50-55 MPH AND THE STEERING VIOLENTLY SHAKES.  COMMON TERM FOR THIS IN JEEP COMMUNITY IS \"DEATH WOBBLE\"  YOU MUST SLOW DOWN TO STOP IT. I TOOK IT TO THE DEALER AND THEY ONLY TEST DROVE THE VEHICLE WHICH WILL ALMOST NEVER WORK.   *JB",
        "vin": "1J4FA59S24P"
    },
    {
        "components": "STEERING,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "12/27/2006",
        "dateOfIncident": "12/23/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10177040,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 JEEP WRANGLER, 16,000 MILES ON IT AND THE FRONT END SHAKES VIOLENTLY WHEN HITTING A BUMP OR EVEN A SMALL POTHOLE IN THE ROAD. I HAVE READ REPORTS OF THIS SAME ISSUE HAPPENING OVER AND OVER AGAIN WITH THE DEALERS TELLING CUSTOMERS THAT IT'S \"BAD DRIVING HABITS\" CAUSING THE ROTORS TO WARP. WARPED ROTORS CAN BE FELT IN THE BRAKE PEDAL WHEN APPLING THE BRAKES, BUT THERE IS NO SHAKING HAPPENING WHILE BRAKING. WHY DON'T MANUFACTURERS \"DO THE RIGHT THING\" AND FIX THE PROBLEMS. SEAT BELT RETRACTORS NOT RETRACTING PROPERLY OR EVEN EXTENDING OUT WHEN TRYING TO FASTEN THEM IS ANOTHER PROBLEM THAT I ENCOUNTER ON A FREQUENT BASIS.",
        "vin": "1J4FA39S34P"
    },
    {
        "components": "TIRES,WHEELS,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/13/2006",
        "dateOfIncident": "02/22/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10176076,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED A USED 2004 JEEP WRANGLER RUBICON WITH 11000 MILES ON THE ODOMETER, AFTER DRIVING THE VEHICLE FOR SEVERAL MONTHS I NOTICED THAT THE ODOMETER SEAMED TO BE READING SLOW, SO I HAD THE ODOMETER CHECKED BY A STATE TROOPER AND FOUND OUT THAT AT 45 MPH I WAS ONLY MOVING AT 40 MPH. WITH FURTHER INVESTIGATION I FOUND THAT THE TIRES AND RIMS ARE NOT THE RIGHT SIZE FOR THE VEHICLE. THE TIRES THAT WHERE ON THE JEEP WHEN I PURCHASED IT ARE P225/75R15, THE MANUFACTURER RECOMMENDS LT245/75R16, IS THIS VEHICLE SAFE TO DRIVE?   THE DEALERSHIP WHERE I PURCHASED THE JEEP FROM REFUSES TO MAKE IT RIGHT. WOULD THE 11000 MILES ON THE ODOMETER BE RIGHT OR COULD IT BE MORE? *JB",
        "vin": "1J4FA69S74P"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/26/2006",
        "dateOfIncident": "08/30/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10174355,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 JEEP WRANGLER 24,000 MILES.  I DO NOT DRIVE MY WIFE'S JEEP THAT OFTEN SO NOT SURE WHEN THIS STARTED BUT IT DEVELOPED A SEVERE SHAKE IN FRONT END, TOOK INTO THE DEALER AND THEY CHANGED THE FRONT SHOCKS.  I DROVE IT A FEW WEEKS LATER AND THE SAME THING WAS STILL HAPPENING, DEALER CHANGED THE STABILIZER.  AGAIN, A FEW WEEK LATER HAD IT OUT AND STILL THE SAME PROBLEM...TOOK IT BACK TO THE DEALER, THIS TIME THEY ADVISED IT HAS WARPED ROTORS DUE TO BAD DRIVING HABITS.  THIS IS MY WIFE'S VEHICLE THAT HAS NEVER BEEN OFF ROAD AND DRIVES HIGHWAY MILES TO WORK, NOT SURE WHAT THE \"BAD HABITS\" ARE.  THE SHAKE IS FAIRLY VIOLENT AT TIMES AND COULD CAUSE A SERIOUS ACCIDENT.  THE DEALER WILL NOT REPAIR AS BRAKES ARE NOT COVERED.  I HAVE READ MANY REPORTS OF THIS PROBLEM, WHY HAVE THEY NOT BEEN ADVISED TO REPAIR THIS CONDITION?  *NM",
        "vin": "1J4FA49S54P"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/22/2006",
        "dateOfIncident": "11/21/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10174067,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE THE SAME ISSUE WITH MY BRAKES. MY RIGHH FRONT IS COMPLETELY GONE. I GET THE SAME ANSWER AS EVERYONE ELSE. ITS NOT UNDER WARRANTY. I HAVE APPROXIMATELY 35000 MILES.  *JB",
        "vin": "1J4FA39S24P"
    },
    {
        "components": "STEERING,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "11/03/2006",
        "dateOfIncident": "10/17/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10172542,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THE PITMAN ARM FELL OFF FROM THE STEERING GEAR BOX WHILE DRIVING 20 MPH ON NORMAL ROAD CONDITIONS, CAUSING THE VEHICLE TO SIDESWIPE ANOTHER VEHICLE.  NO INJURIES WERE SUSTAINED, AND A POLICE REPORT WAS TAKEN.  THE VEHICLE WAS TOWED TO THE DEALER FOR EVALUATION.  ALSO, THE FRONT END SHOOK WHEN DRIVING 50 MPH FOR TWO MONTHS PRIOR TO THE FAILURE.  THE MANUFACTURER WERE CONTACTED BUT THE CAUSE OF THE PROBLEM COULD NOT BE DETERMINED.",
        "vin": "1J4FA39S64P"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/30/2006",
        "dateOfIncident": "08/30/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10167089,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "2004 JEEP WRANGLER X HAS DEVELOPED A NOTICEABLE SHAKE, OR \"SHIMMY\" WITHIN THE LAST 30 DAYS.  THIS SHAKE IS ESPECIALLY VIOLENT AT AROUND 50 MPH OVER PAVED ROAD SURFACES WITH UNEVENNESS OR POTHOLES.    AT TIMES, THIS SHAKING IS SO SEVERE AS TO MAKE THE VEHICLE DIFFICULT TO CONTROL.    THIS PROBLEM WAS EVALUATED BY A JEEP DEALERSHIP.  THEIR FINDING WAS THAT THE ALIGNMENT AND STEERING ARE IN GOOD CONDITION, HOWEVER ALL FOUR TIRES ARE OUT OF ROUND AND NEED TO BE REPLACED.    THE TIRES ARE STOCK GOODYEAR WRANGLER GS-A'S AND ORIGINAL TO THE VEHICLE.  THEY HAVE LESS THAN 25,000 MILES ON THEM AND NOW APPEAR TO BE FAILING AT THE SAME TIME.  THE DEALER SERVICE REPRESENTATIVE REPORTED THAT THIS IS A CONDITION IS NOT UNCOMMON.  *NM",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/25/2006",
        "dateOfIncident": "06/01/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10164737,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 JEEP WRANGLER BURNING ALOT OF OIL. MECHANIC REFUSES TO REPAIR. *KB  THE ENGINE USED TO BURN A HALF A QUART OF OIL BETWEEN OIL CHANGES.  THAT HAS INCREASED TO 1 QUART OF OIL BETWEEN OIL CHANGES. THE MANUFACTURER SAID THIS WAS NORMAL AND REFUSED TO FIX THE VEHICLE.  THE DRIVER'S SIDE PLASTIC WINDOW CRACKED.  *NM",
        "vin": ""
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/07/2006",
        "dateOfIncident": "07/07/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10161852,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WILL ENTER INTO A VIOLENT WOBBLE AND SHAKE WHEN HITTING A BUMP AT HIGHWAY SPEED. VIOLENT SHAKING DOES NOT STOP UNTIL SPEED IS REDUCED TO UNDER 20 MPH. HAD WHEELS ROTATED AND BALANCED, WHEELS ALIGNED. CHECKED ALL TIE RODS, BALL JOINTS, AND LINKAGE WITH NO NOTICEABLE WEAR. DEATH WOBBLE STILL PRESENT.   *JB",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/21/2006",
        "dateOfIncident": "05/27/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10160402,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "FIRST OFF YOU NEED TO DO A GOOGLE SEARCH FOR 'DEATH WOBBLE'.  I AM NOT THE ONLY ONE WITH THIS PROBLEM.  IT IS GETTING WORSE AND I AM AFRAID FOR MY WIFE TO DRIVE THE JEEP.  \"DEATH WOBBLE\".. THE DEATH WOBBLE IS BASICALLY WHEN YOU ARE DRIVING YOUR JEEP DOWN THE ROAD AND THE FRONT END STARTS TO SHAKE VIOLENTLY. IT CAN HAPPEN AT VIRTUALLY ANY SPEED, THOUGH MOSTLY ABOVE 40 MPH OR SO, AND IS A FRIGHTENING EXPERIENCE, ESPECIALLY FOR THOSE WITNESSING IT FOR THE FIRST TIME. THE ONLY WAY TO STOP IT IS TO SLOW DOWN AND PULL OVER. IT SEEMS TO GET MORE AND MORE OUT OF CONTROL. OUR JEEP IS A 2004 WRANGLER WITH ONLY 17,000 MILES.  WE HAVE HAD THE PROBLEM SINCE 5,000 MILES OR SO.    JEEP NEEDS TO ADDRESS THIS PROBLEM.  *NM",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "06/16/2006",
        "dateOfIncident": "06/16/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10160008,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE TRAVELING 50 MPH A CAR CUT IN FRONT OF THE VEHICLE, THE DRIVER TURNED THE WHEEL SLIGHTLY AND LOST CONTROL OF THE VEHICLE, THEN STRUCK A GUARD RAIL.  THE DRIVER SUSTAINED MINOR INJURIES AND THERE WAS A POLICE REPORT FILED AT THE SCENE.  THE VEHICLE WAS TOWED TO AN INDEPENDENT REPAIR SHOP, WHERE IT WAS DETERMINED THE STEERING GEAR SHEERED AND FRACTURED.  THE STEERING GEAR NEEDS TO BE REPLACED.",
        "vin": "1J4FA39S64P"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/09/2006",
        "dateOfIncident": "06/01/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10159425,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2004 JEEP WRANGLER SPORT, RECENTLY I WAS DRIVING AT 45 TO 50 MPH AND THE FRONT END STARTED TO SHAKE SO HARD I THOUGHT I WAS GOING TO LOSE CONTROL, WHEN I CALLED JEEP THEY SAID BRING IT IN AND WE WILL CHARGE YOU TO LOOK AT IT SHOP TIME WHERE I LIVE IS AROUND 100.00 AN HOUR, SINCE THE WARRANTY IS UP THEY REALLY DON'T WANT TO DO ANYTHING FOR ME EXCEPT CHARGE ME TO LOOK AT IT. I AM SURE THEY WILL NEVER ADMIT TO IT HAVING A PROBLEM. I REPLACED THE STEERING STABILIZER AND ITS STILL DOING IT. I AM NOT SURE WHERE TO GO FROM HERE. ANYONE ELSE OUT THERE HAVING THE SAME PROBLEM?  MAYBE IF THERE IS ENOUGH COMPLAINTS THEY WILL RECALL IT HOPEFULLY BEFORE SOMEONE GETS KILLED. ALL I WANT TO DO IS SELL IT NOW AND GET SOMETHING NOT MADE BY CHRYSLER. *JB",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/08/2006",
        "dateOfIncident": "05/18/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10159363,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I CURRENTLY OWN A JEEP GRAND CHEROKEE 2004, AT AROUND 12,000 MILES WHEEL STARTED SHAKING UNCONTROLLABLE. TOOK IT TO DEALER AND WAS TOLD ROTORS HAD TO BE REPLACED.  THEY DID IT FOR FREE AND TOLD ME NEXT TIME THEY ARE NOT COVERED. IT IS NOW 29,000 MILES AND SAME THING IS HAPPENING AGAIN I NEVER HEARD OF SUCH A THING. I OWNED MANY CARS IN MY LIFE AND NEVER ONCE WENT THROUGH ROTORS ON ANY OF THEM. IF CHRYSLER KNOWS OF PROBLEM WHY WONT THEY ADDRESS IT.  *NM",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/29/2006",
        "dateOfIncident": "04/18/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10158490,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2004 JEEP GRAND CHEROKEE AFTER 30,000 MILES HAS DEVELOPED WHAT IS KNOWN AS \"WARPED ROTORS\" THERE IS A PULSATION WHEN APPLYING THE BRAKE PEDAL AT HIGH SPEEDS. THIS HAS BECOME EVEN WORSE. IT SEEMS THAT THESE ROTORS KEEPS GOING BAD FOR THE JEEP CHEROKEE. THE GOVERNMENT SHOULD ISSUE A RECALL ON THE FRONT ROTORS OF ALL CHEROKEES FROM 1999 TO 2004. MY WIFE USES THE CAR EVERYDAY TO TAKE OUR TWO SMALL CHILDREN TO SCHOOL. SHE IS AFRAID TO DRIVE THE CAR NOW.   DEALER SAYS THERE IS NOTHING THEY CAN DO. I AM SUPPOSED TO PAY FOR A NEW SETS OF ROTORS BUT THE REAL PROBLEM IS THE MATERIAL THAT WAS USED TO MAKE THE ORIGINAL ROTORS.  *NM",
        "vin": "1J4GW48SX4C"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/19/2006",
        "dateOfIncident": "03/10/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10155653,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BREAK PEDDLE BEGAN TO VIOLENTLY VIBRATE WHEN I WOULD BREAK.  I TOOK MY JEEP TO THE DEALER WHERE I BOUGHT IT AND WAS TOLD MY ROTORS WERE WARPED.  THEY SAID IT WAS BECAUSE OF THE WAY I DROVE THE CAR.  I AM 36 YEARS OLD AND DO NOT GO \"OFF-ROADING\".  I HAVE NEVER HAD TO REPLACE THE ROTORS ON ANY CAR!  THIS CAR IS LESS THAN 2 YEARS OLD.  *NM",
        "vin": "1J4FA39S24P"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/15/2006",
        "dateOfIncident": "03/05/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10152824,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY 2004 JEEP LIBERTY WHEN MY BALL JOINT BROKE ON PASSENGER SIDE. I TOOK IT INTO DEALERSHIP AND THEY SAID THE OTHER SIDE HAD TO BE REPLACED ALSO,IT WAS AT MAXIMUM TOLERANCE. I'M VERY CONCERNED FOR OTHERS THAT HAVE THIS VEHICLE BECAUSE I WAS LUCKY THAT MY GRANDCHILD AND I WEREN'T KILLED.  *JB",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "02/21/2006",
        "dateOfIncident": "01/20/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10150744,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "ON TWO OCCASIONS, I HAVE REAR-ENDED SOMEONE DUE TO WHAT I BELIEVE IS A FAULTY DESIGN IN THE POSITION OF THE BRAKE PEDAL IN RELATIONSHIP TO THE ACCELERATOR PEDAL IN MY 2004 JEEP WRANGLER UNLIMITED. IN INSTANCES WHERE I HAD TO STOP SUDDENLY THEREFORE APPLYING EXTREME PRESSURE TO THE BRAKE PEDAL, THE BRAKE PEDAL DESCENDED BELOW THE ACCELERATOR AND THE RIGHT SIDE OF MY FOOT CAME IN CONTACT WITH THE ACCELERATOR CAUSING THE ACCELERATOR TO BE DEPRESSED AT THE SAME TIME. I WOULD HAVE HAD ADEQUATE STOPPING DISTANCE IN BOTH INSTANCES HAD THE ACCELERATOR NOT CAUSED ME TO BE PUSHED INTO THE CAR IN FRONT OF ME.  *JB",
        "vin": "1J4FA49S54P"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/08/2006",
        "dateOfIncident": "12/18/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10149831,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION FAILS TO DOWN SHIFT BETWEEN 45 AND 55 MPH.  SOUNDS LIKE BALL BEARINGS IN A TIN CAN.  THIS HAPPENS ON A LONG GRADE INCLINE AND TRANSMISSION WILL NOT DOWN SHIFT UNLESS THE ACCELERATOR IS PUNCHED TO THE FLOOR.  TAKEN TO TWO DIFFERENT DEALERS OVER MANY MONTHS, BOTH WERE UNABLE TO CORRECT THE PROBLEM. SOUNDS SIMILAR TO ODI CASE # 10105648 & 10072841. *JB",
        "vin": "1J4FA39S94P"
    },
    {
        "components": "VISIBILITY,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "01/29/2006",
        "dateOfIncident": "01/29/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10148937,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2004 JEEP WRANGLER AND THERE ARE SEVERAL PROBLEMS  BUT THE WORST IS THAT NEITHER  FRONT BELTS WILL RETRACT FAST ENOUGH TO PREVENT EITHER DOOR FROM SLAMMING ON THE SHOULDER PORTION. I FEAR THAT AFTER REPEATED DOOR CLOSING ON THE BELTS WILL WEAKEN THEM TO THE POINT OF BREAKING DURING AN IMPACT. THE SECONDARY PROBLEM  IS THE FRONT WINDSHIELD IS CRACKING IN 2 PLACES.*AK",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,TIRES",
        "crash": false,
        "dateComplaintFiled": "01/24/2006",
        "dateOfIncident": "08/20/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10148471,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "WRANGLER AT",
                "productYear": "9999",
                "size": "LT255/85R16",
                "type": "Tire"
            }
        ],
        "summary": "PROBLEM NO. 1:  MY 2004 JEEP WRANGLER UNLIMITED HAS HAD A STEERING AND WHEEL VIBRATION PROBLEM SINCE I PURCHASED IT BRAND NEW IT IN JULY 2004 FROM PARRISH JEEP IN FAIRFAX, VA.  THE PROBLEM CONTINUES TO GET WORST.  THE WHEELS AND STEERING VIBRATE ABRUPTLY BETWEEN 45 - 60 MILES MPH.  I HAVE TO HOLD THE STEERING WHEEL WITH 2 HANDS TO ATTEMPT TO SAFELY DRIVE MY JEEP.  AS OF AUGUST 2004, I HAVE TAKEN IT TO 2 VIRGINIA JEEP DEALERSHIPS FOR THE VIBRATION PROBLEM ON SEVERAL OCCASIONS, IN WHICH THE PROBLEM WAS WITNESSED AND NOTED.  ALTHOUGH THE PROBLEM WAS WITNESSED BY THE JEEP DEALERSHIP, I WAS TOLD I HAD TO PROVIDE PROOF OF MY VEHICLE SERVICES, WHICH I DID.  PARRISH JEEP HAS COPIES OF ALL OF THEM.  AFTER CONTACTING JEEP CUSTOMER SERVICE, WHICH JUST TOLD ME TO CONTINUE TO CALL THE DEALERSHIP, I WAS FINALLY TOLD IN DECEMBER 2005 BY THE DEALERSHIP THAT I HAD TO BRING MY JEEP IN TO THE DEALERSHIP AGAIN FOR A JEEP ENGINEER TO TEST DRIVE AND DIAGNOSE.  THE SERVICE MANAGER INFORMED ME THAT HE BELIEVED THE TIRES TO BE FAULTY, BUT NOW THEY WERE CONCERNED ABOUT THE MILEAGE ON MY JEEP.  I REMINDED HIM THAT THE RECEIPTS SHOW THAT I HAVE COMPLAINED OF THIS PROBLEM WHEN I INITIALLY BROUGHT THE VEHICLE NEW IN 2004.  SO, NOW I HAVE BEEN WAITING OVER ONE MONTH FOR A CALL TO HAVE THE JEEP ENGINEER REVIEW THE PROBLEM.   THIS IS MY 3RD JEEP THAT I HAVE OWNED, IN ADDITION TO THE 2 THAT MY FAMILY MEMBERS HAVE OWNED BECAUSE OF MY RECOMMENDATION, AND I HAVE NEVER HAD THIS PROBLEM BEFORE.  THIS MAY BE MY AND MY FAMILY MEMBERS' LAST TIME TO BUY JEEP PRODUCTS DUE TO SAFETY AND LACK OF CUSTOMER SERVICE.  PROBLEM NO. 2:  THE TRANSMISSION JERKS AS I COME TO A STOP.  THIS JERKING HAPPENS AFTER I HAVE DRIVEN THE VEHICLE AND IT HAS WARMED UP.  THIS PROBLEM WAS NOTED AS OF THE SUMMER 2005.  I HAVE TAKEN IT IN TO THE SAME 2 VA DEALERSHIPS, BUT THE PROBLEM HAS NOT BEEN RESOLVED.  THE COMPUTER WAS CHECKED AND I WAS TOLD THAT ALL UPDATES HAD BEEN MADE.  HOWEVER, THE JERKING IS STILL PERSISTED.*AK",
        "vin": "1J4FA49S14P"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/20/2006",
        "dateOfIncident": "06/09/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10148246,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WARPED FRONT DISC BRAKES AT 15790 MILES.   *NM",
        "vin": "1J4GW48S74C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/14/2005",
        "dateOfIncident": "03/13/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10145183,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 JEEP WRANGLER SPORT WITH 4.0 I-6 ENGINE.  WOULD STALL AFTER COMPLETE WARM UP WHILE IDLING IN GEAR.  DEALER INSTALLED HEAT SHIELD OVER FUEL INJECTOR, BUT STILL HAVE STALLING PROBLEMS ON COLD START.  NO LIGHTS OR ANYTHING COME ON.  ONLY HAD 400 MILES ON IT WHEN FIRST OCCURRED.  NOW, AT 16000 MILES, I'M HAVING STALLING ON COLD STARTS IN WARM WEATHER ONLY.  IN THE WINTER, THE VEHICLE RUNS GREAT.  DEALER CANNOT RECREATE THE PROBLEM, AND DO NOT KNOW WHAT TO DO.*JB",
        "vin": "1J4FA49S24P"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "11/15/2005",
        "dateOfIncident": "11/14/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10142688,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "WRANGLER SRA",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "2004 JEEP LIBERTY, GOODYEAR SR-A WRANGLER TIRE. FAILURE. APPEARS TO BE TIRE SEPARATION WITH MAJOR SECTION OF TREAD COMING OFF. BEFORE COMPLETELY SEPARATING, TIRE SECTION \"BEAT\" WIRING LOOSE FROM REAR END OF CAR CAUSING ELECTRICAL SHORT TO DASHBOARD, REAR SIGNALS. TIRE CURRENTLY AT LOCAL GOODYEAR DEALER FOR REPLACE.  *JB",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/21/2005",
        "dateOfIncident": "10/18/2005",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10140424,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE IS A 2004 JEEP WRANGLER 4X4 PURCHASED 12/04.  DEBRIS ACCUMULATED UNDER THE SKID PLATE, APPARENTLY IGNITED BY EXHAUST SYSTEM.  I SMELLED AND SAW SMOKE AND HAD A FIRE EXTINGUISHER WHICH I USED TO PUT OUT THE FIRE.  ENGINE WIRING HARNESS DAMAGED BY THE FIRE, REPAIRS ABOUT $2,000.   SKID PLATE DESIGN ALLOWS DEBRIS TO COME IN FRONT OF SKID PLATE  BUT NOT BE BLOWN OUT THE BACK OR BOTTOM.  I BOUGHT THE JEEP IN PART FOR ITS OFFROAD CAPABILITIES, BUT AM AFRAID TO USE IT NOW.  *NM",
        "vin": "1FTRF17263N"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/29/2005",
        "dateOfIncident": "03/09/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10138158,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE CONTACT STATED CAR SHUT DOWN AT SLOW SPEEDS.  HE OWNS A 2004 JEEP WRANGLER UNLIMITED. HAS BEEN HAVING THIS PROBLEM SINCE 3-05.  THERE WERE  4,000 MILES ON THE CAR WHEN IT FIRST  SHUT DOWN.  THE CAR DID  NOT MAKE ANY NOISE BEFORE THIS HAPPENED.  NO LIGHTS CAME ON.  THE DEALERSHIP COULD DUPLICATE THE PROBLEM. THE DEALERSHIP HAS TALKED TO THE MANUFACTURER. THE DEALERSHIP PUT A BRAND NEW COMPUTER AND A NEW THROTTLE BODY, BUT THE PROBLEM RECURRED. *AK",
        "vin": "1J4FA49S04P"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/29/2005",
        "dateOfIncident": "07/22/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10138178,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THE CONSUMER OWNS A  2004 JEEP WRANGLER X.  THE SAFETY DEFECT WAS WITH THE STICK SHIFT AND WHEN IDLING THROUGH TOWN IN SECOND  OR THIRD GEAR THE ENGINE SPEED WOULD DROPS.  THE CONSUMER DID NOT FLOOR THE VEHICLE BACK TO IDLE SPEED.  THE VEHICLE  WAS TAKEN TO DEALER,  AND THE DEALER REPLACED THE THROTTLE POSITION SENSOR.  THE CONSUMER HAD TAKEN THE VEHICLE BACK TO THE DEALER FOR A SECOND TIME AND THE DEALER TOLD HIM TO DRIVE IT FAST AND MAYBE IT WILL FIX ITSELF.  ALSO THE CONSUMER CONTACTED THE MANUFACTURER, AND WAS TOLD TO  FILE A SAFETY COMPLAINT WITH NHTSA.  *AK  (12/05/05)  *SC",
        "vin": "1J4FA39S04P"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/17/2005",
        "dateOfIncident": "07/10/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10136837,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WILL ENTER INTO A VIOLENT WOBBLE AND SHAKE WHEN HITTING A BUMP AT HIGHWAY SPEED. VIOLENT SHAKING DOES NOT STOP UNTIL SPEED IS REDUCED TO UNDER 15 MPH. *JB",
        "vin": "1J4FA39S74P"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/22/2005",
        "dateOfIncident": "07/01/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10130246,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 JEEP WRANGLER'S FRONT BRAKE ROTORS WARPED.*MR  *NM",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/06/2005",
        "dateOfIncident": "06/30/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10127639,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRYING TO USE THE AC ON MY 2004 JEEP WRANGLER , IT WAS OVERHEATING. I TOOK TO A DEALERSHIP SERVICE DEPT.THEY SAID IT WAS THE CLUTCH FAN.REPLACED UNDER WARRANTY AND TOLD ME IT WORKED FINE AFTER BEING TEST DRIVEN AND VERIFIED.  I DROVE THE NEXT DAY,COULD NOT USE THE AIR  BECAUSE AS SOON AS THE MOTOR WARMED UP IT OVERHEATED TO 260. I SHUT IT DOWN AND HAD IT TOWED BACK TO SAME DEALERSHIP(3RD TIME). TOLD THEM TO CHECK THERMOSTAT WATERPUMP ETCC.. EXPLAINED THAT I CAN'T EVEN DRIVE IT NOW FOR OVERHEATING. THREE AND HALF HOURS LATER THEY SAID IT IS A RADIATOR RESTRICTION AND I AM 32 ND ON A LIST BECAUSE APPARENTLY THERE HAS BEEN QUITE A PROBLEM WITH THE RADIATOR ON THE JEEP WRANGLER BUT NO RECALLS. THEY ALSO SAY  THEY DON'T KNOW IF IT IS COVERED UNDER  WARRANTY. I HAVE HAD IT LESS THAN A YEAR AND ONLY HAS 24000 MILES ON IT. THE WARRANTY IS 3/YR/36000 I BELIEVE. AM CHECKING ON HTIS. HAS ANYONE ELSE REPORTED THIS PROBLEM?",
        "vin": "1J4F449S04P"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/23/2005",
        "dateOfIncident": "06/21/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10126307,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER HITTING A BUMP, (POT HOLE, DIP, ETC) WITH THE LEFT FRONT WHEEL THE VEHICLE BEGINS TO SHAKE VIOLENTLY.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,PARKING BRAKE,POWER TRAIN,VISIBILITY,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "05/08/2005",
        "dateOfIncident": "12/11/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10120194,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I DRIVING MY JEEP AND WAS HIT ON THE DRIVERS SIDE BY A MERCEDES THAT WAS MOVING 35MPH. I WATCH THE WHOLE SCENE COMING THROUGH MY FRONT SOFT TOP GLASS WINDOW. MY FACE HIT THE SOFT TOP WINDOW AND BROKE MY NOSE PRETTY BAD ACCORDING TO DR. CHARLES SHAFFER (MY SURGIEON). BY THE WAY THE SOFT TOP AND UPPER DOOR HALFS WERE THE FACTORY EQUIPPED \"WILLY'S EDITION\" MODEL SPECIFIC WHICH ARE SUPPLIED TO DAILMER CHRYSLER BY HERTZ. BLOOD WAS EVERYWHERE AND TOOK 3 HOURS TO COMPLETELY STOP THE BLEEDING. I WAS WEARING MY SEAT BELT BY THE WAY. I HAD TO HAVE SURGERY TO MY NOSE AND SEVERAL FOLLOW UP SESSIONS. I FEEL VERY LUCKY THAT IT WAS A MERCEDES THAT HIT ME BECAUSE THEY ARE ABLE TO CRUSH VERY WELL. HIS VEHICLE WAS TOTALED AND HAD NECK PAIN AND I DROVE HOME WITH A BROKE NOSE, BENT REAR AXLE SHAFT (BEND WAS OUTSIDE OF THE AXLE BEARING, WHICH MAKES ONE OF MY REAR BRAKES USELESS), DAMAGED FACTORY ROCKER PANEL (WILLY'S EDITION MODEL SPECIFIC), DAMAGED BODY, REAR FENDER FLARE, I ALSO HAD TO STRAIGHTEN AND REWELD THE BODY MOUNT THAT TORE OFF THE FRAME( THERE ARE 3 BODY MOUNTING POINTS THAT ARE CLEARLY VISIBLE BETWEEN THE 2 DRIVERS SIDE WHEELS, THE MOUNT CLOSEST TO THE REAR TIRE WAS TORN OFF THE FRAME)    PLEASE CONTACT ME IF YOU WOULD LIKE TO ASK ME MORE QUESTIONS AT (704) 506-4592.",
        "vin": "1J4FA39S14P"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/20/2005",
        "dateOfIncident": "04/15/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10118979,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT APPROXIMATELY 70 MPH THE CLOTH TOP CAME OFF  THE VEHICLE. OWNER HAD TO HOLD IT DOWN WITH HIS HAND. OWNER CONTACTED THE MANUFACTURER, AND WAS TOLD THAT THIS DEFECT DID NOT FALL UNDER THE WARRANTY.  *AK",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "03/08/2005",
        "dateOfIncident": "05/05/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10112744,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2004 JEEP WRANGLER.  TWO WEEKS AFTER PURCHASING THE JEEP I NOTICED AIR COMING IN THROUGH THE REAR WINDOW.  WHILE DRIVING THE BACK WINDOW ON THE HARDTOP WILL POP OPEN, ENOUGH TO LET AIR, WATER, AND OTHER DEBRIS INTO THE VEHICLE.  THE WINDOW WILL OPEN UNTIL IT TOUCHES THE SPARE TIRE, THEREFORE PROHIBITING THE USE OF THE REAR WINDSHIELD WIPER.  MY CONCERN IS EXHAUST ENTERING THE REAR OF THE VEHICLE AND HARMING OCCUPANTS.  I HAVE TAKE IT TO THE DEALER NUMEROUS TIME THROUGHOUT THIS PAST YEAR (TO ENCOUNTER RUDE AND UNKNOWLEDGEABLE SERVICE MEN) ONLY FOR THEM TO TELL ME THEY DO NOT KNOW HOW TO FIX IT AND IT CANT BE FIXED.  THIS PAST WEEK THE SAID THEY FIXED IT, HOWEVER THE PROBLEM STILL OCCURS.*AK",
        "vin": ""
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "01/22/2005",
        "dateOfIncident": "03/09/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10107716,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "FAILURE OF SEAT BELT RETRACTORS . SEAT BELT CATCHES ON DOOR LATCH CAUSING DAMAGE TO SEAT BELT. DEALER REPLACED DRIVERS SIDE. PROBLEM APPEARED AGAIN ON BOTH SEATS.  RETURNED TO DEALER AND WAS TOLD THEY COULD NOT HELP. THE WEB OF THE SEAT BELTS HAVE HOLES IN THEM FROM BEING PINCHED IN DOOR. WHEN WILL THEY FAIL?",
        "vin": "1J4FA39S54P"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/21/2005",
        "dateOfIncident": "04/08/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10107655,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "JUST STARTED WITH POWER LOSS FROM SHOW ROOM FLOOR,CAM REPLACED LIFTERS REPLACED BREAKS STICKING TO THE POINT WHERE THE JEEP IS HARD TO MOVE SAYS IT IS BECAUSE OF RUST USED DAYLY,TIMING OUT 15 DEGREES FRONT AND REAR DIF LEAKING WITH METAL SHAVINGS INSIDE MECHANIC SAYS DANA PROBLEM GRINDING RIGHT FRONT AXEL NOISE.    *NM",
        "vin": "1J4FA39S34P"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/03/2005",
        "dateOfIncident": "01/02/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10105648,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MOTOR RATTLES FROM 42MPH TO 60MPH IN 4L I-6 AUTOMATIC TRANSMISSION IN OD. WITH O/D OFF, IT RATTLES FROM 35 TO 45MPH.*AK",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,STRUCTURE,SEATS",
        "crash": false,
        "dateComplaintFiled": "12/04/2004",
        "dateOfIncident": "04/12/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10102148,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT BRAKE VIBRATE VIOLENTLY,AND HAVE BEEN CHANGED 4 TIMES WITHIN THE 1.5 YRS I HAVE OWNED THE TRUCK. MY DRIVERS SEAT FRAME IS CRACKED (THE METAL FRAME) I USE A PILLOW TO KEEP IT STREIGHT BECAUSE IT LEANS TO THEE LEFT DUE TO THE WELD CRACK IN THE FRAME. I HAVE GOTTEN NO WHERE WITH 2 DIFFERENT DEALERSHIPS AND SHELLED OUT WELL OVER 2.000 DOLLARS ON ROTORS AND BRAKES. THE REAR BRAKES HARDLRY WORK ALSO I CAN PULL I=THE EMERGENCY BRAKE AND THE TRUCK WILL NOT EVEN SLOW DOWN THE FRONTS DO ALL THE WORK AND IT HAS BEEN IN FOR BRAKE REPAIRS BY SEVERAL DIFFERENT SHOPS. THERE MUST BE A RECALL BECAUSE THIE IS A SEVERE DANGER AND IS GOING TO REALLY CAUSE A PROBLEM OR WORSE DEATHS.*AK",
        "vin": "1J4GW58N0YC"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/03/2004",
        "dateOfIncident": "06/01/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10102110,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "HARD STARTING AND STALLING.  THE VEHICLE WILL CRANK AND CRANK AND WILL START SOMETIMES OR YOU MUST TURN THE KEY OFF AND TRY TO RESTART, AND WILL START THE SECOND TIME, BUT USUALLY RUNS POORLY FOR A FEW SECONDS.  WILL SOMETIMES STALL WHEN PUTTIN INTO GEAR.  DEALER HAS CHANGED FUEL PUMP AND PUT A SHIELD OVER ONE OF THE FUEL INJECTORS.  STILL HAVING THE HARD STARTING PROBLEM.*AK",
        "vin": "1J4FA69S74P"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "11/28/2004",
        "dateOfIncident": "12/20/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10100631,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDSHIELD-2004 JEEP LIBERTY WITHIN A MONTH OF BUYING THERE WAS LITTLE CHIPS ALL OVER WINDSHIELD SPOKE WITH DEALERSHIP (NOTHING THEY WOULD DO)  THIS VEHICLE HAS ONLY BEEN DRIVEN IN TOWN AND ON HIGHWAY.  THIS IS RIDICULOUS FOR A 24,000 DOLLAR VEHICLE.*AK",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": true,
        "dateComplaintFiled": "11/09/2004",
        "dateOfIncident": "11/01/2004",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10101458,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE CAUGHT ON FIRE.  *NM  THE CONSUMER WAS HIT ON THE PASSENGER SIDE DOOR CAUSING THE OTHER DRIVERS BUMPER TO WEDGE INTO THE CONSUMERS GAS TANK.  THE BACK DOOR OF THE CONSUMERS JEEP WAS TORN OFF ALONG WITH THE SPARE TIRE.  THE CONSUMERS JEEP DID NOT STOP UNTIL IT FLIPPED OVER.  THE CONSUMER STATED THAT THE STURDY JEEP SAVED HER LIFE.  THE CONSUMER PURCHASED THE SAME VEHICLE AND THE GAS TANK BLEW UP.  THE CONSUMER SON BARELY ESCAPED DUE TO THE FLAMABLE SEATS.  THE JEEP BURNED TO THE GROUND.  *TC",
        "vin": ""
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "10/27/2004",
        "dateOfIncident": "10/08/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10096532,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "SEAT BELT FAILURE DUE TO RETRACTOR DEFECT. THE RETRACTOR DOES NOT RETURN THE BELTS WHICH ALLOWS THEM TO CATCH IN THE DOOR LATCH AND FRAY AND RIP. WHEN SUBMITTED TO DAMLIER CHRYSLER THE REPLY WAS THAT THEY DID NOT HAVE ENOUGH INFORMATION TO PROPERLY DIAGNOSE.*AK",
        "vin": "1J4FA39S24P"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/13/2004",
        "dateOfIncident": "10/01/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10095695,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A NEW 2004 JEEP WRANGLER SPORT ON SEPT 30,2004. ON OCT 1, 2004 I DISCOVERED DEFECTIVE PAINT ON THE LEFT FRONT FENDER NEAR THE ENGINE COMPARTMENT(APPEARS TO BE A CHEMICAL CONTAMINANT AS WELL AS GRAZING OF THE BASE COAT), DENT ON THE UNDERSIDE OF THE RIGHT HAND PASSENGER DOOR, WELDING SPLATTERS ON THE RIGHT FRONT FENDER, DENTS ON THE INSIDE OF THE RIGHT FRONT FENDER, RIGHT FRONT FENDER IS WARPED. ALL BODY DAMAGE APPEARS TO HAVE BEEN PRE-DELIVERY. DEALER SERVICE PERSONNEL TOLD ME TO IGNORE THE PAINT DAMAGE.  I DONT UNDERSTAND HOW THE VEHICLE LEFT THE FACTORY IN THIS CONDITION. IAM DISGUSTED AND DEPRESSED AFTER SPENDING $26,000 DOLLARS ON THIS JEEP. IAM A U.S. NAVY VETERAN, AVIATION STRUCTURAL MECHANIC. *AK",
        "vin": "1J4FA49S34P"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/19/2004",
        "dateOfIncident": "07/19/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10083511,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 70 MPH THE ENGINE STALLED WITHOUT WARNING. AS A RESULT THE VEHICLE LOST ALL POWER.   *JB   THE FAILURES CAUSED THE CONSUMER TO PULL OFF OF THE HIGHWAY WITHOUT THE USE OF POWER STEERING.   *SC  *JB",
        "vin": "1J4FA29184P"
    },
    {
        "components": "ELECTRICAL SYSTEM,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "06/03/2004",
        "dateOfIncident": "05/27/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10074755,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "type": "Child Seat"
            }
        ],
        "summary": "I OWN A 2004 JEEP WRANGLER WITH A 4.0 I-6 ENGINE. WITHIN THE PAST 2 WEEKS, THE VEHICLE HAS STALLED ON THE HIGHWAY 3 DIFFERENT TIMES. THE FOLLOWING APPLIES TO ALL 3 INCIDENTS... ONCE I GOT THE VEHICLE OVER TO THE SHOULDER AND STOPPED, THE ENGINE WOULD NOT RESTART. THE VEHICLE WAS TOWED TO A DEALER WHERE THE CRANKSHAFT POSITION SENSOR WAS DIAGNOSED AS FAULTY AND THUS REPLACED.  THE CRANKSHAFT POSITION SENSOR WAS REPLACED THREE TIMES. ALL 3 INCIDENTS OF FAILURE HAVE OCCURRED AT HIGHWAY SPEEDS. THIS RAISES MY SAFETY CONCERN SINCE I CAN NOT ACCELERATE AND SAFELY PULL TO THE SHOULDER, ESPECIALLY WHEN THE SURROUNDING VEHICLES ARE AT HIGHWAY SPEEDS. THE INCIDENT DATE POSTED WAS THE DATE OF THE THIRD AND MOST RECENT INCIDENT THE SECOND INCIDENT OCCURRED ON MAY 23, 2004 AND THE FIRST INCIDENT OCCURRED ON MAY 18, 2004.  *JB",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/20/2004",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10074001,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE WERE GAS FUMES COMING INTO THE VEHICLE THROUGH THE VENTS DUE TO  A LEAK IN THE GAS LINE.  IT WAS REPAIRED.  HOWEVER, THE PROBLEM RECURRED. DEALER COULD NOT RESOLVE THE PROBLEM.  *AK",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/19/2004",
        "dateOfIncident": "05/16/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10072841,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MOTOR RATTLES GOING FROM 3RD TO 4TH IN THE 4L AUTOMATIC ENGINE.   *AK",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/08/2004",
        "dateOfIncident": "05/03/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10068490,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "LEAKING TRANSMISSDIONTRANSFERE CASE. DEALER HAS TRYED TO FIX WITHOUT SUCCESS. BRAND NEW RUBICON LESS THAN 2500 MILES ON IT AND LEAKING BAD.DEALER HAS TRYED TO REPLACE SEALS WITHOUT ANY SUCCESS.NOW THEY SAY ITS A MANUFACTORES DEFECT.*AK",
        "vin": "1J4FA69SX4P"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/29/2004",
        "dateOfIncident": "04/08/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10066814,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT 30 MPH VEHICLE HIT A TREE HEAD ON. UPON IMPACT,  FRONTAL AIR BAGS FAILED TO DEPLOY.  CONSUMER HIT THE STEERING  WHEEL, AND SUSTAINED A CUT AND BRUISES ABOVE  RIGHT EYE. *AK  *LA",
        "vin": "1J4FA49S14P"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "04/26/2004",
        "dateOfIncident": "04/25/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10067837,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "GOT IN VEHICLE. PUT RIGHT FOOT ON BRAKE, PUT CAR IN DRIVE, TOOK MY FOOT OFF BRAKE AND THEN IMMEDIATELY REAPPLIED IT AS CAR PULLED IN FRONT OF ME.  WRANGLER BEGAN CREEPING FORWARD AND I APPLIED MORE PEDAL PRESSURE ONLY TO FIND THE VEHICLE ACCELERATING HARDER.  HIT CAR IN FRONT OF ME.  THOUGHT I HAD MY RIGHT FOOT ON BRAKE WHEN IN FACT, MOST OF MY RIGHT FOOT WAS ON THE ACCELERATOR.  WHY ARE THESE PEDALS SO CLOSE?  I'M NORMALLY A LEFT FOOT BRAKER SO THIS ISN'T A BIG ISSUE, BUT IN THE CASE, I USED MY RIGHT FOOT AND ENDED UP HAVING MY RIGHT FOOT ON BOTH PEDALS.  VERY POOR DESIGN AND DANGEROUS, IN MY OPINION.*AK",
        "vin": "1J4FA69S84P"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/06/2004",
        "dateOfIncident": "04/06/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10065661,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "RIGHT FRONT BRAKES SEIZED ON MY WAY HOME.  *LA",
        "vin": "1J4FA69S34P"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/04/2004",
        "dateOfIncident": "03/18/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10064503,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "LEFT FRONT AXLE SEAL LEAK.   *NM",
        "vin": "1J4FA69S34P"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/04/2004",
        "dateOfIncident": "04/03/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10064504,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "OIL LEAK FROM ENGINE/TRANSMISSION.   *NM",
        "vin": "1J4FA69S34P"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/11/2004",
        "dateOfIncident": "03/03/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10061894,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "NEW 2004 JEEP WRANGLER SE. THE MANUAL TRANSMISSION CLUNKS CLINKS & SOMETIMES GRINDS WHEN UPSHIFTING FROM 1ST TO 2ND AND FROM 2ND TO 3RD GEAR. I WAS NEARLY REARENDED LAST WEEK. I WAS GOING UP A HILL FROM A STOP. WHEN I SHIFTED FROM 2ND TO 3RD GEAR THE SYNCROS STARTED GRINDING. NOT WANTING TO ABUSE MY JEEP, I BACKED OFF TO NEUTRAL AND WAS NEARLY REARENDED BY THE CAR BEHIND ME. I HAVE BEEN TOLD BY THE DEALER AND THE FACTORY REP. THAT THERE IS NOTHING WRONG WITH THE TRANSMISSION. THAT IT IS\"THE NATURE OF THE BEAST\", ALL OF THESE TRANSMISSION ARE A LITTLE NOISY, BUT NOT TO WORRY BECAUSE I HAVE A 7 YEAR,70,000 MILE WARRANTY. WHAT GOOD IS A WARRANTY IF THEY REFUSE TO ADMIT THAT THERE IS A PROBLEM?  *AK",
        "vin": "1J4FA29194P"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/20/2004",
        "dateOfIncident": "01/14/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10055357,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT 25 MPH CONSUMER'S VEHICLE WAS HIT BY ANOTHER VEHICLE ON THE FRONT DRIVERS SIDE. UPON IMPACT, BOTH FRONTAL AIR BAGS DID NOT DEPLOY. DRIVER SUSTAINED MINOR INJURIES.  *AK",
        "vin": ""
    }
]