[
    {
        "components": "SUSPENSION",
        "crash": true,
        "dateComplaintFiled": "07/25/2008",
        "dateOfIncident": "07/06/2008",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10235798,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "OUTBACK",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE PULLING OUR 29 FT. TRAVEL TRAILER NORTH ON HWY 75 NEAR JASPER, FL., WHEN SUDDENLY IT STARTED TO FISHTAIL. WE TRIED TO CONTROL THE SWAYING, BUT IT INCREASED UNTIL THE CAMPER WAS MOVING OUR CAR AND CARRIED US OFF THE ROAD. THE CAMPER COMPLETELY COLLAPSED EVEN THOUGH WE DID NOT ROLL. WE WERE TRAVELING ON A STRAIGHT ROAD AND DID NOT MAKE ANY LANE CHANGES OR SUDDEN MOVES TO START THE SWAYING. IT JUST STARTED AND INCREASED. WE BELIEVE THE AXLE BROKE OR SWAY BAR. THE DESIGN OF THIS CAMPER ADDED TO THE INCREASED SWAY AND PROBABLY LED TO THE COLLAPSING.  *TR",
        "vin": "4YDT28R294G"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/24/2007",
        "dateOfIncident": "09/04/2007",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10204869,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "OUTBACK",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Hankook Tire America Corp.",
                "productMake": "HK",
                "productModel": "S400",
                "productYear": "9999",
                "size": "T115/70D15",
                "type": "Tire"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 KEYSTONE OUTBACK RV. THE TIRE BRAND IS DURO, HWA-FONG RUBBER INDUSTRIAL COMPANY LTD IS THE MANUFACTURER. THE TIRE SIZE WAS T115/70D15.  25RSS IS THE MODEL NUMBER. THE RV DOESN'T HAVE A MOTOR. THE CONTACT OBSERVED THAT THE TREAD IS SEPARATING ON ALL 4 OF HIS TIRES, THE FRONT PASSENGER AND DRIVER AND THE  REAR DRIVER AND  PASSENGER TIRES.  THE ESTIMATED COST TO REPLACE THEM IS $300 PER TIRE. THESE ARE THE ORIGINAL TIRES WHEN THE RV WAS PURCHASED. THE DEALER ADVISED THE OWNER TO SPEAK WITH THE TIRE MANUFACTURER.  THE MANUFACTURER ADVISED HIM TO EMAIL PHOTOS OF THE TIRES AND THEY WOULD COMPENSATE HIM FOR HALF OF THE COST. THE CONTACT WANTS THE MANUFACTURER TO REIMBURSE HIM FOR 4 NEW TIRES, INCLUDING THE SPARE. THE CURRENT APPROXIMATE TIRE MILEAGE WAS 850 AND THE FAILURE MILEAGE WAS 450.  UPDATED 10.09.07. *JB",
        "vin": "4YDT25R214G"
    },
    {
        "components": "SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "05/24/2006",
        "dateOfIncident": "05/19/2006",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10158231,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "OUTBACK",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED AN OUTBACK TRAILER FROM KEYSTONE RV IN 2004 AND IT CURRENTLY HAS 3000 MILES ON IT.   I RECENTLY NOTICED THAT THE TIRES ON THE DRIVER SIDE HAVE STARTED TO CRACK, AND DURING THE TIRE REPLACEMENT THE MECHANIC NOTICED THAT THE HUBS ARE LOOSE ON BOTH AXLES ON THE DRIVER SIDE.  I THEN TOOK THE TRAILER TO GENERAL RV IN MOUNT CLEMENS, MICHIGAN FOR REPAIR AND THEY CONFIRMED THAT THE HUBS ARE BOTH LOOSE DUE TO A LACK OF COTTER PINS THAT HOLD THE CASTLE NUT ON TO THE TRAILER ON BOTH HUBS.  THE HUBS HAVE NEVER BEEN SERVICED BY REMOVAL ONLY BY ADDING GREASE THROUGH THE ZERK FITTINGS.  THE DEALERS MECHANIC COULD NOT FIND ANY INDICATION OF THE COTTER PINS INSIDE THE HUBS.  SO, ONE CAN ONLY ASSUME THAT THEY DID NOT EVER ADD THE COTTER PINS TO THE ASSEMBLY.  THE CASTLE NUT HAD VIBRATED NEARLY OFF THE SPINDLE ON BOTH WHEELS ON THE DRIVER SIDE. THE TRAILER HAS DUAL AXLES FROM AL-KO KOBER CORPORATION.  I TEND TO BELIEVE THAT THIS COULD LEAD TO SERIOUS COMPLICATIONS ON THE ROAD, AND SHOULD BE INVESTIGATED FURTHER.  THANK YOU FOR YOUR TIME JEFFERY K PLAMP.  *JB",
        "vin": "4YDT28R2346"
    }
]