[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/20/2019",
        "dateOfIncident": "04/17/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11202631,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE GOT LOCKED IN HER CAR IN THE GARAGE AT HOME.  THERE IS A SPRING ON THE DOOR LATCH THAT HOLDS UP A LEVER, THAT BROKE, CAUSING THE LEVER TO DROP AND JAM THE LOCK LEVER.    WHEN SHE TRIED TO UNLOCK HER DOOR IT WOULD NOT RELEASE AND THE AUTO LOCK FUNCTION KEPT THE OTHER DOORS LOCKED TOO.  WE WERE ABLE TO USE MY KEY TO QUICKLY UNLOCK AND OPEN THE PASSENGER SIDE DOOR AND GET OUT BY CRAWLING OVER THE CENTER CONSOLE.  A SIMPLE GOOGLE SEARCH FOUND A FEW THOUSAND ENTRIES SHOWING THIS SAME ISSUE WITH OTHER KIA RIOS AND OPTIMAS WHERE PEOPLE ARE GETTING STUCK IN THEIR CARS.",
        "vin": "KNADC125346"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/28/2019",
        "dateOfIncident": "02/28/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183157,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  2004 KIA RIO LOCKS IN CAR BROKEN UNABLE TO UNLOCK AND GET OUT THE CAR I DON'T KNOW IF THERE IS SOMETHING WRONG WITH THE LOCKING SYSTEM AND IT HAS BECOME A MAJOR PROBLEM",
        "vin": "KNADC125994"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/15/2018",
        "dateOfIncident": "01/15/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11062844,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO CINCO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SIDE DOOR LOCK DOES NOT ALWAYS WORK. WHEN LOCKED FROM INSIDE THE CAR YOU HAVE TO CRAWL OUT THE PASSENGER SIDE AND GO AROUND TO DRIVER DOOR, PUT THE KEY IN THE LOCK AND WIGGLE THE INSIDE DOOR LOCK LEVER. SOMETIMES IT TAKES MINUTES TO GET IT TO UNLOCK. IF YOU WERE TO HAVE TO EXIT THE VEHICLE QUICKLY IT WOULD NOT BE POSSIBLE.  THIS HAS HAPPENED MULTIPLE TIME IN THIS CAR.",
        "vin": "KNADC165946"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/22/2016",
        "dateOfIncident": "11/04/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10897541,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 KIA RIO. WHILE DRIVING VARIOUS SPEEDS, THERE WAS AN ABNORMAL NOISE UNDERNEATH THE VEHICLE. THE VEHICLE WAS TAKEN TO MULTIPLE INDEPENDENT MECHANICS AND A DEALER ON NUMEROUS OCCASIONS WHERE IT WAS DIAGNOSED THAT THE FRONT DRIVER SIDE WHEEL BEARING NEEDED TO REPLACED. THE WHEEL BEARING WAS REPLACED MULTIPLE TIMES; HOWEVER, THE FAILURE PERSISTED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "KNADC125846"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/21/2015",
        "dateOfIncident": "05/12/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10750410,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO CINCO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE KIA WAS UNDER WARRANTY AT THIS TIME: IT REQUIRED A NEW TRANSMISSION. I WAS TOLD IT WAS ABOUT TO 'DROP'. DESPITE BEING UNDER WARRANTY, I WAS MADE TO PAY FOR IT. 2007 THE PASSENGER REAR DOOR STOPPED WORKING AND WOULD NOT OPEN.  IN 2008 THE ELECTRICAL WENT. NO INTERIOR LIGHTS, RADIO AND NO 'DOOR AJAR' WARNING.   2008 THE DOOR BEHIND DRIVER WOULD NOT OPEN. 2013 THE DRIVER DOOR WOULD NOT OPEN FOLLOWED BY THE HATCHBACK. RIGHT NOW ONLY 2 DOORS ARE ABLE TO BE LOCKED DUE TO THIS ISSUE.   A NEW CLUTCH WAS PUT IN DURING  2012. THE SHIFTING HAS ALWAYS BEEN A LITTLE STICKY WITH IRREGULAR TIMING.  I PURCHASED THIS CAR BRAND NEW AND CANNOT BELIEVE THE SAFETY ISSUES CONCERNING THE DOORS, ABOVE ALL. I CANNOT BELIEVE THAT I BOUGHT THE ONLY 'LEMON'..OR AM AMONG A FEW KIA RIO CINCO OWNERS FACING THESE PROBLEMS.",
        "vin": "KNADC165046"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/16/2015",
        "dateOfIncident": "03/07/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10725617,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 KIA RIO. WHILE DRIVING APPROXIMATELY 50 MPH, THE WHEEL BEARING AND THE HUB FROM BOTH REAR WHEELS DETACHED. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE WHEEL BEARINGS NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED, BUT THE FAILURE RECURRED. THE CONTACT STATED THAT THE REAR TIRE BEARINGS WERE PREVIOUSLY REPLACED MULTIPLE TIMES. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 163,000.",
        "vin": "KNADC125146"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/20/2014",
        "dateOfIncident": "07/01/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10614790,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO CINCO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "OK, MY CAR MAKES A THUMPING NOISE UNDER THE TIRE, THOUGHT WAS THE WHEEL BEARING IT'S NOT SOMEONE SAID IT WAS THE AXLE I DON'T KNOW ALSO, THE ENGINE LIGHT HAS BEEN ON I CHANGED THE AIR FILTER, I READ THAT SOMEONE ELSE HAD PROBLEMS WITH THE FILTER, I READ THAT THE AXLE RUSTS OUT, I THINK THIS CAR SHOULD BE RECALLED PEOPLE ARE COMPLAINING ABOUT THE SAME PROBLEMS AND KIA SHOULD FIX IT FOR FREE, I DON'T THINK I SHOULD PAY FOR THAT THE CAR DOESN'T GET DRIVEN THAT MUCH AND I CAN'T GO FAR PLACES WITH IT IN FEAR THAT IT MIGHT BREAK DOWN SOMEWHERE, I FEEL LIKE SUING KIA FOR MAKING A CRAPPY CAT THAT DOESN'T LAST.  I'VE NEVER HAD A CAR LIKE THIS BEFORE, THE DOORS ARE BROKEN EVEN THE HATCH WON'T OPEN ANYMORE, WHAT THE [XXX].    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": ""
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "07/10/2014",
        "dateOfIncident": "07/02/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10609586,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 KIA RIO.  THE CONTACT STATED THAT THE DRIVERS SIDE DOOR FAILED TO OPEN WHEN USING THE KEY OR BY MANUALLY PULLING THE LOCK. THE CONTACT MENTIONED THAT IN ORDER TO ENTER THE VEHICLE SHE HAD TO DO SO THROUGH THE FRONT PASSENGERS DOOR. THE MANUFACTURER WAS NOT CONTACTED.  THE VEHICLE WAS NOT REPAIRED.  THE FAILURE AND CURRENT MILEAGE WAS 84,000.",
        "vin": "KNADC125346"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/20/2014",
        "dateOfIncident": "02/19/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10565082,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL-THE CONTACT CT OWNS A 2004 KIA RIO. THE CONTACT STATED THAT THE WINDSHIELD DEFROSTER AND HEATING SYSTEM FAILED. THE CONTACT INSPECTED THE VEHICLE AND FOUND THAT THE WINDSHIELD DEFROSTER AND HEAT BUTTON HAD TO BE HELD IN TO BE ABLE TO HAVE THE WINDSHIELD DEFROST AND HEAT SYSTEM OPERATE.  THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE VIN WAS NOT AVAILABLE.  THE FAILURE AND CURRENT MILEAGE WAS 87,050. LI",
        "vin": ""
    },
    {
        "components": "SUSPENSION,STRUCTURE,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/24/2013",
        "dateOfIncident": "12/19/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10557137,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO CINCO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING WITH MY GIRLFRIEND, HEADED OUT TO DINNER, GOING 15 TO 20 MPH THROUGH TOWN (25 MPH SPEED LIMIT), WHEN SUDDENLY A LOUD CLUNKING NOISE STARTED, COMING FROM PASSENGER SIDE REAR WHEEL.     I PULLED OVER IN A BUSINESS LOT & REMOVED TIRE TO FIND THAT THE REAR AXEL WHERE THE SHOCK ABSORBER CONNECTS TO HAD RUSTED OFF & THE SHOCK ABSORBER SWINGING, DISCONNECTED FROM THE AXEL MOUNT.     I NURSED THE VEHICLE HOME & CHECKED THE DRIVERS SIDE REAR AXLE & FOUND THAT IT TOO WAS READY TO SNAP OFF.     A SLIGHT TAP WITH A HAMMER ON THE AXLE  PRODUCED A HOLE OF ABOUT 1\" A SECOND TAP & IT TOO CAME OFF THE CAR.     I REMOVED BOTH SHOCKS & THE CAR IS NOW NO LONGER SAFE TO DRIVE. SO, IT'S A TOTAL LOSS WHICH IS NOT COVERED UNDER INSURANCE.    I SEE WHERE KIA HAS RECALLED THE 2004 OPTIMA FOR A RUST OUT ISSUE WITH ITS SUBFRAMES. (SC 075 JUNE 2009).    THE RECALL SHOULD ALSO INCLUDE THESE VEHICLES AS WELL.    UPON FURTHER INSPECTION THE REAR BRAKE DRUMS ARE ALSO ROTTING OUT LEAVING A GAP ON TOP WHERE MOISTURE CAN GET TO THE INNER WORKINGS OF THE BRAKES.    THE REAR LATERAL ARM MOUNTING NUT IS NOT IDENTIFIABLE DUE TO EXTREME RUST.    BOTH REAR SPINDLE ASSEMBLIES ARE ALSO ROTTING SO BADLY FROM BEHIND  THAT THE BOLTS USED TO SECURE THEM HAVE NO HEADS JUST RUST.    THE REAR SEAM OF THE GAS TANK IS ALSO ROTTING OUT.    FINALLY THE FRONT SUSPENSION & UNDERBODY ALSO HAS SEVERE RUSTING ISSUES.    THE CAR WAS PURCHASED NEW IN NJ & HAS SPENT IT'S ENTIRE TIME WITH ME AT MY HOME.  AT TIME OF PURCHASE THE DEALERSHIP, SALERNO KIA OF NEWTON , NJ ( NO LONGER IN BUSINESS) \"RUSTPROOFED\" THE UNDERSIDE OF THE CAR WHICH COST ME SEVERAL HUNDRED DOLLARS EXTRA.  *TR",
        "vin": ""
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "11/19/2012",
        "dateOfIncident": "11/18/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10485125,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 KIA RIO. THE CONTACT STATED THAT THE MANUAL DOOR LOCKS ON BOTH THE INTERIOR AND EXTERIOR FRONT DRIVER'S SIDE DOORS WOULD NOT RELEASE. THE CONTACT HAD TO ENTER THE VEHICLE THROUGH THE FRONT PASSENGER SIDE DOOR AND EXIT IN THE SAME MANNER. THE VEHICLE WAS NEITHER DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE PROBLEM. THE APPROXIMATE FAILURE MILEAGE WAS 21,599.",
        "vin": "KNADC165146"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/15/2012",
        "dateOfIncident": "12/18/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10443859,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS PURCHASED USED APPROXIMATELY 2 YEARS AGO. ON THE APPROXIMATE INCIDENT DATE, THE CLUTCH PEDAL FAILED TO ACTUATE THE CLUTCH AFTER PRODUCING A LOUD NOISE. INSPECTION AT A REPAIR FACILITY REVEALED FAILURE IN SEVERAL CLUTCH COMPONENTS AND A METAL FATIGUE FAILURE IN THE CLUTCH AND BRAKE PEDAL SUPPORT BRACKET. I AM FILING THIS COMPLAINT ON BEHALF OF MY DAUGHTER FOR THE FAILED SUPPORT BRACKET, WHICH I HAVE IN MY POSSESSION.",
        "vin": "KNADC125546"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/17/2011",
        "dateOfIncident": "04/27/2011",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10440268,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR CAUGHT ON FIRE, KIA SAYS THEY SENT A NOTIFICATION TO THE ORIGINAL OWNER, YEARS AGO.  WE FEEL THAT WE WERE ENTITLED TO A RECALL NOTICE BEFORE THE CAR BURNED DOWN.  WE FEEL THIS IS NOT A SMALL RECALL, IT WAS A FIRE, A FIRE IS VERY DANGEROUS AND CAN BURN AND KILL PEOPLE.  WE HAD 22 KIAS RIOS IN OUR FLEET AND NEVER RECEIVED RECALL NOTICES ON ANY OF THEM.  KIA DID SEND NOTICES TO THE ORIGINAL OWNER HOWEVER THEY HAD THE INFORMATION AS TO WHICH CARS RECEIVED THE RECOMMENDED REPAIRS AND WHICH CARS NEVER CAME IN, THERE NEEDS TO BE SOME FOLLOW UP.  *TR",
        "vin": "KNADC125346"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/25/2011",
        "dateOfIncident": "04/27/2011",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10421512,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR CAR CAUGHT ON FIRE.  KIA SAYS THAT RECALL NOTICES WERE SENT OUT TO THE PREVIOUS OWNER TO TAKE THE CAR TO A KIA DEALER FOR REPAIRS.  NOTICE WAS SENT OUT YEARS AGO (2002).  KIA KNEW THAT THE REPAIRS WERE NEVER DONE BECAUSE NO DEALERSHIP HAD BILLED KIA FOR REPAIRS.  FOR NINE (9) YEARS THIS CAR WAS ON THE ROAD WITHOUT A SAFETY RECALL BEING PERFORMED FOR FIRE.  FOR NINE YEARS WE REGISTERED THIS CAR AND KIA MADE NO ATTEMPT TO FIND OUT WHO OWNS THE VEHICLE.  KIA IS BEING VERY UNETHICAL BECAUSE THEY SAY THAT A NOTICE WAS SENT OUT (ONE NOTICE) AND NOW THEY HAVE DONE THEIR OBLIGATION.  *TR",
        "vin": "KNADC125346"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/05/2010",
        "dateOfIncident": "11/06/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10369219,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS AT A STOP SIGN AND MY 2004 KIA RIO DIED , I PUSHED IT TO THE MECHANIC AND WAS TOLD THE TIMING BELT LOST ITS TEETH AND THERE IS NOW NO COMPRESSION IN 3 AND 4  , THE MILEAGE ON CAR IS 68040. I WAS TOLD BASICALLY THE ENGINE IS TOAST AND I WASN'T EVEN MOVING ,I WAS TOLD BY A COUPLE OF MECHANICS THAT THE BELT THAT KIA USED IS FAULTY . THE OWNERS MANUAL SAYS REPLACE 60,000 MILES BUT REPLACE IT 105,000 IN CALIFORNIA. HOW WOULD A BELT BE BAD IN 49 STATES EXCEPT CALIFORNIA.  I FOUND  ON AUTO MD .COM NHTSA ACTION #10015272 SERVICE BULLETIN # 289221  REPORT DATING JAN 1 2005 IMPROVED TIMING BELTS FOR 04 RIO AND OPTIMA .  *TR",
        "vin": "KNADC125546"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/13/2010",
        "dateOfIncident": "11/16/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10360357,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 KIA RIO. THE CONTACT WAS DRIVING AT VARIOUS SPEEDS. THE ENGINE COMPLETELY STALLED AND THE ENTIRE ELECTRICAL SYSTEM FAILED WITHOUT WARNING. THE ENGINE WOULD RESTART AFTER WAITING FOR APPROXIMATELY ONE MINUTE. THE FAILURE OCCURRED ON SEVERAL DIFFERENT OCCASIONS. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHERE THEY WERE UNABLE TO LOCATE THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 78,000.",
        "vin": "KNADC125546"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/07/2010",
        "dateOfIncident": "09/01/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10354082,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LEFT LOWER CONTROL ARM CAME LOOSE FROM THE CAR, PULLING THE CV AXLE OUT OF PLACE.  THE LEFT LOWER CONTROL ARM WAS BOLTED BACK INTO PLACE AND THE CV AXLE SHAFT WAS REPAIRED. *TR",
        "vin": "KNADC125546"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/20/2009",
        "dateOfIncident": "06/17/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10281226,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 KIA RIO. WHEN THE CONTACT APPROACHED A  STOP LIGHT, THE VEHICLE BEGAN ACCELERATING AND A NOISE WAS PRESENT IN THE FRONT OF THE VEHICLE. THE TRANSMISSION WAS REPLACED ON THREE OCCASIONS WITHIN THE LAST 1000 MILES. THE DEALER INFORMED THE CONTACT THAT THE TRANSMISSION NEEDED TO BE REPLACED. THE CURRENT MILEAGE WAS 55700 AND THE FAILURE MILEAGE WAS 30000.",
        "vin": "KNADC125446"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/03/2009",
        "dateOfIncident": "02/21/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10260541,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 KIA RIO.  WHILE PULLING UP TO A PARKING LOT AT 20 MPH, THE VEHICLE SUDDENLY STALLED.  THE CONTACT ATTEMPTED TO RESTART THE ENGINE, BUT WAS UNSUCCESSFUL.  SHE WAS NEAR A TIRE SHOP AT THE TIME AND THE MECHANIC STATED THAT THE TIMING BELT FAILED. SHE HAD THE VEHICLE TOWED TO AN AUTO REPAIR SHOP AND WAS INFORMED THAT THE TIMING BELT FAILED AND THE ENGINE VALVES NEEDED TO BE REPLACED.  THE MANUFACTURER STATED THAT SHE WOULD BE RESPONSIBLE FOR THE REPAIRS.  THE VEHICLE IS IN THE PROCESS OF BEING REPAIRED, BUT THE CONTACT BELIEVES THAT THE TIMING BELT SHOULD NOT HAVE FAILED WITHIN FIVE YEARS.  THE VIN WAS UNKNOWN.  THE CURRENT AND FAILURE MILEAGES WERE 80,000.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/18/2008",
        "dateOfIncident": "11/10/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10249072,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2004 KIA RIO.  I HAD NO PROBLEMS WITH THIS VEHICLE TILL THE MONTH OF OCTOBER WHEN IT FAILED INSPECTION FOR EMISSIONS.  I TOOK IT TO THE SHOP AND IT TOOK A WHILE BEFORE THEY FOUND OUT IT WAS A SENSOR.  SO THEN I HAD THE CAR BACK FOR A WEEK AND MY HUSBAND WHO DRIVES THE CAR EVERYDAY WAS DRIVING HOME FROM WORK HEARD A LOUD NOISE AND THE CAR DIED.  COME TO FIND OUT THE TIMING BELT WENT ON THE VEHICLE.  WHICH COME TO FIND OUT YOU ARE SUPPOSE TO CHANGE THESE AT 60,000 ACCORDING TO THEIR BOOK.  WHEN WE BOUGHT THE RIO WE ALSO BOUGHT A KIA SPECTRA.  SO OF COURSE WE TOOK THE SPECTRA IN RIGHT AWAY TO GET A NEW BELT SO WE WOULDN'T HAVE 2 CARS DOWN.  THAT COST 677.00.  I HAD 78,000 ON THE SPECTRA AND THERE WAS 83,000 ON THE RIO.  I INVESTIGATED THIS PROBLEM COME TO FIND OUT ALOT OF PEOPLE HAD THIS PROBLEM SO KIA KNOWS ABOUT IT.  I THEN CHECKED THE TECHNICAL BULLETINS AND FOUND THAT IN JANUARY 0F 2005 THERE WAS A BULLETIN ITEM NUMBER 10015272.  IT SAYS THEY IMPROVED THE TIMING BELTS FOR THE KIA RIO AND OPTIMA.  WELL THEY DIDN'T IMPROVE IT FOR MY CAR.  WHEN THE TIMING BELT WENT IT BLEW THE ENGINE.  WE ARE SO MADE AND WHEN WE TOOK MY SPECTRA IN TO BE DONE AND TOLD THEM WHAT HAPPENED TO THE RIO THEY SAID THAT'S TO BAD.  WE NOW HAVE OUR CAR AT ANOTHER GARAGE AND ARE TRYING TO GET KIA TO PAY FOR ANOTHER ENGINE.  WHAT DO YOU THINK MY CHANCES ARE?  I AM AT WORK NOW AND I DO NOT HAVE THE VIN NUMBER, IF YOU EMAIL ME THEN LATER TONIGHT I CAN FORWARD THE VIN NUMBER TO YOU. *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/23/2008",
        "dateOfIncident": "10/01/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10246561,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO CINCO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "FAN CONTROL KNOB FOR HEAT INTERMITTENTLY WOULD ONLY WORK ON SOME SPEEDS AND GRADUALLY WOULD NOT WORK AT TIMES. IT WOULD \"CATCH\" EVERY ONCE IN AWHILE ONLY ON HIGH, I COULD SMELL SOMETHING HOT, NOW IT DOES NOT WORK AT ALL. AFTER LOOKING BEHIND THE COVER,  THE CLIPS THAT HOLD THE RELAY SWITCH TO THE KNOB ARE MELTED, THE RELAY SWITCH IS BURNED AND THE WIRE HARNESS IS MELTED.  *TR",
        "vin": "KNADC165046"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/03/2008",
        "dateOfIncident": "08/22/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10240850,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "ON FRIDAY, 8/22/08, THE VEHICLE STALLED AFTER BEING DRIVEN FOR LESS THAN A QUARTER OF A MILE FROM MY HOME AND IN A 25 M.P.H. ZONE.  ON MONDAY 8/25/08, I HAD THE VEHICLE TOWED TO THE DEALERSHIP WHERE I PURCHASED THE VEHICLE.  THERE I MET WITH THE SERVICE TECHNICIAN.  THE SERVICE TECHNICIAN FELT THAT THE TIMING BELT MAY HAVE FAILED AND THAT THE EVENT WOULD LIKELY NOT BE COVERED UNDER MY WARRANTY BECAUSE, AS THE CUSTOMER, I SHOULD HAVE HAD THE TIMING BELT REPLACED AT 60,000 MILES.  MY VEHICLE HAD 79,418 MILES AT THE TIME THE VEHICLE STALLED.     MY 2004 KIA RIO HAS AN INTERFERENCE ENGINE AND NO ADEQUATE WARNING OF THE PROBABILITY OF A TIMING BELT FAILURE WAS EXPRESSED OR POSTED BY KIA.  MY ENGINE HAS COMPLETELY FAILED BECAUSE THE TIMING BELT STRIPPED.  IT WILL COST $1,200.00 TO $2,000.00 TO REPLACE THE MOTOR IN THIS AUTOMOBILE. *TR",
        "vin": "KNADC125346"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/28/2008",
        "dateOfIncident": "03/26/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10222564,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 KIA RIO.  WHILE DRIVING BETWEEN 50-55 MPH UPHILL, THE VEHICLE BEGAN WEAVING, VIBRATING, AND SHAKING.  THE FAILURE RECURRED THE SAME DAY.  THE DEALER CONFIRMED THAT THE LATERAL STABILIZER BAR FAILED.  THE VEHICLE IS CURRENTLY AT THE DEALER, AWAITING THE PARTS TO ARRIVE.  THE CONTACT HAS PICTURES.  THE CURRENT AND FAILURE MILEAGES WERE 76,243.",
        "vin": "KNADC125546"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/05/2008",
        "dateOfIncident": "02/29/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10220143,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR WAS IN AN ACCIDENT AND THE AIR BAGS NEVER DEPLOYED ON THE DRIVER SIDE OR THE PASSENGER SIDE. NOTHING WAS DONE TO FIX IT .THE CAR NOW HAS TO HAVE THE WHOLE FRONT END FIXED AND NEED TO HAVE THEM CHECKED TO SEE WHY THEY DIDN'T DEPLOY.  *TR",
        "vin": "KNADC125846"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/04/2007",
        "dateOfIncident": "08/18/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10204856,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 KIA RIO CINCO.  WHILE DRIVING 30, 45, OR 55 MPH, THE VEHICLE STALLED AND SHUT OFF WITHOUT WARNING.  THE DEALER WAS UNABLE TO DUPLICATE THE FAILURE AND THE DIAGNOSTIC SHOWED THAT NOTHING WAS WRONG.  THE MANUFACTURE STATED THAT THE INVESTIGATION WAS CLOSED SINCE THE DEALER COULD FIND NO FAILURE WITH THE VEHICLE.  THE CURRENT AND FAILURE MILEAGES WERE 53,015.  UPDATED 01-14-08.  *KB  THE ROTORS WERE RESURFACED AND THE DRUMS WERE ROTATED. UPDATED 12/12/07. *JB",
        "vin": "KNADC165646"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/27/2007",
        "dateOfIncident": "12/18/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10194775,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 KIA RIO.  THE CONTACT WAS INVOLVED IN A HEAD-ON CRASH WHILE DRIVING 25 MPH.  THE AIR BAGS FAILED TO DEPLOY.  THE VEHICLE WAS DESTROYED.  THE CONTACT SUSTAINED MAJOR INJURIES WHILE WEARING HIS SEAT BELT.  A POLICE REPORT WAS FILED.  NO OTHER VEHICLE INFORMATION WAS AVAILABLE.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/12/2006",
        "dateOfIncident": "12/10/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10175941,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE DRIVING 70 MPH ON NORMAL ROAD CONDITIONS A LOST OF ENGINE POWER WAS NOTICED. THERE WERE  NO ENGINE WARNING LIGHTS TO ALERT THE CONTACT OF AN ENGINE PROBLEM.  THE VEHICLE WAS TAKEN TO AN INDEPENDENT CERTIFIED MECHANIC WHO DETERMINED THE ENGINE BLEW OUT DUE TO THE PRESENCE OF COOLANT MIXED WITH THE ENGINE OIL AND RECOMMENDED ENGINE PEPLACEMENT. THE DEALERSHIP AND MANUFACTURER HAVE NOT BEEN CONTACTED.  THE VEHICLE REMAINED INOPERABLE.  THE CONTACT WAS CONCERN BECAUSE THE VEHICLE HAS BEEN UNDER REGULAR MAINTENACE SINCE THE PURCHASE DATE",
        "vin": "KNADC125546"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/07/2006",
        "dateOfIncident": "04/01/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10172888,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THE VEHICLE CONTINUOUSLY STALLED.  THE VEHICLE WAS TAKEN TO THE SERVICE DEALER SIX TIMES BUT THE DEALER WAS UNABLE TO DUPLICATE THE PROBLEM.  UPDATED 12/01/06. *JB",
        "vin": "KNADC125746"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/03/2006",
        "dateOfIncident": "11/02/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10172536,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED WHILE TRAVELING AT SPEEDS BELOW 25 MPH, THE TRANSMISSION WOULD NOT DOWNSHIFT, CAUSING SEVERE HESITATION.  THE DEALERSHIP DETERMINED THE PROBLEM WAS IN THE TRANSMISSION AND NO REPAIR WAS AVAILABLE.  11/30/06. *JB",
        "vin": "KNADC125046"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/03/2006",
        "dateOfIncident": "10/26/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10172592,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THE ENGINE'S TIMING BELT CHIPPED AND DENTED AN ENGINE PISTON.  THE SERVICE DEALER DETERMINED THE ENGINE NEEDED TO BE REPLACED.",
        "vin": "KNADC125446"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES, HYDRAULIC,FUEL SYSTEM, GASOLINE,WHEELS",
        "crash": false,
        "dateComplaintFiled": "11/02/2006",
        "dateOfIncident": "11/01/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10172443,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THE VEHICLE'S FRONT END MADE A LOUD CLANKING NOISE AND WAS TAKEN TO AN INDEPENDENT MECHANIC WHO DETERMINED UPON EXAMINATION THAT BOTH ROTORS NEEDED TO BE REPLACED.  THE MECHANIC REPLACED THE ROTORS.  THEN, THE VEHICLE HAD PROBLEMS WITH THE REAR END, AND WAS TAKEN TO A LOCAL DEALER WHO DETERMINED THAT THE AXLE BEARING WAS BAD AND THAT THE REAR WHEELS WERE BENT.  THE DEALER PROVIDED THE VEHICLE WITH PROPER MAINTENANCE AND BRAKE SERVICE AND REPAIRED THE FUEL PUMP.  THE VEHICLE WAS CURRENTLY AT THE DEALER FOR FURTHER EXAMINATION OF ONGOING PROBLEMS.  NO FURTHER REPAIRS WERE MADE.  UPDATED 03/19/07. *JB  THE FUEL PUMP WAS REPALCED. UPDATED 09/25/07 *JB",
        "vin": "KNADC125046"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/17/2006",
        "dateOfIncident": "01/19/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10162588,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THAT SINCE THE VEHICLE WAS PURCHASED ON JANUARY 19TH 2005, IT HAS BEEN EXPERIENCING PROBLEMS WITH THE CARBURETOR AND A BAD ODOR THAT COMES FROM THE ENGINE.  THE VEHICLE WAS ALSO SOLD TO THE CONTACT WITHOUT NOTIFICATION OF RECALL DEFECT TO THE CARBURETOR.  THE VEHICLE WAS TAKEN TO THE DEALERS TO HAVE A PART REPLACED TO REMEDY PROBLEMS WITH THE CARBURETOR BUT VEHICLE CONSISTENTLY EXPERIENCES THE SAME PROBLEMS.  THE VEHICLE WAS TAKEN BACK ON TEN OTHER OCCASIONS FOR SERVICES RELATED TO THE PROBLEM.  THE VEHICLE WAS THAN TAKEN TO AN INDEPENDENT MECHANIC WHO DETERMINED THAT THE PROBLEM WAS RELATED TO FUEL INJECTION SYSTEM.  THE MANUFACTURER WAS NOTIFIED AND PROVIDED A REFERRAL TO ANOTHER DEALERS FOR SERVICE.  THE VEHICLE HAS BEEN TAKEN TO THE RECOMMENDED DEALER FOR SERVICE.  THE ENGINE LIGHT ILLUMINATED, HOWEVER THE DEALER REFUSED TO ADDRESS THE PROBLEM.  THE VEHICLE WAS PULLING TO THE RIGHT, AN ALIGNMENT WAS PERFORMED.  THE CONSUMER HEARD A WIND NOISE WHILE DRIVING. THE BRAKES WERE MAKING A LOUD  NOISE.   UPDATED 08/01/06. *JB",
        "vin": "KNADC125846"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/28/2006",
        "dateOfIncident": "06/26/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10160987,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO CINCO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE ON A LONG ROAD TRIP, I EXPERIENCED A PROBLEM WITH THE CLUTCH ON MY 2004 KIA RIO CINCO.  AT HIGHWAY SPEED I ATTEMPTED TO PASS A TRUCK WHEN, AT APPROXIMATELY 70 MPH, THE CLUTCH PARTIALLY DISENGAGED CAUSING MY ACCELERATION TO CEASE.   I LET OFF THE THROTTLE AND WHEN RE-ENGAGING THE THROTTLE, THE CLUTCH SLIPPED AGAIN.  I HAD TO LET OFF,APPLY BRAKES, AND SWERVE IN BEHIND THE TRUCK I WAS ATTEMPTING TO PASS TO AVOID BEING STRUCK BY AN ONCOMING TRUCK.  THE CAR SEEMED TO OPERATE PERFECTLY AFTER THIS INCIDENT BUT I CONTACTED CUSTOMER SERVICE BY PHONE AND WAS TOLD TO HAVE IT LOOKED AT BY A DEALER AS SOON AS POSSIBLE.  WHEN I FINALLY FOUND A DEALER THAT HAD THE TIME TO LOOK AT IT A DAY LATER, I WAS TOLD IT WAS THEIR POLICY TO NOT REPAIR CLUTCH PROBLEMS SINCE THEY ARE CALLED A \"WEAR ITEM\".  THEY ALSO TOLD ME THE CLUTCH PLATE LOOKED TO BE BADLY BURNED BUT I COULD FINISH THE TRIP IF I BABIED IT.  I CONTINUED ON TO OUR FINAL DESTINATION AND HAVE DECIDED TO SELL THE CAR.  AT THE TIME OF THE INCIDENT DESCRIBED, THE CAR ONLY HAD ABOUT 10,000 MILES ON IT.  I AM A PROFESSIONAL DRIVER AND AM ALMOST THE SOLE DRIVER SO THIS WASN'T CAUSED BY DRIVER ABUSE.  I GUESS THEIR ARE LOOPHOLES IN THE WARRANTY THAT KIA ADVERTISES SO HIGHLY AND THEY AREN'T AFRAID TO LOSE CUSTOMERS WHEN THEIR PRODUCT FAILS.  *NM",
        "vin": "KNADC165846"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/26/2006",
        "dateOfIncident": "06/23/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10160791,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2004 KIA RIO STARTED TO STALL AT STOP SIGNS AND LIGHTS @ 24,000  I AM ALSO EXPERIENCING ERRATIC TACHOMETER READINGS (UP AND DOWN) AND I HAVE HAD A CONTINUED ROUGH IDLE.  I HAVE BROUGHT THE CAR TO MY DEALER ON MORE THAN 6 OCCASIONS AND AT THAT POINT THEY ONLY RETURNED THE COMPUTER CHIP AND TOLD ME THERE SEEMS TO BE NOTHING WRONG WITH MY CAR. AFTER HIRING A LAWYER AND CONSTANT PRESSURE FROM THEM TO FIX THE CAR, THEY ORDERED A THROTTLE ARM AND AGREED TO TRY IT OUT. ON JUNE 23, 2006 BEFORE THEY PUT THE THROTTLE ITEM IN, I STALLED @ 30 MPH MAKING A TURN ONTO TO A STREET FROM A INTERSECTION. A CAR COMING THE OTHER WAY  AND STOPPED INCHES SHORT OF HITTING ME ON MY DRIVERS SIDE DOOR.  AT THIS POINT EVEN WITH THE NEW PART PLACED IN MY CAR, I DO NOT FEEL SAFE DRIVING THIS CAR SINCE THEY SAID THERE IS NO WAY TO GUARANTEE THE PROBLEM WILL BE FIXED.  *NM",
        "vin": "KNADC125346"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "03/17/2006",
        "dateOfIncident": "03/17/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10152976,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE DRIVING 30 MPH, THE BRAKE PEDAL WAS DEPRESSED AND THE BRAKES DID NOT RESPOND.  THE VEHICLE STOPPED WHEN HITTING ANOTHER VEHICLE.  THERE WAS A POLICE REPORT TAKEN AT THE SCENE.  THE VEHICLE WAS DRIVEN TO THE DEALERSHIP WHERE IT WAS DETERMINED THE CALIPERS WERE BLOWN OUT.",
        "vin": "KNADC125446"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/13/2006",
        "dateOfIncident": "02/01/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10150163,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED THE ACCELERATOR PEDAL STUCK.  THE PROBLEM OCCURRED MULTIPLE TIMES WHILE THE ACCELERATOR WAS PRESSED DOWN FOR A DISTANCE.  THE LEVER THAT IS ATTACHED TO THE HOUSING BLOCK WAS MANUALLY PUSHED BACK.  THE VEHICLE WAS INSPECTED BY A DEALERSHIP WHICH DETERMINED THE HOUSING UNIT NEEDED TO BE REPLACED.  THE PARTS FOR REPLACEMENT WERE NOT AVAILABLE.",
        "vin": "KNADC125446"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/08/2006",
        "dateOfIncident": "02/08/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10149813,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED THE WINDSHIELD WIPERS FAILED.  THE RETAINING NUT ON THE WINDSHIELD WIPER ARM LOOSENS, CAUSING THE WINDSHIELD WIPERS NOT TO FUNCTION.  THE DEALERSHIP INSPECTED AND TIGHTENED THE RETAINING NUT, BUT THE PROBLEM STILL EXISTS.  THE MANUFACTURER HAS BEEN ALERTED HOWEVER, NO OTHER REPAIRS HAVE BEEN MADE.",
        "vin": "KNADC125336"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/23/2005",
        "dateOfIncident": "07/28/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10143539,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THE CONTACT STATED  VEHICLE JERKED AND CUT OUT.  WHEN THIS HAPPENED THE ENGINE LIGHT CAME , ON AND THERE WAS A BURNING SMELL.  THE VEHICLE WAS TAKEN TO THE DEALERSHIP SEVEN TIMES, AND THEY STATED IT WAS AN ELECTRICAL PROBLEM.  THEY  REPLACED THE ELECTRICAL THROTTLE MODULE  EVERY TIME,  AND STATED THERE WAS A POOR CONNECTION AT THE ENGINE BULK.  THE PROBLEM HAS NOT BEEN CORRECTED AT THIS TIME.  *AK",
        "vin": "KNADC125146"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/27/2005",
        "dateOfIncident": "09/26/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10137887,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO CINCO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR IS A KIA RIO CINCO, I HAVE EXPERIENCED WHAT SEEMS TO BE CLUTCH SLIPPAGE IN ALL GEARS.  CAR WILL ONLY ACCELERATE ABOUT 10 MILES IN EACH GEAR, THEN BEGINS TO STALL AND THEN DECELERATE, UNLESS I MOVE IT TO THE NEXT GEAR.  WHEN I REACH 5TH GEAR AT ABOUT 42 MILES PER HOUR, THE CAR WILL DRIVE OK UNTIL I REACH 50 AND THEN BEGAN TO DECELERATE, STABILIZING AT ABOUT 45 MILES PER HOUR. *JB",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/19/2005",
        "dateOfIncident": "03/14/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10118855,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DEALER CHANGED COMPUTER, WIRING HARNESS , 2 INJECTORS, PLUG, TIMING BELT, SENSOR  AND REPLACED COMES SWITCHES .   BOUGHT A 2004 KIA RIO IN MARCH 2005. IT HAS BEEN IN THE SHOP FOR THE PAST 3 WEEKS.  THE CONSUMER PICKED THE CAR UP AT THE SHOP,  AND IT DIDN'T MAKE IT OFF THE LOT BEFORE THE CAR BROKE DOWN AGAIN.  DEALER OFFERED ME A RENTAL CAR.  WENT BACK ONE WEEK LATER TO PICK UP THE CAR AND ONLY WENT TWO MILES BEFORE THE CAR BROKE DOWN AGAIN.  TOOK THE CAR BACK TO DEALER, AND REQUESTED ANOTHER CAR JUST LIKE THE ONE THAT I HAD A 2004 KIA RIO.  DEALER SAID COULD NOT TRADE THE CAR WITHOUT REFINANCING IT.  THEY DID FINANCE THE  HOUSE FOR THE FIRST CAR BUT REFUSED TO WITH THE SECOND CAR.   WHY CANT THE DEALER FINANCE THE SECOND CAR AS THEY DID THE FIRST?  *AK   *NM",
        "vin": "KNADC125246"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "08/16/2005",
        "dateOfIncident": "08/14/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10133037,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO CINCO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  WHILE DRIVING ON THE HIGHWAY AT 55-60 MPH THE STEERING WENT OUT. THE CAR WAS MOVING ON ITS OWN ACCORD FROM ONE SIDE OF THE LANE TO THE OTHER, AND STEERING BECAME  UNRESPONSIVE.  PUMPING THE BRAKES MADE THE REACTION WORSE.  THE VEHICLE WAS STRUCK ON THE PASSENGER'S SIDE , SLOWING  THE CAR,AND STEERING ENGAGED AGAIN.    PULLED THE CAR OVER TO THE LEFT SHOULDER OF THE HIGHWAY.*AK",
        "vin": "KNADC165046"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/18/2005",
        "dateOfIncident": "12/23/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10129257,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO CINCO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE DAY ONE THIS CAR HAS HAD A SHAKE IN THE STEERING WHEEL AT THE SPEED OF 55 - 65 MPH. THIS CAR HAS BEEN BACK TO THE DEALER 4 TIMES FOR THIS PROBLEM.THE DEALER HAS TOLD ME THAT  THEY DON'T KNOW WHAT IT IS.  I REQUESTED A REPRESENTATIVE COME AND CHECK THE CAR.THE RESPONSE THAT  I GOT WAS, \"WHAT YOUR FEELING IN YOUR STEERING WHEEL IS COMMERCIALY ACCEPTABLE TO THE INDUSTRY.\" AS A TECHINIAN MYSELF, I BELIEVE THAT NO NEW CAR SHOULD SHAKE IN THE STEERING WHEEL. THE MANUFACTURER HAS DECLINED MY REQUEST TO BUY BACK MY CAR. I NEED SOME HELP. ALL OF THE SAME CARS THAT I DROVE FROM THE DEALER HAD THE SAME PROBLEM. SOMETHING IS NOT RIGHT. MY WIFE AND TWO SMALL CHILDREN DRIVE IN THIS CAR AND I CAN'T HELP BUT THINK, WHAT IF SOMETHING WENT WRONG. I WOULD HAVE NEVER PURCHASED THIS CAR HAD I KNOWN THAT IT WOULD HAVE BEEN THIS MUCH TROUBLE. I WOULD LIKE THE CAR TO BE REPURCHASED .",
        "vin": "KNADC165046"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "05/04/2005",
        "dateOfIncident": "12/10/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10119819,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "CONTACT STATES:  THE DEALER DESCRIBED THE PROBLEM AS A FUEL COMPATIBILITY/TEMPERATURE PROBLEM. CONTACT SAYS THAT THE VEHICLE RUNS ROUGH WHEN COLD, AND THAT IT CUTS OUT WHEN CHANGING GEARS. DEALER RECOMMENDED THAT HE WOULD LET HIS VEHICLE WARM UP BEFORE HE BEGINS TO DRIVE, AND HE ALWAYS DOES. HOWEVER,  PROBLEM RECURRED.  DEALER FIXED THE CHECK ENGINE LIGHT.  VEHICLE HAS BEEN IN SHOP SEVERAL TIMES FOR WARRANTY WORK. NO PRIOR WARNING TO THE FAILURE.*AK",
        "vin": "KNADC125X46"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/10/2005",
        "dateOfIncident": "02/03/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10111299,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO CINCO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING BETWEEN 30-35 MPH VEHICLE SUDDENLY STOPPED ACCELERATING. A POLICE OFFICE HAD TO USE HIS VEHICLE TO PUSH THE CONSUMER'S VEHICLE TO THE SIDE OF THE ROAD.  VEHICLE WAS TOWED TO THE DEALERSHIP, WHERE THE TRANSMISSION WAS REPLACED. THE FAILURE RECURRED WHILE DRIVING AT HIGHWAY SPEEDS. THIS ALMOST RESULTED IN VEHICLE BEING HIT BY ONCOMING TRAFFIC. THE VEHICLE WAS COASTED OF THE HIGHWAY, THEN TOWED TO THE DEALERSHIP, WHO REPLACED THE TRANSMISSION AGAIN.*AK",
        "vin": "KNADC165146"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "01/26/2005",
        "dateOfIncident": "01/17/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10107953,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING A FRONTAL-IMPACT ACCIDENT, THE DRIVER AIRBAG FAILED TO DEPLOY UNTIL AFTER I HIT THE STEERING WHEEL.  I THEN SAW THE PASSENGER AIRBAG DEPLOY.  NEITHER THE SEAT BELT NOR THE AIRBAG STOPPED ME FROM HITTING THE STEERING WHEEL CAUSING CHEST WALL CONTUSIONS AND MUSCLE STRAINS IN CHEST AND BACK. I'M STILL OUT OF WORK DUE TO THE INJURIES.  THE CAR WAS TOTALED.*AK",
        "vin": "KNADC125846"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/05/2004",
        "dateOfIncident": "07/21/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10099686,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE SOON LIGHT CAME ON AND THERE WAS NOT ACCELERATION WHILE IN 1ST GEAR.  REPLACED FUEL INJECTOR HARNESS.   *BF  THE DEALER ALSO REPLACED THE AIR CLEANER LID WITH A NEWLY DESIGNED ONE, MASS AIR FLOW SENSOR AND TIGHTENED PIN CONNECTORS.  *NM",
        "vin": "KNADC125346"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/30/2004",
        "dateOfIncident": "08/30/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10090029,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING CHECK ENGINE LIGHT APPEARED ON THE DASHBOARD AND REMAINED ON.   VEHICLE OVERHEATED. THIS CAUSED THE VEHICLE TO STALL.   CONSUMER WAS UNABLE TO RESTART VEHICLE, AND HAD IT TOWED TO THE DEALER FOR INSPECTION.   MECHANIC  DETERMINED  THAT THE CAM SENSOR, AND OTHER PARTS NEEDED TO BE REPLACED.  CONSUMER INFORMED THE MECHANIC  THAT A TICKING PROBLEM  OCCURRED, AND THE PROBLEM WAS  RESOLVED.  *AK",
        "vin": "KNADC165346"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/15/2004",
        "dateOfIncident": "08/12/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10086878,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO CINCO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR HAS STALLED NUMEROUS TIMES. VEHICLE WOULD NOT ACCELERATE UNLESS THE GAS PEDAL WAS DEPRESSED COMPLETELY TO THE FLOOR.  THE CAR HAS BEEN INTO THE DEALER ON 4 DIFFERENT OCCASIONS AND THREE OF THE FOUR TIMES THEY HAVE REPLACED A DIFFERENT PART. THE VACUUM SEAL ON THE FUEL LINE, THE CATALYTIC CONVERTER,  AND A PART WITH A O2 SENSOR.  EACH TIME THEY TELL ME THAT THE PROBLEM IS FIXED.  NOW THERE IS A VIBRATION WHEN THE CAR IDLES AND A SCRAPING SOUND WHEN THE CAR ACCELERATES FROM A COMPLETE STOP.  THE CAR WILL BE IN FOR THE 5TH TIME FOR THIS PROBLEM.   *JB",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/22/2004",
        "dateOfIncident": "03/07/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10068683,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO CINCO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE LIGHT CONTINUED TO STAY ON.  DEALER STATED MASS AIR FLOW SENSOR  FAILED.  THIS  PART HAD BEEN REPLACED SIX TIMES. HOWEVER, PROBLEM RECURRED. *AK",
        "vin": ""
    }
]