[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/08/2021",
        "dateOfIncident": "10/07/2021",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436117,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "Everything appears normal driving down road bout 45 to 50 mph. Slowed down for car n front was turning when I noticed smoke coming from under hood around headlights both sides. Then we pulled into a storage unit place. When even more smoke . I got out popped hood it was all on fire. I turned off van and a friend and I got a couple cups and dipped in water puddle and put fire out , while we were watching to make sure it restarted 2 more times. After half hour goes by and no more smoke . Closed van up found a ride home after contacting insurance company.",
        "vin": "Kndup131546"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/28/2020",
        "dateOfIncident": "03/28/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319611,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2004 KIA SENDONA LX VAN AND THE WHEEL BARRINGS ARE BAD I FIXED IT ONCE ALREADY A MONTH AGO AND IT IS ALREADY BROKEN AGAIN BOTH TIMES IT COMPLETELY FELL APART IN TO LITTLE PEICES WHEN I TOOK THE WHEEL OFF.",
        "vin": "KNDUP131246"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/21/2019",
        "dateOfIncident": "05/04/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11221742,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA EX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING MAKES WHINING SOUND WHEN TURNING THE WHEEL, POWER STEER FLUID LOW IN CANISTER DUE TO LEAKS. HARD TO TURN TO THE STEERING WHEEL WHEN TURNING. DON'T KNOW IF BELTS AFFECTED I HEAR A HUMMING SOUND. DON'T KNOW IF THE POWER STEERING PUMP IS WORKING PROPERLY. CONSTANTLY ADDING FLUID TO THE CANISTER.",
        "vin": "KNDUP131846"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/02/2019",
        "dateOfIncident": "03/30/2019",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11193363,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2004 KIA SEDONA. THE CONTACT STATED THAT THE VEHICLE CAUGHT FIRE. THE FIRE DEPARTMENT EXTINGUISHED THE FIRE. THE VEHICLE WAS DESTROYED AND TOWED TO A TOW YARD. THE CONTACT MENTIONED THAT THE CAUSE OF THE FIRE WAS UNKNOWN. THE DEALER AND MANUFACTURER WERE NOT CONTACTED. THE APPROXIMATE FAILURE MILEAGE WAS 100,100.",
        "vin": "KNDUP131946"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/21/2018",
        "dateOfIncident": "09/01/2018",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11141627,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MY  2004 KIA SEDONA WAS SITTING STATIONARY IN MY DRIVEWAY ENGINE WAS OFF. WHEN SOMETHING IN THE ENGINE COMPARTMENT CAUGHT FIRE CAUSING EXTENSIVE DAMAGE TO ENGINE PARTS ON THE TOP SIDE OF THE ENGINE. SUCH BE AS FLUID RESERVOIRS WIRING, FUSE BOX, AND MORE.",
        "vin": "KNDUP131446"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/21/2018",
        "dateOfIncident": "12/16/2017",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080722,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SATURDAY, DECEMBER 16, AT APPROXIMATELY 11:30 AM, MY WIFE'S 2004 KIA SEDONA SPONTANEOUSLY CAUGHT FIRE IN THE DRIVEWAY OF OUR HOME.  I HAD DRIVEN IT THAT MORNING TO RUN A QUICK ERRAND, ACTUAL DRIVE TIME LESS THAN HALF AN HOUR WITHOUT ANYTHING OUT OF THE ORDINARY.  I RETURNED HOME, PARKED IN OUR DRIVEWAY BEHIND MY FORD WINDSTAR.  BOTH MY WIFE AND MYSELF WERE IN OUR HOUSE WHEN WE HEARD A LOUD BOOM FOLLOWED SHORTLY BY A SECOND BOOM.  THAT IS WHEN WE SAW THAT FIRE WAS COMING FROM THE ENGINE COMPARTMENT OF HER VAN AND THE REAR OF MY WINDSTAR WAS ON FIRE.  WE IMMEDIATELY CALLED 911 AND SHORTLY THEREAFTER OUR LOCAL FIRE COMPANY ARRIVED AND BEGAN FIGHTING THE BLAZE.  BY THAT TIME BOTH VEHICLES WERE ENGULFED IN FLAMES.  THE FIRE APPEARS TO HAVE STARTED IN THE ENGINE COMPARTMENT OF THE KIA.  BOTH VEHICLES ARE A TOTAL LOSS.     UNTIL THIS INCIDENT, NOTWITHSTANDING BASIC MAINTENANCE AND REPAIRS, THE KIA SEDONA WAS A VERY RELIABLE VEHICLE.  AS WITH THE WINDSTAR, MAINTENANCE AND REPAIRS WERE DONE ON A REGULAR AND AS NEEDED BASIS BY THE SAME SHOP THAT HAS WORKED ON ALL OUR VEHICLES FOR OVER 10 YEARS.  I AM SURE I CAN PRODUCE MAINTENANCE AND REPAIR RECORDS IF NEEDED.  THE LAST TIME THE KIA WAS SERVICED WAS LATE OCTOBER OF THIS YEAR TO REPLACE AN ALTERNATOR.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/05/2017",
        "dateOfIncident": "06/05/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10993222,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I WENT TO START MY CAR IT IMMEDIATELY SHUT OFF, AS IT OCCASIONALLY DOES. THE RPM'S DROPPED AND THE ENGINE CUT OUT. USUALLY THE PROBLEM IS RESOLVED BY ME REVVING THE ENGINE FOR A MINUTE OR TWO, BUT THE PROBLEM PERSISTED LONGER THAN USUAL. IT EVENTUALLY STAYED ON AND I TRIED TO DRIVE AWAY. AS I CHANGED INTO GEAR EVERYTHING SEEMED OKAY, I REVERSED FROM WHERE I WAS PARKED THEN I PUT IT INTO DRIVE AND WHILE IN THE MIDDLE OF THE ROAD THE ENGINE CUT OUT AND I WAS STUCK THERE FOR ONLY A FEW SECONDS LUCKILY. I DROVE BACK TO WHERE I WAS PARKED AND AS I STOPPED THE ENGINE CUT OUT ON ME. THIS TYPICALLY HAS HAPPENED TO ME WHEN THE GAS TANK WAS BELOW HALF. I MANAGED TO GET TO A GAS STATION AND FILL UP AND THAT STOPPED THE PROBLEM.",
        "vin": "KNDUP131846"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "06/01/2017",
        "dateOfIncident": "05/09/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10992708,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "\"TAKATA  RECALL\"  ON TUESDAY MAY 9, 2017 WE WERE INVOLVED IN AN AUTOMOBILE ACCIDENT. TO OUR AMAZEMENT AND HORROR, NOT ONE AIRBAG DEPLOYED . 'WE  WERE HIT ON THE PASSENGER SIDE OF THE VAN . THE FRONT PASSENGER  DOOR REQUIRED ASSISTANCE FROM THE POLICE/FIRE FIGHTERS ASSISTANCE TO EXIT THE VAN HOWEVER THE SLIDING DOOR COULD NOT BE OPENED REQUIRING REMOVING THE BABY THROUGH THE DRIVER'S SIDE.    THE LIGHT TURNED GREEN AND WE BEGAN TO MOVE FORWARD WHEN OUR VAN WAS STRUCK BY THE OTHER CAR EXITING A PARKING LOT. NEITHER ONE OF US SAW THE ADVANCE NOR IMPACT OF THE OTHER CAR. AFTER REALIZING WHAT HAPPENED WE CALL EMERGENCY VEHICLES FOR ASSISTANCE. WE WERE INSTRUCTED TO MOVE OUR VAN TO A SAFE LOCATION AND WAIT FOR H",
        "vin": "KNDUP131046"
    },
    {
        "components": "UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/23/2017",
        "dateOfIncident": "05/23/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10991190,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA EX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER HAVING A VARIETY OF MECHANICS DIAGNOSE A PROBLEM OF MY VEHICLE NOT STARTING FOR 20 MINS TO 1 HOUR AFTER THE ENGINE IS WARM & AFTER THE VEHICLE DOES START; IT HAS A VERY STRONG GASOLINE &/OR ADDITIVE SMELL. I WENT TO A KIA DEALER TO HAVE THEIR OPINION: THE KIA MECHANIC STATED: TO START A $200.00 TEST WOULD HAVE TO BE PERFORMED TO ENSURE THAT IT'S THE CRANKSHAFT POSITION SENSOR; A $159.00 PART; THAT IS COMMON FOR KIA'S TO GO BAD, BECAUSE IT COULD BE FUEL RELATED; ANOTHER COMMON PROBLEM THEY HAVE. TO REPLACE THE SENSOR WILL COST $1,400.00 BECAUSE OF WHERE IT IS; MAKING A TIMING BELT REPLACEMENT NECESSARY. (THIS IS AFTER GETTING SPARK PLUGS DONE & NUMEROUS OTHER REPAIRS THAT INVOLVED REPEATED FIXES INVOLVING THE VEHICLES WATER SYSTEM); ONE MECHANIC SAYS THERE MAY BE ANOTHER PROBLEM & UNRELATED TO THE SENSOR; AND THESE PROBLEMS HAVE BEEN ONGOING WITH NO MECHANIC ABLE TO FIX THE PROBLEMS SINCE THE VEHICLE'S PURCHASE IN 2012; EVEN THE RADIATOR WAS REPLACED & THE VEHICLE STILL CAN QUICKLY OVERHEAT; ESPECIALLY AFTER DRIVING THROUGH THREE TRAFFIC LIGHTS OR IN TRAFFIC. I AM MORE THAN UNCOMFORTABLE WITH CERTIFIED MECHANICS SAYING WHEN I DO HAVE THE MONEY FOR THE SENSOR REPAIR, THEY'LL REPLACE THE WATER PUMP AS WELL; EVEN THOUGH THERE IS NO VISIBLE SIGN OF LEAKAGE...THE VEHICLE TAKES ABOUT 1 1/2 LITERS OF WATER A DAY DIRECTLY INTO THE RADIATOR & ONLY PERIODICALLY SUCKS IT FROM THE RESEVOIR...THIS ADDED REPAIR IS NOT INCLUDED FOR FREE... AND IF THAT DOESN'T FIX IT, WE WILL DO THE FAN ETC...THE A/C IS NOT CONNECTED; SO DRIVING WITH THE HEAT ON IN FL TO KEEP THE VEHICLE FROM OVERHEATING IS NOT MAKING IT EASY TO RESOLVE THIS/THESE ONGOING PROBLEMS THAT IS STATED TO BE 'COMMON'.",
        "vin": "KNDUP131446"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/15/2017",
        "dateOfIncident": "05/15/2017",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10985783,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 KIA SEDONA. WHILE STATIONARY, THE FRONT END OF THE VEHICLE ERUPTED INTO FLAMES. THE CONTACT STATED THAT THE FIRE ORIGINATED FROM THE ENGINE COMPARTMENT. A POLICE REPORT WAS NOT FILED. THE FIRE WAS EXTINGUISHED BY THE FIRE DEPARTMENT. THERE WERE NO INJURIES SUSTAINED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FIRE. THE FAILURE MILEAGE WAS 110,000.",
        "vin": "KNDUP131446"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/30/2017",
        "dateOfIncident": "03/30/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10969516,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL..MY VAN STALLS OUT NO MATTER WHERE..STOPPED AT IDLE IT RANDOMLY SHUTS OFF..DRIVING AVERAGE SPEED IN TOWN 45MPH IT RANDOMLY SHUTS OFF..ON THE HWY. SPEEDS AVERAGE FROM 55 TO 70 MPH IT RANDOMLY SHUTS OFF ..IN HEAVY TRAFFIC THIS IS VERY DANGEROUS..I HAVE REPLACED THE FOLLOWING..  FUEL PUMP  FUEL FILTER  FUEL PUMP RELAYS  THROTTLE POSITION SENSOR  MASS AIR FLOW SENSOR  CRANK SHAFT POSITION SENSOR  OXYGEN SENSOR  FUEL  COIL PACKS  SPARK PLUGS  INTAKE GASKETS  INJECTORS  AIR FILTER    JUST LIKE THE HUNDREDS OF PEOPLE ON THE FORUMEBAY ABOUT KIA SEDONA..I'VE PUT $1000'S IN THE VAN WITH NO SOLUTION TO THE DANGEROUS ISSUES..THE ONLY THING LEFT TO CHANGE IS THE INTERNAL WIRING..THIS PROBLEM IS WAY TO COMMON FOR KIA NOT TO HAVE A RECALL ON IT..ITS A HUGE SAFETY HAZARD AND NEEDS TO HAVE SOMETHING DONE ABOUT IT..NOT JUST FOR ME BUT FOR EVERYONE THAT HAS A KIA SEDONA..ITS OBVIOUSLY A SHORT IN THE WIRING AND IS A MANUFACTURER FLAW FOR SO MANY PEOPLE TO HAVE THE SAME ISSUE..BTW MY VAN ONLY HAS 100.000 MILES ON IT I'VE SEEN SOME AS LOW AS 30.000 WITH THIS SAME ISSUE..NO EXCUSES FOR THIS..ANY KIND OF ELECTRONIC SHORT OUT HAS POTENTIAL FOR FIRE NOT TO MENTION THE HAZARDS OF THE VAN RANDOMLY STOPPING IN TOWN AT INTERSECTION ON THE INTERSTATE .",
        "vin": "KNDUP131746"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/04/2015",
        "dateOfIncident": "11/01/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10788466,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MY STEERING IN MY 2004 KIA SEDONA LX IS TENDING TO BIND AND NEARLY LOCK UP AROUND TURNS.  THIS PROBLEM COMES AND GOES.",
        "vin": "KNDUP131X46"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/14/2015",
        "dateOfIncident": "05/13/2015",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10716372,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON RETURNING HOME AND PARKING MY VAN AFTER RUNNING AN ERRAND OF ABOUT 5 MILES, I SAW SMOKE COMING FROM THE ENGINE COMPARTMENT, RAN TO GET A FIRE EXTINGUISHER, THE FIRE WAS PUT OUT WITHIN 60 (SIXTY) SECONDS AFTER SEEING THE SMOKE.     REMOVING THE AIR CLEANER AND OTHER COMPONENTS, --  THE WIRE HARNESS ON THE PASSENGER SIDE OF THE ENGINE COMPARTMENT WAS FOUND CHARRED BY THE FIRE.       NO IMMEDIATE REASON WAS FOUND FOR THIS INCIDENT TO OCCUR.",
        "vin": "KNDUP131046"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/13/2015",
        "dateOfIncident": "02/25/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10705253,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA EX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT MY SEDONA ON OR ABOUT FEBRUARY 7 2015. AFTER AWEEK ALMOST TWO. I WAS BROKE DOWN AND STRANDED IN THE MIDDLE OF THE ROAD.VAN WAS SO HOT IT WOULDN'T START AND. BEHAVED AS A VEHICLE WITH A BLOWN HEAD GASKET . THE DISHONEST CRIKED. CROOK SALES MAN AT THE DEALER. SHIP WOUND. NOT FIX IT AT FIRST AFTER COMPLAINING AT THE BETTER BUSINESS BUREAU SALES MAN [XXX]. PRAMIER AUTO SALES SOUTH NINTH STREET MODESTO. CAILIFORNIA 95351 WOULDN'T. HELP ME AFTER A WEEK OF COMPLAINING. HE AGREED TO PUT IT IN HIS SHOP WHO HE IS IN PARTERNS WITH (BOY) PREMER.AUTO SALES MATNENS LOCATED ON ANGEY WAY CERES CAILIFORNIA. 95307 MY SADONS VAN REMAINED THERE ON ANGIE WAY FOR. SEVEN DAYS ON MARCH TWENTIETH. 2015 [XXX] FROM PREMER AUTO SALES. REFUSED TO SURRENDER KIA SEDONA. VAN WITHOUT WRITING THREE TIMES I AM A SATISFIED CUSTOMER.HE WAS ANNOYED DUE TO EXPENSIVE OF A NEW WATER PUMP,RADIATOR,FAN, BELT,AND THERMOSTAT.NOW ONLY APRIL 10,2015 MY KIA SEDONA IS PERFORMING THE WAY IT WAS BEFORE REPAIR.FAN NOT COMING ON,RADIATOR NOT CIRCULATING,MOTOR CUTTING BECAUSE ITS SO HOT.I PAID 2200.00 DOLLARS DOWN AND HAVE DRIVEN IT FOR TWO MONTHS.  TWO MONTHS OF COST.MY INSURANCE WAS 500.00 DOLLARS TO START UP 143.00 DOLLARS A MONTH,HOWEVER WHEN THE RUBBER DEMINISHES COMPLETELY OFF SEDONAS TIRE RIM WHILE DRIVING DOWN HIGHWAY, MY INSURANCE. STONEWOOD FROM COST U LESS WOULDN'T ANYONE UNDER 18 IN THEIR TOW TRUCK A.D WOULD ONLY DISPATCH A TOW TRUCK IF ONLY SOMEONE OVER EIGHTEEN STAYED ON HIGHWAY WITH BROKE DOWN SEDONA.UNABLE TO DO SO BECAUSE I WAS THE ONLY ADULT WITH THREE CHILDREN. AGES ,11,7,5, SO THE VERY BEST HIGHWAY PATROL WERE ARE ONLY HOPE.AGAIN MY KIA SEDONA AFTER COMPLETELY NEW PARTS COOLANT. FAN AGAIN NOT WORKING 2 MONTHS OWNING ONE OF THE WORST CARS WITH ONE OF THE WORST EXPERIENCE IN MY LIFE ,LIKE WHEN I OWNED A GRAND TRINO EXPERIENCING. FREEZE PLUGS.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "KNDUP131346"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/19/2015",
        "dateOfIncident": "01/27/2015",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10695433,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "CAUGHT ON FIRE WHILE PARKED AFTER DRIVING ENGINE WAS OFF . HISTORY OF OIL LEAKS. #15003607 VAN TOTALED AND SENT TO SALVAGE YARD.  *TR",
        "vin": "KNDUP131246"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/06/2015",
        "dateOfIncident": "02/06/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10681668,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VAN WONT STEER. IT IS TIGHT AND WONT LET ME GO LEFT OR RIGHT.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/30/2014",
        "dateOfIncident": "01/15/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10669086,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 KIA SEDONA. WHILE OPENING THE FRONT DRIVER SIDE EXTERIOR DOOR HANDLE, ALL FOUR DOORS ON THE VEHICLE LOCKED INDEPENDENTLY. THE FAILURE RECURRED ON SEVERAL OCCASIONS. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 150,000.     UPDATED 6/11/15*CN  UPDATED 06/16/15*JB",
        "vin": "KNDUP131346"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/26/2014",
        "dateOfIncident": "10/07/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10668374,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING IN WET CONDITIONS THE BRAKE AND BATTERY LIGHT WILL COME ON INSTRUMENT PANEL AND THERE IS A LOSS OF POWER OF STEERING. WHEN TAKEN TO KIA DEALERSHIP TO FIX PROBLEM THEY TOLD US IT IS A COMMON COMPLAINT AMONG KIA CARS. THEY CHECKED ALL BELTS, BATTERY AND ALTERNATOR ALL TESTS CAME BACK NORMAL. WHILE DRIVING IT IS DANGEROUS TO LOSE POWER OF STEERING ESPECIALLY IN WET CONDITIONS.   *TR",
        "vin": "KNDMB233296"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/09/2014",
        "dateOfIncident": "10/21/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10663267,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA EX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE SEIZED WITHOUT ANY WARNING.  THERE WASN'T MUCH TRAFFIC ON THE ROAD AND HELPED TO STEER THE VEHICLE TO THE SHOULDER. IN BAD WEATHER AND/OR TRAFFIC CONDITIONS, THIS COULD HAVE RESULTED IN A SERIOUS ACCIDENT. I STRONGLY BELIEVE THAT THERE ARE SOME SAFETY ISSUES WITH THE ENGINE OF THIS VEHICLE MAKE/MODEL AND WOULD LIKE TO REGISTER THIS INCIDENT.  *TR",
        "vin": "KNDUP131446"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/24/2014",
        "dateOfIncident": "08/01/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10638653,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 KIA SEDONA. WHILE DRIVING APPROXIMATELY 40 MPH, THE SPEEDOMETER FLUCTUATED AND SEIZED INTERMITTENTLY. IN ADDITION, THE VEHICLE WOULD ACCELERATE INDEPENDENTLY. IN ORDER TO PREVENT THE FAILURE, THE CONTACT HAD TO DRIVE AT A SLOWER SPEED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 05V329000 (VEHICLE SPEED CONTROL). THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 96,000.",
        "vin": "KNDUP131546"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/22/2014",
        "dateOfIncident": "09/18/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10638133,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE MAKING RIGHT AND LEFT TURNS THE STEERING BECOMES VERY TIGHT. THE POWER STEERING FLUID WAS FINE. NO OTHER WARNINGS.    THIS MADE ME VERY SCARED TO MAKE TURNS.  I DID MY BEST TO AVOID TURNS ONLY IF ABSOLUTELY NECESSARY FOR TWO DAYS. IN MY 32 YEARS OF DRIVING I HAVE NEVER HAD THIS HAPPEN TO ME.  WHEN I TOOK IT TO TIRE CHOICE AND TOTAL CAR CARE THEY SAID IT WAS MY INTERMEDIATE STEERING SHAFT  NEED TO BE REPLACED.  I HAD IT REPLACED THAT DAY 9/20/14.  *TR",
        "vin": "KNDUP131746"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/14/2014",
        "dateOfIncident": "07/30/2014",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10622317,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WIRING UNDER SEAT SHORTED CAUSING SMALL FIRE INSIDE..EXTINGUISHED  WIRING UNDER CAR IN SAME AREA MELTED SHORTING EVERY THING OUT.  *TR",
        "vin": "KNDUP131546"
    },
    {
        "components": "STEERING,SERVICE BRAKES, HYDRAULIC,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/04/2014",
        "dateOfIncident": "06/04/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10596215,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA EX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING TODAY, I NOTICED A WHINING NOISE, WITH A SLIGHT GRINDING NOISE TO IT AS WELL. INITIALLY THINKING IT WAS THE BRAKES, I LISTENED CLOSER AND REALIZED IT WAS NOT HAPPENING WHEN BRAKING BUT RATHER SEEMED TO BE HAPPENING WHEN TURNING, PRIMARILY DURING ACCELERATION. SOON AFTER THE TURN AS I STEADIED SPEED, THE NOISE WOULD DECREASE OR DISAPPEAR. AFTER THE FIRST FEW TIMES MAKING TURNS HOWEVER, IN ADDITION TO THE NOISE THE STEERING WHEEL ALSO BECAME VERY STIFF AND EXTREMELY DIFFICULT TO TURN. IT PROGRESSED SO SUDDENLY AND SEVERELY THAT I WAS WORRIED I MAY NOT MAKE IT HOME WITHOUT CRASHING. THIS ALL HAPPENED DURING A TOTAL OF APPROXIMATELY 20 MILES OF DRIVING IN TOWN. SINCE RETURNING HOME I BEGAN TO INVESTIGATE WHAT THE LIKELY CULPRIT MAY BE, AND NOW BELIEVE STRONGLY THAT IT IS THE UNIVERSAL JOINT; A PROBLEM THAT HAS CLEARLY EFFECTED ENOUGH KIA SEDONA OWNERS THAT I FIND THE LACK OF RECALL QUITE MADDENING AND A BIT CONFOUNDING. WITH TWO YOUNG CHILDREN IN THE VAN AT THE TIME, IT IS PLAIN TO SEE HOW POTENTIALLY DANGEROUS THIS PROBLEM IS, AND I AM JUST GRATEFUL THAT THERE WAS SO LITTLE TRAFFIC AT THE TIME; HAD IT BEEN A BUSIER TIME OF DAY OR MORE HEAVILY POPULATED TOWN, I BELIEVE A CRASH WOULD'VE BEEN HIGHLY UNAVOIDABLE.   *TR",
        "vin": "KNDUP131646"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/25/2014",
        "dateOfIncident": "04/25/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10584969,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING NOISE AND HIGHER THAN NORMAL STEERING RESISTANCE    REFERENCE BULLETIN TSB-019    THIS IS RIDICULOUS THAT THERE HASN'T BEEN A RECALL! ARE WE JUST WAITING FOR A WRECK THAT ACTUALLY KILLS SOME ONE? WE WERE TURNING ONTO THE HIGHWAY AND THE STEERING WHEEL LOCKED AND HAD TO BE TURNED BACK TO STRAIGHT OR ELSE IT WOULD HAVE JUST KEPT TURNING US INTO ONCOMING TRAFFIC.  *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/13/2014",
        "dateOfIncident": "01/09/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10559674,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 KIA SEDONA .THE CONTACT STATED THAT WHILE DRIVING 70 MPH, THE CONTACT CRASHED INTO A DEER BUT THE AIR BAGS DID NOT DEPLOY. THE VEHICLE WAS NOT TAKEN TO THE DEALER FOR INSPECTION. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 152,500. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "12/03/2013",
        "dateOfIncident": "10/17/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10554726,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA EX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VAN WAS IN DRIVE TO MOVE FORWARD WHEN THE GAS WAS PRESSED INSTEAD OF GOING FORWARD IT WENT IN REVERSE & WHEN THE BRAKE WAS PRESSED TO STOP IT DIDN'T WORK. THE ONLY WAY TO STOP THE VAN BEFORE GOING INTO THE CEMENT WALL OF A COMMUNITY CENTER WAS TO OPEN THE DRIVER DOOR WHICH CAUSED 3 OTHER VEHICLES TO BE DAMAGED. THANK GOD THE DRIVER IS SAFE BUT THE VAN HAS DEEMED A TOTAL LOSS BY THE INSURANCE COMPANY.  *TR",
        "vin": "KNDUP131146"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/23/2013",
        "dateOfIncident": "08/22/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10536846,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "DOUGLASS & LOMASON CO.",
                "productMake": "DOUGLAS",
                "productModel": "DOUGLAS",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "THIS IS THE SECOND SET OF DOUGLAS TIRES I HAVE HAD TO PAY FOR EVEN THOUGH WALMART SAYS IT IS A MANUFACTURE DEFECT  THEY GET HOLES IN THE SIDE OF THE TIRES  THIS TIME THE WHOLE INSIDE OF MY TIRE IS GONE LOOKS LIKE ROPE HANGING OUT  ME AND MY DAUGHTER COULD OF BEEN SERIOUSLY HURT OR KILLED SO I THINK THAT DOUGLAS SHOULD HAVE TO REPLACE MY TIRES ON MY KIA MINI VAN I AM SICK AND TIRED OF WALMART  AND THE DOUGLAS TIRES I CANNOT AFFORD MORE TIRES  HERE IS THE  DOT NUMBER ON THE TIRES AND THE SIZETHEY R EXTRA TRAC [[ MTS 215/70R15 MD34 O1R 17/11 SOMETHING NEEDS TO BE DONE.  *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/16/2013",
        "dateOfIncident": "08/15/2013",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10535679,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA EX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN GOING TO KIA FOR YEARS COMPLAINING OF A STRANGE INTERMITTENT GROANING SOUND COMING FROM THE BRAKES AT LOW SPEED STOPS. IT WOULD NEVER MAKE NOISE AT THE DEALER AND WOULD ONLY MAKE THE NOISE SOMETIMES. NEVER FOR THE SAME REASON. IT WAS VERY RANDOM.  THIS TIME I WAS DRIVING FOR SEVERAL HOURS  ( CITY TRAFFIC) WHERE I BEGAN TO HEAR THE SOUND. AFTER ABOUT 20 MINUTES OR SO I SMELLED RUBBER OR TAR. THOUGHT IT WAS FROM THE STREET REPAVING BUT WHEN WE PASSED THE CONSTRUCTION I COULD STILL SMELL IT. THE CAR BEGAN TO DRIVE AS THOUGH THE TRANSMISSION WAS NOT WORKING PROPERLY. AFTER ABOUT 2 MILES AT SLOW SPEED I PULLED OVER AND SAW STEAM. I LIFTED HOOD WHERE IT APPEARED TO BE COMING FROM TRANSMISSION. I CONTINUED 10 MPH OR LESS TO GET CLOSER TO HOME AND OUT OF THE WAY OF TRAFFIC. ABOUT A MILE OR 2 LATER I COULD HARDLY DRIVE EVEN AT SLOW SPEED. I PULLED OVER TO STOP AND AS I GOT OUT THE FRONT PASSENGER BRAKES WERE ON FIRE AND THE REAR DRIVER SIDE BRAKES WERE SMOKING. THE FRONT BRAKES WERE NEW AND THE BAKE ONES STILL HAD PLEA TOY OF LIFE. I HAVE BEEN COMPLAINING FOR YEARS AND KEEP GETTING TOLD THERE IS NO PROBLEM.  THIS IS A MAJOR PROBLEM.  *TR",
        "vin": "KNDUP131946"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/29/2013",
        "dateOfIncident": "06/26/2013",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10532292,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 KIA SEDONA. THE CONTACT STATED THAT THE VEHICLE CAUGHT ON FIRE FROM UNDER THE HOOD WHILE DRIVING AN UNKNOWN SPEED. THE CONTACT WAS ABLE TO MOVE OFF THE ROADWAY AND CALLED THE FIRE DEPARTMENT, WHO EXTINGUISHED THE FIRE. A FIRE REPORT WAS FILED OF THE INCIDENT. THE VEHICLE WAS DEEMED AS DESTROYED BY THE CONTACT'S INSURANCE AGENCY. THE FAILURE AND CURRENT MILEAGES WERE 135,000.",
        "vin": "KNDUP131446"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/24/2013",
        "dateOfIncident": "07/01/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10531691,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "ABS MODULE IS DEAD.  *TR",
        "vin": "KNDUP131X46"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEATS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/04/2013",
        "dateOfIncident": "12/26/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10501254,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "VAN DOES NOT STAY STARTED. SENSOR CONTROL AND SHORT ON SEATS.  *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "01/22/2013",
        "dateOfIncident": "01/17/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10493816,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 KIA SEDONA. THE CONTACT STATED THAT WHILE EXITING A CAR WASH, SHE SHIFTED FROM NEUTRAL TO DRIVE WITH THE BRAKE PEDAL DEPRESSED WHEN THE VEHICLE SUDDENLY ACCELERATED ON INDEPENDENTLY. THE VEHICLE THEN TRAVELED OVER A CURB BEFORE CRASHING INTO A TREE. THE VEHICLE CONTINUED TO ACCELERATE AND CAME TO A STOP WHEN THE FRONT AND REAR TIRES BECAME FLAT AND THE CONTACT SHIFTED INTO NEUTRAL. BOTH THE CONTACT AND A FRONT PASSENGER SUSTAINED BRUISING FROM THE CRASH AND WERE TRANSPORTED VIA AMBULANCE TO A HOSPITAL FOR TREATMENT OF THEIR INJURIES. THE VEHICLE WAS TOWED TO A SALVAGE YARD. THE VEHICLE WAS DESTROYED. THE APPROXIMATE FAILURE MILEAGE WAS 78,000.",
        "vin": "KNDUP131746"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/01/2012",
        "dateOfIncident": "02/02/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10486690,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS HAS HAPPENED 3 TIMES, THE LATEST IN NOVEMBER WHILE ON THE INTERSTATE, DURING RUSH HOUR, GOING 60 MILES PER HOUR. MY VAN KEEPS DYING WHILE I'M DRIVING WHETHER IT WAS A SENSOR OR OUT OF GAS, WHATEVER THE REASON, WHEN POWER GOES OUT, THE BRAKE LOCKS UP AND I HAVE NO CONTROL TO SLOW DOWN OR STOP THE VAN. IT HAS TO COAST UNTIL IT STOPS ON ITS OWN. THE LAST TIME TOOK ME A MILE AND HALF TO FINALLY STOP. THIS IS VERY DANGEROUS AND COULD CAUSE INJURY/AND OR DEATH IF THERE ARE OTHER VEHICLES IN FRONT OF ME.  *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/05/2012",
        "dateOfIncident": "10/04/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10478695,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING IN MOUNTAINS IN SOUTHWEST IN OCTOBER USING CRUISE CONTROL AT 60 MPH. THE CRUISE WAS DISENGAGED BY THE DRIVER AS A TURN APPROACHED. VEHICLE SUDDENLY ACCELERATED FULLY. BRAKES DID NOT SLOW IT AND THEY BECAME UNRESPONSIVE. DRIVER PUT VEHICLE IN NEUTRAL AND ENGINE CONTINUED TO REV PAST 6000 RPM'S. IN NEUTRAL, VEHICLE WAS ABLE TO COAST TO A STOP. AFTER A TOW TO A REPAIR SHOP, THE MECHANIC FOUND THE CRUISE CONTROL ASSEMBLY BROKE AND THE CABLE CONNECTED TO THE THROTTLE RECOILED PULLING THE THROTTLE WIDE OPEN. THE MECHANIC DISENGAGED THE CRUISE CONTROL CABLE FROM THE THROTTLE AND THE VEHICLE COULD BE DRIVEN NORMALLY WITHOUT CRUISE.  *TR",
        "vin": "KNDUP131246"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/28/2012",
        "dateOfIncident": "08/14/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10472771,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "FIRESTONE",
                "productModel": "AFFINITY TOURING",
                "productYear": "9999",
                "size": "P215/70R15",
                "type": "Tire"
            }
        ],
        "summary": "ON TUESDAY, AUGUST 14, 2012, MY WIFE TOOK OUR GRANDDAUGHTER SHOPPING.  AFTER DROPPING HER OFF AT HOME, MY WIFE PROCEEDED TO DRIVE ~30 MILES HOME.  ON THE WAY SHE NOTED A THUMPING SOUND COMING FROM THE FRONT PASSENGER SIDE TIRE.  SHE STOPPED AT A GAS STATION ABOUT HALFWAY HOME TO CALL ME AND ASK THAT I COME OUT TO CHANGE THE TIRE.  AT THAT TIME SHE NOTED A BLISTER IN THE TIRE SIDEWALL.  MOMENTS LATER THERE WAS A LOUD BANG AND THE TIRE BLEW OUT WHILE SITTING AT THE GAS STATION.    THE FOLLOWING DAY I TOOK THE VEHICLE BACK TO THE FIRESTONE DEALER WHERE THE TIRES WHERE PURCHASED IN THE FALL OF 2010.  AFTER LISTENING TO A LITANY OF EXCUSES FOR THE FAILURE, INCLUDING; SHE (MY WIFE) MUST HAVE HIT A POT HOLE, TIRES WERE UNDER INFLATED, FRONT WHEELS WERE NOT ALIGNED, TIRES HAD NOT BEEN ROTATED, FINALLY THE SALESPERSON CONCEDED THAT THE TIRE SHOULD NOT HAVE BLOWN OUT.  THE BAD TIRE WAS REPLACED AT MINIMUM EXPENSE TO ME, BUT I PAID FOR MOST OF THE OTHER FRONT TIRE, IN ORDER TO HAVE TWO TIRES WITH SIMILAR WEAR ON THE FRONT OF THE VEHICLE.  *TR",
        "vin": "KNDUP131446"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/24/2012",
        "dateOfIncident": "05/17/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10467191,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MULTIPLE INSTANCES WHERE VEHICLE HAS BEEN UNABLE TO START.  WILL SUBSEQUENTLY TURN OVER FOR A PERIOD OF ABOUT 5 SECONDS AND FINALLY \"CATCHES\" AND WILL RUN ROUGH.  UPON DRIVING THE VEHICLE WILL RUN ROUGH, HESITATE AND STALL, MOSTLY AT TIMES DURING A FULL STOP ATTEMPTING TO ACCELERATE TO NORMAL DRIVING SPEED IN TRAFFIC AND THROUGH TURNING.  UPON INSPECTION AT DEALERSHIP, NO FAULTY PARTS FOUND AND CONDITION \"DISAPPEARS\".  UPON RECEIPT OF VEHICLE FROM DEALERSHIP, PROBLEM HAS CONTINUED TO PLAGUE VEHICLE.  REPLACED MANY PARTS UNDER THE ADVISEMENT OF THE DEALERSHIP AND HAVE NEVER FOUND A SOLUTION TO THE PROBLEM.  NO CHECK ENGINE CODE PRESENT DURING PROBLEM.  HAS LEFT FAMILY STRANDED ON MORE THAN A FEW OCCASIONS MAKING VEHICLE UNRELIABLE AND UNSAFE TO OPERATE.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/17/2012",
        "dateOfIncident": "01/18/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10455481,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 KIA SEDONA. THE CONTACT WAS DRIVING 2 MPH AND ATTEMPTING A RIGHT TURN WHEN THE STEERING WHEEL SEIZED. THE VEHICLE WAS TAKEN TO THE DEALER AND A PRIVATE MECHANIC. THE MECHANIC ADVISED THAT THE RACK AND PINION FAILED AND NEEDED TO BE REPLACED. THE MANUFACTURER WAS NOT CONTACTED AND THE VEHICLE WAS REPAIRED. THE FAILURE MILEAGE WAS 83,325 AND THE CURRENT MILEAGE WAS 85,000.",
        "vin": "KNDUP131846"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/13/2012",
        "dateOfIncident": "03/05/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10452019,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "CPSC#I1230221A. 2004 KIA SEDONA. CONSUMER STATED HE WAS HAVING DIFFICULTY IN STARTING THE VEHICLE DUE TO STALLING. THE VEHICLE WILL SHUT OFF WHILE IDLING AND WHILE DRIVING. LOSS OF POWER RESULTS IN DIFFICULTY IN STEERING THE VEHICLE. *LN  THE CONSUMER STATED NONE OF THE REPAIRS, HAVE FIXED THE STALLING ISSUE.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/31/2011",
        "dateOfIncident": "05/31/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10433629,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA EX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STEERING STARTED TO BECOME DIFFICULT WHILE DRIVING ,INTERMITTENTLY DANGEROUS WHEN YOU NEVER KNEW IT WAS GONNA HAPPEN.  EVENTUALLY JUST STOPPED WORKING ALL TOGETHER ,I DID ALOT OF ONLINE RESEARCH AND FOUND OUT THIS IS A VERY COMMON PROBLEM ,WITH THE STEERING KNUCKLE BINDING BECAUSE OF CORROSION .  ALL AND ALL THINK THE VEHICLE WAS VERY WELL THOUGHT OUT AND ALOT OF AMENITIES ARE AWESOME IN THIS VEHICLE ,WHY DOESN'T KIA JUST OFFER A RECALL ,SINCE THEY HAVE ALREADY POSTED A BULLETIN FOR THIS? CALL THE DEALERSHIP AND REALIZE THIS PART IS ALWAYS ON BACK ORDER COME ON KIA MAN UP.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/31/2011",
        "dateOfIncident": "08/31/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10433727,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "INCREASED STEERING EFFORT NOTED.  RESEARCHED AND FOUND NHTSA ACTION # 10027724, AND FOUND IT WAS OPENED AND CLOSED TWICE.  THE ACTION APPEARED TO BE RELATED THE INTERMEDIATE STEERING SHAFT AND ASSOCIATED UNIVERSAL JOINT.  LUBRICATING THE INTERMEDIATE SHAFT UNIVERSAL JOINT APPEARED TO SLIGHTLY LESSEN STEERING EFFORT.  *TR",
        "vin": "KNDUP131346"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/04/2011",
        "dateOfIncident": "07/11/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10428691,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WHEEL BEARINGS DISINTEGRATED AND CAUSED THE WHOLE HUB TO COME OFF. LUCKILY WE WERE RIGHT AROUND THE CORNER FROM OUR DESTINATION AND WEREN'T GOING VERY FAST.  *TR",
        "vin": "KNDUP131446"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/04/2011",
        "dateOfIncident": "09/14/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10428693,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "VAN WAS MAKING A HIGH-PITCHED WHINING SOUND. TOOK IT IN AND FOUND THAT THE WATER PUMP NEEDED REPLACEMENT. THEY TESTED IT AND IT WAS STILL NOT RUNNING PROPERLY SO THEY DUG A LITTLE DEEPER AND FOUND THAT THE COILS AND WIRING NEEDED TO BE REPLACED. GOT THE VAN BACK IN WORKING CONDITION AND LESS THAN TWO DAYS LATER, THE CHECK ENGINE LIGHT COMES ON. TOOK IT BACK AND THEY SAID IT NEEDED A NEW CATALYTIC CONVERTER. THANKS TO LAWS IN THE STATE OF CALIFORNIA, WE CANNOT REPLACE WITH AN AFTERMARKET ($200); INSTEAD WE WERE QUOTED $1K, AND THAT APPARENTLY IS ON THE CHEAP SIDE. THE GOV.'T HAS A WARRANTY PROGRAM TO REPLACE CATALYTIC CONVERTERS ON VEHICLES 80,000 MILES OR LESS. WE WERE JUST OUT OF THAT LIMIT. TOO BAD FOR US. WE'RE TRADING IT IN.  *TR",
        "vin": "KNDUP131446"
    },
    {
        "components": "STEERING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/21/2011",
        "dateOfIncident": "06/21/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10407682,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 KIA SEDONA.  THE CONTACT STATED THAT WHILE ATTEMPTING A LEFT TURN, THE STEERING WHEEL LOCKED MAKING IT DIFFICULT FOR THE CONTACT TO TURN THE WHEEL.  THE CONTACT TAPPED ON THE BRAKES AND THEN THE ACCELERATOR IN ORDER FOR THE STEERING WHEEL TO UNLOCK.  THE DEALER WAS NOTIFIED OF THE FAILURE BUT THE VEHICLE WAS NEITHER DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE.  THE FAILURE AND CURRENT MILEAGE WAS 61,000.   THE CONSUMER ALSO STATED THE VEHICLE JERKS AND THE POWER STEERING PROBLEM HAS WORSENED SIGNIFICANTLY. UPDATED 07/19/11",
        "vin": "KNDUP131746"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/03/2011",
        "dateOfIncident": "04/20/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10398838,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STEERING IN MY 2004 KIA SEDONA IS MALFUCTIONING. WHEN TURNING THE STEERING WHEEL IT NOW TAKES A GREAT AMOUNT OF EFFORT SOME OF THE TIME. IT COMES AND GOES. AS YOU TURN THE WHEEL IT GOES FROM EASY TO VERY DIFFICULT AND YOU NEVER KNOW WHEN IT WILL HAPPEN. AFTER A TURN YOU MUST TURN THE WHEEL BACK TO GO STRAIGHT OR IT WILL CONTINUE TO TURN. THESE 2 PROBLEMS ARE VERY DANGEROUS AS I COULD CAUSE AN ACCIDENT JUST BY MAKING A TURN.  *TR",
        "vin": "KNDUP131546"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/26/2011",
        "dateOfIncident": "04/23/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10397975,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING BINDING. WAS TOLD AT THE KIA DEALERSHIP THAT THEY HAVE HAD PROBLEMS WITH STEERING IN SEDONAS NOW I AM PAYING A HIGH PRICE TO GET VEHICLE FIXED. I ASKED WHY ISNT IT ON RECALL LIST THEY SAID THEY DONT HAVE ANYTHING TO DO WITH IT. I AM LEASING A 2004 KIASEDONA. I HAVE HAD PROBLEM WITH TURNING THE STEERING WHEEL TO THE LEFT AS FOUND IN OTHER COMPLAINTS AND WAS TOLD THE RACK AND PINION STEERING NEEDED TO BE FIXED.  *TR",
        "vin": "KNDUP131846"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "04/08/2011",
        "dateOfIncident": "04/03/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10395300,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "PEP BOYS",
                "productMake": "PEP BOYS",
                "productModel": "DEFINITY EX600",
                "productYear": "9999",
                "size": "P215/60R16",
                "type": "Tire"
            }
        ],
        "summary": "75,000 MILE TIRES COMING APART AFTER 23,844 MILES !  AFTER VISITING RELATIVES IN STUART FLA ON OUR WAY HOME ON I-95 HEADING SOUTH TO POMPANO BEACH AT 70MPH OUR VAN STARTED TO VIBRATE VICIOUSLY IN THE REAR,I PULLED OFF THE HIGHWAY TO CHECK THE TIRES,I THOUGHT ONE OF THE REAR WHEELS CAME LOOSE I JUST HAD IT IN AT THE POMPANO BEACH PEPBOYS FOR A TIRE ROTATION AND FRONTEND ALIGNMENT,AFTER CHECKING ALL THE WHEEL NUTS ON THE REAR AND FRONT WHEELS I FOUND NONE TO BE LOOSE.  I DID NOT HAVE A FLASHLIGHT TO INSPECT THE TIRES WITH US,I HAD TO WAIT TILL WE ARRIVED HOME SO I COULD SEE WHAT HAD HAPPENED TO THE TIRES,I HAD TO KEEP THE SPEED DOWN TO 55 MPH BECAUSE OF THE BAD VIBRATION TO MAKE IT HOME THIS WAS AT 9PM SUNDAY NIGHT.  MONDAY MORNING I INSPECTED THE TIRES,I FOUND THE TIRES TO HAVE CRACKS ALL AROUND BOTH SIDES OF THE TIRES WHERE THE TREAD COMES TOGETHER WITH THE SIDEWALL.  THE LEFT REAR TIRE IS THE WORST,THE TREAD HAS A BULGE THE SIZE OF A FOOTBALL NEXT TO THE SIDEWALL.  I FELL THAT ALL OF THE TIRES ON MY VAN NOT TO BE SAFE TIRES AND I DON'T TRUST THEM.  *TR",
        "vin": "KNDUP131346"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/16/2011",
        "dateOfIncident": "03/16/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10390442,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA EX",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "INSIGNIA SE200",
                "productYear": "9999",
                "size": "P215/70R15",
                "type": "Tire"
            }
        ],
        "summary": "BRIDGESTONE INSIGNIA SE200 SIZE P215/70R15 65K MILE TIRES SET OF 4 PURCHASED. MAY 2009 WITH 77,567 MILES ON VEHICLE. DATE ON TIRE IS 2108 SO THEY APPEAR TO HAVE BEEN A YEAR OLD WHEN INSTALLED AT COYOTE TIRE SHOP IN GLENDALE AZ. DRIVING IN 80 DEGREE WEATHER 70MPH IN A KIA SEDONA WITH 2 ADULTS AND ONE 6YR OLD CHILD INSIDE. TREAD  SEPARATED FROM TIRE. WAS ABLE TO PULL TO SIDE OF ROAD.  AIR NEVER ESCAPED FROM TIRE. STILL HAS 32LBS IN IT COLD.  TIRE TREAD DESTROYED REAR BUMPER OF VEHICLE UPON SEPARATION. NO PRIOR HANDLING OR VIBRATIONS OCCURRED.  ODOMETER READ 104235 AT TIME OF INCIDENT SO THE TIRE ONLY HAD 26,668 MILES ON IT.  DOT NUMBER: Y7M3    MODEL YEAR 2004  MAKE KIA  MODEL SEDONA EX    VEHICLE IDENTIFICATION NUMBER: N/A TIRES WERE AFTERMARKET.  *TR",
        "vin": "KNDUP131946"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/15/2011",
        "dateOfIncident": "02/28/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10390182,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING SEEMS TO FADE IN AND OUT INTERMITTENTLY. I LOOKED ONLINE AND SEE THAT THERE AREA A LOT OF KIA SADONA OWNER THAT ARE HAVING THE SAME ISSUE HOWEVER THERE IS NO RECALL. THIS IS A SAFETY CONCERN AND THIS SHOULD BE TAKEN CARE OF NOW BEFORE SOME ONE GETS KILLED.  *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/15/2011",
        "dateOfIncident": "07/15/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10390197,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2004 KIA SEDONA HAS HAD AN \"AIR BAG\" LIGHT ON THE DASH FOR SOME TIME. IT HAPPENED WHILE IT WAS IN THE ORIGINAL WARRANTY PERIOD, BUT THE DEALER DID NOT HAVE THE PARTS NECESSARY TO COMPLETE THE REPAIR. HE SAID THEY WOULD ORDER THEM AND CALL ME WHEN THEY ARRIVED. AFTER SEVERAL WEEKS WITH NO CALL WE WENT BACK TO THE DEALER AND WERE TOLD THAT SINCE WE DID NOT COME BACK, THEY THOUGHT WE NO LONGER NEEDED THE PARTS AND USED THEM ON SOMEONE ELSE'S VEHICLE. WE PROTESTED AND TOLD THEM TO GET THEM AGAIN. WHEN THEY ARRIVED, WE WENT BACK TO GET THE REPAIRS DONE. AT THIS TIME, WE WERE TOLD THAT THE WARRANTY HAD EXPIRED AND THE EXTENDED WARRANTY WOULD NOT COVER IT AND THE COST WOULD BE SEVERAL HUNDRED DOLLARS. THE EXTENDED \"BUMPER TO BUMPER\" WARRANTY FROM ZURICH AMERICAN COST $1,000.00 AND WAS TOTALLY A WASTE OF MONEY. THE VAN WAS IN WARRANTY WHEN THE PROBLEM WAS FIRST REPORTED. A CALL TO KIA PRODUCED NOTHING. THEY SAID THAT IT WAS UP TO THE DEALER.  *TR",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/06/2011",
        "dateOfIncident": "02/10/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10386581,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA EX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2004 KIA SEDONA WHICH I HAVE REPLACE HEADLIGHTS SO MANY TIMES, NOW THERE IS A PROBLEM WITH THE REAR LIGHTS, WHEN I TURN HEADLIGHTS ON THERE ARE NO BACK LIGHTS. YOU WANT TO TALK ABOUT DANGEROUS DRIVING AT NIGHT. APPARENTLY YOU CAN REPLACE THE FUSE BUT THERE IS NO GUARANTEE THAT THE FUSE WILL NOT BLOW AND HOW ARE YOU TO KNOW WHEN YOU ARE DRIVING AT NIGHT AS THE DASH LIGHTS STAY ON. PLEASE LET ME KNOW IF ANYONE ELSE HAS HAD THIS MAJOR PROBLEM. THIS HAS HAPPENED SEVERAL TIMES AND NOW I HAVE TO PAY $500.00 TO GET THIS MODULAR REPLACED.  *TR",
        "vin": "KNDUP131846"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/28/2011",
        "dateOfIncident": "01/25/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10379443,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2004 KIA SEDONA 3.5L THAT I PURCHASED ON 08-31-2010 WITH 53638 MILES ON IT.  ON 01-25-2011 AS I WAS DRIVING I HEARD A RATTLING FROM THE ENGINE COMPARTMENT.  I STOPPED TO OPEN THE HOOD AND CONFIRM THAT IT WAS COMING FROM THE ENGINE, IT WAS.  I DROVE TO THE NEAREST AUTO MECHANIC AND HAD IT DIAGNOSED TO BE TOLD THAT I HAD A BLOWN ENGINE AND IT WOULD HAVE TO BE REPLACED.  I HAD IT TOWED TO HE LOCAL KIA DEALERSHIP TO BE LOOKED AT FURTHER.  THE ENGINE WAS OPENED UP TO BE INSPECTED.  I WAS TOLD THAT THE #6 CYLINDER WAS COMING APART AND THAT I WOULD HAVE TO REPLACE THE ENGINE.  THE VAN CURRENTLY HA ONLY 59430 MILES ON IT.  IT IS UNDER THE 60000 MILE WARRANTY MARK BUT OVER THE 5 YEAR PORTION.  I HAVE BEEN MADE AWARE THAT THERE WAS A KIA SERVICE BULLETIN THAT MENTIONED THAT THE 2004 KIA SEDONA 3.5L ENGINE HAD SCORING ON THE #6 CYLINDER FROM THE MANUFACTURING PROCESS WHICH ALSO RESULTED IN A GASKET DEFECT OR MALFUNCTION.  THIS CLEARLY SHOULD BE COVERED UNDER WARRANTY SERVICE.  THIS IS NOT THE ONLY CASE OF THIS SPECIFIC PROBLEM WITH THE #6 CYLINDER.  *TR",
        "vin": "KNDUP131946"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/29/2010",
        "dateOfIncident": "12/28/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10373352,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2004 KIA SEDONA THE REAR COOLANT LINES HAVE FAILED AND NOW I AM LEAKING COOLANT AND IT WILL COST $1000 TO FIX. IT HAPPENED ALL OF A SUDDEN. NOW I CAN'T DRIVE MY CAR SAFELY.  *TR",
        "vin": "KNDUP131846"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "11/17/2010",
        "dateOfIncident": "11/14/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10366508,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 KIA SEDONA. WHILE DRIVING APPROXIMATELY 65 MPH, THE CONTACT HEARD A LOUD CRACKING NOISE. A FEW MOMENTS LATER, HE HEARD A LOUD EXPLOSION. THE CONTACT PULLED OVER AND NOTICED THAT THERE WAS A HOLE IN THE REAR PASSENGER SIDE HUB AND THE BEARING WAS MISSING. THE VEHICLE WAS TOWED TO AN AUTHORIZED DEALER WHERE THE CONTACT WAS INFORMED THAT THE VEHICLE WAS NOT INCLUDED IN RECALL 05V232000 (WHEELS). THE VEHICLE HAD NOT BEEN REPAIRED. THE CURRENT AND FAILURE MILEAGES WERE APPROXIMATELY 97,000.",
        "vin": "KNDUP131046"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/22/2010",
        "dateOfIncident": "06/22/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10361707,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 KIA SEDONA. WHILE TRYING TO MAKE A TURN THE RACK A PINION STEERING MADE A CLANGING NOISE IN STAGES, JERKS BACK AND FORTH AND BECAME VERY HARD TO TURN. THE DEALER WAS CALLED AND INFORMED HIM THAT THE WARRANTY EXPIRED AND HE HAD TO PAY FOR THE REPAIRS. THE MANUFACTURER WAS CALLED AND CONFIRMED THAT THE WARRANTY EXPIRED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 55,000.",
        "vin": "KNDUP131X46"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/14/2010",
        "dateOfIncident": "08/02/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10355445,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA EX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE: 2004 KIA SEDONA  AT 47K MILES ROARING NOISE COMING FROM REAR-END. NOTIFIED KIA SINCE THERE WAS A RECALL ON CERTAIN 2004 MODELS BUT THEY SAID MY VEHICLE WAS NOT PART OF THE RECALL...GO FIGURE. I HAD MY LOCAL AUTO REPAIR SHOP REPLACE BOTH INNER AND OUTER WHEEL BEARINGS ON THE REAR AXLE.  THEY SHOWED ME THE OLD BEARINGS WHICH WERE RUSTY AND HAD PITS. IT APPEARS THAT ALL 2004 MODELS SHOULD HAVE BEEN INCLUDED IN THIS RECALL. *TR",
        "vin": "KNDUP131546"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/10/2010",
        "dateOfIncident": "01/01/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10354843,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 KIA SEDONA. WHILE DRIVING APPROXIMATELY 45 MPH SHE HEARD A ROARING NOISE COMING FROM THE WHEELS. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE SHE WAS INFORMED SHE NEEDED NEW WHEEL BEARINGS ON ALL FOUR WHEELS.  THE MANUFACTURER WAS NOTIFIED AND SHE WAS INFORMED HER VEHICLE WAS NOT INCLUDED IN THE RECALL ASSOCIATED WITH NHTSA CAMPAIGN ID NUMBER  05V232000, WHEELS. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 78,000 AND THE CURRENT MILEAGE WAS 90,000.",
        "vin": "KNDUP131246"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "08/27/2010",
        "dateOfIncident": "08/20/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10352317,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 KIA SEDONA. THE CONTACT STATED THAT AS SHE EXITED THE VEHICLE, THE FRONT DRIVER POWER SEAT INDEPENDENTLY MOVED FORWARD AND UNDER THE STEERING WHEEL. THE CONTACT WAS UNABLE TO MOVE THE SEAT BACK IN PLACE. THE DEALER STATED THAT THE MOTOR SWITCH HAD FAILED. THE VEHICLE WAS NOT UNDER RECALL AND ANY REPAIRS WOULD BE AT HER EXPENSE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 80,000.",
        "vin": "KNDUP131746"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/18/2010",
        "dateOfIncident": "04/06/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10350418,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2004 KIA SEDONA STEERING COLUMN DISINTEGRATED CAUSING STEERING FAILURE. IT HAD TO BE COMPLETELY REPLACED AT MY COST. *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/26/2010",
        "dateOfIncident": "07/24/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10345265,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 KIA SEDONA.  STEERING THIS VEHICLE BECAME EXTREMELY DANGEROUS WHEN EXECUTING TURNS, ESPECIALLY EXITING FROM HIGHWAYS.  STEERING FEELS AS IF IT IS BINDING AND ABOUT TO SEIZE.  STEERING WHEEL WILL NOT RETURN TO CENTER WITHOUT SIGNIFICANT DRIVER EFFORT.  THE PROBLEM IS MORE NOTICEABLE WHEN APPLYING THE BRAKES.  KIA SIMPLY ADVISED ME THE VEHICLE IS OUT OF WARRANTY AND THE STEERING MECHANISM IS NOT PART OF THE DRIVE TRAIN.  THE REPAIR SHOP INDICATES THE STEERING SYSTEM NEEDS REPLACEMENT OF THE RACK AND PINION MECHANISM.  THIS VEHICLE WAS PURCHASED NEW IN NJ AND IT HAS BEEN USED PRIMARILY IN NJ AND THE NORTHEAST; THE VEHICLE IS USED AS THE FAMILY CAR WITH MOST DRIVING DONE LOCALLY WITHIN TOWN.  MILEAGE IS APPROX 63,000.  THE PROBLEM IS NOT RELATED TO THE POWER STEERING FLUID OR PUMP.  THE STEERING MECHANISM IS ABOUT THE MOST BASIC AND CRITICAL SAFETY SYSTEM ON A CAR NEXT TO THE BRAKES.  PRIOR INVESTIGATIONS LISTED ON THE NHTSA SITE MENTION A PROBLEM RATE 11 TIMES HIGHER IN SALT BELT STATES (MY VEHICLE HAD TO HAVE THE REAR WHEEL BEARINGS REPLACED FOR THIS ISSUE VIA A SAFETY RECALL).   IT SEEMS THIS IS SOMETHING THE CAR MANUFACTURER NEEDS TO RECONSIDER. *TR",
        "vin": "KNDUP131546"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "07/20/2010",
        "dateOfIncident": "07/19/2010",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10344195,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 KIA SEDONA. WHILE DRIVING APPROXIMATELY 40 MPH THE CONTACT SMELLED A STRONG BURNING ODOR AND SMOKE EMITTED FROM THE VENTS. SUDDENLY, THE CONTACT DROVE THE VEHICLE ONTO THE EMERGENCY LANE. THE CONTACT STATED WHEN THE DRIVER SIDE JUNCTION BOX COVERING WAS REMOVED IT WAS ON FIRE. THE POLICE EXTINGUISHED THE FIRE. A POLICE REPORT WAS NOT FILED. THE CONTACT EXPERIENCED THE CONSEQUENCES RELATED TO THE FIRE AS MENTIONED IN NHTSA RECALL CAMPAIGN ID NUMBER 05V463000 (SEATS). THE CONTACT WAS IN THE PROCESS OF NOTIFYING THE MANUFACTURER REGARDING THE RECALL. THE VEHICLE WAS TOWED TO A RECOVERY FACILITY. THE VEHICLE HAD NOT BEEN INSPECTED BY THE INSURANCE COMPANY. THE FAILURE MILEAGE WAS APPROXIMATELY 120,000.",
        "vin": "KNDUP131446"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEATS,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "05/05/2010",
        "dateOfIncident": "03/20/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10328938,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA EX",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "ON OR ABOUT MARCH 20, 2010, WHILE MY WIFE WAS OPERATING OUR 2004 KIA SEDONA VAN, THE LEFT FRONT (DRIVERS  SEAT) POWER SEAT MOVED ALL THE WAY FORWARD WHILE VEHICLE WAS IN MOTION.  DRIVER DID NOT INITIATE ACTION. SEAT COULD NOT BE MOVED TO THE REARWARD POSITION. MILEAGE AT THIS TIME (MARCH 2010 WAS 50,599) THIS SAME ACTION OCCURRED ON ONE PREVIOUS OCCASION(WHILE I WAS DRIVING THE VEHICLE) ON OR ABOUT FEBRUARY 17, 2009, AT THAT TIME THE VEHICLE WAS TAKEN TO LAFOUNTAINE KIA, DEARBORN, MICHIGAN FOR SERVICING. VEHICLE MILEAGE AT THIS TIME WAS 40,431. BASED ON THE INVOICE FOR THAT WORK THE SWITCH BOX ASSEMBLY WAS REPLACED. CURRENTLY THE VEHICLE IS AGAIN AT LAFOUNTAINE KIA FOR REPAIRS.  HOWEVER AT THIS NO WARRANTY EXIST FOR THIS PARTICULAR ITEM.  LAFOUNTAINE STATED THAT PARTS AND LABOR FROM THE FEBRUARY 2009 INCIDENT ARE ONLY COVERED FOR 12 MONTHS/12,000 MILES.  SO  WHAT I HAVE IS A 2004 KIA SEDONA VAN IN WHICH DURING A ROUGHLY 13 MONTH PERIOD THE DRIVERS SIDE POWER SEAT, ON ITS OWN MOVED TO THE FULL FORWARD POSITION AND COULD NOT BE MOVED BACK.  LAFOUNTAINE CLAIMS THEY ARE UNAWARE OF ANY PROBLEMS WITH KIA POWER SEATS.     UPDATED 05/12/10   *BF  THE DEALER CLAIMED THE WIRING PULLED LOOSE FROM THE ELECTRIC SWITCH. THE CAUSE WAS UNKNOWN/ THE SWITCH AND WIRING WERE SPLICED TOGETHER AND THE WRING HARNESS WAS TIE STRAPPED TO THE SEAT MOUNTING TO PREVENT FUTURE OCCURRENCES.  UPDATED 05/14/10.*JB    *TR",
        "vin": "KNDUP131146"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/15/2010",
        "dateOfIncident": "02/28/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10319669,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD THE FRONT WHEEL BEARINGS AND HUBS REPLACED AT 65,000 MILES ON MY 2004 KIA SEDONA UNDER WARRANTY DUE TO PLAY IN THE HUB.  LAST MONTH DURING A BRAKE INSPECTION I WAS INFORMED THAT THEY ARE BAD AGAIN THE VEHICLE NOW HAS 106,000 MILES.  THIS IS A POTENTIAL HAZARD AS WHEN THEY FAIL COMPLETELY THE WHEEL WILL FALL OFF POTENTIALLY CAUSING A SERIOUS ACCIDENT.  I BELIEVE THIS TO BE A DESIGN FLAW SINCE THIS ONLY VEHICLE I HAVE OWNED IN 30 YEARS THAT NEEDED BEARINGS REPLACED EVEN ONCE MUCH LESS TWICE IN 100,000 MILES.  JUST TO LET YOU KNOW THE REAR BEARING WERE REPLACED TWICE ALREADY UNDER WARRANTY ONE TIME UNDER A RECALL AND ANOTHER TIME AS A RESULT OF ANOTHER BRAKE INSPECTION. *TR",
        "vin": "KNDUP131046"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/10/2010",
        "dateOfIncident": "03/09/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10318470,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING SEEMS TO FADE IN AND OUT INTERMITTENTLY. *TR",
        "vin": "KNDUP131446"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/10/2010",
        "dateOfIncident": "01/01/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10318527,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 KIA SEDONA. WHILE DRIVING AT SPEEDS OF 70 MPH THE VEHICLE WOULD CONTINUOUSLY MAKE A JERKING MOTION AND STALL WITHOUT WARNING; HOWEVER, THE PROBLEM WOULD OCCUR INTERMITTENTLY. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THEY COULD NOT DUPLICATE THE FAILURES AND RELEASED THE VEHICLE BACK TO THE OWNER. THE VEHICLE CONTINUED TO STALL INTERMITTENTLY WITHOUT WARNING. THE VEHICLE WAS TAKEN BACK TO THE DEALER A SECOND TIME  AND AGAIN THEY COULD NOT DUPLICATE THE FAILURE. HE THEN TOOK THE  VEHICLE TO AN INDEPENDENT MECHANIC WHO ALSO COULD NOT DETERMINE  THE CAUSE OF THE FAILURE. ON THE THIRD ATTEMPT, A SPECIALIST AT THE DEALERSHIP STATED THAT THE EMISSIONS SENSOR AND THE THROTTLE VALVE WERE REPLACED; HOWEVER, THE FAILURE PERSISTED. THERE WERE NO ADDITIONAL REPAIRS PERFORMED AND THERE WERE NO RECALLS ON THE VEHICLE. THE FAILURE MILEAGE WAS APPROXIMATELY 75,000 AND THE CURRENT MILEAGE WAS 98,000.",
        "vin": "KNDUP131046"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/01/2010",
        "dateOfIncident": "02/01/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10303652,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA EX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE HEARING A GRINDING TYPE NOISE WHEN WE WERE MAKING A TURN SO WE TOOK OUR VEHICLE IN TO THE DEALERSHIP. THEY DIAGNOSED IT AS A BAD RACK AND PINION AND ARE REPLACING IT. I HAVE BEEN TOLD BY NUMEROUS PEOPLE THAT THIS IS NOT SOMETHING THAT SHOULD BE GOING OUT AT 70,000 MILES. AS OF RIGHT NOW, KIA WILL NOT REPLACE IT FOR US. *TR",
        "vin": "KNDUP131746"
    },
    {
        "components": "VISIBILITY,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/24/2009",
        "dateOfIncident": "12/20/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10296916,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT WINDSHIELD FIRST STARTED MAKING CREAKING AND POPPING NOISES. THEN A LEAK BEGAN IN THE SAME AREA OF THE NOISES. WATER LEAKS ONTO THE FLOOR NEAR THE BRAKE PEDAL AND CAUSES A SLIPPERY SURFACE UNDER MY FEET.  NOW I HAVE BEEN TOLD THAT THE ENTIRE WINDOW FRAME OF THE FRONT WINDSHIELD IS MOVING WHEN THE CAR MOVES AND COULD POP OUT OF PLACE OR SHATTER WHILE DRIVING. *TR",
        "vin": "KNDUP131346"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/22/2009",
        "dateOfIncident": "04/23/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10296750,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA EX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM WRITING TO BAND TOGETHER EVERYONE WHO IS READY TO BRING ON A CLASS ACTION LAW SUIT AGAINST KIA FOR THE LIES, BREECH OF WARRANTY, AND DEFECTIVE ENGINES THAT THEY ARE RESPONSIBLE FOR.  I HAVE THE EXACT SAME STORY AS EVERYONE HERE......MY ENGINE BLEW, KIA WOULDN'T HONOR THEIR WARRANTY, SAID IT WAS MY FAULT DUE TO OVERHEATING, AND THE COOLANT RESERVOIR HAD A CRACK IN IT.....SOUND FAMILIAR?  I WAS OUT OVER $8000....I NEED TO RECLAIM MY LOSSES.  WHO'S WITH ME?  PLEASE CONTACT ME .  STACI MINNICK *TR",
        "vin": "KNDJD733445"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/15/2009",
        "dateOfIncident": "07/12/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10295893,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 KIA SEDONA. WHEN MAKING TURNS SHE CAN HEAR A CLINGING NOISE IN THE STEERING COLUMN. ALSO SHE EXPERIENCED DIFFICULTLY STEERING. THE VEHICLE WAS TAKEN TO THE DEALERSHIP FOR INSPECTION. SHE WAS ADVISED THAT THE INTERMEDIATE SHAFT BINDING NEEDED TO BE REPLACED. THE CURRENT AND FAILURE MILEAGES WERE 50000.",
        "vin": "KNDUP131946"
    },
    {
        "components": "SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "12/13/2009",
        "dateOfIncident": "12/11/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10295523,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT 10 MPH ,MY DAUGHTER AND I HEARD A CLUNK IN THE REAR OF OUR 2004 KIA SEDONA LX. I WAS HEADING FOR A REPAIR SHOP AS A RESULT AND HEARD A SECOND CLUNK AND PULLED OFF ON A SIDE STREET AND DROVE 200 FEET WHEN THE WHEEL BEARING ASSEMBLY CAME APART AND THE WHOLE WHEEL FLEW OFF THE VAN. *TR",
        "vin": "KNDUP131X46"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/12/2009",
        "dateOfIncident": "11/06/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10291920,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA EX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2004 KIA SEDONA MINI-VAN.  ON THE EVENING OF NOVEMBER 6, 2009 THE STEERING COLUMN ESSENTIALLY SEIZED ON ME.  THE VAN BECAME EXTREMELY DIFFICULT TO CONTROL ALMOST TO THE POINT WHERE IT WAS UNDRIVEABLE.  THERE WAS NO WARNING OR PREVIOUS INDICATIONS.  I WAS BARELY ABLE TO GET THE VAN TO A SHOP ON SATURDAY, NOVEMBER 7, 2009 WHERE THE MECHANIC FOUND THAT KIA HAD ISSUED A TECHNICAL SERVICE BULLETIN FOR STEERING DIFFICULTIES DUE TO MALFUNCTIONING INTERMEDIATE STEERING COLUMN.  GIVEN THE SEVERE SAFETY IMPLICATIONS OF THIS SITUATION, I BELIEVE THAT KIA SHOULD HAVE ISSUED A RECALL NOTICE AND SHOULD REIMBURSE OWNERS THAT HAVE HAD THE PART REPLACED. *TR",
        "vin": "KNDUP131146"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/28/2009",
        "dateOfIncident": "10/23/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10290164,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "KIA SEDONA 2004-VEHICLE WILL NOT SHUT OFF EVEN WHEN THE KEYS ARE REMOVED FROM THE IGNITION.  THE CAR WILL DRIVE HOWEVER NO FUNCTIONS ON THE DASHBOARD WILL WORK,  LIGHTS, WIPERS, RADIO, HEADLIGHTS ETC.  THIS HAPPENED FOR ABOUT 1 WEEK IN JUNE 2009 AND HERE AND THERE THROUGHOUT THE SUMMER.  I DID HAVE IT TOWED BACK TO THE DEALERSHIP BUT AT THE TIME THEY WERE UNABLE TO IDENTIFY THE PROBLEM AS IT HAD CORRECTED ITSELF.  IT HAPPENED AGAIN THE WEEK OF OCTOBER 21ST. THE BATTERY HAD TO BE DISCONNECTED TO TURN THE VEHICLE OFF.  THEY ARE STILL  UNSURE OF WHAT IS CAUSING THE CAR TO REMAIN ON WITHOUT THE KEY IN THE IGNITION. *TR",
        "vin": "KNDUP131X46"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/05/2009",
        "dateOfIncident": "10/16/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10286332,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "ABOUT A YEAR AGO MY STEERING ON MY 04 KIA SEDONA WAS GETTING TIGHT AND HARD TO TURN, NOW THERE IS A CLICKING NOISE WHEN TURNING THE STEERING WHEEL MY FRIEND HAS AN 03 SEDONA AND HERS DID THE SAME THING IS THIS A RECALL? *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/28/2009",
        "dateOfIncident": "06/01/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10285487,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA EX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 KIA SEDONA EX. SHE HAD TO EXERT GREAT FORCE WHILE TURNING THE STEERING WHEEL. THE VEHICLE WAS TAKEN TO A LOCAL REPAIR FACILITY FOR INSPECTION AND THE MECHANIC REPLACED THE POWER STEERING PUMP, THE RACK AND PINION, AND THE INTERMEDIATE SHAFT. THE MANUFACTURER STATED THAT THEY WOULD NOT ASSUME RESPONSIBILITY FOR THE FAILURE. THE FAILURE MILEAGE WAS 36,000 AND THE CURRENT MILEAGE WAS 41,000.",
        "vin": "KNDUP131446"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/24/2009",
        "dateOfIncident": "08/22/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10281505,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "KIA SEDONA 2004 TRAVELING ABOUT 30 MPH WITH GENTLE ACCELERATION.  CAR WITHOUT USING ACCELERATOR SPED UP TO 40+ MPH AND BRAKES COULD NOT STOP CAR.  CAR STOPPED BY PULLING OVER AND TURNING OFF ENGINE. *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/24/2009",
        "dateOfIncident": "08/22/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10281559,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "COMPLAINT 10281505 PREVIOUSLY FILED.    SEDONA HAD THROTTLE CABLE REPLACED IN OCTOBER 05 AS PART OF KIA SERVICE RECALL.    PROBLEM SAME AS IN COMPLAINT 10139518 FROM SEPT 2005 REPORTED INCIDENT.    THE 2005 AND THIS 2009 INCIDENT DID NOT OCCUR IN THE WINTER IN FREEZING CONDITIONS. *TR",
        "vin": "KNDUP131946"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/11/2009",
        "dateOfIncident": "08/09/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10280057,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA EX",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Cooper Tire & Rubber Co.",
                "productMake": "COOPER",
                "productModel": "COOPER TRENDSETTER SE",
                "productYear": "9999",
                "size": "P175/65/R14",
                "type": "Tire"
            }
        ],
        "summary": "DRIVING ON 8/9/09, CAR STARTED SHAKING, GOING ABOUT 70 MPH.  PULLED TO RIGHT LANE SLOWING DOWN, GOT OFF EXIT RAMP AND ABOUT 30 FEET DOWN LEFT FRONT TIRE BLEW OUT.  TREAD HAD SEPARATED FROM TIRE AND ONCE GOT TO SAFE PLACE TO CHANGE TIRE, MY FRONT QUARTER PANEL AND LEFT FRONT HEADLIGHT WERE DAMAGED. *TR",
        "vin": "KNDUP131X46"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEATS",
        "crash": false,
        "dateComplaintFiled": "07/30/2009",
        "dateOfIncident": "07/21/2008",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10278783,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA EX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TO WHOM THIS MAY CONCERN:  WE ARE A FAMILY OF 6 AND ON JULY 21ST OUR 2004 KIA SEDONA EX CAUGHT ON FIRE. WE HAD JUST DRIVEN IT 2 HOURS BEFORE WITH NO INDICATIONS OF A FIRE. WE HEARD A BLARING HORN AND LOOKED OUT THE WINDOW TO SEE THE NEIGHBOR RUNNING ACROSS THE STREET. WE STEPPED OUT OF THE HOUSE TO FIND OUR VAN IN FLAMES COMING FROM THE DRIVER SIDE. THE WINDOWS WERE ALL UP AND WE WATCHED THE FIRE DIE DOWN AND SMOKE FILL THE AIR. THE POLICE AND FIRE DEPARTMENT CAME AND TOOK PICTURES AND MADE A REPORT. AFTER ALL THAT WAS SAID AND DONE WE BEGAN TO RESEARCH THE INTERNET AND FOUND A RECALL THAT WAS SENT OUT ON OUR VAN BACK IN NOV/DEC 2005. (NHTSA CAMPAIGN ID NUMBER:  05V463000) THE FIRE APPEARS TO HAVE STARTED IN THE FUSE BOX AREA. APPROX. A YEAR BEFORE THE INCIDENT WE HAD STARED HAVING TROUBLE WITH THE PASSENGER SIDE SEAT WORKING ON AND OFF. DUE TO NOT BEING UNDER WARRANTY ANY LONGER WE DECIDED NOT TO GET IT FIXED BECAUSE WE NEVER REALLY USED THE SEAT CONTROLS ON THAT SIDE MUCH. WE WERE UNAWARE OF ANY RECALL ON OUR VEHICLE; IF WE HAD BEEN WE WOULD HAVE DEALT WITH THIS MATTER MUCH DIFFERENTLY. IN ADDITION, WE HAD BEEN HAVING ISSUES FOR APPROX 9 MONTHS WITH THE BATTERY GOING DEAD. WE HAD REPLACED 3 BATTERIES IN 9 MONTHS AND OUR CD PLAYER STOPPED WORKING 3 MONTHS BEFORE THE INCIDENT. WE HAD BEEN IN CONTACT WITH THE DEALERSHIP AFTER THE FIRE AND THEY INFORMED US THEY SUPPOSEDLY FIXED THE RECALL ON JANUARY 11, 2006; A FEW DAYS BEFORE WE PURCHASED THE VEHICLE. WE WERE NEVER INFORMED OF THIS RECALL WHEN WE PURCHASED THE VEHICLE OR SHOWN THE RECALL ON THE CAR FAX. THIS FIRE HAS NOW RESULTED IN OUR FAMILY VEHICLE BEING TOTALED OUT AND OUR FAMILY NOW BEING LEFT WITH NOTHING. WE APPRECIATE YOUR ASSISTANCE WITH THIS MATTER AND THANK YOU.*TR",
        "vin": "KNDUP131946"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "06/15/2009",
        "dateOfIncident": "06/12/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10273784,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 KIA SEDONA.  WHILE DRIVING 45 MPH, THE FRONT DRIVER'S SIDE WINDOW SHATTERED INTO PIECES.  THE CONTACT'S ARM WAS INJURED FROM THE GLASS AND A POLICE REPORT WAS FILED.  SHE STATED THAT THE WINDOW WAS PARTIALLY ROLLED DOWN PRIOR TO THE FAILURE AND NOTHING STRUCK THE GLASS.  THE VEHICLE HAS NOT BEEN TAKEN TO THE DEALER AND THE MANUFACTURER WAS NOT NOTIFIED.  THE CAUSE OF THE FAILURE HAS NOT BEEN DETERMINED.  THE FAILURE MILEAGE WAS 79,460.",
        "vin": "KNDUP131746"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/22/2009",
        "dateOfIncident": "04/17/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10266385,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2004 KIA SEDONA. I AM THE ONLY OWNER.  I STARTED HAVING STEERING PROBLEMS ABOUT 5 DAYS AGO. I ALMOST RAN INTO ANOTHER CAR TURNING THE CORNER. I TOOK IT INTO MY KIA DEALER TO BE TOLD MY STEERING BINDING HAS FAILED. SO NOW I HAVE TO PAY OVER $500 TO HAVE IT REPAIRED, SINCE THIS IS A SAFETY HAZARD. I BELIEVE THIS TO BE A DEFECT ON MY KIA. I WOULD LIKE FOR THEM TO TAKE CARE OF IT AND REIMBURSE ME FOR MY COSTS. *TR",
        "vin": "KNDUP131846"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/08/2009",
        "dateOfIncident": "02/02/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10257989,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, I NOTICED THE STEERING STARTED TO GET MORE AND MORE HARD TO CORRECT WHILE TURNING.  AS YOU ARE TURNING THE WHEEL STICKS, THEN GIVES AND STICKS AGAIN.  WHILE IN THE STUCK POSITION, IF YOU DO NOT TURN THE WHEEL HARDER, THE VAN WILL CONTINUE TO LEAD IN THE DIRECTION.  WE TOOK THE VAN IN FOR INSPECTION, AND WERE TOLD IT WAS THE POWER STEERING PUMP.  THEY REPLACED IT, BUT WE OUT OF THE 60,000 MILE WARRANTY.  THANKFULLY WE BOUGHT THE EXTENDED WARRANTY, SO IT ONLY COST US THE $100 DEDUCTIBLE.  THEY THEN TOLD US THE POWER STEERING BELT NEEDED REPLACED, BUT WAS NOT COVERED UNDER THE EXTENDED WARRANTY.  AFTER WE RECEIVED THE VAN BACK, IT CONTINUED TO DO THE SAME.  WE ARE TAKING THE VAN BACK IN FOR SERVICE AND COMPLAINT TOMORROW.  HOPEFULLY THEY GET IT RIGHT THIS TIME.  THIS IS NOT SOMETHING TO THINK YOU GOT IT RIGHT THE FIRST TIME, HAS TO BE ABSOLUTELY RIGHT THE FIRST TIME.  ESPECIALLY WHEN YOU HAVE 2 SMALL KIDS. *TR",
        "vin": "KNDUP131046"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/28/2009",
        "dateOfIncident": "12/04/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10256609,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA EX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING BINDS WHEEL DOES NOT RETURN FROM CORNERING/TURNING AS IT NORMALLY WOULD. STEERING BINDING MAKES NORMAL HANDLING DIFFICULT. REPAIR SHOP SPRAYED STEERING KNUCKLE/JOINT WITH LUBRICANT BUT AFTER A 2 MONTH PERIOD THE STEERING IS BINDING ONCE AGAIN. THIS IS A RECURRING ISSUE AND A SAFETY HAZARD. *TR",
        "vin": "KNDUP131646"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/12/2009",
        "dateOfIncident": "01/08/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10254713,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA EX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 KIA SEDONA EX. I HAVE HAD THE POWER STEERING PUMP REPLACED (UNDER 60K MILE WARRANTY) BECAUSE STEERING GOT TIGHT AND NOISY. NOW 5 MONTHS LATER (AND OUT OF WARRANTY) THEY TELL ME THE STEERING KNUCKLE (OR UNIVERSAL - NOT VERY SPECIFIC) NEEDS REPLACED AT A COST OF $200. I TOOK THIS TO THE DEALER FOR WARRANTY REPAIR OF THE FRONT HEEL BEARINGS (100K WARRANTY ON THESE) AND FOR EVALUATION OF THE DANGEROUS STEERING. THIS VAN SUDDENLY BECAME VERY DIFFICULT TO STEER, AND YOU ACTUALLY HAVE TO \"UN-STEER\" WHEN GOING AROUND A BEND. THE WHEEL WILL STAY IN THE POSITION YOU STEER IT TO AND WOULD RUN RIGHT OFF THE ROAD IF YOU DO NOT FORCE IT BACK TO CENTER. *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/31/2008",
        "dateOfIncident": "12/18/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10253376,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA EX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2004 KIA SEDONA WITH 85,000 MILES LOST STEERING. I WAS LUCKY I WAS NOT KILLED. REPAIR SHOP STATES THAT THE SHAFT BROKE, RACK AND PINION WENT AND THE CLOCK SPRING WENT. IT APPEARS TO BE A DEFECT. *TR",
        "vin": "KNDUP131446"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/29/2008",
        "dateOfIncident": "10/22/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10247164,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA EX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "PROBLEM WITH THE STEERING. POPPING AND LOUD TIGHT SOMETIMES.    CONCERNED THAT IT COULD BE A SAFETY HAZARD. *TR",
        "vin": "KNDUP131946"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/29/2008",
        "dateOfIncident": "08/28/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10243859,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 KIA SEDONA.  EVER SINCE PURCHASING THE VEHICLE, THE CONTACT HAS HEARD A HUMMING NOISE COMING FROM THE REAR BRAKES WHILE DRIVING 10 MPH.  SHE HAS TAKEN THE VEHICLE TO THE DEALER NUMEROUS TIMES, BUT THEY COULD NOT FIND ANY FAILURES.  THE CONTACT STATED THAT IT SOUNDS AS IF SOMETHING IS WRONG WITH THE REAR BRAKING SYSTEM AND IS CONCERNED OF THE SAFETY RISK INVOLVED.  THE FAILURE MILEAGE WAS 100 AND CURRENT MILEAGE WAS 45,000.",
        "vin": "KNDUP131046"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES, HYDRAULIC,TIRES,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/11/2008",
        "dateOfIncident": "09/11/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10241847,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA EX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 KIA SEDONA EX. THERE IS A HYDRAULIC SYSTEM CONTAINING A RESERVOIR WHICH CONTROLS REAR BRAKE FORCE ON TURNS AND OTHER BRAKING MANEUVERS. THIS RESERVOIR IS SUBJECT TO LEAKS (LOCATION -- BETWEEN REAR WHEELS). LEAKING FROM THIS RESERVOIR AND LOW PRESSURE TRIGGERS THE 'CHECK ENGINE' AND 'BRAKE FAILURE' LIGHTS. TEMPORARY FIX IS TO REFILL THE RESERVOIR, BUT THIS LEAKAGE PROBLEM APPEARS SYSTEMIC FROM MANUFACTURE. IF LEFT UNATTENDED, CONTROL OVER THE REAR BRAKING SYSTEM IS SEVERELY DIMINISHED. *TR",
        "vin": "KNDUP131646"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/31/2008",
        "dateOfIncident": "07/13/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10240490,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA EX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I, LIKE OTHERS ON THIS SITE, HAVE TAKEN MY KIA TO THE DEALER FOR BRAKES ISSUES. GRINDING AND STUTTERING WHILE BRAKING. KIA HAS \"CORRECTED\" THE PROBLEM THREE TIMES, AND ALL THREE TIMES HAVE TOLD ME IT WAS RESOLVED.  THE  FOURTH TIME I WAS TOLD IT WAS NO LONGER A \"PROBLEM\" THAT IT WAS INDICATIVE OF THE BRAKE SYSTEM!  MY SERVICE MANAGER AT THE KIA DEALERSHIP INFORMED ME THAT KIA IS WELL AWARE OF  THE PROBLEM , BUT CHOOSES TO IGNORE IT, AND THAT HE HAS HAD QUITE A FEW CUSTOMERS WITH THE SAME ISSUES.  THIS PROBLEM HAS BEEN ONGOING SINCE OUR PURCHASE OF THE CAR IN FEB 2004.  *TR",
        "vin": "KNDUP131346"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/18/2008",
        "dateOfIncident": "08/14/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10238760,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 KIA SEDONA.  WHILE DRIVING BETWEEN 45-55 MPH, THE CONTACT NOTICED A LOUD ROARING NOISE AND VIBRATION IN THE VEHICLE.  SHE PULLED THE VEHICLE OVER AND CALLED THE MECHANIC.  THE MECHANIC ADVISED HER TO CHECK THE LUGS TO SEE IF THE WHEELS WERE ON TIGHT.  SHE DROVE TO THE NEXT TOWN AND STOPPED AT A REPAIR SHOP.  THE MECHANIC DROVE AROUND THE BLOCK AND STATED THAT THE WHEEL BEARING APPEARED TO BE DEFECTIVE.  THE DEALER STATED THAT HER VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN ID NUMBER 05V232000 (WHEELS).  THE CURRENT AND FAILURE MILEAGES WERE APPROXIMATELY 77,000.",
        "vin": "KNDUP131546"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/12/2008",
        "dateOfIncident": "07/14/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10237828,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE FLOORBOARD GOT HOT AND MELTED THE WIRING HARNESS UNDER CARPET.  KIA DEALER FOUND NO CAUSE FOR THE EXCESSIVE HEAT BUT REPLACED THE WIRING AT MY EXPENSE. *TR",
        "vin": "KNDUP131X46"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/22/2008",
        "dateOfIncident": "05/15/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10235378,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "UNSURE WHY THE FRONT RIGHT STRUT WENT OUT ON MY 2004 KIA SEDONA MINIVAN.  STRUT WILL NEED TO BE REPLACED.  *TR",
        "vin": "KNDUP131246"
    },
    {
        "components": "SERVICE BRAKES, AIR",
        "crash": false,
        "dateComplaintFiled": "06/10/2008",
        "dateOfIncident": "06/10/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10230518,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "IN MARCH OF THIS YEAR WE HAD THE SIXTH VISIT TO THE KIA DEALER IN REFERENCE TO BRAKES PULSATING  WHILE COMMING TO A STOP AT ABOUT40 MPH  IN THE PAST THE RESURFACE  THE ROTORS  AND ADJUST HE BREAKES AT ONE TIME THEY REPLACE THE ROTORS   STILL HAVE THE SAME PROBLEM IF FEELS LIKE THE CALIPER ARE STUCK AND MAKE A RUBBING SOUND AND THE CALIPERS START TO WORP AND TO VIBRATE MORE AND MORE , THE DEALER ACCUSE MY WIFE OF HEAVY FOOT  SHE TRAVELS 15 MILES TO WORK EVERY DAY WITH NOT MUCH STOPPING , WE ARE JUST ABOUT TO GO BACK TO THE DEALER TO HAVE THEM LOOK AT THE PROBLEM THE LAST TIME WE WENT THEY REPLACE THE BRAKE SHOES . WE DONT KNOW WHAT TO DO.",
        "vin": "KNDUP131946"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/14/2008",
        "dateOfIncident": "07/16/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10227710,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WE PURCHASED A 2004 KIA SEDONA IN JULY OF THAT YEAR, AND WHEN WE HAD 33,000 MILES ON IT , IT WAS ON ITS THIRD SET OF FRONT BRAKE PADS AND SECOND SET OF ROTORS, THE DEALER NEVER ONCE TOLD US THERE WAS A PROBLEM WITH THE KIA BRAKE SYSTEM, AND I CALLED KIA AND THEY TOLD ME THEY WERE NOT AWARE OF ANY BIG PROBLEM WITH THEM, AT THAT POINT I TOLD THE KIA REPRESENTATIVE THAT I WILL NEVER PURCHASE ANOTHER KIA, AND I WENT AND TRADED MY 2004 SEDONA FOR A CHEVROLET,AND NEVER WILL OWN A KIA AGAIN.  *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/28/2008",
        "dateOfIncident": "09/08/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10225867,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 KIA SEDONA.  WHILE DRIVING 40 MPH, THE CONTACT HAD TO SLAM ON THE BRAKES AND THE ABS FAILED.  THE ABS ENGAGED FOR 1 1/2 SECONDS, DISENGAGED FOR 5-6 SECONDS, AND THEN RE-ENGAGED, CAUSING THE VEHICLE TO SLIDE 12 FEET.  THE CONTACT ALMOST DROVE OFF THE ROAD BEFORE THE BRAKES FINALLY STOPPED THE VEHICLE.  THE ABS FAILURE OCCURRED NINE TIMES FROM THE DATE THE VEHICLE WAS PURCHASED.  THE HARDER SHE DEPRESSES THE BRAKE PEDAL, THE LONGER IT TAKES TO STOP THE VEHICLE.  AFTER AVOIDING A CRASH, THE CONTACT DROVE STRAIGHT TO THE DEALER.  DUE TO THE RAIN, THE DEALER WOULD NOT ALLOW THE TECHNICIAN TO TEST DRIVE THE VEHICLE BECAUSE A CRASH COULD RESULT DUE TO THE BRAKE FAILURE.  THE FAILURE MILEAGE WAS 320.",
        "vin": "KNDUP131446"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/11/2008",
        "dateOfIncident": "08/20/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10224179,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 KIA SEDONA.  IN JUNE OF 2007, WHILE BACKING OUT OF THE DRIVEWAY AT AN UNKNOWN SPEED, THE VEHICLE STALLED.  THE FAILURE DATES WERE AUGUST 20, 2007 AT 74,200 MILES AND SEPTEMBER 9, 2007 AT 77,450 MILES.  WHEN THE CONTACT APPROACHED A TRAFFIC LIGHT, THE BRAKES WERE DEPRESSED AND THE VEHICLE STALLED ON MARCH 28, 2008.  WHILE DRIVING 50 MPH, THE VEHICLE STALLED AGAIN AT 83,000 MILES.  THE CONTACT WAS NEAR A NAPA AUTO PARTS STORE AND PULLED INTO THE PARKING LOT.  A MECHANIC INSPECTED THE VEHICLE TO IDENTIFY THE CAUSE OF THE FAILURE, BUT WAS UNSUCCESSFUL.  THE CONTACT CALLED TWO DIFFERENT KIA DEALERS TO ATTEMPT TO DIAGNOSE THE FAILURE, BUT THEY WERE ALSO UNSUCCESSFUL.  THE FAILURE MILEAGE WAS 70,000 AND CURRENT MILEAGE WAS 83,400.    UPDATED 04/29/08  *BF",
        "vin": "KNDUP131X46"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "04/07/2008",
        "dateOfIncident": "03/20/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10223568,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 KIA SEDONA.  WHILE HER DAUGHTER WAS DRIVING AT ABOUT 5 TO 10 MPH, THE STEERING WHEEL BECAME DIFFICULT TO TURN IN ALL DRIVING CONDITIONS.  THE CONTACT ALSO HEARD A SQUEAKING SOUND WHEN TURNING THE STEERING WHEEL.  THE STEERING SHAFT U-JOINT FAILURE (BADLY CORRODED) CAUSED THE CONTACT TO CRASH THE FRONT END OF HER VEHICLE INTO THE BRIDGE ON HER DRIVEWAY.  SHE HAS NOT TAKEN THE VEHICLE TO A DEALER.  THE DEALER SAID THAT THERE IS A NATIONAL BACK ORDER FOR STEERING INTERMEDIATE SHAFT. THE VIN WAS UNKNOWN.  THE CURRENT MILEAGE WAS 90,000 AND FAILURE MILEAGE WAS 89,000.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/31/2008",
        "dateOfIncident": "06/10/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10222927,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 KIA SEDONA.  WHILE STOPPED, THE VEHICLE STALLS.  THE VEHICLE CAN BE RESTARTED AFTER THE FAILURE.  THE CONTACT HAS NOT TAKEN THE VEHICLE TO A DEALER; HOWEVER, A LOCAL MECHANIC COULD NOT IDENTIFY THE CAUSE OF THE FAILURE.  THE VEHICLE HAS STALLED FOUR TIMES.  THE FAILURE MILEAGE WAS 70,000 AND CURRENT MILEAGE WAS 83,000.",
        "vin": "KNDUP131X46"
    },
    {
        "components": "TIRES,WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/25/2008",
        "dateOfIncident": "03/22/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10222268,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 KIA SEDONA. WHILE DRIVING 60 MPH, THE CONTACT HEARD A LOUD THUMPING SOUND.  AFTER SHE INSPECTED THE VEHICLE, SHE NOTICED THE WHEEL AND TIRE DETACHED.  THE VEHICLE WAS TOWED TO THE DEALER HOWEVER; THEY WERE UNABLE TO DIAGNOSE THE FAILURE.  AS OF MARCH 25, 2008, THE DEALER HAD NOT REPAIRED THE VEHICLE.  THE CURRENT MILEAGE WAS 83,000 AND FAILURE MILEAGE WAS 82,000.",
        "vin": "KNDUP131346"
    },
    {
        "components": "SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/24/2008",
        "dateOfIncident": "03/22/2008",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10222183,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA EX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2004 KIA SEDONA EX, AND WAS RETURNING HOME FROM A FAMILY VACATION, WAS DRIVING ALONG AND HEARD A LOUD NOISE COME FROM THE BACK PASSENGER SIDE, THE VAN STARTED SHAKING AS IF I HAD A FLAT TIRE, I STARTED APPLYING MY BRAKES TO PULL OVER, THEN I HEARD A LOUD POP, THE BACK CORNER WENT DOWN. OUT MY REAR PASSENGER SIDE WINDOW I LOOKED AND SAW MY ENTIRE WHEEL FLYING THROUGH THE TREES ON FIRE. I HAD LITERALLY NO STOPPING POWER, LUCKILY I GOT MY VEHICLE STOPPED SAFELY BECAUSE I HAD MY FAMILY AND MOTHER IN LAW WITH ME AT THE TIME. I SEE THERE WAS A RECALL ABOUT THIS SITUATION, BUT I DON'T REMEMBER ANY NOTIFICATION ABOUT IT, AND NOW I HAVE TO PAY $2500 TO HAVE IT FIXED, THE SAME AMOUNT I PAID TO GO ON VACATION.   *TR",
        "vin": "KNDUP131346"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/31/2008",
        "dateOfIncident": "01/31/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10216562,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE REPAIR PAPERWORK FROM THE TWO PAST OWNERS. THE KIA SADONA ENGINE DIES FOR NO REASON WHAT SO EVER. THIS HAS BEEN AN ON GOING ISSUE WITH THIS VEHICLE. TODAY, IT ALMOST GOT MY FAMILY KILLED BECAUSE IT STALLED AT AN INTERSECTION THEY WERE CROSSING THROUGH.  *TR",
        "vin": "KNDUP131546"
    },
    {
        "components": "SUSPENSION,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/15/2008",
        "dateOfIncident": "01/06/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10214941,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "BAD MISFIRE IN MOTOR CAUSING THE CRUISE CONTROL TO TURN OFF AND TRANS TO SLAM OUT AND THEN BACK INTO OVER DRIVE,CAME CLOSE TO GETTING HIT IN THE REAR ON  I-95. I HAVE HAD THIS VAN BACK TO KIA MINEY TIMES AND ITS STILL NOT FIX.  ALL SO THE LAST TIME I HAD THE VAN FOR SERVICE I COMPLAINED ABUT A BEARING NOISE THEY DID NOT FIX IT THE NOISE IS GETTING WORSE.  *TR",
        "vin": "KNDUP131346"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/04/2007",
        "dateOfIncident": "01/15/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10210765,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 KIA SEDONA.  WHEN THE BRAKES ARE APPLIED, THE CONTACT HEARS A GRINDING, SQUEALING, AND SQUEAKING SOUND.  THE FAILURE IS HEARD WHEN TWO OR MORE PEOPLE ARE IN THE VEHICLE.  THE VEHICLE WAS TAKEN TO THE DEALER A DOZEN TIMES CONCERNING THIS AND, ON SIX OF THOSE OCCASIONS, THE SOUNDS COULD NOT BE DUPLICATED.  THE BRAKING SYSTEM HAS BEEN REPLACED TWICE; ONCE AT THE CONTACT'S EXPENSE AND ONCE AT THE DEALER'S EXPENSE.  THE SOUNDS CEASED FOR APPROXIMATELY ONE WEEK AND THEN RESUMED.   THE CURRENT MILEAGE WAS 53,891 AND FAILURE MILEAGE WAS 30,000.      UPDATED 12/31/07  *BF  THE FUEL TANK PRESSURE SENSOR WAS REPLACED DUE TO THE CHECK ENGINE LIGHT ILLUMINATING. DIFFERENT PARTS WITHIN THE BRAKE SYSTEM WAS REPLACED; SUCH AS THE DRUMS AND REAR BRAKE SHOES UPDATED",
        "vin": "KNDUP131246"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/14/2007",
        "dateOfIncident": "09/04/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10203009,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA EX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 KIA SEDONA EX.  WHILE ATTEMPTING TO ACCELERATE FROM A STOP, THE VEHICLE WOULD NOT MOVE FORWARD.  THE CONTACT STATED THAT THE VEHICLE ONLY DROVE IN REVERSE.  THE VEHICLE WAS TOWED TO THE DEALER AND THEY STATED THAT THE TRANSMISSION NEEDED TO BE REPLACED.  THE CURRENT AND FAILURE MILEAGES WERE 50,000.",
        "vin": "KNDUP131546"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/18/2007",
        "dateOfIncident": "07/13/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10196704,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA EX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 KIA SEDONA EX.  WHILE DRIVING 35 MPH, THE TEMPERATURE GAUGE BEGAN TO RISE ON THE INSTRUMENT PANEL.  THE CONTACT CHECKED THE ENGINE AND NOTICED THAT THE COOLANT RECEPTACLE WAS EMPTY.  SHE ADDED COOLANT, BUT THE VEHICLE CONTINUED TO OVERHEAT.  THE VEHICLE WAS TOWED TO THE DEALER AND THE RADIATOR WAS FLUSHED.  HOWEVER, THE VEHICLE CONTINUED TO OVERHEAT.  THE CONTACT TOOK THE VEHICLE TO A SERVICE SHOP WHERE IT WAS FOUND THAT THE COOLANT LINE WAS ROTTED AND CORRODED.  THE PLASTIC CASE WAS ALSO CORRODED.  THE MANUFACTURER STATED THAT THEY WILL PAY FOR THE PARTS, NOT THE LABOR.  A POLICE REPORT WAS FILED.  THE CURRENT AND FAILURE MILEAGES WERE 61,485.",
        "vin": "KNDUP131446"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/26/2007",
        "dateOfIncident": "09/25/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10189033,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 KIA SEDONA.  THE VEHICLE WAS INVOLVED IN RECALL # 05V232000 REGARDING THE WHEEL BEARINGS.  THE CONTACT' S VEHICLE  DEVELOPED  BRAKE FAILURE SHORTLY AFTER THE RECALL REPAIR WAS PERFORMED.  THE CONTACT HEARD A LOUD GRINDING NOISE WHEN STOPPING THE VEHICLE, AND THE STOPPING DISTANCE WAS REDUCED.  THE FAILURE OCCURRED INTERMITTENTLY.  THE DEALER REPLACED AND REPAIRED THE BRAKE PADS, DRUMS, AND ROTORS, BUT THE NOISE CONTINUED.  THE CURRENT MILEAGE IS 61,000, AND FAILURE MILEAGE WAS 13,000.*AK",
        "vin": "KNDUP131346"
    },
    {
        "components": "STEERING,ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/25/2007",
        "dateOfIncident": "04/24/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10188847,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA EX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2004 KIA SEDONA. I BOUGHT THE CAR WITH 57,000 MILES ON IT FROM THE ORIGINAL OWNER. THE WARRANTY CALLS FOR 60,000 MILES TO SECOND OWNER. THE TRANSMISSION, RACK & PINION WERE REPLACED BY ME AT 57,000 AND NOW THE ENGINE HAS A BUILD UP OF SLUDGE AND THE LOCAL DEALER IS REFUSING TO WARRANTY THE DEFECT. THEY DID NOT REPLACE THE TRANSMISSION OR RACK AND PINION EITHER. THEY WERE PAID FOR AND REPLACED BY ME. I FEEL THIS CAR IS A LEMON AND I NEED HELP IN PURSUING RECOURSE AGAINST THIS DEALER IN CHATTANOOGA, PREBUL KIA. THANKS   *TR",
        "vin": "KNDUP131846"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/23/2007",
        "dateOfIncident": "04/03/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10188558,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VAN HAS BRAKE PROBLEMS SQUEAKING AND WEARING OUT PADS WAY TOO FAST.  I WAS TOLD NOTHING IS WRONG WITH THE BRAKE SYSTEM BUT WHEN TAKING IT TO A BRAKE SHOP I WAS TOLD THE CALIPERS ARE BAD, KIA HAS NOT FIXED THEM AND DENIES THAT THEY'RE BAD.  THE CHECK ENGINE LIGHT CAME ON AND I WAS TOLD THAT A SPARK PLUG HAD MISFIRED, THAT WAS FIXED UNDER WARRANTY AND THEN ANOTHER SPARK PLUG MISFIRED AND WAS FIXED UNDER WARRANTY.  THE OIL LEVEL WAS GETTING LOW BUT I HAD NO LEAK AND I WAS TOLD THAT THE OIL FILTER WAS SIMPLY LOOSE SO THEY SAID THEY FIXED IT.  I ASKED IF I SHOULD BRING THE VAN BACK IN A WEEK TO HAVE THE OIL LEVEL CHECKED AND WE WERE ASSURED THERE WAS NO LEAK.  CHECK ENGINE LIGHT CAME ON AGAIN AND THE OIL LIGHT FLICKERED, DID NOT STAY ILLUMINATED, SO WE TOOK IT TO THE DEALERSHIP IMMEDIATELY, AS THE OWNERS MANUAL AND THE MECHANIC HAD STATED.  THEN WE'RE TOLD THAT THERE'S SLUDGE IN THE ENGINE AND THAT IT WILL BE 2,000 DOLLARS TO TAKE IT APART AND CHECK THE DAMAGE THAT WE CAUSED FROM CONTINUING TO DRIVE IT.  THEY NEVER TOLD US THERE WAS ANY REASON TO NOT DRIVE IT NOR DID THEY MENTION SLUDGE PREVIOUSLY.  THE VAN WILL BE TOWED BACK TO KIA TOMORROW. *TR",
        "vin": "KNDUP131446"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "04/12/2007",
        "dateOfIncident": "04/08/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10187717,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA EX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE MINI VAN'S POWER LOCKS AUTOMATICALLY LOCK THEMSELVES.  IT HAS HAPPENED AT LEAST 10 TIMES.  IT USUALLY DOES IT WHILE THE VEHICLE IS RUNNING.  IT HAS EVEN LOCKED MY 3 SMALL CHILDREN IN IT.  I HAVE HAD IT TO THE KIA DEALERSHIP 5 DIFFERENT TIMES AND EVERY TIME THEY CAN'T GET IT TO DUPLICATE THE PROBLEM.  I'VE BEEN TOLD THEY CAN'T DO ANYTHING TO THE VEHICLE UNLESS IT IS DUPLICATED AT THE DEALERSHIP.  *TR",
        "vin": "KNDUP131146"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/31/2007",
        "dateOfIncident": "03/10/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10186644,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR BUCKING AND SHIFTING PROBLEMS. KIA HAS HAD MANY PROBLEMS WITH THE SEDONA AND FUEL PROBLEMS THAT THEY ARE WELL AWARE OF BUT REFUSE TO DO ANYTHING ABOUT THEM. THE CAR STALLS ON THE FREE WAY IT BUCK VIOLENTLY AND THERE ARE NUMEROUS OWNERS THAT ARE HAVING THE SAME PROBLEMS THAT WE ARE FACING.  *JB",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/21/2007",
        "dateOfIncident": "12/08/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10185752,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2004 KIA SEDONA HAS 24,000 MILES ON IT AND IS  IN THE 3 YEAR 36,000 MILE BUMPER-TO-BUMPER PART OF THE WARRANTY.  MY CHECK ENGINE LIGHT CAME ON AND THE CAR WAS TOWED TO ALBERT KIA. THE SERVICE MANAGER SAID THE CAR HAD A BLOWN ENGINE AND THAT IT WOULD BE REPLACED UNDER WARRANTY, HOWEVER, WE NEEDED TO BRING IN ALL THE OIL CHANGE RECORDS FOR WARRANTY PURPOSES -WHICH WE DID.  THAT DEALERSHIP WENT OUT OF BUSINESS AND THE CAR WAS NEVER REPAIRED.  A REP FROM KIA USA TOLD ME THAT THEY WERE GOING TO TOW MY CAR TO BALISE KIA IN WARWICK, RI. TWO DAYS LATER, SCOTT, THE SERVICE MANAGER AT BALISE, CALLED TO TELL ME THAT HE AND THE DISTRICT MANAGER HAD LOOKED AT THE CAR AND IT WAS DETERMINED THAT IT HAD 5 LITERS TOO MUCH OIL IN IT.  I TOLD SCOTT THAT THE SERVICE MANAGER AT ALBERT KIA HAD ALREADY DIAGNOSED THE CAR AND REPORTED A BLOWN ENGINE, NEVER ONCE MENTIONING ANYTHING ABOUT TOO MUCH OIL.  WITHIN THE 72 HOURS, JEFF FROM KIA USA CALLED AND INFORMED ME THAT HE HAD MY CASE. AFTER A BRIEF REVIEW, JEFF ASKED ME TO FAX OVER THE SERVICE RECORDS TO HIM.  ON JANUARY 16TH, MY CASE WAS GIVEN TO RUSSELL STUART. LATER IN JANUARY, THE KIA DM AND I CHECKED THE OIL TOGETHER AND NOTED THAT IT WAS NOT OVER THE FILL LINE.  THE DM REMOVED THE OIL CAP, LOOKED AT THE UNDERSIDE, AND NOTED THAT IT FILLED COVERED WITH SLUDGE.  THE DM NOW STATED THAT THE CAR NEVER HAD AN OIL CHANGE - VOIDING THE WARRANTY.  I ASKED IF THE SLUDGE ON THE BACK OF THE CAP WAS THE RESULT OF A BLOWN HEAD GASKET.  THE DM SAID NO.  MY SON, AN ASE MASTER TECHNICIAN, FOUND A KIA ISSUED TECHNICAL SERVICE BULLETIN STATING THAT SOME 2004 SEDONA MODELS WITH THE 3.5 LITER ENGINE HAD A DEFECT THAT LEFT A SCORE MARK AT THE #6 CYLINDER ON THE HEAD, RESULTING IN HEAD GASKET FAILURE. MY VEHICLE WAS BUILT 4 WEEKS AFTER KIA SAID THEY CORRECTED THE PROBLEM BUT KIA WILL NOT LEND ANY CREDENCE TO THIS BULLETIN REGARDING MY VEHICLE.  I'M STUCK WITH A VEHICLE THAT HAS BEEN OUT OF SERVICE FOR 3 MONTHS.*AK",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/19/2007",
        "dateOfIncident": "11/26/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10185578,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS BOUGHT IN JULY OF 2004 SINCE THEN I BEEN HAVING SEVERAL PROBLEMS WITH THE BRAKES. NOV 26, 2006 BRAKE PADS WERE WORN OUT, THERE WAS NO SPECIFIC REASON FRON THE MECHANIC SINCE THE VEHICLE WAS LESS THAN 3000 MILES. APRIL 2, 2006 THE VEHICLE WENT BACK TO WARRANTY FOR THE SAME REASON NOISY BRAKES AND VIBRATION. JULY 23, 2005 BACK TO REPAIRS FOR SAME REASON. SEPTEMBER 9, 2005 THE VEHICLE WENT BACK TO REPAIRS FOR SAME REASON, BRAKES, VIBRATION AND NOISE. NOV 10, 2005 THE WHOLE CAR WENT BLACK NO LIGHTS, VIBRATION AND NOISE. DEC 9, 2005 THE VEHICLE WAS DOWN DUE TO BRAKE PROBLEMS.  DIC 21, 2005 THE CAR DOS NOT WANT TO START. MAY 31, 2006 PROBLEM WITH FRONT AND REAR BRAKES. AUGUST 2, 2006 VIBRATION WHEN BRAKE, NOISE IN FRONT SUSPENSION AND NOISY ENGINE. DIC, 15, 2006 VEHICLE WENT DOWN DUE TO BRAKE PROBLEM. AS YOU CAN READ THERE HAVE BEEN A PATTERN PROBLEM WITH THE BRAKES IN THIS VEHICLE THERE HAVE BEEN A LOT OF SERVICES FOR THE SAME REASON AND WARRANTY DOES NOT WANT TO COVER IT BECAUSE HAVE BEEN WORN OUT PADS. THE VEHICLE HAVE LESS THAN 28,000 MILES AND I HAD PRIOR VEHICLES OF SAME WEIGHT, SIZE (MAZDA MPV) AND SAME USE. NEVER HAD PROBLEMS WITH PRIOR VEHICLES. ACTUALLY I AM FILLING A COMPLAIN FOR LEMON LAW AND THE VEHICLE HAS BEEN PARK IN MY HOUSE SINCE DECEMBER.",
        "vin": "KNDUP131146"
    },
    {
        "components": "VISIBILITY,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/15/2007",
        "dateOfIncident": "02/27/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10185205,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE ORIGINALLY SEEN D/T NO HEAT ON 2/16/07 BY AUTO REPAIR BUSINESS. HEATER CORE FLUSH DID NOT CORRECT PROBLEM, AS WELL AS  NEW THERMOSTAT.  HEATER CORE REPLACED ON 2/22/07.  TECHNICIAN  NOTED A LARGE AMOUNT OF COOLANT LEAKING ON FLOOR FROM FIREWALL.  AIRBAG LIGHT ON AFTER PICKING UP VEHICLE.  ON 2/27/07,  OWNER WAS IN VEHICLE &  A LOUD NOISE SOUNDING LIKE AN EXPLOSION WAS HEARD.  SEVERAL PLASTIC PIECES COVERING  SEATBELT ON PSSGER. SIDE POPPED OFF.  SEATBELT FROZEN. STRONG SMELL RESEMBLING GUNSMOKE IN  VEHICLE.  OWNER STOPPED AT KIA DEALERSHIP. NO KIA TECH AVAILABLE.  APPT. 3/2/07.  DX. WAS THAT THERE WAS NUMEROUS SHORT TO GROUND CODES THAT PROBABLY HAPPENED WHEN DASH WAS REINSTALLED AFTER HEATER CORE REPAIR.  RECOMMENDATION BY DEALERSHIP  TO TAKE VEHICLE BACK TO WHERE  REPAIR WAS DONE.  AUTO REPAIR SHOP STARTED LOOKING AT IT ON 3/5/07, TAKING DASHBOARD COMPLETELY APART. ON 3/7/07, LOOKED AT VEHICLE/DISCUSSED SITUATION. SHOP OWNER FELT THAT INCIDENT WAS NOT CAUSED BY THEIR REPAIR WORK.  HE FELT THAT THE COMPUTER FOR THE AIRBAGS SHORTED OUT D/T COLLECTION OF COOLANT  WITHIN THE COMPUTER & STATED WHAT NEEDED TO BE REPLACED, INCLUDING A NEW COMPUTER, NEW RESTRAINING SYSTEM & SEATBELT TENSIONER. HE FELT  THE DEALERSHIP DIAGNOSIS WAS INCORRECT,& WAS UNHAPPY THAT  DEALERSHIP WAS BLAMING HIM FOR THE PROBLEMS THAT OCCURRED.  THE SHOP OWNER FEELS THAT  COOLANT HAD PROBABLY BEEN LEAKING  BEFORE  REPAIR WORK WAS DONE, &  POSSIBLY BE RELATED TO THE WAY VEHICLE WAS MADE, SINCE THE COOLANT WAS LEAKING WITHIN THE INTERIOR OF THE CAR UNDERNEATH THE DASHBOARD, &  NOT WHERE IT SHOULD HAVE BEEN. OWNER OF VEHICLE CALLED DEALERSHIP ON 3/9/07 & SPOKE WITH SERVICE MANAGER, ASKING FOR A REFUND FOR SERVICES PROVIDED BY THEM ON 3/2/07.  HE REFUSED, STATING THAT THEIR DIAGNOSIS WAS CORRECT & THAT THEY DID NOT DO ANYTHING WRONG. VEHICLE REMAINS AT AUTO REPAIR SHOP. OWNER QUESTIONS SAFETY OF  VEHICLE. NO ACCIDENT.  KIA CORP. CALLED 3/7 BY OWNER. REP. MADE COMMENTS BLAMING AUTO REPAIR SHOP. *JB",
        "vin": "KNDUP131246"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "01/28/2007",
        "dateOfIncident": "11/29/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10180934,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR WINDOW DEFROST SYSTEM BROKEN. THE COPPER HEATING ELEMENTS HAVE PEELED OFF THE WINDOW LEAVING THE SYSTEM NONFUNCTIONAL. DEALER SERVICE STATES THAT THE USE OF AN AMMONIA-BASED CLEANING PRODUCT WILL CAUSE THE EPOXY TO DISSOLVE AND THE COPPER ELEMENTS TO PEEL OFF. WE DID NOT USE ANY CLEANING PRODUCT ON THE WINDOW PRIOR TO THIS PROBLEM; THEREFORE, THE PROBLEM IS A MANUFACTURE DEFECT.  *NM",
        "vin": "KNDUP131246"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ELECTRICAL SYSTEM,WHEELS,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "01/04/2007",
        "dateOfIncident": "01/04/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10177764,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA EX",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "VEHICLE IMPROVEMENT PRDCT",
                "productMake": "VIP",
                "productModel": "VIP",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "5/05 NOTICED HUMMING ON OCCASION FROM REAR WHEELS AT HIGHWAY SPEEDS  6/30/05 RECEIVED RECALL NOTICE THAT REAR HUB ASSEMBLY/OR BEARINGS MAY NEED REPLACING.   7/05 BROUGHT CAR TO DEALER FOR RECALL REPAIR, DEALER ORDERED PART  8/12/15 PART IN TO DEALER, BEARING SCORED AND REPLACED BOTH  OUTER WHEEL BEARINGS  NOTICED LOUD HUMMING NOISE WORSE SINCE RECALL REPAIR  8/30/05 BOTH REAR HUB ASSEMBLIES NEEDING REPLACEMENT  3/22/06 AT 22,000 MILES BOTH ROTORS AND BRAKE DRUMS WARPED AND NEED REPLACING AT OWNERS EXPENSE  8/29/06 VIBRATION COMING FROM REAR OF VAN, TIRES ROTATED AND REBALANCED, VIBRATION  STILL NOTED IN REAR END  8/31/06 AC COMPRESSOR AND RADIO BRAKES BOTH REPLACED  9/29/06 RADIO BREAKS AGAIN AND IS REPLACED  11/1/06 UNABLE TO REMOVE KEY FROM ENGINE, SHIFT LOCK CABLE BINDING  11/9/06 LOUD HUMMING NOISE AGAIN NOTED IN REAR OF CAR, REAR VALVE REPLACED  11/29/06 LOUD HUMMING NOISE CONTINUES REAR HUB ASSEMBLY FOUND TO BE COMING APART, RIGHT REAR HUB ASSEMBLY REPLACED, VIBRATION IN REAR CONTINUES  1/4/07 LOW SCREECHING SOUND INTERMITTENTLY WHEN APPLYING BRAKES  SINCE REPLACING REAR HUB ASSEMBLY, BOLTS IN REAR DRUMS FOUND TO  BE MISSING , BRAKE PAD TOO TIGHT READJUSTED. *JB",
        "vin": "KNDUP131946"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/02/2007",
        "dateOfIncident": "05/28/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 4,
        "odiNumber": 10177534,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA EX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* -  THE CONTACT STATED THAT WHILE DRIVING  AND  COMING OFF A GRAVEL ROAD AT 52 MPHTHE DRIVER LOST CONTROL OF THE VEHICLE, HITTING A MAILBOX , AND CAUSING THE VEHICLE TO ROLL OVER 3 TIMES, THEN STRIKING A TREE.  WHILE VEHICLE WAS ROLLING OVER THE AIRBAGS DIDN'T DEPLOY.  AT THE TIME OF THE INCIDENT THERE WERE 4 PASSENGERS IN THE VEHICLE ,3 OF THE PASSENGERS HAD MINOR INJURIES, BUT THE DRIVER, WHO WAS NOT WEARING A SEAT BELT ,WAS EJECTED FROM THE VEHICLE ,  SUSTAINING  SEVERE INJURIES.  THE CONTACT STATED THAT THERE HASN'T BEEN ANY MAINTENANCE OR SERVICE WORK PERFORMED ON THE AIR BAGS BEFORE THE INCIDENT. A POLICE REPORT WAS TAKEN.  *AK  UPDATED 02/22/07. *JB",
        "vin": "KNDJC733645"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/22/2006",
        "dateOfIncident": "12/21/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10176789,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "HAD TO GET MY CAR SERVICED BECAUSE ANTIFREEZE WAS POURING OUT OF MY CAR. AFTER THEY LOOKED AT MY CAR I WAS NOTIFIED THAT KIA DOES NOT HAVE THE PART TO FIX MY CAR BUT INSISTS THAT I CAN STILL DRIVE IT. MEANWHILE I NEED TO FILL UP THE TANK AFTER MY ERRANDS FOR THE DAY, THAT'S AN ESTIMATE OF $20 A DAY!THEY TOLD ME IT WOULD TAKE UP TO 2-3 WEEKS UNTIL THIS PART CAME IN. I FOUND IT DISTURBING HOW THEY TOLD ME I CAN DRIVE THIS CAR WHILE IT POURS OUT ANTIFREEZE (ANTIFREEZE IS POISON TO ANIMALS). ALSO TO GET IT SERVICED I CALLED THE PLACE WHERE I BOUGHT IT AND THEY COULDN'T EVEN LOOK AT MY CAR TILL ANOTHER 3 WEEKS OR SO. MY CAR IS NOW AN HOUR AWAY AND KIA WILL NOT PROVIDE ME WITH A RENTAL. ITS A SHAME HOW THEY SCAM PEOPLE INTO BUYING THE CAR FOR THE WARRANTY BECAUSE ONCE THEY HAVE YOUR MONEY THEY DON'T CARE AFTER THAT.  *NM",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/22/2006",
        "dateOfIncident": "09/09/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10176819,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* -  THE CONTACT STATES SINCE PURCHASING  OF 2004 KIA SEDONA HE HAS HAD TO TAKE THE VEHICLE  TO DEALER  FOR ROTOR REPAIRS FIVE TIMES . THE DEALERSHIP REPLACED THE ROTORS THREE TIMES.  THE CONTACT STATED THAT ON  FIRST REPAIR HE WAS TOLD THAT THE ROTORS HAD HOT SPOTS ON THEM.  WHILE DRIVING AT 40 MPH AND TRYING TO COME TO A STOP THE VEHICLE VIBRATED. THE CONTACT TOOK  THE VEHICLE T O DEALER  ON OTHER OCCASIONS FOR THE SAME PROBLEM, AND THEY HAVE DONE ALL OF THE REPAIRS.  THE LAST TIME A REPAIR WAS DONE THE DEALERSHIP DID REPAIRS ON THE REAR BRAKES AND DRUMS, BUT  THE PROBLEM RECURRED.  THE CONTACT TOOK  THE  VEHICLE TO DEALER  TWO WEEKS AGO FOR THE SAME PROBLEMS,  WITH THE VEHICLE VIBRATING. THE CONTACT WAS TOLD BY DEALERSHIP THAT THEY WILL NOT DO THESE REPAIRS FOR FREE.  THE CONTACT STATED THAT THE VEHICLE SAT AT THE DEALERSHIP FOR OVER A WEEK, AND HE HAD TO GO AND PICK UP THE VEHICLE AND DRIVE IT BACK HOME WITHOUT ANY REPAIRS BEING DONE.  THE  VEHICLE  WAS  STILL UNDER WARRANTY,  AND THEY HAVE ALWAYS TAKEN CARE OF THE REPAIRS IN THE PAST. HE  CONTACTED THE CHRYSLER CORPORATION, AND WAS TOLD THERE WAS NOTHING THEY COULD DO, BUT TAKE DOWN  THE  INFORMATION.  THE CONTACT WAS GIVE A REFERENCE # 15798865 FROM THE CHRYSLER CORPORATION FOR HIS COMPLAINT.*AK  UPDATED 02/22/07. *JB  UPDATED",
        "vin": "KNDUP131446"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/14/2006",
        "dateOfIncident": "12/06/2006",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10176180,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE FREEWAY FOR ABOUT 15 MINUTES WHEN MY 04 KIA SEDONA LX STARTED SMOKING.  AT FIRST I THOUGHT THERE WAS A FIRE IN THE LOCAL AREA.  AFTER A FEW MINUTES IT OCCURRED TO ME THAT IT COULD BE MY VAN AND PULLED OVER AND POPPED THE HOOD.  FLAMES JUMPED UP IN THE ENGINE AND BURNED UNTIL THEY WERE EXTINGUISHED WITH A FIRE EXTINGUISHER.  THE KIA SERVICE MANAGER SAID THAT HE BELIEVED IT WAS A TOTAL LOSS.  MY INSURANCE COMPANY IS NOW VERIFYING THAT.  *NM",
        "vin": "KNDUP131546"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/13/2006",
        "dateOfIncident": "09/01/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10176080,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THE ENGINE DIED WITHOUT WARNING.  THE SERVICE DEALER DETERMINED THE ENGINE SHORT BLOCK NEEDED TO BE REPLACED TO FIX THE ISSUE.",
        "vin": "KNDJD733345"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/27/2006",
        "dateOfIncident": "11/05/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10174458,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2004 KIA SORENTO  4X4 (THAT CAR OPTION  NOT INCLUDED IN COMPLAINT FORM) ONE MORNING CAR STARTED UP ROUGH AND WOULDN'T STOP.  ENGINE LIGHT CAME ON.  DROPPED OFF AT DEALERSHIP WHERE THEY SAID IT WAS MY FUEL INJECTORS.  THEY REPLACED THEM, BUT SAID THEY WANTED TO KEEP CAR OVERNIGHT TO MAKE SURE PROBLEM DID NOT REPEAT.  IT STARTED ROUGH AGAIN WITH THEM AND ENGINE LIGHT CAME ON AGAIN.  THEY KEPT THE CAR NEXT DAY TO DIG DEEPER TO FIND PROBLEM.  THEY DISCOVERED THE WIRE HARNESS SUFFERED A SHORT AND WAS BURNT IN 3 DIFFERENT AREAS.  SINCE HARNESS IS CONNECTED FROM COMPUTER TO SPARK PLUGS, FUEL INJECTOR AND OTHER ENGINE COMPONENTS THEY HAD TO REPLACE EVERYTHING...BUT THE COMPUTER.  I GOT CAR BACK AFTER 5 DAYS.  2 DAYS LATER CAR STARTED ROUGH IDLING AND STARTED MISFIRING AND CHECK ENGINE LIGHT CAME ON.  I ONCE AGAIN DROPPED CAR OFF AT DEALERSHIP.  SAID IT FEELS LIKE THE SAME PROBLEM, OR COULD BE RELATED TO WORK DONE.  THEY SAID RANDOM MISFIRES ARE COMMON AND CLEARED COMPUTER LOG AND I GOT CAR BACK.  NEXT MORNING CAR RAN ROUGH AGAIN AND WAS MISFIRING AGAIN.  I CALLED KIA SERVICE AND SAID THAT THIS CAR NEVER MISFIRED BEFORE OR RAN ROUGH AND HOW CAN A RANDOM MISFIRE HAPPEN SO FREQUENTLY AND ISN'T IT COINCIDENTAL THAT IT ONLY STARTED HAPPENING AFTER MY WIRE HARNESS SUFFERED FROM A SHORT THAT WAS DIRECTLY ATTACHED TO THE SPARK PLUGS.  SERVICE MANAGER MENTION THAT TECHNICIAN WORKING ON CAR THOUGHT THAT COMPUTER WAS MALFUNCTIONING BUT NEGLECTED TO TELL ME.  I ASKED IF THEY KNEW IT WAS MALFUNCTIONING, WHY DID THEY EVER GIVE THE CAR BACK TILL EVERYTHING WAS FIXED.  HE SAID THEY NEED PROOF AND NOT JUST MAYBE'S.  I TOLD THEM THAT THE CONSTANT MISFIRING WAS PROOF ENOUGH.  THEY TOOK THE CAR BACK AND REPLACED THE COMPUTER.  THEY SENT THE COMPUTER TO KIA HEADQUARTERS TO INVESTIGATE WHY THE COMPUTER MALFUNCTIONED.  I WAS TOLD THAT THEY WERE WORRIED THAT THIS MAY NOT BE A ISOLATED CASE.  *JB",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/21/2006",
        "dateOfIncident": "01/05/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10173993,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WE ARE WRITING TO REPORT A POTENTIALLY DANGEROUS SITUATION WITH THE 2004 *(AND POSSIBLY OTHER YEARS) KIA SEDONA.  WE PURCHASE OUR VEHICLE NEW IN DAYTONA BEACH FLORIDA AND DID NOT HAVE A PROBLEM UNTIL WE RELOCATED TO THE MOUNTAINS OF WESTERN NORTH CAROLINA. SINCE FEBRUARY OF 2005 WE HAVE BEEN ATTEMPTING TO SAFELY RECTIFY A PROBLEM WITH OUR CAR WHICH NOW HAS APPROX 38,000. MILES ON IT. OUR CAR FYI HAS NEVER BEEN IN AN ACCIDENT AND WE ARE THE ONLY DRIVERS AND OWNERS. WE NOTICED IN APPROX JAN OF 2005 A SEVERE CAVITATION IN THE VEHICLE WHEN BRAKING ON A HILL AT A NORMAL RATE OF SPEED. MY HUSBAND IMMEDIATELY WENT TO THE LOCAL DEALER,PARAMOUNT KIA TO HAVE THE VEHICLE EXAMINED AND REPAIRED. HE WAS TOLD THAT KIA WAS AWARE OF A PROBLEM WITH THE BRAKING SYSTEM AND WAS UNABLE TO OFFER ANY ASSISTANCE AS THE PROBLEM WAS NOT UNDER WARRANTY. IN ADDITION, THE SERVICE MANAGER AT THE DEALERSHIP TOLD US THAT MANY KIA SEDONA OWNERS WERE COMPLAINING OF THE SAME PROBLEM AND THAT THE PROBLEM WAS SINGULAR TO THE WESTERN NORTH CAROLINA AREA DUE TO UNUSUAL WHETHER CONDITIONS. AT THAT TIME THE DEALERSHIP COULD NOT TELL US WHETHER THE CAR WAS SAFE TO DRIVE AND WAS UNABLE TO OFFER ANY ASSISTANCE IN REPAIRING THE PROBLEM, AS WE WERE TOLD THAT THE REPLACEMENT PARTS WERE THE SAME PARTS THAT WERE SUPPOSEDLY CAUSING THE PROBLEM.   MY HUSBAND, UNSATISFIED BY THE POOR ANSWERS (EVASIVE IN NATURE) WENT TO ANOTHER REPUTABLE MECHANIC AND HAD ON SEVERAL OCCASIONS DIFFERENT PARTS OF THE BRAKING SYSTEM CHECKED AND THEN REPLACED AS NECESSARY. DURING THE ALMOST YEAR THAT WE HAVE BEEN HAVING THE PROBLEM WE HAVE BEEN TOLD REPEATEDLY THAT KIA IS AWARE OF A BRAKING SYSTEM PROBLEM, BUT NO RECALL HAS BEEN INITIATED, NO INFORMATION LETTER HAS BEEN SENT OUT TO LET KIA SEDONA OWNERS KNOW THAT THERE IS A POTENTIAL PROBLEM WITH THE BRAKING SYSTEM.  *NM",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/30/2006",
        "dateOfIncident": "10/20/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10172111,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE HAD A FRONTAL CRASH AT 35-40 MPH.  INTO THE SIDE OF A BOX TRUCK.  NEITHER PASSENGER  NOR DRIVER'S AIRBAG  DEPLOYED.  THE HOOD HAD ALSO FLEW OFF THE VEHICLE AND LANDED MORE THAN 20 FEET AWAY AFTER BEING DEFLECTED OFF HER WINDSHIELD.  THIS VEHICLE SUSTAINED MORE THAN $11,000 IN DAMAGES.  *JB",
        "vin": "KNDUP131946"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/18/2006",
        "dateOfIncident": "10/17/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10171156,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 18000 MI. VAN SHOOK WHILE BRAKING. DEALER CUT ROTORS AND REPLACED BRAKE PADS. AT 20000 MI. VAN SHOOK AGAIN BROUGHT VEHICLE BACK TO DEALER, DEALER REPLACED ROTORS AND BRAKE PADS.  AT 33000 MI PROBLEM STARTED ALL OVER AGAIN.  *NM",
        "vin": "KNDUP131X46"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/05/2006",
        "dateOfIncident": "07/16/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10170036,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THE REAR PASSENGER SIDE TIRE FELL OFF WHILE THE CONTACT WAS JACKING UP THE VEHICLE.  THE NON SERVICE DEALER DETERMINED THIS OCCURRED DUE TO THE WHEEL BEARING DISINTEGRATING.  THE FRONT DRIVER SIDE WHEEL BEARING ALSO DISINTEGRATED.  THE MANUFACTURER HAD A RECALL #05V232000; REGARDING THE WHEELS, BUT THE VEHICLE WAS NOT INCLUDED IN THE RECALL DUE TO THE VIN.*AK",
        "vin": "KNDUP131346"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/12/2006",
        "dateOfIncident": "03/15/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10168072,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED AT VARIOUS SPEEDS, THE VEHICLE'S FRONT BRAKES MADE A SCREECHING NOISE.  THE VEHICLE WAS TAKEN TO THE DEALERSHIP WHO DETERMINED THAT THE FRONT BRAKE PADS WERE WORN AND INSTALLED NEW PADS.  THE VEHICLE RETURNED TO THE DEALER 4 MONTHS LATER, BECAUSE THE PADS WORE OUT PREMATURELY AND HAD TO BE REPLACED.  THIS DID NOT REMEDY THE PROBLEM. ON THE 3RD VISIT, THE DEALER REPLACED THE FRONT CALIPERS BUT THE PROBLEM PERSISTED.  THE VEHICLE WAS TAKEN TO THE DEALER ON 2 OTHER OCCASIONS FOR FRONT PAD REPLACEMENT, BUT THE PROBLEM PERSISTED.  THE MANUFACTURER WAS NOT CONTACTED.",
        "vin": "KNDUP131846"
    },
    {
        "components": "STEERING,SUSPENSION,SERVICE BRAKES, HYDRAULIC,POWER TRAIN,AIR BAGS,INTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/30/2006",
        "dateOfIncident": "12/26/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10163893,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THEY WERE MINOR AT FIRST, SPEAKER COVER, WEATHER STRIPPING, AND NOISE WHEN BACKING UP. THEN THE OTHER PROBLEMS CAME: FAULTY PILOT BEARING, CLUTCH, AND PRESSURE PLATE, 4WD LIGHT, E BRAKE, POWER WINDOWS, PAINT COMING OF VEHICLE IN VARIOUS PLACES, DOME LAMP,DOOR LOCK SENSOR, GEAR SHIFTER, WINDSHIELD MOLDING, AIR BAG LIGHT,GAS PEDAL STICKING, CUP HOLDER. THE ONES THAT CONCERN ME THE MOST IS THE VIBRATION THAT I HAVE AT SPEEDS OF 65-75 MPH. THE WHOLE STEERING WHEEL SHAKES AND THE VIBRATION CAN BE FELT BELOW. I HAVE SEEN WHERE THERE ARE OTHER COMPLAINTS ON THIS MODEL FOR THIS. I AM CONCERNED BECAUSE I HAVE TAKEN IT TO THE DEALER AND THEY CANNOT LOCATE THE PROBLEM. I ALSO HAVE PROBLEMS SHIFTING INTO LOWER GEARS ESPECIALLY IN THE MORNINGS. I ALSO HAVE PROBLEMS SHIFTING INTO 1ST GEAR FROM NEUTRAL. I WAS SITTING AT A STOP LIGHT AND WHEN THE LIGHT TURNED GREEN WENT TO PUT MY CAR INTO FIRST, IT WOULD NOT GO, I SHIFTED INTO 2ND AND TRIED TO GO INTO 1ST BUT IT WOULD NOT GO. I FINALLY CUT THE VEHICLE OFF AND GOT IT INTO 1ST. THE OTHER MAIN CONCERN IS THERE IS A DELAY ON ACCELERATION. I EXPERIENCE IT AFTER MY VEHICLE HAS SAT FOR 5 OR MORE HOURS. WHEN THE GAS PEDAL IS PUSHED THE VEHICLE WILL NOT GO OR WILL MOVE SEVERAL FEET AND THEN STOP. I HAVE MADE THE DEALERSHIP AWARE OF THESE PROBLEMS AND SOME HAVE BEEN FIXED BUT THE MAJOR ONES, VIBRATION, HESITATION, AND SHIFTING INTO 1ST CANNOT BE FIXED BECAUSE THE CAUSE IS UNKNOWN. I HAVE ALREADY HAD TWO CLOSE CALLS IN THIS VEHICLE ONE BECAUSE I COULD NOT GET MY CAR INTO GEAR AND I WAS ABOUT HIT FROM BEHIND. THE OTHER WAS THE HESITATION WHERE THE CAR STALLED JUST AS I WAS PULLING ONTO THE ROAD AND WOULD NOT GO. THE VIBRATION CONCERNS ME TOO BECAUSE THIS COULD BE THE TRANSMISSION OR STEERING, AND I KNOW THAT MUCH OF A VIBRATION HAS TO AFFECT OTHER THINGS AS WELL. I AM GOING TO CONTACT SOMEONE ABOUT TRYING TO DECLARE THIS VEHICLE AS A LEMON. I AM CONCERNED FOR MY DAUGHTER'S SAFETY AND THIS IS MY ONLY SOURCE OF TRANSPORTATION. PLEASE HELP ME.  *JB",
        "vin": "KNDJC733145"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/27/2006",
        "dateOfIncident": "07/26/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10163636,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA EX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THE FIRST INCIDENT, I WENT OUT TO THE VAN, A 2004 KIA SEDONA EX AND IT WOULDN'T EVEN TURN OVER, JUST MADE A CLICKING NOISE.  THEN IT WOULD TURN OVER AND NOT FIRE.  I CALLED ROADSIDE ASSISTANCE TO HAVE THEM TOW IT, BUT TRIED LATER BEFORE THEY ARRIVED AND PRESSED THE ACCELERATOR TO THE FLOOR AND IT FINALLY FIRED UP.  I THOUGHT MAYBE IT WAS JUST BAD GAS SINCE IT WAS FINE AFTER THAT.  YESTERDAY, MY WIFE IS DRIVING IT AND THE RADIO CUTS OFF AND SHE BEGINS TO LOSE POWER AND CANNOT ACCELERATE.  SHE WAS WHERE SHE NEEDED TO GO WHEN IT HAPPENED, SO SHE WENT ON IN, IT STARTED BACK UP, BUT THEN SHE HAD THE SAME THING NOT EVEN A BLOCK LATER OF THE POWER CUTTING OUT AND NO ACCELERATION.  AFTER THIS IT WOULD JUST CLICK WHEN THE KEY WAS TURNED AND DO WHAT IT DID TO ME.  *NM",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/26/2006",
        "dateOfIncident": "01/24/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10160770,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VAN WILL LUNGE OR CUT-OFF WHILE BEING DRIVEN. THE DEALERSHIP HAS REPEATED THIS PROBLEM WITH SEVERAL EMPLOYEES. NO ONE KNOWS WHAT IS CAUSING THIS OR HOW TO REPAIR. SO THEY KEEP GIVING IT BACK TO US UN-REPAIRED.  *JB",
        "vin": "KNDUP131X46"
    },
    {
        "components": "CHILD SEAT,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/08/2006",
        "dateOfIncident": "06/08/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10159328,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Evenflo Company, Inc.",
                "productMake": "EVENFLO",
                "productModel": "CHILD SAFETY SEAT",
                "productYear": "9999",
                "type": "Child Seat"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE THE CHILD WAS RESTRAINED, THE BOOSTER SEATBELT CLIPS FRACTURED WHICH ALLOWED THE SEATBELT TO RUB THE CHILD'S NECK. THIS INCIDENT OCCURRED WITHOUT WARNING.  NO INJURIES WERE SUSTAINED.  THE MANUFACTURER WAS ALERTED.  THE CHILD SAFETY SEAT IS AN EVENFLO COMET, MODEL # 3221213P1, DATE OF MANUFACTURE OCT. 23, 2002.",
        "vin": ""
    },
    {
        "components": "CHILD SEAT,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/08/2006",
        "dateOfIncident": "06/08/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10159326,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Evenflo Company, Inc.",
                "productMake": "EVENFLO",
                "productModel": "CHILD SAFETY SEAT",
                "productYear": "9999",
                "type": "Child Seat"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE THE CHILD WAS RESTRAINED, THE BOOSTER SEATBELT CLIPS FRACTURED WITHOUT WARNING WHICH ALLOWED THE SEATBELT TO RUB THE CHILD'S NECK.  NO INJURIES WERE SUSTAINED.  THE MANUFACTURER WAS ALERTED.  THE CHILD SAFETY SEAT IS AN EVENFLO COMET, MODEL # 3221213P1, DATE OF MANUFCATURE JAN. 16, 2003.",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/11/2006",
        "dateOfIncident": "05/11/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10157281,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE DRIVING AT VARIOUS SPEEDS THE VEHICLE RIDES ROUGH.  THE VEHICLE WAS TAKEN TO THE DEALER ON 5 OCCASIONS FOR THIS PROBLEM.  THE FRONT STRUTS AND STRUT BOOTS WERE REPLACED, HOWEVER THE PROBLEM PERSISTED.",
        "vin": "KNDUP131346"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/03/2006",
        "dateOfIncident": "04/14/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10156736,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WE RECENTLY HAD TO HAVE BRAKES REDONE ON OUR KIA SEDONA WITH ONLY 25,000 MILES.  WE WERE TOLD THERE WAS ONLY 5 PERCENT BRAKING LEFT.  THIS IS CONSISTENT WITH THE VIBRATIONS WE OBSERVED UPON BRAKING.  WE WERE TOLD BY THE KIA SERVICE MANAGER THAT THE VEHICLE WAS VERY HEAVY IN FRONT AND THAT WAS THE REASON FOR THE EXTREME BRAKE FAILURE.  WE WERE ALSO TOLD THEY HAD TO REPLACE THE BRAKES ON A SEDONA WITH ONLY 13,000 MILES.  THE SERVICE MANAGER ALSO SAID THE BRAKE WEAR WAS DUE TO DRIVING HABITS.  AS A COMPARISON, WE HAVE A FORD WINDSTAR, 1995 MODEL, WITH ABOUT 140,000 MILES AND IT HAD TO HAVE ONLY ONE BRAKE JOB.  ANOTHER VEHICLE IN OUR POSSESSION, A NISSAN FRONTIER WITH OVER 80,000 MILES HAS NOT HAD TO HAVE THE BRAKES REDONE.  I FEEL THIS IS A DESIGN PROBLEM WITH KIA SEDONA AND CAN LEAD TO A SAFETY ISSUE.  *JB",
        "vin": "KNDUP131246"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/03/2006",
        "dateOfIncident": "11/18/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10155193,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA EX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 SEDONA BRAKES MAKE A MOANING AND GRINDING NOISE. BRAKES WERE REPLACED AND NOISE STILL PERSIST.  *TS  THE CONSUMER STATED THE SLIDING DOOR WAS HARD TO CLOSE AT TIMES. *JB",
        "vin": "KNDUP131746"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/07/2006",
        "dateOfIncident": "03/07/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10152147,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED WHILE APPLYING BRAKE PRESSURE THE BRAKES MADE A GRINDING NOISE.  THE DEALERSHIP REPLACED THE FRONT AND REAR BRAKES AND ROTORS HOWEVER THE PROBLEM STILL EXISTS.  THE MANUFACTURER WAS ALERTED.",
        "vin": "KNDUP131046"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/02/2006",
        "dateOfIncident": "02/22/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10151663,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA EX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED ALL OF THE EXTERIOR LIGHTS HAVE BLOWN.  BOTH THE HEADLIGHTS AND TAILLIGHTS HAVE BEEN REPLACED 2 TIMES EACH.   THE VEHICLE WAS TAKEN TO THE DEALER FOR INSPECTION; HOWEVER THE CAUSE OF PROBLEM COULD NOT BE DETERMINED. THE MANUFACTURER HAS BEEN ALERTED.",
        "vin": "KNDJD733045"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/01/2006",
        "dateOfIncident": "11/18/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10152996,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA EX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 KIA BRAKES SQUEAL AND GRIND, BRAKES WERE REPLACED.  *TS  THE VEHICLE HAD BEEN TAKEN TO THE DEALER THREE TIMES AND EACH TIME THE CONSUMER WAS TOLD THE PROBLEM WAS FIXED. *JB",
        "vin": "KNDUP131746"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/28/2006",
        "dateOfIncident": "02/27/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10151420,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED THE ELECTRICAL SYSTEM WAS CONTINUALLY BLOWING FUSES THAT OPERATE THE HEADLIGHTS.  WHILE DRIVING AT NIGHT IT WAS DANGEROUS BECAUSE THERE WERE NO INDICATIONS THAT THE FUSE WOULD BLOW.  THE BULBS IN THE HEADLIGHT WERE REPLACED NUMEROUS TIMES TO SEE IF THE BULBS WERE THE PROBLEM.  THE BULBS WOULD PASS INSPECTION WHEN TAKING OUT OF THE CONTACT'S VEHICLE.  THE DEALER CAN NOT DUPLICATE THE PROBLEM AND NO REPAIRS WERE MADE.",
        "vin": "KNDJD733845"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/23/2006",
        "dateOfIncident": "02/23/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10150980,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD THIS VEHICLE SINCE FEBRUARY 2004.  SINCE I PURCHASED IT, I HAVE HAD TO REPLACE THE HEADLIGHTS ABOUT EVERY THREE MONTHS.  THEY DO NOT GO OUT AT THE SAME TIME.  ONE GOES, THEN SEVERAL WEEKS LATER THE OTHER GOES.  I HAVE TAKEN TO REPLACING THEM BOTH AT THE SAME TIME, SINCE I KNOW THEY WILL BOTH GO OUT WITHIN A FEW WEEKS OF EACH OTHER.  *JB",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/06/2006",
        "dateOfIncident": "02/01/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10149565,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "AT LESS THAN 21K MILES A LOW BEAM HEADLIGHT BURNED OUT.  WE DON'T USE THEM FOR DRL.  THIS SEEMS ODD AND A FORUM ON KIA SORENTO'S SHOWS THE SAME CONCERN.  AFTER BUYING NEW BULBS I FIND IT TAKES A PROFESSIONAL MECHANIC TO INSTALL THEM...THE DEALER CHARGES $18/BULB FOR LABOR ONLY.  THIS SOUNDS LIKE A SCAM BY THE MANUFACTURER.  THIS IS FOR A SORENTO WHICH YOUR DATABASE DOES NOT ALLOW FOR AN OPTION TO CHOOSE FROM.  FOR MISFIRE PROBLEM I FILED BEFORE THIS I SELECTED SEDONA INSTEAD TO GET MY CLAIM THROUGH.   8JB",
        "vin": "KNDJC733345"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/06/2006",
        "dateOfIncident": "01/15/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10149564,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE LIGHT ON.  ENGINE WAS KNOCKING.  CALLED THE DEALER 3 TIMES AND EACH TIME THEY TRIED TO TELL ME IT WAS MY GAS CAP NOT LOCKED ON PROPERLY.  WHEN I FINALLY BROUGHT IT IN THEY HAD TO DO AN ENTIRE TUNE UP BECAUSE A PLUG WAS MISFIRING.  *JB",
        "vin": "KNDJC733345"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/31/2006",
        "dateOfIncident": "01/30/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 2,
        "numberOfInjuries": 16,
        "odiNumber": 10149166,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS JUST NOTIFIED BY STATE FARM INSURANCE THAT THE AIR BAGS ON THE KIA SORENTO ARE NOT WORKING PROPERLY. THIS HAS CAUSED THEM TO REMOVE THE SAFETY DISCOUNT FROM THE VEHICLE. IF THE AIR BAGS ARE NOT WORKING IN ACCIDENTS THEN I FEEL THAT THEY NEED TO BE FIXED OR REPLACED SO PEOPLE WILL NOT DIE DUE TO THE FAILURE OF AIR BAGS.   *JB",
        "vin": "KNDJD733445"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,TIRES",
        "crash": false,
        "dateComplaintFiled": "01/24/2006",
        "dateOfIncident": "01/22/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10148495,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR OF THE VEHICLE  BEGAN TO PRODUCE A HUMMING NOISE AND IT GRADUALLY GOT LOUDER UNTIL THE PASSENGER SIDE REAR BRAKE ASSEMBLY AND TIRE CAME OUT OF THE 2004 KIA SEDONA. *AK",
        "vin": "KNDUP131X46"
    },
    {
        "components": "SUSPENSION,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/19/2006",
        "dateOfIncident": "08/30/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10148091,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA EX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "08-30-04: CHECK ENGINE LIGHT - R&R FUEL PUMP; DIAG FUEL PUMP (SAME WORK WAS DONE 5-28-04, PRIOR TO VEHICLE PURCHASE).  RT REAR SITS 1/2 INCH HIGHER - NOT ABLE TO CHECK, RESCHEDULED  08-31-04: CHECK ENGINE LIGHT - R&R FRONT HARNESS; HI SCAN WIRING HARNESS; R&R INSTRUMENT HARNESS. RT SIDE OF VAN SITS 1/2 INCH HIGHER - MEASURED; ONLY 1/4 INCH HIGHER; CHECKED SHOCKS; SHOCKS ARE STIFF BUT WITHIN SPECS; NO ADJUSTMENTS NEEDED  07-08-05: VAN SITS LOWER IN DRIVERS SIDE, CK & ADVISE - NO PROBLEM FOUND  09-16-05: CHECK ENGINE LIGHT - REPLACE PSV VALVE; R&R CANISTER; REPLACED PURGE VALVE SOLENOID; HI-SCAN PRO OPERATON (2 TIMES); REPLACE CANISTER CLOSE VALVE; ORDERED NEW GAS CAP (PUT ON 10-12-05)  10-12-05: CAR DOESNT SIT LEVEL - REPLACED BOTH REAR COIL SPRINGS; STILL NOT LEVEL  10-14-05: FIRST CONTACT BY KIA REP(APPROX DATE); REQUESTED COMPENSATION AND/OR RETURN OF VEHICLE; KIA REP PULLING SERVICE TICKETS,RESEARCH AND FIND SOLUTION  11-02-05: CHECK ENGINE LIGHT - HI PRO SCAN; CAP ASSY-FUEL FILLER; VALVE-PURGE CONTROL; R&R ENGINE COVER; REPLACED PURGE VALVE SOLENOID  11-16-05: CHECK ENGINE LIGHT - R&R ENGINE CONTROL MODULE ASSEMBY; REPLACED CANISTER CLOSE VALVE DUE TO NOT WITHIN RESISTANCE SPEC; REPLACED CCV FILTER; CANISTER CLOSE VALVE  12-07-05: CHECK ENGINE LIGHT - AFTER HOURS, LEFT MSG.  12-08-05: KIA REP SAID NOT TO TAKE IT FOR SERVICE; LIGHT NOT FLASHING; OKAY FOR NOW.  12-23-05: KIA REP CALLED WITH SERVICE DATE OF JANUARY 16TH FOR KIA \"EXPERT\" TO LOOK AT MY VEHICLE AT LOCAL DEALERSHIP (APPROX DATE)  12-29-05: LEFT MSG FOR KIA REP -LIGHT WENT OFF(APPROX DATE)- THEIR OFFICE WAS CLOSED TILL 1-3-06  01-03-06: KIA REP CALLED BACK-LIGHT WENT OFF-STILL TAKE IT FOR SERVICE ON 16TH, NOT SURE WHAT THEY WILL BE ABLE TO DO. REQUESTED COMPENSATION AND/OR RETURN OF VEHICLE; DENIED  01-16-06: VEH TO SHOP FOR SVC W/EXPERT    01-18-06: EXPERT FOUND NOTHING WRONG  01-19-06: WAITING ON KIA REP TO CALL WITH SOME COURSE OF ACTION.  *NM",
        "vin": "KNDUP131846"
    },
    {
        "components": "SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "01/12/2006",
        "dateOfIncident": "10/14/2005",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10147663,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE CONTACT STATED WHILE DRIVING AT  3 TO 5 MPH THE  CONTACT'S VEHICLE WAS HIT ON N THE SIDE BY ANOTHER  VEHICLE   PULLING FROM A DRIVEWAY. THE DRIVER AND PASSENGER SEAT BELTS FAILED TO LOCK WHEN THE IMPACT OCCURRED. THE  CONTACT  SUSTAINED INJURIES TO THE NOSE, REQUIRING SURGERY. THE VEHICLE WAS TOWED TO THE LOCAL DEALER. TODAY, THE DEALER PLACED THE VEHICLE IN AN ACCIDENT SIMULATOR IN ORDER TO TEST THE SEAT BELTS. THE RESULTS SHOWED THE SEAT BELTS WERE WORKING PROPERLY AND DID NOT LOCK BECAUSE OF THE SPEED AT THE TIME OF THE ACCIDENT. THE DEALER DETERMINED THE SEAT BELTS SHOULD HAVE LOCKED AT A SPEED OF 25 MPH. *AK",
        "vin": "KNDUP131446"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/03/2006",
        "dateOfIncident": "12/15/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10146799,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "BEFORE 10,000 MILES, THE FRONT WOULD VIBRATE WHEN BRAKING FROM HIGHWAY SPEEDS OR GOING DOWN STEEP HILLS.  I HAD THE ROTORS TURNED BECAUSE THEY WERE WARPED.  WITHIN 3 MONTHS, THE SAME THING HAPPENED AGAIN.  THE ROTORS WERE WARPED AGAIN.  I TOOK IT TO THE DEALERSHIP AND THEY REPLACED THE ROTORS.  WITHIN 3 MONTHS IT DID IT AGAIN.  I TOOK IT BACK TO THE DEALERSHIP AND THEY REPLACED THE ROTORS AGAIN.  I ALSO REPLACED THE BRAKES OUT OF MY POCKET.  IT HAS BEEN ANOTHER 3 MONTHS AND IT IS STARTING AGAIN.  AT A ROUTINE OIL CHANGE AND BRAKE INSPECTION, FIRESTONE SAYS THE ROTORS ARE WARPED AND MY BRAKE PADS ARE DOWN TO 25%.  THE VEHICLE IS ONLY 2 YEARS OLD AND HAS LESS THAN 30,000 MILES ON IT.  I HAVE HAD 3 DIFFERENT SETS OF ROTORS PUT ON THIS VEHICLE.  *JB",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,PARKING BRAKE,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/28/2005",
        "dateOfIncident": "09/28/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10146201,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "NONE.  *NM",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/07/2005",
        "dateOfIncident": "12/06/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10144653,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MULTI OCCASIONS REAR BRAKE OR DIRECTIONAL LIGHTS FAIL. THIS STARTED WITH 3000 MILES AND STILL IS ORRURRING WITH LESS THAN 10, 000 MILES ON THE CAR.  *NM",
        "vin": "KNDJC733545"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,WHEELS,SEATS",
        "crash": false,
        "dateComplaintFiled": "11/15/2005",
        "dateOfIncident": "06/20/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10144259,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "KIA SEDONA REAR OUTER BEARINGS AND/OR HUB ASSEMBLY NEEDING REPLACED. *TS  WHEN THE CONSUMER ARRIVED AT THE DEALERSHIP, SHE INFORMED THE REPRESENTATIVE THE LEFT REAR SEAT WOULD NOT COME OUT AND THE AIR BAG LIGHT WAS ON. WHEN THE CONSUMER WENT TO PICK UP THE VAN AND AFTER GOING OVER THE PAPERWORK, SHE NOTICED ONLY THE AIR BAG LIGHT WAS FIXED AND EVERYTHING ELSE THE PARTS WERE ON ORDER. AFTER GETTING ANOTHER APPOINTMENT, THE CONSUMER THEN TOLD THE DEALER SHE WAS EXPERIENCING A PULSATION WHEN IN THE BRAKES. THE DEALER TOLD THE CONSUMER THE BRAKES WERE NOT A PART OF THE WARRANTY, HOWEVER THEY WOULD TAKE THE RESPONSIBILITY FOR THE ROTORS, BUT THE CONSUMER WOULD HAVE TO PAY FOR THE BRAKE PADS. THE CONSUMER STATED THE PULSATION PROBLEM HAD NEVER BEEN FIXED. THE CONSUMER WAS TOLD NOW THE REAR BRAKES WERE PULSATING.  *JB",
        "vin": "KNDUP131546"
    },
    {
        "components": "PARKING BRAKE",
        "crash": false,
        "dateComplaintFiled": "11/02/2005",
        "dateOfIncident": "10/30/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10141562,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "AN OBJECT STRUCK THE PASSENGER SIDE REAR AXLE BETWEEN THE SPRING AND TIRE CAUSING THE EMERGENCY BRAKE CABLE TO SET THE BRAKE ON THE RIGHT REAR WHEEL WHILE I WAS TRAVELING AT 65 MPH ON AN INTERSTATE HIGHWAY.  AN EMERGENCY STOP WAS REQUIRED TO MAINTAIN CONTROL.  IN ORDER TO SAFELY DRIVE THE VEHICLE, THE CABLE HAD TO BE FORCED BACK TO ITS ORIGINAL POSITION TO FREE THE BRAKE. *JB",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/24/2005",
        "dateOfIncident": "09/29/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10140618,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE CONTACT STATED THAT WHILE DRIVING THE LEFT REAR PASSENGER WHEEL CAME LOOSE FROM THE VEHICLE WITH THE TIRE AS WELL AS THE LUGS NUTS STILL INTACT.   THE CONTACT WAS ABLE TO COAST INTO A GAS STATION BEFORE THE WHEEL CAME COMPLETELY OFF. BEFORE THIS INCIDENT  RECALL 05V232000  REPAIRS WERE PERFORMED ON REAR WHEEL BEARINGS FOR WATER  BY A LOCAL KIA DEALERSHIP.  THE DEALERSHIP INSPECTED  THE INSIDE  WHEEL BEARINGS .  THE VEHICLE WAS TOWED BACK TO THE KIA DEALERSHIP.  THE DEALER COULD NOT DETERMINE WHY THIS OCCURRED, AND COULD NOT FIND ANY MOISTURE WITHIN THE BEARINGS.  THE VEHICLE IS CURRENTLY AT THE DEALER FOR REPAIRS. *AK",
        "vin": ""
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/18/2005",
        "dateOfIncident": "07/10/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10137825,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE CONTACT OWNS A 2004 KIA SEDONA.  WHEN APPLYING THE BRAKES THE WHOLE FRONT END VIBRATED. DID NOT HEAR  NOISES WHEN  APPLYING THE BRAKES. SHE NOTICED THIS AROUND TWO MONTHS AGO.  THE CONSUMER  MOTHER-IN -LAW ALSO HAD A 2005  KIA SEDONA AND SHE EXPERIENCED THE SAME PROBLEM.  THE CONSUMER TOOK  CAR TO A DEALER, AND THEY TOLD HER THAT IT WAS NOT THE BRAKES. THEY WERE NOT SURE WHAT IT WAS. THE CONSUMER SAID THIS HAPPENS AT ANY SPEED.*AK  *JB",
        "vin": "KNDUP131246"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "10/12/2005",
        "dateOfIncident": "09/08/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10139518,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING VEHICLE AS NORMAL ON RTE 1 NORTH.  ATTEMPTED TO SLOW VEHICLE TO STOP AT AMBER COLORED LIGHT BEFORE INTERSECTION WITH E. GRAND AVE,VEHICLE TRAVELING OVER 5 MPH BUT UNDER 10 MPH AT THIS TIME, APPLIED BRAKES, VEHICLE DID NOT SLOW DOWN.  PUMPED BRAKES AND PUSHED BRAKE PEDAL TO FLOOR OF VEHICLE TO NO AVAIL, VEHICLE STILL MOVING , MAINTAINING SPEED,AND ABOUT TO TRAVEL THROUGH RED LIGHT AT INTERSECTION, ALSO APPLIED EMERGENCY BRAKE, VEHICLE DID NOT STOP, VEHICLE PROCEEDED THROUGH RED LIGHT AND COLLIDED WITH ANOTHER VEHICLE TRAVELING EAST BOUND ON E.GRAND AVENUE, AFTER COLLISION TURNED OFF VEHICLE, VEHICLE RESTARTED, TESTED BRAKES ON SIDE OF ROAD, BRAKES WERE APPLIED BUT DID NOT FUNCTION NORMALLY, WHEN BRAKES WERE APPLIED THEY HESITATED AND YOU COULD STILL PUSH PEDAL TO FLOOR WITHOUT STOPPING VEHICLE.  TURNED OFF CAR AGAIN AND RESTARTED FOR LATER TESTING BY POLICE OFFICER.  LATER TESTING SHOWED BRAKES \"APPEARED\" TO FUNCTION NORMALLY. CAR WAS DRIVEN TO DEALER FOR FURTHER TESTING, OBSERVING BRAKES JERKING AND HESITATING.  CAR HAD NOT DEMONSTRATED THIS BEHAVIOR PRIOR TO INCIDENT. MECHANIC CALLED IN SPECIALIST, AS PER MANUFACTURER, TO  MAKE ASSESSMENT OF BRAKES.  RECALL NOTICE RECEIVED FOR DEFECTIVE THROTTLE, PRODUCING SAME EFFECT AS DEMONSTRATED AT INCIDENT.  INFORMED MECHANIC OF RECALL NOTICE UPON RECEIPT,RECALL REPAIRED AS PER DEALER MECHANIC. CAR HAS NOT PRODUCED SAME EFFECT SINCE. *NM",
        "vin": ""
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/07/2005",
        "dateOfIncident": "08/01/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10139006,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA EX",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THERE IS A PROBLEM WITH HEAVY CORROSION ON THE FRONT WHEELS.  THE CONTACT NOTICED THE PROBLEM IN AUGUST 2005,  BUT IT HAD BEEN GOING ON BEFORE THEN.  HE HAD TAKEN  IT TO THE  DEALER TO HAVE TWO RECALL REPAIRS  PERFORMED.  THE RECALLS WERE FOR THE REAR WHEELS AND THROTTLE CABLE.  THE RECALLS WERE ESC-051 AND SC-049.  THE CONTACT ASKED THE DEALERSHIP TO LOOK AT THE FRONT WHEELS ALSO.  HE TOLD HIM THAT ANY VEHICLE WOULD HAVE THAT SAME PROBLEM.  THE REPAIRS HAVE YET TO BE DONE.  *AK UPDATED 11/29/05. *JB",
        "vin": "KNDUP131246"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/04/2005",
        "dateOfIncident": "09/09/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10138436,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WE TOOK OR 2004 SEDONDA EX. TO WESTON PONTIAC FOR A RECALL ON THE THROTTLE CABLE, MY WIFE ALSO SHOWED THEM THE LETTER FOR THE RECALL ON THE ALLOY WHEELS ASKED FOR THEM TO CHECK REAR BEARINGS FOR MOISTURE IN FEAR OF A CRASH. AFTER 3 HRS SHE WAS SENT HOME SAID IT WAS GOOD AND THEY WOULD ORDER PARTS. SOMETHING DIDN'T SEEM RIGHT SO I HAD HER TAKE IT TO BE CHECKED BY OTHER TECH. HIS FINDINGS WAS MOISTURE AND WAS CORRODED WITH RUST. LATER WHEN I WAS TALKING TO KIA'S CAC THEY GOT WESTON PONTIAC ON THE PHONE THE SHOP SAID THEY NEVER HAD TIME TO CHECK REAR BEARINGS WE WERE LUCKY THAT NO ONE WAS INJURED OR DEATHS WE HAVE GOTTEN A RUN AROUND FROM THEM LIES AND ONLY FIXING 1/2 THE PROBLEM.  SAYING OUR PARTS ARE IN AND THEY DID NOT EVEN HAVE THEM JUST THAT KIA HAS CALLED AND WANTED TO GET THEM OFF THEIR BACKS. WE WERE ALSO TOLD TO KEEP CHECKING FOR MOISTURE IN THE BEARINGS AND JUST BRING IT WHEN WE DO. ITS LIKE SAYING DRIVE WITH YOUR EYES CLOSED YOU NEVER KNOW WHEN YOU MAY CRASH, AS THE RECALL SAYS I DON'T LIKE THAT ODDS WITH MY WIFE & GRANDCHILDREN LIVES AT HAND. KIA( KARRIE) IS WHO I SPOKE TO & GAVE ME THIS # K1016279 TO REFER TO MY COMPLAINT SAID WELL YOUR VAN IS FIXED AND NO ONE GOT HURT I DON'T SEE WHAT YOUR PROBLEM IS. THE LIE TO MY WIFE SAYING OR VAN WAS OK WHEN NEVER CHECK AND WAS NOT THE RISK THEY PUT MY LOVED ONES IN WITH NO CONCERN FOR THEIR LIVES AND THAT THEY NEVER FIXED IT THEY PUT A BANDAID ON IT JUST TO GET US AND THIS RECALL OFF THEM. I KNOW THE RECALL WAS NOT ON THE RENTAL BUT IT WAS NOT SAFE TO BE OUT ON THE ROAD THE TIRES WERE BOLD AND WAS OUT OF ALIGNMENT THAT IT PULLED SO HARD TO THE RIGHT. THE ONLY THING THEY COULD SAY WAS NO ONE TOLD US. SO THEY PUT US FROM ONE DANGER RIGHT INTO ANOTHER. PLEASE SOMETHING NEEDS TO BE DONE TO STOP THEM HOW MANY OTHERS HAVE THEY SENT OFF SAYING THEIR VEHICLE IS OK AND NOT. THANK-YOU FOR YOUR TIME AND CONCERN IN THIS MATER ALBERT SMITH . *JB",
        "vin": "KNDUP131846"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/04/2005",
        "dateOfIncident": "06/20/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10138527,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THE CALLER  RECEIVED RECALL LETTER CONCERNING OUTER REAR WHEEL BEARING  IN JUNE AND HAS NOT BEEN ABLE TO GET WORK DONE.  THE CALLER HAS NOT EXPERIENCED ANY PROBLEMS YET. DEALER SAID THE PARTS WERE ON BACK ORDER. MANUFACTURER SAID THEY WOULD CALL THE DEALER AND FIND OUT WHY THE CALLER COULD NOT GET PARTS. THEY WERE TOLD THE CALLER WAS ON TOP OF LIST WHEN PARTS COME IN. CALLER  WAS CONCERNED ABOUT THE SAFETY ISSUE OF THE WHEEL BEARING WENT OUT. THE CALLER SAID THE RECALL LETTER STATED THAT THE PROBLEM COULD LEAD TO A CRASH IF IT WAS NOT REPAIRED. *AK",
        "vin": "KNDUP131746"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/28/2005",
        "dateOfIncident": "09/08/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10137967,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE CONTACT  COMPLAINED ABOUT  BRAKE PROBLEM  FOUR MONTHS AFTER SHE BOUGHT THE CAR. THE CAR STARTED TO SHIMMY. AFTER SHE HAD THE CAR TEN MONTHS  WITH  7,174 MILES ON IT  SHE TOOK THE CAR  TO THE DEALER, AND THE DEALER CHANGED THE ROTORS AND THEN THE DRUMS. ABOUT TWO MONTH LATER WHEN THE CAR HAD 8,317 MILES ON  IT  THE VEHICLE STARTED DOING IT AGAIN. THE DEALER TOLD THE CONTACT  THEY COULD NOT FIX IT UNDER WARRANTY BECAUSE THIS WAS NOT A SAFETY ISSUE. SHE BOUGHT THE CAR BRAND NEW IN MAY-2004.  *AK",
        "vin": "KNDUP131046"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/23/2005",
        "dateOfIncident": "03/14/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10135096,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE CONTACT OWNS A 2004 KIA SEDONA MINI VAN. THE CONTACT STATED THEIR  RECALL  03V158000 CONCERNING ABS BRAKES  WAS ISSUED IN 2003 FOR THE 2003 KIA SEDONA.  THIS VEHICLE WAS HAVING THE SAME PROBLEM AS STATED IN THE RECALL. HOWEVER THE MANUFACTURER WILL NOT INCLUDE 2004  IN THE RECALL. FRONT ENDS  SHIMMIED WHILE BRAKING. SHE WAS CONCERNED BECAUSE THE RECALL STATED THAT THIS COULD  CAUSE EXTENDED   STOPPING DISTANCES AND RESULT IN A CRASH. KIA HAS TURNED THE  ROTORS AND PADS FOUR TIMES. WHILE MAKING A HARD STOP WHEN  COMING OFF OF A FREEWAY THE  FRONT END, STEERING WHEEL, AND THE ENTIRE VEHICLE SHOOK AND SHIMMIED.  THE CONTACT HAD THIS PROBLEM SINCE THE  PURCHASE OF THE VEHICLE ON  MARCH 14, 2004. THE DEALERSHIP AND MANUFACTURER WERE NOT WILLING TO REPAIR THE VEHICLE RIGHT NOW UNDER THE RECALL. SHE WAS IN TOUCH WITH ARBITRATION, AND  WITH CONSUMER AFFAIRS TO POSSIBLY APPLY THE  LEMON LAW  FOR  THIS VEHICLE. SHE HAS A LETTER THAT WAS WRITTEN FROM KIA GENERAL SALES MANAGER, WHERE SHE TAKES VEHICLE IN FOR SERVICE. THE LETTER STATED: THAT 2003 RECALL CAME FROM KIA MOTOR CORPORATION NOT FROM DEALERSHIP. THEREFORE,  SHE MIGHT QUALIFY FOR THE LEMON LAW.  ALSO, TOLD HER TO PURSUE THE  PROBLEM THAT WAY. THE CONTACT HAS COPIES OF THE   LETTERS AVAILABLE FROM THE AGENCIES THAT SHE CORRESPONDED WITH.  THE CONSUMER ALSO HEARD A TICKING NOISE COMING FROM THE ENGINE  *AK  *NM",
        "vin": "KNDUP131646"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/20/2005",
        "dateOfIncident": "09/20/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10137124,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE RECEIVED A SAFETY RECALL NOTICE FROM KIA MOTORS AMERICA, INC DATED AUGUST 29, 2005, NOTIFYING ME THAT MY 2004 KIA SEDONA REQUIRES IMMEDIATE SERVICE AT NO COST TO MODIFY A PROTECTIVE SLEEVE AROUND THE THROTTLE CABLE.  I HAVE CONTACTED NATIONWIDE KIA, THE DEALERSHIP WHERE I PURCHASED THE VEHICLE (SEE CONTACT INFORMATION BELOW), WITHOUT A RESPONSE TO DATE.      NATIONWIDE KIA  1600 YORK RD  TIMONIUM, MD 21093  PH: (410) 561-9000  FX: (410) 561-1967 .   *NM",
        "vin": "KNDUP131056"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/16/2005",
        "dateOfIncident": "06/13/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10134112,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: CONSUMER  RECEIVED A RECALL LETTER ON  6-13-2005 FROM KIA MOTORS AMERICA. THE MANUFACTURER HAS BEEN CONTACTED. THEY STATED THAT  NOT ENOUGH PARTS WERE AVAILABLE TO REPAIR THE PROBLEM IN ALL AFFECTED VEHICLES. TO DATE THIS PROBLEM HAS NOT BEEN REPAIRED IN THE CONSUMER'S VEHICLE. THE DEALER INSPECTED THE VEHICLE AND STATED IT WAS SAFE FOR USE.  THE DEALER RECOMMENDED REPLACEMENT OF THE OUTER WHEEL BEARING WHEN PARTS WERE AVAILABLE. *AK *JB",
        "vin": "KNDUP131546"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/12/2005",
        "dateOfIncident": "06/13/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10136204,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:   THE CONSUMER  RECEIVED  RECALL  LETTER  CONCERNING  WHEELS ON  JUNE 13, 2005 FOR THE KIA SEDONA.  THE CONSUMER TOOK THE VEHICLE TO DEALER ONCE FOR  RECALL REPAIRS  IN JULY 2005 AND SPOKE WITH DEALER TWICE . THEY SAID  THE PARTS WERE ON BACK ORDER.  THE CONSUMER CONTACTED THE MANUFACTURER ONCE AND THEY INDICATED THE SAME THING. THE CONSUMER  IS  STILL WAITING FOR THE PARTS TO COME IN. THE DEALER DID INSPECT THE VEHICLE WHEN IT WAS AT THE DEALER. *AK  *NM",
        "vin": "KNDUP131846"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/08/2005",
        "dateOfIncident": "06/13/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10135833,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "SAFETY RECALL NOTICE MAILED IN JUNE, 2005.  THEY WILL NOT FIX THE PROBLEM UNLESS YOUR VEHICLE IS MAKING A NOISE. *JB",
        "vin": ""
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/07/2005",
        "dateOfIncident": "06/13/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10135707,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: CONSUMER  RECEIVED A RECALL NOTICE CONCERNING THE ALLOY WHEELS ON  06-13-05.  HE  TRIED TO GET THE RECALL FIXED, ON 9-7-05 HE TALKED TO A LOCAL KIA DEALER IN CLARKSVILLE, INDIANA;  WHO TOLD HIM THAT THE PARTS WERE STILL ON BACKORDER AND THAT IT COULD TAKE ANYWHERE FROM NOW TO  NEXT YEAR FOR THE PARTS TO COME IN. *AK *MR",
        "vin": "KNDUP131646"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/07/2005",
        "dateOfIncident": "08/20/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10135720,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  2004 KIA SEDONA.  NHTSA RECALL  05V232000 CONCERNING REAR WHEEL BEARING  WAS ISSUED.  THE VEHICLE WAS TAKEN TO THE DEALERSHIP AND PARTS WERE ORDERED FOR THE VEHICLE ON JULY 7, 2005.   THE CONSUMER WAS  STILL WAITING ON THESE PARTS TO BECOME AVAILABLE.  THE CONSUMER CONTACTED THE DEALERSHIP AT LEAST THREE TIMES AND ALL THREE TIMES THEY COULD NOT TELL THE CONSUMER WHEN THE PARTS WOULD BE IN.   *AK *MR",
        "vin": "KNDUP131046"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/30/2005",
        "dateOfIncident": "06/27/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10134705,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: IN JUNE 2005  THE BRAKES MADE A HUMMING NOISE  FOR ABOUT THREE MONTHS. THEY HAVE NOT CAUSED ANY PROBLEMS WITH STOPPING OR  ANY SAFETY HAZARD PROBLEMS  AT THIS TIME, BUT THE OWNER WAS UPSET BECAUSE  THE CAR  WAS IN THE  REPAIR SHOP FIVE TIMES SINCE JUNE. THE DEALERSHIP SAID THE PROBLEM COULD BE CAUSED BY DIRTY BRAKES.  BUT AFTER CLEANING THE BRAKES THE NOISE WAS STILL THERE. THE DEALERSHIP DID NOT KNOW WHY THE BRAKES WERE MAKING NOISE.  A REPRESENTATIVE FROM KIA WHO DROVE THE CAR AND HEARD THE NOISE. HE SAID IT WAS CAUSED BY DIRTY BRAKES. KIA WILL NOT DO ANYTHING FURTHER  THAN REPLACE THE BRAKES AGAIN.*AK",
        "vin": "KNDUP131946"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/26/2005",
        "dateOfIncident": "06/10/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10129976,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THE CONSUMER RECEIVED A RECALL LETTER, 05V232000, ON JUNE 10, 2005.  THE LOCAL DEALERSHIP WAS CALLED TO ARRANGE THE RECALL REPAIR; THE CONSUMER WAS  TOLD THE PARTS WERE NOT AVAILABLE.  A WEEK LATER, THE CONSUMER CALLED AND WAS TOLD TO BRING THE VEHICLE IN.  THE VEHICLE WAS INSPECTED, BUT THE PARTS WERE STILL NOT AVAILABLE.  AT THIS TIME, THE CONSUMER WAS TOLD NOT TO DRIVE LONG DISTANCES.  THE CONSUMER HAS CALLED MULTIPLE DEALERSHIPS AND THE MANUFACTURER TO LOCATE THE PART.  THE CONSUMER IS GOING TO GO ON A TRIP, APPROXIMATELY 2,500 MILES, AND KIA CORPORATE TOLD HIM TO GO AHEAD AND DRIVE THE VEHICLE.  *JB",
        "vin": "KNDUP131746"
    },
    {
        "components": "SUSPENSION,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/23/2005",
        "dateOfIncident": "08/09/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10133873,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THE CALLER  RECEIVED A RECALL LETTER BUT CAN'T GET REPAIR WORK DONE. DEALER SAID THEY DID HAVE THE PARTS TO FIX IT. THROTTLE CABLE AND WHEEL BARINGS FAIKED. DEALER SAID PARTS  WERE ON BACK ORDER. MANUFACTURER HAS NOT BEEN CONTACTED YET.*AK",
        "vin": ""
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/22/2005",
        "dateOfIncident": "06/13/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10133725,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  CONTACT STATES THERE IS A RECALL ON THE REAR HUB CAPS ON  2004 KIA SEDONA. THE PARTS HAVE BEEN ON BACK ORDER SINCE JUNE 2005.  THE CONSUMER HAS CONTACTED THE MANUFACTURER, AND THEY DID CONFIRM THAT THE PARTS WERE ON BACK ORDER.  THE CONSUMER HAS CONTACTED SERVICE DEALER AND OTHER DEALERSHIPS IN THE AREA, BUT NO ONE HAS THE PARTS AVAILABLE.     *AK",
        "vin": "KNDUP131446"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/19/2005",
        "dateOfIncident": "06/15/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10129868,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE CONSUMER RECEIVED A RECALL LETTER IN THE MAIL ON JUNE 15, 2005. THERE WAS NO RECALL NUMBER ON THE LETTER. THE CONSUMER HAS CONTACTED THE DEALER AND THEY DO NOT HAVE THE PARTS.  IT HAS BEEN A MONTH SINCE THE CONSUMER RECEIVED THE LETTER. THE CONSUMER CONTACTED THE MANUFACTURER AND THE PARTS WERE BACK ORDERED.  *JB  *SC",
        "vin": "KNDUP131246"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "08/18/2005",
        "dateOfIncident": "03/25/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10133265,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "AC HAS MUSTY ODOR WHEN USED. I CAN SMELL EXHAUST GASES FROM OTHER VEHICLES EVEN ON REC AIR. *JB",
        "vin": "KNDUP131046"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/16/2005",
        "dateOfIncident": "08/08/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10133024,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: CONTACT STATED RECEIVED A RECALL FROM  KIA ON 06/13/2005 CONCERNING HUB CAPS.  TOOK VEHICLE TO DEALER FOR RECALL REPAIRS  ON 8-8-05 AND THEY HAD NO PARTS  TO FIX IT.  HE RECEIVED THE RECALL LETTER ON 6-13-05.  THE DEALER AND  MANUFACTURER  TOLD HIM   TO CONTACT SOMEONE IN KOREA TO GET THE PARTS IN.*AK  THE CONSUMER STATED THE RECALL HAS SINCE BEEN TAKEN CARE OF.  11/15/05. *JB",
        "vin": "KNDUP131246"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/16/2005",
        "dateOfIncident": "06/23/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10133025,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THE CONSUME R RECEIVED A RECALL NOTICE BACK IN JUNE FROM KIA, TOOK  THE VEHICLE TO THE DEALER ON JUNE 23, 2005 FOR THE REAR HUB. THEY INSPECTED THE VEHICLE BUT DID NOT HAVE THE PART. CONTACTED THE MANUFACTURER , AND THEY SAID EVERYONE  WAS WAITING FOR PART. *AK",
        "vin": "KNDUP131346"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/16/2005",
        "dateOfIncident": "06/13/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10133060,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  RECEIVED RECALL FOR THE KIA SEDONA ON JUNE 13, 2005  FOR THE WHEEL BEARINGS,  TOOK THE VEHICLE TO THE DEALER FOR   AN OIL CHANGE BUT THEY DID NOT HAVE THE PART.  CONTACTED THE MANUFACTURER AND THEY HAVE NOT RETURNED THE PHONE CALL. *AK  THE CONSUMER STATED THE RECALL HAS BEEN FIXED.  *JB",
        "vin": "KNDUP131746"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/12/2005",
        "dateOfIncident": "07/12/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10129081,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: CONTACT RECEIVED A RECALL LETTER AROUND 6-15-05 CONCERNING  ALLOY WHEELS.  THE CONSUMER CALLED THE DEALER, AND THEY TOLD HER THE BEST THEY COULD DO WAS PUT HER ON A WAITING LIST. THEY COULD NOT TELL HER A SPECIFIC TIME WHEN SHE MIGHT BE CALLED BACK. THERE WERE MORE THAN  30 PEOPLE AT DEALER WITH SIMILAR PROBLEMS. . SHE CONTACTED THE DEALER THE VERY SAME DAY SHE RECEIVED THE LETTER. THE LAST TIME SHE CALLED,(ON JULY 12,05,   SHE TOLD THEM TO PUT HER ON THE LIST. THEY DID RECOMMEND ANOTHER KIA DEALER FURTHER AWAY. SHE DID NOT WANT TO GO FURTHER AWAY DUE TO THE SAFETY ISSUE INVOLVED.*AK *JB",
        "vin": "KNDUP131846"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING,INTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/12/2005",
        "dateOfIncident": "07/30/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10132599,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "HAD ENGINE AND TRANS PROBLEMS AT 1200 MI.  FOUND METAL IN ENGINE AND COULD NOT EXPLAIN WHY.  HAVE HAD RECURRING PROBLEMS WITH BRAKES/ROTORS IN WHICH HAVE HAD ROTORS REPLACED AND NEW PADS AS WELL.  HAS HAD VIBRATION IN ENGINE ON OTHER OCCASIONS IN WHICH FOUND CRACK IN SPARK PLUG. INTERIOR LIGHTS WOULD NOT WORK.  MY VAN WOULD NOT START ONE DAY AND HAD TO HAVE IT TOWED TO KIA IN LEX AND THEY HAD IT FOR SEVERAL DAYS AND WAS NEVER GIVEN A REASONABLE ANSWER TO WHAT IT WAS THAT CAUSED IT TO NOT START.  THE DEALERSHIP HAS BEEN FRIENDLY AND HELPFUL, HOWEVER TO MANY OCCURRENCES FOR ANY NEW VEHICLE SO PLAN TO START LITIGATION TO DECLARE IT A LEMON!   *NM",
        "vin": "KNDUP131546"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/12/2005",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10133422,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR HUB CAP RECALL COULD NOT BE PERFORMED ON THE KIA SEDONA DUE TO LACK OF PARTS.*MR  *JB",
        "vin": "KNDUP131146"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/10/2005",
        "dateOfIncident": "06/28/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10132207,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: CONTACT STATES RECEIVED A RECALL LETTER DATED 6-13 05 FRO  KIA. ON 6-28-05 TOOK VEHICLE TO DEALER FOR INSPECTION . THEY SAID THEY WOULD NEED TO ORDER THE PARTS. HE KEPT CALLING EACH WEEK, AND THEY TOLD HIM THEYE WERE STILL WAITING FOR  THE PARTS. WHEN THE  CONSUMER  CALLED THE 800 CUSTOMER SERVICE NUMBER FOR KIA THEY TELL HIM THE PARTS WERE ON BACKORDER FROM KOREA. ON 8-10-05 THEY TOLD HIM TO TAKE VEHICLE BACK TO THE DEALER,  HAVE THEM LOOK AT IT, AND IF THEY FEEL THAT VEHICLE  WAS UNSAFE THEY  WILL GOVE  HIM A RENTAL/LOANER CAR TO DRIVE.*AK",
        "vin": "KNDUP131246"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/05/2005",
        "dateOfIncident": "06/21/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10126081,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THE VEHICLE STALLED INTERMITTENTLY.  THE VEHICLE WAS TAKEN TO THE DEALER ON MARCH 30, 2004.  AFTER THE ENGINE STALLED THE CHECK ENGINE LIGHT ILLUMINATED.  THE VEHICLE THEN SPUTTERED AND LOST POWER BUT SLOWLY REGAINED IT.  TOOK VEHICLE TO DEALER  FOR THIS PROBLEM AT LEAST 6 TIMES.  KIA SAYS THAT A CYLINDERS  IS MISFIRING , PLUGGING  WIRES ARE CROSS FIRING. THE DATES OF FAILURE ARE APRIL 13, 2004, AUGUST 13, 2004, OCTOBER 19, 2004 AND MARCH 11, 2005, MAY 12, 2005 AND FINALLY JUNE 21, 2005.  THE CONSUMER STATED THAT HIS FAMILIES LIVES HAVE BEEN IN DANGER THREE TIMES.    *AK  *NM",
        "vin": "KNDUP131446"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/03/2005",
        "dateOfIncident": "06/13/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131386,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: RECEIVED RECALL LETTER FROM KIA ON JUNE 13, 2005 FOR THE HUB ASSEMBLEY. CONTACTED THE DEALER, THEY DO NOT HAVE THE PARTS. CONTACTED THE MANUFACTURER THEY WERE SHORT ON PARTS.  *AK",
        "vin": "KNDUP131546"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/03/2005",
        "dateOfIncident": "06/13/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131410,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE CONTACT OWNS A 2004 KIA SEDONA. HE RECEIVED NHTSA RECALL  05V232000 ON JUNE 13, 2005. CONTACT  WASU NABLE TO GET THE REPAIR WORK DONE. WHEN CONTACT TOOK VEHICLE TO DEALER  TO GET TIRES  ROTATED WAS  TOLD BY DEALER THAT  HUB ASSEMBLY WAS FIXE, BUT THEY DID NOT REPLACE THE RECALL PART. CONTACT COMPLAINED THAT DEALER  DID NOT NOTIFY HIM THAT THEY DID NOT COMPLETE THE RECALL. *AK",
        "vin": "KNDUP131146"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/03/2005",
        "dateOfIncident": "06/01/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131447,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE CONTACT OWNED A 2004 KIA SEDONA. THE CONTACT RECEIVED A RECALL 05V232000  IN JUNE OF 2005.  IN AUGUST 2005 NOW AUGUST CONSUMER WAS  IS STILL UNABLE TO GET  RECALL  REPAIRS DONE. CONTACTED THE MANUFACTURER AND  DEALERSHIP, AND THEY TOLD  HER THAT SHE  HAD TO WAIT. CONSUMER DID  NOT  WANT TO WAIT SINCE THIS WAS A SAFETY DEFECT. THE DEALERSHIP WOULD NOT EVEN INSPECT THE  VEHICLE, PARTS WERE UNAVAILABLE. *AK",
        "vin": "KNDUP131446"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/25/2005",
        "dateOfIncident": "06/13/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10129953,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THE CONSUMER OWNS A 2004 KIA SEDONA. HE STATED HE RECEIVED A RECALL LETTER ON JUNE 13, 2005 AND SINCE THEN HE HAS BEEN UNABLE TO GET HIS VEHICLE REPAIRED. THE DEALERSHIP KEEPS TELLING HIM THEY DO NOT HAVE THE PARTS AVAILABLE HE DID SPEAK WITH THE MANUFACTURER AND THEY JUST TELL HIM TO GO TO ANOTHER DEALERSHIP TO GET THE REPAIR WORK DONE. HE DOES NOT FEEL SAFE DRIVING THIS VEHICLE BECAUSE HE CAN'T GET THIS DONE. THE RECALL WAS ON THE ALLOY WHEELS, MOISTURE COULD ACCUMULATE AROUND THE REAR HUBCAPS.*JB",
        "vin": "KNDUP131446"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/22/2005",
        "dateOfIncident": "06/12/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10129688,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THE CALLER RECEIVED A RECALL NOTICE AND CAN'T GET THE WORK DONE.  THE CALLER HAD THREE DIFFERENT APPOINTMENTS TO GET IT FIXED, AND ALL THREE TIMES THEY TOLD HER THAT THEY DID NOT HAVE THE PARTS.  THE DEALER AND THE MANUFACTURER HAVE TOLD HER THAT THEY COULD NOT GET THE PARTS.  *AK  AS OF 08/02/05 THE PARTS HAD NOT COME IN.  *SC",
        "vin": "KNDUP131846"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/22/2005",
        "dateOfIncident": "06/16/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10129710,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  CALLER HAS RECALL THAT  CAN'T GET FIXED BECAUSE DEALER HAS PARTS ON BACK ORDER. RECALL NUMBER IS NOT AVAILABLE.  DEALER INSISTS THEY  CAN'T FIX THE PROBLEM  NOW BECAUSE THEY DON'T HAVE THE PARTS ON HAND. MANUFACTURER ALSO SAID THE PARTS  WERE ON BACK ORDER. *AK",
        "vin": "KNDUP131046"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/20/2005",
        "dateOfIncident": "07/18/2005",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10129485,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER PARKING VAN AFTER A SHORT TRIP OF APPROXIMATELY 2 TENTHS OF A MILE THE VAN WAS TURNED OFF AND THE KEY WAS OUT OF THE IGNITION AND DOORS WERE LOCKED, FOUR HOURES LATER SOMEONE NOTICED SMOKE COMING FROM THE VAN. WHEN THE DRIVERS SIDE DOOR WAS OPENED FLAMES SHOT OUT OF THE VAN. AFTER A FIRE EXTINGUISHER WAS USED TO EXTINGUISH THE FIRE, IT WAS NOTICED BE ME THAT THE MAIN WIRING HARNESS GOING TO THE FUSE PANEL AS WELL AS THE FUSE PANEL WAS MELTED AND SMOLDERING. I ALSO NOTICED THAT THE RADIO WAS PLAYING AND THE DASH LIGHTS WERE FLASHING AND THE DOOR BUZZER WAS BUZZING, ALL WITHOUT THE BEING IN THE IGNITION. I THEN PROCEEDED TO UNHOOK THE POSITIVE BATTERY CABLE TO KILL POWER TO THE VAN. KIA MOTERS CAME AND GOT THE VAN AND TOOK IT TO A LOCAL DEALER. UPON INSPECTION BY THE DEALERSHIP THEY AND KIA MOTORS CONCLUDED THAT IT WAS NOT AN WARRENTY ISSUE. IT WAS OBVIOUS THAT THIS WAS A WIRING FIRE AND WAS NOT CAUSED BY ANY FREAK ACT OF NATURE OR NEGLEGIENCE OF ME THE OWNER. KIA SAYS THAT IT IS NOT A MANUFACTURER DEFECT. KIA SAID TO TAKE PICTURES AND MAIL THEM TO THEM AND TURN IN A CLAIM TO MY INSURANCE COMPANY. WE HAVE READ OF NUMEROUS FIRES JUST LIKE THE ONE THAT OCCURED ON MY VAN ON THE INTERNET.",
        "vin": "KNDUP131846"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/18/2005",
        "dateOfIncident": "06/13/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10129067,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: CONSUMER RECEIVED A RECALL NOTICE  ON REAR OUTER BEARINGS.  CONSUMER COULD  NOT GET REPAIR WORK DONE AT DEALERSHIP BECAUSE THEY DID NOT HAVE ENOUGH PARTS TO FIX THE RECALL .  CONSUMER WAS PLACED ON A WAITING LIST, BUT NO CALLS WERE RETURNED.  CONCERNED, CONSUMER CALLED KIA. AND WAS TOLD THEY ONLY RECEIVED 400 PARTS A WEEK FROM KOREA TO SUPPLY ALL OF THEIR US DEALERSHIPS, AND DID NOT OFFER ANY TIME FRAME AS TO WHEN THE REPAIRS COULD BE HANDLED.  NO REPAIRS AT ALL,  BUT HAS NOT BEEN EXPERIENCING A PROBLEM. *AK",
        "vin": "KNDUP131246"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/12/2005",
        "dateOfIncident": "07/06/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10128414,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  WHILE LOADING GROCERIES INTO THE TRUCK OF THE VEHICLE THE HYDRAULICS WOULD NOT HOLD UP THE WEIGHT OF THE HATCHBACK.  WHEN THE CONSUMER FIRST OPEN THE HATCHBACK HE NOTICED THAT IT DID FEEL HEAVIER THAN USUAL BUT THERE WERE NO SIGNS OF THE HATCHBACK FAILING.  THE DEALERSHIP HAS BEEN NOTIFIED AND THE PART IS ON BACK   ORDER.  THE MANUFACTURER OF THE VEHICLE HAS NOT BEEN NOTIFIED.    *NM",
        "vin": "KNDUP131546"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/12/2005",
        "dateOfIncident": "06/05/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10128462,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS NOTIFIED VIA A LETTERDATED JUNE 13,2005  OF A RECALL TO CORRECT A DEFECT ON MY VEHICLE. (CAMPAIGN ID# 05V232000).  I IMMEDIATELY CALLED THE DEALER TO SCHEDULE AN APPOINTMENT FOR THE REPAIRS.  DEALER NOTIFIED ME OF AWARENESS OF THE RECALL BUT NO PARTS WERE AVAILABLE AT THAT TIME TO COMPLETE THE REPAIRS.   DEALER INDICATED HE WOULD CALL ME WHEN THE PARTS  WERE AVAILABLE.  I WAITED APPROX. FOUR WEEKS THEN CALLED THE DEALER.  AGAIN NO PARTS.  I THEN CALLED KIA CUSTOMER AFFAIRS DEPT.  THEY HAVE NO IDEA WHEN PARTS WILL BE AVAILABLE. THEY SUGGESTED I TAKE THE VEHICLE TO THE DEALER FOR INSPECTION AND IF A DEFECT WAS FOUND THE VEHICLE WOULD BE IMPOUNDED UNTIL PARTS BECAME AVAILABLE.   I THINK KIA IS TAKING FAR TO LONG TO CORRECT THIS PROBLEM.  THE RECALL WAS TO BEGIN JUNE 5, 2005.  OWNERS WERE NOTIFIED VIA LETTER DATED JUNE 13, 2005.  AS OF JULY 12, 2005 THEY HAVE NO IDEA WHEN REPAIRS CAN BE MADE.  MUST PEOPLE BE KILLED BEFORE ACTION IS TAKEN?",
        "vin": "KNDUP131746"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/05/2005",
        "dateOfIncident": "07/05/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10127527,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: CONSUMER  RECEIVED A RECALL LETTER AROUND JUNE 13, 2005. SHE  CONTACTED THE LOCAL DEALERSHIP, AND WAS TOLD THE PARTS WERE NOT IN.  SHE CALLED BACK TODAY AND THE PARTS STILL WERE NOT  AVAILABLE. SHE CALLED KIA, AND THEY TOLD HER TO CALL BACK AND HAVE THE VEHICLE INSPECTED UNTIL THE PARTS WERE AVAILABLE. SHE HAS TO CALL BACK AGAIN TO ARRANGE FOR THAT.  *AK",
        "vin": "KNDUP131746"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/28/2005",
        "dateOfIncident": "06/20/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10126794,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:CONTACT  ATTEMPTED TO HAVE  A RECALL TAKEN CARE OFF BUT THE PARTS  WERE NOT AVAILABLE FROM KIA.  THEY WERE ON BACK ORDER.  CONTACT WAS TOLD BY THE DEALER AND BY KIA THEY WERE ON NATIONAL BACKORDER . HE HAS BEEN TOLD THAT BACK ORDER WILL TAKE APPROXIMATELY 2 WEEKS. HE WAS CONCERNED BECAUSE THE RECALL WAS FOR DAMAGED OUTER WHEEL BEARINGS.  HE  KNEW THERE WAS DAMAGE TO THE WHEEL BEARINGS,  AND THAT HE WAS DRIVING AN UNSAFE VAN, AND TRANSPORTING CHILDREN IN THE VAN.*AK",
        "vin": "KNDUP131146"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/28/2005",
        "dateOfIncident": "06/15/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10126821,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  TOOK  KIA, SEDONA 2004  4 TIMES  TO DEALER FOR BRAKE FAILURE. THE BRAKES SQUEAKED A LOT,  AND THE PROBLEM HAS NOT BEEN FIXED PROPERLY.   CONSUMER  TOOK  VEHICLE TO THE DEALER  AND THE PROBLEM WAS FIXED. BUT, THEN AGAIN ONE COULD  HEAR A SOUND ON THE BRAKES. CONSUMER  WAS TAKEN BACK   VEHICLE TO DEALER FOR  THE 5TH TIME. TO SEE WHAT COULD  BE DONE.  ALSO  TRANSMISSION WHEN IN DRIVE AROUND 5 MPH, WANTED TO STOP, THEN JUMPED  TO NORMAL. ALSO  WHEN THE CAR WAS  IDLING IN PARK OR STOPPING IT SHOOK.  *AK",
        "vin": "KNDUP131746"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/24/2005",
        "dateOfIncident": "06/20/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10126491,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  CONSUMER RECEIVED A RECALL NOTICE. CONTACTED DEALER, AND  THEY DO NOT HAVE THE PARTS FOR RECALL REPAIRS.  DEALER DID RECEIVE SOME PARTS BUT NOT COMPLETE PARTS, THEN, CONTACTED THE MANUFACTURER, WHO FIRST SAID THEY DIDN'T HAVE ANY,  AND SOME WERE NOT COMPLETE. MANAGER  SAID THAT CONSUMER WOULD HEAR A HUMMING 10,000 MILES PRIOR.*AK",
        "vin": "3C3EL55H3YT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/15/2005",
        "dateOfIncident": "06/13/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10125427,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  TOOK VEHICLE  TO DEALER AT LEAST 15 TIMES, THEY SAID NOT KICKING UP ANY ERA CODES.  THE THROTTLE BODY WAS CHANGED ALSO TRANSMISSION CONTROL MODULE (TCM ) WAS THEN CHANGED.  THIS  DID NOT FIX THE PROBLEM.  THEY DID SOMETHING WITH THE GROUNDS. IN  FEBRUARY 2005 THEY PUT IN A NEW TRANSMISSION.  LIKE THE CAR  IT WAS LOSING POWER, AND CAR WAS GEARING DOWN ON ITS OWN.  AT FIRST THIS ONLY HAPPENED ONCE OR TWICE A WEEK, BUT CURRENTLY IT HAPPENED  EVERY TIME CONSUMER  GOT  INTO THE CAR.  THE LAST THIS HAPPENED CONSUMER  PULLED OUT ONTO  A ROAD AND CAR HAD NO POWER, AND  DID NOT WANT TO ACCELERATE.  IT WAS ALMOST HIT BY A TRACTOR TRAILER.  DROVE TO DEALERSHIP DID NOT TURN OFF THE CAR. TECHNICIAN  DROVE THE CAR, AND HE SAID THAT THE TRANSMISSION KICKED ITSELF INTO SAFE MODE, WHICH MEANT THE CAR STAYED IN SECOND GEAR  WHILE DRIVING.    *AK",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/03/2005",
        "dateOfIncident": "05/30/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10124043,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THUMPING NOISE FROM FRONT END..WHEELS OR STRUTS.  USUALLY OCCURS AT SLOW SPEEDS ON UNEVEN SURFACES.  NOT AS NOTICABLE AT HIGHER SPEEDS.  THIS CONCERNS ME BECAUSE SOMETHING IS APPARENTLY LOOSE AND VIBRATING YET THEY HAVE YET TO CORRECT THE PROBLEM.  IF YOU LOOK AT WW.KIA-FORUMS.COM AND LOOK UNDER SEDONA, YOU WILL SEE NUMEROUS PEOPLE WITH THE SAME PROBLEM AND KIA HAS YET TO FIX IT.  I GUESS THEY WON'T BE HAPPY UNTIL THE FRONT END FALLS OUT OR SOMETHING.  PEOPLE HAVE HAD THEIR WHOLE FRONT END BASICALLY REPLACED AND STILL THEY HAVE THE PROBLEM.",
        "vin": "11111111111"
    },
    {
        "components": "TIRES,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/01/2005",
        "dateOfIncident": "05/05/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10120093,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THE SPARE TIRE UNDERNEATH THE VAN SITS ON A METAL RACK.  THE  METAL RUBED ON THE TIRE AND MADE RIDGES ON THE TIRE.    CONSUMER CONTACTED MANUFACTURER.  *AK  *SB  *NM",
        "vin": "KNDUP131446"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/01/2005",
        "dateOfIncident": "01/01/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10123844,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE CONTACT OWNS A 2004 KIA SADONA. THE DASH LIGHTS HAVE REPEATEDLY FAILED IN LESS THAN ONE YEAR. A COUPLE OF TIMES THE DEALER PUT FUSES IN THE VEHICLE, AND THEY CLAIMED THAT SOMETHING HAD BEEN PLUGGED INTO THE CIGARETTE LIGHTER THAT DID NOT WORK. THE MASTER TECHNICIAN PUT A NEW INSTRUMENT CLUSTER BOARD. THIS WOULD SOLVE THE PROBLEM FOR A WEEK UP TO A MONTH, AND THE PROBLEM WOULD COME  BACK. AT NIGHTS, THEY CANNOT SEE THE SPEED OR FUEL OR ANY LIGHTS ON THE DASHBOARD.  PREVIOUS OWNER HAD THIS VEHICLE IN THE SHOP THREE TIMES FOR ELECTRICAL REASONS.  *AK",
        "vin": "KNDUP131146"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/08/2005",
        "dateOfIncident": "12/21/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10111567,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER COMPLAINED ABOUT A BRAKE PROBLEM.   THE BRAKES LOCKED UP WHILE THE VEHICLE WAS COMING TO A STOP.  VEHICLE MADE A LARGE CLANKING SOUND WHEN APPLYING THE BRAKES. CONSUMER TOOK THE VEHICLE TO THE DEALER. HOWEVER, THE DEALER WAS UNABLE TO DUPLICATE THE PROBLEM.  *AK   THE CONSUMER STATED THAT THE BRAKES HAVE NOT WORKED PROPERLY SINCE PURCHASE.  *TC",
        "vin": "KNDUP131246"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/02/2005",
        "dateOfIncident": "01/18/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10109560,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE VEHICLE IS COLD THE ACCELERATOR PEDAL WILL NOT GO DOWN. VEHICLE HAS TO WARM UP BEFORE THE ACCELERATOR PEDAL WILL OPERATE NORMALLY.  OWNER WAS INFORMED THAT THE ACCELERATOR THROTTLE CABLE NEEDED TO BE REPLACED. DEALER REPLACED THE CABLE, AND THE VEHICLE  WAS OPERATING NORMALLY. *AK  THE CONSUMER STATED THAT THE GAS PEDAL STUCK AND THE VEHILCE REACHED 90 MPH.   *TC",
        "vin": "KNDUP131446"
    },
    {
        "components": "STEERING,ENGINE AND ENGINE COOLING,POWER TRAIN,ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/18/2005",
        "dateOfIncident": "08/18/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10103760,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 50 MPH VEHICLE STALLED. VEHICLE WAS STILL DRIVEABLE.  DEALERSHIP INFORMED THE CONSUMER THAT THERE TRANSMISSION FAILED. DEALERSHIP WAS NOTIFIED, BUT DID NOT RESOLVE THE PROBLEM. *AK  DEALER STATED PROBLEM WAS CAUSED BY ELECTRICL HARNESS.  ALSO HAVING MULTIPLE FAILURES WITH OUTPUT SPEED SENSOR; TRANSMISSION 3 TIMES;  THERMOSTAT ASSEMBLY; POWER STEERING LEAKED; INPUT SPEED SENSOR;  LOW GROUND VOLTAGE FAILED; FUSE BLOCK PROBLEMS; CRUISE CONTROL.   CONSUMER WAS ADVISED THAT DUE TO THE DESIGN OF THE CRUISE CONTROL, THE VEHICLE ACCELERATES OFTEN WHILE ON AN INCLINE AT 45 TO 55 MPH AS IF VEHICLE'S ENGINE/TRANSMISSION WAS RACING.  *TT   *TC",
        "vin": "KNDUP131X46"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "02/07/2005",
        "dateOfIncident": "01/29/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10109974,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE GOING EAST ON A COUNTY ROAD(219TH), AT ABOUT 40 MPH. THE PASSENGERS FRONT TIRE CROSSED THE WHITE LINE AND SLIPPED INTO THE DITCH. VAN CONTINUED EAST INTO A TELEPHONE POLE, BREAKING IT IN 3 PIECES. THE VAN THEN SLIDE SIDEWAYS AND CAME TO REST SOUTHBOUND AFTER HITTING A TREE. AFTER VAN CAME TO REST AND THE DRIVER CHECKED FAMILY'S SAFETY, IT WAS THEN DISCOVERED THAT THE AIR BAGS ON BOTH SIDES HAD NOT DEPLOYED AND THAT THE AUTO LOCK FEATURE OF THE SEAT BELTS HAD NOT ENGAGED EITHER. WE WERE ASSISTED FROM THE VAN AND CONTACTED THE POLICE. VAN WAS TOWED TO WRECKING YARD (NOT DRIVABLE).NOTIFIED KIA SERVICE MANAGER OF FAILURES AND HE TOLD ME TO CONTACT KIA. HE GAVE US THE NUMBER AND SAID WE NEED TO CONTACT THEM ASAP AND THEY WILL CONTACT HIM. KIA TOOK OUR INFORMATION AND TOLD US TO SEND PICTURES AND A LEGIBLE COPY OF ACCIDENT TO THE MAIN OFFICE IN CA.    *JB",
        "vin": "KNDUP131646"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/21/2005",
        "dateOfIncident": "12/01/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10107708,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "RECENTLY PURCHASED A NEW 2004 KIA SEDONA ON 11/29/04 AND A COUPLE OF DAYS AFTER I BOUGHT IT I NOTICED EVIDENCE OF RUST AROUND THE BOLTS THAT HOLD THE FRONT SEATS TO THE CHASSIS.  AFTER FURTHER INSPECTION, I FOUND NUMEROUS POINTS OF RUST ON THE INTERIOR OF THE VEHICLE.  I TOOK TO VEHICLE TO THE DEALERSHIP TO RECTIFY THE SITUATION AND THEY STATED THAT THEY HAD NEVER SEEN THIS TYPE OF PROBLEM BEFORE.  THE DEALERSHIP THEN CONTACTED THE KIA DISTRICT REPRESENTATIVE TO FIND OUT WHAT TO DO ABOUT THE PROBLEMS WITH THE RUST.  HE INFORMED THE DEALERSHIP TO SAND DOWN AND PRIMER THE AFFECTED AREAS.  I TOLD THEM THAT WAS NOT AN ACCEPTABLE OPTION.  SO, THE KIA REPRESENTATIVE THEN HAD THE DEALERSHIP REPLACE THE FRONT SEATS AND SAND DOWN THE REMAINING AFFECTED AREAS AND PRIMER THEM.  WHEN THE DEALERSHIP STARTED PERFORMING THE REPAIRS THEY ACTUALLY FOUND SIGNIFICANT AMOUNTS OF RUST UNDERNEATH THE DASH AND UNDER THE CARPET.  THE DEALERSHIP HAS STATED THAT IT WOULD COST TOO MUCH TO COMPLETELY REPAIR THE VEHICLE, AND THAT I NEEDED TO FILE A COMPLAINT WITH KIA CONSUMER AFFAIRS.  I DID FILE A COMPLAINT AND KIA HAS STATED THAT THEY HAVE MET THEIR OBLIGATION TO VEHICLE UNDER THE WARRANTY AND OFFERED ME THREE MONTHS CAR PAYMENT FOR MY INCONVENIENCE.  *NM",
        "vin": "KNDUP131446"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/12/2005",
        "dateOfIncident": "01/04/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10106210,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "HIT SOME BLACK ICE AND VEHICLE STARTED TO SPIN, THEN ROLLED.  NONE OF THE AIRBAGS DEPLOYED.  VEHICLE WAS TOTALED.  THIS VEHICLE MODEL IS THE SORENTO LX.*AK",
        "vin": "KNDJD733445"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/11/2005",
        "dateOfIncident": "04/20/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10106115,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 KIA SORENTO LEAKS OIL.  FOUR TIMES IN FOR SERVICE, LATEST TIME JANUARY 5, 2005.  TWICE DEALER REPLACED OIL PLUG GASKET.  LAST TIME IN DEALER SERVICE DEPT SAYS PROBLEM IS CAUSED BY DEFECTIVE DESIGNED OIL FILTERS.  DEALER GOES ON TO SAY KIA AWARE OF PROBLEM AND GOING TO REDESIGN OIL FILTER.  DEALER DOES NOT KNOW WHEN NEW FILTER IS GOING TO BE AVAILABLE.  IN MEAN TIME MY 2004 SORENTO CONTINUES TO LEAK OIL.  FUMES FROM OIL BURNING ON HOT ENGINE CAUSING ME HEADACHES AND NAUSEA.  DON'T BELIEVE DEALER EXPLANATION.  USED TO HAVE A 2003 SORENTO WHICH KIA REPLACED BECAUSE OF MAJOR ENGINE PROBLEMS.  NOW THE REPLACEMENT VEHICLE (2004 SORENTO) HAS OIL LEAKING PROBLEMS THAT ARE UNRESOLVED BY DEALER.  GOING TO TAKE IN AGAIN BECAUSE FUMES SO STRONG IT MAKES IT UNDRIVEABLE EXCEPT AS A LAST RESORT.  BELIEVE ENGINE IN 2003 SORENTO IS SAME TYPE ENGINE IN 2004 SORENTO.  OIL LEAKING IN THE 2003 WASN'T AN ISSUE.  ONLY IN THIS SORENTO 2004.*AK",
        "vin": "KNDJC733045"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/11/2005",
        "dateOfIncident": "03/10/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10106113,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "OIL LEAKS - 2004 KIA SORENTO.  COMPLIANT FORM DOES NOT ALLOW ME TO SELECT SORENTO AS VEHICLE MODEL WHEN COMPLETING THIS FORM.  DEALER REPLACED OIL PLUG GASKET TWICE.  BEEN IN FOR OIL LEAK COMPLAINTS 4 TIMES.  LAST TIME THERE JAN 05, 2005 DEALER SERVICE SAYS PROBLEM IS OIL FILTER LEAKING BECAUSE OF DEFECTIVE OIL FILTER DESIGN.  DEALER SERVICE SAYS KIA IN PROCESS OF RE-DESIGN OF FILTER.  WHEN NEW OIL FILTERS AVAILABLE DEALER SAYS UNKNOWN.  FIND THIS EXPLANATION OF PROBLEM TO BE UNBELIEVABLE.  DON'T BELIEVE 2004 ENGINE DIFFERENT FROM 2003 ENGINE IN THIS VEHICLE.  WHEN LAST IN DEALER SERVICE ANOTHER CUSTOMER WAS IN FOR SAME TYPE OF PROBLEM; OIL LEAKS IN 2004 SORENTO.  WAS IN MULTIPLE TIMES FOR A SOLUTION.  USED TO HAVE SORENTO 2003 AND NEVER HAD LEAKING OIL, KIA REPLACED MY 2003 WITH A 2004 SORENTO BECAUSE OF MAJOR PROBLEMS WITH 2003.  ENGINE OIL LEAKING WAS NOT ONE OF THE PROBLEMS WITH 2003.  BELIEVE SAME ENGINE USED IN BOTH MODELS.  DON'T BELIEVE PROBLEM IS OIL FILTER DESIGN.*AK",
        "vin": "KNDJC733045"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "11/30/2004",
        "dateOfIncident": "11/30/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10100762,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS MILEAGE FAR BELOW PROMISED. THE 2004 KIA SEDONA LX WAS POSTED AS 16-22 MPG. WE ARE AVERAGING 11 MPG HWY/CITY. IT HAS BEEN TO THE DEALER TWICE, THE SECOND TIME THERE WERE PARTS REPLACED LIKE AIRFLOW SENSORS. THIS DID NOT CORRECT THE PROBLEM. OUR DEALER HAS WORKED WITH US WELL, BUT WITH GAS PRICES THE WAY THEY ARE, THE COST TO OPERATE THE VEHICLE IS MUCH MORE THAN ADVERTISED. I HAVE TALKED TO OTHERS WHO OWN THE SEDONA AS WELL, SOME ARE AVERAGING OVER THE 20MPG, WHILE OTHERS ARE LIKE MYSELF, 10-11 MPG.*AK",
        "vin": ""
    },
    {
        "components": "SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/20/2004",
        "dateOfIncident": "10/17/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10096123,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 10/17/04 WHILE DRIVING TO WORK I HEARD A NOISE LIKE I HAD A FLAT, WHEN THE VEHICLE WAS CHECKED THERE WAS NO FLAT. I DROVE THE VEHICLE TO THE NEAREST EXIT. WHEN I ATTEMPTED TO MOVE THE VEHICLE THE WHOLE TIRE FELL OFF THE VEHICLE, THE REAR DRIVERS SIDE . THE VEHICLE WAS TOWED TO THE DEALER WHERE NEW PARTS WERE ORDERED. IN MY OPINION I DONT FEEL SAFE DRIVING THIS VEHICLE BECAUSE IT COULD HAPPEN AGAIN AND NEXT TIME I MIGHT NOT BE LUCKEY. I COULD HAVE KILLED OR MY WHOLE IF THEY WERE WITH ME.",
        "vin": "KNDUP131X46"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/29/2004",
        "dateOfIncident": "09/28/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10093277,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "BLOWN MAIN ENGINE FUSE DUE TO THIS FAILURE IT SHUTS OFF ALL ENGINE AND IT DOES NOT OPERATE AT ALL.  WHILE DRIVING, ENGINE SHUTS OFF AND WON'T START.  AFTER IT WENT TO THE DEALER FOR SO MANY DAYS WITHOUT CALLING US TO INFORM OF WHAT'S GOING ON, THEY HAVE  FIGURED THAT IT HAS A BLOWN FUSE AND THEY ( DEALER MECHANICS ) BLAME ME TO THE FACT THAT I MIGHT BE USING A LOT OF ELECTICAL ACTIVITIES IN THE VAN SUCH AS PLAYING VIDEO GAME WHILE DRIVING AND MIGHT HAVE CAUSED THE ELECTRICAL BLOW OUT.  THEN 2 MONTHS LATER... SAME THING HAPPENED I WAS ON MY WAY TO WORK AND IT DID THE SAME THING. NOW THAT THE CAR IS AT THE DEALER, GOD KNOWS WHAT THEY WILL COME UP WITH, TO HAVE SUCH AN EXCUSE. *AK",
        "vin": "KNDUP131346"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/15/2004",
        "dateOfIncident": "08/21/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10092321,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING THE VEHICLE STARTED TO SHAKE AND  THEN SHUT DOWN.  THE DEALER CHANGED THE ENGINE AND THE DEFECT OCCURRED AGAIN, THE VEHICLE WAS PLACED ON THE COMPUTER AND NO DEFECTS  HAVE BEEN FOUND.  *JB",
        "vin": "KNDUP131X46"
    },
    {
        "components": "PARKING BRAKE",
        "crash": true,
        "dateComplaintFiled": "08/31/2004",
        "dateOfIncident": "07/09/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10090125,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PARKED ON AN INCLINE EMERGENCY PARKING BRAKE DID NOT ENGAGE.   VEHICLE ROLLED BACKWARD UNTIL IT HIT A TREE. DEALER WAS NOTIFIED. *AK",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/19/2004",
        "dateOfIncident": "08/18/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10089263,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT ANY SPEED, THE VEHICLE STALLED WITHOUT WARNING. PLEASE PROVIDE MORE DETAILS.  *JB",
        "vin": "KNDUP131746"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/06/2004",
        "dateOfIncident": "04/27/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10080390,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING THE VAN ANY SPEED. ONCE IT WARMS UP WITH THE AC ON THERE IS A LOUD GROANING/GROWING SOUND COMING FROM THE REAR CARGO AREA OF THE VEHICLE.  THE SOUND STARTS OUT INTERMITTENTLY AND THEN CONTINUES AND INCREASES IN FREQUENCY.   *NM",
        "vin": "KNDUP131546"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/30/2004",
        "dateOfIncident": "06/30/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10080193,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT ANY SPEED CONSUMER HEARD A LOUD NOISE DESCRIBED AS RUBBING COMING FROM THE REAR BRAKES.  VEHICLE WAS TAKEN TO DEALERSHIP, AND  TECHNICIAN INDICATED THAT VEHICLE WAS OPERATING AS DESIGNED BY THE MANUFACTURER.  *AK",
        "vin": "KNDUP131946"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/24/2004",
        "dateOfIncident": "04/15/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10079770,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DEPRESSING THE BRAKES AT ANY SPEED FRONT END  VIBRATED. CONSUMER TOOK THE VEHICLE TO THE DEALER FOR INSPECTION, AND MECHANIC  DETERMINED THAT THE ROTORS  FAILED. CONSUMER STATED THAT ROTORS  WERE ALREADY REPLACED, BUT PROBLEM RECURRED.*AK",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "06/04/2004",
        "dateOfIncident": "10/18/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10071493,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDSHIELD HAS SOME TYPE OF HAZE THAT APPEARS CLOUDY THROUGH THE DRIVER'S EYES.  THE HAZE MAKES IT HARD FOR THE DRIVER TO SEE CLEARLY. *AK  THE KIA REPRESENTATIVE INDICATED THAT THE HAZE WAS A CHARACTERISTIC OF THE VEHICLE AND THAT NOTHING COULD BE DONE TO CORRECT IT.  *NM",
        "vin": "KNDUP131246"
    }
]