[
    {
        "components": "VISIBILITY,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "12/17/2010",
        "dateOfIncident": "10/01/2006",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10371130,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A 2004 LANCER OZ RALLY BRAND NEW, STILL DRIVE IT DAILY AND I'VE ALWAYS HAD THIS PROBLEM TOO.  IT WAS HARD TO TURN TO THE HEAT AND THE KNOB BROKE OFF.  I CAN'T USE THE HEAT ANYMORE BECAUSE I CAN'T GET IT TO TURN AT ALL.  I EVEN TRIED USING NEEDLE NOSE PLIERS (MINE STILL HAS SOME OF THE WHITE PLASTIC PART ATTACHED), WHICH WORKED A FEW TIMES BUT NOW I CAN'T GET IT TO TURN AT ALL.  IN 2006, WHEN THE KNOB BROKE OFF,  I CONTACTED THE DEALER WHERE I BOUGHT THE CAR FROM ABOUT THE PROBLEM.  THEY SAID IT WOULD COST AT LEAST $800 TO REPAIR.  I ASKED WHY, IT'S JUST A KNOB?  THEY TOLD ME THEY HAD TO TAKE MY WHOLE DASH APART TO FIX IT AND IT WAS MOSTLY LABOR COSTS.  I CAN'T AFFORD TO PAY THIS FOR A FAULTY MECHANISM.      I ALSO COULDN'T USE MY DEFROSTER THIS MORNING AND REALLY NEEDED IT.  I HAD TO PULL OVER TO WIPE MY WINDOWS... NOT SAFE MITSUBISHI!!!!  PLEASE RECALL THIS NOW!!!  *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/09/2008",
        "dateOfIncident": "10/04/2008",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10245006,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HEARD A SQUEAKING NOISE COMING FROM THE BACK OF MY 2004 LANCER RALLIART.  I HAD THE REAR SWAY BAR REPLACED, AND THEN I ALSO HAD THE STRUTS REPLACED IT WAS GOOD FOR 2 DAYS AND NOW IT IS SQUEAKING AGAIN.  IT IS VERY FRUSTRATING SINCE I HAD TO PAY ALOT OF MONEY TO HAVE IT FIXED AND NOW IT IS SQUEAKING AGAIN.  *TR",
        "vin": "JA3AJ66F54U"
    }
]