[
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ELECTRICAL SYSTEM,STRUCTURE,SEATS",
        "crash": false,
        "dateComplaintFiled": "10/18/2005",
        "dateOfIncident": "04/05/2004",
        "fire": false,
        "manufacturer": "MONACO COACH CORPORATION",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10134035,
        "products": [
            {
                "manufacturer": "MONACO COACH CORPORATION",
                "productMake": "MONACO COACH",
                "productModel": "DIPLOMAT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THE CALLER HAS A PROBLEM WITH THE FRONT ROADSIDE SLIDE ON THE MOTOR HOME. THEY  HAD IT IN FOR REPAIR 8 DIFFERENT TIMES, AND IT STILL IS NOT FIXED. TO DATE THE ROADSIDE SLIDE IS UNSTABLE. THE SLIDE IS OFF CENTER, AND A PERSON CAN PUT  THEIR HAND IN THE BOTTOM OPENING TO THE SIDE. THEREFORE, THE SLIDE RIDES TOO HIGH AND CAUSES A LOUD WIND NOISE, A PERSON IS UNABLE TO HEAR THE TRAFFIC, AND THIS CAUSES DISTRACTION FOR THE DRIVER. ALSO, FEAR OF TURNING A CORNER AND CAUSING AN ACCIDENT. THE CAPTAIN'S DRIVER SEAT IS WOBBLING AT THE PEDESTAL, THE CALLER IS AFRAID THE SEAT WILL FALL OFF. WHEN APPLYING THE BRAKES THE RIGHT REAR SMOKES AND BELLOWS OUT AROUND THE WHEEL. THIS MOTOR HOME GCWR IS 39,300 POUNDS. THIS IS THE REASON WHY THIS MOTOR HOME IS UNSAFE. DIFFERENT DEALERS HAVE TRIED TO FIX THE ROADSIDE SLIDE, BUT NO ONE HAS BEEN ABLE TO DO SO.  MANUFACTURER OFFERED THEM ANOTHER MOTOR HOME IF SHE PAID THE DIFFERENCE. THEY OFFERED THEM $5000.00 TO BRING IT TO ELKHART, INDIANA FOR REPAIRS.  THE CALLER HAS HAD IT THERE TWO OTHER TIMES FOR THE SAME PROBLEM. THE CALLER SAID THE WORK WAS POORLY DONE UNDER THE WARRANTY. CALLER BELIEVES THIS IS A MANUFACTURER'S  DEFECT. THE CALLER HAS HAD NUMEROUS ELECTRICAL PROBLEMS WITH MOTOR HOME.*AK *JB",
        "vin": "1RF42464542"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "06/05/2005",
        "dateOfIncident": "01/26/2005",
        "fire": false,
        "manufacturer": "MONACO COACH CORPORATION",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10124244,
        "products": [
            {
                "manufacturer": "MONACO COACH CORPORATION",
                "productMake": "MONACO COACH",
                "productModel": "DIPLOMAT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DEFROSTER NOT WORKING WINDSHIELDD ICED OVER WHEN DRIVING FROM SNOW. WHEN STOPED DEFROSTER WILL OUTPUT ENOUGH HEAT TO MELT ICE. HEATER DEFROSTER IS SUB STANDARD INSUFFICIENT HOT WATER FLOW FROM REAR MOUNTED DIESEL ENGINE TO HEATER CORE ABOUT 37FT.",
        "vin": "1RF42464842"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "05/26/2005",
        "dateOfIncident": "12/25/2004",
        "fire": false,
        "manufacturer": "MONACO COACH CORPORATION",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10122259,
        "products": [
            {
                "manufacturer": "MONACO COACH CORPORATION",
                "productMake": "MONACO COACH",
                "productModel": "DIPLOMAT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DEFROSTER NOT WORKING WINDSHIELD ICED OVER WHEN DRIVING FROM SNOW AND FREEZING RAIN.WHEN STOPED DEFROSTER WILL OUTPUT ENOUGH HEAT TO MELT ICE. HEATER DEFROSTER IS SUB STANDARD.",
        "vin": "1RF42464842"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ELECTRICAL SYSTEM,STRUCTURE,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "03/25/2005",
        "dateOfIncident": "02/23/2005",
        "fire": false,
        "manufacturer": "MONACO COACH CORPORATION",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10115850,
        "products": [
            {
                "manufacturer": "MONACO COACH CORPORATION",
                "productMake": "MONACO COACH",
                "productModel": "DIPLOMAT",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DIPLOMAT 40PDQ 2004 MOTOR HOME, THE SLIDE WAS OFF CENTER AND STRIPS WERE NOT LINED UP PROPERLY.   *BF  THE SLIDE RIDES TO HIGH AND CAUSES SO MUCH WIND NOISE THAT THE CONSUMER WAS UNABLE TO HEAR OUTSIDE TRAFFIC.  A GAP UNDER THE WINDOW ALLOWED WATER TO COMING INTO THE COACH.  THE CAPTAIN DRIVER SEAT STARTED COMING APART AT THE PEDESTAL.  WHEN APPLYING THE BRAKES SMOKE BILLOWED FROM THE REAR PASSENGER'S SIDE  WHEEL.  THE AIR CONDITIONER/HEAT PUMP KICKED THE CIRCUIT BREAKER.  THE WINDSHIELD LEAKED IN THE CENTER ONTO THE DASH.  CB GROUND PROBLEM.  THE WASHER AND DRYING DID NOT WORK PROPERLY.  THE HOLDING TANK WOULD NOT REGISTER PROPERLY.  MANY ATTEMPTS HAVE BEEN MADE TO REPAIR THE COACH BUT NONE HAVE BEEN SUCCESSFUL.  THE CONSUMER WOULD LIKE A FULL REFUND OF ALL MONEY PLUS ATTORNEY FEES OR A NEW COACH.    NM",
        "vin": ""
    }
]