[
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/29/2021",
        "dateOfIncident": "09/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434840,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2004 Oldsmobile Alero. The contact stated while driving 35 MPH, the vehicle accelerated independently. The contact stated no warning light was illuminated. The contact stated she was able to drive to her destination. The contact called multiple local dealers: Les Stanford Cadillac (21730 Michigan Ave, Dearborn, MI 48124, (313) 565-6000), Gordon Chevrolet, INC. (31850 Ford Rd, Garden City, MI 48135, (734) 237-6089) and James-Martin Chevrolet, INC. (6250 Woodward Ave, Detroit, MI 48202, (313) 444-8226) and was informed that the accelerator pedal was no longer being manufactured. The vehicle was not diagnosed or repaired. Upon investigation, the contact associated the failure with NHTSA Campaign Number: 04V528000 (Vehicle Speed Control) however, the VIN was not included. The manufacturer had been informed of the failure. The failure mileage was approximately 112,000.",
        "vin": "1G3NL12E24C"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/30/2020",
        "dateOfIncident": "10/30/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11372378,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HAZARD AND TURN SIGNALS DOESN'T WORK AT ALL. I BOUGHT A NEW TURN SWITCH, PUT A NEW FUSE IN AND EVERYTHING AND NOTHING WORKS. WHEN I DRIVE ON THE ROAD THE TURN SIGNAL DOESNT COME ON AND SOMETIMES IT CAUSES A LOT OF PROBLEMS.",
        "vin": "1G3NL52F24C"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/18/2019",
        "dateOfIncident": "12/14/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11180995,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTICED THE WINDSHIELD WAS LEAKING WHICH CAUSE TO LEAK ON EQUIPMENT UNDER INSIDE AND OUT DASHBOARD WITCH CAUSED EROSION AND DEFECTS TO OTHER OPERATING EQUIPMENT LEAD TO CAR STALLING WHILE DRIVING,SOME OPERATIONS OF WILL WORK, SOME WON'T. IT HAS A MIND OF IT'S OWN,THE SECURITY SYSTEM ON CAR DOES NOT WORK. I DO NOT FEEL SAFE SINCE I WAS DRIVING DOWN ROAD ON HIGHWAY 55MPH. AND THE CAR COMPLETELY TURN OFF, I TURNED IGNITION SWITCH TO TURN CAR BACK ON IT WAS VERY SCARY MOMENT. I DIDN'T KNOW WHAT TO DO. BUT I WISH I CAN AFFORD TO FIX THE CAR PROBLEMS THAT HAS CAUSED ME A LOT OF MISERY FINANCIALLY EMOTIONALLY FEEL SAFE WITH GM SEALING FRONT WINDOW PROPERLY ON ALERO I WOULDN'T HAVE THESE PROBLEMS IN THE FIRST PLACE! SO NOT PROPERLY SEALING AND WIRING DIAGRAM NEEDS TO BE EXAMINED IN MY OPINION ALL I WANT IS TO FEEL SAFE IN ANY GM MOTORS MODELS NOT JUST ME BUT OTHERS TOO . I WISH SOMEONE WOULD HELP ME AS MUCH I HELP OTHERS IN MY CAR N MY DAILY LIFE TO GET BY NOT MUCH TO ASK TO FEEL SAFE!  THE CAR WAS NOT SEALED RIGHT IN FIRST PLACE. THIS IS WHAT CAUSED MY PROBLEMS OWNING THIS CAR. I NEED EITHER HELP WITH CAR TO GET FIX PTHE RIGHT WAY. OR I NEED A NEW CAR I HAVE A DISABLED MOTHER AND GRANDPA THAT DEPEND ON ME AND I NEED A RELIABLE CAR TO PROVIDE DAILY TASKS APPOINTMENTS THE LIST GOES ON. I COULD REALLY USE A PIECE OF MIND JUST TO KNOW I'M DRIVING A SAFE RELIABLE CAR TO DO MY GOD SERVICES EVERY DAY I'M BEGGING!!",
        "vin": "1H3NL52F34C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/09/2018",
        "dateOfIncident": "11/09/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11150336,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 OLDSMOBILE ALERO. THE CONTACT STATED THAT THE VEHICLE WAS TAKEN TO AUTONATION CHEVROLET AMARILLO (2200 E I-40, AMARILLO, TX 79103) TO BE REPAIRED PER NHTSA CAMPAIGN NUMBER: 14V400000 (ELECTRICAL SYSTEM). THE CONTACT RECEIVED TWO NEW KEYS FROM THE DEALER, BUT THEY DID NOT START THE VEHICLE AND THE SECURITY INDICATOR FLASHED. THE VEHICLE WAS NOT TAKEN TO A DEALER OR INDEPENDENT MECHANIC FOR DIAGNOSTIC TESTING OR REPAIRS. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 133,000.",
        "vin": "1G3NL12E14C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/03/2018",
        "dateOfIncident": "10/24/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11145084,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "RECENTLY STARTED FINANCING A VEHICLE THROUGH CAR HOP. THEY HAD ME SIGN A FORM SAYING THAT THERE WAS A POSSIBILITY OF A RECALL ON THE VEHICLE, BUT DIDN'T SPECIFY WHAT. READING IT OVER NOW THE FORM STATES THEY WILL NOT BE RESPONSIBLE TO CORRECT THIS RECALL. RECALL NUMBER IS 14V400.",
        "vin": "1G3NK52F84C"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "08/14/2018",
        "dateOfIncident": "08/02/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11119848,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 OLDSMOBILE ALERO. WHILE DRIVING 30 MPH, ANOTHER VEHICLE CRASHED INTO THE REAR OF THE CONTACT'S VEHICLE. THE AIR BAGS DID NOT DEPLOY AND THE SEAT BELTS FAILED TO LOCK. THE CONTACT SUSTAINED A LEG INJURY AND A CONCUSSION, WHICH REQUIRED MEDICAL ATTENTION. A POLICE REPORT WAS FILED. THE VEHICLE WAS NOT TAKEN TO A DEALER TO BE DIAGNOSED OR REPAIRED.  THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 200,000.",
        "vin": "1G3NL52E54C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/25/2017",
        "dateOfIncident": "07/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10991614,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HAZARD LIGHT BUTTON FELL INTO THE DASHBOARD AND THE BLINKER SIGNALS ONLY INTERMITTENTLY WORK. THEY WILL SOMETIMES STOP WORKING WHILE IN THE MIDDLE OF A TURN, OTHER TIMES WILL WORK FOR A FEW DAYS, AND THEN RANDOMLY STOP AGAIN FOR NO CONSISTENT AMOUNT OF TIME. UPON RESEARCHING THIS ISSUE TO REPAIR I SEE THAT IT IS VERY COMMON WITH OTHER CARS OF THIS MAKE AND MODEL.",
        "vin": "1GN3NL52E84"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/17/2017",
        "dateOfIncident": "04/02/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10986256,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2004 ALERO OLDSMOBILE I PURCHASED THE CAR USED IN 2008. IT LATER ONLY HAD ONE RECALL WHICH WAS FOR THE IGNITION ISSUES. WHILE THE CAR IS ON AND IN DRIVE THE KEY IS STILL ABLE TO BE PULLED OUT OF THE IGNITION AND THE CAR STILL REMAINS ON AND IN DRIVE. I AM ALSO EXPERIENCING MY BLINKERS NOT WORKING 100% OF THE TIME, (NHTSA CAMPAIGN # FOR THIS ISSUE IS 03V327000). I CAN PRESS THE HAZARD LIGHT BUTTON QUICKLY AND FREQUENTLY WHILE PUSHING ON THE SIGNAL STICK AND THAT SOMETIMES WILL MAKE THEM WORK, OTHER TIMES THAT DOESN'T WORK AND NEITHER MY SIGNALS NOR HAZARD SIGNALS WORK AT ALL. LASTLY, AND MOST FRIGHTENING, IN THE MIDST OF DRIVING THE VEHICLE HAS STALLED, AND WILL JUMP AS THE RPM'S BOUNCE BACK AND FORTH, (NHTSA CAMPAIGN # FOR THIS ISSUE IS 07E021000). THERE HAD BEEN SEVERAL TIMES THIS HAS HAPPENED AND A FEW TIMES THE VEHICLE ACTUALLY DID SHUT OFF IN THE MIDDLE OF DRIVING, I'VE HAD TO PUSH THE CAR OFF THE ROAD, AND WAIT 10-15 MINUTES BEFORE I ATTEMPT TO START THE VEHICLE AGAIN. THE CAR WAS TESTED FOR OVER 3 HOURS AND THEY FOUND NOTHING WRONG WITH THE ENGINE OR BATTERY, WHICH IS WHY I AM CERTAIN IT IS THE FUEL PRESSURE RECALL. I TOOK THE CAR IN FOR THE KEY RECALL I BROUGHT THIS UP TO THEM AS WELL, (AS MY WINDOWS ALSO DO NOT WORK), I PURCHASED A NEW GAS CAP AS INSTRUCTED HOPING THAT WOULD FIX THIS DANGEROUS SITUATION WITH THE CAR STALLING OUT, IT DID NOT FIX THE ISSUE.  THERE ARE  RECALLS THAT MY CAR FALLS UNDER AND THAT I AM EXPERIENCING, I ASKED WHY THESE  LIFE THREATENING RECALLS WEREN'T ABLE TO BE FIXED ON MY CAR, I WAS TOLD THEY WEREN'T  LISTED ON MY VIN. PLEASE HELP MY VEHICLE AND THE MILLIONS OTHERS BE UPDATED WITH THE NHTSA TO REQUEST THE MANUFACTURER TO REVIEW THIS MORE CLOSELY IN RELATION TO THE ONES ACTUALLY AFFECTED BY THESE ISSUES. THESE ISSUES ARE EXTREMELY DANGEROUS AND POSE AS A THREAT NOT ONLY TO MYSELF AND FAMILY BUT TO OTHER DRIVERS AROUND ME.",
        "vin": "1G3NL52F34C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/02/2017",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10983078,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 OLDSMOBILE ALERO. THE CONTACT STATED THAT THE VEHICLE FAILED TO START WITHOUT WARNING. THE VEHICLE WAS TOWED TO AN INDEPENDENT DEALER WHERE IT WAS DIAGNOSED THAT THE IGNITION SWITCH NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 14V400000 (ELECTRICAL SYSTEM). THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 202,640.",
        "vin": "1G3NL12F14C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/02/2017",
        "dateOfIncident": "05/02/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10983123,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 OLDSMOBILE ALERO. AFTER DRIVING AND ARRIVING AT HER DESTINATION, THE CONTACT STATED THAT THE VEHICLE KEY CAME OUT OF THE IGNITION SWITCH ON ITS OWN. THE CONTACT STATED THAT THIS WAS AN EVERY DAY OCCURRENCE EVER SINCE THE VEHICLE WAS REPAIRED FOR AN IGNITION SWITCH RECALL ISSUED BY THE MANUFACTURER IN APRIL OF 2017. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND CASE NUMBER: 8-2930117201 WAS FILED. THE VEHICLE WAS NOT REPAIRED. THE NHTSA CAMPAIGN NUMBER WAS NOT PROVIDED. THE APPROXIMATE FAILURE MILEAGE WAS 150,000.",
        "vin": "1G3NL52FX4C"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/25/2017",
        "dateOfIncident": "04/12/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10980495,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "\"TAKATA RECALL\"  I WAS HAVING TROUBLE STARTTING MY CAR SO I WENT TO AUTO DEALERSHIP AND BOUGHT A KEY WHICH COST $38..  IT WORKED GREAT FOR MAYBE A MONTH.  THEN I TOOK MY CAR TO CAR WASH AND TURNED THE IGNATION SWITCH OFF AND GOT OUT OF CAR. WHEN I WAS READY TO GO, THE CAR WOULD NOT START.  HAD TO HIRE A WREAKER TO HAUL IT TO THE HOUSE.  THE CAR STILL WON'T START.",
        "vin": "1G3NL52E04C"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/06/2017",
        "dateOfIncident": "03/11/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10970841,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT CAR A YEAR AGO, IT HAD ISSUES WITH TURN SIGNALS NOT WORKING. I GOOGLED ISSUE AND REPLACED HAZARD SWITCH 125,000 MILES. NOW AT 155,000 TIMING CHAIN SLIPPED, IT'S REPLACEMENT WORTH MORE THAN CAR VALUE. I HEARD AFTER 2004 A CHANGE WAS MADE BECAUSE OF ISSUES BUT NO RECALL. CAR WAS PULLED TO END OF DRIVEWAY BEFORE TAKING A CLOSE OUT OF TOWN TRIP, TURNED OFF TO CHECK OIL AND SUCH, WOULDN'T START. ESTIMATE RECEIVED TO REPAIR 2,500$. I AM FURIOUS!",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/21/2017",
        "dateOfIncident": "03/20/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10967545,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MY TURNING SIGNALS WORK, BUT WHEN NOT IN USE THE SIGNAL NOISE DOES A RAPID BEEP, BEEP NOISE, EVEN WHEN I DRIVE AND SIT IDLY.",
        "vin": "1G3NL52F84C"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/14/2016",
        "dateOfIncident": "09/05/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10906277,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MY GRANDDAUGHER TO BE RAN INTO THE BACK OF ANOTHER CAN GOING ONLY ABOUT 25 MPH.  THE AIRBAGS CAME OUT BUT DID NOT DEFLATE.  THEY HAD A CUT IN THEM.  SHE DID NOT GET HURT BUT IF SHE HAD BEEN GOING FASTER OR IF I HAD BEEN DRIVING AND HAD A WRECK IT COULD HAVE CAUSED MAJOR DAMAGE.  SHE WAS ON A SIDE STREET",
        "vin": "1G3NL52F24C"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/28/2016",
        "dateOfIncident": "07/28/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10889390,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "FIRESTONE",
                "productModel": "FR710",
                "productYear": "9999",
                "size": "P215/60R16",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 OLDSMOBILE ALERO EQUIPPED WITH FIRESTONE FR710 TIRES, SIZE: P215/60R16. WHILE DRIVING 35 MPH, THE THREAD ON THE FRONT DRIVER SIDE TIRE SEPARATED AND CAUSED THE FRONT FENDER AND WHEEL WELL LINER TO PARTIALLY DETACH. IN ADDITION, THE DOOR TRIM AND REAR BRAKE LIGHT HOUSING FRACTURED. THE VEHICLE WAS TOWED TO THE CONTACT'S RESIDENCE AND WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VIN WAS UNKNOWN. THE TIRE FAILURE MILEAGE WAS UNAVAILABLE. THE VEHICLE FAILURE MILEAGE WAS 100,000.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/14/2016",
        "dateOfIncident": "06/14/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10884842,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 OLDSMOBILE ALERO. WHILE DRIVING 55 MPH, THE ENGINE STALLED WITHOUT WARNING. THE VEHICLE WAS REPAIRED PER NHTSA CAMPAIGN NUMBER: 14V400000 (ELECTRICAL SYSTEM). THE FAILURE RECURRED NUMEROUS TIMES. THE VEHICLE WAS ABLE TO RESTART AFTER SEVERAL ATTEMPTS. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 162,000.",
        "vin": "1G3NL52F74C"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/15/2016",
        "dateOfIncident": "06/17/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10874339,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 OLDSMOBILE ALERO. WHILE DRIVING VARIOUS SPEEDS, THE TURN SIGNALS FUNCTIONED INTERMITTENTLY. THE FAILURE RECURRED ON NUMEROUS OCCASIONS. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 125,000.   UPDATED 08/02/16*LJ",
        "vin": "1G3NF52E24C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/06/2016",
        "dateOfIncident": "05/02/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10863644,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 OLDSMOBILE ALERO. THE CONTACT STATED THAT THE ENGINE STALLED WITHOUT WARNING WHILE DRIVING 35 MPH. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC WHO PERFORMED DIAGNOSTIC TESTING, WHICH LOCATED A FAILURE CODE AT THE IGNITION SWITCH. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER STATED THAT NHTSA CAMPAIGN NUMBER: 14V400000 (ELECTRICAL SYSTEM) WOULD ONLY UPDATE THE KEYS; IT WOULD NOT REPLACE THE IGNITION SWITCH. THE FAILURE MILEAGE WAS 200,000.",
        "vin": "1G3NL52F34C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/25/2015",
        "dateOfIncident": "11/23/2015",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10806734,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 OLDSMOBILE ALERO. THE CONTACT STATED THAT WHILE ATTEMPTING TO START THE VEHICLE AND TURNING THE IGNITION SWITCH WITH THE KEY, THE IGNITION SWITCH CAUGHT ON FIRE. THE CONTACT STATED THAT THE VEHICLE WAS REPAIRED UNDER NHTSA CAMPAIGN NUMBER: 14V400000 (ELECTRICAL SYSTEM) BUT THE FAILURE RECURRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 90,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/15/2015",
        "dateOfIncident": "05/15/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10782393,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 OLDSMOBILE ALERO. WHILE DRIVING AT APPROXIMATELY 45 MPH, THE VEHICLE STALLED AND THE SECURITY AND AIR BAG WARNING LIGHTS ILLUMINATED. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS REPAIRED UNDER NHTSA CAMPAIGN NUMBER: 14V400000 (ELECTRICAL SYSTEM). THE TECHNICIAN STATED THAT THE POWER CONTROL MODULE ALSO NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 150,000.",
        "vin": "1G3NL52F24C"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/17/2015",
        "dateOfIncident": "03/06/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10764629,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 OLDSMOBILE ALERO. WHILE DRIVING AT APPROXIMATELY 60 MPH, THE VEHICLE STALLED. THE VEHICLE WAS NOT ABLE TO RESTART. THE VEHICLE WAS TOWED TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE MOTOR FAILED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 134,212.",
        "vin": "1G3NL12F74C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/14/2015",
        "dateOfIncident": "08/12/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10763614,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 OLDSMOBILE ALERO. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 14V400000 (ELECTRICAL SYSTEM); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "1G3NL52E04C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/07/2015",
        "dateOfIncident": "08/07/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10747098,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 OLDSMOBILE ALERO. THE CONTACT STATED THAT THE VEHICLE FAILED TO START DUE TO THE FAULTY PASS LOCK SYSTEM. THE CONTACT REPLACED THE PASS LOCK SYSTEM AND IGNITION SWITCH BUT THE FAILURE RECURRED AFTER THE REPAIR. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE THE FUEL PUMP, THE STARTER AND THE ALTERNATOR WERE REPLACED HOWEVER, THE FAILURE PERSISTED. THE VEHICLE WOULD ONLY START BY LOOSENING THE BATTERY AND THE IGNITION KEY TURNED INTO THE ON POSITION. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 196,000.",
        "vin": "1G3NL52E24C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/08/2015",
        "dateOfIncident": "02/20/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10702636,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 OLDSMOBILE ALERO.  CONSUMER WRITES IN REGARDS TO THE IGNITION SWITCH RECALL NOTICE ISSUES.  *SMD  THE CONSUMER STATED WHEN SHE TOOK THE VEHICLE TO THE DEALER ON NOVEMBER 19, 2014, SHE ASSUMED THE RECALL HAD PERFORMED. HOWEVER, ON FEBRUARY 20, 2015, SHE WAS UNABLE TO REMOVE THE KEY FROM THE IGNITION. WHEN SHE CONTACTED THE DEALER, SHE WAS INFORMED THE RECALL HAD NOT BEEN PERFORMED AND THE CURRENT PROBLEM WAS WITH THE KEY AND WOULD NOT BE COVERED BY THE INITIAL RECALL. *JB",
        "vin": "1G3NL52F24C"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/19/2015",
        "dateOfIncident": "02/06/2015",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10684255,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "[XXX]: AFTER A DAY OF LIGHT DRIVING AFTER BEING STATIONARY FOR ABOUT AN HOUR AND A HALF IN COLORADO SPRINGS CO (COOL WEATHER) UPON STARTING THE VEHICLE THE TEMP NEEDLE WENT FROM COOL TO ALMOST OVERHEATED IN THE UNDER 30 MINS IT TOOK TO GO FROM ONE STORE PARKING LOT TO THE NEXT NEARBY ONE. THE VEHICLE BECAME FULLY OVERHEATED & SPARKS / 1' FLAMES EMERGED FROM THE SIDES OF THE FRONT HOOD. UPON BEING SHUT OFF THE FLAMES RECEDED, AFTER APPROX 30MINS SITTING THE HOOD WAS LIFTED & FLUIDS CHECKED (ALL WERE AT APPROPRIATE LEVELS). THE VEHICLE WAS STARTED AGAIN & RAN IDLE FOR 20 MINS & THE SPARKS / FLAMES REAPPEARED AGAIN SO THE VEHICLE WAS SHUT DOWN & A RIDE CALLED. UPON BEING PICKED UP THE NEXT DAY THE VEHICLE RAN FINE AGAIN FOR THE MOST PART WITH ONLY SLIGHT OVERHEATING - IT WAS TAKEN FOR AN ENGINE WASH / UNDER HOOD AT AN APPROPRIATE FACILITY TO REMOVE ANY FLAMMABLE / COMBUSTIBLE RESIDUE. HAD TO BE DRIVEN AT SPEEDS UNDER 50MPH TO RETURN HOME WITHOUT FURTHER PROBLEMS.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "1G3NL52E74C"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/14/2014",
        "dateOfIncident": "10/05/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10664129,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING ON IN TOLL ROAD WHEN MY HEADLIGHTS WENT OFF.  I WAS ABLE TO GET THEM BACK ON BY GOING TO MANUAL.  THEY ALSO FLICKERED ON & OFF EVEN WITH CAR OFF AND KEY OUT OF IGNITION.   HAD RECALL ON IGNITION, RECALL 143510, ADVISED GM AND DEALER OF PROBLEM.  THEY SAID WASN'T COVERED BY RECALL. STILL A RECURRING PROBLEM.  *TR",
        "vin": "1G3NL52E24C"
    },
    {
        "components": "EXTERIOR LIGHTING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/02/2014",
        "dateOfIncident": "12/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10654351,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 OLDSMOBILE ALERO.  HAZARD LIGHT BUTTON IS PUSHED BACK WHERE HE WAS UNABLE TO ACTIVE MY HAZARD LIGHTS IF NEEDED.  ALSO, THERE WERE SOME UNIDENTIFIED LIGHTS STUCK ON THE DASHBOARD.  *MW",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/20/2014",
        "dateOfIncident": "11/23/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10659625,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 OLDSMOBILE ALERO. THE CONTACT STATED THAT THE VEHICLE FAILED TO START AFTER INSERTING THE KEY IN THE IGNITION SWITCH. THE PROBLEM RECURRED NUMEROUS TIMES. THE VEHICLE WAS TAKEN TO A DEALER. THE TECHNICIAN DIAGNOSED THAT THE IGNITION SWITCH, LOCK AND KEY NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 160,000.",
        "vin": "1G3NL52F64C"
    },
    {
        "components": "ELECTRICAL SYSTEM,TRACTION CONTROL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/13/2014",
        "dateOfIncident": "11/03/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10652265,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 OLDSMOBILE ALERO, CONSUMER WRITES IN REGARDS TO WARNING LIGHT COMING ON AND THEN GOING OFF. *CW  THE CONSUMER STATED THE OIL AND TRACTION LIGHT ILLUMINATED. *JB",
        "vin": "1G3NL52E64C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/13/2014",
        "dateOfIncident": "07/10/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10654801,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "IGNITION SWITCH ISSUE. TOOK VEHICLE IN FOR RECALL. ALL THEY DID WAS STICK PLASTIC ON KEYS. WHAT ARE WE SUPPOSE TO DO SINCE THE IGNITION SWITCH IS STILL FALLING OUT OF PLACE? ALSO, WHY DIDN'T THEY REPLACE THE IGNITION MODULE SINCE IT IS A KNOWN DEFECT? THE SWITCH IS THE PROBLEM ON THE VEHICLE. NOT THE KEYS!!!  *TR",
        "vin": "1G3NL52F34C"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/11/2014",
        "dateOfIncident": "09/01/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10654218,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BLINKERS ONLY WORK 5 % OF THE TIME. I HAVE ALMOST BEEN HIT IN THE REAR SEVERAL TIMES DUE TO THIS ISSUE. NEITHER BLINKER WILL WORK. I NOTICE A RECALL WAS DONE ON THE 2001 OLDS ALERO FOR THIS PROBLEM. I HAVE A 2004 OLDS ALERO THAT IS HAVING THE SAME ISSUE. THE BLINKERS DO NOT WORK DUE TO A DEFECTIVE HAZARD WARNING LIGHT SWITCH. A RECALL SHOULD BE DONE ON 2004 OLDS ALERO.  *TR",
        "vin": "1G3NL52F34C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/05/2014",
        "dateOfIncident": "09/16/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10652649,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 OLDSMOBILE ALERO. THE CONTACT STATED THAT THE IGNITION FAILED, PREVENTING THE VEHICLE FROM BEING STARTED WITHOUT WARNING. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE CONTACT RECEIVED A NOTIFICATION FOR RECALL NHTSA CAMPAIGN NUMBER: 14V400000 (ELECTRICAL SYSTEM). HOWEVER, THE PART NEEDED TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 80,000.",
        "vin": "1G3NL12F94C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/03/2014",
        "dateOfIncident": "11/03/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10652129,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 OLDSMOBILE ALERO.  THE CONTACT STATED THAT WHILE DRIVING AT APPROXIMATELY 45 MPH AND GOING OVER A BUMP, THE DRIVER AND PASSENGER SIDE AIR BAG WARNING LIGHTS ILLUMINATED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 189,283.",
        "vin": "1G3NL12F74C"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/30/2014",
        "dateOfIncident": "10/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10651503,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE FREEWAY AND MY CAR TURNED OFF WITHOUT WARNING. MY CAR TURNED OFF (POWER SHEERING LOCKED UP) I MADE IT TO THE SIDE OF THE ROAD BUT NOT BEFORE ALMOST GETTING HIT BY A 2 DIFFERENT SEMI-TRUCKS. I WAS STRANDED ON THE FREEWAY FOR 4 HOURS WITH A NEW BORN BABY. I HAVE YET TO BE ABLE TO FIX MY CAR DUE TO THIS ISSUE. I HAVE BEEN LOOKING FOR INFORMATION ON WHAT HAPPENED TO MY CAR WHEN I FOUND THE RECALL.   *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "10/28/2014",
        "dateOfIncident": "12/13/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10650870,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING DOWN A STREET A CAR RAN A STOP SIGN CAUSING A T-BONE COLLISION. MY AIRBAGS NEVER DEPLOYED BECAUSE OF MY AIRBAGS NOT DEPLOYING I HIT MY HEAD ON THE FRONT WINDOW PANE. IF THE AIRBAG HAD DEPLOYED I WOULD HAVE NEVER HIT THE FRONT WINDOW CAUSING MY TWO HEAD CONTUSIONS, SPRAINED NECK, AND HERNIATED DISCS.  *TR",
        "vin": "1G3NL52E44C"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/24/2014",
        "dateOfIncident": "09/16/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10649586,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 OLDSMOBILE ALERO. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 40 MPH, THE STEERING WHEEL BECAME DIFFICULT TO TURN AS ALL THE WARNING LIGHTS ILLUMINATED. THE VEHICLE WAS TAKEN TO THE DEALER. THE TECHNICIAN DIAGNOSED THAT THE STEERING WHEEL NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED BUT THE FAILURE RECURRED. IN ADDITION, THE CONTACT RECEIVED A NOTIFICATION FOR RECALL NHTSA CAMPAIGN NUMBER: 14V400000 (ELECTRICAL SYSTEM). HOWEVER, THE PART NEEDED TO DO THE RECALL WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 85,000.",
        "vin": "1G3NL12E74C"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/17/2014",
        "dateOfIncident": "10/14/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10648450,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TURN SIGNALS RANDOMLY STOP FUNCTIONING.  THEY CAN GO FROM WORKING TO NOT WORKING AND BACK IN ANY GIVEN DRIVE.  I HAVE REPLACED THE FUSES MULTIPLE TIMES, BUT IT QUICKLY STARTS DOING IT AGAIN.  *TR",
        "vin": "1G3NL52F64C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/14/2014",
        "dateOfIncident": "10/14/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10644681,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 OLDSMOBILE ALERO. THE CONTACT RECEIVED A NOTIFICATION FOR RECALL NHTSA CAMPAIGN NUMBER: 14V400000 (ELECTRICAL SYSTEM). HOWEVER, THE PART NEEDED TO DO THE REPAIRS WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT AWARE OF THE ISSUE. THE VIN WAS UNAVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": ""
    },
    {
        "components": "STEERING,AIR BAGS,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "10/03/2014",
        "dateOfIncident": "07/19/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10641159,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SON WAS DRIVING DOWN A ROAD WHEN THE ENGINE STOPPED RUNNING.  HE HAD NO BRAKES OR POWER STEERING CAUSING HIM TO LEAVE THE ROADWAY AND CRASH INTO A FENCE. THE CRASH DIDN'T DEPLOY THE AIRBAG, BUT CAUSED SEVER DAMAGE TO THE CAR, RESULTING IN IT BEING TOTALED.  IT WAS TOWED TO A JUNK YARD WHERE IT WAS SOLD AS SCRAP.    FORTUNATELY MY SON WAS ONLY SLIGHTLY INJURED, AND DID NOT REQUIRE MEDICAL ATTENTION.     I CONTACTED GM AFTER RECEIVING THEIR RECALL NOTICE IN SEPTEMBER, 2014.  I SPOKE WITH A REPRESENTATIVE THERE ASKING JUST FOR THE REPLACEMENT COST OF THE CAR SINCE THE RECALL NOTICE  DESCRIBED EXACTLY WHAT HAPPENED WHEN THE CAR CRASHED. THE REPRESENTATIVE DECLINED THE CLAIM STATING THEY COULD NOT INSPECT THE CAR.  THE CLAIM # IS [XXX].       I FEEL THIS IS UNFAIR AS AT THE TIME OF THE CRASH WE WERE NOT AWARE OF THIS RECALL NOTICE AND FELT NO OBLIGATION AT THE TIME TO REPORT IT TO GM.   I ALSO HAVE A COPY OF THE POLICE REPORT, AND CAN FORWARD THAT TO YOU IF NEEDED.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "1G3NL12E34C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/01/2014",
        "dateOfIncident": "05/13/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10640436,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 OLDSMOBILE ALERO. WHILE ATTEMPTING TO START THE VEHICLE, THE CONTACT HAD TO WIGGLE THE KEY, WHICH CAUSED THE SECURITY CHIME TO ACTIVATE. THE FAILURE OCCURRED MULTIPLE TIMES. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 14V400000 (ELECTRICAL SYSTEM). THE MANUFACTURER WAS NOT NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 35,000.",
        "vin": "1G3NL52F84C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/21/2014",
        "dateOfIncident": "09/21/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10637887,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED THE NOTIFICATION ABOUT THE SAFETY RECALL ON 2004 OLDSMOBILE ALEROS, AND THE DEALER, AFTER I HAD SCHEDULED AN APPOINTMENT, TOLD ME THEY DIDN'T HAVE TO DO THE RECALL, BUT I JUST HAD TO BUY ANOTHER KEY.  THAT'S NOT THE WAY I UNDERSTAND RECALLS.  I DON'T BUY SOMETHING, BUT IT SHOULD BE THEY FIX SOMETHING.  I'VE NEVER HEARD OF A DEALER ARGUING WITH THE CUSTOMER ABOUT SOMETHING LIKE THIS EITHER, BUT I'M GOING TO SEEK LEGAL ADVICE.  HOWEVER, I FELT IT WAS NECESSARY TO CONTACT YOU FIRST, BASED ON THE LANGUAGE OF THE RECALL NOTICE.  *TR",
        "vin": "1G3NL52E34C"
    },
    {
        "components": "EXTERIOR LIGHTING,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "09/20/2014",
        "dateOfIncident": "06/02/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10637775,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TURN SIGNALS ON MY 2004 ALERO GOES IN AND OUT ALL OF THE TIME. THE HAZARDS WILL WORK BUT NO TURN SIGNALS. IT IS VERY HAZARDOUS BECAUSE PEOPLE CAN'T SEE THAT I'M TURNING OR CHANGING LANES. I ALSO GOT PULLED OVER FOR NOT USING MY BLINKER BECAUSE IT WOULDN'T WORK. ALSO MY HORN HASN'T WORKED FOR A LONG TIME. THAT IS ALSO A SAFETY HAZARD.   *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/16/2014",
        "dateOfIncident": "06/01/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10633512,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "JUNE 2010(IRVING, TX)  - THE GEAR SHAFT BUTTON POPPED OUT WHICH MADE SHIFTING FROM PARK TO REVERSE OR DRIVE ALMOST IMPOSSIBLE WITHOUT STICKING SOMETHING HARD INSIDE, LIKE A PEN . VEHICLE WOULD BECOME DIFFICULT TO START, TYPICALLY AFTER THIRD TRY IT WOULD START. . THE VEHICLE WAS NOT TAKEN TO A DEALER OR AN INDEPENDENT MECHANIC FOR DIAGNOSIS OR REPAIRED AS I COULD NOT AFFORD IT AT THE TIME, . I WAS INVOLVED IN AN ACCIDENT, IN WHICH MY ALERO WAS TOTALED AFTER FAILING TO STOP BECAUSE POWER STEERING AND BRAKES LOCKED, THE AIRBAGS NEVER DEPLOYED. THE APPROXIMATE MILEAGE WAS 165,340 AT THE TIME OF FAILURE  *TR",
        "vin": "1G3NL52F82C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/10/2014",
        "dateOfIncident": "07/21/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10632121,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 OLDSMOBILE ALERO. THE CONTACT STATED THAT THE VEHICLE FAILED TO START. THE DEALER REPLACED THE IGNITION SWITCH. THE VIN WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 14V40000 (ELECTRICAL SYSTEM). THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 20,000.   UPDATED 10/24/2014*LJ      UPDATED 4/21/2015 *JS",
        "vin": "1G3NF52E34C"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/08/2014",
        "dateOfIncident": "08/20/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10631662,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 OLDSMOBILE ALERO. WHILE DRIVING APPROXIMATELY 35 MPH, THE ENGINE STALLED WITHOUT WARNING AND THE POWER STEERING AND BRAKES FAILED. THE VEHICLE RESTARTED AFTER MULTIPLE ATTEMPTS, BUT THE FAILURE RECURRED MULTIPLE TIMES. THE DEALER STATED THAT THE FAILURE COULD BE DUE TO A FAULTY IGNITION SWITCH AND/OR VARIOUS ENGINE FAILURES. THE VEHICLE WAS NOT REPAIRED. THE CONTACT RECEIVED NHTSA CAMPAIGN NUMBER: 14V40000 (ELECTRICAL SYSTEM) AND PERFORMED THE RECOMMENDATIONS FROM THE NOTIFICATION, INCLUDING DRIVING WITH A SINGLE KEY. THE FAILURE RECURRED NUMEROUS TIMES. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 35,570.",
        "vin": "1G3NL52E84C"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/04/2014",
        "dateOfIncident": "09/12/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10630568,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE  CAR  WILL   NOT  START  AFTER   WARMED UP   . AND  WHEN  SITTING  AFTER  STARTED IT   ACTS LIKE  IT WANTS  TO  DIE  .    *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/27/2014",
        "dateOfIncident": "07/15/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10628852,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "KEY WILL NOT TURN TO TURN THE CAR ON.  AFTER MANY MULTIPLE TIMES TURNING THE KEY IT MAY ENGAGE AND START MY CAR.  THE PROBLEM WITH TRYING TO START THE CAR IS CONTINUING TO GET WORSE. IT NOW TAKES SEVERAL MINUTES OF TRYING TO GET IT TO START.   THERE HAS BEEN A RECALL BUT HAS NOT BEEN SENT OUT YET.  THE DEALER CAN'T FIX IT BECAUSE THEY HAVE NOT BEEN NOTIFIED AND HAVE NO PARTS.   I AM STRANDED.  COST TO FIX IT ON MY OWN, EVEN THOUGH THE PART HAS HAD MULTIPLE COMPLAINTS AND IS APPARENTLY DEFECTIVE WILL BE OVER $300.  THAT'S RIDICULOUS.  GET THE RECALL SENT OUT SO WE CAN CONTINUE TO DRIVE SAFELY OR IN MY CASE DRIVE.  *TR",
        "vin": "1G3NL52E940"
    },
    {
        "components": "ELECTRICAL SYSTEM,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "08/13/2014",
        "dateOfIncident": "06/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10621969,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "INTERCONTINENTAL AUTO PARTS",
                "productMake": "IGINITION & FUEL SYSTEMS",
                "productModel": "GF 978",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "2004 OLDSMOBILE ALERO IGNITION SWITCH WON'T START SOMETIMES ONHAD THE IGNITION SWITCH REPLACED AND STILL HAVING THE PROBLEM SOME TIMES IF YOU KEEP TURNING THE KEY ON AND OFF IT WILL START OR YOU WILL HAVE TO GO UNDER THE HOOD AND CRANK IT BY THE STARTER.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/29/2014",
        "dateOfIncident": "01/14/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10617161,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 OLDSMOBILE ALERO. WHILE DRIVING 35 MPH, THE VEHICLE STALLED WITHOUT WARNING. THE CONTACT WAS ABLE TO RESTART THE VEHICLE, BUT THE FAILURE RECURRED MULTIPLE TIMES. AN INDEPENDENT MECHANIC WAS UNABLE TO DUPLICATE THE FAILURE. THE MANUFACTURER WAS NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 80,000.",
        "vin": "1G3NL52F64C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/24/2014",
        "dateOfIncident": "07/22/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10615981,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 OLDSMOBILE ALERO. THE CONTACT STATED THAT THE VEHICLE FAILED TO START OR WOULD STALL IMMEDIATELY AFTER BEING STARTED. THE VEHICLE WAS TAKEN TO A MECHANIC FOR DIAGNOSIS AND THE DEALER STATED THAT THE SENSOR IN THE IGNITION SWITCH FAILED AND NEEDED REPLACING. THE MILEAGE AT THE TIME OF FAILURE WAS 102,000.",
        "vin": "1G3NK52F74C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/19/2014",
        "dateOfIncident": "04/03/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10614766,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR IS DIFFICULT TO START. THE IGNITION KEY MUST ALWAYS BE JIGGLED SEVERAL TIMES TO GET THE IGNITION SWITCH TO TURN ON THE ENGINE.  *TR",
        "vin": "1G3NL12EX4C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/14/2014",
        "dateOfIncident": "07/14/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10610460,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR IS DIFFICULT TO START.  THE IGNITION KEY MUST ALWAYS BE JIGGLED SEVERAL TIMES TO GET THE IGNITION SWITCH TO TURN ON THE ENGINE.  THE PROBLEM STARTED BACK IN 2008 AND CONTINUES TO GET WORSE.  EVENTUALLY I WILL BE UNABLE TO START THE ENGINE.  I HAD A SIMILAR PROBLEM WITH MY 1992 OLDS EXCEPT THE ENGINE FINALLY WOULD NOT TURN-OFF.  I HAD TO DROP IT OFF AT A LOCAL AUTO REPAIR SHOP RUNNING, AND THEY REPLACED THE IGNITION SWITCH FOR $150.  *TR",
        "vin": "1G3NK52F94C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/11/2014",
        "dateOfIncident": "12/18/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10579131,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WANT OFF ON A COLD NIGHT AND WOULD NOT STOP. PULLED THE RELAY WHEN IT GOT WARM PUT IT BACK IN. WORKED FOR A FEW DAY IT MY HORN AND IT GOT STUCK AGAIN.   *JS",
        "vin": "1G3NL52E84C"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/10/2014",
        "dateOfIncident": "05/10/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10578880,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "FAILURE HAPPEN AGAIN. THE VEHICLE AS TAKEN TO THE DEALER. THE DEALER REPLACE. THE CAM SENSOR AND CRANK SENSOR MODULATOR. THE VEHICLE WAS REPAIRED HOWEVER THE FAILURE HAPPEN AGAIN. THE DEALER THEN STATED THAT COULD NOT DUPLICATE THE FAILURE AGAIN. THE VEHICLE WAS NOT REPAIRED. THE FAILURE PERSISTED. THE FAILURE WAS TAKEN TO THE DEALER. THE DEALER STATED THE FUEL PUMP WOULD NEED TO BE REPLACED. THE VEHICLE WAS REPAIRED BUT THE FAILURE REOCURED SHORTLY AFTER. THE DEALER FUEL PUMP WOULD NEED TO BE REPAIRED AGAIN. THE VEHICLE WAS TAKEN TO ANOTHER DEALER. THE DEALER THEN STATED THE FAILURE WAS CAUSED BECAUSE OF A DEFECTIVE IGNITION SWITCH. THE VEHICLE WAS REPAIRED. THE FAILURE DID NOT REOCURED .  THE FAILURE MILEAGE WAS 107,650. AZ",
        "vin": "1G3NL52F84C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/19/2014",
        "dateOfIncident": "03/19/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10573560,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 OLDSMOBILE ALERO. THE CONTACT STATED THAT THE AIR BAG HOUSING FAILED, EXPOSING THE AIR BAG. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THE FAILURE WAS CONFIRMED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT CONTACTED ABOUT THE FAILURE. THE FAILURE MILEAGE AND VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/26/2014",
        "dateOfIncident": "01/08/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10566013,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL-    THE CONTACT OWNS A 2004 OLDSMOBILE ALERO. THE CONTACT STATED WHILE DRIVING APPROXIMATELY 15 MPH THE ENGINE STALLED WITHOUT WARNING. THE VEHICLE RESTARTED AND RESUMED NORMALLY. THE FAILURE RECURRED TWICE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE THE BATTERY WAS REPLACED; HOWEVER, THE FAILURE PERSISTED. THE VEHICLE WAS TAKEN BACK TO THE MECHANIC WHO WAS UNABLE TO LOCATE A PROBLEM. THE MANUFACTURER WAS NOTIFIED OF THE DEFECT. THE APPROXIMATE FAILURE MILEAGE WAS 102,000.   RK   UPDATED 4/22/14*CN      THE CONSUMER STATED THE VEHICLE EXPERIENCED A LOSS OF STEERING AND WOULD NOT CONTINUE TO RUN. THE DEALER ADVISED THE IGNITION WAS THE CAUSE OF THE FAILURE.   UPDATED 04/24/2014   *JS",
        "vin": "1G3NL12F24C"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/24/2014",
        "dateOfIncident": "01/01/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10565585,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 OLDSMOBILE ALERO. THE CONTACT STATED THAT WHILE DRIVING 45 MPH WITH THE CRUISE CONTROL ACTIVATED, THE FUNCTION WOULD NOT DEACTIVATE. THE CONTACT WAS ABLE TO STOP THE VEHICLE BY APPLYING EXCESSIVE FORCE TO THE BRAKE PEDAL AND SHIFTING INTO NEUTRAL. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 56,000.",
        "vin": "1G3NK52F24C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/31/2013",
        "dateOfIncident": "12/31/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10557945,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE HAS BEEN EXPERIENCING GENERAL MOTORS PASSLOCK ISSUES SINCE IT HAD 60000 MILES ON IT. I CAN NO LONGER TRUST IT TO START, AND HAVE TO LEAVE IT RUN WHEN I HAVE TO BE SOMEWHERE ON TIME.  *TR",
        "vin": "1G3NK52F34C"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/27/2013",
        "dateOfIncident": "12/09/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10557454,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 OLDSMOBILE ALERO. THE CONTACT STATED THAT INTERMITTENTLY, THE TURN SIGNALS WOULD INDEPENDENTLY ACTIVATE AND THE HAZARD LIGHTS BECAME OPERABLE. THE VEHICLE WAS NOT TAKEN TO A DEALER OR AN INDEPENDENT MECHANIC FOR DIAGNOSIS OR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE PROBLEM. THE APPROXIMATE FAILURE MILEAGE WAS 130,000.",
        "vin": "1G3NL12E64C"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/27/2013",
        "dateOfIncident": "05/18/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10553995,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS AN AMENDMENT TO THE COMPLAINT FILED ON 11-22-13,ODI# 10553362,ABOUT THE FUEL PRESSURE REGULATOR,THEY WANT TO REPLACE...IT WAS REPLACED ALREADY ON DEC.30,2009.I AM MAKING A LIST OF ALL OF THE WORK I HAVE DONE ON THIS CAR STARTING FROM THE MILEAGE OF 7635,MAY,18,2005.IT WAS ONLY 5 MONTHS OLD,AND THEY HAD TO REPLACE THE GASKET PAN ON THE TRANSMISSION FOR LEAKING.OCT.6,2006,TRANSMISSION WAS LEAKING AGAIN,AND THE COOLER LINE SEAL WAS REPLACED.NOV.1,2006,THE GENERATOR AND ALTERNATOR WAS REPLACED.MILEAGE WAS26,419.JUNE 13,2007,TRANSMISSION LEAKING AGAIN.JAN.5,2009,POWER STEERING LEAK REPLACED GEARTIE RODS AND SEALS,ENGINE LIGHT COMES ON.DEC.4,2009 MILEAGE WAS 70,687.,WATER PUMP WENT OUT AND REPLACED.  FEB5,2010,DON'T KNOW WHAT THIS MEANS,BUT 800 FRONYEND LF SENSOR FRACTION LIGHT HUB KIT-CPC,MILEAGE WAS71,822.  I WAS DRIVING DOWN I-45 GOING TO WORK AT 60 MPH,AND I SAW SOMETHING BLACK FLY OFF OF MY CAR,IT WAS THE BLACK WINDOW STRIPPING THAT HOLDS THE WINDSHIELD ON!!!!!!!! THEN THE COVER ON THE PASSENGER SIDE AIRBAG STARTED TO CURL OFF OF THE BAG.I TOOK IT TO CREST CADILLAC AND THEY TOLD ME IF WOULD COST ABOUT $1,000 TO FIX IT.THESE BOTH WERE MANUFACTURERS DEFAULT OF SLOPPY WORKMANSHIP.CASE #71-986879285..I CONTACTED GM ON 9-13-11,AND ON 9-21-13,A SANDEE EMAILED ME,THEY DID FIX THEM AT NO COST TO ME.BUT STILL IT WAS WORRYING IF THE WINDOW WAS GOING TO FLY OFF ON THE FREEWAY AND KILL SOMEONE WHO WOULD HAVE BEEN RESPONSIBLE?  105-12REPLACED FUEL PUMP MILEAGE 95562.  I TOOK IT TO GET INSPECTION AND IT WON'T PASS INSP NOW AND THEY WANT OVER 2,000 TO FIX ALL OF THE THINGS THEY ALREADY FIXED.  MOTORTREND.COM.RECALLS ON THEM.   TANK ASSEMBLY  PRESSURE RELIEF DEVICES  I HAVE SMELLED GAS IN MY CAR SINCE TO THIS MORNING.I WAS WARNED BY THE PLANO,TX.POLICE TO GET INSPEC STICKER HOW DO I DO THAT?  *TR",
        "vin": "1G3NF52E64C"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/22/2013",
        "dateOfIncident": "11/21/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10553362,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT IT IN DEC.2004,THE LAST 2-ONE BLACK AND ONE WHITE,I TOOK THE BLACK SITTING ON THE LOT OF FREEMAN OLDS, IRVING TX. I STARTED HAVING TROUBLE IN2006 I HAVE ALL OF MY PAPERWORK. BRAKES WENT OUT, POWERTRAIN WENT OUT. THEN I STARTED SMELLING GAS IN THEMORNING WHEN I CRANKED IT. AND STILL DO TO THIS MORNING,IT IS AWFUL. LAST YEAR IT DIED RIGHT IN THE MIDDLE OF THE ROAD. WOULD NOT START,I EVEN HAD THE PLANO TX. POLICE TRY TO BOOT IT FOR ME. BATTERY I THOUGHT. HUFFINES HAD IT TOWED IN AND IT STARTED RIGHT UP FOR THEM,BUT IT WAS MY FAULT THEY COULD NOT REPRODUCE IT. SO THEY GAVE IT BACK,I GO TO THE BANK, MILES FROM HOME AND IT DOES IT AGAIN.THEY TOW IT BACK AND AGAIN THE SAME THING.I GO AGAIN AT MY HOUSE AND THE SAME THING,THIS IS BS AT THIS POINT CONTACT GM FOR THE LOUSINESS OF THIS CAR, [XXX] WAS THE FIRST, ANGEL, AND NOW LASHAWNDA.THEY TELL ME THE FUEL PUMP,OK,THEY REPLACED IT, I HAD TO CASH IN MY GRANDCHILDRENS LIFE INS TO PAY FOR IT,AND AM STILL PAYING BACK THE LOAN A YEAR LATER. I AM ON DISABILITY,AND DON'T HAVE ANY MONEY. SO I TAKE IT IN FOR INSPECTION,HE COMES OUT WITH A LIST OF ABOUT $800.00 WORTH OF STUFF TO FIX BEFORE IT WILL PASS. [XXX] SAID THEY WOULD WAIVE THE DIAG FEE, I TOOK IT YESTERDAY, HE GAVE ME ANOTHER$1,000 WORTH OF STUFF TO FIX:FUEL PRESSURE REGULATOR,LEAKING GAS,EGR VALVE,THERMOSTAT AND COOL FLUSH.NOT INCLUDING THE 800,$2,000,TO GET IT ALL DONE. I HAVE COPIES OF THE RECALLS ON IT. SEVERAL TRANSMISSION LEAKS WITH IN MONTHS OF BUYING IT. AFTER THE FUEL PUMP THAT WASN'T EVEN THE PROBLEM,ALL IT WAS ,THE RELAY SWITCH. THEY DID NOT EVEN TRY THAT. I ASKED THEM TO EITHER FIX THIS PROBLEM AND CALL IT EVEN,OR GIVE ME BACK MY MONEY.SHE SAID NO THEY FIXED THAT OTHER PROBLEM FOR NOTHING SO BE GRATEFUL IS WHAT SHE MEANT. AFTER PAYING $24,000 FOR NOTHING??? THE ORIG PRICE 24,000 BUT WITH SOME DIS IT WAS 14,000? BUT WITH INTEREST IT WAS 24,NEVER CONTACTED ME. [XXX] STOPPED DOING ANY GM.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "1G3NF52E64C"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/30/2013",
        "dateOfIncident": "05/12/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10546125,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "BLINKER INTERMITTENTLY STOPS WORKING. I WILL GO TO SIGNAL A LANE CHANGE AND THE BLINKER WILL NOT WORK. THEN RANDOMLY IT WILL START WORKING AGAIN. THIS IS A SAFETY HAZARD BECAUSE I AM UNABLE TO SIGNAL MY LANE CHANGE AND IT CAUSES ME TO BREAK THE LAW.  *TR",
        "vin": "1G3NL52EX4C"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/01/2012",
        "dateOfIncident": "04/01/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10473283,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE TURN SIGNALS WORK INTERMITTENTLY. THE HAZARD LIGHTS, AND TURN SIGNALS WILL STOP FUNCTIONING GOING DOWN THE ROAD, AND WILL RANDOMLY START FUNCTIONING AGAIN. OFTEN IN THE MIDDLE OF TRAFFIC I WILL BE UNABLE TO SIGNAL BECAUSE THEY HAVE STOPPED FUNCTIONING. I FEEL THAT THIS IS VERY DANGEROUS, AS WELL AS CAUSES THE VEHICLE'S OPERATOR TO INADVERTENTLY BREAK TRAFFIC LAWS. I BELIEVE THIS EXACT PROBLEM WAS RECALLED IN THE SAME MAKE, AND MODEL, BUT AN EARLIER YEAR. I THINK THAT THE RECALL SHOULD BE EXPANDED TO COVER LATER MODEL YEARS, BECAUSE THE ISSUE CONTINUED INTO THE LATER MODEL YEARS. A SIMPLE INTERNET SEARCH WILL SHOW THAT THIS IS A MAJOR PROBLEM WITH THIS VEHICLE, AND MANY OWNERS OF THIS MAKE AND MODEL HAVE EXPERIENCED IT.   *TR",
        "vin": "1G3NL52F14C"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/30/2012",
        "dateOfIncident": "08/29/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10473027,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 OLDSMOBILE ALERO. THE CONTACT STATED THAT WHILE DOING RESEARCH ONLINE, SHE NOTICED SEVERAL COMPLAINTS ON THE VEHICLE STALLING. THE CONTACT WANTED TO MAKE THE PROBLEM KNOWN AND STATED THAT A RECALL SHOULD BE FILED. THE FAILURE HAS NOT OCCURRED IN HER VEHICLE BUT SHE WAS JUST BEING ALERT.",
        "vin": "1G3NL52FX4C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/02/2012",
        "dateOfIncident": "06/29/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10463934,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "HORN STARTED GOING OFF AND WON'T STOP. THIS IS DEFINITELY A SAFETY ISSUE AND THERE ARE MANY REPORTS ONLINE AND IT SHOULD BE RECALLED.    *JS",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/15/2012",
        "dateOfIncident": "05/09/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10458517,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 OLDSMOBILE ALERO. THE CONTACT STATED THE SECURITY LIGHT ILLUMINATED ON THE INSTRUMENT PANEL AND CAUSED THE VEHICLE TO LOSE POWER. HE HAD TO TURN THE VEHICLE OFF AND WAIT 10 MINUTES FOR THE COMPUTER TO RESET IN ORDER FOR THE VEHICLE TO FUNCTION NORMALLY. THE VEHICLE WAS NOT TAKEN TO THE DEALER FOR DIAGNOSTIC TESTING. THE CURRENT MILEAGE WAS 81,000.    UPDATED 07/06/12 *BF  THE KEY AND SWITCH LOCK CYLINDER WERE REPROGRAMMED. UPDATED 07/12/12",
        "vin": "1G3NL52F04C"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/26/2011",
        "dateOfIncident": "10/04/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10432918,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WHEEL HUB ASSEMBLY HAS GONE BAD IN THIS 2004 ALERO. WE HAD HIT A DEER WITH OUR 2002 ALERO AND TWO WEEKS BEFORE WE HIT THAT DEER THAT CAR'S WHEEL HUB WENT BAD. *TT",
        "vin": "1G3NF52E54C"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/05/2011",
        "dateOfIncident": "01/02/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10428830,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SIGNAL DOES NOT WORK ALL THE TIME AND IF SOMEONE IS BACKING UP AND THEY CAN'T SEE YOU THE HONK DOES NOT WORK. PEOPLE DO NOT KNOW THAT YOU ARE TRYING TO TURN BACK TURNING SIGNAL IS NOT WORK AT ALL TIMES. *TR",
        "vin": "IG3NL12F3F3"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/01/2011",
        "dateOfIncident": "06/01/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10410176,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 OLDSMOBILE ALERO. THE CONTACT STATED THAT WHENEVER A TURN SIGNAL WAS ENGAGED, THE OPPOSITE SIGNAL WOULD ILLUMINATE. THE DEALER AND MANUFACTURER WERE NOTIFIED, BUT OFFERED NO ASSISTANCE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 87,500 AND THE CURRENT MILEAGE WAS 88,000. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "04/26/2011",
        "dateOfIncident": "08/12/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10397970,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2004 OLDSMOBILE ALERO. THE DRIVERS SIDE WINDOW WAS PAUSING WHILE BEING PUT DOWN.   THEN IT STARTED SHAKING WHEN IT WAS GOING UP. ONE DAY WHEN I TRIED TO PUT IT DOWN THE WINDOW ITSELF DIDN'T MOVE. AS I WAS DRIVING THE WINDOW PROCEEDED TO LITERALLY FALL INSIDE THE DOOR. TO GET IT BACK UP I HAD TO PULL UP ON THE GLASS ITSELF AND PUSH THE WINDOW CONTROL TO GET IT UP. I TOOK IT TO A REPAIR SHOP AND WAS TOLD THAT THE PIECE THAT HOLDS THE GLASS HAD BROKEN OFF. THEY TRIED TO GLUE IT WITH A KIND OF GLASS GLUE. IT HELD FOR ABOUT A WEEK AND THEN FELL AGAIN. I HAVE NOT PUT THE WINDOW DOWN SINCE THEN,ABOUT SIX MONTHS. NOW THE PASSENGER WINDOW IS DOING THE SAME THING. MY GRANDMOTHER ALSO HAS ON OLDSMOBILE AND HER DRIVERS SIDE WINDOW HAS DONE THE SAME THING AS MINE.  *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,EQUIPMENT,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/16/2011",
        "dateOfIncident": "01/14/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10376822,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "GM PRODUCTS DIV. GM CORP.",
                "productMake": "GM PRODUCTS",
                "productModel": "GM PRODUCTS",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "AS I'M READING DIFFERENT WEBSITES AND NOW THIS SITE TO FIND A SOLUTION AS TO WHAT'S WRONG WITH MY CAR, I SEE I SHARE THE SAME PROBLEM WITH A LOT OF OTHER PEOPLE... I TOO HAVE A 2004 ALERO THAT WILL CRANK BUT NOT TURN OVER... THE SECURITY LIGHT COMES ON AND STAYS ON... WHEN I FIRST NOTICED IT I WOULD TURN MY CAR OFF THEN BACK ON AND IT WILL GO OFF... LATELY IT WILL COME ON AND STAY ON, NOW IT WON'T START! IN THE MORNING I WILL TRY WHAT EVERYONE ELSE TRIED WITH TURNING THE KEY UNTIL THE LIGHT GOES OFF, BUT THIS IS REALLY ASHAME THAT THIS MANY PEOPLE ARE HAVING THE SAME PROBLEM! I REPLACED THE FUEL PUMP A YEAR IN A HALF AGO FOR THIS SAME PROBLEM AND IT WAS NO WAY CHEAP! TRY $1,200 AT A GM DEALERSHIP THAT ONLY USE GM PARTS ON THEIR GM CARS! I'M A BROKE COLLEGE STUDENT THAT NEEDS MY VEHICLE FOR TRANSPORTATION BETWEEN SCHOOL AND WORK! PLEASE JUST RECALL THESE CARS SO THEY CAN HAVE THIS PROBLEM TAKEN CARE OF...  SHOULD I TAKE MY PROBLEM TO THE MEDIA TO GET SOME SORT OF RESULTS? IT SEEMS IF THAT'S THE ONLY WAY TO GET ANYTHING DONE NOW A DAYS... *LN",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/24/2010",
        "dateOfIncident": "04/01/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10367802,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 OLDSMOBILE ALERO. THE CONTACT ATTEMPTED TO START THE VEHICLE BUT IT WOULD NOT START. THE VEHICLE WAS TOWED TO TWO INDEPENDENT MECHANICS BUT THE FAILURE COULD NOT BE DIAGNOSED. THE VEHICLE HAD NOT BEEN REPAIRED. AFTER ALLOWING THE VEHICLE TO SIT FOR A DAY, THE CONTACT WAS ABLE TO SUCCESSFULLY START IT. THE FAILURE OCCURRED AGAIN. THE CONTACT ALSO STATED THAT THE TURN SIGNALS INTERMITTENTLY DID NOT FUNCTION. THE VEHICLE WAS TAKEN TO A LOCAL REPAIR SHOP WHERE THE TURN SIGNAL BULBS WERE REPLACED BUT THE FAILURE CONTINUES. THE FAILURE MILEAGE WAS UNKNOWN AND THE CURRENT MILEAGE WAS APPROXIMATELY 110,000. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/11/2010",
        "dateOfIncident": "01/01/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10359966,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 OLDSMOBILE ALERO: PASSLOCK ANTITHEFT SYSTEM ACTIVATES ABOUT ONE OUT OF 10 ATTEMPTS TO START THE VEHICLE. I HAVE TO WAIT TEN MINUTES BEFORE THE CAR WILL START. I HAVE BEEN STUCK IN BAD PARTS OF TOWN SEVERAL TIMES WHILE WAITING AND BEEN LATE TO WORK SO MUCH THAT I HAVE TO GO OUT TEN MINUTES EARLY AND LEAVE THE CAR RUN. GM HAS REFUSED TO FIX THE PROBLEM. *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "10/04/2010",
        "dateOfIncident": "10/02/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10359024,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 OLDSMOBILE ALERO ONGOING PROBLEMS WITH TURN SIGNALS AND HAZARDS INOPERABLE MOST OF THE TIME. MOST ELECTRICAL COMPONENTS FAIL AT TIMES. WINDOW REGULATOR FAILED. REAR DOOR LOCKS HAVE TO PLAY WITH REMOTE LOCKS BEFORE DOOR OPENS ACTS AS THOUGH CHILD SAFETY LOCKS ARE ON CAN NOT OPEN DOOR FROM IN OR OUT. EVENTUALLY AFTER PUSHING ON REMOTE LOCK IT OPENS. BRAKES ALWAYS GRINDING EVEN AFTER REPLACEMENTS. ENGINE HAS ALSO, TICKED NOT KNOCK JUST TICKING SINCE I'VE PURCHASED THE CAR. MANY TIMES THE CAR DOES NOT START FIRST TRY AFTER SECOND IT STARTS BUT ALL ELECTRICAL HAS TO RESET EXAMPLE RADIO, CLOCK ECT. *TR",
        "vin": "1G3NL52E94C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/18/2010",
        "dateOfIncident": "05/14/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10343878,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MY OLDSMOBILE ALERO CONTINUES TO OVER HEAT. EVERY OTHER DAY I GO TO THE SHOP AND THEY KEEP FILLING IT WITH COOLANT. THEY ARE BAFFLED BECAUSE I HAVE REPLACED ALMOST EVERY PART ON THE ENGINE AND IT STILL RUNS HOT. I CAN'T EVEN GET OUT OF THE PARKING LOT WITHOUT THE TEMPERATURE GAUGE GOING STRAIGHT TO THE RED ZONE. I ALWAYS HAVE TO PULL OVER, CUT THE CAR OFF, SIT FOR 2 MINUTES, THEN START THE CAR UP AGAIN. I DO NOT HAVE MONEY TO CONTINUE TO REPLACE PARTS ON THIS CAR AND STILL HAVE THE SAME PROBLEM. ON 7/25, I WILL NOT BE ABLE TO PAY MY CAR NOTE. BECAUSE ON THIS DATE THE MECHANICS ARE GOING TO REPLACE MY RADIATOR TO SEE IF THE PROBLEM WILL CEASE. IN MY MIND, I DON'T THINK SO, BUT I AM GETTING TIRED OF GOING BACK AND FORTH TO THE CAR SHOP AND I AM QUITE SURE THEIR GETTING TIRED OF TRYING TO FIGURE OUT WHAT IS CAUSE THIS PROBLEM. I NEED HELP IN PAYING FOR MY CAR IN GETTING FIXED, OR TELL ME THAT I DON'T HAVE TO CONTINUE IN MAKING CAR NOTE PAYMENTS. MY PROBLEM HAS BEEN GOING SENSE APRIL. I AM GETTING TRIED OF THE CAR SHUTTING DOWN IN THE MIDDLE OF THE STREET EVERY TIME IT STARTS GETTING TO THE HOT ZONE ON THE GAUGE. I AM SO NERVOUS IN DRIVING THIS CAR ON THE FREEWAY. THE LAST TIME I DROVE IT ON THE FREEWAY WAS IN JUNE. THIS WAS BECAUSE I SPENT $374.00 ON A WATER PUMP AND THEN IN A WEEK, I SPENT MORE MONEY ON ANOTHER WATER PUMP. TUNE-UPS, OIL CHANGE, RADIATOR FLUSH HAS BEEN DONE AND I AM STILL HAVING THE SAME PROBLEM. ON   7/25, THEY ARE GOING TO PUT A NEW RADIATOR IN THE CAR. THE CAR ALSO ACTS LIKE IT DOESN'T WANT TO STAY STARTED ONCE YOU CUT THE CAR ON. I WOULD TURN THE KEY, START THE CAR AND WAIT. THE CAR WOULD START SHAKING AND THEN CUT OFF. I WOULD START IT AGAIN AND THE CAR WOULD IDLE UP, THEN DOWN. I WOULD REALLY LIKE TO GET SOMEONE TO RESOLVE THIS PROBLEM BY HELPING MY IN PAYING FOR THESE ISSUES THAT I SHOULD NOT BE HAVING. IT IS ALSO GIVING A HEADACHE. *TR",
        "vin": "1G3NL52EX4C"
    },
    {
        "components": "VISIBILITY,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/27/2010",
        "dateOfIncident": "04/15/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10332522,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TRIM AROUND THE WINDSHIELD OF A 2004 OLDSMOBILE ALERO POPPED OUT OF PLACE, AND I TRIED TO PUT IT BACK IN PLACE.  EVERYTIME I GOT UP TO A FAST SPEED, IT WOULD COME BACK OUT AND START FLAPPING AND HITTING THE PASSENGER SIDE WINDOW.  FINALLY, IT CAME COMPLETELY OFF WHILE DRIVING ON THE INTERSTATE. *TR",
        "vin": "1G3NL52E44C"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/20/2009",
        "dateOfIncident": "10/20/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10289148,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WON'T START. ENGINE TURNS OVER BUT DOESN'T FIRE. TURNS OUT TO BE A PROBLEM WITH THE PASSLOCK SECURITY SYSTEM. THIS IS THE 4TH TIME THIS HAS OCCURRED THIS YEAR.  LEAVE IGNITION SWITCH ON FOR 10 MINUTES AND WAIT FOR SECURITY WARNING LIGHT TO GO OUT. THEN RESTART CAR. *TR",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/17/2009",
        "dateOfIncident": "06/01/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10284367,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2004 OLDSMOBILE ALERO.  RECENTLY, THE TURN SIGNAL AND HAZARD LIGHTS WORK INTERMITTENTLY, OCCASIONALLY, OR SOMETIMES NOT AT ALL.  I HAVE VIEWED SEVERAL COMPLAINTS OF OWNERS VIA THE INTERNET WITH THE SAME PROBLEM.  I WAS INFORMED VIA THE MAKERS OF MY VEHICLE THAT THE YEAR MY VEHICLE WAS MADE, THE PROBLEM, \"IF ANY\" WERE FIXED.  I FOUND THAT THERE HAD BEEN WORK ORDERS TO ALLOW THE YEARS BEFORE 2004 OLDSMOBILE ALERO TO BE FIXED FREE OF CHARGE FOR THIS SAME MALFUNCTION.  I HAVE CALLED SEVERAL PART PROVIDERS, AND THIS PART IS UNAVAILABLE.  I HAVE CONTACTED THE DEALER, AND FOR  \"FEE\", THEY FIRST HAVE TO LOOK AT THE VEHICLE, BEFORE THEY CAN TELL ME IF THEY ARE ABLE TO GET THE PART AND IF THEY CAN FIX IT.  THIS IS NOT ONLY UNSAFE FOR ME AS A DRIVER, BUT ALSO FOR DRIVERS AND PEDESTRIANS WHO MAY BE UNSURE OF MY TURNING INTENTIONS.  ALSO, IN THE EVENT I AM STRANDED IN MY VEHICLE, I CAN'T USED MY HAZARD LIGHTS.  MY VEHICLE AS A WHOLE IS IN GREAT WORKING CONDITION, AND I HAVE NO INTENTIONS OF NEEDING TO REPLACE IT, JUST BECAUSE OF THE TURNING SIGNALS.  I FEEL THAT THE PROBLEM WAS NEVER FIXED, AND FROM THE PREVIOUS FREE SERVICES GIVEN FOR THE OTHER MODELS, WE WHO OWN THE 2004 MODELS ARE HAVING TO PAY OUT OF POCKET, SO THEY CAN REGROUP THE PREVIOUS FREE WORK GIVEN.  THIS IS VERY FRUSTRATING AS A CONSUMER.  PLEASE HELP. THANK YOU IN ADVANCE FOR YOUR DILIGENCE, IN PRODUCT AND PUBLIC SAFETY. *TR",
        "vin": "1G3NL52E74C"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/17/2009",
        "dateOfIncident": "06/15/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10274143,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 OLDSMOBILE ALERO.  WHILE DRIVING APPROXIMATELY 35 MPH, THE CONTACT CRASHED INTO THE REAR DRIVER'S SIDE DOOR OF ANOTHER VEHICLE.  THE AIR BAGS FAILED TO DEPLOY AND THERE WERE NO WARNING INDICATORS ILLUMINATED ON THE INSTRUMENT PANEL.  THERE WERE NO INJURIES AND A POLICE REPORT WAS FILED.  THE VEHICLE WAS COMPLETELY DESTROYED AND WAS TOWED TO A COLLISION CENTER.  THE FAILURE AND CURRENT MILEAGES WERE 119,000.",
        "vin": "1G3NL52F84C"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/02/2009",
        "dateOfIncident": "01/13/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10257258,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TURN SIGNAL LAMPS BECOME INTERMITTENT OR INOPERATIVE. THIS IS AN ACTUAL RECALL ON 1999 TO 2001 MODELS BUT FOR SOME REASON NOT ON THE 2002 THROUGH 2004 MODELS. I HAVE JUST PURCHASED THIS VEHICLE AND HAVE NOT YET HAD IT REPAIRED. *TR",
        "vin": "1G3NL52E04C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/21/2009",
        "dateOfIncident": "01/01/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10255801,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2004 OLDSMOBILE ALERO THAT I HAVE FOUND TO HAVE A VERY IRRITATING PROBLEM WITH THE PASSLOCK THEFT DETERRENT SYSTEM. WHAT HAPPEN IS WHEN YOU GO TO START YOUR CAR SOMETIME THE IGNITION DOESN'T RECOGNIZE YOUR KEY AND THE CAR WILL NOT START BECAUSE IT THINKS FOR SOME REASON OR ANOTHER THAT SOMEONE IS STEALING THE CAR. WHAT YOU HAVE TO DO IS PUT YOU KEY IN TURN IT TO THE A/C POSITION AND WAIT FOR 10 MINUTES UNTIL THE SECURITY LIGHT TURNS OFF THEN TURN IT BACK TO OFF, TAKE THE KEY OUT AND THEN IT WILL START. I WAS WITH OUT A CAR FOR 3 WEEKS LOST WORK AND HAD TO FIND MY KIDS A WAY TO SCHOOL BECAUSE OF THIS PROBLEM. I HAD THE CAR LOOKED AT AND HE COULDN'T FIND THE PROBLEM. I THOUGHT I WAS GOING TO HAVE TO HAVE THE CAR TOWED TO A GARAGE TO HAVE FIXED UNTIL I GOOGLED IT ON THE INTERNET ONLY TO FIND OUT THAT THERE WERE ALOT OF PEOPLE WITH THE SAME PROBLEM. I FOUND A WEB SITE WITH THE EXACT SAME STORY AND PEOPLE WHO HAVE CALLED THE GMC PLACE TO TRY TO GET THIS PROBLEM RECALLED BUT JUST BECAUSE IT IS NOT A SAFETY ISSUE GMC FEELS LIKE THEY ARE NOT RESPONSIBLE. I LIVE PAYCHECK TO PAYCHECK AND CAN'T AFFORD TO HAVE THIS FIXED ALL THE TIME LIKE THE OTHER PEOPLE HAVE REPORTED. I HOPE YOU CAN GET SOMETHING DONE SO THAT HARD WORKING PEOPLE LIKE MYSELF DOESN'T GET PUSHED AROUND. THE WEB SITE I WENT TO WAS WWW.COMPLAINTS.COM THE KEY WORDS TO FIND THE HORRIBLE STORIES IS ALERO, DEFECTIVE, DETERRENT, OLDSMOBILE, PASSLOCK, SYSTEM, THEFT. I LOOK FORWARD TO HEARING FROM YOU. PLEASE HELP! *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/10/2008",
        "dateOfIncident": "12/10/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10251280,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN THE ROAD IN RUSH HOUR GOING APPROX. 55 MPH AND MY CAR COMPLETELY SHUT OFF, THE GAUGES SHUT DOWN, LOST POWER STEERING. HAD TO PULL OFF THE ROAD AS SAFELY AS POSSIBLE, PLACE VEHICLE IN PARK AND RESTART CAR. MY CAR HAS SHUT DOWN PREVIOUSLY TO THIS INCIDENT AND FEEL AS THOUGH IT NEEDS SERIOUS INVESTIGATION. I COULD HAVE BEEN ON THE HIGHWAY AND BEEN KILLED. THIS ALSO HAS HAPPENED WHEN IN A SPIN OUT AS WELL THOUGH THIS PARTICULAR INCIDENT WAS RANDOM. *TR",
        "vin": "1G3NL12F74C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/10/2008",
        "dateOfIncident": "07/16/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10251442,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE KEY WOULD NOT TURN AND HAD TO FIDDLE WITH IT TO WORK, SO I TOOK IT TO A DEALER AND HAD THE IGNITION KEY CYLINDER CHANGED ALONG WITH THE KEY(?). COST WAS OVER $500.00 WITH MILEAGE AT 60,981. JUST PAST WARRANTY. THIS IS RIDICULOUS AND SHOULD NEVER HAPPEN. I FEEL I SHOULD BE COMPENSATED FOR SOME OF THIS AT THIS MILEAGE. *TR",
        "vin": "1G3NL12E44C"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "09/09/2008",
        "dateOfIncident": "09/01/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10241602,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "LEFT FRONT WINDSHIELD MOLDING CAME OFF WHILE DRIVING. *TR",
        "vin": "1G3NF12E24C"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/02/2008",
        "dateOfIncident": "08/10/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10240598,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TURN SIGNAL IS BROKEN.  MAKES NOISE WHEN IN A NEUTRAL, NOT ON, POSITION. HAZARD SWITCH SOLDER JOINT IS CRACKING CAUSING THE TURN SIGNAL TO ONLY WORK INTERMITTENTLY.  *TR",
        "vin": "1G3NL52F54C"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/08/2008",
        "dateOfIncident": "04/08/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10223667,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "SAME PROBLEM AS THE 1999- 2002 MALIBU, GRAND AM, AND ALERO WITH INTERMITTENT TURN SIGNALS DUE TO THE HAZARD SWITCH.  *TR",
        "vin": "1G3NK52F84C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/04/2008",
        "dateOfIncident": "03/01/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10223397,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2004 ALERO GLS WITH 43,200 MILES ON IT.  AT 42,500 THE COOLANT LIGHT CAME ON SO I CHECKED AND THE OVERFLOW TANK WAS EMPTY.  WHEN I WENT FOR AN OIL CHANGE THEY FILLED IT AND 2 DAYS LATER IT WAS EMPTY AGAIN.  THERE WAS NO COOLANT ON THE GROUND OR IN THE ENGINE COMPARTMENT ANYWHERE.  I BROUGHT IT TO THE DEALER WHO FILLED IT AGAIN AND 2 DAYS LATER IT WAS EMPTY.  SINCE THIS STARTED A LOUD TAPPING SOUND STARTED WHEN THE CAR IS COLD FIRST THING IN THE MORNING AND WHEN THE CAR HEATS UP IT STOPS.  IT DOESN'T HAPPEN AGAIN UNTIL THE NEXT DAY.  I BROUGHT IT BACK AGAIN TO THE DEALER AND AFTER THEY CHECKED IT OUT THEY TOLD ME THAT IT WAS THE INTAKE MANIFOLD GASKET THAT WAS LEAKING AND NEEDS REPLACING.  AFTER MUCH RESEARCH I FIND THAT THIS IS A KNOWN PROBLEM.  EVEN TALKING TO OTHER MECHANICS WHO WORK FOR OTHER REPAIR SHOPS TELL ME IT IS A KNOW FACT THAT THIS ENGINE HAS A PROBLEM WITH INTAKE GASKETS.  THE LEAK JUST STARTED OUT OF NOWHERE AND IT NEEDS TO BE FIXED.  I CANNOT AFFORD TO FIX IT, NOR DO I FEEL IT IS MY RESPONSIBILITY TO PAY FOR IT.  *TR",
        "vin": "1G3NF52E24C"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/25/2008",
        "dateOfIncident": "02/17/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10222242,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 OLDSMOBILE ALERO.  WHILE DRIVING (MPH UNKNOWN) HE HEARD A CLICKING NOISE WHEN HE ACTIVATED THE TURN SIGNAL.  IN ADDITION, THE HAZARD LIGHTS WERE INOPERABLE.  THERE IS A RECALL FOR THE EXTERIOR LIGHTING: HAZARD FLASHING WARNING LIGHTS: SWITCH (NHTSA CAMPAIGN ID #03V327000) HOWEVER, THE 2004 MODEL YEAR WAS NOT INCLUDED.  THE SWITCH INTERRUPTER WAS REPLACED HOWEVER, THE FAILURE CONTINUED TO OCCUR.  THE CURRENT MILEAGE WAS 55,203 AND FAILURE MILEAGE WAS 55,150.",
        "vin": "1G3NL52F34C"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/23/2007",
        "dateOfIncident": "10/21/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10206627,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERMITTANT TURN SIGNALS AND HAZARD WARNING LIGHTS.  *TR",
        "vin": "1G3NK52F84C"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "09/04/2007",
        "dateOfIncident": "02/03/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10201806,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "RIGHT WINDSHIELD WIPER BECAME DISCONNECTED FROM IT'S DRIVE MECHANISM. WIPER JUST LAYED AT BASE OF WINDSHIELD. THIS HAPPENED DURING A SNOWSTORM, I'M GLAD IT WAS NOT THE DRIVERS SIDE. *TR  UPDATED 12/12/07 *BF",
        "vin": "1G3NK52F34C"
    },
    {
        "components": "SERVICE BRAKES, AIR",
        "crash": false,
        "dateComplaintFiled": "06/10/2007",
        "dateOfIncident": "08/04/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10192867,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE HAD TO REPLACE BRAKES AND ROTORS 4 TIMES IN ONE YEAR, AND THE SLIDER PINS ON CALIPERS KEEP GOING BAD, PASS SIDE STRUT NEEDS REPLACED FOR THE 3RD TIME IN 2 YEARS",
        "vin": ""
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES, HYDRAULIC,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "04/29/2007",
        "dateOfIncident": "09/09/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10189208,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "L SERIES",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT BEARING HUBS FAILURE. FRONT SUSPENSION FAILURE, FRONT BREAK SYSTEM FAILURE. *TR",
        "vin": "1G3NL52E44C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/04/2007",
        "dateOfIncident": "02/12/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10186970,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MY OLDSMOBILE  ALERO JUST HIT 60000 MILES, AND IS  NOT STARTING AND IS  STALLING. I AM NOT SURE WHAT THE PROBLEM IS YET, BUT IT SEEMS ELECTRICAL. THE SECURITY LIGHT HAS COME ON WHEN IT STALLS SO I AM NOT SURE IF THEY ARE RELATED.  *AK",
        "vin": "1G3NL52F24C"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/25/2007",
        "dateOfIncident": "01/31/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10186093,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "ABS LIGHT CAME ON.  TAKEN TO DEALERSHIP AND WAS DETERMINED TO BE WHEEL HUB/BEARING/ABS SENSOR. DEALERSHIP REPLACED WHEEL HUB/BEARING.*AK",
        "vin": "1G3NL52E14C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/17/2007",
        "dateOfIncident": "01/05/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10185384,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WOULD NOT START, SECURITY LIGHT ON. PASSLOCK SENSOR NEEDED REPLACING PER DEALER. REPARI WAS MADE, NEW KEYS ISSUED, BUT STRANGLY ENOUGH, OLD KEYS STILL WORKED. I'VE SEEN OTHER NOTES OF PASSLOCK SENSOR PROBLEMS IN OTHER ALEROS. SAFETY? YES-CAR HAD TO BE TOWED.",
        "vin": "1G3NL52FX4C"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "11/27/2006",
        "dateOfIncident": "04/10/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10174375,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THE DRIVER'S HAND WAS CUT WHEN ATTEMPTING TO ADJUST THE RIGHT FRONT SEAT TO CLEAN UNDERNEATH IT.  THE FRONT SEAT ADJUSTMENT SPRINGS NEEDED RUBBER PROTECTIVE CAPS ON THE TOP TO PREVENT CUTS OR PERSONAL INJURIES.  UPDATED",
        "vin": ""
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/10/2006",
        "dateOfIncident": "10/10/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10170391,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN MY VEHICLE REACHED 49,000 MILES I HAD TO HAVE THE FRONT WHEEL BEARINGS AND BRAKES REPLACED.  MY CAR IS NOW AT 59,000 MILES AND THE FRONT WHEEL BEARINGS NEED TO BE REPLACED AGAIN.  *NM",
        "vin": ""
    },
    {
        "components": "STRUCTURE,SEATS",
        "crash": false,
        "dateComplaintFiled": "04/07/2006",
        "dateOfIncident": "04/07/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10154812,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THE DRIVER'S SEAT IS NOT PROPERLY SECURED TO THE FLOOR.  THE SEAT MOVES BACK AND FORTH WHILE DRIVING.  THE DEALER REPLACED THE SEAT RISER UNDERNEATH THE SEAT.  THIS DID NOT REMEDY THE PROBLEM.  THE DEALERSHIP DETERMINED THE ACTUAL FLOOR OF THE VEHICLE WAS DEFECTIVE.  THE DEALERSHIP TEMPORARILY FIXED THIS BY INSERTING FOAM RUBBER BETWEEN THE SEAT RISER AND THE FLOOR.  *AK",
        "vin": "1G3NK12F84C"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/07/2006",
        "dateOfIncident": "03/07/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10152141,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED THE BRAKES GRIND AND SQUEAK AT ANY SPEED.  THE DEALERSHIP DETERMINED THIS WAS DUE TO DIRT ROADS AND REPLACED THE HUBS, ROTORS, AND BRAKES.  THESE REPAIRS HAVE BEEN MADE TWICE, AND NEED REPLACING AGAIN.    UPDATED 4/11/2006 - *NM",
        "vin": "1G3NF12E24C"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING,POWER TRAIN,ELECTRICAL SYSTEM,EXTERIOR LIGHTING,VISIBILITY,STRUCTURE,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/06/2005",
        "dateOfIncident": "11/05/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10135455,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: BEGINNING IN NOVEMBER 2004 THE CONSUMER BEGAN TO HAVE PROBLEMS WITH THE ELECTRICAL SYSTEM IN THE 2004 OLDSMOBILE ALERO. WHEN THE VEHICLE WAS PURCHASED THE  AIR BAG LIGHT CAME ON. THE  CONSUMER  WAS CONCERNED THAT THE AIR BAG LIGHT WILL CAUSE THE AIR BAGS NOT  TO DEPLOY IN CASE OF AN ACCIDENT. ALSO, SHE WAS  CONCERNED THAT THE AIR BAGS WOULD DEPLOY WHEN THERE WAS NO ACCIDENT. THE VEHICLE HAS  BEEN TO THE  REPAIR SHOP 6 TIMES DUE TO BRAKE PROBLEMS.. WHEN THE VEHICLE HAD 20,000 MILES  IT  HAD TO HAVE THE ROTORS TURNED AND BRAKE SHOES REPLACED. THE BRAKES WERE STILL MAKING A HUMMING NOISE. THE DEALERSHIP COULD NOT FIGURE OUT WHY THE VEHICLE WAS HAVING PROBLEMS WITH THE AIR BAG LIGHT OR WITH THE BRAKES.*AK    THE CRUISE CONTROL, DOOR PANELS, WINDOWS WERE INOPERATIVE. THE TRANSMISSION OR FRONT AXLE SEAL WAS LEAKING, THE BLINKERS WERE BLINKING TOO FAST, THE WINDSHIELD WAS LEAKING, THE CARPET LINING WAS COMING OUT OF THE TRUNK, THE ENGINE MADE A KNOCKING NOISE, THE BACK TRIM AROUND THE SEATS DIDN'T FIT PROPERLY, THE IGNITION SWITCH WAS REPLACED, THE FUSE BOX WAS REPLACED. *JB",
        "vin": "1G3NK52F84C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/28/2005",
        "dateOfIncident": "08/11/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10134423,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 OLDS ALERO  KEY WILL NOT TURN HAVE TO SWAP KEY AROUND UNTIL IT TURNS. SOMETIMES WHEN IT DOES FINALLY TURN THE STARTER WILL HESITATE TO DISENGAGE. I HAVE SEEN THIS PROBLEM SEVERAL TIMES ON FORUMS SOME PEOPLE HAVE HAD TO HAVE THEIR ALERO TOWED AND HAVE THE IGNITION SWITCH/CYLINDER REPLACED. I FEEL A RECALL IS IN ORDER BEFORE THE PROBLEM WORSENS LIKE THE FORD MOTOR COMPANY HAD. *JB",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/28/2004",
        "dateOfIncident": "09/15/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10105423,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LEFT FRONT WHEEL WAS MAKING A SOUND FROM THE BRAKES.  THE CONSUMER TOOK THE VEHICLE TO THE DEALER AND THEY STATED IT WAS THE WEATHER MAKING THE BRAKES SOUND. THE  BRAKES ARE NOW SO DEFECTIVE THAT WHEN THEY ARE PRESSED, THEY GO  ALL THE WAY TO THE FLOOR.  *JB",
        "vin": "1G3NL52E94C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/30/2004",
        "dateOfIncident": "10/23/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10097580,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PULLING INTO A DRIVEWAY THE DUAL AIR BAGS DEPLOYED INADVERTENTLY.  NO INJURIES WERE REPORTED.   *AK   *SC",
        "vin": "1G3NL52E54C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/15/2004",
        "dateOfIncident": "07/09/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10098850,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING SLOWING OVER SOME RAILROAD TRACKS THE AIR BAGS DEPLOYED.*AK",
        "vin": "1G3NL52F34C"
    }
]