[
    {
        "components": "STEERING,SUSPENSION,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "12/11/2021",
        "dateOfIncident": "11/17/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11443450,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "Brakes system keeps malfunctioning. Service brake system.notice keeps coming on dash even after new brakes had been put on and serviced. Had to do a last mo.ent quick stop but brakes went to floor amd I hit a car head on cause brake system keeps malfunctioning and the ABS",
        "vin": "1GHDT13S142"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/28/2020",
        "dateOfIncident": "10/20/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366777,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING MYSELF AND 2 CHILDREN DOWN THE HIGHWAY AND THE HEADLIGHTS SHORTED  OUT AND DIDNT COME BACK ON RIGHT AWAY I GOT TRUCK PULLED OFF THE RD. AND TURNED IT OFF GOT OUT TAPPED ON HEADLIGHT ASSEMBLY TO SEE IF THERE WAS A SHORT OR A BULB ISSUE THERE WAS NOTHJNG WROMG WITH THE BULDS I GOT BACK IN TURNED KEY STILL NO HEADLIGHTS 20 MINS LATER TRIES TURNING KEY AND  HEADLIGHTS SWITCH AND THEY FINALLY BEGAN WORKING THIS HAS HAPPEND 4 TIMES IN 2 WEEKS IVE ONLY OWNED VEHICLE LESS THAN 45 DAYS!!! THE CRUISE CONTROL HAS SHORTED OUT AND THE COOLING FAN SYSTEM FOR ENGINE AND A/C HAS SHORTED OUT!!!",
        "vin": "1GHDT13S142"
    },
    {
        "components": "EXTERIOR LIGHTING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/23/2017",
        "dateOfIncident": "08/02/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11019209,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A CRACK IN MY EXHAUST MANIFOLD, IS THERE A RECALL OR A EXTENDED COVERAGE. ALSO THE HEAD LIGHTS ARE SHUTTING OFF WHILE DRIVING ESPECIALLY AT NIGHT.",
        "vin": "1GHDT13S642"
    },
    {
        "components": "AIR BAGS,FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "12/06/2015",
        "dateOfIncident": "12/04/2015",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10808623,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL, MY WIFE WAS IN TWO ACCIDENTS, ONE IN APRIL 2011 SHE WAS DRIVING DOWN A SUBURB STREET TO CATCH A LIGHT ON A LEFT TURN AND WHEN THE LIGHT TURNED GREEN FOR THE OTHER SIDE COMING AT HER, A CAR ALREADY AT SPEED LIMIT CONTINUED AND MY WIFE STRUCK THAT CAR ON ITS LEFT SIDE WITH HER FRONT LEFT BUMPER ; AIRBAGS NEVER DEPLOYED, SHE WAS IN ANOTHER ACCIDENT ON 12/4/2015. SHE WAS DRIVING ON THE FREEWAY IN THE FAR RIGHT LANE GOING ABOUT 70MPH WHEN A VAN DRIFTED INTO HER LANE FORCING HER OFF THE ROAD. HER CAR FISHTAILED WHEN IT HIT THE SHOULDER AND WHEN TRYING TO REGAIN CONTROL OF THE VEHICLE, IT FLIPPED OVER AND ROLLED A  TIMES OFF THE FREEWAY, LANDING UPSIDE DOWN AND THEN CAUGHT FIRE. NO AIRBAGS DEPLOYED IN THIS CASE EITHER.",
        "vin": "1GHDT13S042"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/01/2012",
        "dateOfIncident": "03/01/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10449995,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "HELLO I BOUGHT AN 2004 OLDSMOBILE BRAVADA ON 2/25/2012 THE SELLER TOLD ME THAT THE TRUCK HAD 100,000 MILES, BUT AFTER I BOUGHT IT AND WHEN A GOT HOME I CHECK THE RECORD OF  THE TRUCK IN VINCARHISTORY. AS A RESULT I FOUND OUT THAT IT HAS 62,000 MILES MORE OF WHAT IT SUPPOSED TO BE AND SELLER NEVER TOLD ME ANYTHING.  WHAT CAN I DO IN THIS CASE BECAUSE I DON'T WANT TO HAVE ANY PROBLEMS???  *TR",
        "vin": "1GHDT13S142"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/04/2011",
        "dateOfIncident": "11/25/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10398884,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS GAUGE , OIL PRESSURE, TACHOMETER AND SPEEDOMETER ALL GIVE FALSE READINGS.  THIS CAUSE THE INABILITY TO ACCURATELY MAINTAIN SPEED IN ACCORDANCE WITH SPEED LIMITS.  IT ALSO MAKES IT IMPOSSIBLE TO DETERMINE FUEL LEVEL WHICH CAN  LEAD TO RUNNING OUT OF GAS WHILE DRIVING.  VEHICLE WAS LOOKED AT BY DEALER AND DETERMINE INSTRUMENT CLUSTER IS DEFECTIVE.  REPAIR REQUIRED CLUSTER BE SENT TO REPAIR SHOP AT A COST OF $750.  I DID MOT HAVE THIS FIXED SINCE I HAVE NEVER HEARD OF THIS KIND OF FAILURE BEING THE CUSTOMERS RESPONSIBILITY SINCE VEHICLE SAFE OPERATION IS DEPENDENT ON IT.  THE VEHICLE IS A 2004 OLDSMOBILE BRAVADA SUV.  *TR",
        "vin": "1GHDT13S042"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/02/2011",
        "dateOfIncident": "09/15/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10398585,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2004 OLDSMOBILE BRAVADA. WHILE DRIVING APPROXIMATELY 55 MPH, THE CONTACT STATED THAT THE VEHICLE RAN OUT OF FUEL. THE FUEL GAUGE DISPLAYED THAT THE FUEL TANK WAS FULL. THE CONTACT STATED THAT THE FUEL GAUGE DID NOT SHOW THE ACCURATE AMOUNT OF FUEL IN THE VEHICLE AND THE READING WOULD FLUCTUATE SPORADICALLY. THE VEHICLE WAS NOT TAKEN TO DEALER FOR DIAGNOSTICS OR REPAIRS.  THE APPROXIMATE FAILURE MILEAGE WAS 80,000.",
        "vin": "1GHDT13SX42"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/21/2010",
        "dateOfIncident": "11/19/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10301741,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I CURRENTLY OWN A 2004 OLDS BRAVADA WITH A 4.2 LTR ENGINE. I NOTICED A LOUD TICKING NOISE. I DISCOVEREDBTHERE WAS A CRACK IN THE EXHAUST MANIFOLD. I HAVE NEVER HAD THIS HAPPEN TO ANY OF MY CARS. APPARENTLY I DO NOT STAND ALONE. I HAVE DISCOVERED COUNTLESS GM OWNERS OF THIS TYPE OF VEHICLE WITH EXACT SAME PROBLEM. I THINK GM SHOULD HAVE RECALLED THIS DEFECT. I BELIEVE IF ALL THIS IS HAPPENING IT IS POISONING OUR ATMOSPHERE WITH ALL THESE EXHAUST LEAKS BASED ON POOR CRAFTSMANSHIP OF THIS PARTICULAR PRODUCT. I THINK THE EPA SHOULD BE MADE AWARE OF THIS INCIDENT. *TR",
        "vin": "1GHDT13S642"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/27/2008",
        "dateOfIncident": "11/09/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10219274,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 OLDSMOBILE BRAVADA.  THE CONTACT NOTICED FAILURE WITH THE FUEL HOUSING WHILE PLACING FUEL IN THE VEHICLE.  THE DEALER REPAIRED THE FAILURE AT THE COST OF $799.65 BY INSTALLING A NEW FUEL PUMP AND HOUSING.  THE FAILURE MILEAGE WAS 82,548 AND CURRENT MILEAGE WAS 85,000.",
        "vin": "1GHDT13S942"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/21/2005",
        "dateOfIncident": "07/19/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10129547,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "ISSUE WITH TRANSMISSION UPSHIFT FROM 1 TO 2 GEAR, 2004 OLDSMOBILE BRAVADA AWD  THE TRANSMISSION HAS ISSUES WHEN IT SHIFTS GEARS AND CAUSES MY FAMILY TO GET THROWN BACK INTO OUR SEATS CAUSING WHIPLASH. IT ALSO DRASTICALLY REDUCES THE RPM, LOSING SPEED. THIS SCARES US  CONSIDERING THAT OTHER VEHICLES MIGHT REAR END MY CAR. UNFORTUNATELY THE GM DEALERSHIP HOLDS OUR VEHICLE FOR MAYBE 2 DAYS AND DRIVES IT FOR A SHORT DISTANCE. SINCE THEY CANNOT FIND THE ISSUE AS IT IS RANDOM EVEN THOUGH THIS CONDITION AS DESCRIBED IN THEIR SERVICE BULLETIN SAYS THAT IT IS RANDOM, THE VEHICLE IS RETURNED SINCE GM WILL NOT PAY THEM. THEY WANT THE CONDITION T WORSEN BEFORE THEY FIX IT, PUTTING US IS HARMS WAY.  I WOULD SUSPECT THIS HAPENS WITH THE TRAILBLAZER AND GMC ENVOY AS WELL.",
        "vin": "1GHDT13S842"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/02/2005",
        "dateOfIncident": "10/21/2004",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10110279,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON CA HWY 18, OUR 2004 OLDS BRAVADA SPONTANEOUSLY CAUGHT FIRE. A PASSING MOTORIST SHOUTED TO MY HUSBAND THAT HIS CAR WAS ON FIRE.  HE PULLED OVER; THE FIRE DEPT. RESPONDED. CAR WAS TOWED TO GM DEALER; USAA INS. DETERMINED THAT IT WAS TOTALED.  IT WAS TOWED TO THEIR YARD IN NO. HOLLYWOOD WHERE IT NOW IS. GM HIRED AN ENGINEER TO CHECK THE CAR.  GM THEN TOLD US THAT A PHOTO TAKEN AFTER THE FIRE & TOWS SHOWED THE TRANSMISSION FLUID DIP STICK HAD NOT BEEN PROPERLY SECURED & THIS CAUSED THE FIRE. THE CAR HAD ONE OIL CHANGE ABOUT 2 MONTHS PRIOR TO THE FIRE.  IN WRITING, GM SAID \"AFTER CAREFUL INVESTIGATION OF YOUR CASE, NONE OF THE AVAILABLE DATA SUGGESTS THAT THE PRODUCT ALLEGATION HAS ANY MERIT...\" & REFERRED US BACK TO OUR INS. CO.  USAA HIRED AN ENGINEER & THEIR CONCLUSION STATES: \"THE CAUSE & ORIGIN OF THE FIRE WAS A FAILURE OF A POWER STEERING HOSE IN THE LOWER RIGHT OF THE ENGINE COMPARTMENT.  THE FAILED HOSE SPRAYED POWER STEERING FLUID ON THE RIGHT SIDE EXHAUST MANIFOLD AND THE CATALYTIC CONVERTER WHERE IT WAS IGNITED BY A SPARK FROM THE SPARK PLUGS AND/OR HEAT FROM THE CATALYTIC CONVERTER.\"  I HAVE THE FULL REPORT WHICH ALSO STATES \"\"THE RIGHT UNDERSIDE OF THE VEHICLE WAS COVERED WITH POWER STEERING FLUID...THE POWER STEERING FLUID RESERVOIR WAS MELTED DOWNWARD FROM THE TOP. THE POWER STEERING HOSES IN THE LOWER RIGHT OF THE ENGINE COMPARTMENT WERE DAMAGED. POWER STEERING FLUID SPRAY PATTERNS WERE FOUND BENEATH THE RIGHT SIDE OF THE ENGINE COMPARTMENT AND ALONG THE FRONT OF THE CATALYTIC CONVERTER.  THE FIRE IGNITED QUICKLY AFTER THE POWER STEERING FLUID LEAK BEGAN AS THE POWER STEERING PUMP STILL TURNED FREELY...  NO OTHER FIRE CAUSES OR CONTRIBUTORS WERE FOUND...*AK  *JB",
        "vin": "1GHDT13S142"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/28/2004",
        "dateOfIncident": "07/11/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 4,
        "odiNumber": 10089596,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING CONSUMER' VEHICLE WAS HIT ON  DRIVER'S SIDE. VEHICLE WAS TOTALED.  SIDE AND FRONTAL AIR BAGS DID NOT DEPLOY. CONSUMER STATES THE VEHICLE WAS EQUIPPED WITH DEFECTIVE EQUIPMENT. DEALER CAME OUT TO DO AN INVESTIGATION, AND STATED VEHICLE WAS FINE.*AK     THE CONSUMER CONTACTED THE OLDSMOBILE CUSTOMER ASSISTANCE CENTER JULY 16.  *TC",
        "vin": "1GHDT13S632"
    }
]