[
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "08/18/2008",
        "dateOfIncident": "08/15/2008",
        "fire": false,
        "manufacturer": "Pilgrim International, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10238641,
        "products": [
            {
                "manufacturer": "Pilgrim International, Inc.",
                "productMake": "PILGRIM",
                "productModel": "OPEN ROAD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2004 PILGRIM INTERNATIONAL OPENROAD.  THE VEHICLE HAS A DOMETIC REFRIGERATOR, MODEL RM2852.  THE CONTACT NOTICED AMMONIA LEAKING OUT OF HER CAMPER AND NOW HER REFRIGERATOR NO LONGER WORKS.  DOMETIC STATED THAT THE FAILURE WAS NOT PART OF NHTSA CAMPAIGN ID NUMBERS 07V201000\\08V336000 (EQUIPMENT:RECREATIONAL VEHICLE).  SHE WOULD LIKE DOMETIC TO RECHARGE THE REFRIGERATOR BECAUSE THE FAILURE WAS DUE TO THE FAULTY PART.  THE CONTACT NEVER RECEIVED A RECALL NOTICE.  UPDATED 10/14/08  *BF    THE CONSUMER STATED THE CAMPER WAS NOT COLD.  THE CONSUMER NEVER RECEIVED A RECALL NOTICE. THE CONSUMER PAID TO HAVE THE UNIT REPLACED.  UPDATED 10/16/08.*JB",
        "vin": ""
    },
    {
        "components": "SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/15/2008",
        "dateOfIncident": "08/03/2007",
        "fire": false,
        "manufacturer": "Pilgrim International, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10214947,
        "products": [
            {
                "manufacturer": "Pilgrim International, Inc.",
                "productMake": "PILGRIM",
                "productModel": "OPEN ROAD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "PER DEXTER AXLE, THE WHEELS SHOULD BE 0 DEGREES FROM CENTER OR IT WILL CAUSE BEARING TO FAIL ,WHICH MINE DID. DEXTER WILL NOT WARRANTY THE AXLE, DUE TO PILGRIM INTERNATIONAL INSTALLING THE WRONG WHEELS ON THEIR CAMPERS. THIS COULD CAUSE A LOT OF ACCIDENTS. PILGRIM HAS SENT ME A CHECK FOR THIS TIME, BUT WHEN I ASKED WHAT THEY WERE GOING TO DO ABOUT THE WHEELS THEY SAID THEY WERE NOT SURE THAT WAS THE PROBLEM. IT MUST BE A PROBLEM OR THE AXLE MANUFACTURER WOULD WARRANTY THEIR AXLES. THERE IS PROBABLY ALOT OF THESE WHEEL AND AXLE COMBINATIONS OUT THERE ON THE ROAD AND ALOT OF THOSE PEOPLE DO NOT KNOW THERE IS A PROBLEM. LUCKY FOR ME I TOOK MINE TO TESH AND SONS TRAILER,SOMEONE THAT KNOWS ABOUT DEXTER NEVER LUBE AXLES. MOST PEOPLE ARE NOT GOING TO KNOW WHAT I JUST TOLD YOU. THEY DON'T KNOW THEY ARE IN DANGER.  *TR",
        "vin": "1P9FM363041"
    }
]