[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/14/2011",
        "dateOfIncident": "08/11/2011",
        "fire": false,
        "manufacturer": "Nu Wa Industries, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10419412,
        "products": [
            {
                "manufacturer": "Nu Wa Industries, Inc.",
                "productMake": "NU WA",
                "productModel": "DISCOVER AMERICA",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR TIRE & RUBBER CO",
                "productModel": "WRANGLER AT/S",
                "productYear": "9999",
                "size": "LT265/70R17",
                "type": "Tire"
            }
        ],
        "summary": "ON AUG. 11,2012 WHILE TOWING MY 5TH WHEEL HITCHHIKER TRAILER AT ABOUT 1800 HOURS AT A SPEED OF ABOUT  65 MPH AT MM106 EASTBOUND ON I-94 NEAR MILES CITY, MT. IN THE RIGHT LANE, A FELLOW DRIVER IN THE LEFT  LANE PULLED ALONG SIDE OF ME & RAPIDLY HONKED HIS HORN & POINTING AT MY TRAILER.    I LOOKED IN MY REAR LOOKING LEFT MIRROR & THE TRAILER&  WAS STILL TRACKING STRAIGHT & I FELT NO PULLING ON THE TRUCK BY THE TRAILER.   I PULLED OFF AT THE NEXT OFF RAMP A SHORT DISTANCE AWAY AS THE TRAFFIC WAS ON THE BUSY SIDE. AFTER GETTING PULLED OVER I LOOKED AT MY TRAILER TIRES  ON THE DRIVERS SIDE & DISCOVERED THAT THE FRONT AXLE TIRE, DRIVERS SIDE HAD BLOWN OUT. THE TIRE WAS GONE OFF OF THE RIM EXCEPT FOR THE TIRE BEADS ON BOTH SIDES OF THE RIM. THE REAR AXLE TIRE HAD A LARGE BULGE IN THE TREAD AREA. I CALLED MY ROADSIDE SERVICE TO COME OUT & REPLACE THE TIRE WITH MY SPARE ( THIS WAS NOW AT ABOUT 2130 HOURS & VERY DARK SO WE DROVE TO THE NEXT REST AREA TO SPEND THE NIGHT AS I DIDN'T WANT TO DRIVE THE INTERSTATE IN THE DARK WITH NO SPARE.  I DROVE TO A TIRE SHOP IN MILES CITY & HAD BOTH LEFT TIRE REPLACED WITH NEW ONES, THE TIRE SHOP THEN EXAMINED THE RIGHT SIDE TIRES & FOUND THAT THE REAR ONE HAD READ SEPARATION, THEN BOTH RIGHT SIDE TIRES WERE REPLACED WITH NEW ONES. THE 4 REPLACED TIRES WERE REPLACED IN 2008 BY GOODYEAR UNDER WARRANTY WITH NEW TIRES BECAUSE OF TREAD CRACKING IN THE GROVES.    I FEEL THE TIRE BLEW BECAUSE OF TREAD SEPARATION. DAMAGE TO MY TRAILER INCLUDED W/WELL SKIRT BROKE & WAS TORN LOOSE, W/WELL WATER MEMBRANE WAS HEAVILY DAMAGED, DIRECTIONAL LIGHT WIRING TORN, BLACK WATER DRAIN TUBE COVER TORN OFF AND THE SIDE OF THE TRAILER WAS HEAVILY BLACKENED BY THE WHIPPING OF THE BLOWN TIRE TREAD BEFORE BEING THROWN OFF TO WHO KNOWS WHERE.  THE TWO PIECES OF THE BLOWN TIRE BEAD HAVE BEEN SENT TO GOODYEAR VIA FED EX, THE TIRE DEALER IN MILES CITY HAS THE OTHER 3 TIRES UNTIL SUCH TIME AS WHAT GOODYEAR WANTS TO DO WITH THEM.  *TR",
        "vin": ""
    }
]