[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/13/2018",
        "dateOfIncident": "11/13/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11150548,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 OLDSMOBILE SILHOUETTE LUXURY. CONSUMER WRITES IN REGARDS TO PROBLEMS WITH THE ELECTRICAL SYSTEM. *LD    THE CONSUMER STATED THE RADIO, LOCKS, SLIDING DOORS AND INSTRUMENT PANEL ALL MALFUNCTION. *JS",
        "vin": "1GHDX13E93D"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/22/2017",
        "dateOfIncident": "12/21/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11056021,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 10 YEAR OLD NIECE ATTEMPTED TO OPEN THE POWER SLIDING DOOR ON THE RIGHT SIDE OF OUR 2004 OLDSMOBILE SILHOUETTE OUTSIDE THE MALL. THE MOTOR WAS ALREADY RUNNING, IN PARK, AS I HAD COME TO PICK UP MY DAUGHTER AND NIECE FROM THE MALL. THE DOOR APPEARED TO BE LOCKED SINCE IT WOULD NOT OPEN, SO I PUSHED 'UNLOCK' A FEW TIMES AS SHE AND MY GROWN DAUGHTER TRIED TO OPEN THE DOOR. I JUST HEARD A CLICKING SOUND OF THE UNLOCK MECHANISM AS IF IT WAS LOCKING AND UNLOCKING. THE DOOR WOULD NOT OPEN, SO MY NIECE ENTERED THROUGH THE MANUAL SIDE DOOR ON THE LEFT SIDE OF THE VAN. WE DROVE ABOUT 3 BLOCKS FROM THE MALL TO THE STOPLIGHT OF A MAJOR CITY STREET. ABOUT HALF A BLOCK OR LESS AFTER TAKING A LEFT AT THE INTERSECTION STOPLIGHT, THE POWER SLIDING DOOR ON THE RIGHT SIDE OF THE VAN JUST OPENED. MY NIECE LOUDLY EXCLAIMED THAT THE DOOR OPENED AND TRIED TO REACH ACROSS FROM HER BUCKLED POSITION ON THE LEFT BUCKET SEAT. MY DAUGHTER AND I BOTH SHRIEKED AND SAID FOR HER NOT TO GET NEAR IT. MY DAUGHTER WAS SEATED UP FRONT ON THE PASSENGER SEAT AND REACHED BACK TO THE WINDOW LEDGE OF THE OPEN SLIDING DOOR AND TRIED TO PULL IT SHUT. IT SHUT MOST OF THE WAY, BUT NOT FULLY. I PULLED INTO A PARKING LOT OF A BUSINESS AND HAD MY NIECE USE THE SWITCH LOCATED NEAR THE POWER SIDE DOOR TO OPEN IT FULLY AND THEN AGAIN TO CLOSE IT FULLY. WE MADE THE NEXT 20 MILES WITHOUT INCIDENT. WE JUST BOUGHT THE VEHICLE LESS THAN A WEEK AGO, AND WE HAVE OUR 3 YOUNGER BOYS RIDE IN THE BACK, SO THIS INCIDENT HAS BEEN VERY SCARY.",
        "vin": "1GHDX03E74D"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/16/2012",
        "dateOfIncident": "07/11/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10465802,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Cooper Tire & Rubber Co.",
                "productMake": "MASTERCRAFT",
                "productModel": "MASTERCRAFT SENSYS 01",
                "productYear": "9999",
                "size": "205/55R16",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 OLDSMOBILE SILHOUETTE. THE VEHICLE WAS EQUIPPED WITH MASTERCRAFT STRATEGY TIRES (N/A), TIRE SIZE 225/60/16. THE DOT NUMBER WAS UNAVAILABLE. WHILE DRIVING APPROXIMATELY 55 MPH, THE VEHICLE BEGAN TO VIBRATE EXCESSIVELY. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHERE THE FOUR TIRES WERE BALANCED AND THE FAILURE CONTINUED TO OCCUR. THE TIRES HAD NOT BEEN REPLACED. THE MANUFACTURER WAS NOTIFIED OF THE DEFECT. THE APPROXIMATE FAILURE MILEAGE WAS 112,963.",
        "vin": "1GHDX03EX4D"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/23/2010",
        "dateOfIncident": "12/10/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10313029,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "SPEEDOMETER IN 2004 OLDSMOBILE SILHOUETTE MALFUNCTIONS. APPEARS TO SHOW CORRECT SPEED SOME OF THE TIME, OTHER TIMES IS OBVIOUSLY OFF. *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/10/2008",
        "dateOfIncident": "11/11/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 10251299,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE IMPACT OF THE CRASH OF MY CAR INTO THE SIDE OF THE OTHER CAR AS I WAS GOING WEST & HE WAS GOING NORTH,AS HIS CAR KEPT ON GOING, ROLLED OVER, MY CAR WAS PULLED NW THE BUMPER PULLED OFF - BUT THE AIR BAG DID NOT BLOW, WHY? *TR",
        "vin": "1GHDX03E74D"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "04/20/2008",
        "dateOfIncident": "04/10/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10225197,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "EAGLE LS",
                "productYear": "9999",
                "size": "P225/60R16",
                "type": "Tire"
            }
        ],
        "summary": "GOODYEAR TIRES ON 2004 OLDSMOBILE VAN DEFECTIVE (SAFETY CONCERN TO OTHER OWNERS). TIRES DEVELOPED BLISTERS THEN RUBBER SPLIT OPEN CAUSING TIRES TO GO FLAT. I HAD TO BUY TIRES IMMEDIATELY. OLD TIRES ARE NOT HERE. I TOOK THEM TO DEALER WHERE I PURCHASED THE VAN NEW. NO HELP FROM THEM OR TIRE MANUFACTURE OR VAN BUILDER. *TR",
        "vin": "1GHDX03E54D"
    },
    {
        "components": "STRUCTURE,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "06/15/2006",
        "dateOfIncident": "06/15/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10159926,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED THE SLIDING DOOR ON THE LEFT SIDE OPENED WITHOUT WARNING.  ALSO, THE DOOR CHIME ALARM SOUNDED WHILE DRIVING VARIOUS SPEEDS.  THE VEHICLE WAS INSPECTED BY THE DEALER WHO DETERMINED THE FUSE TO DOOR ALARM COULD NOT BE REMOVED BECAUSE IT WAS A SAFETY FEATURE.  THE DEALER CLEANED THE DOOR CONTACTS AND REPLACED THE LOCKS.  THE PROBLEMS PERSISTED.  THE MANUFACTURER WAS NOT ALERTED.",
        "vin": "1GHDX13E94D"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "12/02/2005",
        "dateOfIncident": "11/07/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10144328,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "EAGLE LS",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "ALMOST IDENTICAL CIRCUMSTANCES AS IN ODI 10137234.  BIG O TIRES ALIGNED MY VAN IN OCT 2005 AND DISCOVERED THE TREAD SEPARATION.  ALIGNMENT WAS WITHIN SPEC, EXCEPT CAMBER OR CASTER ON THE REAR WERE 0.02 DEGREES OUT.  THEY REFEREND ME TO THE DEALER.   AT FIRST, OVER THE TELEPHONE, THE DEALERSHIP SAID IT WAS DUE TO NEGLET AND REFERRED ME TO AN AUTHORIZED GOODYEAR DEALER.  GOODYEAR TIRE DEALERSHIP DISCOVERED TREAD SEPARATION ON ALL 4 TIRES ON MY 2004 OLDSMOBILE MINIVAN ON THE INSIDE EDGE, UNDER THE VEHICLE.  GOODYEAR SAW MY ROTATION/BALANCE RECORDS AND AGREED TO WARRANT THE TIRES.  THIS IS WHY ALL FOUR TIRES WERE WORN, DUE TO ROTAITON EVERY 6-8K MILES.  THEY GAVE ME PRORATED CREDIT BASED ON TREAD DEPTH REMAINING.  50% FOR TWO AND 25% FOR THE OTHER TWO CREDIT.  MILEAGE IS AT 32K.  THEY ALSO EXPLAINED THAT WE SHOULD NOT DRIVE ON THEM UNTIL REPLACED.  OF COURSE I REPLACED THEM WITH ANOTHER MODEL OF GOODYEAR.  I WAS CONCERNED THAT MY WIFE AND KIDS WOULD BE KILLED IN AN ACCIDENT (WIFE'S CAR).  BIG O TIRE ALSO STATED THEY HAVE HEARD OF TREAD SEPARATION ON THESE EXACT TIRES, THE LS MODEL, ON OTHER VANS.  I DEMAND THAT BOTH GOODYEAR AND OLDSMOBILE SHOULD ADDRESS THIS SITUATION FOR A RECALL.  IN ADDITION, FULL REIMBURSEMENT IS NECESSARY FOR REPLACEMENT.  THIS NEEDS TO BE ADDRESSED IMMEDIATELY TO PREVENT POSSIBLE INJURY AND/OR DEATH.  *NM",
        "vin": "1GHDX03EX4D"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/21/2005",
        "dateOfIncident": "09/17/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10137234,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TOOK CAR TO BE SERVICED.  TECHS SAW THE TIRE SEPARATION AND STATED IT WAS VERY DANGEROUS AND NOT TO DRIVE ON THEM.  REPORTED TO DEALERSHIP&GMAC. GOODYEAR AND FIRESTONE DEALERS SAY IT WAS TREAD SEPERATION DUE TO FAULTY MANUFACTURING.  TIRES ARE GOODYEAR P225/60R16    .....  BOTH FRONT TIRES ARE SEPARATING ON THE INSIDE.  DEALERSHIP BLAMED IT ON NONROTATION (I DO THAT MYSELF SO NO RECORDS.)  WHEN THAT DIDNT WORK THEY TRIED TO BLAME IT ON BAD ALLIGNMENT.  THIS ALSO WAS NOT THE CASE.    THE CAR STAYED SATURDAY NIGHT AND SUNDAY AT THE DEALERSHIP AFTER THEY SO THOUGHTFULLY LENT US A SAFE VEHICLE AFTER THREATENING TO HAVE US ARRESTED FOR REFUSING TO DRIVE THE UNSAFE VEHICLE THAT WAS STILL UNDER WARRANTY.  I ARRIVED APPX 7 AM AT THE DEALERSHIP AND THEY LOOKED AT THE TIRES AND STATED IT WAS OUR FAULT AND THEY ONLY COVER TIRES FOR 7500 MILES.  THEY ALSO DID SOME OTHER WARRANTY AND RECALL WORK.  I DID NOT LET THEM TOUCH THE TIRES OR ALLIGNMENT BECAUSE OF THEY HAVE A HABIT OF ACTING IN ILL WILL AND I DO NOT TRUST THEM ANY LONGER.  MILEAGE OUT-24706  I DROVE TO THE NEAREST FIRESTONE DEALER (MILELAGE IN 24708 TIME 8:49 AM) AND EXPLAINED TO THEM THE SITUATION.  THEY PULLED THE TIRES OFF AND SAID IT LOOKED LIKE FAULTY TIRES.  I BOUGHT NEW ONES BECAUSE THE OLD ONES WERE TOO DANGEROUS TO DRIVE ON AND THE DEALERSHIP WASN'T GOING TO DO THE RIGHT THING ANY TIME SOON.  FIRESTONE CHECKED THE ALLIGNMENT.  DATA WAS AS FOLLOWS: LF CAMBER -0.6, RF CAMBER -1.0, CROSS CAMBER .4, LF CASTER 2.9, RF CASTER 2.9, CROSS CASTER -0.1,   (ALL WITHIN SPEC) LF TOE .18, RF TOE .11, TOTAL TOE .29 (MINORLY OUT OF SPEC...BUT POSITIVE TOE WOULD HAVE CAUSED WEAR ON THE OUTSIDE OF THE TIRES AND WAS VERY OBVIOUS TO ANYONE WITHIN 10 FEET THAT THERE WAS SOMETHING WRONG WITH THEM.  TIRES FAILED ON THE INSIDE UNDER THE CAR AND ITS POSSIBLE THEY COULD HAVE KILLED US ALL BEFORE WE EVER NOTICED THEM)  WE STILL HAVE THE FRONT TIRES IF YOU NEED THEM.    (TYPED BY WIFE)",
        "vin": "1GHDX13E84D"
    },
    {
        "components": "PARKING BRAKE",
        "crash": true,
        "dateComplaintFiled": "07/18/2005",
        "dateOfIncident": "07/15/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10129080,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: LAST WEEK WHILE IN PARK THE VEHICLE ROLLED BACKWARDS. THE VEHICLE WAS PARKED ON FLAT GROUND.  THE CAR WAS PARKED OUTSIDE OF HOME.THERE ARE NO WARNING LIGHTS TO INDICATE A PROBLEM. THE VEHICLE ROLLED DOWN AND IMBANKMENT.THE PARKING BRAKE WAS NOT SET. . IT SHOWED THAT THE VEHICLE WAS STILL IN PARK WHEN THE OWNER GOT BACK IN IT. THERE WAS DAMAGE TO THE VEHICLE. THE DEALERSHIP WAS CONTACTED, WHO WAS CONSULTING GM TO SEE IF THEY WERE ABLE TO WORK WITH OWNER.  OWNER HAS NOT SPOKEN WITH GM. THE OWNER IWAS NOT AWARE OF WHETHER OR NOT THERE WILL BE COSTS INCURRED BY THIS INCIDENT.  OWNER FOUND AN OLD RECALL ON INTERNET, BUT HAS ALREADY CHECKED, AND THERE WAS NO RECALL ON THIS VEHICLE. THE OLD RECALL NUMBER WAS NOT AVAILABLE.*AJK",
        "vin": "1GHDX13E74D"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "09/14/2004",
        "dateOfIncident": "09/12/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10091004,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REMOVABLE REAR BACK SEATS LOCKING MECHANISIM IN THE 2004 OLDSMOBILE SILHOUETTE VAN HAS CAUGHT MY FINGER INCURING SEVERAL THOUSAND DOLLARS IN MEDICAL FEES.    THE UNDERCARRIGE MOVES BACKWARD  WHEN THE FRONT BRACKET IS ENGAGED AND EASILY PINCHES A HAND OR FINGER.APPEARS TO BE A  DESIGN FAIURE.I'D LIKE TO KNOW IF OTHERS HAVE HAD THE SAME EXPERIENCE.PLS ADVISE KIM JACKSON",
        "vin": ""
    }
]