[
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "04/09/2005",
        "dateOfIncident": "04/03/2005",
        "fire": false,
        "manufacturer": "Winnebago Industries, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10116666,
        "products": [
            {
                "manufacturer": "Winnebago Industries, Inc.",
                "productMake": "RIALTA",
                "productModel": "RIALTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE IS A 2004 RIALTA MOTOR HOME.  THE REAR PORTION IS MANUFACTURED BY WINNEBAGO AND THE FRONT BY VOLKSWAGEN.  THE PROBLEM CONCERNS THE FRONT PASSENGER SIDE SEAT BELT (SUPPOSEDLY A VW RESPONSIBILTY).  IT CONSATNTLT CONTRACTS CREATING AN IMPOSSIBLE SITUATION FOR THE WEARER.  THREE ATTEMPTS AT HAVING VW FIX THIS HAVE RESULTED IN THEIR FINAL POSITION THAQT THIS IS THE WAY IT WAS DESIGNED, AND THAT I'LL HAVE TO LIVE WITH IT.  HOWEVER IT WORKS LIKE NO OTHER SEAT BELT IN THE VEHICLE OR ANY OTHER THAT I HAVE EVER EXPERIENCED IN ANY OTHER VEHICLE.  REPEATED ATTEMPTS TO VERIFY THIS \"DESIGN\" SITUATION WITH VW OF AMERICA HAVE MET WITH NO RESPONSE.  IF UNCHANGED, THIS SITUATION CREATES A POTENTIAL SAFETY HAZARD AND DISCOURAGES COMPIANCE WITH LOCAL SEAT BELT REQUIREMENTS.*AK",
        "vin": "WV3AB470X3H"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "12/13/2004",
        "dateOfIncident": "04/19/2004",
        "fire": false,
        "manufacturer": "Winnebago Industries, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10107174,
        "products": [
            {
                "manufacturer": "Winnebago Industries, Inc.",
                "productMake": "RIALTA",
                "productModel": "RIALTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "CLASS C RV REAR VEIW MIRRORS WERE FOUND INADEQUATE TO SEE  REAR OF THE VEHICLE. MIRRORS ORIGINALLY DESIGNED FOR <A ONMOUSEOUT=\"WINDOW.STATUS=''; RETURN TRUE;\">VW EUROVAN</A>, WHICH IS MUCH SMALLER IN LENGTH AND WIDTH.  *BF   WINNEBAGO INDUSTRIES DECLINED TO REPLACE THE MIRRORS WITH A DIFFERENT STYLE MIRROR.   THERE IS A BLIND SPOT IN THE DRIVER SIDE MIRROR WHICH HIDES A VEHICLE PARALLEL AND TO THE LEFT.  THE CONSUMER STATED THAT THERE IS NO SEAT ADJUSTMENT TO COMPENSATE FOR MIRROR PLACEMENT AND MIRROR ADJUSTMENTS  DO NOT CORRECT THE PROBLEM.  THE DRIVERS SIDE REAR VIEW MIRROR IS MOUNTED HORIZONTALLY AND REQUIRES A DOWNWARD AND SIDEWARD MOVEMENT OF THE CONSUMERS HEAD TO FACILITATE AN ADEQUATE VIEW TO THE REAR.  THE CONSUMER SUGGESTS LARGER SIZED VERTICAL MIRRORS WOULD FIX THE PROBLEM.  *TC",
        "vin": "WV3AB47083H"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "01/23/2004",
        "dateOfIncident": "01/09/2004",
        "fire": false,
        "manufacturer": "Winnebago Industries, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10057160,
        "products": [
            {
                "manufacturer": "Winnebago Industries, Inc.",
                "productMake": "RIALTA",
                "productModel": "RIALTA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "PROBLEMS WITH THE PROPANE FURNACE, WHICH IS FAULTY AND QUITS WORKING FREQUENTLY.   *PH  THE VEHICLE HAS BEEN TAKEN TO THE DEALER SIX TIMES BUT THEY HAVE BEEN UNABLE TO REPAIR THE VEHICLE.  THE CONSUMER IS ESPECIALLY CONCERNED BECAUSE HE LIVES AND SLEEPS IN THE VEHICLE DURING THE WEEK.   *NM",
        "vin": "WV3AB47043H"
    }
]