[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/14/2005",
        "dateOfIncident": "07/31/2005",
        "fire": false,
        "manufacturer": "RAGEN INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10136993,
        "products": [
            {
                "manufacturer": "RAGEN INC.",
                "productMake": "RAGE'N",
                "productModel": "TRAILER",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "DT: THE CONSUMER  PURCHASED A NEW RAGE'N TOY HAULER TRAILER WITH CARLISLE TIRES THAT EXPERIENCED THREE BLOW OUTS.  THE TIRES DID NOT SHOW ANY KIND OF WEAR.  WHILE DRIVING AT APPROXIMATELY 55 MPH ON THE INTERSTATE THE REAR PASSENGER SIDE TIRE BLEW OUT WITH COMPLETE TREAD SEPARATION.  THE TRAILER SUSTAINED  SOME DAMAGE. THE OTHER TWO TIRES BLEW OUT LATER ON THE SAME TRIP WITHOUT WARNING AND IN A SIMILAR FASHION.  BEFORE THE TRIP, THE CONSUMER CHECKED TIRE PRESSURE AND THE TRAILER HAD ADEQUATE WEIGHT LOAD.  THIS OCCURRED ON A SUNDAY EVENING AND  A TIRE SERVICE CAME OUT TO REPLACE THE TIRES WITH SPARES.  ONCE THE SPARES WERE REPLACED THE CONSUMER DROVE THE TRAILER TO A TIRE SERVICE SHOP AND LEFT IT FOR FURTHER INSPECTION.  THE TIRE DEALER SAID THE TIRES WERE IN PERFECT SHAPE, AND THEY SHOULD HAVE NOT EXPERIENCED A TREAD SEPARATION.  THE CARLISLE TIRE MANUFACTURER WAS CONTACTED , AND THEY REQUESTED ADDITIONAL INFORMATION, SUCH AS THE BLOWN TIRES AS WELL AS THE REMAINING TIRE.  IN THE REPAIR SHOP, THERE WERE OTHER TRAILERS WITH THE SAME TIRES AND THE SAME PROBLEMS.  THE CONSUMER REPLACED THE TIRES WITH A DIFFERENT BRAND OUT OF POCKET. CARLISLE,  LT235/85/16 LOAD RATED D. *AK   CARLISLE TIRE.*JB",
        "vin": "4KZFR302141"
    }
]