[
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/03/2014",
        "dateOfIncident": "03/18/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10608119,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE OWNED A 2004 SAAB 9-5 SPORT COMBI WAGON SINCE 2006. TWICE, OVER THE LAST SEVERAL YEARS (2011, 2014), MY HUSBAND AND I HAVE BEEN ON THE HIGHWAY AND HAD AN IGNITION SWITCH INCIDENT WHERE HE WAS THE DRIVER AND I WAS THE PASSENGER. IN BOTH INCIDENTS, I TURNED AROUND TO TALK TO MY DAUGHTER (2011) AND THEN DAUGHTERS (2014) AND INADVERTENTLY BUMPED THE  KEY IN THE IGNITION WITH MY KNEE. THE IGNITION SWITCH IS LOCATED IN THE CENTER OF THE CAR BY THE CONSOLE. IT ONLY TOOK A SLIGHT TAP OF MY KNEE AND MY CAR SHUT OFF WHILE GOING AT SPEEDS OF 75-80 MPH ON THE HIGHWAY. FORTUNATELY, BOTH TIMES MY HUSBAND WAS ABLE TO PUT THE CAR INTO NEUTRAL AND GET THE CAR OFF TO THE SIDE OF THE ROAD.   *TR",
        "vin": "YS3ED59A143"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/02/2014",
        "dateOfIncident": "05/11/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10586152,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 SABB 9-5. THE CONTACT STATED THAT WHILE DRIVING 75 MPH, THE VEHICLE STALLED WITHOUT WARNING.  THE CONTACT WAS ABLE TO RESTART THE VEHICLE AND TOOK IT TO THE DEALER FOR INSPECTION OF THE FAILURE WHERE THE TECHNICIAN REPLACED THE IGNITION MODULE. THE CONTACT WAS MADE AWARE OF A MANUFACTURER'S RECALL FOR THE IGNITION SWITCH BUT WAS ADVISED THAT THE VEHICLE WAS NOT INCLUDED. THE MANUFACTURER WAS CONTACTED. THE APPROXIMATE FAILURE MILEAGE WAS 64,000.  UPDATED 10/23/2014*LJ    THE CONSUMER STATED THE CHECK ENGINE AND NO AUTOMATIC WARNING LIGHTS WOULD ILLUMINATE ON FREQUENTLY.   UPDATED 8/10/2015*JS",
        "vin": "YS3ED49A343"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/14/2014",
        "dateOfIncident": "03/14/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10569393,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 SAAB 9-5. THE CONTACT STATED THAT WHILE TRAVELING VARIOUS SPEEDS, THE VEHICLE SUDDENLY STALLED. THE VEHICLE WAS TAKEN TO A PRIVATE MECHANIC WHERE IT WAS FOUND THAT THE CRANK SHAFT POSITION SENSOR, FUEL PUMP, AND THE TWICE UNIT NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED BUT THE FAILURE RECURRED. THE MANUFACTURER WAS NOT CONTACTED ABOUT THE FAILURE. THE FAILURE MILEAGE WAS 51,108.",
        "vin": "YS3EB55EX43"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/06/2014",
        "dateOfIncident": "03/01/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10567631,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS 2004 SAAB 9-5. THE CONTACT STATED THAT SHE WAS TRAVELING 55 MPH WITH HER PURSE ON THE PASSENGER'S SIDE SEAT. THE CONTACT PROCEEDED TO EXIT THE HIGHWAY WHEN THE WATER BOTTLE THAT WAS IN HER PURSE TOPPLED OVER AND STRUCK THE IGNITION SWITCH, CAUSING THE VEHICLE TO STALL. THE VEHICLE WAS NOT TAKEN TO THE DEALER FOR INSPECTION OR REPAIRS. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VIN WAS NOT AVAILABLE. THE FAILURE AND CURRENT MILEAGE WAS 95,000.  *TR",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "04/10/2013",
        "dateOfIncident": "03/27/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10505800,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Kumho Tire Co., Inc.",
                "productMake": "KUMHO",
                "productModel": "ECSTA LX",
                "productYear": "9999",
                "size": "225/45ZR17",
                "type": "Tire"
            }
        ],
        "summary": "KUMHO ECSTA LX PLATINUM 225/45ZR17 TIRE ON LEFT FRONT OF SAAB 9-5 WITH APPROXIMATELY 25,000 MILES USE BLEW OUT SUDDENLY (RAPID LOSS OF AIR) AND WITHOUT WARNING AT 35 MPH.  APPEARS TO HAVE SEVERAL CRACKS IN SIDEWALL NEAR TREAD.  PRIOR TO BLOWOUT, SLIGHT LEFT PULL IN CAR STEERING WAS NOTED DURING INTERSTATE DRIVING, BUT ASSUMED TO BE ALIGNMENT ISSUE SINCE ALL TIRES MAINTAINED NORMAL PRESSURE.  TIRE WAS REPLACED; DEALER DETERMINED TIRE WAS DEFECTIVE (POSSIBLE INTERNAL BELT SLIP).  FAILED TIRE IS AVAILABLE FROM OWNER.  *TR",
        "vin": "YS3EH49G443"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/26/2011",
        "dateOfIncident": "08/26/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10421659,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "A RECALL WAS PREVIOUSLY ISSUED FOR SAAB DIRECT IGNITION CASSETTE FAILURES  FOR MODEL YEARS 2000 THROUGH 2002.  MY 2004 SAAB 9-5 ARC, WHICH HAS 46,180 MILES ON IT, HAD TO HAVE THE DI CASSETTE REPLACED TODAY DUE TO FAILURE.  MY MODEL YEAR SHOULD HAVE BEEN INCLUDED IN THIS RECALL DUE TO THE LIMITED (LESS THAN REASONABLE) LIFE OF THE PART.  *TT",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/15/2010",
        "dateOfIncident": "11/22/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10355728,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2004 SAAB 9-5. THE CONTACT STATED THAT WHEN DRIVING ON THE HIGHWAY, THE VEHICLE WOULD SUDDENLY SHUT DOWN COMPLETELY. THE ENGINE AND ELECTRICAL SYSTEMS WOULD TURN OFF COMPLETELY. THE FAILURE OCCURRED SEVERAL TIMES. THE VEHICLE WAS ABLE TO BE IMMEDIATELY RESTARTED WHEN THE FAILURE OCCURRED. THE VEHICLE WAS INSPECTED BY AN INDEPENDENT MECHANIC WHO STATED THAT THE IGNITION SWITCH WAS MOST LIKELY THE CAUSE FOR FAILURE. THE VEHICLE HAD NOT BEEN REPAIRED. THE CONTACT CALLED THE MANUFACTURER WHO OFFERED NO ASSISTANCE. THE CURRENT MILEAGE WAS APPROXIMATELY 74,00. THE FAILURE MILEAGE WAS APPROXIMATELY 60,000.    UPDATED 12/30/10  *BF  UPDATED 01/10/11*JB  UPDATED 3/31/14*CN",
        "vin": "YS3EB55E043"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/17/2010",
        "dateOfIncident": "12/20/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10300083,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 SAAB 95 LINEAR WAGON LIFTGATE HINGE FAILURE  HINGE MAY OR MAY NOT HOLD THE LIFTGATE AT THE OPEN POSITION.  IF ONE IS REACHING DEEP INTO THE TRUNK, LIFTGATE CAN CLOSE BY ITSELF, AND HIT ON THE BACK WITH SUBSTANTIAL FORCE. *TR",
        "vin": "YS3EB59E543"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/15/2008",
        "dateOfIncident": "07/15/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10245621,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED THE CAR USED 5/23/08 WITH 42,700 MILES FROM SAAB DEALERSHIP. WITHIN A MONTH THE HEADLIGHTS WORKED RANDOMLY, CHECK ENGINE LIGHT WOULD COME ON RANDOMLY. CALLED THE DEALERSHIP AND WAS TOLD THAT IT WOULDN'T HURT ANYTHING AND SHOULD IT BECOME MORE FREQUENT, BRING THE CAR IN. 8/18 TOOK THE CAR IN TO DEALERSHIP WHEN THE LIGHT WAS COMING ON MORE FREQUENTLY. HEADLIGHT RELAY REPLACED, ENGINE LIGHT WAS DUE TO A DIRECT IGNITION CASSETTE FAILURE. SAAB DEALERSHIP ORDERED THE PART WHICH WAS ON NATIONAL BACK ORDER, PART CAME IN 10/9. VEHICLE WAS TAKEN IN 10/6 DUE TO STEAM COMING FROM UNDER THE HOOD, TEMPERATURE GAUGE NEVER MOVED ABOVE THE MIDDLE. BYPASS VALVE REPLACED ($450 PARTS/LABOR). VEHICLE HAS APPROX. 48,500 MILES AND IS OUT OF MANUFACTURER WARRANTY AND REPAIR IS NOT COVERED UNDER DEALERSHIPS LIMITED WARRANTY. AFTER AN INTERNET SEARCH FOR INFORMATION RELATING TO THE DI CASSETTE FAILURE I FOUND THAT THERE WAS A RECALL FOR 2000-2002 MODELS FOR THE SAME ISSUE. MY VEHICLE IS A 2004 SAAB 9.5 AERO SEDAN. *TR",
        "vin": "YS3EH49G643"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/09/2008",
        "dateOfIncident": "07/30/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10237522,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2004 SAAB 9-5 WAGON, WHICH WAS PURCHASED IN NOV 2004.  THERE WERE APPROXIMATELY 31,800 MILES ON THE CAR AT THE TIME OF THIS FAILURE, WHICH OCCURRED IN LATE JULY 2008.  (IRONICALLY, LESS THAN 2 WEEKS AFTER HAVING TAKEN THE CAR FOR ROUTINE SERVICE/OIL CHANGE/TIRE ROTATION.)  AFTER HAVING RUN 2 ERRANDS (I.E. TWO STOPS & STARTS), I WAS DRIVING TO WORK ON A RELATIVELY BUSY 4-LANE ROAD.  JUST AFTER HAVING COME DOWN A HILL & ROUNDING A CORNER, WITH ESTIMATED SPEED 35MPH, THE CAR'S ENGINE CUT OUT, THE POWER STEERING WENT OUT, & THE BRAKES SEEMED NOT TO WORK APPROPRIATELY.  I WAS FORTUNATE TO BE IN THE RIGHT LANE, AND WOUND UP COASTING TO A STOP IN THE LANE OF TRAFFIC, AS I HAD SO LITTLE CONTROL OF THE VEHICLE THAT I WAS NOT EVEN ABLE TO MOVE TO WHAT LITTLE SHOULDER WAS AVAILABLE (THE VEHICLE FINALLY STOPPED WHILE ON A BRIDGE).  THE VEHICLE WOULD NOT RESTART.   FORTUNATELY, TRAFFIC BEHIND ME BECAME AWARE THAT THE CAR HAD DIED, AND NO ACCIDENTS OCCURRED.  HAD THIS FAILURE OCCURRED EVEN 5 OR 10 SECONDS EARLIER, HOWEVER, IT WOULD ALMOST UNDOUBTEDLY HAVE CAUSED AN ACCIDENT AS I WOULD HAVE BEEN COMPLETELY UNABLE TO NAVIGATE THE TURN COMING DOWNHILL.  AFTER HAVING THE VEHICLE TOWED TO THE SAAB DEALERSHIP, IT WAS DISCOVERED THAT THE \"CRANK SENSOR FAILED ELECTRICALLY.\"  FORTUNATELY, IT WAS STILL UNDER WARRANTY & WAS REPLACED.  I WOULD NOT HAVE EVEN THOUGHT TO REPORT THIS HAD I NOT SEEN REPORTS OF SIMILAR FAILURES IN OTHER SAAB MODELS. *TR",
        "vin": "YS3EB59E943"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/22/2006",
        "dateOfIncident": "08/22/2006",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10166216,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2004 SAAB 9.5 THAT I BOUGHT NEW ON APRIL 1, 2004.  I DISCOVERED TODAY FOR THE FIRST TIME THAT MY BACKUP LIGHTS ARE NOT WORKING. YESTERDAY, I FILED A COMPLAINT #10166145.  THIS BACK UP LIGHT PROBLEM IS RELATED.  THE HARD PLASTIC MOLDED ASSEMBLY ON THE DRIVERS SIDE OF THE TRUNK LID THAT IS SUPPOSED TO PROTECT THE WIRING HARNESS FROM DAMAGE IS ACTUALLY DAMAGING AND EVENTUALLY CUTTING THROUGH ALL OF THE WIRES THAT PASS THROUGH THE ASSEMBLY.  WIRES IN MY CAR BEGAN GETTING CUT WITHIN 2 MONTHS OF PURCHASE AND HAVE CONTINUED.  THIS ASSEMBLY APPEARS TO BE ABLE TO CUT THROUGH ABOUT 8 WIRES LEAVING EXPOSED WIRE IN CONTACT WITH EACH OTHER AND THEREBY DISABLING THE CRUISE CONTROL, BRAKE LIGHTS, REVERSE LIGHTS AND ELECTRIC TRUNK LOCK.  THIS IS NOT NORMAL WEAR AND TEAR - ITS A DESIGN FAULT. THE WIRES SEEM TO CATCH ON THE SHARP EDGE OF THE PLASTIC PROTECTOR (!) THAT FITS INTO THE LID. THEY RUB AGAINST THIS AS THE LID IS OPEN AND CLOSED.   I BELIEVE THIS SITUATION PRESENTS A POTENTIAL ELECTRICAL FIRE HAZARD AND SAFETY HAZARD AND THAT THE NHTSA SHOULD IMMEDIATELY ISSUE A RECALL ON THIS ITEM.  *NM",
        "vin": "YS3ED45A743"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/21/2006",
        "dateOfIncident": "08/21/2006",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10166145,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2004 SAAB 9.5 THAT I BOUGHT NEW ON APRIL 1, 2004.  FROM DAY 1 THE CRUISE CONTROL WAS WORKING ERRATICALLY. DEALER SAID HE COULD NOT REPLICATE PROBLEM.  THEN CRUISE CONTROL STOPPED WORKING.  THEN THE ELECTRIC TRUNK LOCK STOPPED WORKING.  I CONTACTED THE DEALER TELLING IT THAT EVEN THOUGH I WAS NOW BEYOND THE 50,000 MILE PORTION OF THE 4 YEAR WARRANTY (OF WHICH ONLY 28 MONTHS HAD ELAPSED) I WANTED THE TRUNK AND CRUISE ISSUES FIXED ALONG WITH A LAUNDRY LIST OF ITEMS THAT WERE NOT ADDRESSED PREVIOUSLY THE LAST TIME I BROUGHT THE CAR IN UNDER WARRANTY.  THEY HAVE REFUSED TO ADDRESS ANY OF THE ISSUES.  I FOUND A SITE ON THE INTERNET CALLED SAABNET.  A PARTICULAR POST HIT THE PROBLEM ON THE HEAD.  HTTP://WWW.SAABNET.COM/TSN/BB/9-5/INDEX.HTML?BID=125557  IT SAID:  TURNS OUT TO BE A BADLY WORN WIRING LOOM WERE THE CABLES RUN FROM THE CAR TRUNK INTO THE TRUNK LID. 6 WIRES HAD BROKEN THROUGH THE INSULATION AND TWO HAD COMPLETELY SNAPPED. THIS CAR IS LESS THAN 3 YEARS OLD!!!! THIS IS NOT NORMAL WEAR AND TEAR - ITS A DESIGN FAULT. THE WIRES SEEM TO CATCH ON THE SHARP EDGE OF THE PLASTIC PROTECTOR (!) THAT FITS INTO THE LID. THEY RUB AGAINST THIS AS THE LID IS OPEN AND CLOSED. YOU CAN CHECK TO SEE IF YOURS IS OK SIMPLY BY PULLING OFF THE PROTECTIVE RUBBER BOOT THAT ATTACHES TO THE END OF THE PLASTIC PROTECTOR.  I DID THE VERY SIMPLE CHECK THE POSTER RECOMMENDED ABOVE BY PULLING THE RUBBER COVER BACK AND WAS SOMEWHAT AMAZED TO SEE 4 WIRES COMPLETELY CUT AND THE OTHER 3 WITH BROKEN INSULATORS.  AS THE POSTER ON SAABNET INDICATED, THIS IS A DESIGN FLAW AND APPEARS AS IF IT COULD LEAD TO FIRE.   LOOKING FURTHER ON SAABNET, I SEE THAT MANY PEOPLE HAVE HAD THIS PROBLEM AS IT IS DISCUSSED QUITE FREQUENTLY.  I BELIEVE THIS SITUATION PRESENTS A POTENTIAL ELECTRICAL AND FIRE HAZARD AND THAT THE NHTSA SHOULD IMMEDIATELY ISSUE A RECALL ON THIS ITEM.  *NM",
        "vin": "YS3ED45A743"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/19/2006",
        "dateOfIncident": "04/14/2006",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10155724,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE WAS DRIVING OUR 2004 SAAB 9-5 WAGON  AT OR AROUND 35 MPH WHEN THE CAR, SUDDENLY AND WITHOUT WARNING, LOST ITS ELECTRICAL POWER.  SHE WAS UNABLE TO STEER, BRAKE OR CONTROL THE VEHICLE IN ANYWAY. ALL OF THE LIGHTS WERE ILLUMINATED ON THE DRIVER'S PANEL.  LUCKILY, THERE WAS NO ON-COMING TRAFFIC OR ANY VEHICLE FOLLOWING BEHIND HER BECAUSE SHE WAS APPROACHING A CURVE IN THE  ROAD AT THE TIME THE CAR FAILED.  SHE COASTED STRAIGHT AHEAD, THROUGH THE CURVE, TO A STOP.  SHE TURNED THE CAR OFF, THEN RESTARTED THE CAR.  WE CALLED THE DEALERSHIP THE NEXT DAY, AND RETURNED THE CAR A COUPLE OF DAYS LATER.   WE NOTIFIED SAAB USA THAT WE NO LONGER FELT SAFE IN OUR VEHICLE AND HAVE LOST FAITH IN THE LINE AS A WHOLE.    THIS INCIDENT WAS NOT THE FIRST ONE.  WE EXPERIENCED THIS SAME ELECTRICAL POWER LOSS TWICE PREVIOUSLY IN OUR 2001 SAAB 9-5 WAGON.  WE HAD THOUGHT IT WAS A PROBLEM UNIQUE TO OUR SPECIFIC CAR, BUT WE NOW BELIEVE  THAT THE SAAB 9-5 WAGON PRESENTS A SERIOUS SAFETY CONCERN TO THE GENERAL PUBLIC, IN OUR OPINION.  WE REGRET THAT WE DID NOT THINK TO REPORT THE PREVIOUS INCIDENTS IN THE 2001 MODEL TO NHTSA. WE DID, HOWEVER, ALERT THE DEALERSHIP, WHO COULD NOT FIND ANY EXPLANATION FOR THE POWER LOSS.  WE DECIDED NOT TO KEEP THE 2001 MODEL WHEN OUR LEASE WAS UP, FOR THAT VERY REASON.  WE FELT COMFORTABLE DRIVING A NEW 2004 SAAB, BECAUSE SURELY THIS PROBLEM ONLY EXISTED IN OUR ONE CAR, RIGHT?  THE \"WHAT-IF'S\" FOR THESE ELECTRICAL POWER FAILURES ARE SCARY AND UNTHINKABLE.  WHAT IF WE HAD BEEN TRAVELING AT HIGHWAY SPEED? WHAT IF THERE WERE PEDESTRIANS IN OUR LINE OF STEERING AT THE TIME?  WHAT IF WE WERE TURNING LEFT AT A MAJOR INTERSECTION?    WE'VE HAD THIS FRIGHTENING EXPERIENCE THREE TIMES IN TWO DIFFERENT MODEL YEARS OF THE SAME CAR.  WE WILL NO LONGER BE SAAB CUSTOMERS.  SAAB SHOULD RECALL ALL 9-5 WAGONS BEFORE A FATAL ACCIDENT OCCURS AS A RESULT OF THIS POWER FAILURE. *JB",
        "vin": "YS3EB59E243"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/25/2005",
        "dateOfIncident": "05/18/2004",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10129885,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "ON NUMEROUS OCCASIONS, OUR 2004 SAAB 95 WOULD NOT START.  LATER IT WOULD START.  SAAB REFUSES TO ACKNOWLEDGE THERE IS A PROBLEM.  NOTHING HAS BEEN DONE.  THERE HAVE BEEN 5 INSTANCES BEGINNING IN MAY OF 2004.",
        "vin": "YS3ED49A043"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/07/2005",
        "dateOfIncident": "01/01/2005",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10112654,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING OUR 2004 SAAB 9-5 ON THE HIGHWAY, AT OVER 60 MPH, THE IGNITION HAS BEEN ACCIDENTALLY TURNED OFF.  THIS CAUSES AN IMMEDIATE LOSS OF POWER STEERING AND POWER BRAKES, MAKING THE CAR VERY DIFFICULT TO STEER AND STOP.  LUCKILY I WAS IN THE FAR RIGHT LANE DURING BOTH INCIDENTS AND COULD PULL OVER AND STOP WITHOUT CAUSING AN ACCIDENT.  IF I HAD BEEN IN ANOTHER LANE, THE RESULTANT LOSS OF SPEED AND AN ATTEMPT TO CHANGE LANES COULD HAVE CAUSED AN ACCIDENT.  HE IGNITION KEY IS LOCATED ON THE CONSOLE BETWEEN THE TWO FRONT SEATS AND IS NOT PROTECTED NOR LOCKED IN ANY WAY TO SAFEGARD BUMPING THE KEY AND TURNING OFF THE IGNITION.  MY LOCAL DEALER HAS NO PARTS OR REPAIR TO CORRECT THE PROBLEM AND SAAB USA DOES NOT ACKNOWLEDGE THAT A PROBLEM EXISTS.*AK",
        "vin": "YS3EB59E443"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "02/24/2005",
        "dateOfIncident": "01/07/2005",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10112091,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Pirelli Tire, LLC",
                "productMake": "PIRELLI",
                "productModel": "P6",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "AFTER SIGNIFICANT VIBRATION UNDER FRONT END AT HIGHWAY SPEEDS APPEARING AT LESS THAN 10,000 MILES, CAR UNDERWENT ALIGNMENT AND 3 HIGH SPEED BALANCES. ACCORDING TO DEALERSHIP, \"ALL 4 TIRES WERE WORN ON INSIDES AND COULD ONLY BE CAUSED BY DEFECT.\" DEALER STATED THAT \"ROAD FORCING WILL NOT ALLOW TIRES TO BE WITHIN THE LIMIT. TIRES NEED TO BE REPLACED. SENT TIRES TO MANUFACTURER FOR WARRANTY.\" SERVICE COMPLETED ON 10.29.04, WITH PIRELLIS REPLACED BY SAME SIZE MICHELINS. WORK ORDER WAS COMPLETED ON 1.7.05, WHICH WAS THE FIRST TIME I SAW DETAILS AND CHARGES, DESPITE REPEATED REQUESTS SINCE 10.29.04. MY UNDERSTANDING, AND AUTHORIZATION AT THE TIME, WAS FOR THE PIRELLIS TO BE REPLACED BECAUSE OF THE DEFECTS, BUT WITH MICHELINS, TO AVOID POSSIBILITY OF DEFECTS WITH THE REPLACEMENT PIRELLIS, AT A COST OF UP TO $50 PER TIRE BECAUSE OF THE CHANGE. DEALER MAINTAINS I OWE $915. 82 FOR THE MICHELINS, LESS THE $212.80 CREDIT PIRELLI ISSUED ON 1.7.05. IRONICALLY, THE VIBRATION IN THE CAR CONTINUES WITH THE NEW MICHELINS. I DO NOT BELIEVE IT WAS THE INTENT OF THE DEALER TO MISLEAD ME, BUT THAT WAS THE RESULT. A WORK ORDER PROVIDED AT THE TIMES REQUESTED INSTEAD OF OVER TWO MONTHS LATER WOULD HAVE DEFINED THE AGREEMENT AND RESULTED IN A DIFFERENT COURSE OF ACTION.  *NM",
        "vin": "YS3ED49AX43"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/14/2004",
        "dateOfIncident": "07/27/2004",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10087691,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "BACK TAILGATE MOTOR BURNED OUT, AND THE TRUNK WAS NOT ACCESSIBLE.  THE SPARE TIRE AND OTHER ITEMS WERE IN THE TRUNK.*AK",
        "vin": "YS3EB59EX43"
    }
]