[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/15/2007",
        "dateOfIncident": "10/04/2007",
        "fire": false,
        "manufacturer": "4-Star Trailers, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10205786,
        "products": [
            {
                "manufacturer": "4-Star Trailers, Inc.",
                "productMake": "4-STAR TRAILERS",
                "productModel": "HORSE TRAILER",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "THE LR TIRE ON MY 5TH WHEEL FAILED. WHEN I ARRIVED AT MY CAMPGROUND FOR THE NIGHT, I NOTICED THE TREAD ON THAT TIRE WAS GONE AND THAT IT HAD RUPTURED THE LP GAS SUPPLY LINE FLEX HOSE TO MY SLIDE-OUT. THE TIRE STILL HAD THE FULL RATED PRESSURE OF 110 PSI IN IT, THAT IS WHY I DID NOT NOTICE THE FAILURE WHEN IT HAPPENED. I ESTIMATE THAT IT FAILED ABOUT 5 MILES BEFORE THE CAMPGROUND. I HAD THE SPARE INSTALLED IN ITS PLACE AND THE NEXT DAY I TOOK THE FAILED TIRE TO A LOCAL GOODYEAR DEALER (GLENN WOLDMAN, GOODYEAR SERVICE CENTER, MIDLOTHIAN, VA 23112, 804-739-5630).  HE CALLED GOODYEAR AT 800-321-2136 AND TALKED TO BETH.  SHE AUTHORIZED A REPLACEMENT AT NO COST TO ME. REF # A221005 APPLIES. I HAVE A DIGITAL PHOTO OF THE FAILED TIRE IF YOU WANT IT ? IF SO, JUST LET ME KNOW BY E-MAIL. THE TIRES ARE THE ORIGINALS THAT WERE ON THE RV WHEN I BOUGHT IT IN MAY OF 2005 FROM PETERSON IND. THE FAILED TIRE HAD AN ESTIMATED TREAD DEPTH OF 8/32? (BASED ON THE DEPTH OF THE RR TIRE TREAD). THE OTHER THREE TIRES AND THE SPARE ALL APPEAR TO BE OK. THE TIRES HAD LESS THAN 19,000 MILES ON THEM AND THAT THEY WERE PROPERLY MAINTAINED AND INFLATED. THE FAILED TIRE WAS BUILT IN THE 33RD WEEK OF 04, BUT THE OTHERS AND THE SPARE WERE BUILT LATER IN 04 (4204 AND 4604).  PLEASE NOTE THE ACTUAL MAKE AND MODEL OF MY RV IS AN EXCEL MODEL L35PKO WHICH IS MANUFACTURED BY PETERSON IND., SMITH CENTER, KS 66967.  SINCE THIS WAS NOT ONE OF THE CHOICES I HAD TO SELECT FROM IN THE LIST OF VEHICLES, I CHOSE THE 1ST ONE ON THE LIST SO I COULD PROCEED. PLEASE DISREGARD ANY REFERENCE TO THE 4-STAR HORSE TRAILER IN THE VEHICLE PORTION OF THE COMPLAINT. THE VIN, PURCHASE DATE AND THE MILEAGES ARE ALL CORRECT FOR MY ACTUAL RV IN THE COMPLAINT. ALSO, I BELIEVE THESE TIRES ARE DESIGNED SPECIFICALLY FOR RVS.  *JB",
        "vin": "1P9RF352351"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,TRAILER HITCHES,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "01/29/2007",
        "dateOfIncident": "12/15/2006",
        "fire": false,
        "manufacturer": "4-Star Trailers, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10180974,
        "products": [
            {
                "manufacturer": "4-Star Trailers, Inc.",
                "productMake": "4-STAR TRAILERS",
                "productModel": "HORSE TRAILER",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "ACCURIDE CORPORATION",
                "productMake": "ACCURIDE",
                "productModel": "ACCURIDE",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "TL* - THE CONTACT HAD A 2005 BIG TEX TRAILER HITCHED TO A 1999 SUBURBAN 1500 WHEN  HE HAD TO STOP SUDDENLY.  THE BRAKES FAILED, AND THE TRAILER WOULD NOT STOP. HOWEVER, THE TRAILER EVENTUALLY STOPPED, THERE WERE NO INJURIES.  THE FAILURE MILEAGE WAS APPROXIMATELY 500 MILES.  THE CONTACT LOOKED UNDER THE VEHICLE AND DISCOVERED THE RUBBER BRAKE LINE SHEARED OFF.   THE DEALER REPLACED THE BRAKE LINE.  APPROXIMATELY 6- 8 MONTHS LATER,  THE BRAKE LINE HAD TO BE REPLACED BECAUSE OF THE SAME PROBLEM WITH THE BRAKES.  THE CONTACT STATED THE SAFETY LATCH ON THE TRAILER KEPT COMING LOOSE.  THE DEALER SAID THEY WOULD REPLACE THE LATCH, BUT THEY HAVE NOT DONE SO.  THE DEALER REPLACED THE BRAKE LINE ON THE TRAILER TWICE. *AK",
        "vin": "16VEX121352"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/01/2006",
        "dateOfIncident": "06/20/2006",
        "fire": false,
        "manufacturer": "4-Star Trailers, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10167223,
        "products": [
            {
                "manufacturer": "4-Star Trailers, Inc.",
                "productMake": "4-STAR TRAILERS",
                "productModel": "HORSE TRAILER",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE DRIVING 55 MPH, THE FRONT RIGHT TIRE ON THE APPALACHIAN 22 FOOT DECKOVER TRAILER DEFLATED WITHOUT WARNING.  UPON INSPECTION, THE RUBBER OF THE TIRE WAS PEELED AWAY FROM THE NYLON CORDS.  THE TIRE WAS CHANGED HOWEVER THE TRAILER WAS NOT TAKEN IN FOR SERVICE. THE TIRE WAS A KENDA USA LODESTAR.",
        "vin": "5NRHF22286S"
    }
]