[
    {
        "components": "SERVICE BRAKES, HYDRAULIC,VEHICLE SPEED CONTROL,EQUIPMENT ADAPTIVE/MOBILITY",
        "crash": false,
        "dateComplaintFiled": "06/26/2014",
        "dateOfIncident": "05/21/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10606131,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A8",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "ADAPTIVE MODULE J428 FAILED AND BRAKES SEIZED WHILE VEHICLE WAS IN MOTION..  AUDI CUSTOMER SERVICE SAID THAT SINCE THEY COULD NOT FIND A RECALL AND THE VEHICLE   WAS NINE YEARS OLD THEY THOUGHT IT WAS NOT THEIR PROBLEM.  I THINK THE PROBLEM  COULD HAVE E RESULTED IN A SERIOUS ACCIDENT AT HIGH SPEEDS AND COULD HAVE KILLED  ME.  I PAID FOR THE REPAIR BUT TOLD THEM THEY SHOULD CHECK INTO THE PROBLEM BECAUSE OF THE SAFETY ISSUE BUT DID NOT RECEIVE A POSITIVE RESPONSE. I FEEL THE PROBLEM SHOULD BE RESEARCHED AND I WOULD LIKE FEED BACK ON ANY INFORMATION  THAT WOULD RESULT FROM THE RESEARCH.  *TR",
        "vin": "WAUMR44E65N"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "01/22/2010",
        "dateOfIncident": "07/28/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10301865,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A8",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2005 AUDI A8L CONTAINS A DEFECT WHICH ALLOWS THE DRIVER'S FLOOR MAT TO POP OFF IT'S RESTRAINING/LOCATING PEGS ENABLING THE MAT TO MOVE FORWARD AND PUSH AND HOLD THE ACCELERATOR PEDAL DOWN, RESULTING RUNAWAY ACCELERATION,  THIS SEEMS TO BE A PROBLEM SIMILAR TO WHAT TOYOTA OWNERS HAVE EXPERIENCED AND FOR WHICH TOYOTA HAS INSTITUTED A LARGE RECALL.    THIS SITUATION HAS OCCURRED AT LEAST SEVEN TIMES TO THREE SEPARATE DRIVERS OVER THE PAST TWO YEARS.  AT THE FIRST OCCURRENCE TO EACH ME AND MY WIFE, WE WERE ABLE TO CONTROL THE ACCELERATION WITH THE BRAKE TO BUY SUFFICIENT TIME TO GATHER OUR WITS AND SHUT OFF THE ENGINE, THOUGH IT WAS SCARY.  NOW WE KNOW TO APPLY THE BRAKE AND PULL THE MAT BACK, REPLACING IT ON ITS PEGS ONCE WE STOP.    AFTER THE FIRST OCCASION, I TOOK THE VEHICLE TO MY LOCAL AUDI DEALER IN DANBURY, CONN.  THEY KEPT IT FOR THREE DAYS, HAD IT INSPECTED BY \"CORPORATE\" PEOPLE, AND IN WRITING CONCLUDED THAT EVERYTHING WAS \"OPERATING AS DESIGNED AND INTENDED.\"  THE SERVICE WRITER AT THE DANBURY AUDI DEALER TOLD ME THAT AUDI FELT THE PROBLEM WAS THE FLOOR MAT, AND SUGGESTED I PURCHASE HEAVY WINTER-TYPE MATS.    I RENEWED MY COMPLAINT TO AUDI IN THE FALL OF 2009 IN LIGHT OF THE TOYOTA ISSUE, BUT THEY AGAIN DENIED THERE WAS ANYTHING WRONG WITH THE VEHICLE.  BETWEEN THE FIRST AND SECOND COMPLAINT, WE EXPERIENCED AT LEAST FIVE MORE EPISODES OF RUNAWAY ACCELERATION CAUSED BY THE FLOOR MAT PUSHING AGAINST THE ACCELERATOR.  I TRY TO BE VIGILANT NOW EACH TIME I DRIVE THE CAR TO LOOK AT THE POSITION OF THE FLOOR MAT.   *TR",
        "vin": "WAUML44E45N"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/16/2007",
        "dateOfIncident": "11/15/2005",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10188022,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A8",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 AUDI A8.  WHILE DRIVING 70 MPH WITH THE CRUISE CONTROL ACTIVATED THE CONTACT HEARD A BELL SOUND AND THE CRUISE CONTROL FAILED.  THE VEHICLE DECELERATED,  BUT DID NOT SHUT OFF.  THE VEHICLE WAS TAKEN TO A DEALER APPROXIMATELY TEN TIMES, BUT THE CAUSE OF FAILURE  COULD NOT BE DETERMINED.  THE DEALER STATED THAT THE FAILURE  WAS A NORMAL CHARACTERISTIC OF THE VEHICLE.  THE VEHICLE HAS NOT BEEN REPAIRED.  THE CURRENT MILEAGE  WAS 23,800, AND FAILURE MILEAGE WAS 10,000.  *AK  UPDATE 05/04/07*TR",
        "vin": "WAULL44E75N"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/09/2007",
        "dateOfIncident": "10/07/2006",
        "fire": true,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10178167,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A8",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "OWNER WAS DRIVING THE AUDI HOME WHEN HE SMELLED SOMETHING BURNING. HE PULLED OVER AND OBSERVED A FIRE IN THE ENGINE COMPARTMENT. FIRE BURNED WITH GREATEST INTENSITY IN LOWER LEFT REAR OF ENGINE COMPARTMENT, FROM LOCATION OF LEFT SIDE CATALYTIC CONVERTER. SPARK PLUGS REMOVED FROM ENGINE SHOWED OVERFUELING PROBLEM IN #6 AND #8 CYLINDERS ON LEFT BANK, CAUSING CATALYTIC CONVERTER TO OVERHEAT AND START THE FIRE.  *NM",
        "vin": "WAUML44E15N"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/26/2006",
        "dateOfIncident": "09/09/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10169319,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A8",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED WHILE DRIVING 10 MPH AND PREPARING TO STOP AT A TRAFFIC LIGHT, THE STEERING WHEEL LOCKED, THE EMERGENCY BRAKE ENGAGED AND THE WARNING LIGHTS ON THE DASH ILLUMINATED.  THE VEHICLE WAS UNABLE TO BE MANEUVERED OFF THE ROAD AND WAS TOWED TO THE DEALER, WHO DETERMINED THE ENTIRE COMPUTER SYSTEM FAILED.  THE FAILURE WAS DUE TO LIQUID WHICH SPILLED IN THE BACK SEAT,  RAN DOWN INTO THE SEAT, AND CAME INTO CONTACT WITH THE TIRE PRESSURE MONITORING CONTROL MODULE.  THE DEALER REPLACED THE TIRE PRESSURE MONITORING CONTROL MODULE, STEERING WHEEL AND LOCK.    UPDATED 10/25/2006 - *NM",
        "vin": "WAUML44E85N"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES,VEHICLE SPEED CONTROL,TIRES",
        "crash": false,
        "dateComplaintFiled": "03/20/2006",
        "dateOfIncident": "03/20/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10153215,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A8",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE THE VEHICLE WAS TRAVELING 40 MPH THE ACCELERATOR PEDAL WAS RELEASED.  THE VEHICLE ACCELERATED ON ITS OWN.  THE BRAKE PEDAL WAS DEPRESSED AND THE VEHICLE STOPPED.  THE DEALERSHIP WAS UNABLE TO DETERMINE A PROBLEM.  A SECOND TIME, WHILE DRIVING 70 MPH, THE ACCELERATOR PEDAL WAS RELEASED AND THE VEHICLE ACCELERATED TO 100 MPH.  THE BRAKE PEDAL WAS APPLIED AND THE VEHICLE SLOWED TO 70 MPH THEN THE VEHICLE SPED UP AGAIN.  THE CONTACT USED THE PARKING BRAKE TO SLOW THE VEHICLE TO 45 MPH, AND THEN APPLIED BOTH FEET TO THE BRAKE PEDAL TO STOP THE VEHICLE.  ONCE AT A STOP, THE VEHICLE WAS PUT IN NEUTRAL AND THE RPM'S RED LINED.  THE VEHICLE WAS THEN PUT IN PARK AND THE ENGINE CONTINUED TO REV.  THE DEALERSHIP WAS CALLED TO TOW THE VEHICLE, BUT THERE WOULD BE AN HOUR WAIT.  THE CONTACT DROVE THE VEHICLE TO THE DEALERSHIP, BUT THE DEALERSHIP IS UNABLE TO DETERMINE A PROBLEM.  THE MANUFACTURER HAS SENT A REPRESENTATIVE FOR FURTHER INSPECTION.    UPDATED 4/11/2006 -  THE TIRE PRESSURE MONITORING SYSTEM WAS INOPERATIVE.  THE TRUNK FAILED INTERMITTENTLY.  *NM",
        "vin": "WAUML44E65N"
    }
]