[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/29/2021",
        "dateOfIncident": "08/29/2021",
        "fire": true,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430934,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "Small electric fire in driver side door panel melted all the way through outside door handle . After this happened to me I looked through forums and this seems to be a common issue with this car and there has been no recall for this issue . Very unsafe",
        "vin": "JH4KB16545C"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/04/2020",
        "dateOfIncident": "04/22/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327339,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE'S DASHBOARD GLOVE BOX IS DEFECTIVE.  I BELIEVE THIS HAPPENS TO MANY VEHICLES WHICH NO ONE BOTHERS TO REPORT.  MY GLOVE BOX, WHEN IT'S HOT OR THE SUN IS OUT, THE EXTERNAL LEATHER OR MATERIAL THAT IT IS MADE OF, SOFTENS AND DETERIORATED LIKE IT'S MELTED PLASTIC.  ANY CONTACT THE LEATHER HAS WITH ANYTHING, THE LEATHER IS DAMAGED EASILY AND INDENTED VERY BADLY WHERE IT'S UNABLE TO REPAIR BESIDES TAKING IT TO A PROFESSIONAL.  I'VE NOTICED MANY OTHER VEHICLES WITH THIS ISSUE, AND IT SEEMS TO BE A DEFECT I. THE VEHICLE WHICH IS OVERLOOKED TO BE RECALLED.  I'VE HAD MY SUNSHADE JUST TEMPORARILY LEFT TO LAY AGAINST THE GLOVE BOX IN THE SUN FOR ONLY A FEW MINUTES, AND THE LEATHER ON THE GLOVE BOX WAS INDENTED AND TORN FROM THE LIGHTWEIGHT SUNSHADE.  *TR",
        "vin": "JH4KB16505C"
    },
    {
        "components": "EXTERIOR LIGHTING,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/25/2020",
        "dateOfIncident": "01/20/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301852,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK AIRBAG SYSTEM LIGHT ON. CONNECTION TO HEADLIGHT DEFECTIVE, HEADLIGHT TURNS ON AND OFF RANDOMLY LIKE WHEN GOING OVER A BUMP, BUT TURNS BACK ON IF YOU TURN LIGHT OFF THEN ON AGAIN.",
        "vin": "JH4KB16565C"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/21/2019",
        "dateOfIncident": "11/09/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11281525,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2005 ACURA RL. THE CONTACT STATED THAT HER SON WAS DRIVING AND APPROACHED A CRASH THAT HAD ALREADY TAKEN PLACE. THE VICTIM OF THE CRASH WAS EJECTED FROM THE VEHICLE AND WAS LYING IN THE ROAD. THE CONTACT APPLIED THE BRAKES AND ATTEMPTED TO AVOID A VEHICLE THAT WAS STOPPED IN THE ROAD. THE CONTACT'S SON SWERVED INTO THE OTHER LANE AND CRASHED INTO THE VEHICLE THAT WAS INVOLVED IN THE CRASH AS WELL AS THE VEHICLE THAT WAS STOPPED IN THE MIDDLE OF THE ROAD. THE DRIVER'S VEHICLE FLIPPED OVER ONTO THE SHOULDER OF THE ROAD AND THEN LANDED UPRIGHT AGAIN. THE CONTACT'S SON SUSTAINED HEAD TRAUMA, CUTS TO THE EYES, A BROKEN NOSE, AND ONE OF HIS EYELIDS WAS DETACHED FROM HIS EYE AND HAD TO BE REPAIRED BY A PLASTIC SURGEON. HE WAS TRANSPORTED BY AMBULANCE TO THE HOSPITAL WHERE HE REMAINED FOR A MONTH AND A HALF, BATTLING INFECTIONS DURING HIS RECOVERY. A POLICE REPORT WAS FILED. THE CONTACT STATED THAT ONLY THE DRIVER'S SIDE AIR BAG DEPLOYED. THE OTHER FIVE AIR BAGS DID NOT DEPLOY. THE VEHICLE WAS DESTROYED AND TOWED TO A WRECKING YARD TO BE INSPECTED. THE CONTACT RETRIEVED THE VEHICLE AND TOOK IT TO HER RESIDENCE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED. THE FAILURE MILEAGE WAS 130,000.*DT    CRASH REPORT (XXX)  LICENSE NUMBER (XXX)  VIN (XXXXXX)  VEH LICENSE NUMBER (XXX)    ('PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).')*JB",
        "vin": "JH4KB16515C"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/21/2019",
        "dateOfIncident": "11/21/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281621,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "UNINTENDED ACCELERATION WHEN ATTEMPTING TO SLOW DOWN.  WHEN SHIFTED TO N DURING AN EVENT, TACHOMETER READS 6000 RPM.  THROTTLE PEDAL AND AREA ARE CLEAR, NO CODES.",
        "vin": "JH4KB16525C"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/01/2018",
        "dateOfIncident": "11/30/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11155315,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "HID HEADLIGHTS. MY PROBLEM HAS BEEN WITH MY HEADLIGHTS EVER SINCE I BOUGHT THE VEHICLE USED IN JULY OF 2015. EVERY NOW AND THEN THE PASSENGER SIDE HEADLIGHT WOULD FLICKER AND GO OUT. I CAN GET THE HEADLLIGHT TO COME BACK ON BY TURNING OFF THE HEADLIGHTS AND TURNING THEM BACK ON. THE PROBLEM CAN BE SO BAD AT TIMES THAT I HAVE TO DO IT REPEATEDLY WHILE I'M DRIVING. I DO MOST OF MY DRIVING AT NIGHT SO THIS HAS BECOME A VERY REAL ISSUE FOR ME. I'VE READ HOW OTHERS HAVE HAD THE SAME PROBLEM BUT ACURA REFUSES TO ACKNOWLEDGE IT. IT'S A COSTLY REPAIR ESPECIALLY IF THEY CAN'T FIND EXACTLY WHAT THE ISSUE IS. I'VE ALREADY GOTTEN STOPPED BY A POLICEMAN ABOUT THE HEADLIGHT BEING OUT. AND WHEN I EXPLAINED TO HIM WHAT THE ISSUE WAS HE LET ME GO ONCE I SHOWED HIM THAT IT CAME BACK ON. THE CAR ITSELF HAS BEEN AMAZING TO DRIVE ESPECIALLY HOW HARD I'VE DRIVEN IT OVER THE YEARS AND IT NOW HAS ABOUT 238,000 MILES ON IT OF WHICH I PUT ABOUT 95,000 MILES. OTHER MAJOR REPAIRS LIKE THE AIR CONDITIONING I HAD REPLACED WITHIN A MONTH AFTER PURCHASING THE CAR UNDER WARRANTY. I WAS NOT SO LUCKY WITH THE RADIATOR THAT WENT UP. THE WHOLE ORDEAL ENDED UP COSTING OVER $1000 AT A AAA AUTO REPAIR CENTER. I STILL SAY IT IS AN AMAZING CAR FOR THE TECHNOLOGY, ROAD MILES, AND AGE OF VEHICLE. I PURCHASED IT BECAUSE IT WAS ALL-WHEEL DRIVE AND THE PRICE WAS JUST UNDER $10K BACK IN 2015. THIS CAR NEW WAS MORE LIKE $50K-$55K. I WISH THAT ACURA WOULD ISSUE A RECALL AND MAKE THE NECESSARY REPAIRS FOR THE HID SYSTEM. I ACTUALLY READ HOW ONE OWNER HAD BOTH HEADLIGHTS GO OUT WHILE DRIVING. SCARY TO EVEN THINK ABOUT THAT HAPPENING AT THE WRONG TIME AND THEY NOT KNOWING HOW TO FIX IT THE WAY I LEARNED WHICH IS TO TURN THEM OFF AND ON. SOMETIMES I CAN GO SEVERAL MONTHS WITH NO ISSUES AND THEN OTHERS IT HAPPENS JUST ABOUT EVERY NIGHT DEPENDING ON CLIMATE I SOMETIMES THINK, SPECIFICALLY, HUMIDITY, BUT I CAN'T BE SURE.",
        "vin": "JH4KB16575C"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/28/2017",
        "dateOfIncident": "02/27/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10957674,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEADLIGHTS INTERMITTENTLY GO OFF WHILE DRIVING. SOMETIMES ITS ONE AND SOMETIMES BOTH. YOU HAVE TO TURN THE LIGHTS OFF AND BACK ON AND THEY TURN BACK ON. THIS IS A MAJOR SAFETY ISSUE.",
        "vin": "JH4KB16585C"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/15/2017",
        "dateOfIncident": "01/07/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10945417,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DOOR HANDLE STARTED SMOKING AND WILL NOT LET START        GPS DISPLAY SCREEN DOES NOT WORK   CLOCK DISPLAY DOES NOT WORK  VSA LIGHT IS ON ALL THE TIME  CAR WAS STATIONARY  BURNT OUTSIDE DOOR HANDLE.",
        "vin": "JH4KB16595C"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/19/2016",
        "dateOfIncident": "12/06/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10936128,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER SIDE LOW BEAM FLICKERS AND WILL COMPLETELY GO OFF. HAVE TAKEN INTO DEALER WITH NO RESULTS (CLAIM THEY COULD NOT FIND THE PROBLEM). THIS I BELIEVE IS A SAFETY ISSUE. PEOPLE HAVE COMPLAINED OF THIS SINCE 2005 WITH NO SOLUTION. IF WHEN DRIVING YOU TURN YOUR LIGHTS OFF THEN BACK ON THEY COME BACK ON TILL THE FLICKERING STARTS AGAIN.  *TR",
        "vin": "JH4KB16525C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/31/2016",
        "dateOfIncident": "10/31/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10920289,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2005 ACURA RL. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 16V344000 (AIR BAGS) AND 16V061000 (AIR BAGS). THE PARTS NEEDED TO REPAIR THE VEHICLE WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT AND VIN TOOL CONFIRMS PARTS NOT AVAILABLE RESPECTIVELY.",
        "vin": "JH4KB16535C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/31/2016",
        "dateOfIncident": "06/24/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10920303,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 ACURA RL. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS). THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JH4KB16515C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/27/2016",
        "dateOfIncident": "10/24/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10919383,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "\"TAKATA RECALL\"  I RECEIVED A LETTER FROM AMERICAN HONDA IN MARCH, 2016 ABOUT A SAFETY RECALL NOTICE.  UNDER THE SECTION \"WHAT SHOULD YOU DO?\" THE LETTER STATES THE REMEDY PARTS WILL BE AVAILABLE IN SUMMER 2016 AND \"ACURA WILL SEND ANOTHER LETTER WHEN PARTS BECOME AVAILABLE\"  I NEVER RECEIVED THIS SECOND LETTER SO ON OCTOBER 24 I CALLED AMERICAN HONDA ACURA CLIENT RELATIONS AND WAS TOLD IT WAS MY RESPONSIBILITY TO LOCATE THE PARTS AND HAVE THEM INSTALLED.  I CALLED MY LOCAL ACURA DEALER AND WAS TOLD THEY HAVE THE PARTS AND CAN INSTALL IMMEDIATELY.  AMERICAN HONDA IS NOT HANDLING THIS RECALL WITH THE LIFE THREATENING URGENCY IT DESERVES AND IS PUTTING LIFE'S AT RISK.",
        "vin": "JH4KB16545C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/30/2016",
        "dateOfIncident": "07/02/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10910853,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2005 ACURA RL. THE CONTACT STATED THAT THE AIR BAG WARNING INDICATOR INTERMITTENTLY ILLUMINATED. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 16V061000, 16V344000 (AIR BAGS), AND 13V092000 (SERVICE BRAKES, HYDRAULIC, TRACTION CONTROL SYSTEM). THE PARTS NEEDED FOR THE REPAIR WERE NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 174,000. VIN TOOL CONFIRMS PARTS NOT AVAILABLE AND PARTS DISTRIBUTION DISCONNECT.",
        "vin": "JH4KB16525C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/27/2016",
        "dateOfIncident": "07/05/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10909876,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL: I RECEIVED NOTICE FROM ACURA ON 7/5/16 TO CALL MY DEALER (ACURA OF OCEAN, NJ) TO SCHEDULE APPT. FOR REPLACEMENT OF (2) DEFECTIVE PARTS.  I IMMEDIATELY CALLED DEALER AND WAS INFORMED THAT PARTS WERE ON \"BACK ORDER\" AND THEY WOULD CALL ME WHEN PARTS ARRIVED TO SCHEDULE INSTALL.  I HAVE CALLED DEALER 2 TIMES SINCE 7/5 AND HAVE BEEN TOLD THAT PARTS ARE STILL ON \"BACK ORDER\".  IT HAS BEEN 84 DAYS WITH NO PARTS, I AM VERY CONCERNED AND WANT ACURA TO RECIFY MY RECALL ASAP.",
        "vin": "JH4KB16595C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/21/2016",
        "dateOfIncident": "07/11/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10908570,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL - RECEIVED NOTICE TO REPLACE PASSENGER AIRBAG IN JULY. CALLED DEALER ON JULY 11, ( MONTANO ACURA IN ALBUQUERQUE) MADE APPOINTMENT FOR JOLY 19. GOT THERE AND THEY DID NOT HAVE THE REPLACEMENT PART. IT HAS BEEN 72 DAYS AND THEY STILL DON'T HAVE IT AND ARE UNABLE TO REPAIR MY CAR.",
        "vin": "JH4KB26585C"
    },
    {
        "components": "AIR BAGS,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/13/2016",
        "dateOfIncident": "10/20/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10906018,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2005 ACURA RL. THE CONTACT RECEIVED NOTIFICATIONS FOR NHTSA CAMPAIGN NUMBERS: 16V061000 (AIR BAGS), 16V344000 (AIR BAGS), 10V504000 (SERVICE BRAKES, HYDRAULIC ) AND 13V092000 (SERVICE BRAKES, HYDRAULIC , TRACTION CONTROL SYSTEM). THE DEALER HAD BEEN UNABLE TO SUPPLY THE PARTS FOR THE RECALL REPAIRS. THE MANUFACTURER WAS NOTIFIED SEVERAL TIMES AND PROVIDED NO OPTION OF A LOANER.  VIN TOOL CONFIRMS PARTS NOT AVAILABLE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "JH4KB16535C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/12/2016",
        "dateOfIncident": "09/10/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10905720,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2005 ACURA RL. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V344000 (AIR BAGS). HOWEVER, THE PART NEEDED TO REPAIR THE VEHICLE WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "JH4KB165X5C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/09/2016",
        "dateOfIncident": "07/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10904954,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2005 ACURA RL. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 16V061000 (AIR BAGS) AND 16V344000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JH4KB16555C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/02/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10903295,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL:  BEEN WAITING SINCE MARCH, 2016 FOR REPLACEMENT  AIRBAG.  CAN THIS BE EXPEDITED.",
        "vin": "JH4KB16576C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/01/2016",
        "dateOfIncident": "09/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10903072,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2005 ACURA RL. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 16V344000 (AIR BAGS) AND 16V061000 (AIR BAGS) HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "JH4KB16595C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/17/2016",
        "dateOfIncident": "02/12/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10896630,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM CONCERNED WHEN THIS WILL BE REPLACED.",
        "vin": "JH4KB16545C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/16/2016",
        "dateOfIncident": "06/06/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10896309,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 ACURA RL. THE CONTACT STATED THAT THE CHECK AIR BAG SYSTEM WARMING LIGHT ILLUMINATED. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 16V344000 (AIR BAGS) AND STATED THAT THE PART NEEDED WAS UNAVAILABLE TO PERFORM THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE FAILURE MILEAGE WAS NOT  AVAILABLE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "JH4KB16545C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/12/2016",
        "dateOfIncident": "05/23/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10895302,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2005 ACURA RL. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V344000 (AIR BAGS). THE PART TO DO THE REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JH4KB165X5C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/05/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10893535,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2005 ACURA RL. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JH4KB16535C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/04/2016",
        "dateOfIncident": "01/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10893031,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE RECEIVED TWO RECALL NOTICES CONCERNED WITH AIR BAG INFLATORS. I CONTACTD A DEALER APPROX. 3 MONTHS AGO AND HAVE BEEN BACK TO THEM 3TIMES STILL NO ACTION. I AM WORRIED WHAT SHOULD I DO???",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/01/2016",
        "dateOfIncident": "03/12/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10892098,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2005 ACURA RL. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 16V061000 (AIR BAGS) AND 16V344000 (AIR BAGS); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIRS. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JH4KB16515C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/26/2016",
        "dateOfIncident": "07/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10888347,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 ACURA RL.  CONSUMER REQUESTS AN UPDATE ON  AVAILABILITY OF DEFECTIVE AIRBAG REPLACEMENT PARTS.  *SMD  RECALL # 16V344000 AND 16V061000.*JB",
        "vin": "JH4KB16505C"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/23/2016",
        "dateOfIncident": "05/13/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10887908,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MY HEADLIGHTS FLICKER A LOT WHILE DRIVING AT NIGHT.  THEY GO OUT SOMETIMES ONE AT A TIME, DRIVER'S SIDE HEADLIGHT OR PASSENGER SIDE HEADLIGHT.  SOMETIMES THEY BOTH GO OFF AND I AM REQUIRED TO TURN THE HEADLIGHTS OFF AND BACK ON USING THE SWITCH.  THIS IS VERY DANGEROUS AND THE AFS LIGHT COMES ON EVERY SO OFTEN.  THIS NEEDS TO BE FIXED IMMEDIATELY.  I READ FROM SEVERAL FORUMS THAT A LOT OF ACURA OWNERS FOR YEARS 2005 AND 2006 EXPERIENCED THIS SAME ISSUE THAT I AM GOING THROUGH.  I NEED ACURA TO RESOLVE THIS ISSUE.  IS THERE A RECALL FOR THIS?  PLEASE HAVE SOMEONE CONTACT ME ASAP!",
        "vin": "JH4KB16525C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/14/2016",
        "dateOfIncident": "03/23/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10884849,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2005 ACURA RL. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "JH4KB16535C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/09/2016",
        "dateOfIncident": "07/08/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10883773,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  I HAD MY DRIVER SIDE AIR BAG REPLACED ALMOST 87 DAYS WITH OUT MY ACURA RL RECIEVED A LOANER... 33 DAYS LATER JULY7 2016 I RECIEVE A RECALL FOR PASSANGER SIDE AIR BAG CAN SEND METAL INJURE OR KILL PASSANGER PLEASE DONT HAVE A PASSANGER I BROUGHT THE CAR TO ACURA DEALER TOLD ME END OF SEPTEMBER  THEY WILL HAVE PARTS GAVE ME A RENTAL TODAY DEALER CALLS AND ASK ME TO BRING BACK RENTAL ACURA NOT GOING TO PAY FOR IT ??? I ASK THE DEALER HOW SHOULD I DRIVE MY CHILDREN TO SPORTS AND WORK MY WIFE CANT DRIVE WITH ME I ONLY HAVE THIS VEHICLE,I CALLED ACURA 800 COMPLAINT AREA NOW THEY ARE RECONCIDERING IF THEY WILL PAY FOR LOANER,I CANT SELL THIS VEHICLE BECAUSE WHAT IF I SELL IT AND THE PASANGER GETS KILLED THIS IS SO CRAZY VW IS BUYING BACK THEIR CARS FROM PEOPLE.  ,BECAUSE THE LIED ABOUT GAS MILAGE,ACURA THINKS IT IS OK TO HAVE YOU DRIVE THIS VEHICLE JUST DONT HAVE A PASSENGER WITH YOU",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/08/2016",
        "dateOfIncident": "03/02/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10883668,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2005 ACURA RL. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 16V344000 (AIR BAGS) AND 16V061000 (AIR BAGS). THE PARTS NEEDED FOR THE REPAIR WERE NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE AND PARTS DISTRIBUTION DISCONNECT.",
        "vin": "JH4KB16515C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/06/2016",
        "dateOfIncident": "07/06/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10883010,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 ACURA RL. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 16V344000 (AIR BAGS) AND 16V061000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "JH4KB16555C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/01/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10882035,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2005 ACURA RL. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS) AND STATED THAT THE PART NEEDED FOR THE REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JH4KB16565C"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/29/2016",
        "dateOfIncident": "05/01/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10881648,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE RUNNING BUT NO ACCELERATION.  SHUT OFF AND RESTART ENABLED 3 DAYS OF DRIVING WITH NO FURTHER ISSUES. SHOP DECLARED, \" ... LOOSE BATTERY CABLE.\"  (SEEMS NOT LIKELY)  INCIDENT WAS ON US 3-LANE HIGHWAY IN TRAFFIC WITH SPEEDS POSTED AT 65 MPH  UPDATED 01/31/17*LJ",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/23/2016",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10875133,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 ACURA RL.  CONSUMER WRITES IN REGARDS TO REPLACEMENT PARTS NOT AVAILABLE TO REPAIR AIRBAG RECALL NOTICE.  *SMD",
        "vin": "JH4KB1659C0"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/20/2016",
        "dateOfIncident": "05/19/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10875310,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 ACURA RL, HEADLIGHTS HAVE FLICKERED SINCE PURCHASE IN 2005, HAVE REPORTED THIS OVER THE PAST 9-10 YEARS CORPORATELY AND TO THE LOCAL ACURA DEALERS, ACURA OF PLEASANTON AND ACURA OF THE DESERT.  THIS HAS NOW BECOME A SAFETY ISSUE, FLICKERING LIGHTS NOW TURN OFF AT NIGHT IN THE DARK WHILE IN MOTION CREATING A DRIVING HAZARD FOR BOTH THE OCCUPANTS OF THE ACURA AND ANY SURROUNDING VEHICLES.  THIS IS A COMMON PROBLEM WITH THE 2005 ACURA RL ACCORDING TO NUMEROUS ONLINE BLOGS AND SITES. ACURA CONTINUES TO IGNORE AND REFUSES TO ASSUME RESPONSIBILITY. PLEASE INTERVENE ON BEHALF OF CURRENT 2005 ACURA RL OWNERS, A FIX OR RECALL IS NECESSARY BEFORE SOME IS KILLED OR INJURED.",
        "vin": "JH4KB16505C"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/30/2016",
        "dateOfIncident": "05/29/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10871423,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT PASSENGER LIGHT FLICKERING MORE FREQUENTLY THESE DAY. WENT TO DEALER AND REPLACED THE LOW BEAM LIGHT BULB. STILL EXPERIENCED THE ISSUE WHEN YOU MADE A RIGHT TURN AND NOTICED LIGHT START FLICKERING AND SOMETIME IT OFF. VERY ANNOYING AND BOTHERSOME TO DRIVER. SAW NUMEROUS COMPLAINTS ABOUT THE FLICKERING LIGHT AND THINK IT'S TIME FOR NHTSA TO START LOOKING INTO THIS PROBLEM BEFORE THEY GET WORSE. HONDA KNEW THE PROBLEM BUT AVOID ACKNOWLEDGE UNTIL SOMEONE GET HURT. DEALER ARE CHARGING CONSUMER OVER $1000 JUST TO REPLACE THE WHOLE HEADLIGHT. SOMETIME, STILL WOULDN'T FIX THE PROBLEM, I URGE NTHSA TO INVESTIGATE IMMEDIATELY.",
        "vin": "JH4KB165X5C"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/27/2016",
        "dateOfIncident": "05/01/2007",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10871174,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHTS HAVE PREVIOUSLY FLICKERED AND TEMPORARILY TURNED OFF, DEALER HAS CLAIMED OUR VEHICLE WAS THE ONLY ONE IMPACTED, LOW BEAMS HAVE NOW COMLPLETELY FAILED CREATING A SAFETY HAZARD",
        "vin": "JH4KB16505C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/11/2016",
        "dateOfIncident": "03/26/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10854772,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2005 ACURA RL. THE CONTACT WANTED TO VOICE THEIR DISSATISFACTION AT HONDA FOR THE WAY THEY WERE HANDLING A MANUFACTURERS AIR BAGS RECALL. THE CONTACT STATED THAT THE DEALER DID OFFER THE OPTION OF A TEMPORARY PROVISIONAL VEHICLE HOWEVER THEY STATED THE CONSUMER HAD TO PAY THE INSURANCE FOR THE VEHICLE. THE CONTACT STATED THAT THE THEIR INSURANCE WOULD ONLY COVER 30 DAYS. THE CONTACT THE TIME FRAME THE MANUFACTURER PROVIDED WAS UNREASONABLE. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE MANUFACTURER NOTIFIED THE CONTACT THAT THEY WOULD COVER THE COST OF THE RENTAL BUT WOULD NOT COVER THE COST FOR THE INSURANCE.",
        "vin": "JH4KB16575C"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/22/2015",
        "dateOfIncident": "12/21/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10811756,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "GLOVE BOX MATERIAL IS MELTING AND SAGGING.  ITHE GLOVE BOX MATERIAL HAS ALSO \"ORANGE PEELED\".  WHEN GOOGLED, THIS IS A WIDESPREAD AND COMMON PROBLEM WITH ACURA'S BETWEEN 2005-2007.  A DEFECTIVE MATERIAL WAS USED ON THE GLOVE BOX.",
        "vin": "JH4KB16315C"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/19/2015",
        "dateOfIncident": "04/01/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10783431,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "ONE NIGHT WHILE DRIVING THE DRIVER'S SIDE HEADLIGHT BEGAN FLICKERING CONSTANTLY AND THE AFS LIGHT WAS ILLUMINATED AND HAS BEEN STEADILY ON SINCE THEN, WHENEVER MY HEADLIGHTS ARE IN OPERATION. ALSO, THE HEADLIGHT WENT DARK.  THIS BEGAN WHEN THE CAR WAS IN MOTION HEADING FROM A RURAL AREA INTO A MORE POPULATED ONE. I WAS ABLE TO TURN THE LIGHTS ON AND OFF VERY QUICKLY AND THE HEADLIGHT WAS ILLUMINATED.  HOWEVER. THIS IS EXTREMELY DANGEROUS AND LOOKS ILLEGAL FROM A LAW ENFORCEMENT POINT OF VIEW.  EVERY SINCE THEN I HAVE HAD ISSUES WITH INTERMITTENT OPERATIONAL HEADLIGHTS. ONE OF THEM WILL FLICKER CONSTANTLY AND MORE OFTEN THAN NOT, TURN OFF COMPLETELY.  ALSO, THE AFS DOESN'T WORK SO MY HEADLIGHTS NO LONGER SHIFT WHEN I TURN. IN ADDITION TO MYSELF, I HAVE READ SEVERAL FORUMS WHERE THIS HAS BEEN HAPPENING TO OWNERS OF THIS SAME GENERATION RL.  FROM RESEARCH, REPLACING THE BULB ITSELF AND/OR THE IGNITER IS NOT SOLVING THE PROBLEM.  IT WILL START AGAIN AND ANY OTHER SOLUTIONS ARE EXTREMELY EXPENSIVE.  IT SEEMS WITH THIS BEING SUCH A WIDESPREAD PROBLEM THAT SOMETHING IS FAULTY ABOUT THE EQUIPMENT USED IN PRODUCTION. I THINK HONDA NEEDS TO RESEARCH THIS AND OWN UP TO THEIR MISTAKE BY ISSUING A RECALL WHEN THEY DISCOVER THE SOURCE OF THE PROBLEM.",
        "vin": "JH4KB16595C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/06/2015",
        "dateOfIncident": "10/06/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10780245,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 ACURA RL. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 14V700000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "JH4KB16505C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/15/2015",
        "dateOfIncident": "07/01/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10734164,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 ACURA RL.  CONSUMER WRITES IN REGARDS TO AIRBAG RECALL REPLACEMENT ISSUES.  *SMD  ACURA INFORMED THE CONSUMER, HIS VEHICLE WAS NOT INCLUDED IN THE RECALL. THE CONSUMER STATED HE LIVES IN A STATE WHERE THE VEHICLE WAS INCLUDED EVEN THOUGH THE VEHICLE WAS PURCHASED IN A STATED THAT WAS NOT INCLUDED IN THE RECALL. *JB",
        "vin": "JH4KB16535C"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/26/2015",
        "dateOfIncident": "04/23/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10730690,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH THE ENGINE STILL RUNNING, THERE WAS NO ACCELERATION.  CYCLING IGNITION OFF/ON BROUGHT THINGS BACK TO NORMAL.  REPORTED TO THE DEALER THROUGH HONDA, CA.  DEALER SAID CAUSE WAS \"LOOSE BATTERY CABLE.\"   THE CAR HAS RUN FINE SINCE.  NO ONE HAS BEEN ABLE TO EXPLAIN HOW THE ENGINE SUFFERED A SINGLE INCIDENT, BUT WAS DRIVEN FOR THREE DAYS BEFORE THE DEALER SAW THE CAR.    THIS IS THE SECOND TIME THE DEALER HAS FOUND A LOOSE BATTERY CABLE AS THE CAUSE OF AN ISSUE.  IN EACH CASE, THE NEW BATTERY WAS NOT INSTALLED BY THE DEALER, BUT AT THE SAME SAM'S CLUB SERVICE CENTER.  BEFORE THIS REPORTED INCIDENT ABOVE, AND ABOUT SEVERAL WEEKS EARLIER, A NEW BATTERY WAS AGAIN INSTALLED BY SAM'S CLUB.  HAVING BEEN ADVISED OF THE PREVIOUS \"LOOSE CABLE,\" THE SAMS CREW WAS ASKED SPECIFICALLY TO ASSURE THE BATTERY CABLE WAS SECURE.  THE TECH SUPERVISOR REPLIED THAT IT WOULD BE DONE.  SAFETY WAS AN ISSUE.  THE ACCELERATOR SITUATION ABOVE OCCURRED WHEN TEMPORARILY STOPPED WITH TRAFFIC ON THE CENTER LANE OF BALTIMORE'S INTERSTATE BELTWAY.  FOR AN EXTENDED PERIOD OF TIME, THE HIGHWAY TRAFFFIC HAD RESUMED FULL SPEED IN THE 2 ADJACENT LANES.THE SPEED LIMIT FOR OTHERS WAS 65 MPH.  FORTUNATELY, THERE WAS ;A SEMI AND ANOTHER TRUCK THAT WERE WAITING BEHIND US.  THEY UNDERSTOOD AND STAYED PUT AT THEIR PERIL.   REQUEST:   A REPLY WITH A SIMPLE BUT TECHNICAL EXPLANATION OF JUST HOW A \"LOOSE BATTERY CABLE\" COULD BE THE CAUSE.",
        "vin": "JH4KB16575C"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/28/2015",
        "dateOfIncident": "04/01/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10721987,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH STRUTS APPEARED GOOD ON SMOOTH ROAD, BUT ARE ESSENTIALLY ROCK SOLID ON POTHOLES OR BUMPS. IN 60 YEARS OF DRIVING I HAVE NEVER HAD A FAILED SHOCK SO NEVER CONSIDERED IT AND BOUGHT THIS 10 YEAR OLD CAR. SCANT AND INCOMPLETE DATA RELATED TO ALL BRANDS ON THE INTERNET BLAMES THE ROUTINE LIFTING OF THE CAR FOR TIRE ROTATION AND BREAKING OF INTERNAL PARTS THAT BLOCK THE OIL FLOW IN THE SHOCK. THIS SEEMS REASONABLE SINCE MANY EVENTS OCCUR IN PAIRS (IN FRONT; I DON'T KNOW ABOUT REAR) . I EXPECT THAT A SINGLE FAILURE COULD CAUSE OBVIOUS SAFETY PROBLEMS. MANY MILES OF GOOD OPERATION ARE CUT OFF FOR OWNERS BY THIS DIABOLICAL DESIGN ERROR IN ADDITION TO THE ADDED REPAIR EXPENSE OF APPROXIMATELY $1000. (+ AND -) I BELIEVE THAT THE DEALER (BRAND NOT IMPORTANT) DID NOT RECOGNIZE THE PROBLEM, INDICATING THAT MORE EXPOSURE AND TRAINING IS REQUIRED. PARTS PEOPLE AND MECHANICS SEEM TO BE AWARE BUT THERE IS NO CONCERTED EFFORT TO SOLVE IT. (A CONFLICT OF INTEREST?)",
        "vin": "JH4KB18535C"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/10/2015",
        "dateOfIncident": "07/15/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10693315,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHTS INTERMITTENTLY FLICKER AND SHUT OFF, SEEMINGLY REGARDLESS OF VEHICLE SPEED OR DRIVING CONDITIONS.  AT TIMES, THE RIGHT PASSENGER SIDE LIGHT SHUTS OFF.  LESS FREQUENTLY, THE LEFT DRIVER SIDE OR BOTH LIGHTS SHUT OFF.  ALSO, OF LATE, THE ACTIVE FRONT LIGHTING INDICATOR (\"AFS\") TURNS ON, SEEMINGLY AT RANDOM, AND WHETHER OR NOT AFS IS ON OR OFF.  *TR",
        "vin": "JH4KB16505C"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/07/2015",
        "dateOfIncident": "03/06/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10692740,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN TRYING TO USE KEYLESS ACCESS SYSTEM WHEN LOCKING THE 2005 ACURA RL I PRESS THE BUTTON ON THE DOOR HANDLE TO LOCK THE DOORS BUT IT IS NOT LOCKING THE CAR. THE REMOTE IS IN MY POCKET. THE KEYLESS ACCESS DOES LET ME UNLOCK THE DOOR WITH THE PULL ON THE DRIVER DOOR HANDLE. THE PROBLEM IS WHEN TRYING TO LOCK THE VEHICLE WITH THE DRIVER DOOR HANDLE IT WILL NOT LOCK THE CAR. SO NOW I HAVE TO JUST USE THE KEYFOB TO LOCK THE CAR WITH PRESSING THE LOCK BUTTON ON THE REMOTE. I HAVE READ AND DONE ALL REQUIRED TO DO WHAT THE MANUAL SAYS BUT IT IS STILL NOT WORKING. I HAVE JUST READ A SERVICE BULLETIN SAYING THAT THERE IS A PROBLEM WITH THE DOOR HANDLES THAT WEATHER LIKE RAIN OR MOISTURE HAS GOTTEN INSIDE AND DAMAGED THE DOOR HANDLE SENSORS.  *TR",
        "vin": "JH4KB16525C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/23/2014",
        "dateOfIncident": "11/23/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10660368,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM QUESTION WHY NHTSA CAMPAIGN NUMBER: 14V700000  IS ONLY IN HIGH TEMPERATURE OR HUMIDITY AREAS WHERE THERE ARE NOW INCIDENTS RECORDED ALL OVER WITH THE TAKATA AIR BAGS.  *TR",
        "vin": "JH4KB16515C"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "11/05/2014",
        "dateOfIncident": "11/01/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10652737,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG WARNING LIGHT ON BECAUSE OF A MALFUNCTION WITH THE RIGHT SIDE AIRBAG INFLATOR, AS IN MANY OTHER ACURA VEHICLES, AND AS SHOWN BY THE RECALLS ON IT. ALSO THE AIRBAG IS NOT WORKING BECAUSE OF THE PASSENGER WEIGHT SENSOR IS SHOWING AS NOT WORKING, AND THE AIRBAG IS NOT WORKING BECAUSE THE DRIVER SEAT BELT SENSOR IN THE BUCKLE SWITCH IS NOT WORKING EITHER, ALL AFFECTING THE AIRBAG DEPLOYMENT AND THUS THE SAFETY OF THE CARS PASSENGERS. ACURA REFUSES TO FIX UNDER WARRANTY.  *TR",
        "vin": "JH4KB16575C"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/01/2014",
        "dateOfIncident": "09/01/2008",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10629853,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN DRIVING SINCE 1980  AND HAVE HAD VARIOUS VEHICLES FROM VARIOUS MANUFACTURERS AND I HAVE NEVER HAD A DASHBOARD MELT FOR ANY REASON. I EXPECTED MY CAR TO HAVE MINOR PROBLEMS AT 40,000 MILES BUT MELTING WAS NOT ONE OF THEM. THE INTERIOR OF MY CAR IS MELTING. ESPECIALLY THE GLOVE COMPARTMENT, THE ARM REST AND THE CONSOLE. THE GLOVE COMPARTMENT HAS MELTED AND REMAIN SOFT AND STICKY, TO THE POINT THAT ANYTHING COMING INTO CONTACT WITH THE GLOVE BOX LEAVES AN IMPRESSION OR POCK MAR.  THE ARM REST AND CENTER CONSOLE HAVE CRACKED AND PEELED. THE DRIVERS DOOR HANDLE CAME OUT IN MY HAND AS I WAS CLOSING THE DOOR ONE DAY, THAT'S WHEN I REALIZED IT WAS MADE OF 100 % PLASTIC COVERED IN VINYL. A CAR ORIGINALLY VALUED AT $51K BRAND NEW AND THEY INSTALL THE CHEAPEST DOOR HANDLE OF ANY MAKER? THEY COULDN'T AFFORD TO PUT IT TOGETHER WITH SCREWS, INSTEAD THEY GLUED IT TOGETHER. MY GLOVE COMPARTMENT AND DASHBOARD IS MELTING AND STICKY. IT APPEARS AS THOUGH SOME TYPE OF GLUE HAD BEEN POURED ON IT. YES YOU CAN RIDE IN MY CAR, BUT SIT IN YOU SEAT AND DON'T TOUCH THE DASHBOARD, IT WILL STICK TO YOUR HANDS. I COMPLAINED TO THE ACURA DEALER WHEN THE CAR WAS STILL UNDER WARRANTY AND EVEN NOW THAT I HAVE PURCHASED EXTENDED WARRANTY, THIS IS NOT COVERED.  THE REST OF MY CAR IS IN IMPECCABLE CONDITION INSIDE AND OUT AS I HAVE TAKEN CARE OF IT SINCE THE DAY I PURCHASED IT.  HOWEVER I AM EMBARRASSED FOR ANYONE TO COME INSIDE THE CAR AND SEE THE TATTERED CONDITION IT IS IN.  *TR",
        "vin": "JH4KB16595C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/27/2014",
        "dateOfIncident": "02/05/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10606573,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING THE MESSAGE COMES ON THAT THE PASSENGER SIDE AIRBAG IS OFF.THE MESSAGE APPEARS CONSTANTLY.  I HAVE CALLED ACURA IN TORRANCE CA.THE MESSAGE WENT AWAY,BUT IT IS CONSTANTLY APPEARING .  THEY GAVE ME A REFERENCE NUMBER B012014-06-2701911.  THEY SAID THAT THEY WILL INVESTIGATE MY VIN # TO SEE IF THERE IS A PROBLEM. IN THE MEANTIME MY PASSENGER SIDE AIRBAG IS INACTIVE.THE MESSAGE IS STILL ON MY COMPUTER SCREEN.I AM WORRIED  I AM TAKING THE CAR IN TO THE DEALER.I THINK THAT ACURA IS TRYING TO PLAY DOWN THE SERIOUSNESS OF THIS. THANK YOU  *TR",
        "vin": "JH4KB16525C"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ELECTRONIC STABILITY CONTROL,TRACTION CONTROL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/26/2014",
        "dateOfIncident": "06/23/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10606234,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DEFECT INVESTIGATION EA13002 HAS 1 RELATED RECALL  NHTSA CAMPAIGN ID NUMBER: 13V092000    MY CAR WAS NOT EXPERIENCING ANY PROBLEMS AT THE TIME OF THIS RECALL BUT I DID TAKE IT IN TO HAVE THE SERVICE COMPLETED IN JUNE 2013.  A COUPLE OF MONTHS AGO MY CAR STARTED ACTING EXACTLY AS DESCRIBED IN THE COMPLAINT.  WHILE DRIVING ANYWHERE FROM 45-50 MPH, THE BRAKES WILL ENGAGE ON THEIR OWN, JERKING THE CAR TO THE SIDE AND THE VSA WARNING LIGHT AS WELL AS THE SH-AWD DRIVE LIGHT WILL COME ON IN THE CAR.  THIS HAPPENS ON A CONSISTENT BASIS, AT LEAST EVERY 3 DAYS, SOMETIMES EVERY DAY.     APPARENTLY THE PROBLEM STILL EXISTS BECAUSE THE RECALL FIX HAS NOT PREVENTED THIS FROM CONTINUING TO HAPPEN.    I TOOK MY CAR IN TO THE LOCAL ACURA DEALERSHIP FOR DIAGNOSIS AND WAS TOLD THE YAW RATE SENSOR IS GIVING POOR INFORMATION TO THE ECU AND STABILITY CONTROL SYSTEM AND I AM SUPPOSED TO PAY $1050.00 TO HAVE A NEW YAW RATE SENSOR INSTALLED.      I DO NOT UNDERSTAND WHY I WOULD BE RESPONSIBLE FOR PAYING FOR THIS WHEN IT IS A DEFECT AND CAN CAUSE INJURY TO ME OR OTHER PASSENGERS ON THE ROAD.   *TR",
        "vin": "JH4KB16525C"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/13/2014",
        "dateOfIncident": "06/12/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10598080,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE I'M DRIVING FROM WORK I HEAD A SQUEAK NOISE. SO I TURN THE AC OFF THE NOISE STOP BUT STILL HEAR TIME TO TIME. I GOT HOME OK THEN I TOLD MY HUSBAND THE PROBLEM, HE TOOK THE CAR OUT FOR A TEST. AS SOON AS BACK OUT THE DRIVE HE CAN HEAR SOME THING FELL OFF THEN THE POWER STEERING STOP WORKING. HE HAS TO MUSCLE THE STEERING BACK TO THE DRIVE. HE OPEN THE HOOD AND FOUND OUT THE HARMONIC BALANCER FELL OFF. LUCKY FOR ME THAT DID NOT HAPPEN TO ME WHILE I'M ON THE FREE WAY. OH MY WORK ONLY TEN MILES FROM MY HOUSE.    *JS",
        "vin": "JH4KB16535C"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "04/28/2014",
        "dateOfIncident": "04/16/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10585276,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG LIGHT WENT ON AND DEALER  CHECKED CODES AND SAID DRIVERS SEATBELT BUCKLE NEEDS REPLACEMENT AND STATED NOT UNDER WARRANTY.  MY SISTERS 2002 HONDA HAS SAME ISSUE LAST MONTH AND THEY WARRANTEED IT.   *JS",
        "vin": "JH4KB16555C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/12/2014",
        "dateOfIncident": "04/04/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10579399,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SRS LIGHT CAME ON SUDDENLY ON DAY IN JANUARY 2014 AND AFTER DISAPPEARED AFTER TWO WEEKS.  HOWEVER, THE MESSAGE IN THE LOG SHOWED A 92-22 ERROR MESSAGE AND REQUIRED ME TO TAKE THE CAR TO DEALERSHIP. AS THE LIGHT SRS HAD GONE OFF I TOOK THE CAR IN TO DEALERSHIP ON APRIL 4TH FOR ANOTHER RECALL ISSUE AND ASKED THEM TO LOOK IN TO SRS MESSAGE.  MIND YOU THE SRS LIGHT WAS OFF WHEN I TOOK THE CAR TO THE DEALERSHIP.  AFTER THEY LOOKED INTO THE ISSUE THE SRS LIGHT CAME BACK ON AND NOW THE DEALERSHIP WANTS $1300 TO REPLACE THE SRS SYSTEM.  I CALLED ACURA AND THEY SAID THE SRS IS OUT OF WARRANTY AND THEY SUGGESTED THAT THEY WILL NOT REPLACE IT.  THERE IS A TECHNICAL SERVICE BULLETIN OUT FOR COLLECTING ALL PASSENGER AIR BAGS HOWEVER THEY WANT TO CHARGE ME.  REALLY DISAPPOINTED WITH THE WAY BOTH THE ACURA DEALERSHIP IN BETHESDA, MD AREA AND ACURA BOTH ARE TREATING THE SITUATION.  I WILL CERTAINLY HAVE TO TAKE THIS ISSUE TO THE NEXT STEP IN INVESTIGATING WHETHER THIS IS A SYSTEMATIC APPROACH USED BY THE COMPANY AND DEALERSHIPS TO HAVE CONSUMERS BARE THE BURDEN OF DEFECTIVE PARTS. MORE TO COME ON THIS SOON.   *JS",
        "vin": "JH4KB16585C"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/20/2014",
        "dateOfIncident": "03/18/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10573744,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING AT NIGHT FRONT HEADLIGHT STARTED FLICKERING AND CUT OFF.  I TURNED LIGHTS OFF THEN BACK ON AND HEADLIGHTS CAME BACK ON.   THE NEXT DAY BOTH HEADLIGHTS STARTED FLICKERING AND BOTH WENT OFF TURNED LIGHTS OFF AND ON UNTIL THEY CAME BACK ON.  *TR",
        "vin": "JH4KB16555C"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/02/2014",
        "dateOfIncident": "02/28/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10566645,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, OR STATIONERY,  DRIVER HEADLIGHT FLICKERS AND SHUTS OFF, FOLLOWED BY THE PASSENGER LIGHT. THE ONLY WAY TO REGAIN HEADLIGHT FUNCTION, LIGHTS MUST BE TURNED OFF AND BACK ON CONSTANTLY.   *TR",
        "vin": "JH4KB16545C"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/21/2014",
        "dateOfIncident": "10/23/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10560783,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "ASSORTED LIGHT CAME ON ACROSS DASH BOARD (WARNING LIGHT) THEN THE TRANSMISSION BEGAN TO START SLIPPING,I HAD THE CAR TOWED TO DEALER. DEALER TELL ME THAT THE SHIFT SOLENOID WENT BAD, REPLACE SHIFT SOLENOID 10/24/2012,I HAD TO REPLACE TRANSMISSION 11/27/2013. ANYTIME THERE WAS AN ISSUE MY CAR I HAD IT SERVICES AND KEPT UP WITH MY MAINTENANCE.   *TR",
        "vin": "JH4KB16505C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/08/2013",
        "dateOfIncident": "11/06/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10551476,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING AT ABOUT 30 MPH ON RUFE SNOW IN NORTH RICHLAND HILL, TX ABOUT 2:00PM, WHEN MY ENGINE SUDDENLY STOPPED. ALL ELECTRICAL WAS SHUT DOWN. TRAFFIC WAS APPROACHING ME FROM BEHIND AND I WAS AFRAID OF BEING HIT FROM BEHIND.  I WAS UNABLE TO OPEN MY DOORS, LOWER WINDOWS OR EVEN PUT THE EMERGENCY FLASHERS ON. I WAS TRAPPED. I CALLED 911 AND REPORTED MY SITUATION. HOWEVER, JUST BEFORE THE POLICE ARRIVED, A MAN WALKED OVER TO MY VEHICLE AND TRIED TO OPEN THE DOOR FROM THE OUTSIDE WITHOUT SUCCESS. I PULLED THE HOOD SWITCH AND HE WAS ABLE TO MOVE THE WIRE ON THE BATTERY WHICH WAS LOOSE AND THE ELECTRONIC AND ALL BEGAN TO FUNCTION. I CALLED ACURA CORP. AND THE MACCHURHILL DEALERSHIP AND ASKED IF THERE WAS A MANUAL METHOD OF ESCAPING SUCH A SITUATION. THEY COULD NOT GIVE THAT SUGGESTION.  *TR",
        "vin": "JH4KB16575C"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/22/2013",
        "dateOfIncident": "07/10/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10548970,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 ACURA RL. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, THE HEADLIGHTS WOULD FLICKER ON AND OFF WITHOUT WARNING. THE CONTACT MENTIONED THAT THE FAILURE WOULD RECUR INTERMITTENTLY. THE VEHICLE WAS TAKEN A DEALER WHERE THE FAILURE WAS UNABLE TO BE REPLICATED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 73,000 AND THE CURRENT MILEAGE WAS 75,240.",
        "vin": "JH4KB16575C"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": true,
        "dateComplaintFiled": "10/03/2013",
        "dateOfIncident": "09/02/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10546634,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS STRUCK BY A DRUNK DRIVER WHILE TRAVELING NORTH ON GSP. LEFT DRIVER SIDE OF THE CAR WAS SIDE SWIPED FROM THE BACK TO THE FRONT.  I HADN'T NOTICE THE LIGHT PRIOR TO THE ACCIDENT HOWEVER ACCORDING TO THE BODY SHOP THERE WAS A PROBLEM PRIOR TO THE ACCIDENT. THE AFS LIGHT WAS NOT TRIGGERED BY THE INCIDENT AND IT IS A SAFETY ISSUE. INSURANCE REFUSED TO REPAIR UNDER CLAIM AS STATED BY THEM.....ACURA SHOULD REPAIR DUE TO THE RECALL.   *TR",
        "vin": "JH4KB16535L"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/07/2013",
        "dateOfIncident": "08/05/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10534121,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECENTLY HAD ISSUES WITH THE HEADLIGHTS ON MY ACURA 2005 RL(WHICH I'VE ONLY HAD FOUR MONTHS).  I WAS DRIVING DOWN A RURAL ROAD AT NIGHT WHEN I PUT MY SIGNAL ON TO MAKE A LEFT TURN AND THE HEADLIGHTS SUDDENLY WENT OUT.  I KEPT TURNING THE KNOB TRYING TO GET THEM TO COME BACK ON BUT IT TOOK A FEW SECONDS BEFORE THEY WOULD COME ON AGAIN.  FORTUNATELY I ONLY HAD TO GO A SHORT DISTANCE BEFORE PULLING INTO A FRIEND'S DRIVEWAY.    I WAS TOLD THE LEFT HEADLIGHTS HADN'T BEEN ON SINCE I HAD LEFT THE GAS STATION.  WE TESTED THE LIGHTS TO DISCOVER THAT  SOMETIMES ONLY THE RIGHT SIDE WOULD WORK, OR THEY WOULD FLICKER AND THEN IMMEDIATELY GO OFF.  SOMETIMES THEY WOULD ALL GO OFF.  NOT WHAT I WOULD EXPECT FOR A $50,000 CAR FROM ACURA.    I CAN'T BELIEVE THERE HAVE BEEN SO MANY COMPLAINTS AND ACURA ISN'T STANDING BEHIND THEIR PRODUCT.  WHY HASN'T ACURA PUT OUT A RECALL FOR THIS PROBLEM....AND WHEN DID ACURA STOP CARING ABOUT THEIR CUSTOMERS?    THIS IS THE THIRD ACURA I HAVE OWNED, THE OTHER TWO WERE GREAT VEHICLES BUT THIS ONE IS A $50,000 LEMON!  IF ACURA DOESN'T REMEDY THE SITUATION IT WILL BE THE LAST VEHICLE I BUY FROM THEM.  I WILL MAKE SURE EVERYONE KNOWS HOW THEY ARE NO LONGER STANDING BEHIND THEIR PRODUCTS, ESPECIALLY AS SERIOUS AS THIS ONE.  *TR",
        "vin": "JH4KB16515C"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/12/2013",
        "dateOfIncident": "08/01/2008",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10524593,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 ACURA RL. THE CONTACT STATED THAT WHILE DRIVING 60 MPH, THE VEHICLE DECELERATED INDEPENDENTLY AND STALLED. THE VEHICLE WAS TAKEN TO THE DEALER, WHO STATED THE FAILURE WAS CAUSED BY THE FUEL PUMP. THE FAILURE RECURRED WHEN THE OUTSIDE TEMPERATURES WERE HIGH. THE VEHICLE WAS NOT REPAIRED. THE FAILURE WAS REPORTED TO THE MANUFACTURER. THE FAILURE MILEAGE WAS 37,000. THE CURRENT MILEAGE WAS 186,000.",
        "vin": "JH4KB16525C"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/21/2013",
        "dateOfIncident": "06/20/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10521107,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "HID HEADLIGHTS GO OUT INTERMITTENTLY AND FLICKER ALL THE TIME. WHEN I CHECK ON LINE, IT SEEMS LIKE THIS IS A VERY BIG PROBLEM WITH THIS MODEL VEHICLE. MANY OTHER PEOPLE ARE HAVING THE SAME PROBLEM WITH THIS MODEL AND THE DEALERS ARE TRYING TO CHARGE ASTRONOMICAL PRICES TO FIX THIS SAFETY ITEM.  *TR",
        "vin": "JH4KB16525C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/17/2013",
        "dateOfIncident": "01/15/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10512489,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "SRS LIGHT CAME ON. TOOK CAR TO DEALERSHIP FOR REPAIR. WAS TOLD IT WAS FAULT CODE 92-21. WAS TOLD A NEW WIRING HARNESS COULD POSSIBLY FIX THE PROBLEM AT A COST TO ME OF $3000. YES, THAT WAS THREE THOUSAND DOLLARS$$ NOW I HAVE NO SRS ON MY CAR AN ACURA FEELS ITS NOT THERE PROBLEM. I UNDERSTAND HOW WARRANTIES WORK AND HOW WEAR AND TEAR EFFECT EVERY CAR, BUT A WIRING HARNESS SHOULD NOT MALFUNCTION, ESPECIALLY ON A SAFETY SYSTEM!! THIS HAS TO BE A MANUFACTURE DEFECT!! THANKS ACURA FOR STANDING BEHIND THE SAFETY OF YOUR VEHICLES!!! BTW, THIS CAR HAS NEVER HAD A ACCIDENT.  *TR",
        "vin": "JH4KB16515C"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/15/2013",
        "dateOfIncident": "05/16/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10503180,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 ACURA RL. THE CONTACT STATED THAT WHILE DRIVING 30 MPH, THE VEHICLE STOPPED SUDDENLY. THE VEHICLE WAS TOWED TO THE DEALER FOR INSPECTION WHERE THEY ADVISED THE CONTACT THAT THAT THEY COULD NOT DIAGNOSE THE CAUSE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED BUT PROVIDED NO ASSISTANCE. THE FAILURE MILEAGE WAS 40,000.",
        "vin": "JH4KB16505C"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/27/2012",
        "dateOfIncident": "02/25/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10482441,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "1ST INCIDENT ON FEBRUARY 25 2009 -DOOR HANDLE SHORTED OUT WHILE VEHICLE WAS PARKED IN GARAGE.  REPLACED BY DEALER.  2ND INCIDENT ON OCTOBER 16,2012-DOOR HANDLE SHORTED OUT WHILE VEHICLE WAS PARKED IN GARAGEFOR 24-36 HOURS. WE DETECTED THE SMELL OF WIRES BURNING IN THE MORNING, BUT COULD  NOT FIND THE SOURCE.  LATER IN THE DAY THE ACURA WOULD NOT START.  NOTHING WORKED.  AAA GOT IT STARTED AND I DROVE TO ACURA DEALER.  ONCE AGAIN, THE DOOR HANDLE SHORTED OUT.   THIS RECURRING , AND POTENTIALLY DANGEROUS , PROBLEM CAUSES A SAFETY RISK.  PARTICULARLY TROUBLING DUE TO THE RECENT RECALL ISSUE WITH SOME HONDA VEHICLES WITH A SIMILAR ISSUE. COST TO OWNER--$503.  *TR",
        "vin": "JH4KB165X5C"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/16/2012",
        "dateOfIncident": "09/15/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10480720,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 ACURA RL. THE CONTACT STATED THAT HE WAS MADE AWARE THAT THE HEADLIGHTS WERE NOT FUNCTIONING BY ANOTHER DRIVER.  THE FAILURE RECURRED INTERMITTENTLY. THE VEHICLE WAS NOT TAKEN TO THE DEALER FOR DIAGNOSTIC TESTING. THE VEHICLE WAS NOT REPAIRED. THE VIN WAS NOT AVAILABLE. THE APPROXIMATE FAILURE MILEAGE WAS 50,000.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/23/2012",
        "dateOfIncident": "02/26/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10467096,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RIGHT-SIDE ENGINE MOUNT HAD TO BE REPLACED BECAUSE IT WAS BROKEN. SUBSEQUENT TO THIS PROBLEM BEING RESOLVED, I WAS INFORMED, ON 6/12/12, BY THE ACURA DEALERSHIP DURING A ROUTINE INSPECTION, THAT THE SAME ENGINE MOUNT ON THE RIGHT-SIDE HAD TO AGAIN BE REPLACED, SO, THIS MEANS THAT THE SAME ENGINE MOUNT HAS HAD TO BE REPLACED TWICE WITHIN APPROXIMATELY A 2 TO 2 1/2 YEAR TIME SPAN.  *TR",
        "vin": "JH4KB16525C"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/26/2012",
        "dateOfIncident": "08/31/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10456605,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS AN INTERMITTENT SAFETY ISSUE WITH THE ACTIVE HEADLIGHTS ON THE ACURA RL VEHICLE.  OCCASIONALLY, THE HEADLIGHTS WILL SHUT THEMSELVES OFF DURING OPERATION AT NIGHT.  SOMETIMES IT'S JUST ONE AND SOMETIMES IT'S BOTH.  THIS IS AN ISSUE THAT HAS BEEN BROUGHT TO THE DEALERS ATTENTION.  THEY CANNOT FIND ANYTHING WRONG SO THEY JUST SUGGEST CHANGING OUT ALL OF THE ACTIVE COMPONENTS AT THE OWNERS EXPENSE.  I DO NOT FEEL THIS SHOULD BE PAID FOR BY THE OWNER AS THIS IS A LONG RUNNING VEHICLE SAFETY ISSUE WHICH SHOULD BE CLEARED UP BY THE HONDA CORPORATION. *TR",
        "vin": "JH4KB16555C"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/19/2012",
        "dateOfIncident": "04/18/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10455724,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2005 ACURA RL HAS CHROME TRIM THAT IS APPARENTLY A THIN SHEET OF METAL THAT HAS BEEN APPLIED TO THE VEHICLE. AFTER SOME TIME, IT HAS DEGRADED, AND IS PEELING FROM ITS ORIGINAL POSITION. THIS HAS EXPOSED VERY SHARP EDGES. ONE OF THE DELAMINATED TRIM PIECES IS UNDER THE HOOD RELEASE, AND WHILE INSERTING MY FINGERS TO OPEN THE HOOD I RECEIVED A CUT ON MY HAND.      *JS",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/27/2012",
        "dateOfIncident": "01/06/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10449412,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEAD LIGHTS WILL FLICKER OFF RANDOMLY WHILE DRIVING. I HAVE BEEN EXPERIENCING THE ISSUE SINCE I HAVE OWNED THE CAR BACK IN 2007. ACURA CAN NEVER DUPLICATE THE PROBLEM, BUT CLAIM THAT I NEED NEW HEADLIGHTS. IF I NEEDED NEW HEAD LIGHTS I DOUBT THEY WOULD TURN BACK ON AFTER IT HAPPENS. THE PROBLEM HAPPENS RANDOMLY. I COULD GO 4 OR 5 DAYS WITHOUT A PROBLEM AND THEN GO 4 OR 5 DAYS WITH CONSTANT ISSUES. IF YOU DO A SEARCH ONLINE, IT IS A COMMON PROBLEM THAT MOST PEOPLE WITH A 2005 ACURA RL ARE HAVING. THIS IS A SAFETY ISSUE BECAUSE IN BAD WEATHER SUCH AS HEAVY RAIN YOU CANNOT SEE IF THE HEADLIGHTS ARE ON OR OFF AND IF AN ON COMING DRIVER CAN NOT SEE ME IT INCREASES THE CHANCE ON BEING IN A COLLISION.  *TR",
        "vin": "JH4KB165X5C"
    },
    {
        "components": "VISIBILITY,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/30/2011",
        "dateOfIncident": "12/26/2011",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10441756,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER AND PASSENGER SIDE MIRRORS BECAME DANGEROUSLY LOOSE.  SERVICE BULLETIN 08-022  ISSUED JUNE 7, 2008 BY ACURA WARNING \"PROBABLE CAUSE: THE BOLTS FASTENING THE MIRROR HOUSING TO THE MIRROR BASE WERE NOT PROPERLY TORQUED.\"   MIRRORS MUST BE REPLACED AT COST OF $750 EACH TO CONSUMER PLUS INSTALLATION.  *KB",
        "vin": "JH4KB163X5C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/01/2011",
        "dateOfIncident": "09/30/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10422889,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MY AIR BAG ON THE PASSENGER SIDE IS PUTTING MARKS ON THE DASH WHERE IT WOULD DEPLOY AND I'M NOW FEARING IT WILL DO SO WHILE IN A DRIVING SITUATION.  *TR",
        "vin": "JH4KB16535C"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/06/2011",
        "dateOfIncident": "08/05/2011",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10417761,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MY ACCURA RL 2005 LIGHTS FLICKER ON AND OFF AND THEN SHUT RIGHT OFF WHILE DRIVING AT NIGHT. THIS IS EXTREMELY DANGEROUS! IT NOT ONLY IMPAIRS MY DRIVING BUT DISTRACTS DRIVERS IN FRONT OF ME THINKING IM FLASHING LIGHTS AT THEM AND TAKING THIER EYES OFF THE ROAD AHEAD OF THEM.  THE LIGHTS ARE ALSO POINTED AT THE GROUND.  CANT SEE AT NIGHT VERY FAR INFRONT OF THE VEHICLE.  ACURA SAYS IT WOULD BE AROUND $1200 TO FIX EACH HEADLIGHT, THATS $2400 TO FIX A SAFETY ISSUE!  THAT IS RIDICULOUS!  READ THE INTERNET, THIS IS AN ONGOING PROBLEM WITH ALL OF THESE ACURA RLS.  *TT",
        "vin": "JH4KB16595C"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/02/2011",
        "dateOfIncident": "08/02/2011",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10416804,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 ACURA RL LOW BEAM HEADLIGHTS TOTALLY FAILED, UNEXPECTEDLY, AND THE CAR WAS NOT MOVING FORWARD. THIS HAS BEEN A RECURRING PROBLEM WITH THE LEFT SIDE LOW BEAM, SOMETIMES I DIDN'T KNOW IT UNTIL TOLD AND NOW IT HAPPENS TO BOTH AT THE SAME TIME WHILE IDLING IN MY DRIVEWAY.  MY DAUGHTER TOLD ME BOTH HAD CUT OUT ON HER EARLIER THIS MONTH, BUT I COULD NOT VERIFY UNTIL TODAY.  TURNING THE SWITCH OFF / ON WILL BRING THE LIGHTS BACK ON, BUT THEN AGAIN FOR HOW LONG IS QUESTIONABLE. DEALERS DENY IT EXIST OR CAN'T VERIFY, BUT A QUICK WEB SEARCH HAS NOW VALIDATED MY PROBLEM HAS EXISTED FOR A VERY LONG TIME WITH THIS CAR. THIS IS MUCH MORE SERIOUS THAN I THOUGHT, CLEARLY A PROBLEM YOU SHOULD BE AWARE OF.  *KB",
        "vin": "JH4KB16545C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/04/2011",
        "dateOfIncident": "02/03/2011",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10404427,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE A 2005 ACURA RL. DURING DRIVING, THE ENTIRE POWER DROPS.  WITHOUT ELECTRICITY TO ALL COMPONENTS, THE POWER STEERING GOES, THE ENGINE STOPS, ALL LIGHTS ON THE DASH BOARD OFF.  AFTER A FEW SECONDS TO A MINUTE, THE POWER COMES BACK.  BUT THE CAR WILL BE SHOWING ALL KINDS OF ERROR MESSAGES.  THE  TRANSMISSION WILL BE AT A WRONG GEAR.    ACURA DEALER SERVICE CAN REPRODUCE THE PROBLEM BUT FOR OVER ONE MONTH, THEY CANNOT FIX IT BECAUSE THEY DO NOT KNOW WHAT IS WRONG.  THE DRIVER AT HE DEALERSHIP WHO EXPERIENCED THE PROBLEM WAS SO SCARED AND THE DEALER TOLD US THE CAR IS EXTREMELY DANGEROUS TO DRIVE.  *TR",
        "vin": "JH4KB16545C"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/05/2011",
        "dateOfIncident": "04/05/2004",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10394335,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR 2006 ACURA RL HAS A FLICKERING FRONT DRIVER'S SIDE HEADLIGHT THAT GOES ON AND OFF OVER ANY BUMP IN THE ROAD.  THE CAR IS DANGEROUS TO DRIVE AT NIGHT.  WE JUST TOOK THE CAR TO A DEALER AND IT COST OVER $300 TO REPLACE THE LIGHT BULB! THEY EVEN HAD TO REMOVE THE BUMPER TO CHANGE THE BULB.  WE WILL NEVER BUY ANOTHER ACURA AGAIN, $50,000 LEMON.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/16/2011",
        "dateOfIncident": "03/16/2011",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10390341,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHT FLICKER ON / OFF. SOMETIME COMPLETELY SHUTOFF, BUT WILL TURN BACK ON AFTER TURN OFF AND ON THE HEADLIGHT. THIS ISSUE IS REPEATABLE FOR OVER A FEW WEEKS.  *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/15/2011",
        "dateOfIncident": "02/12/2011",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10382759,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "LOW BRAKE PEDAL -- NEED A ABS/ VSA MODULATOR- THIS IS A SAFETY DEFECT THAT AFFECTS BRAKING AND SHOULD BE A RECALL BY HONDA.  *TR",
        "vin": "JH4KB16585C"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/03/2011",
        "dateOfIncident": "02/02/2011",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10380045,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 ACURA RL HAS HEADLIGHT PROBLEMS.  THE HEADLIGHTS START TO FLICKER AND THEN ALL OF A SUDDEN WILL SHUT OFF.  I TRY TO SHUT OFF THE LIGHTS AND TURN ON THE LIGHTS AND IT WORKS FOR A WHILE.  NOW THE PROBLEM HAS BEEN OCCURRING MORE FREQUENTLY.  ACURA SHOULD RESOLVE THIS ISSUE BEFORE SOMEONE GETS INVOLVED IN A FATAL ACCIDENT DUE TO NO HEADLIGHTS.  IT IS HARD TO TELL WHEN THE HEADLIGHTS ARE NOT WORKING IN A WELL LIT STREET.  ACURA ITS TIME FOR YOU TO TAKE RESPONSIBILITY OF THIS MANUFACTURERS DEFAULT AND FIX THE PROBLEM.  *TR",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/16/2010",
        "dateOfIncident": "11/12/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10366447,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON MOUNTAIN ROAD AT NIGHT. HEADLIGHTS FLICKER, WITH ONE SIDE GOING OUT, TURN KEY OFF THEN RESTART AND ALL IS WELL UNTIL YOU HIT A BUMP IN THE ROAD OR TURN A SHARP CORNER. *TR",
        "vin": "JH4KB16535C"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/06/2010",
        "dateOfIncident": "09/01/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10353988,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "IN SEPT 2010, NOTICED FOR THE FIRST TIME THAT THE LEFT SIDE HEADLIGHT ON MY 2005 ACURA RL WORKS INTERMITTENTLY.  AT THE DEALERSHIP, IT WAS WORKING AT FIRST, BUT THEN THEY NOTICED THE PROBLEM AND SAID IT HAD TO DO WITH THE INVERTER AND IGNITER.  THE REPAIR QUOTE WAS $1,750.  THE CAR IS 5 YRS OLD WITH 61K MILES. *TR",
        "vin": "JH4KB16515C"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/26/2010",
        "dateOfIncident": "08/23/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10352215,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHTS HAVE BEEN FLICKERING HERE AND THERE, GETTING WORSE AND WORSE.  NOW THE DRIVERS SIDE HEADLIGHT GOES OUT AND COMES BACK ON OCCASIONALLY. *TR",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/23/2010",
        "dateOfIncident": "08/20/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10351220,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "ACURA RL 2005 LOUD CLUNKING NOISE FROM LEFT FRONT DASH AND STEERING COLUMN. *TR",
        "vin": "JH4KB165X5C"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/12/2010",
        "dateOfIncident": "08/12/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10349111,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECENTLY BOUGHT A 2005 ACURA RL--WHAT A GREAT CAR!  THE PROBLEM IS THESE HEADLIGHTS KEEP FLICKERING ON AND OFF, SAME AS A LOT OF PEOPLE HERE.  THIS IS VERY DANGEROUS, AND ACURA NEEDS TO STEP UP TO THE PLATE AND INITIATE A RECALL BEFORE SOMEONE DIES IN AN ACCIDENT.  OTHER THAN THE HEADLIGHT ISSUES, I AM VERY SATISFIED WITH THE CAR. *TR",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/18/2010",
        "dateOfIncident": "07/17/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10343820,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 ACURA RL PASSENGER HEADLIGHT INTERMITTENTLY WILL TURN OFF WHILE DRIVING.  THE HEADLIGHT WILL TURN BACK ON IF I TURN OFF THE HEADLIGHTS & TURN THEM BACK ON.  THERE IS NO TELLING WHEN IT WILL OCCUR.  IT CAN OCCUR 6 OR 7 TIMES IN A 20 MINUTE DRIVE OR NOT AT ALL DURING THE SAME DRIVE THE NEXT EVENING.  THIS HAS BEEN OCCURRING SINCE I'VE OWNED THE CAR IN 12/2007. *TR",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/11/2010",
        "dateOfIncident": "02/02/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10342488,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 ACURA RL  LEFT HEADLIGHT DOES NOT TRACK  AFS WARNING LIGHT KEEPS COMING ON.  NOT ALL THE TIME MOSTLY WHEN RAINING OR IN SNOW. *TR",
        "vin": "JH4KB165X5C"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/22/2010",
        "dateOfIncident": "03/07/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10339593,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 ACURA RL INTERMITTENT HEADLIGHT PROBLEM. HEADLIGHTS FLICKER WHEN GOING OVER BUMPS BUT ALSO ONE OR THE OTHER OF THE OTHER HEADLIGHTS GOES COMPLETELY DARK WHILE DRIVING AT NIGHT. SOMETIMES IT IS THE LEFT AND SOMETIMES IT IS THE RIGHT HEADLIGHT WHICH GOES DARK WHILE DRIVING AND FOR NO APPARENT REASON. I CAN 'RESET' THE DIMMED HEADLIGHT BY SWITCHING THE HEADLIGHTS FROM 'AUTO' TO 'OFF' AND THEN BACK TO 'AUTO' AGAIN.    2- THE FAILURE IS VERY OFTEN. AT LEAST 3 TIME A WEEK.   3- I TOOK MY CAR TO THE DEALER AND PAID ABOUT $98 SO FAR BUT IT HAPPENED AGAIN THE VERY NEXT DAY. ACCORDING TO WHAT I'M READING ONLINE IS THAT THEY WILL CHARGE ME FROM $600-$1200 PER LIGHT AND STILL NOT SURE IF THAT WILL FIX THE ISSUE SINCE IT HAS BEEN GOING ON FOR OVER 5 YEARS(SINCE THE CAR WAS OUT FOR SALE). *TR",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/20/2010",
        "dateOfIncident": "06/14/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10339230,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "1.  DANGEROUS DRIVING CONDITIONS  2. HEADLIGHTS FLICKERING AND SHUTTING OFF  3. NEED TO GO TO DEALERSHIP.  READING ONLINE ABOUT PROBLEMS FROM GOOGLE.COM WHEN I TYPED 2005 ACURA RL HEADLIGHTS, A SEARCH CAME UP WHERE MULTIPLE PEOPLE HAVE HAD THE SAME PROBLEM THAT I HAVE HAD. THE DEALERSHIP KEEPS SAYING IT'S JUST THE HEADLIGHT THAT NEEDS TO BE REPLACED AND FROM WHAT I KNOW AND READ IT IS MUCH MORE THAN THAT. *TR",
        "vin": "JH4KB16575C"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/06/2010",
        "dateOfIncident": "06/04/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10334913,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 ACURA RL ACTIVE FRONT HEADLIGHTING  I FIRST COMPLAINED ABOUT THE PROBLEM TO MY DEALER, AND NOTHING WAS DONE. DURING DRIVING AT NIGHT THE DRIVERS HEAD LIGHT FLICKERS AND GOES OFF COMPLETELY I LIVE IN TENNESSEE SO I DRIVE ON MOUNTAIN ROADS ALOT, TO GET THE LIGHT BACK ON TO WORK PROPERLY I HAVE TO ACTUALLY STOP IN THE MIDDLE OF THE ROAD, OR PULL OVER SAFELY AND TURN OFF THE HEADLIGHTS THEN BACK ON AGAIN, THIS HAPPENS WHEN GOING AROUND CURVES, AS WELL AS OVER ROUGH PAVEMENT I HAVE RESEARCHED ONLINE AND THIS IS A PROBLEM THAT OCCURS WITH THIS SYSTEM AND THERE HAS NOT BEEN A POSITIVE FIX AS OF YET PLEASE ADVISE. *TR",
        "vin": "JH4KB16565C"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/26/2010",
        "dateOfIncident": "03/01/2008",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10327642,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "A COUPLE YEARS AGO, I WAS STOPPED BY A POLICEMAN BECAUSE MY DRIVER'S SIDE HEADLIGHT WAS OUT.  HE GAVE ME A WARNING AND TOLD ME TO GET IT FIXED.  I TOOK IT INTO A LOCAL REPAIR SHOP AND WHEN WE CHECKED THE LIGHT, IT WAS WORKING.  I HAVE NOTICED THAT THE LIGHT FLICKERS QUITE A BIT, AND ALSO THAT IT WILL WORK FOR A WHILE AND THEN IT WON'T.  SOMETIMES I CAN REMEDY THE PROBLEM BY TURNING THE LIGHTS ON AND OFF, BUT NOT ALL THE TIME.  MEANWHILE, I FOUND OUT THAT THE PRICE FOR THE BULB WAS $200 SO DECIDED TO FOREGO CHANGING THE BULB, SINCE IT DIDN'T APPEAR THAT WAS THE PROBLEM.  IT CONTINUES TO FLICKER AND DOESN'T WORK ALL THE TIME, BUT IT'S HARD TO NOTICE WHEN I'M IN THE CITY AND ON A LIT STREET.  I BELIEVE THE PROBLEM IS SOMETHING CALLED THE INVERTER OR BALLAST AND THAT CAN COST UP TO $1,000.00 BECAUSE YOU HAVE TO TAKE THE BUMPER OFF TO GET TO IT.  I HAVE BEEN UNHAPPY WITH THE LIGHTING SYSTEM EVER SINCE WE GOT THE CAR.....NOT WHAT I EXPECTED FROM AN ACURA PRODUCT.  I EXPRESSED MY DISPLEASURE INITIALLY WITH THE DEALERSHIP BUT WAS TOLD THAT'S JUST THE WAY THEY WORKED.  VERY DANGEROUS ON DARK, RURAL ROADS WHICH IS WHAT WE DRIVE ON.  I'VE READ AN ACURA FORUM ON-LINE AND LOTS OF PEOPLE HAVE THE SAME FEELINGS ABOUT THE HEADLIGHTS.  LOVE THE CAR, HATE THE HEADLIGHTS!  I HOPE THIS MAKES SOME SENSE, I DON'T SEEM TO BE ABLE TO SCROLL TO READ WHAT I'VE WRITTEN. *TR",
        "vin": "JH4KB16555C"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/17/2010",
        "dateOfIncident": "04/14/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10326094,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2005 ACURA RL HAS DEFECTIVE HEADLIGHTS. FOR NO REASON UNDERSTOOD THE HEADLIGHTS BEGIN TO FLICKER ON AND OFF THEN EVENTUALLY GO TOTALLY BLACK WHEN DRIVING. THIS HAPPENS ALMOST EVERY TIME I DRIVE NOW. MY CAR ONLY HAS 60,000 MILES. THIS IS INEXCUSABLE. THE ONLY WAY TO GET THEM TO WORK IS TO TURN THE LIGHT SWITCH ALL THE WAY IN THE OFF POSITION AND THEN BACK TO THE ON POSITION. THIS IS A VERY DANGEROUS DEFECT THAT HAPPENS WHILE DRIVING. I ALMOST GOT INTO AN ACCIDENT BECAUSE OF THIS AND HAVE HEARD OF OTHER 05-06 ACURA RL OWNERS GETTING INTO ACCIDENTS BECAUSE OF THIS. THERE HAVE BEEN NUMEROUS COMPLAINTS OF THIS WITH ALL 2005-2006 ACURA RL'S. ACURA DOES NOT WANT TO ADMIT THERE IS A SERIOUS DEFECTIVE LIGHTS SYSTEM WITH THE 05-06 RL. WHAT'S IT GOING TO TAKE FOR THEM TO OFFER A RECALL ON THIS PROBLEM. SOMEONE'S LIFE IN AN ACCIDENT. *TR",
        "vin": "JH4KB16555C"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/31/2010",
        "dateOfIncident": "02/07/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10323047,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "LIGHTS GO OUT ON ACURA RL 2005.  THE LIGHTS WILL PERIODICALLY TURN OFF WHEN HITTING A BUMP OR GOING DOWN HILL.  THE DEALER SAID THE BALAST NEEDS REPLACED WHICH WILL COST AND ESTIMATED 800 + DOLLARS.  ASIDE FROM THE SEVER SAFETY CONCERN THE COST TO FIX A BROKEN HEAD LIGHT IS INSANE.  FORGET ABOUT IT IF YOU HAVE TO FIX TWO OF THEM.  I HAVE NOW READ SEVERAL FORUMS ON THIS AND SEEN HUNDREDS OF POST ON ALL YEARS OF THE RL MODELS AND TL AND NONE OF THIS HAS BEEN ADDRESSED.  THIS PROBLEM IS OBVIOUSLY SISTEMIC OF THE LIGHTING SYSTEM AND A RECALL SHOULD BE ENFORCED FOR THE SHEER INSANITY OF DRIVING WITHOUT LIGHTS!",
        "vin": "JH4KB16595C"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/28/2010",
        "dateOfIncident": "02/26/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10315013,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MY HEADLIGHTS FLICKER WHEN GOING OVER ROAD BUMPS. IT BECOMES VERY DIFFICULT, AND DANGEROUS TO SEE THE ROAD CLEARLY AT NIGHT. ACURA WANTS TO CHARGE ME APPROXIMATELY $1000 TO REPLACE THE HEADLIGHTS. *TR",
        "vin": "JH4KB165X5C"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/08/2010",
        "dateOfIncident": "11/15/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10307505,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "ACURA 2005RL       ACCELERATION PROBLEMS.  OCCURS OCCASIONALLY,ABOUT EVERY 2 WEEKS  DEALER HAS EXAMINED THE CAR AND CAN'T FIND THE PROBLEM",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/15/2009",
        "dateOfIncident": "09/10/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10295730,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHTS FLICKER WHEN CAR HIT BUMPS OR WHEN HEADLIGHTS TURN.  IT IS VERY ANNOYING.  THE FLICKERING COMES AND GOES, BUT IT IS GETTING MORE FREQUENT.  HAVE CALLED THE DEALER ABOUT TAKING THE CAR IN AND WILL MAKE AN APPOINTMENT TO TAKE MY CPO RL TO DEALER FOR INSPECTION THIS WEEK.  CAR HAS 56K MILES AND IT IS A CPO ACURA.  *TR",
        "vin": "JH4KB16575C"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/14/2009",
        "dateOfIncident": "12/12/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10295576,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2205 RL HEADLIGHT BRIEFLY GO OUT WHEN I HIT A BUMP IN THE ROAD. HAS BEEN HAPPENING FOR PAST 6 MONTHS BUT NOW I AM NOTICING IT HAPPENING MORE FREQUENTLY. VERY DANGEROUS AT NIGHT. *TR",
        "vin": "JH4KB16525C"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/10/2009",
        "dateOfIncident": "12/06/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10295202,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2005 ACURA RL.  THE HEADLIGHTS FLICKER AND PERIODICALLY GO OUT.  THE ONLY WAY TO GET THEM TO COME BACK ON IS IF I TURN THE HEADLIGHTS OFF AND THEN BACK ON.  THIS, OF COURSE, HAPPENS AT NIGHT AND IS EXTREMELY DANGEROUS WHEN I'M TRAVELING DOWN THE ROAD AT 65 MPH!  THIS HAS BEEN OCCURRING FOR THE PAST 4 MONTHS.  THE DEALER REPLACED THE SOP HID CONTROL UNIT TWO DAYS AGO AND IT HAS NOT FIXED THE PROBLEM.  IT DID COST ME $553.95. *TR",
        "vin": "JH4KB16545C"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/02/2009",
        "dateOfIncident": "11/22/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10294263,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "1) FILLING GAS TANK - REPEAT SHUT OFF AT FILLING STATION  IMMEDIATELY FOLLOWING INCIDENCE AT FILLING STATION THE NEST DAY THE FOLLOWING OCCURRED TO MY VEHICLE:   2) REMOTE KEYLESS ENTRY FAILURE  3) NAVIGATION SYSTEM FAILURE  4) NO HEAT OR AIR CONDITIONING      $ 700 CHARGE AT DEALER FOR THEM TO REPLACE: PASSENGER SIDE OUTER DOOR HANDLE FOR TRACED SHORT TO HANDLE CAUSING BLOWN FUSE WHICH WAS (ABOVE LISTED ) RESOLVED PROBLEMS 2-4.    $ 1700+ CHARGE AT DEALER FOR THEM TO REPLACE FUEL TANK - PROBLEM UNKNOWN.      COULD THERE BE A CONDITION SIMILAR TO MUSTANG FUEL TANK PROBLEM IN 2005,2006 & 2007 MODELS?  CONDITION MAY BE DUE TO THE FUEL TANK VAPOR VENTING SYSTEM INSIDE THE FUEL TANK, A HEAT-INDUCED FUEL VAPOR LOCK, OR OTHER GASOLINE FUEL FILL INTERRUPTION SITUATIONS. *TR",
        "vin": "JH4KB16595C"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/26/2009",
        "dateOfIncident": "11/15/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10293639,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 ACURA RL:  HEAD LIGHTS FLICKER WHEN HITTING BUMP IN THE ROAD. OCCURS DAILY (NIGHTLY) NOW AND GETTING WORSE. I EXPECT THEY WILL EVENTUALLY GO OUT.  NOW GETTING QUOTES TO CORRECT. HUNDREDS OF DOLLARS AND PROBABLY OVER $1000 THAT I DON'T THINK I SHOULD PAY. *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/02/2009",
        "dateOfIncident": "07/31/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10279072,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MY HEADLIGHT ON MY ACURA RL ARE INTERMITTENT AND GOING OUT EVERY SO OFTEN, MORE OFTEN THEN NOT. THE PROBLEM JUST STARTED TO HAPPEN. IT HAPPENS ALL THE TIME OFF AND ON. THE PROBLEM IS WITH THE LIGHT BALLAST AND IT WILL RUN YOU FROM $500 TO $1200 TO REPAIR. *TR",
        "vin": "JH4KB16555C"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/26/2009",
        "dateOfIncident": "03/12/2007",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10278339,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "HEAD LIGHT FLICKERS ON/OFF INTERMITTENTLY. *TR",
        "vin": "JH4KB16565C"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/24/2009",
        "dateOfIncident": "02/01/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10269837,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 05 RL'S RIGHT SIDE LOW BEAM HEADLIGHT STARTED FLICKERING SEVERAL MONTHS AGO AND NOW THE FLICKERING HAS PROGRESSED  TO HEADLIGHT GOING COMPLETELY OUT.  WHEN THE LIGHT SWITCH IS TURNED FROM AUTO TO OFF AND THEN BACK ON, THE LIGHTS COME BACK ON. *TR",
        "vin": "JH4KB16575C"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/20/2009",
        "dateOfIncident": "04/15/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10269482,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "OWN 2005 ACURA RL, THAT HAS AFS LIGHT SYSTEM.  WHILE DRIVING VEHICLE ON INTERSTATE, THE HEADLIGHTS ARE INTERMITTENT AND GOES OFF AT TIMES, LEAVING ME WITHOUT VISIBILITY OF THE ROAD AHEAD.  I'VE CONTACTED ACURA AND THEY STATE THAT VEHICLE IS OUT OF WARRANTY AND CANNOT SERVICE.  MY CONCERN IS THAT IS  A SAFETY ISSUE.  I HAVE ALSO GOOGLED ISSUE AND HAVE SEEN NUMEROUS COMPLAINTS ABUT THE AFS SYSTEM. *TR",
        "vin": "JH4KB16535C"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/24/2008",
        "dateOfIncident": "12/29/2007",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10215924,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 ACURA RL.  THE CONTACT STATED THAT HER VEHICLE WAS INCLUDED IN NHTSA CAMPAIGN ID NUMBER 07V551000 (STEERING:HYDRAULIC POWER ASSIST:HOSE, PIPING, AND CONNECTIONS).  SHE WAS NOT GRANTED A LOANER VEHICLE TO USE DURING THE ALLOTTED REPAIR TIME.  THE CONTACT IS DISABLED AND FELT THAT SHE SHOULD HAVE RECEIVED A LOANER VEHICLE.  THERE HAD BEEN NO FAILURE TO DATE.  THE CURRENT MILEAGE WAS 27,185.",
        "vin": "JH4KB16535C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/05/2007",
        "dateOfIncident": "09/04/2007",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10201998,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIR CONDITIONER BLOWS OUT ONLY WARM AIR. I HAVE TAKEN IT TO THE DEALERSHIP AND THEY HAVE DIAGNOSED THE PROBLEM AS A FAULTY COMPRESSOR AND HAVE ORDERED A NEW PART BUT IT IS ON A NATIONAL BACKORDER WITH NO ETA FOR THE PART. IT IS UNACCEPTABLE THAT ACURA IS IGNORING A WIDE SPREAD PROBLEM AND NOT ISSUING A RECALL OR PRODUCT UPDATE FOR THE AFFECTED MODELS.  *TR",
        "vin": "JH4KB16595C"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/29/2007",
        "dateOfIncident": "03/25/2007",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10186504,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2005 ACURA RL. I BELIEVE THE VEHICLE HAS A FUNDAMENTAL DESIGN FLAW. THE CLEARANCE BELOW THE FRONT OF THE CAR IS INSUFFICIENT AND FURTHERMORE POSSIBLE THE SUSPENSION IS NOT STRONG ENOUGH FOR THE WEIGHT OF THE ENGINE. WHAT HAPPENED IS THAT I USED THE CAR UNDER NORMAL OPERATING CONDITIONS AND IT GOT DAMAGED. I HAD THREE NORMAL SIZE ADULT PASSENGERS AND A NORMAL SIZE 9 YEAR OLD CHILD IN THE CAR. NO LUGGAGE. I PULLED INTO A PARKING LOT AT NORMAL SPEED AND THERE WAS A LOUD NOISE FROM THE FRONT OF THE VEHICLE. I HAVE NOTICED BEFORE THAT THE FRONT OF THE VEHICLE HITS CURBS WHEN YOU PARK AND SCRAPES WHEN YOU GO UP SIDEWALK RAMPS, SO I WAS AWARE THAT IT DOES NOT HAVE AMPLE CLEARANCE AND/OR SUSPENSION, BUT IN THIS CASE WITH THOSE PASSENGERS ON BOARD IT WAS WORSE, THE RIGHT CORNER OF THE BUMPER GOT BADLY DAMAGED. I TALKED TO THE DEALER AND ACURA CLIENT SERVICES AND THEY DENIED THERE IS ANY DESIGN FLAW. BUT I DON'T BUY THAT BECAUSE I HAVE HAD A SAAB AND A LEXUS AND NOTHING LIKE THIS EVER HAPPENED (IN FACT THEY DON'T EVEN SCRAPE LIKE THIS ONE DOES). IT'S MY VIEW THAT THIS CAR DOES NOT MEET THE BASIC REQUIREMENT OF AN IMPLIED WARRANTY, WHICH IS THAT IT SHOULD BE USABLE UNDER THE OPERATING CONDITIONS FOR WHICH IT WAS DESIGNED.*JB",
        "vin": "JH4KB16535C"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/23/2006",
        "dateOfIncident": "10/23/2006",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10171598,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN BACKING CAR OUT FROM PARKING STALL, AFTER TURNING WHEEL BEYOND OTHER CAR AND READY TO GO FORWARD, I STOP COMPLETELY WITH FOOT ON BRAKE .  AS I BEGIN TURNING STEERING WHEEL IN THE OTHER DIRECTION A LOUD SCRAPING NOISE COMES FROM AREA OF THE STEERING COLUMN.  IT  AN BE HEARD FOR AT LEAST 100 FEET.  THIS DOES NOT HAPPEN EVERY TIME, BUT SOMETIMES 4 OR 5 TIMES DURING A WEEK.  WE HAVE BEEN WORKING WITH THE DEALER FOR MORE THAN A YEAR .  THE CAR IS 2005 ACURA 3.5 RL  ON OCT  13TH WITH THE SERVICE MANAGER AND A DEALER REPRESENTATIVE IN THE CAR THEY WERE FINALLY ABLE TO HEAR THE NOISE THAT WE HAD DESCRIBED TO THEM. THEY HAVE NOT BEEN ABLE TO CORRECT THE PROBLEM. ON OCT 20TH I HEARD THE NOISE 2 MORE TIMES. I AM WORRIED THAT SOMETHING IS HAPPENING IN THE STEERING MECHANISM  THAT COULD RESULT IN SERIOUS DAMAGE AND/OR INJURY.  IN SEPTEMBER I NOTICED OIL LEAKING.  AFTER 1/2 HOUR I DROVE CAR TO DEALER AND THERE WAS NO POWER STEERING.  I LEARNED LATER THAT THE HIGH PRESSURE HOSE WAS ONLY \"FINGER TIGHT\" WHEN THE CAR WAS MADE.  *NM",
        "vin": "JH4KB16585C"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/27/2006",
        "dateOfIncident": "11/12/2005",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10160916,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEADLIGHTS ON MY CAR POSE SERIOUS SAFETY PROBLEMS ON UNLIT ROADS. THE LIGHTS ONLY SHINE 50-70 FEET OUT ON THE STREET. WHEN THERE ARE NO STREET LIGHTS, I CAN NOT SEE MORE THAN 50 FEET AND I MUST TRAVEL AT SLOW SPEEDS DUE TO EXTREMELY POOR VISIBILITY. THE NAVIGATION SYSTEM IDENTIFIES AN UPCOMING TURN, BUT I CAN'T SEE THE STREET OR STREET SIGN. AT SPEEDS OVER 20 MPH; I FEEL THIS IS VERY UNSAFE.  THE DEALER SAID THIS IS NORMAL AND WITHIN SPECIFICATION. THE HEADLIGHTS ARE TERRIBLE!  *JB",
        "vin": "JH4KB16595C"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/21/2006",
        "dateOfIncident": "12/01/2005",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10150767,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VERTICAL SELF ADJUSTING HEADLIGHTS POSE SERIOUS SAFETY CONCERNS ON UNLIT ROADWAYS, OFTEN ILLUMINATING ONLY 40 FEET IN FRONT OF THE CAR. ON HILLY TERRAIN, THE HEADLIGHTS WILL ADJUST DOWN AS THE VEHICLE STARTS UPHILL, ILLUMINATING APPROXIMATELY 40 FEET IN FRONT OF THE VEHICLE. THIS ALSO OCCURS WHEN THE VEHICLE TRAVELS OVER BUMPS AND ANY MINOR CHANGES IN VEHICLE ATTITUDE. IT IS VERY EASY TO OVERDRIVE THE HEADLIGHTS, OFTEN AT SPEEDS LESS THAN 20 MPH. YOU SIMPLY CAN NOT SEE ROAD HAZARDS OR PEDESTRIANS. THE DEALER ADVISED THIS IS NORMAL AND WITHIN SPECIFICATION.   *NM",
        "vin": "JH4KB16535C"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "02/06/2006",
        "dateOfIncident": "02/01/2006",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10149770,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "FAX FM CONSUMER WHO'S (OR) DISAPPOINTED IN THE WAY ACURA HANDLED THE BRAKES AND RADIO DEFECTS IN THEIR 2005 ACURA RL, ES HAVE NO RECORDS OF PREV. CORRESPONDENCE.  *TS    A PART WITHIN THE BRAKE ASSEMBLY WAS NOT MADE TO FIT PROPERLY AND HAD TO BE RETROFITTED TO STOP THE LOUD RATTLING AND BANGING NOISE WHENEVER THE VEHICLE WAS DRIVEN OVER UNEVEN PAVEMENT OR ROUGH SURFACES.  WHEN THE RADIO WAS TURNED ON THE SCREEN DISPLAYED A CODE ENTRY MESSAGE AND THE RADIO WOULD NOT WORK.  BOTH PROBLEM WERE EVENTUALLY REPAIRED BY THE DEALER.  *NM",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "01/23/2006",
        "dateOfIncident": "01/01/2006",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10148698,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 ACURA RL BRAKE ASSEMBLY PARTS WERE NOT MADE TO FIT PROPERLY AND HAD TO BE RETROFITTED TO STOP LOUD RATTLING AND BANGING WHENEVER THE VEHICLE WAS DRIVEN OVER UNEVEN OR ROUGH SURFACES. *TS  WHILE THE CONSUMER TRIED TO USE THE RADIO A CODE ENTRY MESSAGE WAS DISPLAYED ON THE SCREEN AND THE RADIO WOULDN'T WORK.",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/20/2006",
        "dateOfIncident": "01/21/2005",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10148229,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONSUMER STATED WHEN USING LOW BEAM, THE HEADLIGHTS DO NOT ILLUMINATE MORE THAN 50 FEET.  THE LACK OF VISIBILITY DECREASES FURTHER WHILE TRAVELING DOWN HILL.  THE DEALERSHIP COULD NOT REPOSITION THE HEADLIGHTS.  THE MANUFACTURER WAS CONTACTED WHICH DETERMINED THIS IS HOW THE VEHICLE WAS MANUFACTURED.  *JB",
        "vin": "JH4KB16585C"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/03/2005",
        "dateOfIncident": "09/10/2005",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10136494,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "REF 2005 ACURA RL  THE HIGH BEAM HEADLIGHTS DO NOT SHINE FAR ENOUGH DOWN THE ROAD.  I WAS DRIVING IN VERMONT ON  DARK COUNTRY ROADS AND ALMOST HIT A TREE.  DRIVING AT THE SPEED LIMIT OF 50 MPH I OUTRUN THE LIGHTS.  ACURA SAYS THERE IS NO WAY TO ADJUST THE HALOGEN LIGHTS & THAT THE PARAMETERS WERE APPROVED BY DOT.   I FEEL THAT A MISTAKE HAS BEEN MADE ON YOUR PART THAT WILL RESULT IN UNNECESSARY SINGLE VEHICLE ACCIDENTS ON THE NATIONS HIGHWAYS.  *JB  *NM",
        "vin": "JH4KB16535C"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/02/2005",
        "dateOfIncident": "09/06/2005",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10141491,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEADLIGHTS ON THE 2005 ACURA RL DO NOT PROVIDE SUFFICIENT LIGHT UNLESS THE HIGH BEAM IS ENGAGED WHICH YOU OFTEN CANNOT DO.  *NM",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/04/2005",
        "dateOfIncident": "10/04/2005",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10138476,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ROAD NOISE PREVENTS THE USE OF THE HANDS FREE PHONE.  THE PHONE WORKS FINE WHILE STOPPED AND CAN NOT BE USED WHEN DRIVING BECAUSE OF THE ROAD NOISE. THIS MAKES IT A SAFETY PROBLEM SINCE YOU MUST USE THE PHONE IN A NORMAL WAY. THIS ALSO BREAKS THE LAW IN NJ. ACURA CAN NOT FIX IT.  *JB",
        "vin": "JH4KB16545C"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "09/27/2005",
        "dateOfIncident": "09/20/2005",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10137826,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THE CALLER WAS PULLING OUT OF A PARKING SPOT WHEN SHE SUDDENLY LOST CONTROL OF THE VEHICLE. IT ACCELERATED ON ITS OWN , AND  SHE TRIED THE BRAKE AND IT DID NOT WORK. SHE SAID THE STEERING WHEEL DID NOT WORK, SHE TRIED TO TURN THE WHEEL AND NOTHING HAPPENED. THE VEHICLE  HIT A PARKED CAR. THE POLICE CAME AND A REPORT WAS TAKEN.  NO ONE WAS HURT. DEALER HAS NOT BEEN CONTACTED YET. THE MANUFACTURER SAID A CASE WORKER WILL CALL HER THIS WEEK. THEY CALLED HER BACK AND SAID THE  CASE WAS CLOSED, AND  INSURANCE COMPANY WOULD HAVE TO HANDLE IT. THE VEHICLE WAS LEASED.  *AK",
        "vin": "JH4KB16545C"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/30/2005",
        "dateOfIncident": "12/20/2004",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10134819,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKES RATTLE WHEN GOING OVER BUMPS AND LOCK UP ON THEIR OWN AT LOW SPEEDS OR WHEN MAKING A TURN. I HAVE WENT TO THE MANUFACTURER SEVERAL TIMES AND THEY SAY THERE IS NOTHING THEY CAN DO ABOUT IT. *JB",
        "vin": "JH4KB165X5C"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "08/12/2005",
        "dateOfIncident": "07/23/2005",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10134488,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER WAS LOCKED INSIDE OF THE VEHICLE WITH AN INOPERATIVE KEY FOB.***NO ANSWER REQUIRED***. *MR  *TT",
        "vin": ""
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/03/2005",
        "dateOfIncident": "01/22/2005",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10119690,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "AT LOW SPEEDS ON ROUGH STREETS, ALL 4 WHEEL SUSPENSIONS MAKE A VERY METALLIC NOISE.  I HAVE BEEN LEAD TO BELEIVE THAT IT IS DUE TO MIS MANUFACTURED BRAKE COMPONENTS.  ONE DEALER DID \"BEND\" THE BRAKE \"CLIPS\" AND THE NOISE SUBSIDED FOR ABOUT 1000 MILES, BUT THE PROBLEM IS BACK AND THE DEALERS ARE SAYING IT IS A MFGR PROBLEM AND THEY CAN'T FIX WITHOUT FACTORY TECH SUPPORT WHICH HAS NOT BEEN FORTH COMING.  I ONLY KNOW OTHER 2005 ACURA RL OWNER IN THE SMALL TOWN OF VISALIA (100K POP.) AND HE IS BEING GIVEN THE SAME RUNAROUND.  MY CONCERN IS BRAKE FAILURE OR MY SERIOUSLY SUSPENSION FAILURE SUCH AS BROKEN WELDS OR DEFECTIVE MATERIALS.  I HAVE HAD THE CAR TO TWO DIFFERENT DEALERSHIPS ON THREE DIFFERENT OCCASIONS AND THEY KEEP SAYING THE PROBLEM IS ELSEWHERE, BUT THE ONLY THING THAT HAS MADE THE NOISE GO AWAY WAS WHEN THE DEALERSHIP (SUPERIOR ACURA IN BAKERSFIELD, CA) SUPPOSEDLY BENT THE BRAKE \"CLIPS\".  MYSTERIOUSLY THAT ACTION WAS NOT LISTED ON THE SERVICE REPORT WHEN MY WIFE PICKED UP THE CAR, BUT IT IS IN THEIR SERVICE RECORDS.  ACURA IS HIDING AS SIGNIFICANT PROBLEM AND I AM ABOUT TO ENACT THE CA LEMON LAW AND YOU SHOULD INVESTIGATE WHY HONDA/ACURA IS BEING VERY MYSTERIOUS ABOUT THIS ISSUE - THEY ON ONE HAND SAY THERE IS A FIX ON THE WAY AND THEN IN THE NEXT BREATH SAY THAT THE NOISE IS COMING FROM SOMEWHERE ELSE???",
        "vin": "JH4KB16515C"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "04/20/2005",
        "dateOfIncident": "04/05/2005",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10118199,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER INFORMING THE ACURA SERVICE CENTER ABOUT 3 MONTHS PRIOR TO THE ACCIDENT THAT THE BRAKES WERE NOT FUNCTIONING PROPERLY ON 2 SEPARATE OCCASIONS, AND BEING REASSURED THAT THERE WAS NOTHING WRONG WITH THE BRAKES, I REAR-ENDED ANOTHER CAR ON APRIL 5 BECAUSE THE BRAKES FAILED AGAIN.  ACURA REFUSED TO RUN A COMPUTER CHECK ON THE CAR OR TO SEND ANYONE FROM CALIFORNIA TO INSPECT THE CAR.  THE DEALER SERVICE CENTER HAD INITIALLY TOLD ME THAT THEY WOULD HAVE SOMEONE FROM CALIFORNIA COME TO INSPECT THE BRAKES AFTER THE ACCIDENT.  THEY TOLD ME THAT THEY CHECKED THE BRAKES BY DRIVING THE CAR AND THAT THEY WERE OKAY.  THEY REPEATEDLY TOLD ME THAT THEY WOULD NOT DO ANY FURTHER TESTS PERTINENT TO MY COMPLAINT UNLESS THE CAR INSURANCE COMPANY REQUESTED THAT THIS BE DONE.  I SPOKE WITH SEVERAL PEOPLE AT METLIFE, (OUR INSURANCE COMPANY),  AND THEY TOLD ME THAT THEY DO NOT MAKE SUCH REQUESTS.  WE SHOULD ASK THE MANUFACTURER TO RUN FURTHER TESTING.  I AGAIN SPOKE WITH ACURA SERVICE AND THE CUSTOMER SERVICE CENTER IN CALIFORNIA ,(ON SEVERAL OCCASIONS), AND WAS TOLD THEY WOULD NOT RUN  ANY FURTHER TESTING OF THE BRAKES.  THEY AGAIN STATED THAT THE BRAKES WERE FINE, AND THAT WE SHOULD PICK UP THE VEHICLE.  TO DATE, WE HAVE NOT PICKED UP THE VEHICLE BECAUSE WE ARE AFRAID THAT THE VEHICLE IS NOT SAFE TO DRIVE.  THE DEALER HAS HAD THE CAR SENT TO AN AUTO BODY SHOP.  THIS CAR IS A LEASED VEHICLE. REPEATEDLY I ASKED FOR A WRITTEN REPORT REGARDING WHAT WAS CHECKED AND FOUND WITH BRAKES FAILURES IN THESE OCCASIONS, BUT NO ANSWER WAS RECEIVED  FROM ACURA.   *AK",
        "vin": "JH4KB16555C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/29/2004",
        "dateOfIncident": "12/15/2004",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10109538,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RL",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 ACURA RL BROKE DOWN WITHIN 10 MILES OF DEALERSHIP IMMEDIATELY AFTER PURCHASE. VEHICLE HAS ELECTRICAL PROBLEMS.  *BF   ON EACH BREAKDOWN, THE SH-AWD AND VSA WARNING LIGHT ILLUMINATED AT THE SAME TIME.  THE NAVIGATION SCREEN WHICH CONTROLLED ALL OF THE ELECTRICAL SYSTEM TOTALLY FAILED.  THE YAR RATE SENSOR UNDER THE CENTER DASH WAS DEFECTIVE.   *SC",
        "vin": ""
    }
]