[
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "01/06/2022",
        "dateOfIncident": "12/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446543,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "It is my understanding that the seatbelt on my vehicle is 100% covered under lifetime warranty.  However, my airbag light is on and remains on due to a sensor failure in the driver's side seatbelt buckle and the tensioner.  I went to the Acura dealer in Chantilly, VA to have repaired and was informed by the Service Manager (Kyle C.) that Acura was only going to pay 50%, which was unacceptable as it is a lifetime warranty part (seatbelt).  As this is a significant safety issue, I was not able to pass a state safety inspection due to the issue and was informed by the inspector that it should be covered by the dealer.  As the sensor failure causes the airbag system light and therefore the possibility that the system would NOT work if in an accident, this is a MAJOR safety issue and the response from ACURA/DEALER is unacceptable.  This issue is a well documented problem among owners of this vehicle as well as the improper responses from Acura.",
        "vin": "JH4CL969X5C"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/05/2020",
        "dateOfIncident": "08/30/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11362895,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR BEGINS BRAKING WHILE ACCELERATING AND STARTS SLIDING WHEN BRAKING ON DRY PAVEMENT. THE OTHER MODEL FROM THIS YEAR SUCH AS THE MDX HAVE A RECALL FOR THE VSA SYSTEM HOWEVER THE TSX DOES NOT. THE MDX RECALL FROM 05 MATCHED THE SAME ISSUES THE 05 TSX HAS.",
        "vin": "JH4CL96895C"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/26/2020",
        "dateOfIncident": "06/06/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331138,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 ACURA TSX. THE CONTACT STATED THAT AT START-UP, THE POWER STEERING FAILED TO OPERATE AS DESIGNED, WITHOUT WARNING. THE CONTACT ADDED POWER STEERING FLUID TO THE POWER STEERING RESERVOIR HOWEVER, THE FAILURE PERSISTED. THE VEHICLE WAS NOT TAKEN TO BE INSPECTED OR DIAGNOSED. THE CONTACT REFERENCED THE FAILURE TO NHTSA CAMPAIGN NUMBER: 10V174000 (STEERING) HOWEVER, THE VIN WAS NOT INCLUDED. AUTONATION ACURA GULF FREEWAY (1125 GULF FWY S, LEAGUE CITY, TX 77573) WAS CONTACTED AND INFORMED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS UNKNOWN.*DT*JB",
        "vin": "JH4CL96845C"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/20/2019",
        "dateOfIncident": "12/19/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11290301,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS ALMOST INVOLVED IN A COLLISION WHILE TRYING TO MAKE A LEFT TURN BECAUSE THE POWER STEERING FAILED OUT OF NO WHERE LOCKS UP TO THE POINT IT'S IMPOSSIBLE TO TURN THE WHEEL. I READ UP ONLINE THAT THE ACURA TSX HAVE RACK AND PINION ISSUES. ACURA SHOULD RELEASE A RECALL ESPECIALLY WITH THE HIGH VOLUME THIS PROBLEM OCCURS AND HOW DANGEROUS IT IS. I'M TERRIFIED TO EVEN DRIVE IT. BECAUSE THIS ISN'T THE FIRST TIME THIS HAS HAPPENED. SOMEBODY CAN GET SERIOUSLY HURT OR KILLED IF SOMETHING ISN'T DONE ABOUT THIS ISSUE POOR QUALITY FROM ACURA.",
        "vin": "JH4CL969X5C"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/02/2019",
        "dateOfIncident": "10/25/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11277696,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING NORTH BOUND HWY 6 TOWARDS COLLEGE STATION TEXAS FROM HOUSTON, AND THE VEHICLE STARTED TO NOT ENGAGE WHILE SHIFTING AND THEN THE VEHICLE GAVE NO POWER TO THE WHEELS ,BUT ALL SOLENIODS SEEM TO BE IN WORKING ORDER. AFTER HAVING THE VEHICLE TOWED FROM HEMPSTEAD WHERE IT WAS DISABLED ,AND AFTER DOING SOME RESEARCH THERE SEEMS TO BE AN ISSUE WITH THE SAME GENERATION OF HONDA'S WITH THE SAME AUTOMATIC TRANSMISSION, BUT THERE IS NOT A RECALL FOR THEIR ACURA COUNTERPARTS. THE RECALL ID# 11V395000.",
        "vin": "JH4CL96905C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/10/2019",
        "dateOfIncident": "05/09/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11206893,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "SOMETIME THE AIRBAG LIGHT GOES OFF AND STAY OFF AFTER THE START WHICH IS NORMAL BUT SOMETIME IT STAYS ON NEVER GO OFF AFTER YOU START IT.",
        "vin": "JH4CL968X5C"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/08/2019",
        "dateOfIncident": "12/26/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11184994,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ALONE ON A ICY CITY STREET AND WAS UNABLE TO STOP COMPLETELY WHEN ANOTHER VEHICLE WAS TURNING LEFT. MY VEHICLE WAS TRAVELING AT APPROXIMATELY 12-15 MILES PER HOUR WHEN IT IMPACTED THE OTHER VEHICLE. ON THE OTHER VEHICLE THERE WAS NO DAMAGE AT ALL AND ON MY 2005 ACURA TSX THERE WAS A MINOR INDENTATION IN THE FRONT BUMPER CAUSED BY THE OTHER CARS LICENSE PLATE AND MY PASSENGER AIRBAG HAD DEPLOYED. AFTER DOING MY RESEARCH AND TALKING TO TWO MECHANICS, I WAS INFORMED THAT IT ISN'T STANDARD OPERATING PRACTICE FOR AN AIRBAG TO DEPLOY UNLESS IT IS ABSOLUTELY NECESSARY FOR SAFETY PURPOSES. BASED ON THE SPECIFICS OF THIS MINOR FENDER-BENDER, THE PASSENGER AIRBAG SHOULDN'T HAVE DEPLOYED BECAUSE NOBODY WAS SITTING ON THE PASSENGER SIDE AND DUE THE SPEED AT IMPACT. IN MY OPINION, THIS SEEMED LIKE A DEFECTIVE AIRBAG THAT ACURA SHOULD BE RESPONSIBLE FOR AND NOT MY INSURANCE COMPANY. I CONTACTED ACURA CUSTOMER RELATIONS FOR ASSISTANCE AND BASICALLY GIVEN THE RUN-AROUND FOR 4 WEEKS ONLY TO BE TOLD THAT I NEEDED TO REPORT THE ACCIDENT TO MY INSURANCE AND THEY WOULD PURSUE A CLAIM AGAINST ACURA IF THEY CHOSE TO. ALTHOUGH THESE PARTICULAR AIRBAGS AREN'T ON THE RECALL LIST, I DO BELIEVE THAT THERE ARE ISSUES WITH THE 2005 ACURA TSX AIRBAGS BASED ON THE AMOUNT  COMPLAINTS I'VE READ ONLINE. I HAVE BEEN AN ACURA/HONDA CUSTOMER FOR OVER 15 YEARS AND WAS QUITE DISAPPOINTED IN THEIR RESPONSE AND HOW THEY HANDLED MY REQUEST.",
        "vin": "JH4CL968X5C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/15/2018",
        "dateOfIncident": "08/10/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11120111,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT LOW SPEED, BOTH DRIVER AND PASSENGER SIDE AIRBAGS DEPLOYED.  THERE WAS NO IMPACT BETWEEN MY VEHICLE AND ANY OTHER VEHICLE OR OBJECT.  THE ROOT CAUSE FOR THE DEPLOYMENT IS UNKNOWN AT THIS TIME (INSURANCE INSPECTOR HAS NOT PROVIDED AN UPDATE AT THIS TIME).",
        "vin": "JH4CL96945C"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/15/2018",
        "dateOfIncident": "07/09/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11111477,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VIN IS NOT INCLUDED IN ACURA R35 RECALL CAMPAIGN OF 167,000 2094-2008  4-CYL TSX  RE: POWER STEERING, BUT THE VEHICLE (2005 4-CYL TSX) IS EXPERIENCING THE ISSUE, AS VERIFIED BY THE ACURA DEALERSHIP THIS WEEK. FROM SERVICE RECCOMENDATION - RED: REQUIRES IMMEDIATE ATTENTION -  'LEAKING SYSTEM WAS LOW AND NOISY. JUST STARTING TO LEAK AT RACK ENDS VERY MINOR, PUMP IS BAD'",
        "vin": "JH4CL96965C"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/03/2017",
        "dateOfIncident": "06/20/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11002800,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRANSMISSION'S FINAL DRIVEN GEAR HAS GONE OUT ON ME TWICE IN THE LAST YEAR. AS THE ATTACHED IMAGE OF ANOTHER PERSON'S GEAR SHOWS, TWO TEETH SOMEHOW SHEER OFF, AND WREAK HAVOC ON THE TRANSMISSION BEARINGS AND TRANSMISSION CASING IF NOT RECOGNIZED AND TURNED OFF IMMEDIATELY. BEING A MANUAL TRANSMISSION, I HAVE ALWAYS BEEN CONFIDENT THAT THE TRANSMISSION'S LIFE WOULD BE MUCH LONGER SINCE THE CLUTCH TAKES MOST OF THE WEAR-AND-TEAR OF SHIFTING GEARS.   WITH MULTIPLE DISCUSSION FORUMS FROM OTHER CONSUMERS OUTLINING THE ISSUE AT HAND (INCLUDING THIS ONE: (HTTP://WWW.TSXCLUB.COM/FORUMS/1ST-GEN-PROBLEMS-FIXES/105177-KNOCKING-NOISE-ONLY-WHEN-POWER-WHEELS.HTML ), THE FACT THAT THE PART NUMBER HAS CHANGED SINCE THE CAR WAS MANUFACTURED, AND KNOWING THAT THE NUMBER OF VEHICLES EFFECTED RELATIVELY LOW LEAD ME TO BELIEVE THAT THIS IS A MANUFACTURING DEFECT THAT ACURA DECIDED TO IGNORE RATHER THAN RECALL.   THE FIRST TIME I WASN'T ABLE TO REBUILD THE TRANSMISSION, WHICH ENDED UP COSTING ME OVER $3,000 IN ORDER TO BUY A USED TRANSMISSION AND INSTALL IT, AND THIS SECOND TIME, IT HAS COST ME $1,850 TO REBUILD IT. I NOTICED THE PROBLEM WHILE DRIVING ON THE HIGHWAY BOTH TIMES IT BROKE DOWN ON ME. THE ISSUE IS EASILY RECOGNIZED AS A TICKING SOUND THAT OCCURS EVERY TIME THE WHEEL/AXLE MAKES A FULL TURN. IT WILL GET PROGRESSIVELY LOUDER OVER THE SUBSEQUENT 30 MINUTES OR MORE UNTIL THE CAR IS BASICALLY CLUNKING DOWN THE HIGHWAY. MY CAR HAD APPROXIMATELY 116,000 MILES ON IT THE FIRST TIME, AND THE SECOND TRANSMISSION HAD ABOUT 135,000 WHEN IT BROKE DOWN. THOUGH THE MILEAGE CAN BE POINTED AS BEING 'TOO HIGH', IT IS WELL-KNOWN THAT ACURA AND HONDA ARE LONG-LIVING VEHICLES, INCLUDING THE TRANSMISSION, AND SHOULD NOT HAVE SUCH AN ISSUE AS THIS UNLESS THE CAR WAS BEING RACED AND ABUSED.    IN SUM, THIS IS CERTAINLY A SAFETY ISSUE FOR ANYONE TRAVELING LONG DISTANCES AND SHOULD BE RECALLED.",
        "vin": "JH4CL95865C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/29/2017",
        "dateOfIncident": "12/15/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10969357,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 230,000 MILES THE PASSENGER AIRBAG LIGHT STARTED FLASHING WHEN THE SEAT WAS UNOCCUPIED.  AT 236,000 THE LIGHT IS NOW ON CONSTANTLY.  I HAVE SEEN OTHERS COMPLAIN ABOUT THIS SAME PROBLEM AND HAVE TO AGREE THAT I DO NOT UNDERSTAND WHY THIS YEARS MODEL IS NOT COVERED IN THE TAKATA RECALL.  THIS IS CLEARLY A SAFETY ISSUE.",
        "vin": "JH4CL96815C"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/17/2016",
        "dateOfIncident": "09/16/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10907327,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "AROUND 11:15PM ON 9/16/16 MAKING A LEFT TURN AT APPROXIMATELY 15MPH ALL THE CENTER CONSOLE LIGHTS/CONTROLS WENT OUT, VEHICLE LOST ACCELERATION AS IF IT WERE IN NEUTRAL, SHIFTED TO MANUAL AND PRESSED THE ACCELERATOR AS WELL, STILL NO ACCELERATION, ONLY MOTOR REVVING, TURNED HEADLIGHTS OFF  THEN IT ACCELERATED, ALL DASH WARNING LIGHTS ILLUMINATED, ALL GAUGES FAILED, VEHICLE STALLED, TRIED TO CRANK AND WOULD NOT TURN OVER, PUT A CHARGE TO THE BATTERY, VEHICLE STARTED BUT ALL ISSUES REMAINED. UNSAFE TO DRIVE.",
        "vin": "JH4CL96835C"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/17/2016",
        "dateOfIncident": "07/19/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10907328,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "CONDENSATION IN THE HEADLIGHT HOUSING CAUSING HID BULB TO GO OUT UNABLE TO REPLACE, SAFETY HAZARD",
        "vin": "JH4CL96835C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/27/2015",
        "dateOfIncident": "08/31/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10713797,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG MIL HAS BEEN REGISTERING ON VEHICLES INSTRUMENT PANEL. LIGHT STARTED GLOWING SPORADICALLY FOR SOME TIME, EVEN BEFORE THE MILEAGE AND DATE LISTED  ABOVE. IT WOULD TURN ON OFF ERRATICALLY, WHILE DRIVING VEHICLE. PROBLEM HAS ESCALATED OVER TIME AND NOW IN CONSTANTLY GLOWING ON. \"ACCORDING TO ACURA TSX MANUAL THIS INDICATES AN AIRBAG RELATED SAFETY ISSUE\". HAVE BEEN ABLE TO PHTOTOGRAPH THE AIRBAG MIL LIGHT AT DIFFERENT MILEAGE.  PHOTOGRAPHIC PROOF AVAILABLE UPON REQUEST TO INDICATE PROBLEM ESCALITING OVER TIME.",
        "vin": "JH4CL96865C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/04/2015",
        "dateOfIncident": "04/03/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10703701,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SRS (AIR BAG) INDICATOR BEGAN TO ILLUMINATE INTERMITTENTLY. WHEN THE SRS LIGHT WAS ILLUMINATED, THE AIR BAG SYSTEM WOULD BECOME DISABLED. DUE TO THIS SAFETY HAZARD, MY VEHICLE WAS UNABLE TO PASS MASSACHUSETTS STATE INSPECTION. AN ACURA DEAL PULLED TO CODES AND DISCOVERED A REPORT OF CODE 81-1- INDICATING A FAILURE OF THE CAR SEAT BUCKLE AND REQUIRED REPLACEMENT OF THE DRIVER'S SIDE CAR SEAT BUCKLE AT A COST OF NEARLY $400. THE PART NUMBER IS 04816SECA12ZD.  THE ACURA DEAL IS UNABLE TO COVER THIS REPAIR UNDER THE LIFETIME CAR SEAT BELT WARRANTY. ACURA CLAIMS THIS IS AN ELECTRICAL FAILURE, NOT A MECHANICAL FAILURE. THIS \"ELECTRICAL\" FAILURE DISABLES THE SRS SYSTEM - WHICH IS VERY MUCH A MECHANICAL FAILURE IN THE EVENT OF A COLLISION.   *TR",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/23/2015",
        "dateOfIncident": "03/21/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10701110,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WILL NOT START WHEN IT DOES YOU HAVE TO PRESS ON PEDAL TO KEEP AUTO ON POSSIBLE FUEL.  *TR",
        "vin": "JH4CL96845C"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/19/2014",
        "dateOfIncident": "11/13/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10659461,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 ACURA TSX. THE CONTACT WAS INVOLVED IN A CRASH AND THE AIR BAGS PARTIALLY DEPLOYED. THE CONTACT MENTIONED THAT THE AIR BAGS FAILED TO INFLATE AND THE SPECIFICS OF THE CRASH WERE NOT AVAILABLE. A POLICE REPORT WAS FILED AND NO INJURIES WERE SUSTAINED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 210,000.",
        "vin": "JH4CL96895C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/09/2014",
        "dateOfIncident": "10/22/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10653739,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "ON NOVEMBER 4 2014 I FILE A COMPLAINT WITH THIS CAR BECAUSE THE AIR BAGS DEPLOYED WHEN THE CAR WAS PARKING MY HUSBAND AND MY LITTLE BOY WHERE ON THE CAR . ( IWAS ON THE DENTIST OFFICE ) MY HUSBAND DECIDE TO GO INTO THE CAR AND GIVE HIM SOME SNACK THEN AFTER ABOUT 20 MIN THAT MY HUSBAND TURN ON THE CAR TO USE THE AC THE AIR BAGS PASSENGER AND DRIVER SIDE DEPLOYED ,THE   PASSENGER SIDE BAG HURT MY SON, 22 MONTHS OLD IN HIS EAR AND HEAD ( BABY AND FATHER WAS IN THE FRONT SEAT OF THE PARKED CAR) THE BABY WAS TAKEN TO THE HOSPITAL FOR CRYING SO MUCH. BURNS AND EAR PAIN WERE THE RESULT.AT THE PREVIOUS COMPLAINT DOES NOT MENTION THE DAMAGE THE BABY RECEIVED BECAUSE IT WAS NOT FATAL BUT AFTER REVIEWING OTHER COMPLAINTS BY OTHER OWNERS I DECIDED TO MAKE A NEW COMPLAINT   THIS CAR SUPPOSEDLY HAD AN ACCIDENT IN 2009 FOR WHICH THE COMPANY CARFAX HAS RECORD DECLARED IT A TOTAL LOSS ON THIS CAR BUT I HAVE IN MY POSSESSION A CLEAN DMV TITLE AND CARFAX WHERE THE RECUR CLARIFIES THAT WERE NEVER THE AIRBAGS BE DEPLOYED AND ALSO NEVER HAD STRUCTURAL DAMAGE IAND I ALSO WANT TO CLARIFY THAT WAS NEVER LOST IN THIS CAR I HAVE DISCOVERED AN ERROR IN CARFAX SO THIS CAR NEVER  WHERE A TOTAL LOSS SO NO ACCEPTABLE EXCUSES, THE AIRBAGS FOR THIS ACURA TSX  2005 DEPLOYED FOR NO REASON   IF YOU CHECKED MY CAR'S COMPUTER WILL KNOW THAT NOTHING CAUSE THE FAILURE EVENT ONLY THE FABRICATION DEFECT I HAVE DOCUMENTS SUPPORTING THIS. I DO NOT KNOW WHERE ELSE TO TURN OR WHAT ELSE SHOULD I DO TO GET ACURA ANSWER FOR EMOTIONAL DAMAGE BECAUSE IT WAS A TERRIBLE SHOCK TO SEE MY BABY BURNED HIS EAR BECAUSE OF A MANUFACTURING DEFECT. I ALSO TAKE THE CAR TO THE DEALER THAT DAY CLAIMING THE INCIDENT THEY REFUSED TO REVISE THE CAR ,AGAIN THIS  CAR WAS NEVER INVOLVED IN AN ACCIDENT THAT COULD CAUSE A DEFECT IN AIRBAGS. THANKS I KEEP WAITING FOR YOUR EARLY ACTION ON THIS DANGEROUS DEFECT.  *TR",
        "vin": "JH4CL96905C"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "11/05/2014",
        "dateOfIncident": "10/22/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10652763,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "ACURA TSX 2005   THE VEHICLE WAS PARKING ON 10/22/14 ON ALTA ARDEN SACRAMENTO CA.  THE AIRBAGS SPONTANEOUSLY DEPLOYED FOR NO REASON. THE CAR WAS PARKING WITH A/C RUNNING.  I BUY THIS CAR ON FEBRUARY 2013 I'M THE SECOND OWNER  THE CARFAX SHOW AN ACCIDENT ON 10/2009 FROM THE FIRST OWNER THIS MAKE THE CAR A SALVAGE CAR BUT WITH NO BIGGER DAMAGE SO I CAN'T BELIEVE THE AIR BAGS JUST COME OUT PUTTING MY FAMILY ON DAMAGE JUST FOR NOTHING.   PLEASE HELP US BECAUSE IT MAY BE A RISK FOR OTHERS AND NOW I LOS EVERYTHING I PAY FOR THIS CAR AND  IM SO SCARED TO CONTINUING DRIVING. IF YOU NEED ANY DOCUMENT JUST ET ME KNOW   THIS CAR HAS A CLEAN TITLE NO A SALVAGE   THIS MAKE MY FAMILY SCARED PLEASE TAKE ACTION ON MY PROBLEM  [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "JH4CL96905C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/26/2014",
        "dateOfIncident": "10/01/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10650074,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERMITTENTLY THE AIR BAG LIGHT GOES ON WHEN STARTING THE CAR AND STAYS ON WHILE DRIVING. SINCE THERE HASN'T BEEN A RECALL ON THIS YET, IT WOULD BE VERY EXPENSIVE TO CHECK THIS OUT AND SINCE IT HAPPENS SOMETIMES AND NOT OTHERS, I WAS TOLD IT WOULD BE EVEN MORE EXPENSIVE TO DETERMINE THE REASON AND FIX IT. IF THIS IS A SAFETY ISSUE, ACURA SHOULD ADDRESS IT BEFORE IT CAUSES ACCIDENTS AND INJURIES.  *TR",
        "vin": "JH4CL96965C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/24/2014",
        "dateOfIncident": "03/24/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10615950,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MULTIPLE OCCASIONS, AFTER STARTING VEHICLE, THE AIRBAG LIGHT STAYS ON WHILE DRIVING.  ON OR ABOUT MAY 23, 2014, I REPORTED THE PROBLEM TO DEVON ACURA OF NORWALK, LOCATED IN NORWALK, CT AND WAS ADVISED THAT HAVING THE AIR BAG LIGHT ON WHILE DRIVING MEANS THE AIRBAGS WILL NOT BE ABLE TO DEPLOY IN THE EVENT OF AN ACCIDENT.  GIVEN THE SAFETY ISSUE, I IMMEDIATELY REQUESTED THAT ACURA ADDRESS ISSUE, BUT THE DEALER ADVISED ME THAT I WILL HAVE TO PAY OUT OF POCKET BECAUSE ACURA HAS NOT ISSUE A RECALL TO ADDRESS THE ISSUE.  CONSEQUENTLY, I FILED A COMPLAINT LETTER WITH ACURA REQUESTING THAT THE COMPANY ADDRESS THIS MAJOR SAFETY ISSUE REGARDING MY VEHICLE.  AND TO MY DISAPPOINTMENT, ACURA'S RESPONSE TO MY VEHICLE SAFETY ISSUE IS THAT THEY ARE COMMITTED TO IMPROVING MY CUSTOMER EXPERIENCE IN THE FUTURE.   *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/22/2014",
        "dateOfIncident": "01/31/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10574197,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON THE ABOVE DATE (OR CLOSE TO THE ABOVE DATE)  A RED LIGHT ON THE DASHBOARD WAS GLARING. I THOUGHT IT WAS THE SEAT BELT LIGHT.  MY SON INFORMED ME THE RED LIGHT HAPPENED TO BE THE LIGHT FOR THE AIRBAG.  I BEGAN WATCHING FOR THE RED LIGHT TO COME ON AGAIN.  IT CONSISTENTLY CAME ON.  I CAN'T GUARANTEE THE LIGHT DOESN'T COME ON WHILE DRIVING BECAUSE I HAVE NOT PERSONALLY OBSERVED THE LIGHT COMING ON WHILE DRIVING TO BE TRUE SINCE I STARTED WATCHING.  I DO KNOW FOR A FACT THAT IT DOES WHEN STARTING THE CAR. WHEN I START THE CAR I SIT FOR A WHILE TO SEE IF ALL THE DASHBOARD LIGHTS GO OUT WITHIN A MINUTE OR SO OF STARTING THE CAR.  THE AIRBAG LIGHT GOES OUT BUT COMES BACK ON WITHIN A FEW SECONDS. CONSISTENTLY THE AIRBAG LIGHT REMAINS ON UNTIL THE IGNITION IS IN THE OFF POSITION (THE CAR IS COMPLETELY TURNED OFF).     MY DAD EXPERIENCE THE SAME PROBLEM WITH HIS TRUCK (NOT AN ACURA PRODUCT).  HE DIDN'T HAVE A CHANCE TO TAKE THE TRUCK INTO THE DEALERSHIP.  WHILE STARTING THE TRUCK ONE DAY THE AIRBAG RELEASED ON ITS OWN AS HE STARTED.   THE ABOVE HAS ME AFRAID TO DRIVE THE CAR AND THE MORE I READ AND HEAR ABOUT RECALLS FOR AIRBAGS I WONDER WHY THE ACURA TSX ISN'T LISTED WITH HONDA AND ACURA TL.  I PLAN TO TAKE THE CAR TO THE DEALER WHEN THE LIGHT STAYS ON AND I HEADED TO A SCHEDULED OR PLANNED APPOINTMENT.  ACURA TSX ALSO NEED TO BE ADDED TO THE RECALL LIST.  THERE IS NO EXPLANATION WHY THE AIRBAG LIGHT COMES ON AND STAY ON OTHER THAN A DEFECT.  PLEASE ADVISE OF ANY RECALL TSX AND IF THIS AUTOMOBILE WILL BE ADDED TO THE LIST OF OTHER AIRBAG RECALLS.  *TR",
        "vin": "JH4CL96825C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/23/2013",
        "dateOfIncident": "12/21/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10557056,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ABOUT 50MPH WHEN THE PASSENGER AIRBAG DEPLOYED.  THEN 10-15 SECONDS LATER THE DRIVER AIRBAG DEPLOYED.  I DID NOT HAVE ANY TIRE BLOWOUTS OR HIT ANY OBJECTS IN THE STREET.  THERE WERE NO POT HOLES OR MAN HOLES IN THE STREET WHERE MY AIRBAGS DEPLOYED.  MY TWO YEAR OLD NEPHEW WAS IN A CHILD SAFETY SEAT IN THE BACK SEAT AND INHALED A SUBSTANTIAL AMOUNT OF THE AIRBAG SMOKE AND WAS CHOKING WHICH CAUSED HIM TO VOMIT.  HIS PARENTS WILL BE TAKING HIM TO HIS PEDIATRICIAN ON DECEMBER 23, 2013.  THE DRIVER AIRBAG HIT ME DIRECTLY IN THE FACE WHICH CAUSED SWELLING AROUND MY NOSE, EYES AND UPPER LIP AREA.  I FELT LIGHT HEADED AFTER THE INCIDENT AND THE NEXT DAY.  I'VE ALSO HAD A SLIGHT HEADACHE SINCE THE INCIDENT ON DECEMBER 21, 2013.  I'VE CONTACTED ACURA CORPORATE OFFICE AS WELL AS THE DEALERSHIP.  I ALSO CONTACTED MY INSURANCE COMPANY, WHICH IN MY OPINION SHOULD NOT BE RESPONSIBLE FOR ACURA'S NEGLIGENCE.  THERE WERE NO WARNINGS OR LIGHTS INDICATING A PROBLEM BEFORE THE AIRBAGS DEPLOYED.   *TR",
        "vin": "JH4CL96905C"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/06/2013",
        "dateOfIncident": "06/30/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10542256,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "IN JUNE OF 2012, I WAS TRAVELING AT APPROXIMATELY 60MPH ON A STATE HIGHWAY WHEN A LOUD GRINDING NOISE BEGAN COMING FROM THE ENGINE. AFTER A FEW MOMENTS THE SOUND STOPPED AND HOT AIR BEGAN COMING THROUGH MY VENTS. I TURNED OFF MY AC AND PULLED OFF THE HIGHWAY. THIS HAPPENED ON A WEEKEND AND I TOOK MY CAR INTO THE ACURA DEALERSHIP ON MONDAY. I WAS TOLD THAT MY AC COMPRESSOR HAD DISINTEGRATED ON THE INSIDE AND SENT METAL SHAVINGS AND SHRAPNEL THROUGH THE ENTIRE HVAC SYSTEM.  I HAD THE COMPRESSOR REPLACED WITH AN AFTERMARKET COMPRESSOR TO SAVE MONEY, THE DEALER FLUSHED AND DRIED ALL LINES AND COMPONENTS TO REMOVE ANY TRACES OF METAL AND DEBRIS. THE ENTIRE ORDEAL COST NEARLY $1,700.  IN AUGUST OF 2013 MY COMPRESSOR ONCE AGAIN DISINTEGRATED SENDING DEBRIS THROUGHOUT MY HVAC SYSTEM. ACCORDING TO THE DEALER, THIS OCCURRED ONE MONTH OUTSIDE OF THE WARRANTY ON THE AFTERMARKET PART. THE SAME PROCESS HAD TO BE REPEATED AND I WAS TOLD IT WOULD COST AN ADDITIONAL $1,800 IN REPAIRS AND LABOR.  I DO NOT UNDERSTAND WHY THE 2005 TSX WAS NOT INCLUDED IN THE CLASS ACTION SETTLEMENT WHEN IT USES THE SAME COMPRESSOR AS IT'S PREDECESSOR THE 2004 TSX WHICH WAS INCLUDED IN THE SETTLEMENT. I HAVE HEARD OF MANY INSTANCES OF THIS FAILURE HAPPENING IN THE 2005'S.",
        "vin": "JH4CL96915C"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/19/2013",
        "dateOfIncident": "06/17/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10525735,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE POWER STEERING RACK STARTED LEAKING AND HAD TO BE REPLACED. I WAS TOLD THE TIE ROD ENDS WERE LEAKING AND THE ENTIRE RACK WOULD HAVE TO BE REPLACED. I RESEARCHED ONLINE AND APPARENTLY IT IS A COMMON ISSUE WITH THE TSX AT THIS MILEAGE.  *TR",
        "vin": "JH4CL96815C"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/30/2013",
        "dateOfIncident": "04/26/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10510053,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 ACURA TSX. THE CONTACT STATED THAT WHILE WAITING AT A TRAFFIC LIGHT, THE VEHICLE STALLED AND THE CHECK ENGINE WARNING LAMP ILLUMINATED. THE CONTACT MENTIONED THAT THE TRANSMISSION SLIPPED GEARS WITHOUT WARNINGS. THE VEHICLE WAS TAKEN TO THE DEALER. THE TECHNICIAN DIAGNOSED THAT THE THROTTLE BODY NEEDED TO BE CLEANED. THE VEHICLE WAS REPAIRED BUT THE FAILURE RECURRED. THE VEHICLE WAS TAKEN BACK TO THE DEALER WHERE THE TECHNICIAN VERIFIED THAT THE TRANSMISSION HAD AN INTERNAL FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STATED THAT THEY WOULD CALL THE CONTACT AT A LATER DATE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE 70,000 AND THE CURRENT MILEAGE WAS 100,800.  *TR",
        "vin": "JH4CL96805C"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/29/2012",
        "dateOfIncident": "06/21/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10463575,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 ACURA TSX. THE CONTACT WAS DRIVING 60 MPH ND LOST CONTROL OF THE VEHICLE. AS A RESULT, THE VEHICLE FLIPPED OVER. DURING THE CRASH, THE PASSENGER SIDE AIR BAG DEPLOYED BUT NOT THE DRIVER SIDE AIR BAGS. THE VEHICLE WAS DESTROYED AS A RESULT OF THE CRASH. THE CONTACT SUSTAINED SEVERE INJURIES TO THE HEAD, NECK, BACK AND RIBS. THE CONTACT WAS TAKEN TO THE HOSPITAL FOR THE INJURIES. THE CONTACT DID NOT CALL THE MANUFACTURER. THE FAILURE MILEAGE WAS 60,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/25/2012",
        "dateOfIncident": "05/08/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10459685,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MY A/C COMPRESSOR HAS FAILED 20 DAYS AFTER MY WARRANTY EXPIRED. COMPRESSOR MADE GRINDING NOISE FOR A FEW SECONDS, THEN A LOUD BANG, THEN STOPPED WORKING. I'VE READ THAT THERE ARE SIMILAR ISSUES WITH 2004 VEHICLES THAT HAVE BEEN ADDRESSED, NOT SURE WHY 2005 VEHICLES WEREN'T INCLUDED. APPARENTLY THEY WERE AWARE THAT THESE PARTS WERE BAD AND WOULDN'T LAST WHEN VEHICLES WERE MANUFACTURED. DEALER HAS STATED REPAIR COSTS TO BE AROUND 2,600.  *TR",
        "vin": "JH4CL96835C"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/15/2012",
        "dateOfIncident": "05/10/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10458537,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 ACURA TSX. WHILE DRIVING AT APPROXIMATELY 45 MPH ANOTHER VEHICLE CRASHED ONTO THE FRONT DRIVERS SIDE FENDER FORCING THE VEHICLE HEAD ON INTO A GUARD RAIL. THE AIR BAGS DID NOT DEPLOY. THE POLICE REPORTED TO THE SCENE AND A REPORT WAS FILED. THE VEHICLE WAS TOWED TO AN AUTO COLLISION SHOP. THE VEHICLE WAS DESTROYED. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 158,000.",
        "vin": "JH4CL96895C"
    },
    {
        "components": "ELECTRICAL SYSTEM,INTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/26/2011",
        "dateOfIncident": "05/22/2011",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10402860,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "CENTER CONSOLE LIGHTS WENT DARK FOR AC/HEAT AND RADIO/CD CONTROLS.  *TR",
        "vin": "JH4CL96845C"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/01/2010",
        "dateOfIncident": "05/14/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10353288,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 CPO TSX HAS CLUTCH SLIP ISSUE AT ONLY 56K MILES.  WE BOUGHT THE CAR AS A CERTIFIED PRE-OWNED VEHICLE AND WITHIN 4 MONTHS, THE CLUTCH NEEDS REPLACEMENT.      WHEN WE TOOK DELIVERY OF THE CAR, WE IMMEDIATELY NOTICED THE CAR'S CLUTCH WAS NOT GRABBING HARD IN 1ST, 2ND AND 3RD GEAR WHEN TRYING TO BRISKLY ACCELERATE.  WE NOTIFIED THE DEALERSHIP AND THEY'RE 'TEST DRIVE' DETERMINED THERE WAS NO PROBLEM WITH THE CAR.  WE DROVE FOR 2 MORE MONTHS AT WHICH TIME, THE CLUTCH WOULD SLIP WHEN MERGING ON THE HIGHWAY IN 4TH, 5TH, AND 6TH GEAR.      DEALESRSHIP WE PURCHASED THE VEHICLE FROM, ELK GROVE ACURA, IS NOT TAKING ANY RESPONSIBILITY FOR THE ISSUE DESPITE HAVING DOCUMENTATION STATING THE CLUTCH WAS SLIPPING.  THEY CLAIM IT'S A WEAR ITEM CAUSED BY US.    THE CAR WILL BE GOING TO ANOTHER DEALERSHIP LOCAL TO US FOR A CLUTCH REPLACEMENT WHICH WE WILL HAVE TO PAY FOR. *TR",
        "vin": "JH4CL958X5C"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/17/2010",
        "dateOfIncident": "08/16/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10350188,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT BRAKE FAILURE.  FRONT BRAKE ROTORS ARE WARPING TO CAUSE SERVE VIBRATIONS AND VERY WEAK BRAKES.  THIS HAD OCCURRED BEFORE REACHING 50,000 MILES.  ROTORS AND PADS NEED TO BE REPLACED.  I DO NOT WANT TO USE ORIGINAL DEALER REPLACEMENT PARTS DUE TO THE FACT IT WILL JUST HAPPEN AGAIN.  THIS IS WELL KNOW ON INTERNET AND EVEN MY LOCAL INSPECTION GARAGE KNOWS ABOUT IT.  SOMETHING NEEDS TO BE DONE PLEASE. *TR",
        "vin": "JH4CL96905C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/12/2010",
        "dateOfIncident": "08/03/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10348923,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE A/C SYSTEM (MAINLY THE A/C COMPRESSOR, CLUTCH, AND STATOR) IN MY 2005 ACURA TSX SUDDENLY STOPPED WORKING AT 71,000 MILES WITHOUT ANY WARNING. I'VE RESEARCHED THIS ISSUE ONLINE AND DISCOVERED THAT MANY 2004 AND ABOVE MODEL-YEAR ACURA TSX VEHICLES HAVE THIS PROBLEM. WWW.ACURAZINE.COM HAS MANY STORIES OF OWNER DISSATISFACTION OVER THE ACURA TSX A/C SYSTEM. MY CAR WAS DIAGNOSED BY A PROFESSIONAL TECHNICIAN AT AAMCO, AND HE INFORMED ME THAT \"THESE CARS\" (ACURA TSX) ARE WELL-KNOWN TO HAVE FAULTY A/C SYSTEMS AND THAT THERE WAS A \"DEALER NOTE\" IN HIS COMPUTER SYSTEM SUGGESTING THAT THE CAR BE TAKEN TO AN ACURA DEALER.     MY CAR WARRANTY HAS EXPIRED, AND NOW I'M FACING APPROXIMATELY $2000 IN REPAIRS BECAUSE ACURA HAS INSTALLED WHAT IS APPARENTLY KNOWN TO BE A FAULTY A/C SYSTEM IN THEIR TSX MODELS. I DON'T SEE HOW IT IS REASONABLE FOR ACURA TSX OWNERS TO PAY SUCH HIGH SUMS OF MONEY FOR ACURA'S FAULTY ENGINEERING/CRAFTSMANSHIP.    I ADMIRE ACURA VEHICLES AND ENJOY DRIVING MY TSX, BUT I WOULD LIKE TO REQUEST SOME RESEARCH INTO THIS MATTER IF POSSIBLE SO THAT MORE PEOPLE DON'T HAVE TO FORK OVER THOUSANDS OF DOLLARS TO FIX ISSUES THAT CAN AND SHOULD BE PREVENTED.     HONDA/ACURA SHOULD BE ACCOUNTABLE TO THE HIGH QUALITY STANDARDS THEY ARE TYPICALLY KNOWN FOR. *TR",
        "vin": "JH4CL96865C"
    },
    {
        "components": "STEERING,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/01/2010",
        "dateOfIncident": "10/01/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10340947,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "IN SEPTEMBER 2009 I PURCHASED MY 2005 ACURA TSX FROM PAUL BURNS AUTO GROUP WHO HAD RECEIVED THE CAR VIA DAVIS ACURA.  I BROUGHT IT HOME I NOTICED THE CAR WAS PINK, ESPECIALLY FADED PAINT ON THE HOOD, TRUNK AND TOP OF THE CAR. AFTER A DAY OR TWO OF DRIVING I NOTICED A NOISE AND HAD TROUBLE STEERING. I TOOK IT TO MY MECHANIC AND HE TOLD ME THERE WAS A SEVERE LEAK IN POWER STEERING FLUID COMING FROM THE RACK. I BATTLED WITH THE DEALER AND WAS ABLE TO REPLACE THE RACK FOR THE HALF THE COST IT WOULD HAVE. THE CAR'S WARRANTY EXPIRED IN APRIL 2009 ONLY SIX MONTHS AFTER I BOUGHT IT. AFTER SEVERAL ESTIMATES AND COUNTLESS HOURS OF RESEARCH I FOUND THAT THIS COLOR MILANO RED WAS DEFECTIVE AND PREMATURELY TURNING PINK IN OTHER CARS THIS MAKE MODEL AND YEAR.     THE ACURA IN NAPLES FLORIDA WAS PAYING TO HAVE AT LEAST 6 CARS THAT I KNOW OF REPAINTED. I SPOKE WITH BOTH THE SERVICE MANAGER AND THE INDIVIDUAL BODY SHOP CLERK. I SPOKE WITH CLIENT SERVICES AND SINCE THE CAR WAS OUT OF WARRANTY THEY WOULD NOT PAY TO REPAINT.  I TRIED THEM AGAIN WAS STILL REJECTED. EVERY BODY SHOP I GO TO TELLS ME THAT TO WRITE A LETTER TO THE MANUFACTURER BECAUSE THIS IS AN OBVIOUS DEFECT IN THE PAINT.  I AM WRITING THIS LETTER TO SEE IF IN GOOD FAITH HONDA WILL STAND BY ITS' PRODUCT. I AM A CONSISTENT CUSTOMER WHO GETS REGULAR MAINTENANCE FROM PIAZZA ACURA IN ARDMORE.    I HAVE JUST RECEIVED A LETTER FROM ACURA STATING THAT THERE IS A RECALL IN A HOSE THAT IF LEAKS COULD POSSIBLY LEAD TO A FIRE UNDER THE HOOD. I RESPECT HONDA FOR AGREEING TO FIX THIS PROBLEM. BUT FOR ALL THESE PROBLEMS IN A HIGH END LUXURY CAR I FEEL THE LEAST HONDA COULD DO IS PAY TO HAVE MY DEFECTIVE PAINT FIXED. AFTER ALL I AM NOT TRYING TO SAY THAT I NEED ROCK CHIPS OR NORMAL WEAR AND TEAR THE CLEAR COAT ON THE VEHICLE IS EXCELLENT IT IS THE PAINT UNDERNEATH THE CLEAR THAT IS FADED.    PEOPLE LOOK AT MY CAR AND SAY THAT'S AN ACURA AND THAT IS WHAT THERE PAINT IS LIKE AFTER 5 YEARS? IF NO ACTION IS TAKEN I WILL BE FORCED TO TAKE MY. *TR",
        "vin": "JH4CL96875C"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/07/2010",
        "dateOfIncident": "05/01/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10335063,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DASHBOARD CRACK IN 2005 ACURA TSX AROUND THE OUTLINE OF THE PASSENGER SIDE AIRBAG. *TR",
        "vin": "JH4CL96805C"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/01/2009",
        "dateOfIncident": "09/29/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10285943,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 ACURA TSX PRESENTED AT DEALER WITH PREMATURELY-DETERIORATED POWER STEERING HOSE.  POWER STEERING FLUID LEAKING ON HOT ENGINE PRESENTS FIRE HAZARD, PER DEALER SERVICE MANAGER.  HOSE WAS REPLACED UNDER RECALL ON TL AND RL MODELS, BUT NOT THE TSX. *TR",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "11/15/2008",
        "dateOfIncident": "11/08/2008",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10248877,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "MICHELIN TIRE CORP.",
                "productMake": "MICHELIN",
                "productModel": "PILOT",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "LITTLE TINY CRACKS HAVE APPEARED ON THE SIDEWALL OF THE TIRES NEAR THE RIM, WHICH I BELIEVE ARE CREATED DUE TO THE TIRES BEING DRY ROTTED. DOES THIS MEAN THE TIRES ARE TOO OLD WHEN THEY WERE PUT ON THE CAR? THE CAR DEALERSHIP MAKES IT SOUND LIKE THIS IS NORMAL WEAR. *TR",
        "vin": "JH4CL96915C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/19/2008",
        "dateOfIncident": "06/21/2007",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10228181,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 ACURA TSX.  WHILE DRIVING 70 MPH, THE VEHICLE STALLED ON THREE OCCASIONS.  THE DEALER WAS UNABLE TO DETERMINE THE CAUSE OF THE FAILURE BECAUSE THE SENSOR FROM THE DIAGNOSTIC WOULD NOT PROVIDE AN ERROR CODE.  THE VEHICLE IS PRESENTLY WITH THE DEALER.  THEY HAVE TEST DRIVEN THE VEHICLE, BUT ARE UNABLE TO DUPLICATE THE FAILURE.  THE DEALER AND THE MANUFACTURER CONTINUE TO STATE THAT THERE IS NOTHING WRONG WITH THE VEHICLE.  THE FAILURE MILEAGE WAS 6,000 AND CURRENT MILEAGE WAS 8,050.",
        "vin": "JH4CL96885C"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/01/2007",
        "dateOfIncident": "10/07/2006",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10198120,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR BUMPER WAS DISCOLORED AND THE ACURA DEALERSHIP, STERLING MCCALL ACURA, ADVISED ME THAT IT WAS MY IMAGINATION. LATER WHEN THE BUMPER PEALED OFF AND SOME OF THE ORIGINAL PAINT WAS SHOWING THROUGH THEY HAD NO CHOICE BUT TO FIX THE CAR. THE CLAIM AT 4K MILES THERE WAS A LITTLE FENDER BENDER, BUT I'M DOUBTFUL THAT IS THE TRUTH. THE REAR DOORS DON'T CLOSE RIGHT AND SQUEAK AS IF ITS HAD A REAR END COLLISION. I COMPLAINED TO THE BBB, ACURA CLIENT SERVICES (NO HELP) AND STERLING MCCALL THEMSELVES. THEY SIMPLY SLAPPED ON MORE PAINT AND NOW ITS PEALING AGAIN!  *TR",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/31/2007",
        "dateOfIncident": "07/15/2007",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10197922,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "MICHELIN TIRE CORP.",
                "productMake": "MICHELIN",
                "productModel": "PILOT",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "DRIVING ON HIGHWAY, TAKING A RAMP FROM ONE ROAD TO ANOTHER, NOTICED A SOUND COMING FROM RIGHT REAR TIRE.  WHILE TRYING TO REACH AN EXIT, FELT THE CAR PULLING TO THE RIGHT, AND WAS ABLE TO PULL OFF ON SHOULDER.  WHEN THE CAR CAME TO A REST, THE TIRE WAS SITTING ON THE ROAD BEHIND THE CAR, STILL IN AN INTACT CIRCLE.  THE TIRE WAS INSPECTED BY AN AUTHORIZED TIRE DEALER WHO COULD FIND NO ROAD HAZARD METHOD OF TIRE FAILURE, AND THE MANUFACTURER DECIDED THAT ALTHOUGH THEY NORMALLY DO NOT COVER THIS TYPE OF DAMAGE UNDER WARRANTY, THEY PAID 35% OF THE REPLACEMENT COST OF A NEW TIRE.  THE DAMAGE LOOKS LIKE A SIDEWALL FAILURE.  *JB",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/16/2007",
        "dateOfIncident": "05/09/2007",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10190902,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS INVOLVED IN AN AUTOMOBILE ACCIDENT,WHERE I WAS REAR ENDED AND PUSHED UP AGAINST THE CAR IN FRONT OF ME. THE CAR SUSTAINED FRONT AND REAR DAMAGE, BUT NONE OF THE AIRBAGS DEPLOYED. THE CAR WAS DECLARED A TOTAL LOSS BY  THE  INSURANCE  COMPANY, ALLSTATE. THIS WAS A BRAND NEW 2005 ACURA TSX.  *AK",
        "vin": "JH4CL96885C"
    },
    {
        "components": "UNKNOWN OR OTHER,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/03/2007",
        "dateOfIncident": "02/13/2006",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10184127,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "ACURA OF MEMPHIS IS SELLING VEHICLES PREVIOUSLY INFESTED AND DAMAGED BY RODENTS, PASSING THE COST OF REPAIRS TO THE CONSUMERS. I AM A VICTIM.  HOW CAN THIS BE?  THIS IS THE FIFTH BRAND NEW CAR THAT I HAVE PURCHASED/OWNED AND I HAVE NEVER HEARD OF OR EXPERIENCE A PROBLEM WITH RODENTS NESTING UNDER THE HOOD   THE CAR IS LESS THEN TWO YEARS OLD.  MY CAR IS DRIVEN EVERY DAY  IS ACURA MAKING CARS WITH PRODUCTS THAT ATTRACT RODENTS AND RACCOONS?  WHERE WAS MY CAR PREVIOUSLY STORED BEFORE ARRIVING TO THE DEALERSHIP?  HOW LONG WAS MY VEHICLE IN STORAGE BEFORE ARRIVING TO THE DEALERSHIP AND BEING SOLD TO ME AND OTHER CONSUMERS?   RODENTS NESTING AND CHEWING WIRES UNDER THE HOOD, THIS HAPPENED BEFORE I PURCHASE THIS VEHICLE AND NOW IT HAS MANIFESTED 17 MONTHS LATER.  I WANT ALL REPAIRS DONE AT NO COST OR A NEW VEHICLE. THERE IS NO WAY OF KNOWING WHAT ELSE IS GETTING READY TO STOP FUNCTIONING OR WHAT WILL BE THE NEXT WARNING LIGHT TO DISPLAY ON MY DASH BOARD.  *JB",
        "vin": "JH4CL96875C"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/02/2007",
        "dateOfIncident": "02/13/2007",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10184077,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "ACURA OF MEMPHIS IS SELLING VEHICLES PREVIOUSLY INFESTED AND DAMAGED BY RODENTS, PASSING THE COST OF REPAIRS TO THE CONSUMERS. I AM A VICTIM. HOW CAN THIS BE?  THIS IS THE FIFTH BRAND NEW CAR THAT I HAVE PURCHASED/OWNED AND I HAVE NEVER HEARD OF OR EXPERIENCE A PROBLEM WITH RODENTS NESTING UNDER THE HOOD     THE CAR IS LESS THEN TWO YEARS OLD     MY CAR IS DRIVEN EVERY DAY    IS ACURA MAKING CARS WITH PRODUCTS THAT ATTRACT RODENTS AND RACCOONS?    WHERE WAS MY CAR PREVIOUSLY STORED BEFORE ARRIVING TO THE DEALERSHIP?    HOW LONG WAS MY VEHICLE IN STORAGE BEFORE ARRIVING TO THE DEALERSHIP AND BEING SOLD TO ME AND OTHER CONSUMERS?     RODENTS NESTING AND CHEWING WIRES UNDER THE HOOD, THIS HAPPENED BEFORE I PURCHASE THIS VEHICLE AND NOW IT HAS MANIFESTED 17 MONTHS LATER.    I WANT ALL REPAIRS DONE AT NO COST OR A NEW VEHICLE. THERE IS NO WAY OF KNOWING WHAT ELSE IS GETTING READY TO STOP FUNCTIONING OR WHAT WILL BE THE NEXT LIGHT TO DISPLAY ON MY DASH BOARD.    MY AUTOMOBILE INSURER SAYS THEY DO NOT COVER RODENT DAMAGE.  *JB",
        "vin": "JH4CL96875C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "09/27/2006",
        "dateOfIncident": "08/02/2006",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10169386,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 ACURA TSX MULTIPLE FAILURES EXPERIENCED UNDER WARRANTY OF AIR CONDITIONING, TRANSMISSION, EXHAUST MANIFOLD.  TRANSMISSION NOT PROPERLY REPAIRED, AS RESULT OF REPAIR ERRORS AND DEFECTS INTERIOR CABIN OF VEHICLE REPEATEDLY FLOODED WITH SEVERAL GALLONS OF WATER.  *JB",
        "vin": "JH4CL96835C"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/24/2006",
        "dateOfIncident": "07/23/2006",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10163276,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "MICHELIN TIRE CORP.",
                "productMake": "MICHELIN",
                "productModel": "MXM",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED THAT WHILE DRIVING AT 50 MPH, THE FRONT RIGHT TIRE LOST AIR.  AFTER THE VEHICLE WAS PULLED OFF THE ROAD, AND AN ATTEMPTED WAS MADE TO REFILL THE TIRE.  THE STEEL BELT WAS OBSERVED TO BE BROKEN.  THERE WERE BLISTERS ON SIDEWALL; BLISTERS WERE ON OTHER 3 TIRES ALSO.",
        "vin": "JH4CL96925C"
    },
    {
        "components": "EQUIPMENT,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/28/2005",
        "dateOfIncident": "07/20/2005",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10130482,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "SILVERWING",
                "productYear": "1982",
                "type": "Equipment"
            }
        ],
        "summary": "NOT HAPPY WITH THE QUALITY OF THE VEHICLE.  *JB",
        "vin": "JH4CL968X5C"
    }
]