[
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/28/2021",
        "dateOfIncident": "05/01/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434688,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R 1200 RT",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2005 BMW R 1200 RT. The contact stated while starting the motorcycle and it began to stall. The contact stated no warning light was illuminated. The motorcycle was not drivable. The motorcycle was towed to an independent mechanic and the contact was informed that the fuel pump needed to be replaced. The motorcycle was repaired. The contact stated that on 7/2021, he noticed fuel leaking from the fuel pump onto the engine. The contact called the local dealer and made them aware of the failure. The motorcycle was not repaired but was pending repairs. Upon investigation, the contact associated the failure with NHTSA Campaign Number: 13V617000 (Fuel System, Gasoline) however, the VIN was not included. The manufacturer had not been informed of the failure. The failure mileage was approximately 52,000.",
        "vin": "WB10388095Z"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/24/2021",
        "dateOfIncident": "04/24/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413715,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R 1200 RT",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "CRACKED THROTTLE CONTROL CABLE CONNECTIONS TO BOTH THROTTLE BODY THROTTLE CONTROL SHAFTS.  IF THIS FAILS, THE THROTTLES RETURN TO IDLE WITHOUT ANY ABILITY TO ACCELERATE.  THIS TYPE OF FAILURE HAS BEEN REPORTED BY OTHER OWNERS OF THE SAME MODEL.  I NEED TO REPAIR PRIOR TO TRAVEL USE TO AVOID THIS SITUATION.",
        "vin": "WB103880X5Z"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/26/2014",
        "dateOfIncident": "08/25/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10628565,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R 1200 RT",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MOTORCYCLE FUEL GAUGE NOT WORKING.  ALWAYS SHOWING EMPTY.  TOOK MOTORCYCLE TO DEALER AND HAD FUEL LEVEL SENSOR REPLACED.  MOTORCYCLE FUEL GAUGE NOW SHOWING FULL ALL THE TIME UNTIL ONE RECENT FUEL FILL UP IT WENT BACK TO SHOWING EMPTY.  I HAD BEEN USING THE TRIP METER TO JUDGE FUEL LEVEL FILLING THE TANK AT 250 MILES.  ON THE DATE OF THIS INCIDENT, IN THE MIDDLE OF HEAVY TRAFFIC, I RAN OUT OF FUEL AT APPROX. 200 MILES.  I MANAGED TO GET OFF OF THE ROAD WITHOUT GETTING RUN OVER.  I HAVE CALLED BMW NORTH AMERICA AND WAS TOLD THAT THE FUEL SENSOR PROBLEM WAS NOT KNOWN ABOUT BUT THAT SHE WOULD TAKE MY COMPLAINT.  I HAVE READ MANY, MANY......MANY COMPLAINTS FROM BMW OWNERS ABOUT THIS PROBLEM.  I WAS TOLD BY A DEALER THAT BMW HAD EXTENDED THE WARRANTY TO COVER THIS PROBLEM FOR 12 YEARS BUT BMW HAD NOT FIXED THE PROBLEM.  THEY WOULD JUST CONTINUE TO REPLACE THE SENSORS UNTIL THE 12 YEARS PASSED.  THIS IS A SERIOUS PROBLEM EVIDENTLY NOT TAKEN SERIOUSLY BY BMW.  IN THE LATTER PART OF 2010 THEY WENT BACK TO A FLOAT STYLE SENSOR BUT HAVE MADE NO ATTEMPT TO FIX THE PROBLEM CREATED BY A POSSIBLE MATERIAL DEFECT AND/OR POOR DESIGN IN THEIR FUEL LEVEL SENSORS INSTALLED IN MODEL YEARS 2005 THROUGH MIDDLE OF 2010.  *TR",
        "vin": "WB10388075Z"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/14/2014",
        "dateOfIncident": "05/14/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10588441,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R 1200 RT",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "REPORT RECEIPT DATE: DEC 12, 2013   NHTSA CAMPAIGN NUMBER: 13V617000   COMPONENT(S): FUEL SYSTEM, GASOLINE   MY COMPLAINT : RECALL LETTER NOT RECEIVED FROM BMW.  *TR",
        "vin": "WB10388055Z"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/22/2013",
        "dateOfIncident": "05/08/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10504130,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R 1200 RT",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL LEAK FROM THREADS ON TANK.  *TR",
        "vin": "WB10388075Z"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/11/2012",
        "dateOfIncident": "04/10/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10454834,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R 1200 RT",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 BMW R 1200 RT. WHILE PARKED WITH THE ENGINE RUNNING, FUEL BEGAN TO SPILL ONTO THE ENGINE AND ONTO THE CONTACT. THE CONTACT INSPECTED THE VEHICLE AND NOTICED A FRACTURE ON THE FUEL FLANGE NEAR THE FUEL PUMP QUICK DISCONNECT. THE VEHICLE WAS NOT TAKEN TO THE DEALER FOR A DIAGNOSTIC TEST. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 53,000.",
        "vin": "WB10388095Z"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/06/2012",
        "dateOfIncident": "01/07/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10446835,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R 1200 RT",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 BMW R 1200 RT  REAL WHEEL FLANGE CRACKED  THIS FLANGE SUPPORTS THE REAR WHEEL BRAKE DISC AND ALSO THE REAR WHEEL ITSELF  COMPLETE FAILURE OF THIS FLANGE WOULD RESULT IN TOTAL LOSS OF CONTROL OF VEHICLE. *TR",
        "vin": "WB10388085Z"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/20/2012",
        "dateOfIncident": "01/20/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10444670,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R 1200 RT",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL PUMP FLANGE CRACKED IN AT LEAST FOUR PLACES THAT I CAN PHOTOGRAPH.  FOR HOW LONG THIS HAS BEEN I CANNOT DETERMINE.  ALTHOUGH IT IS NOT LEAKING FUEL AT THIS TIME SEVERAL RIDERS OF THIS MODEL HAVE EXPERIENCED THE EXACT FLANGE FAILURE THAT RESULTED IN FUEL FLOWING OUT OF THE CRACK AND ONTO THE MOTORCYCLE AND RIDER.  FUEL ON A PERSON, IN THE AIR AND ON THE VEHICLE IS A CHEMICAL HAZARD AND ENVIRONMENTAL HAZARD AT THE VERY LEAST AND FUEL IN THE PRESENCE OF AN IGNITION SOURCE INCHES AWAY IS DEADLY. I BELIEVE IT IS A MAJOR SAFETY ISSUE AND SOMETHING SHOULD BE DONE ABOUT IT BY THE MANUFACTURER.   8TT",
        "vin": "WB10388035Z"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/01/2011",
        "dateOfIncident": "09/30/2011",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10428629,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R 1200 RT",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "FAILURE OF THE FUEL PUMP HOUSING HIGH-PRESSURE FUEL QUICK DISCONNECT REINFORCEMENT FLANGE CRACKS UNDER HIGH PRESSURE CYCLING AND LEAKS, SENDING RAW FUEL DOWN THE LEFT FAIRING IN CLOSE PROXIMITY OF THE VEHICLES LEFT EXHAUST PIPE AND IGNITION SYSTEM COMPONENTS.  THE VEHICLES FAIRING EFFECTIVELY CAPTURES THE FUEL VAPORS CREATING A SIGNIFICANT RISK FOR FIRE.  IN ADDITION, LEAKING FUEL, STREAMING ALONG THE LEFT FAIRING IS EXHAUSTED ON THE RIDERS LEFT LEG, CREATING SIGNIFICANT RISK FOR THE RIDER EVEN AFTER DISMOUNTING THE VEHICLE.  CONSEQUENCES OF FAILURE  THE COMBINATION OF HIGH FUEL PRESSURE AND NEGLIGENT DESIGN CREATE SUBSTANTIAL RISK FOR RIDERS OF THE IMPACTED VEHICLES.  THERE ARE MULTIPLE NEGATIVE CONSEQUENCES OF THIS FAILURE, A FEW OF WHICH ARE OUTLINED BELOW:  1. RIDERS BECOME FUEL SOAKED AS FUEL LEAKS DOWN THE LEFT FAIRING AND THEN IS FORCED BY FAIRING AIRFLOW DYNAMICS ON TO THE RIDERS LEFT LEG.  2. FUEL VAPORS, CAPTURED BY THE FAIRING AND HEATED BY THE EXHAUST PIPE BECOME EXTREMELY VOLATILE AND COULD LEAD TO A FIRE AND/OR EXPLOSION.  3. FUEL VAPORS RISING FROM THE FAIRING AND EXITING THE TOP OF THE FAIRING BETWEEN THE INSTRUMENT PANEL AND FUEL TANK, ARE BLOWN BY AIRFLOW INTO THE RIDERS FACE.  THE CARCINOGENIC ASPECTS OF FUEL INHALATION ARE DOCUMENTED.  PRELIMINARY ANALYSIS  EXAMINATION OF THE FUEL PUMP ASSEMBLY SUGGESTS THAT THE HIGH-PRESSURE FUEL QUICK DISCONNECT REINFORCEMENT FLANGE WAS INADEQUATELY DESIGNED FOR THE FUEL PUMP OUTLET PRESSURES. BMW'S CHOICE OF A NON-METALLIC (COMPOSITE) PUMP HOUSING COMBINED WITH A COMPOSITE HIGH-PRESSURE DISCONNECT FITTING WAS UNWISE AND THE FAILURE MECHANISM IS OBVIOUS.  HIGH PUMP PRESSURE EXPANDS THE COMPOSITE HIGH-PRESSURE FITTING CAUSING IT TO READILY LOAD THE FUEL PUMP HIGH-PRESSURE QUICK DISCONNECT FLANGE. OVER TIME, PRESSURE CYCLING CAUSES THE QUICK DISCONNECT REINFORCEMENT FLANGE TO CRACK ALLOWING FUEL TO LEAK.  UPDATED 10/20/11.*JB",
        "vin": "WB10388045Z"
    }
]