[
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/31/2018",
        "dateOfIncident": "10/10/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11144510,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 BMW R1200 GS. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 20 MPH, FUEL HAD LEAKED FROM THE FUEL PUMP FLANGE AND SPRAYED ONTO THE RIDERS LEG AND PARTS OF THE MOTORCYCLE. THE CAUSE OF THE FAILURE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER AND AN UNKNOWN LOCAL DEALER WERE NOTIFIED OF THE FAILURE BUT NO ASSISTANCE WAS OFFERED. THE CONTACT WAS INFORMED THAT THE MOTORCYCLE WAS NOT INCLUDED IN THE NHTSA CAMPAIGN NUMBER: 13V617000 (FUEL SYSTEM) ALTHOUGH THE MOTORCYCLE HAD EXPERIENCED THE SAME FAILURE LISTED IN THE RECALL. THE FAILURE MILEAGE WAS 24,000.",
        "vin": "WB10317A15Z"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/25/2017",
        "dateOfIncident": "05/16/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11001223,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "ABS PUMP FAILURE.",
        "vin": "WB10317AX5Z"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "05/18/2015",
        "dateOfIncident": "05/17/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10717109,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I EXPERIENCED A 100% NO BRAKES SITUATION COMING INTO A SLOW SPEED 90 DEGREE TURN ON A BACK ROAD. LUCKILY I HADN'T BEEN GOING TO FAST AND WAS ABLE TO DOWN SHIFT AND SCRUB A LITTLE SPEED BUT FORCED WITH ONLY ENGINE BRAKING AND A VERY OLD ASPHALT ROAD COVERED IN GRAVEL I HAD TO LAY IT DOWN TO STOP FROM GOING INTO A 60FT+ RAVINE.     I'VE PUT 250-300K OF STREET RIDING UNDER MY BUTT AND THIS IS THE FIRST TIME I'VE LAID A BIKE DOWN. I DID HURT MY LEFT LEG AND I HAVE A HUGE BRUISE THERE NOW AND MY CRASH BARS PREVENTED ANY MAJOR DAMAGE TO THE BIKE BUT IT DID STILL CAUSE ABOUT $500 IN DAMAGES. I'M WELL AWARE OF THE PROBLEMS THAT THE 05-06 SERVO BIKES HAVE HAD WITH BRAKE FAILURE BUT I'VE ALWAYS READ THAT THE RESIDUAL BRAKES ARE STILL THERE IF THE SERVOS FAIL. I CAN ATTEST I HAD ZERO BRAKES! LEVER WENT TO THE BARS AND REAR JUST FELL DOWN AND HAD NOTHING. I'VE ACTUALLY PRACTICE A COUPLE PANIC STOPS WITH THE IGNITION OFF TO EXPERIENCE WHAT JUST THE RESIDUAL BRAKE FEEL LIKE AND I WAS ABLE STOP FAIRLY NORMAL WITH JUST SOME INCREASE EFFORT. THIS WAS NOT THAT!     AFTER THE CRASH I TURNED OFF THE BIKE AND ANOTHER RIDER HELPED ME PICK IT UP. UPON TURNING IT BACK ON I STILL HAD ZERO BRAKES THE LEVER JUST WENT TO THE BARS AND REAR HAD NOTHING. WHEN I TURNED THE BIKE BACK ON I HAD THE ABS AND BRAKE FAILURE LIGHTS FLASHING AND THE SERVO NEVER KICKED ON TO DO ITS BIT CYCLE. SO ME AND THE OTHER GUY SAT THERE TALKING ABOUT WHAT JUST HAPPENED AND ABOUT 2 MINUTES OR SO WENT BY AND ALL OF A SUDDEN THE SERVOS KICKED ON AND ALL THE WARNING LIGHTS WENT OFF AND MY BRAKES WHERE BACK TO NORMAL!!! I TURNED THE BIKE OFF AND NOW I HAD RESIDUAL BRAKES AGAIN!    THIS  FAILURE COULD HAVE VERY WELL KILLED ME IF IT HAPPENED IN MULTIPLE AREAS EARLIER IN THE RIDE. A QUICK GOOGLE SEARCH SHOWS THAT THIS HAS HAPPENED TO NUMEROUS PEOPLE.  *TR",
        "vin": "WB10317A15Z"
    },
    {
        "components": "STEERING,POWER TRAIN,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/10/2014",
        "dateOfIncident": "10/08/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10643951,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON REPLACING REAR TIRE AT THE BMW DEALERSHIP, NOTICED A CRACKED REAR WHEEL FLANGE. THESE CRACKS APPEARED ON 4 OF 5 ATTACHMENT POINTS WHERE THE FLANGE BOLTS ONTO THE REAR DRIVE.  THIS IS A PART THAT HOLDS THE WHEEL TO THE MOTORCYCLE.  SPOKE TO BMW NA AND THEY DO RECOGNIZE THE PROBLEM AS INHERENT DEFECT, AND HAVE NOT RECALLED DESPITE HAVING REDESIGNED THE REPLACEMENT PART SEVERAL TIMES OVER THE LAST FEW YEARS (IMPLIED ADMISSION BY BMW OF THE INHERENT DEFECT DUE TO REDESIGN).   THIS IS SAFETY ISSUE RELATED TO AN INHERENT DEFECT OF SAFETY CRITICAL PART - THE REAR WHEEL FLANGE.    FAILURE OF THIS PART WHILE THE VEHICLE IS BEING OPERATED MAY CAUSE LOSS OF REAR BRAKE FUNCTION, LOSS OF STEERING ABILITY, SUDDEN SEIZURE OF REAR WHEEL, AND/OR  POSSIBLE LOSS OF REAR WHEEL.    THIS MAY LEAD TO SERIOUS INJURY AND EVEN DEATH.   *TR",
        "vin": "WB10317AX5Z"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/07/2014",
        "dateOfIncident": "07/02/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10608526,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS 2005 BMW R1200 GS. THE CONTACT STATED THAT WHILE INSPECTING THE MOTORCYCLE, THE CONTACT DISCOVERED THAT THERE WAS A CRACK ON THE REAR WHEEL FLANGE. THE MOTORCYCLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED WITH A FRACTURED WHEEL FLANGE. THE MANUFACTURE WAS MADE AWARE OF THE FAILURE. THE FAILURE AND CURRENT MILEAGE WAS 47,000.",
        "vin": "WB10317A05Z"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/04/2014",
        "dateOfIncident": "06/03/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10596090,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS REPLACING MY REAR BRAKE ROTOR.  THE ROTOR IS BOLTED TO A PIECE CALLED A FLANGE (PART NUMBER 33117722831) USING 5 BOLTS.  I FOUND THAT EACH OF THE 5 BOLT HOLES IN THE FLANGE ARE CRACKED.  IF THIS PART WERE TO COME APART WHILE RIDING I THINK IT WOULD CAUSE THE REAR WHEEL TO LOCK UP AND SKID OR POSSIBLY WORSE.  THE FLANGE (PART NUMBER 33117722831) IS ALSO PART OF THE POWER TRAIN AND REAR WHEEL DRIVE SYSTEM (ALSO KNOWN AS THE FINAL DRIVE SYSTEM) FOR THE BMW R1200GS MOTORCYCLE.  THE BMW MUST KNOW THAT THIS IS A DANGEROUS PROBLEM BECAUSE THEY HAVE REDESIGNED THE PART.  SEARCHING THE INTERNET FOR \"BMW R1200GS FLANGE CRACK\" RETURNS MANY PAGES OF INFORMATION ON THIS PROBLEM.  HERE IS A GOOD SUMMARY:  HTTP://WWW.MTS1200.INFO/MOTORCYCLEINFO/INDEXE65D.HTML?FA=CONTENTGENERIC.NKYQIUKEVRYEUZUT&PAGEID=360814.  *TR",
        "vin": "WB10317A05Z"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/22/2013",
        "dateOfIncident": "09/02/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10544829,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL LEAKING AT THE FUEL PUMP FLANGE AS WELL AS AT THE SUCTION PUMP FLANGE AROUND THE BASE OF THE QUICK DISCONNECT FITTING.",
        "vin": "WB10317A05Z"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/28/2013",
        "dateOfIncident": "08/15/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10537803,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "SMELLED FUEL, REMOVED LEFT SIDE COVER, SAW TOP OF FUEL PUMP COVERED WITH GAS. IT IS LEAKING FROM THE PLASTIC QUICK DISCONNECT. ALSO SEE CRACKS IN THE FLANGE ON TOP OF FUEL PUMP. THIS IS A FIRE HAZARD, CAUSED BY POOR DESIGN THAT USES TAPERED PIPE THREAD IN PLASTIC. *TT",
        "vin": "WB10317A45Z"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/27/2013",
        "dateOfIncident": "07/26/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10532145,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL PUMP FLANGE CRACKED AT FUEL PUMP OUTPUT CONNECTOR AND FUEL SPRAYED OUT UNDER PRESSURE. PRESSURIZED FUEL SPRAYED ON LEG AND HIT HOT ENGINE EXHAUST. WAS ABLE TO CUT OFF ENGINE AND FUEL PUMP BEFORE A FIRE STARTED. HAD TO WAIT SEVERAL HOURS BEFORE HELP ARRIVED AND TRUCKED BIKE HOME.  *TR",
        "vin": "WB10317A35Z"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/19/2013",
        "dateOfIncident": "10/17/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10525785,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "FAULTY FUEL STRIP    GAS GAUGE WILL SHOW 1/2 TANK, BUT TANK MAY BE FULL OR EMPTY, OR SOMEWHERE IN BETWEEN. LIKEWISE, GAS GAUGE MAY SHOW FULL, BUT TANK MAY BE CLOSE TO EMPTY.    THE FUEL STRIP DOES NOT CORRECTLY DISPLAY THE AMOUNT OF FUEL IN THE TANK.  *TR",
        "vin": "WB10317A15Z"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/08/2013",
        "dateOfIncident": "05/08/2007",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10523763,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "STOPPED AFTER RIDING TO WORK, NOTICED FUEL SMELL, LOOKED CLOSER, GAS WAS DRIPPING ON HOT EXHAUST PIPE.  TURNS OUT THE FUEL LINE PLASTIC QUICK DISCONNECT THREADED BOSS ON THE FUEL TANK WAS CRACKED ENOUGH THAT GAS LEAKS OUT WHEN THE FUEL PUMP IS RUNNING.  JUST NOW REPORTING ALTHOUGH IT FIRST HAPPENED YEARS AGO.  TRIED VARIOUS REPAIRS THAT WERE ONLY TEMPORARILY EFFECTIVE BEFORE REPLACING THE ENTIRE FUEL PUMP ASSY AND REINFORCING THE BOSS WITH AN AFTERMARKET SPECIALTY CLAMP DESIGNED FOR THIS WELL KNOWN FAILURE.  *TR",
        "vin": "WB10317A65Z"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/08/2013",
        "dateOfIncident": "07/03/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10523825,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "CRACKS HAVE BEEN FOUND IN THE FUEL LINE INPUT FLANGE @ FUEL PUMP  AND THE RETURN FUEL FLANGE.  *TR",
        "vin": "WB10317A65Z"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/23/2013",
        "dateOfIncident": "06/13/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10521322,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FUEL PUMP FITTING CRACKED WHILE I WAS RIDING ON THE HIGHWAY. THIS RESULTED IN FUEL SPRAYING ON ME AND DRIPPING ONTO THE ENGINE WHEN I STOPPED. THE FITTING AND THE FLANGE ARE BOTH MADE OF A PLASTIC MATERIAL. THE THREADS ARE NPT TYPE AND AS THE FITTING IS SCREWED INTO THE FUEL PUMP FLANGE THE FIT GETS TIGHTER. THIS DESIGN WILL EVENTUALLY RESULT IN CRACKING. THIS IS WHAT HAPPENED TO THE PLASTIC FITTING WHICH I REPLACED WITH A METAL ONE. THIS WILL NOT SOLVE THE PROBLEM BECAUSE THE FLANGE IS LIKELY TO CRACK BECAUSE OF THE DESIGN RESULTING IN ANOTHER FAILURE. THIS TYPE OF FAILURE CAN EASILY RESULT IN A FIRE.  *TR",
        "vin": "WB10317A25Z"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/16/2013",
        "dateOfIncident": "04/11/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10508423,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON INSPECTION, I DISCOVERED THAT EACH OF FIVE WHEEL MOUNTING TABS ON THE REAR WHEEL FLANGE IS CRACKED. THIS HAS BEEN REPORTED IN NUMEROUS OTHER BMW R1200GS MOTORCYCLES, IN SOME CASES LEADING TO CATASTROPHIC FAILURE.  *TR",
        "vin": "WB10317A15Z"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/02/2013",
        "dateOfIncident": "04/01/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10505324,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 BMW R1200GS MOTORCYCLE. THE CONTACT STATED THAT THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC FOR UNRELATED MAINTENANCE WHEN THEY NOTICED THAT THE REAR WHEEL FINAL DRIVE WAS SEVERELY WORN. THE PART WAS ORDERED AND THE VEHICLE WAS LATER REPAIRED. THE REAR BRAKE PADS WERE REPLACED DURING THE REPAIR DUE TO AN EXCESSIVE OIL LEAK FROM THE REAR WHEEL. THE DRIVE SHAFT WAS ALSO DAMAGED AND WOULD NEED TO BE REPLACED. THE MANUFACTURER WAS NOT NOTIFIED OF THE PROBLEM. THE APPROXIMATE FAILURE MILEAGE WAS 68,000.   UPDATED 06/10/13 *BF  THE CONSUMER STATED THE FINAL DRIVE SEAL BLEW WHILE DRIVING. THE REAR TIRE WAS COVERED IN OIL. IN ADDITION, THE REAR BRAKE PAD HAD TO BE REPLACE DUE TO OIL DAMAGE. WHILE REPAIRING THE FINAL DRIVE. THE MECHANIC FOUND THE DRIVE SHAFT WAS NOTCHY AND NEEDED TO BE REPLACED.",
        "vin": "WB10317A15Z"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/15/2013",
        "dateOfIncident": "02/15/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10498314,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING SERVICE, TECH NOTICED A CRACK IN THE FUEL PUMP HOUSING.  BIKE IS UNSAFE TO DRIVE DUE TO RISK OF FUEL LEAK AND FIRE HAZARD.  THIS PROBLEM IS WELL DOCUMENTED AND COULD POTENTIALLY LEAD TO LOSS OF LIFE OR SEVERE BURNS.  RECOMMEND RECALL ON THIS PART.  *TR    THE ISSUE IS SO WELL KNOWN, ONLINE PARTS STORES ARE SELLING A PARTS FIX.    REQUEST REASON WHY RECALL HAS NOT BEEN ISSUED.",
        "vin": "WB10317A05Z"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/16/2012",
        "dateOfIncident": "08/23/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10488899,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER FILLING UP ON FUEL AND DRIVING HOME (LESS THAN FIVE MILES), I PARKED THE MOTORCYCLE. LATER IN THE DAY, I NOTICED FUEL ON THE ASPHALT BENEATH THE BIKE AND LEAKING FROM THE FUEL PUMP, DOWN ONTO THE ENGINE, LEFT EXHAUST PIPE AND OTHER PARTS OF THE FRAME.    FURTHER INSPECTING, I FOUND FUEL POOLED ATOP THE FUEL PUMP HOUSING. MOPPING UP THE FUEL, I IDENTIFIED A HAIRLINE CRACK IN THE UPPER PLASTIC HOUSING THAT HOLDS THE FUEL PUMP, FUEL PUMP ELECTRONICS AND FUEL LINE CONNECTION. THE FUEL PUMP ELECTRONICS UNIT WAS DAMAGED BY EXPOSURE TO THE FUEL, CAUSING SILICON INSULATION TO CRUMBLE AND FALL AWAY. (EVIDENCE THAT THE LEAK HAD EXISTED FOR SOME TIME, BUT ONLY CAME TO MY ATTENTION AFTER THIS PARTICULAR FILL-UP.)    REPLACEMENT PARTS ESTIMATE FROM BMW: $680.34 (INCLUDING TAX, BUT EXCLUDING INSTALLATION.)  *TR",
        "vin": "WB10317A15Z"
    },
    {
        "components": "STRUCTURE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/11/2012",
        "dateOfIncident": "12/09/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10487986,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DISCOVERED 12/9/2012.  EXTENT OF CRACKING INDICATES THAT THE ISSUE LIKELY BEGAN A NUMBER OF YEARS EARLIER.    MY FUEL TANK HAS PLASTIC QUICK DISCONNECT FITTINGS ON LEFT AND RIGHT SIDE.  NUMEROUS (8-12) SMALL RADIAL CRACKS HAVE APPEARED IN EACH OF THE QUICK DISCONNECT REINFORCEMENT FLANGES, EXTENDING IN SEVERAL CASES DOWN TO THE TOP OF THE TANK.  CONTINUED GROWTH OF THE CRACKS INTO THE THREADED AREA HAVE RESULTED IN FUEL LEAKS ON OTHER BIKES WITH THIS SAME CONFIGURATION (BUT NOT YET ON MY BIKE).    BELIEF IS THAT THE COMPOSITE QUICK DISCONNECT EXPANDS DURING PRESSURE CYCLING AND IMPARTS A RADIAL LOAD TO THE PUMP HOUSING QUICK DISCONNECT REINFORCEMENT FLANGE. OVER TIME, THIS PRESSURE CYCLING CAUSES CRACKS TO APPEAR IN THE REINFORCEMENT FLANGE WHICH EVENTUALLY RESULT IN FUEL LEAKS.    SEE ODI 10428629 AND CASE [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "WB10317A55Z"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/22/2012",
        "dateOfIncident": "08/01/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10485807,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL STARTED LEAKING FROM TOP OF GAS TANK , LEAKING FROM CRACKS IN FLANGE CONNECTION VERY UNSAFE FIRE HAZARD.  *TR",
        "vin": "WB10317A65Z"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/27/2012",
        "dateOfIncident": "09/22/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10477315,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 BMW R1200 GS MOTORCYCLE. THE CONTACT STATED THAT THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER FOR INSPECTION WHERE THEY DETECTED THAT THE DRIVE-LINE SEAL WAS LEAKING INTERNALLY. THE CONTACT REFERENCED A CONCURRENT INVESTIGATION UNDER NHTSA CAMPAIGN ID NUMBER: DP12001 (POWER TRAIN:DRIVE LINE:DIFFERENTIAL UNIT) THAT COULD HAVE BEEN RELATED TO THE FAILURE. THE VEHICLE HAD NOT BEEN REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE DEFECT. THE APPROXIMATE FAILURE MILEAGE WAS 10,000.  UPDATED 10/24/12*LJ  UPDATED 10/25/12",
        "vin": "WB10317A35Z"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/13/2012",
        "dateOfIncident": "10/16/2008",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10447862,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR WHEEL MOVED SIDE TO SIDE (BEARING ABOUT TO FAIL).  SECOND R1200GS I OWNED WITH SAME SAFETY FAILURE, REPLACED AND SOLD MOTORCYCLE AT SEVERE LOSS AS TWO R1200GS REAR DRIVE FAILURES ON TWO LOW MILEAGE R1200GS.  LOSS OF THOUSANDS UPON THOUSANDS OF DOLLARS.  *TR",
        "vin": "WB10317A15Z"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/05/2012",
        "dateOfIncident": "07/30/2011",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10446715,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "FINAL DRIVE ON THE MOTORCYCLE FAILED. THIS IS A TYPICAL FAILURE FOR MANY BMW MOTORCYCLES. THERE WAS MINOR LEAKAGE/SEEPAGE OF FINAL DRIVE OIL BEFORE AND DURING THE FAILURE. NO CRASH RESULTED.  *TR",
        "vin": "WB10317A15Z"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/17/2012",
        "dateOfIncident": "01/17/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10444057,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TURN SIGNALS BEGAN WITH INTERMITTENT MALFUNCTION AND HAVE NOW FAILED COMPLETELY. AFTER INVESTIGATING I FOUND THAT THIS IS A TYPICAL FAILURE ON BMW MOTORCYCLES AND HAS BEEN TRACED TO NON-FUNCTIONAL MICRO SWITCHES IN THE HANDLE BAR CONTROL ASSEMBLIES, BOTH LEFT AND RIGHT.  *TR",
        "vin": "WB10317A55Z"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/18/2011",
        "dateOfIncident": "09/16/2011",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10425962,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DETECTED FUEL LEAKING FROM LEFT SIDE OF MOTORCYCLE.  LEFT SHIN WAS COVERED IN GASOLINE.  REMOVED SIDE COVERS AND DETECTED GAS SPRAYING FROM A PLASTIC GAS LINE CONNECTOR DIRECTLY ABOVE THE FUEL PUMP.  300 MILES FROM HOME AND THE NEAREST BMW DEALER.  TIE WRAPPED GAS LINE TO STOP LEAKING.  MANAGED TO RIDE THE MOTORCYCLE HOME.  BMW IS AWARE OF THE PROBLEM AND HAS SELECTED A METAL CONNECTOR AS A REPLACEMENT.   I HAD AN 18,000 MILE CHECK-UP PERFORMED BY THE DEALERSHIP IN JUNE 2011.  NO RECALL BY BMW.  MOTORCYCLE IS OUT OF WARRANTY, SO I MUST PAY FOR REPAIR.  AFTER OPERATING MOTORCYCLE, GAS COLLECTS IN A BOWL ABOVE THE FUEL PUMP.  WHEN YOU PLACE THE MOTORCYCLE ON THE SIDE STAND GAS CAN FALL ON THE HOT ENGINE.  POTENTIAL FOR FIRE AND IGNITING GAS ON MY LEG IF A FIRE OCCURRED.  THE MOTORCYCLE IS ALSO UNSAFE TO RIDE UNTIL REPAIRED.   IF THIS WAS A CAR, THERE WOULD BE A RECALL.  *TT",
        "vin": "ZL78071"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/08/2009",
        "dateOfIncident": "11/08/2009",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10291417,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "ABS BRAKE FAILURE WHILE DRIVING.  HARD TO STOP BIKE AND A NEAR MISS WITH ANOTHER VEHICLE.  SEEMS TO BE A FAULTY FRONT BRAKE SWITCH.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/03/2009",
        "dateOfIncident": "07/15/2009",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10290767,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTICED OIL LEAKING FROM ENGINE TRANSMISSION JUNCTURE BEING BLOWN BACK ONTO REAR TIRE ON MY 2005 BMW MOTORCYCLE. *YT",
        "vin": "WB10317A25Z"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/12/2008",
        "dateOfIncident": "05/03/2008",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10242609,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 BMW 1200 GS MOTORCYCLE HAD A DEFECTIVE PART.  CONSUMER STATES THAT THE REAR WHEEL FINAL DRIVE WAS DEFECTIVE AND WANTS TO BE REIMBURSED FOR THE DEFECTIVE PART.   *NJ  THE CONSUMER STATED WHILE RIDING THE BIKE, IT SLID/HOPPED A COUPLE OF TIMES ON FAST CURVES.  THE DEALER REPLACED THE  REAR FLANGE IN THE FINAL DRIVE BECAUSE IT WAS DAMAGED. *JB",
        "vin": "WB10317A75Z"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/06/2008",
        "dateOfIncident": "04/10/2008",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10226877,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE REAR MAIN SEAL BEGAN LEAKING RIGHT AFTER WARRANTY PERIOD EXPIRED.  THIS WAS SECOND MAJOR SEAL FAILURE, THE FIRST BEING TRANSMISSION OUTPUT SEAL.  THE SEAL WAS REPLACED WITHIN A WEEK, BUT BEGAN LEAKING AGAIN ON THE TRIP BACK FROM THE REPAIR SHOP.  THIS IS A VERY COMMON PROBLEM WITH THIS MOTORCYCLE AND USUALLY LEADS TO OIL CONTAMINATION ON THE CLUTCH, LEADING TO CLUTCH FAILURE.  BMW REFUSES TO RECOGNIZE THIS DEBILITATING PROBLEM AND OFFERS NO AFTER-WARRANTY SUPPORT.  *TR",
        "vin": "WB10317A35Z"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/15/2007",
        "dateOfIncident": "10/04/2007",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10209020,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MY BMW R1200GS, I NOTICED OIL LEAKING FROM THE FINAL DRIVE. IT TURNS OUT THAT THE SEAL WAS ONLY AN INDICATION THAT THE DRIVE WAS FAILING. THE DEALER CONFIRMED THIS AND HAS REPLACED THE FINAL DRIVE UNDER WARRANTY. THERE AR RUMORS OF THIS BEING A COMMON PROBLEM FOR R1200 SERIES BMWS. THE OLD FINAL DRIVE IS NOT AVAILABLE.  *TR",
        "vin": "WB10317A85Z"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/06/2007",
        "dateOfIncident": "07/05/2006",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10208077,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MOTORCYCLE FAILED TO DOWNSHIFT ON RUGGED MOUNTAIN ROADWAY ON NUMEROUS OCCASIONS.  SHIFTING REQUIRED STOPPING THE VEHICLE AND/OR DOUBLE CLUTCHING.  PROBLEM WAS DIAGNOSED AS DRIVE SPLINE WITHOUT LUBRICATION.  HAD THIS OCCURRED IN A BUSY AREA, THE CONSEQUENCES COULD BE FATAL.  *TR",
        "vin": "WB10317A55Z"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/19/2007",
        "dateOfIncident": "10/17/2007",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10206360,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 BMW R1200 GS.  WHILE CRUISING AT 40 MPH, THE ENGINE FAILED WITHOUT WARNING.  ALL OF THE OTHER COMPONENTS WERE STILL OPERABLE.  THE CONTACT PUSHED THE VEHICLE TO THE SIDEWALK.  THE VEHICLE RESTARTED FOR ONLY TEN SECONDS AND WAS TOWED TO A DEALER.  THE DEALER STATED THAT WATER LEAKED INSIDE THE FUEL MODULE CONTROLS AND CORRODED THE CABLES, WHICH PREVENTED A SIGNAL FROM REACHING THE FUEL PUMP.  NO REPAIRS WERE MADE.  NHTSA CAMPAIGN ID NUMBER 05V082000 (FUEL SYSTEM, GASOLINE:DELIVERY:FUEL PUMP) WAS REFERENCED.  THE POWERTRAIN WAS UNKNOWN.  THE CURRENT AND FAILURE MILEAGES WERE 11,800.",
        "vin": "WB10317A45Z"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/09/2007",
        "dateOfIncident": "11/01/2006",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10202317,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR BRAKE PADS WEAR OUT PREMATURELY, TYPICALLY IN 6000 MILES, AS OPPOSED TO TYPICAL PAD LIFE WHICH IS ~18-24000 MILES.  NO SYMPTOMS WERE NOTED PREVIOUS TO THE BRAKE PADS WEARING OUT.  WHEN REAR BRAKE PADS WEAR OUT, THERE IS LOSS OF REAR BRAKING ABILITY.  THIS DID NOT CAUSE AN ACCIDENT FOR ME, BUT COULD EASILY CATCH A RIDER BY SURPRISE AND CAUSE A CRASH AS A RESULT OF LOSS OF REAR BRAKE.  BMW CLAIMS THAT THIS IS NORMAL FOR THESE BIKES, AND THEREFORE NOTHING WAS DONE TO FIX THE ACTUAL PROBLEM, ASIDE FROM HAVING THE OWNER PAY AND HAVE NEW BRAKE PADS INSTALLED.    THE PROBLEM SEEMS TO BE CAUSED BY THE LINKED BRAKE SYSTEM EMPLOYED ON THE R12GS / ABS MODEL.  WITH THIS SYSTEM, USING THE FRONT BRAKE ALSO CAUSES THE REAR BRAKES TO BE ACTUATED.  SOMEHOW THE SYSTEM IN AT LEAST SOME CASES CAUSES THE BREAKING FORCE APPLIED TO FRONT AND REAR BRAKES TO BE BIASED TO USE THE REAR BRAKE VERY HEAVILY.      A SYMPTOM OF THE PROBLEM IS THAT THE REAR BRAKE ROTOR IS VERY HOT (INDICATING THAT THE REAR BRAKE HAS BEEN ACTUATED) EVEN WHEN NEITHER BRAKE LEVERS HAVE BEEN EMPLOYED BY THE RIDER.    THIS PROBLEM HAS HAPPENED VERY OFTEN.  AT LEAST TO ME ONCE, PERSONALLY.  I'VE ALSO READ MANY MANY FIRSTHAND STORIES ABOUT THIS PROBLEM ON VARIOUS WEB FORUMS SUCH AS ADVRIDER.COM, UKGSER.COM AND BMWMOA.ORG.    I AM UNSURE OF THE EXACT TIME THAT THIS OCCURRED TO ME BUT CAN FIND RECORDS TO PINPOINT THE EXACT DATE. *JB",
        "vin": ""
    },
    {
        "components": "SUSPENSION,POWER TRAIN,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/20/2007",
        "dateOfIncident": "07/01/2007",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10197057,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 BMW R1200 GS.  THE CONTACT STATED THAT THE VEHICLE WAS EXPERIENCING FINAL DRIVE BEARING FAILURE.  HE STATED THAT THE REAR WHEEL BECAME FLAT.  WHEN HE REMOVED THE WHEEL, IT WAS DISCOVERED THAT A LOOSE BEARING CAUSED THE FAILURE.  HE STATED THAT BMW DOES NOT CONSIDER THIS TO BE A SAFETY ISSUE.  THE CONTACT IS HAVING THE VEHICLE REPAIRED WITH NEW BEARINGS.  THE POWERTRAIN WAS UNKNOWN.  THE CURRENT AND FAILURE MILEAGES WERE 17,500.  THE CONSUMER STATED DEALER REPLACED BEARINGS AND SEALS @ 17,670 AND THE SECOND DEALER REPLACED COMPLETE FINAL DRIVE AND COVER @ 18,699. THE DEALER STATED REAR DIFFERENTIAL FAILURE AND REMOVE TAIL LIGHT.  UPDATED 11/21/07  *TR",
        "vin": "WB10317A35Z"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/24/2007",
        "dateOfIncident": "05/20/2007",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10191687,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 BMW R1200 GS MOTORCYCLE.  WHILE DRIVING 65MPH INTO 40-50MPH WIND, THE LEFT SIDE PANEL DETACHED FROM THE MOTORCYCLE AND STRUCK HIS KNEE.  THE CONTACT WAS ABLE TO REATTACH THE PANEL. THE WEATHER CONDITIONS WERE DRY AND EXTREMELY WINDY.  THE FAILURE MILEAGE WAS 6200 AND THE CURRENT MILEAGE WAS 6300.  THE NUMBER OF CYLINDER INFORMATION IS NOT AVAILABLE.",
        "vin": "WB10317A45Z"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/16/2006",
        "dateOfIncident": "08/16/2006",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10165627,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED THE AFTERMARKET SADDLE BAG INSTALLED BY THE DEALERSHIP HAD SEPARATED FROM THE MOTORCYCLE TWICE AND BECAME AIRBORNE.  THE VEHICLE WAS TAKEN TO THE DEALERSHIP TWICE BUT THE PROBLEM COULD NOT BE DETERMINED.*AK",
        "vin": "WB10317A45Z"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/03/2006",
        "dateOfIncident": "06/26/2006",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10161346,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 BMW R1200GS.  ABS OFF, BLINKING BRAKE FAILURE, ONLY RESIDUAL BRAKING. DEALER RESET THE ABS COMPUTER, BUT CAME BACK AFTER ONE WEEK, ONLY RESIDUAL BRAKING NOW, (REQUIRE EXTRA ORDINARY LEVER GRIP TO STOP)  THIS IF NOT PREPARED TO STOP COULD CAUSE A CRASH, WHAT IS CAUSING THE ABS TO DEACTIVATE.  NOW THE BRAKE LIGHT IS STUCK ON BRIGHT, NO ABS, RESIDUAL BRAKING, DEALER TOLD ME TO DRIVE IT IN, IS THAT SAFE?  NO WORKING BRAKE LIGHT?  BMW SHOULD INVESTIGATE PROBLEM AND CORRECT PROBLEM.  *JB",
        "vin": "WB10317A05Z"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": true,
        "dateComplaintFiled": "06/21/2006",
        "dateOfIncident": "05/22/2006",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10160356,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "IN THE LAST SEVEN YEARS, I HAVE RIDDEN OVER 100,000 MILES ON SIX DIFFERENT BMW MOTORCYCLES, ALL PURCHASED NEW. I RIDE YEAR-ROUND AND HAVE ALWAYS USED AN ELECTRIC VEST TO AVOID HYPOTHERMIA. IN SEPTEMBER, 2005 I PURCHASED A NEW 2005 BMW R1200RT MOTORCYCLE. DURING A CROSS-COUNTRY RIDE IN MAY, 2006, MY NON-BMW BRAND ELECTRIC VEST FAILED TO FUNCTION DURING RAIN AND COLD TEMPERATURES ENCOUNTERED IN SOUTH DAKOTA. THE NEXT DAY, I EXPERIENCED UNUSUAL FATIGUE, WENT OFF THE ROAD IN KANSAS, TOTALED THE BIKE AND BROKE MY LEG. I SUBSEQUENTLY FOUND OUT BY READING A MOTORCYCLE PUBLICATION THAT BMW DELIBERATELY ENGINEERED THE STANDARD 12 VOLT OUTLET ON THE FAIRING TO SHUT DOWN WHEN USING A NON-BMW ELECTRIC VEST. I BELIEVE BMW HAS AN OBLIGATION TO WARN OWNERS ABOUT THIS UNEXPECTED  LACK OF PERFORMANCE WHICH IN MY MIND WAS A SIGNIFICANT CONTRIBUTOR TO MY PROPERTY LOSS AND PERSONAL INJURY. ON MY REPLACEMENT BIKE, I WILL GO TO THE EXPENSE OF   INSTALLING A 12 VOLT FAIRING OUTLET DIRECTLY CONNECTED TO THE BATTERY.  *JB",
        "vin": "WB10388005Z"
    }
]