[
    {
        "components": "VISIBILITY,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "10/04/2021",
        "dateOfIncident": "09/22/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435436,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2005 Cadillac Escalade. The contact stated while driving 62 MPH, he heard an abnormal sound coming from the sunroof. The contact stated while attempting to exit the highway, the sunroof detached from the vehicle and hit the road. The contact drove to nearby auto glass repair shop. The vehicle was not repaired. The contact drove another vehicle to the local dealer and was informed that the sunroof was not the original equipment but was an aftermarket sunroof. Upon investigation, the contact associated the failure with NHTSA Campaign Number: 10V427000 (Equipment). The vehicle was not repaired. The contact attempted to speak with a representative from Webasto Product North America, Inc. manufacturer but was not successful. The failure mileage was approximately 235,000.",
        "vin": "1GYEK63N05R"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/27/2021",
        "dateOfIncident": "01/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414146,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 CADILLAC ESCALADE. THE CONTACT STATED THAT THE GEAR SHIFT LEVER LIGHT FAILED TO ILLUMINATE DURING THE DAYTIME. THE CONTACT STATED THAT DURING NIGHT TIME DRIVING, THE GEAR SHIFTER LIGHT OPERATED AS DESIGNED. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 05V055000 (POWER TRAIN). THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 126,000.",
        "vin": "3GYEK62N55G"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/05/2021",
        "dateOfIncident": "01/12/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394897,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "SPEEDOMETER QUIT WORKING ON THE INSTRUMENT CLUSTER. ONLY AROUND 55,000 MILES ON VEHICLE. YOU CAN DRIVE IT AWHILE AND THEN IT QUITS WORKING. LET IT SIT FOR A FEW MINUTES AND IT WILL WORK AGAIN FOR A LITTLE WHILE AND QUIT AGAIN. NO OTHER GAUGES ARE AFFECTED YET.  LAMP ASSEMBLY IS FADING FROM THE INSIDE OF THE LIGHT HOUSING.",
        "vin": "1GYEK63N15R"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/09/2021",
        "dateOfIncident": "01/07/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387336,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING AND THE VEHICLE WAS ACTING LIKE IT DIDN'T WANT TO SWITCHES INTO THE NEXT GEAR. TRANSMISSION FLUID WAS EMPTY. FILLED IT UP AND THE NEXT DAY IT STILL HAS THE SAME ISSUE.",
        "vin": "1GYEK63N95R"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/14/2020",
        "dateOfIncident": "08/11/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11374633,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LIGHTING FOR THE GEAR INDICATOR DOESN'T WORK.  I CANNOT TELL WHAT GEAR IT IS IS",
        "vin": "1GYEK63N45R"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/16/2020",
        "dateOfIncident": "03/06/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318254,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 CADILLAC ESCALADE. THE CONTACT STATED THE INSTRUMENT PANEL ON THE GEAR SHIFTER FAILED TO ILLUMINATE AS DESIGNED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC. THE CONTACT WAS INFORMED THAT SIMILAR VEHICLES WERE INCLUDED IN NHTSA CAMPAIGN NUMBER: 05V055000 (POWER TRAIN) HOWEVER, THE VIN WAS NOT INCLUDED. CADILLAC OF NEW ORLEANS LOCATED AT (3100 LIME ST, METAIRIE, LA 70006) WAS CONTACTED AND IT WAS CONFIRMED THAT THE VIN WAS NOT INCLUDED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "3GYFK66N35G"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/10/2019",
        "dateOfIncident": "06/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11288292,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MY AIRBAG LIGHT CAME ON WHILE DRIVING AND HAS REMAINED ON. IT IS ON WHILE IDLING AND DRIVING. IT NEVER GOES OFF. THERE WAS NO COLLISION OR ANYTHING TO CAUSE IT TO COME ON. I FEAR THERE MIGHT BE SOMETHING FAULTY HAPPEN WHILE I DRIVE.   ALSO I'VE BEEN HAVING ISSUES FUELING MY 2005 ESCALADE.  IT WILL ONLY LET ME PUT IN $1.00 MAYBE $1.50 AT A TIME AND THE PUMP WILL KICK OFF. I'VE EVEN HAD GAS SPILL OUT WHILE THIS IS OCCURRING. THE GAS SPILL HAS HAPPENED TWICE AND THE FUEL TANK WAS ALMOST EMPTY. SO IT WASN'T OVERFILL.    ALSO, MY AIR CONDITIONER, AT TIMES WILL JUST GET HOT WHILE DRIVING.  IF I STOP AND TURN OFF THE VEHICLE AND TURN IT BACK ON, THE AIR WILL RETURN TO COLD.  AND IT SMELLS LIKE BURNING WIRES.   I HAVE BEEN ROUTINELY LOOKING TO SEE IF THERE IS A RECALL ON THIS VEHICLE THROUGH THIS WEBSITE.",
        "vin": "3GYFK66N45G"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/01/2019",
        "dateOfIncident": "07/29/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11241090,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE PEDDLE GOING TO THE FLOOR",
        "vin": "1GYEK63NX5R"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/05/2018",
        "dateOfIncident": "04/02/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11133571,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 CADILLAC ESCALADE. WHILE MAKING A LEFT TURN, THE FRONT PASSENGER SIDE WHEEL DETACHED FROM THE VEHICLE DUE TO A HUB BEARING FAILURE. AS A RESULT, THE VEHICLE DROVE OVER A CURB. THE VEHICLE WAS TOWED TO HERITAGE CHEVROLET BUICK OWINGS MILLS (11234 REISTERSTOWN RD, OWINGS MILLS, MD 21117, 1-(866) 730-3826) WHERE IT WAS DIAGNOSED THAT THE FRONT PASSENGER SIDE HUB BEARING NEEDED TO BE REPLACED. THE MANUFACTURER WAS CONTACTED AND INDICATED THAT THE VEHICLE WAS NOT INCLUDED IN MANUFACTURER SAFETY RECALL NUMBER: 07E-10B (HUB ASSEMBLY) AND NHTSA CAMPAIGN NUMBER:  07E106000 (WHEELS). THE VEHICLE WAS REPAIRED BY AN INDEPENDENT MECHANIC AT AN INDEPENDENT REPAIR FACILITY. THE MANUFACTURER PROVIDED NO ASSISTANCE. THE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": "1GYEK63N65R"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/13/2018",
        "dateOfIncident": "08/02/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129309,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG LIGHT ON AND SAYS CHECK AIRBAGS",
        "vin": "3GYFK66N35G"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/05/2018",
        "dateOfIncident": "09/04/2018",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11124518,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE ESV",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS PARKED IN MY DRIVEWAY, WHERE IT HAD BEEN SINCE THE DAY BEFORE.  IT WAS NOT POWERED ON IN ANYWAY, NOR WAS ANYTHING PLUGGED IN INSIDE.  IN THE EARLY MORNING WE WERE MADE AWARE BY A NEIGHBOR THAT THE TRUCK WAS ON FIRE.  THE FIRE WAS IN THE PASSENGER SIDE DASHBOARD AREA AND THE CENTER CONSOLE OF THE VEHICLE.  THE FIRE DEPT ARRIVED QUICKLY AND EXTINGUISHED THE BLAZE.      THE FIRE REPORT STATED:    IGNITION - D1 AREA OF FIRE ORIGIN: VEHICLE AREA, OTHER                 D2 HEAT SOURCE: HEAT FROM POWERED EQUIPMENT, OTHER                 D3 ITEM FIRST IGNITED: OTHER    CAUSE OF IGNITION - FAILURE OF EQUIPMENT    FACTORS CONTRIBUTING TO IGNITION - ELECTRICAL FAILURE, MALFUNCTION, OTHER    HUMAN FACTORS CONTRIBUTING TO IGNITION - NONE",
        "vin": "3GYFK66NX5G"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/14/2018",
        "dateOfIncident": "02/27/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11079082,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 CADILLAC ESCALADE. WHEN THE CONTACT ATTEMPTED TO ADD FUEL TO THE FUEL TANK, THE VALVE BECAME STUCK AND PREVENTED THE FUEL FROM ENTERING. AS A RESULT, FUEL SPILLED OUT. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE FUEL TANK AND THE VALVE NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND ADVISED THE CONTACT TO TAKE THE VEHICLE TO THE DEALER TO BE DIAGNOSED. THE FAILURE MILEAGE WAS 53,000.",
        "vin": "1GYEC63N55R"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/06/2017",
        "dateOfIncident": "09/06/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11032027,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY CAR USED FROM A DEALERSHIP IN 2009 AND I NOW HAVE THE FOLLOWING PROBLEMS WITH IT.  A CHECK ENGINE LIGHT THAT WILL NOT GO OUT, THE ERROR STATES THE FUEL CAP IS NOT TIGHT AND NO MATTER HOW MUCH I TIGHTENED IT NEVER GOES AWAY.  WHEN FUELING THE CAR FUEL WILL OVERFLOW IF NOT PAYING ATTENTION.  ALSO THE THE SHIFT LEVER POSITION IS NO LONGER ILLUMINATED SO I AM NOT SURE WHICH POSITION THE CAR IS IN MOST OF THE TIME I HAVE TO LISTEN AND GAUGE IT BEFORE TRYING TO PUT IT IN GEAR.  I NEVER RECEIVED AN COMMUNICATIONS THAT THE CAR WAS UNDER RECALL BUT FROM WHAT I AM SEEING FROM THE NHTSA WEBSITE THESE ARE THE PROBLEMS THAT I AM NOW HAVING.",
        "vin": "1GYEC63N25R"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/05/2017",
        "dateOfIncident": "08/03/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11021549,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION SHIFT LEVER POSITION INDICATOR NOT ILLUMINATED.  GM RECALL # 05023.  I CALLED GM # 866-982-2339.  THEY STATED MY VEHICLE NOT INCLUDED IN RECALL.  WOULD LIKE TO KNOW WHY AND HAVE THE INSTRUMENT PANEL CLUSTER REPROGRAMED AT NO CHARGE TO ME.  I CAN'T TELL WHAT GEAR THE VEHICLE IS IN AND THIS IS NOT SAFE.",
        "vin": "1GYEC63N65R"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/13/2016",
        "dateOfIncident": "09/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10915892,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 CADILLAC ESCALADE. THE CONTACT STATED THAT THE AIR BAG WARNING INDICATOR ILLUMINATED. THE CONTACT WAS ADVISED THAT THERE WAS NO RECALL RELATED TO THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 64,977.",
        "vin": "1GYEK63N15R"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/17/2016",
        "dateOfIncident": "02/14/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10850208,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE ESV",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "FEBRUARY 14, 2016 I WAS DRIVING TO WORK GOING ABOUT 50 MILES PER HOUR UPON APPROACHING 60 THE VEHICLE BEGIN TO LOSE POWER SO I STEERED OVER TO THE SIDE OF THE HIGHWAY AND HIT THE ONSTAR BUTTON TO TELL THEM THAT I WAS LOSING POWER AND THAT WOULD THEY RUN A DIAGNOSTIC THEY STATED THAT WOULD.  THEY STATED ALSO WHAT THEY ARE GOING TO CHECK, BRAKING SYSTEM, ENGINE, TRANSMISSION ETC.  WHEN THEY CAME BACK ONLINE ME NOT KNOW WHAT THEY REALLY DID CHECK I WAS TOLD THAT ALL WAS A GREEN LIGHT, SO I PROCEED TO CONTINUE ON MY WAY TO WORK, BUT IT HAPPEN AGAIN AND I CONTACTED THEM AGAIN AND WAS TOLD THE SAME THING.  NEVER ONCE DID THEY DIAGNOSTIC ONLY MEANT THAT THEY WAS JUST CHECKING FOR CODES AND IT WAS NOT A TRUE DIAGNOSTIC CHECK.  THEY ALSO NEVER OFFER TO TOW THE VEHICLE HOME OR TO THE DEALER.  I WAS ABLE TO GET THE VEHICLE HOME AND TOOK IT TO THE FIRST MECHANIC AND WAS TOLD THAT THE YAW RATE SENSOR NEEDED REPLACED AT $500 SOMETHING DIDN'T SEEM RIGHT SO I TOOK IT TO A GM CERTIFIED MECHANIC AND WAS TOLD IT WAS THE  HYDO-BOOST, PRESSURE HOSES NEEDED REPLACED AT $2600 ALONG ON THE PHONE BACK AND FORTH WITH ON STAR WHICH CLAIMED RESPONSIBILITY  ON STAR STATED TO ME THAT GM TECH WANTED THE VEHICLE TAKEN TO THE DEALERSHIP AND THAT THEY WOULD PAY FOR THE DIAGNOSIS TO SEE WHAT WAS THE PROBLEM.  SO GM CAME AND PICK THE VEHICLE UP AND TRANSPORTED TO BOMMORITO CADILLAC OF WHICH THEY INSPECTED THE VEHICLE AND REPORT BACK TO ON STAR WHICH STATED THAT THEY WASN'T RESPONSIBLE AND THAT THEY BELIEVED THAT GM SHOULD HANDLE IT FROM HERE.  TO MAKE A LONG STORY SHORT GM CLAIMED NO RESPONSIBILITY FOR THIS EVEN THOUGH YOU GUY'S AND CONSUMER AFFAIRS WARNED THEM ABOUT THE ISSUE WITH THE BRAKING SYSTEM BEFORE AND THEY DONE NOTHING ABOUT IT EVEN THOUGH IT WAS A SAFETY ISSUE.  MY COMPLAINT THAT THIS ISSUES SHOULD NOT BE MY RESPONSIBILITY NOR THE COST CAUSE THEY NEW THE POTENTIAL OF THIS FAILURE.",
        "vin": "3GYFK66N35G"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/09/2015",
        "dateOfIncident": "09/07/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10762401,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 CADILLAC ESCALADE. AFTER STARTING THE VEHICLE, THE SERVICE AIR BAG WARNING LIGHT ILLUMINATED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 77,000.",
        "vin": "1GYEK63N95R"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/08/2015",
        "dateOfIncident": "09/04/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10762059,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE ESV",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 CADILLAC ESCALADE ESV. WHILE DRIVING APPROXIMATELY 65 MPH AND DEPRESSING THE BRAKE PEDAL, THE VEHICLE WOULD NOT STOP AND THE BRAKE PEDAL EXTENDED TO THE FLOOR. THE CONTACT DROVE ONTO THE SHOULDER TO AVOID CRASHING INTO ONCOMING VEHICLES. DURING THE INCIDENT, THE BRAKE LIGHT ILLUMINATED. THE CONTACT, WHO WAS AN INDEPENDENT MECHANIC, INSPECTED THE VEHICLE AND DISCOVERED THAT THE REAR BRAKE LINES WERE CORRODED AND NO BRAKE FLUID WAS PRESENT. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 230,000.",
        "vin": "3GYFK66N05G"
    },
    {
        "components": "SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "08/08/2015",
        "dateOfIncident": "05/02/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10747163,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE EXT",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING SOUTH ON POWERS BLVD AND CROSSING THE BRIARGATE INTERSECTION IN COLORADO SPRINGS, COLORADO ON MAY 2, 2015, HONDA CIVIC VEHICLE RAN RED LIGHT TRAVELING WEST AROUND 32 TO 33 MPH (HIT GAS INSTEAD OF BRAKE). AND IMPACTED 2005 CADILLAC ESCALADE EXT ON DRIVERS SIDE. COMPONENT PARTS IN QUESTION ARE FRONT DRIVERS SEAT BELT AND PASSENGER FRONT SEAT BELT. DRIVER SUPPOSIVELY REPORTED TO ONSTAR THAT DRIVERS SEATBELT HAD DISENGAGED SOMETIME DURING IMPACT.  POLICE REPORT STATES CADILLAC CAME TO STOP 219 FEET FROM IMPACT. ONSTAR CALL ONLY AVAILABLE IF SUBPOENA IS REQUESTED. INJURIES TO PASSENGER WAS SIDE WHIPLASH, BACK INJURY, AND ROAD RASH TO KNEES, BRUISING AND SORES AS A RESULT OF KNEES IMPACTING GLOVE BOX IN FRONT OF PASSENGER. INITIAL INJURIES TO DRIVER WAS CONCUSSION, CLOSED HEAD INJURY, WHIPLASH, LEFT RIB CONTUSIONS, BRUISING AND SORES. BOTH OCCUPANTS IN CADILLAC WERE TRANSPORTED TO ER. PICTURES TAKEN OF VEHICLE ONCE LOCATED 3 DAYS LATER ILLUSTRATE DRIVERS SEATBELT IN NORMAL POSITION AND PASSENGER SEATBELT IN PULLED DOWN POSITION. PICTURES AVAILABLE UPON REQUEST. ACCORDING TO POLICE REPORT, PICTURES TAKEN AT SCENE.",
        "vin": "3GYEK62N85G"
    },
    {
        "components": "AIR BAGS,WHEELS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/05/2015",
        "dateOfIncident": "06/01/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10746323,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 CADILLAC ESCALADE. THE CONTACT STATED THAT THE AIR BAG LIGHT ILLUMINATED AND THE FUEL GAUGE FLUCTUATED SHOWING THE INCORRECT FUEL LEVEL. THE CONTACT MENTIONED THAT AN ABNORMAL NOISE EMITTED FROM THE WHEELS. THE FAILURE OCCURRED WITHOUT WARNING. THE VEHICLE WAS TAKEN TO THE DEALER. THE TECHNICIAN WAS UNABLE TO DIAGNOSE THE FAILURES. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURES. THE APPROXIMATE FAILURE MILEAGE WAS 180,000.",
        "vin": "1GYEK63N45R"
    },
    {
        "components": "STEERING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/01/2015",
        "dateOfIncident": "06/30/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10731537,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 CADILLAC ESCALADE. WHILE DRIVING AT 70 MPH, THE BRAKES AND THE STEERING WHEEL SEIZED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS UNKNOWN. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,SEATS",
        "crash": false,
        "dateComplaintFiled": "04/25/2015",
        "dateOfIncident": "04/24/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10712862,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE ESV",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVERS HEATED SEAT BUTTON TURNS OFF AND ON WHEN PUSHED BUT THIS TIME IT STAYED ON, IT OVER HEATED AND IT BURNT A SMALL HOLE IN THE SEAT AS I WAS DRIVING... THE PASSENGER HEATED SEAT DOES THE SAME BUT DID NOT BURN HOLE ...  *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/10/2014",
        "dateOfIncident": "12/02/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10663397,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 CADILLAC ESCALADE. WHILE DRIVING APPROXIMATELY 60 MPH, THE SPEEDOMETER DISPLAYED THAT THE VEHICLE WAS TRAVELING 20 MPH. THE VEHICLE WAS TAKEN TO THE DEALER WHO DIAGNOSED THAT THE INSTRUMENT CLUSTER WAS FAULTY. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. IN ADDITION, THE CONTACT INDICATED THAT THE AIR BAG SENSOR LIGHT WAS ILLUMINATED. THE FAILURE MILEAGE WAS 180,000.",
        "vin": "1GYEK63N35R"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/01/2014",
        "dateOfIncident": "08/27/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10629857,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE ESV",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES COMPLETELY WENT OUT WHILE DRIVING MY CHILDREN TO SCHOOL. BRAKE LINE RUST BUSTED THE BRAKE LINES. THIS WAS OUT OF NO WHERE AND COULD HAVE KILLED SOMEONE.   *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/26/2014",
        "dateOfIncident": "12/10/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10565964,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WITHOUT ANY PRIOR PROBLEM THE SPEEDOMETER BEGAN TO STICK AND NOT DISPLAY PROPER SPEEDS AND NEVER GOES BACK TO ZERO EVEN WHEN VEHICLE IS OFF.  ALSO, AFTER THIS BEGAN THE OTHER GAUGES ON THE INSTRUMENT PANEL BEGAN TO GIVE NO/FALSE READINGS.  *TR",
        "vin": "1GYEK63N35R"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/18/2013",
        "dateOfIncident": "06/01/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10552744,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE TWO CRACKED EXHAUST MANIFOLD BOLTS. I HAVE READ THAT THOUSANDS OF SIMILAR VEHICLES HAVE THIS SAME CONDITION.  I HAVE AN INTERMITTENT CHECK ENGINE LIGHT THAT IT WON'T PASS EMISSIONS.  I AM ALSO WORRIED OF WHERE IT IS LOCATED, THAT IT MAY CAUSE A FIRE.  I WOULD THINK GM SHOULD HAVE AN OBLIGATION TO FIX THIS DEFECT DUE TO THE EPA VIOLATION & SAFETY RISK THAT IT POSSES. *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/11/2013",
        "dateOfIncident": "11/11/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10551722,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "FROM PARKED POSITION PLACED KEY IN IGNITION AND STARTED CAR.  ALL WARNING LIGHT (TRACTION CONTROL, EMERGENCY BRAKE, SERVICE STABILITY, ETC) REMAINED ILLUMINATED AND DID NOT GO OFF.  ATTEMPTED TO TURN OFF CAR AND IGNITION WAS STUCK IN \"ON\" POSITION.  COULD NOT TURN CAR OFF OR REMOVE KEY FROM IGNITION.  VEHICLE HAD FULL POWER AND WAS ABLE TO GET HOME EVEN THOUGH WARNING LIGHTS ACTIVATED.  ONCE HOME, HAD TO TRY NUMEROUS ATTEMPTS TO GET VEHICLE TO TURN OFF.  FINALLY, HAD TO UNHOOK BATTERY, PULL FUEL PUMP RELAY, AND PULL WIRES OUT OF COMPUTER IN ORDER TO GET ENGINE TO STOP RUNNING.  HAVING TO TOW TO SHOP FOR REPAIRS.  POSSIBLE STEERING WHEEL CLOCK SPRING IS STUCK.  IF IT IF THE CLOCK SPRING, THIS WILL BE THE SECOND TIME THAT WE HAVE HAD TO REPLACE IT.  *TR",
        "vin": "1GYEK63N15R"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/15/2013",
        "dateOfIncident": "10/07/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10547901,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING AT 35 MPH CAR PULLED OUT IN FRONT OF ME SLAMMED ON BRAKES CAR STOPPED DASH BOARD LIT UP WITH VARIOUS WARNING LIGHTS. AS I TOOK OFF I WENT TWO BLOCKS PUT ON BRAKES HAD NO BRAKES.THE FRONT BRAKE LINE WAS TOTALLY CORRODED THROUGH AND ALL BRAKE FLUID HAD DRAINED OUT.AFTER CHECKING LINE FOUND OUT ENTIRE FRONT BRAKE LINE FROM LEFT WHEEL TO RIGHT WHEEL IS CORRODED .CADILLAC IS CLAIMING TO MANY MILES WILL NOT STAND BEHIND IT.THE CARS ORIGINAL BATTERY HAS OUTLASTED BRAKE LINES.  *TR",
        "vin": "1GYEK63N85R"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/17/2013",
        "dateOfIncident": "09/17/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10543999,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 45 MPH, THE VEHICLE DECELERATED AND BEGAN TO COAST.  THE TRANSMISSION ACTIVE INDICATOR LIGHT CAME ON.  LOST CONTROL OF THE VEHICLE.  *TR",
        "vin": "1GYEK63N95R"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/08/2013",
        "dateOfIncident": "09/08/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10542533,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "AT HOME IN THE DRIVEWAY, STARTED THE ENGINE AND PUT MY FOOT ON THE BRAKE.  THE PEDAL WENT ALL THE WAY TO THE FLOOR AND A BRAKE FAILURE WARNING LIGHT CAME ON IN THE VEHICLE.  UNDER THE VEHICLE THERE WAS A LARGE POOL OF BRAKE FLUID AND A LEAK FROM ONE OF THE BRAKE PIPES UNDER THE DRIVERS SIDE OF THE VEHICLE.  ON CLOSER INSPECTION IT WAS FOUND THAT THE BRAKE LINE HAD RUSTED BADLY OVER A SECTION LENGTH OF AROUND ONE FOOT IN LENGTH, AND COMPLETELY RUSTED THROUGH, SUDDENLY GIVEN WAY - LUCKILY WHILE THE VEHICLE WAS AT A STANDSTILL.  THE VEHICLE HAS NEVER BEEN IN A SALTY ENVIRONMENT OTHER THAN NORMAL VIRGINIA WINTER ROAD SALT, OR USED OFF ROAD.  *LN",
        "vin": "3GYEK62N55G"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/24/2013",
        "dateOfIncident": "06/12/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10531666,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TWO EXHAUST MANIFOLD BOLTS HAVE SHEARED OFF CAUSING AN EXHAUST LEAK ON BOTH SIDES OF THE ENGINE WHERE THE EXHAUST MANIFOLD MEETS THE ENGINE. THIS WILL POSSIBLY LEAD TO EMISSIONS FAILURE AND HIGH REPAIR COST FOR ME THE OWNER. IT WILL ALSO HARM THE ENVIRONMENT BY THE EXHAUST EXITING PRIOR TO GOING THROUGH THE CATALYTIC CONVERTER OR MUFFLER. INTERNET RESEARCH SHOWS THIS IS A WIDESPREAD PROBLEM AND NEEDS TO BE ADDRESSED. THIS SHOULD BE A RECALL.  *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/08/2013",
        "dateOfIncident": "07/08/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10523687,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE EMERGENCY/PARKING BRAKE RELEASE MECHANISM HAS BROKEN TODAY.  THIS IS THE SECOND TIME THIS MECHANISM HAS FAILED.  IT WAS REPLACED WITH A GM OEM PURCHASED FROM THE DEALER ON 8-13-2011. THIS VEHICLE HAS 68932 MILES ON IT AND WE ARE THE ORIGINAL OWNERS.  THERE IS OBVIOUSLY A DESIGN FAILURE IN THIS PART.  *TR",
        "vin": "3GYFK66N35G"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/12/2013",
        "dateOfIncident": "06/11/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10519415,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "FAILURE OF EXHAUST MANIFOLD BOLTS, DEALER SAYS NOT COVERED UNDER EXTENDED WARRANTY....THIS IS A DANGEROUS SITUATION, OBVIOUSLY THIS IS A DESIGN DEFECT AND SHOULD BE LOOKED INTO....AFTER RESEARCHING ON THE INTERNET THIS IS A BIG PROBLEM THAT GM IS IGNORING.  *TR",
        "vin": "3GYEK62N45G"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/22/2013",
        "dateOfIncident": "08/15/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10504162,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL- THE CONTACT OWNS A 2005 CADILLAC ESCALADE. THE CONTACT STATED THAT THE INSTRUMENT PANEL DISPLAYED INACCURATE GAUGE READINGS. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSIS. THE TECHNICIAN STATED THAT THE INSTRUMENT PANEL CLUSTER WOULD HAVE TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 90,000.  KMJ  *TR",
        "vin": "1GYEK63N45R"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "12/21/2012",
        "dateOfIncident": "12/17/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10489454,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "DUELER H/L ALENZA",
                "productYear": "9999",
                "size": "P285/45R22",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 CADILLAC ESCALADE EQUIPPED WITH BRIDGESTONE DUELER H/L ALENZA TIRES, SIZE P275/55/20 (N/A). THE CONTACT STATED  THAT THE SIDEWALL ON ALL FOUR TIRES HAD BECOME SEVERELY DRY ROTTED. THE TIRES WERE NOT REPLACED. THE MANUFACTURER WAS NOTIFIED OF THE PROBLEM. THE APPROXIMATE FAILURE MILEAGE OF THE TIRES WAS 142,100. THE VEHICLE FAILURE MILEAGE WAS UNKNOWN. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "SUSPENSION,ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/26/2012",
        "dateOfIncident": "09/14/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10482369,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SERVICE AIRBAG CAME ON OUT OF THE BLUE AS I WAS DRIVING, THAN EARLIER THIS YEAR MY AIRRIDE CONTROL WENT OUT AIR COMPRESSOR AND SHOCKS , IN FEB MY REAR BOLTS ON THE DRIVE SHAFT WERE LOOSE LEAKING FLUID , MY REAR SEAT BELT IS MALFUNCTIONING FOR MY SON 8 YEARS GET STUCK, MY AIR CONDITIONING IS HOT ON ONE SIDE AND COLD ON THE OTHER CADILLAC CHANGED OUT A MODULE THREE MONTHS LATER. IT STILL DOES THE SAME THING BUT I WON'T TAKE IT BACK BECAUSE THAT'S WHEN ALL THE OTHER STUFF STARTING HAPPENING REAR BOLTS LOSE LOST MASSIVE FLUID THEN THE AIR RIDE WENT OUT AIR COMPRESSOR AND SHOCKS. WHEN WE OPENED THE AIR COMPRESSOR UP IT WAS RUSTED AS IF IT HAD NOT WORKED IN YEARS SO I TRULY BELIEVE THAT SEWELLE CADILLAC DAMAGED MY SUV EVERYTHING BUT THE AIR ON ONE SIDE WAS GETTING HOT NOT TO MENTION THEY HAD MY TRUCK FOR OVER 7HRS AS I WAITED IN THE LOBBY  LAST YEAR LOST MY ONE OF MY HUBS THE INTERIOR PAINT IS PEELING OFF THE VIDEO PLAYER WENT OUT IN 2007 .  MY VEHICLE STAYS ON WHEN THE DOORS ARE OPEN AND THE KEY IS OFF AND OUT OF THE IGNITION THE INSIDE LIGHT SWITCH COMES ON SOMETIMES AND THIS TRUCK IS ALMOST PAID BUT ITS A LOT OF MONEY FOR ALL THESE THINGS TO GO WRONG. THERE IS A LOT MORE.  *TR",
        "vin": "1GYEK63N45R"
    },
    {
        "components": "POWER TRAIN,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/30/2012",
        "dateOfIncident": "03/01/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10478026,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE ESV",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HID HEADLIGHTS HAVE BEEN BLINKING TOGETHER ON AND OFF FOR NO REASON.  STARTED, STOPPED, MOVING, SITTING IN THE DRIVEWAY AFTER SHUT OFF WAITING FOR DELAY LIGHTING TO TURN OFF.  THE LOSS IS MOMENTARY.  IT IS MORE CRITICAL ON UNLIT HIGHWAYS AND SIDE STREETS.  THEY BLINK ON AND OFF TOGETHER.  THE DEALER WAS UNABLE TO REPAIR IN A 4 MONTH WINDOW.    ON DRY ROADS, FROM A STOP, STARTING OUT AT 5-20 MPH ACTIVE TRACTION CONTROL TURNS ON AND THE VEHICLE STALLS.  AS MOST STOPS OCCUR DIRECTLY PRIOR TO INTERSECTION THIS IS A VERY DANGEROUS POSITION TO PLACE THE DRIVER WITH A GAS PEDDLE THAT IS BASICALLY INOPERATIVE BECAUSE THE CAR IS IN ACTIVE TRACTION MODE AND TAKING OVER THE DRIVE TRAIN.  DEALER WAS UNABLE TO REPAIR OVER A 4 MONTH PERIOD.  IT MIGHT HAVE BEEN RELATED TO SPEED SENSORS IN FRONT WHEELS BUT THEY DIDN'T WANT TO REPLACE THEM. THEY MADE ME DRIVE FOR 2 WEEKS WITH A CODE RECORDER IN ORDER TO GET THEM TO DO ANY SERVICE.  *TR",
        "vin": "3GYFK66N35G"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/10/2012",
        "dateOfIncident": "08/10/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10470184,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE ESV",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "EXHAUST MANIFOLD BOLTS ARE SHEARING OFF THE ENGINE CAUSING EXHAUST ODOR AND FUMES.  *TR",
        "vin": "1GYEK63N15R"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/19/2012",
        "dateOfIncident": "07/05/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10466644,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 CADILLAC ESCALADE. THE CONTACT NOTICED AN ABNORMAL FUEL ODOR. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC FOR DIAGNOSTICS. THE MECHANIC STATED THE FUEL PUMP ASSEMBLY AND MODULE WOULD HAVE TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 105,000. ...UPDATED 09/12/12 *BF UPDATED 09/17/2012  *JS",
        "vin": "1GYEK63N55R"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,PARKING BRAKE",
        "crash": false,
        "dateComplaintFiled": "12/07/2011",
        "dateOfIncident": "11/01/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10438896,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE EMERGENCY BRAKE FRICTION LININGS BECAME SEPARATED FROM THEIR METAL SHOE WHICH RESULTED IN COMPLETE FAILURE OF THE EMERGENCY BRAKE.  ADDITIONALLY, THIS RUINED THE ROTOR AND BRAKE PADS OF THE REAR BRAKES.  *TR",
        "vin": "3GYFK66N35G"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/02/2011",
        "dateOfIncident": "04/30/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10398655,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE ESV",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "FAULTY FUEL GAUGE.  WE HAD BEEN COMPLAINING OF THE FAULTY FUEL GAUGE SINCE WE LEASED THE CARE AND THEN SUBSEQUENTLY BOUGHT IT.  IT WILL OCCASIONALLY JUST SHUT OFF WHEN PREVIOUSLY SHOWING A FULL TANK THEN GO TO EMPTY OR ANYWHERE IN BETWEEN.  *TR",
        "vin": "3GYFK66N55G"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/22/2011",
        "dateOfIncident": "12/20/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10392466,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE EXT",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 CADILLAC ESCALADE EXT. THE CONTACT STATED THAT THE SPEEDOMETER BEGAN MALFUNCTIONING INTERMITTENTLY AND DISPLAYED THAT THE CONTACT WAS DRIVING 80 MPH WHEN TRAVELING APPROXIMATELY 30 MPH. THE MANUFACTURER WAS CONTACTED AND STATED THAT THEY WERE AWARE OF THE FAILURE AND INITIATED A VOLUNTARY SAFETY IMPROVEMENT CAMPAIGN. THE CONTACTS VEHICLE DID NOT FALL WITHIN THE VIN RANGE OF THE VEHICLES CHOSEN FOR THE VOLUNTARY REPAIR AND THE CONTACT WOULD BE RESPONSIBLE FOR ANY REPAIRS. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 68,700.",
        "vin": "3GYEK62N65G"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/12/2011",
        "dateOfIncident": "12/12/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10376405,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 CADILLAC ESCALADE. THE CONTACT STATED THAT WHILE DRIVING 70 MPH, THE REAR DIFFERENTIAL LOCKED. THE CONTACT HAD THE VEHICLE TOWED TO A LOCAL MECHANIC WHO STATED THAT THE REAR DIFFERENTIAL NEEDED TO BE REPLACED. THE CONTACT CALLED THE MANUFACTURER WHO STATED THAT THEY WOULD SPEAK TO A DEALER REGARDING THE REPAIR. THE MANUFACTURER HAD NOT MADE A DECISION. THE FAILURE MILEAGE WAS 68,800.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/08/2010",
        "dateOfIncident": "09/18/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10359652,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE ESV",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 CADILLAC ESCALADE ESV.. INTERMITTENT SERVICE AIR BAG MESSAGE. AFTER DOING AN INTERNET SEARCH OF THE PROBLEM I FOUND HUNDREDS OF OWNERS OF SIMILAR GM VEHICLES 2003 TO 2005 WITH THE SAME PROBLEM. NOT KNOWING IF YOUR AIR BAG IS WORKING IS A SCARY SITUATION. *TR",
        "vin": "3GYFK66N35G"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/02/2010",
        "dateOfIncident": "07/28/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10346773,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2005 CADILLAC ESCALADE 6.0L ENGINE, WITH 88,000 MILES ON IT. I HAD A TICKING SOUND INVESTIGATED BY A LOCAL MECHANIC AND HE FOUND 3 EXHAUST MANIFOLD BOLTS, TWO ON ONE SIDE AND ONE ON THE OTHER, HAD SPONTANEOUSLY BROKEN.  HE INDICATED BEFORE HE LIFTED THE HOOD THAT  WAS THE PROBLEM BECAUSE \"THAT WAS A COMMON PROBLEM WITH THE 6.0L ENGINE\".  I CHECKED WITH CADILLAC OWNERS GROUP AND EDMUNDS CAR SPACE AND READILY FOUND SEVERAL SIMILAR COMPLAINTS WITH THE 6.0L GM ENGINE.  THIS SHOULD NEVER HAPPEN AND COULD LEAD TO AN ENGINE COMPARTMENT FIRE AND/OR THE LEAKAGE OF EXHAUST GASES INTO THE SAME.  I HAD ALL OF THE MANIFOLD BOLTS REPLACED.  THEY DIDN'T APPEAR TO BE EXCESSIVELY CORRODED, BUT RATHER, THE HEADS OF THE 3 FAILED BOLTS APPEAR TO HAVE JUST POPPED OFF.  I HAVE THE BOLTS THAT WERE REMOVED AND REPLACED.  THIS PROBLEM IS SOMEWHAT INSIDIOUS BECAUSE IT CAN MIMIC THE SOUND THAT A BAD LIFTER MIGHT MAKE.  I CONTACTED CADILLAC CUSTOMER SERVICE AND FILED A COMPLAINT.  THEY OFFERED NO RECOURSE. *TR",
        "vin": "1GYEK63N75R"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "03/19/2010",
        "dateOfIncident": "10/05/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10321057,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE ESV",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS THE EMAIL I SENT TO CADILLAC A FEW MONTHS AGO. THE SEAT BELT HAS SINCE BEEN REPLACED BUT THE DANGER STILL EXIST. MY SON IS LUCKY TO BE ALIVE AFTER THE SEAT BELT FAILED TO RELEASE; NEARLY RESULTING IN WHAT COULD HAVE BEEN A FATAL STRANGULATION.   HERE IS THE EMAIL:    I AM CONTACTING CADILLAC TO REPORT A PROBLEM I'VE EXPERIENCED WITH YOUR SEATBELTS. I HAVE AN 05 ESCALADE ESV AND MY SON WAS IN THE BACKSEAT SLEEPING AND SOMEHOW MANAGED TO GET THE SEATBELT WRAPPED AROUND HIS NECK. I TURNED THE VEHICLE OFF WITH HOPES THAT IT WOULD LOOSEN UP SO I COULD GET IT OFF BUT IT ONLY BECAME TIGHTER THE MORE I WORKED TO GET IT OFF. AT THE POINT WHERE HE WAS HAVING A HARD TIME BREATHING AND STARTED TURNING PURPLE I HAD MY HUSBAND OBTAIN SCISSORS AND WE HAD TO CUT IT OFF. MY SONS NECK IS NOW CUT AND BRUISED FROM THE SEATBELT.    IS THIS HOW ALL THE SEATBELTS IN YOUR CARS WORK (DOESN'T LOOSEN UP EVEN AFTER THE CAR IS OFF) HAD I NOT BEEN ABLE TO GET SCISSORS TO FREE HIM THIS MAY NOT HAVE HAD THE SAME OUTCOME.      THE DEALER THAT REPLACED THE SEAT BELT UNTIL SAID IT WAS \"COMPLETELY LOCKED AND AGREED THAT IF WE HADN'T CUT IT THERE WAS NO OTHER WAY TO RELEASE IT. I ALSO HAVE PHOTOS OF MY SONS NECK DAYS AFTER THE INCIDENT. I WOULD HAVE REPORTED THIS SOONER BUT DIDN'T KNOW WHERE TO REPORT IT TO UNTIL I WAS INFORMED OF THIS WEBSITE. *TR",
        "vin": "3GYFK66N95G"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/16/2009",
        "dateOfIncident": "12/13/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10296129,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "INSTRUMENT PANEL CLUSTER DEFECT CAUSES SPEEDOMETER TO STICK. *TR",
        "vin": "1GYEK63N25R"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/18/2009",
        "dateOfIncident": "10/30/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10259224,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 CADILLAC ESCALADE.  THE CONTACT STATED THAT THE SPEEDOMETER DISPLAYED INACCURATE SPEEDS WELL ABOVE AND BELOW THE ACTUAL TRAVELED SPEEDS.  THERE WAS A RECALL ISSUED FOR HER SAME MAKE AND MODEL VEHICLE, BUT HER YEAR WAS NOT INCLUDED.  THE VEHICLE HAS NOT BEEN REPAIRED.  THE FAILURE MILEAGE WAS 60,000 AND CURRENT MILEAGE WAS 69,000.   UPDATED 05/05/09.  *LJ",
        "vin": "1GYEK63N75R"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,POWER TRAIN,TIRES",
        "crash": false,
        "dateComplaintFiled": "01/27/2009",
        "dateOfIncident": "01/05/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10256451,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE ESV",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "WRANGLER",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 CADILLAC ESCALADE ESV.  WHILE DRIVING 50 MPH, THE VEHICLE DECELERATED AND BEGAN TO COAST.  THE CONTACT LOST STEERING ABILITY, BUT WAS ABLE TO SAFELY MANEUVER THE VEHICLE TO THE SHOULDER OF THE ROAD.  SHE WAS ABLE TO RESTART THE VEHICLE AND DRIVE TO THE LOCAL DEALER FOR INSPECTION.  THE FAILURE OCCURRED WITHOUT WARNING.  THE DEALER STATED THAT THE GEARS IN THE TRANSMISSION FAILED.  THE VEHICLE WAS REPAIRED AT THE COST OF $3,200.  THE MANUFACTURER STATED THAT BECAUSE THE VEHICLE DID NOT RECEIVE A TRANSMISSION FLUSH AND FAILED DUE TO LACK OF MAINTENANCE, NO COMPENSATION WOULD BE PROVIDED.  THE FAILURE MILEAGE WAS 83,000 AND CURRENT MILEAGE WAS 83,050.    UPDATED 3/11/09 *CN  THE CONSUMER ALSO STATED THE BRAKES  LOCKED UP AND THE TIRES BLEW OUT. UPDATED 03/16/09. *JB",
        "vin": "3GYFK66N75G"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/19/2009",
        "dateOfIncident": "01/19/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10255601,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE ESV",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING DOWN THE ROAD AT APPROXIMATELY 80 MPH THE SPEEDOMETER FROZE. WHEN I PULLED ONTO AN EXIT RAMP AN CAME TO A COMPLETE STOP THE GAUGE FEEL TO ZERO BUT WHEN I STARTED TO DRIVE THE GAUGE WOULD NOT MOVE, IT STAYED ON ZERO FOR THE REMAINDER OF MY DRIVE. ONSTAR COULD NOT FIGURE OUT THE ISSUE. I HAVE NOT HAD TIME TO TAKE IT TO A DEALER YET. I WAS WONDERING IF THERE WAS A RECALL OR TSB FOR THIS ISSUE. *TR",
        "vin": "3GYFK66N15G"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/16/2007",
        "dateOfIncident": "09/30/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10185278,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* - THE CONTACT  OWNS  A 2005 CADILLAC ESCALADE.  THE CONTACT STATED THAT THE VEHICLE WOULD ONLY GET 8 MPG IN THE CITY AND 10 MPG ON THE HIGHWAY. THIS WAS WITHOUT RUNNING THE AIR, OR HEAT, AND NOT PLAYING MUSIC OR USING ANY OF THE ELECTRICAL IMPLEMENTS.  THE DEALER STATED THAT AFTER REACHING  AN ODOMETER READING OF 2, 000 MILES THE VEHICLE SHOULD GET THE MILEAGE THAT WAS ADVERTISED.  THE CONTACT DID MOSTLY CITY DRIVING AND TOOK CARE OF  THE  VEHICLE.  THE CONTACT STATED THAT SINCE PURCHASING THE VEHICLE IN SEPTEMBER 2005, IT HAS NEVER  REACHED  THE MPG THAT IT SHOULD.   THE CURRENT MILEAGE WAS 9,050.*AK  THE CONSUMER HAS INCLUDED THE MILEAGE PAGE AT TIME OF PURCHASE AND LEGAL DOCUMENT FROM LAWYER. THE CONSUMER STATED THE DEALER SAID SOMETIMES THEY GET VEHICLES IN LIKE THAT AND THERE IS NOTHING THAT THEY CAN DO. UPDATE 4/25/07*TR   UPDATED *JB",
        "vin": "1GYEK63N45R"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "12/15/2006",
        "dateOfIncident": "11/27/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10176277,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE EXT",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2005 CADILLAC ESCALADE EXT, I WAS IN LAS VEGAS AND PARKED MY VEHICLE IN THE FIRST PARKING SPOT , WHICH WAS THE HANDICAP PARKING IN FRONT OF STORE . I WAS IN THERE FOR NO MORE THAN 20 MINUTES AND MY VEHICLE WAS STOLEN , I THE  CALLED THE POLICE WHICH GAVE ME THE NUMBER TO ONSTAR, THEN ONSTAR  TOLD ME THEY SENT A SIGNAL TO THE TRUCK, AND THE TIME FRAME WAS NO MORE THAN 10 MINUTES OF 8:50 . THE OUTCOME WAS THAT ONSTAR DID NOT LOCATE THE VEHICLE IT WAS LOCATED BY THE POLICE 6 DAYS LATER. WHEN I WENT TO GO TO LOOK AT THE TRUCK AT THE TOW YARD I DISCOVERED THAT THE ONSTAR ANTENNA WAS BEHIND THE REAR VIEW MIRROR , SO THE PERSON WHO IS STEALING YOUR VEHICLE JUST HAS TO  PULL A PLUG OUT OF REAR VIEW MIRROR AND THAT DISABLES THE  ANTENNA.  THE TRUCK WILL NEVER BE PICK UP BECAUSE IT WILL ONLY TAKE THEM TWO SECONDS FROM JUMPING IN THE VEHICLE TO DISABLE IT . AND THE UNIT IS BEHIND THE GLOVE COMPARTMENT WHICH THEY JUST PULL DOWN THE BOX AND RIP OFF THE WIRES THAT CONNECT THE POWER AND ETC.. SO MY COMPLAINT IS THAT ONSTAR IS NOT A GOOD SYSTEM TO HAVE FOR STOLEN LOCATION, I WAS TOD TO PUT LOJACK AND THE POLICE TOLD ME THIS, SO CADILLAC KNOWS THIS AND THEY SAID THAT IS NOT A GOOD REASONS FOR ME TO HAVE CADILLAC LOOK INTO THIS OR HELP ME WITH ASST OF BUYING A NEW VEHICLE AND TRADING THE OLD ONE IN.  *JB",
        "vin": "3GYEK62N95G"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM,EXTERIOR LIGHTING,SEATS,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "09/06/2006",
        "dateOfIncident": "09/06/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10167487,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE EXT",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THE VEHICLE FAILED TO START AFTER BEING PARKED FOR ONE OR TWO DAYS.  THIS PROBLEM OCCURRED ON FOUR OCCASIONS.  ON ONE OCCASION, THE DEALERSHIP REPLACED THE BATTERY BUT THIS DID NOT REMEDY THE PROBLEM.  THE DEALERSHIP COULD NOT DUPLICATE THE PROBLEM ON ALL OTHER OCCASIONS.    THE CONSUMER STATED THE VEHICLE HAS BEEN IN THE SHOP 17 TIMES, SINCE THE VEHICLE WAS PURCHASED. THE CD PLAYER WAS INOPERATIVE. THE HEATED SEAT WAS INOPERATIVE. THE FUEL TANK AND FOG LIGHT WAS REPLACED  UPDATED 09/25/06. *JB",
        "vin": "3GYEK62N15G"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/10/2006",
        "dateOfIncident": "03/01/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10152376,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "HAD A FRONT END COLLISION WITH ANOTHER VEHICLE AND NONE OF MY AIRBAGS DEPLOYED.  THE VEHICLE WAS 4 WEEKS OLD AND HAD 1850 MILES AT THE TIME OF THE ACCIDENT.    CALLED CADILLAC CUSTOMER SERVICE AND WAS GIVEN AN AIRBAG HISTORY LESSON VIA TELEPHONE FROM SOMEONE THAT HAD NEVER SEEN MY VEHICLE OR INSPECTED IT FOR DAMAGE AFTER THE ACCIDENT.  AT THE END OF OUR CONVERSATION I WAS TOLD ALL WAS OK, NONE OF MY AIRBAGS SHOULD HAVE DEPLOYED AND NOT TO WORRY ABOUT IT.  THE ENTIRE FRONT END OF MY VEHICLE WAS KNOCKED OFF, THE FRAME HAS MULTIPLE CRACKS AND IS BENT AS A RESULT OF THE COLLISION AND THE COLLISION CENTER IS 90% CERTAIN THE VEHICLE IS NOT REPAIRABLE.  *JB",
        "vin": "1GYEK63N65R"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/01/2006",
        "dateOfIncident": "03/01/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10151556,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE ESV",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE USING THE DVD PLAYER AND THEN SWITCHING TO THE RADIO, CD OR SATELLITE, THE SPEAKER VOLUME INCREASES TO A DEAFENING LEVEL.  THE VEHICLE HAS BEEN SEEN BY THE SERVICE DEALER, WHO WAS ABLE TO DUPLICATE THE PROBLEM, BUT A REMEDY WAS UNAVAILABLE TO CORRECT THE PROBLEM.",
        "vin": "3GYFK66N85G"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/01/2005",
        "dateOfIncident": "12/01/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10144184,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE EXT",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HORN FAILED TO SOUND WHEN IT WAS NEEDED. THIS SEEMS TO OCCUR WHEN THE HORN IS NOT USED FOR SOME TIME. I HAD THIS EXACT PROBLEM ON MY 2004 CADILLAC ESCALADE EXT, AND I THINK A RECALL SHOULD BE DONE TO RESOLVE THIS PROBLEM ON ALL GM CARS AND TRUCKS INVOLVED. I AM TIRED OF BEING SCARED WHEN MY HORN DOES NOT WORK. AFTER A YEAR, GM SHOULD HAVE HAD THIS PROBLEM RESOLVED. I THINK NHTSA SHOULD NOW RESOLVE IT FOR THEM!*JB",
        "vin": "3GYEK62N05G"
    },
    {
        "components": "AIR BAGS,EQUIPMENT",
        "crash": true,
        "dateComplaintFiled": "11/23/2005",
        "dateOfIncident": "07/16/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10143566,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "ESCALADE",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "S UTILITY",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JULY 16TH, 2005; I WAS INVOLVED IN A LIFE CHANGING, SINGLE VEHICLE AUTO ACCIDENT. I STRUCK A HILL WITH THE FRONT RIGHT SIDE OF THE VEHICLE WITH ENOUGH EXCESSIVE FORCE TO FLIP THIS CADILLAC ESCALADE HEAD FIRST. THE ESCALADE FLIPPED TWICE, IMPACTING THE FRONT OF THE VEHICLE AND LANDING UP SIDE DOWN. ASTONISHINGLY, OUT OF THE FOUR AIR BAGS IN THIS VEHICLE, NOT ONE OF THEM DEPLOYED. I PURCHASED THIS 2004 ESCALADE BRAND NEW AND AT THE TIME OF THE ACCIDENT IT ONLY HAD 15,000 MILES. THE VEHICLE IS A TOTAL LOSS AND IT IS UTTERLY UNBELIEVABLE THAT THE AIR BAGS DID NOT DEPLOY. I WAS SO IMPRESSED WITH THE RAVED REVIEWS, CONSUMER REPORTS INCLUDING SAFETY FEATURES, AND STYLISH BODY THAT THIS CADILLAC ESCALADE BECAME THE VEHICLE OF MY DREAMS. NEEDLESS TO SAY, I AM VERY DISAPPOINTED WITH MY CADILLAC EXPERIENCE. I DO NOT TRUST THIS VEHICLE ENOUGH TO GET INTO ANOTHER ONE. I KNOW THAT I AM ONLY HERE BECAUSE GOD DECIDED THE SPARE MY LIFE. AS A DIRECT RESULT OF THIS ACCIDENT I FREQUENTLY SUFFER SEVERE MIGRAINES, DIZZY SPELLS, BLURRED VISION, MEMORY LOSS, AND ANXIETY/PANIC ATTACKS ALL WHICH KEEP ME FROM SLEEPING. IT IS EXTREMELY DIFFICULT TO COMMUTE FROM DOCTORS APPOINTMENTS AND WORK FOR FEAR OF ANOTHER ACCIDENT. THE NEXT WEEK I HAD SEVERE CHEST, SHOULDER AND LOWER BACK PAINS; ALL OF WHICH I AM BEING TREATED FOR ON A REGULAR BASIS. I ALSO SEEK TREATMENT FROM A NEUROLOGIST FOR THE HEAD INJURY. I BELIEVE THAT THIS VEHICLE HAS A SERIOUS PROBLEM WITH THE AIR BAGS AND GM SHOULD STRONGLY CONSIDER INVESTIGATING THIS MATTER.  *JB",
        "vin": "1GYEC63T64R"
    }
]