[
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/15/2017",
        "dateOfIncident": "11/08/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11046223,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 BMW R1200. WHEN THE CONTACT ATTEMPTED TO START THE CYCLE, IT FAILED AND FUEL WAS LEAKING FROM THE FRONT. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE LOCAL DEALER (HAP'S CYCLE SALES, INC, 2530 17TH ST, SARASOTA, FL, 34234) WAS CONTACTED AT 941-365-3443. THE CONTACT TOOK THE FUEL PUMP APART AND CONFIRMED THROUGH THE PHONE WITH THE DEALER THAT THE COUPLING TO THE FUEL PUMP OF THE FLANGED HAD FRACTURED AND NEEDED TO BE REPLACED. THE CYCLE WAS NOT DIAGNOSED OR REPAIRED BY THE DEALER OR AN INDEPENDENT MECHANIC. THE MANUFACTURER WAS CONTACTED AND STATED THAT THERE WAS NO RECALL ON THE CYCLE. THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 13V617000 (FUEL SYSTEM). THE FAILURE MILEAGE WAS APPROXIMATELY 17,120.",
        "vin": "WB10388015Z"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/06/2016",
        "dateOfIncident": "09/30/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10914193,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVE SHAFT U-JOINT FAILURE RIDING ON INTERSTATE 5. BIKE STARTED TO VIBRATE AND WHEN CLUTCH WAS DEPRESSED, VIBRATION STOPPED. RELEASED CLUTCH AND VIBRATION STARTED AGAIN. DEPRESSED CLUTCH AGAIN AND PULLED TO SIDE OF THE ROAD BEFORE DRIVE SHAFT LOCKED UP. PULLED BACK REAR BOOT ON FINAL DRIVE AND THERE WAS SMOKE COMING OUT OF THE SWING ARM SHAFT. BMW DEALER DIAGNOSED IT AS A FAILED U-JOINT BUT COULD NOT REPAIR UNLESS THEY REMOVED TRANSMISSION TO REMOVE U-JOINT STUCK ON TRANSMISSION SPLINE. PRICE FOR DRIVE SHAFT ALONE WAS $1,100 DOLLARS PLUS LABOR TO REMOVE TRANSMISSION.",
        "vin": "WB10388075Z"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/27/2016",
        "dateOfIncident": "02/19/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10838801,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PULLING AWAY FROM A STOP SIGN THE MOTORCYCLE INCREASED SPEED AND RPM'S IN EXCESS OF THE AMOUNT OF THROTTLE I WAS TWISTING. I IMMEDIATELY PULLED IN THE CLUTCH AND RELEASED THE THROTTLE. THE RPM'S CONTINUED TO CLIMB OVER 4000 AND THE ENGINE SUSTAINED THIS LEVEL. THE MOTORCYCLE WOULD ONLY RETURN TO A NORMAL IDLE LEVEL (1100 RPM) IF I FORCED THE THROTTLE CLOSED (FORWARD TWISTING MOTION).  THIS MATTER COULD HAVE BEEN VERY DANGEROUS AND LIFE THREATENING.    I DELIVERED THE MOTORCYCLE TO THE BMW DEALER TO HAVE THE MATTER DIAGNOSED. THE BMW MECHANIC ADVISED THAT THE THROTTLE CABLE PULLEY'S HAD BROKEN ON BOTH THROTTLE BOTH THROTTLE BODIES. I WAS FURTHER ADVISED THAT THESE PULLEY'S ARE MADE OF A MOLDED PLASTIC MATERIAL AND THAT THIS MATERIAL BROKE.    THE MECHANIC HAS ALSO INFORMED ME THAT THESE PARTS (ALTHOUGH EXTERNAL ON THE THROTTLE BODIES) ARE NOT REPLACEABLE. THE ENTIRE THROTTLE BODIES MUST BE REPLACED.   I BELIEVE THAT BMW SHOULD BE RECALL THESE ITEMS FOR THE OBVIOUS SAFETY RISKS RELATED TO THEIR FAILURE.",
        "vin": "WB10555A22Z"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/11/2013",
        "dateOfIncident": "11/10/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10551749,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER FILLING MY BMW MOTORCYCLE WITH GAS I PARKED IT TO VISIT WITH SOME OTHER RIDERS. AFTER A SHORT TIME RETURNED TO MY BIKE TO FIND GAS RUNNING ONTO THE HOT ENGINE AND POOLING ON THE GROUND. LEFT THE BIKE WENT HOME GOT A TRAILER AND TOOK IT HOME. I DRAINED THE GAS, TOOK THE COVER OFF THE GAS TANK AND FOUND THE QUICK DISCONNECT  ON THE FUEL LINE CRACKED ALLOWING FUEL TO RUN DOWN THE TANK AND ONTO THE ENGINE.  *TR",
        "vin": "WB10388095Z"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/06/2013",
        "dateOfIncident": "10/06/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10546944,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE RIDING MY BMW R1200RT TODAY I STARTED SMELLING GAS.   I RETURNED HOME AND PUT THE MOTORCYCLE IN THE GARAGE.   IT HAD A VERY STRONG GAS SMELL COMING FROM IT.  I REMOVED THE LEFT UPPER FAIRING TO INSPECT THE FUEL PUMP AREA.  ON TOP OF THE FUEL PUMP RAW GASOLINE WAS POOLED AND LEAKING DOWN THE SIDE OF THE GAS TANK TOWARDS THE LEFT CYLINDER EXHAUST PIPE NEAR THE CYLINDER HEAD.   THANK GOODNESS ENOUGH GAS HAD NOT LEAKED YET TO RUN ALL THE WAY DOWN TO THE EXHAUST PIPE!    I TURNED THE KEY ON TO ENERGIZE THE ELECTRIC FUEL PUMP AND PRESSURIZE THE FUEL SYSTEM TO SEE WHERE THE GAS WAS LEAKING FROM.   IT IS LEAKING FROM THE FEMALE PLASTIC FUEL FITTING THAT IS PART OF THE PLASTIC GAS TANK.  THERE ARE MULTIPLE CRACKS RADIATING FROM THIS FEMALE FUEL FITTING  AND I CAN SEE GASOLINE DRIBBLING OUT OF AT LEAST ONE CRACK AT A FAST ENOUGH RATE TO PUDDLE ON TOP OF THE FUEL PUMP.    THIS IS VERY DANGEROUS AND COULD EASILY CAUSE A FIRE WHILE I AM RIDING DOWN THE ROAD.  *TR",
        "vin": "WB10388085Z"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/04/2013",
        "dateOfIncident": "04/04/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10507044,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "PLASTIC FEMALE FITTING ON TOP OF FUEL PUMP HAS SEVERAL CRACKS WHICH WILL EVENTUALLY RESULT IN FUEL LEAKAGE.  *TR",
        "vin": "WB10388095Z"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/23/2013",
        "dateOfIncident": "12/04/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10499798,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FUEL STRIP FAILED ON THE MOTORCYCLE.  THIS IS A WELL KNOWN ISSUE WITH THESE MOTORCYCLE, EVEN BY BMW.  THIS COULD CREATE A SERIOUS SAFETY ISSUE IF THE FUEL QUANTITY DEPLETES ON A BUSY INTERSTATE OR IN A BUSY INTERSECTION.  *TR",
        "vin": "WB10388025Z"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/22/2013",
        "dateOfIncident": "02/08/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10499667,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS RIDING MY MOTORCYCLE IN THE RIGHT HAND LANE IN A 50MPH RESIDENTIAL ZONE IN FAIRLY HEAVY EVENING TRAFFIC WHEN THE ENGINE STARTED TO SEVERELY MISFIRE AND STUMBLE / SPUTTER.   LUCKILY I WAS IN THE RIGHT HAND LANE BECAUSE THE ENGINE THEN DIED AND I WAS ABLE TO PULL TO THE SIDE WITHOUT TOO MUCH DIFFICULTY ALTHOUGH THE VEHICLE BEHIND CAME VERY CLOSE TO ME SINCE THE BIKE SO RAPIDLY SLOWED WITHOUT MY BRAKELIGHT ON TO INDICATE A SLOW DOWN.  THE BIKE WOULD NOT RESTART AND I HAD A FRIEND TRAILER IT TO MY HOUSE, SINCE THIS WAS AT NIGHT AND THE DEALERSHIP WAS CLOSED.  UPON INVESTIGATION, I FOUND THE GAS TANK WAS BONE DRY, WHICH CAME AS A HUGE SURPRISE SINCE THE GAS GAUGE SHOWED A 1/4 TANK REMAINING AND OVER 100 MILES TO GO BEFORE EMPTY.  I PUT A GALLON OF GAS IN IT AND IT STARTED RIGHT UP. I TOOK IT TO THE DEALER IN THE MORNING AND THEY HAD TO REPLACE THE FUEL SENSOR FILM STRIP TO THE TUNE OF $265.68, WHICH MY EXTENDED WARRANTY COVERED EXCEPT FOR THE $50 DEDUCTIBLE.  I CONSIDER MYSELF VERY LUCKY THAT THIS DID NOT HAPPEN ON THE FREEWAY IN HEAVY TRAFFIC AS THE OUTCOME MIGHT HAVE BEEN RADICALLY DIFFERENT.  *TR",
        "vin": "WB10388065Z"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/19/2012",
        "dateOfIncident": "08/02/2010",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10471471,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "ABS MODULATOR FAILED. $3500 REPAIR.  *TR",
        "vin": "WB10388025Z"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/08/2012",
        "dateOfIncident": "07/06/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10464617,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS FAILURE IS NOT LIMITED TO THE 2005 BMW R1200RT. THE SAME FUEL PUMP IS USED FROM 2005-2009 IN THE RT1200RT AND R1200GS.  THE FUEL PUMP HOUSING HIGH-PRESSURE FUEL QUICK DISCONNECT REINFORCEMENT FLANGE CRACKS UNDER HIGH PRESSURE CYCLING AND LEAKS, SENDING RAW FUEL DOWN THE LEFT FAIRING IN CLOSE PROXIMITY OF THE VEHICLES LEFT EXHAUST PIPE AND IGNITION SYSTEM COMPONENTS. THE MOTORCYCLE FAIRING EFFECTIVELY CAPTURES THE FUEL VAPORS CREATING A SIGNIFICANT RISK FOR FIRE. IN ADDITION, LEAKING FUEL, STREAMING ALONG THE LEFT FAIRING IS EXHAUSTED ON THE RIDERS LEFT LEG, CREATING SIGNIFICANT RISK FOR THE RIDER EVEN AFTER DISMOUNTING THE VEHICLE. CONSEQUENCES OF FAILURE THE COMBINATION OF HIGH FUEL PRESSURE AND NEGLIGENT DESIGN CREATE SUBSTANTIAL RISK FOR RIDERS OF THE IMPACTED VEHICLES. CONSEQUENCES OF THIS FAILURE ARE OUTLINED BELOW:  1. RIDERS BECOME FUEL SOAKED AS FUEL LEAKS DOWN THE LEFT FAIRING AND THEN IS FORCED BY FAIRING AIRFLOW DYNAMICS ON TO THE RIDERS LEFT LEG.  2. FUEL VAPORS, CAPTURED BY THE FAIRING AND HEATED BY THE EXHAUST PIPE BECOME EXTREMELY VOLATILE AND COULD LEAD TO A FIRE AND/OR EXPLOSION.  3. FUEL VAPORS RISING FROM THE FAIRING AND EXITING THE TOP OF THE FAIRING BETWEEN THE INSTRUMENT PANEL AND FUEL TANK, ARE BLOWN BY AIRFLOW INTO THE RIDERS FACE. THE CARCINOGENIC ASPECTS OF FUEL INHALATION ARE DOCUMENTED.  EXAMINATION OF THE FUEL PUMP ASSEMBLY SUGGESTS THAT THE HIGH-PRESSURE FUEL QUICK DISCONNECT REINFORCEMENT FLANGE WAS INADEQUATELY DESIGNED FOR THE FUEL PUMP OUTLET PRESSURES. THE NON-METALLIC (COMPOSITE) PUMP HOUSING COMBINED WITH A COMPOSITE HIGH-PRESSURE DISCONNECT FITTING IS UNSUITED FOR THE PART. HIGH PUMP PRESSURE EXPANDS THE COMPOSITE HIGH-PRESSURE FITTING CAUSING IT TO READILY LOAD THE FUEL PUMP HIGH-PRESSURE QUICK DISCONNECT FLANGE. OVER TIME, PRESSURE CYCLING CAUSES THE QUICK DISCONNECT REINFORCEMENT FLANGE TO CRACK ALLOWING FUEL TO LEAK.  *TR",
        "vin": "WB10388095Z"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/22/2012",
        "dateOfIncident": "06/20/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10462747,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL TANK QUICK DISCONNECT CRACKED SPILLING FUEL WHILE RIDING.  *TT",
        "vin": "WB10388025Z"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/30/2012",
        "dateOfIncident": "01/30/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10445888,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "CRACKS ON THE HIGH PRESSURE SIDE OF FUEL PUMP AT THE FITTING. THIS WILL CAUSE FUEL TO LEAK UNDER OPERATION WITH POSSIBLE FIRE. PUMP DESIGN IS FAULTY AND A RECALL SHOULD BE INTIATED FOR THIS DANGEROUS PROBLEM.  *TT",
        "vin": "WB10388035Z"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/29/2012",
        "dateOfIncident": "01/29/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10445779,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "CRACKS HAVE DEVELOPED IN THE FUEL QUICK DISCONNECT REINFORCEMENT FLANGE ON THE FUEL PUMP HOUSING. THIS COULD LEAD TO A FUEL LEAK (AND HAS IN MANY CASES) ON TO THE EXHAUST PIPE, IGNITION SYSTEM COMPONENTS, AND MY LEFT LEG.  *TT",
        "vin": "WB10388015Z"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/23/2012",
        "dateOfIncident": "01/23/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10444876,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MULTIPLE CRACKS IN FUEL PUMP HOUSING AT FLANGE WHERE FUEL LINE CONNECTS.  ODOR AND GAS LEAKAGE.  *TR",
        "vin": "WB10388065Z"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/15/2011",
        "dateOfIncident": "11/19/2010",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10435984,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL WAS LEAKING FROM THE FLANGE AROUND THE FEMALE QUICK-DISCONNECT FITTING.  PLASTIC FLANGE IS LOCATED ON TOP OF FUEL TANK.  REPLACED PLASTIC FITTING WITH METAL ONE BUT LEAKS CONTINUED.  PLACED ORIGINAL FITTING BACK AND USED A FUEL-RESISTANT SEALING COMPOUND TO STOP LEAKS.  HAVE NOT EXPERIENCED ANY LARGE LEAKS RECENTLY BUT AM CONCERNED THIS PATCH WILL START LEAKING AGAIN.  IT WAS A FRIGHTENING EXPERIENCE TO BE RIDING AND SEEING GAS SPLATTER ON YOUR CLOTHES - COULDN'T WAIT UNTIL I GOT HOME.  THE FLANGE DESIGN IS AT FAULT BECAUSE IT PREVENTS A SOLID CONNECTION OF HIGH PRESSURE GASOLINE LINES TO THE FUEL TANK.  *TR",
        "vin": "WB10388085Z"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/10/2009",
        "dateOfIncident": "06/01/2009",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10279884,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 BMW R 1200 RT MOTORCYCLE.  THE CONTACT NOTICED GASOLINE LEAKING ONTO THE MUFFLER, WHICH PREVENTS THE VEHICLE FROM STARTING.  THROUGH RESEARCH, SHE DISCOVERED THAT THE GAS CONNECTER WAS THE CAUSE OF THE FAILURE.  THE DEALER STATED THAT THE VEHICLE NEEDED A NEW VALVE AND THAT THE HOSE NEEDED TO BE ROUTED DIFFERENTLY.  THE CONTACT PURCHASED ALL THE PARTS AND IS MAKING THE REPAIRS.  SHE BELIEVES THAT THE FAILURE WAS DUE TO A MANUFACTURER DEFECT DUE TO ALL OF THE COMPLAINTS SHE FOUND ONLINE FOR THE SAME ISSUE.  THE VIN WAS UNKNOWN.  THE CURRENT AND FAILURE MILEAGES WERE 35,000.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/26/2009",
        "dateOfIncident": "05/08/2009",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10275008,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON RETURNING HOME FROM A RIDE ON MY 2005 BMW R1200RT MOTORCYCLE, I ATTEMPTED TO LOWER MY SIDE STAND AND NOTICED THAT THE CENTER STAND ASSEMBLY WAS DANGLING BY MERELY A RETRACTION SPRING.  FORTUNATELY, IT HAD NOT COME COMPLETELY UNDONE AND BECOME ENTANGLED IN THE REAR WHEEL, WHICH WOULD MOST CERTAINLY HAVE CAUSED AN IMMEDIATE CRASH.  BOTH BOLTS THAT HOLD THIS ITEM TO THE BIKE'S UNDERCARRIAGE HAS SHEARED OFF MID-WAY.  I CONTACTED BMW NA ABOUT THIS, AND RECEIVED ONLY A BRIEF APOLOGY, BUT NO ADMISSION OF FAULT OR COMPENSATION.  I INVESTED APPROX. $45 IN OEM REPLACEMENT PARTS FROM A BMW DEALER TO REPAIR THE UNIT, WHICH THE DEALER STATES IS NOW PERMANENTLY 'BENT.'  SIMILAR CATASTROPHIC FAILURE (SKID MARKS ON PAVEMENT CONSISTENT WITH WIDTH OF CENTER STAND LEGS) IMPLICATED IN TWO DEATHS (10/05/08 - MONROE CO., PA - DETAILS AVAILABLE UPON REQUEST).  I HAVE RETAINED THE DEFECTIVE BOLTS. *TR  THE CONSUMER STATED ON AUGUST 20, 2010, THE FINAL DRIVE ON HIS MOTORCYCLE FAILED. THE SUPER-HEATING FROM THE CROWN GEAR BEARING FAILED AND LEAKED OIL.  THE REPAIRS EXCEEDED $2,000.  UPDATED IVOQ 02/15/12",
        "vin": "WB10388025Z"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/28/2008",
        "dateOfIncident": "08/26/2008",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10240065,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 BMW R1200 RT.  WHILE THE VEHICLE WAS STOPPED, THE CONTACT SMELLED GAS.  HE NOTICED GASOLINE DRIPPING FROM THE TAIL PIPE AND HIS PANTS.  THE CONTACT REPLACED THE FUEL CHECK VALVE COVER HIMSELF.  THE DEALER STATED THAT THE FUEL VALVE COVER FAILING DUE TO THE DEFECTIVE PLASTIC WAS A COMMON ISSUE.  THE CURRENT AND FAILURE MILEAGES WERE 11,750.",
        "vin": "WB10319A54Z"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/07/2007",
        "dateOfIncident": "11/07/2007",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10208216,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "FINAL DRIVE FAILURE.  *TR",
        "vin": "WB10388055Z"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/12/2007",
        "dateOfIncident": "09/12/2007",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10202781,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "FINAL DRIVE FAILURES ARE BECOMING ALL TOO COMMON ON BMW MOTORCYCLES MANUFACTURED FROM 2005 ON.  BMW IS TAKING A NONCHALANT ATTITUDE IN ITS REPLACEMENT OF THESE UNITS.  ALTHOUGH I HAVE NOT HAD A FAILURE, IF YOU WILL LOOK TO ANY OF THE FORUMS YOU WILL FIND NUMEROUS INCIDENTS.  *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "11/18/2005",
        "dateOfIncident": "09/01/2005",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10143124,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT BRAKES LOCKING UP,AND REAR BRAKES SQUEELING.  *NM",
        "vin": "WB10559A45Z"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "07/26/2005",
        "dateOfIncident": "06/28/2005",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10130040,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "REARVIEW MIRRORS ON BMW R1200RT MOTORCYCLE ARE INADEQUATE.  VIEW IS 75-80% BLOCKED BY HANDS AND REAR SADDLEBAGS.",
        "vin": "WB1053606S0"
    }
]