[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/17/2022",
        "dateOfIncident": "03/17/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11457183,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I noticed this car has several recalls that were never corrected on my vehicle.",
        "vin": "1GYEE637550"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/23/2020",
        "dateOfIncident": "08/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360681,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN IT RAINS WATER LEAKS FROM THE TOP OF THE VEHICLE AND LEAKS INSIDE THE CAR THROUGH A PLASTIC PIECE THAT SAYS AIR BAG AND IN THE REAR WATER LEAKS IN AND FILLS UP WHERE THE JACK IS LOCATED AND I'M AFRAID THAT THE AIRBAG WILL NOT WORK PROPERLY WITH THE WATER LEAKING INTO IT WHEN IT RAINS OR I GO THROUGH THE CAR WASH. ALSO THE REAR AXLE MOUNT IS BROKE AND IT CAUSE THE VEHICLE TO MAKE A LOT OF NOISE AND I'M HOPING THE REAR END DOESN'T COME OFF WHILE I'M DRIVING BECAUSE IT WILL DEFINITELY CAUSE A WRECK.",
        "vin": "1GYEE637X50"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/12/2020",
        "dateOfIncident": "01/12/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11308709,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TIMING CHAIN LEAKING OIL.  STATIONARY SAW OIL IN DRIVEWAY    NOISE IN FRONT WHILE DRIVING TURNED OUT TO BE 2 STRUTS NEED REPLACEMENT",
        "vin": "1GYEE637750"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/21/2020",
        "dateOfIncident": "11/02/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300818,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR TRUNK DON'T LOCK",
        "vin": "1GYEE63A050"
    },
    {
        "components": "UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/10/2019",
        "dateOfIncident": "12/10/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11288106,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MAKING A LEFT HAND TURN ONTO MY WORK PARKING LOT, APPLIED BRAKES TO PULL INTO MY PARKING SPACE AND I HEARD A TERRIBLE GRINDING/SHUDDERING NOISE AND THE BRAKE PEDAL WENT TO THE FLOOR.  I DIDN'T THINK I WAS GOING TO BE ABLE TO STOP WITHOUT HITTING THE CONCRETE WALL.  THE CAR FINALLY STOPPED AND THEN I SAW THE \"SERVICE STABILITY SYSTEM\" APPEAR ON THE DRIVER INFORMATION CENTER.  SINCE I JUST PURCHASED THIS VEHICLE USED I LOOKED THIS UP AND IT APPEARS THIS \"SHOULD\" HAVE BEEN CONSIDERED AS A RECALL GM NEEDS TO MAKE BEFORE SOMEONE IS SERIOUSLY HURT OR KILLED.",
        "vin": "1GYEE637750"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/23/2019",
        "dateOfIncident": "08/15/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11257426,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "AT RANDOM TIMES, WHILE ACCELERATING THE TRACTION ENGAGE MESSAGE WILL APPEAR AND THE CAR WILL NOT ACCELERATE FOR 2--3 SECONDS. VERY DANGEROUS. THE LAST TIME IT HAPPENED WAS WHEN I WAS TRYING TO MAKE A LEFT TURN IN A BUSY INTERSECTION.",
        "vin": "1GYEE637650"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/09/2019",
        "dateOfIncident": "06/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11230546,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 CADILLAC SRX. WHILE ATTEMPTING TO ACCELERATE AFTER A COMPLETE STOP, A LOUD VIBRATION/RUMBLE EMITTED FROM UNDERNEATH THE VEHICLE. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE CONTACT TOOK THE VEHICLE TO COVERT CADILLAC BUICK GMC (11750 RESEARCH BLVD, AUSTIN, TX 78759, (512) 583-3000), BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 160,000.",
        "vin": "1GYEE637750"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "05/01/2019",
        "dateOfIncident": "03/30/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205033,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR HAS A REAR LEAK THAT BUILDS UP IN THE TRUCK AND HOLDS WATER THERE WHERE THE JACK IS LOCATED WHICH IS NOW STUCK TO THE CARPET AND LOTS OF MOVEMENT IN THE REAR END OF THIS VEHICLE IS DEFECTIVE AND NEED TO HAVE A RECALL ON BOTH OF THESE ISSUES ALONG WITH THE REAR TRUNK NOT LOCKING OR REAR WINDSHIELD WIPERS NOT WORKING AT ALL AND COULD BE FROM THE WATER LEAKING INTO IT FROM THE REAR SOMEWHERE THAT NEEDS A RECALL ON.",
        "vin": "1GYEE637X50"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/19/2018",
        "dateOfIncident": "12/08/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11162460,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "LEFT FRONT TURN SIGNAL KEEPS GOING OUT.  5 TIMES SINCE OWNING THE CAR.  REPAIR COSTS TO CHANGE BULB $250. HAPPENS WITH OUT WARNING. CADILLAC HAS NO FIX FOR PROBLEM.  NEED TO BE A RECALL, AND SOLUTION TO PROBLEM. HAPPEN WHEN CAR IS IN MOTION, WHEN TURN SIGNAL IS USED.",
        "vin": "1GYEE63A650"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/10/2018",
        "dateOfIncident": "10/09/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11139487,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2005 CADILLAC SRX. WHILE DRIVING APPROXIMATELY 45 MPH, A SECOND VEHICLE CRASHED INTO THE PASSENGER SIDE OF THE CONTACT'S VEHICLE. THE CONTACT LOST CONTROL OF THE STEERING AND CRASHED HEAD ON INTO AN ONCOMING SEMI TRUCK. THE CONTACT'S VEHICLE WAS DESTROYED AND THE FRONT END WAS SEVERELY DAMAGED; HOWEVER, THE AIR BAGS DID NOT IMMEDIATELY DEPLOY. THE CONTACT INDICATED THAT THE AIR BAG DEPLOYED MOMENTS AFTER THE COLLISION OCCURRED. THE DRIVER SUSTAINED FACIAL LACERATIONS AND CONTUSIONS ALONG WITH CONTUSIONS AND ABRASIONS TO THE ARMS, LEGS, AND TORSO. A POLICE REPORT WAS FILED AND THE VEHICLE WAS TOWED AWAY. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE LOCAL DEALER AND MANUFACTURER WERE NOT NOTIFIED OF THE FAILURE. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 152,000.",
        "vin": ""
    },
    {
        "components": "STEERING,POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/04/2018",
        "dateOfIncident": "10/15/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11133340,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "'TAKATA RECALL' WHEN I WAS DRIVING MY DASH, STEREO AND LIGHTS STARTED TO FLICKER AND ALL THE ELECTRICAL COMPONENTS WERE NOT WORKING. THEN. I TRIED CHANGING LANES ON THE INTERSTATE TO EXIT BUT LOST POWER STEERING. IT WAS VERY DANGEROUS AT THOSE HIGH SPEED!. I WAS ABLE TO PULL OFF BEFORE MY CAR COMPLETELY DIED.. IT TOOK A WHILE FOR IT TO TURN BACK ON BUT ONCE IT DID THE CAR WAS NOT WORKING PROPERLY, SUCH AS THE TEMP AND GAS GAUGE, TRACTION CONTROL WAS NOT WORKING AND LIGHT WAS LIT ON DASH. POWER STEERING WASN'T WORKING, AND  THE TRANSMISSION WAS SHIFTING WEIRD. I TOOK IT IN TO THE GM DEALERSHIP AND WAS TOLD IT WAS THE 'ECM THAT WENT BAD' AND IT WASN'T COMMUNICATING WITH THE REST OF THE VEHICLE PROPERLY.  IT WAS ABOUT 900$ IN TOTAL WITH THE TOWING AND 'DIAGNOSE AND FIX'. IT WAS FIXED BUT EXACTLY  6 MONTHS LATER IT HAPPENED AGAIN WHILE DRIVING, I HAD TO PULL OVER. WENT BACK AND HAD TO PAY LIKE 400$ MORE TO GET IT 'FIXED' AGAIN AND THAT ONLY LASTED 1 MONTH. SO NOW WE TOOK IT TO THE CADILLAC DEALERSHIP AND THEY LOOKED AT IT AND COUKDNT TELL ME WHY IT WAS HAPPING OTHER THEN THEY THINK IT WAS THE 'ECM REPLACEMENT THAT WERE BAD'. SO NOW I WILL HAVE TO PAY 950$ FOR THAT STEALERSHIP FOR THE DIAGNOSIS AND TO REPLACE THE ECM. WITH THEM THEY SAID THEY HAD A LIFETIME WARRANTY ON PARTS AND LABOR WITH IS WHY WE WENT THERE. BUT STILL ALL THAT MONEY PAID FOR A DEFAULT OF CADILLAC. THEY NEED TO RECALL IT.",
        "vin": "1GYEE637350"
    },
    {
        "components": "SUSPENSION",
        "crash": true,
        "dateComplaintFiled": "09/17/2018",
        "dateOfIncident": "09/16/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 11129886,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 CADILLAC SRX. THE CONTACT STATED THAT THERE WAS AN ABNORMAL NOISE AND AN INTERMITTENT FAILURE REGARDING THE REAR SUSPENSION. IN ADDITION, THE REAR OF THE VEHICLE SWAYED BACK AND FORTH. AN INDEPENDENT MECHANIC DIAGNOSED THAT THE REAR DIFFERENTIAL FAILED, WHICH CAUSED DIFFICULTY WHEN TURNING THE VEHICLE IN EITHER DIRECTION AT LOW OR HIGH SPEEDS. THE VEHICLE WAS NOT REPAIRED. WHILE DRIVING APPROXIMATELY 35 MPH ON THE HIGHWAY, THE REAR OF THE VEHICLE SWAYED IN BOTH DIRECTIONS. AS A RESULT, THE VEHICLE SPUN OUT OF CONTROL ACROSS FOUR LANES OF TRAFFIC AND CRASHED INTO A MEDIAN. NONE OF THE AIR BAGS DEPLOYED. A POLICE REPORT WAS FILED. THE DRIVER SUSTAINED A HEAD INJURY, NECK AND BACK PAINS, AND HEADACHES. THE FRONT PASSENGER SUSTAINED A SPRAINED LEFT THUMB, AND NECK AND BACK PAINS. THE REAR PASSENGER SUSTAINED BACK AND MUSCLE PAINS, AND FEET INJURIES. ALL THE OCCUPANTS RECEIVED MEDICAL ATTENTION. THE VEHICLE WAS TOWED BY THE POLICE TO AN IMPOUND LOT. THE VEHICLE WAS NOT DIAGNOSED BY A DEALER. THE MANUFACTURER WAS NOTIFIED OF THE CRASH. THE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": "1GYEE63A650"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/12/2018",
        "dateOfIncident": "03/01/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11084782,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 CADILLAC SRX. THE CONTACT STATED THAT THE CHECK ENGINE INDICATOR ILLUMINATED. THE VEHICLE WAS TAKEN TO AN UNKNOWN LOCAL DEALER WHERE IT WAS DIAGNOSED THAT THE CATALYTIC CONVERTER NEEDED TO BE REPLACED AND THE VEHICLE WAS NOT INCLUDED IN ANY RECALLS. THE MANUFACTURER WAS ALSO CONTACTED AND WAS UNABLE TO ASSIST. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 108,000.",
        "vin": "1GYEE63AX50"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/29/2018",
        "dateOfIncident": "03/28/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11081943,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING OUR 2005 CADILLAC SRX A SERVICE STABILITY SYSTEM ERROR MESSAGE APPEAR ON CONSOLE DISPLAY SCREEN ALONG WITH TC AND ABS LIGHT COMING ON THE DASH. VEHICLE'S BRAKE SYSTEM BEGINS TO WORK ON ITS OWN FOR NO APPARENT REASON (NO ICE, SNOW, RAIN OR GRAVEL). VEHICLE NEEDS TO COME TO A COMPETE STOP, SOMETIMES SHUT THE VEHICLE COMPLETELY DOWN AND RESTART TO GET THE TC AND ABS LIGHT TO GO OUT ON THE DASH.  THIS HAS HAPPENED 3 TIMES IN THE LAST FEW WEEKS. NOT SAFE TO DRIVE.  ANY ASSISTANCE WOULD BE HELPFUL?",
        "vin": ""
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/18/2018",
        "dateOfIncident": "02/12/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080019,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "SERVICE STABILITY SYSTEM CODE COMES ON REAR WHEELS LOCK UP AFTER MAKING LOUD GRINDING NOISE, FIRST TIME I HAD IT TOWED TO DALE EARNHARDT CADILLAC DEALERSHIP THEY FOUND NOTHING WRONG. IT NOW DOES IT WHEN I TURN RT OR WHEN DRIVING STRAIGHT.",
        "vin": "1GYEE63A750"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/13/2018",
        "dateOfIncident": "07/20/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11078839,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TURNING RIGHT OR  LEFT OCCASIONALLY ''' SERVICE STABILITY SYSTEM '' WARNING COMES UP...STABILIZING ENGAGE CAUSING VEHICLE TO COME TO GRINDING STOP.........THIS HAPPENS WHILE VEHICLE IS MOVING.....'''STARTING ENABLED''  ''REMOVE KEY'' COMES ON ....CANNOT REMOVE KEY IMMEDIATELY ...MUST  JUNGLE KEY SEVERAL TIMES THEN REMOVE IT...  THIS HAPPENS BEFORE VEHICLE IS STARTED....  ON CITY STREETS....",
        "vin": "1GYEE637650"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/03/2017",
        "dateOfIncident": "11/29/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11052115,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "STABILITY CONTROL SYSTEM ENGAGES DURING NORMAL DRIVING AND DRY, LEVEL, LOW-SPEED CONDITIONS SUCH AS PULLING ONTO HIGHWAY FROM A STOP.  THIS HAS OCCURRED THREE TIMES, IN EACH INSTANCE STARTING FROM A DEAD STOP TO MAKE A TURN.  WHEN THE SYSTEM ENGAGES THE DRIVER HAS LITERALLY NO CONTROL OVER THE VEHICLE - BRAKES ENGAGE ABS WITHOUT DRIVER INPUT, ENGINE POWER IS SUDDENLY REDUCED, AND VEHICLE IS BROUGHT TO AN IMMEDIATE CRAWL AND THEN STOP, UNTIL IT DISENGAGES.  THUS FAR I'VE BEEN FORTUNATE ENOUGH THAT THIS HAS NOT OCCURRED WHERE ANY ONCOMING TRAFFIC HAS POSED A THREAT OF COLLISION, BUT THE POTENTIAL FOR A MAJOR ACCIDENT IS OBVIOUS.  RESEARCHING THIS ISSUE ONLINE INDICATES THAT IT IS NOT AN UNCOMMON EXPERIENCE WITH THIS VEHICLE, AND REPORTED DEALER RESPONSES ARE NOT ENCOURAGING.  AN ELECTRONIC SAFETY SYSTEM SHOULD BY DEFINITION NOT BE A LETHAL THREAT; THERE APPEARS TO BE NO PROTECTION AGAINST A HARDWARE/FIRMWARE FAILURE MODE CAUSING UNWARRANTED AND WHOLLY UNPREDICTABLE DEPLOYMENT OF THE SYSTEM WITH VERY HIGH RISK OF CAUSING COMPLETE LOSS OF CONTROL OF THE VEHICLE.  HOW IS IT POSSIBLE THAT I READ DOZENS AND DOZENS  OF REPORTS OF THIS ISSUE WITHOUT THERE HAVING BEEN A RECALL? I GRANT THAT MY VEHICLE HAS 185K MILES...BUT COMPETENT ENGINEERS KNOW HOW TO DESIGN S/W THAT WOULD DISABLE THE STABILITY CONTROL IF ANY FAULT IS DETECTED, IE STEERING POSITION SENSOR, YAW SENSOR, ECM.  IT'S STAGGERING TO IMAGINE THAT A FEW LINES OF CODE COULDN'T BE ADDED DOING JUST THAT, INSTEAD OF ALLOWING THE SYSTEM TO DEPLOY AT WILL WHEN NO VALID CONDITIONS EXIST.  I CAN TELL YOU THAT IT'S A DESPERATELY DANGEROUS SITUATION TO SUDDENLY FIND YOURSELF FACING, AND THEN READ REPORT AFTER REPORT OF DEALER SERVICE BLINDLY REPLACING SENSORS AND MODULES AT VERY HIGH COST TO THE VEHICLE OWNER WITHOUT RESOLVING THE PROBLEM BECAUSE 'WE DON'T REALLY KNOW WHAT CAUSES IT'.",
        "vin": "1GYEE637850"
    },
    {
        "components": "STEERING,SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "11/03/2017",
        "dateOfIncident": "10/31/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11043134,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 05 CADILLAC SRX HAVE A SERIOUS SAFETY ISSUE IN THE FRAME WHERE AS A METAL PICE ON LEFT AND RIGHT FRONT HAVE ROTTED ALL THE WAY THROUGH. I HAVE PICTURES OF THE PROBLEM. I NEED SOMEONE TO HELP ME BECAUSE NO CAR SHOULD HAVE THIS PROBLE WITH ONLY 80 THOUSAND MILES ON IT. HOW CAN I SEND THE PICTURE TO.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/12/2017",
        "dateOfIncident": "10/01/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11033118,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 CADILLAC SRX. WHILE DRIVING 20 MPH, THE ENGINE STALLED WITHOUT WARNING. THE VEHICLE WAS TOWED TO A LOCAL DEALER (MERITS AUTO SALES, 313 ELIZABETH AVE, NEWARK, NJ 07112), BUT THE CAUSE OF THE FAILURE COULD NOT BE DIAGNOSED. THE DEALER STATED THAT THE REPAIRS WERE THE CONTACT'S RESPONSIBILITY. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE VEHICLE WAS TOWED TO THE CONTACT'S RESIDENCE. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE FAILURE MILEAGE WAS 100,000.",
        "vin": "1GYEE637350"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/24/2017",
        "dateOfIncident": "03/14/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10968319,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT'S DAUGHTER OWNED A 2005 CADILLAC SRX. WHILE DRIVING APPROXIMATELY 40 MPH ON AN ICY, SNOWY ROAD, THE VEHICLE STARTED TO SKID AND THE DRIVER LOST CONTROL OF THE VEHICLE. THE DRIVER CRASHED INTO A CEMENT WALL. ALL THE AIR BAGS FAILED TO DEPLOY. THE DRIVER SUSTAINED HEAD INJURIES THAT REQUIRED MEDICAL ATTENTION ALONG WITH BRUISES TO THE CHEST, RIGHT ARM, AND LEG. A POLICE REPORT WAS FAILED. THE VEHICLE WAS TOWED AND DEEMED DESTROYED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 110,000. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/28/2016",
        "dateOfIncident": "12/28/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10938318,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "CADILLAC ISSUED A TSB IN APRIL 2012 (TSB #PIT-3749D), WHICH IS ALSO NOTED AS NHTSA ID #10037570 REGARDING RUST AND FRAME CORROSION.  MY 2005 CADILLAC SRX IS EXPERIENCING THIS ISSUE, AND I WAS JUST QUOTED $5700 TO REPAIR THE MANUFACTURING DEFECT.  WHY ISN'T THE NHTSA REQUIRING A RECALL IF THE STRUCTURAL FRAME OF THE CAR IS ERODING AWAY?  I CAN SEND YOU ALL MY CORRESPONDENCE WITH CADILLAC CORPORATE OVER THE PAST TWO WEEKS.",
        "vin": "1GYEE63A350"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/12/2016",
        "dateOfIncident": "08/11/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10895253,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG DIDN'T DEPLOY IN AN ACCIDENT ON AUGUST 11 2016. AIRBAG IS FAULTY AND CONCERN ABOUT THE SAFETY OF THE 2005 SRC  04/01/2021: ODI # CHANGED FROM 10895442 TO 10895253 AS PART OF ROUTINE DATA CLEANUP.",
        "vin": "1GYEE637650"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/16/2016",
        "dateOfIncident": "06/09/2016",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10874595,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 CADILLAC SRX. WHILE THE VEHICLE WAS PREPARING TO STOP AT A STOP SIGN, THE VEHICLE BEGAN TO SPUTTER INTO TRAFFIC AND ALL THE WARNING LIGHTS ILLUMINATED. THE ENGINE STALLED AND SMOKE APPEARED. THE VEHICLE WAS TOWED TO A DEALER WHERE IT WAS DIAGNOSED THAT THE POSITIVE CABLE WIRE FAILED AND NEEDED TO BE REPAIRED. THE VEHICLE WAS NOT REPAIRED. THE CONTACT ALSO MENTIONED THAT THE PARTS TO REPAIR THE FAILURE WERE ON BACK ORDER. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 108,000.",
        "vin": "1GYEE637050"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/19/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10865816,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STATIONARY.  UNABLE TO START. UNABLE TO REMOVE KEY. BATTERY GOES DEAD. 2 GM DEALERSHIPS SAY THERE IS NO FIX.  HAVE HAD CAR DIAGNOSED. NO FIX IS UNACCEPTABLE FOR A CADILLAC.  DEALERSHIPS \"FIX\" SO CAR STARTS AND THEN THE SAME PROBLEM STARTS.  PLEASE ADVISE",
        "vin": "1GYEE637150"
    },
    {
        "components": "STEERING,SUSPENSION,POWER TRAIN,STRUCTURE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/08/2016",
        "dateOfIncident": "04/06/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10854380,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 CADILLAC SRX. AFTER PURCHASING THE VEHICLE FROM AN INDEPENDENT DEALER, THE CONTACT TOOK THE VEHICLE TO A CERTIFIED FORD DEALER. THE TECHNICIAN DIAGNOSED THAT THE ENGINE LIGHT WAS ILLUMINATED AND THE DRIVE SHAFT COUPLERS, POWER STEERING, FRONT WHEEL BEARING, AND MOTOR MOUNTS WERE ALL DEFECTIVE AND NEEDED TO BE REPLACED. THE VEHICLE WAS RETURNED TO THE INDEPENDENT DEALER WHO REFUSED TO REPAIR THE VEHICLE. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURES. THE FAILURE MILEAGE WAS APPROXIMATELY 109,916.",
        "vin": "1GYEE63A350"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/01/2016",
        "dateOfIncident": "03/30/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10852942,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TOOK THE CAR TO THE SUPERMARKET & AS I WAS DRIVING HOME I WENT TO STOP AT A RED LIGHT & MY BRAKES COMPLETELY FAILED. THERE WAS NO WARNING, THANK GOD I WAS NOT GOING FAST AND I WAS NOT HIT BY ANOTHER CAR. BRAKE FLUID HAD COMPLETELY DRAINED OUT OF THE SYSTEM. GOT MY CAR TOWED TO REPAIR SHOP WHERE WE HAVE ALL OUR CARS SERVICED. MECHANIC SAID ALL THE BRAKE LINES WERE ALL ROTTED/RUSTED. CAN'T GET PARTS ANYMORE, THEY HAVE TO 'FABRICATE' THEM. PRICE TO REPAIR $1200.00 MY CAR ONLY HAS 58K & IS GARAGED. I DO LIVE ON LONG ISLAND BUT HAVE NEVER DRIVEN THROUGH ANY   FLOODS. CADILLAC SAYS 'CAR IS TOO OLD FOR ANY RECOURSE ON THEIR PART'. WHAT ELSE IS NEW. I LOST MY BRAKES IN AN INSTANT WITH NO WARNING. I'M GRATEFUL I DID NOT CAUSE AN ACCIDENT OR GET MYSELF KILLED. HAVE READ ONLINE THAT THIS HAS BEEN AN ISSUE. I GUESS YOU CAN ADD MY CAR TO YOUR STATISTICS. I GUESS I COULD ASK MECHANIC FOR PICTURES IF YOU WOULD LIKE TO SEE. THANK YOU [XXX]     INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "1GYEE637350"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/23/2016",
        "dateOfIncident": "03/23/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10851298,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DO YOU REALLY BELIEVE PLACING 2 PLASTIC CAPS ON A KEY SOLVES THIS IGNITION RECALL? THE RECALL IS FOR THE IGNITION SWITCH!  I TOOK THE CAR IN TODAY AND THIS IS HOW THEY ADDRESSED THE ISSUE. THIS WAS A COMPLETE WASTE OF MY TIME AND I AM NO MORE SAFER NOW THAN BEFORE I WENT IN.",
        "vin": "1GYEE637850"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/07/2016",
        "dateOfIncident": "09/17/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10840266,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 CADILLAC SRX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 14V394000 (ELECTRICAL SYSTEM); HOWEVER, THE PART NEEDED TO PERFORM THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "1GYEE637450"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/23/2015",
        "dateOfIncident": "02/11/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10775310,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 CADILLAC SRX. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS AND ATTEMPTING TO ACCELERATE, THE VEHICLE DECELERATED AND THE CHECK ENGINE WARNING LIGHT ILLUMINATED. THE CONTACT MENTIONED THAT THERE WAS A SUDDEN INCREASE OF ENGINE RPMS. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC, WHO DIAGNOSED THAT THE TIMING TENSIONER BELT FAILED AND ADVISED THE CONTACT TO TAKE THE VEHICLE TO THE DEALER. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 120,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/02/2015",
        "dateOfIncident": "07/21/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10745605,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "ON TUESDAY, JULY 21, I WAS AT A STOPLIGHT ON THE CORNER OF MERRICK AVENUE AND STEWART AVENUE IN GARDEN CITY, NY. WHILE WAITING FOR THE LIGHT TO TURN GREEN, THERE WAS A LOUD POP. I BRIEFLY LEFT MY AUTOMOBILE AND SAW THAT THE SUNROOF WAS SHATTERED. I TURNED AT THE LIGHT SINCE MY DESTINATION WAS LESS THAN A BLOCK FROM WHERE THE INCIDENT TOOK PLACE.",
        "vin": "1GYEE63A150"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/29/2015",
        "dateOfIncident": "05/18/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10722223,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 CADILLAC SRX. WHILE DRIVING AT 35 MPH, THE TRACTION LIGHT ILLUMINATED ON THE INSTRUMENT PANEL AND THE VEHICLE STALLED. THE VEHICLE RESTARTED, BUT LOST ACCELERATION AND THE STABILITY LIGHT ILLUMINATED. THE CONTACT MERGED TO THE SIDE OF THE ROAD. THE FAILURE RECURRED SEVERAL TIMES. THE VEHICLE WAS TOWED TO A DEALER WHERE IT WAS DIAGNOSED THAT THE CONNECTION WIRE FROM THE COMPUTER TO THE ACCELERATOR PEDAL WAS NOT CONNECTED AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 108,295.",
        "vin": "1GYEE63A550"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/15/2015",
        "dateOfIncident": "02/02/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10705878,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "AT APPROX. 121,000 MILES, WENT TO START MY CAR, WHEN STARTED THERE WAS AN AWFUL KNOCKING NOISE UNDER THE HOOD, THE ENTIRE CAR WAS SHAKING, AND MISFIRING. AFTER TAKING TO THE DEALER, I WAS TOLD THE TIMING CHAIN NEEDED REPLACED. OVER $2000 TO DO THIS, DURING HAVING THE TIMING CHAIN REPLACED I WAS TOLD THAT THE TIMING CHAIN GEARS HAD BEEN PREVIOUSLY MARKED MEANING THE TIMING CHAIN ON MY VEHICLE HAD BEEN PREVIOUSLY CHANGED. I HAVE READ ABOUT SO MANY PEOPLE HAVING THE EXACT SAME ISSUE WITH TIMING CHAINS HAVING TO BE REPLACED AT VERY LOW MILEAGE. I BELIEVE WITH ALL THE COMPLAINTS AND CONCERNS OF THE TIMING CHAINS FAILING AT THIS RATE, THIS SHOULD HAVE BEEN A RECALL AND BEEN REPLACED UNDER CADILLACS EXPENSE. THIS IS JUST RIDICULOUS. I HAVE SEEN PREVIOUS NHTSA ITEM #'S REGARDING THE SAME THING! THERE ARE PLENTY OUT THERE. PREVIOUS COMPLAINTS:  NHTSA ID # 10335816, 10512619, 10598962 ETC. THERE WAS A RECALL FROM GM ON TIMING CHAINS BUT ONLY INCLUDED MODELS  07 BULLETIN NO 11340A,REV B AND REV C. NHTSA REFERENCE- 10043857. I BELIEVE THIS RECALL SHOULD HAVE INCLUDED MODELS OLDER THAN  07 GOING BACK OF 04 AS SO MANY PEOPLE HAVE HAD THIS ISSUE! I BELIEVE GM SHOULD MADE RESPONSIBLE FOR REPLACING THESE ISSUE AND REIMBURSING FOR THE REPAIR COSTS. AS IF IT WAS IN 2007-2009 MODELS WHEN THEY REALIZED THE ISSUE IT IS MORE LIKELY TO HAVE BEEN IN OLDER MOLDERS AS WELL, AS THE ISSUE WAS NOT FIXED UNTIL AROUND 2010. MAKE GM RESPONSIBLE!  *TR",
        "vin": "1GYEE63A450"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/14/2015",
        "dateOfIncident": "03/09/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10705736,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERMITTENT ATTEMPTS AT STARTING. START ATTEMPTS WITHOUT THE KEY BEING ACTUATATED.  *TR",
        "vin": "1GYEE63A350"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/11/2015",
        "dateOfIncident": "02/10/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10682683,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR RAPIDLY SPEED UP AT FULL  AND LITTLE TIME AFTER THAT HEARD LOUD NOISE IN BACK AS DRIVING .TODAY TOOK TO MECHANIC AND DIDN'T EVEN GET POWER STARTING UP AND THEN SPEED UP AGAIN AT FULL STOP AND STARTED SMOKING TO. SAID POWER STEERING WENT OUT THOUGHT IT WAS THAT GOT ALMOST HOME PROBLEM STILL OCCURRED SO DID SOME RESEARCH AND FOUND THIS RECALL .   *TR",
        "vin": "1GYEE637150"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/06/2015",
        "dateOfIncident": "12/14/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10670417,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER DOOR LATCH STAYS IN THE OPEN POSITION, PREVENTING THE DOOR FROM LATCHING CLOSED. AFTER SITTING FOR A WHILE, OVER NIGHT OR A FEW DAYS, DOOR WILL LATCH CLOSED AGAIN. THIS IS A INTERMENT PROBLEM. CONCERNED WILL OCCUR WHILE DRIVING AS IT APPEARS TO BE EFFECTED BY THE ELECTRIC LOCK SYSTEM. CHECKED ON WEB SEVERAL OTHERS HAVE HAD THIS PROBLEM ALSO.",
        "vin": "1GYEE637250"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/29/2014",
        "dateOfIncident": "09/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10668838,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 CADILLAC SRX. THE CONTACT STATED THAT THE KEY WAS DIFFICULT TO REMOVE FROM THE IGNITION. THE FAILURE OCCURRED INTERMITTENTLY. THE CONTACT STATED THAT NHTSA CAMPAIGN NUMBER: 14V394000 (ELECTRICAL SYSTEM) EXCEEDED A REASONABLE MOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER INFORMED THAT THE PART WAS NOT AVAILABLE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 1,000.",
        "vin": "1GYEE637350"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/21/2014",
        "dateOfIncident": "11/21/2014",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10659967,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 CADILLAC SRX. THE CONTACT STATED THAT WHILE DRIVING AT APPROXIMATELY 15 MPH, THE HEATER WAS ACTIVATED AND THERE WAS AN ABNORMAL NOISE. THE CONTACT ALSO STATED THAT THERE WAS A BURNING ODOR EMITTING FROM THE VENTS AND THE STEERING WHEEL SEIZED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 75,000.",
        "vin": "1GYEE637450"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "11/08/2014",
        "dateOfIncident": "11/02/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10653557,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE EXPRESSWAY WITH MY CHILDREN IN THE CAR, I WAS GOING THE NORMAL SPEED LIMIT OF 60 MPH ON THIS ROAD.  ALL OF A SUDDEN, I LOOKED UP AND THE GLASS TO MY SUNROOF FLEW OFF.  I NEVER HAD A PREVIOUS ISSUE WITH THIS SUNROOF AND THERE WAS NOTHING LOOSE AT THE TIME OF THE INCIDENT.  I WAS SO SCARED THAT THE GLASS WOULD HIT SOMEONES CAR BUT IT DID NOT.  I AM STILL BAFFLED BY THE WHOLE EXPERIENCE. THERE HAS TO BE A MANUFACTURER'S DEFECT BECAUSE GLASS DOES NOT COME OFF A VEHICLE.  *TR",
        "vin": "1GYEE637050"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/17/2014",
        "dateOfIncident": "10/01/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10648316,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 CADILLAC SRX. WHILE DRIVING APPROXIMATELY 65 MPH, THE VEHICLE DECELERATED TO 30 MPH AND STALLED WITHOUT WARNING. THE FAILURE OCCURRED ON NUMEROUS OCCASIONS. THE DEALER MADE SEVERAL UNKNOWN REPAIRS TO THE VEHICLE, BUT THE FAILURE PERSISTED. THE VEHICLE WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 14V394000 (ELECTRICAL SYSTEM). THE VIN WAS UNAVAILABLE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 37,000.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/06/2014",
        "dateOfIncident": "09/23/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10641014,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "SUBMISSION FROM CONSTITUENT RE 2005 MODEL YEAR CADILLAC SRX GM RECALL #14172.  *SMD  THE DEALER INFORMED THE CONSUMER, THE PARTS WERE NOT AVAILABLE. *JB",
        "vin": "1GYEE637250"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/03/2014",
        "dateOfIncident": "08/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10641060,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 CADILLAC SRX. WHILE DRIVING APPROXIMATELY 30 MPH AND ATTEMPTING TO STOP FOR A RED LIGHT, THE BRAKES FAILED TO ENGAGE AND CAUSED THE VEHICLE TO DRIVE INTO A BUSY INTERSECTION. AFTER THE INCIDENT, THE ABS SENSOR ILLUMINATED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC. THE TECHNICIAN STATED THAT THE ABS WAS FAULTY. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE, BUT NO SOLUTION WAS OFFERED. THE FAILURE MILEAGE WAS 91,000.",
        "vin": "1GYEE637350"
    },
    {
        "components": "STEERING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/29/2014",
        "dateOfIncident": "08/15/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10639770,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 CADILLAC SRX. WHILE DRIVING 60 MPH, THE STEERING WHEEL SEIZED WITHOUT WARNING. THE VEHICLE STALLED AND DID NOT RESTART. THE VEHICLE WAS TOWED TO A DEALER WHERE IT WAS DIAGNOSED THAT THE ENGINE NEEDED TO BE REPLACED. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE FAILURE MILEAGE WAS 115,000.",
        "vin": "1GYEE637550"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/23/2014",
        "dateOfIncident": "09/23/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10638474,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DEALERSHIP IN MY CITY RAN OUT OF PARTS TO REPAIR MY VEHICLE THEY WERE SENT ONLY A FEW SO WE ALL ON A WAITING LIST FOR ??????  *TR",
        "vin": "1GYEE637750"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/22/2014",
        "dateOfIncident": "09/22/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10638273,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "UNBELIEVABLE. YOU GIVE SPACE FOR 2,551 CHARACTERS BEYOND YOUR LIMIT BEFORE I HIT A PROBLEM. I HAVE COPIED MY COMPLAINT AND SENT IT TO GM DIRECTLY INSTEAD OF POSTING IT HERE. DO NOT BOTHER ME. I TRUST GM TO HANDLE IT. MY COMPLAINT IS IN GM'S BEST INTEREST ANYWAY. GOOD NIGHT.  *TR",
        "vin": "1GYEE637450"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/27/2014",
        "dateOfIncident": "08/06/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10628725,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 CADILLAC SRX. THE CONTACT RECEIVED A NOTIFICATION FOR NHTSA CAMPAIGN NUMBER 14V394000 (ELECTRICAL) BUT WAS INFORMED THAT THE PART WAS UNAVAILABLE. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "1GYEE637350"
    },
    {
        "components": "SUSPENSION,ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/04/2014",
        "dateOfIncident": "12/08/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10618784,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THRU OUT THE OWNERSHIP OF THIS VEHICLE, IT HAS HAD MULTIPLE SIGNAL AND HEADLIGHT PROBLEMS, IGNITION, AND NOW THE SUSPENSION SYSTEM DEFECTIVE. (QUOTED BY GM DEALERSHIP, COST WILL BE $5,000.00 PLUS).  WHAT DOES IT TAKE, AN ACCIDENT KILLING SOMEONE FOR GM TO REPAIR/REPLACE, WHATEVER IT TAKES, ON THIS VEHICLE? PLEASE, I URGE GM TO CONSIDER STEPPING UP TO THE PLATE AND TAKING CARE OF THIS VERY SERIOUS PROBLEM. WE HAVE OWNED 5 NEW CADILLACS WITH NO PROBLEMS, UNTIL NOW. WE LOVE THIS CAR BUT ARE VERY HESITANT TO TAKE THIS VEHICLE LONG DISTANCES. PLEASE, PLEASE TAKE CARE OF THIS PROBLEM.   *TR",
        "vin": "1GYEE637050"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/03/2014",
        "dateOfIncident": "06/17/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10607999,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2005 CADILLAC SRX.  WHILE DRIVING 35 MPH, THE VEHICLE FAILED TO STOP WHEN THE BRAKE PEDAL WAS DEPRESSED.  THE VEHICLE MANAGED TO COME TO A STOP WHEN THE CONTACT APPLIED THE EMERGENCY BRAKE.  THE CONTACT TURNED OFF AND RESTARTED THE VEHICLE AND THE BRAKES PERFORMED NORMALLY.  THE FAILURE OCCURRED ON THREE DIFFERENT OCCASIONS.  THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED.  THE MANUFACTURER WAS NOTIFIED.  THE FAILURE MILEAGE WAS 73,000.",
        "vin": "1GYEE637350"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/30/2014",
        "dateOfIncident": "06/26/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10607092,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON I20 IN GEORGIA. MY CHECK ENGINE LIGHT CAME ON AND BEFORE I COULD GET OFF INTERSTATE CAR STARTED MAKING HORRIBLE NOISE. GOT OFF AND TURNED OFF ENGINE. WHEN I TRIED TO RESTART IT, IT WOULD JUST MAKE A GRINDING NOISE. SOMEONE CHECKED THE OIL FOR ME AND IT WAS BONE DRY. COMPUTER STATED 61% OIL LIFE LEFT AND NEVER GAVE ME A \"OIL CHANGE\" NOTICE. NOW THE ENGINE IS SHOT AND NEEDS REPLACING. I WAS GOING 70 MPH AT THE TIME AND CAR WENT DOWN TO ABOUT 30 MPH WITHIN SECONDS. THIS COULD HAVE CAUSED A HORRIBLE ACCIDENT!  *TR",
        "vin": "1GYEE637550"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/17/2014",
        "dateOfIncident": "06/09/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10598962,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TIMING CHAIN BROKE CAUSING THE VEHICLE TO FAIL IN THE MIDDLE OF TRAFFIC. GM HAS NO RECALLS ON TIMING CHAINS ON THIS MODEL BUT HAS THE SAME ISSUE/RECALL FOR OTHER MODELS OF CADILLACS. THEY WANT CUSTOMERS TO PAY FULL RETAIL PRICE TO REPAIR THE BAD DESIGN ISSUE THAT THEY KNOW ABOUT.  *TR",
        "vin": "1GYEE637250"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/19/2014",
        "dateOfIncident": "05/17/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10592407,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL * THE CONTACT OWNS A 2005 CADILLAC SRX.  THE CONTACT STATED THAT THE VEHICLE WOULD NOT START.  THE VEHICLE WAS NOT TAKEN TO THE DEALER AND WAS NOT DIAGNOSED.  THE MANUFACTURER WAS NOTIFIED AND STATED THAT NOTHING COULD BE DONE.  THE FAILURE MILEAGE WAS 63,000.",
        "vin": "1GYEE637750"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/03/2014",
        "dateOfIncident": "04/08/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10586387,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "RIGHT AND LEFT TURN SINGLES HAVE GONE OUT 6 TO 7 TIMES SINCE I HAVE OWNED THE CAR. WHEN THEY ARE REPLACED THEY ONLY LAST A FEW WEEKS. MY DEALERS SATES THAT THE PLUGS NEED REPLACED. I HAVE HEARD THAT THIS AFFECTS 2004 THROUGH 20009. WITH LARGE NUMBER I THINK IT SHOULD BE RECALLED. 30% OF ALL ACCIDENTS ARE CAUSED BY NOT USING OR FAULTY TURN  SINGLES. THE DEALER CHARGES $200.00 TO REPLACE THE BULBS PER SIDE.   *TR",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/01/2014",
        "dateOfIncident": "02/06/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10585950,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 CADILLAC SRX. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, THE STABILITY WARNING LIGHT ILLUMINATED AND THE VEHICLE DECELERATED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO WAS UNABLE TO DIAGNOSE THE CAUSE OF THE FAILURE. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 150,000.",
        "vin": "1GYEE637350"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/28/2014",
        "dateOfIncident": "01/23/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10561744,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT MY 2005 CADILLAC SRX AT 43,000 MILES JUNE 25,2012 NOW IT'S JANUARY 23,2014 AND THE POWER STEERING GOES OUT AT 72,000 MILES. THERE WAS A HUGE LEAK STEERING WAS VERY TIGHT AND STABILITY WAS IN USE. MY FATHER SAID IT LOOKS LIKE THE PUMP WAS REPLACED ONCE THAT'S RIDICULOUS WITH THE LOW MILES MY CAR HAS. I THINK CADILLAC REALLY NEEDS TO FIX THE PROBLEM THEY HAVE RECALLS ON THE 2004'S THEY NEED TO FIX THE 2005'S TOO! IT'S A BURDEN RIGHT NOW I'M PAYING FOR A CAR THAT'S SITS IN THE GARAGE NOW!  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/17/2013",
        "dateOfIncident": "09/01/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10544113,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2005 CADILLAC SRX AWD V8. THERE WAS A POWER STEERING LEAK THAT OCCURRED APPROXIMATELY 9/2010 (DATE COULD BE OFF, BUT GM HAS THE OFFICIAL DATES/MILEAGE). THIS WAS SERVICED BY THE DEALER AND THEY REPLACED THE POWER STEERING RETURN LINE STATING THAT THIS IS A REGULAR OCCURRENCE IN THIS STYLE CADILLAC. I FILED A COMPLAINT WITH GM AT THE TIME BECAUSE I HAD TO RENT A CAR FOR 3 WEEKS AS THE PART WAS OUT OF STOCK AND IN PRODUCTION. GM AGREED TO PAY FOR MY RENTAL CAR. APPROXIMATELY 4/2013 THE SAME LEAK STARTED UNDER MY POWER STEERING RETURN LINE. I BROUGHT IT TO THE DEALER WHERE I WAS AGAIN TOLD THAT IT IS COMMON FOR THIS PART TO DEFAULT AND THAT THEY WOULD NEED TO REPLACE THE ENTIRE POWER STEERING RACK AS WELL AS THE POWER STEERING RETURN LINE AGAIN. THEY QUOTED ME APPROXIMATELY $2000. I AGAIN FILED A COMPLAINT WITH GM AND THEY SAID THOUGH IT IS A COMMON PROBLEM THEY WERE NOT WILLING TO PAY ANY COST FOR REPAIR. I HAVE A MUTUAL FRIEND WHO OWNS THE SAME STYLE CADILLAC SRX AS I DO AND THE SAME PROBLEM JUST HAPPENED TO HIM. HE WAS ADVISED BY THE DEALER THAT HE WOULD NEED TO REPLACE THE POWER STEERING RACK AND RETURN LINE FOR A COST OF APPROXIMATELY $2000. I BELIEVE THERE IS A HUGE RISK IN ALLOWING THESE VEHICLES TO REMAIN ON THE ROAD IF THEY HAVE PS PROBLEMS. MY VEHICLE EVEN AFTER HAVING THE LINE FIXED IS AGAIN SPEWING POWER STEERING FLUID ALL OF MY ENGINE PARTS AND DRIPS ONTO MY AXLE. IF I AM STOPPED WITH MY CAR ON, YOU CAN SEE SMOKE RISING AND THERE IS A BURNING SMELL COMING FROM THE AFFECTED AREA. PLEASE HELP!  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/18/2013",
        "dateOfIncident": "03/23/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10512619,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOOK MY CAR IN FOR SERVICE BECAUSE THE ENGINE LIGHT CAME ON, AFTER THE DEALER PERFORMED ITS CHECKS, IT STATED IT WAS A PURGE VALVE, WHICH THEY SUPPOSEDLY FIXED, HOWEVER A WEEK LATER THE ENGINE BROKEN DOWN. I HAD THE CAR TOWED BACK TO THE DEALER ONLY TO FIND OUT, IT WAS TIMING CHAIN THAT TOTALLY FAILED CAUSING MORE THAN 8000.00 IN REPAIRS WHEN THE ENGINE ONLY HAD 65,000 MILES.   *TR",
        "vin": "1GYEE637250"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/13/2013",
        "dateOfIncident": "08/15/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10511609,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING I PUSHED ON THE BRAKES AND THE PEDDLE WENT TO THE FLOOR. I GOT IT TO THE REPAIR SHOP AND WAS TOLD THAT THE BRAKE LINE WAS RUSTED OUT. I HAD IT REPLACED. IT HAS HAPPENED TO 3 DIFFERENT BRAKE LINES. THE LATEST WAS JUST LAST WEEK, GOING UP MY DAUGHTERS DRIVEWAY.  *TR",
        "vin": "1GYEE637850"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/24/2013",
        "dateOfIncident": "04/24/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10509409,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 CADILLAC SRX. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, THE ELECTRONIC STABILITY CONTROL LIGHT ILLUMINATED AND THEN ENGAGED INDEPENDENTLY, WHICH APPLIED THE REAR BRAKES. THE FAILURE RECURRED NUMEROUS TIMES. THE VEHICLE HAD NOT BEEN REPAIRED. THE FAILURE AND CURRENT MILEAGE WAS 97,000.",
        "vin": "1GYEE637850"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/14/2013",
        "dateOfIncident": "03/01/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10502968,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 CADILLAC SRX.  CONSUMER WRITES IN REGARDS TO VEHICLE JERKING,BUCKING AND STALLING WHILE DRIVING.  *SMD  THE CONSUMER STATED HE DISCOVERED THE PROBLEM WAS WITH THE BRAKES. APPARENTLY, THE VEHICLE HAS FIVE DIFFERENT SYSTEMS THAT CAN WORK THE BRAKES AUTOMATICALLY, AND IT SEEMED ONE OF THEM WAS WORKING HARDER THAN NORMAL. THE CONSUMER STATED HE WAS ALWAYS TAUGHT TO PRESS ON THE BRAKE PEDAL THREE OR FOUR TIMES WHEN MAKING A FULL STOP, SO THE BRAKES WOULD NOT HEAT UP OR WEAR OUT PREMATURELY. HOWEVER, HE BELIEVED THE VEHICLE WAS INTERPRETING HIS WAY AS A PANIC STOP. WHEN HE APPLIED THE BRAKE ONLY ONCE, WITHOUT LETTING OFF THE BRAKE ALL THE WAY TO A FULL STOP, THERE WAS NO BUCKING. THE CONSUMER BELIEVED THE PANIC BRAKE ASSIST SYSTEM , WAS ONLY ONE OF THE FIVE BRAKE ASSIST SYSTEMS THAT HE BELIEVED COULD STOP THE VEHICLE IMMEDIATELY, AS IT DID THE PREVIOUS WEEK.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/27/2012",
        "dateOfIncident": "10/27/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10482452,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE FOUND THAT THE REASON FOR DISAPPEARING OIL IS THE SNORKEL FOR AIR INTAKE IS TO SMALL, AND WHILE DRIVING ENGINE SUCKS OIL OUT OF TAPPIT COVER INTO INTAKE AND THE AUTO BURNS IT. ITS A POOR DESIGN AND GM SHOULD REPAIR IT.   *TR",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/04/2012",
        "dateOfIncident": "07/31/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10469185,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING HOME ON INTERSTATE I-85 SOUTH IN GEORGIA ENGINE LIGHT CAME ON CAR SEEMED TO BE HESITATING AND THEN STOPPED. BROUGHT CAR (TOWED) TO ROSS CADILLAC IN GAINSVILLE GA. DEALER EXAMINE CAR AND SAID IT WAS 4 QUARTS LOW ON OIL I DON'T SEE HOW THAT'S POSSIBLE WHEN I CHECKED THE OIL LEVEL THAT MORNING AND IT WAS FINE. I HAD THE CAR OIL CHANGED LESS THAN 3000 MILES AGO. DEALER SAID HE RAN CODES AND IT INDICATED TIMING CHAIN WAS BAD. DEALER QUOTED ME $1600 FOR NEW TIMING CHAIN. DEALER CALLED NEXT DAY AND SAID IT NEEDS A NEW ENGINE FOR $3800 IN ADDITION TO THE ALREADY INCURRED $700. I HAVE LOOKED ON LINE AND MANY PEOPLE HAVE HAD THE SAME PROBLEM, SOME CALL IT DISAPPEARING OIL?? THE CAR HAS NO WARRANTY BUT YOU WOULD THINK CADILLAC WOULD HAVE NOTIFIED DEALERS OF THIS RECURRING PROBLEM AND HAD A RECALL FOR TIMING CHAIN, LOW OIL PROBLEM.  *TR",
        "vin": "1GYEE637450"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/01/2012",
        "dateOfIncident": "07/31/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10468764,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TIMING CHAIN WENT OUT AND ENGINE LOCKED.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "04/16/2012",
        "dateOfIncident": "03/31/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10455394,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 CADILLAC SRX. WHILE DRIVING APPROXIMATELY 45 MPH, THE CONTACT STATED THAT THE STEERING BECAME DIFFICULT TO MANEUVER AND HE LOST CONTROL OF THE VEHICLE. THERE WERE NO WARNING LIGHTS ILLUMINATED ON THE INSTRUMENT PANEL. THE CONTACT THEN CRASHED INTO A HIGHWAY DIVIDER AND INTO ANOTHER VEHICLE. THERE WERE NO INJURIES. THE VEHICLE WAS TOWED TO AN AUTO CENTER AND THE MECHANIC STATED THAT THERE WAS A RECALL UNDER NHTSA CAMPAIGN ID NUMBER 06V125000 (SUSPENSION:REAR), THAT MAY BE RELATED TO THE FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STATED THAT THE VIN WAS NOT INCLUDED IN THE RECALL. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 46,000.",
        "vin": "1GYEE637650"
    },
    {
        "components": "TRACTION CONTROL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/11/2012",
        "dateOfIncident": "02/07/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10454905,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 CADILLAC SRX. THE CONTACT STATED THAT WHILE DRIVING 45 MPH, THE STABILITY CONTROL WARNING LIGHT ILLUMINATED.  THE CONTACT STATED THAT WHEN THE FAILURE OCCURRED, THE VEHICLE WOULD VIBRATE AND THE STEERING WHEEL WOULD STIFFEN. THE CONTACT TOOK THE VEHICLE TO THE DEALER BUT THE DEALER COULD NOT DIAGNOSE A FAILURE WITH THE VEHICLE. THE CONTACT DID NOT CALL THE MANUFACTURER.  THE FAILURE MILEAGE WAS 100,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": true,
        "dateComplaintFiled": "03/31/2012",
        "dateOfIncident": "03/30/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10453674,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "05 XRS TOTAL LOSS OF CONTROL W/ SERIOUS ACCIDENT BY GARRBOSR  MAR 31, 2012 (4:27 PM)  I WAS ON THE BELT PARKWAY YESTERDAY ON THE EDGE OF QUEENS WHERE THE CROSS ISLAND AND BELT SPLIT, HEADING EAST INTO THE TUNNEL OVERPASS. A FEW MILES BACK I BECAME AWARE THE CAR WAS STRONGLY OVER COMPENSATING IN THE TURNS . I EVEN CHECKED TIRE PRESSURE IN ALL 4 TIRES, W/ READS OF 36,35,35,32. NEW EXPENSIVE TIRES WITH LESS THAN 5,000 MI READS WERE A BIT I FILLED ON A COLD DAY WHEN ALERTED ME LOW PRESSURE. GOING TO PULL OVER AT FIRST CHANCE LET SOME AIR OUT  IM COMING UP ON THE OVERPASS TUNNEL GOING EAST, BARING TO THE RITE, IM IN THE RITE LANE OF THE LEFT SPLIT, I SLOWED DOWN TO AROUND 45, I WAS PREPARED , I ENTERED BOTH HANDS ON THE WHEEL, ITS WAS A LITTLE RUTTY THERE AND A LITTLE POT HOLE. THE CAR LUNGED INTO THE TURN, ALMOST HITTING THE RITE HAND WALL, I WAS BARELY ABLE TO KEEP THE CAR OFF THE WALL ON THE RITE WITH A SLIGHT CORRECTION, WAS THROWN TO THE LEFT AS IT OVER COMPENSATED COMING BACK INTO A FULL BROADSIDE LEFT, CLIPPING THE CAR COMING BY ON THE LEFT, WITH MY FRONT L CORNER AND TAKING OUT HER REAR BUMPER, SOMEWHAT RIGHTING MY CAR BUT SLAMMING ME INTO THE EAST WEST DIVIDER WALL, TAKING OUT THE ENTIRE RITE SIDE AND BREAKING THE REAR LEFT AXLE. WITH ALL THE HIGH PRICED HIGH END SUSPENSION, STEERING, TCS, ANTI LOCK BREAKING THIS CAR SHOULD IN NO WAY EVER REACTED THIS WAY. ITS DESIGNED TO PREVENT THIS EXACT SCENARIO ! EVERYTHING FAILED !       *JS",
        "vin": "1GYEE637650"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/19/2012",
        "dateOfIncident": "03/28/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10452281,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER MY PURCHASE OF THE 2005 CADILLAC SRX IN 2007I HAVE HAD A CONTINUOUS PROBLEM WITH THE STABILITY SYSTEM EVER SINCE.  A MESSAGE KEEPS POPPING UP THAT THE STABILITY SYSTEMS NEEDS MAINTENANCE FOLLOWED BY ANOTHER MESSAGE THAT THE STABILITY SYSTEM HAS BEEN ENGAGED, WHICH COMES UP SEVERAL TIMES WHEN YOUR ON THE FREEWAY TRAVELING 60+MPH. I'VE BROUGHT THE CAR IN TO GET LOOKED AT, HOWEVER THEY ARE UNABLE TO FIND THE PROBLEM SINCE THE MESSAGE DID NOT POP UP AT THE DEALERSHIP.  THIS IS A DANGEROUS PROBLEM TO HAVE ESPECIALLY WHEN YOUR ON THE ROAD AND THE MESSAGE POPS UP THAT THE STABILITY SYSTEM IS ENGAGED AND YOUR STEERING LOCKS FOR A FEW SECONDS AND YOU HAVE NO CONTROL OF YOUR STEERING WHEEL.  I'VE BEEN ABLE TO TURN THE TRACTION CONTROL OFF, HOWEVER IT STILL DOESN'T CHANGE THE PROBLEM.  YOU WILL STILL ENCOUNTER THE STABILITY MESSAGE COMING UP, THEN EXPERIENCE THE STEERING LOCK UP AND THEN IT GOES AWAY. YOU CAN GET INTO A MAJOR ACCIDENT IF THIS IS NOT FIXED WITH CADILLAC. ALTHOUGH MOST CADILLAC OWNERS ARE GETTING THE RUN AROUND WITH THIS SPECIFIC PROBLEM,  GM PLEASE HEAR ALL THE COMPLAINTS MADE BY CADILLAC OWNERS, THESE STATEMENTS SHOULD BE TAKEN SERIOUSLY.  *JS",
        "vin": ""
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/08/2012",
        "dateOfIncident": "02/04/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10447145,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 CADILLAC SRX. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 65 MPH, THE VEHICLE SUDDENLY DECELERATED TO 40 MPH. THE CONTACT WAS ABLE TO ACCELERATE TO HIGHER SPEEDS BUT THE VEHICLE HESITATED IN THE PROCESS. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THEY ADVISED HER THAT THE STABILITY CONTROL FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS CONTACTED AND THEY OFFERED NO ASSISTANCE. THE FAILURE AND CURRENT MILEAGES WERE APPROXIMATELY 79,000. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/14/2011",
        "dateOfIncident": "11/10/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10439968,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 CADILLAC SRX.  THE CONTACT STATED THAT THE CHECK ENGINE LIGHT WAS ILLUMINATED AND THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSTIC TESTING.  THE TEST RESULTS SHOWED DETERMINED THAT THE FUEL TANK CAP AND THE TIRE TRACTION SENSORS ON THE REAR TIRES NEEDED REPLACING. THE DEALER REPLACED THE FUEL TANK CAP AND TIRE TRACTION SENSORS.  THE CONTACT STATED THAT AFTER THE REPAIRS, THE CHECK ENGINE AND TIRE TRACTION WARNING LIGHTS ILLUMINATED. THE CONTACT TOOK THE VEHICLE BACK TO THE DEALER AND THE DEALER STATED THAT THE CATALYTIC CONVERTER MALFUNCTIONED. IN ADDITION, THE CONTACT STATED THAT THE VEHICLE WOULD RATTLE ABNORMALLY WHEN DRIVING VARIOUS SPEEDS. THE FAILURE MILEAGE WAS 148,665.",
        "vin": "1GYEE637250"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/07/2011",
        "dateOfIncident": "12/06/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10438903,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 CADILLAC SRX. THE CONTACT WAS DRIVING 65 MPH WHEN THE VEHICLE EXHIBITED AN ABNORMAL WHINING. THE VEHICLE WAS TAKEN TO PRIVATE MECHANIC FOR MAINTENANCE WHERE THE MECHANIC CONFIRMED THAT THE REAR RACK AND PINION WAS LEAKING AND NEEDED TO BE REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND ADVISED THE CONTACT THAT THE VEHICLE WAS NOT INCLUDED IN THE RECALL ASSOCIATED WITH NHTSA CAMPAIGN ID NUMBER: 07V589000( POWER TRAIN:AXLE ASSEMBLY:AXLE SHAFT:SEAL). THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND THE CURRENT MILEAGES WERE 109,000. UPDATED 01/10/12*LJ  UPDATED 01/11/12",
        "vin": "1GYEE63AX50"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/29/2011",
        "dateOfIncident": "10/27/2011",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10433512,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN STOPPING, THEN STARTING UP (WITH THE ENGINE RUNNING, LIKE AT A STOP SIGN) THE 2005 CADILLAC SRX WILL OFTEN FAIL TO MOVE WHEN THE ACCELERATOR IS PRESSED AND THE +TRACTION CONTROL+ INDICATION LIGHTS UP ON THE RADIO. THIS ALSO HAPPENS SOMETIMES WHEN TURNING WITHOUT STOPPING. IT HAPPENS ON LEVEL GROUND AND WHEN GOING UP INCLINES. IT MAKES A GRINDING SOUND (LIKE WHEN GEARS ARE RAKED IN A MANUAL TRANSMISSION.) BY LETTING OFF THE ACCELERATOR, THEN RE-APPLYING IT, THE CAR WILL MOVE, BUT THE HESITATION IS VERY DANGEROUS. IF THE DRIVER DOES NOT LET OFF OF THE ACCELERATOR DURING ONE OF THESE EPISODES, THE CAR WILL VERY SLOWLY BEGIN TO MOVE AND EVENTUALLY ACCELERATE NORMALLY. THIS HAPPENS ON WET OR DRY PAVEMENT, WITH NO REASON FOR LOSS OF TRACTION. +TURNING OFF+ THE TRACTION CONTROL FEATURE BY PRESSING THE BUTTON ON THE CONSOLE DOES NOT ALWAYS PREVENT THIS FROM HAPPENING. THE PROBLEM DOES NOT HAPPEN ALL THE TIME, BUT INTERMITTENTLY. I HAVE HAD THE CAR INTO THE DEALER FOR REPAIR OF THE PROBLEM NUMEROUS TIMES, BUT THE DEALER HAS NEVER BEEN ABLE TO DIAGNOSE OR SOLVE THE DEFECT. I PUT MY SAFETY AND OTHERS AT RISK WITH EVERY MILE THAT I DRIVE THIS CAR.  *TR",
        "vin": "1GYEE637850"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/21/2011",
        "dateOfIncident": "10/08/2011",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10432419,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE WAS BACKING OUT OF THE DRIVE WAY WHEN SHE SAW SMOKE COMING OFF THE CRACKS OF THE DRIVERS SIDE IN THE FRONT OF THE VEHICLE. THE HOOD WAS CLOSED AND HAD LOTS OF BLACK SMOKE GUSHING OUT OF THE CRACKS AND IT SMELLED LIKE BURNING PLASTIC.     I TRIED STARTING THE VEHICLE AND TO MY SURPRISE THE VEHICLE STARTED BUT MOST OF THE ELECTRONIC CONTROLS WERE SHOWING ERRORS IN THE DASH. I WAS ABLE TO DRIVE IT CAREFULLY TO THE NEAREST CADILLAC DEALER (LAVERY AUTO) IN ALLIANCE, OH. WHEN I STOPPED THE CAR I WAS UNABLE TO TAKE OFF THE KEYS FROM THE IGNITION BECAUSE THE SECURITY SYSTEM ALSO HAD AN ERROR.    THEY DIAGNOSED THE PROBLEM AND FOUND THAT THE ELECTRICAL SYSTEM IN THE AC COMPRESSOR HAD CAUGHT FIRE AND ALSO MELTED THE WIRING. THIS HAD ALSO DESTROYED THE COMPUTER ECM OF THE VEHICLE. THEY REPAIRED IT AND I BROUGHT THE SRX BACK HOME IN THE EVENING OF 10/14/11 AND PARKED IT IN MY DRIVE WAY. THE NEXT MORNING I FOUND THE BATTERY WAS DEAD AND HAD TO USE MY WIFE'S CAR TO JUMP START. THE SAME THING HAPPENED THE NEXT DAY MORNING AND HAD TO CALL UP A TOW TRUCK TO JUMP START THE SRX.     I TOOK IT BACK TO THE SAME DEALER (LAVERY AUTOMOTIVE) AND THEY FOUND THAT ANOTHER RELAY WAS BAD DUE TO THE FIRE AND THEY REPLACED THIS TOO.  I SPENT OVER $1,500 TO REPAIR THIS VEHICLE. I HAVE THE RECEIPTS WITH FULL EXPLANATIONS. I WOULD LIKE FOR YOU TO INVESTIGATE THE REASON FOR THIS FIRE THAT HAD THE POTENTIAL TO INJURE ME AND MY FAMILY AND ALSO PROVIDE ASSISTANCE IF POSSIBLE IN HAVING GENERAL MOTORS REIMBURSE ME FOR THESE CHARGES BECAUSE OF POOR SAFETY AND QUALITY IN THIS VEHICLE.  THANK YOU.   *TR",
        "vin": "1GYEE637050"
    },
    {
        "components": "SUSPENSION,AIR BAGS,ELECTRONIC STABILITY CONTROL",
        "crash": true,
        "dateComplaintFiled": "10/12/2011",
        "dateOfIncident": "08/18/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10429582,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD SEVERAL INCIDENTS WHEN MY \"VEHICLE STABILITY CONTROL\" HAS TURNED ON BY ITSELF CAUSING THE ENTIRE CAR TO VIOLENTLY JERK TO THE RIGHT SIDE. I WAS COMING OFF OF A EXIT ON 8/18/2011 AT ABOUT 40MPH ONCE AGAIN THE TRACTION CONTROL CAME ON FOR NO REASON CAUSING THE VEHICLE TO JERK VIOLENTLY TO THE RIGHT, I LOST CONTROL OF THE VEHICLE, JUMPED A CURB, HIT A LIGHT POLE AND ROLLED INTO THE TREES. CAUSING ME TO LOOSE CONSCIOUSNESS, MISS 6 WEEKS FROM WORK AND INCUR THOUSANDS OF DOLLARS IN REPAIR COSTS AND MEDICAL EXPENSES. THE AIRBAGS DID NOT DEPLOY DURING THE RIGHT SIDE FRONTAL CRASH. THE SEATBELT CAUSED 3 HERNIATED DISKS IN MY NECK THAT I AM STILL BEING TREATED FOR. IN ADDITION TO THAT THE TRANSFER CASE CHAIN SNAPPED AND I HAD TO PAY OUT OF POCKET FOR THE REPAIR.  *KB",
        "vin": "1GYEE637850"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/20/2011",
        "dateOfIncident": "06/21/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10426443,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 CADILLAC SRX. THE CONTACT STATED THAT WHEN DRIVING AT LOW SPEEDS AND ATTEMPTING A U-TURN, THE VEHICLE STALLED AND THE ELECTRONIC STABILITY CONTROL LIGHT WAS ILLUMINATED ON THE INSTRUMENTAL PANEL. THE VEHICLE WAS NOT INSPECTED BY A DEALER NOR REPAIRED. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS APPROXIMATELY 102,000.",
        "vin": "1GYEE637750"
    },
    {
        "components": "TRACTION CONTROL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/04/2011",
        "dateOfIncident": "07/03/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10417054,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 CADILLAC SRX. THE CONTACT STATED THAT THE TRACTION CONTROL WOULD ACTIVATE ABNORMALLY, WHEN IT WAS NOT ENGAGED BY THE CONTACT. THE FAILURE WOULD CAUSE THE CONTACT TO LOSE CONTROL OF THE VEHICLE. THE VEHICLE WAS INSPECTED BY THE DEALER WHO ADVISED THAT THE THEY WOULD REPROGRAM THE VEHICLE. THE VEHICLE WAS REPROGRAMMED BUT THE FAILURE RECURRED WITHIN A FEW DAYS. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND THEY OFFERED NO ASSISTANCE. THE FAILURE MILEAGE WAS APPROXIMATELY 40,000.",
        "vin": "1GYEE637850"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/26/2011",
        "dateOfIncident": "07/13/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10415274,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 CADILLAC SRX. THE CONTACT STATED THAT THE VEHICLE WOULD JERK WHILE ACCELERATING AND THE CHECK ENGINE LIGHT WOULD ILLUMINATE ON THE INSTRUMENT PANEL. THE VEHICLE WAS TAKEN TO AN INDEPENDENT REPAIR SHOP WHERE THE CONTACT WAS INFORMED THAT THERE WAS AN OIL LEAK WITHIN THE ENGINE. AS A RESULT, THE CATALYTIC CONVERTER AND SOLENOID NEEDED TO BE REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE, BUT OFFERED NO ASSISTANCE AND REFERRED THE CONTACT TO NHTSA. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGES WERE 74,000.",
        "vin": "1GYEE637150"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/05/2011",
        "dateOfIncident": "07/01/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10410488,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 CADILLAC SRX.  WHILE DRIVING, THE CONTACT STATED THAT THE VEHICLE WOULD MAKE A RATTLING NOISE AND IT WOULD ALSO HESITATE.  A LOCAL MECHANIC DIAGNOSED THAT THE CATALYTIC CONVERTER NEEDED TO REPLACED. THE VEHICLE WAS NOT REPAIRED. THE DEALER WAS NOTIFIED, BUT DID NOT ASSIST WITH THE FAILURE. THE VIN WAS UNKNOWN. THE FAILURE MILEAGE WAS 70,000 AND THE CURRENT MILEAGE WAS 74,000.",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/28/2011",
        "dateOfIncident": "04/01/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10398141,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 CADILLAC SRX.  THE CONTACT STATED THAT THE SHOCK ABSORBER WAS NOT FUNCTIONING PROPERLY, CAUSING THE VEHICLE TO BOUNCE UP AND DOWN WHEN TRAVELING. AT 40,000 MILES, THE CONTACT STATED THAT THE SERVICE SUSPENSION SYSTEM INDICATOR ILLUMINATED ON THE INSTRUMENT PANEL INTERMITTENTLY.  THE DEALER ADVISED THE CONTACT THAT THE ELECTRONIC SUSPENSION CONTROL MODULE WAS CORRODED AND NEEDED TO BE REPLACED.  THE MANUFACTURER OFFERED TO PAY HALF OF THE REPAIR COST. THE CURRENT MILEAGE WAS 80,000 AND THE FAILURE MILEAGE WAS 40,000.",
        "vin": "1GYEE63A250"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/14/2011",
        "dateOfIncident": "04/10/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10395861,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE CHANGING LANES...MY STEERING WHEEL LOCKED AND VEHICLE JUMPED TO THE RIGHT LANE.  I RESTARTED THE CAR AND THE WHEEL WAS FREE.  I TOOK IT IN FOR REPAIRS AND WAS TOLD I MUST REPLACE THE ENTIRE STEERING RACK, PUMP AND HOSES FOR A COST OF $ 2,489.00.  THE REPAIR FACILITY TOLD ME THIS IS VERY COMMON IN SRX AND THAT HE JUST DID THE SAME THING ON ANOTHER 05 SRX!  SCARY AND COSTLY!  *TR",
        "vin": "1GYEE637750"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/14/2011",
        "dateOfIncident": "10/15/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10395857,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "IN OCTOBER OF 08 MY 05 CADILLAC SRX BEGAN TO BUCK AND HESITATE EXTENSIVELY.  I HAD IT TOWED TO THE DEALER AND WAS TOLD IT HAD NO OIL IN IT.  I PRODUCED MY RECEIPT THAT I HAD THE OIL CHANGED 730 MILES PREVIOUS.  CAR HAD 53,000 MILES ON IT AND OUT OF WARRANTY!  I HAVE SINCE HAD TO REPLACE THE FUEL INJECTORS (6 AT $800) EACH AND WAS TOLD THAT THIS CAR IS \"KNOWN FOR BURNING OIL...WHICH LEADS TO THIS PROBLEM!\".  I NOW USE THREE QUARTS OF OIL EVERY 6000 MILES BETWEEN OIL CHANGES!  CAR HAS 81,000 MILES AND COSTS ME ABOUT 2000 EVERY 6 MONTHS IN REPAIRS!  *TR",
        "vin": "1GYEE637750"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/14/2011",
        "dateOfIncident": "01/10/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10390088,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 CADILLAC SRX. WHILE DRIVING APPROXIMATELY 35 MPH, THE CONTACT HEARD A LOUD KNOCKING NOISE FROM THE REAR OF THE VEHICLE. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHERE THEY STATED THAT THE FAILURE WAS RELATED TO THE REAR DIFFERENTIAL. THE VEHICLE WAS REPAIRED YET THE FAILURE RECURRED TWO YEARS LATER. THE CONTACT REFERENCED NHTSA CAMPAIGN ID NUMBERS: 06V125000 (SUSPENSION:REAR) AND 07V589000 (POWER TRAIN:AXLE ASSEMBLY:AXLE SHAFT:SEAL) BUT THE CONTACTS VIN WAS NOT INCLUDED IN EITHER RECALL AND THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 33,000.   UPDATED 05/04/11 *BF  UPDATED 05/09/11",
        "vin": "1GYEE637750"
    },
    {
        "components": "STEERING,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/23/2011",
        "dateOfIncident": "02/05/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10384140,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2005 CADILLAC SRX AND IN THE PAST 3 MONTHS I HAVE EXPERIENCED SEVERAL FLAWS IN THIS VEHICLE (PURCHASED USED IN OCTOBER 2010).  THE MOST IMPORTANT PROBLEM I AM EXPERIENCING WITH THIS VEHICLE IS THE \"STABILITY SERVICE ENGAGING\" AS I AM DRIVING AND AFTER I HAVE MADE A SHARP TURN.  THE VEHICLE LOCKS THE BRAKES AND STEERING WHEEL.  I HAVE HAD THIS HAPPEN TO ME THREE SEPARATE TIMES WHILE I WAS IN TRAFFIC AND BY THE GRACE OF GOD, NO ONE WAS BEHIND ME SO AN ACCIDENT DID NOT OCCUR.  I HAVE READ SEVERAL BLOGS ON EDMUND.COM (13 PAGES)AND ALSO ON THIS WEBSITES COMPLAINTS ABOUT THE SAME PROBLEM. I DO NOT FEEL SAFE DRIVING MY SRX AND AFTER PAYING A NICE AMOUNT FOR THIS SUV, I FIND THIS TO BE IRRESPONSIBLE OF CADILLAC AND I DO SEE SOME FAULT ON THE NHTSA PART FOR NOT RECALLING OR DEMANDING CADILLAC TO RECALL THESE VEHICLES FOR THIS PROBLEM.  AS OTHERS HAVE STATED THE DEALERSHIPS DO NOT SEEM TO KNOW THE PROBLEM, WHICH I ALSO THINK IS RIDICULOUS, BECAUSE THIS IS WHAT THEY ARE SUPPOSE TO BE CERTIFIED TO DO.  I HAVE ALSO SEEN WHERE SOME HAVE HAD THE \"STEERING WHEEL SENSOR\" REPLACE AND THIS HAS SEEMED TO FIX THE PROBLEM.  IF THAT IS THE CASE THEN CADILLAC SHOULD HAVE A RECALL TO REPLACE THE \"STEERING WHEEL SENSOR\" SEEING THAT ITS HAPPENING TO QUITE A FEW PEOPLE.  I WILL NEVER PURCHASE ANOTHER CADILLAC AND WILL ADVISE OTHERS THE SAME, IF THIS ISN'T TAKEN CARE OF ASAP, MY NEXT STEP WILL BE A CLASS ACTION SUIT!!  I, AS WELL AS OTHERS, WORK HARD FOR OUR INCOME AND WHEN PURCHASING AND TRUSTING IN A PRODUCT WE EXPECT TO RECEIVE A QUALITY PRODUCT AND IF FOR SOME REASON THERE IS A PROBLEM, I PERSONALLY EXPECT THE MANUFACTURER TO TAKE CARE OF IT, JUST LIKE I TAKE CARE OF MY CAR PAYMENT EACH MONTH!  *TR",
        "vin": "1GYEE63A750"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/22/2010",
        "dateOfIncident": "03/12/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10372050,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 CADILLAC SRX. WHILE THE CONTACT WAS DRIVING AT VARIOUS SPEEDS THE ENGINE BEGAN TO BUCK AND HESITATE WITHOUT WARNING. THE ENGINE LEAKED A SUBSTANTIAL AMOUNT OF OIL. THE VEHICLE WAS NOT EQUIPPED WITH A LOW OIL WARNING INDICATOR TO ALERT OF THE ENGINE'S LOW CONSUMPTION OF OIL. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHERE THEY INFORMED THAT THE PROBLEM WAS CONTRIBUTED TO A MANUFACTURER'S DESIGN FLAW WITHIN THE ENGINE. THE FAILURE MILEAGE WAS APPROXIMATELY 25,000.",
        "vin": "1GYEE637250"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/08/2010",
        "dateOfIncident": "12/05/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10369704,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2005 CADDY SRX THAT THE STABILITY AND ABS ALARMS, LIGHTS COME ON.  THE ALARM PANEL RESETS BUT THE LIGHTS STAY ON AND NEITHER SYSTEM WORKS. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/01/2010",
        "dateOfIncident": "11/01/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10368561,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 CADILLAC SRX. THE CONTACT STATED THAT THE VEHICLE WAS CONSUMING AN EXCESSIVE AMOUNT OF OIL WHICH COULD CAUSE THE ENGINE TO LOCK WHILE DRIVING. THE DEALER WAS AWARE OF THE FAILURE, BUT OFFERED NO ASSISTANCE. THE MANUFACTURER WAS NOTIFIED, BUT ALSO OFFERED NO ASSISTANCE. THE VEHICLE WAS NOT REPAIRED. THE CURRENT MILEAGE WAS APPROXIMATELY 70,100. THE FAILURE MILEAGE WAS APPROXIMATELY 63,000.  UPDATED 02/08/11*LJ  UPDATED 04/21/11",
        "vin": "1GYEE637850"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/18/2010",
        "dateOfIncident": "02/01/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10367454,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR MORE THAN 2.5 YEARS MY SRX (PURCHASED NEW IN 2005) HAS EXPERIENCED RE-OCCURRING/INTERMITTENT TURN SIGNAL FAILURE OF BOTH THE LEFT AND RIGHT TURN SIGNALS.  AFTER THE TURN SIGNAL FAILS, IT WILL SOMETIMES WORK AGAIN AFTER A SECOND OR THIRD ATTEMPT.  MOST OFTEN, HOWEVER, I MUST RESORT TO SWITCHING ON MY HAZARD LIGHTS TO ACTIVATE THE TURN SIGNAL.  THE VEHICLE HAS UNDERGONE TEN UNSUCCESSFUL REPAIR ATTEMPTS SINCE FEBRUARY OF 2008 THROUGH THE DEALER'S SERVICE DEPARTMENT.  THE DEALERSHIP'S SERVICE DIRECTOR AND MECHANICS APPEAR TO BE AT A LOSS ON HOW TO RECTIFY THIS ONGOING SAFETY ISSUE.  THANK YOU FOR YOUR TIME.",
        "vin": "1GYEE637250"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/25/2010",
        "dateOfIncident": "06/14/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10362290,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "ONE DAY AFTER AROUND 2 WEEKS OF BUYING MY CAR, I STARTED TO HEAR STRANGE NOISES INSIDE THE REAR CAR DOOR PANELS EVERYTIME I LOWER OR RAISE THE WINDOWS. ONE DAY I  WAS AT WORK ABOUT TO GO TO LUNCH, SO I GOT IN MY CAR' TURNED IT ON THEN STARTED TO DRIVE AWAY AT THE SAME TIME LOWERING MY WINDOWS TO AIR OUT THE HOT AIR BUILD UP, THEN AFTER A MINUTE OR SO AS I WAS DRIVING I STARTED TO ROLL UP THE WINDOWS' SUDDENLY I HEARD A LOUD NOISE  AND SEEN THAT MY REAR DRIVER SIDE WINDOW NOT THERE....  I WENT TO A SERVICES STATION WHERE HAD ONE OF THE WORKERS CHECK IT OUT AND ADVISED ME THAT THE WINDOW HAD JUST FALLEN INTO THE DOOR... I HAD THEM TEMPORARILY CLOSED THE WINDOW AND LOCK IT IN PLACE UNTIL I COULD GET IT REPAIRED.... A FEW WEEKS AFTER THAT' MY  REAR PASSENGER WINDOW DID THE EXACT SAME THING...  AFTER IT WAS GETTING ROLLED UP DRIVING DOWN THE HIGHWAY, I HAD TO PULL OVER ON THE EMERGENCY LANE TO PULL THE WINDOW UP AND LOCK IT IN-PLACE THE SAME WAY I HAD THE OTHER ONE DONE.. I HAD IT CHECK OUT AND AN ESTIMATE WAS GIVEN BUT I WAS ADVISED THAT THIS WAS CAUSED BY AN MANUFACTURE DEFECT. *TR",
        "vin": "1GYEE63A650"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/12/2010",
        "dateOfIncident": "07/01/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10342785,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I GOT A OIL CHANGE ON SUNDAY AND MONDAY  MY CAR BROKE DOWN. THE DEALER SAID MY ENGINE DIDN'T HAVE ANY OIL IN IT. AFTER READING OTHER REPORTS THIS HAS HAPPEN TO OTHERS. THE OIL DIDN'T LEAK ON THE GROUND OR THEIR WAS NO SIGN OF THE OIL LEAKING.  *TR",
        "vin": "1GYEE637550"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/11/2010",
        "dateOfIncident": "06/06/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10335816,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TIMING CHAINS STRETCHED OUT WITH VERY LOW MILES.  FRONT ENGINE NOISE TO TOTAL IDLE ISSUES AND ACCELERATION ISSUES. REPAIRED AT CADILLAC DEALER FOR $$$$$ REPLACED BOTH CHAINS. *TR",
        "vin": "1GYEE637950"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/30/2010",
        "dateOfIncident": "05/27/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10333887,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BACK UP LIGHTS DO NOT COME ON.   APPARENTLY, THERE IS A MANUFACTURERS' DEFECT IN THE DESIGN.  WE ARE ON OUR THIRD FAILURE.   A WIRE THAT IS INTEGRATED INTO THE TAILGATE BECOMES WARN .   *TR",
        "vin": ""
    },
    {
        "components": "TRACTION CONTROL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/29/2010",
        "dateOfIncident": "05/28/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10333833,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2005 CAD SRX STABILITY SYSTEM LIGHT IS COMING ON RECURRING.  MECHANICS CAN'T FIGURE OUT THE PROBLEM AND JUST KEEP RESETTING THE SENSORS.  THE CAR LURCHES AND BRAKES ITSELF ON THE HIGHWAY AND I'M AFRAID OF AN ACCIDENT. *TR",
        "vin": "1GYEE637950"
    },
    {
        "components": "VEHICLE SPEED CONTROL,TRACTION CONTROL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/20/2010",
        "dateOfIncident": "05/12/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10331401,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "CADILLAC SRX STABILITY SYSTEM/TRAFFIC CONTROL ENGAGES UNPREDICTABLY AND APPEARS TO ENGAGE ANTI-LOCK BRAKES CAUSING THE SUV TO SEIZE UP AND FIGHT AGAINST THE ACCELERATOR. THIS HAS OCCURRED 1/2 DOZEN TIMES IN VERY DANGEROUS TRAFFIC AREAS AND DEALERSHIP DOES NOT KNOW HOW TO FIX IT (AND ARE CHARGING ME FOR THEIR TROUBLESHOOTING LABOR). *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/05/2010",
        "dateOfIncident": "04/25/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10328987,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 CADILLAC SRX. WHILE DRIVING AT 35 MPH, THE CONTACT NOTICED A GRINDING SOUND AND OIL LEAKING FROM THE REAR OF THE VEHICLE. THE VEHICLE WAS TAKEN TO A LOCAL MECHANIC WHO REPLACED THE REAR AXLE AND PINION SEAL. THE CONTACT CALLED AN AUTHORIZED DEALERSHIP WHERE HE WAS INFORMED THAT RECALL 07V589000 (POWER TRAIN: AXLE ASSEMBLY: AXLE SHAFT: SEAL) DID NOT INCLUDE HIS VEHICLE. THE CURRENT AND FAILURE MILEAGES WERE APPROXIMATELY 62,000.  UPDATED 09/22/10. *LJ  UPDATED 09/23/10",
        "vin": "1GYEE637550"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/14/2009",
        "dateOfIncident": "07/12/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10295609,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "LIGHT BULBS FOR TURN SIGNALS,TAIL LIGHTS ,STOP LIGHTS SLIP OUT OF SOCKETS. DESIGN OF SOCKETS HAS BEEN IMPROVED TO SECURE BULBS BUT GM HAS NOT ADVISED OWNERS TO REPLACE THE SOCKETS. THIS RESULTS IN NUMEROUS VEHICLES BEING OPERATED WITH ESSENTIAL LIGHTS OUT OF SERVICE. *TR",
        "vin": "1GYEE637050"
    },
    {
        "components": "STEERING,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/08/2009",
        "dateOfIncident": "06/01/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10273077,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 CADILLAC SRX.  THE CONTACT STATED THAT THE ELECTRONIC STABILITY CONTROL SYSTEM SPORADICALLY ENGAGES WITHOUT WARNING.  THE FAILURE CAUSES THE FRONT WHEELS TO LOCK.  HE IS IN THE PROCESS OF HAVING THE VEHICLE INSPECTED TO DETERMINE THE CAUSE OF THE FAILURE.  THE CONTACT FILED A COMPLAINT WITH THE MANUFACTURER.  THE FAILURE AND CURRENT MILEAGES WERE 46,000.    UPDATED 7/1/09 *CN   THE DEALER REPLACED A FAULTY WHEEL POSITION SENSOR. UPDATED 07/07/09.*JB",
        "vin": "1GYEE637550"
    },
    {
        "components": "STEERING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/13/2009",
        "dateOfIncident": "04/13/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10265076,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 CADILLAC SRX.  THE CONTACT STATED THAT SHE EXPERIENCES DIFFICULTY WHEN TURNING THE STEERING COLUMN.  IN ADDITION, SHE HEARS A SCREECHING NOISE.  SHE TOOK THE VEHICLE TO THE DEALER ON NUMEROUS OCCASIONS, BUT THEY COULD NOT PROVIDE A REMEDY FOR THE FAILURE.  ON ONE OCCASION, WHILE DRIVING APPROXIMATELY 25 MPH, THE CONTACT EXPERIENCED SPONTANEOUS ACCELERATION UNTIL SHE REACHED 60 MPH.  THE CONTACT STATED THAT THE FRONT DRIVER'S SIDE TIE ROD FRACTURED.  SHE IS IN THE PROCESS OF HAVING THE VEHICLE REPAIRED AT HER EXPENSE BECAUSE THE VEHICLE EXCEEDS ITS WARRANTY.  THE FAILURE MILEAGE WAS 9,000 AND CURRENT MILEAGE WAS 41,000.",
        "vin": "1GYEE637650"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/18/2009",
        "dateOfIncident": "02/06/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10262222,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 CADILLAC SRX.  WHILE DRIVING 20 MPH, THE VEHICLE BEGAN TO HESITATE WITH A STOP AND GO MOTION.  THE CHECK ENGINE INDICATOR ILLUMINATED ON THE INSTRUMENT PANEL.  THE CONTACT DID NOT NOTICE ANY WARNINGS PRIOR TO THE FAILURES.  THE VEHICLE WAS TAKEN TO THE DEALER FOR INSPECTION AND THEY STATED THAT THE TIMING CHAIN, TWO VALVES, AND A CAM ACTUATOR FAILED.  THE VEHICLE WAS REPAIRED, BUT THE FAILURES CONTINUED.  THE VEHICLE IS CURRENTLY AT THE DEALER BEING INSPECTED BY A CADILLAC ENGINEER.  MULTIPLE PARTS HAVE BEEN REPLACED, BUT THE FAILURES ARE STILL OCCURRING.  THE CONTACT CALLED THE MANUFACTURER AND WAS ADVISED TO TAKE THE VEHICLE TO THE DEALER FOR INSPECTION.  THE FAILURE AND CURRENT MILEAGES WERE 56,000.",
        "vin": "1GYEE637950"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/09/2009",
        "dateOfIncident": "07/09/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10261298,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 CADILLAC SRX.  WHILE DRIVING BETWEEN 25-50 MPH ON NORMAL ROAD CONDITIONS, THE ENGINE BEGAN TO REV EXCESSIVELY HIGH.  THE VEHICLE ACCELERATED UNEXPECTEDLY AND THE CONTACT DEPRESSED THE BRAKE PEDAL WITH GREATER FORCE IN ORDER TO STOP THE VEHICLE.  IN ADDITION, THE STOPPING DISTANCE WAS INCREASED.  THE FAILURE OCCURRED WITHOUT WARNING AND INTERMITTENTLY.  THE VEHICLE WAS TAKEN TO AUTHORIZED DEALERS FOR DIAGNOSTIC TESTING ON SIX OCCASIONS.  THE FAILURE COULD NOT BE DUPLICATED; HOWEVER, REPAIRS WERE PERFORMED UNDER THE EXTENDED WARRANTY.  THE TECHNICIAN STATED THAT THERE WERE ACCELERATION ISSUES.  THE FAILURES OCCURRED APPROXIMATELY 40-50 TIMES.  THE VEHICLE HAS NOT BEEN REPAIRED AT THIS TIME.  THE FAILURE MILEAGE WAS 45,000 AND CURRENT MILEAGE WAS 75,000.    UPDATED 05/15/09  *BF  UPDATED 05/18/09.*JB",
        "vin": "1GYEE637550"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/03/2009",
        "dateOfIncident": "11/27/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10260625,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "RIGHT FRONT PARKING LIGHT AND TURN SIGNAL LIGHT REPEATEDLY BURNS OUT, ABOUT EVERY TWO TO THREE MONTHS. *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/04/2009",
        "dateOfIncident": "12/31/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10253749,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "STOPPED AT GAS STATION SHUT CAR OFF SAT IN CAR FOR A FEW MINUTES TALKING ON CELL WHEN SUDDENLY A LOUD EXPLOSION  I LOOKED AROUND TO SEE WHAT HAPPENED I GOT OUT TO GAS CAR UP STILL WONDERING WHAT THE EXPLOSION WAS AS I OPENED DOOR I HEARD A CRINKLE SOUND FROM ROOF AREA I NOTICED ROOF SINKING INTO CAR GLASS ROOF WAS THE EXPLODING SOUND I HEARD I WAS PARKED UNDER A GAS STATION CANOPY GOT MANAGER FROM STATION TO SHOW WHAT HAPPENED NOTHING FELL FROM CANOPY THIS GLASS BLEW FROM SOME DEFECT ON ITSELF CADILLAC NEEDS TO BE AWARE THERE IS A DEFECT PROBLEM HERE. *TR",
        "vin": "1GYEE637450"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/27/2008",
        "dateOfIncident": "11/01/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10252906,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED AS CERTIFIED PRE-OWNED FROM CADILLAC DEALERSHIP. THE CAR AVERAGES 11 MPG PER NORTHSTAR CONSOLE MONITORING. *TR",
        "vin": "1GYEE63A050"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/16/2008",
        "dateOfIncident": "09/01/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10252010,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR 2005 CADILLAC SRX SUFFERED A TIMING BELT DEFECT AT 62,000 MILES - JUST OUTSIDE THE FACTORY WARRANTY. I WAS TOLD BY A TECHNICIAN AND ASSISTANT SVC. MANAGER THAT THEY HAVE HAD 4-8 OF THESE \"DEFECTS\" IN THE PAST YEAR AND A BULLETIN HAS BEEN RELEASED BY GM WITH INSTRUCTIONS ON HOW TO FIX IT. THEY KEPT OUR CAR FOR OVER 30 DAYS TRYING TO FIX IT, AND IT TURNS OUT THAT IT REQUIRES A \"REDESIGNED\" TIMING CHAIN THAT IS NOTHING LIKE THE CURRENT CHAIN THAT IS BREAKING. HOWEVER, THEY REFUSE TO ACKNOWLEDGE THAT IT IS A DEFECT AND SHOULD BE SUBJECT TO RECALL, AND THEY ARE CHARGING THE CAR'S OWNERS FULL PRICE TO FIX WHAT SHOULD BE REPLACED FREE OF CHARGE. IT IS A SERIOUS SAFETY HAZARD AND THEY ONLY HALF-HEARTEDLY ACKNOWLEDGE THAT IT'S EVEN AN ISSUE - YET THEY READILY ADMIT THAT THE NEW DESIGN \"FIXES\" PROBLEMS THAT THEY SAY DON'T EXIST. *TR",
        "vin": "1GYEE637150"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "11/20/2008",
        "dateOfIncident": "11/20/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10249426,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FALKEN TIRE CORPORATION",
                "productMake": "FALKEN",
                "productModel": "FALKEN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TIRES OUT OF BALANCE HAD THEM BALANCED 5 TIMES WITHOUT RESULTS  FOUND OUT THAT   3 OF THE 4 TIRES WERE OUT OF ROUND.   THE TIRES HAVE ONLY 5,000 MILES ON THEM.  THE DEALER SAID THAT THE WARRANTY ONLY COVERS THE TIRE DURING THE FIRST 1/32 OF WARE.    I TOOK THE VEHICLE IN . THE SO CALLED BALANCED THE TIRES AND AFTER 5 TIMES THEY FOUND THE TIRES OUT OF ROUND.  I BELIEVE THAT THE TIRE MFG. SHOULD REPLACE THE TIRES. *TR",
        "vin": "1GYEE637X50"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/16/2008",
        "dateOfIncident": "09/20/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10248941,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM THE OWNER OF A CADILLAC SRX 2005. THIS HAD APPROX 59,000 MILES AT TIME OF ENGINE FAILURE. PRIOR TO THE FAILURE ON TWO OCCASIONS THE ENGINE WARNING LIGHT CAME ON AT WHICH TIME I TOOK IT TO THE DEALERSHIP. THEY RAN DIAGNOSTIC AND NOTHING WRONG. ON SEPT. '08 THE ENGINE FAILED WHILE DRIVING AND IT WAS TOWED TO THE DEALERSHIP AND THEY DETERMINED THAT THE TIMING BELT FAILED.        THIS IS A 3 YEAR OLD VEHICLE WITH LESS THAN 60K MILES AND THE TIMING BELT FAILS. THIS TO ME IS VERY RARE AND I BELIEVE IT TO BE A FACTORY DEFECT. I HAVE HAD MANY VEHICLES WITH ALOT MORE MILES AND NOT ONE OF THEM HAD A TIMING BELT FAILURE. *TR",
        "vin": "1GYEE637450"
    },
    {
        "components": "SUSPENSION,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/10/2008",
        "dateOfIncident": "08/20/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10241765,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE A  NOISE  AROUND THE WHEEL AREA  AND THE ENGINE AREA OF THE VEHICLE  WE HAVE HAD IT CHECKED OUT BUT THE DEALSHIP TELLS US ITS SOMETHING THAT COMES WITH THE VEHICLE .. TO ME IT  SOUNDS LIKE LIFTERS.. THE  SOUND STARTED AROUND A MONTH AFTER WE BROUGHT IT .. IT SEEMS TO BE GETTING LOUDER... *TR",
        "vin": "1GYEE637150"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/24/2008",
        "dateOfIncident": "07/22/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10235690,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 CADILLAC SRX  ULTRA VIEW GLASS ROOF EXPLODED WHILE DRIVING 55 ON HIGHWAY ROUTE 9 SOUTH IN CT. I WAS ONLY CAR ON ROAD AT THE TIME, NO OTHER VEHICLE'S IN AREA, NO BRIDGES, AND NOTHING IN ROAD. WEATHER WAS 75-80 DEGREES AND OVERCAST. I AM CERTAIN NOTHING CAME INTO CONTACT WITH THE ROOF. IT WAS CLOSED, AS WAS ALL THE WINDOWS, WHEN IT JUST BURST AND EXPLODED AND GLASS SHOWERED DOWN ALL INTO THE CABIN AND ON ME.  *TR",
        "vin": "1GYEE637150"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "09/13/2007",
        "dateOfIncident": "05/19/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10202866,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE HAD MULTIPLE TRIPS TO THE DEALER FOR SUNROOF ISSUES.  ISSUES HAVE BEEN EITHER THE SUNROOF STOPS WORKING ALL TOGETHER, AND WHEN OPENED IT WILL NOT CLOSE.  THE SUNROOF TRIES TO CLOSE, BUT THEN RE-OPENS.  THIS ISSUE HAS BEEN ONGOING SINCE I PURCHASED THE VEHICLE IN 2005.  *TR",
        "vin": "1GYEE637650"
    },
    {
        "components": "SUSPENSION",
        "crash": true,
        "dateComplaintFiled": "08/16/2007",
        "dateOfIncident": "08/10/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10199834,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "LOST CONTROL OF VEHICLE AND WENT OFF THE ROAD. I BELIEVE THE CAUSE COULD BE THE RECALL#06V12500. DEALERSHIP IS CHECKING THE  WELD.  *JB",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/30/2006",
        "dateOfIncident": "05/16/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10172182,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE DRIVING 5 MPH AND MAKING A LANE CHANGE.  THERE WAS NO WARNING SIGNAL PRIOR TO THE INCIDENT.  THE VEHICLE WAS TAKEN TO A SERVICE DEALER WHO COULD NOT INITIALLY DUPLICATE THE PROBLEM.   LATER ON  AFTER FURTHER INSPECTION. *AK  THE VEHICLE STALLED AFTER TURNING THE STEERING QUICKLY. THE SENSOR IN THE STEERING WHEEL WAS REPLACED AND THERE HAVE BEEN NO FURTHER PROBLEMS WITH THE VEHICLE STALLING. UPDATED 11/30/06. *JB",
        "vin": "1GYEE637250"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "10/10/2006",
        "dateOfIncident": "11/25/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10170374,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THE CONTOUR OF THE SEATS WERE UNCOMFORTABLE WHICH CREATED A PROBLEM FOR THE CONTACT MEDICALLY; A PINCH NERVE. TO DRIVE THE VEHICLE THE CONTACT HAD TO SEAT VERY CLOSE TO THE STEERING WHEEL. THE DEALER AND MANUFACTURER WERE CONTACTED WHO CONFIRMED THAT THERE HAD BEEN MANY COMPLAINTS BUT THERE WAS NO RECALL. THE DEALER DETERMINED THE MECHANICISM AT THE BOTTOM OF THE SEAT CAUSED THE PROBLEM. A MECHANIC WITH THE DEALERSHIP MENTIONED THAT THE PROBLEM MAY BE WITH THE LUMBAR SUPPORT.",
        "vin": "1GYEE637050"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/25/2006",
        "dateOfIncident": "08/11/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10166501,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "RIGHT REAR WELD BROKE DUE TO INCORRECT WELD MAKING MY TIRE INVERTED AND UN-DRIVABLE.  I WAS NOT NOTIFIED OF THIS RECALL - WAS INFORMED MY VIN WAS NOT INCLUDED IN THIS RECALL SO OTHERS NEED TO BE AWARE.  I WOULD LIKE TO KNOW IF MY VIN NUMBER WAS IN FACT NOT PART OF THIS RECALL.  *JB",
        "vin": "1GYEE637650"
    },
    {
        "components": "SUSPENSION,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/15/2006",
        "dateOfIncident": "09/17/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10165556,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL GAUGE HAS GONE OUT FOUR TIMES; PROBLEMS WITH THE SUSPENSION.  *NM",
        "vin": "1GYEE637250"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/13/2006",
        "dateOfIncident": "08/12/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10165378,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "RIGHT REAR STABILIZER BAR BROKE - VEHICLE HAS 23,000 MILES.  *JB",
        "vin": "1GYEE637650"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/15/2006",
        "dateOfIncident": "04/14/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10155415,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING A RIGHT FRONTAL/SIDE IMPACT MOTOR VEHICLE ACCIDENT INVOLVING A 2005 CADILLAC SRX V6, NONE OF THE 8 AIRBAGS DEPLOYED.  THE OCCUPANT SUFFERED AN INJURY TO THE RIGHT SIDE OF THE HEAD WHEN THE MOTION CAUSED HER TO STRIKE THE LEFT (DRIVER'S SIDE) WINDOW.  THE DRIVER WAS WEARING HER SEAT BELT.  *NM",
        "vin": "1GYEE637650"
    },
    {
        "components": "SUSPENSION,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/06/2006",
        "dateOfIncident": "03/28/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10149551,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE TRAVELING DOWN A THREE LANE HIGHWAY IN OUR 2005 CADILLAC SRX WHICH WEIGH APPROX 4,302 LBS. WHEN WE WERE STRUCK ON THE DRIVERS SIDE BY A 2002 HONDA ACCORD, WHICH WEIGH APPROX 3,300 LBS.  THIS VEHICLE IMMEDIATELY STARTED FLIPPING IT FLIPPED OVER 6 TIMES BEFORE IT STOPPED.  THE DRIVERS SEAT BROKE AND FLIPPED OVER TO THE BACK OF THE CAR, NO AIR BAGS CAME OUT EXCEPT FOR THE LEFT CURTAIN.  THE TOP AND SUNROOF WAS CRASHED IN AND WE HAD TO BE CUT OUT OF THE CAR.  BOTH PASSENGERS HAD ON SEAT BELTS AND THE DRIVER SUFFERED BODILY AND HEAD DAMAGE. QUESTIONS WERE ASKED TO GENERAL MOTORS (1) HOW DID A SMALL HONDA HIT THIS SUV WEIGHING 1,000 LBS MORE GET PUCHED TO THE CURB ACROSS TWO LANES AND FLIP 6 TIMES.  THE ONLY WAY IT STOPPED FLIPPING IT HIT A POLE. (2) THIS VEHICLE HAS A (NEW) MAGNETIC RIDE CONTROL, THE FASTEST REACTING SUSPENSION SYSTEM IN THE WORLD.  CADILLAC SRX IS THE FIRST AND ONLY ONE TO OFFER THE MRC. IT IS OUR EXPECTATIONS, WITH ITS FASTEST REACTING SUSPENSION ON EACH WHEEL REACTING INDEPENDENDENTLY COULD NOT RESPOND PROPER ONCE IMPACTED.  (3).  THE SUSPENSION SYSTEM, I STRONGLY FEEL IMPACTED THE SUV TO FLIP SO MANY TIMES.  THIS VEHICLE DAMPERS NEEDED TO BE CHECKED ON EACH WHEEL.  EVEN G.M. STATED THAT \"ENERGIZED MAGNETIC FIELD WITHIN THE FLUID ALIGNS PARTICLES, CREATING RESISTANCE TO MOVEMENT AND INCREASED DAMPING.  WHEN, UNCHARGED, THE PARTICLES FLOAT FREELY, CREATING LESS RESISTANCE.\"  (4).  THE VEHICLE STABILITY ENHANCEMENT SYSTEM, WHICH SUPPOSE TO RESPOND BY ENGAGING THE BRAKE SYSTEM AND DRIVE TRAIN.  IT ALSO SUPPOSE TO MONITOR THE WHEEL SPEED AND STEERING WHEEL ANGLE.  THIS SYSTEM SHOULD BE INVESTIGATED.  (5).  THE NEW GYRO-CHIP SENSOR, DID THIS VEHICLE HAVE THIS?  THE GYRO-CHIP SENSOR, IS TO HELP KEEP ALL FOUR WHEELS FIRMLY PLANTED TO THE ROAD.  WE SUGGESTED THAT G.M. CALL BACK THESE VEHICLES AND GO OUT AND INVESTIGATE OUR VEHICLE.  TO THIS DATE NO ONE FROM GENERAL MOTORS HAVE CONTACTED ME. *JB",
        "vin": "1GYEE637950"
    },
    {
        "components": "TIRES,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "11/21/2005",
        "dateOfIncident": "09/02/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10143331,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE CONTACT STATED THE STANDARD EQUIPMENT, AUTOMATIC WINDSHIELD WASHER/WIPER, AND THE TIRE PRESSURE MONITORING SYSTEM WERE NOT INCLUDED ON THIS VEHICLE.  THIS WAS STANDARD EQUIPMENT FOR THIS TYPE OF VEHICLE.  THE CONTACT  DID NOT NOTICE THE EQUIPMENT WAS NOT INCLUDED ON THE VEHICLE UPON PURCHASING IT. .  THE DEALER CONFIRMED THAT STANDARD EQUIPMENT WAS NOT INCLUDED ON THE VEHICLE.  THE EQUIPMENT COULD NOT BE ADDED TO THE VEHICLE AFTER LEAVING THE MANUFACTURER.  *AK  UPDATED 11/7/2005.  THE CONSUMER REQUESTED A REFUND FROM THE DEALER/MANUFACTURER BECAUSE THE STANDARD TIRE PRESSURE MONITOR AND AUTOMATIC WINDSHIELD WIPERS WERE NOT INSTALLED IN HIS VEHICLE.   THE CONSUMER PAID EXTRA FOR THE LUXURY PACKAGE BUT NON OF THE OPTIONS WERE INSTALLED.  THE DEALER SAID THERE WAS NOTHING THEY COULD DO BECAUSE THEY HAD TO BE INSTALLED AT THE FACTORY.   *NM",
        "vin": "1GYEE637650"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES,CHILD SEAT",
        "crash": false,
        "dateComplaintFiled": "09/19/2005",
        "dateOfIncident": "09/19/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10136975,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Combi USA, Inc.",
                "productMake": "COMBI",
                "productModel": "8100 (AVATAR)",
                "productYear": "9999",
                "type": "Child Seat"
            }
        ],
        "summary": "LATCH SYSTEM ON 2005 CADILLAC SRX CANNOT BE USED WITH CAR SEATS....THE LATCHES ARE TOO HIGH UP TO ALLOW FOR PROPER INSTALLATION AND TOO FAR AWAY. BABY CAR SEAT CAN ONLY BE PLACED IN THE MIDDLE OF THE CAR BUT YOU MUST ATTEMPT TO FIND (NEITHER LOCAL DEALER NOR CADILLAC USA HAD ANY IDEA ABOUT HOW TO DO THIS, BY THE WAY) A SPECIAL \"OPTION\" ACCESSORY, A NYLON \"X\" STRAP TO STRAP IN AND HOLD IN PLACE THE REAR SEAT CENTER CONSOLE THAT, AS ITS OWN MANUAL POINTS OUT, MUST BE USED IF YOU PLACE THE CAR SEAT IN THE MIDDLE AND YOU CAN'T USE THE LATCH BC OF THE SIDE IMPACT AIR BAG IN THE REAR THAT CANNOT BE TURNED OFF. NOTE, THE ACCESSORY CAN BE PURCHASED THROUGH THE DEALERSHIP, EVEN THOUGH CREST CADILLAC IN SYRACUSE NY SAID OTHERWISE. *JB",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "08/22/2005",
        "dateOfIncident": "08/17/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 6,
        "odiNumber": 10133823,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE CONTACT OWNS A 2005 CADILLAC SRX. THE CONTACT STATED WHILE DRIVING AT 60-65 MPH THE SUN ROOF COLLAPSED, CAUSING SIX PEOPLE TO BE INJURED IN THE VEHICLE. LUCKILY THIS DID NOT CAUSE AN ACCIDENT. THE MANUFACTURER WAS INVESTIGATING THIS TO SEE IF IT WAS A MANUFACTURING DEFECT. *AK  IE05-052.PCO PE05-052.PCO",
        "vin": "1GYEE637350"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "08/18/2005",
        "dateOfIncident": "08/13/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 10133342,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 CADILLAC SRX ULTRAVIEW SUNROOF EXPLODED AND SHOWERED GLASS THROUGHOUT THE VEHICLE WHILE TRAVELING AT 55 MPH ON AN INTERSTATE HIGHWAY.   *NM  IE05-052.PCO PE05-052.PCO",
        "vin": "1GYEE637250"
    },
    {
        "components": "STEERING,POWER TRAIN,ELECTRICAL SYSTEM,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "08/11/2005",
        "dateOfIncident": "04/01/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10132536,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:THE CONTACT OWNS A 2005 CADILLAC SRX. HLS HIS WIFE PARKED THE VEHICLE  AND THE STEERING WHEEL LOCKED.  SHE COULD NOT GET IT UNLOCKED. VEHICLE WAS TOWED TO THE CADILLAC DEALERSHIP, AND  THEY HAD TO UNHOOK THE LINKAGE ON THE TRANSMISSION IN ORDER TO BE ABLE TO TOW THE VEHICLE. THE DEALERSHIP ORDERED A NEW KEY ASSEMBLY, AND THEY HAD TO REMOVE TUMBLER NUMBER 3. IN ORDER TO GET THE LOCK TO OPEN THEY HAD TO DRILL  THE LOCK CYLINDER AND  REMOVE THE CYLINDER. DEALERSHIP RETURNED  THE  VEHICLE TO THE CONTACT,  CLAIMING  IT WAS FIXED . HOWEVER,  WHILE DRIVING THE STEERING WOULD LOCKED AGAIN AND  SHE HAD A HARD TIME GETTING IT UNLOCKED.  CURRENTLY, UPON  TURNING THE STEERING WHEEL BACK AND FORTH ONE CAN HEAR A GRINDING NOISE. THE VEHICLE WAS TAKEN  BACK TO THE DEALERSHIP.  THE CONTACT  ASKED THE DEALERSHIP IF THEY HAD TO TAKE THE STEERING WHEEL OFF TO CORRECT THE PROBLEM WITH THE DOOR OPEN INDICATOR, AND THE DEALERSHIP SAID THAT THEY DIDN'T. BUT WHEN THE CONTACT TOLD THEM HE SPOKE WITH ANOTHER MECHANIC THEY SAID THAT THEY DID HAVE TO TAKE THE KEY ASSEMBLY APART WHICH WAS ON THE STEERING COLUMN TO FIX IT . THE DEALERSHIP CHANGED THEIR CLAIM.  ALSO, THE AIR CONDITIONING IN THE BACK DID NOT WORK . IT WAS TAKEN TO THE DEALERSHIP AND THEY FINALLY CORRECTED THE PROBLEM. AFTER SIX TIMES OF TAKING THE VEHICLE. TO DEALERSHIP THEY FOUND THAT SOME PARTS  IN THE BACK WERE UNHOOKED AND THIS WAS STRAIGHT FROM THE FACTORY. *AK",
        "vin": "1GYEE63A250"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "06/30/2005",
        "dateOfIncident": "06/17/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10127199,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "LARGE SUNROOF ON MY 2005 CADILLAC SRX INEXPLICITLY SHATTERED AND CAVED INTO VEHICLE WHILE TRAVELLING IN LIGHT TRAFFIC.  THERE IS NO EVIDENCE OF FOREIGN OBJECT CAUSING THIS, NOR WAS THERE THE SOUND OF IMPACT YOU WOULD EXPECT NECESSARY TO TAKE OUT A LARGE PIECE OF GLASS LIKE THIS.  CAN'T GET GM TO CONSIDER THAT THIS MAY BE AN EQUIPMENT FAILURE.  FORTUNATELY, THE SUNSHADE WAS CLOSED OR GLASS WOULD HAVE FALLEN ON OCCUPANTS  GM ISN'T FORTHCOMING WITH INFORMATION ABOUT THIS UNIQUE ROOF OR EVEN WHO MANUFACTURES IT.  THIS IS A $3,500 REPAIR THAT GM WON'T COVER OR PROVIDE DETAILS OF OTHER POTENTIAL INCIDENTS. IE05-052.PCO PE05-052",
        "vin": "1GYEE637X50"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/25/2004",
        "dateOfIncident": "06/04/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10082599,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SRX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING WENT OUT THREE TIMES.  *AK",
        "vin": ""
    }
]