[
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE,TIRES",
        "crash": false,
        "dateComplaintFiled": "10/31/2007",
        "dateOfIncident": "10/01/2007",
        "fire": false,
        "manufacturer": "Exiss Aluminum Trailers, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10208267,
        "products": [
            {
                "manufacturer": "Exiss Aluminum Trailers, Inc.",
                "productMake": "EXISS",
                "productModel": "HORSE TRAILER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 EXISS TRAILER WITH PROBLEMS WITH THE ELECTRICAL SYSTEM, AND TIRES. CUSTOMER STATES THAT THE FAILURE WITH THE ELECTRICAL SYSTEM CAUSED PROBLEMS WITH THE BRAKES. SHE ALSO STATES THAT THE TIRES WOULD NOT HOLD PROPER AIR PRESSURE.  *KB  AFTER LEAVING THE DEALERSHIP, THE WARNING SIGNAL ILLUMINATED NOTING TRAILER DISENGAGE. THE TECHNICIAN COULD NOT FIND ANYTHING WRONG.  THE DOOR HANDLE WAS NOT WORKING PROPERLY, DUE TO THE WIRING NOT BEING ENERGIZED. THE CONSUMER EXPERIENCED A TIRE BLOWOUT, WHICH WAS CAUSED BY A RELEASE OF AIR PRESSURE DUE TO A DEFECTIVE METAL VALVE STEM.  THE FRONT ESCAPE WINDOW HAD A BROKEN BRACKET AND WAS NOT MOUNTED FLUSH. MOISTURE WAS DETECTED IN AND AROUND THE WINDOW AFTER HEAVY RAINS.  THE WINDOW WAS IMPROPERLY INSTALLED AND THEREFORE THE WINDOW FRAME HAD A MISALIGNMENT WITH THE TRAILER FRAME. SMOKE WAS EMITTING FROM THE TRAILER, WHICH WAS A RESULT OF THE TIRE ON THE INSIDE RUBBING THE WHEEL WELL. THE BRAKE WIRE WAS REPLACED WHICH WAS TOUCHING THE MAIN FRAME OF THE TRAILER ON THE DRIVERS REAR POST BEHIND THE STOP LIGHT. THE BRAKE WIRE FROM THE HARNESS TO THE JUNCTION FOR THE REAR AXLE WAS CAUSING SHORTS AND INTERMITTENT LIGHT AND BRAKE ISSUES.*JB",
        "vin": "4LAAH312755"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/23/2007",
        "dateOfIncident": "08/19/2007",
        "fire": false,
        "manufacturer": "Exiss Aluminum Trailers, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10200577,
        "products": [
            {
                "manufacturer": "Exiss Aluminum Trailers, Inc.",
                "productMake": "EXISS",
                "productModel": "HORSE TRAILER",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 UNIVERSAL EXISS (NA).  THE VEHICLE CAME EQUIPPED WITH HI-RUN TIRES, SIZE G235/85/R16 (NA).  THE CONTACT STATED THAT THE TWO FRONT TIRES BLEW OUT.  HE NOTICED THAT THE THIRD TIRE HAD SEVERE TREAD SEPARATION AND HE COULD SEE THE BELT AND A BULGE IN THE TIRE.  THE CONTACT HAS PICTURES OF THE TIRES THAT CAN BE FOUND AT   HTTP://RIDES.WEBSHOTS.COM/ALBUM/560403292KEOOJN.  THE TIRE FAILURE MILEAGE WAS 10,000.  NO OTHER VEHICLE INFORMATION WAS PROVIDED.",
        "vin": ""
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "04/12/2007",
        "dateOfIncident": "04/02/2007",
        "fire": false,
        "manufacturer": "Exiss Aluminum Trailers, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10188977,
        "products": [
            {
                "manufacturer": "Exiss Aluminum Trailers, Inc.",
                "productMake": "EXISS",
                "productModel": "HORSE TRAILER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 EXISS TRAILER THAT TRAILER DISENGAGE AND DOOR LIGHT NOT WORKING AND TWO TIRES THAT WERE LOOSING AIR PRESSURE**NAR**CC  THE DOOR HANDLE LIGHT DIDN'T WORK BECAUSE THE WIRING TO THE HANDLE WAS NOT ENGERGIZED. THE CONSUMER EXPERIENCED A TIRE BLOWOUT. THE FIRE ESCAPE WINDOW HAD A BROKEN BRACKET. MOISTURE WAS DETECTED IN AND AROUND THE WINDOW AFTER HEAVY RAINS. THE WINDOW WAS IMPROPERLY INSTALLED AND THEREFORE THE WINDOW FRAME WAS MISALIGNED WITH THE TRAILER FRAME. THE BRAKES ON THE TRAILER WERE SMOKING.  *JB",
        "vin": "1D4LAAH3125"
    }
]