[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/11/2022",
        "dateOfIncident": "01/11/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447083,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "Oil leaking from more than 4 parts of the engine and was told it’s normal for this model. Also, when driving over a bump or uneven pavement the trucks steering and suspension drives out of control.",
        "vin": "1ftww31p25e"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/21/2021",
        "dateOfIncident": "11/05/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444537,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "Once I get up to 55-60 mph it just shakes really bad, I have had ball joints replaced bought new tires and it still shakes",
        "vin": "1FTWW33P55E"
    },
    {
        "components": "SUSPENSION,POWER TRAIN,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "10/17/2021",
        "dateOfIncident": "01/20/2021",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437093,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "[XXX] who performs automotive work out of his residence [XXX] and [XXX] of [XXX] have worked on this vehicle to spite the customer and to gouge the customer in unnecessary fraudulent repairs. They have deliberately set this vehicle up to fail with the braking system, the 6.0 engine being rebuilt to no avail, and constant driving problems such as pulling to the right and the left when brakes applied, constant overheating, constant oil temperature overheating, shuttering at highway speed, transmission failure, air conditioning failure, coolant system failure, electrical system failure, and every system that they have repaired, continues to fail. They specifically performed work on the electrical wiring and truck keeps blowing fuses. They performed work on the transmission and the transmission failed shortly after. They performed work on the engine and deleted illegally all the emissions EGR pollutant controls. They installed faulty wiring for the electric trailer brake controls and the electronic speed controls. They tampered with the air conditioning system causing the compressor to blow out, send metal through the a/c lines, and the belt stopped turning causing the serpentine belt to break, tear the fan shroud apart and shred. They also installed a trailer brake controller that was aftermarket and it caused brake loss and intermittent failure with the service brake system and speed control. Domingo also tuned the computer to make the truck output 550 horsepower which caused the new engine to fail prematurely and the transmission to fail as well.  INFORMATION Redacted PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "1FTWW32P65E"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES,ENGINE",
        "crash": true,
        "dateComplaintFiled": "10/17/2021",
        "dateOfIncident": "12/13/2019",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11437097,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "[XXX], [XXX] approx age 40 lives and works at [XXX].[XXX] can also control the computers to cancel out and delete the use of catalytic converters, delete the use of DEF intake, delete the use of DPF particulate filters, and not react to controls such as manual braking or acceleration because the computer is controlling when and not the driver. [XXX] strictly states that he cannot have any emissions controls such as EGR, DEF, DPF, catalyst, or any pollutant controls. [XXX] intentionally set it up to have flaws and be dangerous for one reason: to get the customer to keep returning again and again with vehicle problems, wiring electrical problems, performance problems, overheating problems, and never ending engine problems not to mention transmission problems because the transmission could not handle the increased output of the engine. The hydroboost and ABS module and master cylinder that controls the brakes can be easily rigged so that when the driver stomps on the brakes, there is no braking action whatsoever for a 3-5 second delay before skidding the tires and locking the brakes. [XXX] altered the hydroboost and ABS module and master cylinder and the electronic controls to the braking system. [XXX] [XXX] partner admitted the hydrobooster and master cylinder was the problem because he admitted what [XXX] did as sabotage to the customer’s truck. [XXX] deletes the DPF and DEF and the electronics rewiring the truck. [XXX] has a pattern of keeping customers vehicles for excessively long periods of time: 42 days to change batteries, change fuel pump change PCM fusebox and rewire truck. [XXX] has removed the all the catalytic converters and he has removed all the EGR and emissions pollutant controls on [XXX]. [XXX] has sabotaged this truck’s braking system, electrical systems, fuse box wiring, electronic braking wiring, accelerator electronic control.  INFORMATION Redacted PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "1FTWW32P65E"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/09/2021",
        "dateOfIncident": "06/07/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428417,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "When driving 50 mph or above and hitting a bump in the road such as a bridge apron the truck develops an uncontrollable shimmy in the front end.  It requires a firm grip from both hands  to control the steering and lasts  until the truck is slowed to under 20 mph and often until it is completely stopped.  Luckily there hasn’t been another vehicle in the lanes next to me when this has occurred.  If there had been it may have caused an accident.  Tires are relatively new and the alignment is spot on.  It feels like  the same problem I had as a teenager in my 1959 Ford F100 when the king pins were worn.",
        "vin": "1FTWW31YX5E"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/30/2020",
        "dateOfIncident": "12/10/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319705,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DEATH WOBBLE. TRUCK SHAKES VIOLENTLY WHEN TRAVELING +50 MPH, EMPTY, OR TOWING OR HAULING LOAD IN TRUCK BED. DOWNHILL BRAKING IS EXTREMELY DANGEROUS. TURNING WHILE BRAKING IS THE WORST.",
        "vin": "1FTWW33P05E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/25/2019",
        "dateOfIncident": "11/04/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11282161,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 FORD F-350. THE CONTACT STATED THAT THE VEHICLE MISFIRED AND CAUSED THE STEERING WHEEL TO SEIZE. ALSO, WHILE DRIVING VARIOUS SPEEDS, THE BRAKE PEDAL WAS DEPRESSED, BUT THE VEHICLE FAILED TO IMMEDIATELY STOP. THE VEHICLE WAS TAKEN TO FORMULA FORD LINCOLN (4318 MIDDLE RD, RUTLAND, VT 05701, (802) 773-9168) WHERE THE CAM PHASERS WERE REPLACED; HOWEVER, THE FAILURE RECURRED AFTER 176 MILES. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 63,000.",
        "vin": "1FDWF37575E"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/03/2019",
        "dateOfIncident": "07/03/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11229388,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING DOWN THE HIGHWAY(45-55MPH) VEHICLE DASH LIGHTS, RADIO, WINDOWS ALL STOP WORKING. THEY COME BACK ON RANDOMLY. NO CHANGE TO LITTLE CHANGE WHEN RE-STARTING. VEHICLE ALSO LOSES POWER AND THE ENGINE SEEMS TO PAUSE AND GO, OVER AND OVER LIKE IT'S STRUGGLING. I'VE TAKEN IT TO SEVERAL FORD CERTIFIED MECHANICS WHO ARE BAFFLED.",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/05/2019",
        "dateOfIncident": "04/05/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11194204,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 FORD F-350. WHILE DRIVING OVER A BUMP IN THE ROAD, THE VEHICLE EXPERIENCED THE DEATH WOBBLE. THE FRONT END OF THE VEHICLE SHOOK UNCONTROLLABLY AND WOULD NOT STOP. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO MOUNTAIN VIEW FORD (301 E 20TH ST, CHATTANOOGA, TN 37408, (423) 756-1331) WHERE IT WAS DIAGNOSED THAT A NEW TRACK BAR WAS NEEDED. THE VEHICLE WAS THEN TAKEN TO MARSHALL MIZE FORD  (5348 TN-153, HIXSON, TN 37343, (423) 875-2023) WHERE IT WAS DIAGNOSED THAT THE VEHICLE NEEDED A TRACK BAR. THE VEHICLE WAS REPAIRED; HOWEVER, THE REPAIR FAILED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND DID NOT ASSIST. THE FAILURE MILEAGE WAS 36,000.",
        "vin": "1FTWW33P45E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/02/2019",
        "dateOfIncident": "02/14/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11193374,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 FORD F-350. WHILE DRIVING 65 MPH, THE VEHICLE STALLED AND THE CHECK ENGINE WARNING INDICATOR ILLUMINATED. THE CONTACT COASTED THE VEHICLE TO THE SIDE OF THE ROAD AND POWERED OFF THE ENGINE. THE VEHICLE WAS RESTARTED AND WAS ABLE TO DRIVE NORMALLY. LATER, THE VEHICLE STALLED AND FAILED TO RESTART. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED, BUT A FAILURE CODE COULD NOT BE FOUND. THE VEHICLE WAS NOT TAKEN TO A DEALER AND WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND INFORMED THE CONTACT THAT THE VIN WAS NOT INCLUDED IN A RECALL. THE APPROXIMATE FAILURE MILEAGE WAS 130,000.",
        "vin": "1FTWW31P55E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/17/2018",
        "dateOfIncident": "09/13/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129906,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 FORD F-150. WHILE DRIVING 35 MPH, THE VEHICLE STALLED WITHOUT WARNING. THE CONTACT ATTEMPTED TO RESTART THE VEHICLE, BUT WAS UNSUCCESSFUL. THE CONTACT HAD THE VEHICLE TOWED TO HIS HOME. A DIAGNOSTIC APPOINTMENT WAS SCHEDULED WITH GUESS FORD (457 STEUBENVILLE RD SE, CARROLLTON, OH 44615, (330)-627-7666). THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND INFORMED THE CONTACT THAT THERE WERE NO RECALLS; THEREFORE, THE CONTACT WOULD HAVE TO PAY IN FULL FOR THE REPAIRS. THE FAILURE MILEAGE WAS 76,000. *TT  CONSUMER STATED THIS  WAS THE SECOND TIME IT STALLED. UPDATED 12/03/18*JB",
        "vin": "1FTWX33P75E"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/03/2018",
        "dateOfIncident": "07/20/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11115565,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 FORD F-350. WHILE DRIVING APPROXIMATELY 35 MPH, THE VEHICLE SUDDENLY STALLED. AFTER, RESTARTING THE ENGINE, THE VEHICLE OPERATED NORMALLY; HOWEVER, THE FAILURE RECURRED. THE VEHICLE WAS TAKEN TO THE LOCAL DEALER (MATTHEWS FORD, 1101 WEST SW. EXPRESS DR., BROKEN ARROW, OK) WHERE IT WAS DIAGNOSED THAT THE ELECTRICAL WIRE HARNESS WAS FAULTY AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE, BUT NO ASSISTANCE WAS OFFERED. THE CONTACT WAS INFORMED BY THE MANUFACTURER THAT THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 05V270000 (ELECTRICAL SYSTEM), ALTHOUGH IT EXPERIENCED THE SAME FAILURE LISTED IN THE RECALL. THE FAILURE MILEAGE WAS 45,000. *TT  *JS",
        "vin": "1FTWW31PX5E"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/03/2018",
        "dateOfIncident": "07/14/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11115659,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "FICM AND ICP SENSOR. I WOULD BE DRIVING DOWN THE ROAD AND MY VEHICLE WOULD CUT OFF ON ME WHILE ON THE STREET. IT WOULD TAKE ABOUT FIFTEEN MINUTES OR MORE TO START BACK UP(HOT START). I'VE ONLY HAD THE VEHICLE FOR A YEAR.",
        "vin": "1FTWW33P15E"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/23/2018",
        "dateOfIncident": "12/01/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11097626,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE INSTRUMENT CLUSTER AND RADIO CUT OUT FREQUENTLY WHILE THE VEHICLE IS RUNNING. THIS CAUSES THE SPEEDOMETER, TACHOMETER, FUEL GAUGE, THERMOSTATS, AND ODOMETER TO SHOW THERE IS NO POWER TO THEM AND THE NEEDLES RESTS AS THEY DO WHEN THE VEHICLE IS OFF.  THE RADIO ALSO CUTS OUT DURING THIS TIME.  THIS HAPPENS WHEN THE VEHICLE IS STATIONARY, MOVING, ON CITY STREETS, AND ON HIGHWAYS.  THERE IS NO WARNING WHEN THIS HAPPENS.  IT WILL STAY OFF FOR SECONDS TO MINUTES.  CURRENTLY THERE IS NO RECALL FROM FORD.  THERE IS INFORMATION ON THE INTERNET CONCERNING OTHERS WITH THE SAME PROBLEM SO THIS IS NOT A SINGLE VEHICLE ISSUE.  I AM CURRENTLY UNABLE TO GET A STATE VEHICLE SAFETY INSPECTION DUE TO THE INSTRUMENTS NOT FUNCTIONING PROPERLY.",
        "vin": "1FTWW31P15E"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/08/2017",
        "dateOfIncident": "08/09/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11022343,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE GAS TANK HAS A DEFECT IT EPOXY LINER IN GAS TANK CORRODES  AND PLUGS UP THE  FILTER EJECTOR AND SHUT TRUCK DOWN AND RUST OUT FILTERS.  THE TRUCK WAS BEEN DRIVEN WHEN IT SHUT DOWN , TOOK TRUCK TO FORD DEALER, WAS TOLD GAS TANK IS ERODED AND HAS PLUG UP SYSTEM INCLUDING INJECTORS,  WILL BE $8000.00 TO FIX,   THAT THERE WASNT A CURRENT RECALL ON ITEM, BUT THAT FOR KNOW PROBLEM EXIST.",
        "vin": "1FDWF36P85E"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/08/2017",
        "dateOfIncident": "08/07/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11022350,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 FORD F-350. WHILE DRIVING APPROXIMATELY 65 MPH, THE ENGINE SEIZED WITHOUT WARNING. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TOWED TO LEIF JOHNSON FORD (501 E KOENIG LN #1, AUSTIN, TX 78751 (512) 454-3711) WHERE IT WAS DIAGNOSED THAT THE FUEL LINER IN THE FUEL TANK CAUSED THE VEHICLE TO SEIZE. THE FUEL TANK WAS CORRODED AND CLOGGED THE INJECTORS. THE CONTACT STATED THAT THE FUEL TANK, FUEL INJECTORS, AND FUEL FILTERS NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER ACKNOWLEDGED THE FAILURE, STATED THAT THE VEHICLE WAS NOT INCLUDED IN A RECALL, AND DID NOT OFFER ANY FURTHER ASSISTANCE. THE APPROXIMATE FAILURE MILEAGE WAS 120,000.",
        "vin": "1FDWF36P85E"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/03/2017",
        "dateOfIncident": "05/15/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11012498,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 FORD F-350. WHILE ATTEMPTING TO START THE VEHICLE, IT FAILED TO START. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THAT THE FUEL INJECTION CONTROL MODULE, SENSOR, AND TURBO HOSES FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. A DEALER WAS NOT CONTACTED. ALSO, WHILE DRIVING 30 MPH, THE ENGINE BEGAN TO REV AND THE CONTACT HAD TO BRAKE TO STOP THE VEHICLE FROM SURGING FORWARD AND COLLIDING WITH THE PRECEDING VEHICLE. THE VEHICLE CONTINUED TO SURGE AS THE CONTACT DROVE. THE CONTACT PULLED OVER AND TURNED OFF THE VEHICLE. THE CONTACT WAS UNABLE TO RESTART THE VEHICLE. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THAT THE INJECTION CONTROL PRESSURE SENSOR FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. A DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS MADE AWARE OF BOTH FAILURES AND STATED THAT THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 05V270000 (ELECTRICAL SYSTEM). THE APPROXIMATE FAILURE MILEAGE WAS 120,000.",
        "vin": "1FTWW31P65E"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/30/2017",
        "dateOfIncident": "05/30/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10992214,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "CAME UP WITH A CODE TO REPLACE T.P.S.   I REPLACED TPS NOW VEHICLE IS HAVING PROBLEMS IDLING . I CONTACTED FORD EXPLAINED TO THEM MY SITUATION. I WAS TOLD BY 3 DIFFERENT PEOPLE THAT WHENEVER PEOPLE WITH A 6.8 V10 HAVE THE CODE TO REPLACE T.P.S THEY END UP REPLACING THE WHOLE E.T.B.  IS THERE A RECALL FOR THE THROTTLE BODY ?",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/26/2017",
        "dateOfIncident": "01/06/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10947809,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 FORD F-350. WHILE DRIVING APPROXIMATELY 70 MPH, THE VEHICLE STALLED WITHOUT WARNING AND FAILED TO RESTART. THE CONTACT HAD THE VEHICLE TOWED. THE VEHICLE WAS NOT TAKEN TO THE DEALER NOR WAS IT DIAGNOSED AND REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND INFORMED THE CONTACT TO FILE A COMPLAINT IN AN ATTEMPT TO HAVE THE VEHICLE INCLUDED IN NHTSA CAMPAIGN NUMBER: 05V270000 (ELECTRICAL SYSTEM). THE APPROXIMATE FAILURE MILEAGE WAS 123,000.",
        "vin": "1FTWW33P15E"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/01/2016",
        "dateOfIncident": "11/28/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10928997,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 FORD F-350. WHILE WALKING TOWARDS THE PARKED VEHICLE, THE CONTACT NOTICED THAT THE REAR PORTION OF THE FUEL TANK WAS SEPARATED FROM THE FRAME DUE TO A RUSTED FUEL TANK STRAP. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VIN WAS UNKNOWN. THE APPROXIMATE FAILURE MILEAGE WAS 174,000.",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/04/2016",
        "dateOfIncident": "06/14/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10903510,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE INTERSTATE IN THE EVENING WITH OUR HEADLIGHTS ON, WE HAD TO BE PULLED OVER BY THE STATE POLICE TO INFORM US WE HAD ABSOLUTELY NO REAR RUNNING LIGHTS. UPON TROUBLESHOOTING THE PROBLEM I FOUND IT IS MOST LIKELY THE SAME AS RECALL NO. 11C18  MULTI-FUNCTION SWITCH. OUR MECHANIC ALSO AGREED THIS IS THE PROBLEM.  BUT FORD SAYS OUR VIN # IS NOT INCLUDED IN THE RECALL. I HAVE SINCE SEEN TWO OTHER TRUCKS IDENTICAL TO OURS WITH NO REAR LIGHT AT NIGHT WHILE YET THEIR HEAD LIGHTS ARE ON.",
        "vin": "1FTWW31595E"
    },
    {
        "components": "STEERING,SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/04/2016",
        "dateOfIncident": "07/14/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10903511,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DEATH WOBBLE. 1ST TIME IT HAPPENED WAS ENTERING THE HIGHWAY OFF THE RAMP AND ACCELERATING TO MERGE INTO TRAFFIC AND GOING OVER THE OVERPASS THE BRIDGES IN MASS. ARE A MESS, ANY WAY, WHEN I DROVE THOSE SERIES OF BUMPS AT ABOUT 60-65 MPH IN A TRUCK IT GETS BUMPY ANYWAY BUT ALL OF A SUDDEN THE STEERING WHEEL, AND THE TRUCK STARTED VIOLENTLY SHAKING OUT OF CONTROL SO BAD I LOST COMPLETE VISION IT WAS SHAKING SO BAD WITH NO CAPABILITY OF STEERING THE TRUCK..INSTINCTIVELY I APPLIED THE BRAKES NOT EVEN CHECKING TO SEE WHAT WAS BEHIND ME AS IT WAS SHAKING SO BAD, YOU CANT TURN AROUND, YOU CAN NOT SEE OUT THE MIRRORS. AS I STATED YOU KIND OF LOSE VISION AND EVERYTHING GOES BLURRY BECAUSE YOUR SHAKING IN THE VEHICLE SO BAD. A QUICK GOOGLE AND YOU FIND THIS HAPPENS TO MANY MANY OWNERS OF THIS VERY THE SAME TRUCK. IN FACT FORD SENT ME A LETTER STATING THEY KNEW ABOUT IT AND TO MAKE SURE WE HAVE THE CORRECT AIR PRESSURE. I USE A $50 AIR PRESSURE GAUGE, THE AIR PRESSURES NOT THE PROBLEM.  IT WAS STILL HAPPENING ANYTIME YOU GO OVER BIG BUMPS OR A SERIES OF SMALLER BUMPS WILL SET IT OFF WHILE DRIVING ON THE HIGHWAY OR OVER 60 MPH. IT DOESN'T HAPPEN TO US AT SLOWER SPEEDS. THIS IS AN EXTREMELY DANGEROUS DEFECT.",
        "vin": "1FTWW31595E"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/10/2016",
        "dateOfIncident": "06/10/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10894949,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER SURGE.  STOPPED WAITING AT LIGHT FELT LIKE I WAS HIT FROM BEHIND, VERY QUICK UNEXPECTED SURGE FORWARD,  IT ALSO OCCRURES WHILE DRIVING BUT THE EFFECT IS NOT STRONG,  MORE NOTICEABLE WHEN BACKING.",
        "vin": "1FTWW31P85E"
    },
    {
        "components": "SUSPENSION,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/05/2016",
        "dateOfIncident": "04/28/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10863336,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 FORD F-350. THE CONTACT STATED WHILE DRIVING AT APPROXIMATELY 65 MPH, THE VEHICLE VIOLENTLY SHOOK. THE FAILURE OCCURRED WITHOUT WARNING. THE VEHICLE WAS TAKEN TO INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THE VEHICLE HAD A FRONT END OSCILLATION AND THAT TRACK BAR, STABILIZER LINK, AND UPPER AND LOWER BALL JOINTS NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 127,000.",
        "vin": "1FTWW33P75E"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/09/2016",
        "dateOfIncident": "07/26/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10825093,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2005 HAS A VIOLENT FRONT END WOBBLE IF I HIT A BUMP WHILE TURNING RIGHT. WHEN I TOOK IT TO THE DEALER, I WAS TOLD TO OVER INFLATE MY TIRES. HE ALSO SAID THAT IT WAS A COMMON COMPLAINT WITH THIS MODEL.   THE DEALER CALLED IT A  \" DEATH WOBBLE \" AND TOLD ME TO MAKE SURE THAT I WAS HOLDING THE STEERING WHEEL TIGHT WHEN IT HAPPENS. THIS IS A REGULAR OCCURRENCE.",
        "vin": "1FTWX31P25E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "02/02/2016",
        "dateOfIncident": "07/23/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10838357,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "CPSC: 2005 F-350. CONSUMER STATED THE 6.0 DIESEL MOTOR IS NO LONGER WORKING DUE TO A BUILDUP IN THE GAS TANK, OR OIL SYSTEM. *SS  THE CONSUMER STATED AFTER THE VEHICLE WAS FIXED, IT BROKE DOWN AGAIN. *JB",
        "vin": "1FTWW33P75E"
    },
    {
        "components": "STEERING,SUSPENSION,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/12/2016",
        "dateOfIncident": "11/30/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10819717,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 FORD F-350. WHILE DRIVING 45 MPH, THE VEHICLE WOBBLED. THE STEERING VEERED TO THE LEFT WHEN THE WHEEL WAS TURNED TO THE RIGHT AND VICE VERSA. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THAT THE FRONT TIE RODS, FRONT STABILIZER BARS, GEAR BOX, AND MULTIPLE PARTS ON THE FRONT OF THE VEHICLE  NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. IN ADDITION, WHILE DRIVING 65 MPH, THE VEHICLE LOST POWER. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THAT THE INJECTORS, CAM SHAFT SENSOR, AND THE WIRING HARNESS FOR THE INJECTORS NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED; HOWEVER, THE FAILURE RECURRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 102,000.",
        "vin": "1FTWX31P05E"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/17/2015",
        "dateOfIncident": "03/06/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10694792,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN EVER THIS TRUCK HITS A BUMPY PART OF ROAD (E.G. POT HOLE, CRACK IN PAVEMENT, OR DEBRIS) THE VEHICLE (AND STEERING WHEEL) WILL SHAKE VIOLENTLY BACK AND FORTH FOR SEVERAL SECONDS (4 TO 5 SECONDS) OR UNTIL I SLOW TO SPEEDS AROUND 35MPH OR BELOW.  THIS HAPPENS ON A REGULAR BASIS AND HAS HAPPENED SINCE I BOUGHT THE VEHICLE TWO YEARS AGO.  THE TIRES ARE LIKE NEW, AND THE FRONT SUSPENSION COMPONENTS HAVE BEEN CHECKED AND DETERMINED TO BE IN GOOD USABLE CONDITION.    SEARCHING THE WEB FOR POSSIBLE CAUSES OR FIXES OF THIS ISSUE, I HAVE FOUND THAT MANY OTHER PEOPLE ALSO HAVE THIS SAME PROBLEM, WITH LITTLE TO NO HELP COMING FROM SERVICE REPAIRS AT A DEALERSHIP.  *TR",
        "vin": "1FTWX31P05E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/05/2015",
        "dateOfIncident": "02/02/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10692272,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 FORD F-350. THE CONTACT STATED WHILE DRIVING APPROXIMATELY 55 MPH, THE ENGINE STALLED WITHOUT WARNING.  THE CONTACT MANAGED TO COAST TO AN EMERGENCY LANE. THE VEHICLE WAS RESTARTED. HOWEVER, THE FAILURE RECURRED MULTIPLE TIMES. THE VEHICLE WAS NOT TAKEN TO THE DEALER FOR A DIAGNOSIS. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 75,000.",
        "vin": "1FTWW33P65E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/02/2015",
        "dateOfIncident": "01/18/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10680578,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 FORD F-350.  THE CONTACT STATED THAT WHILE DRIVING AT APPROXIMATELY 74 MPH, THE VEHICLE STALLED WITHOUT WARNING. THE FAILURE RECURRED ON MULTIPLE OCCASIONS.  THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC, WHO DIAGNOSED THAT FOUR INJECTORS FRACTURED.  THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 170,000.",
        "vin": "1FDWX37P95E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/21/2015",
        "dateOfIncident": "04/16/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10676992,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRUCK WOULD SHUT OFF WHILE DRIVING.  NOTHING WILL WARN THE DRIVER WHEN THIS HAPPENS.  I HAVE SPENT MORE THAN $1500 AT A FORD DEALERSHIP AND IT STILL HAS THE SAME PROBLEM.     THIS IS A VERY DANGEROUS PROBLEM BECAUSE THE POWER STEERING AND BRAKES WILL NOT FUNCTION WHEN THE ENGINE SHUTS OFF.  *TR",
        "vin": "1FTWW33PX5E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL,POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/17/2015",
        "dateOfIncident": "12/16/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10676166,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2005 FORD F350 DIESEL POWERSTROKE THAT HAS THE FUEL TANK LINING FALLING OFF AND ITS GOTTEN TO MY FUEL LINES AND FUEL PUMP CAUSING THE TRUCK TO COME TO A COMPLETE STOP WHILE I WAS DRIVING DOWN THE FREEWAY HAULING A 12FT TRAILER WITH A 10000 LBS TRACTOR ON IT. I HAD TO GET IT TOWED TO A SHOP WHERE THEY REPLACED THE FUEL PUMP AND FILTERS. ONE MONTH LATER IT DID THE SAME THING WHILE ON THE HIGHWAY AGAIN IT JUST DIED THE MECHANIC SAYS MY FUEL TANK IS THE PROBLEM THE LINING INSIDE THE FUEL TANK IS CHIPPING AWAY AND IT HAS GOTTEN TO THE FUEL SYSTEM AGAIN THIS IS A FREQUENT PROBLEM WITH FORD DIESEL TANKS AND THEY WONT TAKE RESPONSIBILITY. THIS SECOND TIME AROUND I AM HAVING TO REPLACE FUEL INJECTORS AND THE FILTERS AGAIN.",
        "vin": "1FDWW36P85E"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/05/2015",
        "dateOfIncident": "12/27/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10670065,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 FORD F-350. WHILE DRIVING 65 MPH, THE VEHICLE DECELERATED ON ITS OWN. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THAT THE FUEL SYSTEM NEEDED TO BE REPLACED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 125,900.",
        "vin": "1FDWF37P15E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL,FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "10/10/2014",
        "dateOfIncident": "08/05/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10643953,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2005 FORD F-350. THE CONTACT STATED THAT WHILE DRIVING AT 30 MPH, THE ENGINE STALLED WITHOUT WARNING. THE FAILURE OCCURRED ON NUMEROUS OCCASIONS. THE VEHICLE WAS TAKEN TO A DEALER ON SEVERAL OCCASIONS WHERE IT WAS DIAGNOSED THAT THE MOTOR NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED BUT THE FAILURE RECURRED. ON ANOTHER OCCASION THE VEHICLE WAS TAKEN TO THE DEALER, WHERE IT WAS DIAGNOSED THAT THE PRESSURE UNIT FOR THE DIESEL PUMP NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 92,000.",
        "vin": "1FTWW33P55E"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/24/2014",
        "dateOfIncident": "08/01/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10638827,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "AUG 1, 2014 FUEL INJECTION FAILURE, DUE TO FUEL INJECTION WIRE HARNESS CHAFING.  SEPT 15 FUEL INJECTION FAILURE DUE TO FICM FAILURE RESULTING IN SEVERE LOSS OF POWER.  VEHICLE BARELY MOVES, STRONG POSSIBILITY OF CRASH DUE TO VEHICLES UNEXPECTED SUDDEN LOSS OF POWER AND INABILITY TO MOVE.    INCIDENTS CLOSELY RELATE TO RECALL 05V270000 FOR VEHICLE MANUFACTURED CLOSE TO SAME DATES. BELIEVE THAT RECALL SHOULD BE REOPENED AND EXTENDED TO INCLUDE ALL 6.0 DIESEL ENGINES.  *TR",
        "vin": "1FTWW31P65E"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/02/2014",
        "dateOfIncident": "05/16/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10595441,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 40 FT TOY HAULER I PULL WITH THE F350, GOING UP HILL AND ALL SYSTEMS FAIL. BUT LEFT ON THE SIDE OF THE MOUNTAIN RD I WAS TRAVELING. A FUEL RAIL IS DISCOVED  GONE BAD, BILLOWS OF WHITE SOME PRIOR TO SYSTEM SHUT DOWN.  $2800.00 REPAIR. TWO WEEKS LATER ANOTHER MOUNTAIN PASS TRUCK OVER HEATS CAUSING SYSTEM FAILURE. COME TO FIND OUT $10,000 DOLLARS LATER IN REPAIRS ALONE NOT, TALKING HOTEL, RENTAL CAR, AND DELAY OF TRIP FOR NINE DAYS. BUT THE PHIL LONG FORD DEALERSHIP NEW ABOUT THE COSTLY REPAIRS AND FAILS TO INFORM CUSTMOR.. LEADING HIM TOO A TOTAL OF $7300.00 IN REPAIRS. TOTAL REPAIRS  $10,100. THANKS PHIL LONG FORD, COLORADO SPRINGS, FOR NOT INFORMING CUSTOMERS OF THE COSTLY REPAIRS BUT KNOWING THEY WHERE THERE. DRAGING HARD WORKING AMERICANS THOUGH THE DIRT... GREAT BUNCH OF GUYS. NOT...  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/22/2014",
        "dateOfIncident": "02/05/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10593514,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 FORD F-350. THE CONTACT STATED THAT WHEN DRIVING AT HIGHWAY SPEEDS, THE VEHICLE STALLED. THE CONTACT MENTIONED THAT THE VEHICLE FAILED TO RESTART AFTER STALLING. THE FAILURE OCCURRED ON SEVERAL OCCASIONS. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC, WHO WAS UNABLE TO REPLICATE THE FAILURE.  THE CONTACT WAS MADE AWARE ABOUT NHTSA CAMPAIGN NUMBER: 05V270000 (ELECTRICAL SYSTEM), HOWEVER DID NOT VERIFY WITH THE MANUFACTURER IF THE VEHICLE WAS INCLUDED. THE FAILURE MILEAGE WAS 137,000.",
        "vin": "1FDWF36P85E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/18/2014",
        "dateOfIncident": "09/25/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10592251,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TOWING UP A GRADE AT ABOUT 35 MPH LOSS ALL POWER.   UPDATED 11/24/2014  *JS",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/16/2014",
        "dateOfIncident": "10/04/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10560282,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 FORD F-350. THE CONTACT STATED THAT WHILE DRIVING 50 MPH, THE VEHICLE STARTED TO JERK VIOLENTLY WITHOUT ANY WARNING. THE VEHICLE WAS NOT TAKEN TO THE DEALER. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE WAS 50,000 AND THE CURRENT MILEAGE WAS 250,000.   UPDATED 2/26/14*CN",
        "vin": "1FTWW33P15E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "12/10/2013",
        "dateOfIncident": "01/07/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10555448,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 FORD F350. THE CONTACT STATED THAT WHILE DRIVING 40 MPH, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS TAKEN TO THE DEALER FOR INSPECTION WHERE THEY STATED THAT THE FUEL FILTER NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED BUT THE FAILURE RECURRED. THE MANUFACTURER WAS NOTIFIED. THE FAILURE MILEAGE WAS 55,000.  *TR",
        "vin": "1FTWX31P75E"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/10/2013",
        "dateOfIncident": "10/10/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10547566,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 FORD F-350 SUPER DUTY. THE CONTACT STATED WHILE AT A STOP LIGHT THE VEHICLE STALLED. THE CONTACT DID NOT TAKE THE VEHICLE TO A DEALER OR A LOCAL MECHANIC. THE CONTACT CALLED THE MANUFACTURER REGARDING THE NHTSA CAMPAIGN NUMBER 05V266000 (FUEL SYSTEM); HOWEVER, THEY STATED THE VEHICLE DID NOT HAVE ANY RECALLS. THE FAILURE MILEAGE WAS 172,456.",
        "vin": "1FTWW31P45E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/14/2013",
        "dateOfIncident": "07/14/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10535311,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 FORD F-350. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 60 MPH, THE ENGINE OVERHEATED. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSIS. THE TECHNICIAN STATED THAT THE HEAD GASKET, OIL COOLER, AND EGR COOLER WOULD HAVE TO BE REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 73,233.  *TR",
        "vin": "1FTWW31P45E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "08/09/2013",
        "dateOfIncident": "07/31/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10534606,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MERGED ON TO MCFARLAND BLVD. WITH SOUTH BOUND TRAFFIC TRUCK LOST POWER COULD NOT CONTROL VEHICLE OTHER TRAFFIC ALMOST RAN INTO THE TRUCK.HAD TRUCK TOWED TO DIESEL SHOP.COLUMBUS DIESEL SERVICE FOUND PAINT CHIPS IN FILTER REMOVED FUEL TANK ,COATING OF THE TANK WAS COMING OFF  AND ENTERING THE FUEL SYSTEM THIS IS THE FACTORY TANK THAT CAME WITH THE TRUCK..   *TR",
        "vin": "1FDWX37P35E"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/02/2013",
        "dateOfIncident": "03/01/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10533255,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MY HUSBAND WAS DRIVING THE TRUCK AFTER SEVERAL REPAIRS AND TURNED ONTO THE HIGHWAY AND THE TRUCK ELECTRICAL SYSTEM JUST SHUT DOWN! WE CONTACTED THE DEALERSHIP THEY DIDN'T HELP WE HAVE PUT OUR OWN MONEY IN THIS TRUCK TO FIX IT AND WAS TOLD THIS TRUCK SHOULDN'T HAVE BEEN SOLD TO US THAT IT WAS A LEMON PER THE MASTER MECHANIC! I DON'T KNOW WHAT TO DO THIS TRUCK IS A HAZARD TO DRIVE AND WHEN I SPOKE WITH THE DEALERSHIPS OWNER HE TOLD ME TO BRING IT BACK AND THEY WILL  SELL IT IN THE AUCTION AGAIN. ITS A DANGER AND CAN'T BE FIXED I HAVE ALL REPORTS  ON WHAT WAS DONE ON THIS TRUCK.  *TR",
        "vin": "1FDWF36PX5E"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/21/2013",
        "dateOfIncident": "05/19/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10512948,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 FORD F-350SD. THE CONTACT STATED THAT THE VEHICLE STALLED WITHOUT WARNING AND COULD NOT BE RESTARTED. THE CONTACT TOOK THE VEHICLE TO THE DEALER AND WAS TOLD THAT THE FUEL INJECTOR CONTROL MODULE NEEDED TO BE REPLACED. THE CONTACT WAS ALSO ADVISED THAT THE VEHICLE WAS NOT INCLUDED NHTSA CAMPAIGN ID NUMBER: 05V270000 (ELECTRICAL SYSTEM). THE FAILURE MILEAGE AND CURRENT MILEAGES WAS 212,000.  *TR",
        "vin": "1FTWW32P95E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/05/2013",
        "dateOfIncident": "04/05/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10507256,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 FORD F-350. THE CONTACT STATED WHILE DRIVING AT VARIOUS SPEEDS, THE VEHICLE STALLED. THE FAILURE RECURRED NUMEROUS TIMES. THE VEHICLE WAS TAKEN TO A DEALER FOR DIAGNOSIS BUT THE CONTACT WAS TOLD THAT NO CAUSE FOR THE FAILURE WAS FOUND. THE MANUFACTURER WAS NOTIFIED BUT OFFERED NO ASSISTANCE. THE FAILURE AND CURRENT MILEAGE WAS 99,000.",
        "vin": "1FTWW32P85E"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/04/2012",
        "dateOfIncident": "04/02/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10487324,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT  OWNS A 2005 FORD F-350. THE CONTACT STATED THAT THE VEHICLE WAS LEAKING TRANSMISSION FLUID FROM A SEAL IN THE TORQUE CONVERTER. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC. THE TECHNICIAN ADVISED THE CONTACT THAT THE TRANSMISSION NEEDED TO BE REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE BUT DID NOT OFFER ANY ASSISTANCE SINCE THE VEHICLE WAS NOT INCLUDED IN ANY RECALLS. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 150,000 AND THE CURRENT MILEAGE WAS 168,000.",
        "vin": "1FTWW33P85E"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/31/2012",
        "dateOfIncident": "10/15/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10482734,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Cooper Tire & Rubber Co.",
                "productMake": "PRO COMP",
                "productModel": "PRO COMP XTERRAIN",
                "productYear": "9999",
                "size": "LT325/65R18",
                "type": "Tire"
            }
        ],
        "summary": "TIRE BELT INSIDE FELL APART AND CAUSED FLAT TIRE. TIRES BOUNCE EVEN AFTER BEING BALANCED OVER AND OVER SHOWS TIRES ARE BALANCED BUT TIRES BOUNCE ON ROAD. *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/16/2012",
        "dateOfIncident": "06/12/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10480688,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE HAS HAD NUMEROUS ENGINE FAILURES WHICH I WILL LIST BELOW. I SPEND ALOT OF TIME IN RURAL LOCATIONS BETWEEN 50 AND 100 MILES FROM ANY SERVICE FACILITIES IN ALL KINDS OF WEATHER. USUALLY THERE IS NOT ANY CELL SERVICE AVAILABLE. IT IS ONLY A MATTER OF TIME BEFORE I OR SOMEONE IS STRANDED IN BAD WEATHER BECAUSE OF THE POOR ENGINEERING ON THE 6.0 LITER DIESEL THAT FORD INSTALLED IN MY VEHICLE. THIS COULD WELL BE LIFE THREATENING AND LEAD TO DEATH IN THE FUTURE.  6/12/06 TURBO FAILURE-COVERED BY WARRANTY BY FORD - 20000 MILES  7/15/06 RECALL ON COMPUTER-COVERED BY WARRANTY BY FORD- 21000 MILES  4/8/11 EGR COOLER BLEW OUT- OUT OF POCKET COST $1703.46- 90619 MILES  8/28/12 INJECTORS FAILED- OUT OF POCKET COST $2178.09- 110732 MILES  8/30/12 REAR WHEEL SEAL AND EMERGENCY BRAKE FAILURE- OUT OF POCKET COST- $703.06- 111423 MILES  10/12/12 TURBO FAILURE AGAIN- OUT OF POCKET COST $2577.75- 113473 MILES  YOU CAN SEE THE ONGOING THEME HERE AND WHEN I TALK TO FORD THEY SAY \"SORRY BUT WE HAVE NO RECALLS AND NO CUSTOMER SERVICE HELP AT THIS TIME.\" THEY NEED TO TAKE RESPOSIBILITY BEFORE SOMETHING HAPPENS AND IT PUTS PEOPLES LIVES AT RISK. AS THE OWNER OF THIS VEHICLE I WOULD LIKE TO BE INCLUDED IN ANY CLASS ACTION LAWSUITS AGAINST FORD FOR NOT TAKING RESPONSIBILITY FOR THE 6.0 LITER ENGINEERING DISASTER THAT THEY CREATED. HOPEFULLY SOMEONE WILL MAKE THEM STEP UP AND PROVIDE THE BUYERS OF THESE ENGINES THE HELP THEY NEED AND DESERVE.  *TR",
        "vin": "1FTWW31P85E"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING,FUEL SYSTEM, DIESEL,POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/16/2012",
        "dateOfIncident": "10/04/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10465856,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 FORD F350 SUPER DUTY. THE CONTACT STATED THAT THE VEHICLE STALLED NUMEROUS TIMES WITHOUT WARNING WHILE DRIVING AT ANY SPEED. THE VEHICLE WAS TAKEN TO THE DEALER NUMEROUS TIMES FOR THE FAILURE. THE DEALER REPLACED THE FUEL INJECTORS, THE TURBO CHARGER WAS REPLACED FOUR TIMES, THE HEAD GASKETS, AND THE REAR END RINGS HOWEVER THE FAILURE WAS NOT CORRECTED. THE VEHICLE CONTINUED TO STALL WITHOUT WARNING AND THE ENGINE COULD NO LONGER BE STARTED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND ADVISED THE CONTACT THAT THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN ID NUMBER: 05V270000 (ELECTRICAL SYSTEM: WIRING). THE FAILURE MILEAGE WAS 9,368 AND THE CURRENT MILEAGE WAS 175,000.   UPDATED 8/21/12 *CN  THE CONSUMER STATED THE HIGH PRESSURE OIL PUMP, FRONT END SEALS, END RINGS, FUEL INJECTORS, TURBO CHARGER, HEAD GASKETS AND EGR VALVE WERE REPALCED.  THE TRANSMISSION WAS SLIPPIING WHEN THE VEHICLE WAS PUT IN REVERSE.  THE ABS LIGHT ILLUMINATED.",
        "vin": "1FTWW31P35E"
    },
    {
        "components": "STEERING,SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/06/2012",
        "dateOfIncident": "07/06/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10464515,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING ON THE HIGHWAY AT 65-70 MPH MY VEHICLE WILL GO INTO A VIOLENT SHIMMY IF IT HITS ANY SORT OF ROAD BUMP (SUCH AS BRIDGE EXPANSION). THIS HAPPENS EVERYDAY IN THIS VEHICLE. IT WILL NOT GO AWAY UNTIL I SLOW THE VEHICLE DOWN TO 45 MPH.   *TR",
        "vin": "1FTWX31515E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/06/2012",
        "dateOfIncident": "06/27/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10465002,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHITE HEAVY SPOKE, LOSS OF POWER, PERFORMANCE, ENGINE STALLED ON MAJOR HIGHWAY AN EXTREMELY DANGEROUS SITUATION.  DEALER STATED NOT FORD OR THEIR PROBLEM. CHARGES CLOSE TO $1,500 TO REPAIR. DEALER CLAIMS FAILED EGR VALVE.",
        "vin": "1FTWW31P05E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/17/2012",
        "dateOfIncident": "03/31/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10458824,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 FORD F-350. THE CONTACT STATED THAT THE VEHICLE STALLED WHILE ACCELERATING INTO TRAFFIC AT 15 MPH. THE FAILURE HAD RECURRED FIVE TIMES. THE VEHICLE WAS TAKEN TO THE CONTACT'S PERSONAL MECHANIC AND HAD BEEN DIAGNOSED WITH NO FAILURES. THE MANUFACTURER WAS CONTACTED AND INFORMED THE CONTACT THAT HER VEHICLE WAS NOT PART OF A RECALL. THE CONTACT WAS THEN ADVISED TO CONTACT NHTSA. THE FAILURE MILEAGE WAS 115,000 AND CURRENT MILEAGE WAS 120,000. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/23/2012",
        "dateOfIncident": "03/22/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10452770,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PULLING A 30 FOOT TRAVEL TRAILER TUCK SUDDENLY DIED CAUSING IMMEDIATE LOSS OF STEERING AND BRAKING POWER ON A VERY BUSY HIGHWAY NEARLY CAUSING AN ACCIDENT. HAD IT TOWED TO A DIESEL SHOP WHO SCANNED TO FIND IT TO BE THE HIGH PRESSURE OIL AND FUEL PUMPS. THEY SAID THEY HAVE DONE REPEATED REPAIRS ON THE SAME ENGINE WITH THE SAME PROBLEMS IN THE PAST. VERY COSTLY REPAIR OVER $3000 AND 5 DAYS TO DO.  *TR",
        "vin": "1FTWW31P55E"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/08/2012",
        "dateOfIncident": "02/01/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10450832,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2005 F350 HAS A FUEL FAILURE AND WHEN I TOOK IT TO THE DEALER THEY SAID THAT 5 INJECTORS HAD FAILED AND I NEEDED THEY BLAME IT ON BIOFUEL, I HAVE ONLY USED ON ROAD DIESEL AND I HAVE OWNED THIS TRUCK SINCE IT HAD 25,000 MILES ON IT. AT THIS POINT IT IS $6000 TO REPAIR AND OF COURSE THERE IS NO WARRANTY ON IT. THIS IS A MAJOR CONCERN BECAUSE THIS TRUCK CARRIES EXTREME LOADS AT HIGH SPEEDS AND A FUEL FAILURE AT 65 OR 70 WILL CAUSE YOU TO LOSE POWER STEERING AND BRAKING ABILITY. WHEN YOU ARE CARRYING A BACKHOE AND HAVE A TRAILER THAT WEIGHS 6000LBS THE TOTAL WEIGHT OF THE WHOLE RIG IS RIGHT AT 35,000 POUNDS. THAT IS ENOUGH TO TAKE OUT AT LEAST 6 OR 7 CARS THAT HAVE STOPPED IN FRONT OF YOU. THIS NEEDS TO BE FIXED ASAP.  *TR",
        "vin": "1FTWW33P35E"
    },
    {
        "components": "STEERING,VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/05/2012",
        "dateOfIncident": "08/01/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10450303,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THE TRUCK USED FROM A PRIVATE DEALER IN AUG 2011 WITH 66,000MI. ON IT! FROM THE DEALER THIS ISSUE STARTED. IT HAS HAPPENED AT LEAST 2 DZ TIMES NOW AND FORD REFUSES TO ACCEPT THE ISSUE AS A FORD ISSUE! THEY TELL ME ITS THE TIRE PRESSURE AND I HAVE HAD IT TO THEM 3 TIMES TO FIX THIS ISSUE, THEY HAVE RE INFLATED MY TIRE PRESSURE TO \" FACTORY RECOMMENDED PRESSURE\" AND WITHIN 5 MILES ITS SHAKING SO VIOLENTLY I HAVE TO PULL OVER AND START AGAIN, THIS WILL CAUSE A DEATH EVENTUALLY!! I WILL NOT LET MY WIFE DRIVE THIS TRUCK AND THAT IS WHAT IT WAS BOUGHT FOR, A SAFE FAMILY VEHICLE.   *TR",
        "vin": "1FTWW33P25E"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/15/2012",
        "dateOfIncident": "01/15/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10448027,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 FORD F-350. THE CONTACT STATED THAT THE VEHICLE STALLED WHILE DRIVING 20 MPH. UPON RESTART, THE VEHICLE OPERATED AS NORMAL. THE CONTACT EXAMINED THE VEHICLE AND STATED THAT THE FUEL TANK WAS DELAMINATING AND CLOGGING THE FUEL FILTERS.  THE VEHICLE WAS NOT DIAGNOSED, NOR REPAIRED, BY THE DEALER. THE FAILURE MILEAGE WAS 49,500 AND THE CURRENT MILEAGE WAS 50,200.",
        "vin": "1FDWF37PX5E"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/03/2012",
        "dateOfIncident": "02/15/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10446406,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 FORD F-350 DEVELOPS SEVER VIBRATION AND THE OSCILLATION OF THE STEERING WHEEL CAUSES SEVERE STEERING DIFFICULTY. THIS PROBLEM DOES NOT DISSIPATE UNTIL SPEED IS REDUCED TO APPROXIMATELY 40 MPH. OBVIOUSLY THIS IS VERY DANGEROUS ON A FAST MOVING FREEWAY WHERE SPEEDS CAN EXCEED 70 MPH. THE CONDITION IS ADDRESSED IN LITERATURE PROGRAM 09L02 LETTER DATED NOVEMBER 2011. THE VEHICLE HAS BEEN CHECKED AFTER AN EVENT AND THE TECHNICIAN HAS NEVER DISCOVERED A DEFICIENCY THAT HE CAN ATTRIBUTE TO THIS MALFUNCTION. THE TECHNICIAN HAS CHECKED ALL SUSPENSION, STEERING AND TIRE RELATED ITEMS. THE TIRES THAT ARE ON THE TRUCKS ARE LOAD RANGE E TIRES AND ARE PROPERLY INFLATED TO THE MAXIMUM PRESSURE PER THE MANUFACTURERS (BIG O) SPECIFICATIONS. ALL SUSPENSION AND STEERING PART ARE FACTORY INSTALLED OR OEM PARTS AND THE SHOCK ABSORBERS ARE HEAVY DUTY.   *KB",
        "vin": "1FTWX31P55E"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/09/2012",
        "dateOfIncident": "01/01/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10443185,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE F350SD HAS A SHIMMY WHEN YOU HIT A DIP IN THE ROAD OR A BUMP. THIS IS VIOLENT ENOUGH FOR CONCERN THAT IT'LL CAUSE AN ACCIDENT. IT DOESN'T GO AWAY ON IT'S OWN YOU HAVE TO COME TO A STOP OR GET TO ABOUT FIVE MILES AN HOUR FOR IT TO RESET. THIS HAS HAPPENED MULTIPLE TIMES. I HAVE HAD THE LOCAL FRONT END SHOP REPLACE THE FRONT STEERING COMPONENTS, EVEN THOUGH THE COMPONENTS CAME WITH IN SPEC THAT FORD SAYS IS SAFE AND CORRECTIVE ACTION NEEDS BE TAKEN. THIS HELPED FOR ABOUT 10 MONTHS BUT NOW I'M BACK TO THE SAME OLD PROBLEM. FORD SAYS TO TAKE IT TO A FORD AUTHORIZED DEALER AND HAVE THEM CHECK IT OUT. I'LL DO IT ONE MORE TIME, THIS IS REPETITIVE, THEY DON'T SEE A PROBLEM IN THEIR PRODUCT SO WHY AM I WASTING MY TIME. EVERYBODY SAYS ITS YOUR TIRE PRESSURE, WRONG, I RUN IT AT MAX AND I'VE EVEN TRIED RUNNING IT  FIVE POUNDS HIGHER THAN RECOMMENDED. WOULD SOMEONE PLEASE HELP US AND GET THIS FIXED RIGHT. I KNOW FORD WONT EVER ACKNOWLEDGE THAT THERE IS A PROBLEM FOR THE CHANCE OF A LAWSUIT. SO I GUESS IT'S UP TO THE HIGHWAY SAFETY COUNCIL TO HELP. I'LL GIVE ALL OF YOU A RIDE AND SHOW YOU HOW BAD IT IS. AND THEN I CAN GIVE YOU ALL THE DOCUMENTS SHOWING FORD SAYS THE FRONT END ARE WITHIN SPEC. YOU KNOW ITS BAD WHEN IT SHIMMIES YOU OFF THE ROAD, THIS IS AS BEST YOU CAN DO TO AVOID AN ACCIDENT.  *TR",
        "vin": "1FTWW31P75E"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/16/2011",
        "dateOfIncident": "12/08/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10440214,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY TRUCK NORMALLY LIKE ANY OTHER DAY, WAS GOING DOWN THE ROAD AROUND 45MPH WHEN ALL OF THE SUDDEN THE FRONT END SHOOK SO VIOLENTLY, THAT IT PULLED SO HARD TO WHERE I HAD TO BRAKE VERY QUICKLY AND STOP THE TRUCK IMMEDIATELY. THIS PROBLEM THAT EXIST HAS NOT BEEN DETERMINED YET. I HAVE IT AT A MECHANIC, I ALSO CAN NOT DRIVE IT, VERY DANGEROUS. I GOT ONLINE AND OTHER PEOPLE ARE HAVING THE SAME TROUBLE AND HAVE LABELED IT THE FORD DEATH WOBBLE. I TOOK IT TO A MECHANIC ON 12.14.11 WERE IT IS STILL AT AND ON THAT SAME DAY I RECEIVED A NOTICE FROM FORD THAT THERE MIGHT BE A RECALL SOON DUE TO EXCESSIVE SHAKING AND  TO CHECK TIRE PRESSURE. FRONT END ALIGNMENT, TIRE SIZE ETC. THIS NEEDS IMMEDIATE ATTENTION, ON THE INTERNET BACK IN 2007 THEY HAD AT LEAST 61 COMPLAINTS. WHATEVER IS CAUSING THIS NEEDS TO BE FIXED ASAP BEFORE SOMEONE LOSES CONTROL AND SERIOUSLY HURTS SOMEONE OR THEMSELVES.  *TR",
        "vin": "1FTWW31P75E"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/09/2011",
        "dateOfIncident": "11/25/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10439128,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION FLUID WAS LEAKING OUT FROM UNDER TRUCK AFTER I STARTED IT TO LET WARM UP. HAD IT TOWED TO THE GARAGE ONLY TO FIND OUT THAT A SNAP RING INSIDE THE TRANSMISSION HAD WORN A HOLE IN THE TRANSMISSION CASING. THIS COULD HAVE BEEN REAL BAD IF I HAD NOT LET THE TRUCK WARM UP AS I LIVE ON A HILL AND THE TRANSMISSION FLUID WAS COMING OUT SO FAST I AM SURE THE ROAD WOULD HAVE BEEN COVERED. I CHECK TO SEE IF FORD HAD RECALLED THIS PROBLEM BUT THEY DID NOT, EVEN AS THERE ARE MANY COMPLAINTS ON THE FORD FORUM WEBSITE. ALL I CAN SAY IS THERE WILL NOT BE ANOTHER FORD IN MY LIFE AFTER I REPLACE THIS TRUCK.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/08/2011",
        "dateOfIncident": "07/21/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10439094,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING STRAIGHT ON A HIGHWAY AT 55 MPH WHEN AFTER HITTING A SMALL BUMP IN THE ROAD THE FRONT TIRES SHOOK UNCONTROLLABLY. THIS CAUSED THE TRUCK TO SHIFT LANES AND NEARLY HIT ANOTHER CAR. THE SHAKING WOULDN'T STOP UNTIL THE TRUCK SLOWED DOWN. TOOK 2 HAND STRUGGLING WITH THE STEERING WHEEL TO KEEP THE TRUCK UNDER CONTROL.  THIS HAS HAPPENED NUMEROUS TIMES AND IS EXTREMELY DANGEROUS. TODAY THE TRUCK IS STILL TOTALLY STOCK WITH 33500 MILES.  PLEASE HAVE FORD ISSUE A RECALL! *TR",
        "vin": "1FTWX31535E"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/07/2011",
        "dateOfIncident": "12/04/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10438837,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "SEVERE SHIMMY WHEN TRUCK WAS NEW. FORD REFUSES TO FIX SAYS THERE IS NO PROBLEM . CAN NOT DRIVE ON HIGHWAY OVER 45 MPH .THEY NEED VIBRATION DAMPER ON FRONT END.  *TR",
        "vin": "1FDWF37YX5E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/30/2011",
        "dateOfIncident": "11/24/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10437906,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE APPROACHING A STOP LIGHT AFTER DOING 60MPH ON THE HIGHWAY, VEHICLE SHUT ITSELF DOWN CAUSING LOSS OF CONTROL AND BRAKING SYSTEM. I WAS ABLE TO BRING VEHICLE TO SAFE AND COMPLETE STOP WHICH CAUSED A TRAFFIC JAM.  *KB",
        "vin": "1FTWW31P75E"
    },
    {
        "components": "STEERING,SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/03/2011",
        "dateOfIncident": "10/28/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10428263,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "LOST FAN BELT TRAVELING 65/MPH THEREBY LOST ALL STEERING AND BRAKES .WAS ON  SECONDARY HIGHWAY  COASTED INTO A SMALL TOWN  AND USED MY EMERGENCY BRAKE TO STOP.  MY WIFE PANICKED JUST LUCKY I WAS DRIVING ,HAVING BEEN A MECHANIC FOR 35 YEARS HAD ENOUGH SENSE TO NOT PANIC AND USE EMERGENCY BRAKE TO STOP.  *TR",
        "vin": "1FTWW31P45E"
    },
    {
        "components": "STEERING,SUSPENSION,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/13/2011",
        "dateOfIncident": "09/01/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10425009,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 FORD F-350. LETTER ON BEHALF OF REGARDING HER CONCERNS WITH FORD MOTOR COMPANY BEING HELD ACCOUNTABLE FOR THEIR DEFECTIVE 6.0 LITER DIESEL ENGINE VEHICLE; REPLY ATTN: KIM CORDELL/BLOUNTVILLE, TN OFFICE *TGW  THE CONSUMER STATED THE TURBO WAS REPLACED FOUR TIMES. SHE ALSO STATED FORD HAS IGNORED THE FRONT END AND STEERING PROBLEMS AS WELL. *JB",
        "vin": ""
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/08/2011",
        "dateOfIncident": "05/08/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10424388,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT HIGHWAY SPEEDS, BUMPS IN THE ROAD SURFACE CAUSE A VIOLENT SHIMMY. TRUCK HAS STOCK SUSPENSION AND OEM TIRES. TIRE PRESSURE IS PER FORD SPECIFICATION (AS INDICATED ON THE DOOR PILLAR).  SEEMS NTSB HAS INVESTIGATED AND DETERMINED THE ISSUE IS DUE TO SUSPENSION MODIFICATIONS OR LOW TIRE PRESSURE. THIS IS NOT THE CASE WITH THIS TRUCK. ALL STOCK AND DEADLY. NTSB NEEDS TO REOPEN THEIR INVESTIGATION BEFORE SOMEONE IS INJURED OR KILLED. *TR",
        "vin": "1FTWW31P85E"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/30/2011",
        "dateOfIncident": "05/28/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10422634,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 FORD F350. THE CONTACT STATED THAT THE STEERING WHEEL WOULD SHAKE VIOLENTLY. THE VEHICLE WAS TAKEN TO A MECHANIC WHO AS UNABLE TO DIAGNOSE THE FAILURE. THE VEHICLE WAS THEN TAKEN TO THE DEALER WHO ALSO COULD NOT DIAGNOSE THE FAILURE. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 24,000.",
        "vin": "1FTWW31PX5E"
    },
    {
        "components": "PARKING BRAKE",
        "crash": false,
        "dateComplaintFiled": "08/23/2011",
        "dateOfIncident": "07/04/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10421092,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "OCCURRING SINCE VEHICLE PURCHASED NEW ON JULY 9, 2005 WITH SIX YEAR EXTENDED WARRANTY.  THE FAILURE IS THAT THE PARKING BRAKE DOES NOT WORK PROPERLY DESPITE REPEATED ATTEMPTS BY TWO DEALERS TO AS THEY SAY \"ADJUST\" IT.  THE BRAKE WORKS AND ACTUATES 1-2 TIMES OUT OF 10 AND DOES NOT WORK IN REVERSE EVER.  DEALER TOLD ME IT IS NOT DESIGNED TO WORK IN REVERSE AT ALL AND WILL NOT HOLD IN REVERSE.  THE DEALERS SEE NO DEFECT AND HAVE NEVER REPLACED ANY PARTS.  THE BRAKE LINING IS IN EXCELLENT CONDITION.  DUE TO THIS SITUATION I SUSPECT IT IS SIMPLY A MANUFACTURER DEFECT OR DESIGN FLAW WITH SERIOUS SAFETY IMPLICATIONS IF THE TRANSMISSION PARK PIN FAILED.  *TR",
        "vin": "1FTWW31P05E"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/29/2011",
        "dateOfIncident": "07/20/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10416280,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "CONTINENTAL",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 FORD F-350 WITH CONTINENTAL TIRES, TIRE LINE SIZE 275/70/18. THE CONTACT STATED THAT WHILE DRIVING 50 MPH, HE HEARD A LOUD NOISE AND THE VEHICLE STARTED JERKING VIOLENTLY. THE CONTACT NOTICED THAT THE PASSENGER SIDE REAR TIRE SIDEWALL WAS PEELING OFF. THE VEHICLE WAS TAKEN TO A LOCAL MECHANIC WHO DIAGNOSED THAT ALL FOUR TIRES NEEDED TO BE REPLACED BECAUSE THE SIDEWALL WAS CRACKED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE TIRES WERE REPLACED. THE DOT NUMBER WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 24,000 AND THE CURRENT MILEAGE WAS 26,000.   UPDATED 8/30/11 *CN  THE CONSUMER STATED THE TIRES WERE INSPECTED AND IT WAS DETERMINED THEY WERE FAULTY. UPDATED 09/26/11",
        "vin": "1FTWW31P95E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "07/14/2011",
        "dateOfIncident": "06/14/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10412284,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 FORD F-350. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS THE VEHICLE WOULD EITHER STALL OR DECELERATE TO APPROXIMATELY 5 MPH. THE VEHICLE WAS TOWED TO AN INDEPENDENT REPAIR SHOP WHERE THEY WERE UNABLE TO DIAGNOSE THE FAILURE. AN INDEPENDENT MECHANIC THEN EXAMINED THE VEHICLE AND NOTICED THAT THERE WERE SILVER FLAKES SETTLING IN THE FUEL FILTER. THE INDEPENDENT REPAIR SHOP WAS THEN NOTIFIED AND THE CONTACT WAS INFORMED THAT THE SILVER FLAKES WERE A RESULT OF THE DELAMINATION OF THE FUEL TANK. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND THE CONTACT WAS INFORMED THAT DIESEL FUEL WAS CAUSING THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "1FDWF37P25E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "04/30/2011",
        "dateOfIncident": "04/30/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10398376,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 F350 SUPERDUTY POWERSTROKE 6.0 DIESEL WITH 53,000 MILES CONTINUED TO ACCELERATE WITHOUT OPERATOR CONTROL NEARLY CAUSING REAR-END COLLISION WHILE DRIVING. OPERATOR COMPLETED A TURN AND ACCELERATED TO THE SPEED LIMIT AND WHEN OPERATOR RELEASED THE THROTTLE THE VEHICLE \"TOOK OFF\" AS IF THE ACCELERATOR HAD BEEN DEPRESSED AGAIN.   OPERATOR CAME CLOSE TO REAR ENDING A PASSENGER CAR IN FRONT OF THE OPERATOR SO THE OPERATOR IMMEDIATELY APPLIED BRAKES AND PULLED OUT OF TRAFFIC WHILE TRUCK CONTINUED ATTEMPT TO ACELERATE. WHILE TRUCK WAS REVING AT HIGH RPM OPERATOR PUT VEHICLE IN \"PARK\" POSITION AND TURNED KEY TO OFF SHUTTING DOWN ENGINE COMPLETLY. ENGINE RESTARTED AND CONTINUE TO OPERATE NORMALLY AND CONTACTED AND DELIVERED VEHICLE TO THE SERVICING FORD DEALERSHIP.   OPERATOR STATES THAT THE VEHICLE HAD PRIOR \"FAILURE TO SHUT DOWN\" AND \"FAILURE TO DECEL\" ISSUES BUT NO \"DIAGNOSTIC CODE\" WAS ESTABLISHED FOR DEALER TO USE AS WITH POSSIBLE CURRENT EVENT.  *TR",
        "vin": "1FTWW31P45E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "04/18/2011",
        "dateOfIncident": "02/15/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10396604,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2005 FORD F-350 WITH A POWERSTOKE. IT ONLY HAS ABOUT 100,XXX MILES ON IT BUT THE FUEL TANK DELAMINATED  AND CAUSED FIVE INJECTORS TO GO BAD THIS IS A SAFETY CONCERN. NOT TO MENTION A COSTLY FIX AND FORD CANT EVEN FILL THE TANK ORDERS ITS BEEN ON BACK ORDER FOR 6 WEEKS. THIS SHOULDN'T HAPPEN ON A TRUCK THAT IS ONLY 5 YEARS OLD.  *TR",
        "vin": "1FDWF36P45E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "03/28/2011",
        "dateOfIncident": "12/15/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10393114,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 FORD F-350 DIESEL. THE CONTACT WAS DRIVING APPROXIMATELY 45 MPH WHEN THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WOULD NOT RESTART DESPITE THE ATTEMPTS OF THE CONTACT AND WAS TOWED TO AN AUTHORIZED DEALER. THE DEALER STATED THE FUEL TANK WAS DELAMINATED AND THE INTERIOR PAINT HAD CLOGGED THE ENGINE. THE DEALER REPLACED THE FUEL TANK, FUEL FILTERS AND SEVERAL FUEL INJECTORS DECEMBER 2007. THE FAILURE RECURRED MARCH 2011 AND THE VEHICLE WAS TOWED TO THE DEALER WHERE THE CONTACT WAS ADVISED THAT THE FUEL TANK WAS RUSTED FROM THE INSIDE OUT AND THE FUEL TANK, FUEL PUMP, FUEL FILTERS, FUEL INJECTORS,  AND EGR VALVE WERE REPLACED AT A COST OF $4,200. THE CONTACT THEN CONTACTED THE MANUFACTURER AND FILED A COMPLAINT REGARDING THE FAILURE BUT NO FURTHER ASSISTANCE WAS OFFERED. THE FAILURE MILEAGE WAS 24,000 AND THE CURRENT MILEAGE WAS 46,000.  UPDATED 06/01/11*LJ  UPDATED 06/02/11",
        "vin": "1FDWF37P05E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/04/2011",
        "dateOfIncident": "02/20/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10388628,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "ISSUE 1 - FUEL SPILLING OUT OF COOLANT SYSTEM. FUEL SPILLING ONTO EXHAUST COMPONENTS AND COATING ENGINE AND UNDERSIDE OF VEHICLE. CREATED A FIRE HAZARD. CREATED AN ENVIRONMENTAL HAZARD. THIS COULD HAVE RESULTED IN SEVERE INJURY OR DEATH IF A FIRE HAD STARTED.",
        "vin": "1FTWW32P05E"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/10/2011",
        "dateOfIncident": "01/06/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10375484,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 FORD F-350. THE CONTACT STATED THAT THE FUEL TANK ON THE VEHICLE WAS ERODING AND CAUSING THE VEHICLE TO LOOSE POWER INTERMITTENTLY WITHOUT WARNING. THE CONTACT TOOK THE VEHICLE TO THE DEALER AND WAS INFORMED THAT THE FUEL TANK WOULD NEED TO BE REPLACED IN ORDER TO CORRECT THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGE WAS 55,000.",
        "vin": "1FDWF37P05E"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/10/2011",
        "dateOfIncident": "09/30/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10377298,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I'M DRIVING AT SPEEDS  OF 65 TO 70 AND GO OVER A BUMP IN ROAD THE STEERING WHEEL SHAKES OUT OF CONTROL. I HAD BROUGHT IT BACK TO DEALER TO HAVE SERVICED  AND THEY TOLD ME \"THERE IS NO PROBLEM, THAT'S WHAT YOU GET FROM A HEAVY DUTY TRUCK.\" WHAT A LOAD OF CRAP! I HAVE PAPER WORK DOCUMENTING THE TRUCK WENT TO DEALER FOR STEERING OUT OF CONTROL.  SINCE THEN THE SHAKING HAS CAUSED ME TO REPLACE BALL JOINTS AND OTHER PARTS TRYING TO STOP THE PROBLEM. THIS SHOULDN'T HAPPEN ON NEW VEHICLE, MUCH LESS ONE THAT COSTS $45.000.  THIS REALLY MAKES ME MAD.",
        "vin": "1FTWX31P25E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/17/2010",
        "dateOfIncident": "11/17/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10366617,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 FORD F-350. THE CONTACT STATED THAT WHILE DRIVING 15 MPH, FOUR FUEL INJECTORS MALFUNCTIONED WHICH CAUSED THE EXHAUST TO EMIT SMOKE AND THE VEHICLE TO STALL. THE VEHICLE WAS TAKEN TO A LOCAL REPAIR SHOP WHERE THE RADIATOR WAS REPLACED. THE CONTACT CALLED THE MANUFACTURER WHO OFFERED NO ASSISTANCE. THE FAILURE MILEAGE WAS APPROXIMATELY 83,000.",
        "vin": "1FTWW31P45E"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/16/2010",
        "dateOfIncident": "11/15/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10366399,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2005 F350 WITH A 4 INCH LIFT. I HAVE EXPERIENCED THE \"FORD DEATH  WOBBLE\" 4 TIMES IN THE LAST WEEK.  3 TIMES IT WAS @ ~40 MPH AND 1  TIME IT WAS AT 75.  SCARED ME TO DEATH.  MY BRAKES DON'T WORK WHEN  IT HAPPENS AND I HAVE TO COAST TO GET IT TO STOP. I HAD THE SHOCKS REPLACED (72K ON TRUCK) SO THE 1ST SHOP I WENT TO TOLD ME THAT WOULD FIX IT.  NO SUCH LUCK... I PICKED IT UP AND RIGHT AFTER IT DID IT AGAIN.  I JUST TOOK IT TO A COMPANY WHO WANTS $700 TO REPLACE THE PITMAN ARM AND GEAR BOX.  I HAVE NOT DONE THIS YET. THEN I HAD A LOCAL 4X4 GUY TELL ME THAT I NEED TO REPLACE THE STEERING STABILIZER SHOCK AND PUT A 2ND ONE ON IT.  I HAVE ALREADY SPENT $500 ON SHOCKS.  THE STABILIZERS WILL BE $150.  NO ONE HAS A CLEAR ANSWER OF WHAT THE ISSUE IS BUT THEY WANT ME TO KEEP SPENDING $ ON TRYING TO FIGURE IT OUT. I TALKED TO FORD AND THEY SEEM TO BE LIKE I HAVE NO IDEA WHAT I AM TALKING ABOUT. THERE IS A GUY ONLINE WHO SELLS AN AFTERMARKET STABILIZER SYSTEM FOR ~$900 BUT I THINK FORD SHOULD FIX IT THIS PROBLEM SINCE ITS A DESIGN ISSUE. PLEASE HELP ME.  I DON'T HAVE A LOT OF MONEY TO KEEP TROUBLESHOOTING THIS. FORD SHOULD BE HELD RESPONSIBLE. THEY SAY THERE IS NO RECALL ON THIS ISSUE BUT IF YOU GO OUT ON THE WEB, MANY OTHER OWNERS OF MY TRUCK AND THE YEARS AND MODELS AROUND IT ARE DESCRIBING THE SAME ISSUE.  I AM SCARED TO DRIVE IT. THE SHAKING IS EXTREMELY VIOLENT AND I AM LUCKY THAT THE TRUCK HAS BEEN ON A STRAIGHTAWAY WITH NO CARS AROUND ME EACH TIME ITS HAPPENED....OTHERWISE I COULD HAVE FLIPPED IT AND KILLED MYSELF OR SOMEONE ELSE OR SOMEONE DEAR TO YOU... PLEASE LOOK INTO THIS AND SEE THE STORIES ON THE WEB ABOUT PEOPLE WHO HAVE INJURED THEMSELVES AND OTHERS DUE TO THIS PROBLEM. SOMETHING HAS TO BE DONE. *TR",
        "vin": "1FTWW31PX5E"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/13/2010",
        "dateOfIncident": "10/01/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10360309,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 FORD F-350. WHILE STOPPED WITH HER FOOT ON THE BRAKE PEDAL THE VEHICLE ATTEMPTED TO SURGE FORWARD. THE RPMS INCREASED EXCESSIVELY AND SHE HAD TO APPLY EXTREME PRESSURE TO THE BRAKE PEDAL IN ORDER TO STOP THE VEHICLE FROM SURGING FORWARD. THE FAILURE ALSO OCCURRED INTERMITTENTLY WHILE DRIVING THE VEHICLE.  THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHERE SHE WAS INFORMED THAT THE EGR COOLER NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGES WERE 39,000.",
        "vin": "1FTWX31P15E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/08/2010",
        "dateOfIncident": "08/23/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10354484,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 FORD F-350. WHILE TRAVELING 15 MPH THE CONTACT NOTICED THAT THE ENGINE HAD BEGAN TO RUN HOT AND WAS MAKING A WHINING NOISE. THE VEHICLE WAS TAKEN TO THE DEALERSHIP WHERE THE HEAD GASKET AND EGR COOLER HAD TO BE REPLACED. THERE WERE NO PRIOR WARNINGS. THE CURRENT AND FAILURE MILEAGES WERE 60000.",
        "vin": "1FTWW31P35E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/20/2010",
        "dateOfIncident": "07/24/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10350748,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 FORD F350.  THE CONTACT STATED THAT THE EGR OIL COOLER FAILED AND NEEDED REPLACING.  THE MANUFACTURER WOULD NOT PROVIDE ANY ASSISTANCE DUE TO THE VEHICLE BEING OUTSIDE OF FACTORY WARRANTY. THE VEHICLE WAS NOT BEEN REPAIRED. THE VIN WAS NOT AVAILABLE. THE FAILURE AND CURRENT MILEAGE WAS 80,000.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/12/2010",
        "dateOfIncident": "06/25/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10342642,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 FORD F-350. WHILE DRIVING 40 MPH, THE  CONTACT NOTICED THE SMELL OF COOLANT INSIDE THE VEHICLE. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THE EGR OIL COOLER WAS REPLACED. THERE WERE NO PRIOR WARNINGS. THE CURRENT AND FAILURE MILEAGES WERE 81,000.   UPDATED 9/13/10 *CN  UPDATED 09/27/10",
        "vin": "1FTWW31P05E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "04/07/2010",
        "dateOfIncident": "03/24/2010",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10324373,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 FORD F-350. THE CONTACT WAS DRIVING APPROXIMATELY 60 MPH, THE DIESEL ENGINE OVERHEATED WITH SMOKE COMING FROM THE EXHAUST PIPE. THE VEHICLE WAS DRIVEN TO THE SIDE OF THE ROAD. THE ENGINE WAS TURNED OFF, AND RESTARTED AFTER WAITING UNTIL THE ENGINE COOLED DOWN. THE VEHICLE RESUMED OPERATION. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC FOR DIAGNOSTIC TESTING. THE FAILURE WAS CONTRIBUTED TO THE OIL COOLER AND EXHAUST GAS RECIRCULATION (EGR). THE VEHICLE WAS REPAIRED. THE   MECHANIC ADVISED REPLACEMENT OF THE OIL PUMP AND FUEL INJECTORS. THE FAILURE MILEAGE WAS 160,000. THE CURRENT MILEAGE WAS 160,200.",
        "vin": "1FTWW31PX5E"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/06/2010",
        "dateOfIncident": "01/08/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10298418,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 FORD F-350 SD.  THE CONTACT STATED THAT WHILE DRIVING 55 MPH OVER A BUMP, THE FRONT END OF THE VEHICLE WOULD SHAKE VIOLENTLY.  THE CONTACT ASKED THE DEALER ABOUT THE FRONT END SHAKE AND THE DEALER STATED THEY'VE NEVER HEARD OF THIS ISSUE.  TWO OTHER DEALERS INFORMED THE CONTACT THAT VEHICLE NEEDED TO HAVE THE TIRES REPLACED.  THE CONTACT REPLACED THE TIRES AND THE VIOLENT SHAKING STILL OCCURRED WHENEVER THE CONTACT DROVE OVER A BUMP AT HIGHWAY SPEEDS. THE FAILURE MILEAGE WAS 19,000.",
        "vin": "1FTWW31P95E"
    },
    {
        "components": "PARKING BRAKE",
        "crash": false,
        "dateComplaintFiled": "01/04/2010",
        "dateOfIncident": "09/04/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10297984,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 FORD F-350. WHILE DRIVING APPROXIMATELY 35 MPH, THE REAR DRIVER SIDE TIRE SUDDENLY LOCKED WHICH CAUSED THE VEHICLES REAR END TO SLIDE; HOWEVER, THE CONTACT WAS ABLE TO CONTROL THE VEHICLE AND AVOID A CRASH. THE DEALER STATED THAT THE PARKING BRAKE ASSEMBLY NEEDED TO BE REPLACED. THE CONTACT PREVIOUSLY NOTICED THAT THE PARKING BRAKE INTERMITTENTLY FAILED TO FUNCTION PROPERLY. THE CURRENT AND FAILURE MILEAGES WERE 59,000.",
        "vin": "1FTWW31P15E"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/23/2009",
        "dateOfIncident": "09/22/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10284981,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005  F350 DIESEL DUALLY     THIS VEHICLE NEEDS TO BE RECALLED!  THE LETTER THAT FORD SENT TO OWNERS IS NOT ACCURATE!  IT IS NOT THE TIRE PRESSURE OF THE VEHICLE CAUSING THE SEVERE SHAKE!  MY WHOLE TRUCK SHOOK PROFUSELY!  IT WAS QUITE SCARY.  AT POSTED HIGHWAY SPEED LIMITS IF THERE IS A SLIGHT BUMP IN ROAD YOU CAN BE SLOWING DOWN AN HIT A BUMP AND TRUCK BEGINS TO SHAKE OR GOING A AROUND A CURVE ON THE HIGHWAY AT 65MPH AND IF THERE IS A BUMP IN THE ROAD ON THE CURVE THE ENTIRE TRUCK SHAKES PROFUSELY.   RECEIVED A LETTER FROM FORD STATING IT WAS TIRE PRESSURE BUT MY TIRE PRESSURE IS PERFECT.  THIS IS A DEFECT THAT NEEDS TO BE RECALLED IMMEDIATELY STEERING BOX ROCKER ARM TIRE ROD SOMETHING BUT THIS TRUCK IS NOT RIGHT. I HAUL A 40FT TRAILER AND IF I HAD BEEN HAULING IT I WOULD BE DEAD ALONG WITH SEVERAL OTHER CARS I WOULD WIPED OUT    PLEASE GET THIS VEHICLE RECALLED FOR SAFETY OF THE CONSUMER IT IS DEFINITELY NOT THE PROBLEM THAT FORD CLAIMS AT THIS POINT.  MY TRUCK NEEDS TO BE REPAIRED AT THE COST OF FORD AND THIS DEFECT NEEDS TO BE RECALLED!    PLEASE TAKE THIS COMPLAINT SERIOUSLY.  SOMEONE WILL BE KILLED LIKE THIS. *TR",
        "vin": "1FTWW33P35E"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "09/18/2009",
        "dateOfIncident": "09/12/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10284483,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A FORD F350 HEAVY DUTY 1 TON, I HAD EXPERIENCED ON SEPARATE OCCASIONS WHEN TRAVELING WITH SPEED AROUND 50-65 MPH, IF A BUMP (SLIGHT) DIP OR ANY SLIGHT VARIANCE IN ROAD MY TRUCK WILL BEGIN A VIOLENT SHAKE.  I HAD RECEIVED THE RECALL NOTICE OF IMPROPER AIR PRESSURE AND CAUSE AND EFFECT. I HAVE HAD MY TIRE PRESSURE CHECKED ON NUMEROUS OCCASIONS, I HAVE ALSO HAD TAKEN MY TRUCK TO LOCAL DEALERSHIP TO CHECK FRONT SUSPENSION , NOTHING FOUND TO BE WRONG WITH FRONT END. (SUSPENSION). ON SEPT. 12, 09 I WAS TRAVELING ON HWY 199 COMING FROM MADILL, OK (JOB) COMING TOWARDS DURANT  HAVING EMPLOYEE IN TRUCK (FRONT PASSENGER SEAT) MY TRUCK BEGAN TO VIOLENTLY SHAKE, THROWING MY TRUCK INTO A CONCRETE BRIDGE. I STEERED TRUCK THE BEST I COULD CONSIDERING THE TRUCK WAS UNCONTROLLABLE. THE REAR END OF THE TRUCK CLIMBED OVER THE BRIDGE THROWING THE TRUCK NEARLY ON ITS SIDE LANDING IN ONCOMING TRAFFIC FACING OPPOSITE DIRECTION OF TRAVEL  60FT. AWAY FROM BRIDGE. MY TRUCK APPEARS TO BE TOTALED. I OWE MORE THAN THE VALUE OF THE TRUCK AND NOW. MY EMPLOYEE AND MYSELF WERE TREATED TO LOCAL HOSPITAL I NOW HAVE A HERNIA FROM THE IMPACT OF THE TRUCK INTO THE BRIDGE.. DUE TO SUSPENSION. I HAD TOLD OFFICER THAT THE TRUCK HAD DONE THIS BEFORE I HAVE RECEIVED A TICKET FOR NOT MAINTAINING SAFE VEHICLE. MY INSURANCE DOES NOT COVER MY PERSONAL INJURIES. I FEEL LIKE FORD HAS NOT OWN UP TO DEFECT OF THE TRUCK SUSPENSION. MAYBE DOT SHOULD INVESTIGATE FORD AGAIN. *TR",
        "vin": "1FTWW33P65E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "05/27/2009",
        "dateOfIncident": "05/08/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10270136,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2009 F-350 SUPER DUTY POWER STROKE DIESEL 6.0L. AT APPROX. 30,000 MILES THE TRUCK WOULD HAVE EPISODES OF RUNNING ROUGH MAYBE ONCE EVERY 50MILES. I BROUGHT IT TO MY MECHANIC WHO REPLACED THE FUEL FILTERS AND THOUGHT I MIGHT HAVE GOTTEN SOME BAD DIESEL. LESS THAN 1,000 MILES LATER THE TRUCK RAN MUCH WORSE . IT WOULD BEGIN RUNNING ROUGH , LOSING POWER AND SOMETIMES STALL. ONCE IT OCCURED AS I WAS PULLING ON TO A FAST MOVING HIGHWAY AND I ALMOST CAUSED AN ACCIDENT BACAUSE I COULD NOT ACCELERATE. THESE EPISODES WOULD OCCUR ONCE EVERY TEN MILES AND VERY QUICKLY STARTED OCCURING EVERY MILE. TO MAKE A LONG AND EXPENSIVE STORY SHORT THE PROTECTIVE COATING ON THE INSIDE OF THE FUEL TANK WAS PEELING OFF AND CLOGGING FUEL DELIVERY. THIS PROBLEM IS EXTREMELY COMMON I HAVE COME TO FIND OUT . MY TRUCK WAS JUST PAST ITS WARRANTY PERIOD SO I HAD NO CHOICE BUT TO PURCHASE ANOTHER TANK FROM FORD WITH NO ASSURANCE IT WON'T HAPPEN AGAIN. THIS IS CLEARLY POOR AND DEFECTIVE CRAFTSMANSHIP AND DANGEROUS. *TR",
        "vin": "1FDWF37P65E"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/22/2009",
        "dateOfIncident": "04/12/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10266374,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*- THE CONTACT OWNS A 2005 FORD F-350. WHILE DRIVING AT 25-30 MPH THE VEHICLE LOST POWER. THE CONTACT HAD THE VEHICLE TOWED TO THE DEALERSHIP AND THE DEALERSHIP REMEDIED THE ISSUE BY REPLACING THE HIGH PRESSURE CUP LINK ON THE INJECTOR ACTIVATION SYSTEM. THE CONTACT FOUND NUMEROUS COMPLAINTS ONLINE ABOUT THE FUEL SYSTEM ON THIS YEAR MAKE AND MODEL VEHICLE.  THE CONTACT FEELS THIS WAS A MAJOR SAFETY ISSUE BECAUSE THE VEHICLE COULD CRASH INTO ANOTHER VEHICLE IF ALL THE POWER IS LOST. THE CURRENT MILEAGE WAS 112,000 AND FAILURE 99,000.",
        "vin": "1FTWX31P85E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/30/2009",
        "dateOfIncident": "03/23/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10263665,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 FORD F-350.  WHILE DRIVING BETWEEN 50-55 MPH, THE VEHICLE SHUT OFF COMPLETELY AND THE POWER STEERING AND BRAKES FAILED.  THE CONTACT STATED THAT FORD SHOULD PAY FOR THE REPAIRS BECAUSE THE FAILURE WAS A MAJOR SAFETY ISSUE.  THE VEHICLE WAS NOT INCLUDED IN ANY RECALLS.  THE CURRENT AND FAILURE MILEAGES WERE 194,947.",
        "vin": "1FTWW31P95E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "01/22/2009",
        "dateOfIncident": "01/20/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10256748,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DIESEL FUEL TANK DE-LAMINATING CAUSING ENGINE PROBLEMS.  *NJ",
        "vin": "1FDWX35PX5E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/20/2009",
        "dateOfIncident": "01/04/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10255769,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 FORD F-350.  THE CONTACT STATED THAT THE FUEL INJECTION MODULE AND RELAY SWITCH FAILED.  THE VEHICLE WOULD NOT DRIVE MORE THAN 10 MPH WITHOUT BLACK SMOKE COMING FROM THE EXHAUST.  THE CONTACT REPAIRED THE VEHICLE.  THE VEHICLE HAD A HIGH PRESSURE OIL LEAK, WHICH LED TO THE FAILURE OF THE RELAY SWITCH THIS REPAIR WAS RESOLVED UNDER WARRANTY.  THE FUEL INJECTORS WERE ALSO FAULTY AND WERE REPAIRED UNDER WARRANTY THREE TIMES. A MECHANIC STATED THAT THE FAILURES WOULD CONTINUE. .  THE CONTACT IS CONCERNED ABOUT THE SAFETY OF HER VEHICLE.  THE CURRENT AND FAILURE MILEAGES WERE 99,970.",
        "vin": "1FTWX31P15E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/23/2008",
        "dateOfIncident": "12/22/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10252699,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE ON I-95, MY 2005 F-350 SUPER-DUTY SPUTTER AND LOST POWER. THE TRUCK WENT FROM 60MPH WITH FLOW OF TRAFFIC TO 40MPH IN SECONDS. MAKING EVASIVE MEASURE FROM GETTING TAG FROM BEHIND, I WAS FORCED TO THE SHOULDER OF THE ROAD WHICH WAS TAKING UP BY SNOW. THE TRUCK CRAWLED HALF ON SHOULDER AND HALF IN THE RIGHT LANE WHILE CARS MADE THERE EVASIVE ACTION IN ORDER TO MISS ME. AFTER GETTING TO A PLACE TO PULL OFF THE HIGHWAY IT TOOK ABOUT 5-10MIN FOR IT TO CLEAR UP. THE DEALER INFORMED ME THAT THE FUEL TANK WAS DETERIORATING AND PROCEEDED TO ASK ME ABOUT MY FUEL AND WERE I GET IT, BECAUSE IT MUST BE CONTAMINATED. I ALSO OWN THREE OTHER DIESEL TRUCKS A 1995, 1996 AND 2000 AND THEY ALL RUN ON THE SAME FUEL FROM THE SAME GAS STATION. BUT YET ALL THESE TANKS ARE FIND. THE DEALER WANTS TO REPLACE THIS TANK AT MY COST WITH A NEW ONE. AFTER READING ALL THE COMPLAINTS ON OTHER WEB SITES, THIS PROBLEM WILL UNMASK IT SELF AGAIN DOWN THE ROAD. AT THIS TIME I WILL PROBABLY BRING THE TRUCK HOME UNTIL I CAN COME UP WITH A SOLUTION. *TR",
        "vin": "1FDSX35P05E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/15/2008",
        "dateOfIncident": "08/01/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10251807,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 FORD F350.  THE MOTOR IN THE VEHICLE CONSTANTLY FAILS.  WHILE TOWING A FIFTH WHEEL AT APPROXIMATELY 65 MPH, THE TURBO CHARGER BLEW OUT.  THE DEALER INSTALLED A NEW TURBO CHARGER UNDER WARRANTY.  APPROXIMATELY THREE MONTHS LATER, THE FAILURE RECURRED AND THE MOTOR OVERHEATED WHILE DRIVING APPROXIMATELY 65 MPH.  THE VEHICLE WAS TOWED TO A LOCAL DEALER AND THEY TESTED THE MOTOR AND REPLACED TWO HEADS, THE OIL COOLER, AND THE EGR VALVE.  THE MECHANIC ADVISED HIM TO NOT USE STRETCH VOLTS TO PREVENT THE FAILURE AGAIN.  THE CONTACT WAS INFORMED THAT NON STRETCH VOLTS WOULD INCREASE THE CHANCES OF THE FAILURE NOT RECURRING BECAUSE IT WAS A BETTER PRODUCT THAN WHAT THE MANUFACTURER USED.  THE CONTACT DID NOT WANT TO PAY ADDITIONAL MONEY FOR AN AFTERMARKET PRODUCT BECAUSE HE BELIEVED THAT THE PRODUCTS USED BY THE MANUFACTURER SHOULD WORK PROPERLY.  AFTER THE REPAIRS WERE MADE, THE VEHICLE WORKED WELL FOR LESS THEN A MONTH.  THE VEHICLE IS NOT CURRENTLY WORKING.  HE ATTEMPTED TO TURN ON THE VEHICLE, BUT THERE WAS NO POWER TO THE MOTOR.  THE VEHICLE WILL BE RETURNED TO THE SHOP FOR MORE REPAIRS.  THE CONTACT FEELS THAT THIS IS A MANUFACTURER DEFECT THAT SHOULD BE RECALLED.  THE FAILURE MILEAGE WAS 27,000 AND CURRENT MILEAGE WAS 30,000.",
        "vin": "1FTWW33PX5E"
    },
    {
        "components": "SUSPENSION,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "11/15/2008",
        "dateOfIncident": "07/04/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10248890,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "HASA S.A.",
                "productMake": "SUSPENSION",
                "productModel": "CONTROL ARM",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "ON JULY 4, 2005, I PURCHASED A 2005 FORD F350 SUPER DUTY LARIAT WITH LONG BED AND DUAL WHEELS AND 4WD AT EL CAJON FORD.  FROM THE BEGINNING, THE TRUCK EXPERIENCED SEVERE FRONT-END VIBRATION WHEN I REACHED ABOUT 60 MPH.  IT CONTINUED UNTIL I GOT TO ABOUT 80 MPH.  I COMPLAINED ABOUT THIS PROBLEM FROM THE FIRST VISIT FOR SERVICE AT DOWNEY FORD.  AFTER A FEW VISITS FOR DIAGNOSTICS, DOWNEY FORD INSTALLED A \"DAMPENER\" ON THE FRONT END.  IT MADE THE PROBLEM BETTER, BUT IT DID NOT COMPLETELY CURE THE DEFECT.    I EVENTUALLY BOUGHT A LANCE CAMPER, WHICH WAS ON THE TRUCK FOR OVER A YEAR.  WHILE THE TRUCK HAD THE 3000 LB CAMPER ON IT, THE VIBRATION WENT AWAY ON THE STRAIGHTAWAY, BUT WAS HORRIBLY DANGEROUS ON THE CURVES.  FOR EXAMPLE, ONE SUCH CURVE IS THE 605 SB TO THE 405 SB IN LONG BEACH.  I ALMOST LOST CONTROL OF THE VEHICLE/CAMPER ON THIS CURVE UNLESS I ALMOST STOPPED.    I REMOVED THE CAMPER ABOUT A YEAR AGO AND THE PROBLEM WITH THE TRUCK IS WORSE.  IT NOW WILL VIBRATE UNCONTROLLABLY AT 40-50 MPH.     I REPORTED THIS VIBRATION PROBLEM EVERY TIME I WENT TO THE DEALER FOR SERVICE.  THEY ALWAYS SAID THEY DID ALL THEY COULD WITH THE DAMPENER.    I TOOK THE TRUCK TO EL CAJON FORD ABOUT 3-4 WEEKS AGO.  NOW THAT IT IS OUT OF WARRANTY, FORD NOW SAYS IT CAN FIX THE PROBLEM, BUT IT HAS DAMAGE THE FRONT STEERING MECHANISM.  THE SERVICE WRITER SAID IN A VOICE MAIL THAT DOWNEY PUT ON A DAMPER THAT WAS TOO SMALL FOR MY TRUCK.    I DEMANDED THEY FIX IT FREE AND THEY REFUSE.    I WANT MY TRUCK FIXED.  THIS IS A DESIGN DEFECT, SINCE IT HAS EXISTED FROM DAY 1.  I HAVE READ ON SEVERAL WEBSITES THAT THIS IS A COMMON PROBLEM THAT EXISTED WELL BEFORE 2005, BUT FORD HAS IGNORED THE SAFETY ISSUES.      A HIGH PROBABILITY OF AN ACCIDENT EXISTS WHEN YOUR TRUCK IS VIBRATING AND BOUNCING ACROSS LANES AND YOU CANNOT STEP ON THE BRAKE OR MAKE IT WORSE!    THANK YOU,    ANNETTE GILLIAM *TR",
        "vin": "1FTWW33P45E"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/21/2008",
        "dateOfIncident": "02/11/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10239158,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "LOSS OF CONTROL OF STEERING.  THIS HAS HAPPENED SO MANY TIMES I CAN NOT COUNT.  *TR",
        "vin": "1FTWW33P05E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "08/18/2008",
        "dateOfIncident": "07/18/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10238777,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER OF THE VEHICLE WAS DRIVING ON THE ROAD WHEN IT STARTED TO SLOW DOWN AND WAS LOSING POWER. THE 2005 FORD F350 DIESEL TRUCK STALLED IN TRAFFIC AND WOULD NOT RUN. IT WAS TOWED TO A LOCATION WHERE THE FUEL FILTERS WERE CHANGED. THIS DID NOT CORRECT THE PROBLEM. IT WAS TOWED TO THE FORD DEALER, WHO STATED THAT THE FUEL TANK HAD DELAMINATED AND THE FUEL TANK NEEDED TO BE REPLACED. FORD CLAIMED THAT BIO DIESEL CAUSED THE PROBLEM. BIO DIESEL IS NOT SOLD IN NJ. THE TRUCK NEVER GOES OUT OF STATE. THE STALLING IN TRAFFIC IS A SAFETY HAZARD FOR ALL DRIVERS. THE TRUCK IS ONLY 3 YEARS OLD AND HAS ONLY 25,500 MILES. *TR",
        "vin": "1FDWX37P25E"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/27/2008",
        "dateOfIncident": "10/05/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10235894,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2005 FORD F-350 4X4 DIESEL DUALLY TRUCK. SOON AFTER I BOUGHT THE TRUCK I EXPERIENCED A ROUGH SHIMMY IN THE FRONT END. WHEN I GO OVER BUMPS ON THE FREEWAY OR CITY STREETS THE FRONT END SHIMMY'S OUT OF CONTROL. THE TRUCK HAS BEEN TO THE DEALER ON SEVERAL OCCASIONS AND THEY HAVE TOLD ME THAT NOTHING IS WRONG. THIS IS NOT MY FIRST FULL SIZE TRUCK AND THIS IS THE FIRST ONE THAT ACTS LIKE THIS. SEVERAL TIMES IT HAS SENT ME INTO THE LANES BESIDE ME. I ALSO TOW A FIFTH WHEEL TRAILER AND IT AMPLIFIES THE PROBLEM. THIS PROBLEM OCCURS EVERY TIME I DRIVE THE VEHICLE AND FORD IN NOT RESPONSIVE TO THE PROBLEM.  *TR",
        "vin": "1FTWW33P55E"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/16/2008",
        "dateOfIncident": "05/05/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10231103,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "FORD F350 STEERING SHAKES TO THE POINT OF LOOSING CONTROL AT ABOUT 60 MPH ON ROUGH UNEVEN FREEWAY OR HITTING POT HOLE.  *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "04/22/2008",
        "dateOfIncident": "04/20/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10225370,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE HIGHWAY PULLING A TRAILER MY 2005 F -350 DIESEL QUIT RUNNING AND ALMOST GOT RUN OVER BY A SEMI. AFTER PULLING OFF TO THE SIDE OF THE ROAD AND RESTARTED THE TRUCK IT RAN ROUGH. WAS ABLE TO GET IT BACK TO THE SHOP WITH THE HAZARDS ON. TO FIND OUT FROM THE DEALER THAT THE FUEL TANK IS DELAMINATING WHICH CAUSE DEBRIS TO GET INTO THE FUEL PUMP AND INJECTORS CAUSING IT TO STALL.  FORD HAS KNOW ABOUT THIS PROBLEM AND THEY CHANGE THERE FUEL TANK DESIGN BUT DID NOT INFORM ANY OWNERS OF THIS SAFETY DEFECT THAT COULD HAVE KILLED ME. NOW I AM ALSO LOOKING AT A $3000. REPAIR BILL THAT FORD WILL NOT BACK ME ON. TO REPLACE THE FUEL TANK WITH A NEW SAFE ONE. I AM ALSO LOOKING AT MY OTHER TWO TRUCKS AND WONDER IF THEY ARE SAFE TO DRIVE. I HOPE THAT NO ONE WILL GET KILLED DUE TO THIS LACK OF PUBLIC INFORMATION BY FORD.  *TR",
        "vin": "1FDWF36P25E"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/07/2008",
        "dateOfIncident": "03/06/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10220435,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS A DESIGN ISSUE. THE 2005 FORD F350 HAS A LARGE PART OF ITS REAR BUMPERS' HORIZONTAL SURFACE REMOVED. THE BUMPER IS THEN COVERED IN A HARD PLASTIC. I STEPPED OFF THE DECK OF MY TRUCK ONTO THE BUMPER AND THE PLASTIC SURFACE GAVE WAY. I ALMOST BROKE MY ANKLE AND LOST MY BALANCE  , NOT BECAUSE THE PLASTIC BROKE THROUGH , IT JUST HAD WAY TOO MUCH FLEX IN IT.   I'VE TRIED TO DEAL WITH FORD CO REGARDING THIS BUT AS YOU PROBABLY KNOW ,THEY WANT ZERO TO DO WITH THE RETAIL / POST WHOLESALE APPARATUS. I WAS TOLD TO TALK TO THE DEALER. I WOULD HAVE MORE COMPETENCE AND HONEST FEEDBACK FROM MY DOG.  *TR",
        "vin": "1FTWX31P35E"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/10/2007",
        "dateOfIncident": "12/03/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10211352,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING ON UNEVEN PAVEMENT OR DRIVING OVER CHUCK HOLES AND PARTICULARLY WHEN MANEUVERING TURNS, THE FRONT END \"HOPS\" SEVERELY CAUSING THE DRIVER TO ALMOST LOSE CONTROL AND SKID SIDEWAYS.  *TR",
        "vin": "1FTWF31595E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/03/2007",
        "dateOfIncident": "10/01/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10199163,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 F-350 WITH OVERHEATING PROBLEMS CUSTOMER STATES THAT THE ENGINE WAS REPLACED CUSTOMER WANTS FORD TO PAY FOR REPAIRS**CC  THE CONSUMER STATED HE HAS HAD PROBLEMS WITH THE VEHICLE FROM DAY ONE. IT WAS AT THE DEALERSHIP FOR 25 DAYS FOR AN ENGINE REPLACEMENT. THE ENGINE WAS REPLACED, HOWEVER 90 DAYS LATER THE CONSUMER STARTED TO HAVE PROBLEMS WITH THE REPLACEMENT ENGINE.  THE AIR TAKE TO THE TURBO WOULD BLOW OFF AND LEAVE THE VEHICLE WITH NO POWER, 2 EGR VALVES WERE REPLACED. FINALLY, THE ENGINE LOCKED UP.  THE CONSUMER STATED THERE IS A DESIGN FLAW WHERE THERE IS TOO MUCH HEAT WITH THE TURBO ON TOP OF THE ENGINE. *JB",
        "vin": "1FTWW33P35E"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/20/2007",
        "dateOfIncident": "07/12/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10197033,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 FORD F-350.  THE CONTACT STATED THAT THE VEHICLE VIOLENTLY SHAKES WHILE DRIVING APPROXIMATELY 65 MPH.  HE ALSO STATED THAT THE STEERING WHEEL SHAKES VIOLENTLY.  THE FAILURES OCCUR WHEN THE VEHICLE DRIVES OVER A BUMPY ROAD.  THE CONTACT STATED THAT THE VEHICLE WAS IN THE SHOP APPROXIMATELY A YEAR AGO FOR THIS SAME FAILURE.  THE VEHICLE IS CURRENTLY AT THE DEALER.  THE CURRENT MILEAGE IS 77,000 AND FAILURE MILEAGE WAS 60,000.",
        "vin": "1FTWX315X5E"
    },
    {
        "components": "EQUIPMENT,EQUIPMENT ADAPTIVE/MOBILITY",
        "crash": false,
        "dateComplaintFiled": "03/09/2007",
        "dateOfIncident": "11/10/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10184647,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "ELECTRONIC MOBILITY CONTROLS",
                "productMake": "EMC",
                "productModel": "AEVIT WL",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "TL* - THE CONTACT HAS A AEVIT BY EMC.  THE CONTACT STATED THAT THIS EQUIPMENT WAS USED TO HELP WITH STEERING, BRAKING, AND ACCELERATION.  THE CONTACT WAS JUST GOING DOWN THE ROAD WHEN ALL OF A SUDDEN THE AEVIT SYSTEM  MADE A HARD LEFT AND SENT THE VEHICLE INTO A DITCH.  THE CONTACT HAD TO GET SEVEN STITCHES ON HIS THE RIGHT SIDE OF FOREHEAD.  A POLICE REPORT  WAS TAKEN.  THE WEATHER THAT DAY WAS COLD, BUT CLEAR.  HE WAS DRIVING APPROXIMATELY 25 - 30 MPH.   THERE WAS APPROXIMATELY $7,000  WORTH OF DAMAGE DONE TO  THE  VEHICLE.  THE VEHICLE HAS BEEN REPAIRED, BUT HE HAS NOT DRIVEN THE VEHICLE SINCE.  THE CONTACT NO LONGER HAD THE VEHICLE. *AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/31/2006",
        "dateOfIncident": "12/21/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10172309,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THE VEHICLE'S ENGINE REVVED UP WHEN STARTING UP, AND WHEN PUT INTO FIRST GEAR, THE ENGINE JERKED PROFUSELY.  THE VEHICLE WAS TAKEN TO THE DEALER WHO UPON EXAMINATION COULD NOT DUPLICATE THE PROBLEM.  THE MANUFACTURER WAS CONTACTED, AND DETERMINED THAT THERE WAS NO RECALL ON THIS ISSUE.",
        "vin": "1FTWW32Y05E"
    }
]