[
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/02/2013",
        "dateOfIncident": "10/31/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10550628,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY TRUCK AND IT STARTED TO LOSE POWER LIKE IT WAS RUNNING OUT OF FUEL. THEN ALL OF A SUDDEN THE TRUCK JUST SHUT OFF. I COULDN'T GET THE TRUCK TO RESTART AT ALL. THE TRUCK WAS TOWED TO A GARAGE. WHEN I LOOKED IN TO THE FUEL TANK I FOUND THE INSIDE OF IT WAS PEELING APART. I CHECKED THE FILTER AND THEY BOTH WERE CLOGGED WITH THE LINING OF THE FUEL TANK.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/10/2013",
        "dateOfIncident": "09/21/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10542942,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 FORD F-550. THE CONTACT STATED THAT WHILE DRIVING 55 MPH, THE VEHICLE MISFIRED, HESITATED, AND STALLED WITH THE ILLUMINATION OF THE MAINTENANCE LIGHT. THE FAILURE RECURRED OVER THE COURSE OF 7 YEARS. THE VEHICLE WAS TOWED TO THE DEALER FOR DIAGNOSIS ON SEVERAL OCCASIONS WHERE IT WAS STATED THAT THE INJECTORS, OIL PUMP, INTAKE GASKET, CRANK SHIFT, AND ENGINE NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED BUT THE PROBLEM PERSISTED. THE MANUFACTURER WAS NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 30,000.",
        "vin": "1FDAF56P45E"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/29/2013",
        "dateOfIncident": "05/06/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10514054,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 FORD F-550 SD. THE CONTACT STATED THAT WHILE DRIVING 50 MPH, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS TAKEN TO THE DEALER, WHO STATED THAT THE FAILURE WAS CAUSED BY A CLOGGED FUEL FILTER. THE FUEL TANK COATING PEELED OFF AND OBSTRUCTED THE FUEL FILTER.  THE VEHICLE WAS REPAIRED BY REPLACING THE FUEL TANK AND THE FUEL FILTER. THE FAILURE WAS REPORTED TO THE MANUFACTURER. THE VIN WAS NOT AVAILABLE. THE FAILURE AND CURRENT MILEAGE WAS 40,000.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/20/2013",
        "dateOfIncident": "05/17/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10512883,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 FORD F550 SD. THE CONTACT STATED THAT THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS NOT TAKEN TO THE DEALER NOR WAS THE VEHICLE REPAIRED. THE MANUFACTURER WAS NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 53,000.  *TR",
        "vin": "1FDAW56PX5E"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/23/2012",
        "dateOfIncident": "04/17/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10467066,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 FORD F-550. THE CONTACT STATED THAT WHILE PARKING, THE VEHICLE ACCELERATED ON ITS OWN. THE CONTACT HAD TO APPLY THE BRAKES TO STOP THE VEHICLE. THE VEHICLE WAS NOT TAKEN TO THE DEALER. THE MANUFACTURER WAS CONTACTED AND STATED THAT THEY WERE GOING TO LOOK INTO THE FAILURE. THE FAILURE MILEAGE WAS 115.000 AND THE CURRENT MILEAGE WAS 120,000.",
        "vin": "1FAHP28195G"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/03/2012",
        "dateOfIncident": "09/10/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10446404,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUCK WAS PURCHASED BRAND NEW BY MY COMPANY IN 2005. THIS PROBLEM BEGAN IN 2008. I HAVE RECORDS OF PREVENTATIVE MAINTENANCE BEING DONE PER MANUFACTURER INSTRUCTIONS. I ALSO HAD THE PM DONE AT THE DEALERSHIP. THE CHIEF PROBLEM IS THE ENGINE HAS CONTINUAL POWER ISSUES WHICH INCLUDE STALLING, SHAKING, EXCESS SMOKING. THE ENGINE JUST STOPS RUNNING WHICH IS A HUGE SAFETY RISK WHILE DRIVING IT. SINCE 2008 THIS TRUCK HAS BEEN TO THE DEALERSHIP VIA TOW TRUCK FOR THE SAME CHIEF COMPLAINT AT LEAST 12 TIMES. EACH TIME THE DEALERSHIP WILL WORK ON THE EGR VALVE, THE EGR COOLER, THE OIL COOLER, THE ICP VALVE, INJECTORS, HEAD AND INTAKE GASKETS, THE COMPUTERS SHOOT CODES SUCH PO261, PO264, PO267, PO269, PO270 AND PO273, PO276, PO279, PO280 AND PO611. THIS TRUCKS ENGINE NEEDS RECALLED TO FIND THE MAIN PROBLEM. IT IS NOW 2012 MY TRUCK IS 7 YEARS OLD WITH JUST AT 100,000 MILES. THIS IS A DIESEL ENGINE 6.0 THEY ARE SUPPOSE TO LAST LONGER THAN GASOLINE ENGINES HOWEVER THIS ENGINE HAS MAJOR SAFETY RECURRING PROBLEMS THAT ARE DANGEROUS TO THE PUBLIC HIGHWAY AND THE PEOPLE DRIVING ON IT. IT ALSO HAS COST THOUSANDS OF DOLLARS IN UNSUCCESSFUL REPAIRS AND LOST WORK TIME FOR MY COMPANY.   *KB",
        "vin": "1FDAF56P65E"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/15/2011",
        "dateOfIncident": "09/09/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10435649,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUCK STALLED I CHECK IT FUEL PUMP HAD STOP WORKING TOOK TO DEALER, NEXT TIME THE FICM WENT BAD I REPLACED IT DROVE GOOD FOR 1500 OR SO MILES THEN PROBLEMS AGAIN FORD SAID FUEL TANK RUSTING CAUSING FICM TO GO BAD AND CLOG INJECTORS FORD FIXED I ASKED ABOUT USE OF COOLENT THEY COULD NOT FIND ANY PROBLEM BUT I HAVE TO ADD ONE GALION EVERY WEEK AND TRUCK IS STARTING TO SMOKE!  *TR",
        "vin": "1FDAF56P55E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/20/2011",
        "dateOfIncident": "02/15/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10402214,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 FORD F550. THE CONTACT STATED THE VEHICLE STARTED LOOSING POWER AND STALLING WHILE DRIVING. THE CONTACT TOOK THE VEHICLE TO THE DEALER WHO STATED THAT THE INJECTION CONTROL PRESSURE SENSOR FAILED. THE CONTACT REVIEWED NHTSA RECALL CAMPAIGN NUMBER 05V270000 (ELECTRICAL SYSTEM: WIRING), BUT WAS TOLD BY THE MANUFACTURER THAT THEIR VEHICLE WAS NOT INCLUDED. THE FAILURE MILEAGE WAS 148,000 AND THE CURRENT MILEAGE WAS 153,000. FUEL INJECTION CONTROL MODULE WAS REPLACED.  UPDATED 08/31/2011 *LN",
        "vin": "1FDAW56P35E"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING,FUEL SYSTEM, DIESEL,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/18/2011",
        "dateOfIncident": "04/01/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10431108,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WE STARTED EXPERIENCING PROBLEMS WITH THE WHEELS, BRAKES, ELECTRICAL, ENGINE AND VEHICLE STALLING WHEN BEING DRIVEN IN 2005-2008.  CONTINUED TO HAVE PROBLEMS IN 2009 WITH THE TRANSMISSION, COOLANT, LACK OF POWER, BATTERIES AND VEHICLE STALLING WHILE BEING DRIVEN. THE FORD DEALER DIAGNOSED AS A TURBO PROBLEM, HEAD GASKET, VC GASKET, EGR, OIL COOLER, NO OIL PRESSURE. A NEW TURBO WAS INSTALLED. IN DECEMBER  2009 THE TRUCK STALLED WHILE DRIVING, DUE TO A FAILED TURBO HOSE. JAN. 2010, THE TRUCK STALLED AGAIN. THE CAM SENSOR, INJECTOR AND FICM WERE REPLACED. IN APRIL AND MAY 2010, THE TRUCK STALLED AGAIN AND ALL THE INJECTORS WERE REPLACED. IN MARCH  2011, THE TRUCK STALLED AGAIN AND THE CAM SENSOR AND INJECTORS WERE REPLACED AGAIN. APRIL 2011, THE INJECTOR NEEDED TO BE REPLACED AGAIN.  UPDATED 10/20/11 *BF",
        "vin": "1FDAF57PX5E"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/21/2011",
        "dateOfIncident": "12/18/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10392414,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "GENERAL AMERI",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "I HAVE A 2005 FORD F550 CREW CAB WITH 36,000 MILES.  THE VEHICLE IS FOR PERSONAL USE ONLY AND HAS NEVER HAD A HEAVY LOAD ON IT.  MY VEHICLES ARE METICULOULY MAINTAINED AND TIRE PRESSURE CHECKED MONTHLY AND PRIOR TO ANY LONGER TRIP.  TIRE PRESSURE WAS CHECKED THE DAY PRIOR TO THIS INCIDENT.  WHILE DRIVING APPROXIMATELY 70 MPH ON THE FREEWAY, THE RIGHT FRONT TIRE SUSTAINED A FULL BLOWOUT, CAUSING DAMAGE TO THE FENDER/WHEELWELL AREAS.  MY VEHICLE ALMOST ROLLED BUT WAS ABLE TO CORRECT IT WITHOUT A CRASH.  ORIGINAL TIRES ARE CONTINENTIAL 225/70R 19.5 WITH EXCELLENT RUBBER STILL ON THE TIRES.  VEHICLE WAS TOWED TO A GOODYEAR DEALER WHO SAID THE TIRE OBVIOUSLY HAD A DEFECT.  INSPECTION OF THE OTHER TIRES REVEALED HEAVY CRACKS IN THE GROVES.  HAD TO REPLACE THE TIRES FOR OBVIOUS SAFETY REASONS AT A SUBSTANTIAL COST.  READ NUMEROUS COMPLAINTS WITH THIS TIRE.  CONTINENTIAL SHOULD REIMBUSE THE COST OF THE TIRES AND THE COST OF THE REPAIRS TO MY TRUCK AND TOWING.  TRIP WAS DELAYED 6 HOURS WHILE WAITING FOR THE TOW AND REPAIRS.  I DO NOT HAVE THE DAMAGED TIRE, BUT HAVE SEVERAL PHOTOGRAPHS SHOWING THE DAMAGE.  *TR",
        "vin": "1FDAW56P45E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "02/22/2011",
        "dateOfIncident": "02/01/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10383981,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 FORD F-550 SUPER DUTY. WHILE HAVING THE VEHICLE SERVICED AT AN AUTHORIZED DEALER FOR ENGINE FAILURES, THE CONTACT WAS TOLD THE FUEL TANK WAS RUSTING FROM THE INSIDE OUT. THE CONTACT WAS ALSO INFORMED THAT THE RUSTING OF THE FUEL TANK WAS CAUSING THE ENGINE FAILURES. THE VEHICLE WAS EXPERIENCING TROUBLES STARTING THE VEHICLE AS WELL AS A LOSS OF POWER WHILE DRIVING. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGES WERE 77,000.",
        "vin": "1FDAF57P35E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/06/2011",
        "dateOfIncident": "12/24/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10374878,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "1. 2005 FORD F550 DIESEL TRUCK STALLING, ROUGH IDLE, LOSS OF POWER COMPLETELY.  2. THE DIESEL FUEL TANK IS DELAMINATING AND HAS CAUSED $6,000 WORTH IN DAMAGES. MY TRUCK STOPPED WORKING COMPLETELY AND WAS TOWED TO A FORD DEALERSHIP HERE IN HAWAII FOR DIAGNOSIS. MY F550 IS CURRENTLY COVERED WITH A SUPER DUTY DIESEL ENGINE CARE WARRANTY THAT COST OVER $3,000 YET FORD WILL NOT REPLACE THE DEFECTED TANK THAT HAS CAUSED THOUSANDS OF PROBLEMS NATIONWIDE TO DATE. THE TANKS NEED TO BE RECALLED AND INDIVIDUALS NEED TO BE REIMBURSED. FORD HAS TAKEN AWAY FROM OUR ECONOMY AND ENDANGERED OUR ROADS.   3. FUEL FILTERS, FUEL TANK, FUEL INJECTORS, FUEL PUMPS, FUEL PRESSURE REGULATORS, AND FUEL SENDERS ALL NEED TO BE REPLACED. THEY ARE PLANNING TO REPLACE THE FUEL TANK WITH THE SAME MANUFACTURED TANK. IT HAS ALREADY BEEN DOCUMENTED THAT THE PROBLEM WILL REOCCUR AS MANY HAVE HAD TO REPLACE THE TANK MORE THAN ONCE. FORD BLAMES BIODIESEL YET I HAVE NEVER USED BIODIESEL. THIS IS MANUFACTURED DEFECT. NO OTHER DIESEL TANKS ARE HAVING THIS PROBLEM ON A DAILY BASIS NATIONWIDE.  *TR",
        "vin": "1FDAF57PX5E"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/07/2010",
        "dateOfIncident": "12/01/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10369458,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 FORD F550. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 70 MPH, THE ENGINE STALLED WITHOUT WARNING. THE FAILURE WOULD OCCUR ON AN INTERMITTENT BASIS. THE VEHICLE WAS TOWED TO THE DEALER WHO INFORMED THE CONTACT THAT SHE WOULD NEED TO REPLACE THE FUEL INJECTOR CONTROL MODULE AND REGULATOR. THE FUEL INJECTOR CONTROL MODULE AND REGULATOR WERE REPAIRED. THE FAILURE RECURRED INTERMITTENTLY FOLLOWING REPAIRS. THE FAILURE MILEAGE WAS APPROXIMATELY 123,981.",
        "vin": "1FDAF56P05E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "11/27/2010",
        "dateOfIncident": "11/27/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10367977,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A FORD F 550 SD 2005, THIS TRUCK HAS HAD FUEL SYSTEM PROBLEM OFF AND ON SINCE I PURCHASED THREE YEARS AGO. BUT THIS PAST WEEK IT STARTED MISSING AND STOPPING ON ME IN TRAFFIC, I TOOK IT TO THE FORD DEALER AND I'M TOLD THAT THE FUEL TANK LINING IS COMING OFF AND DAMAGED THE FUEL PUMP, FILTERS AND INJECTORS, REPAIR TO COST $5,000. ALSO THAT THIS IS DUE TO THE EPA'S LOW SULFUR REQUIREMENT ON DIESEL FUELS. THIS MAY BE TRUE BUT FORD KNOW OF THIS WAY PRIOR TO THE START DATE OF THIS NEW FUEL AND STILL IS USING DEFECTIVE PARTS THAT THEY WILL NOT COVER UNDER WARRANTY OR A RECALL TODAY....  THIS PARTS FAILURE INCLUDE 2 FUEL TANKS, FUEL PUMP, FUEL FILTERS,AND INJECTORS ALL DAMAGED DUE TO A POOR TANK LINING OR COATING.  *TR",
        "vin": "1FDAW57P35E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "07/28/2010",
        "dateOfIncident": "06/19/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10345894,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 FORD F-550. THE CONTACT STATED WHILE DRIVING AT 65 MPH, THE VEHICLE BEGAN TO INDEPENDENTLY DECREASE IN SPEED. THE CONTACT ATTEMPTED TO ACCELERATE BUT THE VEHICLE WOULD NOT RESPOND. THE CONTACT THEN SWITCHED TO THE REAR FUEL TANK YET THE FAILURE PERSISTED. HE ATTEMPTED TO SWITCH BACK TO THE FRONT FUEL TANK HOWEVER THE VEHICLE STALLED. THE CONTACT CONTINUED TO SWITCH FROM THE REAR TO THE FRONT FUEL TANK AND EACH TIME HE WOULD SWITCH TO THE FRONT FUEL TANK, THE VEHICLE WOULD STALL. THE CONTACT STATED HE ATTEMPTED TO CHANGE THE FUEL FILTER HOWEVER IT WAS SEVERELY CLOGGED WITH WHAT APPEARED TO BE PAINT. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THE FUEL TANK, FOUR FUEL INJECTORS AND THE FUEL LINES THAT WERE CONNECTED TO THE ENGINE BACK TO THE TANK. THE DEALER ADVISED THE FAILURE WAS CAUSED BY DE-LAMINATION OF THE FUEL TANK. THERE WERE NO RECALLS FOR THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 90,000 AND THE CURRENT MILEAGE WAS APPROXIMATELY 95,400.   THE VEHICLE WAS TAKEN TO THE DEALER WHERE THEY INSPECTED THE FRONT FUEL TANK AND DISCOVERED THE COATING AND LINING WAS PEELING OFF INSIDE THE TANK, WHICH CAUSED FUEL SHORTAGE TO THE ENGINE. THE DEALER REPLACED THE FRONT FUEL TANK, FUEL FILTERS, FUEL REGULATOR, FUEL INJECTORS AND FLUSHED ALL THE FUEL LINES.  UPDATED EVOQ 09/08/10*JB  UPDATED 10/04/10. *LJ  THE DEALER INSPECTED THE TANK AND FOUND THE LINING OF THE FRONT TANK PEELING OFF AND GETTING INTO THE FUEL TANK SYSTEM. THEY REPLACED THE FRONT TANK AND FLUSHED ALL OF THE FUEL LINES. ALSO, THE REAR TANK REVEALED PAINT FLAKING AND REPLACEMENT OF THAT TANK WAS REQUIRED. UPDATED 10/12/10",
        "vin": "1FDAX56PX5E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/07/2010",
        "dateOfIncident": "06/01/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10335108,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONTACT OWNS A 2005 FORD F-550.  SHE STATED THAT ON JUNE 1, 2010, WHILE DRIVING 20 MPH, THE  ENGINE OVERHEATED AND CONTACT HAD TO STOP THE VEHICLE AND REPLACED THE COOLANT FLUIDS.  THE DEALER AND MANUFACTURER WAS CONTACTED AND ADVISED THAT THEY WERE NOT ABLE TO REPAIR THE FAILURE BECAUSE IT WAS NO LONGER UNDER WARRANTY.  THE FAILURE AND CURRENT MILEAGE  WERE 50,000..MR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "01/04/2010",
        "dateOfIncident": "12/23/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10298158,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM CONTACTING YOU TO FILE A COMPLAINT WITH FORD MOTOR COMPANY REGARDING THE FUEL TANKS ON 450 AND F550 TRUCKS THAT WE OWN. I HAVE MORE THAN ONE VEHICLE THAT IS AND HAS BEEN AFFECTED BY THIS. THE FUEL TANKS ARE DEGRADING FROM THE INSIDE, CAUSING FUEL SYSTEM DAMAGE AND CREATING A HAZARD DUE TO THE FACT THAT AS LARGE AS THESE VEHICLES ARE THEY CAN BE DISABLED IN TRAFFIC. I DO UNDERSTAND THAT ANY VEHICLE COULD BE RENDERED DISABLED. HOWEVER THIS WOULD BE FOR A KNOWN CAUSE. FORD DEALERSHIPS ARE WELL AWARE OF THE PROBLEM AS ARE MANY TANK REPAIR FACILITIES IN NEW ENGLAND. I UNDERSTAND THROUGH RESEARCH THESE TANKS HAVE BEEN DEFECTIVE SINCE 1998. FORD IS TRYING TO SAY IT IS DUE TO BIO-DIESEL. IF YOU LOOKED INSIDE THE TANK, YOU WOULD SEE IT IS LIKE PAINT FLAKING OFF OF A WALL. THIS SITUATION HAS BEEN DOING DAMAGE TO PUMPS AND INJECTORS CAUSING BREAKDOWNS. FORD IS WELL AWARE OF THIS AND HAS DONE NOTHING TO RESOLVE IT TO THE BEST OF MY KNOWLEDGE. *TR",
        "vin": "1FDAF56P35E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "09/23/2009",
        "dateOfIncident": "09/07/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10284995,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 FORD F550 SD. THE CONTACT STATED BECAUSE THE LINING IN THE FUEL TANK HAS BECOME LAMENTED, IT CLOGS THE FUEL FILTER.  AS A CONSEQUENCE FUEL NOT ONLY LEAKS, BUT THE ENGINE INTERMITTENTLY STALLS. HE CONTACTED THE DEALER, AND WAS ADVISED BY A TECHNICIAN THAT HE WOULD HAVE TO PAY $900.00 TO REPLACE THE FUEL TANK. NO REPAIRS WERE MADE. THE FAILURE AND CURRENT MILEAGES WERE 74,000.",
        "vin": "1FDAF56P15E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "06/24/2009",
        "dateOfIncident": "06/22/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10274801,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 F-550 HAVING FUEL TANK LINER FAILURE PROBLEMS. *TR",
        "vin": "1FDAF56P25E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "06/18/2009",
        "dateOfIncident": "04/15/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10274255,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 FORD F-550 FUEL TANK LINER FAILURES.  TANK LINER COMING APART CAUSING THE FUEL TANK NEEDING TO BE RELINED, AND REPLACING THE FUEL PUMP AND FUEL FILTER. *TR",
        "vin": "1FDAF56P25E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "06/17/2009",
        "dateOfIncident": "06/13/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10274121,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WE OWN A 2005 FORD F-550 DIESEL TRUCK.  WE ARE HAVING PROBLEMS WITH THE FUEL TANK DELAMINATING AND CAUSING THE FUEL FLOW TO STOP TO THE ENGINE.  THIS IS A COMMON PROBLEM ON ALOT OF FORD DIESEL TRUCKS, FORD DOES NOT WANT TO TAKE RESPONSIBILITY FOR THE TANK DELAMINATION, CAUSING THE TRUCK TO STOP RUNNING.  WE ARE HAVING TO PAY FOR THE REPAIR, EVEN THOUGH THE TRUCK IS STILL UNDER WARRANTY.  THEY SAY THAT WE ARE RUNNING BIO-DIESEL THROUGH THE TRUCK AND THIS IS WHAT IS CAUSING THE LINER SEPARATION. *TR",
        "vin": "1FDAF56P75E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "06/06/2009",
        "dateOfIncident": "05/25/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10272988,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "1.  THE TRUCK WAS LOSING POWER AND COULD BARLEY MAKE IT UP ANY HILL.  2.  THE FUEL TANK IS DELAMINATING, ALUMINUM FLAKES ARE CLOGGING THE FILTERS AND INJECTORS.  3.  INJECTORS WERE REPLACED ALONG WITH THE FUEL FILTERS. *TR",
        "vin": "1FDAW56P56E"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/12/2009",
        "dateOfIncident": "05/01/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10268562,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 2005 FORD F-550, THE REAR AXLE SEAL IN PASSENGER SIDE LEAKS.  BRAKES ARE COATED WITH GEAR OIL WHEN HIS OCCURS.  FORD TSB # 05124 HAS BEEN DONE BUT DOES NOT WORK.  MY VEHICLE HAS HAD FOUR REPAIRS ( 3 SEAL REPLACEMENTS AND 1 ATTEMPT AS PER TSB ) AND ALL HAVE FAILED.  TRUCK HAS @ 24,000 MILES ON IT. *TR",
        "vin": "1FDAF57P45E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "04/11/2009",
        "dateOfIncident": "03/18/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10264980,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUCK STARTED LOSING POWER ON THE HIGHWAY. WOULD HARDLY CLIMB AN INCLINE. WE EXITED THE HIGHWAY, TRUCK WAS RUNNING WORSE, AND FINALLY STALLED OUT. IT WOULD ONLY RESTART AND RUN ROUGH FOR A MINUTE OR TWO AFTER LETTING IT SIT FOR A WHILE, AND THEN STALL AGAIN. I HAD TO GET THE TRUCK TOWED BACK TO MY SHOP. WE CHANGED THE FUEL FILTERS, AND THE ONE IN THE FRAME RAIL HAD A SILVER FLAKY SUBSTANCE INSIDE THE FILTER. I HAD TO PUT THE TRUCK ON A TRAILER, AND BRING IT TO THE DEALERSHIP. I WAS TOLD I NEEDED A NEW FUEL TANK, A NEW FUEL PUMP, NEW FUEL FILTERS, AND THE FUEL SYSTEM NEEDS TO BE FLUSHED. THEY SAID THEY ARE AWARE OF THE PROBLEM, AND THEY CALLED A WARRANTY REP. THEY REFUSED TO HELP ME. I CALLED FORD ROADSIDE ASSISTANCE, AND THEY REFUSED TO HELP ME. I NOW HAVE TO SPEND THOUSANDS TO FIX THIS. THE PARTS SALESMAN AT THE DEALERSHIP SAY THAT THIS HAPPENS ALL THE TIME, AND SOMETIMES THE REPLACEMENT TANKS DO THE SAME THING. I KNOW OF ABOUT A DOZEN OR A DOZEN AND A HALF FORD TRUCKS THAT HAVE HAD THIS EXACT PROBLEM. THERE IS ACTUALLY A DEALERSHIP IN CT THAT STOCKS A BUNCH OF THESE TANKS BECAUSE THIS HAPPENS SO MUCH. *TR",
        "vin": "1FDAF57P45E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/23/2008",
        "dateOfIncident": "09/22/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10246571,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE AND ENGINE COOLING:ENGINE:DIESEL   MY FORD F550 HEAVY DUTY TRUCK EQUIPPED WITH  DIESEL ENGINE, THE CAMSHAFT POSITION SENSOR LOCATED ON THE ENGINE OF THE VEHICLE MAY FUNCTION INTERMITTENTLY, POSSIBLY RESULTING IN AN ENGINE STALL.    I  HEAR I'M NOT THE ONLY I KNOW FOR A FACT THE  FORD HAS HAD MANY PROBLEM'S WITH THEIR ENGINE'S IF POSSIBLE I WOULD LIKE TO RETURN IT FOR A REFUND. *TR",
        "vin": "1FDAF56P45E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "09/26/2008",
        "dateOfIncident": "07/15/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10243558,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUCK WILL HAVE A SUDDEN LOSS OF POWER WHEN DRIVING ON THE HIGHWAY AND FINALLY STALLS OUT. IT PUTS THE DRIVER AND THE OCCUPANTS IN A DANGEROUS SITUATION. WE DO MANAGE TO GET THE TRUCK INTO THE SHOULDER AND ATTEMPT TO START THE TRUCK UP. AFTER 10 MINUTES THE TRUCK WILL START UP AND DRIVE OK. THE TRUCK WILL CONTINUE TO DO THIS INTERMITTENTLY PUTTING THE OCCUPANTS AT RISK. THE FUEL FILTER IS REPLACED BUT CONTINUATION OF THE SAME PROBLEM. THE FUEL PUMP IS NEXT TO BE REPLACED, THEN THE LIFTER PUMP WITH STILL NO RESULTS. THEY FINALLY CHECK THE FUEL TANK AND FIND RUST AND SOME SORT OF BROWN SLIME IN THE TANK AND REPLACE THE TANK ALONG WITH A NEW FUEL FILTER WHICH SOLVED THE PROBLEM. *TR",
        "vin": "3FRNF65F75V"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "07/29/2008",
        "dateOfIncident": "07/24/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10236333,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MY FORD F-550 FUEL TANK IS PEELING OFF AND CLOGGING UP THE ENGINE. CAUSING IT TO STOP DEAD IN THE MIDDLE OF DRIVING. FORD WILL NOT FIX THIS UNDER WARRANTY WORK. MY TRUCK ONLY HAS 27,500 MILES ON IT.  *TR",
        "vin": "1FDAW57P05E"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/08/2008",
        "dateOfIncident": "05/06/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10227036,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 FORD F550.  WHILE DRIVING AT ANY SPEED, THE CLUTCH LOCKS TO THE BOTTOM OF THE FLOOR WHEN IT IS ENGAGED.  THE FAILURE PREVENTS THE CONTACT FROM SWITCHING GEARS AND THE VEHICLE CONTINUES TO ACCELERATE.  IN ORDER TO STOP THE VEHICLE FROM ACCELERATING, HE MUST MANUALLY FORCE THE VEHICLE TO SWITCH GEARS.  THE VEHICLE HAD TO BE TOWED TO THE DEALER.  THE VEHICLE HAS BEEN DIAGNOSED BY THE DEALER SEVERAL TIMES, BUT THE FAILURE STILL PERSISTS.  THE CURRENT MILEAGE WAS 50,084 AND FAILURE MILEAGE WAS 15,000.",
        "vin": "3FRNF65Z65V"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "12/06/2007",
        "dateOfIncident": "12/01/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10211059,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MY FORD F550 TRUCK IS BEING REPAIRED FOR A DELAMINATING FUEL TANK. FORD IS TRYING TO SAY IT IS FROM USING BIOFUEL,I NEVER USED ANYTHING BUT STRAIGHT DIESEL. THE TANK IS PLASTIC LINED AND IS COMING APART BADLY AND CLOGGING INJECTORS CAUSING THE ENTIRE FUEL SYSTEM AND ENGINE TO FAIL. THE DEALER SAID HE HAS SEEN THIS BEFORE AND IT IS BECOMING A RECURRING PROBLEM. THE TRUCK HAS 41,777 MILES ON IT. THE YEAR IS A 2005, IT WAS IN FOR AN EXTREME LOSS OF POWER WHILE STILL UNDER WARRANTY,THE DEALER MISS DIAGNOSED THE PROBLEM, CHANGED THE FUEL FILTER AND THE TRUCK HAS BEEN RUNNING ERRATIC EVER SINCE. THEY SAID THEY COULD NOT FIND ANY PROBLEM. NOW I AM PAYING TO HAVE A NEW TANK INSTALLED SAME AS THE OLD ONE, AND THE PROBLEM IS ONLY GOING TO HAPPEN AGAIN AND MAY EVEN LEAD TO AN ACCIDENT OR A BLOWN MOTOR. PLEASE CONTACT ME. *TR",
        "vin": "1FDAF57PX5E"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/05/2007",
        "dateOfIncident": "09/16/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10184232,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 FORD F550. FOR SEVERAL MONTHS THE DRIVERS SIDE REAR TIRE SLOWLY DEVELOPED A BLISTER ON THE SIDEWALL.  THE TIRE BLEW OUT WHILE DRIVING 65 MPH ON THE HIGHWAY.  THE WEATHER WAS NOT A FACTOR. THE FAILURE MILEAGE WAS 6000 WHEN THE BLISTER APPEARED, AND AT 7,000 WHEN THE TIRE BLOWOUT OCCURRED. THE CONTACT STATED THAT THE ORIGINAL TIRES ON THE VEHICLE ARE CONTINENTAL.  THE CURRENT MILEAGE WAS 12,000. THE FAILURE MILEAGE WAS 6,000.  *AK  UPDATED 04/05/07 *JB",
        "vin": "1FDAF56P4SE"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/22/2007",
        "dateOfIncident": "11/19/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10179392,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* - AT A STOP SIGN THE CONTACT WAS GETTING READY TO ACCELERATE ACROSS A MAIN ROAD WITH THIS 05 FORD F-550 SUPER DUTY.  WHILE ACCELERATING THE VEHICLE COMPLETELY LOST POWER, STALLING IN THE MIDDLE OF THE ROAD.  BEFORE VEHICLE COMPLETELY STALLED,  THE CHECK ENGINE WARNING LIGHT CAME ON WITHIN A SECOND AFTER THE ENGINE LIGHT CAME ON THE VEHICLE STALLED OUT.  THE VEHICLE WAS TOWED INTO DEALERSHIP AND AT THE DEALERSHIP THEY STATED THAT THE OIL PUMP PRESSURE DROPPED BELOW 20 POUNDS CAUSING THE VEHICLE TO SHOT OFF AUTOMATICALLY.  *AK  UPDATED 02/22/07. *JB",
        "vin": "1FDAF57P95E"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "12/21/2006",
        "dateOfIncident": "12/01/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10176738,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WE ARE GETTING REPORTS THAT FORD F550 TRUCKS ARE LOSING THEIR DUAL TIRES BECAUSE OF BROKEN LUG BOLTS ON THE REAR DUALS.   THESE ARE APPARENTLY HAPPENING ON OLDER MODELS THAT HAVE HAD EIGHT BOLT PATTERNS.   I AM FORWARDING THIS INFORMATION ON BEHALF OF SEVERAL ELECTRIC UTILITIES ACROSS THE COUNTRY WHO HAVE BROUGHT THIS INFORMATION TO MY ATTENTION.  *NM",
        "vin": ""
    }
]