[
    {
        "components": "POWER TRAIN,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/21/2010",
        "dateOfIncident": "09/19/2010",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10356767,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "WILDCAT",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 FOREST RIVER WILDCAT TRAILER. WHILE EXAMINING THE VEHICLE THE CONTACT NOTICED THAT THE REAR AXLE HAD SEPARATED FROM THE MOUNTING. THE CONTACT ALSO NOTICED CRACKS IN THE AXLE WHERE IT WAS WELDED TO THE TRAILER. THE VEHICLE HAS NOT BEEN DIAGNOSED AND THERE WERE NO PRIOR WARNINGS. THE CURRENT AND FAILURE MILEAGES WERE APPROXIMATELY 5000.  UPDATED 01/11/2011*LJ  UPDATED 03/30/11",
        "vin": "4X4TWCB215T"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "11/24/2009",
        "dateOfIncident": "08/13/2009",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10293377,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "WILDCAT",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Cheng Shin Rubber/Maxxis International",
                "productMake": "CHENG SHIN",
                "productModel": "CHENG SHIN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "THIS PAST MARCH I REPLACED MY 5 YEAR OLD FIFTH-WHEEL TRAILER TIRES (LOAD RANGE D) WITH SECURA SST 225-75/15 TIRES (E RATED TIRES). MY FIRST CAMPING TRIP IN APRIL OF APPROX 300 MILES I HAD NO PROBLEMS. OVER THE JULY 4TH HOLIDAY ANOTHER TRIP OF AROUND 400 MILES RESULTED IN A BLOWOUT WITH TIRETREAD SEPARATION TO THE RIGHT REAR TRAILER AXLE . MY NEW SECURA SPARE WAS INSTALLED AND I RETURNED HOME APPROX 60 MILES. BLOWOUT WAS RETURNED TO THE PLACE OF PURCHASE AND AFTER AN INSPECTION OF THE TIRE I WAS GIVEN ANOTHER TIRE. MY THIRD TRIP OF THE YEAR IN AUGUST FOUND ME ABOUT 40 MILES FROM HOME WHEN I HAD ANOTHER BLOWOUT ON THE RIGHT REAR AXLE OF MY TRAILER. AFTER PUTTING ON MY NEW SPARE I PROCEEDED DOWN THE ROAD ABOUT 30 MILES WHEN THE RIGHT REAR TIRE BLEW OUT. THIS IS THE SAME TIRE THAT WAS PUT ON THE ROAD ABOUT 130 MILES AGO THIS PAST JULY. NEW GOODYEAR TIRES WERE PUT ON BY EMERGENCY ROADSERVICE AT CONSIDERABLE EXPENSE ON ALL 4 TRAILER TIRES AS MY WIFE REFUSED TO RIDE IN MY TRUCK FEARING ANOTHER BLOWOUT ON THE TRAILER MIGHT CAUSE US TO BE IN A SEVERE ACCIDENT. ALL TIRES WERE RETURNED TO PLACE OF PURCHASE TO BE SENT TO THE MANUFACTURER. THEIR REVIEW AND REPORT  STATED THAT THE BLOWOUTS WERE A RESULT OF IMPACTS. I AM THE ONLY PERSON THAT PULLS MY TRAILER AND I CAN ASSURE YOU THAT THE TIRES DID NOT RECEIVE ANY IMPACTS. I AM RELIGIOUS IN CHECKING TIRE PRESSURES SO AS TO AVOID SUCH PROBLEMS. *TR",
        "vin": "4X4FWCG285V"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "03/12/2009",
        "dateOfIncident": "03/01/2008",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10262309,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "WILDCAT",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 FOREST RIVER WILDCAT RV WITH DOMETIC REFRIGERATOR RECALL PROBLEM.  *NJ  THE CONSUMER STATED THE BOILER TUBE IN HIS RV CRACKED AND RELEASED PRESSURIZED COOLANT. THE CONSUMER STATED THE MANUFACTURER'S RESOLUTION WAS TO INSTALL A LIGHT SHEET METAL AROUND THE BACK PART OF THE UNIT. THE REPAIR WAS DONE ON THE CONSUMER'S RV, HOWEVER IT DID NOT SOLVE THE LEAKING GAS PROBLEM.  THE MOTOR HAD TO BE REPLACED IN THE AIR CONDITION UNIT. *JB",
        "vin": "4X4FWCD2X5V"
    }
]