[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/26/2007",
        "dateOfIncident": "08/10/2007",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10206980,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHR",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "METZELER MOTORCYCLE TIRE",
                "productMake": "METZELER",
                "productModel": "16080R16",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "MOTORCYCLE ROAD TRIP - CHECKED TIRES.  REAR METZELER ME880 1.50/80HB16 - MADE IN BRAZIL.  DELAMINATION - UNDERLYING PLIES EXPOSED.  KNOWN PROBLEM BY METZELER WITH BRAZILIAN MANUFACTURED TIRES.  METZELER IS DISTRIBUTING DEFECTIVE AND DANGEROUS TIRES TO DEALERS.  COMPLAINTS HAVE BEEN MADE TO METZELER.  OTHER INDIVIDUALS HAVE HAD THE SAME PROBLEM.  EXTENSIVE TIRE FAILURE REPORT HAS BEEN SENT TO METZELER AS OF 10/25/07.  MATCHING SET OF DUNLOP TIRES REPLACED THE METZELERS.  DEFECTIVE TIRE IS AVAILABLE AS EVIDENCE AND PHOTOGRAPHIC DOCUMENTATION HAS BEEN SENT TO METZELER ALONG WITH THE REPORT.  THE SUBJECT METZELER TIRE WAS CLEARLY UNSAFE CREATING THE POTENTIAL TO CAUSE SERIOUS INJURY OR DEATH.  IT IS CLEARLY FORESEEABLE TO METZELER THAT ITS TIRES WOULD CONTINUE TO EXPOSE ITS CUSTOMERS TO GREAT RISK!  *TR",
        "vin": "1HD1FDV135Y"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/03/2006",
        "dateOfIncident": "04/03/2006",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10154384,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHR",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE DRIVING 55 MPH, THE REAR WHEEL VIBRATED.  THE VEHICLE WAS TAKEN TO THE DEALER FOR INSPECTION.  THE DEALER TIGHTENED THE SPOKES ON THE WHEELS.  THAT REMEDIED THE PROBLEM FOR A SHORT AMOUNT OF TIME.  HOWEVER, THE PROBLEM RECURRED.  IN OCTOBER 2005  MOTORCYCLE HAD SLIGHT VIBRATION WHILE DRIVING AT 50 MPH. TOOK IT TO DEALER FOR 5,000 MILES SERVICE AND REPORTED THE VIBRATION. DEALER TIGHTENED SPOKES AND TRUED WHEEL. DEALER DID NOT CHARGE THE CONTACT, IT WAS FIXED UNDER WARRANTY. ON   APRIL 3, 2006 CONTACT WENT FOR A RIDE IN A GROUP OF 9 MOTORCYCLES AND 13 PEOPLE. THE CONTACT WA SIN FRONT ON RIGHT DOING 50 MPH, AND WHEN COMING AROUND A SLIGHT CURVE TO THE RIGHT THE MOTORCYCLE STARTED TO VIBRATE. THE CONTACT MANAGED TO KEEP CONTROL AND STOPPED THE MOTORCYCLE. FOUND THE SPOKES TO BE LOOSE. CALLED THE DEALER NEXT DAY AND REQUESTED NEW WHEEL. REQUEST WAS DENIED BY DEALER. THEN CALLED HARLEY DAVIDSON, AND WAS TOLD WHEELS WERE NOT COVERED.  *AK",
        "vin": "1HD1FRW1X5H"
    }
]