[
    {
        "components": "WHEELS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/28/2006",
        "dateOfIncident": "08/20/2006",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10166758,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLSTF",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE ME AND MY WIFE WAS RIDING OUR FATBOYS (HER 2005 & MINE 2004) WE WERE ON OUR FIRST DAY OF A 8 DAY ROAD TRIP TRAVELING ON ROUTE 84 WEST NEAR CARMEL NY, SHE DEVELOPED A PROBLEM. ALL 5 OF HER CHROME PULLEY BOLTS SHEARED OFF HARLEY DAVIDSON P/N 94773-00A. GOT MY BOYS TO TRAILER HER HOME. NEXT DAY BOUGHT NEW HD WHEEL AND PARTS TO BUT THE BIKE ON THE ROAD. BEFORE BRING THE PARTS TO MY DEALER I WANTED TO SEE IF THE ORIGINAL FACTORY BOLTS FIT THE SAME AS THE CHROME (94773-00A) DID. I CLEAN THE YELLOW LOCKTIGHT OFF OF THE ORIGINAL BOLT AND WITHOUT THE PULLEY IN PLACE I  HAND-TIGHTEN THE BOLT . DID THE SAME WITH THE 94773-00A BOLT. THEY FIT DIFFERENT. THE ORIGINAL BOLTS FIT WITH A SLIGHT MOVEMENT WHEN MOVING THE BOLT LEFT TO RIGHT. THE 94773-00A BOLT HAD A MUCH MORE NOTICEABLE MOVEMENT. SHOWED MY DEALERSHIP AND I AM WAITING FOR A REPLY FROM HARLEY DAVIDSON. IF YOU PERFORM THIS TEST ON YOUR WHEEL MAKE SURE THE BOLT AND THE THREADS IN THE WHEEL ARE TOTALLY FREE OF LOCKTIGHT.  BEFORE I INSTALLED THE 94773-00A BOLTS I PURCHASED THE SOFTAIL SERVICE MANUAL AND A NEW TORQUE WRENCH AND RED 262 LOCKTIGHT, I FOLLOWED EVERY STEP IN THE HD MANUAL.  *NM",
        "vin": "1HD1BMY125Y"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/06/2005",
        "dateOfIncident": "10/02/2005",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10138954,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLSTF",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "1. WATCHING SOMEONE START THEIR HARLEY MOTORCYCLE IN GEAR WITHOUT THE CLUTCH LEVER PULLED IN.  2. MOTORCYCLE LURCHED FORWARD WHEN PUSHING THE STARTER BUTTON.  OBVIOUS CONSEQUENCES.  FALLING, RUNNING OVER SOMEONE OR SOMETHING.  3. PUT IN NEUTRAL WHEN STARTING OR PULLING IN THE CLUTCH LEVER WHEN IN GEAR.   *NM",
        "vin": ""
    }
]