[
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/08/2013",
        "dateOfIncident": "04/30/2013",
        "fire": false,
        "manufacturer": "Heartland Recreational Vehicles, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10515814,
        "products": [
            {
                "manufacturer": "Heartland Recreational Vehicles, LLC",
                "productMake": "HEARTLAND",
                "productModel": "LANDMARK",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TOOK VEHICLE TO SHOP FOR SMELL OF PROPANE, WHERE THEY DISCOVERED DAMAGES TO THE FRAME OF THE UNIT NOT UNCOMMON FROM THIS MFG WITH FRAME FAILURES, INSURANCE HAS DENIED MY CLAIM.  I'M SEEING A PATTERN OF DAMAGE WITH OTHER UNITS AND MFG USING LIPPERT COMPONETS FRAMES. THE FRAME HAS NUMEROUS CRACKS AND HAS SHIFTED 2.5 INCHES THIS SAME SHOP HAS SEEN MORE OF THESE PROBLEMS WITH OTHER UNITS USING LIPPERT FRAMES.  IN JANUARY OF 2007 HEARTLAND ISSUED A TECH SERVICE BULLETIN VIA LETTER TO OWNERS OF AFFECTED LANDMARKS.  A CROSS SUPPORT NEEDED TO BE ADDED.  ON RVNET WEBSITE NUMEROUS EXAMPLES OF FAILURES HAVE BEEN NOTED AS WELL.  THIS IS A MODEL NAMED GOLDEN GATE FLOOR PLAN.  THE RV INDUSTRY SEEMS TO BE EXEMPT FROM THESE TYPE OF RECALL ISSUES?  *TR",
        "vin": "1H9GF36235E"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "01/12/2010",
        "dateOfIncident": "11/27/2009",
        "fire": false,
        "manufacturer": "Heartland Recreational Vehicles, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10299095,
        "products": [
            {
                "manufacturer": "Heartland Recreational Vehicles, LLC",
                "productMake": "HEARTLAND",
                "productModel": "LANDMARK",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "KENDA USA",
                "productMake": "KENDA",
                "productModel": "KARRIER ST RADIAL",
                "productYear": "9999",
                "size": "235/85/R16",
                "type": "Tire"
            }
        ],
        "summary": "YOUR SYSTEM DID NOT ALLOW FOR ME TO SELECT THE PROPER MODEL OF TIRE, SO I HAVE TO SELECT WHAT WAS THERE.  THE PROPER MODEL IS KLEVER.    PURCHASED 2005 HEARTLAND LANDMARK TRIPLE AXLE FIFTH WHEEL TRAILER IN JUNE 2006.  TRAVELED FROM TX TO WA AND USED IT IN LOCAL AREA FOR CAMPING FOR THREE YEARS.  MOVED BACK FROM WA TO TX IN NOV 2009 AND HAD TWO SEPARATE BLOW OUTS WHERE THE TREAD OF TIRE SEPARATED FROM THE CASE.  TIRES ARE KENDA KLEVER 235/85R16, AIR PRESS AND TORQUE WAS CHECKED EACH STOP.  OVER ALL THE TRAILER HAD LESS THEN 5K MILES ON IT.  REPLACED THE TWO TIRES WITH ANOTHER BRAND.  OLD TIRES ARE AVAILABLE FOR STUDY.  AS FAR AS I KNOW THE TIRES DID NOT STRIKE UNEVEN ROAD SURFACES.  OVERALL DAMAGE TO TRAILER IS OVER 4K. *TR",
        "vin": "1H9GF39385E"
    }
]