[
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/16/2016",
        "dateOfIncident": "02/20/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10849989,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "VT750",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I NOTICED 3 WEEKS AGO THAT THERE WAS A STRONG SMELL OF GASOLINE AROUND MY BIKE. SO I LOOKED AROUND THE ENGINE AND DIDN'T FIND ANYTHING. I THOUGHT I WAS IMAGING THINGS, BEING OVERLY PRECAUTIOUS. SINCE THEN THE SMELL HAS DEVELOPED INTO A WET SPOT UNDERNEATH MY BIKE, A SMALL PUDDLE. THE FUEL VALVE ON MY GAS TANK IS DRIPPING GAS. THE CHROME ON MY CLUTCH COVER IS NOW WAVY BECAUSE OF THE LEAK. I NORMALLY START MY BIKE IN THE GARAGE TO WARM IT UP BUT AM AFRAID IT WILL START A FIRE. AFTER CONDUCTING SOME RESEARCH I CAME UPON SEVERAL COMPLAINTS ABOUT THE SAME THING. I NOTICED IT WAS THE SAME KIND OF BIKE BUT DIFFERENT YEARS. THEN SOMEONE MENTIONED THERE HAD BEEN A RECALL BECAUSE MANY OTHER BIKES WERE HAVING THE SAME ISSUE. I DON'T UNDERSTAND WHY A RECALL WOULD BE CONDUCTED ONLY ON SPECIFIC YEARS IF IT IS A SAFETY CONCERN INVOLVING MULTIPLE YEARS. IF THERE IS A COMPLAINT ABOUT A SPECIFIC PART CONTINUOUSLY THEN IT SHOULD BE ADDRESSED EVERYTIME. IF IT IS A DEFECTIVE PART THEN IT SHOULD BE FIXED. IT'S KIND OF SCARY THINKING MY BIKE COULD CATCH FIRE. I'M GOING TO ORDER A PART AND GET IT FIXED BECAUSE IT'S A SAFETY ISSUE. IT ISN'T AN ACCESSORY. I SAW MY FRIEND AT BIKE NIGHT LAST WEEK, I WAS TALKING TO HER HUSBAND EXPLAINING ABOUT THE LEAK AND HE SAID HE HAD JUST REPLACED HER FUEL VALVE THE DAY BEFORE. WHAT A COINCIDENCE. SHE HAS A 2007 HONDA SHADOW AERO WITH THE SAME PROBLEM. MAYBE THEY ARE FAULTY ACROSS THE BOARD.",
        "vin": "JH2RC50465M"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/09/2014",
        "dateOfIncident": "07/01/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10609346,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "VT750",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FUEL PETCOCK (FUEL CONTROL VALVE) DIAPHRAGM IS LEAKING ON A HOT ENGINE.  HONDA HAS A RECALL FOR THIS PART IN THE 2007 AND 2008 BUT NOT FOR THE 2005 MODEL YEAR.      THIS IS A MAJOR ISSUE AS FUEL IS LEAKING ON A HOT ENGINE!      I HAVE CALLED HONDA AND THEY WILL NOT DO ANYTHING ABOUT IT.  I SPOKE WITH TWO SEPARATE GENTLEMEN AT 1-866-784-1870 WITHOUT LUCK.  *TR",
        "vin": "JH2RC50385M"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/28/2009",
        "dateOfIncident": "09/21/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10285541,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "VT750",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 HONDA VT750. THE CONTACT STATED THAT THE FUEL TANK LEAKED EACH TIME FUEL WAS ADDED TO THE VEHICLE.  FUEL LEAKAGE IN THE PRESENCE OF AN IGNITION SOURCE, INCREASED THE RISK OF A FIRE.  THE MANUFACTURER WAS NOTIFIED, AND HE WAS REFERRED TO A DEALER. HE IS IN THE PROCESS OF TAKING THE VEHICLE TO THE DEALER FOR INSPECTION. THE VEHICLE IDENTIFICATION NUMBER WAS UNAVAILABLE. THE FAILURE AND CURRENT MILEAGES WERE 1,000.",
        "vin": ""
    }
]