[
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,WHEELS",
        "crash": true,
        "dateComplaintFiled": "12/29/2014",
        "dateOfIncident": "08/03/2014",
        "fire": true,
        "manufacturer": "Navistar, Inc.",
        "numberOfDeaths": 1,
        "numberOfInjuries": 0,
        "odiNumber": 10668819,
        "products": [
            {
                "manufacturer": "Navistar, Inc.",
                "productMake": "INTERNATIONAL",
                "productModel": "4300",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "LEETE TIRE CO.SENT MY HUSBAND ON A OUT OF STATE CALL TO TOW A VEHICLE TO N.C.COMING BACK INTERSTATE 85 NORTH THE TOW TRUCK ENDING UP RUNNING OFF THE ROAD INTO THE WOODS AND CAUGHT FIRE,LOOKED LIKE EXPLODED,KILLED MY HUSBAND AND HIS BODY BURNED IN FLAMES.FRIDAY BEFORE THE FATAL ACCIDENT MY HUSBAND ASK FOR TWO NEW TIRES ON HIS TOW TRUCK FOR THE ONES ON IT WERE BADLY WORN,HIS BOSS JUST SWAPPED THE TIRES FROM LEFT TO RIGHT ON EACH FRONT SIDE,THIS TRUCK HAD 1 HALF MILLION MILES ON IT,LEETE DOES THEIR OWN INSPECTIONS,AND DOES NOT KEEP THEIR EMPLOYEES SAFE,THE BOSS WAREN STRUM GETS A BONUS EACH MONTH IF HE DOESNT HAVE TO FIX OR REPLACES ANY THING ON THE EMPLOYEES COMPANY TRUCKS,FED.MOTOR CARRIER STATE THESE TRUCK ARE NOT ALLOWED TO EVEN GO OUT OF STATE,THEY ARE INVESTIGATE NOW,AND NO LOG IS MADE TO SERVICE THESE COMPANY TRUCKS,THE AIR BAG NEVER WENT OFF TO SAVE MY HUSBAND,THE TIRE TREAD SEPARATED ON THE FRONT TIRE.MY HUSBAND DIED AS THE RESULT,PLEASE HELP!!   *TR",
        "vin": "1HTMMAAM25H"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/20/2010",
        "dateOfIncident": "03/15/2010",
        "fire": false,
        "manufacturer": "Navistar, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10331340,
        "products": [
            {
                "manufacturer": "Navistar, Inc.",
                "productMake": "INTERNATIONAL",
                "productModel": "4300",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 INTERNATIONAL 4300 DUMP TRUCK.  THE CONTACT STATED THE ENGINE WOULD SLIP INTO IDLE MODE AND WHEN DEPRESSING THE ACCELERATOR PEDAL, IT WOULD NOT RESPOND. THE FAILURE OCCURRED WHILE DRIVING VARIOUS SPEEDS. THERE WERE NUMEROUS WARNING LIGHTS ILLUMINATED ON THE DASHBOARD WHEN THE FAILURE WOULD OCCUR. THE VEHICLE WAS TAKEN TO THE DEALER AND THE WIRING HARNESS WAS REPLACED. THE FAILURE CONTINUED TO OCCUR.  THE VEHICLE WAS TAKEN BACK TO AN AUTHORIZED DEALER WHERE THE CONTACT WAS AWAITING REPAIRS. THE FAILURE MILEAGE WAS APPROXIMATELY 80,000 AND THE CURRENT MILEAGE WAS APPROXIMATELY 89,000.    UPDATED 7/16/10 *CN  THE CONSUMER STATED THE WIRING HARNESS HAD FRICTION BREAKS IN NUMEROUS SPOTS; ALONG THE FRAME AND ENGINE CAUSING A SHORT AND CAUSED THE TRUCK TO SHUT DOWN WITH NO WARNING. THE TRUCK HAD TO BE TOWED TO THE DEALER TWICE. UPDATED 07/22/10*JB",
        "vin": "1HTMMAAN95H"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/16/2006",
        "dateOfIncident": "10/16/2006",
        "fire": false,
        "manufacturer": "Navistar, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10171005,
        "products": [
            {
                "manufacturer": "Navistar, Inc.",
                "productMake": "INTERNATIONAL",
                "productModel": "4300",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "PLEASE ADVISE WHERE I MIGHT FIND OUT INFORMATION ABOUT INTERNATIONAL DUMP TRUCKS. THE DUMP BED BROKE AWAY FROM THE FRAME OF MY FATHER'S TRUCK. WE ARE TRYING TO DETERMINE IF THIS IS A COMMON OCCURRENCE. MODEL # INTERNATIONAL TRUCK 4300 SBA 4X2 THANK YOU FOR ANY INFORMATION YOU CAN PROVIDE. *NM",
        "vin": "1HTMMAAL25H"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/25/2006",
        "dateOfIncident": "11/01/2005",
        "fire": false,
        "manufacturer": "Navistar, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10148554,
        "products": [
            {
                "manufacturer": "Navistar, Inc.",
                "productMake": "INTERNATIONAL",
                "productModel": "4300",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "PREMATURE AND EXCESSIVE BRAKE WEAR ON 2005 4300 INTERNATIONAL TRUCKS, AS WELL AS 203 AND 2004, TO FRONT PASSENGER SIDE ONLY.  SEVEN OUT OF  NINE INTERNATIONAL TRUCKS SHOWED THIS PATTERN.  THREE OUT OF FOUR  2005 INTERNATIONAL TRUCKS HAD CRITICAL PAD WEAR ON THE FRONT PASSENGER SIDE ONLY, RESULTING IN LITTLE OR NO REMAINING PAD LEFT WHILE ALL OTHER BRAKING POINTS HAD EXTENDED LIFE REMAINING.  LOCAL INTERNATIONAL  SERVICE DEPARTMENT MAINTAINED THAT CONDITION WAS CRITICAL WITH BRAKING SYSTEM COMMING APART.THIS OCCURRED ON A 2005 INTERNATIONAL WITH JUST 46,000 ROAD MILES.     *AK",
        "vin": "1HTMMAAM45H"
    }
]