[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/27/2008",
        "dateOfIncident": "06/15/2004",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10246810,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "RAPTOR",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 KEYSTONE RAPTOR.  THE CONTACT NOTICED THAT THE OUTSIDE WALL WAS SEPARATING FROM THE BOTTOM OF THE VEHICLE.  THE VEHICLE WAS TAKEN TO AN RV MECHANIC, WHO STATED THAT THE FRAME FAILED.  THE VEHICLE HAS NOT BEEN DIAGNOSED BY THE DEALER.  THE FAILURE HAS BEEN OCCURRING EVER SINCE THE VEHICLE WAS PURCHASED.  THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "4YDF351265M"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/18/2007",
        "dateOfIncident": "07/10/2007",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10203328,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "RAPTOR",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "CARLISLE TIRE(225X75X15) ON MIDDLE AXLE ON KEYSTONE RAPTOR SEPARATED, LOOKED AS IF STEEL BELT HAD CUT INTO SIDEWALL AS A DEFECT.  TIRE IMMEDIATELY SHREDDED AND DAMAGED THE RIM AND THE TIRES ON BOTH AXLES AROUND IT.  ALSO DAMAGED AREA UNDER WHEEL AS WELL AS FENDER. CARLISLE WAS CONTACTED AND DENIED ANY WARRANTY AS TIRES WERE 2 YEARS OLD IN APRIL AND THIS HAPPENED IN JULY.  THEY REFUSED TO ACCEPT ANY RESPONSIBILITY FOR HIGH FAILURE RATE OF RV TRAILER TIRES.  *JB",
        "vin": "4YDF361305M"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/08/2007",
        "dateOfIncident": "07/09/2007",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10198888,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "RAPTOR",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "NANKANG RUBBER & TIRE CORP.",
                "productMake": "NANKANG",
                "productModel": "MISSION",
                "productYear": "9999",
                "size": "ST 225/75 R15",
                "type": "Tire"
            }
        ],
        "summary": "TL*THE CONTACT OWNS 2005 KEYSTONE RAPTOR TRAILER WITH MISSION TIRES SIZE ST2257515.  WHILE DRIVING 65 MPH SHE EXPERIENCED BLOW OUTS ON THE TWO FRONT AND REAR TIRES.  THERE WAS NO SIGN OF WEAR AND TEAR. THE TIRES WERE REPLACED WITH THE SAME BRAND AND SIZE.  THE ENGINE SIZE, NUMBER OF CYLINDERS, POWER TRAIN, AND FUEL SYSTEM INFORMATION WAS NOT APPLICABLE.  THE FAILURE MILEAGE WAS 2,500.",
        "vin": "4YDF351255M"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/27/2006",
        "dateOfIncident": "08/25/2006",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10169393,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "RAPTOR",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "I HAVE A 2005 KEYSTONE RAPTOR TOY HAULER TRAILER (3612DS) WITH 15\" MISSION \"D\" RATED TIRES ON THEM.  I HAVE HAD 4 BLOWOUTS IN THE LAST 6 MONTHS.  THE TIRES BLOWOUTS HAVE CAUSED DAMAGE TO THE UNDER-CARRIAGE OF MY TRAILER.  TWO OF THE BLOWOUTS OCCURRED ON ONE TRIP WHILE I WAS NOT CARRYING ANY CARGO IN THE REAR AT ALL.  THE OTHER TWO TIMES WERE WHILE I WAS CARRYING TWO FULL SIZE QUADS (THUS, THE WEIGHT WAS NOT AN ISSUE).  THESE TIRES ARE JUNK AND SHOULD NOT BE ALLOWED ON LARGER RIGS.  LARGE RIGS SHOULD BE MANDATED TO HAVE 16\" STEEL BELTED, COMMERCIAL TIRES.  THESE TIRE BLOWOUTS COULD CAUSE SERIOUS INJURIES OR EVEN DEATH.  *JB",
        "vin": ""
    },
    {
        "components": "SUSPENSION,POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "07/15/2006",
        "dateOfIncident": "05/04/2005",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10162457,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "RAPTOR",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE UNIT I PURCHASED  FROM ORANGEWOOD RV IN SURPRISE, AZ. LAST YEAR,WAS DEFECTIVE AND CAUSED CONSIDERABLE DAMAGE TO OUR TOW VEHICLE AND UNIT. THIS WAS CAUSED AS  A DIRECT RESULT OF A MANUFACTURER DEFECT IN THE 3 AXLES ON THE RIGHT/PASSENGER SIDE OF OUR RAPTOR-MODEL, WERE INSTALLED, 2 1/2 INCHES OFF-CENTER, WHICH CREATED DAMAGE TO VEHICLE, AS THE REAR END OF THE UNIT WAS OVER THE TRAFFIC LINE, AT TIMES AS MUCH AS 8-12 INCHES, AND SUSTAINED DAMAGE TO THE ROOF AND WAS AN EXCESSIVE STRAIN AND DAMAGE TO THE TOW VEHICLE, THAT IT REQUIRED EXTENSIVE REPAIR AND IMPROVEMENTS, AS THEY FRAUDULENTLY LED ME TO BELIEVE, I COULD TOW THE VEHICLE SAFELY, WITH THE VEHICLE I OWNED, WITHOUT ANY MODIFICATIONS OR IMPROVEMENTS NECESSARY, WHICH WAS NOT TRUE, AS I SOON LEARNED.  ALL OF THIS COMBINED, RESULTED  IN OVER $25,000.00 IN DAMAGES TO THE UNIT IT'S SELF AND THE TOW VEHICLE. I WONDER HOW MANY OTHER UNITS CAME OUT OF THE FACTORY IN THE SAME DEPLORABLE SHAPE???   R.G. MARKS.  *JB",
        "vin": "4YDF361315M"
    }
]