[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/26/2011",
        "dateOfIncident": "08/26/2010",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10421609,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "LAREDO",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 KEYSTONE LAREDO TRAILER.  THE CONTACT STATED THAT THE SPARE TIRE CARRIER, WHICH WAS CONNECTED TO THE BUMPER, FRACTURED AND CAUSED THE SPARE TIRE AND BUMPER TO DETACH FROM THE VEHICLE. THE DEALER AND MANUFACTURER WERE CONTACTED, BUT THE CONTACT LEFT A MESSAGE AND RECEIVED NO RETURN CALL.  THE VEHICLE WAS NOT REPAIRED. THE CONTACT REFERENCED NHTSA CAMPAIGN ID NUMBER: 10V063000 (TIRES: TEMPORARY/EMERGENCY SPARE TIRE) BUT WAS ADVISED THAT THE VIN WAS NOT INCLUDED IN THE RECALL.  THE WAS NO FAILURE OR CURRENT MILEAGE ON RECORD.  THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/23/2011",
        "dateOfIncident": "04/01/2011",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10408663,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "LAREDO",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 KEYSTONE LAREDO 25RL. THE CONTACT STATED THAT WHILE DRIVING, THE PIN BOX FRACTURED. THE CONTACT MENTIONED THAT THREE OF FOUR CONNECTING POINTS WERE TORN . THE VEHICLE WAS TAKEN TO A LOCAL WELDING SHOP WHO CONFIRMED THE FAILURE AND STATED THAT THE PIN BOX WAS DEFECTIVE AND PROVIDED A TEMPORARY FIX. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGE WAS 15,000.   UPDATED 07/08/11  *BF  PICTURES RECEIVED UPDATED 07.18.11",
        "vin": "4YDF25R275J"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/03/2011",
        "dateOfIncident": "12/18/2010",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10374033,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "LAREDO",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING IN THE US, I NOTICED EXCESSIVE FLEXING OF PINBOX OF FIFTHWHEEL TRAILER WHILE TOWING. VISIBLE UP-AND-DOWN MOVEMENT OF PINBOX FRAME RELATIVE TO THE FRONT STRUCTURE OF THE TRAILER.  UPON INSPECTION, SEVERAL CRACKS AND TEARS WERE DISCOVERED IN THE METAL OF THE TUBULAR CROSSMEMBERS ADJACENT TO THE WELDS WHERE THE PINBOX WAS ATTACHED TO THE FRAME. THE CRACKS WERE SPREADING, AND WOULD HAVE RESULTED IN COMPLETE SEPARATION OF THE PINBOX FROM THE TRAILER, AND RESULTANT SEPARATION OF THE TRAILER FROM THE TOW VEHICLE.  I CONTACTED KEYSTONE, THE RV MANUFACTURER, AND SUPPLIED PHOTOGRAPHS OF THE CRACKING. THEY EVENTUALLY DENIED RESPONSIBILITY, SAYING THE VEHICLE WAS OUT OF WARRANTY, AND SUGGESTED I CONTACT THE FRAME SUBCONTRACTOR, LIPPERT.  I CHOSE TO GET THE FRAME REPAIRED AT A FRAME WELDING FACILITY AT MY EXPENSE, AS WE HAD TO TRAVEL HOME WITH THE RAP FROM FLORIDA TO ONTARIO.    PHOTOGRAPHS AND COPIES OF EMAIL CORRESPONDENCE ARE AVAILABLE IF REQUIRED.    THE RESULT OF A COMPLETE SEPARATION OF THE FRAME/PIMPS WOULD OBVIOUSLY HAVE BEEN CATASTROPHIC, ESPECIALLY IF IT OCCURRED AT HIGHWAY SPEED.  *TR",
        "vin": "4YDF29R225J"
    }
]