[
    {
        "components": "STEERING,POWER TRAIN,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/13/2020",
        "dateOfIncident": "06/09/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11374512,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON PUBLIC STREET LOSS CONTROL DUE TO A POT HOLE IN THE STREET THE CAR LOST CONTROL FLIPPING SLIDING THEN FLIP UP RIGHT TILL IT CAME TO A STOP ON APT WALL THEN WHEN IT WAS ALL OVER AND DONE THE AIRBAG DEPLOYED GO OFF ON MY ARM RIGHT ARM GIVING ME SECOND TO THIRD DEGREE BURNS THE PURPOSE OF THE AIR BAG ? I HAVE BROKEN BACK CAR WAS TOTALED NOW I GOT CHRONIC PAIN EVERYDAY   I LOST MY CAR AM LIMITED ON MOBILEBILITY WAS GOING GET SCREWS PLACED ON MY BACK AND UN ABLE TO SET WALK OR STAND DO TO CHRONIC PAIN",
        "vin": "KNADC125556"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "01/19/2016",
        "dateOfIncident": "05/31/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10820989,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 KIA RIO. THE CONTACT STATED THAT THE AIR BAG AND SEAT BELT WARNING LIGHTS RANDOMLY FLASHED. THE VEHICLE WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 12V244000 (AIR BAGS); HOWEVER, THE CONTACT DID NOT RECEIVE A RECALL NOTIFICATION. THE VEHICLE WAS TO BE TAKEN TO THE DEALER FOR DIAGNOSTIC TESTING AND REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": "KNADE123066"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/08/2016",
        "dateOfIncident": "01/08/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10818838,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE CAR IS EXPOSED TO MOISTURE, EITHER FROM UNDERNEATH BY DRIVING THROUGH A SMALL PUDDLE OR FROM ABOVE IN A RAINSTORM, THE ENGINE COMPARTMENT GETS WET AND CAUSES THE SERPENTINE BELT TO SLIP. THIS RESULTS IN SUDDEN LOSS OF POWER STEERING AND ALTERNATOR FAILURE, WHICH CAN LEAD TO THE CAR'S POWER CUTTING OUT IN THE MIDDLE OF THE ROAD.  THIS IS AN OBVIOUS DRIVING HAZARD, BUT I AM TOLD THAT THIS IS A COMMON ISSUE DUE TO THE CONSTRUCTION OF THE ENGINE COMPARTMENT IN KIA VEHICLES RATHER THAN A PRECIPITATING MECHANICAL FAILURE CAUSING IT.",
        "vin": "KNADC125056"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/24/2015",
        "dateOfIncident": "09/23/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10776432,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 KIA RIO. WHILE DRIVING APPROXIMATELY 40 MPH, THE VEHICLE STALLED WITHOUT WARNING. THE CONTACT HAD TO MANEUVER THE VEHICLE TO THE SIDE OF THE ROAD TO A COMPLETE STOP. THE VEHICLE WOULD NOT START. THE VEHICLE WAS TOWED TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE TIMING BELT FRACTURED AND NEEDED REPLACEMENT. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE CONTACT ALSO STATED THAT THE VEHICLE WAS INSPECTED AND TAGGED WITH LICENSE PLATES ONE HOUR BEFORE THE INCIDENT. THE APPROXIMATE FAILURE MILEAGE WAS 65,125.",
        "vin": "KNADC165056"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "11/23/2014",
        "dateOfIncident": "11/23/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10660357,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BLOWER STOPPED BLOWING AIR. FOR A SHORT WHILE IT WOULD COME ON,  RARE OCCASIONS AND EVENTUALLY STOPPED WORKING. CHANGED THE BLOWER MOTOR AND RESISTOR, STILL DIDN'T WORK. PULLED THE DASH APART TO CHANGE THE BLOWER SWITCH AND FOUND THAT IT HAD MELTED THE PLASTIC CONNECTOR. NOT SURE WHAT CAUSED THE MALFUNCTION, HOWEVER ONCE THE NEW SWITCH WAS PUT IT THE BLOWER WORKED.   *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/29/2014",
        "dateOfIncident": "08/29/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10629331,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "NOT REALLY A SAFETY ISSUE BUT MAYBE YOU CAN HELP, PLEASE. I CHECK ENGINE LIGHT CAME ON TELLING ME I'M AT LESS THAN 90% EFFICIENCY RELATIVE TO POLLUTION. WHEN THE MECHANIC CHECKS THE CO2 AND OTHER POLLUTION REQUIREMENTS I'M OK. I STILL GET GREAT MILEAGE AND GOOD POWER.  THE PROBLEM IS THE  COMPUTER SAYS THE CONVERTER IS OFF AND HENCE CAN'T GET A STICKER BUT THE CAR IS NOT POLLUTING ?? IF I LIVED OUT SIDE A BIG CITY WHERE THEY DO NOT TRACK THIS STUFF THERE WOULD BE NO PROBLEM. PS THE COST TO REPLACE THE CAT CONVERTER IS OVER $1400.00. WHILE IT US STILL 90% EFFECTIVE??? WHAT GIVES PLEASE HELP.  THANKS,  *TR",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/16/2014",
        "dateOfIncident": "11/18/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10588777,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "KIA RIO 2005 IS A VERY POORLY BUILT CAR.  THE PASSENGERS DOOR WILL NOT OPEN, A MECHANISM IN THE DOOR IS BROKEN.  SINCE THE DOOR WON'T OPEN NO ONE SEEMS TO KNOW HOW TO REPAIR THIS PROBLEM.  THE DOOR PANEL CAN NOT BE REMOVED FROM THE DOOR WITHOUT THE DOOR BEING OPEN.  NEVER AGAIN WILL I BUY A KIA OF ANY KIND.  *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/15/2014",
        "dateOfIncident": "06/16/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10572593,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2005 KIA RIO (VIN PROVIDED LATER) PURCHASED 2006, LOW MILES. SUMMER 2011 CAR STALLED, STOPPED & CHECK ENGINE LIGHT CAME ON & HAD IT TOWED TO THE NEAREST SHOP, NTB. REPLACED TIMING BELT & NO DAMAGE TO MY MOTOR. I FOUND OUT THE TIMING BELT NEEDED CHANGING AT 60K MILES (MINE WAS LOWER). THE MECHANIC WASN'T ABLE TO DETERMINE A REASON FOR THE CHECK ENGINE LIGHT. ANOTHER SUGGESTED A BAD SENSOR & WIPED SOMETHING OFF UNDER THE HOOD. THE LIGHT WENT OFF AFTER DRIVING LESS THAN 5 MILES. REPLACED THE ALTERNATOR APRIL 2013 (NEW ALTERNATOR, BELT & PARTS STILL UNDER WARRANTY). JUNE 2013 THE CHECK ENGINE LIGHT STARTED COMING ON WHEN PARKED UPWARD ON AN STEEP HILL, ESP WHEN OUTSIDE TEMP WAS VERY HOT (TX). THE LIGHT WOULD REMAIN ON UNTIL AFTER PARKING IT IN A COVERED GARAGE & DRIVING HRS LATER. JULY 2013 MANDATORY CAR INSPECTION. WEEK OR 2 LATER, PROBLEMS W/ RPM STARTED; DURING TAKE AFTER IDLE. ABOUT 2WKS LATER, AC SPEED SUDDENLY SLOWED & BECAME WARMER. 2DAYS LATER CHECK ENGINE LIGHT ON & A STRANGE NOISE NEAR THE DRIVER'S SIDE. AGAIN, TOWED TO THE NEAREST SHOP, THE SAME NTB. ALL ELECTRICAL COMPONENTS WAS STILL WORKING. AT THE SHOP THE CAR STARTED BUT NOT LONG. THEY WERE PUZZLED. AFTER 2DAYS I WAS TOLD MY MOTOR WAS BAD & NEEDED REPLACED. NO ONE HAD AN EXPLANATION.I HAD TO HAVE MY CAR, ONLY TRANSPORTATION FOR ME & MY KIDS TOWED HOME. I TALKED TO DIFFERENT MECHANICS THAT AGREE I HAVE A BAD SENSOR & CATALYST WHICH CAUSED MY MOTOR TO LOCK (PRE-IGNITION). THERE ARE SEVERAL BLOGS/ARTICLES W/THIS SAME PROBLEM. HOWEVER, KIA HAS NEVER SAID ANYTHING ABOUT THE 2005 RIO FUEL PROBLEMS, ONLY THE 2004 & SUPPOSEDLY CORRECTING IT. BUT IT WASN'T & MECHANICS CAN'T DIAGNOSE IT. SOMETHING IS WRONG & NEEDS INVESTIGATING. A FATAL ACCIDENT COULD HAVE OCCURRED IF I HAD BEEN DRIVING ON THE HWY. KIA SHOULD TAKE RESPONSIBILITY FOR LOST $ AND TIME BC THEY ONLY BANDAGED THE PROBLEM & NOT ACTUALLY FIXING IT.",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/20/2014",
        "dateOfIncident": "01/08/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10560693,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER DOOR WON'T OPEN.  AND THIS IS A PROBLEM THAT MANY KIA RIO OWNERS HAVE WITH THEIR CAR.  CAR IS A PIECE OF JUNK.  IT IS BY FAR THE WORST CAR I HAVE EVER OWNED.   *TR",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/08/2013",
        "dateOfIncident": "09/25/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10551514,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE STOPPED IN TRAFFIC ON HWY, WIFE WAS IN DANGER OF BEING HIT BY OTHER VEHICLES,NO POWER TO GET TO EDGE OF ROADWAY ON BRIDGE, HEAVY CONSTRUCTION, HAD TO CLIMB OUT PASSENGER DOOR, DOWN EMBANKMENT TO SAFETY. TOWED VEHICLE HOME TO FIND ENGINE LOCKED UP. MAINTENANCE DONE REGULAR BELTS, TIRES,OIL CHANGES AND BATTERY REPLACED. ONLY FUEL GAUGE ISSUE IS ALL PROBLEMS, ASK DEALER WAS TOLD TO BRING IN FOR ESTIMATE 300.00 TO CHECK.AFTER ISSUE ON HIGHWAY FIND OUT TIMING BELT AND ENGINE PROBLEMS HAVE OCCUR ON THIS MODEL SINCE 2001. SAD FOR VETERAN UNABLE TO MAKE REPAIRS DUE TO DISABILITY. NEVER BUY OR RECOMMEND KIA TO ANYONE.  *TR",
        "vin": "KNADC125256"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/21/2012",
        "dateOfIncident": "05/17/2012",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10459179,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 KIA RIO. THE CONTACT STATED THAT THE DRIVER WAS DRIVING 20 MPH WHEN SHE ATTEMPTED TO SLOW DOWN BUT THE BRAKES FAILED. THE VEHICLE COASTED INTO AN ALLEY. WHILE THE VEHICLE WAS COASTING, THE CONTACT SMELLED BURNING WIRES. SMOKE BEGAN TO RISE FROM THE HOOD ONCE THE VEHICLE WAS STOPPED. THE CONTACT ATTEMPTED TO EXIT THE VEHICLE, BUT WAS RESTRAINED BY THE SEAT BELT AND SUFFERED NECK AND SHOULDER INJURIES. BOTH THE CONTACT AND THE DRIVER SUCCESSFULLY EXITED THE VEHICLE AND NOTICED THAT SPARKS AND FLAMES WERE SEEN UNDER THE HOOD. THE FIRE DEPARTMENT WAS NOTIFIED AND EXTINGUISHED THE FIRE. THE CAUSE OF THE FIRE WAS UNKNOWN. THE VEHICLE WAS TOWED TO THE DEALER. THE DEALER ADVISED THE CONTACT TO TOW THE VEHICLE TO AN AUCTION. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE IS UNKNOWN.",
        "vin": "KNADC125756"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "12/27/2010",
        "dateOfIncident": "11/01/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10372600,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER SEAT BELT LATCH ASSEMBLY IS SPLIT IN TWO.  THERE WERE NO EVENTS LEADING UP TO THE EVENT, IT JUST HAPPENED ONE DAY.  IT HAS NOT BEEN REPAIRED OR REPLACED, IT IS CURRENTLY BEING HELD TOGETHER WITH DUCT TAPE. *TR",
        "vin": "KNADC125256"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/10/2010",
        "dateOfIncident": "10/07/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10359902,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "GOING 70 MPH ON INTERSTATE 4 IN ORLANDO FL MY 2005 KIA RIO BROKE THE TIMING BELT CAUSING THE VEHICLE TO LOSE ALL ENGINE POWER & ROLLED TO A STOP WE WERE ABLE TO PULL THE CAR OVER TO THE RIGHT LANE & BARELY AVOIDED GETTING REAR ENDED. *TR",
        "vin": "KNADC125556"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/19/2010",
        "dateOfIncident": "07/28/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10356310,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "KIA PLACED A BULLETIN WITH YOU ON 1/1/05,#TSB82,#10015272.  APPARENTLY  KIA  THOUGHT THAT WAS ENOUGH.  MY KIA WAS PURCHASED 7/21/05.  I WAS TOLD I HAD \"BUMPER TO BUMPER COVERAGE IF I PURCHASED THE ADDITIONAL 4,000. EXTENDED WARRANTY. THEY WERE REQUIRED TO FURNISH ME WITH  A COMPLETE WARRANTY DISCLOSURE BEFORE PURCHASE.  THEY DID FURNISH ME WITH A BOOKLET CALLED WARRANTY AND CONSUMER INFORMATION MANUAL AND A PAMPHLET CALLED START UP TIPS FOR YOUR KIA.  I DID READ THESE. AND THE TIMING BELT ISN'T MENTIONED.  LATER WHEN I READ MY OWNERS MANUAL I DID NOTICE THAT  THE MAINTENANCE REQUIREMENTS DID MENTION THE TIMING BELT, IT SHOULD BE CHECKED AT 30,000 MI, 60,000MI AND POSSIBLY CHANGED AT 105,000.  KIA DOES CLAIM 100,000 WARRANTY, AND I HAD THE BUMPER TO BUMPER COV, SO I STILL FELT PRETTY CONFIDENT IN MY CAR.   IF KIA HAD COMPLETELY DISCLOSED ALL THE MAINTENANCE AT THE TIME OF PURCHASE I WOULD HAVE WALKED.  AT 38,000 MI I WAS ON MY WAY TO WA.  I WAS JUST ABOUT TO THE TOP OF RICE HILL WHEN SOMETHING HAPPENED.  6 LANES OF 70MPH TRAFFIC, CONCRETE ON ALL SIDES AND NOWHERE TO GO, WHEN THE CAR  LOST POWER.  IT WAS VERY DISORIENTING   THE ENGINE REVVED BUT NO POWER, NO CHECK ENGINE LIGHT, NOTHING,I WAS DUMBFOUNDED. I PUT MY FLASHERS ON AND WAS ABLE TO COAST TO THE RT. LANE.  WE PUSHED IT OVER THE TOP OF RICE HILL AND COASTED TO THE SHOULDER.  I CALLED KIA, THEY TOLD ME I HAD NO COVERAGE, BECAUSE MY CAR WAS A WEEK PAST 5 YRS.  WE TOWED IT  TO KIA  WHERE THEY TOLD ME I WASN'T COVERED.  SO I CALLED KIA  AND THEY TOLD ME IT WAS UP TO THE SERVICE MAN.. I WENT BACK TO KIA, AND THE MANAGER TOLD ME I NEEDED TO DO A DIAG TEST ($174.) WHICH I KNEW WAS IMPOS. BECAUSE THE CAR WON'T START. AFTERWARD THE SERVICE MAN TOLD ME HE HAD LOOKED AT MY CAR AND THE TB  WAS GONE BUT THE PISTONS WERE FINE WHICH IS RARE.  THEY WON'T  FIX IT.  I WENT ONLINE AND FOUND 100 CONSUMERS WITH BLOWN ENGINES AND DEFECT. TIMING BELTS. WHATS UP?  THIS IS DANGEROUS!  IT CAN CAUSE ACCIDENTS!  I WAS LUCKY!  DO SOMETHING. *TR",
        "vin": "KNADC125056"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/23/2010",
        "dateOfIncident": "08/20/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10351205,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 KIA RIO STALLING PROBLEM.  I'VE HAD THE CAR IN FOR REPAIR 4-5 TIMES OVER THE LAST  18 MONTHS, AND DEALERSHIP SAID THEY CAN'T FIND ANY PROBLEM. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/19/2010",
        "dateOfIncident": "10/01/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10331273,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 KIA RIO. THE CONTACT STATED THAT WHILE DRIVING, THE VEHICLE WOULD SUDDENLY STALL. IT WOULD RESUME NORMALLY AFTER SHE DEPRESSED THE ACCELERATOR PEDAL. THE FAILURE BECAME PROGRESSIVELY WORSE OVER TIME. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALERSHIP THREE TIMES FOR AT LEAST A WEEK SO THAT THE DEALER COULD DUPLICATE THE FAILURE AND FIND A CAUSE FOR THE FAILURE. THE DEALER STATED THAT THE PROBLEM COULD HAVE BEEN THE FUEL FILTER OR SENSOR. THE FUEL FILTER AND SPARK PLUGS WERE REPLACED BUT THE FAILURE CONTINUED. THE CONTACT CALLED THE MANUFACTURER AND FILED A COMPLAINT. THE VEHICLE WAS CURRENTLY AT THE DEALERSHIP AND THE CONTACT DID NOT FEEL IT WAS SAFE TO DRIVE. THE FAILURE MILEAGE WAS APPROXIMATELY 45,000. THE CURRENT MILEAGE WAS APPROXIMATELY 54,000.  THE SENSORS AND FUEL PUMP WERE REPLACED, HOWEVER THE VEHICLE CONTINUED TO STALL. UPDATED 06/22/10.*JB  UPDATED 08/11/10. *LJ  UPDATED 10/05/10*JB",
        "vin": "KNADC125856"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/03/2010",
        "dateOfIncident": "01/20/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10316328,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE LIGHT COMES ON INTERMITTENTLY.  WHEN A DIAGNOSTIC TEST IS RUN ON THE CAR, ERROR P0101 IS DETECTED.  THIS ERROR, \"MASS AIR FLOW CIRCUIT RANGE PERFORMANCE PROBLEM,\" CAN BE CORRECTED BY REPLACING THE MASS AIR FLOW SENSOR IN THE ENGINE.  HOWEVER, THIS ERROR HAS OCCURRED TWICE IN MY CAR, THE INCIDENT IN JANUARY BEING THE THIRD.  IF IGNORED, THE CHECK ENGINE LIGHT MAY GO OFF AFTER TIME.  SOMETIMES WHEN THE PROBLEM OCCURS, THERE IS HESITATION IN THE ENGINE WHEN ACCELERATING AFTER COMING TO A COMPLETE STOP.  I HAVE NOTICED THAT THE HESITATION IS WORSE WHEN THE CAR IS WARMED UP AND HAS BEEN DRIVING FOR OVER 20 MINUTES.  NO ONE AT KIA HAS BEEN ABLE TO FIX THE PROBLEM PERMANENTLY AND IT IS NO LONGER COVERED UNDER WARRANTY, SO I HAVE TO PAY TO REPLACE THIS SENSOR MYSELF. *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/07/2009",
        "dateOfIncident": "10/28/2009",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10294786,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD A 2005 KIA RIO BURN DOWN FROM AN APPARENT ELECTRICAL FIRE INSIDE THE DASHBOARD. I WAS DRIVING HOME ONE DAY FROM WORK AND SMOKE STARTED TO SEEP THROUGH THE SEAL AROUND THE DASH. I IMMEDIATELY GOT OFF THE ROAD AND CALLED 911. WITHIN 5MIN MY CAR BURST INTO FLAMES AND THE WHOLE DASHBOARD STARTED TO MELT. *TR",
        "vin": "KNADC125256"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/17/2009",
        "dateOfIncident": "10/30/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10292631,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG DID NOT DEPLOY DURING A HEAD ON COLLISION. *TR",
        "vin": "KNADC165756"
    },
    {
        "components": "SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "09/25/2009",
        "dateOfIncident": "09/18/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10285207,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR SON WAS DRIVING A 2005 KIA RIO 15 MILES SOUTH OF MCMINNVILLE, OR WHEN HE WENT OFF THE ROAD AND FLIPPED THE CAR.  THE FEMALE PART OF THE SAFETY BELT CLASP FAILED WHICH RESULTED IN HIM BEING THROWN AROUND THE CAB.  HE ENDED UP IN THE CAB ON THE ROOF IN THE BACK SEAT.  HE IS STILL VERY SORE AND HAS BACK PAIN. *TR",
        "vin": "KNADC125156"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/21/2009",
        "dateOfIncident": "11/01/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10284768,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 KIA RIO. WHILE DRIVING AT LOWS SPEEDS THE VEHICLE BEGAN TO RANDOMLY HESITATE. THE FAILURE USUALLY OCCURRED  WHEN THE ENGINE WAS COLD OR IT HAS NOT RAINED WITHIN A FEW HOURS. THE VEHICLE BEGAN TO DRIVE NORMALLY WHEN THE ENGINE WAS SHUT OFF AND RESTARTED. THE DEALER HAS MADE SEVERAL ATTEMPTS TO DIAGNOSE THE FAILURE. TWO WEEKS LATER THE DEALER WAS UNABLE TO DUPLICATE THE FAILURE. AN AUTHORIZED MECHANIC DIAGNOSED THE FAILURE ON A THIRD VISIT TO THE DEALER AND STATED THAT THEY WERE ABLE TO REPAIR THE VEHICLE; HOWEVER, THEY WERE UNABLE TO SAY WHAT COMPONENT WAS REPAIRED. THE FAILURE CONTINUED TO OCCUR. THE FAILURE MILEAGE WAS ESTIMATED TO BE 9,000 AND THE CURRENT MILEAGE WAS 39,000.",
        "vin": "KNADC125X56"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/08/2009",
        "dateOfIncident": "03/23/2009",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10264504,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 KIA RIO.  WHILE DRIVING APPROXIMATELY 50 MPH, THE VEHICLE BURST INTO FLAMES.  THE CONTACT PULLED ONTO THE HIGHWAY AND, AFTER A SHORT TIME OF ACCELERATING, THE VEHICLE BEGAN TO DECELERATE.  SHE TOOK PRESSURE OFF OF THE ACCELERATOR PEDAL, BUT NOTHING CHANGED.  SHE ATTEMPTED TO APPLY PRESSURE TO THE ACCELERATOR PEDAL, BUT THE VEHICLE STILL DID NOT ACCELERATE.  SHE PULLED OVER TO THE SIDE OF THE ROAD AND NOTICED STEAM UNDERNEATH THE HOOD.  SHE PULLED THE LATCH TO LOOSEN THE HOOD AND NOTICED SMOKE COMING FROM UNDERNEATH THE HOOD ALONG WITH A BURNING ODOR.  ANOTHER DRIVER ARRIVED WITH A FIRE EXTINGUISHER.  A POLICE OFFICER ARRIVED AND USED THE FIRE EXTINGUISHER ON THE ENGINE COMPARTMENT.  A POLICE REPORT WAS FILED.  THE FIRE APPEARED TO CEASE, BUT THEN IGNITED AGAIN.  THE FIRE DEPARTMENT ARRIVED AND EXTINGUISHED THE FLAMES FOR GOOD.  THE VEHICLE WAS DESTROYED.  THE CONTACT CONSULTED THE MANUFACTURER, WHO PROVIDED HER WITH A CASE NUMBER AND INFORMED HER THAT THE MATTER WOULD BE INVESTIGATED.  SHE HAS NOT YET HEARD BACK REGARDING THE INVESTIGATION.  THE CURRENT AND FAILURE MILEAGES WERE APPROXIMATELY 37,000.",
        "vin": "KNADC125X56"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/24/2009",
        "dateOfIncident": "02/19/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10259853,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MY KIA RIO DIED IN THE MIDDLE OF THE STREET.  IT WOULDN'T TURN OVER SO I HAD IT TOWED TO THE DEALER.  THEY REPORTED THAT THE ENGINE NEEDS TO BE REPLACED AT A COST OF $6000.  THE CAR IS STILL UNDER THE 100,000 MILE WARRANTY SINCE IT ONLY HAS 80,000 MILES ON IT.  THE DEALER IS REFUSING TO HONOR THE WARRANTY, SAYING THAT MAINTENANCE ISSUES CAUSED THE FAILURE.  KIA IS DEFRAUDING THE AMERICAN PUBLIC BY STATING IT HAS A 100,000 MILE WARRANTY THAT IT DOES NOT HONOR.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/28/2007",
        "dateOfIncident": "09/14/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10204401,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SON WAS DRIVING HIS 2005 KIA RIO HOME FROM WORK ONE NIGHT WHEN THE CAR STALLED. HE WAS ABLE TO GET IT INTO A PARKING LOT WHERE ONE OF OUR COUNTY SHERIFFS TRIED TO GIVE HIM A JUMP. THE CAR WOULD NOT TURN OVER. MY SON TOOK THE CAR TO THE DEALERSHIP ON MONDAY. HE WAS TOLD THAT THE WARRANTY HAD BEEN DENIED DUE TO LACK OF MAINTENANCE. THEIR DEFINITION OF THAT WAS MY SON WENT OVER ON TWO OIL CHANGES. I DO NOT UNDERSTAND WHERE TWO OIL CHANGES WOULD CAUSE A CAR TO  LOCK UP. BECAUSE OF THE TWO OIL CHANGES KIA WILL NOT LOOK AT THE CAR. THEY ARE MAKING US TAKE THE PIECE OF JUNK THEY SOLD US TO ANOTHER DEALERSHIP AND HAVE THEM LOOK AT IT TO SEE WHAT IS WRONG WITH THE CAR. IT HAS BEEN SITTING ON THEIR LOT FOR 2 WEEKS NOW. I HAVE CALLED THEIR CONSUMER AFFAIRS DEPARTMENT AND THERE AGAIN THEY WERE NO HELP. SO NOW I TAKE THE CAR TO ANOTHER DEALERSHIP TO FIND OUT WHAT IS THE MATTER WITH IT BECAUSE KIA WONT EVEN LOOK AT THERE OWN CAR. I AM NOT BEING TOLD WHAT IS AND IS NOT COVERED UNDER WARRANTY. IN JUNE OF THIS YEAR MY SON WAS TOLD THAT THERE WAS A LOWER BEARING KNOCK IN HIS CAR. HE CALLED THE SERVICE MANAGER AT THE DEALERSHIP WHO NEVER RETURNED HIS CALL TO DISCUSS IT. IT THAT IS WHAT HAS HAPPENED TO THE CAR THEN IT HAS NOTHING TO DO WITH AN OIL CHANGE IT IS THE OIL PUMP WHICH IS THEIR PROBLEM AND THEY AREN'T GOING TO FIX IT. BUYERS BEWARE IF YOU BUY A KIA AND GO OVER ON ANY OF YOUR OIL CHANGES THEY WILL NOT COVER YOUR CAR UNDER WARRANTY DUE TO LACK OF MAINTENANCE. THEY WILL GET YOU IN THEIR SHOWROOM TO BUY THEIR CARS BECAUSE THE WARRANTY IS SO GREAT AND THEN THEY DON'T WANT TO COVER IT IF SOMETHING HAPPENS TO THE CAR. THAT CAR WAS THE BIGGEST MISTAKE I HAVE EVER MADE IN A VEHICLE PURCHASE.  *JB",
        "vin": "KNADC125X56"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/20/2007",
        "dateOfIncident": "08/04/2007",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10200116,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 KIA RIO.  WHILE DRIVING 20 MPH, THE AIR CONDITIONER BUTTON BECAME STUCK WHEN THE CONTACT ATTEMPTED TO TURN IT OFF.  AS THE CONTACT AND PASSENGER ATTEMPTED TO CORRECT THE FAILURE, SMOKE BEGAN TO RISE AND THEN FLAMES WERE PRESENT NEAR THE BUTTON AREA.  THE PASSENGER SNATCHED OFF THE CUBBY HOLE UNDER THE CD PLAYER TO FIND FLAMES SHOOTING APPROXIMATELY SIX INCHES HIGH.  THE CURRENT MILEAGE WAS 95,000 AND FAILURE MILEAGE WAS 94,000.",
        "vin": "KNADC125756"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/07/2007",
        "dateOfIncident": "05/01/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10189937,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RIGHT SIDE OF THE VEHICLE HAS A STEERING RACK PROBLEM.  WHAT MAKES ME INTERESTED IN THIS PROBLEM  WAS THE  A RECALL OF OVER 350 VEHICLES IN CANADA FOR THE 2004 MODELS.  THE DEALER , AURORA KIA OF FAIRBANKS, AS WELL AS THE KIA CONSUMER CARE, DID  NOT SEEM TO WANT TO ADDRESS THE CONCERN WITH ME.  I HAVE ASKED THEM ON SEVERAL OCCASIONS TO MAKE REPAIRS DUE TO A NOISE I HEAR FROM THAT SIDE ,AND WHICH THE SERVICE ADVISOR AT AURORA KIA OF FAIRBANKS HEARD AS WELL, BUT SO FAR NO REPAIRS  WERE BEING MADE.  *AK",
        "vin": "KNADC125356"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/03/2006",
        "dateOfIncident": "10/23/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10172568,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "FAILURE OF VEHICLE REPAIR X 3 WEEKS.  3 DIFFERENT REPAIRS, STILL NOT FIXED.  KIA REFUSES TO GIVE LOAN/RENTAL TO DRIVE WHILE PERFORMING WARRANTY WORK.  CAR WILL NOT RUN, STOPPED IN MIDDLE OF INTERSTATE ALMOST KILLING MY COLLEGE STUDENT X 3+.*JB",
        "vin": ""
    },
    {
        "components": "SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "07/11/2006",
        "dateOfIncident": "09/30/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 1,
        "numberOfInjuries": 3,
        "odiNumber": 10162145,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SEPTEMBER 30, 2005 A KIA RIO WAS INVOLVED IN A ROLL OVER WRECK THAT RESULTED IN THE DEATH OF ONE TEENAGER WHO WAS EJECTED FROM THE VEHICLE DURING THE ROLL OVER AND THERE WERE INJURIES TO OTHER PASSENGERS AS WELL.  ON OCTOBER 19, 2005, AN INVESTIGATING OFFICER WENT TO THE PLACE WHERE THE VEHICLE HAD BEEN TOWED AND REMOVED THE THREE BACK SEAT BELTS BECAUSE HE DISCOVERED THAT TWO OF THE BACK SEAT BELTS WOULD NOT HOLD THEIR BUCKLE.  THE TEENAGER WHO WAS EJECTED AND DIED WAS IN THE SEAT WHERE ONE OF THOSE TWO BELTS WERE LOCATED.    *JB",
        "vin": "KNADC125656"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/07/2006",
        "dateOfIncident": "02/28/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10152111,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED THE BRAKES ON THE VEHICLE HAVE BEEN MAKING LOUD SCREECHING NOISES EVERY TIME THE BRAKE PEDAL IS DEPRESSED AT 10MPH.  THE VEHICLE HAS BEEN TAKEN TO A SERVICE DEALER FOR REPAIR WHERE THEY DETERMINED THE DISCS WERE SLIGHTLY OFF CENTER.  AFTER THE REPAIR, THE NOISE CONTINUED.  THE DEALER WAS CONSULTED AGAIN, AND WAS UNABLE TO DETERMINE THE CAUSE OF THE NOISE.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/25/2006",
        "dateOfIncident": "01/24/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10148544,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "AT ABOUT 5,000 MILES OR MAYBE EVEN SOONER I BEGAN TO DETECT AND HEAR SOMETHING THAT  SOUNDED AND ACTED LIKE THE TRANSMISSION.  EACH TIME TAKING  VEHICLE  FOR OIL CHANGE I TOLD THE  SERVICE TECHNICIAN  TO CHECK THE TRANSMISSION. IT JUMPED IN 2ND GEAR WHILE  IN REVERSE. THEY FORGOT EACH TIME, AND DUE TO THE FACT THAT MY APPOINTMENT  WAS EITHER CANCELLED OR NO OIL CHANGE PERSON WAS  THERE WHEN I TOOK VEHICLE  AT SCHEDULED TIME,  IT WENT UNRESOLVED UNTIL THE OIL CHANGE ON JANUARY '6, 2006.    DURING THE JANUARY 6, 2006  OIL CHANGE THE MECHANIC SAID THAT TRANSMISSION DIDN'T SOUND RIGHT.  MADE ANOTHER APPOINTMENT  TO BRING  VEHICLE  BACK FOR INSPECTION. IT TOOK 3 MORE WEEKS TO GET THE APPOINTMENT. I LEFT THE CAR AT 9 AM, WENT  5 MILES HOME, AND THEY ADVISED  ME ON THE TELEPHONE   THAT  IT  WAS THE CLUTCH NOT THE TRANSMISSION.  THE WARRANTY ON THE CLUTCH EXPIRED AT 12,000 MILES.  THE MILEAGE AT TIME  OF THE FAILURE EXCEED THAT BY 2,000 MILES.  THE CHARGE WOULD BE  $668. 00.  I THINK BILL BYRD KIA OF PANAMA CITY FLORIDA  PURPOSELY LET THE WARRANTY  EXPIRE BY PUTTING OFF APPOINTMENTS . I BOUGHT THE CAR FROM A DEALER IN ANOTHER STATE, AND THEY  DIDN'T WANT TO DO THE WARRANTY WORK, AND THEY  KNEW IT WAS THE CLUTCH. BY THE TIME FOR NEXT SCHEDULED APPOINTMENT 3 WEEKS LATER IT WOULD BE OVER THE 12,000 MILES. I  WAS FURIOUS AND DID NOT INTEND TO TAKE THIS WITHOUT A FIGHT. THE MECHANIC SAID IT WAS A PROBLEM OF WEAR AND TEAR, AND IMPROPER DRIVING OF A STANDARD SHIFT. I THINK A CLUTCH SHOULD LAST LONGER THAN 12,000 MILES.  AS FAR AS IMPROPER DRIVING OF A STANDARD SHIFT I HAVE BEEN DRIVING STANDARD SHIFTS FOR 48 YEARS, INCLUDING SCHOOL BUSES  AND DUMP TRUCKS.  *AK",
        "vin": "KNADC125456"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/13/2005",
        "dateOfIncident": "12/03/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10145062,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG DEPLOYED WITHOUT IMPACT TO THE VEHICLE OR ANY OTHER VEHICLE PRESENT.  VEHICLE IN QUESTION IS A 2005 BRAND NEW KIA RIO [XXX]. MYSELF & DAUGHTER WERE DRIVING ON THE HIGHWAY ON DEC 3RD 2005, WE RAN OVER A TIRE TREAD ON THE HIGHWAY, PROCEEDED MAYBE 1/2 A MILE & THE AIRBAG DEPLOYS FROM OUT OF NOWHERE. CAR WAS TOWED TO THE KIA DEALERSHIP, IT TOOK THEM A WEEK TO DETERMINE THAT THEY WERE NOT GOING TO REPAIR THE VEHICLE WHICH IS AN OBVIOUS DEFECT. I WAS TOLD BY THE SERVICE MANAGER & TECHNICIANS THAT THERE WAS NO IMPACT TO THE VEHICLE & AIRBAG SHOULD NOT HAVE DEPLOYED. KIA ADVISED ME TO GO THROUGH MY INSURANCE, THEY ARE NOT RESPONSIBLE. I AM AT THE MERCY OF KIA, I AM UNABLE TO FIND AN ATTORNEY THAT WILL PLEAD MY CASE BECAUSE MYSELF & MY DAUGHTER DID NOT HAVE SERIOUS INJURIES AT THE TIME OF THE INCIDENT, WE SUBSTAINED NECK & HEAD INJURY BUT NOTHING THAT WOULD WARRANT HOSPITALIZATION, THANK GOD. I NEED HELP & THERE IS NO ONE TO FIGHT ON OUR BEHALF, THIS IS THE ONLY VOICE I HAVE.  *NM UPDATED 07/17/2012 *JS    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6)",
        "vin": "KNADC125856"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/24/2005",
        "dateOfIncident": "10/23/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10140625,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THE CONSUMER STATED SEVERAL TIMES WHILE AT A STOP LIGHT, THEN AGAIN AT A STOP SIGN WITH HER FOOT ON THE GAS PEDAL WITH THE VEHICLE IN DRIVE AND THE GEAR SHIFTED INT NEUTRAL.  THE PROBLEM ALSO OCCURRED WHEN DRIVING AT VERY LOW SPEEDS IN THE PARKING LOT.  THE GEAR SHIFTED INTO NEUTRAL AGAIN.  WHILE  DRIVING AT 65 MPH IN A RAIN STORM THE VEHICLE MADE A NOISE AND THE DASHBOARD LIGHTS CAME ON.  THE CONSUMER PULLED OFF OF THE FREEWAY AND TURNED THE VEHICLE OFF.  THE CONSUMER STARTED THE VEHICLE, BACKED UP AND IT WORKED FINE.  THE VEHICLE HAD 3400 MILES ON IT.  THE PROBLEM STARTED AT 2000 MILES.  THE VEHICLE HAD BEEN CHECKED AT A LOCAL DEALERSHIP.  THE MECHANIC STATED THAT THE TRANSMISSION SENSORS WERE FINE.  *AK  (11/29/05)  THE OVERDRIVE WOULD SHUT OFF AT 65 MPH.  *SC",
        "vin": "KNADC125956"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/24/2005",
        "dateOfIncident": "07/18/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10134084,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THE CALLER SAID THE VEHICLE LOSES POWER WHEN  ACCELERATING. HEIT ONLY HAPPENS WHEN VEHICLE ACCELERATES FROM A STANDSTILL. NO LIGHTS COME ON TO LET HIM KNOW THIS IS GOING TO HAPPEN. VEHICLE DOES IT AFTER IT WARNS UP. HE SAID THE MORE HE DRIVES IT THE WORSE IT GETS. HTHE VEHICLE STALLS WHEN COMING TO A STOP. THIS HAPPENS RANDOMLY AND WITH NO WARNING. HE HAS TAKEN IT TO THE DEALER THREE TIMES, AND THEY SAID THERE WAS NOTHING WRONG WITH IT, AND IT WAS A NORMAL CHARACTERISTIC OF THE VEHICLE. MANUFACTURER SAID IT NEEDSEDTO BE DUPLICATED BY AN AUTHORIZED TECHNICIAN. *AK",
        "vin": "KNADC125156"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/12/2005",
        "dateOfIncident": "07/30/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10132647,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE CONTACT OWNS A 2005 KIA RIO SENCO. THE VEHICLE WILL STALL IN THE MIDDLE OF THE ROAD. IT IS CURRENTLY AT THE DEALERSHIP.  ALSO, THE CONTACT WAS THINKING   ABOUT THE  LEMON  LAW.  ON JULY 30, 2005  THE VEHICLE  LOST POWER AT 65 MPH . THE CHECK ENGINE LIGHT CAME ON, STEERING LOCKED, AND  VEHICLE  WAS IN THE PATH OF A TRACTOR TRAILER.  THE CONTACT PICKED UP  THE VEHICLE FROM  DEALERSHIP  ON AUGUST 1, 2005 AND AGAIN ON  AUGUST 3, 2005 THE VEHICLE WENT BACK TO THE DEALERSHIP,WHO REPLACED THE COMPUTER CHIP.  THE VEHICLE FAILED THREE TIMES. THE LAST TIME IT OCCURRED ON  AUGUST 11, 2005 THE VEHICLE LOST POWER AND SHUT OFF. THIS OCCURRED WHILE DRIVING AT A STEADY SPEED AFTER THE CAR HAS BEEN DRIVEN FOR AWHILE. THERE WAS NO WARNING BEFORE THIS HAPPENED.  THE CHECK ENGINE LIGHT CAME  ON IMMEDIATELY AFTERWARDS ALL THIS HAPPENED WITHIN LESS THAN 30-35 SECONDS. THE FIRST TIME SHE WAS DRIVING AT SPEEDS OF 65 MPH, THE SECOND AND THIRD IT WAS BETWEEN 35-45 MPH. THE ENGINE RESTARTED RIGHT BACK. THE VEHICLE IS CURRENTLY AT THE DEALERSHIP SHE WAS UNSURE OF WHAT THEY WERE GOING TO DO  WITH VEHICLE THEY TOLD HER THEY WHERE GOING  TEST DRIVE THE VEHICLE. *AK",
        "vin": "KNADC165X56"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "08/09/2005",
        "dateOfIncident": "05/05/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10132113,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "BOUGHT NEW CAR CHILD SAFETY LOCKS FAILED. DRIVER DOOR JAMMED CLOSED COULD NOT OPEN FROM INSIDE OR OUTSIDE. THE DEALER MADE ME DRIVE WITH THE PROBLEM FOR THREE WEEKS BEFORE THEY WOULD EVEN LOOK AT IT. THAN TOOK A WEEK AND A HALF TO FIX IT.  *NM",
        "vin": "KNADC165856"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "07/25/2005",
        "dateOfIncident": "07/18/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10129945,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR STALLING, 15 MPG SHOULD GET 35MPG, RPM AT 3.5 GOING 65 MPH TOO HIGH, NO POWER.  PURCHASED THE VEHICLE SATUDAY JULY 16, 2005 AND IT HAS BEEN IN THE SHOP SINCE JULY 18, 2005. VEHICLE ONLY HAD 24 MILES WHEN PURCHASED BRAND NEW AT CHESROWN KIA IN COLUMBUS OHIO.. WASN'T INFORMED THAT THE CAR HAD ISSUES BEFORE PURCHASING IT.IT HAD WORK DONE TO IT BEFORE I BOUGHT IT.  WHEN I GAVE THEM THE CONCERN AFTER TEST DRIVING IT THEY SAID IT WAS THE WAY I WAS DRIVING THE CAR BECAUSE IT WAS A STICK SHIFT. ASSURED ME IT WAS A GREAT CAR. IT HAS BEEN BACK AT THE DEALERSHIP SINCE LAST MONDAY, AND THEY STILL HAVEN'T FOUND THE PROBLEM AFTER TAKING EVERYTHING APART AND PUTTING IT BACK TOGETHER..2005 KIA RIO, JUST ALSO FOUND OUT THAT THE 188,000 2004 KIA RIO'S WERE RECALLED LAST SEPTEMBER 2004 FOR DEFECTIVE FUEL SYSTEMS.",
        "vin": "KNADC125X56"
    }
]