[
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/02/2018",
        "dateOfIncident": "11/01/2017",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11075863,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 LAND ROVER RANGE ROVER. THE CONTACT HEARD AN ABNORMAL NOISE AND FELT A STRONG VIBRATION WHEN THE VEHICLE WAS IN MOTION. THE VEHICLE WAS TAKEN TO TWO DIFFERENT INDEPENDENT MECHANICS WHERE IT WAS DIAGNOSED THAT THE FRONT DIFFERENTIAL NEEDED TO BE REPLACED. AN UNKNOWN DEALER WAS CONTACTED TO DIAGNOSE THE FAILURE. THE MANUFACTURER WAS NOTIFIED. THE MANUFACTURER ISSUED FIVE TSBS FOR THE SUSPENSION. THE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": "SALME11445A"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/15/2017",
        "dateOfIncident": "06/14/2017",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10995345,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STEERING COLUMN WILL DROP WHILE DRIVING. IT IS A KNOWN PROBLEM AND LAND ROVER WANTS $1,900 OR MORE TO REPLACE THE STEERING COLUMN. I WAS TRAVELLING ON THE INTERSTATE AND THE STEERING WHEEL SUDDENLY DROPPED ON MY KNEES. WHEN I LIFTED MY LEG TO APPLY THE BRAKES, IT CAUSED THE STEERING WHEEL TO TURN, CAUSING ME TO SWERVE INTO TRAFFIC. I IMMEDIATELY CALLED THE LAND ROVER DEALERSHIP AND THEY SAID THEY HAVE HAD COMPLAINTS BUT IT IS NOT ON THE RECALL LIST. THIS IS VERY DANGEROUS.",
        "vin": "SALMF11495A"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "12/10/2015",
        "dateOfIncident": "11/30/2015",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10809383,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I STARTED UP FROM A STOP AT A LIGHT I FELT A CLUNKING IN THE FRONT END.  I STARTED TO INCREASE SPEED AND ATTEMPTED TO MAKE A SUDDEN TURN TO AVOID AN OBSTACLE IN THE ROAD.  THE FRONT END FROZE UP.",
        "vin": "SALMF11465A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/14/2015",
        "dateOfIncident": "10/06/2015",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10781886,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DIFFERENTIAL IS LEAKING & I THINK IT HAS CAUSE MY TRANSMISSION TO FALSE.. I BELIEVE THIS HAS HAPPEN WHILE IN MOTION ON THE STREET IN NEWYORK ... I PURCHASED THE RANGE ROVER FROM LAND ROVER OF VIRGINIA IN 2008.",
        "vin": "SALME11445A"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/14/2015",
        "dateOfIncident": "10/05/2015",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10781890,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I'VE  HAD THIS VEHICLE FOR SIX YEARS NOW AND I HAVE TAKING IT FOR SERVICE THREE TIMES FOR  THE VALLEY PAN & HOT WATER PIPE TO BE REPAIRED...THIS IS STRANGE THAT THESE PARTS KEEP FAILING...THIS VEHICLE WAS IN MOTION ON THE STREETS OF NEW YORK.",
        "vin": "SALME1145A1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/16/2015",
        "dateOfIncident": "09/15/2015",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10764058,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 RANGE ROVER HAS A LEAK IN THE FRONT DIFFERENTIAL. ALTHOUGH THE FRONT DIFFERENTIAL SHOULD LAST FOR THE LIFE OF THE VEHICLE, THE MECHANIC INDICATED THAT THIS WOULD LEAD TO PREMATURE MECHANICAL FAILURE OF THE UNIT AND POTENTIAL LIFE SAFETY ISSUE IF IT FAILS WHILE DRIVING.",
        "vin": "SALME11425A"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/29/2015",
        "dateOfIncident": "01/15/2015",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10731074,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 LAND ROVER RANGE ROVER. THE CONTACT STATED THAT THERE WAS A SUDDEN LOSS OF POWER AND THE TIMING CHAIN SKIPPED, WHICH CAUSED THE VEHICLE TO HESITATE AND POTENTIALLY STALL. THE CONTACT KEPT THE VEHICLE PARKED DUE TO IT HESITATING TO START AND BEING SLUGGISH WHILE TRAVELING AT ANY RATE OF SPEED. THE AUTHORIZED DEALER WAS NOTIFIED OF THE FAILURE SEVERAL TIMES AND THE VEHICLE WAS NOT DIAGNOSED. THE CONTACT HAD NOT YET APPROVED THE DEALER TO DIAGNOSE THE VEHICLE DUE TO HOW EXTENSIVE THE REPAIR WOULD BE IN WHICH VARIOUS COMPONENTS MAY NEED TO BE MANEUVERED OR ADJUSTED TO DETERMINE THE FAILURE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND PROVIDED NO REMEDY. THE APPROXIMATE FAILURE MILEAGE WAS 125,000.",
        "vin": "SALME11465A"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "06/09/2015",
        "dateOfIncident": "05/05/2015",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10724406,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 LAND ROVER RANGE ROVER. THE CONTACT WAS ATTEMPTING TO CHANGE A TIRE WITH THE FACTORY ISSUED JACK, THE JACK FAILED CAUSING THE VEHICLE TO COLLAPSE AND THE ROTOR FELL ONTO THE WHEEL. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VIN WAS UNAVAILABLE. THE FAILURE MILEAGE WAS 160,000.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/19/2015",
        "dateOfIncident": "01/17/2015",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10676470,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING DOWN CITY STREET AT 30 MPH, A LOUD HUMMING SOUND COMES FROM FRONT OF VEHICLE. IMMEDIATELY BROUGHT TRUCK TO MECHANIC AND MECHANIC THEN STATED AFTER INSPECTION THAT HE HAS SEEN THIS PROBLEM ON RANGE ROVERS BEFORE AND THAT IT SHOULD BE COVERED UNDER SAFETY RECALL.   NHTSA CAMPAIGN ID NUMBER: 08V635000.  *TR",
        "vin": "SALME11455A"
    },
    {
        "components": "STRUCTURE,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "09/06/2014",
        "dateOfIncident": "09/01/2012",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10631270,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR PASSENGER DOORS PERIODICALLY LOCK AND WILL NOT UNLOCK NOR OPEN EITHER BY REMOTE, INTERIOR CONSOLE BUTTON, NOR BY INTERIOR DOOR HANDLES.  PASSENGERS MUST ENTER AND EXIST VIA THE FRONT SEAT CLIMBING TO, OR FROM, THE BACK.  THE PROBLEM IS UNEXPECTED AND SPORADIC, MAY LAST A FEW HOURS OR A FEW DAYS, HAVE HAD PROBLEM ON MY CAR SINCE PURCHASED TWO YEARS AGO.  PROBLEM RELATES TO COMPUTER CONTROLLED LOCKING SYSTEM AND NOT CHILD CONTROLS, ONCE THE REAR PASSENGER DOORS ARE LOCKED (WHICH MAY HAPPEN AUTOMATICALLY), THEY WILL NOT UNLOCK AND  INTERIOR DOOR LATCH HANDLES WILL ALSO NOT ALLOW OPENING OF DOORS, FOR PRACTICAL PURPOSES SAME AS HAVING REAR DOORS WELDED SHUT WITH NO WAY TO OPEN.  OTHER OWNERS REPORT SAME PROBLEM AS COMMON ON OWNER FORUMS. PROBLEM IS DANGEROUS IN CASE OF AN ACCIDENT SINCE REAR PASSENGERS CAN NOT OPEN DOORS TO EXIT VEHICLE.",
        "vin": "SALME11465A"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,EQUIPMENT ADAPTIVE/MOBILITY",
        "crash": false,
        "dateComplaintFiled": "08/12/2013",
        "dateOfIncident": "08/08/2011",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10534926,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING BECOMES HARD REGULARLY, HAVE TO RESTART VEHICLE TO MAKE THE POWER STEERING REENGAGE. THIS HAPPENS OFTEN; SOMETIMES EVEN WHEN DRIVING AT HIGH SPEED, POWER STEERING JUST GOES OUT.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/06/2013",
        "dateOfIncident": "07/16/2013",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10533850,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 LAND ROVER RANGE ROVER. THE CONTACT STATED THAT WHILE DRIVING 30 MPH, A HUMMING SOUND WAS HEARD FROM THE FRONT END OF THE VEHICLE. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSIS WHERE IT WAS STATED THAT THE DIFFERENTIAL NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED AND THE MANUFACTURER WAS NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 125,000.",
        "vin": "SALMF11465A"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/07/2013",
        "dateOfIncident": "03/11/2013",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10515758,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 LAND ROVER RANGE ROVER. THE CONTACT STATED THAT WHILE AT A STOP, THE STEERING WHEEL SEIZED. THE VEHICLE WAS TOWED TO THE DEALER, WHO ADVISED THAT THE STEERING COLUMN NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOT CONTACTED ABOUT THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 31,000.   UPDATED 07/23/13*LJ",
        "vin": "SALMF11415A"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/04/2013",
        "dateOfIncident": "05/28/2013",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10515109,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TO WHOM IT MAY CONCERN : MY RANGE ROVER WAS NOT WORKING FOR ABOUT A MONTH. HAVING SAID THAT, WHEN I WENT TO GET IT TOWED I COULDN'T GET THE KEY TO TURN. THE KEY WAS LOCKED! FURTHERMORE WHEN THE DEALERSHIP DID AN INSPECTION THEY SAID THAT THE STEERING COLUMN MODULE WAS INTERNALLY FAULTY. JUST LIKE THAT, NOW I'M LOOKING AT A 5,000 JOB! NOT TO MENTION THAT THIS IS  A MAJOR SAFETY ISSUE. IN CLOSING, I REALLY THINK THAT THIS SHOULD BE CONSIDERED A RECALL ITEM. I'VE DONE SOME RESEARCH ON THIS ISSUE AND FIND OUT THAT ABOUT (1 OUT OF 5 ) RANGE ROVER OWNERS HAVE HAD THIS SAME PROBLEM. I REALLY FEEL THAT SOMEONE SHOULD BE HELD ACCOUNTABLE! ESPECIALLY WHEN YOU'RE CHARGING TOP DOLLAR FOR A VEHICLE AND IT'S NOT EVEN DEEMED TO BE SAFE.  THANKS.  *TR",
        "vin": "SALME11485A"
    },
    {
        "components": "SUSPENSION,ELECTRICAL SYSTEM,WHEELS",
        "crash": false,
        "dateComplaintFiled": "11/19/2011",
        "dateOfIncident": "01/25/2010",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10436446,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED A 2005 LR3 IN 2009 SUSPENSION FELL IN 2010 EVERY SINCE I'VE HAD ISSUES WITH THE HCD INACTIVE SWITCH.  HCD INACTIVE WAS COMING ON PRIOR TO SUSPENSION FALLING AND CONTINUES TO AS OF 11/11.  ABS LIGHT AND AIRBAG LIGHT ALSO TURNS ON ANYTIME THROUGHOUT THE DAY AND SHUTS OFF.  BEFORE THE SUSPENSION FELL I CONSTANTLY PAID DEALER TO DIAGNOSE AND THEY DID NOT FIND ANY PROBLEM WITH THE SUSPENSION..SHORTLY AFTER WHILE I WAS DRIVING THE SUSPENSION FELL.  AS OF 11/11 MY ABS, HCD INACTIVE LIGHTS KEEP TURNING ON, THE DASHBOARD INCLUDING RADIO LIGHTS BLINK ON/OFF.  PAST TWO WEEKS WHILE DRIVING THE CAR SLOWS DOWN AND THE STEERING WHEEL LOCKS IN PLACE.  MECHANIC CANNOT FIND ELECTRICAL ISSUES.  MECHANIC DID FIND MY REAR INNER TIRES ARE BALD AND DANGEROUS.  AFTER REVIEWING VARIOUS RR COMPLAINTS IT IS BEYOND MY UNDERSTANDING WHY RR ARE ABLE TO CONTINUE TO SELL $60,000 TRUCKS WITHOUT ANY FORM OF LEGAL ACTION.  THE COMPANY AND PUBLIC ARE AWARE OF THE FAULTY ISSUES, THE ISSUES ARE DANGEROUS AND ALL COMMON IE: SUSPENSIONS FALLING, BALD INNER TIRES, GAS LEAKS.  THE QUESTION RAISED ARE THESE SITES, CONSUMER COMPLAINTS ETC FOR CUSTOMERS TO VENT OR FOR ACTION TO TAKE PLACE??  2 YEARS AND I'M ON MY SECOND SET OF TIRES!!  PEOPLE ARE BUSTED FOR SELLING FAKE PRODUCTS SUCH AS PURSES, CLOTHES, BUT RR IS LOOKED OVER FOR KNOWINGLY MANUFAC., DANGEROUS VEHICLES.  *TR",
        "vin": "SALME11445A"
    },
    {
        "components": "SUSPENSION,FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/01/2011",
        "dateOfIncident": "03/26/2011",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10394924,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY RANGE ROVER 2005 HSE (USED) FROM LAND LOVER OF PARSIPPANY PAUL MILLER ON 2-26-2011 WITH 61981 MILES ON THE ODOMETER. OUT OF THE LAST 30 DAYS THE CAR HAS BEEN DYSFUNCTIONAL AT THE DEALER FOR 15 DAYS PRIMARILY WITH ELECTRIC BOX FAN NOISE, DEAD BATTERY, FAULTY ALTERNATOR AND DEAD FUEL PUMP WITH UNDER 900 MILES DRIVEN (MAJORITY OF WHICH BACK AND FORTH TO THE DEALER). DETAILED SEQUENCE OF EVENTS IS LISTED IN THE APPENDIX. HTTP://RANGEROVER2005.BLOGSPOT.COM/",
        "vin": "SALME11415A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/18/2011",
        "dateOfIncident": "01/02/2011",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10377018,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT DIFFERENTIAL FAILURE ON A 2005 LAND ROVER, RANGE ROVER HSE.  THERE WAS A LOUD NOISE FROM THE RIGHT SIDE OF THE CAR, AND FORWARD MOVEMENT OF THE VEHICLE WAS HAMPERED AS WELL AS MY STEERING.  I WAS FORTUNATE THAT I WASN'T NEAR ANOTHER VEHICLE AND I WAS ABLE TO FORCE THE CAR TO THE SIDE OF THE ROAD.  THIS IS VERY DANGEROUS AND APPARENTLY A COMMON FAILURE WITH THIS VEHICLE.  THE MECHANIC SAYS THE CV JOINT MUST BE REPLACED BUT THAT A FLAW IN THE DESIGN CAUSES THIS FREQUENTLY WITH THIS VEHICLE.  *TR",
        "vin": "SALME11405A"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/13/2010",
        "dateOfIncident": "06/01/2010",
        "fire": true,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10343034,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "COMPLAINT:  FIRE ERUPTING FROM 2005 RANGE ROVER HSE    2005 RANGE ROVER HSE, PURCHASED IN 2004-5 FROM SCOTTSDALE, AZ LAND ROVER.  ON JUNE 1, 2010, WHILE VEHICLE OCCUPANT DRIVING TO WORK IN PHOENIX, AZ, FOLLOWING DASHBOARD MESSAGE APPEARED WITH THE ABBREVIATION, \"TRANS FAILSAFE PROG.\"    THE RANGE ROVER OWNERS HANDBOOK, PG. 79, STATES THAT THE ABOVE MESSAGE MEANS, \"A MALFUNCTION HAS OCCURRED IN THE TRANSMISSION.\"  AS TO \"WHAT TO DO,\" THE HANDBOOK EXPLAINS, \"DRIVE CAREFULLY AVOIDING EXCESSIVE REVS AND CONSULT YOUR RETAILER AT THE EARLIEST OPPORTUNITY.\"    NOTHING IN THE MESSAGE OR THE HANDBOOK INDICATED THAT THIS SITUATION POSED A FIRE HAZARD AND A GRAVE AND IMMEDIATE DANGER TO THE CAR OR ITS OCCUPANTS.    OCCUPANT PROMPTLY CALLED LAND ROVER SERVICE REPRESENTATIVE LOCATED AT THE LAND ROVER DEALERSHIP AT SCOTTSDALE AND 101 IN SCOTTSDALE, AZ TO REPORT THE MESSAGE AND TO SAY THAT HE IMMEDIATELY WAS BRINGING THE CAR IN FOR SERVICE.    OCCUPANT DROVE ABOUT 1-2 MILES THEN PULLED CAR OVER AFTER CAR WOULD NOT PROCEED FURTHER.  SMOKE AROSE FROM UNDERNEATH THE FRONT HOOD.  OCCUPANT CALLED TRIPLE A, THEN SAW SPARKS FALLING BELOW THE HOOD TO THE GROUND.  911 WAS IMMEDIATELY CALLED.  THEN FLAMES EMERGED FROM UNDERNEATH THE FRONT HOOD, AND SPREAD TO CONSUME SOME 90% OF THE CAR BEFORE THE FIRE DEPT. ARRIVED TO PUT OUT FIRE.       THE CAR IS TOTALED, WITH INSURANCE OFFERING TO PAY WHAT IT DEEMS IS ITS PRESENT VALUE, ROUGHLY $30,000. *TR",
        "vin": "SALME11495A"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/01/2010",
        "dateOfIncident": "05/10/2010",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10340934,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 LAND ROVER RANGE ROVER. WHILE THE CONTACT WAS DRIVING BETWEEN 55 AND 75 MPH, THE ENGINE WARNING LIGHT ILLUMINATED ON THE INSTRUMENT PANEL. THE WARNING INDICATOR REMAINED ILLUMINATED UNTIL THE ENGINE WAS TURNED OFF. THE FAILURE OCCURRED WHENEVER THE VEHICLE WAS IN OPERATION. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHERE THE CONTACT WAS INFORMED THAT THE FAILURE WAS CONTRIBUTED TO THE CATALYTIC CONVERTER. THE VEHICLE WAS REPAIRED.  THE FAILURE OCCURRED TWICE IN WHICH THE CATALYTIC CONVERTER WAS REPLACED BY AND AUTHORIZED DEALER. THE FAILURE CONTINUED TO OCCUR. THE FAILURE WAS BEING DIAGNOSED BY THE DEALER WHEN THE COMPLAINT WAS FILED. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "SALME11475A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/04/2008",
        "dateOfIncident": "11/20/2007",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10247645,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "RANGE ROVER 2005 HSE DRIVESHAFT WENT OUT. *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/29/2008",
        "dateOfIncident": "09/04/2006",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10232627,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERSTATE TRIP I-10  REMOTE AREA SOUTH OF MOBILE, ALABAMA.  LOST ABILITY TO ACCELERATE AND WAS ONLY ABLE TO ROLL THE VEHICLE OFF THE SIDE OF THE INTERSTATE IN HEAVY TRAFFIC.  UNABLE TO MOVE VEHICLE FROM ROAD SHOULDER WITHOUT TOWING.  FRONT DIFFERENTIAL FAILURE THAT REQUIRED TOWING AND REPLACEMENT OF DIFFERENTIAL.  OCCURRED AT APPROX. 20000 MILES ON NEW RANGE ROVER.  *TR",
        "vin": "SALME11405A"
    },
    {
        "components": "POWER TRAIN,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "03/15/2008",
        "dateOfIncident": "03/14/2008",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10221282,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM THE OWNER OF A 2005 RANGE ROVER.  I PURCHASED THE VEHICLE USED IN 2006 WITH 60,000 MILE'S ON IT. IN JUNE 2007, THE FRONT  DIFFERENTIAL BROKE WHILE IN THE MIDDLE OF TWO BUSY INTERSECTIONS.  TRAFFIC WAS HALTED UNTIL SOME MEN PUSHED MY CAR TO THE SIDE OF THE ROAD. THERE WAS NO WARNING LEADING UP TO THIS BREAKDOWN.  IN FACT, THE CAR WAS JUST AT THE DEALERSHIP FOR THE 75,000 MILE CHECKUP. NOT TO MENTION RANGE ROVER CHARGED ME $3,000.00 FOR THIS REPAIR..  THE MOST RECENT FRONT DIFFERENTIAL BREAKDOWN WAS MORE SERIOUS SINCE IT OCCURRED ON THE EXPRESSWAY IN THE MIDDLE OF NOWHERE. WHILE TRAVELING TO BIRMINGHAM AL. FROM ATLANTA GA. AT A SPEED OF 70 MILES PER/HR THE CAR MADE A SUDDEN GRINDING NOISE AND STOP ACCELERATING.  ONCE I REALIZED WGAT WAS GOING ON I STARTED GETTING TO THE SIDE OF THE ROAD.  IT WAS SCARY BECAUSE PART OF THE TRUCK WAS STILL IN THE FREEWAY LANE AND TRUCKS AND CARS WERE AVOIDING  HITTING US.  MY TEENAGE SON HAD TO PUSH THE CAR OFF THE FREEWAY.  AFTER THIS BEING THE SECOND TIME IN PERIL I AM NOW AFRAID TO DRIVE THIS VEHICLE THAT I OWE A CONSIDERABLE AMOUNT OF MONEY ON.  THIS LAST INCIDENT OCCURRED ON MARCH 07, 2008.  THE PART WAS STILL UNDER WARRANTY SINCE IT HAD ONLY BEEN 9 MONTHS AND LESS THAN 8,000 MILES SINCE THE LAST FRONT DIFFERENTIAL WAS REPLACED.  OH BY THE WAY , THE CAR IS STILL AT THE DEALERSHIP IN BIRMINGHAM AL. THEY DIDN'T HAVE THE PARTS AND THE PARTS HAVEN'T ARRIVED YET. I HOPE SOMETHING CAN BE DONE TO HELP ME, AND OTHERS IN MY POSITION.  *TR",
        "vin": "SALME11415A"
    },
    {
        "components": "POWER TRAIN,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "03/12/2008",
        "dateOfIncident": "03/10/2008",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10220974,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FAILURE WHICH OCCURRED TWICE WAS THAT MY FRONT DIFFERENTIAL AND FRONT DRIVE SHAFT FAILED (FIRST TIME 48,000 MILES AND SECOND 68,000 MILES).  WHAT WAS DONE TO CORRECT THE FAILURE WAS APPARENTLY ALL PARTS WERE CHANGED. CAR DOES NOT MOVE. OLD PARTS ARE AVAILABLE. DEALER WANTS TO CHARGE TWICE AS MUCH AS A  PRIVATE MECHANIC WANTS TO CHARGE. VEHICLE IS NOT OUTSIDE THE WARRANTY AND DEALER WILL NOT REPLACE PARTS FOR FREE. DEALER DOES NOT  ACKNOWLEDGE HIGH RATE OF FRONT DIFFERENTIAL FAILURE.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/04/2008",
        "dateOfIncident": "02/03/2008",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10220036,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING SOMEWHERE IN BETWEEN 15-25 MILES AN HOUR, WITH NO WARNING WHATSOEVER, MY 2005 LAND ROVER RANGE ROVER LOCKED UP IMMEDIATELY AND MADE A HORRIBLE GRINDING SOUND. THE CAR FROZE UP AND WOULD NOT PROCEED FORWARD AND I AM ASSUMING BECAUSE I WAS ACCELERATING AND BROUGHT TO AN ABRUPT STOP, THE CAR THEN STARTED TO SHAKE. I PUT THE CAR IN PARK AND WENT BACK INTO DRIVE, ONLY FOR THE CAR TO IMMEDIATELY MAKE THAT LOUD HORRIBLE GRINDING SOUND AGAIN. THE CAR WAS NOT DRIVABLE IN THE DRIVE POSITION, OR REVERSE. I HAD TO PUT IT INTO NEUTRAL AND PUSH IT HOME. I JUST WOULD LIKE TO NOTE THAT THE SAFETY OF MYSELF AND PASSENGER COULD HAVE BEEN PUT IN JEOPARDY BECAUSE I DID JUST EXIT THE FREEWAY BEFORE THIS HAPPENED. I ALSO WOULD LIKE TO STATE THAT THIS PROBLEM SHOULD BE RECALLED, AS I HAVE ALREADY FOUND MANY WEBSITES COMPLAINING OF THIS ISSUE. I COULD HAVE BEEN INJURED AND HOPE THAT SOMEONE INVESTIGATES THIS MATTER.  *TR",
        "vin": "SALME11415A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/28/2008",
        "dateOfIncident": "02/25/2008",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10219552,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "FAILURE OF FRONT DIFFERENTIAL ON 2005 RANGE ROVER, WELL DOCUMENTED PROBLEMS WITH THIS COMPONENT ON THE VEHICLE BUT NO SAFETY RECALL AS OF YET.  IMMOBILIZED VEHICLE ON EXTREMELY BUSY INTERSTATE (I35) IN DALLAS CAUSING SIGNIFICANT TRAFFIC BACKUP, OVER $2K IN REPAIR COST.  *TR",
        "vin": "SALME11465A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/25/2008",
        "dateOfIncident": "02/21/2008",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10219047,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "AROUND 12 AM ON 2/21/08 I WAS DRIVING DOWN INTERSTATE 29 SOUTH NEAR PLATTE CITY MO AT SPEEDS AROUND 70-75 MILES PER HOUR.  AS I WAS PASSING ANOTHER CAR MY 2005 RANGE ROVER STARTED MAKING A LOUD GRINDING SOUND AND STARTED SLOW DOWN.  I GOT TO THE SIDE OF THE ROAD AND IT WOULD ALTHOUGH I PRESSED ON THE GAS THE TRUCK WOULD NOT MOVE.   THE DEALER TOLD ME THE FRONT DIFFERENTIAL AND DRIVE TRAIN BROKE AND THEY ARE LOOKING FOR PARTS SINCE THIS IS A NATIONAL BACKORDER.   IT HAS NOT YET BEEN REPAIRED AND THE OLD PARTS WILL BE PUT ON IT WHEN AVAILABLE.  *TR",
        "vin": "SALMF11405A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/31/2007",
        "dateOfIncident": "12/22/2007",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10213308,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT DIFFERENTIAL FAILURE. NO PRIOR WARNING. FAILED ON FREEWAY AT FREEWAY SPEED, 65/MPH TO 70/MPH. TRUCK COMPLETELY DISABLED. NO POWER FROM ENGINE TO WHEELS. I WAS BARELY ABLE TO CHANGE LANES AND GET TO SHOULDER OF FREEWAY (COASTING) WITHOUT CAUSING ACCIDENT. LAND ROVER PAID FOR REPAIR UNDER WARRANTY. DEALER PROVIDED LOANER FOR DURATION OF REPAIR.  *TR",
        "vin": "SALMF11445A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/31/2007",
        "dateOfIncident": "10/05/2007",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10207532,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "OCT. 5, 2007 AT 8AM- MY FAMILY AND I WERE RIDING ON I-94W, 100 MILES FROM HOME, AT APPROX. 65MPH, AND THERE WAS A GRINDING NOISE.  THEN SUDDENLY THE VEHICLE LOST POWER.  LUCKILY WE MADE IT PARTIALLY TO THE SIDE OF THE ROAD. VEHICLE WAS IMMEDIATELY TOWED BY STATE TOW, BECAUSE LOCATION OF VEHICLE WAS UNSAFE, TO THE NEAREST DEALER 20 MIN AWAY.  BECAUSE I WAS AT 56K MILES DEALER REQUIRED ME TO PAY FOR RENTAL.  TWO DAYS LATER ON MONDAY, DIAGNOSIS WAS FRONT DIFFERENTIAL FAILURE.  THEN AFTER DIFFERENTIAL WAS FIXED DEALER SAID THE TRANSFER CASE WAS BAD.  LATEST, AS OF TODAY, 26 DAYS LATER, I AM STILL WAITING FOR TRANSFER CASE TO BE FIXED, WHICH WILL NOT BE  IN UNTIL NOV. 8TH.  STILL RENTING A MINI VAN, PAYING $30/DAY FOR RENTAL, AND PAYING MY RANGE ROVER NOTE.  *TR",
        "vin": "SALMF11405A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/04/2007",
        "dateOfIncident": "09/29/2007",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10204828,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING UNDER NORMAL DRIVING CONDITIONS WITHOUT ANY UNDUE STRESS ON THE VEHICLE THE FRONT DIFFERENTIAL STRIPPED OUT AND MY VEHICLE COMPLETELY LOST POWER TO THE WHEELS. LAND ROVER IS NOW REPLACING THE FRONT DIFFERENTIAL BUT HAS MADE NO TECHNICAL MODIFICATIONS TO PREVENT THIS FROM OCCURRING AGAIN.  *JB",
        "vin": "SALMF114X5A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/10/2007",
        "dateOfIncident": "12/19/2005",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10187442,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT DIFFERNTIAL FAILURE.  *AK",
        "vin": "SALME11435A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/10/2007",
        "dateOfIncident": "11/21/2006",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10187451,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT DIFFERNTIAL FAILURE.  *AK",
        "vin": "SALME11435A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/24/2007",
        "dateOfIncident": "03/18/2007",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10186077,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "LAST SUNDAY, I WAS TRAVELING IN THE  2005 RANGE ROVERON AN INTERSTATE 100 MILES FROM MY HOME. THE TRANSISSION SUDDENLY FAILED & I HAD TO BE TOWED TO THE DEALER NEAR MY HOME. ON MONDAY I SOPKE TO THE DEALERSHIP THAT TOLD ME THE PROBLEM WITHOUT EVEN LOOKING AT  THE CAR THERE  WAS A DEFECT IN THE ORIGINAL DESIGN OF THE LIMITED SLIP DIFFERENTIAL, AND THEY WERE  ORDERING THE PART AND RENTING ME A CAR. ON FURTHER DISCUSSION THE SERVICE DEPARTMENT  TOLD ME THAT THEY HAVE A REWORKED REPLACEDMENT, AND IT SHOULD NOT HAPPEN AGAIN. THEY ALSO TOLD ME THAT THEY  WERE GETTING AT LEAST ONE CAR A WEEK WITH THE SAME PROBLEM. *AK    IF THIS IS SOMETHING THAT THEY KNOW ABOUT, WHY ARE THEY ONLY FIXING IT AFTER THE FACT. THERE COULD BE SERIOUS INJURY TO OTHER DRIVERS WHO SUDDENLY HAVE THIS POWER LOSS. I WAS LUCKY.",
        "vin": "SALME11405A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/13/2007",
        "dateOfIncident": "08/08/2006",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10185003,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I THOUGHT YOU MIGHT BE INTERESTED TO KNOW THAT MY 2005 RR (30000 KMS - BUILD DATE 01/05) TD6 IS CURRENTLY HAVING THE DIFFERENTAIL AND PROP SHAFT REPLACED. THE CAR HAS BEEN MAKING A GRINDING NOISE WHEN MOVING FORWARD AT A SLOW PACE GRADUALLY GETTING WORSE OVER THE PAST FEW WEEKS. THIS NOISE WILL ONLY OCCUR WHEN THE VEHICLE IS IN GEAR (D) AND ONLY WHEN TRAVELING VERY SLOWLY, THE NOISE DISAPPEARS WHEN NEUTRAL IS SELECTED EVEN WHILE THE VEHICLE IS STILL ROLLING.  THE FRONT PROP SHAFT SEAL (TRANSMISSION END) HAS ALSO FAILED AND LEAKING OIL. THREE MONTHS AGO THE AIR COMPRESSOR WAS REPLACED AS THE ORIGINAL FAILED. *JB",
        "vin": "SALLMAMC35A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/20/2006",
        "dateOfIncident": "12/19/2006",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10176690,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING 50 MPH ON FEEDER OF I-10, HEARD A LOUD NOISE WITH INSTANT WHEEL LOCKING, GAINED CONTROL AND PULLED OVER AS I HAD NO POWER.  CPU SAID TO SELECT NEUTRAL WHICH I DID.  ATTEMPTED TO PUT IN DRIVE AND HEARD A LOUD SCREECHING NOISE ALTHOUGH THE CAR WOULD NOT MOVE.  CALLED TOW TRUCK AND HAD IT TOWED TO DEALERSHIP WHO DIAGNOSED PROBLEM AS DIFFERENTIAL AND DRIVE SHAFT.  SERVICE ADVISOR SAID WE HAVE HAD MULTIPLE WITH THIS PROBLEM.  GOT ONLINE AND DISCOVERED PROBLEM HAS HAPPENED MULTIPLE TIMES. CAR IS A 2004 RANGE ROVER HSE.   *NM",
        "vin": "SALME11444A"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/04/2005",
        "dateOfIncident": "01/31/2005",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10109830,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2005 LAND ROVER LR3 HAS STALLED 9 TIMES SINCE I FIRST GOT IT ON 1/2/05.  THERE HAVE BEEN AT LEAST 8 VEHICLES THAT HAVE REPORTED THIS STALLING PROBLEM, INCLUDING WARREN BROWN OF THE WASHINGTON POST DURING HIS TEST DRIVE.  THERE ARE NUMEROUS POSTS ON EDMUNDS.COM FORUM THAT DESCRIBE THIS FAILURE (UNDER THE LR3 REVIEW PAGE).  MY DEALER HAS BEEN UNABLE TO CORRECT THIS FAILURE AFTER TWO VISITS TO THE SHOP AND NUMEROUS COMPONENTS REPLACED.  THE VEHICLE IS CURRENTLY BACK IN THE SHOP.  WHEN COMING DOWN A HILL AND TRYING TO STOP, THE VEHICLE HAS STALLED 9 TIMES.  IT DOES NOT STALL EVERY TIME IN THE SAME SITUATION.  THE DEALER HAS REPLACED THE FUEL TANK (THOUGHT A DIESEL TANK WAS INSTALLED BY MISTAKE), THEN REPLACED SOME SENSORS AND THE CATALYTIC CONVERTER.  AS THE TRUCK WEIGHS 6000 LBS, IT IS QUITE DIFFICULT TO STEER WHEN YOU LOSE POWER.  I AM CONCERNED FOR THE SAFETY OF MY FAMILY.  *JB",
        "vin": "SALAA254X5A"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "01/31/2005",
        "dateOfIncident": "01/10/2005",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10108276,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "CLASSIC",
                "productYear": "1992",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A RANGE ROVER, COUNTY MODEL VIN:  [XXX], PURCHASED IN 1992.  I HAVE REPLACED 2 FUEL TANKS DUE TO WHAT 2 DIFFERENT MECHANICS HAVE TOLD ME IS LEAKING FUEL DUE TO FAULTY SEAMS ON THE PLASTIC FUEL TANKS.  I HAVE BEEN UNABLE TO LOCATE A NEW FUEL TANK BECAUSE I AM TOLD BY LAND ROVER THAT THE TANK IS NO LONGER IN PRODUCTION BECAUSE ROVER IS UNABLE TO SECURE A FUEL TANK MANUFACTURER.  AFTER MARKET COMPANIES HAVE TOLD ME THE SAME.  I HAVE CONTACTED LAND ROVER AND THEY HAVE TOLD ME THAT NO RECALL HAS HAPPENED AT THIS POINT IN TIME.    I AM ABLE TO SMELL FUEL AROUND MY VEHICLE ESPECIALLY AFTER FILLING THE TANK.  IT WOULD MAKE SENSE TO BELIEVE THAT FUEL TANKS SHOULD LAST THE LIFE OF THE VEHICLE WITHOUT EVER LEAKING, ESPECIALLY 2 FUEL TANKS. THE REPLACEMENT FUEL TANKS SHOULD ALSO BE AVAILABLE FOR PURCHASE EVEN IF THERE IS NOT A RECALL.  I AM CONCERNED THAT THIS PRESENTS A FIRE HAZARD AND THE VEHICLE SHOULD BE RECALLED. I   BELIEVE THAT THIS MATTER NEEDS THE IMMEDIATE ATTENTION OF THE NHTSA.  I AM TOLD BY ROVER MECHANICS THAT OTHER OWNERS ARE EXPERIENCING THE SAME PROBLEM, AND THAT ROVER'S DISCONTINUANCE OF PRODUCTION IS THE RESULT OF THE \"PROBLEMS THEY ARE HAVING WITH TANK FAILURE\".  WHAT ARE WE TO DO?  THEY WON'T RECALL A KNOWN PROBLEM AND EVERY DAY WE DRIVE OUR FAMILY AROUND WITH A STRONG ODOR OF GAS FUMES COMING FROM THE REAR OF THE VEHICLE.  THIS IS AN EXTREMELY COSTLY REPAIR INVOLVING WHAT COULD BE A LIFE THREATENING PROBLEM.  PLEASE REPLY.*AK UPDATED 07/24/2012  *JS    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6)",
        "vin": "SALHV1249NA"
    }
]