[
    {
        "components": "SUSPENSION,EXTERIOR LIGHTING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/29/2020",
        "dateOfIncident": "04/10/2019",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341985,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 MITSUBISHI LANCER. THE CONTACT STATED THAT THE CUP FROM THE BALL JOINTS, THE FRONT END, TIE ROD, UNKNOWN WIRING HARNESS AND THE DRIVER'S SIDE HEADLIGHT FAILED. THE VEHICLE WAS TAKEN TO AN UNKNOWN MITSUBISHI DEALER HOWEVER, WAS NOT DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND INFORMED THE CONTACT THAT THE VEHICLE WAS NOT COVERED UNDER THE WARRANTY. THE CONTACT STATED THAT THE VEHICLE WAS REPAIRED OUT OF POCKET. ADDITIONALLY, THE INSTRUMENT PANEL WAS ALSO REPLACED. THE FAILURE MILEAGE WAS APPROXIMATELY 100,000.",
        "vin": "JA3AJ26EX5U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/30/2019",
        "dateOfIncident": "01/10/2018",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11216924,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SIGNAL LIGHTS STOP WORKING ALSO THE HAZARDS. THE HORN REMAINS ON. A LOT OF PEOPLE SAY THAT IS A PROBLEM OF THE CAR INSIDE BODY THAT TAKE THE CONNECTOR OF THE JUNCTION BLOCK AND CORRODE THEM. A LOT OF PEOPLE HAVE THIS PROBLEMS. THE PROBLEM IS IN MOTION AND STATIONARY.",
        "vin": "JA3AJ66F75U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/11/2019",
        "dateOfIncident": "04/11/2019",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11195712,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I SOLD THIS CAR LAST JULY 2018 THROUGH A TRADE-IN.  PLEASE STOP SENDING ME ALL OF THESE HORRIFYING REMINDERS.  IT IS NOT APPRECIATED.  PLEASE REMOVE MY NAME AND ADDRESS FROM ALL MAILING LISTS.  I DID NOT GET IT DONE WHEN I OWNED THE CAR AS THE DEALERSHIP WAS QUITE A DRIVE AND I COULD NOT DROP IT OFF.  CAR IS SOLD.",
        "vin": "JA3AJ66F05U"
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/26/2018",
        "dateOfIncident": "06/20/2016",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11154033,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 MITSUBISHI LANCER. THE CONTACT STATED THAT THE CROSS MEMBER FRACTURED WITHOUT WARNING AND THE FRONT UPPER AND LOWER CONTROL ARMS DETACHED. THE VEHICLE WAS UNABLE TO BE DRIVEN DUE TO THE FAILURE. THE VEHICLE WAS TOWED TO BELL MITSUBISHI (1500 US-1, RAHWAY, NJ 07065, (732) 709-4333) WHERE IT WAS DIAGNOSED THAT THE CROSS MEMBER NEEDED TO BE REPLACED AND FURTHER TESTING WAS NEEDED. THE CONTACT WAS NOT NOTIFIED OF NHTSA CAMPAIGN NUMBER: 16V458000 (SUSPENSION). THE DEALER DID NOT KNOW THEN THE PART WOULD BE AVAILABLE. THE MANUFACTURER PROVIDED A CASE NUMBER AND THE CONTACT WAS INFORMED THAT A CASE MANAGER WOULD FOLLOW-UP WITHIN TEN BUSINESS DAYS. THE CONTACT HAD NOT BEEN CONTACTED. THE APPROXIMATE FAILURE MILEAGE WAS 170,000. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "JA3AJ26E15U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/08/2018",
        "dateOfIncident": "02/08/2018",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11071829,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "RECEIVED NOTICE OF A RECALL ON THE PASS. SIDE AIRBAG. CALLED LOCAL DEALER, OUT OF BUSINESS (GREENVILLE MITSUBISHI). NEXT CLOSEST DEALER IS 2 COUNTIES AWAY (DON HERRING MITSUBISHI PLANO), SPOKE TO BENNY. SAID IT'S A 5-HOUR REPAIR AND THEY ARE OPEN ON SATURDAY, BUT WILL NOT PERFORM THE RECALL ON SATURDAY. DUE TO THE DISTANCE INVOLVED, IT'S UNREASONABLE TO TOW OR DROP OFF MY VEHICLE, AND LIKE MANY, I DON'T HAVE 8-9 HOURS TO LOSE TO FIX MITSUBISHI'S ISSUE (DRIVE AND REPAIR TIME, PLUS CONSIDERING LIGHT NORTH DALLAS TRAFFIC). I'M UNABLE TO PROVIDE THE EXORBITANT TIME THIS DEALER REQUIRES OF ME TO PHYSICALLY BE PRESENT FOR THE REPAIR, AND I DON'T KNOW WHO WOULD BE. MISSING WORK, PLUS LITERAL EXPENSES FOR SOMETHING I HAD NO PART IN IS WRONG, AS IS THE 50+ MILE CAB OR UBER FAIR THAT WOULD BE REQUIRED TO MAKE THE RETURN TRIP DURING THE REPAIR. AT THAT POINT, THIS BECOMES A BILL, NOT A SAFETY RECALL. AND MY WIFE IS THE ONLY PASSENGER IN THE FRONT SEAT OF THE VEHICLE. RECALL SITE SENT ME HERE TO FILE A COMPLAINT IF THE DEALER WAS UNABLE TO PERFORM THIS RECALL IN A TIMELY MANNER. NEED RESOLUTION ON THIS MATTER THAT DOESN'T COST ME MORE THAN THE REPAIR ITSELF.",
        "vin": "JA3AJ26E75U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/19/2017",
        "dateOfIncident": "10/02/2017",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11034749,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG DEFECT",
        "vin": "JA3AJ26E25U"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/09/2015",
        "dateOfIncident": "05/01/2015",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10762438,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 MITSUBISHI LANCER. THE CONTACT STATED THAT WHILE THE VEHICLE WAS PARKED, THE FLOOR MAT WAS REMOVED ON THE DRIVER SIDE AND IT WAS DISCOVERED THAT THE FLOOR BOARD HAD EXCESSIVE RUST AND FRACTURED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 94,000.",
        "vin": "JA3AJ26E85U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/10/2015",
        "dateOfIncident": "08/10/2015",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10747461,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A SAFETY RECALL NOTICE BY MAIL FROM MITSUBISHI MOTORS SALES OF CARIBBEAN ON JUNE, I CALL TO A DEALERSHIP THEY TOLD ME THAT I HAVE TO WAIT MY TURN AND TO WAIT THE INFLATOR TO BE AVAILABLE, WE ARE IN AUGUST AND STILL NO NOTICE, I CALL THEM TODAY AND THEY TOLD ME I HAVE TO WAIT MY TURN, I CALLED TO ANOTHER DEALERSHIP AND THEY TOLD ME THEY ARE TAKING ONLY ONE CAR DAILY AND THE LIST IS LONGER. THEY ARE EXTREMELY SLOW, OTHER MANUFACTURERS ARE MORE PROACTIVE, BUT THIS IS TAKING TO LONG TO RESOLVE THE DEFECT.",
        "vin": "JA3AJ66F25U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/27/2015",
        "dateOfIncident": "07/24/2015",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10744034,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "GOOD DAY, I RECENTLY GOT A SAFETY RECALL LETTER FROM MITSUBISHI ABOUT A POSSIBLE DEFECT IN MY CAR'S AIRBAGS THAT WHEN DEPLOYED COULD CAUSE METAL FRAGMENTS TO IMPACT MY FACE AND BODY AND POSSIBLY CAUSE DEATH.    THE PROBLEM I'M HAVING IS, ON THE LETTER THEY STATED THAT ALL THE REPAIRS WOULD BE AT NO-COST WITH NO MENTION OF AFTERMARKET PARTS AN EXTRA FEE I HAVE TO PAY FOR. SO I SET UP AN APPOINTMENT AND WHEN I GOT TO THE DEALER THEY SAID I HAD TO PAY THEM A FEE TO REMOVE MY AFTERMARKET ALARM AND STEREO. I WAS BAFFLED AS TO WHY I HAD TO PAY FOR SOMETHING THAT WASN'T EVEN MY FAULT. I TALKED TO THE MANAGER OF THE DEALERSHIP TRYING TO BE REASONABLE BUT THEY WOULDN'T WAIVE THE FEE. I'VE CALLED THE MITSUBISHI HOTLINE BUT TO NO AVAIL, SAYING THAT I HAVE TO PAY THE FEE FOR \"UNINSTALLATION AND REINSTALLATION OF AFTERMARKET PARTS\".     I DON'T KNOW WHERE ELSE TO GO TO THAT'S WHY I'M ASKING FOR YOUR HELP. I STRONGLY BELIEVE THAT I SHOULDN'T HAVE TO PAY FOR SOMETHING THAT WASN'T EVEN MY FAULT TO BEGIN WITH AND IT WAS MY LIFE ON THE LINE FOR WHO KNOWS HOW LONG I'VE BEEN DRIVING WITH POTENTIALLY DEFECTIVE AND DEADLY AIRBAGS. I HOPE YOU UNDERSTAND MY SITUATION.    SINCERELY, JAZPER",
        "vin": "JA3AJ26E65U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/23/2015",
        "dateOfIncident": "06/23/2015",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10726839,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 MITSUBISHI LANCER. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V321000 (AIR BAGS); HOWEVER, THE PARTS NEEDED WERE NOT AVAILABLE. THE MANUFACTURER EXPECTED THE CONTACT TO SCHEDULE A REPAIR AT A DEALER THAT WAS OUT OF STATE AND NOT A LOCAL AUTHORIZED DEALER WHICH WAS UNREASONABLE.  THE MANUFACTURER WAS UNABLE TO PROVIDE AN ESTIMATED DATE FOR WHEN THE VEHICLE WOULD RECEIVE THE RECALL REPAIR. THE VIN WAS NOT AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/25/2014",
        "dateOfIncident": "10/01/2014",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10660799,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SRS LIGHT CAME ON IN MY LANCER.  I HAVE BEEN TOLD BY THE MECHANIC THE PART WILL TAKE OVER A MONTH TO ARRIVE AS A RESULT OF A RECALL.  I HAVE BEEN TOLD THAT THE AIR BAG NO LONGER WORKS.  *TR",
        "vin": "JA3AJ26E34U"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/29/2012",
        "dateOfIncident": "06/29/2012",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10463616,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 MITSUBISHI LANCER. THE CONTACT STATED THAT WHILE DRIVING 45 MPH, SHE NOTICES THAT THE VEHICLE WAS ACCELERATING INDEPENDENTLY. THE CONTACT WAS ABLE TO SLOW DOWN THE VEHICLE BY UTILIZING THE EMERGENCY BRAKE. THE VEHICLE WAS NOT TAKEN TO THE DEALER AND THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE AND CURRENT MILEAGES WERE 131,883.",
        "vin": "JA3AJ26E85U"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/26/2010",
        "dateOfIncident": "04/26/2010",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10327526,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 MITSUBISHI LANCER. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 65 MPH, THE VEHICLE CRASHED INTO THREE DEER. THE HEADLIGHTS WERE DESTROYED, THE FRONT FELL OFF OF THE VEHICLE, AND THE PASSENGER SIDE FENDER WAS PUSHED IN. THE AIR BAGS DID NOT DEPLOY BUT THE SRS AIR BAG WARNING LIGHT ILLUMINATED UPON IMPACT AND HAD REMAINED ILLUMINATED. THE CONTACT DID NOT REPORT ANY INJURIES. THE CONTACT HAD NOT CALLED THE MANUFACTURER WHEN THE COMPLAINT WAS FILED. THE CURRENT AND FAILURE MILEAGES WERE APPROXIMATELY 80,000.",
        "vin": "JA3AJ26EX5U"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/04/2010",
        "dateOfIncident": "09/28/2004",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10316564,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL GAUGE SHOWS MORE FUEL THAN IS IN THE TANK UNTIL THE GAGE SHOWS HALF FULL.  WHEN IT SHOWS HALF FULL, THERE IS PROBABLY 4 GALLONS LEFT IN THE TANK. *TR",
        "vin": "JA3AJ26E55U"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/23/2009",
        "dateOfIncident": "10/22/2009",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10289499,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "HELLO MY NAME IS RYAN GIROUARD, I OWN A 2005 MITSUBISHI RALLIART SEDAN,MY MASTER CYLINDER BROKE DOWN DRIVING  ON ROAD ALMOST CAUSING A SERIOUS ACCIDENT, WARRANTY CLAIMED TO BE NOT COVERED, MASTER CYLINDER BLED OUT COMPLETELY. IS THERE A WARRANTY COVERAGE FOR THIS PART? AND IS MY CLUTCH PLATE DAMAGED DUE TO BLEED OUT OF MASTER CYLINDER? AS A RESULT DESTROYING OTHER COMPONENTS THAT WERE IN WORKING ORDER,I'M CONCERNED AS ITS NOT A REGULAR WEARING PART OF THIS VEHICLE. AS I'M AWARE OIL, BRAKES, TRANSMISSION FLUID AND OTHER FLUIDS, WIPER BLADES , TIRES, AND MANY OTHERS ARE NOT COVERED,     PLEASE REPLY BACK  THANK YOU    RYAN *TR",
        "vin": "JA3AJ66F55U"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/02/2008",
        "dateOfIncident": "09/01/2008",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10240569,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "#1- REMOVING BOTH FRONT TIRES FOR BRAKE MAINTENANCE, AND CLEANING OF THE TIRE-WELL.  #2- THREE OF THE BOLTS SECURING THE TIRE TO THE RIM FAILED.  ONE SNAP UNDER LIGHT PRESSURE (RIGHT SIDE), TWO OF THE BOLTS WERE STRIP BY THE LOCKING NUT, RENDERING THEM USELESS (LEFT SIDE).   THIS CAR FEATURE ANTI-THEFT WHEEL COVERS INSTALLED BY THE DEALER-DISTRIBUTOR IN PR WHICH REQUIRES DIFFERENT TYPE OF LOCKNUT FOR THE TIRE RIM.  #3- THE CAR WILL BE TAKEN FOR SERVICE TO AN AUTHORIZED REPAIR SHOP AND I WILL REQUEST REPLACEMENT OF ALL BOLTS WITH NEW SAFETY NUTS. *TR",
        "vin": "JA3AJ16E15U"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/19/2007",
        "dateOfIncident": "05/31/2007",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10206323,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 MITSUBISHI LANCER.  WHILE STOPPED AT A TRAFFIC LIGHT, THE ACCELERATOR PEDAL SUDDENLY WENT STRAIGHT TO THE FLOOR.  THE VEHICLE JERKED FORWARD AND THE ENGINE REVVED.  THE CONTACT APPLIED THE BRAKES AND PLACED THE VEHICLE IN NEUTRAL TO PREVENT IT FROM SURGING.  HE SHUT OFF THE ENGINE AND RESTARTED THE VEHICLE.  THE FAILURE OCCURRED AT TRAFFIC LIGHTS ON TWO OCCASIONS.  THE VEHICLE WAS TAKEN TO THE DEALER TWICE, BUT THEY WERE UNABLE TO DUPLICATE THE FAILURE.  THE FAILURE MILEAGE WAS 11,000 AND CURRENT MILEAGE WAS 17,000.  THE CONSUMER STATED HE TOOK THE VEHICLE TO ANOTHER MITSUBISHI DEALER AND THEY INFORMED HIM, THEY HAD OTHER 2005 MITSUBISHI'S WITH SAME DEFECT. THE DEALER STATED THEY COULD NOT DUPLICATE. UPDATED 11/15/07  *TR  THE CONSUMER HAS REQUESTED AN ARBITRATION.. UPDATED 11/29/07",
        "vin": "JA3AJ26E25U"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/24/2007",
        "dateOfIncident": "09/01/2007",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10203999,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 MITSUBISHI LANCER.  WHILE DRIVING 60 MPH, THE CONTACT LOST CONTROL AND THE REAR DRIVER SIDE OF THE VEHICLE CRASHED INTO A TREE.  THE AIR BAGS FAILED TO DEPLOY.  SHE SUSTAINED HEAD INJURIES AND THE VEHICLE WAS DESTROYED.  AS OF SEPTEMBER 24, 2007, THE INSURANCE COMPANY HAD NOT INSPECTED THE VEHICLE.  A POLICE REPORT WAS FILED.  THE CURRENT AND FAILURE MILEAGES WERE 70,000.",
        "vin": "JA3AJ26E55U"
    },
    {
        "components": "AIR BAGS,EQUIPMENT",
        "crash": true,
        "dateComplaintFiled": "06/20/2007",
        "dateOfIncident": "06/03/2007",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10193792,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "DIAMOND CARE",
                "productModel": "DIAMOND CARE",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "I PURCHASED A 2005 LANCER AND MY DECISION FOR THE PURCHASE WAS BECAUSE OF THE 4 AIR BAGS. I TOTALED  THE CAR AND ALL FOUR AIRBAGS DID NOT DEPLOY.  THE CAR WAS TOTALED ON 6-3-07 WITH ALOT OF DAMAGE TO THE UNDERCARRIAGE.  PLEASE EXPLAIN WHY THE AIRBAGS DID NOT DEPLOY.  *AK",
        "vin": "JA3AJ66FX5U"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/15/2006",
        "dateOfIncident": "07/15/2006",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10162476,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 LANCER ES, MANUAL TRANSMISSION, PURCHASED 8-11-05 IN SOUTHERN CALIFORNIA. APPROXIMATELY 8,500 MILES, BEGAN TO HEAR RUBBING SOUNDS WHEN SLOWING FROM HIGH SPEED- THOUGHT IT NEEDED ALIGNMENT, SO TOOK IT IN, HAD WHEELS ALIGNED, AND ROTATED, (ALREADY HAD PREVIOUS ALIGNMENT AND ROTATION @ 6,000 MILES.) AFTER LOCAL (SURFACE STREET) DRIVING ONLY, AT 9,800 TOOK TO DEALER TO INSPECT PROBLEM, WITHIN 11 MONTHS OF PURCHASE. DEALER SAID IT WAS \"NORMAL WEAR AND TEAR\". I HAVE NEVER HAD  BRAKES WEARING OUT UNDER 15,000 MILES. SEEMS DEFECTIVE TO ME.  *JB",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "11/22/2005",
        "dateOfIncident": "10/26/2005",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10143502,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR GLASS RATTLING OVER BUMPS. *JB",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/14/2005",
        "dateOfIncident": "04/18/2005",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10142621,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE FAILURE AT 7032 MI BRAKES COMPLETELY METAL TO METAL LOSS OF MOST BRAKING FUNCTIONS VERY POOR RESPONSE TIME,BRAKE PADS REPLACED,BRAKE FAILURE AGAIN AT 13560 BRAKES AGAIN METAL TO METAL VERY POOR RESPONSE TIME,BRAKE PADS REPLACED AGAIN,BRAKE FAILURE AGAIN AT 18500 AGAIN BRAKES METAL TO METAL LOSS OF BRAKE RESPONSE TIME VERY LOUD GRINDING NOISES UPON APPLICATION OF BRAKING SYSTEMS SERVICE REFUSED BY DEALER ALL WITHIN 10 MONTHS OF VEHICLE PURCHASE BRAND NEW.  *NM",
        "vin": "JA3AJ26E05U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/13/2005",
        "dateOfIncident": "01/13/2005",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10106279,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "NO OUT OF THE ORDINARY EVENTS LEAD UP TO THE FAILURE.  MY VEHICLE, WHICH IS A DAILY DRIVER CAR WOULD ONCE IN A WHILE \"STUMBLE\" THEN THROW A CHECK ENGINE LIGHT.  AFTER THIS I WOULD GO TO MY DEALER OR AN AUTOSHOP AND HAVE THE \"PULL THE CODE\" USING A ODB II ERROR SCAN TOOL.  EVERYTHING IT WAS THE SAME \"CODE\" NAMED P0300.  THIS WOULD HAPPEN INFREQUENTLY (5-6 TIMES A MONTH) BUT EVENTUALLY IT BECAME A OCCURRENCE ALMOST BY THE MINUTE.  WHEN THE CAR \"STUMBLES\" THERE IS NO POWER TO MERGE, TURN OR CHANGE LANES.  MY DEALER HAS OFFERED A RECALL - WHICH IS A COMPUTER \"REFLASH\" - BUT TO NO AVAIL - THE PROBLEM STILL PERSISTS.  WHEN I COMPLAIN I AM TOLD THERE IS NOTHING MORE THEY CAN DO.    PLEASE HELP.   *NM",
        "vin": "JA3AH86F23U"
    }
]