[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/11/2021",
        "dateOfIncident": "12/03/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11443460,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "The accelerator sticks and this is very dangerous",
        "vin": "4M2YU56Z45D"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/24/2019",
        "dateOfIncident": "10/24/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11270694,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 MERCURY MARINER. WHILE THE CONTACT WAS DRIVING 45 MPH, ANOTHER VEHICLE VEERED INTO HIS PATH WITH THE BRIGHT LIGHTS ILLUMINATED. TO AVOID CRASHING INTO THE OTHER VEHICLE, THE CONTACT MOVED OVER INTO THE RIGHT LANE. THE VEHICLE STRUCK A DITCH AND ROLL OVERED FOUR TIMES. THE AIR BAGS FAILED TO DEPLOY. THE CONTACT SUSTAINED ARM, NECK, AND BODY INJURIES. HE AND THE PASSENGER WERE TRANSPORTED TO THE HOSPITAL FOR MEDICAL ATTEINTION. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO A TOW YARD. THE VEHICLE WAS NOT TAKEN TO A DEALER OR AN INDEPENDENT MECHANIC FOR DIAGNOSTIC TESTING. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 191,000.",
        "vin": "4M2YU56135D"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/29/2019",
        "dateOfIncident": "04/27/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11204530,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "CD4E - ENGINE STALLING ON ENGAGEMENT/STOPPING. VEHICLE STALLED AT THE RED LIGHT OF AN EXIT RAMP OFF THE HIGHWAY. VEHICLE STALLED WHEN AT A COMPLETE STOP AND WOULD NOT ENGAGE WHEN PUT INTO DRIVE OR REVERSE.",
        "vin": "4M2YU56Z45D"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/24/2018",
        "dateOfIncident": "04/22/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11089900,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 MERCURY MARINER. WHILE DRIVING 60 MPH, THE VEHICLE STALLED AND THE ANTI-THEFT SYSTEM WARNING INDICATOR ILLUMINATED. THE CONTACT TURNED OFF AND RESTARTED THE ENGINE, BUT THE VEHICLE WOULD JERK WHILE DRIVING. THE VEHICLE WAS DRIVEN TO THE CONTACT'S RESIDENCE. THE DEALER (NORTHTOWNE LINCOLN, 21 NE VIVION RD, KANSAS CITY, MO 64118) AND MANUFACTURER WERE CONTACTED AND STATED THAT THERE WAS NO RECALL ASSOCIATED WITH THE VIN. THE FAILURE MILEAGE WAS 165,250. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/29/2017",
        "dateOfIncident": "12/15/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11057464,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 MERCURY MARINER. WHILE THE VEHICLE WAS STATIONARY, THE CONTACT NOTICED THAT THE FRAME WAS SEVERELY RUSTED AND CORRODED WITH HOLES. BROWNELL MOTORS INC IN FISHKILL, NEW YORK WAS MADE AWARE OF THE FAILURE AND STATED THAT THERE WAS NO RECALL ON THE VEHICLE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VIN WAS UNKNOWN. THE FAILURE MILEAGE WAS APPROXIMATELY 103,000.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/14/2017",
        "dateOfIncident": "12/13/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11054786,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE FREEWAY AND MY CAR JUST QUIT WORKING.  I TOOK IT TO THE MECHANIC AND THE ISSUE IS THE COILS AND A NOW FRIED COMPUTER SYSTEM.",
        "vin": "4M2CU57125D"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/01/2017",
        "dateOfIncident": "10/31/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11042251,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "AS OF MONDAY OCT 23RD 2017. MY 2005 MERCURY MARINER STARTED STUTTERING, HESITATING, LOSING POWER, SPITTING, SUFFERING, HOW EVERY YOU WOULD PUT IT. WHEN YOU PUSH ON THE GAS. IT DID THIS OFF AN ON THIS DAY. LATER THIS DAY IT FELT LIKE SOMEONE PRESSED ON THE BRAKES AND THEN FLOORED THE GAS AT THE SAME TIME. WHEN THIS HAPPENED THE ANTI-THEFT LIGHT FLASHED AT THE SAME TIME IT DONE THIS. IT DOES IT WITH IN ABOUT 10 SECONDS THEN THE LIGHT GOES OUT AND GOES BACK TO SPITTING AN SPUTTERING AND THE RADIO VOLUME GOES DOWN AND BACK UP OFF AN ON AS THIS IS HAPPENING. IT CONTINUED DOING ALL OF THAT EVERY SO OFTEN EVERYDAY FROM OCT 23RD - OCT 31ST. ON OCT 31ST 2017 I WAS COMING HOME, IT WAS AROUND 9:30 P.M. SPEED LIMIT WAS 55 I WAS RUNNING RIGHT AT 60 COMING OVER HIWASSEE BRIDGE AND MY HOLE VEHICLE SHUT DOWN HAD NO LIGHT INSIDE OR OUT WASN'T RUNNING, COULDN'T STEER, TRIED TO TURN HAZARD LIGHTS ON TO LET CARS COMING BOTH WAYS I WAS THERE BUT NOTHING WOULD WORK. MY BOY FRIEND SAID I'M GOING TO PUT IT IN NEUTRAL HE REACHED OVER TO SEE IF IT WOULD CRANK NOTHING I STARTED GETTING NERVOUS SO I JUST PUT IT BACK IN DRIVE AND AFTER A COUPLE SECONDS IT WAS RUNNING AGAIN BUT HAD NO LIGHTS AT ALL INSIDE OR OUT JUST COULD DRIVE. SO I WAS TRYING TO MAKE IT TO THE END OF THE BRIDGE WITH NO LIGHTS SO I COULD PULL OFF BUT IT STARTED ACTING GOING CRAZY FLASHING ON OFF LIKE IT WAS POSSESSED OR SOMETHING. IT DID THAT FOR ABOUT A MINUTE THE THE HEAD LIGHTS CAME ON AND STAYED ON JUST THE HEAD LIGHTS ONLY STILL HAD NO OTHER LIGHTS NO TAIL, BRAKE, OR INSIDE LIGHTS, JUST HEAD LIGHTS. SO I TRIED TO MAKE IT ON HOME. IT CONTINUED TO DO THE SPITTING AN SPUTTERING THING AND THE BATTERY LIGHT FLASHED ON THEN OFF ABOUT 3 TIMES IN 5 MILES MY TURN WAS COMING UP TO THE LEFT SO I JUST TIRED THE BLINKER HOPING IT WILL WORK, NO LUCK. AFTER I MADE THE LEFT TURN GOT GOING THE HAZARD LIGHTS CAME ON. 7 MILES ALL LIGHTS ON.",
        "vin": "4M2CU57145D"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "05/11/2017",
        "dateOfIncident": "05/09/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10984959,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THE FREEWAY AND CAR SUDDENLY HAS OVERDRIVE LIGHT BLINKING, AT THE SAME TIME I BEGAN LOSING POWER, I WAS ABLE TO GET OFF FREEWAY BUT NOT AFTER I OPEN HOOD AND NEARLY GOT RUN OVER. I WAS CHECKING TO SEE IF THERE WAS OVERHEATING OR SMOKE. BUT NOTHING. I HAVE ALREADY REPLACED PCM, TRANSMISSION, AND TORQUE CONVERTER. CONSEQUENTLY MY SHIFTER IS   BROKEN AND YOU CAN SEE DOWN INTO TRANSMISSION. OBVIOUSLY NO I CAN'T DRIVE, I WILL HAVE TO HAVE VEHICLE TOWED. WHY HASN'T TRANSMISSION BEEN RECALLED ON THIS VEHICLE. I COULD NOT THINK ABOUT IF MY CHILD WOULD HAVE BEEN WITH ME AND STOOD IN FRONT OF CAR. HE NEVER WOULD HAVE BEEN ABLE TO MOVE THAT QUICKLY OR EVEN WORSE WITH FREEWAY DRIVING  I EVEN COULD HAVE BEEN HIT FROM BEHIND.",
        "vin": "5M2CU57125D"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/15/2016",
        "dateOfIncident": "09/27/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10916250,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2005 MERCURY MARINER PREMIER HAS A PROBLEM WHEN DRIVING THAT THE LEFT AND RIGHT DOOR SHOWS THEY ARE AJAR. AND IT CYCLES BACK AND FORTH ACROSS THE DASH BOARD, YOU HEAR A BEEP THEN THE MESSAGE IS DISPLAYED ON THE DASHBOARD . WHEN THE CAR IS PARKED AND LOCKED THE ALARM GOES OFF BETWEEN FIVE AND 10 TIMES A NIGHT DRAINING THE BATTERY. THIS HAS STARTED ABOUT A YEAR AND HALF AGO. I TOOK MY CAR INTO A FORD DEALERSHIP ON SEPTEMBER 27,20016 TO BE REPAIRED. I HAD THE CAR IN THEIR CAR CARE FOR TWO AND ONE HALF WEEKS ONLY TO FIND OUT THAT THE PART FOR THE RIGHT SIDE THE CABLE AND HANDLE ASSEMBLY IS RECALLED AND THERE IS NO REPLACEMENT AT THIS TIME AND NO ESTIMATED TIME FRAME FOR IT TO BE AVAILABLE. I SPENT $544.00 ON A RENTAL AND $604.39. I STILL DO NOT HAVE THE PROBLEM FIXED AND FORD DEALER SAYS IT HAS NO TIME ESTIMATE WHEN IT CAN BE REPAIRED IF ANY?",
        "vin": "4M2CU57185D"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/13/2016",
        "dateOfIncident": "02/16/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10905973,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2005 MERCURY MARINER ON 2/14/13 FROM A LOCAL DEALER IN MY AREA. WITHIN TWO DAYS THE VEHICLE BROKE DOWN ON ME. I DID NOT PURCHASE THE WARRANTY (STUPID MISTAKE) BUT I DID TAKE THE VEHICLE BACK TO THE DEALERSHIP IN WHICH THEY ASSURED ME THEY WOULD FIX THE PROBLEM. IT WAS A TRANSMISSION PROBLEM FAST FORWARD TO 03/2015 THE TRANSMISSION WENT OUT IN THE VEHICLE WHICH COST ME AROUND $3,000. THAT IS MORE THAN I OWE ON THE VEHICLE, WOULD NOT RECOMMEND THIS VEHICLE UNLESS YOU WANT TO PAY FOR IT TWICE.",
        "vin": "4M2YU57Z55D"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/11/2016",
        "dateOfIncident": "03/06/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10864352,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECENTLY PURCHASED A 2005 MERCURY MARINER.  JUST AFTER MAKING MY FIRST PAYMENT, I WAS GOING DOWN THE INTERSTATE IN IT AND IT JERKED LIKE SOMETHING HAD BROKEN.  IT NEVER LOST POWER. NEVER HAD ANY GAUGES COME ON OR ANYTHING. I DROVE IT TO THE CLOSEST STORE AND HAD IT TOWED HOME AND THEN TO THE FORD DEALERSHIP IN MY TOWN.  THEY CALL ME 2 DAYS LATER AND SAY I NEED A NEW MOTOR $6500.  THAT'S MORE THAN THE VEHICLE IS WORTH.  I ASK HOW WAS THAT WHEN NO GAUGES CAME ON. HIS RESPONSE WAS \"IT'S INTERNAL.  GAUGES WON'T COME ON.\"  NEITHER THE LOT I BOUGHT IT AT, FORD, NOR THE FINANCE COMPANY WILL HELP IN THE REPAIRS.  JUDGING BY ALL OF THE COMPLAINTS LISTED HERE, THIS SHOULD BE A MANDATORY RECALL.  NOW I'M STUCK WITH A LEMON, NO WAY TO FIX IT OR GET OUT OF IT.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/05/2016",
        "dateOfIncident": "07/01/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10853470,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 MERCURY MARINER. AFTER DRIVING HIGH SPEEDS AND COMING TO A STOP, THE VEHICLE HESITATED AND STALLED WITHOUT WARNING. THE CONTACT HAD TO MAKE SEVERAL ATTEMPTS TO RESTART THE VEHICLE. THE FAILURE RECURRED. THE CONTACT TOOK THE VEHICLE TO THE DEALER, BUT NO FAILURE WAS FOUND. THE VEHICLE WAS NOT REPAIRED AND THE FAILURE RECURRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 127,000.",
        "vin": "4M2CU57145D"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/02/2015",
        "dateOfIncident": "11/13/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10808014,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 MERCURY MARINER. THE CONTACT STATED THAT THE VEHICLE DECELERATED AND STALLED WITHOUT WARNING, WHILE EXITING HIGHWAY TRAFFIC. THE FAILURE WAS EXPERIENCED SEVERAL TIMES. ALL THE LIGHTS ON THE INSTRUMENTAL PANEL ILLUMINATED AFTER THE FAILURE OCCURRED. THE CONTACT WAS ABLE TO RESTART THE ENGINE AND THE VEHICLE RESUMED TO NORMAL FUNCTION. THE VEHICLE WAS TAKEN TO THE DEALER TO WHERE THE FAILURE WAS UNABLE TO BE DETERMINED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 131,000.",
        "vin": "4M2CU561X5D"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/19/2015",
        "dateOfIncident": "09/15/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10749657,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 MERCURY MARINER. WHILE DRIVING APPROXIMATELY 60 MPH, THE EXTERIOR HEADLIGHTS FAILED. THE CONTACT SWITCHED TO THE AUTOMATIC LIGHT SYSTEM. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DIAGNOSED AS A LIGHT SWITCH FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 150,000.",
        "vin": "4M2CU57125D"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/29/2015",
        "dateOfIncident": "07/29/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10744547,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR IS PARKED IN MY OFFICE PARKING LOT.  THE CAR ALARM GOES OFF.  I CAN SEE OUT THE WINDOW THERE IS NO ONE AROUND THE CAR.  I USE THE REMOTE TO TURN IT OFF.  HAPPENS INTERMITTENTLY, A FEW TIMES A DAY.  I EVEN TOOK THE KEYS OUT OF MY POCKET AND JUST HAVE THEM SITTING ON MY DESK...IT STILL HAPPENS....UPDATE 9/15/15*CW     UPDATED 12/13/2017*CN",
        "vin": "4M2CU56165D"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/29/2015",
        "dateOfIncident": "07/29/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10744736,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "RECEIVED AN  ABS TROUBLE CODE. MECHANIC CHECKED AND SAID IT WAS THE ABS TONE WHEEL ON THE OUTTER LEFT FRONT CV JOINT. MECHANIC SAID THIS WAS A COMMON PROBLEM WITH FRONT TONE WHEELS ON THE MERCURY MARINERS AND SHOULD BE RECALLED BY FORD.",
        "vin": "4MCU57155DJ"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "06/24/2015",
        "dateOfIncident": "06/24/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10730205,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS STOPPED IN A HIGHWAY TURN LANE, WAITING FOR TRAFFIC TO PASS IN ORDER TO MAKE A LEFT TURN, WHEN  HEARD A LOUD NOISE AND THE REAR WINDOW ON THE LIFT GATE SUDDENLY SHATTERED AND EXPLODED OUTWARD FROM THE BACK OF THE VEHICLE, WITH MOST OF THE GLASS ENDING UP ON THE ROADWAY. THIS OCCURRED IN THE EARLY AFTERNOON ON A WARM BUT NOT HOT DAY (TEMPS WHERE PROBABLY IN THE LOW 80S).",
        "vin": "4M2YU57Z25D"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/20/2015",
        "dateOfIncident": "04/20/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10711837,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR STALLED ON ME TWICE TODAY. THE FIRST TIME IT HAPPENED, I WAS TRAVELING ON GIBSON AT 45 MPH AND MADE A LEFT TURN SUDDENLY CAR STALLED WHILE IN GEAR. I WAS ABLE TO COAST TO THE SHOULDER, HOWEVER I COULD NOT RESTART THE CAR. I CHECKED THE MANUAL AND CAME ACROSS THE FUEL SAFETY CUT OFF SWITCH LOCATED ON THE FRONT PASSENGER SIDE PANEL. I PUSHED THE RESET BUTTON AND WAS ABLE START THE CAR. SECOND TIME, I WAS APPROACHING A TRAFFIC LIGHT THE CAR STALLED ON ME AGAIN. I PUSHED THE RESET BUTTON AGAIN, AND STARTED THE CAR. AT THIS POINT I AM NOT SURE WHAT IS HAPPENING TO MY CAR, AND I DON'T WANT TO BE ON THE FREEWAY AT HIGH SPEEDS WHEN IT SUDDENLY HAPPENS AGAIN. IT APPEARS TO ME THAT THE FUEL FLOW IS BEING SUDDENLY CUT OFF TO THE ENGINE.  *TR",
        "vin": "4M2YU57145D"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "03/01/2015",
        "dateOfIncident": "02/14/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10691335,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS IN A HEAD ON COLLISION WITH ANOTHER VEHICLE, BOTH TRAVELING 30MPH. THE VEHICLE WAS TOTALED. THE DRIVER WAS WEARING THEIR SEAT BELT, AND THEIR NOSE WAS BROKEN DUE TO COLLISION WITH THE STEERING WHEEL. THE AIRBAG NEVER DEPLOYED. *TR",
        "vin": "4M2YU57165D"
    },
    {
        "components": "VEHICLE SPEED CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/13/2015",
        "dateOfIncident": "11/03/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10683358,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE GAS PEDAL STUCK WHILE DRIVING, THE CAR WOULD ONLY IDLE AND NOT MOVE.  THE CAR WAS IN TRAFFIC AND ALMOST HIT BY ANOTHER VEHICLE. ON A PRIOR DATE THE GAS PEDAL STUCK AND WOULD NOT MOVE, CAR JUST IDLED IN A PARKING LOT FOR ABOUT FIVE MINUTES. THIS WASN'T FIRST TIME IT STUCK, BUT PRIOR TIMES IT ALWAYS RELEASED RIGHT AWAY.  *TR",
        "vin": "4M2YU56Z25D"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/20/2014",
        "dateOfIncident": "11/15/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10659621,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE HIGHWAY MY BRAKES WASN'T WORKING. AFTER GETTING IT CHECKED OUT, I FOUND THERE WAS A RIP IN THE FRONT BRAKE HOSE. THIS CAUSED ALL OF MY BRAKE FLUID TO LEAK OUT WHICH LEFT ME WITH NO BRAKES. WHEN YOUR BRAKE HOSE IS RIPPED OR LEAKING, YOU RECEIVE NO WARNING THAT THERE IS A PROBLEM. THIS PUTS YOU AND OTHERS AT RISK OF HAVING A BAD CAR CRASH.    IT APPEARS THE SAME PROBLEM IS OCCURING WITH THE REAR BRAKE HOSE. THIS VEHICE SHOULD BE RECALLED BECAUSE THESE BRAKE HOSE CAN GIVE OUT AT ANYTIME WITHOUT WARNING AND COULD BE A HUGH TRADEGY FOR EVERYONE INVOLVED.  *TR",
        "vin": "4M2YU56195F"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/22/2014",
        "dateOfIncident": "12/04/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10615259,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 MERCURY MARINER. THE CONTACT STATED THAT ALL OF THE WARNING LIGHTS TO ILLUMINATED ON THE INSTRUMENT PANEL. IN ADDITION, THE VEHICLE STALLED AND COULD BE RESTARTED HOWEVER THE FAILURE RECURRED TWELVE TIMES. THE VEHICLE WAS TOWED TO THE DEALER FOR DIAGNOSTIC TESTING AND STATED THAT THE STEERING COLUMN COVER FOR THE IGNITION WAS FRACTURED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 55,000.",
        "vin": "4M2CU57175D"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/27/2014",
        "dateOfIncident": "09/24/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10575271,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR ACCELERATED AS I TRIED TO STOP. THEN WHEN I TRIED TO GO, I PRESSED THE GAS AND IT WOULD NOT GO BUT THE RPM'S WENT REALLY HIGH. THEN THE CAR DIED AND I HAD TO WAIT A FEW MINUTES TO TURN IT BACK ON. 2ND INCIDENT- I WAS DRIVING ON A BUSY ROAD DURING RUSH HOUR AND TRIED TO STOP AT A STOP LIGHT BUT THE CAR ACCELERATED SO I HAD TO KEEP BREAKING BUT THE CAR WOULD NOT STOP ACCELERATING SO I TURNED THE CAR OFF. WHEN I TRIED TO TURN THE CAR BACK ON, NOTHING WORKED (HAD NO POWER AT ALL THEREFORE I COULD NOT TURN ON MY HAZARDS TO SIGNAL TO PEOPLE THAT MY CAR WAS STALLED). I WAITED THEN TRIED TO TURN IT ON AGAIN AND IT TURNED ON BUT WAS STILL ACCELERATING ONLY I WAS IN PARK SO IT DID NOT GO ANYWHERE. I TURNED THE ENGINE OFF BUT DID NOT TURN THE CAR OFF SO I COULD TURN HAZARDS ON. I WAITED SEVERAL MINUTES THEN TRIED AGAIN AND WAS ABLE TO PULL OFF THE ROAD.   *TR",
        "vin": "4M2CU57125D"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/10/2014",
        "dateOfIncident": "01/14/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10563727,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "ANTI THEFT DASH LIGHT COMES ON SOLID FOR 2 OR 3 SECONDS.  ENGINE LOSES POWER.  AFTER 2 OR 3 SECONDS, THE ANTI THEFT LIGHT GOES OFF AND ENGINE REGAINS POWER.  HAS HAPPENED INTERMITTENTLY SEVERAL TIMES SINCE FIRST OCCURRENCE AT VARIOUS SPEEDS AND INTERVALS.   *TR",
        "vin": "4M2YU57195D"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/06/2013",
        "dateOfIncident": "08/12/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10542349,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "ON AUGUST,2013 I WENT GOT MY VEHICLE SMOGED  .  IT PASSES GOOD. THEN THE NEXT DAY I SEE ENGINE LIGHT AIR BAG LIGHT. THEN GOES OFF WHEN I STOP. SO I TRY TAKE TO A MECHANIC WHO I SPEND A GOOD LIKE ALMOST 800 STILL LIGHT IS ON NOW BOTTOM. NOW THE CAR DASH BOARD AND THE  RADIO ARE SO HOT, IT FELT LIKE SOMETHING MAY CAUSE A FIRE! I WAS VERY SCARED!  I WAS NEAR A LINCOLN DEALERSHIP WHO HAD A SERVICE CENTER IN DUARTE. CA. I NEVER KNEW. A PCM WAS A PART OF A TUNEUP! PLEASE THIS IS A 2300! AND I'M PUTTING OUT ANOTHER 1288!",
        "vin": "4M2CU57125D"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/18/2013",
        "dateOfIncident": "02/01/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10525643,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING TO WORK AND MY HEAD LIGHTS WENT OFF. I HAVE PAID 3 DIFFERENT MECHANICS TO FIX THIS PROBLEM AND IT HAS ONLY GOTTEN WORSE. I EVEN PAID AAMCO OVER 500.00 TO FIX THIS AND THEY ENDED UP GIVING ME MY MONEY BACK. AND NOW THE WHOLE LIGHTING SYSTEM POPS ON AND OFF INCLUDING BACK LIGHTS AND RUNNING LIGHTS. MY BACK WIND SHIELD WIPER NO LONGER WORKS AND MY DOOR AJAR LIGHT STAYS ON..I LIKE MY TRUCK BUT I DON'T KNOW HOW TO FIX THIS PROBLEM. I WORK 21 MILES FROM MY HOME AND I WORK NIGHT SHIFT. THIS IS DANGEROUS ON THE HIGHWAY. I PRAY EVER NIGHT I CAN GET TO WORK SAFELY WITH OUT MY LIGHTS GOING OUT ON ME. I CANNOT AFFORD ANOTHER CAR RIGHT NOW. PLEASE HELP ME.   *TR",
        "vin": "4M2YU56155D"
    },
    {
        "components": "VEHICLE SPEED CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/19/2012",
        "dateOfIncident": "03/02/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10475934,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PROBLEM IS WITH THE GAS PEDAL, ITS HARD TO PRESS/ACCELERATE AND SOMETIMES WHEN I PRESS/ACCELERATE FROM A STOP AND AT SPEEDS OF 30 MPH, IT GETS STUCK AND I HAVE TO PUT IT IN NEUTRAL.  VERY DANGEROUS SITUATION.  *TR",
        "vin": "4M2YU57Z15D"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/22/2012",
        "dateOfIncident": "10/20/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10466917,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING THE CAR IN COLD WEATHER THE THROTTLE WOULD STICK FOR THE FIRST COUPLE OF MILES UNTIL THE CAR WAS WARMED UP. THIS IS A 4CYL.AUTO TRANS./ SAME TYPE OF VEHICLE AS FORD ESCAPE.  *TR",
        "vin": "4M2YU57Z85D"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/17/2011",
        "dateOfIncident": "12/01/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10436205,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "ORIGINALLY, THE CAR ALARM WOULD GO OFF WITHOUT A REASON--SOMETIMES WITHIN A FEW MINUTES OF EACH OTHER, SOMETIMES DAYS APART OR EVEN WEEKS.  IT HAS ESCALATED NOW TO NOT BEING ABLE TO LOCK MY DOOR, ANY DOORS, WITHOUT THE ALARM GOING OFF WITHIN A FEW MINUTES ANY TIME OF THE DAY OR NIGHT.  EVEN WHEN THE DOORS ARE NOT LOCKED AND I AM DRIVING DOWN THE STREET, MY LIGHTS START FLASHING ON THE INSIDE AND OUTSIDE FOR THE FIRST FEW MINUTES OF GETTING INTO THE CAR.  I HAVE FRIENDS AND RELATIVES WHO TELL ME THEY KNOW PEOPLE WITH CARS, ESPECIALLY EXPLORERS THAT DO THAT.  THE GUY ARE THE FORD SERVICE DEPARTMENT TOLD ME THAT THEY HAVE HAD A LOT OF ISSUES DEALING WITH THAT PROBLEM, ESPECIALLY WITH EXPLORERS.  THEY TELL ME THAT THE REMEDY IS GETTING THE ENTIRE DOOR LOCK SYSTEM CHANGED OUT ON THE FRONT PASSENGER DOOR AT THE COST OF CLOSE TO $400.  *TR",
        "vin": "4M2YU56185D"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "11/17/2011",
        "dateOfIncident": "11/15/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10436289,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR GLASS HATCH EXPLODED WITHOUT WARNING WHILE PARKED OVERNIGHT OUTSIDE.  *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/01/2011",
        "dateOfIncident": "10/01/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10428147,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE STOPPED, THE ACCELERATOR PEDAL STICKS IN THE \"UP\" POSITION, AND REQUIRES EXCESSIVE FORCE TO MOVE THE VEHICLE.  THIS SOMETIMES RESULTS IN EXCESSIVE ACCELERATION WHEN THE PEDAL BECOMES UNSTUCK.  *TR",
        "vin": "4M2YU56Z65D"
    },
    {
        "components": "POWER TRAIN,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "07/30/2011",
        "dateOfIncident": "06/24/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10416339,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "AUTOMATIC EQUIP. MFG. CO.",
                "productMake": "UNKNOWN",
                "productModel": "AUTOMATIC",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "I PURCHASED A 2005 MERCURY MARINER IN MARCH OF 2007, THIS VEHICLE HAD 11,000 MILES ON IT.  IN JUNE OF 2009, I BEGIN HEARING RATTLING NOISE IN THE ENGINE AND THE GEARS BEGIN OPERATING VERY POORLY.  HAD AN AUTO SHOP CHECK OUT WHAT THE PROBLEM COULD BE IN JUNE OF 2009, AND WAS TOLD MY TRANSMISSION NEEDED REPAIR.  I STOPPED DRIVING THE VEHICLE AND BEGIN USING A RENTAL CAR UNTIL I COULD PUT THE MONEY TOGETHER FOR THE REPAIR, WHICH I WAS QUOTED OVER $2100.00.  I CONTACTED FORD TO INQUIRE ABOUT WHY I'M HAVING THIS PROBLEM AT 40,989 MILES, FORD CLAIMED THEY HAD NO REPORTED CASES OF MY MECHANICAL PROBLEM AND THAT I NEEDED TO GET IT TO THE DEALER TO BE CHECKED OUT.  I WAS INFORMED I WOULD BE RESPONSIBLE FOR ALL CHARGES, REPAIRS, TOWING AND RENTAL CAR EXPENSES, SINCE THE 36,000 MILES WARRANTY AND 3 YEARS HAD EXPIRED.  I MADE ARRANGEMENTS FOR MY CAR TO BE REPAIRED BY THE FIRST AUTO SHOP, AND THE TRANSMISSION WAS REBUILT, TOTAL COAST, NOT INCLUDING RENTAL CAR CAME TO $2237.50.    JULY 16, 2011 I WAS TRAVELING APPROX. 30 MILES AND MY OD OFF LIGHT BEGIN FLASHING, MADE A STOP AT A CONVENIENT STORE,  RESTARTED THE CAR AND THE OD OFF LIGHT HAD STOPPED FLASHING.  WHILE CONTINUING TO TRAVEL APPROX. ANOTHER 30 MILES, OD OFF LIGHT BEGIN FLASHING AGAIN, APPROX. 20 MINUTES LATER THE CHECK ENGINE LIGHT CAME ON.  THERE WERE NO SIGNS OF OVER HEATING, NO STRANGE SMELLS OF ANY SORT, THE VEHICLE CONTINUED TO RUN AS NORMAL.  ONCE I MADE MY FINAL DESIGNATION, THE VEHICLE APPEARED TO BE FINE AND NORMAL, STILL NO SIGNS OF OVER HEATING OR NO STRANGE SMELLS.      WHILE TRAVELING BACK APPROX. 45 MILES, THE OD OFF LIGHT BEGIN FLASHING, NO SIGNS OF OVER HEATING, NO STRANGE SMELLS.  APPROX. ANOTHER 30 MILES, THE CHECK ENGINE LIGHT CAME ON.  CHECK ENGINE LIGHT REMAINED ON, I LOCATED A COUPON FOR A FREE SCAN WITH AAMCO, WHICH FOUND THAT MY TRANSMISSION NEED TO BE REPAIRED, THE TRANSMISSION FLUID WAS DRAINED AND  WAS BURNT.  TOTAL COST FOR THIS REPAIR, NOT INCLUDING RENTAL CAR IS $2290.00, MILEAGE IS AT 59,900.  *TR",
        "vin": "4M2YU56Z65D"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/27/2010",
        "dateOfIncident": "12/15/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10372511,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS MILEAGE HAS SUDDENLY AND MARKEDLY PLUMMETED ON HIGHWAY DRIVING.  AIR FILTER REPLACED - NO CHANGE.  THERE HAS BEEN NO CHANGE IN DRIVING PATTERNS.  IT HAS GONE FROM AROUND 20 HWY TO AROUND 10 HWY OUT OF THE BLUE - NO ENGINE/TRANNY/BRAKES ISSUES OR ANYTHING LIKE THAT.  NOT A CLUE.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/18/2010",
        "dateOfIncident": "11/06/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10366751,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 MERCURY MARINER.  VEHICLE RUNNING JUST FINE, EXCEPT STARTING SLUGGISH.  NEEDED NEW BATTERY.  I CHANGED IT. RIGHT AWAY IT BEGAN TO SHIFT ROUGH ON 3 SHIFT (AUTOMATIC).  READ MANUAL AND IT STATED TO GIVE TIME FOR COMPUTER TO RESET TO DRIVE CONDITIONS.  AFTER 3 WEEKS I SET UP APPOINTMENT WITH DEALERSHIP.  THEY CHARGED $119.00, AND STATED THAT THEY UPDATED THE COMPUTER, BUT IT STILL DID SAME THING.  THEY INFORMED ME THEY CALLED FORD, AND WAS TOLD TO REPLACE THE TRANSMISSION FOR $3500.  THE TECHNICIAN DID NOT SEEM CONVINCED OF THAT, AND SAID FLUID WAS FINE AND DID NOT SMELL BURNT.  SAID TO DRIVE LONGER.  I HAVE WRITTEN TO FORD TO NO AVAIL.  THEY ALSO STATED THE REASON IT DID NOT DO IT WITH THE OLD BATTERY WAS DUE TO THE COMPUTER COVERING THE ROUGH SHIFT.  I TALKED TO A TRANSMISSION EXPERT.  HE JUST COULD NOT SEE THAT BEING POSSIBLE.  *TR",
        "vin": "4M2YU57175D"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/20/2010",
        "dateOfIncident": "10/17/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10361317,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN THE INTERSTATE FOR ABOUT 50 MILES AND EXITED AT AN OFF RAMP. AT THE END OF THE RAMP, MY 2005 MERCURY MARINER STALLED CAUSING LOSS OF CONTROL.. MY MARINER WOULD CRANK, BUT WOULD STALL ONCE ENGAGED INTO FORWARD GEAR. I WAS ABLE TO KEEP THE VEHICLE FROM STALLING BY IDLING AT HIGH RATE IN NEUTRAL ONLY.   MY VEHICLE  STALLS ONCE PLACED INTO GEAR AND COMING TO A STOP AT PERIODIC TIMES.  I LEARNED THAT FORD MOTOR COMPANY PRODUCED TECHNICAL SERVICE BULLETINS ON THIS ISSUE, BUT DID NOT NOTIFY ME OR OTHER OWNERS OF THE DEFECT WITH MARINERS FROM '05-'08 EQUIPPED W/ A CD4E AUTOMATIC TRANS AXLE BUILT FROM 8/01/04-2/15/07. I CONTACTED FORD AND DISCOVERED THAT FORD DOES NOT NOTIFY OWNERS OF DEFECTS THROUGH SERVICE BULLETINS. FORD REFUSES TO RECTIFY ISSUE. *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/02/2010",
        "dateOfIncident": "05/20/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10315646,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 MERCURY MARINER. WHILE THE CONTACT WAS DRIVING 55 MPH THE VEHICLE HAD SUDDENLY BEGAN TO SURGE FORWARD CAUSING THE CONTACT TO APPLY THE BRAKES IN ORDER TO STOP THE VEHICLE FROM ACCELERATING. THE VEHICLE WAS TAKEN TO THE DEALERSHIP WHERE THE CONTACT HAD THE TRANSMISSION TORQUE CONVERTER AND THROTTLE SENSOR REPLACED. THE CONTACT NOTICED PRIOR THAT THE REAR END OF THE VEHICLE WOULD JERK WHENEVER IT WAS DRIVEN UP AN INCLINE. THE CURRENT AND FAILURE MILEAGES WERE 61000.",
        "vin": "4M2CU57125D"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/15/2010",
        "dateOfIncident": "12/20/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10310504,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR STOPPED RUNNING AS I EXITED THE INTERSTATE OFF RAMP.  THIS WAS IN HIGH TRAFFIC WITH CARS BEHIND ME.  I WAS ABLE TO GET THE CAR RESTARTED AND COASTED TO THE SIDE OF THE ROAD.  A TOW TRUCK TOOK ME TO A FORD DEALER, WHERE IT WAS STATED THE TORQUE CONVERTER HAD FAILED.  THE FORD DEALER TOLD ME THAT A NEW \"CODE\" NUMBER HAD BEEN ISSUED BECAUSE THERE WERE SO MANY PROBLEMS FOR FORD ESCAPE AND MERCURY MARINER FROM 2003-2008.   MY VEHICLE IS A 2005 MERCURY MARINER.  I HAD NO PREVIOUS INDICATIONS THAT THIS WOULD FAIL AND WAS TRAVELING OUT OF STATE.   THE COST WAS $1800 AND THE DEALER STATED THAT FORD AND MERCURY WERE NOT DOING ANYTHING TO RESOLVE THIS OTHER THAN ISSUE AN INTERNAL NOTICE TO ALL DEALERS.   I FEEL A RECALL SHOULD BE ISSUED AND MY COSTS REFUNDED, THEY ARE OBVIOUSLY AWARE OF THIS ISSUE.  *TR",
        "vin": "4M2YU56Z05D"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/23/2009",
        "dateOfIncident": "10/16/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10289645,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR WINDOW ON MY 2005 MERURY MARINER EXPLODED. THERE WAS A LOUD BOOM AND THE WINDOW EXPLODED INTO SMALL PIECES. *TR",
        "vin": "4M2YU57125D"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/30/2009",
        "dateOfIncident": "05/15/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10272405,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN THE INTERSTATE FOR 45 MILES AND EXITED AT AN OFF RAMP. AT THE END OF THE  RAMP, MY CAR STALLED ALMOST CAUSING A CRASH.  MY CAR WOULD CRANK, BUT WOULD CONTINUE TO STALL ONCE ENGAGED INTO GEAR.  I CAN KEEP THE VEHICLE FROM STALLING BY MASHING THE ACCELERATOR, REVVING THE RPM'S.  EVER SINCE THEN MY VEHICLE HAS CONTINUED TO STALL ONCE PLACED INTO GEAR AND COMING TO A STOP AT PERIODIC TIMES.   I FIND MY VEHICLE UNSAFE TO DRIVE, DUE TO IT HAPPENING OUT OF NOWHERE AND AT INTERSECTIONS.  I HAD A FRIEND OF MINE IN THE AUTOMOBILE INDUSTRY LOOK AT MY VEHICLE AND INTO THE SITUATION, AND HE HAS FOUND THAT FORD HAS HAD NUMEROUS ISSUES AS FAR BACK AS '07 WITH ESCAPES AND MARINERS FROM '05-'08 EQUIPPED W/ A CD4E AUTOMATIC TRANS AXLE AND BUILT FROM 8/01/04-2/15/07.  FORD HAS ENACTED SERVICE PROCEDURES FOR CORRECTING THE PROBLEM DATED 3/01/2007. *TR",
        "vin": "4M2CU56175D"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/06/2009",
        "dateOfIncident": "05/02/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10267827,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 MERCURY MARINER.  WHILE DRIVING 25 MPH, THE CONTACT HEARD A LOUD CLUNKING NOISE COMING FROM THE ENGINE AND THE VEHICLE SHUT OFF.  SHE WAS ABLE TO RESTART THE VEHICLE AND HEARD A CLICKING NOISE.  SHE WAS ABLE TO SAFELY DRIVE THE VEHICLE TO HER DESTINATION.  THE VEHICLE WAS TOWED TO A LOCAL REPAIR SHOP AND INSPECTED BY A TECHNICIAN, WHO DETERMINED THAT THE ENGINE HAD NO OIL PRESSURE.  THE FAILURE CAUSED SEVERAL LIFTERS AND THE BEARING ROD TO FAIL.  THE VEHICLE HAS NOT BEEN REPAIRED.  THE CONTACT CALLED THE MANUFACTURER AND WAS INFORMED THAT NO COMPENSATION WOULD BE PROVIDED BECAUSE HER VEHICLE WAS OUT OF WARRANTY.  THE FAILURE AND CURRENT MILEAGES WERE 48,000.",
        "vin": "4M2YU56Z45D"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "03/23/2009",
        "dateOfIncident": "03/05/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10262784,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "3M COMPANY TRAFFIC SAFETY SYSTEMS DIV.",
                "productMake": "3M",
                "productModel": "SERIES 963",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "2-18-09: 2005 MERCURY MARINER--LOCKED ENGINE: MESSAGE: CHECK EMISSION SYSTEM. TAKEN TO SHOP. TOOK 10 DAYS TO REPAIR, DROVE VEHICLE 3 DAYS AND SAME THING HAPPENED.    3-5-09: VEHICLE AGAIN LOCKED UP AND TAKEN TO SHOP BY WRECKER FOR REPAIR. 2 WEEKS LATER CAR STILL NOT FIXED. TOLD BY FORD IN DETROIT: BACKLOG/PARTS SUPPLIER OUT OF BUSINESS. WILL NOT LOAN A ME A VEHICLE, CAN DO NOTHING TO HELP ME. WAIT 3 MONTHS FOR PART. *TR",
        "vin": "4M2YU56135D"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/20/2008",
        "dateOfIncident": "07/08/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10252344,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 MERCURY MARINER.  SUDDEN STALLING OF ENGINE AT SPEEDS UP TO 40MPH AND LOSS OF POWER (THEN RECOVERS) AT HIGHER SPEEDS.  NOTIFIED FORD AND SCHEDULED FOR SERVICE TWICE - DEALER UNABLE TO REPLICATE AND FORD RESPONSE IS THAT \"EVERY CONSIDERATION HAS BEEN GIVEN TO THE MATTER....UNABLE TO FURTHER REVIEW CONCERN\"  WE HAVE YET ANOTHER SERVICE CALL SCHEDULED WITH ANOTHER DEALER BECAUSE PROBLEM PERSISTS AND COULD LEAD TO SERIOUS ACCIDENT IN TRAFFIC.  PROBLEM MANIFESTED ITSELF IN JULY 2008 AND NO REGULAR CONSISTENT PATTERN TO IT BUT HAPPENING MORE OFTEN AND STALLS HAPPENING MORE OFTEN.    AFRAID TO DRIVE VEHICLE IN HEAVY NORTHERN VA TRAFFIC DUE TO ITS UNPREDICTABLE STALLING AND/OR LOSS OF POWER.  REPORTING IN CASE TO BE ON RECORD, IN CASE OTHER COMPLAINTS FILED ABOUT THIS ISSUE WITH THIS MODEL ,AND FOR FUTURE REFERENCE IN THE EVENT FORD UNABLE OR UNWILLING TO FIX A SERIOUS SAFETY ISSUE. *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/26/2008",
        "dateOfIncident": "10/26/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10246726,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2005 MERCURY MARINER, PURCHASED NEW. WHEN IT GETS COLD THE GAS PEDAL STICKS, I PUSH DOWN AND THERE IS NO RESPONSE FOR A FEW TIMES. THIS ALMOST CAUSED ME TO BE REAR ENDED THIS MORNING HAD I NOT PUT ON THE HAZARD LIGHTS. ONCE IT WARMS UP IT IS FINE. THIS HAS BEEN GOING ON SINCE I BOUGHT THE CAR BRAND NEW IN 2005. THIS HAS HAPPENED OVER 50 TIMES AND IS STARTING TO SCARE THE HECK OUT OF ME. *TR",
        "vin": "4M2YU56Z65D"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/26/2008",
        "dateOfIncident": "04/17/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 10225794,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "SIDE AIR BAGS DID NOT GO OFF AFTER HIT IN DRIVERS DOOR.  *TR",
        "vin": "4M2CU56105D"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/24/2008",
        "dateOfIncident": "04/17/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 10225591,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS HIT ON THE DRIVER'S SIDE DOOR, AND THE SIDE AIR BAG NEVER WENT OFF.  *TR",
        "vin": "4M2CU56105D"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/21/2008",
        "dateOfIncident": "04/17/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10225245,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 MERCURY MARINER.  WHILE DRIVING 40 MPH, THE CONTACT FELT AS IF SOMEONE REAR ENDED HER VEHICLE.  SHE LOOKED IN THE REARVIEW MIRROR, BUT DID NOT SEE ANYTHING.  WHEN SHE ARRIVED AT THE DEALER, THE ENTIRE ENGINE FELL FROM THE MOTOR COMPARTMENT AND ONTO THE GROUND.  THE MECHANIC STATED THAT THE ENTIRE FRONT END OF THE VEHICLE HAD FALLEN APART.  THE VEHICLE IS CURRENTLY AT THE DEALER.  THE FAILURE MILEAGE WASE 38,351.   UPDATED 05/21/08 *BF  THE CONSUMER ALSO STATED THE TRANSMISSION FAILED. UPDATED 05/19/08",
        "vin": "4M2YU56Z55D"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/16/2008",
        "dateOfIncident": "03/01/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10215118,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR BEGAN TO MAKE A POP LIKE NOISE, IT HAS BEEN TAKEN TO DEALER 3 TIMES AND THE CATALYTIC CONVERTER WAS REPLACED THE 2ND TIME IN. ON THE 3RD TIME THEY SAID THEY COULD DO NOTHING ABOUT THE NOISE AS I START THE CAR WHEN COLD. WHO IS LIABLE WHEN MY WARRANTY IS OVER?  *TR",
        "vin": "4M2YU56155D"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/05/2007",
        "dateOfIncident": "12/05/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10210908,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN IT GETS COLD THE GAS PEDAL STICKS, I PUSH DOWN AND THERE IS NO RESPONSE FOR A FEW TIMES.  THIS ALMOST CAUSED ME TO BE REAR ENDED THIS MORNING HAD I NOT PUT ON THE HAZARD LIGHTS.  ONCE IT WARMS UP IT IS FINE.  THIS  HAS BEEN GOING ON SINCE I BOUGHT THE CAR BRAND NEW IN 2005.  *TR",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "11/23/2007",
        "dateOfIncident": "11/21/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10209723,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 MERCURY MARINER.  WHILE DRIVING 25 MPH, THE REAR WINDOW SHATTERED WITHOUT WARNING.  THE POLICE STATED THAT A ROCK OR BULLET DID NOT CAUSE THE FAILURE; HOWEVER, THEY SUGGESTED THAT THE CHANGE IN WEATHER MAY HAVE CAUSED THE FAILURE.  AS OF NOVEMBER 23, 2007, THE DEALER HAD NOT INSPECTED THE VEHICLE.  THE FAILURE AND CURRENT MILEAGES WERE 26,000.",
        "vin": "4M2YU57115D"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "11/09/2007",
        "dateOfIncident": "05/01/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10208496,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTITRAC AW",
                "productModel": "P27560R17",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 MERCURY MARINER.  THE VEHICLE HAS CONTITRAC AW, SIZE P27560R17 TIRES.  THE CONTACT STATED THAT THE TIRES ON THE VEHICLE WERE EXTREMELY NOISY, THE TREAD WAS CUPPING, AND THERE WERE HAIRLINE CRACKS IN THE SIDEWALL WHERE THE RUBBER MEETS THE RIM.  THE NOISE IS LOUD AT ALL SPEEDS, BUT INTENSIFIES WHILE DRIVING 5 - 65 MPH.  THE TIRES HAVE BEEN ROTATED AND ALIGNED BY BOTH THE DEALER AND AN INDEPENDENT TIRE STORE.  THE NOISE WORSENED AFTER THE TIRES WERE ROTATED AND ALIGNED.  THE CONTACT PLANS TO PURCHASE NEW TIRES BECAUSE HIS WIFE IS AFRAID TO DRIVE THE VEHICLE.  THE CURRENT MILEAGE WAS 25,000 AND FAILURE MILEAGE WAS 4,000.",
        "vin": "4M2CU56135D"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/11/2007",
        "dateOfIncident": "04/01/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10205413,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 MERCURY MARINER.  THE PASSENGER SIDE AIR BAG COVER WAS SLIGHTLY ELEVATED AND THE AIR BAG WARNING INDICATOR LIGHT ILLUMINATED.  THE DEALER STATED THAT BOTH AIR BAGS DEPLOYED WITHOUT A CRASH OR HARD IMPACT TO THE VEHICLE.  THE DEALER REPLACED THE AIR BAGS. THE FAILURE MILEAGE WAS 40,000 AND CURRENT MILEAGE WAS 55,000. UPDATED 01/02/08.*LJ",
        "vin": "4M2YU56Z15D"
    },
    {
        "components": "POWER TRAIN,TIRES",
        "crash": false,
        "dateComplaintFiled": "05/21/2007",
        "dateOfIncident": "05/20/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10191325,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FIRESTONE TIRE & RUBBER CO.",
                "productMake": "FIRESTONE",
                "productModel": "24575R16",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "I OWN A 2005 MERCURY MARINER PREMIER THAT  WAS PURCHASED IN 2005 ,THE VEHICLE HAD  A VERY BAD ROAR INSIDE WHILE  DRIVING DOWN THE ROAD.  I WOULD LIKE TO KNOW IF THERE WAS  A WAY TO MAKE IT STOP MAKING THAT ROARING SOUND.  ACCORDING TO OTHER COMPLAINTS I HAVE READ  THE OTHER CUSTOMER S HAVE NOT HAD ANY HELP AT THERE LOCAL DEALERSHIPS, NEITHER DID I.  *AK",
        "vin": "4M2YU56155D"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/08/2007",
        "dateOfIncident": "04/27/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10190129,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 MERCURY MARINER.  WHILE DRIVING 55 MPH, ALL THE VEHICLE'S WARNING LIGHTS ILLUMINATED AND THEN THE VEHICLE JERKED AND COMPLETELY SHUT OFF.  THE VEHICLE WAS TOWED TO THE DEALER WHO STATED THAT THE VEHICLE NEEDED A TRANSMISSION TORQUE CONVERTER AND WOULD BE UNSAFE TO DRIVE UNTIL THE PARTS ARRIVED.  THE CURRENT MILEAGE IS 22,127 AND FAILURE MILEAGE WAS 18,000.",
        "vin": "4M2CU57125D"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "04/30/2007",
        "dateOfIncident": "04/30/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10189249,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "STRONG GASOLINE ODOR WHILE PARKED IN GARAGE.  SERVICING DEALER REPORTS GAS LINE IS RUSTED AND IS LEAKING.  CONDITION IS TOO DANGEROUS TO ALLOW FURTHER DRIVING WITHOUT REPAIR.  *AK",
        "vin": ""
    },
    {
        "components": "SUSPENSION,PARKING BRAKE,ENGINE AND ENGINE COOLING,VISIBILITY,AIR BAGS,TIRES",
        "crash": false,
        "dateComplaintFiled": "03/02/2007",
        "dateOfIncident": "09/19/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10184024,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTITRAC SUV",
                "productModel": "P26570R16",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "I PURCHASED A 2005 MERCURY MARINER 7/24/2006AT ANAHEIM LINCOLN MERCURY AND THEY WERE SHUT DOWN.  I HAVE GONE TO MANY FORDS & THEY WILL NOT HELP ME CAUSE THE THEY DON'T HAVE START DATE OF WARRANTY.  I ONLY HAVE 17,0000 MILES ON THIS CAR AND MY AIR BAG LIGHT GOES ON & OFF.  ALSO MY TIRES HAVE SERIOUS PROBLEM I HAD TO BUY 2 MYSELF THE FIRST 2000 MILES THE TIRE R WEARING SO BAD NOW ONCE AGAIN.  *JB",
        "vin": "4M2CU57125D"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "02/27/2007",
        "dateOfIncident": "02/27/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10183766,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTITRAC SUV",
                "productModel": "P26570R16",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "I HAVE BEEN HAVING PROBLEMS WITH MY VEHICLES AND ALL 4 OF MY TIRES SINCE JULY 06. MY VEHICLE/ STEERING WHEEL/FRONT END IS SHAKING & VIBRATING TERRIBLY. I WAS TOLD BY THREE DIFFERENT AUTHORIZED TIRE/DEALERSHIPS THAT ALL FOUR OF MY  TIRES ARE BAD, THEY ARE CUPPED & FEATHERED AND THE TREAD IS NOT GOOD. THE DEALERSHIP WHERE I BOUGHT MY VEHICLE SAYS IT IS NOT THEIR RESPONSIBILITY TO PROVIDE ME WITH NEW TIRES (MY VEHICLE IS STILL UNDER WARRANTY) THE TIRE MANUFACTURER WILL ONLY PAY FOR 1/2 THE RETAIL COST BECAUSE THEY SAY IT IS NOT THEIR PROBLEM EITHER. I AM VERY UPSET. THE VEHICLE IS UNSAFE TO DRIVE, AND I AM AFRAID I AM GOING TO GET HURT OR SOMEONE ELSE WILL., I DO NOT KNOW WHO TO TRUST AND COULD REALLY USE SOME HELP.  *NM",
        "vin": "4M2YU571X5D"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/20/2007",
        "dateOfIncident": "02/07/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10183002,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "BACK GLASS ON MERCURY MARINER SHATTERED FOR NO REASON.  *NM",
        "vin": "4M2CU57175D"
    },
    {
        "components": "SUSPENSION,POWER TRAIN,STRUCTURE,WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/05/2007",
        "dateOfIncident": "10/08/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10177923,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* -  THE CONTACT STATED THAT ON 10/08/06 WHILE D AT A SPEED OF 40 MPH  DRIVER'S FRONT TIRE WHEEL STUDS BROKE OFF.  THE VEHICLE HAD AN ODOMETER READING OF 16,002 MILES ON THE VEHICLE AT THE TIME OF THE INCIDENT.  THE CONTACT STATED THAT ON THE DAY OF THIS INCIDENT THE WEATHER WAS CLEAR AND SO WERE THE ROAD CONDITIONS.  THE CONTACT HAD THE VEHICLE TOWED TO DANA MOTORS IN STATEN ISLAND, NY, AND THE DEALERSHIP  REPLACED 4 LUG: NUTS AND 4 WHEEL STUDS.  THE CONTACT STATED THAT ON 12/10/06 THE VEHICLE WOULD NOT ACCELERATE.  THE VEHICLE WAS  TOWED TO DANA MOTORS ,AND AT THAT TIME THE VEHICLE HAD 17,642 MILES ON IT.  THE CONTACT STATED THAT THE REPAIR ORDER STATED THAT DEALERSHIP REPLACED PARTS AND GEARS.  THE DEALERSHIP  INFORMED THE CONTACT THAT THE TRANSMISSION BOX WAS OPENED AND FOUND THAT THE TRAY HAD PIECES OF METAL IN THE TRANSMISSION TRAY. AK  THE INSIDE CARGO LIGHT WAS NOT WORKING, THE WINDSHIELD WAS LEAKING, THE STEERING WHEEL WOULD VIBRATE WHEN THE CONSUMER REACHED A SPEED OF 70 MPH. UPDATED 03/07/07*JB",
        "vin": "4M2YU57155D"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "11/23/2006",
        "dateOfIncident": "09/06/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10174123,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR WINDOW AND DOOR WERE CLOSED, I PULLED INTO THE GARAGE, STOPPED, HEARD A CRACKING NOISE, STARTED TO BACK UP A FEW INCHES, THEN THE REAR WINDOW BLEW OUTWARD COVERING THE DRIVEWAY IN GLASS. *JB",
        "vin": "4M2YU56Z55D"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/16/2006",
        "dateOfIncident": "09/15/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10170928,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED WHILE COMING TO A STOP, THE VEHICLE WOULD SHUT OFF AND A VIBRATION WAS FELT WHEN TURNING THE VEHICLE BACK ON.  ALSO, A CLUNKY SOUND WAS HEARD, WHEN STARTING BACK UP.  THESE INCIDENTS HAPPENED SPORADICALLY WITHOUT ANY PRIOR WARNING.  THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC, WHO WAS UNABLE TO DUPLICATE THE PROBLEM.  THE VEHICLE WAS GOING TO BE TAKEN INTO THE DEALER FOR FURTHER EXAMINATION.",
        "vin": "4M2YU56Z75D"
    },
    {
        "components": "POWER TRAIN,TIRES",
        "crash": false,
        "dateComplaintFiled": "10/10/2006",
        "dateOfIncident": "10/10/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10170421,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "WE HAVE TAKEN OUR MARINAR BACK AT LEAST 2 TIMES COMPLAINING OF OUTRAGEOUS ROAD NOISE WHILE DRIVING. THIS IS THE WORST VEHICLE I HAVE EVER DRIVEN OR RIDDEN IN WITH THIS TYPE OF NOISE INCLUDING DIESEL TRUCKS.  THE DEALER SAYS IT IS THE TIRES BUT THEY ARE THE ORIGINAL TIRE THAT CAME WITH THE VEHICLE (CONTINENTALS). I WILL NOT DRIVE THE VEHICLE DUE TO THIS ROAD NOISE.  FRIENDS THAT HAVE BEEN IN THE VEHICLE WITH ME CAN NOT BELIEVE THE DECIBEL LEVEL OF THE ROAD NOISE AND THAT IT IS UNBEARABLE. I HAVE A FRIEND OF THE FAMILY WHO ALSO HAS A MARINAR AND HE ALSO HAS TAKEN HIS VEHICLE BACK TO THE DEALER 3 TIMES FOR THIS ROAD NOISE TO KNOW AVAIL.  CAN YOU ADVISE ME ON WHAT TO DO ABOUT THIS SITUATION.  *JB",
        "vin": "4M2CU57175D"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/16/2006",
        "dateOfIncident": "08/16/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10165634,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL MILEAGE FOR 2005 MERCURY MARINER IS NOT EVEN CLOSE TO WHAT IS STATED ON WINDOW STICKER.  I COMPLETELY UNDERSTAND THAT DRIVING HABITS AND CONDITION APPLY, BUT WHEN THE WINDOW STICKER READS 22 LOCAL 26 HWY AND YOUR ACTUAL IS 16 HWY, THERE IS SOMETHING WRONG.  THE CAR HAS BEEN TO THE DEALER ON A REGULAR BASIS AND EACH TIME I HAVE COMPLAINED.  THEY DO THERE OWN TEST AND STATE THE TRUCK IS GETTING 22 MPG.  I DO ALL HIGHWAY DRIVING ON A RELATIVELY FLAT SURFACE ALL WEEK LONG AND ONLY GET 16 MPG.  THE TAIL PIPE IS FULL OF SOOT AND THE DEALER STATES NO PROBLEM.  *NM",
        "vin": ""
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "07/01/2006",
        "dateOfIncident": "03/28/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10161184,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DEFECTIVE SEAT BACK ALLOWED FOR SPRING TO BREAK THROUGH SEAT FABRIC. THIS LEAD TO FACET JOINT DAMAGE WHICH PREVENTED ME FROM WORKING FOR A PERIOD OF TIME. I AM IN TRAVELING SALES AND THE MERCURY MARINER WAS A POPULAR VEHICLE CHOICE. THIS SAME PROBLEM HAPPENED TO MANY OTHER INDIVIDUALS IN THE SAME VEHICLE.  *NM",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/02/2006",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10152985,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 MARINER PREMIER DRIFTS TO THE INTO ONCOMING TRAFFIC AT LOW TO MEDIUM SPEEDS.  *TS  WHEN THE VEHICLE IS STOPPED THE STEERING WHEEL MOVES ABOUT 12 DEGREES FROM CENTER.  THE DEALER ADJUSTER BOTH THE FRONT AND REAR CAMBER AND CASTER OUTSIDE OF THE SPEC TO COMPENSATE FOR THE DRIFT.  THE VEHICLE WAS RETURNED TO THE CONSUMER WITH THE SAME PROBLEM.  THE DEALER STATED THAT THE RACK AND PINION NEEDED TO BE REPLACED BUT REFUSED TO PERFORM THE SERVICE.  *NM",
        "vin": "4M2CU57165D"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/30/2005",
        "dateOfIncident": "10/23/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10146551,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2005 MERCURY MARINER WAS IN A SERIOUS COLLISION WITH A DEER ON THE DRIVER'S SIDE.  OVER $5000 OF DAMAGE WAS DONE TO THE VEHICLE.  THE SIDE CURTAIN AIR BAGS DID NOT DEPLOY IN THE COLLISION.  I WAS TRAVELING AT 55 MPH AND THE DEER'S RUNNING SPEED CAUSED A VIOLENT IMPACT.  THE DEER MADE DIRECT CONTACT WITH MY HEAD, NECK, AND SHOULDER, AND THE ABSENCE OF THE PROTECTION OF THE AIRBAG ALLOWED THE GLASS TO BE DRIVEN DIRECTLY INTO MY BODY BY THE FORCE OF THE CONTACT.   I SUFFERED ONLY MINOR BRUISING AND A MULTITUDE OF GLASS SCHRAPNEL CUTS ON THE SCALP, FACE, AND ARMS, WHICH QUICKLY HEALED.  I AM NOT ABLE TO GET AN ANSWER EITHER FROM FORD LINCOLN MERCURY OR THE LOCAL DEALER AS TO WHY THE SIDE CURTAIN AIRBAG DID NOT DEPLOY.  I HAVE HAD THREE SEPARATE CONTACTS WITH FORD LINCOLN MERCURY BY E-MAIL, LETTER, AND TELEPHONE WITH NO SATISFACTION.  THIS WEEK THE VEHICLE WAS TAKEN BACK TO THE DEALERSHIP, WHERE IT WAS REPORTED TO ME THAT ALL SENSORS WERE CHECKED AND FOUND TO BE COMPLETELY FUNCTIONAL.  WHEN I OBTAINED THE DEALER'S WORK ORDER, IT CLEARLY STATES THAT THEY CHECKED THE RIGHT SIDE SENSORS (PASSENGER SIDE), WHEN THE COLLISION OCCURRED ON THE LEFT (DRIVER'S) SIDE.  I BELIEVE THAT A MANUFACTURING DEFECT CAUSED THE SIDE CURTAIN TO FAIL TO DEPLOY, AND NOW HAVE NO CONFIDENCE THAT THE EXTRA PROTECTION THAT I PURCHASED WOULD PROTECT ME IN ANY FUTURE COLLISION OF THE SAME TYPE.  I FEEL THAT I HAVE EXHAUSTED ALL OF MY OPTIONS THROUGH THE MANUFACTURER AS WELL AS THE DEALER, AND STILL HAVE NOT HAD A VALID ANSWER TO MY QUESTION ABOUT THE SAFETY OF THE VEHICLE.  *NM",
        "vin": "4M2CU57195D"
    },
    {
        "components": "STEERING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/13/2005",
        "dateOfIncident": "05/28/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10145084,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THE CONTACT STATED WHILE DRIVING ON AN INCLINE THE 4-WHEEL DRIVE ENGAGED AND DISENGAGED WHICH CAUSED THE VEHICLE TO JOLT.  THE DEALERSHIP WAS UNABLE TO DIAGNOSE THE PROBLEM, BECAUSE THEY WOULD NOT TAKE IT TO AN INCLINE WHEN TEST DRIVING.  AN ENGINEER WITH THE MANUFACTURER TOLD THE CONTACT THAT BECAUSE IT WAS ALL WHEEL DRIVE THE FOUR WHEEL DRIVE ACTIVATED WHEN THE VEHICLE DETECTED  A WHEEL SLIP.  THERE HAVE BEEN NO REPAIRS MADE TO THE VEHICLE. *AK    UPDATED 1/25/2006 - WHENEVER THE CONSUMER DROVE OVER UNEVEN PAVEMENT SHE HEARD A CLUNKING NOISE.  THE VEHICLE WAS TAKEN TO THE DEALER WHO INDICATED THAT EVERYTHING WAS VISUALLY OK AND THE THE MANUFACTURER SAID THE NOISE WAS A CHARACTERISTIC OF THE VEHICLE.  AFTER THE VEHICLE'S STEERING RACK WAS REPLACED THE CONSUMER HEARD A LOUD HUMMING/WHINING NOISE COMING FROM THE PASSENGER SIDE FRONT WHEEL.  THE VEHICLE WAS TAKEN TO THE DEALER WHO DIAGNOSED THE PROBLEM AS A FAULTY STEERING RACK.  *NM",
        "vin": "4M2CU57145D"
    },
    {
        "components": "SEATS,CHILD SEAT",
        "crash": true,
        "dateComplaintFiled": "08/30/2005",
        "dateOfIncident": "08/05/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 4,
        "odiNumber": 10134747,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  2005 MERCURY MARINER.  CONSUMER'S  VEHICLE WAS INVOLVED IN  AN ACCIDENT ON AUGUST 5, 2005.  THE VEHICLE WAS DRIVEN OFF  THE ROAD AND WENT INTO A DITCH.  THEN, THE VEHICLE WENT AIRBORNE AND LANDED IN ANOTHER DITCH.  THE CONSUMER DID NOT REMEMBER WHAT EXACTLY HAPPENED, BUT THE POLICE DEPARTMENT VERIFIED THE ACCIDENT.  UPON IMPACT, THE DRIVER'S SEAT COLLAPSED.  THE BRACKET ON THE 60/40 BACK SEAT DISLODGED, CAUSING THE CHILD SAFETY SEAT TO BECOME DISLODGED FROM THE VEHICLE  AND CONSUMER'S  DAUGHTER WAS THROWN INTO THE PASSENGER DOOR HEAD FIRST.  THE SAFETY BELT WHERE THE CHILD SAFETY SEAT WAS BECAME UNLOCKED.  THE CONSUMER'S HUSBAND , WHO WAS DRIVING,  SUSTAINED COMPRESSION FRACTURE IN HIS BACK.  THE CHILD SUSTAINED  HEAD LACERATION FROM  RIGHT EAR ACROSS  FOREHEAD TO  LEFT EAR.  THIS SPLIT HER FOREHEAD OPEN AND SKULL WAS EXPOSED.  HER SON WAS IN A HIGH BACK BOOSTER AND SUSTAINED A BROKEN COLLAR BONE. THE  OTHER DAUGHTER  SUSTAINED ABRASIONS FROM THE 5 POINT HARNESS ON THE CHILD SAFETY SEAT.   A POLICE REPORT WAS TAKEN.  THE VEHICLE WAS TOTALED.  THE CHILD WITH THE HEAD LACERATION WAS ON THE 40% SIDE, AND THE OTHER TWO CHILDREN WERE ON THE 60% SIDE OF THE BACK SEAT.*AK",
        "vin": "4M2CU57155D"
    }
]