[
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "11/10/2017",
        "dateOfIncident": "11/08/2017",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11045268,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVO",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER HAS MADE ITS WAY THROUGH THE GROMMET IN THE DRIVER SIDE WHEEL WELL, DOWN THE HARNESS, AND RESTS IN THE CONNECTORS BEHIND THE KICK PANEL UNDER THE DASH. WIRES/CONNECTORS HAVE BECOME CORRODED CAUSING SEVERAL PROBLEMS, INCLUDING:  LIGHTS WILL NOT TURN OFF, AND NEITHER WILL THE ENGINE AFTER KEYS ARE REMOVED AND EVEN AFTER THE BATTERY IS DISCONNECTED.",
        "vin": "JA3AH86D85U"
    },
    {
        "components": "SUSPENSION,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/30/2017",
        "dateOfIncident": "05/31/2016",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10948519,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVOLUTION",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 MITSUBISHI LANCER EVOLUTION. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 15V321000 (AIR BAGS) FOR THE FRONT PASSENGER SEAT AIR BAG INFLATOR AND 16V458000 (SUSPENSION) FOR THE LOWER CONTROL ARM. THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "JA3AH86D65U"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/31/2016",
        "dateOfIncident": "12/30/2016",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10938875,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVOLUTION",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "FOUND EXCESSIVE RUST CAUSING STRUCTURAL DAMAGE TO REAR UNI BODY FRAME SIDE MEMBERS. APPEARS TO HAVE RUSTED FROM THE INSIDE OUT, SIMILAR TO THEIR CURRENT FRONT SUB FRAME RUST RECALL. AT THIS TIME NO ACCIDENTS/ DAMAGE CAUSED BUT LIKELY WILL RESULT IN UNI BODY WEAKENING AND  POSSIBLE SUSPENSION/ STRUCTURAL FAILURE",
        "vin": "JA3AH86D15U"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/28/2016",
        "dateOfIncident": "06/21/2015",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10928414,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVOLUTION",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING I HAD ALL 3 ACD LIGHTS COME ON. UPON FURTHER INVESTIGATING AND A TRIP TO THE DEALERSHIP I WAS TOLD MY ACD PUMP WAS BAD AND I WOULD NEED A NEW ONE. THIS IS A COMMON PROBLEM IN THESE CARS THAT STILL HASN'T BEEN FIXED WITH THE NEWER MODELS. I WAS QUOTED 2400 DOLLARS JUST FOR THE PUMP, NOT INCLUDING LABOR, AND THAT DOESN'T GUARANTEE THAT IT WON'T HAPPEN AGAIN.  *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/25/2016",
        "dateOfIncident": "11/01/2016",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10927874,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVOLUTION",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 MITSUBISHI LANCER EVOLUTION. WHILE DRIVING VARIOUS SPEEDS, THE VEHICLE BECAME VERY UNSTABLE AND PULLED TO THE LEFT. THE VEHICLE ALSO EXPERIENCED SEVERE OVERSTEERING WHEN TURNING. IT WAS DISCOVERED THAT THE FRONT LOWER CONTROL ARM WAS FAULTY DUE TO CORROSION AND RUSTING OF THE SUBFRAME. THE DEALER REPAIRED THE VEHICLE PER NHTSA CAMPAIGN NUMBER: 16V458000 (SUSPENSION) IN WHICH AN ANTI-CORROSION AGENT WAS APPLIED, BUT THE FAILURES CONTINUED. THE MANUFACTURER WAS NOTIFIED. THE FAILURE MILEAGE WAS 187,000.",
        "vin": "JA3AH86D75U"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/22/2016",
        "dateOfIncident": "10/15/2016",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10927500,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVOLUTION",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "LOWER CONTROL ARM LOOSE / DISCONNECTED FROM SUBFRAME, CAUSING STABILITY AND CONTROL PROBLEMS WITH THE VEHICLE RESULTING IN UNSAFE OPERATION AT ANY SPEED AND AT ANY TIME WHICH THE VEHICLE IA BEING OPERATED.THE SOCKET ON THE SUBFRAME HAS DEEP RUST AND AN IRREGULAR HOLE VISIBLE. BOB PENKHUS MITSUBISHI REFUSES TO PERFORM THE RECALL WHICH ADDRESSES THIS ISSUE OF CORROSION OF THE SUBFRAME, SPECIFICALLY WHERE THE LOWER CONTROL ARM ATTACHES TO THE VEHICLE.",
        "vin": "JA3AH86D75U"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/10/2012",
        "dateOfIncident": "03/15/2011",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10457996,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVOLUTION",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SRS AIRBAG LIGHT CAME ON, THE WIPERS WON'T STOP RUNNING. THE HORN STARTS ON ITSELF.   ALL IS RELATED TO WATER ENTERING IN THE INNER FENDER, SHORTING ELECTRICAL CONNECTIONS.   THIS HAPPENS WHEN IT'S RAINY OUTSIDE. THIS HAPPENS TO EVERY EVOLUTION OWNER THAT I KNOW.  I DON'T KNOW IF THERE IS A RISK WITH AIR BAGS NOT WORKING CAUSED BY THAT, BUT THAT HIGHLY CONCERNS  ME. IF THERE IS AN ACCIDENT, I WOULD WANT TO BE SURE THAT THE AIRBAGS WILL DEPLOY...  THANKS FOR YOUR ASSISTANCE.  *TR",
        "vin": "JA3AH86D05U"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "09/14/2011",
        "dateOfIncident": "07/13/2011",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10425350,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVO",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TRAVELING ON FREEWAY IN NUMBER 3 LANE, FRONT DRIVE TRAIN LOCKED UP.  CAR SKIDDED FOR APPROX 60 FEET AND THAN VEERED TO THE LEFT AND WAS STRUCK IN THE NUMBER 1 LANE.   *KB",
        "vin": "JA3AH86D95U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/19/2008",
        "dateOfIncident": "05/02/2007",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10231547,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVOLUTION",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR WAS PURCHASED ON 11/23/05. ONE WEEK AFTER PURCHASE, SERVICE MANAGER INFORMED ME THAT MY OIL WAS REALLY LOW AND ADDED A QUART OF OIL. HE ADVISED ME TO CHECK THE OIL LEVEL REGULARLY. I NOTICED THAT I HAD TO ADD A QUART OF OIL EVERY 1,000 MILES OR SO. I VOICED MY CONCERN TO THE SERVICE MANAGER WHEN I HAD MY FIRST OIL CHANGE AND WAS TOLD THAT \"A QUART OF OIL LOSS PER 1,000 MILES IS NORMAL\". I CHECKED MY OIL REGULARLY TO AVOID ANY PROBLEMS UNTIL ONE DAY, I FOUND OUT ABOUT OIL CONSUMPTION TESTS. I TOLD THE SERVICE MANAGER ABOUT IT AND HE ARRANGED TO HAVE IT DONE ON MY NEXT OIL CHANGE. THE FIRST OIL CONSUMPTION TEST REVEALED ABNORMAL RESULTS WHICH PROMPTED THEM TO REPAIR THE PROBLEM. ANOTHER OIL CONSUMPTION TEST WAS DONE AND IT SHOWED A MORE FAVORABLE RESULT. I CHECK THE OIL LEVEL REGULARLY AND STILL NOTICE THAT I ADD A QUART OF OIL EVERY 1,000 MILES. I SPOKE TO THE SERVICE MANAGER ABOUT IT AND WAS TOLD THAT IT WAS NORMAL. I WENT TO ANOTHER DEALER TO HAVE THE OIL CONSUMPTION CHECKED. THE FIRST OIL CONSUMPTION TEST REVEALED A QUART OF OIL LOSS PER 1000 MILES AND THE SECOND TEST REVEALED AN ABNORMAL RESULT OF A QUART AND A QUARTER OIL LOSS PER 1000 MILES. I WAS THEN TOLD BY THE SERVICE REPRESENTATIVE TO CONTACT MITSUBISHI CORPORATE OFFICE TO REPORT THE RESULT. NOW I'M ASKING FOR YOUR ASSISTANCE IN SOLVING THIS PROBLEM. THANK YOU.  *TR",
        "vin": "JA3AH86D25U"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/12/2007",
        "dateOfIncident": "01/11/2007",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10178574,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVOLUTION",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TURNED WARPED BRAKE ROTOR. PROBLEM CAME BACK, UNSAFE TO DRIVE DUE TO POOR HANDLING WHEN BRAKING. *JB",
        "vin": "JA3AH86D25U"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/02/2006",
        "dateOfIncident": "01/05/2006",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10149328,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVOLUTION",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT BEARINGS ARE LOOSE CAUSING ERRATIC STEERING, PREMATURE TIRE WEAR AND PREMATURE BRAKE WEAR. *JB",
        "vin": "JA3AH86D05U"
    },
    {
        "components": "TIRES,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/01/2006",
        "dateOfIncident": "02/01/2006",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10149785,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVOLUTION",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER COMPLAINT REGARDING THE NEED FOR MUD FLAPS ON 2005 MITSUBISHI EVOLUTION VIII LANCER.  *TS  THE CONSUMER STATED WITHOUT THE MUD FLAPS, THE TIRES STICK OUT 1.5 INCHES PAST WHEEL WELLS.  THE CONSUMER STATED WHEN A  RIGHT TURN WAS MADE, OR A SPEED BUMP WAS HIT, A STRANGE NOISE WOULD EMIT FROM THE VEHICLE AND THEN A POP SOUND COULD BE HEARD.  THE DEALER TOLD THE CONSUMER GRAVEL WAS STUCK INTO HE CALIPERS, SHOCK TOWERS, BRAKES AND SPRINGS AND IT WOULD WORK ITSELF OUT.  THE DEALER RECOMMENDED THE CONSUMER TAKE THE VEHICLE TO A CAR WASH, BUT THE PROBLEM CONTINUED AFTER THE VEHICLE WAS WASHED.  THE TIRES WERE REPLACED BECAUSE THEY WERE SO BADLY WORN.  *JB",
        "vin": "JA3AH86D05U"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "01/23/2006",
        "dateOfIncident": "12/27/2005",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10148355,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVOLUTION",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "PRIOR TO THE AUTOMOBILE ACCIDENT ON DECEMBER 27, 2005 THERE WAS NO PROBLEMS WITH THE VEHICLE. WAS PURCHASED IN JULY OF 2005 (DEMO CAR-USED). THE ACCIDENT HAPPEN AS FOLLOWS, IT WAS COLD THAT NIGHT I WAS MAKING A RIGHT TURN GOING WEST INTO THE MIDDLE LANE. UNFORTUNATELY MY CAR DID NOT GO STRAIGHT BUT CONTINUE TO TURN. I CROSSED OVER FAR RIGHT LANE, THEN THE SIDE WALK INTO AN UTILITY POLL. COULD NOT CONTROL THE STEERING WHEEL OF THE CAR. THE WHEEL LOCKED, COULD NOT TURN THE CAR AT ALL. THE CAR CRASHED INTO AN UTILITY POLL IMPLODING BOTH AIR BAGS. MY INSURANCE COMPANY'S ADJUSTER DEEMED IT A TOTAL LOSS NON-REPAIR. NOT SURE IF THERE WERE ANY PROBLEMS WITH THIS MODEL OF CAR AT ALL, JUST WANTED TO REPORT THIS INCIDENT WITH THE DEALERSHIP TO INFORMED THEM OF WHAT HAPPEN, SO THAT IT WOULD BE ON THEIR RECORDS, JUST IN CASE ANOTHER INCIDENT HAPPEN WITH THIS MODELED CAR TO SOMEONE ELSE THAT WAS ALL, BUT THEY DID NOT ASSIST ME. I WANTED TO SEE IF THERE COULD BE A INVESTIGATION TO LOOK AT THE CAR TO SEE WHAT COULD HAVE CAUSED THE WHEEL TO LOCK AND FOR ME TO NOT HAVE CONTROL OF THE CAR. JUST WANTED THIS ON FILE TO LET YOU KNOW.*AK",
        "vin": "JA3AJ26E25U"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "01/23/2006",
        "dateOfIncident": "12/27/2005",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10148361,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVOLUTION",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "PRIOR TO THE AUTOMOBILE  ACCIDENT ON DECEMBER 27,2005 THERE WAS NO PROBLEMS WITH THE VEHICLE TO MY KNOWLEDGE. IT WAS PURCHASED IN JULY 2005 , DEMO-USED CAR. THE ACCIDENT  HAPPENED AS FOLLOWS: IT WAS VERY COLD THAT EVENING, I WAS MAKING A RIGHT TURN GOING WEST INTO THE MIDDLE LANE,  UNFORTUNATELY MY CAR DID NOT GO STRAIGHT, BUT CONTINUE TO TURN. I CROSSED OVER TO THE FAR RIGHT LANE, THEN THE SIDE WALK INTO AN UTILITY POLL. COULD NOT CONTROL THE WHEEL OF THE CAR, THE WHEEL LOCKED, COULD NOT TURN  THE CAR. THE CAR CRASHED INTO AN UTILITY POLL,  IMPLODING BOTH AIR BAGS. MY INSURANCE COMPANY'S ADJUSTER DEEMED IT A TOTAL LOSS, NON-REPAIRABLE. NOT SURE IF THERE WERE ANY PROBLEMS WITH THIS MODEL AT ALL, JUST WANTED TO REPORT THIS INCIDENT WITH THE DEALERSHIP TO INFORMED THEM OF WHAT HAPPEN THAT IT WOULD BE ON THEIR RECORDS, JUST IN CASE ANOTHER INCIDENT HAPPEN WITH THIS MODELED CAR TO SOMEONE ELSE, THAT WAS ALL, BUT THE DEALERSHIP WOULD NOT ASSIST ME. I WANTED TO SEE IF THERE COULD BE AN INVESTIGATION DONE TO LOOK AT THE CAR TO SEE WHAT COULD HAVE CAUSED THE WHEEL TO LOCK AND FOR ME NOT TO HAVE CONTROL OF THE CAR. I DO NOT KNOW IF THERE WAS ANYTHING ON THE ROAD THAT EFFECTED THE TIRES, NOT SURE AT ALL BECAUSE EVERYTHING HAPPEN VERY QUICKLY THAT NIGHT. IF YOU NEED ANY DOCUMENTATION ON THE INCIDENT, PLEASE CONTACT ME AT [XXX]. I KNOW THIS IS A VERY SMALL CASE, BUT I JUST WANTED THIS ON FILE TO LET YOU KNOW. THANK YOU.*AK    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "JA3AJ26E25U"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/28/2005",
        "dateOfIncident": "11/09/2005",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10146262,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVOLUTION",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A BRAND NEW 2005 MITSUBISHI LANCER EVOLUTION, AND TWO MONTHS LATER @ 1847 MILES, THE CLUTCH WENT OUT. MITSUBISHI REFUSED TO WARRANTY REPAIR THE FAILURE, SO I STARTED INVESTIGATING THEIR CLUTCHES. IT TURNS OUT SIX LOCAL REPAIR SHOPS AS WELL AS 4 MITSUBISHI TECHNICIANS ADVISED ME THE CLUTCHES ARE WEAK/DEFECTIVE FROM THE FACTORY, AND MITSUBISHI IS AWARE OF THE PROBLEM ON MY MODEL, BUT REFUSES TO RECALL THEM OR REPAIR THEM. I ALSO WENT ON-LINE AND FOUND SEVERAL WEB-SITE COMPLAINTS ABOUT EVOLUTION CLUTCHES, INCLUDING \"WWW.MITSUBISHISUCKS.COM\" I CONTACTED MITSUBISHI'S CONSUMER COMPLAINT DEPT, WHO GENERATED FILE#[XXX] AND I WAS NEVER CONTACTED AGAIN. THEY REFUSE TO ACKNOWLEDGE THEIR PRODUCT FAILURE! MY VIN# [XXX]. I ENDED UP HAVING TO PAY $606.80 TO DAYTONA MITSUBISHI OR THEY WOULD NOT GIVE ME MY CAR BACK! THEY HEAD SERVICE MANAGER RON, TOLD ME \"ITS A LITTLE CAR, WITH TOO MUCH POWER, SO MITSUBISHI HAD TO DESIGN IT IN A WAY WHERE SOMETHING WOULD HAVE TO BREAK, AND UNFORTUNATELY ITS THE CLUTCH\". WITH HUNDREDS OF EXISTING COMPLAINTS, I WOULD RESPECTFULLY REQUEST MITSUBISHI HAVE TO RECALL ALL LANCER EVOLUTION CLUTCHES, AND REPLACE THEM WITH A UNIT THAT WILL NOT FAIL. *JB UPDATED 07/17/2012 *JS    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6)",
        "vin": "JA3AH86D15U"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/23/2005",
        "dateOfIncident": "09/22/2005",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10137410,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "LANCER EVOLUTION",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2005 MITSUBISHI EVOLUTION LANCER THAT HAS 9,661 MILES ON IT AND THE CLUTCH IS ALREADY NEEDING TO BE REPLACED. MITSUBISHI ACKNOWLEDGES THAT THERE HAVE BEEN NUMEROUS COMPLAINTS REGARDING THIS PROBLEM THAT DATES BACK TO THE 2003 LANCER, BUT YET THEY STILL REFUSE TO CONFRONT THE ISSUE AND TAKE CARE OF IT.  *NM",
        "vin": "JA3AH86D45U"
    }
]