[
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/27/2021",
        "dateOfIncident": "07/18/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426687,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2005 Nissan Sentra. The contact stated while driving 30-35 mph, the vehicle revved up and accelerated without warning. The contact downshifted to slow the vehicle. The local dealer was contacted. The vehicle was not diagnosed nor repaired. The manufacturer was notified of the failure. The failure mileage was 123,000.",
        "vin": "3N1CB51D25L"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/16/2021",
        "dateOfIncident": "07/16/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11425136,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I had an appointment for 10am I called ahead to confirm the estimated amount of time I was told it would take 2-4 hours. When I arrived they refused to service my vehicle they claimed they we're busy and refused to service my recall and treated me like a nuisance and with little respect. I spoke to the Nissan representative of San Leandro on Marina Blvd.",
        "vin": "3N1CB51DX5L"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/30/2021",
        "dateOfIncident": "01/20/2021",
        "fire": true,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11414660,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING THIS CAR BUT HAD STOPPED TO LET TRAFFIC BY (IN A TURN LANE) WHEN AN ONCOMING TRUCK BARRELLED TOWARD ME & HIT ME HEAD-ON, GOING ABOUT 40 MPH. HIS TRUCK BENT IN THE WHOLE FRONT OF MY SENTRA BUT MY NEITHER MY DRIVER-SIDE OR PASSENGER-SIDE AIRBAG WENT OFF TO PROTECT ME & MY DAUGHTER! THERE IS A RECALL ON THE AIRBAGS, CITING THEY COULD ERUPT & ARE DANGEROUS, SO I DON'T KNOW IF IT'S GOOD OR BAD THAT THEY DIDN'T DEPLOY?? WE WERE STOPPED & STILL IN A TURN LANE ON A CITY STREET. MY CAR WAS TOTALLED & WRECKER GOT IT. FEW WEEKS LATER IT WAS SENT TO SALVAGE/AUCTION COMPANY. I AM DISABLED &CAN'T UPLOAD PICTURES ETC BUT CAN SEND YOU EMAIL W  OF MY INSURANCE ADJUSTER & POLICE REPORT IF YOU TELL WHERE TO SEND IT. BUT I DON'T KNOW HOW TO UPLOAD THINGS, ETC. I JUST THINK THE BAGS SHOULD HAVE DEPLOYED BUT DIDN'T. HOWEVER I HADN'T BEEN ABLE TO TAKE CAR IN FOR AIRBAG RECALL YET, AS TOLD TO DO BEFORE THIS ACCIDENT.",
        "vin": "3N1CB51D75L"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/08/2021",
        "dateOfIncident": "02/09/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407138,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DO NOT PASS SMOG. UNKNOWN REASON.",
        "vin": "3N1CB51DX5L"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/22/2021",
        "dateOfIncident": "02/21/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397360,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 NISSAN SENTRA. THE CONTACT STATED WHILE DRIVING 10 MPH, THE VEHICLE LOSS MOTIVE POWER WITHOUT WARNING. THE VEHICLE WAS TOWED TO THE LOCAL DEALER NISSAN OF VACAVILLE (671 ORANGE DR, VACAVILLE, CA 95687, (707) 474-4846) WHERE IT WAS DIAGNOSED WITH NEEDING THE CRANKSHAFT SENSOR TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. UPON INVESTIGATION, THE CONTACT ASSOCIATED THE FAILURE WITH NHTSA CAMPAIGN NUMBER: 07V527000 (ENGINE AND ENGINE COOLING) HOWEVER, THE VIN WAS NOT INCLUDED. THE MANUFACTURER WAS INFORMED OF THE FAILURE AND CONFIRMED THAT THE VIN WAS NOT INCLUDING IN THE RECALL. THE FAILURE MILEAGE WAS APPROXIMATELY 126,000.",
        "vin": "3N1AB51D75L"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/17/2020",
        "dateOfIncident": "02/25/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318504,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL THE CONTACT OWNS A 2005 NISSAN SENTRA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V008000 (AIR BAGS) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT STATED DUBLIN NISSAN LOCATED AT  2046 VETERANS BLVD, DUBLIN, GA 31021 EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "3N1CB51D55L"
    },
    {
        "components": "AIR BAGS,SEAT BELTS,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "09/23/2019",
        "dateOfIncident": "09/23/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11257476,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 NISSAN SENTRA. WHILE DRIVING 65 MPH, THE CONTACT DEPRESSED THE BRAKE PEDAL, WHICH FAILED TO ENGAGE AND CAUSED THE CONTACT TO REAR END ANOTHER VEHICLE CAUSING THAT VEHICLE TO REAR END ANOTHER VEHICLE. THE CONTACT STATED THAT NO WARNING LIGHTS WERE ILLUMINATED. THE CONTACT STATED THAT THE FRONT DRIVER'S SIDE AND PASSENGER SIDE AIR BAGS FAILED TO DEPLOY AS WELL AS THE SEAT BELTS FAILED TO RESTRAIN THE OCCUPANTS. THE CONTACT STATED THAT BOTH SHE AND THE PASSENGER HEADS COME IN CONTACT WITH THE WINDSHIELD. THE CONTACT SUSTAINED CUTS TO THE HEAD AND BACK PAINS.  THE FRONT SEAT PASSENGER SUSTAINED A CUT TO THE RIGHT SIDE OF HIS HEAD, NECK AND BACK PAINS. MEDICAL ATTENTION WAS NOT SOUGHT. THE CONTACT WAS UNAWARE OF INJURIES SUSTAINED IN THE OTHER VEHICLES. A POLICE REPORT WAS NOT FILED. THE VEHICLE WAS TOWED TO THE CONTACT'S RESIDENCE WHERE IT WAS AWAITING INSPECTION BY THE INSURANCE COMPANY. THE CONTACTED STATED THAT THE VEHICLE WAS SERVICED UNDER NHTSA CAMPAIGN NUMBER: 15V287000 (AIR BAGS) AT FONTANA NISSAN (16444 S HIGHLAND AVE, FONTANA, CA 92336 (909) 574-2288) SEVERAL MONTHS PRIOR TO THE COLLISION. THE DEALER WAS NOT CONTACTED FOR DIAGNOSTIC TESTING OR REPAIRS AFTER THE COLLISON.  THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 122,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/16/2019",
        "dateOfIncident": "09/13/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11255696,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I BROUGHT MY CAR INTO THE DEALERSHIP FOR SERVICE AND THEY SAID IT HAS A BLOWN HEAD GASKET.THEY ALSO SAID THAT IT WOULD COST $2500 AND THIS CAR ONLY HAS 64000 MILES ON IT.THE DEALER SAID THAT THIS IS A KNOWN ISSUE WITH THE 2005 NISSAN SENTRA 1.8 ENGINE.",
        "vin": "3N1CB51DX5L"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/29/2019",
        "dateOfIncident": "07/20/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11240250,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 NISSAN SENTRA. WHILE DRIVING APPROXIMATELY 65 MPH, THE VEHICLE STALLED WITHOUT WARNING. THE CONTACT WAS ABLE TO RESTART THE VEHICLE AFTER SEVERAL ATTEMPTS. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. BANISTER NISSAN OF CHESAPEAKE (LOCATED AT 930 N BATTLEFIELD BLVD, CHESAPEAKE, VA 23320, (757) 214-6342) WAS CONTACTED AND A DIAGNOSTIC APPOINTMENT WAS SCHEDULED AND STILL PENDING. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 166,000. PIIR = Y.",
        "vin": "3N1CB51D75L"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/17/2019",
        "dateOfIncident": "12/30/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11170487,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MY FUEL LINE IS NOT STANDING UP TO WORK AND IS LEADKING, SAME AS THE KIA. EXPENSIVE REPAIR TO TAKE CAREOF THIS",
        "vin": "3N1CB51D45L"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/13/2018",
        "dateOfIncident": "01/07/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11151260,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY 2005 NISSAN SENTRA FROM A PRIVATE SELLER IN 2007 WITH THE TOTAL MILEAGE OF 9,100. AFTER SIX MONTHS OF DRIVING THE SERVICE LIGHT CAME ON AND I TOOK IT TO MY MECHANIC WHOM I HAVE USED FOR ALL MY AUTOMOBILES. I WAS TOLD THE SEAL ON THE VAPOR HOSE WAS LOOSE AND HE COULD TIGHTEN IT, BUT IT WOULD ONLY BE A TEMPORARY FIX. THE COST TO REPAIR THE SEAL WAS OUT OF MY PRICE RANGE. SINCE 2007 THE SERVICE LIGHT ON MY DASH WOULD LIGHT UP INTERMITTENTLY WHETHER THE VEHICLE WAS IN MOTION OR STATIONARY. I WOULD HAVE TO WAIT FOR THE LIGHT TO SWITCH OFF BEFORE I COULD GO FOR AN INSPECTION STICKER. A COUPLE OF TIMES THE INSPECTORS AT THE STATION TOLD ME OF THE VAPOR LEAK AND WERE NICE ENOUGH TO TIGHTEN THE SEAL TO THE VAPOR HOSE SO THE CAR COULD PASS INSPECTION. TO DATE THE SEAL ON THE VAPOR HOSE HAS NOT BEEN REPAIRED AND I AM CONCERNED ABOUT A FIRE HAZARD.    IT IS UNDERSTOOD THAT THE VIN ON THIS SPECIFIC 2005 NISSAN SENTRA DOES NOT FALL UNDER THE NHTSA CAMPAIGN #05V269000 FOR THE FUEL TANK VAPOR HOSE. WHAT I DO NOT UNDERSTAND IS WHY THIS VEHICLE IS HAVING THIS SPECIFIC PROBLEM. AND IT IS A PROBLEM. STARTED 01/07/2010",
        "vin": "3N1CB51D75L"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/22/2018",
        "dateOfIncident": "06/21/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11103446,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS SITTING A STOP LIGHT IN TRAFFIC AND MY CAR CUT OFF AND WOULD NOT CUT BACK ON. I WAS OBSTRUCTING TRAFFIC AND COULD NOT MOVE. HAD TO HAVE A STRANGER HELP ME PUSH THE CAR OFF THE ROAD IN BUSY HIGHWAY LUNCHTIME TRAFFIC TO A NEARBY PARKING LOT. THEN HAD CAR TOWED TO MECHANIC. DIAGNOSED AS A FAULTY CRANKSHAFT POSITION SENSOR THAT OVERHEATED AND CAUSED VEHICLE TO SHUT DOWN. THIS SHOULD BE PART OF WARRANTY 07V527000. BUT MY VIN IS NOT LISTED, EVEN THOUGH IT FITS THE DESCRIPTION OF THE KNOWN ISSUE EXACTLY SO I WAS TOLD BY NISSAN THERE IS NOTHING THEY WILL DO.",
        "vin": "3N1CB51D85L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/04/2018",
        "dateOfIncident": "06/01/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11099562,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 NISSAN SENTRA. WHILE DRIVING 75 MPH, THE VEHICLE STALLED. THE SERVICE ENGINE AND OIL WARNING INDICATORS ILLUMINATED AFTER THE FAILURE OCCURRED. THE CONTACT PULLED THE VEHICLE OFF THE ROAD, RESTARTED THE ENGINE, AND DROVE HOME AT A VERY LOW SPEED. THE CONTACT DIAGNOSED THE VEHICLE HIMSELF AND LOCATED A 'P03355' FAILURE CODE REGARDING THE CRANK SHAFT SENSOR. THE VEHICLE WAS TAKEN TO FIRST TEAM NISSAN (6520 PETERS CREEK ROAD, ROANOKE, VA 24019, (540)-362-4800) AND A FAILURE CODE WAS LOCATED AT THE CRANK SHAFT SENSOR. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE MANUFACTURER STATED THAT THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 07V527000 (ENGINE AND ENGINE COOLING). THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 131,000.",
        "vin": "3N1CB51DX5L"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/29/2017",
        "dateOfIncident": "01/09/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11051315,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 NISSAN SENTRA. THE CONTACT STATED THAT THE AIR BAG WARNING INDICATOR FLASHED FOR AN EXTENDED PERIOD OF TIME. THE VEHICLE HAD NOT BEEN DIAGNOSED BY A DEALER. THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 15V287000 (AIR BAGS) AND NHTSA ACTION NUMBER: EA15001 (AIR BAGS). THE MANUFACTURER WAS NOTIFIED OF THE FAILURE TO DETERMINE A SOLUTION TO REPAIR THE VEHICLE. THE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": "3N1CB51D95L"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/12/2017",
        "dateOfIncident": "07/11/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11045471,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER FUELING CAR (I.E. PUMP AUTO SHUTS OFF) AND FUEL PUMP IS REMOVED, A GURGLING SOUND CAN BE HEARD FROM WITHIN THE CAR'S FUEL FILLER AND THEN GASOLINE IS PUSHED OUT AND OVERFLOWS, SPILLING OUT DANGEROUSLY ONTO THE GROUND. CAR IS STATIONARY, TURNED OFF, AT GAS STATION WITH KEYS REMOVED. HAPPENS ONCE OR TWICE A YEAR.",
        "vin": "3N1CB51D25L"
    },
    {
        "components": "AIR BAGS,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "11/06/2017",
        "dateOfIncident": "08/05/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11043779,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I FILED A POLICE REPORT AND HAVE MEDICAL BILLS FROM ACCIDENT WITH INSURANCE COMPANY FARM BUREAU - BRAKES DID NOT WORK",
        "vin": ""
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/01/2017",
        "dateOfIncident": "02/27/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10957947,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DAUGHTER WAS DRIVING DOWN THE FREEWAY AND SLOWED DOWN GOING SO ME RAL ROAD TRACKS AND THE. CAR STALLED, IT  SCARED HER A LOT BEING SHE WAS ON THE FREEWAY, SHE WAS ABEL TO PULL OVER HALF SCARED TO DEATH BECAUSE THE STEERING WHEEL GOT STIFF NOT KNOWING THE CAR HAD STALLED AND AS YOU KNOW WHEN A CAR STALLES AND YOUR IGNITION IS ON ON ALL YOUR WARNING LIGHTS CYCLE IN THE MIDDLE OF A BUSY FREEWAY, SHE WAS VERY FORTUNATE SHE DID NOT HAVE A ACCIDENT, THIS HAPPENED ALL OF A SUDDEN, HAD NEVER DONE IT BEFORE, MY SON TOOK IT TO GET IT CHECKED AT A PARTS STORE AND SAID IT HAD A BAD BATTERY SO HE REPLACED IT. SHE'S A COLLEGE STUDENT, AFTER NIGHT CLASS WAS GOING BACK TO HER APARTMENT, GETTING OFF THE FREEWAY ON TO THE RAMP CAME TO A LIGHT AND TURNED GREEN SO SHE DID NOT HAVE TO STOP AS SHE WAS TURNING CAR STALLED AGAIN IN THE MIDDLE OF THE INTERSECTION, SHE PANICKED BECAUSE SHE THOUGHT A CAR OR TRUCK WOULD REAR END HER IN THE MIDDLE OF THE INTERSECTION. CAR STALLED AND DID NOT WANT TO START FOR A FEW MINUTES UNTIL IT FINALLY SRATED AND WAS ABLE TO GET HOME. DID OT WANT TO TAKE ANY CHANCES TOOK IT TO THE DEALER NEXT DAY AND DIAGNOSTIC WAS THE CRANKSHAFT SENSOR WAS BAD, SEEMS TO BE WORKING FINE, I HOPE SHE DOES NOT HAVE TO GO THROUGH THAT EXPERIENCE EVER AGAIN. WHAT REALLY BOTHERS ME IS THAT SHE COULD OF HAD A VERY SERIOUS ACCIDENT AND NOW I GO ONLINE AND FIND OUT THAT THERE IS HUNDREDS OF PEOPLE GOING THROUGH THE SAME EXPERIENCE AND NISSAN DOES NOT COVER THIS DEFECT THAT THEY SAY ONLY CERTAIN MODELS OR ENGINE SIZE WERE IN THERE RECALL COST OVER $300.00 DOLLARS TO GET IT FIXED, PLUS MY CAR ALSO HAS A OTHER DEFECT WITCH SOME TIMES HAS A HARD TIME STARTING BECAUSE FUEL PUMP LOOSES  PRESSURE, THEY SAY THERE IS A REPAIR KIT YOU CAN BUY TO FIX THE PROBLEM, BUT IT IS A DEFECT AND SHOULD BE RECALLED, IT COST ABOUT THORPE SAME AMOUNT AS IF YOU WERE TO REPLACE THE WHOLE FUEL PUMP.",
        "vin": "3N1CB51DX5L"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/12/2016",
        "dateOfIncident": "05/14/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10934764,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 NISSAN SENTRA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V287000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "3N1CB51D15L"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/02/2016",
        "dateOfIncident": "05/01/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10892454,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MY NISSAN 2005 SENTRA COMPLETELY DIED AT 75000 MILES. THE CAR GAVE NO WARNING JUST COMPLETELY DID NOT START ONE MORNING. TOOK IT THE REPAIR SHOP AND THE TECHNICIAN ADVISED ME THAT ONE OF THE ENGINE CYLINDERS WASN'T FIRING AND IT WOULD COST 1600 TO REPAIR. MY COMPLAINT IS HOW CAN A VEHICLE THAT HAS BEEN SERVICED AT IT'S PROPER SERVICING INTERVALS AND UNDER 100 K MILES POSSIBLY HAVE ENGINE ISSUES. MY VEHICLE NOW OUTSIDE OF THE WARRANTY SITS IN MY DRIVEWAY COLLECTING DUST. I HAVE DONE RESEARCH ONLINE AND HAVE COME TO THE UNDERSTANDING THAT MANY NISSAN SENTRA 05 OWNERS HAVE ALSO EXPERIENCED THE SAME PROBLEM WHICH CLEARLY INDICATES FAULT FROM THE MANUFACTURER ( NISSAN). THIS WAS MY VERY FIRST BRAND NEW VEHICLE THAT I PURCHASED FROM NISSAN. I ALSO CURRENTLY PURCHASED A NISSAN MAXIMAL 09 WHICH I TOOK A LEAP OF FAITH THINKING I WAS GETTING A BETTER QUALITY VEHICLE IN COMPARISON TO THE SENTRA AND NOW THIS VEHICLE HAS STARTED ALSO STARTED TO GIVE ME PROBLEMS ( STEERING LOCK MODULE) ANOTHER DEFECTIVE PART FROM THE MANUFACTURER. IN WHICH I HAD TO COME OUT OF POCKET $ 1000 TO FIX. THIS EXPERIENCE WITH NISSAN HAS LED ME TO HAVE A BAD TASTE IN MY MOUTH IN THE OVERALL QUALITY AND CUSTOMER SATISFACTION OF NISSAN PRODUCTS. I WILL NOT BE A REPEAT CUSTOMER AND ADVISED ALL CAR BUYERS TO DO THEIR RESEARCH BEFORE MAKING A PURCHASE",
        "vin": "3N1CB51A55L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/26/2016",
        "dateOfIncident": "07/25/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10888795,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 NISSAN SENTRA. WHILE DRIVING ON THE INTERSTATE AT APPROXIMATELY 40 MPH, THE VEHICLE LOST POWER AND ALL OF THE SENSOR LIGHTS ILLUMINATED. THE VEHICLE WAS PULLED ONTO THE LEFT SHOULDER. THE VEHICLE RESTARTED AND WAS DRIVEN APPROXIMATELY ONE MILE; HOWEVER, THE FAILURE RECURRED. THE VEHICLE WAS TOWED TO A MECHANIC WHO DIAGNOSED THAT THE CRANK SHAFT SENSOR HAD TO BE REPLACED DUE TO OVERHEATING. THE VIN WAS EXCLUDED FROM NHTSA CAMPAIGN NUMBER: 07V527000 (ENGINE, ENGINE COOLING). THE FAILURE MILEAGE WAS 166,000...UPDATED 11/17/16 *BF  STATUS REQUEST. UPDATED 11/22/16.*JB  ...UPDATED 08/02/17 *BF    *CN",
        "vin": "3N1CB51D75L"
    },
    {
        "components": "STEERING,AIR BAGS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/21/2016",
        "dateOfIncident": "07/20/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10887517,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "AR BAGS MADE BY TAKATA. NEVER FIXED ON RECALL. REPRESENT DAMGE TO DRIVER TO KILL THEM. HUMIDITY CAN CAUSE DANGER TO DRIFE TO KILL THEM. NEVER RECALLED BY NISSAN NJ IS THE MOST HUMID STATE.",
        "vin": "3N1CB51D45L"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/21/2016",
        "dateOfIncident": "06/21/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10887519,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "VAPOR CANISTER - FUEL IS SPILLING ALL OVER THE GROUND WHEN FILLING UP BECAUSE THE VAPOR CANISTER DOES NOT WORK PROPERLY. THE COMPANY REFUSES TO TAKE ANY CARE OF IT DESPITE THE FACT IT IS A RECALL 05V269000.",
        "vin": "3N1CB51D45L"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/21/2016",
        "dateOfIncident": "06/25/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10887521,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "ENDLESS REPAIRS CONTUING OVER HEADLIGHTS, WHICH KEEP BLOWING OUT OVER AND OVER AND OVER AGAIN AND WHERE ELECTRICAL CONNECTIONS ALL BY THEMSELVES STOP CONNECTING SWO THAT THERE IS INTERMITTENT HEADLIGHTS. THIS HAPPENS OVER AND OVER AND OVER. HEADLIGHT BULB HARDLY WORK FOR LONG. THIS HAPPENS OVER AND OVER AND OVER AGAIN - NOT JUST ONE ONE DAY.",
        "vin": "3N1CB51D45L"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/05/2016",
        "dateOfIncident": "06/03/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10872554,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE LIGHT HAS BEEN ON FOR AT LEAST 2YRS OR LONGER. THE VEHICLE IS RUNNING HOT. I'VE REPLACED THE THERMOSTAT, WATER PUMP, RADIATOR, THROTTLE BODY, ETC. I'VE SPENT HUNDREDS OF DOLLARS. NISSAN NEEDS TO STAND BEHIND THEIR PRODUCTS, AND CORRECT THIS MADNESS. THEN WANT TO SAY BECAUSE YOU DON'T HAVE A WARRANTY NOTHING COULD BE DONE. TOO MANY PEOPLE HAS REPORTED THIS SIMILAR ISSUE TO NOW TAKE ACTION AND CLASSIFY THIS AS A RECALL TO THEIR EXPENSE. THE CONSUMER HAS SPENT ENOUGH MONEY TO TRY AND CORRECT THIS HEADACHE, AND STILL NOT HAVE THE MATTER CORRECTED. MY VEHICLE STILL RUNS HOT, AND IT'S TERRIFYING TO WATCH THAT NEEDLE MOVE CONSTANTLY IN THE HOT AREA OF THE GAUGE AS I DRIVE THE HIGHWAY, AND STREETS EVERYDAY.",
        "vin": "3N1CB51D45L"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/29/2016",
        "dateOfIncident": "05/15/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10862179,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2005 NISSAN SENTRA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V287000 (AIR BAGS) HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "3N1CB51D25L"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/17/2016",
        "dateOfIncident": "03/11/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10850230,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "FRIDAY MARCH 11, 2016 WHILE DRIVING TO WORK ON THE GEORGE BUSH TURNPIKE WHERE THE SPEED LIMIT IS 70 MPH MY CAR LOSS ALL POWER AND WOULD NOT RESTART,  LUCKILY IT  WAS 5:30AM WHEN THE TRAFFIC WAS LIGHT AND I FELT THE POWER STARTING TO DWINDLE AND WAS ABLE TO REACH THE SHOULDER WITHOUT INJURY.  I'M LEASING THE CAR FROM DRIVETIME OF IRVING AND WAS NOT INFORMED OF THIS DEFECT.  I FOUND OUT THROUGH MY RESEARCH TRYING TO FIGURE OUT WHAT WAS WRONG WITH THE THAT WAS A NOVEMBER 2007 RECALL.  I AM AMAZED THAT THESE CARS ARE STILL ON THE ROAD AND BEING SOLD WITH NO WARNING.   THANK GOD THAT I WAS ONE OF THE LUCKY ONES AND NOT ACCIDENT OCCURRED.",
        "vin": "3N1CB51D15L"
    },
    {
        "components": "STEERING,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/07/2016",
        "dateOfIncident": "03/04/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10840258,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 NISSAN SENTRA. UPON ENTERING THE VEHICLE, THE CONTACT OBSERVED THAT THE STEERING WHEEL WAS CRACKED AND THE AIR BAG WAS EJECTED. THE VEHICLE WAS NOT TAKEN TO A DEALER OR DIAGNOSED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VIN WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 15V287000 (AIR BAGS). THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "3N1CB51DX5L"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/18/2016",
        "dateOfIncident": "10/22/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10836951,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2005 NISSAN SENTRA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V287000 (AIR BAGS) HOWEVER, THE PART FOR THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAS NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "3N1CB51D05L"
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/13/2016",
        "dateOfIncident": "12/15/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10820122,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE DIE WHILE DRIVING ON THE FWY & WON'T RESTART. BEEN CLOSE TO CAUSE AN ACCIDENT. HAPPENING VERY OFTEN...",
        "vin": "3N1CB51D35L"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/22/2015",
        "dateOfIncident": "12/21/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10811621,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CHECK ENGINE LIGHT COMES ON AND THE CAR KEEPS RUNNING HOT AFTER I JUST GOT THE COOLANT FLUSHED.",
        "vin": ""
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/01/2015",
        "dateOfIncident": "10/10/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10807809,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MORE THAN ONE OCCASION, MY CAR CUT OFF ON ME WHILE DRIVING.  THE ISSUE BEGAN AROUND MARCH OF 2015.  THREE TIMES MY CAR CUT OFF ON ME DRIVING DOWN A BUSY ROAD.  THE OTHER FEW TIMES WERE ON LOCAL ROADS.  AS A RESULT, I OFTEN HAD TO PUSH, WAIT IT OUT (CAR EVENTUALLY WOULD START/CRANK OVER ABOUT AN HOUR LATER) OR CALL GEICO TO TOLL IT FOR ME.  EACH OF THOSE TIMES, I WAS FORTUNATE NOT TO CAUSE A MAJOR ACCIDENT.  AFTER HAVING WHAT I FELT WAS A NEAR DEATH EXPERIENCE, I TOOK MY CAR TO SEVERAL AUTOZONES, A LOCAL SHOP, AND A NISSAN DEALERSHIP.  EACH OF THEM INFORMED ME THAT IT WAS THE CRANK SHAFT SENSOR.  UPON FURTHER RESEARCH, I LEARNED THAT THERE WAS A RECALL FOR THIS PART.  I CONTACTED NISSAN NORTH AMERICA, SPOKE WITH A REPRESENTATIVE AND FILED A CLAIM.   AT A LATER DATE, I WAS INFORMED THAT MY CAR WAS NOT APART  OF THAT RECALL NOR WAS IT COVERED UNDER THE WARRANTY.  I ASKED THE YOUNG LADY, \"WHAT IF LIVES WERE HARMED OR WORSE, LOST DUE TO THIS MECHANICAL MALFUNCTION?\" SHE KINDLY REPLIED \"I'M SORRY FOR THE INCONVENIENCE, BUT YOU'RE CAR WAS NOT INCLUDED IN OUR RECALL\".  I'M JUST BAFFLED AT THE IDEA THAT A CAR THAT COULD CUT OFF AT ANY MOMENT ON A MAJOR HIGHWAY WOULD BE CAST ASIDE BECAUSE SOME HOW IT WAS MISSED DURING THE RECALL ROUND UP.  I'M NOT SURE WHERE OR HOW FAR THIS COMPLAINT WILL GO. HOWEVER, AFTER READING SIMILAR ONES ON THE INTERNET, I CAN'T HELP BUT WONDER WHY THIS ISSUE HASN'T BEEN ADDRESSED BY THE MEDIA.  THAN AGAIN, I THINK I KNOW WHY.",
        "vin": "3N1CB51D75L"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/09/2015",
        "dateOfIncident": "08/01/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10781102,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 NISSAN SENTRA. WHILE OPERATING THE VEHICLE, THE ODOR OF FUEL WAS PRESENT. THE VEHICLE WAS TAKEN TO THE DEALER WHO WAS UNABLE TO DETERMINE THE CAUSE OF THE FAILURE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 205,000.",
        "vin": "3N1CB51D55L"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "09/01/2015",
        "dateOfIncident": "07/27/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10760608,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR SUDDENLY DIED ABOUT 7/27/2015.  IT JUST SHUT OFF WHILE MY HUSBAND WAS DRIVING AND LUCKILY HE WAS AT A LIGHT AND NO ONE REAR ENDED HIM.  THEN ON ABOUT 8/27/2015 THE VEHICLE DIED WHILE I WAS OPERATING IT.  IT RESTARTED AFTER A FEW MINUTES AND DROVE ABOUT A QUARTER MILE AND DIED AGAIN THEN I MANAGED TO PULL INTO A DRIVEWAY BUT WAS BLOCKING PEOPLE FROM ENTERERING OR EXITING.  MY HUSBAND CAME AND PUSHED ME OUT OF THE WAY.  THEN WHILE I WAS CALLING FOR A TOW, THE CAR STARTED AGAIN AND I WAS CLOSE TO HOME SO I HOPED I COULD MAKE IT.  MY HUSBAND WAS IN HIS VEHICLE AND FOLLOWED ME AND THE VEHICLE DIED AGAIN IN ABOUT ANOTHER 100 FEET BUT I PULLED INTO A BUSINESS CENTER.   MY SON AND HUSBAND PUSHED MY CAR FOR A LITTLE MOMENTUM AS MY TAIL END WAS IN THE STREET AND I PARKED THE CAR THERE FOR A FEW HOURS AND WHEN IT SEEMED TO COOL DOWN A BIT IT STARTED.  THEN TODAY, I WAS CLOSE TO MAKING IT HOME AND THE CAR DIED ON THE SAME BUSY STREET AND WOULD NOT RESTART.  A GOOD SAMARITAN CAME ALONG AND PUSHED ME TO THE SAME BUSINESS CENTER.   AGAIN, WE WENT BACK LATER AND THE VEHICLE STARTED.   THIS IS DANGEROUS BECAUSE ESPECIALLY YESTERDAY,  MANY PEOPLE NEARLY REAR ENDED ME BECAUSE YOU COULD NOT SEE ME BECAUSE I WAS JUST OVER A HILL.  I SEE NISSAN HAS RECALLED SOME VEHICLES FOR THIS ISSUE BUT MINE IS NOT ONE OF THEM AND IT SHOULD BE.  THIS IS VERY DANGEROUS AND SOMEONE COULD BE SERIOUSLY INJURED OR KILLED IF IT WERE TO DIE AT A BAD TIME OR IF SOMEONE WHO IS TRYING TO HELP GETS HURT.  PLEASE HELP.",
        "vin": "3N1CB51DX5L"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/19/2015",
        "dateOfIncident": "08/03/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10749726,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING AT 25 MPH CAR SUDDENLY SHUT OFF. TAKEN TO MECHANIC INFORMED IT IS A FAILURE IN THE CRANKSHAFT POSITION SENSOR. I WAS INFORMED BY NISSAN MY VIN IS NOT INCLUDED IN THE RECALL AS I HAVE A 1.8 L ENGINE AND NOT THE 2.5 L",
        "vin": "3N1CB51D45L"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/10/2015",
        "dateOfIncident": "08/03/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10746336,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 NISSAN SENTRA.  CONSUMER WRITES IN REGARDS TO AIRBAG RECALL NOTICE ISSUES RECALL # 15V287000.  *SMD  THE CONSUMER STATED TWO YEARS HE WAS INVOLVED IN AN ACCIDENT AND THE AIR BAG DID NOT DEPLOY. *JB",
        "vin": "3N1CB51D85L"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/21/2015",
        "dateOfIncident": "05/01/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10735410,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 NISSAN SENTRA. WHILE ATTEMPTING TO START THE VEHICLE, THE ENGINE WOULD NOT IMMEDIATELY START. ONCE THE ENGINE STARTED, FUEL FUMES WERE PRESENT INSIDE THE VEHICLE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THAT THE IGNITION COIL AND ENGINE SENSOR WERE FAULTY AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED BUT THE FAILURE RECURRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 110,000.",
        "vin": "3N1CB51DX5L"
    },
    {
        "components": "STEERING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/01/2015",
        "dateOfIncident": "03/19/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10731603,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 NISSAN SENTRA. WHILE DRIVING AT A LOW SPEED, THE CONTACT NOTICED THAT THE TEMPERATURE GAUGE BEGAN TO INCREASE AS THE VEHICLE OVERHEATED. IN ADDITION, THE STEERING WHEEL SEIZED. THE VEHICLE WAS TAKEN TO A MECHANIC WHO DIAGNOSED THAT THE HEAD GASKET NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 82,544.",
        "vin": "3N1CB51D65L"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/21/2015",
        "dateOfIncident": "06/16/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10726454,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PUMPING GAS AFTER 1.50 OR LESS PUMP SHUTS OFF AND GAS SPILLS OUT ON TO THE GROUND THIS OVER AND OVER WHILE TRYING TO PUT 20.00 IN TAKES SO LONG AND SO MUCH GAS SPILLING OUT IS DANGEROUS AND NOW MY ENGINE LIGHT IS ON WHICH HAPPEN AT THE SAME TIME",
        "vin": "3N1CB51D45L"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/04/2015",
        "dateOfIncident": "06/02/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10723492,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2005 NISSAN SENTRA. THE CONTACT'S DAUGHTER WAS INVOLVED IN A CRASH. THE AIR BAGS DEPLOYED WITH EXPLOSIVE FORCE. THE VEHICLE WAS DESTROYED. THE EXPLOSIONS OCCURRED A FEW MINUTES AFTER THE AIR BAGS DEPLOYED. THE CONTACT'S DAUGHTER WAS INJURED AND RECEIVED MEDICAL ATTENTION. A POLICE REPORT WAS FILED. THE CONTACT DISCOVERED THAT THE VIN WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 15V287000 (AIR BAGS), BUT WAS NOT NOTIFIED TO HAVE THE VEHICLE REPAIRED. THE VIN WAS INVALID. THE FAILURE MILEAGE WAS UNAVAILABLE. ..UPDATED 06-16-15 *BF   UPDATED 8/10/15*CN    UPDATED 10/18/2017*CN",
        "vin": "3N1CD51D25L"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/21/2015",
        "dateOfIncident": "04/21/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10711908,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 NISSAN SENTRA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 14V701000 (AIR BAGS) HOWEVER, THE PARTS NEEDED TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/20/2015",
        "dateOfIncident": "04/20/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10706609,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 NISSAN SENTRA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 14V701000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "3N1CB51D55L"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/21/2015",
        "dateOfIncident": "11/08/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10676920,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER-SIDE AIRBAG IMPROPERLY DEPLOYED THEREBY EXPLODING AND RUPTURING WHICH RESULTED IN SIGNIFICANT AND PERMANENT INJURIES.....UPDATED 02-03-15 *BF.......UPDATED 03/31/15 *BF   *TR   UPDATED 9/19/2017*CN",
        "vin": "3N1CB51D35L"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/15/2014",
        "dateOfIncident": "12/15/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10664277,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE STOPPED RUNNING ALL OF THE SUDDEN. AS I CAME OUT OF THE FREEWAY DRIVING ABOUT 15 MPH  USED A SCANNER AND I GOT A P0335 CODE (CRANK SHAFT POSITION SENSOR) CHECKED RECALLS FORM NISSAN AND IT SAYS THAT MY VIN DOES NOT HAVE ANY RECALLS. IT SEEMS TO BE THE SAME PROBLEM WITH A PREVIOUS RECALLS ON A 2.5 L ENGINES. THIS IS A VERY DANGEROUS ISSUE SINCE IT SEEMS THAT COULD HAPPEN AT ANY TIME. AMAZED THAT THIS ISSUE HAS NOT BEEN RECALLED.  *TR",
        "vin": "3N1CB51D75L"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/21/2014",
        "dateOfIncident": "10/01/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10660059,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 NISSAN SENTRA. THE CONTACT STATED THAT THE AIR BAG WARNING LIGHT SPORADICALLY ILLUMINATED. THE VEHICLE WAS TAKEN TO THE DEALER WHERE HE WAS NOTIFIED THAT HIS VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 14V701000 (AIR BAGS). THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 103,000.",
        "vin": "3N1CB51D55L"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/19/2014",
        "dateOfIncident": "11/19/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10659451,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM VERY UNSAFE DRIVING AROUND IN A VEHICLE WITH A TAKATA AIRBAG THAT CAN BECOME A DEATH INSTRUMENT AT ANY TIME BY SHOOTING PARTS INTO MY BRAIN AND BODY.  *TR",
        "vin": "3N1CB61D45L"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/11/2014",
        "dateOfIncident": "11/23/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10654250,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR START OVER HEATING CHANGED COOLANT , THERMOSTAT BUT NO RESOLVE DEALER SUGGESTS ITS HEAD GASKET THAT IS VERY COMMON IN NISSAN SENTRA 2005.  *TR",
        "vin": "3N1CB51A55L"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/21/2014",
        "dateOfIncident": "09/05/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10649038,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER WEEKS OF VEHICLE MISFIRING AND ATTEMPTS AT DIAGNOSING, LOCAL NISSAN DEALER FOUND CRACKED HEAD GASKET. STATED THEY REFILLED COOLANT LEVELS AND VEHICLE SHOULD BE OKAY FOR A WHILE. VEHICLE'S HEAD GASKET WILL NEED TO BE REPLACED. QUOTED $1200. *TR",
        "vin": "3N1CB51A05L"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/25/2014",
        "dateOfIncident": "04/30/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10638921,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2005 NISSAN SENTRA HAS ONLY 30,000 MILES ON IT AND HAS A BLOWN HEAD GASKET. IT HAS HAD ISSUES WITH HEATING AND COOLING EVER SINCE I BOUGHT IT. IT IS NOT AS RELIABLE AS I THOUGHT. I HAVE TAKEN IT TO THE DEALER FOR EVERY SCHEDULED OIL CHANGE AND TUNE UP. IT IS IN PERFECT CONDITION. NOW, THE ENGINE SHAKES WHEN I START THE CAR. IT IS COSTING ME A LOT TO FIX AND MAINTAIN THIS CAR. NISSAN CORP OF AMERICA SHOULD TAKE RESPONSIBILITY FOR THE FAULTY HEAD GASKET IN THE 2005 NISSAN SENTRA 1.8S MODEL.  *TR",
        "vin": "3N1CB51D25L"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/21/2014",
        "dateOfIncident": "08/15/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10627054,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TRAVELING ON MAIN HIGHWAY W/ AIR TEMP (OAT) 90 DEGREES. RUNNING A/C. COOLANT TEMP SHOWED NORMAL.    VECHICLE STALLED AND COASTED TO A STOP. WAITED AND IT STARTED. DID THIS FOUR MORE TIMES BEFORE DESTINATION.    CODE 335 READING (CAMSHAFT SENSOR). 1.8L ENGINE. NOT 2.5. REPLACED BOTH CAMSHAFT AND CRANKSHAFT SENSORS.   *TR",
        "vin": "3N1CB51D25L"
    },
    {
        "components": "AIR BAGS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/31/2014",
        "dateOfIncident": "04/01/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10618056,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "1)  I HEARD THAT AIRBAGS ON MY CAR MAY NOT FUNCTION AS THEY ARE DESIGNED TO DO.  THERE MAY BE A RECALL. PLEASE ADVISE.    2)  FOR THE PAST 3-4 MONTHS, I HAVE NOTICED A THUMPING SOUND/VIBRATION  WHEN I PRESS MY BRAKES.   IT DOESN'T DO IT EVERYDAY.  SOME DAYS, AFTER THE CAR IS DRIVEN A FEW MILES,  EVERY SINGLE TIME I USE MY BRAKES THE FIRST TIME I NOTICED IT, I WAS DRIVING AND HAD TO PUT ON BRAKES SUDDENLY AND I HEARD IT. NOW IT STILL HAPPENS, BUT I HEAR AND FEEL A THUMPING UNDERNEATH THE FLOOR ON THE LEFT BACK-WHEN THERE IS A PASSENGER SITTING BEHIND THE DRIVER AND THIS SOUND OCCURS, THEY REPORT TO ME THAT THEY  CAN ACTUALLY FEEL THE THUMP UNDER THEIR FEET. OTHER DAYS I DON'T HEAR IT ALL.  IF I HAVE A FULL LOAD OF FOUR PEOPLE, I HEAR IT AND FEEL IT FREQUENTLY. SOMETIME IT SOUNDS LIKE ITS UNDER THE TRUNK OR IN THAT BACK SEAT AREA. WE HAD THE CAR EXAMINED BY A LOCAL  REPUTABLE REPAIR SHOP, THEY DID NOT HEAR THE THUMP AND STATED THEY WOULD HAVE TO HEAR IT OR FEEL IT IN ORDER TO MAKE ANY REPAIRS..  THEY DID EXAMINE THE CAR AND FOUND NOTHING THAT SHOULD BE MAKING THIS NOISE, IN THEIR OPINION.      DO YOU HAVE ANY SUGGESTIONS ON WHAT IS GOING ON. CURRENT MILEAGE:  172,000.  CELL PHONE: [XXX].    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "3N1CB51D75L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/10/2014",
        "dateOfIncident": "04/04/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10597459,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "COMMENTS: MY DAUGHTER, [XXX] , OWNED A 2005 NIACIN SENTRY WHICH HAD TO HAVE THE CAM POSITION SENSOR AND CRANK POSITION SENSOR REPLACED ON 4/9/14 AFTER THE CAR QUICK RUNNING WHILE DRIVING HOME FROM WORK.  SHE WAS IDLING AT A LIGHT, AND THE VEHICLE STOPPED ACCELERATING WHEN SHE TRIED TO PROCEED. SINCE THEN, SHE TRADED THE CAR IN. IN RESEARCHING 2005 NIACIN SENTRY RECALLS, THERE IS A RECALL NHTSA REFERENCE #07V527000, WHICH IS FOR THE CRANKSHAFT POSITION SENSOR ON 2005 NIACIN SENTRY VEHICLES WITH A 2.5L ENGINE. APPARENTLY, HER VEHICLE DOES NOT HAVE THIS ENGINE BUT, AMAZINGLY, HAD THE SAME PROBLEM. I SPOKE WITH A NIACIN REP, MELODY, WHO JUST REPEATED SOME STANDARD TEXT SHE WAS READING, WHICH DID NOT MAKE ANY SENSE TO ME. IT SEEMS MY DAUGHTER'S NIACIN HAD THE SAME ISSUE AS THAT IN THE RECALL.      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *TR",
        "vin": "3N1CB51D25L"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/09/2014",
        "dateOfIncident": "05/14/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10597084,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE HEADING TO WORK, MY CAR LOST POWER DUE TO A SCREW FROM A POWER INTAKE VALVE (BUTTERFLY VALVE AS THE DEALERSHIP REFERRED TO IT) COMING LOOSE AND FALLING INSIDE THE #1 CYLINDER CHAMBER.  INSIDE THE CHAMBER, THE PISTON QUICKLY BENT THE SPARK PLUG ELECTRODES TOGETHER CAUSING THE CAR TO SHUT OFF AND LOSE POWER.  I WAS INSIDE MORNING RUSH HOUR TRAFFIC AT THE TIME OF THE INCIDENT AND WAS NEARLY IN A REAR END COLLISION AS A RESULT.  THE DEALERSHIP POINTED OUT INADVERTENTLY THAT THERE WAS A SERVICE BULLETIN COVERING THIS ISSUE.  I RESEARCHED THESE BULLETINS AND FOUND BULLETIN NTB05-058B.  THIS COVERS THE EXACT PROBLEM THAT HAPPENED TO MY VEHICLE.  THERE IS A CATCH WITH THIS BULLETIN.  I OWN A 2005 NISSAN SENTRA SER SPECV MANUFACTURED IN OCT. 2004.  THE COMPANY CLAIMS MY VIN FALLS OUTSIDE THE SERVICE BULLETIN BY MERE WEEKS.  THIS PROBLEM HAD NOT BEEN PROPERLY ADDRESSED AND MY ENGINE FAILED BECAUSE OF SUCH.  I HAVE CONTACTED NISSAN CORP. DIRECTLY AND THEY PLACE ME IN THE HANDS OF NISSAN REGIONAL.  I WAS GIVEN EXCUSE AFTER EXCUSE AS TO WHY MY VEHICLE WOULD NOT BE REPAIRED BY THE FACTORY.  #1. VEHICLE FELL OUTSIDE THE SERVICE BULLETIN DATE RANGE.  #2 AGE OF VEHICLE AND MILEAGE EVEN THOUGH A BRAND NEW ENGINE WAS PLACED IN OCT 2008.  #3. CUSTOMER LOYALTY WAS IN QUESTION AS NISSAN DID NOT SERVICE MY ENGINE.  WHEN I INQUIRED HOW OIL CHANGES WERE RELEVANT, I WAS TOLD THE TECHNICIANS WOULD HAVE FOUND THIS ISSUE DURING A TWENTY-ONE POINT INSPECTION.  I ASKED FOR CLARIFICATION AS TO WHY I WOULD BELIEVE NISSAN WOULD HAVE DISSEMBLED MY ENGINE, FOUND A LOOSE SCREW AND RE-ASSEMBLED MY ENGINE ALL DURING AN OIL CHANGE. ALSO, THIS PROBLEM SHOULD HAVE BEEN ADDRESSED PROPERLY WHEN MY ENGINE WAS REPLACED IN OCTOBER OF 2008.    LOOSING ENGINE POWER IN HEAVY TRAFFIC, NEARLY BEING IN AN ACCIDENT IS NOT A MATTER I WANT TO TAKE LIGHTLY.  DO I HAVE A VALID ARGUMENT AGAINST NISSAN?  *TR",
        "vin": "3N1AB51D05L"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/20/2014",
        "dateOfIncident": "05/13/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10592756,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 NISSAN SENTRA.  THE CONTACT STATED THAT GASOLINE SPILLED ONTO THE GROUND  BEFORE THE FUEL TANK WAS FILLED TO ITS CAPACITY. THE FAILURE RECURRED ON SEVERAL OCCASIONS.  THE MANUFACTURER WAS NOTIFIED AND  DID NOT PROVIDE A REMEDY. THE FAILURE WAS NOT DIAGNOSED BY A DEALER OR MECHANIC. THE FAILURE MILEAGE WAS 166,000. THE CURRENT MILEAGE WAS 166,811.",
        "vin": "3N1CB51DX5L"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/07/2014",
        "dateOfIncident": "08/12/2006",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10587122,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SERVICE ENGINE LIGHT COMES BEFORE STARTING VEHICLE AND THEN THROTTLE PEDAL HAS NO EFFECT. STARTS FINE RUNS SMOOTH BUT WILL NOT ACCELERATE. I HAVE TO DISCONNECT POSITIVE BATTERY POST FOR ABOUT 5 MINUTES AND THEN REINSTALL BATTERY CABLE. SO FAR WILL WORK FINE FOR A WHILE.  THE SERVICE ENGINE LIGHT COMES MORE FREQUENT NOW BUT THROTTLE PEDAL WILL WORK SOME TIMES. I AM WORRIED THAT THIS WILL START HAPPENING WHEN DRIVING DOWN THE HIGHWAY AND STALL THE CAR. WE BOUGHT THE CAR WITH 17000 MILES AND NOW HAS 107000 MILES ON IT. I CHECKED FOR RECALLS BUT NONE YET.  *TR",
        "vin": "3N1CB51D95L"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/25/2014",
        "dateOfIncident": "03/15/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10574635,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS DRIVING ON THE FREEWAY THE VEHICLE LOST POWER AND SHUT OFF ON ME. CAR WONT START. BLOWN HEAD GASKET AND ENGINE PROBLEMS.   *TR",
        "vin": "3N1CB51DX5L"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/25/2014",
        "dateOfIncident": "09/30/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10574770,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2005 NISSAN SENTRA 1.8S. WE WERE REPLACING A FEW PROBLEM AREAS UNDER THE HOOD, AND AFTER REPLACEMENT NOTICED THE CAR WOULD NOT DRIVE MORE THAN 30MPH. EVEN GETTING IT UP TO 30MPH IS A STRUGGLE.  WE TOOK IT TO A COUPLE REPAIR SHOPS, INCLUDING A LOCAL NISSAN DEALERSHIP. NO ONE IS ABLE TO IDENTIFY THE ISSUES WE HAVE REPLACED THE THROTTLE BODY (WHICH IS ONE MEANT FOR A 2006 YEAR NOT 2005), AND THE GAS PEDAL POSITION SENSOR, 3 TIMES. THE CAR HAS BEEN SITTING FOR THE LAST 5 1/2 MONTHS.   NISSAN DOES NOT KNOW WHAT THE ISSUE IS. THEY CHARGED ME FOR THE GAS PEDAL POSITION SENSOR, EVEN THOUGH WE JUST HAD IT REPLACED AND THAT PART WAS IN FACT A GOOD PART! THEY CHARGED US FOR THEIR UNFOUNDED GUESSES.   *TR",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/03/2013",
        "dateOfIncident": "06/20/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10554622,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JUNE 20, 2013 I BROUGHT MY 2005 NISSAN SENTRA INTO CURRY NISSAN IN YORKTOWN HTS,NY 10598 BECAUSE MY CHECK ENGINE LIGHT WENT ON SAYING IT WAS MY SWIRL VALVE PART # 75150 CODE P1138 .  THEY CHARGED ME $110.00 TO UPDATE MY ENGINE ECU AS PER TECH BULLETIN . ON NOV. 20TH MY CHECK ENGINE LIGHT WENT ON AGAIN AND I BROUGHT IT TO THE NEAREST SERVICE STATION AND  WAS ONCE AGAIN TOLD THAT IT WAS THE SAME CODE FOR THE SWIRL VALVE AND THAT I WAS TO TAKE IT TO NISSAN.. I WAS LUCKY ENOUGH THAT THIS PROBLEM DID NOT CAUSE AN ACCIDENT BUT AM I EXPECTED TO HAVE THIS HAPPEN EVERY 5 OR 6 MONTHS? PLEASE ADVISE ME IF THIS IS A RECALL.  *TR",
        "vin": "3N1CB51D25L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/14/2013",
        "dateOfIncident": "10/14/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10547847,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING DOWN THE SIDE STREET AT APPROXIMATELY 25 MILES PER HOUR, MY CAR SUDDENLY STOPPED WITHOUT WARNING AND TURNED OFF. LATER I FOUND OUT THAT THE PART THAT WAS AFFECTED WAS RECALLED ON SEVERAL NISSAN MODELS BUT THAT MY PARTICULAR VIN NUMBER WAS NOT INCLUDED IN THE RECALL.  THE PIECE THAT WAS DEFECTED WAS RECALLED IN 2007, AND COULD HAVE CAUSED A SEVERE CAR ACCIDENT WITH ME AND MY TODDLER IN THE BACK SEAT HAD I BEEN ON A BUSY STREET OR HIGHWAY; YET, NISSAN IS PUTTING UP A FIGHT TO NOT COVER THE COST UNDER THE RECALL CAMPAIGN BECAUSE MY VIN NUMBER WAS NOT A PART OF THE CAMPAIGN.  *TR",
        "vin": "3N1CB51D55L"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/22/2013",
        "dateOfIncident": "08/19/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10536784,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 NISSAN SENTRA 1.8S WITH APPROX. 63000 MILES.  CAR STARTED HAVING ISSUES WITH STARTING, APPROX. 1-2 YEARS AGO.  THEN ABOUT A MONTH AGO, OWNER NOTICED VEHICLE ENGINE SHUDDERING/RUNNING ROUGHLY, FOR SEVERAL SECONDS, IMMEDIATELY AFTER COLD START IN THE MORNING.  ON EVENING OF AUG. 19TH, CAR WAS EXCEPTIONALLY DIFFICULT TO START, AND RAN ROUGH FOR MORE THAN 1 MINUTE.  CHECK ENGINE LIGHT WAS ILLUMINATED.  UPON INSPECTION, WAS DETERMINED TO BE FAULTY HEAD GASKET.  REPAIR, APPROX. $900.00.  *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/10/2013",
        "dateOfIncident": "07/16/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10524271,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR OVERHEATED, THEN I TOOK IT TO A MECHANIC AND THE ENTIRE ENGINE WAS BLOWN AND I HAD TO PAY $1200.00 TO FIX IT AND COME TO FIND OUT, THERE WAS A RECALL ON MY MAKE AND MODEL AND YEAR ON THE WATER PUMP WHICH WOULD HAVE CAUSED MY CAR TO OVERHEAT AND THUS NOT HAVING TO HAVE MY ENGINE BLOWN.  WHEN I CALLED TO FIND OUT ABOUT THE RECALL NISSAN INFORMED THAT MY VEHICLE WAS NOT ONE OF THOSE INCLUDED BUT IT MATCHED THE YEAR, MAKE AND MODEL???? I WANT ANSWERS...  *TR",
        "vin": "3N1CB51D15L"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/28/2013",
        "dateOfIncident": "04/30/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10513757,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 NISSA SENTRA. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 65 MPH, THE ENGINE STALLED WITHOUT WARNING. THE CONTACT MERGED TO THE SHOULDER. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC FOR DIAGNOSIS AND THEY WERE UNABLE TO LOCATE THE PROBLEM. THERE WAS A RECALL ASSOCIATED WITH NHTSA CAMPAIGN ID NUMBER 07V527000 (ENGINE AND ENGINE COOLING). THE VEHICLE HAD NOT BEEN REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE DEFECT. THE APPROXIMATE FAILURE MILEAGE WAS 142,000.",
        "vin": "3N1CB51D05L"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/25/2013",
        "dateOfIncident": "03/16/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10504409,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 NISSAN SENTRA. THE CONTACT STATED THAT WHENEVER REFUELING, FUEL WOULD OVERFLOW AND SPLASH ALL OVER THE CONTACT. THE VEHICLE WAS TAKEN TO THE DEALER FOR INSPECTION AND THEY STATED THAT THERE WAS NOTHING WRONG WITH THE VEHICLE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED BUT PROVIDED NO ASSISTANCE. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "3N1CB51D75L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/26/2013",
        "dateOfIncident": "02/20/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10500136,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 1.8L 2005 NISSAN SENTRA. AS I WAS DRIVING TO WORK MY VEHICLE SHUTDOWN. I LOOKED AT THE RECALL NHTSA CAMPAIGN NUMBER 07V527000 CRANKSHAFT POSITION SENSOR FAILURE/ENGINE STALL.    I WAS GOING 65MPH ON THE FREEWAY WHEN MY CAR DIED. I HAD MY MECHANIC LOOK AT MY CAR AND FOUND IT WAS THE CRANKSHAFT POSITION SENSOR.  *TR",
        "vin": "3N1CB51D85L"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/20/2013",
        "dateOfIncident": "09/01/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10493544,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM THE FIRST OWNER OF NISSAN SENTRA 1.8S 2005. AT MILEAGE 74,900, THE CHECK ENGINE LIGHT TURNED ON AND A NISSAN DEALERSHIP RETRIEVED THE CODE P0303 CYLINDER 3 MISFIRING ON SEPTEMBER 1, 2012. I ALSO NOTICED, THE COOLANT STARTED TO DROP. SPECIFICALLY, FIRST TIME I REPORTED THE COOLANT DROP TO A NISSAN DEALER ON OCTOBER 9, 2012 (AT MILEAGE 75,557) WHO RAN A PRESSURE TEST BUT ASKED TO COME BACK IF I NOTICED THE COOLANT DROP AGAIN. WHEN THE COOLANT DROPPED AGAIN, THE NISSAN DEALER DETECTED A COOLANT LEAK IN NUMBER 3 CYLINDER JANUARY 4, 2013 (AT MILEAGE 76,577) AND REPLACED THE ENGINE GASKETS, THERMOSTAT ASMY, ENGINE OIL AND ALL NECESSARY PARTS NEEDED FOR REPAIRS ON JANUARY 7, 2013. I PAID ALL THE EXPENSES FOR REPAIRS AS NISSAN.    I FILED A FORMAL COMPLAINT WITH NISSAN AND THEY INFORMED ME THAT SINCE THERE IS NO RECALL AND THE CAR?S POWERTRAIN WARRANTY HAS EXPIRED, NISSAN WILL NOT REIMBURSE ME THE EXPENSES FOR THE REPAIRS DONE AT THE NISSAN DEALERSHIP.    I CONSIDER MYSELF LUCKY THAT I NOTICED THE DROP IN COOLANT AND THE ENGINE WAS NOT SIGNIFICANTLY DAMAGED. I WONDER WHAT COULD HAVE HAPPENED IF I WERE IN THE MIDDLE OF A BUSY FREEWAY AND THE CAR ENGINE CEASED. THIS IS A DANGEROUS COMPONENT FAILURE WITH LIFE THREATENING CONSEQUENCES. GIVEN THAT THIS FAILURE HAS NOTHING TO DO WITH THE DRIVER OF THE CAR AND CAN HAPPEN ANYTIME, I WOULD LIKE TO KNOW WHY NISSAN NEVER RECALLED. AFTER READING FEW ONLINE BULLETIN BOARDS AND COMPLAINTS AT NHTSA (SAFERCAR.GOV), IT APPEARS TO ME THAT IT IS A KNOWN PROBLEM FOR THIS VEHICLE MODEL.  *TR",
        "vin": "3N1CB51D95L"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/16/2013",
        "dateOfIncident": "01/07/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10493154,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 NISSAN SENTRA. THE CONTACT STATED THAT THE CHECK ENGINE WARNING LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN TO THE DEALER FOR INSPECTION WHERE THEY ADVISED THAT THE FAILURE COULD HAVE BEEN CAUSED BY THE FUEL CAP NOT BEING SECURED. THE VEHICLE WAS REPAIRED HOWEVER, THE DEALER ADVISED THAT THE WARNING LIGHT COULD POSSIBLY RE-ILLUMINATE AND IF SO, TO BRING THE VEHICLE BACK FOR FURTHER INSPECTION. THE DEALER DETERMINED THAT IF THE FAILURE RECURRED, THEN THERE COULD POSSIBLY HAVE BEEN A FUEL LEAK SOMEWHERE. THE MANUFACTURER WAS NOTIFIED BUT PROVIDED NO ASSISTANCE. THE FAILURE MILEAGE WAS 75,000.",
        "vin": "3N1CB51D85L"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/14/2013",
        "dateOfIncident": "01/06/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10492909,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "CAMSHAFT POSITION VALVE- ENGINE WOULD MISFIRE AND BUCK WHILE DRIVING FIRST THING IN THE MORNING AND AT LOW SPEEDS, BUT WOULD BE FINE AT HIGH SPEEDS.  *TR",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/14/2013",
        "dateOfIncident": "08/06/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10492908,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE CODE P1446 EVAP CANISTER VENT CONTROL VALVE. VEHICLE WOULD SPIT OUT GAS WHEN TRYING TO REFUEL.  VALVE NEED TO BE REPLACED.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/12/2012",
        "dateOfIncident": "05/23/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10488630,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 NISSAN SENTRA. THE CONTACT STATED THAT WHILE TRAVELING APPROXIMATELY 50 MPH, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS MOVED TO THE SHOULDER, RESTARTED AND BEGAN TO FUNCTION NORMALLY. THE VEHICLE WAS DRIVEN TO A PRIVATE MECHANIC WHERE IT WAS CONFIRMED THAT THE CRANK SHAFT SENSOR FAILED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS CONTACTED ABOUT THE ISSUE AND INFORMED THE CONTACT THAT THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN ID NUMBER: 07V527000 (ENGINE AND ENGINE COOLING). THE FAILURE MILEAGE WAS 124,600 AND THE CURRENT MILEAGE WAS 125,800.",
        "vin": "3N1CB51D75L"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "11/18/2012",
        "dateOfIncident": "11/18/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10485074,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "LATCH SYSTEM IS NOT COMPATIBLE WITH A NEW CAR SEAT THAT IS COMPLIANT WITH THE LATEST SAFETY STANDARDS. THE LATCH RESTRAINTS ARE NOT ACCESSIBLE AND CANNOT BE USED WITH THE CAR SEAT AT ALL.  *TR",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/13/2012",
        "dateOfIncident": "08/01/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10484504,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS PUMPING GAS INTO THE VEHICLE GAS BEGAN TO POUR ON TO THE CAR. THE GAS TANK WAS EMPTY BUT THE PUMP CONTINUED TO CLICK AS IF THE TANK WERE FULL AND THERE WERE EXCESSIVE FUMES COMING OUT OF THE TANK.  *TR",
        "vin": "3N1CB51D05L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/22/2012",
        "dateOfIncident": "10/18/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10481426,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "NHTSA ACTION NUMBER: RQ06001 REQUIRES NISSAN TO FIX THE RECALLED CRANKSHAFT SENSOR IN OUR CAR BECAUSE THE PART HAS BEEN RECALLED FOR SAFETY REASONS, HOWEVER NISSAN REFUSES TO FIX THIS PROBLEM. IT IS UNSAFE TO DRIVE AND NEEDS TO BE FIXED.  *TR",
        "vin": "3N1CB51D75L"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/15/2012",
        "dateOfIncident": "08/06/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10475492,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "CANNOT FILL GAS TANK NORMALLY. WITH A 1/4 TANK, THERE IS BACK-FILL THAT CAUSES THE GAS PUMP TO 'CLICK' OFF AS IF IT IS FULL. OTHER TIMES, YOU HEAR THE 'SWOOSHING' SOUND OF A BACK-FILL, AND GAS HAS COME FLYING BACK OUT AT ME WHILE 'ATTEMPTING' TO PUT GAS IN THE CAR - SEVERE HAZARD!!! CHECKED THE CODE AND SURE ENOUGH, LIKE THOUSANDS OF OTHERS, VOILA - IT'S THE EVAP CANISTER VENT VALVE MALFUNCTION... IN THIS CASE, IT'S 'CLOSED'. IT CAN TAKE UP TO 8 MINUTES TO PUT 2 GALLONS WORTH OF GAS IN, NEEDLESS TO SAY, VAPOR FUMES ARE STRONG, AND GAS DRIBBLES OUT. FILLING UP THIS VEHICLE IS A PAIN IN THE _____. IT APPEARS TO BE A WELL DOCUMENTED ISSUE WITH NISSAN VEHICLES AND IT APPEARS TO ME, NISSAN DOES NOT WANT TO TAKE CARE OF THIS ISSUE.   *TR",
        "vin": "3N1CB51D15L"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/07/2012",
        "dateOfIncident": "12/08/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10474257,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 NISSAN SENTRA. WHILE DRIVING APPROXIMATELY 45 MPH, THE ENGINE STALED WITH THE ILLUMINATION OF THE ENTIRE INSTRUMENT PANEL. THE CONTACT WAS ABLE TO COAST TO THE SIDE OF THE ROAD SAFELY. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC WHERE THE CRANK SHAFT POSITION SENSOR WAS REPLACED AT THE OWNER'S EXPENSE. THERE WAS A RECALL UNDER NHTSA CAMPAIGN ID NUMBER 07V527000 (ENGINE AND ENGINE COOLING); HOWEVER THE VIN WAS UNAVAILABLE. IN ADDITION, WHENEVER REFUELING THE FUEL WOULD SPRAY OUT OF THE FUEL TANK FILLER NECK. THERE WAS A RECALL RELATED TO THE DEFECT UNDER NHTSA CAMPAIGN ID NUMBER 05V269000 (FUEL SYSTEM, GASOLINE:STORAGE). THE VIN WAS INELGIBLE UNDER THE RECALL; HOWEVER THE DEALER HAD TAKEN RESPONSIBILITY OF THE REPAIR EXPENSE. THE MANUFACTURER WAS NOTIFIED OF THE PROBLEM. THE APPROXIMATE FAILURE MILEAGE WAS 68,000.",
        "vin": "3N1CB51D75L"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/26/2012",
        "dateOfIncident": "08/22/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10472512,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEAD GASKET FAILED PREMATURELY ON MY 2005 NISSAN SENTRA AT 82,450 MILES. THERE WAS ISSUES WHEN THE VEHICLE WOULD START UP IN THE MORNINGS OR ON COLD STARTS. ENGINE WOULD MISFIRE 3-5 SECONDS AFTER STARTING. I IMMEDIATELY TOOK THE VEHICLE TO MY LOCAL NISSAN DEALERSHIP. COMPUTER CODES P0303 AND P0300 WERE DETECTED. COOLANT WAS FOUND INSIDE CYLINDER NUMBER 3. A NISSAN SERVICE TECHNICIAN CONFIRMED IT WAS A FAILED HEAD GASKET AND SAID THAT THIS PROBLEM IS COMMON THIS GENERATION OF VEHICLES. VEHICLE WAS VERY WELL TAKEN CARE OF. ALL THE VEHICLE'S MAINTENANCE WAS PERFORMED AT THE NISSAN DEALERSHIP AT THE PROPER AND RECOMMENDED INTERVALS. THIS A VERY COMMON PROBLEM IN 2000-2006 1.8L SENTRAS THAT MUST BE ADDRESSED. HEAD GASKETS SHOULD NOT FAIL AT THIS MILEAGE RANGE, ESPECIALLY WHEN THE VEHICLE WAS 100% UP TO DATE ON MAINTENANCE.  *TR",
        "vin": "3N1CB51D75L"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/01/2012",
        "dateOfIncident": "06/30/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10463913,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT THIS CAR NEW IN 2005.   SHORTLY AFTER I PURCHASED THIS CAR, I NOTICED THAT IT WAS HARD TO START ON SOME OCCASIONS.   I THOUGHT IT WAS A PROBLEM WITH THE BATTERY AND THOUGHT NOTHING OF IT AND WOULD JUST REPLACE THE BATTERY WHEN IT DIED.    ON THE JUNE 30, 2012, THE CAR WOULD NOT START AT ALL.   TOOK IT TO A PLACE TO HAVE FIXED AND WAS TOLD THE HEAD GASKET HAD A HOLE IN IT AND MY COOLANT WAS LEAKING IN ONE OF THE PISTON CHAMBERS.   WHEN THE TECH EXPLAINED WHAT HAPPENED TO THE CAR WHEN I START IT UP, IT WAS EXACTLY WHAT I HAVE BEEN EXPERIENCING WITH THIS CAR FOR A VERY LONG TIME.   I TOLD HIM THAT THIS WAS AN OLDER CAR PROBLEM AND HE RELAYED TO ME THAT THIS WAS A COMMON PROBLEM WITH THIS CAR.    THIS IS A VERY EXPENSIVE REPAIR AND SHOULD HAVE BEEN FIXED BY NISSAN AS IT SEEMS TO BE A FLAW IN ITS DESIGN.     WILL NEVER BUY ANOTHER NISSAN AGAIN.    *TR",
        "vin": "3N1CB51D95L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/21/2012",
        "dateOfIncident": "02/01/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10452610,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I STARTED HAVING PROBLEMS WITH MY CAR STARTING TO OVERHEAT, AS SOON AS I WOULD SEE THE CAR OVERHEAT I WOULD PULL OVER AND WAIT FOR IT TO COOL AS I STARTED TO EXPERIENCE THESE PROBLEMS. I STARTED TO RESEARCH THE CAR ON THE INTERNET AND THIS WEB SITE FOR CAR COMPLAINTS HAD AT LEAST 500 CAR OWNERS WITH THE SAME MAKE AND MODEL HAVING THEIR CARS OVERHEAT. I HAVE TAKING IT TO FOUR DIFFERENT AUTO SHOPS AND FIRST THEY SAY MAYBE THE WATER PUMP, MAYBE THE RADIATOR, AND THEN THEY ALL DECIDE IT A BLOWN HEADGASKET. HOW IS THAT EVEN BE POSSIBLE I HAVE OWNED MANY CARS AND NEVER HAVE HAD THIS BIG OF ISSUE. AND AFTER READING ALL OF THESE OTHER CAR OWNERS HAVING THE SAME ISSUE HOW CAN THESE MANY PEOPLE HAVE THE SAME PROBLEM AND WHY IS THERE NOT A RECALL. WE ALL SPEND ALOT OF MONEY TO BUY A CAR AND TO MAINTAIN A CAR AND THIS IS ONE ISSUE THAT MAYBE 1 OR 2 PEOPLE MAY HAVE BUT NOT HUNDREDS?????? HERE IS WHERE I FOUND THE MOST COMPLAINTS.  HTTP://WWW.CARCOMPLAINTS.COM/NISSAN/SENTRA/2005/         *JS",
        "vin": "3N1CB51D35L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/15/2012",
        "dateOfIncident": "02/07/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10451837,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STARTED TO DISPLAY \"CHECK ENGINE SOON\" LIGHT AT APROX. 55,000 MILES I TOOK IT TO DEALERSHIP FOR A DIAGNOSTIC, INITIALLY THEY SAID IT WAS A BAD FUEL SENSOR BUT AFTER RETURNING CAR TO ME P0300 ERROR LIGHT CAME BACK ON NEXT DAY. I TOOK BACK TO DEALERSHIP THIS TIME THEY SAID IT WAS A BAD HEAD GASKET UPON FURTHER INVESTIGATION I FOUND INFORMATION FROM 3 SEPARATE SOURCES THAT NUMEROUS CONSUMERS WHO HAVE PURCHASED THE SAME MAKE AND MODEL 2005 NISSAN SENTRA HAVE HAD SIMILAR PROBLEMS WITH FAULTY HEAD GASKET I ALSO FOUND NISSAN IS AWARE OF A PROBLEM WITH 2005 NISSAN SENTRA HEAD GASKET BUT REFUSE AT THIS TIME TO DO A RECALL MOST LIKELY BECAUSE IT IS NOT A SAFETY ISSUE BUT A MONETARY ISSUE BASICALLY NISSAN CORP. WOULD RATHER HAVE CONSUMERS HAVE TO COME OUT OF THEIR POCKET AND PAY FOR REPAIR THEN STAND BEHIND THEIR PRODUCT AND DO THE RIGHT THING AND DO A RECALL ON 2005 NISSAN SENTRA HEAD GASKET.   HTTP://WWW.CARCOMPLAINTS.COM/NISSAN/SENTRA/2005/ENGINE/BLOWN_HEAD_GASKET.SHTML   HTTP://WWW.TOPIX.COM/FORUM/AUTOS/NISSAN-SENTRA/TP3DF0A7JTI0AKN92.  *TR",
        "vin": "3N1CB51D15L"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/09/2012",
        "dateOfIncident": "03/08/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10450999,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR WAS SUPPOSEDLY FULLY INSPECTED ON OCTOBER 2010. IT HAD BEEN CHECKED ABOUT THREE TIMES THAT SAME YEAR BY NISSAN DEALERSHIPS. ON MARCH 8, AS I WAS EXITING I-35, MY BRAKES WOULD NOT RESPOND. I KEPT PRESSING THE BRAKE; I DIDN'T RAISE MY FOOT AND PUSH, I JUST KEPT PUSHING DEEPER AND DEEPER. I BRACED MYSELF FOR IMPACT, BUT MIRACULOUSLY, THE CAR STOPPED JUST A CENTIMETER AWAY FROM THE CAR IN FRONT OF ME. THE WARRANTY RAN OUT ON OCTOBER 2010, SO I TOOK THE CAR TO A NON-NISSAN MECHANIC, WHO FOUND THAT MY CAR WAS MISSING BRAKE FLUID AND THAT ALL MY BRAKES WERE WORN OUT. THEY ALL NEED TO BE REPLACED, INCLUDING BRAKE PADS. THIS DID NOT HAPPEN OVERNIGHT. NO NISSAN DEALERSHIP EVER TOLD ME ABOUT ANY PROBLEMS WITH MY BRAKES. TOWN NORTH NISSAN IN AUSTIN WERE THE ONES WHO LAST INSPECTED MY CAR, TWICE IN A PERIOD OF SIX MONTHS. BEFORE, THAT, I TOOK MY CAR TO CHARLIE CLARK NISSAN IN HARLINGEN (WHICH HAS THE WORST SERVICE EVER; THEY TRIED MAKING ME PAY FOR THINGS THAT WERE COVERED UNDER MY WARRANTY). I COULD HAVE CRASHED; I COULD'VE KILLED OTHERS AND MYSELF. I DON'T KNOW WHO ELSE TO RESORT TO, BECAUSE BASED ON PRIOR EXPERIENCE (I'VE HAD ISSUES WITH MY A.C., WINDOWS, AND OTHER THINGS BEFORE), NISSAN DOES IS RUDE AND DOES NOT HELP OUT. SO, I DOUBT THEY'LL HELP ME NOW THAT MY WARRANTY HAS RUN OUT. MY BRAKES DID NOT WEAR OUT OVER NIGHT. A HUGE ACCIDENT COULD HAVE RESULTED DUE TO  THE NISSAN'S NEGLIGENCE. *TR",
        "vin": "3N1CB51D65L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/10/2011",
        "dateOfIncident": "03/07/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10435191,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 NISSAN SENTRA. THE CONTACT STATED THAT THE CHECK ENGINE WARNING LIGHT REMAINED ILLUMINATED AND CAUSED THE VEHICLE TO BECOME RESISTANT TO START-UP ATTEMPTS. THE VEHICLE WAS ALSO LOSING ANTI-FREEZE ABNORMALLY BUT THE CONTACT WAS UNABLE TO LOCATE A HOLE OR LEAK IN THE RADIATOR. THE VEHICLE WAS NOT INSPECTED FOR THE FAILURE. THE CONTACT SPOKE WITH A LOCAL MECHANIC WHO ADVISED THAT THE HEAD GASKET COULD POSSIBLY NEED REPLACING. THE VEHICLE WAS NOT REPAIRED. THE CURRENT MILEAGE WAS 33,899 AND THE FAILURE MILEAGE WAS UNKNOWN.  UPDATED11/29/11 *BF  THE CONSUMER STATED ANTI-FREEZE WAS LEAKING FROM THE VEHICLE AND THE ENGINE LIGHT ILLUMINATED. UPDATED 12/13/11",
        "vin": "3N1CB51D85L"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/28/2011",
        "dateOfIncident": "10/26/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10433155,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 NISSAN SENTRA. THE CONTACT STATED THAT SHE WAS UNABLE TO EXIT THE VEHICLE FROM THE FRONT DRIVER SIDE DOOR. SHE WAS ABLE TO OPEN THE DOOR FROM THE EXTERIOR, BUT NOT THE INTERIOR. THE VEHICLE WAS TAKEN TO AN INDEPENDENT REPAIR SHOP AND THEY WERE UNABLE TO DUPLICATE THE FAILURE. THE FAILURE RECURRED INTERMITTENTLY. THE VEHICLE WAS NOT TAKEN BACK TO HAVE THE FAILURE DIAGNOSED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE AND CURRENT MILEAGES WERE 61,000.",
        "vin": "3N1CB51D95L"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/15/2011",
        "dateOfIncident": "09/11/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10425569,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 NISSAN SENTRA. THE CONTACT STATED THAT GASOLINE SPILLED FROM THE FUEL TANK ONCE FILLED TO CAPACITY. THE CONTACT TOOK THE VEHICLE TO THE DEALER AND WAS TOLD THAT THE FUEL VALVE NEEDED TO BE REPLACED. THE CONTACT BELIEVED THAT THE FAILURE WAS A MANUFACTURING DEFECT.   UPDATED 11/16/11*LJ  THE CONSUMER STATED SHE HAD 1/4 TANK OF GAS. SHE WENT TO TWO DIFFERENT GAS STATION TRYING TO PUT FUEL IN THE VEHICLE. BOTH TIMES, IT CLICKED OFF AFTER A DOLLAR OF GAS AND RELEASED GAS BACK OUT.  THE DEALER REPLACED THE CONTROL VALVE. UPDATED 01/19/12",
        "vin": "3N1CB51D75L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/14/2011",
        "dateOfIncident": "08/30/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10425457,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 NISSAN SENTRA.  THE CONTACT STATED THAT THE CHECK ENGINE LIGHT WAS ILLUMINATED AND THE CONTACT HEARD A LOUD, ABNORMAL NOISE FROM BEHIND THE DASHBOARD. THE CONTACT THEN NOTICED THAT THERE WAS DUST AND OIL SEEPAGE ON THE CYLINDER HEAD THAT WAS NEVER PRESENT BEFORE.  THE VEHICLE WAS LEFT WITH THE DEALER FOR DIAGNOSIS, BUT REQUESTED THAT THE CONTACT AUTHORIZE REMOVAL OF THE CYLINDER HEAD FOR FURTHER INSPECTION.  THE MANUFACTURER DENIED ANY ASSISTANCE WITH REPAIR UNLESS THE CONTACT AUTHORIZED FOR FURTHER INSPECTION.  THE VEHICLE WAS REPAIRED.  THE FAILURE AND CURRENT MILEAGE WAS 49,542. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/17/2011",
        "dateOfIncident": "12/01/2007",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10419766,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN TURNING RIGHT I WOULD NOTICE THAT MY ENGINE TEMP WOULD GO UP.  THE MECHANICS FINALLY FIGURED OUT THAT IT WAS A BROKEN HEAD GASKET WHICH COST ME $1000.00.  THE CAR HAD LESS THAN 50,000 MILES ON IT AT THE TIME.  NOW MY CHECK ENGINE LIGHT IS ON AND I HAVE PROBLEMS STARTING IT.  *KB",
        "vin": "3N1CB51D75L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/16/2011",
        "dateOfIncident": "08/06/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10419715,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 NISSAN SENTRA. THE CONTACT STATED THAT THE ENGINE WOULD BEGIN TO LOSE POWER AND NEARLY STALL. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER, WHERE THE CONTACT WAS INFORMED THAT THE CRANKSHAFT POSITION SENSOR FAILED. THE DEALER ALSO STATED THAT THERE WAS A RECALL ASSOCIATED WITH NHTSA CAMPAIGN ID NUMBER 07V52700 (ENGINE AND ENGINE COOLING), BUT THE VEHICLE WAS NOT INCLUDED. THE FAILURE MILEAGE WAS 130,000.",
        "vin": "3N1CB51D45L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/08/2011",
        "dateOfIncident": "08/01/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10418035,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 NISSAN SENTRA. THE CONTACT STATED THAT WHILE DRIVING 30 MPH, THE VEHICLE STARTED TO HESITATE AND IT STALLED. THE VEHICLE WAS TOWED TO A LOCAL REPAIR SHOP, WHERE THEY WERE UNABLE TO DIAGNOSE THE FAILURE, BUT REPLACED THE TEMPERATURE GAUGE AS A TEMPORARY REMEDY. APPROXIMATELY SEVEN MONTHS LATER, THE FAILURE RECURRED. THE VEHICLE WAS TAKEN BACK TO THE LOCAL REPAIR SHOP, WHO DIAGNOSED THAT THE HEAD GASKET AND RADIATOR NEEDED TO BE REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE, BUT OFFERED NO ASSISTANCE. THE VEHICLE WAS REPAIRED. THE FAILURE MILEAGE WAS 80,000 AND THE CURRENT MILEAGE WAS 92,000.",
        "vin": "3N1CB51D35L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/06/2011",
        "dateOfIncident": "05/15/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10410777,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER THE CAR HAD BEEN HAVING TROUBLE WITH OVERHEAD, THE THERMOSTAT, ENGINE BELTS, AND WATER PUMP WERE REPLACED APRIL 30, 2011.  APPROXIMATELY TWO WEEKS LATER, THE CAR WOULD NO LONGER START.  THE MECHANIC SAID THIS NO START CONDITION AND THE PREVIOUS PROBLEMS WITH THE THERMOSTAT/COOLANT WERE DUE TO A HEAD GASKET PROBLEM. THE HEAD GASKET IS FAULTY AND MANY OTHERS HAVE HAD THIS PROBLEM. THE CAR HAS ONLY 70,000 MILES AND SHOULD NOT BE HAVING THIS TYPE OF PROBLEM.  THE CAR WAS BOUGHT NEW, HAD BEEN WELL CARED FOR AND THE ONLY PROBLEMS HAVE BEEN CAUSED BY THE FAULTY HEAD GASKET.  *TR",
        "vin": "3N1CB51D35L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/05/2011",
        "dateOfIncident": "07/05/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10410543,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "BLOWN HEAD GASKET ON 2005 NISSIAN SENTRA 1.8. THIS IS A REOCCURING PROBLEM WITH HUNDREDS OF NISSAN SENTRA VEHICLES. LOOK AT ALL THE TESTIMONIES ONLINE. THE NHTSA SHOULD PUT A RECALL ALERT ON THIS PRODUCT. TO MANY CONSUMERES LOSING MONEY BECAUSE IT HAPPENS AFTER THE WARRANTY HAS EXPIRED.  *KB",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/28/2011",
        "dateOfIncident": "05/15/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10409241,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 NISSAN SENTRA. WHILE ADDING FUEL TO THE VEHICLE IT BEGAN TO SPILL OUT OF THE VEHICLE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC. THE MECHANIC STATED THAT THE VAPOR CANISTER NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. NHTSA RECALL CAMPAIGN ID NUMBER: 05V269000 (FUEL SYSTEM, GASOLINE:STORAGE) MAY BE RELATED TO THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 85,000.",
        "vin": "3N1CB51D15L"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/23/2011",
        "dateOfIncident": "06/23/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10408647,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 NISSAN SENTRA.  WHILE ATTEMPTING TO REFUEL THE VEHICLE, FUEL SPILLED FROM THE FILLER NECK AND ONTO THE PASSENGER.  THE DEALER ADVISED THE CONTACT THAT HIS VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN ID NUMBER: 05V269000 (FUEL SYSTEM, GASOLINE:STORAGE) AND OFFERED NO FURTHER ASSISTANCE.  THE MANUFACTURER WAS MADE AWARE OF THE FAILURE.  NO REPAIRS WERE PERFORMED.  THE CURRENT AND FAILURE MILEAGES WERE 100,000.",
        "vin": "3N1CB51DX5L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/24/2011",
        "dateOfIncident": "04/11/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10403097,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 NISSAN SENTRA. CONSUMER STATES PROBLEM WITH OIL DIPSTICK BREAKING OFF. *TGW",
        "vin": "3N1CB51D45L"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/10/2011",
        "dateOfIncident": "05/07/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10399897,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 NISSAN SENTRA. THE CONTACT STATED WHENEVER FUEL WAS DISPENSED INTO THE FUEL TANK, THE FUEL WOULD SPEW OUT FROM THE FUEL TANK FILLER NECK REGARDLESS OF THE FUEL CAPACITY. THERE WAS A RECALL ASSOCIATED WITH THE FAILURE UNDER NHTSA CAMPAIGN ID NUMBER: 05V269000 (FUEL SYSTEM, GASOLINE:STORAGE) BUT THE VIN WAS NOT INCLUDED IN THE RECALL. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 109,000.",
        "vin": "3N1CB51D15L"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/28/2011",
        "dateOfIncident": "12/08/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10398966,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "CAN NOT OPEN THE DRIVER'S DOOR FROM THE INSIDE. THE WINDOW HAS TO BE ROLLED DOWN AND THE OUTSIDE HANDLE HAS TO BE USED TO OPEN THE DOOR.",
        "vin": "3N1CB51D95L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/26/2011",
        "dateOfIncident": "04/10/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10397908,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DIPSTICK FOR OIL SEPARATED. THERE IS NO WAY TO CHECK THE OIL.",
        "vin": "3N1CB51D45L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/28/2011",
        "dateOfIncident": "02/25/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10393048,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 NISSAN SENTRA. THE CONTACT STATED THAT THE VEHICLE WOULD NOT START AND WAS TAKEN TO THE DEALER FOR INSPECTION. THE DEALER ADVISED THAT THE TIMING CHAIN AND HEAD GASKET WOULD NEED REPLACING. THERE WERE NO RECALLS FOR THE FAILURE AND THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS ADVISED THAT THEY WOULD ASSIST WITH FIFTY PERCENT OF THE REPAIR COSTS BUT THE CONTACT DECLINED. THE FAILURE MILEAGE WAS 54,000.",
        "vin": "3N1CB51D65L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/22/2011",
        "dateOfIncident": "03/03/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10392478,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "CLIENT CONTACT OWNS A 2005 NISSAN SENTRA 1.8L ENGINE WITH 77,650 MILES. THE CONTACT STATED THAT THE HEAD GASKET WAS BLOWN AND THERE WERE NO INDICATIONS THAT THE VEHICLE WAS OVERHEATING.     HE ALWAYS NOTICED THE NORMAL PRESSURE IN THE ENGINE.  THE VEHICLE WAS TAKEN TO A MECHANIC THREE TIMES WHO STATED THAT HE BOUGHT BAD GAS AND REFILL THE GAS TANK WITH HIGH TEST WHEN IT WAS HALF EMPTY.     MECHANIC NOTICE A MISFIRE IN CYLINDER 1 AND/OR RANDOM MISFIRE. ALSO, RUNNING A LITTLE ELEVATED TEMPERATURE.  WE CHANGED SPARK PLUGS, OIL, AND CLEANED THE FUEL INJECTORS BUT STILL HAD THE PROBLEM.    THREE DAYS LATER THE CHECK ENGINE LIGHT CAME ON.  WE WENT TO FIRESTONE AND TOLD THE HEAD CASKET WAS BLOWN.    THE COST IS ABOUT 950 DOLLARS TO FIX THE HEAD GASKET. WHO KNOWS WHAT OTHER DAMAGE HAS BEEN CAUSED TO OTHER PARTS AS WELL.  *TR",
        "vin": "3N1CB51A65L"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/01/2011",
        "dateOfIncident": "02/01/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10379825,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT PASSENGER SIDE WINDOW WILL NOT GO UP OR DOWN, IT IS RAINING, SNOWING. THIS IS SECOND WINDOW TO FAIL IN THIS CAR. IT IS UNSAFE TO HAVE ELECTRIC WINDOWS THAT ARE SO SHODDILY MADE. I DON'T USE THAT WINDOW MUCH. I AM SURE THEY ALL WILL FAIL AT THIS RATE. ALL 4 OF THEM.  *LN",
        "vin": "3N1CB51D45L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/26/2011",
        "dateOfIncident": "12/01/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10378782,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 NISSAN SENTRA. THE CONTACT STATED THAT THE HEAD GASKET WAS BLOWN AND THERE WERE NO INDICATIONS THAT THE VEHICLE WAS OVERHEATING. SHE READ DETAILS REGARDING A HAIR LINE FRACTURE IN THE HEAD GASKET. THE NORMAL PRESSURE IN THE ENGINE SHOULD BE 60 AND IT COULD DECREASE WHICH WOULD ALSO BE AN INDICATION THAT THE HEAD GASKET WAS BLOWN; HOWEVER, IT WAS ONLY DUE TO THE BOLTS THAT WERE ON THE HEAD GASKET AT THE BOTTOM OF THE ENGINE. THE VEHICLE WAS TAKEN TO A MECHANIC THREE TIMES WHO STATED THAT  THE IGNITION COIL, THE THROTTLE BODY AND THE GASOLINE PEDAL WERE THE REASON THAT THE CHECK ENGINE LIGHT ILLUMINATED. THE THIRD TIME THE FAILURE OCCURRED SHE WAS TOLD THAT THE ACTUAL FAILURE WAS THE HEAD GASKET ALTHOUGH THERE WERE NO PRIOR SIGNS OF THE VEHICLE OVER HEATING. THE THERMOSTAT WAS CHECKED AND THERE WAS NO WATER MIXING WITH THE OIL NOR WAS IT OPENING AND CLOSING AT THAT TIME. SHE WAS THE ORIGINAL OWNER OF THE VEHICLE. SHE WAS CONCERNED THAT THE BOLTS WERE A COMMON FAILURE FOR HER YEAR, MAKE AND MODEL VEHICLE. THE FIRST FAILURE OCCURRED AT 44,900 MILES WHEN THE CHECK ENGINE LIGHT CAME ON.  THE CURRENT MILEAGE WAS 45,100.",
        "vin": "3N1CB51D85L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/13/2011",
        "dateOfIncident": "12/23/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10376529,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 NISSAN SENTRA. WHILE DRIVING APPROXIMATELY 35 MPH THE CONTACT NOTICED THAT THE HEAT STOPPED BLOWING FROM THE VENTS. THE VEHICLE WAS TAKEN TO AN INDEPENDENT REPAIR SHOP WHERE THE CONTACT WAS TOLD THAT A HEAD GASKET HAD BLOWN OUT.  THE HEAD GASKET WAS REPLACED. THE FAILURE MILEAGE WAS 76,200 AND THE CURRENT MILEAGE WAS 76,300.",
        "vin": "3N1CB51D05L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/23/2010",
        "dateOfIncident": "08/01/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10367288,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "1.  SHAKING WHEN CAR WAS TURNED ON.  LOSING POWER WHILST DRIVING. LOSING COOLANT.   2.  HEAD GASKET WAS DIAGNOSED TO BE LEAKING. OCCURRED CONSTANTLY WHEN CAR TURNED ON, LOST POWER AS DRIVING, IDLED ROUGH,  FAILED TO POINT COULD NO LONGER DRIVE AS COULD NOT ACCELERATE WITHOUT SHAKING OR FEELING LIKE IT WOULD STALL. ODD PART IS IT SEEMED TO BE BETTER ON COOLER MORNINGS.  3.  READ CODES FOR MISFIRE CYLINDER 4, AND RANDOM MISFIRE. ALSO RUNNING A LITTLE ELEVATED TEMPERATURE.  WE CHANGED SPARK PLUGS, COILS, AND STILL HAD THE PROBLEM.  SEARCHED ONLINE TO FIND THE SAME MODEL AND YEAR ALL HAD SAME CODES.  THE SOLUTION ON MULTIPLE MESSAGE BOARDS THAT 2005 NISSAN SENTRA ALL HAD PROBLEMS WITH HEAD GASKET BLOWING.  WHEN ASKED MECHANIC TO CHECK, HE FOUND CYLINDER 4 BE VERY CLEAN WHICH HE BELIEVED WAS DUE TO COOLANT LEAKING IN. HE USED A SEALANT PRODUCT THROUGH THE SYSTEM THAT FILLED IN LEAKS.  HE SAID THE HEAD GASKET DESIGN WAS DIFFERENT. THEY WERE BOLTS THAT SEEMED TO STRETCH AS THEY TIGHTEN WHICH WOULD OBVIOUSLY CRACK OR BREAK AFTER GENERAL USE.  HE SAID THERE COULD BE A PROBLEM IF ANY FRAGMENTS WERE TO BE LOSE IN THE SYSTEM COULD DAMAGE OTHER PARTS SUCH AS A WATER PUMP.  WE ARE WATCHING THE WATER LEVELS. WE HAVE PARKED THE CAR BECAUSE WE DO NOT KNOW IF OR WHEN THE CAR WILL REPEAT THE ISSUE. THE COST IS ABOUT 2,000 DOLLARS TO FIX THE HEAD GASKET.  WHO KNOWS WHAT OTHER DAMAGE HAS BEEN CAUSED TO OTHER PARTS AS WELL.  *TR",
        "vin": "3N1CB51D35L"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/09/2010",
        "dateOfIncident": "10/14/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10365087,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR BUMPER DETACHED FROM THE REST OF CAR.  WHEN TAKEN TO A BODY SHOP THE CLIPS HAD GONE BAD.  *TR",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/09/2010",
        "dateOfIncident": "04/05/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10368969,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "CD TOOK CD AND WOULD NOT EJECT CD. CD PLAYER STOPPED WORKING.    INNER PART OF PASSENGER SIDE DOOR (SECTION USED TO PULL DOOR CLOSED)  COMES APART",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/28/2010",
        "dateOfIncident": "07/10/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10362844,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THROTTLE POSITION SENSOR SYSTEM - CONSISTS OF TWO PARTS; THE GAS PEDAL AND THE THROTTLE BODY CONTROL UNDER THE HOOD.  VEHICLE WILL RUN NORMALLY AND WHEN THE TPS FAILS, IT WILL DROP ENGINE RPM TO LESS THAN 1000 RPM NO MATTER THE POSITION OF THE GAS PEDAL.  MOST OFTEN OCCURS RIGHT AFTER STARTING THE VEHICLE AND IN SHIFT PATTERN BETWEEN GEARS, HOWEVER, IT CAN HAPPEN AT INTERSECTIONS OR AT SPEED ON THE HIGHWAY THUS CAUSING AN UNSAFE SITUATION.  WHEN IT HAPPENS, THE ONLY WAY TO RESOLVE THE ISSUE IS TO SHUT OFF THE ENGINE AND RESTART THUS RESETTING THE SENSOR.  DEPENDING ON THE FAILURE LEVEL OF EITHER PART OF THE SENSOR, DEPENDS ON HOW OFTEN THE PROBLEM DESCRIBED ABOVE OCCURS.  I HAVE HAD BOTH PARTS OF THE TPS REPLACED AND THERE IS STILL AN ISSUE WHERE THE ENGINE SPUTTERS AT HIGH RPM EVEN WITH NO SERVICE ENGINE SOON LIGHT CURRENTLY ON AT THIS TIME.  THE ENGINE SPUTTERING I FEEL IS RELATED TO THE THROTTLE POSITION SENSOR SYSTEM PROBLEM.  EITHER WAY, IT IS A SAFETY ISSUE WHEN IT OCCURS IN FAST MOVING TRAFFIC, INTERSECTIONS OR AT SPEED ON THE FREEWAY. *TR",
        "vin": "3N1CB51D35L"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/21/2010",
        "dateOfIncident": "09/15/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10361531,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 NISSAN SENTRA. THE CONTACT WAS REFUELING THE VEHICLE AS GASOLINE BEGAN TO SPILL ONTO THE GROUND. THE CONTACT STATED THAT IT WOULD TAKE APPROXIMATELY 20 TO 30 MINUTES TO FILL THE FUEL TANK. THE CONTACT REFERENCED NHTSA CAMPAIGN ID NUMBER: 05V269000 (FUEL SYSTEM, GASOLINE:STORAGE) AND WAS INFORMED BY THE MANUFACTURER THAT HIS VEHICLE WAS NOT INCLUDED IN THE RECALL. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 105,000 AND THE CURRENT MILEAGE WAS 112,000.",
        "vin": "3N1CB51D85L"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/17/2010",
        "dateOfIncident": "03/09/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10360933,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT ME A 2005 NISSAN SENTRA 1.8 ON JANUARY OF 2010. I WAS TOLD BY THE DEALER THAT THEY GET GREAT GAS MILEAGE AND ARE A VERY RELIABLE CAR TO HAVE. I HAVE LEARNED FAST THIS WAS NOT SO. MY CAR IS NOW NOT WANTING TO START, IT IS SHIFTING VERY HARD AND SOMETIMES WONT SHIFT AND I CAN SMELL SOMETHING BURNING ESPECIALLY WHEN DRIVING UP A HILL, MY KEYPAD WILL NOT WORK TO LOCK OR UNLOCK MY CAR BUT WILL OPEN THE TRUNK, THE LOCK-UNLOCK BUTTON INSIDE THE CAR WILL NOT WORK, AND NONE OF MY WINDOWS WILL ROLL DOWN. THIS IS BS. I HAVE TOLD AND WILL PROCEED TO TELL EVERYONE I KNOW TO NOT BUY A NISSAN. THIS HAS MADE ME NOT WANT TO TRUST ANY OF YOUR VEHICLES AGAIN AND I WILL PROBABLY GO TO A DIFF. DEALER AND GET SOMETHING WELL WORTH MY MONEY. I AM NOT PAYING 8,000 DOLLARS ON A CAR THAT JUST KEEPS TEARING UP, ESPECIALLY WHEN PARTS ARE WAY TO EXPENSIVE! *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": true,
        "dateComplaintFiled": "09/24/2010",
        "dateOfIncident": "09/06/2010",
        "fire": true,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10357290,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "NISSAN SENTRA 05    HEAD GASKET    NISSAN SENTRA'S  ( ESPECIALLY 05'S ) SEEM TO HAVE   PROBLEMS WITH HEAD GASKETS BLOWING.    DESPERATELY NEEDS TO BE RECALLED    WOULD TRULY APPRECIATE IF YOU LOOK INTO THIS PROBLEM.  EVERYONE IT SEEMS HAS PROBLEMS WITH IT.  IF YOU LOOK UP 05 SENTRA COMPLAINTS ONLINE  9 OUT OF 10 TIMES ITS HEAD GASKET.    I GAVE FALSE INFORMATION ON HERE CONCERNING THE INCIDENT REPORT IN HOPES THAT IT WOULD INCREASE CHANCES OF MY DESCRIPTION BEING READ. DON'T TRY MY CONTACT INFORMATION  EITHER BECAUSE IT SHOULD ALSO BE OBVIOUSLY FALSE.  PLEASE HELP. *TR",
        "vin": ""
    },
    {
        "components": "STRUCTURE,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "09/22/2010",
        "dateOfIncident": "09/15/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10356901,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR IS A 2005 NISSAN SENTRA LIMITED EDITION THE DRIVERS DOOR WILL NOT OPEN.  THE ONLY WAY I CAN OPEN IT IS IF I ROLL MY WINDOW DOWN AND REACH MY HAND OUT   THE DOOR TO THE HANDLE THIS IA A SAFETY ISSUE I CONTACTED COAST NISSAN I HAVE  AN APPOINTMENT 9-22-10 THEY SAID I HAVE TO PAY IT APROX COST 200.00 ,IT SHOULD BE PAID BY NISSAN NOT THE CONSUMER MY APPOINTMENT IS AT 8AM I AM HOPING THAT I CAN BE REIMBURSE FOR THE SAFETY ISSUE .I HOPE YOU STAND BEHIND YOUR PRODUCT. *TR",
        "vin": "3N1CB51D65L"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/31/2010",
        "dateOfIncident": "08/22/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10352958,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION NOT SHIFTING PROPERLY GETTING A BURNING SMELL WHEN DRIVING ON HIGHWAYS WITH SMOKE. CAR WILL NOT ACCELERATE PROPERLY. *TR",
        "vin": "3N1CB51D15L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/27/2010",
        "dateOfIncident": "08/24/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10352285,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2005 NISSAN SENTA. I WAS DRIVING DOWN THE FREEWAY AND MY CAR SHUT OFF WHILE IN DRIVE. MY CHECK ENGINE LIGHT CAME ON. I WAS INFORMED THAT MY CRANKSHAFT POSITION SENSOR NEEDS TO BE REPLACE. I HAVE REPLACED THE PART TWICE AND MY CAR STILL CUTS OFF WHILE DRIVING. THERE IS A RECALL FOR THIS ISSUE WITH NISSAN AND NISSAN IS TELLING MY THAT MY VIN NUMBER DOES NOT QUALIFY FOR THE RECALL. NISSAN WANTS ME TO PAY FOR A DIAGONISTIC FROM A NISSAN DEALARSHIP AND IF THEY PROVE THAT IT IS DEFEACTED THEN THEY WILL REPLACE IT. *TR",
        "vin": "3N1CB51D15L"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/18/2010",
        "dateOfIncident": "08/09/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10350382,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 NISSAN SENTRA. THE CONTACT WAS REFUELING THE VEHICLE WHEN GASOLINE BEGAN TO SPEW BACK OUT OF THE FILLER TUBE. THE VEHICLE WOULD ONLY ALLOW APPROXIMATELY TWO DOLLARS WORTH OF GASOLINE BEFORE SPILLING. THE CONTACT STATED THE VEHICLE WAS REPAIRED ONE MONTH PRIOR TO THE FAILURE FOR THE SAME DEFECT. SHE WAS ABLE TO LOCATE NHTSA CAMPAIGN ID NUMBER: 05V269000 (FUEL SYSTEM, GASOLINE: STORAGE) BUT WAS ADVISED BY THE DEALER THAT HER VIN WAS NOT INCLUDED.  THE VEHICLE WAS AT THE DEALER WHERE THE CONTACT WAS AWAITING REPAIRS. THE FAILURE AND CURRENT MILEAGE WAS 99,500.",
        "vin": "3N1CB51D75L"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "07/31/2010",
        "dateOfIncident": "07/28/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10346456,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER SIDE REAR WINDOW WILL NOT GO UP AND DOWN., IT WAS HARDLY USED AT ALL AND NOW MOTOR IS BROKEN AND WINDOW WILL NOT WORK. *TR",
        "vin": "3N1CB51D45L"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/30/2010",
        "dateOfIncident": "06/09/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10340768,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 NISSAN SENTRA.  WHILE REFUELING THE VEHICLE GAS BEGAN TO SPILL OUT OF THE FUEL TANK.  THE FAILURE RECURS WHENEVER THE VEHICLE GET REFUELED.  THE MANUFACTURER WAS NOTIFIED AND INFORMED THE CONTACT HIS VEHICLE WAS NOT INCLUDED IN THE RECALL ASSOCIATED WITH NHTSA CAMPAIGN ID NUMBER 05V269000.  THE VEHICLE WAS NOT SERVICED.  THE FAILURE AND CURRENT MILEAGES WERE 106,000.  UPDATED 10/27/10. *LJ",
        "vin": "3N1CB51D75L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/06/2010",
        "dateOfIncident": "04/30/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10329194,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECENTLY HAD TO HAVE THE CRANK SENSOR REPLACED ON MY 2005 NISSAN SENTRA 1.8L ENGINE.  I FOUND THAT THERE WAS A RECALL FOR THE 2005 SENTRA 2.5 L ENGINE, BUT NOT THE 1.8L ENGINES.  I FEEL THAT THERE SHOULD BE A RECALL IN THIS CASE, BECAUSE MY CAR SHUT DOWN MANY TIMES ON THE HIGH WAY WITH NO WARNING.  THE CAR COMPLETELY STALLED OUT AND STOPPED WORKING, AND IT'S A REAL DANGER TO THOSE ON THE ROAD. *TR",
        "vin": "3N1CB51D75L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/30/2010",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10313145,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 NISSAN SENTRA ENGINE LIGHT RECALL.  ON*CW   THE CONSUMER STATED IT TOOK SIX MONTHS FOR THE PART TO ARRIVE. THE DEALER CLAIMED THE PROBLEM WAS FIXED. HOWEVER, THE CONSUMER CONTINUES TO EXPERIENCE PROBLEMS WITH THE ENGINE LIGHT ILLUMINATING.  THE CONSUMER STATED THE VEHICLE FAILED EMISSIONS DUE TO THE RECALL PROBLEM NOT BEING RESOLVED. *JB",
        "vin": "3N1CB51D45L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/08/2010",
        "dateOfIncident": "03/24/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10324479,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CHECK ENGINE LIGHT FIRST CAME ON AND I NOTICED I WAS HAVING TO PUT COOLANT AND/OR WATER IN THE RADIATOR EVERY FEW DAYS.  I WAS ONLINE AND READ A FORUM WITH ABOUT 25-30 OTHER PEOPLE COMPLAINING ABOUT THE SAME ISSUES I WAS HAVING AND THEY ALL TURNED OUT TO BE THE HEAD GASKETS.  PEOPLE HAVE SAID THEY FILED COMPLAINTS WITH NISSAN BUT NOTHING WAS DONE.  ALL THE VEHICLES HAD MILEAGE OF 60,000-80,000 AND THAT IS NOT NEARLY ENOUGH MILEAGE FOR US TO BE HAVING THIS PROBLEM.  I JUST DON'T THINK ITS A COINCIDENCE THAT WE ARE ALL HAVING THE SAME PROBLEM WITH THE SAME PART.  I CHANGED OUT THE THERMOSTAT, WATER PUMP, AND HAD EVERYTHING CHECKED AND AM STILL HAVING THIS PROBLEM SO I'VE DETERMINED IT HAS TO BE THE HEAD GASKET, LIKE THE MANY OTHERS. I HAVE NOT FIXED THE HEAD GASKET YET AS I'M STILL SAVING MONEY FOR IT.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/29/2010",
        "dateOfIncident": "02/06/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10322689,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).    MY CAR (2005 NISSAN SENTRA 1.8L ENGINE) BEGAN OVERHEATING TERRIBLY IN FEBRUARY OF 2010.  I BROUGHT IT INTO A MECHANIC, WHO HAD TROUBLE DIAGNOSING THE PROBLEM.  WHEN I BROUGHT IT INTO A NISSAN DEALERSHIP, THEY ADVISED THAT IT WAS A BROKEN HEADGASKET.  I FOUND NUMEROUS OTHER COMPLAINTS ON THE WEBSITE HTTP://WWW.CARCOMPLAINTS.COM/NISSAN/SENTRA/2005/ENGINE/BLOWN_HEAD_GASKET.SHTML.  I DECIDED TO SEND THOSE INTO NISSAN AND ASKED THEM TO LOOK INTO THE ISSUE AND DO A RECALL.  I FEEL THAT THIS IS A SAFETY PROBLEM- ESPECIALLY SINCE IT SEEMS LIKE THE PROBLEM HAPPENED OVERNIGHT.  HAD I NOT BEEN PAYING ATTENTION TO THE SIGNALS ON MY CAR, I WOULD NOT HAVE KNOWN THAT MY CAR WAS OVERHEATING SO BADLY AND IT COULD HAVE CAUSED A FIRE.  I ENDED UP PAYING $911.00 TO FIX THE CAR.  I SENT A LETTER INTO NISSAN AND WAS CONSIDERED FOR REIMBURSEMENT BUT THEY ULTIMATELY DENIED MY CLAIM.    I REALLY FEEL THAT A RECALL SHOULD BE DONE IN THIS CASE.  I'VE INVESTIGATED THIS SITUATION AND FOUND THAT IT'S QUITE COMMON FOR THE HEADGASKETS ON THIS CAR TO FAIL.  PLEASE LOOK INTO THIS FOR ME.  [XXX]  *TR",
        "vin": "3N1CB51D75L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/24/2010",
        "dateOfIncident": "03/15/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10321811,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2005 NISSAN SENTRA (VIN #[XXX] ) THAT HAS BLOWN A HEAD GASKET AT 65,000 MILES.  ON MARCH 15 I NOTICED MY CAR HAD TROUBLE STARTING, ENGINE WOULD TURN OVER BUT NOT CATCH.  IT DID START, HOWEVER, SO I DROVE HOME, CALLED A MECH AND SCHEDULED AN APPT FOR THE 17TH.  ON THE 16TH MY CAR WOULD NOT START AND HAD TO BE TOWED TO THE MECH.  THIS MECH RAN DIAGNOSTICS AND DISCOVERED A BLOWN HEAD GASKET.  ASKED ME WHAT OTHER SYMPTOMS I HAD BEEN HAVING..THERE WERE NONE.  I THEN HAD THE CAR TOWED TO ANOTHER MECHANIC -- FOR A SECOND OPINION -- SINCE MY 1ST MECHANIC WAS SURPRISED AND A BIT SHOCKED THAT THE HEAD GASKET WOULD GO BAD THIS EARLY IN THE LIFE OF MY CAR.  THE 2ND MECHANIC DIAGNOSED THE SAMETHING AND WAS ALSO SHOCKED IT WAS THE HEAD GASKET SINCE HEAD GASKETS NORMALLY LAST WELL OVER 100,000 MILES.  I CALLED THE LOCAL NISSAN DEALERSHIP AND WAS TOLD A) THAT THE HEAD GASKET IS ONLY COVERED UNDER WARRANTY UP TO 60,000 MILES AND B) THAT HAD I TAKEN BETTER CARE OF MY CAR, THIS WOULD NOT HAVE HAPPENED.  I DO TAKE EXCELLENT CARE OF MY CAR.. I'M ACTUALLY A BIT ANAL ABOUT GETTING THE RECOMMENDED OIL CHANGES AND HAVE THE RECORDS TO PROVE IT.  TOLD HIM THIS AND ESSENTIALLY HE BLEW ME OFF.  INTERESTINGLY, HE WAS THE ONLY ONE NOT SURPRISED THAT THE HEAD GASKET HAD BLOWN.  IN MY RESEARCH SINCE THEN, I HAVE DISCOVERED THAT THE #1 COMPLAINT FOR THE 2005 NISSAN SENTRA IS A BLOWN HEAD GASKET BETWEEN 65,000 AND 75,000 MILES.  IT WOULD APPEAR TO ME THAT NISSAN KNEW THEY USED A DEFECTIVE PART BUT 'COVERED THEMSELVES' BY ONLY COVERING IT UP TO 60,000 MILES. THEY ADMITTED THAT THEIR OTHER 'MODELS' DO NOT HAVE THIS PROBLEM (THOUGH I DID NOT GET THIS IN WRITING) AND ACTUALLY TRIED TO SELL ME ANOTHER NISSAN.   WHILE THIS WAS NOT DANGEROUS TO ME, AS IT HAPPENED IN THE SAFETY OF MY GARAGE, HAD IT HAPPENED ON THE ROAD IT COULD HAVE HAD A MUCH DIFFERENT OUTCOME.  I'M OUT LOTS OF MONEY (APPROX $1,200) AND AFTER A WEEK STILL DO NOT HAVE A RUNNING CAR.  INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *TR",
        "vin": "3N1CB51D35L"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/03/2010",
        "dateOfIncident": "02/03/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10304969,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR HAS HAD PROBLEMS WITH THE GAS TANK AND FUEL PUMP LINE.  I JUST RECENTLY PAID A LARGE AMOUNT OF MONEY IN JANUARY OF 2010 TO GET A NEW GAS TANK PUT IN THE CAR BECAUSE THE GAS TANK WOULD REJECT GAS WHEN I WOULD PUMP GAS CAUSING GAS TO OVER FLOOD ONTO THE GROUND WHICH IS DANGEROUS. I WENT TO A NON NISSAN DEALERSHIP AND I CAN'T AFFORD TO KEEP GOING PLACES TO FIX THE PROBLEM THAT IS NOT MY FAULT. HOWEVER, THE CHECK ENGINE LIGHT IS STILL ON IN MY CAR.  I HAVE BEEN TO NISSAN DEALERS IN INDIANAPOLIS, INDIANA AND THEY TOLD ME THAT THEY WILL NOT FIX THE PROBLEM. I NEED THE CAR FIXED AT A NISSAN DEALERSHIP THAT WILL NOT TURN ME AWAY. I PURCHASED THE CAR IN 2005 AND SHORTLY AFTER THAT, I HAD TO GET THE FUEL PUMP LINE FIXED. I REALLY NEED SOME HELP AND GUIDANCE.  TIMES ARE TOO TOUGH TO BE REPEATEDLY TURNED AWAY.  I AM AFRAID THAT SOMETHING VITAL MIGHT HAPPEN IF THE PROBLEM CONTINUES TO BE IGNORED BECAUSE GAS ISSUES CAN BE DANGEROUS. I HAVE FOUND RECALLS ON MY MAKE AND MODEL AND I NEED SOMEONE TO ACKNOWLEDGE THESE RECALLS.  I WAS TOLD IN THE PAST YEARS THAT MY NISSAN DID NOT HAVE ANY RECALLS AND I WAS GIVEN FALSE INFORMATION. *TR",
        "vin": "3N1CB51D45L"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/30/2009",
        "dateOfIncident": "05/16/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10297561,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "SUDDENLY COULD NOT FILL GAS TANK, DUE TO THE FUEL BACKING UP INTO THE HOSE. CAUSING THE GAS HOSE TO CLICK OFF, AS IF THE TANK WAS FULL. RESEARCHED PROBLEM ON INTERNET, FOUND RECALL FOR 2005  NISSAN SENTRA VEHICLES WHICH WAS IN REGARDS TO THE FUEL SYSTEM-HARD START/LONG CRANK TIME. CALLED NISSAN NORTHAMERICA AND WAS TOLD MY VIN WAS NOT INCLUDED IN THIS RECALL??? TOLD TO TAKE VEHICLE TO NISSAN DEALER FOR DIAGNOSTIC REPORT. PAID 100.00 FOR THIS DEALER TO TELL ME THE PROBLEM WAS THE E-VAC CANISTER AND NOT THE RECALL PART. SHOWED DEALER THE DETAILS OF THE RECALL WHICH INCLUDED THE E-VAC CANISTER  BEING REPLACED THEN THE FUEL TANK. DEALER SAID IT DID NOT FALL WITHIN THE SPECTS OF THE RECALL, SO THEY WOULD NOT FIX IT.  I MENTIONED THAT IT WAS THE FIST STEP OF THE OVER ALL REPAIR OF THE RECALL. WAS TOLD THAT DOES NOT MATTER.  I HAVE IN FRONT OF ME A REPORT THAT STATES ALL 2005 VIN NUMBERS ARE PART OF THIS RECALL. YET I CANNOT GET NISSAN TO EVEN ACKNOWLEDGE THIS PROBLEM. I AM AGAIN TOLD TO TAKE THE VEHICLE TO THE DEALERSHIP, (BECAUSE OVER 30 DAYS HAVE GONE BY SINCE THE LAST TIME I HAD IT DIAGNOSED BY A NISSAN DEALER) AND HAVE IT DIAGNOSED AGAIN (PAY 100.00) SO THAT I CAN AGAIN BE TOLD THAT THE E-VAP CANISTER IS DEFECTIVE, ONLY THEN WILL THE REPRESENTATIVE AT THE NISSAN NORTHAMERICA CUSTOMER SERVICE DEPARTMENT REFER THE COMPLAINT TO AND ELEVATED LEVEL TO HAVE A MORE TECHNICAL CUSTOMER SERVICE DEPARTMENT INDIVIDUAL LOOK INTO THE PROBLEM. (OH AND I CAN REQUEST MY 100.00 BACK. BUT IT DOESN'T MEAN I WILL GET IT BACK!!)  SO THE VEHICLE REMAINS DEFECTIVE. GUESS IT IS TIME TO CONTACT THE MASSACHUSETTS ATTORNEY GENERALS OFFICE ABOUT NISSAN'S KNOWING NEGLIGENCE FOR THE SAFETY OF EVERY PERSON THAT MIGHT BE NEAR THIS VEHICLE IF IT EXPLODES WHILE I AM TRYING TO FILL THE GAS TANK! *TR",
        "vin": "3N1CB51D45L"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "11/23/2009",
        "dateOfIncident": "11/09/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10293237,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER SIDE SUN VISOR IN MY 2005 NISSAN SENTRA SE-R WAS ALWAYS HANGING DOWN ABOUT AN INCH LOWER THAN DRIVER'S SIDE. THE PASSENGER SIDE SUN VISOR BECAME COMPLETELY LOOSE AND IS NOW DANGLING TO WHERE I HAVE ISSUES SEEING TOWARDS THE RIGHT TO SEE IF IT IS SAFE TO MAKE A TURN. MULTIPLE ISSUES WITH SUN VISORS AND NISSAN FROM AN INTERNET SEARCH. *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/16/2009",
        "dateOfIncident": "05/02/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10288690,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 NISSAN SENTRA.  WHEN FUELING THE GAS TANK, EXCESS FUEL SPILLS ONTO THE GROUND. FUEL LEAKAGE, IN THE PRESENCE OF AN IGNITION SOURCE, COULD RESULT IN A FIRE. THE DEALER WAS CONTACTED IN REFERENCE TO RECALL# 05V269000 ((FUEL SYSTEM, GASOLINE:STORAGE).  SINCE HIS VEHICLE IDENTIFICATION NUMBER WAS EXCLUDED FROM THE RECALL HE WOULD HAVE TO PAY $400.00 FOR A REMEDY. NO REPAIRS WERE MADE. THE FAILURE MILEAGE WAS 70,000.  THE CURRENT MILEAGE WAS UNAVAILABLE.            UPDATED 12/9/09 *CN  UPDATED 12/10/09.*JB",
        "vin": "3N1CB51D65L"
    },
    {
        "components": "EQUIPMENT ADAPTIVE/MOBILITY",
        "crash": false,
        "dateComplaintFiled": "09/30/2009",
        "dateOfIncident": "08/10/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10285786,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2005 NISSAN SENTRA, AND MY FLOOR MAT KEEPS COMING OFF THE J HOOKS AND GATHERING UP BY THE GAS PEDAL. *TR",
        "vin": "3N1CB51D75L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/14/2009",
        "dateOfIncident": "04/21/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10283933,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY 2005 NISSAN SENTRA WHEN IT STARTED RUNNING ROUGHLY THEN THE CHECK ENGINE LIGHT CAME ON. THE NEXT DAY IT RAN FINE THE ENGINE LIGHT WAS OFF. SOMEONE TOLD ME TO HAVE THE SPARK PLUGS REPLACED SO I DID THAT. THE CAR WAS FINE FOR ABOUT TWO WEEKS. THEN THE SAME THING STARTED HAPPENING AGAIN AND THIS TIME IT WAS WORSE IT WAS RUNNING ROUGHER AND SMOKE WAS COMING OUT OF THE TAILPIPE AND IT WAS LOUD. I TOOK IT TO THE DEALERSHIP THEY HAD IT FOR 2 HOURS AND TOLD ME THAT MY HEAD GASKET HAD FAILED AND THEY COULD NOT GIVE ME AN EXPLANATION AS TO WHY THAT HAD HAPPENED. IT WAS COVERED UNDER THE REMAINING POWERTRAIN WARRANTY. AFTER THAT I HAD DONE SOME RESEARCH AND FOUND THAT THIS IS HAPPENING TO A LOT OF OTHER PEOPLE. THE REASON THAT I AM MAKING THIS COMPLAINT IS THAT MY VEHICLE IS OUT OF WARRANTY AUGUST 2010 AND THE TOTAL COST TO REPLACE THE HEAD GASKET IN MY VEHICLE IS ALMOST 2000.00 DOLLARS. I THINK NISSAN SHOULD ADDRESS THIS PROBLEM AND REPLACE WHAT EVER PARTS REQUIRED TO MAKE SURE THIS PROBLEM NEVER HAPPENS AGAIN. *TR",
        "vin": "3N1CB51D15L"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/03/2009",
        "dateOfIncident": "03/02/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10260542,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 NISSAN SENTRA.  THE CONTACT RECEIVED A RECALL NOTICE FOR NHTSA CAMPAIGN ID NUMBER 05V269000 (FUEL SYSTEM, GASOLINE:STORAGE).  SHE TOOK THE VEHICLE TO THE DEALER TO HAVE THE FUEL LEAK INSPECTED.  THEY CHECKED THE VAPOR HOSE CONNECTIONS IN THE FUEL TANK AND DETERMINED THAT THERE WAS NO FUEL LEAK.  CURRENTLY, THE VEHICLE IS LEAKING FUEL.  THE VEHICLE WAS TAKEN BACK TO THE DEALER AND THEY STATED THAT THE NISSAN MANUFACTURER WOULD NOT HONOR THE RECALL TO INSTALL A NEW FUEL TANK FOR FREE.  THE FAILURE MILEAGE WAS 65,000.",
        "vin": "3N1CB51D75L"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/02/2009",
        "dateOfIncident": "01/30/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10257162,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HORN STOPPED WORKING ON THIS PAST SATURDAY, JANUARY 30, 2009 - AGAIN. THIS MUST BE THE SIXTH TIME I HAD THE HORN NOT WORKING. I HAVE BROUGHT IT IN TO THE DEALER ENDLESS TIMES BECAUSE THE HORNS ARE COMPLETELY DEFECTIVE. I HAVE OWNED CARS MY ENTIRE LIFE AND NEVER HAD THIS TROUBLE WITH A CAR IN MY ENTIRE LIFE. *TR",
        "vin": "3N1CB51D45L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/13/2009",
        "dateOfIncident": "04/21/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10254831,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 NISSAN SENTRA 1.8 HEAD GASKET FAILURE - CAR OVERHEATED ON HIGHWAY, ANTIFREEZE LEAKING IN ENGINE COMPARTMENT.  HAD CAR TOWED TO NISSAN DEALERSHIP AND CONFIRMED HEAD GASKET FAILURE.  BOUGHT VEHICLE NEW, LESS THAN 36 MONTHS OF OWNERSHIP, BUT 76K MILES.  ATTEMPTED TO WORK THROUGH CUSTOMER RELATIONS AT NISSAN TO RECOVER A PORTION OF THE REPAIR EXPENSE AS GOOD WILL, BUT WAS DENIED. *TR",
        "vin": "3N1CB51D95L"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/09/2009",
        "dateOfIncident": "12/10/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10254362,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "NISSAN REFUSES TO FOLLOW THROUGH ON THEIR RECALL, NHTSA CAMPAIGN ID NUMBER 07V527000.  ON 12/10/08 I WAS DRIVING MY 2005 NISSAN SENTRA ON THE HIGHWAY, JUST CRUISING, NOT ACCELERATING OR DECELERATING, WHEN SUDDENLY MY ENGINE HAD A STRONG PULL BACK, AND THE CHECK ENGINE LIGHT CAME ON.  2 DAYS LATER I BROUGHT MY VEHICLE TO AUTOZONE FOR A FREE DIAGNOSTICS, AND THEY PRINTED ME A REPORT THAT LISTED THAT THERE WAS A PROBLEM WITH THE CRANKSHAFT POSITION SENSOR.  I LOOKED HERE ON NHTSA FOR RECALLS, AND FOUND THERE WAS ONE DIRECTLY DEALING WITH MY PROBLEM.  THE RECALL CLEARLY STATES \"DEALERS WILL REPROGRAM THE ECM FREE OF CHARGE.\"  WHEN I BROUGHT MY VEHICLE TO THE DEALERSHIP, THEY SAID THEY CANNOT REPROGRAM THE ECM BECAUSE MY CHECK ENGINE LIGHT IS ON.  FIRST, IT DOES NOT MENTION THAT IN THE RECALL.  SECOND, MY CHECK ENGINE LIGHT IS ON BECAUSE OF THE CRANKSHAFT SENSOR, WHICH IT ALSO STATES IN THE RECALL SUMMARY \"THE CRANKSHAFT POSITION SENSOR CAN OVERHEAT CAUSING A BRIEF INTERRUPTION IN THE SIGNAL OUTPUT FROM THE SENSOR.\"  SO SINCE THEN, I HAVE BEEN ON THE PHONE NUMEROUS TIMES WITH THE REGIONAL MANAGER, WHO FINALLY TODAY, 1/9/09, TOLD ME I NEED TO PAY $95 FOR A DIAGNOSTICS AT A NISSAN DEALERSHIP, FOR THEM TO CONSIDER REPLACING THE ACKNOWLEDGED FAULTY SENSOR, AND DO THE REPROGRAMMING.  WHICH, SHE ADMITTED, THEY WILL MOST LIKELY NOT DO UNDER \"GOOD WILL\".  SO I SIMPLY ASKED THE MANAGER, DO YOU UNDERSTAND HOW \"INSANE\" THAT IS THAT YOU ARE TELLING ME THAT I HAVE TO PAY $95 FOR A DIAGNOSTICS THAT I ALREADY HAVE, TO GET NISSAN TO CONSIDER FIXING THE FAULTY PART WHICH THEY MOST LIKELY WILL NOT DO.  THE MANAGER SAID, \"YES, THAT IS 'INSANE', BUT THAT IS POLICY AND PROCEDURE.\"  IF I AM NOT WILLING TO GET THE DIAGNOSTICS DONE AT NISSAN, THERE IS NOTHING SHE CAN DO FOR ME, AND MY FILE IS CLOSED.  SO, IN THE END, NISSAN WILL NOT PERFORM THEIR RECALL NOR FIX THE PART THEY ACKNOWLEDGE IS FAULTY IN THE RECALL. *TR",
        "vin": "3N1AB51A75L"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/03/2009",
        "dateOfIncident": "01/03/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10253665,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON THE HIGHWAY. ENGINE CHECK LIGHT CAME ON. CAR WOULD ONLY DO 10 MILES PER HOUR ON A SUPERHIGHWAY - VERY VERY DANGEROUS. I WAS ABLE TO DRIVE 2 MILES THIS WAY ON VERY SIDE OF ROAD TO SIDE ROAD WHERE I PARKED. WHEN I STARTED IT UP AGAIN IT DROVE NORMALLY. THIS CHECK ENGINE LIGHT IS VERY DANGEROUS. I SEE THERE IS A LOT OF TROUBLE WITH NISSAN SENTRAS. ALOT OF TROUBLE. IT IS TIME FOR THIS GOVT AGENCY TO START WORKING FOR CONSUMERS AND STOP BEING FRONT MEN FOR CAR COMPANIES. THE CAR ONLY HAS 57000 MILES ON IT. I WAS SCARED OUT OF MY MIND AND VERY FRIGHTENED. I AM 73 YEARS OLD. *TR",
        "vin": "3N1CB51D45L"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/28/2008",
        "dateOfIncident": "02/15/2007",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10250049,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 NISSAN SENTRA.  THE CONTACT NOTICED THAT THE FUEL PUMP WOULD SUCK THE FUEL BACK INTO THE TANK INSTEAD OF MAINTAINING PRESSURE IN THE FUEL INJECTORS.  HE WOULD ATTEMPT TO START THE VEHICLE, BUT WAS UNSUCCESSFUL BECAUSE GASOLINE WAS IN THE TANK.  THE ISSUE OCCURRED MANY TIMES IN THE PREVIOUS YEAR.  THE CONTACT HAD TO REPLACE TWO SET OF SPARK PLUGS.  THE DEALER CHARGED $100 FOR A DIAGNOSIS AND THEN INFORMED HIM OF THE FUEL PUMP ISSUE.  THE MANUFACTURER DID NOT ASSIST.  THE CONTACT STATED THAT HIS EXTENDED WARRANTY DID NOT COVER THE FAILURE AND HE WOULD HAVE TO PAY OUT OF POCKET FOR A COMPLETELY NEW FUEL PUMP.  THE CURRENT MILEAGE WAS APPROXIMATELY 43,000 AND FAILURE MILEAGE WAS 21,582. UPDATED 12/22/08.  *LJ  UPDATED 12/23/08. *JB",
        "vin": "3N1CB51D25L"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/04/2008",
        "dateOfIncident": "08/28/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10247678,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2005 NISSAN SENTRA.  ENGINE SERVICE LIGHT CAME ON AND WITHIN A WEEK I WAS UNABLE TO PUMP GAS INTO MY TANK AT A NORMAL PACE. ONLY ABLE TO PUT IN A LITTLE AT A TIME WITHOUT GAS SHOOTING BACK OUT OF THE TANK.  WITHIN A COUPLE OF WEEKS, I WAS UNABLE TO START MY CAR.  I WAS TOLD THAT THE VENT CONTROL VALVE WAS MALFUNCTIONING AND THAT IT WOULD NOT EFFECT THE RUNNING OF MY CAR, BUT NOW I AM $500 LOOKING A NEW FUEL PUMP.  I HAVE NOTICED ONLINE MULTIPLE COMPLAINTS FROM OTHER NISSAN OWNERS WITH THE SAME PROBLEMS.  IS SOMEONE LOOKING INTO THE ON GOING PROBLEM?  I BOUT THIS CAR FOR THE FUEL EFFICIENCY AND THE WELL KNOWN REPUTATION OF A LONG LASTING CAR.  NOT VERY SATISFIED WHEN IT IS ONLY 3 YRS OLD!!!! *TR",
        "vin": "3N1CB51D05L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/27/2008",
        "dateOfIncident": "08/27/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10239932,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2005 NISSAN SENTRA IN APRIL 2006.  SINCE FEBRUARY 2008, I HAVE HAD THE SAME CONTINUOUS PROBLEM.  I GET IN MY CAR AND IT SIMPLY WILL NOT START.  I BOUGHT THE CAR FROM TOYOTA AND TOOK IT TO THEM TO FIX IT.  THEY WERE UNABLE TO FIX IT AND THEY SENT IT TO NISSAN.  WHEN TOYOTA TRIED TO FIX IT THEY TOLD ME IT WAS BAD GAS, THAT DIDN'T FIX THE PROBLEM, THEY THEN SAID IT WAS A STARTER, THEY PUT A STARTER ON IT, THAT DIDN'T FIX THE PROBLEM.  WHEN NISSAN GOT IT, THEY FIXED SOMETHING, I REALLY DON'T REMEMBER AT THIS POINT.  A FEW MONTHS LATER, THE CART WOULDN'T START AGAIN, TOOK IT BACK TO NISSAN, THEY SAID IT WAS A HEAD GASKET, THEY FIXED IT.  SATURDAY WHEN TO GET IN MY CAR, IT WOULDN'T START.  IT EVENTUALLY STARTED LATER ON THAT DAY.  BEEN DRIVING THE CAR.  THIS MORNING (4 DAYS LATER) CAR WILL NOT START.  I AM AT MY WITS END.  I BOUGHT A NEW CAR BECAUSE MY OLD CAR WAS UNRELIABLE.  NOW MY NEW CAR IS JUST AS UNRELIABLE.  BOUGHT A NISSAN BECAUSE SUPPOSEDLY IT IS A REALLY GOOD CAR.  SO FAR, NOT CONVINCED.  I NOW HAVE TO PAY TO HAVE THE CAR FIXED BECAUSE IT NOT UNDER WARRANTY ANY LONGER.  I AM REALLY GOING TO HAVE TO HAVE A HEART TO HEART TALK WITH NISSAN REGARDING THIS CONTINUOUS PROBLEM. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/08/2008",
        "dateOfIncident": "04/18/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10237422,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THERMOSTAT FROZE SHUT CAUSING CAR TO OVERHEAT AND BLOW THE HEAD GASKET. LUCKILY I CAUGHT IT BEFORE IT WAS TO LATE. IM ALSO A MECHANIC. I HAD A LOSE OF HEAT IN THE CAR SO I KNEW WHAT IT WAS. THIS SHOULD NOT BE HAPPENING TO A CAR WITH 67K MILES. I HAD TO PAY 900.00 FOR NISSAN TO FIX IT AS I WAS IN THE MIDDLE OF A MOVE AND DIDN'T HAVE ACCESS TO MY TOOLS. ALL OF THESE LISTINGS WITH SEVER ENGINE TROUBLE IS CAUSED BY THIS OVERHEAT ISSUE.  THE THERMOSTAT IS DEFECTIVE IN MANY SENTRAS, THEN OTHER DAMAGE OCCURS. THIS WILL BE THE LAST NISSAN I BUY. IN THE BEGINNING NISSAN TOLD ME THEY WOULD COVER THIS, THEN AFTER THE FACT THEY WOULD NOT.  ALSO THE FUEL PUMP HAS ALWAYS BEEN WEAK AND NOW NEEDS REPLACEMENT (SAME MILEAGE) AND THE CD PLAYER QUITE WORKING. THEY KNEW WHAT THEY WERE DOING WITH LIMITING THE WARRANTY TO 60K.  *TR",
        "vin": "3N1CB51D05L"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/01/2008",
        "dateOfIncident": "07/25/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10236682,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "SES ERROR P1446 - DEFECTIVE EVAP CANISTER VENT CONTROL VALVE (HTTP://NISSAN.JUSTANSWER.COM/UPLOADS/RMILLERPHD/2008-06-15_175622_AFINAL.PDF) FROM WHAT I HAVE BEEN TREADING ONLINE MANY PEOPLE HAVE HAD PROBLEMS WITH NISSAN AND THEIR EVAP VALVE AND IT GETTING STUCK OPEN OR CLOSED WHICH CAUSES A VERY SERIOUS SAFETY HAZARD BUT NISSAN IS DOING NOTHING ABOUT THIS. I RECENTLY GOT THIS SES CODE AND LOOKED IT UP ONLINE AND FOUND A SLEW OF PEOPLE POINTING DIRECTLY TO THE PROBLEM WITH THE VALVE AND IT GETTING GUNKED UP OR STUCK.  MINE IS A 2005 NISSAN SENTRA 1.8L BUT I HAVE SEEN THIS PROBLEM REPORTED ON A WIDE RANGE OR NISSAN MODELS. PLEASE LOOK INTO THIS PROBLEM BEFORE SOMEBODY GETS HURT BUT NISSAN'S NEGLECT.  *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/18/2008",
        "dateOfIncident": "11/01/2007",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10234783,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 NISSAN SENTRA.  THE ENGINE LIGHT ILLUMINATED ON THE INSTRUMENT PANEL AND THE CONTACT WAITED BEFORE TAKING THE VEHICLE TO AUTOZONE.  SHE WAS INFORMED THAT ONE OF HER CONTROL VALVES HAD CLOSED.  SHE ATTEMPTED TO HAVE THE VEHICLE DIAGNOSED BY THE DEALER, BUT THEY WERE UNABLE TO PERFORM AN INSPECTION.  THROUGHOUT THIS PROCESS, THE CONTACT WENT TO FILL UP THE VEHICLE WITH GASOLINE, BUT THE PUMP KEPT CLICKING AND INDICATED THAT THE TANK WAS FULL.  THE CLICKING WOULD OCCUR EVERY FEW SECONDS.  THE CONTACT WAS UNSURE IF THE FAILURE WAS DUE TO THE VEHICLE OR THE ACTUAL GASOLINE PUMP.  THE CONTACT SMELLED A STRONG SMELL OF GASOLINE INSIDE THE PASSENGER COMPARTMENT, AND WENT ONLINE TO RESEARCH POSSIBLE DEFECTS.  SHE DISCOVERED NHTSA CAMPAIGN ID NUMBER 05V269000 (FUEL SYSTEM, GASOLINE:STORAGE) FOR THE SAME FAILURE; HOWEVER, THE MANUFACTURER STATED THAT HER VIN WAS NOT INCLUDED IN THE RECALL.  THE VEHICLE HAS NOT BEEN REPAIRED.  THE VIN WAS UNKNOWN.  THE FAILURE MILEAGE WAS 50,000 AND CURRENT MILEAGE WAS 58,000.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "07/13/2008",
        "dateOfIncident": "08/05/2006",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10234111,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "999R5-AR000",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "I HAD A HEAD GASKET PROBLEM AND WIRE PROBLEM BUT I ONLY HAD THE CAR FOR 19 MONTH IN BEEN IN THE SHOP MORE THAN I HAVE HAD THE CAR.  *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/30/2008",
        "dateOfIncident": "06/14/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10232773,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "SUSPENSION CONTROL ARM BUSHINGS.  *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "06/22/2008",
        "dateOfIncident": "05/30/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10231946,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SERVICE ENGINE SOON LIGHT CAME ON 3 YEARS AND 2 MONTHS AFTER THE PURCHASE OF THE 2005 NISSAN SENTRA SE-R. I NOTICED A DECREASE OF 10 MPG IN FUEL ECONOMY WITHIN 48 HOURS OF THE SERVICE ENGINE LIGHT COMING ON. I TOOK IT TO A NISSAN DEALER IN SARASOTA FLORIDA AND THEY INFORMED ME THAT IT WAS THE THROTTLE BODY SENSOR THAT WAS BAD. I ASKED IF THEY HAD THE PART IN STOCK AND THEY SAID YES. THAT MEANS THAT THIS IS A CONSISTENT PROBLEM IF NISSAN IS GOING TO HAVE THROTTLE BODY'S IN STOCK. THEY WENT TO THE COMPUTER AND NISSAN WOULD PAY FOR EVERYTHING WITH THE CUSTOMER PAYING A $100 DEDUCTIBLE. THE PART ALONE IS $180.00 AND IT IS VERY EASY TO REPLACE YOURSELF BUT THE AVERAGE PERSON WOULD END UP PAYING OVER $300 FOR A DEFECTIVE PART THAT WILL GO BAD EVERY THREE YEARS OR SO. THE MILEAGE OF THE VEHICLE AT THE TIME OF REPAIR WAS 34K MILES.  *TR",
        "vin": "3N1AB51D45L"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/17/2008",
        "dateOfIncident": "06/13/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10231377,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A RECALL ON 2005 NISSAN SENTRA'S WITH THE VAPOR RETURN HOSE AND I TOOK MY CAR TO HOVE NISSAN DEALER IN BOURBONNAIS IL AND THEY TOLD ME THAT THERE WAS NO RECALL ON MY CAR BUT WHEN I LOOK IT UP ON THE INTERNET IT IS TELLING ME THAT THERE IS A RECALL ON 2005 NISSAN SENTRA WITH THE SAME PROBLEM THAT I AM HAVING WITH MINE I ALSO TOOK MY CAR TO BE DIAGNOSED AT THE DEALERSHIP AND THEY TOLD ME THE SAME THING THAT MY VAPOR HOSE IS IN NEED OF REPAIR. MY CAR IS NOT ALLOWING ME TO PUT GAS IN MY CAR AND I AM LOOSING GAS AND RUNNING OUT OF GAS, I ALSO UNDERSTAND THAT THE ENGINE CAN ALSO IGNITE IN A FIRE.  *TR",
        "vin": "3N1CB51D95L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/27/2008",
        "dateOfIncident": "01/26/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10219332,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE  62,861 MILES.  ALL REGULAR MAINTENANCE HAS BEEN PERFORMED.  JANUARY 26, 2008 I DROVE VEHICLE 25 MILES FROM MY HOME.  THE CAR SAT FOR 4 HOURS.  ON RESTART GOT NO HEAT. TEMPERATURE GAUGE IN THE NORMAL RANGE.  DROVE 10 MILES WHEN THE HEAT GAUGE SPIKED HIGH, STOPPED.  ENGINE TEMP BACK TO NORMAL, AND I SHUT THE ENGINE OFF.  OPENED HOOD NO STEAM VISIBLE.  EASED RADIATOR CAP OFF, COULD SEE COOLANT IN RADIATOR STARTED ENGINE BACK UP TO SEE WHERE THE WATER LEVEL WOULD DROP TOO.  ADDED  4 OZ. NO STEAM COMING FROM ENGINE OR RADIATOR. SERVICE SOON LIGHT NOW LIT.  ENGINE RAN SMOOTHLY.  TRIED TO DETERMINE WHAT WAS WRONG.  SUSPECTED NO WATER FLOW THROUGH HEATER.  DETERMINED WATER FLOW OUT OF THE RADIATOR, NO STEAM, HAD A SERVICE SOON LIGHT, AND ENGINE HAD A SLIGHT MISS AT STARTUP THAT CLEARED AFTER A FEW SECONDS OF RUNNING.  I TOOK THE NISSAN TO BREEDEN'S AUTO REPAIR.  BREEDEN'S DETERMINED ENGINE HAD A BLOWN HEAD GASKET, AND A MISS IN NO. 2 CYLINDER.  THE NISSAN'S ENGINE WAS REPAIRED.  BREEDEN'S MECHANICS TOLD ME THE FOLLOWING: NISSAN HAD 4 OR 5 (SERVICE) NOTICES ON FAILED HEAD GASKET WITH CYLINDER NUMBER 2 MISS FOR THE 2005 1.8 SENTRA, HOWEVER NO RECALL EXISTS; ENGINE COOLANT AND RADIATOR WERE CLEAN; NEW TYPE HEAD BOLTS WERE REQUIRED WITH THE GASKET REPLACEMENT AND REQUIRED 60 FOOT-POUNDS OF TORQUE; THAT WHEN REMOVING THE HEAD THEY FOUND THE REAR BOLTS TO BE MUCH LOOSER THAN THE FRONT BOLTS (NOT THE REQUIRED TORQUE); AND THEY FOUND NO OTHER REASON TO EXPLAIN HEAD GASKET FAILURE.  THE 1.8 NISSAN ENGINE HEAD GASKET SHOULD NOT FAIL ON A WELL MAINTAINED, NON-ABUSED ENGINE WITH 62K MILES.  I BELIEVE NISSAN HAD INDICATIONS THAT SOME OF THEIR 1.8 ENGINES HAD A PROBLEM BLOWING HEAD GASKETS BECAUSE OF THE NOTICES. I SUSPECT NISSAN ATTRIBUTED THESE RECORDED FAILURES TO HEAD BOLT TORQUE, AND I WONDER WHY NO RECALL NOTICE WAS FORTHCOMING.    NISSAN GAVE A NEGATIVE RESPONSE ON FEBRUARY 28, 2008.  *TR",
        "vin": "3N1CB51D15L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/13/2008",
        "dateOfIncident": "09/15/2007",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10217927,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY 2005 NISSAN SENTRA IN DECEMBER 2005. IN SEPTEMBER 2007, I BEGAN NOTICING THAT MY CAR WAS OVERHEATING. IN ADDITION TO MY CAR OVERHEATING, THE HEAT STOPPED WORKING. I DO NOT HAVE VERY MUCH MONEY AND MY WARRANTY HAS ALREADY EXPIRED SO I HAD A FAMILY MECHANIC LOOK AT THE CAR. I HAD THE WATER-PUMP REPLACED, THE RADIATOR FLUSHED, THE HEATING AND COOLING SENSOR REPLACED, BELTS AND HOSES REPLACED. AFTER HAVING SO MANY THINGS DONE TO MY CAR, THE PROBLEM WAS STILL NOT SOLVED. I THEN DECIDED TO TAKE IT TO A REPAIR SHOP. THE REPAIR SHOP FLUSHED OUT MY RADIATOR. WHEN I PICKED UP THE CAR, THE HEAT WAS WORKING AND IT WAS FINE. THE REPAIR SHOP IS LITERALLY ACROSS THE STREET FROM WHERE I LIVE. BEFORE I GOT HOME, THE CAR OVERHEATED AND THE HEAT WENT OUT. I TOOK THE CAR RIGHT BACK TO THE REPAIR SHOP AND THE MECHANIC TOLD ME THAT I MUST HAVE A HEAD GASKET PROBLEM. OK, SO I WENT BACK TO THE FAMILY MECHANIC BECAUSE THE REPAIR SHOP WANTED TO CHARGE OVER $1000 TO REPLACE THE HEAD GASKET (WHICH I DIDN'T HAVE). THE FAMILY MECHANIC REPLACED THE HEAD GASKET FOR ME THOUGH HE DIDN'T SEE HOLES OR CRACKS IN THE ORIGINAL HEAD GASKET. THIS STILL DID NOT SOLVE MY PROBLEM. I FINALLY DECIDED TO TAKE MY CAR TO THE NISSAN SERVICE DEPT. THEY TOLD ME THAT I NEEDED A RADIATOR, I PAID $560 JUST TO HAVE THEM REPLACE THE RADIATOR. WHEN I PICKED UP THE CAR, I DIDN'T MAKE IT HOME BEFORE THE CAR BEGAN TO OVERHEAT AGAIN AND THE HEAT WENT OUT. I TOOK THE CAR BACK TO NISSAN SERVICE DEPT. THIS WAS FIVE WEEKS AGO. I STILL DO NOT HAVE MY CAR. THEY ARE TELLING ME THAT I PROBABLY NEED A HEAD GASKET. I GAVE THE OK TO REPLACE THE HEAD GASKET WHICH WILL COST OVER $1500. I AM STILL AWAITING MY CAR BUT AM NOT SURE THAT THIS WILL SOLVE MY PROBLEM.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/01/2008",
        "dateOfIncident": "02/01/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10216668,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD AT LEAST 2 PREVIOUS HORNS PUT INTO MY 2005 SENTRA FOUR DOOR CAR.  THIS LATEST ONE HAS NOT BEEN IN THAT LONG AND IT DOES NOT WORK. IT GIVES A BEEP AND THEN IT IS GONE. I NEED A HORN THAT WORKS IN CONGESTED NEW JERSEY. THIS IS UNACCEPTABLE. I WASTE MY TIME GOING THERE AND I DON'T THINK THE DEALERSHIP IS DOING ANYTHING AT ALL TO CORRECT THIS ISSUE.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/16/2007",
        "dateOfIncident": "08/13/2006",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10212010,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD PROBLEMS WITH MY CAR SINCE I GOT IT. I BOUGHT IT USED AT SMITHTOWN NISSAN IN AUGUST 2006. I HAVE BEEN TOLD THAT THERE IS A PART, I BELIEVE A SENSOR, THAT NEEDS REPLACING AND I HAVE GOTTEN A CONTINUPIS RUN AROUND BOTH F ROM SMITHTOWN NISSAN AND FROM THE NISSAN DEALER IN PLATTSUBRGH, NY WHERE I GO TO SCHOOL. A LIGHT KEPT GOING ON NAS SUMMER AND WHEN I TOOK IT BACK TO NISSAN BECAUSE I HAD TO DRIVE B ACK TO SCHOOL WITH IT. THEY SAID IT WOULD BE ALRIGHT. BUT ON THE WAY TO SCHOOL THE LIGHT WENT ON AGAIN. I TOOK IT TO THE NISSAN DEALER IN PLATTSBURGH WHO SAID IT NEEDED A PART AND THEY WOULD ORDER IT AND THAT IT WOULD TAKE A FEW WEEKS. AFTER I DIDN'T HEAR FROM THEM  I CALLED AND THEY SAID THEY HAD CALLED ME BUT I DIDN'T RETURN THEIR CALL AND SO THEY RETURNED THE PART. THIS NEVER HAPPENED! THEY SAID THEY WOULD HAVE TO ORDER THE PART AGAIN AND THAT IT WOULD BE IN THE END OF DEC. WELL NOW I'M BACK IN RONKONKOMA AND OBVIOUSLY CAN'T GO BACK TO THE PLATTSBURGH NISSAN. I AM VERY WORRIED ABOUT THIS PROBLEM AS I DRIVE BACK AND FORTH FROM RONKONKOMA TO PLATTSBURGH AND I AM AFRAID THAT SOMETHING WILL HAPPEN.  *TR",
        "vin": "3N1CB51D95L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "11/25/2007",
        "dateOfIncident": "11/16/2007",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10209821,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2005 NISSAN SENTRA. I'VE HAD IT FOR A YEAR WHEN IT STARTED SQUEALING UNDER THE HOOD, IT ALSO WOULD SHAKE FOR AT LEAST 5 MINUTES EVERYTIME I STARTED IT IN THE MORNING. EVENTUALLY THE CAR WOULDN'T START AND I WAS TOLD I NEEDED A NEW ENGINE. THE GAUGES DIDN'T WARN ME OF ANY PROBLEMS BEFORE HAND. I TOOK THE CAR FOR REGULAR SERVICES, ALWAYS ON TIME FOR OIL CHANGES. THE CD PLAYER WAS ALSO REPLACED ONCE AND STILL DOESN'T WORK. THE CAR NO LONGER HAS WARRANTY AND I DON'T HAVE THE MONEY FOR A NEW ENGINE AT THIS POINT IN TIME.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/24/2007",
        "dateOfIncident": "08/23/2007",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10209814,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD ONGOING PROBLEMS WITH MY 2005 SENTRA SINCE I GOT IT. I LOOKED UP SIMILAR PROBLEMS ON THE NHTSA ODI COMPLAINT SITE AND SEE THAT MANY OTHER PEOPLE HAVE HAD THE SAME OR SIMILAR PROBLEMS.  *TR",
        "vin": "3N1CB51D95L"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "11/21/2007",
        "dateOfIncident": "11/21/2007",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10209648,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "LEMANS",
                "productModel": "CHAMPION SE",
                "productYear": "9999",
                "size": "P205/70R15",
                "type": "Tire"
            }
        ],
        "summary": "ON 10/04/07 I BOUGHT A LEMANS CHAMPION HR BL 195/690R15 88H TIRE FROM FIRESTONE COMPLETE AUTO CARE BUENA PARK. ON 11/1107 I NOTICE THE TIRE WAS FLAT I CHECK THE TIRE FOR ANY HOLE OR TEAR'S I COULD NOT FIND ANY. THE PRESSURE OF THE TIRE BEFORE I REFILLED IT WAS 19 PSI AFTER WARDS IT WAS AT 31.8 PSI.  I CHECK THE TIRE PRESSURE 10 DAY LATER ON 11/21/07 IT WAS AT 25 PSI. I TOOK IT BACK TO THE STORE TO BE REPLACED. I TOLD THEM WHAT WAS GOING ON THEY RAN SOME TEST AND COULD NOT FIND ANYTHING WRONG SO THEY DID NOT REPLACE THE TIRE. I BELIEVE THERE IS A DEFECT IN THIS TIRE.  *TR",
        "vin": "3N1CB51D45L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/20/2007",
        "dateOfIncident": "11/19/2007",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10209527,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "SQUEALING NOISE UNDER HOOD REPORTED, TOLD COULD NOT DUPLICATE NOISE.  4 MONTHS LATER RETURNED VEHICLE TO SHOP.  WAS TOLD NOISE IS COMING FROM BELTS WHOSE COATINGS ARE CRACKED BUT BELTS ARE GOOD.  COST $170 PLUS TAX TO REPLACE GOOD BELTS.  APPARENTLY THE BELTS USED ON MY 2005 SENTRA WAS DEFECTIVE.  *TR",
        "vin": "3N1CB51DX5L"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/29/2007",
        "dateOfIncident": "10/28/2007",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10207308,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I WENT TO NISSAN DENVILLE TODAY AND WS TOLD MY BRAKES ARE IN BAD SHAPE. THERE IS ONLY ABOUT 37,500 MILES ON CAR. I AM NOT HARD ON BRAKES, I AM A 72 YEAR OLD LADY WHO LETS THE CAR ROLL TO A STOP WHEN I CAN. THERE IS ABSOLUTELY NO REASON MY BRAKES SHOULD BE IN SUCH BAD SHAPE. WHAT IS GOING ON WITH NISSAN BRAKES?  *TR",
        "vin": "3N1CB51D45L"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "10/21/2007",
        "dateOfIncident": "10/19/2007",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10206417,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2005 NISSAN SENTRA, BOUGHT BRAND NEW FROM THE DEALER. I MAINTAIN THE CAR LIKE A BABY. TWO WEEKS AGO I HAD THEIR 100 POINT CHECK UP, BRAKES CHECKED, WHEEL ALIGNMENT AND ALL. ON MY WAY HOME FROM THIS SERVICE CHECKUP, THE BACK BREAKS STARTED MAKING A THUMPING NOISE, I WENT BACK TO THE DEALER YESTERDAY, WAITED THERE FOR TWO HOURS FOR THEM TO \"FIX\" THE NOISE. ON MY WAY HOME ON THIS RAINY DAY, MY CAR SKIDDED OUT OF CONTROL, WHEN I TRIED TO SLOW DOWN AS I WAS GOING ONTO AN EXIT. THE BRAKES ABSOLUTELY DID NOT WORK AND THE CAR BUMPED THE CURB AT LEAST 4 TIMES BEFORE IT FINALLY STOPPED. I TRIED APPLYING THE BRAKES WHILE THE CAR WAS GOING INSANE, BUT IT DIDN'T HELP.    THIS IS NOT THE FIRST TIME THAT THE BRAKES FAILED ON A RAINY DAY. THE OTHER TIME IT HAPPENED I WAS ACTUALLY INCHING IN TRAFFIC, THE CAR STOPPED SHORT AN INCH FROM THE CAR IN FRONT OF ME, AND ONLY BECAUSE THAT CAR MOVED FORWARD. APPARENTLY THESE BRAKES AREN'T MADE TO WORK IN THE RAIN.  *TR",
        "vin": "3N1CB51D15L"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/03/2007",
        "dateOfIncident": "08/29/2007",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10201740,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "REGARDING THE BRIDGESTONE TIRES ORIGINALLY INSTALLED ON MY CAR - THE CAR WAS PURCHASED ESSENTIALLY NEW OFF OF THE LOT IN 2005 (300 MILES). IT HAS THE ORIGINAL TIRES - BRIDGESTONE P195/60/R15. IT NOW HAS ABOUT 2000 MILES ON THE CAR. THE LEFT FRONT TIRE BLEW OUT WHILE DRIVING AND HAD TO BE REPLACED. THE TREAD AREA HAD APPARENTLY SEPARATED FROM THE SIDEWALL - A SPLIT ABOUT AN INCH LONG. THERE IS ALMOST 1/2\" OF TREAD ON THE TIRE, AND THEY APPEARED FINE UNTIL THIS APPARENT SEPARATION OF TREAD AND SIDEWALL, BUT THE TIRE COULD NOT BE REPAIRED AND I HAD TO BUY A NEW ONE.   *JB",
        "vin": "3N1CB51D65L"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/19/2007",
        "dateOfIncident": "07/14/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10196797,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2005 NISSAN SENTRA WHICH MY DAUGHTER DRIVES.  THIS CAR HAS FRONT AIRBAGS AS WELL AS SIDE AIRBAGS.  MY DAUGHTER HAD AN ACCIDENT 2 YEARS AGO.  SHE HIT THE BACK OF ANOTHER CAR.  THERE WAS $4,000 WORTH OF DAMAGE TO THE FRONT END.  I WAS CONCERNED BECAUSE THE AIRBAGS DID NOT DEPLOY.  ON SATURDAY SHE WAS DRIVING TO NY FROM VA AND WAS TRAVELING 45 MPH AND A CAR STOPPED SUDDENLY IN THE MIDDLE OF THE STREET.  SHE TRIED TO SWERVE OUT OF THE WAY, BUT ENDED UP SLAMMING INTO THE BACK OF THE OTHER CAR.  THE INSURANCE COMPANY TOTALED THE CAR YESTERDAY....AGAIN NON OF THE AIR BAGS DEPLOYED.  THERE WAS NOTHING LEFT TO THE FRONT OF THE CAR AND IT ALSO SMASHED THE DRIVERS SIDE OF THE CAR.  NO AIR BAGS DEPLOYED, FRONT OR SIDE.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/13/2007",
        "dateOfIncident": "06/04/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10193300,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS CAR HAS BEEN HORRIBLE FROM THE START. THE LATEST PROBLEM INVOLVED THE TIMING CHAIN SLIPPING AND  REQUIRING A NEW ENGINE, THIS WAS  THE 3RD ENGINE THAT HAS BEEN IN THE CAR. THE 1ST ENGINE HAD A HEAD GASKET FAILURE THAT CAUSED THE ENGINE TO BE  REPLACED.   ALSO, THERE WA S A  SECOND TRANSMISSION, THE FIRST ONE MADE NOISES WHEN SHIFTING AT CERTAIN RPMS. BE WARNED, NISSAN QUALITY HAS GONE DOWN, WAY DOWN.  *AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/08/2007",
        "dateOfIncident": "11/20/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10190188,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WE BOUGHT OUR NISSAN SENTRA 1.8S WITH 126 HORSE POWER MOTOR AND WITH AN AUTOMATIC TRANSMISSION BRAND NEW IN JANUARY 2005. AFTER THE FIRST 14000 MILES THE CAR BEGAN EXHIBITING WEAK  RESTARTING  PROBLEMS AFTER THE CAR HAD BEEN AMPLY WARMED UP AND   SAT FOR ONE  HOUR OR LONGER WITH THE MOTOR REMAINING IN THE WARM TEMPERATURE  RANGES TO SLIGHTLY ABOVE THE  COLD.  *AK",
        "vin": "3N1CB51D65L"
    },
    {
        "components": "SEATS",
        "crash": true,
        "dateComplaintFiled": "04/11/2007",
        "dateOfIncident": "02/24/2007",
        "fire": true,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10187622,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*- THE CONTACT OWNS A 2005 NISSAN SENTRA WITH A CURRENT AND FAILURE MILEAGE OF 14,000. THE CONTACT WAS STOPPED AT A LIGHT WHEN THE VEHICLE WAS REAR ENDED BY ANOTHER VEHICLE, CAUSING THE CONTACT'S VEHICLE TO HIT THE VEHICLE IN FRONT. AS A RESULT OF THE REAR END COLLISION THE DRIVER'S SEAT COLLAPSED ONTO THE REAR SEAT WHICH INJURED THE CONTACT.  SHE CALLED THE MANUFACTURER ABOUT THE DRIVER'S SEAT COLLAPSING, AND THEY SENT AN INVESTIGATOR, WHO FOUND THAT THERE WAS A POSSIBLE FAULT IN THE SEAT. WHEN NISSAN CALLED THE CONTACT ABOUT THE REPORT THEY INFORMED HER THAT THIS WAS A SAFETY FEATURE IN THE VEHICLE. THE CONTACT THEN CALLED THE LOCAL NISSAN DEALER, WHO TOLD HER THAT THIS WAS NOT A SAFETY FEATURE. THE POLICE AND FIRE DEPARTMENT CAME TO THE SCENE OF THE CRASH AND FILED REPORTS.*AK",
        "vin": "3N1CB51D75L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "03/08/2007",
        "dateOfIncident": "02/01/2007",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10184535,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN DIESEL",
                "productModel": "CLA83",
                "productYear": "1988",
                "type": "Equipment"
            }
        ],
        "summary": "I BROUGHT MY 05 NISSAN SENTRA IN MARCH 2005. I HAVE TAKEN MY CAR IN FOR REGULAR VISITS, AND EVERY TIME FOR A YEAR EVERYTHING SEEMED FINE. THEN IN APRIL OF 2006 MY CAR WOULDN'T START. I TOOK THE VEHICLE TO THE MOSSY NISSAN ON MILE OF CARS IN NATIONAL CITY (WHERE I PURCHASED THE VEHICLE) TWO AND EACH TIME THEY SAID THEY FIXED IT. THE THIRD TIME I TOOK IT BACK BECAUSE IT WOULDN'T START THEY SAID THAT I NEEDED A NEW ENGINE! AND WANTED ME TO PAY FOR IT. I WAS PREGNANT ON BED REST AND HAVING TO ARGUE WITH THE DEALERSHIP AND NISSAN CORP. THAT REGULAR MAINTENANCE NEVER REVEALED ANY PROBLEMS AND THAT IF THERE WERE PROBLEMS THEY SHOULD HAVE CAUGHT THEM. I INFORMED THAT THEY DID NOT HAVE TO HONOR THE 60 MONTH WARRANTY THAT I HAD I WOULD JUST SUE THEM. AFTER HAVING MY HUSBAND PARENTS ARGUE WITH THEM BECAUSE THE STRESS DURING MY PREGNANCY WAS JUST TOO MUCH. THEY AGREED TO PAY FOR THE NEW ENGINE. SO FAR SO GOOD FOR ALMOST ANOTHER YEAR AND NOW THE CAR'S SERVICE ENGINE SOON KEEPS COMING ON THE CAR IS AT THE DEALER TODAY FOR THE 3RD TIME. THE CAR STALLS OUT. THE SERVICE MAN JUST LEFT A MESSAGE ON MY PHONE AND IS NOW SAYING THE REASON FOR THE PROBLEM IS THE SENSOR IS OFF?! WHATEVER .. I AM GOING TO GO PICK IT UP .. IF THE PROBLEM HAPPENS AGAIN I AM GOING TO HAVE MY BOSS WHO'S SPOUSE IS A LEMON LAW ATTORNEY GET INVOLVED.   *JB",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/30/2006",
        "dateOfIncident": "05/15/2006",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10174752,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2005 NISSAN SENTRA BOUGHT IN APRIL, 2005.  IT START MAKING NOISE IN THE REAR DRUM BRAKES WHEN I PRESS THE BRAKE PEDAL. THE DRUMS IN THE REAR OF MY SENTRA ARE GRABBING AND LETTING GO AND MAKING A THUD NOISE ( I THINK IT'S THE BRAKES ANYWAY GIVEN THAT IT HAPPENS WITH THE BRAKES ON AND AT LOW SPEED FROM ABOUT 10 TO 0 MPH).  AT AROUND 10 MPH IT THUMPS - QUICKLY AND THE THUMPS ARE SPACED OUT LONGER AS THE CAR SLOWS. *JB",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/18/2006",
        "dateOfIncident": "09/18/2006",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10168522,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY 2005 SENTRA BRAND NEW IN MARCH OF 2005.  I CURRENTLY HAVE ONLY 8K MILES ON MY VEHICLE.  I'VE NOT HAD ANY ACCIDENTS OR HAD TO SLAM ON THE BRAKES.  MY CAR HAS BEEN MAKING A THUMPING NOISE FROM THE REAR END FOR ABOUT A MONTH.  I TOOK IT IN TO NISSAN TODAY AND THEY TOLD ME IT WAS MOST LIKELY MY TIRES.  I STILL INSISTED THEY CHECK IT OUT, AND THEY CONFIRMED THAT THE REAR DRUMS ARE WARPED AND I WILL NEED NEW DRUMS AND BRAKE SHOES ON THE REAR WHEELS.  WITH ONLY 8K MILES ON A BRAND NEW VEHICLE THAT IS WELL MAINTAINED, HOW IS THIS POSSIBLE?",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN,ELECTRICAL SYSTEM,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "08/30/2006",
        "dateOfIncident": "08/30/2006",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10167023,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS CAR HAS BEEN A LEMON SINCE PURCHASED. THE DRIVERS DOOR HANDLE QUIT WORKING, THE TRANSMISSION CHIRPS WHEN SHIFTING, IT IDLES ROUGH, AND IT TURNS OVER PROBABLY 40 TIMES BEFORE STARTING. DEALERSHIP STATES SINCE IT HAS 36,000 MILES ON IT THAT IT WILL COST AN ESTIMATED $1700.00 TO FIX. THIS CAR HAD PROBLEMS FROM THE DATE OF PURCHASE. BEWARE OF THE SENTRA.  *JB",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ELECTRICAL SYSTEM,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "07/13/2006",
        "dateOfIncident": "07/12/2006",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10162345,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "LOST HORN FOR THIRD TIME. A HORN IS SAFETY EQUIPMENT.  THE NISSAN SENTRA I OWN SEEMS TO BE FALLING APART AT 20,000 MILES. I HAD HORN TROUBLE, BRAKES SQUEAK LIKE MAD, WINDOWS SQUEAK WHEN UP AND DOWN - HARDLY GO UP AND DOWN, ANOTHER SAFETY ISSUE.  *JB",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/30/2006",
        "dateOfIncident": "02/03/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10161142,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE 2005 NISSAN SENTRA THAT I PURCHASED HAS CONTINUED TO STALL WHILE DRIVING OVER 6 TIMES DURING THE PAST 18 MONTHS. IT HAS BEEN IN THE SHOP 6 TIMES WITH THE COMPLAINT OF SLUGGISH AND/OR STALLING. THE DEALER HAS BEEN UNABLE TO FIX IT AND CLAIMS IT IS NOT A SAFETY ISSUE, HOWEVER, THERE IS A POTENTIAL RISK TO BE REAR-ENDED WHEN IT APPEARS I AM MOVING FORWARD AND SUDDENLY STOP! THE STALL HAS HAPPENED AS I LEAVE A SITTING POSITION EITHER GOING FORWARD OR REVERSING. THE FIRST STALL HAPPENED AFTER THE CAR WAS ONLY ONE WEEK OLD. WHEN WE CALLED TO COMPLAIN TO THE SERVICE DEPARTMENT, THEY MENTIONED THAT HAPPENS SOMETIMES WITH NEW CARS WORKING OUT THE KINKS. THE DEALERS MULTIPLE ATTEMPTS TO FIX IT HAVE BEEN UNSUCCESSFUL AND THE CAR IS CURRENTLY WITH THE DEALER-ONCE AGAIN.  *JB",
        "vin": "3N1CB51D95L"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "03/30/2006",
        "dateOfIncident": "03/29/2006",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10154228,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING ON I-95 IN S.C. AT ABOUT 75 MPH A VEHICLE I WAS PASSING ENTERED THE PASSING LANE. I SWERVED SLIGHTLY ONTO THE LEFT SHOULDER & BRAKED. THE REAR WHEELS LOCKED BEFORE THE FRONT WHEELS CAUSING THE VEHICLE TO SPIN OUT OF CONTROL & ACROSS BOTH LANES OF TRAFFIC ONTO THE RIGHT SHOULDER. THE DEALER IN SC DID NOT SEEM TO THINK THE REAR WHEELS LOCKING BEFORE THE FRONT WAS A PROBLEM. AS WE WERE LUCKY ENOUGH TO AVOID BEING STRUCK BY ANY OTHER VEHICLES THE ONLY DAMAGE WAS FLAT SPOTS ON ALL 4 TIRES WHICH CAUSED A VIBRATION PROBLEM UNTIL THEY WERE REPLACED. NONREPORTABLE CRASH, NO INJURIES AN VEHICLE COULD BE DRIVEN FROM THE SCENE- THIS TIME! *JB",
        "vin": "3N1CB51D25L"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/10/2006",
        "dateOfIncident": "01/04/2006",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10147335,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED AFTER SPILLING COFFEE ON THE AUTOMATIC TRANSMISSION GEAR SHIFT POSITION INDICATOR, THE SHIFT BUTTON STAYED DEPRESSED WHEN SHIFTING.  WHEN THE BUTTON   WAS DEPRESSED THE KEY WOULD NOT RELEASE FROM THE IGNITION.  THE VEHICLE WAS SEEN BY A DEALER, WHO SUGGESTED REPLACING THE GEAR SHIFT POSITION INDICATOR. *AK",
        "vin": "3N1CB51D05L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/19/2005",
        "dateOfIncident": "09/01/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10145637,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THE CONTACT COMPLAINED ABOUT  AN ONGOING PROBLEM WITH THE CHECK ENGINE LIGHT AND THE VEHICLE RUNNING ROUGHLY.  SHE TOOK THE VEHICLE TO THE DEALERSHIP,  WHERE THEY CHANGED THE SPARK PLUGS AND RAN A DIAGNOSTIC TEST. THE PROBLEM  RECURRED,  AND THIS TIME  THE DEALER CHANGED THE IGNITION COIL.  SHE HAD THE VEHICLE BACK  THREE DAYS WHEN THE CHECK ENGINE LIGHT CAME BACK ON  AND THE VEHICLE STARTED RUNNING ROUGHLY.  NO FURTHER REPAIRS HAVE BEEN MADE . THE DEALER NOTED ON THE CONTACT'S INVOICE THE PROBLEM WAS RELATED TO CYLINDER NUMBER THREE MISFIRING. HOWEVER, THERE WAS NO INDICATION ON EITHER SERVICE INVOICE  HOW THE CYLINDER MISFIRE WAS CORRECTED BY THE REPLACEMENT OF THE SPARK PLUGS OR THE IGNITION COIL. *AK  UPDATED 1/19/2006 - *NM",
        "vin": "3N1CB51DX5L"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "09/30/2005",
        "dateOfIncident": "07/25/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10138249,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THE CALLER SAID THAT WHILE DRIVING  45 MPH AND TRYING TO SLOW DOWN BRAKES FAILED. . WHEN HE APPLIED THE BRAKES NOTHING HAPPENED. APPLIED THE BRAKES A FEW TIMES AND  FINALLY RAN INTO THE BACK OF ANOTHER VEHICLE. CALLER SAID THE LAST TIME HE APPLIED THE BRAKES THEY LOCKED  ANDVEHICLE SKIDDED AND THAT WAS WHEN HE HIT THE OTHER VEHICLE. CALLER'S CHILD WAS INJURED. THE POLICE WAS NOT CALLED. THE CALLER SAID AFTER THE ACCIDENT THE BRAKES WORKED FINE. DEALER REPAIRED THE DAMAGE DONE IN ACCIDENT. DEALER DID NOT KNOW WHY BRAKES FAILED. MANUFACTURER HAS NOT BEEN CONTACTED YET. THE CALLER BELIEVED THE PROBLEM WAS IN THE COMPUTER.*AK",
        "vin": "3N1CB51D65L"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "08/04/2005",
        "dateOfIncident": "07/25/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131559,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR 2005 NISSAN SENTRA WAS IN AN ACCIDENT IN WHICH THE AIR BAGS WENT OFF AND A CHARGE IN THE FRONT SEAT BELT WENT OFF LOCKING THEM AND REQUIRING THAT THEY BE REPLACED.  WE WERE TOLD 7/25 THAT THERE WILL BE NO BELTS AVAILABLE IN THIS COUNTRY UNTIL 8/19-25.  I HAVE TALKED TO BOTH THE DEALER AND NISSAN CONSUMER AFFAIRS.  NISSAN SAYS THEIR ONLY RESPONSIBILITY IS TO REPLACE THE BELTS WHEN THEY CAN GET THEM. I AM GOING TO BE FORCED TO EITHER PARK THE CAR OR DRIVE WITHOUT SEAT BELT BECAUSE THEY CAN NOT PROVIDE THEM.   *NM",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/31/2005",
        "dateOfIncident": "07/26/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10130733,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "SERVICE ENGINE LIGHT CONTINUES TO TURN ON, AFTER MULTIPLE SERVICE VISITS WITH MULTIPLE MIS FIRES IN THE SYSTEM.  THE VEHICLE WILL SHAKE VERY HARD AND RAPIDLY.  THERE WERE NO ACCELERATION.  WHILE DRIVING, THE VEHICLE WILL STALL ON A GEAR WITH THE R.P.M. REFERRING ON HIGH FOR A LONG PERIOD OF TIME, ALSO WHEN GOING FROM BRAKE TO GAS OR VICE VERSA IT WILL STALL THEN ACCELERATE.  ALL THESE MALFUNCTIONS HAPPENING WITHIN A  6 MONTH. PERIOD OF PURCHASING THIS VEHICLE BRAND NEW.  VEHICLE RECENTLY SHUT OFF ON THE HIGHWAY.  WHEN BROUGHT IN FOR SERVICE THE FOLLOWING MORNING, I WAS TOLD BY THE SERVICE DEPARTMENT THE ENGINE MOTOR, CARBURETOR & THROTTLE BODY ALL NEEDED TO BE REPLACED.  THEY ALSO STATED THE VEHICLE CANNOT BE FIXED DUE TO NISSAN NOT HAVING THE PARTS.  ALL THIS HAPPENING WITHIN A 6 MONTH. PERIOD OF PURCHASING THE VEHICLE.   *NM",
        "vin": "3N1CB51D45L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/03/2005",
        "dateOfIncident": "04/16/2005",
        "fire": true,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10118949,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONSUMER STARTED THE VEHICLE AND NOTICED THAT THE CHECK ENGINE LIGHT HAD COME ON (APRIL 13, 2005).  THE VEHICLE WAS TAKEN TO THE DEALERSHIP WHERE SHE WAS INFORMED THAT A REPLACEMENT PART WAS NEEDED.  THE VEHICLE WAS TAKEN BACK TO DEALERSHIP ON APRIL 15, 2005,  AND THE PART WAS REPLACED.  WHILE DRIVING ON THE FREEWAY AT 55 MPH ON APRIL 16, 2005, SMOKE FILLED THE INSIDE OF THE VEHICLE.  THE VEHICLE WAS DRIVEN TO THE GAS STATION OFF OF THE FREEWAY AND THE MECHANIC DETERMINED THAT THE FLAMES WERE COMING FROM UNDER THE HOOD.  THE MECHANIC EXTINGUISHED THE FLAMES, AND INFORMED THE CONSUMER THAT PROBLEM WAS CAUSED BY THE ENGINE.   *AK   THE #3 CYLINDER HAD MISFIRED DUE TO THE HEAD GASKET LEAKING INTERNALLY.   *SC",
        "vin": "3N1CB51D85L"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/07/2005",
        "dateOfIncident": "01/14/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10112648,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT CAR IN OCTOBER  2004, AND BY DECEMBER WAS CONTINUALLY HEARING A LOUD, CREAKING SOUND WHEN GOING OVER ANY KIND OF IMPERFECTION IN THE ROAD.  WHEN RETURNED TO THE DEALERSHIP, PROBLEM BLAMED ON FACTORY BLOWN STRUTS.  WAITED A MONTH FOR THE PART (BECAUSE IT WAS ON NATIONAL BACKORDER) AND PART WAS FINALLY REPLACED.  WITHIN THREE DAYS, THE SAME SOUND COULD BE HEARD.  BROUGHT BACK TO THE DEALERSHIP AND ORDERED MORE STRUTS.  A MONTH LATER (NOW MARCH 1ST) WHEN PICKED UP THE CAR FOR THE SECOND TIME, THE DAY AFTER REPLACING THE STRUT SAME SOUND WAS HEARD AGAIN.  ON TAKING IT BACK TO THE DEALERSHIP FOR THE THIRD TIME, SOUND BLAMED ON CONTROLL ARM BUSHINGS.  APPT. NEXT WEEK TO SEE IF THIS PRBLEM IS CORRECT.*AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/20/2005",
        "dateOfIncident": "02/20/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10111863,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH REGARD TO ODI# 10110307 MENTIONED ABOVE:  I AM A CURRENT OWNER OF A 2004 NISSAN SENTRA, THERE IS A WIDESPREAD PROBLEM THAT EVEN  NHTSA IS FAILING TO ACKNOWLEDGE WITH REGARD TO THE 1.8L ENGINE AND/OR ASSEMBLY PLANTS IN MEXICO THAT PRODUCE THESE UNITS.  I HAVE FOUGHT NISSAN TOOTH AND NAIL OVER THIS, THE LAST TIME I WAS AT THE SALES DEALER FOR SERVICE, THEY REFUSED TO SERVICE THE VEHICLE, AND ACTUALLY ASKED ME TO LEAVE THEIR PROPERTY.  REGIONAL REPRESENTATIVE FROM NISSAN NORTH AMERICA, INC. IN NEW JERSEY WAS CONTACTED IMMEDIATELY, THAT INDIVIDUAL SIDED WITH THE DEALER WITH RESPECT THAT I SHOULD GO TO ANOTHER DEALER FOR SERVICE.  ENGINE STILL PINS IN COLD WEATHER, AND RATTLES IN HOT WEATHER.  WATER STILL LEAKS UNDER THE HOOD ONTO THE DRIVE BELT.  HAVE WRITTEN TO NISSAN MOTORS LTD. IN JAPAN WITH NO RESPONSE.  WILL BE LOSING APPROXIMATELY $6,000 WHEN I TRADE OUT OF THE VEHICLE IN ORDER TO GET SECURE AND RELIABLE TRANSPORTATION, WHICH WILL DEFINITELY NOT BE ANOTHER NISSAN.  NISSAN NORTH AMERICA REFUSES TO GIVE ME ANY INFORMATION TO CONTACT A \"HIGHER UP\" ON THE CORPORATE CHAIN, THEY SAY THAT  INFORMATION CANNOT BE DISCLOSED.  TO ALL CURRENT OWNERS OF NEW NISSANS, I SAY CHEERS AND GOOD LUCK!  *JB",
        "vin": "3N1CB51D34L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/10/2005",
        "dateOfIncident": "12/21/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10110307,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "CONCERN: ENGINE LOST ALMOST ALL OF ITS POWER.  THE HEAD WAS CRACKED, AND THE #4 CYLINDER WAS MISSING ONE OF THE 2 COMPRESSION RINGS. CAR WAS IN SHOP FOR OVER 40 DAYS.*AK    CORRECTION:  WAITED 30 DAYS FOR PARTS, ENTIRE ENGINE, EXHAUST SYSTEM, AND INTAKE WERE REPLACED.  CAR STILL RUNS HORRIBLE, AND NOW THE TRANSMISSION DOES NOT LIKE TO SHIFT WHEN IT IS COLD.     THE CAR OVER HEATED AND POSSIBLY CAUSING A FIRE",
        "vin": ""
    }
]