[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/01/2005",
        "dateOfIncident": "05/15/2005",
        "fire": false,
        "manufacturer": "Reinke Manufacturing Company, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10130817,
        "products": [
            {
                "manufacturer": "Reinke Manufacturing Company, Inc.",
                "productMake": "REINKE",
                "productModel": "TRAILER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 RUFFNECK TRAILER SERIES/MODEL BU-07-01 VIN [XXX]PURCHASED ON 3/22/05 IN NORTH MIAMI FROM RUFFNECK TRAILER CO. ON 5/15/05, WHILE DRIVING HOME ON NORTHBOUND INTERSTATE 275 IN ST PETERSBURG, FL, FROM SARASOTA, FL, THE RIGHT METAL FENDER SUDDENLY FLEW OFF THE TRAILER STRIKING THE ROADWAY AND DAMAGING THE RIGHT TIRE. AFTER LOCATING THE FENDER ON THE SIDE OF THE ROADWAY, WE TOOK THE TRAILER TO A LOCAL DEALER THE NEXT DAY, O'DELL'S TRAILERS IN LARGO,FL. ACCORDING TO O'DELL'S, THE RIGHT FENDER WAS NOT PROPERLY WELDED TO THE FRAME CAUSING IT TO SEPARATE. FURTHERMORE, THE LEFT FENDER WAS ALSO LOOSE AND HAD TO BE RE-WELDED TO PREVENT IT FROM SEPARATING FROM THE FRAME LIKE THE RIGHT FENDER HAD DONE. O'DELL'S STRAIGHTENED OUT AND RE-WELDED THE RIGHT FENDER BACK ONTO THE TRAILER FRAME. HOWEVER, THE INTEGRITY OF THE TIRE HAD BEEN COMPROMISED DUE TO THE SHEAR ON THE SIDEWALL FROM THE METAL FENDER EDGE AND A NEW TIRE HAD TO BE PURCHASED. I CONTACTED DAN THATCHER, OWNER OF RUFFNECK TRAILERS, AND HE SAID HE HAD NEVER HEARD OF THIS OCCURRING TO ANY OF HIS TRAILERS BEFORE AND REFUSED TO BELIEVE THE INCIDENT OCCURRED. I OFFERED TO SEND DIGITAL PHOTOS OF THE DAMAGE TO THE TRAILER AS WELL AS THE REPAIR INVOICE BUT HE REFUSED TO LISTEN. I EXPLAINED TO DAN THAT WE WERE FORTUNATE THAT THE INCIDENT OCCURRED AT APPROX 2200 HRS AND THE ROADWAY WAS CLEAR OF OTHER TRAFFIC OTHERWISE THE FLYING METAL FENDER COULD HAVE EASILY STRUCK ANOTHER VEHICLE OR PEDESTRIAN OR IMPEDED THE MOTION OF ANOTHER VEHICLE IN THE NEXT LANE CAUSING A CRASH AND SUBSEQUENT DAMAGE AND/OR INJURY. DAN WAS UNCOOPERATIVE AND DISCONNECTED THE PHONE LINE. THERE WAS NO INDICATION THAT THE FENDER WAS LOOSE THAT NIGHT AND I HAD EVEN VISUALLY CHECKED THE TRAILER PRIOR TO LEAVING SARASOTA FOR HOME.     NOTE: THE VEHICLE INFO PAGE DOES NOT INCLUDE RUFFNECK TRAILERS SO I CHOSE THE FIRST ENTRY- AIRSTREAM- WHICH HAS NO CONNECTION TO THIS COMPLAINT. THANK YOU.   *JB UPDATED 07/19/2012 *JS    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6)",
        "vin": "1R9BU071451"
    }
]