[
    {
        "components": "STRUCTURE,WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/17/2013",
        "dateOfIncident": "01/01/2005",
        "fire": false,
        "manufacturer": "Fishing Holding, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10508556,
        "products": [
            {
                "manufacturer": "Fishing Holding, LLC",
                "productMake": "RANGER BOAT TRAILER",
                "productModel": "FISHERMEN",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I WOULD APPRECIATE IT IF YOU LOOKED INTO THE PROBLEM OF AXLE WELD FAILURES ON RANGER BOAT TRAILERS. I HAVE ATTACHED A BASS FISHING WEB SITE ADDRESS WHERE THIS IS DISCUSSED AT LENGTH. I HAVE ALSO ATTACHED THE TEXT OF A MESSAGE FROM A FORMER RANGER DEALER WHO PROVIDED INFO ON THIS ISSUE. WEB SITE WHERE THE FOLLOWING WAS POSTED: HTTP://WWW.BBCBOARDS.NET/RANGER-BOATS/   I CAN TELL YOU THAT WHEN DAVID FRITTS OUTDOORS CARRIED RANGER WE STARTED HAVING ISSUES WITH THE TRAILERS IN 2005 AND IT CONTINUED RIGHT UP TO LATE 2010. THE BIGGEST ISSUE WAS WITH THE SINGLE AXLE TRAILERS BUT ALSO WITH THE TANDEM TRAILERS. FROM TIRES WEARING TO HUBS FAILING, AND THE AXLES BREAKING LOOSE. THE FIRST ONE WAS BROUGHT TO ME ON A FLAT BED AND THE AXLE HAD BROKEN LOOSE AND FOLDED UNDER THE BOAT. WITHIN 2 WEEKS OF THE FIRST TRAILER FAILURE WE HAD 3 MORE COME IN. I CHECK THE INVOICES ON THESE 4 BOATS AND FOUND THAT THEY WERE SHIPPED ON THE SAME LOAD AND HAD CONSECUTIVE SERIAL NUMBERS. I CALLED RANGER TO INFORM HIM OF MY FINDINGS. [XXX] ASSURED ME THAT DFO WAS THE ONLY DEALER THAT HAD REPORTED ANY FAILURES. LATER THAT YEAR I SENT SOME GUYS TO THE PRODUCT KNOWLEDGE TOUR AT THEPLANT. WHILE TOURING THE TRAILER PLANT HE CALLED ME AND SAID THAT THERE WAS AT LEAST 8-9 TRAILERS SITTING IN THE BACK WITH THE SAME AXLE PROBLEMS THAT HE HAD SEEN AT DFO. HAVING PROBLEMS WITH A MANUFACTURED PRODUCT IS TO BE EXPECTED, BUT TO NOT ADMIT THAT YOU HAVE A PROBLEM IS WRONG AND I DON?T CARE WHO YOU ARE. I COULD SIT HERE AND TYPE FOR HOURS ABOUT THESE TRAILERS BUT I WON?T. I DO WANT THE OWNERS TO BE AWARE THAT REGARDLESS OF THE PEOPLE HERE THAT SAY IT?S ONLY A FEW TRAILERS. I WOULD GUESS THAT DFO REPLACED MORE THAN 30 AXLES FROM 2005-2010.  MY ADVICE IS TO HAVE THE WELDS CHECKED ON YOUR TRAILERS NOWBEFORE THERE IS A POST ABOUT SOMEONE BEING SERIOUSLY INJURED.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": ""
    }
]