[
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/29/2020",
        "dateOfIncident": "10/14/2017",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11302892,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "PORSCHE RECALLED THIS FUEL PUMP (17V-576) AFTER I REPLACED FOR THE SAME REASON IT WAS RECALLED.  I'VE CONTACTED PORSCHE SEVERAL TIMES AND THEY STILL HAVE NOT ADDRESSED REPLACING THE FUEL PUMP FILTER FLANGE. IT'S BEEN MORE THAN 2 YEARS NOW? WHAT CAN I DO?",
        "vin": "WP1AB29P85L"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "10/09/2019",
        "dateOfIncident": "09/09/2019",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11267395,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 PORSCHE CAYENNE. THE CONTACT STATED THAT ALL FOUR DOOR LATCHES FAILED TO OPEN FROM OUTSIDE AND  INSIDE THE VEHICLE. THE CONTACT CALLED PORSCHE ORLANDO (9590 US-17, MAITLAND, FL 32751, (407) 680-0785) AND WAS INFORMED THAT THERE WOULD BE A FEE TO REPAIR EACH DOOR. THE VEHICLE WAS NOT TAKEN TO A DEALER AND WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND PROVIDED CASE NUMBER: 5557958. THE APPROXIMATE FAILURE MILEAGE WAS 162,160.",
        "vin": "WP1AA29P85L"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/28/2019",
        "dateOfIncident": "05/25/2019",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11210362,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "GOOGLE: CAYENNE WET FLOOR. ALL CAYENNE HAVE ISSUE WITH POOR WATER DRAINAGE SYSTEM ACCORDING TO THE WEBSITES. MY CAR WAS DRIVING FINE BEFORE I PARKED IT, THEN WHEN I TRY TO START IT, I GOT AN ERROR ON THE INFO DISPLAY IN RED: IGNITION LOCK FAULT, ABS BRAKE PROPORTIONING. NO CRANK FROM THE BATTERY, TRANSMISSION LOCKED IN PARK. SO I GOOGLED IT AND FOUND MANY OWNERS FROM AROUND THE WORLD REPORTING THIS ISSUE. THE DRAINAGE UNDER THE WINDSHIELD CAN GET BLOCKED EASILY WITH DEBRIS, AND CAUSE WATER TO OVERFLOW INSIDE THE CABIN AND OR ELECTRICAL MODULES LOCATED IN THE WINDSHIELD COWL AREA.   ON THE DRIVER SIDE AS PER VIDEO, I REMOVED THE RUBBER CARPET AND FORCED LIFTED THE PERMANENT CARPET, AND FOUND POOL OF WATER UNDERNEATH, ON THE METAL FLOOR WAS A BUNCH OF WIRES CONNECTING TO THE CAR BATTERY UNDER THE DRIVER SEAT WERE ALL UNDER WATER. I STARTED EMPTYING BUT MORE WATER KEPT COMING, FOAMS, RUBBERS WERE ALL SOAKED. ACCORDING TO THE FORUMS AFTER REMOVING ALL WATER, I NEEDED TO LOCATE 3 SET OF WIRES AMONGST THE BUNCH, THESE 3 ARE JOINED BY TWISTING AND WRAPPED WITH ELECTRICAL TAPE/GAUGE FROM THE FACTORY. THESE WIRES SINCE EXPOSED ARE SUSCEPTIBLE TO CORROSION. 1 SET OF WIRE COMPLETELY SNAPPED, APPARENTLY 1 WIRE IS FOR ABS BRAKE, AND THE OTHER IS FOR IGNITION KEY LOCK THAT RENDERS THE CAR IMMOBILIZED.   I FOLLOWED THE VIDEO DESCRIBING THE STEPS TO FIX THIS ISSUE MYSELF, AND BIG BOLD LETTERS ON VIDEOS TO DO NOT BRING THE CAR TO THE DEALER AS THEY WILL CHARGE THOUSANDS, IF MODULES NEED REPLACING, RUST  AN OWNER RECORDED A VIDEO ONLINE OF HIS CAYENNE DASH STOP WORKING, ALL LIGHTS BLINKING WHILE THE CAR WAS IN MOTION. LUCKILY MINE MALFUNCTIONED WHILE PARKED AT HOME, NOT DRIVING WITH MY FAMILY. I HAVE 2 CAYENNE, A 2005 AND 2008 THAT MY WIFE DRIVES. I NEED TO FOLLOW FORUM INSTRUCTION IN CLEANING THE DRAINAGE AND REMOVING THE GROMMET THAT CAN BE BLOCKED AND CAUSE WATER NOT TO DRAIN.",
        "vin": "WP1AA29P35L"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/04/2019",
        "dateOfIncident": "02/03/2019",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11174386,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I CALLED 3 TIMES TO HAVE MY RECALL REMEDIED AND PORSCHE DENIED ME EACH TIME BUT YOUR WEBSITE SAYS I HAVE AN OPEN RECALL, THEY TOLD ME IT IS BECAUSE THE RECALL WASN'T THAT IMPORTANT",
        "vin": "WP1AA29P75L"
    },
    {
        "components": "AIR BAGS,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/08/2018",
        "dateOfIncident": "12/03/2018",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11157001,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I NOTICED A RECALL ON YOUR SITE FOR MY VIN # BUT I HAVE NOT BEEN REACHED BY PORSCHE TO FIX. I'M UNSURE IF THIS HAS BEEN THE CULPRIT OF MY CHECK ENGINE LIGHT AND AIRBAG LIGHT BEING ILLUMINATED ON MY DASH.",
        "vin": "WP1AB29P45L"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/21/2018",
        "dateOfIncident": "10/15/2018",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11153097,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 PORSCHE CAYENNE. WHILE THE VEHICLE WAS PARKED IN THE DRIVEWAY, THE AIR BAG DEPLOYED WITHOUT WARNING OR A CRASH. THE PASSENGER SIDE WINDOW SHATTERED. THERE WERE NO INJURIES. THE CONTACT CALLED PORSCHE OF TAMPA AT 813-936-2222 (LOCATED AT 103 E FOWLER AVE, TAMPA, FL 33612) AND WAS INFORMED TO CALL THE MANUFACTURER. THE MANUFACTURER WAS CALLED AND THE CONTACT WAS REQUESTED TO PROVIDE PROOF OF OWNERSHIP AND INSURANCE. THE INFORMATION WAS PROVIDED TO THE MANUFACTURER AND AN EMAIL WAS SENT TO THE CONTACT, REQUESTING A PICTURE OF THE VEHICLE. THE CONTACT EMAILED THE PICTURE AND DID NOT RECEIVE A RESPONSE. THE CONTACT CALLED THE MANUFACTURER AND WAS INFORMED THAT A CARFAX REPORT REVEALED THAT THE VEHICLE WAS PREVIOUSLY INVOLVED IN A CRASH. THE MANUFACTURER DECLINED FURTHER ASSISTANCE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 150,482.",
        "vin": "WP1AA29P85L"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/04/2018",
        "dateOfIncident": "09/03/2018",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11124415,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 PORSCHE CAYENNE. WHILE DRIVING APPROXIMATELY 35 MPH, THE CONTACT HEARD AN ABNORMAL CLANKING NOISE UNDERNEATH THE VEHICLE. THE CONTACT DROVE TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE DRIVESHAFT WAS DETACHED AND SPLIT IN HALF AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE VEHICLE WAS NOT TAKEN TO A DEALER. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND DID NOT ASSIST. THE APPROXIMATE FAILURE MILEAGE WAS 110,000. *DT  DRIVESHAFT FAILED AND REPLACED TWICE 11/05/12 AT 69,400 MILES AND 9/3/18 AT 109,800 MILES. UPDATED 10/5/18*JB",
        "vin": "WP1AB29P05L"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/16/2018",
        "dateOfIncident": "11/01/2013",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11111666,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 PORSCHE CAYENNE. THE CONTACT STATED THAT NHTSA CAMPAIGN NUMBER: 17V576000 (FUEL SYSTEM, GASOLINE) EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT RECEIVED THE RECALL NOTIFICATION IN NOVEMBER OF 2017.  THE CONTACT SPOKE WITH NEWPORT BEACH PORSCHE (445 EAST PACIFIC COAST HIGHWAY, NEWPORT BEACH, CA 92600, 877-891-0824) AND WAS INFORMED THAT THEY WERE NOT AWARE OF THE RECALL AND DID NOT HAVE PARTS. THE CONTACT NOTIFIED THE MANUFACTURER AND WAS PROVIDED WITH CLAIM NUMBER: 01020600. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "WP1AB29P75L"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/15/2018",
        "dateOfIncident": "06/08/2018",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11102015,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE S",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "CONTINENTAL",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "IN 2016, AT AROUND 85,000 MILES THE BIG O TIRES, LOCATED AT 3415 S MARYLAND PKWY, LAS VEGAS, NV 89169, INSTALLED FOUR NEW TIRE ON MY CAYENNE S, 2005. THE TIRE MANUFACTURER IS CONTINENTAL AND ALL TIRES ARE OF 275/45/19 SIZE.  ANTICIPATING A 470 MILES TRIP ON JUNE 8, 2018 FROM LAS VEGAS TO MOAB, UT, ON THE PREVIOUS DAY I CHECK ALL TIRES FOR PRESSURE AND APPEARANCE. THE PRESSURE OF THE REAR TIRES WAS SET AT 40 PSI. NO VISIBLE DAMAGES WERE DETECTED.   ON THE DAY OF THE TRIP, AT 80 MPH THE REAR LEFT TIRE SUDDENLY LOST PRESSURE REQUIRING SIGNIFICANT EFFORTS TO CONTROL THE VEHICLE. AS SOON AS I MANAGED TO STOP AND LOOK AT THE PROBLEM TIRE, I NOTICED THAT ABOUT 70% OF THE TREAD LAYER WAS SEPARATED FROM THE BODY OF THE TIRE. AT THAT TIME, THE ODOMETER INDICATED THAT THE TIRES WERE USED ONLY FOR ABOUT 3,500 MILES.   WHEN I CONTACTED BIG O TIRE IN LAS VEGAS ON MONDAY, JUNE 11, 2018, THE FIRST COMMENT THE MANAGER WAS THAT THE ACCIDENT WAS CAUSED BY A DEFECTIVE TIRE. HOWEVER, TWO DAYS AFTER RECEIVING THE CAR AND THE DAMAGED TIRE, HE INFORMED ME THAT CONTINENTAL REFUSED TO TAKE RESPONSIBILITY IN THIS CASE. THEY HAVE DETERMINED THAT A LOW AIR PRESSURE CAUSED THE DAMAGE.  KNOWING THE FACTS, I BELIEVE THAT CONTINENTALS CONCLUSION IS MOST PROBABLY INCORRECT. I STRONGLY RECOMMEND THAT FOR THE SAFETY OF MILLIONS OF USERS OF TIRES MANUFACTURED BY CONTINENTAL, THIS CASE IS INVESTIGATED.",
        "vin": "WP1AB29P85L"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/05/2018",
        "dateOfIncident": "06/05/2018",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11099994,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 PORSCHE CAYENNE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V576000 (FUEL SYSTEM, GASOLINE); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER (PORSCHE OF HILTON HEAD, 107 DRIVERS WAY, HARDEEVILLE, SC 29927, (843) 208-3300) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "WP1AB29PX5L"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/22/2018",
        "dateOfIncident": "01/01/2009",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11096251,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 PORSCHE CAYENNE. CONSUMER WRITES IN REGARDS TO FILTER FLANGE OF FUEL PUMP. *LD    THE CONSUMER STATED THE VEHICLE FAILED WITH THE SAME DEFECT AS DESCRIBED IN THE RECALL, PRIOR TO RECALL BEING IN EFFECT. THE MANUFACTURER WAS NOTIFIED AND HAD NOT RESPONDED TO THE CONSUMER'S REQUEST FOR REIMBURSEMENT. *JS",
        "vin": "WP1AA29P35L"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/10/2018",
        "dateOfIncident": "09/15/2017",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11093250,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 PORSCHE CAYENNE. THE CONTACT SMELLED A FUEL ODOR INSIDE THE VEHICLE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE DRIVER'S SIDE FUEL TANK FLANGE NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED AT THE CONTACT'S EXPENSE. ONE MONTH AND THREE WEEKS LATER, THE CONTACT RECEIVED A RECALL NOTIFICATION IN THE MAIL FOR NHTSA CAMPAIGN NUMBER: 17V576000 (FUEL SYSTEM, GASOLINE). THE RECALL WAS FOR THE SAME FAILURE THAT THE CONTACT HAD GOTTEN REPAIRED PRIOR TO RECEIVING THE RECALL NOTICE. THE MANUFACTURER WAS INFORMED THAT THE FAILURE HAD BEEN REPAIRED PRIOR TO HAVING ANY KNOWLEDGE OF THE RECALL. THE MANUFACTURER STATED THAT THEY USUALLY USE A THIRD PARTY FOR REIMBURSEMENT; HOWEVER, THAT WAS NOT THE CASE FOR THIS RECALL SO REIMBURSEMENT WAS NOT POSSIBLE. THE DEALER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 59,626. *TT  UPDATED 9/20/18*JB",
        "vin": "WP1AA29P95L"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/04/2018",
        "dateOfIncident": "11/01/2017",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11091943,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE S",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 PORSCHE CAYENNE S. THE CONTACT STATED THAT NHTSA CAMPAIGN NUMBER: 17V576000 (FUEL PUMP, GASOLINE) EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT RECEIVED THE RECALL NOTIFICATION IN NOVEMBER OF 2017. THE VEHICLE WAS TAKEN TO THE DEALER (THE COLLECTION, 200 BIRD ROAD, CORAL GABLES, FL 33146, PHONE (305) 444-5555), BUT THE PARTS WERE UNAVAILABLE. THE DEALER HAD BEEN WAITING FOR PARTS FOR MORE THAN NINETY DAYS. THE MANUFACTURER WAS NOTIFIED AND STATED THAT THE COLLECTION DEALER CONTACTED THEM CONCERNING PART AVAILABILITY. THE DEALER WAS INFORMED THAT THE PARTS WERE UNAVAILABLE AND THE MANUFACTURER DID NOT KNOW WHEN THEY WOULD ARRIVE. THE CONTACT WAS CONCERNED THAT THE VEHICLE MIGHT EXPERIENCE A FAILURE BEFORE PARTS BECAME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "WP1AB29P45L"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/27/2018",
        "dateOfIncident": "11/14/2017",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11075222,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 PORSCHE CAYENNE. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 17V576000 (FUEL SYSTEM); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER  (STEVINSON IMPORTS PORSCHE IN LITTLETON, COLORADO) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WP1AC29P05L"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/01/2018",
        "dateOfIncident": "11/15/2017",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11066432,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I GOT THE LETTER FOR RECALL OF REPLACE FILTER OF FUEL PUMP,  CALL LOCAL DEALER MANY TIME AND GOT THE ANSWER WITH OUT THE PART ,  THIS UNSAFE UNDER DRIVING ? KEEP CONTINUES OR STOP DRIVING ? WE HAVE 2 KIDS ,  PLEASE ADVIDE ..THANKS",
        "vin": "WP1AA29P85L"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEATS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/24/2017",
        "dateOfIncident": "10/18/2016",
        "fire": true,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11056292,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I PAID FOR THIS RECALL 17V-576 AND NEVER RECEIVED MY REIMBURSEMENT FOR THIS ISSUE FROM PORSCHE.  THEY OWE ME $1800.00  I WANT TO BE REIMBURSED IMMEDIATELY.  I SPENT A LOT OF MONEY REPAIRING THIS VEHICLE CONSTANTLY.  VERY POORLY MADE.",
        "vin": "WP1AB29P85L"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/22/2016",
        "dateOfIncident": "03/17/2016",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10851050,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE S",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE HAS PLASTIC COOLANT PIPES BETWEEN THE FRONT AND BACK OF THE ENGINE.  THEY FAILED AND DUMPED ALL THE COOLANT OUT WHILE ON THE ROAD.  CAR WAS DISABLED AND HAD TO BE TOWED.  AFTER RESEARCHING, IT'S CONCLUDED THAT THIS IS A VERY COMMON FAILURE IN CAYENNES WITH A V8 ENGINE AT ABOUT 60000 MILES.  MINE HAD 61000.  THIS IS A SAFETY CONCERN.  THE CAR CAN BE DISABLED AT ANYTIME.  ALSO, THE REPAIR IS VERY COSTLY, EXCEEDING 3000 USD FOR PARTS AND LABOR.",
        "vin": "WP1AB29P35L"
    },
    {
        "components": "STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "09/11/2014",
        "dateOfIncident": "08/14/2014",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10632407,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE S",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "IN A PARKING LOT TRAVELING AT 7 MPH APPROX, APPLIED THE BRAKES AND THE PSM (STABILITY MANAGEMENT) LIGHTS AND BUZZERS CAME ON. LOST ALL BRAKES ON THE CAR AND COULD NOT STOP. PUMPED THE BRAKES AND STILL NO STOPPING CAPABILITY. HAD TO HIT A POLE TO AVOID PEDESTRIANS AND OTHER CARS. DEALER DIAGNOSED THE CAUSE AS A YAW SENSOR FAILURE WHICH THEY SAY CONTROLLED THE ABS. MECHANICAL BRAKES SYSTEMS WERE OPERATIONAL AFTER CRASH. CRASH DAMAGE WAS NOT EXTENSIVE, AT APPROX 8-10 MPH.  *TR",
        "vin": "WP1AB29P45L"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/03/2013",
        "dateOfIncident": "10/17/2012",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10505497,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 PORSCHE CAYENNE. THE CONTACT STATED THAT WHEN DRIVING 90 MPH THE VEHICLE WOULD SHAKE. THE VEHICLE WAS TAKEN TO THE DEALER FOR INSPECTION AND THE CONTACT WAS TOLD THAT THERE WAS NOT ENOUGH FUEL TRAVELING THROUGH THE FUEL LINES AND THE ACCELERATOR PEDAL NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED BUT PROVIDED NO ASSISTANCE. THE FAILURE MILEAGE WAS 113,000.",
        "vin": "WP1AA29P85L"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/19/2012",
        "dateOfIncident": "03/15/2005",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10466627,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE I HAVE HAD THE VEHICLE I HAVE HAD TO REPLACE THE DRIVE SHAFT 3 TIMES. PORSCHE REPLACED IT ONCE UNDER WARRANTY AND THE OTHER TWO TIMES I HAD TO PAY IN EXCESS OF $900.00 TO HAVE IT REPLACED.  I HAVE BEEN TOLD  BY PORSCHE THAT IT HAS A DEFIECTIVE RUBBER SEAL AND WHEN THE SEAL FAILS SO DOES HE DRIVE SHAFT.  THIS IS A COMMON DEFECT AND IS KNOW BY PORSCHE AT THE DEALERS AND THE MANUFACTURER. THEY HAVE ACKNOWLEDGED THE DEFECT TO ME. MY CONCERN IS IF THE DRIVE SHAFT TOTALLY FAILS AND BREAKS, NOT JUST FLEXING AND HITTING THE FLOOR, IT COULD CAUSE AN ACCIDENT BY MAKING THE VEHICLE GO OUT OF CONTROL.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/13/2011",
        "dateOfIncident": "11/02/2011",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10439788,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 PORSCHE CAYENNE. THE CONTACT WAS DRIVING 35-40 MPH WHEN THE VEHICLE LUNGED FORWARD WHILE SHIFTING HARD. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THE DEALER CONFIRMED THAT THE VALVE BODY NEEDED TO BE REPLACED. THE MANUFACTURER WAS NOT  CONTACTED AND THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 60,000 AND THE CURRENT MILEAGE WAS 68,000 .",
        "vin": "WP1AA29P45L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/20/2011",
        "dateOfIncident": "08/20/2011",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10426461,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE S",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 PORSCHE CAYENNE S.  THE CONTACT STATED THAT THE RADIATOR PIPE WAS FRACTURED, CAUSING ANTI FREEZE TO LEAK FROM THE VEHICLE.  THE VEHICLE WAS TOWED TO THE DEALER WHERE THE ORIGINAL HOSE LINES WERE REPLACED WITH METAL LINES DUE TO CORROSION.  THE MANUFACTURER WAS MADE AWARE OF THE FAILURE HOWEVER, DID NOT OFFER ANY ASSISTANCE.  THE CURRENT MILEAGE WAS 75,000 AND THE APPROXIMATE FAILURE MILEAGE WAS 74,800.",
        "vin": "WP1AB29P25L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/22/2011",
        "dateOfIncident": "08/21/2011",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10420958,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "COOLANT PIPE FAILURE.  *TR",
        "vin": "WP1AC29PX5L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/26/2011",
        "dateOfIncident": "05/22/2011",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10402881,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 PORSCHE CAYENNE. THE CONTACT STATED WHILE DRIVING AT LOW AND HIGH SPEEDS THE VEHICLE LUNGED FORWARD. HE ALSO HEARD A LOUD NOISE IN THE ENGINE. THE VEHICLE WAS INSPECTED BY A DEALER WHO ADVISED HIM THAT THE IGNITION COIL AND CYLINDER NUMBER 5 NEEDED TO BE REPLACED. THE IGNITION COIL WAS REPAIRED; HOWEVER, IMMEDIATELY AFTER LEAVING THE DEALER THE FAILURE RECURRED. THE DEALER WAS CONTACTED AND ADVISED HIM TO BRING THE VEHICLE BACK. THE FAILURE MILEAGE WAS APPROXIMATELY 66,000. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/17/2011",
        "dateOfIncident": "05/03/2011",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10401249,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE S",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2005 PORSCHE CAYENNE S.  THE CONTACT STATED THAT INSTRUMENT PANEL WAS FAILING AND THE TURN SIGNALS AND SPEEDOMITOR WERE INOPERABLE.  THE VEHICLE WAS TAKEN TO THE DEALER AND THEY TOLD THE CONTACT THAT THE ENTIRE INSTRUMENT PANEL WOULD NEED TO BE REMOVED TO REPLACE A MICROCHIP AT A COST OF $2000.  THE FAILURE MILEAGE WAS 76,621 AND THE CURRENT MILEAGE IS 76,668.   UPDATED 09/07/11",
        "vin": "WP1AA29P35L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/29/2011",
        "dateOfIncident": "03/15/2011",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10393582,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 PORSCHE CAYENNE. THE CONTACT STATED THAT THE ENGINE LIGHT WAS ILLUMINATED THEN THE VEHICLE STARTED TO LUNGE FORWARD WHEN THE CONTACT TRIED TO ACCELERATE, AND IT BECAME DIFFICULT TO SHIFT GEARS. THE VEHICLE WAS INSPECTED BY A DEALER WHO  ADVISED HIM THAT THERE WAS A MISFIRE ON THE ENGINE AND ONE OF ITS COMPONENTS NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS CONTACTED AND THEY ARE CURRENTLY WAITING FOR A RESPONSE. THE FAILURE MILEAGE WAS APPROXIMATELY 47,000. UPDATED 05/04/11 *BF  UPDATED 05/11/11",
        "vin": "WP1AA29P65L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/02/2008",
        "dateOfIncident": "10/02/2008",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10244267,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE S",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING A PORSCHE CAYENNE S TODAY ON HIGHWAY AT 65MPH.  THE CAR UNEXPECTEDLY SLOWED DOWN BY AROUND 20 MILES FOR ABOUT 10 SECONDS.  5 MINUTES LATER, SAME PROBLEM OCCURRED AGAIN AND THEN THE ENGINE STALLED, AND THE STEERING WHEEL LOCKED.  IT IS VERY DANGEROUS TO STALL ON HIGHWAY, WITHOUT TOO MUCH CONTROL ON STEERING WHEEL. THE DEALER SAID THEY COULD NOT FIND THE PROBLEM. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/11/2008",
        "dateOfIncident": "11/18/2007",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10217698,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE S",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2005 PORSCHE CAYENNE. SINCE OWNING THIS TRUCK THERE HAVE BEEN NUMEROUS ITEMS THAT HAVE GONE WRONG. ALL THE MAIN COMPUTERS HAD TO BE REPLACED, FRONT DRIVE SHAFT, TRANSMISSION, AND NOW A COOLANT TUBE. THE LAST ITEM IS MY CONCERN, WHICH COST $2,800.00 TO FIX ON A TRUCK THAT HAS 71,000 MILES ON IT. WHEN IT WAS TAKEN TO THE DEALER I WAS TOLD THAT ALL THE CAYENNE?S FROM 2003 ? 2006 HAVE TO HAVE THIS PART CHANGED (IT?S MADE OF PLASTIC), BECAUSE IT BREAKS. NOW PORSCHE KNOWS THERE IS AN ISSUE WITH THIS PART BECAUSE IT HAS RECALLED OF THE REPLACEMENT PARTS THAT WHERE ON ALL OF THE DEALERSHIPS SHELVES. AFTER DOING THIS THERE REDESIGNED THE AND PART MADE IT OUT OF ALUMINUM AND HAD THIS PART ON BACK ORDER BECAUSE THERE WHERE SO MANY CAYENNE?S THAT NEED THIS PART FIXED SITTING IN THE DEALERSHIPS. I HAVE TRIED WORKING WITH PORSCHE BUT THEY JUST SAY THAT I?M OUT OF WARRANTY AND THERE IS NOTHING THEY WILL DO! IT SEEMS TO ME THAT WHEN THEY NEED TO REPLACE THIS PART ON ALL OF ITS TRUCKS THERE IS AN ISSUE. HELP!  *TR",
        "vin": "WP1AB29P84L"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "12/17/2007",
        "dateOfIncident": "10/07/2006",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10212147,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "METAL, HEAT-CONDUCTIVE PORSCHE EMBLEM ON STEERING WHEEL (ATOP AIRBAG) CAUSED SEVERE BURN/BRAND ON DRIVER'S FOREARM WHEN AIRBAG DEPLOYED.  OTHER MANUFACTURERS USE PLASTIC EMBLEM TO AVOID BURNING DRIVERS.  *TR",
        "vin": "WP1AA29P65L"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/26/2007",
        "dateOfIncident": "06/22/2007",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10194233,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE S",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM AN OWNER OF THE 2005 PORSCHE CAYENNE S. THE PORSCHE CAYENNE SEEMED TO HAVE A HESITATION ISSUE THAT WE HAVE TRIED TO HAVE REPAIRED SEVERAL TIMES IN THE PAST.  I WISH I HAD TAKEN CAR IN AS SOON AS I FIRST NOTICED, AS I WOULD HAVE EASILY BEEN ABLE TO PURSUE THE NY STATE LEMON LAW, HAVING HAD THE CAR SERVICED FOR THIS ISSUE MORE THAN 3 TIMES WITH NO RESOLUTION.  BUT THE SITUATION HAS ONLY GOTTEN WORSE WITH TIME AND THE DEALERS REFUSE TO RECOGNIZE, ACKNOWLEDGE AND FIX THE ISSUE.  I HAVE HAD MULTIPLE PEOPLE DRIVE THE CAR AND HAVE EXPERIENCED THE HESITATION ISSUE WHEN STEPPING ON THE THROTTLE, AS THE CARS WILL HESITATE AND ONLY MOVE AFTER PUMPING THE GAS PEDDLE A FEW TIMES.  I HAVE HAD MORE THAN ONE DANGEROUS SITUATION ARISE AS I AM TRYING TO MAKE TURNS. I FINALLY SEARCHED THE WEB SITE CAR FORUMS TO SEE IF OTHERS HAVE HAD THIS ISSUE AND HAVE FOUND HUNDREDS OF SIMILAR CASES AND WAS SURPRISED TO FIND NO RECALLS.  PLEASE ASSIST WITH THIS ISSUE BEFORE SOMEONE SERIOUSLY GETS HURT.*AK",
        "vin": "WP1AB29P45L"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/15/2007",
        "dateOfIncident": "06/08/2007",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10193438,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 PORSCHE CAYENNE.  THE ENGINE LIGHT ILLUMINATED WHILE DRIVING.  THE VEHICLE WAS TAKEN TO THE DEALER WHO DISCOVERED THAT ONE OF THE WIRES IN THE STORAGE COMPARTMENT WAS RIPPED.  THE CONTACT WAS CHARGED $770 FOR WIRES THAT HE STATED WERE BARE WIRES ON ONE SIDE OF THE NON-INSULATED STORAGE COMPARTMENT.  THE PURCHASE DATE AND POWERTRAIN WERE UNKNOWN.  THE CURRENT AND FAILURE MILEAGES WERE 48,388.  THE GROUND WIRE TO THE SHUT OFF VALVE HAD SHORTED OUT.  UPDATED 08/15/07. *JB",
        "vin": "WP1AA29P15L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/13/2006",
        "dateOfIncident": "06/26/2006",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10162281,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HESITATION - THREE OCCASIONS - FIRST WHILE TRYING TO CROSS A DIVIDED HIGHWAY...CAR HESITATED, LEFT ME IN THE EAST BOUND LANE , ONCOMING CAR JUST MISSED MY WIFE AND I; SECOND WHILE CROSSING A TWO LAND HIGHWAY - CAR HESITATED WHILE I WAS IN WEST BOUND LANE, ATTEMPTING TO HEAD EAST BOUND .. NO ACCIDENT; THIRD TIME IN DRIVE WAY.  TOOK CAR TO DEALER AFTER FIRST INCIDENT - NOTHING SHOWED ON CAR COMPUTER SO NOTHING WAS DONE; AFTER SECOND AND THIRD INCIDENT I TOOK CAR TO DEALER AND IS NOW REPLACING THE SIX COILS (?) AFTER MY VERY CONCERNED COMPLAINT.  CAR IS STILL WITH DEALER.  CAN I TRUST THE REPAIR OR WILL I BE LESS LUCKY THE NEXT TIME???*JB",
        "vin": "WP1AA29P85L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/30/2005",
        "dateOfIncident": "04/06/2005",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10135627,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER REQUEST FOR PORSCHE CARS OF NORTH AMERICA TO REPURCHASE HIS 2005 PORSCHE CAYENNE.***NO ANSWER REQUIRED***. *MR THE CONSUMER HAS EXPERIENCED NUMEROUS MECHANICAL PROBLEMS WITH HIS VEHICLE SUCH AS ENGINE STALLING, A REPLACEMENT AIR BAG MODULE, BATTERY FAILURE, FUEL TANK SENDER CALIBRATION. *JB",
        "vin": "WP1AA29P35L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/08/2005",
        "dateOfIncident": "04/16/2005",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10119298,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT APPROXIMATELY 70 MPH, THE ENGINE FAILED.  THE OWNER CONTACTED THE DEALERSHIP, AND HAD THE VEHICLE TOWED TO THE DEALERSHIP.  THE OWNER WAS TOLD THAT THERE WAS A CRACK IN THE ENGINE.  THE OWNER ALSO CONTACTED THE MANUFACTURER, BUT WAS UNSUCCESSFUL IN GETTING ANY ASSISTANCE.   *AK   *SC  *JB",
        "vin": "WP1AA29P65L"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/17/2005",
        "dateOfIncident": "03/17/2005",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10115358,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE S",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE STALLED WHILE ACCELERATING FROM A STOP THEN LUNGES FORWARD.  THE VEHICLE WAS TAKEN TO THE DEALER WHO INDICATED THAT THIS IS THE WAY THE VEHICLE WAS DESIGNED.  *AK  *NM",
        "vin": "WP1AB29P15L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/04/2004",
        "dateOfIncident": "11/30/2004",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10102150,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "CAYENNE",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "1) THE VISIT WORKSHOP LIGHT APPEARED ON MY NEW 2005 PORSCHE 911 CARRERA S.  2) ON NOVEMBER 30, 2004 THE VEHICLE WAS RUNNING FINE WITH THE WORKSHOP LIGHT ON.  THE VEHICLE THEN SUDDENLY LOST ENGINE POWER AT 65 MPH DURRING ACCELERATION ON THE NJ TURNPIKE.  THE LOSS OF ENGINE POWER CAUSED SEVERAL TRACTOR-TRAILERS TO NEARLY COLIDE WITH MY VEHICLE, AND WITH OTHERS, WHILE I PROCEEDED TWORDS THE SHOLDER AREA.  THE VEHICLE WAS THEN ABLE TO RUN ENOUGH ON THE SHOLDER AT 15 TO 30 MPH TO A SAFE EXIT OFF THE TURNPIKE.  3) THE VEHICLE IS AT THE RAY CATENA PORSCHE SERVICE AREA IN EDISON NEW JERSEY, AND IT HAS NOT BEEN LOOKED AT, TO DIAGNOSE THE FAILURE.*AK",
        "vin": "WP0AB29945S"
    }
]