[
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/03/2021",
        "dateOfIncident": "11/02/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439156,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2005 Subaru Impreza. The contact stated while her son was driving and approaching a stop sign, he heard an abnormal noise which caused him to lose control of the vehicle. The contact stated no warning light was illuminated. The driver was able to park on the side of the road. The vehicle was not drivable and was towed to her residence. The vehicle was not diagnosed or repaired. A dealer was not contacted. Upon investigation, the contact associated the failure with NHTSA Campaign Number: 11V464000 (Suspension). The manufacturer had been informed of the failure and was informed the recall was completed by the previous owner on 12/10/2011. The failure mileage was approximately 199,000.",
        "vin": "JF1GD29685G"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/30/2021",
        "dateOfIncident": "04/13/2021",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414627,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE KEY INTERMITTENTLY GETS STUCK IN THE IGNITION SWITCH WHEN THE GEARSTICK IS SET IN THE 'PARK' POSITION. THE CAR CAN BE TURNED OFF, BUT THE KEY CANNOT BE MOVED FORWARD INTO THE #1 POSITION (LOCK/OFF) AND CANNOT BE REMOVED FROM THE IGNITION IN THE #2 POSITION (ACCESSORY). THIS SCENARIO RETAINS THE ELECTRICAL IN THE 'ON' POSITION WHICH POTENTIALLY DRAINS THE BATTERY AND FORCES THE DRIVER TO INDEFINITELY REMAIN WITH THE VEHICLE TO AVOID A DEAD BATTERY AND/OR VEHICLE THEFT.    SUBARU HAS ACKNOWLEDGED THIS ISSUE IN SERVICE BULLETIN 16-112-18R (NHTSA ID NUMBER: 10155220). THE SUMMARY IS AS FOLLOWS: 'THIS BULLETIN ANNOUNCES A DESIGN CHANGE TO THE CVT SELECT LEVER (SHIFTER) MECHANISM IN RESPONSE TO ISOLATED CUSTOMER CONCERNS OF NOT BEING ABLE TO REMOVE THE KEY FROM THE IGNITION SWITCH WHEN THE VEHICLE IS IN PARK. THE CAUSE IS CONTAMINATION OF THE PARK-RANGE SWITCH INTERNAL COMPONENTS.' MANY CONSUMERS BELIEVE THAT IF THIS PROBLEM WAS SERIOUS ENOUGH TO REQUIRE A REDESIGN TO THE CVT (CONTINUOUSLY VARIABLE TRANSMISSION), THEN IT IS SERIOUS ENOUGH TO REQUIRE A RECALL.'    PLEASE NOTE THAT EVEN THOUGH YOUR INCIDENT REPORT FORM REQUIRES THE USER TO SELECT \"ONE DATE\" WHEN THE INCIDENT HAPPENED, THAT THIS INCIDENT IS ONLY THE FIRST OCCURRENCE OUT OF MULTIPLE OCCURRENCES. THE PROBLEM IS NOW ONGOING AND UNRESOLVED FROM THE REPORTED DATE FORWARD.",
        "vin": "JF1GG68595H"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "08/27/2020",
        "dateOfIncident": "08/27/2020",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351670,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 SUBARU IMPREZA OUTBACK SPORT    ON 8/23/2020 THE BRAKE LIGHT WAS ILLUMINATED.  UPON RETURNING HOME, THE BRAKE FLUID WAS CHECKED AND FOUND TO BE LOW.  NOTICED BRAKE FLUID ON DRIVEWAY UNDER CAR.  THE CAR WAS NOT USED UNTIL TAKING IT TO GOODYEAR FOR AN INSPECTION ON 8/27/2020.  GOOD YEAR IDENTIFIED THAT THERE IS A LEAK IN THE BRAKE LINE.  THEY ADVISED THAT THERE WAS A RECALL FOR SUBARU'S FOR THIS ISSUE, ALTHOUGH THEY COULD NOT LOCATE IT FOR THIS VIN#.    I CONTACTED SUBARU AND OPENED A CASE REGARDING THIS ISSUE.  THE CASE NUMBER IS [XXX].  THEY ADVISED ME THAT THE RECALL DID NOT APPLY TO MY VEHICLE (WQK-47).  WHEN I QUESTIONED THAT IT APPEARS TO BE THE EXACT SAME PART THAT WAS AFFECTED BY THE RECALL IN OTHER CARS THAT YEAR, I WAS ADVISED TO TAKE THE VEHICLE TO A SUBARU DEALER FOR EVALUATION.  THE DEALER WOULD BE RESPONSIBLE FOR CONTACTING SUBARU REGARDING THE ISSUE.  THE CAR WILL BE TOWED TO SUBARU IN THE NEXT DAY OR SO FOR EVALUATION. *LN    THE CONSUMER STATED PRIOR TO THE FAILURE THE VEHICLE WAS INVOLVED IN AN ACCIDENT. *JS    PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "JF1GG68505H"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/24/2019",
        "dateOfIncident": "12/23/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11291060,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE MY SON WAS BACKING OUT OF THE DRIVEWAY, HIS PASSENGER SIDE LOWER CONTROL ARM SNAPPED IN 2. HE STRUGGLED TO GET IT EVEN BACK INTO THE DRIVEWAY.  I RAN THE VIN NUMBER AND IT DOES NO SHOW THAT THIS CAR HAS A RECALL THAT NEEDS TO BE DONE.  DOES THIS MEAN IT WAS ALREADY DONE?  OR IS THIS CAR NOT COVERED FOR THE RECALL?",
        "vin": "JF1GD66585H"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/17/2019",
        "dateOfIncident": "12/17/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289711,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 SUBARU IMPREZA. WHILE THE CONTACT'S WIFE WAS DRIVING 40 MPH, SHE HEARD A SNAP IN THE ENGINE THAT  CAUSED HER TO LOSE CONTROL OF THE VEHICLE WITHOUT WARNING. THE VEHICLE WAS TOWED TO THE CONTACT'S FATHER'S HOME WHERE HE DISCOVERED THAT THE FRONT LOWER CONTROL ARM WAS FRACTURED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND STATED THAT THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 11V464000(SUSPENSION). THE CONTACT SPOKE WITH VIC BAILEY MAZDA SUBARU (400 E DANIEL MORGAN AVE, SPARTANBURG, SC 29302, (864) 568-3338) AND WAS INFORMED THAT THE VEHICLE WAS NOT INCLUDED IN THE RECALL. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 158,000.",
        "vin": "JF1GD66535H"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/10/2019",
        "dateOfIncident": "10/08/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11267693,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I BELIEVE MY VEHICLE NEEDS ADDED TO THE SAFETY RECALL: WQK47. NHTSA CAMPAIGN: 14V311000. I OWN A 2005 SUBARU IMPREZA RS. DRIVING DOWN RESIDENTIAL STREET I LOST ALL BRAKE PRESSURE COMING TO A STOP. PROBLEM WAS FROM BRAKE LINE HAD LEAK FROM CORROSION. IT'S THE SAME PROBLEM AND EXACT SPOT DESCRIBED IN THE RECALL FOR WQK47. YES, I LIVE IN THE SALT BELT. THIS NEEDS TO BE LOOKED INTO MORE AND AS SOON AS POSSIBLE. DEFINITELY A SAFETY ISSUE. THANK YOU.",
        "vin": "JF1GD67515G"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/26/2018",
        "dateOfIncident": "10/19/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11143057,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TURNING TO BACK INTO DRIVEWAY CONTROL ARM BROKE.  IT IS RUSTED",
        "vin": "JF1GD67545H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/20/2017",
        "dateOfIncident": "12/06/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11055749,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 SUBARU IMPREZA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V323000 (AIR BAGS). THE CONTACT STATED THAT THE VEHICLE WAS TAKEN TO MARK MILLER SUBARU MIDTOWN AT (801) 268-3734 (3535 STATE ST, SALT LAKE CITY, UT 84115) WHERE THE FRONT PASSENGER SIDE AIR BAG WAS REPLACED. SOON AFTER THE RECALL REPAIR WAS COMPLETED, THE AIR BAG INDICATOR REMAINED ILLUMINATED. THE MANUFACTURER STATED THAT THE RECALL WAS COMPLETED AND THE CONTACT WOULD BE CHARGED A DIAGNOSTIC FEE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 161,000.",
        "vin": "JF1GD29615G"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/27/2017",
        "dateOfIncident": "06/23/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11001716,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 SUBARU IMPREZA. WHEN THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC FOR A YEARLY INSPECTION, THE TECHNICIAN NOTICED THAT THE FRONT SUBFRAME WAS CORRODED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND REFERRED THE CONTACT TO NHTSA. THE APPROXIMATE FAILURE MILEAGE WAS 120,000.",
        "vin": "JF1GD67515G"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/21/2017",
        "dateOfIncident": "06/18/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000539,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE HIGHWAY WHEN I LOST CONTROL OF MY CAR. I WAS ABLE TO SAFELY PULL OFF TO THE SIDE, AND HAVE THE CAR TOWED HOME.  THE CONTROL ARM ON THE PASSENGER SIDE WAS RUSTED AND SNAPPED SNAPPED WHILE MY CAR WAS TRAVELING STRAIGHT. MY CAR IS AFFECTED BY THE WVX34 FRONT LOWER CONTROL ARM (TRANSVERSE LINK) CORROSION RECALL, WHICH WAS PERFORMED BEFORE I PURCHASED THE CAR. THE CONTROL ARMS HAD ANTI-RUST SPRAY APPLIED AT THAT TIME, AND WERE NOT REPLACED. THE SPRAY WAS NOT EFFECTIVE IN PREVENTING FURTHER DAMAGE. FORTUNATELY I WAS UNHARMED BECAUSE THE HIGHWAY WAS NOT VERY BUSY AND TRAFFIC WAS MINIMAL.",
        "vin": "JF1GG29655G"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/29/2016",
        "dateOfIncident": "09/22/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10910589,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 SUBARU IMPREZA. WHILE DRIVING 70 MPH, THE VEHICLE VIBRATED UNCONTROLLABLY. AS A RESULT, THE CONTACT ALMOST LOST CONTROL OF THE VEHICLE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE FRONT LOWER DRIVER SIDE CONTROL ARM FAILED AND WOULD NEED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE VEHICLE WAS PREVIOUSLY SERVICED PER NHTSA CAMPAIGN NUMBER: 11V464000 (SUSPENSION), BUT THE REMEDY FAILED TO REPAIR THE VEHICLE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 99,260. ...UPDATED 12/06/16 *BF  *TR",
        "vin": "JF1GD29695G"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/05/2016",
        "dateOfIncident": "06/30/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10882678,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 SUBARU IMPREZA. WHILE DRIVING 20 MPH, THE CHECK ENGINE WARNING LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THAT SOME CODES NEEDED TO BE CLEARED. THE VEHICLE WAS REPAIRED; HOWEVER, AFTER THE REPAIRS WERE PERFORMED, THE VEHICLE STALLED. THE CONTACT WAS ABLE TO RESTART THE VEHICLE, BUT THE FAILURE RECURRED ON NUMEROUS OCCASIONS. THE CONTACT SPOKE WITH A DEALER AND INDEPENDENT MECHANIC WHO STATED THAT THE VEHICLE NEEDED TO BE IDLING FOR SOMETIME IN ORDER TO ALLOW THE VEHICLE  RELEARN THE IDLE. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 120,000.",
        "vin": "JF1GG675X5G"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/29/2016",
        "dateOfIncident": "06/27/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10881386,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2005 SUBARU IMPREZA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V323000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.   UPDATED 10/28/16*LJ  THE CONSUMER STATED THE VEHICLE WAS REPAIRED ON JULY 31, 2016. UPDATED 11/02/16.*JB",
        "vin": "JF1GG68595G"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/11/2016",
        "dateOfIncident": "05/27/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10854861,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL : I HAVE A 2005 SUBARU WRX WHICH HAS NOT BEEN SCHEDULE FOR THE RECALL, FOR OVER A YEAR. I HAVE BEEN USING THE CAR WITHOUT ALLOWING ANYONE TO SIT IN THE FRONT SEAT FOR A YEAR NOW, WAITING FOR THE RECALL TO BE SCHEDULE. I AM TIRED OF BEING INCONVENIENCED DUE TO THIS RECALL.",
        "vin": "JF1GD70625L"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/10/2015",
        "dateOfIncident": "06/01/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10789623,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 SUBARU IMPREZA. THE CONTACT STATED THAT NHTSA CAMPAIGN NUMBER: 15V323000 (AIR BAGS) EXCEEDED A REASONABLE TIME FOR REPAIR. THE DEALER STATED THAT THE PART WAS NOT AVAILABLE FOR REPAIR. THE MANUFACTURER ALSO VERIFIED THAT THE PART WAS NOT AVAILABLE FOR REPAIR. THE CONTACT RECEIVED THE RECALL NOTIFICATION IN JUNE OF 2015. THE VIN WAS UNKNOWN. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/30/2015",
        "dateOfIncident": "07/01/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10787384,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CONCERN IS THE UNREASONABLE LENGTH OF TIME IT IS TAKING TO REMEDY THE JULY SAFETY RECALL.  FOUR MONTHS NOW AND THE DEALER SIMPLY TELLS ME THE PARTS ARE NOT AVAILABLE AND MORE CARS ARE BEING RECALLED WITH THE SAME PROBLEM!  UNTIL THE REPAIR IS PERFORMED, WE ARE ADVISED TO NOT ALLOW PASSENGERS TO RIDE IN THE FRONT PASSENGER SEAT.  A FEW WEEKS OF NOT ALLOWING PASSENGERS IS ONE MATTER, FOUR MONTHS IS RIDICULOUS.  AND THERE IS NO PROMISE OF REPAIR ANY TIME SOON.  AN APPOINTMENT WAS MADE FOR THE REPAIR ON 8/17 AND AFTER WAITING 2 1/2 HOURS I WAS ADVISED THEY HAD RUN OUT OF THE PARTS.  THEY WERE EXPECTING MORE AND I WOULD BE CALLED BY WEDNESDAY OF THAT WEEK.  HAVING NOT BEEN CONTACTED BY THE DEALER ON 9/3 I CONTACTED SUBARU OF AMERICA.  GRANT NOBLE WITH SUBARU OF AMERICA CONTACTED THE DEALER AND ADVISED ME THE PART WAS EXPECTED IN VERY SOON.  NOW, TWO MONTHS LATER, NO REMEDY!!!  PERHAPS, YOU CAN ALLOW THE AIRBAG TO BE DISABLED SINCE NO PASSENGERS ARE ALLOWED AS IT IS.  CAN SUBARU PROVIDE ANOTHER VEHICLE OR COMPENSATE ME FOR THE INCONVENIENCE AND EXTRA EXPENSE OF DRIVING ANOTHER VEHICLE DURING THIS TIME?  I WILL NEED THE AWD SUBARU WITH WINTER WEATHER.",
        "vin": "JF1GG685X5H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/25/2015",
        "dateOfIncident": "08/01/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10777741,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 SUBARU IMPREZA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V323000 (AIR BAGS), HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.   UPDATED 12/03/15*LJ; UPDATED 4/9/18*JB    THE CONSUMER STATED REPAIRS WERE MADE TO THE VEHICLE ON OCTOBER 28, 2015. *TR",
        "vin": "JF1GD70635L"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/22/2015",
        "dateOfIncident": "07/01/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10781721,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2005 SUBARU IMPREZA, VIN [XXX] AND IN JULY RECEIVED A RECALL NOTICE (15V-323) RE. THE WQR-53 RECALL CAMPAIGN. THE LETTER STATED THAT THE FRONT PASSENGER SEAT SHOULD NOT BE USED BECAUSE OF THE SAFETY HAZARD CREATED BY THE DEFECTIVE AIR BAG. GIVEN THE MANNER IN WHICH WE USE THIS CAR THIS PRESENTS ARE HARDSHIP FOR US. I CALLED THE SUBARU COMPANY (1-800-782-2783) AS WELL A LOCAL SUBARU DEALERSHIP AND WAS UNABLE TO SCHEDULE AN APPOINTMENT FOR REPAIR BECAUSE THE NECESSARY PARTS ARE NOT AVAILABLE. AT THE DEALERSHIP I WAS TOLD THE PARTS WOULD NOT COME IN BEFORE NOVEMBER AT THE EARLIEST. I DO NOT BELIEVE IT IS FAIR FOR THE CUSTOMER TO HAVE TO HAVE TO LIVE WITH THE CONSEQUENCES OF THE DELAY WITHOUT ANY REMEDY OR COMPENSATION. I WOULD APPRECIATE IF YOU COULD LOOK INTO THIS MATTER.  THANK YOU     INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "JF1GG685X5H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/28/2015",
        "dateOfIncident": "08/28/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10759928,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 SUBARU IMPREZA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V323000 (AIR BAGS) HOWEVER, THE PART NEEDED TO REPAIR THE VEHICLE WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "JF1GG67565H"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/14/2015",
        "dateOfIncident": "12/15/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10748709,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TEMPORARILY EXPERIENCE SOME FUEL SEEPAGE AT ENGINE FUEL DELIVERY PIPE/HOSE DURING  COLD ENGINE START UP IN EXTREMELY COLD OUTSIDE TEMPERATURES. VEHICLE  OCCUPANTS MAY NOTICE THE SMELL OF FUEL. THE SAME ISSUE IS DESCRIBED IN SUBARU CAMPAIGN/RECALL WVK-21 ISSUED FOR 2002-2003 MODEL YEAR SUBARU IMPREZA VEHICLES. SERVICE BULLETIN 01-170-09   HTTP://WWW-ODI.NHTSA.DOT.GOV/ACMS/CS/JAXRS/DOWNLOAD/DOC/ACM12948229/RCSB-09V468-1307.PDF",
        "vin": "JF1GG29635G"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/14/2015",
        "dateOfIncident": "05/27/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10748804,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 SUBARU IMPREZA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V323000 (AIR BAGS) HOWEVER, THE PART NEEDED TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "JF1GD70625L"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/28/2015",
        "dateOfIncident": "07/25/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10744345,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING AND LOST CONTROL OF THE CAR AT 55MPH. I STRUGGLED TO PULL THE CAR OFF THE ROAD. THE CAR WAS TOWED TO MY MECHANIC WHERE HE DIAGNOSED A BROKEN CONTROL ARM DUE TO CORROSION.",
        "vin": "JF1GG685X5G"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/08/2015",
        "dateOfIncident": "11/03/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10704386,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "EVERYTIME I START THE CAR IN EVEN THE MILDEST TO COLDEST TEMPERATURES, THE CAR HAS AN EXTREME GAS SMELL IN THE CABIN OF THE CAR. I HAVE TAKEN IT TO THE SHOP AND THEY CLAIM THEY DON'T EVEN SMELL IT AND CANNOT SERVICE IT.  THERE IS A RECALL FOR MODEL 02 AND 03 OF THIS CAR BUT DOES NOT COVER MY YEAR. IT'S GOTTEN TO THE POINT WHERE THE CAR IS NOT DRIVE-ABLE DURING COLD WEATHER. THE RECALLS ALSO DO NOT COVER THE STATE OF MARYLAND, WHICH IS RIDICULOUS BECAUSE WE'VE BEEN GETTING COLD SNAPS PUTTING US BELOW 0. CONSIDERING THE PROBLEM IS DETECTABLE EVEN IN 40 DEGREE WEATHER, THIS DOES NOT SEEM REASONABLE.  *TR",
        "vin": "JF1GG29615G"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/14/2015",
        "dateOfIncident": "01/09/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10672422,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2005 SUBARU IMPREZA WRX STI, UPON STARTING VEHICLE, IDLE, AND DRIVING THERE'S STRONG FUEL SMELL UNDER THE HOOD AND INSIDE THE CABIN. I HAVE POPPED THE HOOD AND CONFIRMED IS COMING FROM BACK PASSENGER SIDE OF INTAKE MANIFOLD WHERE THE FUEL LINES, RAILS, AND INJECTORS ARE. I HAVE CONFIRMED THIS TO BE RELATING TO SOA'S RECALL FOR THE 02-03 IMPREZA WRX'S HARD FUEL LINE / RUBBER HOSE LEAKING ISSUES. I LIVE IN SOUTHERN CALIFORNIA SO APPEARS EXTREME COLD WEATHER NOT THE CAUSE. LEAKING FUEL IS A HUGE SAFETY ISSUE!  *TR",
        "vin": "JF1GD70645L"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/12/2015",
        "dateOfIncident": "01/06/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10671710,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "ALL OF A SUDDEN I WAS UNABLE TO STEER THE CAR. SPECIFICALLY, ACCORDING TO MY MECHANIC THE O-RING FAILED IN THE STEERING PUMP RETURN HOSE. THIS CAUSED AN AIR LEAK  IT IS A GOOD THING I WAS ONLY GOING SLOWLY. THE CAR  HAD LOW MILEAGE. THE O-RING THAT FAILED WAS MADE OF PLASTIC AND BECAME WARPED DUE TO ENGINE HEAT OVER 9 YEARS.   THIS FAILURE COULD HAVE CAUSED A MAJOR CRASH AND DEATH TO THE OCCUPANTS IN THE CAR. I AM SURE THAT MY CAR WAS NOT THE ONLY ONE WITH THE O RING FAILURE. CHECK AT YOUTUBE. IN MY OPINION THERE SHOULD BE A RECALL FOR THIS CAR.  *TR",
        "vin": "JF1GD70675L"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/10/2015",
        "dateOfIncident": "01/08/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10671535,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "STRONG FUEL SMELL IN CABIN, DEALER CONFIRMED LEAKING FUEL HOSES.  *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/10/2015",
        "dateOfIncident": "01/04/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10671598,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS ABOUT TO TAKE MY 17 YEAR OLD SON OUT FOR A DRIVING LESSON.  THE RIGHT REAR BRAKE LINE BLEW AS WE WERE LEAVING OUR DRIVEWAY.  THANKFULLY WE WERE NOT GOING FAST AND HAD ENOUGH BRAKING TO STOP AT WHICH POINT I TOOK OVER AND USED THE PARKING BRAKE TO GET THE VEHICLE BACK TO OUR HOUSE.  AFTER FURTHER INSPECTION I DISCOVERED THE RIGHT REAR BREAK LINE CORRODED AND LEAKING AS IT EXITS THE INTERNAL FRAME OF THE VEHICLE JUST PRIOR TO A JUNCTION IN FRONT OF THE REAR WHEEL.  AFTER DOING SOME RESEARCH AND VISITING THE DANBURY SUBARU SERVICE DEPARTMENT I FOUND OUT THAT MANY SUBARU VEHICLES ARE BEING RECALLED FOR A SIMILAR REASON.  UNFORTUNATELY MY '05 IMPREZA IS NOT ON THE RECALL LIST EVEN THOUGH THE ACTIVE RECALL DESCRIBES MY VEHICLES PROBLEM EXACTLY.  IN FACT THIS CAR WAS REGISTERED IN VT IT'S WHOLE LIFE UP UNTIL RECENTLY WHEN I PURCHASED IT AND REGISTERED IT IN CT.  I BELIEVE THIS CAR SHOULD BE INCLUDED IN THE RECALL.  A CAR THAT IS 10 YEARS OLD WITH ONLY 86K MILES SHOULD NOT HAVE THE BRAKE LINES BREAKING.    *TR",
        "vin": "JF1GG67565G"
    },
    {
        "components": "STRUCTURE,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "12/10/2014",
        "dateOfIncident": "10/10/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10663478,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I APPLIED THE BRAKE AND SLOWED DOWN WHILE ENTERING THE GARAGE, THE CAR BECAME UNCONTROLLABLE.  IT REVVED AND ACCELERATED HITTING THE WALL BETWEEN THE GARAGE AND LAUNDRY ROOM.  THE CAR CAME TO REST APPROXIMATELY 4 FEET INSIDE THE LAUNDRY ROOM.  MY FOOT WAS NOT ON THE GAS; FLOOR MAT WAS ANCHORED TO THE FLOOR AND WAS NOT INVOLVED.  *TR",
        "vin": "JF1GG68545H"
    },
    {
        "components": "STRUCTURE,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "11/19/2014",
        "dateOfIncident": "10/10/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10659158,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "ON OCTOBER 10, 2014 AT 6:13 AM I DROVE HOME FROM THE GYM.  AS I APPROACHED MY HOUSE I OPENED THE GARAGE DOOR AND THE LIGHT CAME ON.  I SLOWED DOWN AND APPLIED THE BRAKE BEFORE ENTERING THE GARAGE, BUT THE CAR BECAME UNCONTROLLABLE.  IT REVVED AND ACCELERATED HITTING THE WALL BETWEEN THE GARAGE AND LAUNDRY ROOM.  IT FELT LIKE I WAS IN AN AIRPLANE TAKING OFF A RUNWAY.  THE CAR CAME TO REST APPROXIMATELY 4 FEET INSIDE THE LAUNDRY ROOM.  MY FOOT WAS NOT ON THE GAS; FLOOR MAT WAS ANCHORED TO THE FLOOR AND WAS NOT INVOLVED    THE ONLY THING THAT STOPPED ME FROM GOING THROUGH THE BACK WALL OF MY HOUSE WAS THE WASHING MACHINE.  THE CAR PUSHED IT INTO THE WALL. I WAS IN SHOCK AND DAZED, BUT MANAGED TO GET OUT OF THE CAR AND GO SEEK HELP FROM A NEIGHBOR ACROSS.  HE HAD HEARD THE IMPACT FROM THE ACCIDENT AND CAME IMMEDIATELY.  I HAVE A HOME ALARM SYSTEM SO THE ACCIDENT IMMEDIATELY ALERTED THE ALARM COMPANY, MY CALL LIST PEOPLE, AND NEIGHBORS.    I DID REPORT ACCIDENT TO SUBARU, IN WRITING.  *TR",
        "vin": "JF1GG68545H"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/22/2014",
        "dateOfIncident": "01/14/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10649283,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING COLD START THERE WAS A FUEL SMELL COMING FROM THE CAR.  THE CAR WAS TAKEN IN TO HAVE THE FUEL LINES TIGHTENED AT A COST OF $50.72.  THE PROBLEM WAS NOT PROPERLY CORRECTED AND THE FUEL SMELL RETURNED A COUPLE MORE TIMES BEFORE THE WEATHER WARMED UP.  I RECENTLY FOUND A RECALL (PROGRAM WVK-21) FOR THE 02-03 MODEL YEARS BUT NOTHING FOR 05 EVEN THOUGH THE PROBLEM EXISTS ON MY 05.  THE PROGRAM CONSISTS OF REPLACING THE HOSES WHICH WAS NOT DONE ON MY CAR.  I AM CONCERNED THAT WITHOUT A RECALL OF ALL THE AFFECTED VEHICLES THAT WHEN THE COLD WEATHER RETURNS THERE WILL BE A SERIOUS SAFETY ISSUE.  *TR",
        "vin": "JF1GD29615G"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/29/2014",
        "dateOfIncident": "08/15/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10629477,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2005 SUBARU IMPREZA. WHILE DRIVING 10 MPH AND MAKING A LEFT TURN, THE CONTACT CRASHED THE VEHICLE INTO ANOTHER VEHICLE. THE AIR BAGS FAILED TO DEPLOY AND A POLICE REPORT WAS FILED. THERE WERE NO INJURIES. THE VEHICLE WAS DESTROYED. THE FAILURE MILEAGE WAS 92,000.",
        "vin": "JF1GD296X5G"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/19/2014",
        "dateOfIncident": "01/06/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10626371,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 SUBARU IMPREZA. THE CONTACT STATED THAT FUEL FUMES WERE EMITTED INSIDE THE VEHICLE. THE DEALER STATED THAT THE FUEL LINES AND THE INTAKE MANIFOLD GASKETS NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 139,476.   UPDATED 10/02/14*LJ  UPDATED 10/23/14    UPDATED 3/30/15  *JS",
        "vin": "JF1GG68555H"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/23/2014",
        "dateOfIncident": "12/31/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10615829,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "EXPERIENCED STRONG FUEL SMELL IN CABIN AFTER COLD START ON A COUPLE OF COLD DAYS (~10F?) EXPERIENCED DURING TRIP NORTH FOR HOLIDAYS.  ODOR WENT AWAY AFTER ENGINE WARMED UP.  NO PROBLEM EVIDENT IN WARMER WEATHER.  SEEMS LIKELY THAT THIS IS SAME PROBLEM THAT LED TO RECALL OF EARLIER MY IMPREZAS.  *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/13/2014",
        "dateOfIncident": "01/24/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10564154,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING COLD WEATHER, A STRONG FUEL ODOR PERMEATES THE CABIN OF MY 2005 SUBARU IMPREZA WAGON.  UPON ENGINE WARM UP THE FUEL SMELL GOES AWAY.  *TR",
        "vin": "JF1GG29625G"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/28/2013",
        "dateOfIncident": "10/01/2012",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10549905,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL LINES SHRINK UNDER TEMPERATURES OF 30 DEGREES. A STRONG ODOR OF FUEL COMING FROM THE ENGINE BAY. SEEMS LIKE A VERY DANGEROUS SITUATION THAT MAY RESULT IN A EXPLOSION OR FIRE. I TOOK MY CAR TO THE DEALERSHIP AND THEY WANTED TO CHARGE ME $900 TO REPLACE 2 RUBBER FUEL LINES THAT ARE 3 INCHES LONG. THERE IS A RECALL ON THE 03 SUBARU IMPREZA FOR THE SAME ISSUE. I DON'T KNOW WHY THERE IS NO RECALL ON THE 04/05 SUBARU IMPREZA.  *TR",
        "vin": "JF1GD70665L"
    },
    {
        "components": "SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/29/2013",
        "dateOfIncident": "09/29/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10546120,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING. HIT A BUMP AS I WAS ATTEMPTING TO TAKE AN EXIT AND HIT A POT HOLE WHICH BENT MY RIMS AND DEPLETED THE AIR IN THE TIRES.  *TR",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/27/2013",
        "dateOfIncident": "01/01/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10504706,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS RESEARCHING THIS SITE FOR SOMETHING ELSE WHEN I CAME UPON COMPLAINTS ABOUT THE TOXIC SMELL OF GASOLINE/FUEL WHEN STARTING UP CERTAIN SUBARUS ON EXTREMELY COLD DAYS.  I LIVE IN COLORADO AND THE SMELL OF FUEL IS AWFUL WHEN THE CAR IS STARTED IN THE WINTER AND I CAN SOMETIMES SMELL IT WHILE OPERATING THE CAR.  I HAVE A 2005 SUBARU IMPREZA WRX.    MY CAR HAS HAD SO MANY PROBLEMS: BEARINGS IN THE TRANSFER BOX FAILING TWICE, THE FUEL PUMP FAILED (ON THE HIGHWAY NO LESS, WHERE I WAS ALMOST HIT BY A TRUCK BECAUSE MY CAR LOST POWER SO QUICKLY).  THE RADIATOR WENT...THE TURBO FAILED.  MY CAR HAS ALWAYS BEEN DUTIFULLY MAINTAINED.    IF THIS FUEL SMELL IS SERIOUS I HOPE SUBARU WILL HANDLE IT AS SUCH BUT MY EXPERIENCE WITH THE LOCAL DEALER AND SUBARU CORPORATE HAS LED NOWHERE.  *TR",
        "vin": "JF1GG29675G"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/20/2013",
        "dateOfIncident": "01/02/2008",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10503847,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "IN JANUARY 2008, I NOTICED A VERY STRONG SMELL OF GAS WHEN I STARTED A THE CAR ON A COLD DAY.  I OPENED THE HOOD AND SAW GAS DRIPPING FROM THE DRIVER LEFT SIDE OF THE ENGINE.  BECAUSE OF MY CONCERN OF A FIRE, I HAD THE CAR TOWED TO THE DEALER.  IT COST $491.30 PLUS TOWING TO HAVE THE FUEL LEAK FIXED.  THIS YEAR I STARTED SMELLING RAW GAS AGAIN WHEN THE CAR IS COLD.  I HAD IT CHECKED AT THE DEALER ON 1/16/2013 AND THEY DID NOT FIND ANYTHING.  I ASKED ABOUT RECALLS AND THEY SAID THERE WERE NONE. THE SMELL OF RAW GAS IS VERY STRONG ON MOST COLD DAYS AND I'M AFRAID THERE WILL BE A FIRE. WHEN I SEARCHED THE WEB FOR SUBARU IMPREZA COLD WEATHER FUEL LEAK IT LOOKS LIKE IT IS A WIDESPREAD CHRONIC PROBLEM.    DOES THERE HAVE TO BE FIRES AND INJURES BEFORE SUBARU IS FORCED TO FIX THIS MAJOR SAFETY ISSUE.  *TR",
        "vin": "JF1GD70685L"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/01/2013",
        "dateOfIncident": "02/01/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10496133,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN CAR IS IN MOTION AND THE HEATER IS ON THE SMELL OF BURNT OIL WHICH BECOMES WORSE WHEN THE CAR COMES TO A FULL STOP, VALVE COVER GASKETS LEAK ON TO THE EXHAUST MANIFOLD DUE TO POOR ENGINEERING MANY PARTS NEED TO BE REMOVED TO GAIN ACCESS WHICH IN RESULT CAUSES A VERY EXPENSIVE BILL.  *TR",
        "vin": "JF1GD296X5H"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/15/2013",
        "dateOfIncident": "01/12/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10493104,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "ON EXTREMELY COLD MORNINGS +/-0 DEGREES MY 2005 SUBARU IMPREZA RS HAS SUCH A STRONG FUEL SMELL THAT YOU CAN NOT USE THE HEAT SINCE YOU CAN'T TURN ON THE VENTS.  IF YOU TURN THE VENTS ON THE SMELL IS SO INTENSE THAT YOU GET LIGHTHEADED AND SICK.  YOU CAN SMELL THE FUEL SMELL OUTSIDE THE ENGINE AREA AND FUEL MILEAGE IS SO MUCH LOWER THAT YOU KNOW THAT IT IS LEAKING FUEL. CALLED SUBARU AND THEY REFUSE TO HELP WITHOUT CHARGING AND DID WARN OF THE POTENTIAL OF THE CAR CATCHING ON FIRE FROM THE FUEL LEAK.  *TR",
        "vin": "JF1GD67505H"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/01/2012",
        "dateOfIncident": "11/01/2011",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10446110,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 SUBARU IMPREZA. THE CONTACT STATED THAT WHILE STOPPED, THE READ END OF THE VEHICLE WAS SITTING MUCH LOWER THAN THE FRONT END. THE CONTACT ALSO STATED THAT A RATTLING NOISE WAS HEARD COMING FROM THE REAR WHILE DRIVING AT LOW SPEEDS. THE VEHICLE WAS NOT TAKEN TO THE DEALER FOR A DIAGNOSTIC TEST, BUT THE CONTACT STATED THAT THE REAR STRUTS MAY BE CAUSING THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 45,000.",
        "vin": "JF1GD70675L"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/16/2012",
        "dateOfIncident": "01/14/2012",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10443962,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "EXACT TO THE SUBARU RECALL ISSUED IN '09 (2002-2003 IMPREZA ONLY), MY 2005 SUBARU IMPREZA WRX SMELLS TERRIBLY OF GAS ON COLD MORNING WHEN I START THE VEHICLE. THE SMELL IS SO BAD THAT I CANNOT SIT IN THE CAR WITHOUT FEELING FAINT IF I DO NOT ROLL THE WINDOWS DOWN, AND CANNOT HAVE ANY PASSENGERS IN THE CAR AT STARTUP UNTIL THE CAR IS WARM AND DRIVEN AROUND THE BLOCK FOR FIVE MINUTES, WHICH IS THE WORST CONSIDERING THE COLD WINTERS I FACE IN CONNECTICUT. THIS SMELL OCCURS UPON STARTING THE VEHICLE AND LETTING IT IDLE FOR ABOUT AFTER A MINUTE, BUT ABOUT AFTER FIVE-TEN MINUTES OF DRIVING THE SMELL FINALLY GOES AWAY. I AM AWARE OF THE ISSUE WITH EARLIER YEAR MODELS, BUT AM SURPRISED AT THE FACT THAT THERE IS A GRAND AMOUNT OF PEOPLE WITH THE SAME EXACT ISSUE WITH 2004 AND UP IMPREZAS AS WELL, AND A RECALL HASN'T BEEN ISSUED YET (AND MY LOCAL SUBARU TOLD ME THAT I WOULD HAVE TO PAY FULL PRICE FOR THIS REPAIR WHICH MIGHT TAKE TWO DAYS AND COST AROUND 500$ AND UP..WOW!). THIS ONLY OCCURS WHEN IT IT BELOW ZERO, BUT FOR ME THAT IS QUITE COMMON DURING WINTER. I HAVE SEEN NUMEROUS REPORTS ONLINE THAT PEOPLE WITH MY YEAR HAVE CALLED SUBARU OF AMERICA, AND THAT THEY HAD PAID FOR THE CAR TO GET REPAIRED AS IF IT WAS A RECALL TYPE OF PROCEDURE, BUT PERSONALLY CALLED THEM TODAY AND WAS TOLD BY THE REP THAT THERE WERE NO SUCH REPORTED CASES WITH SUBARU OF AMERICA... SURE! QUITE DISAPPOINTING, BUT MOST OF ALL DANGEROUS, AND I DREAD DRIVING THE CAR AND PUTTING MYSELF AND OTHERS IN DANGER.  I WAS TOLD BY A TECH AT SUBARU THAT IF THERE WAS ANY SORT OF IGNITION OR SPARK AROUND THIS AREA FOR ANY MALFUNCTIONING REASON, OR AN ACCIDENT, THAT THERE WOULD BE A GOOD CHANCE THAT THE CAR MIGHT IGNITE. HELP ME OUT HERE, I KNOW I AM NOT THE ONLY ONE WITH THIS ISSUE WITH THIS YEAR AND MODEL SUBARU.  *TR",
        "vin": "JF1GD29655G"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/07/2011",
        "dateOfIncident": "06/01/2008",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10438848,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 SUBARU IMPREZA. WHILE DRIVING APPROXIMATELY 65 MPH, THE VEHICLE BEGAN TO DECELERATE. THE CONTACT SHUT THE VEHICLE OFF AND  REGAINED ACCELERATION AFTER RESTARTING. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSTIC. THE TECHNICIAN WAS UNABLE TO DIAGNOSE THE FAILURE BUT SUGGESTED THAT THE THROTTLE BODY BE REPLACED. THE THROTTLE BODY WAS REPLACED BUT THE FAILURE CONTINUED AFTER THE REPAIR. THE VEHICLE WAS NOT FURTHER REPAIRED. THE VIN WAS NOT AVAILABLE. THE APPROXIMATE FAILURE MILEAGE WAS 99,000.",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/20/2011",
        "dateOfIncident": "09/20/2011",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10432202,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 SUBARU IMPREZA. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, HE NOTICED A LOUD CLUNKING NOISE. HE LATER INSPECTED THE VEHICLE AND DISCOVERED THAT THE DRIVER SIDE FRONT LOWER CONTROL ARM WAS FRACTURED DUE TO CORROSION. THE VEHICLE WAS NOT INSPECTED BY A DEALER NOR REPAIRED. THE MANUFACTURER WAS CONTACTED AND THEY ADVISED HIM THAT THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN ID NUMBER 11V464000 (SUSPENSION:FRONT:CONTROL ARM:LOWER ARM). THE FAILURE MILEAGE WAS APPROXIMATELY 72,000.",
        "vin": "JF1GD67595G"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/31/2011",
        "dateOfIncident": "01/12/2011",
        "fire": true,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10403795,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JAN 12 2011 MY 2005 SUBARU IMPREZA WRX  STARTED TO HAVE A RAW FUEL SMELL COMING INTO THE CABIN AREA WHEN IT WAS COLD OUTSIDE NO MATTER IF IT WAS IN A GARAGE OR OUTSIDE. ON FURTHER INSPECTION I COULD SEE RAW FUEL STREAMING OUT OF THE FUEL LINES ONTO A HOT ENGINE BLOCK. THERE IS A RECALL FOR 02-03 SUBARU IMPREZAS WITH THE SAME PROBLEM, BUT IT DOES NOT COVER ANY NEWER MODELS WITH THE SAME FUEL DELIVERY SYSTEM PROBLEMS. NOTHING WAS DONE TO CORRECT IT BY THE DEALER BECAUSE IT WAS NOT COVERED BY THE RECALL. IT SHOULD HAVE BEEN COVERED BY SOME TYPE RECALL BECAUSE OF FOUND DEFECTS IN JUST SLIGHTLY OLDER MODELS BUT THE SAME ENGINE CONFIGURATION AND FUEL SYSTEM.  *TR",
        "vin": "JF1GD29675H"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/26/2011",
        "dateOfIncident": "01/01/2011",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10378716,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE RAW FUEL SMELL UPON START UP DURING COLD WEATHER.  FUEL DRIPS FROM THE FUEL LINE UNDER THE INTAKE MANIFOLD ON THE DRIVERS SIDE OF THE CAR AND/OR DRIPS FROM THE FUEL RAIL.     THIS IS A CONTINUING PROBLEM FOR  SUBARU IMPREZA'S FOR YEARS BEYOND THE RECALL THAT WAS ENTERED FOR THE 02-03 MODELS.      RESEARCH ON SEVERAL SUBARU FORUMS REFLECT IT IS STILL A VERY SIGNIFICANT PROBLEM ON 04-05 YEAR WRX IMPREZAS.  THERE HAVE BEEN SEVERAL FIRES AND ACCIDENTS CAUSED BY THE RAW FUEL DRIPPING ON THE HOT MOTOR BLOCK.     AT THIS TIME THERE IS NO ACTION BEING TAKEN BY SUBARU FOR THE LATER YEARS. *TR",
        "vin": "JF1GG29665G"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/28/2010",
        "dateOfIncident": "12/13/2010",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10372675,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 SUBARU IMPREZA WRX. THE CONTACT WAS DRIVING 25 MH WHEN THERE WAS AN OVERPOWERING GASOLINE ODOR EMITTING FROM THE AIR VENTS. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER FOR DIAGNOSIS.  THE DEALER TIGHTENED TWO HOSE FEEDER CLAMPS THAT WERE CONNECTED TO THE FUEL RAIL TO CORRECT THE PROBLEM. THE FAILURE RECURRED TWO WEEKS FOLLOWING THE REPAIR. THE VEHICLE WAS NOT FURTHER REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 71,000.",
        "vin": "JF1GG29655H"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/30/2010",
        "dateOfIncident": "03/25/2010",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10328287,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING IN MY CAR WOULD LOCK WHILE TRYING TO TURN MY CAR. THIS WOULD HAPPEN PERIODICALLY AND AT DIFFERENT SPEEDS. IT HAPPENED 5-6 TIMES BEFORE I TOOK IT IN AS I WAS AFRAID AN ACCIDENT MIGHT HAPPEN DUE TO NOT BEING ABLE TO TURN MY CAR. SUBARU DEALER SAID MY POWER STEERING PUMP WAS FAILING. DEALER ALSO STATED THAT A NEWER DESIGN POWER STEERING PUMP WOULD BE INSTALLED. THIS INDICATED TO ME THAT SUBARU HAD AN ISSUE WITH THIS, OTHERWISE WHAT WOULD BE THE REASON FOR A NEW DESIGN. *TR",
        "vin": "JF1GD70635L"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "02/04/2010",
        "dateOfIncident": "02/04/2010",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10305368,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS LEAK IN THE FUEL LINE CAUSING A STRONG RAW ODOR INSIDE THE VEHICLE ON COLD DAYS. THIS IS A KNOWN ISSUE FOR IMPREZA MODELS AND THERE IS RECENTLY A RECALL FOR THE 02-03 MODELS. CURRENTLY THERE IS NO RECALL FOR THE 04-05 MODELS YET. *TR",
        "vin": "JF1GD29675G"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/25/2009",
        "dateOfIncident": "08/14/2009",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10281765,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 SUBARU IMPREZA - OIL LIGHT NEVER CAME ON....THE CAR RAN OUT OF OIL AFTER ONLY 4000 MILES USING SYNTHETIC.  OTHER DRIVERS ONLINE REPORT THE OIL LIGHT NEVER COMES ON OR FLICKERS.  THIS COULD CAUSE A CRASH ON THE HIGHWAY IF THE ENGINE BLOWS UP. *TR",
        "vin": "JF1GG67575G"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/11/2009",
        "dateOfIncident": "02/21/2009",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10261523,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN IN TO STAR SUBARU FOR A TURBO CHANGE AND MY ENGINE WENT 1 WEEK LATER. MY CHECK ENGINE LIGHT WENT ON 2DAYS AFTER GOT CAR BACK FROM STAR SUBURU SERVICE AND LESS THEN A WEEK THE ENGINE WENT. HAD CAR TOWED BACK TO STAR SUBARU AND MY PISTON HAD SHATTERED. NOW THEY ARE SAID THAT IT WAS DO TO THE WAY THE CAR WAS DRIVEN AND SO THE SUBARU WARRANTY NOW DOESN'T WANT TO PAY TO FIX IT. MY UNDERSTANDING IS THAT THEY JUST PUT IN THE NEW TURBO WITHOUT CHECKING THE AIRFUEL WERE IT WAS AT OR THEY MAY HAD FORGOTTEN TO PUT IN THE OIL. I AM FIGHTING THE CASE AND THEY DON'T WANT TO ACCEPT THAT THEY DIDN'T DO WHAT THEY WERE SUPPOSE TO. MY CAR HAS BEEN IN AND OUT OF THE SUBARU SINCE I GOT IT I BOUGHT IT WITH 32,000 AND NOW IT HAS ABOUT 48,000. I ONLY HAVE THE HAVE 1 1/2 YEAR. IT HAS BEEN A NIGHTMARE WITH THIS CAR AND DEALING WITH STAR SUBARU AND THE SUBARU WARRANTY. *TR",
        "vin": "JF1GD70615L"
    },
    {
        "components": "SUSPENSION",
        "crash": true,
        "dateComplaintFiled": "10/17/2007",
        "dateOfIncident": "10/08/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 1,
        "numberOfInjuries": 1,
        "odiNumber": 10206154,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BROTHER WAS DRIVING HIS 2005 WRX STI ON A CLEAR MORNING ON DRY PAVEMENT AND LOST CONTROL.  THE CAR SLID OFF THE SHOULDER OF THE ROAD AND THEN CROSSED BACK OVER THE ROAD WHERE IT COLLIDED SIDEWAYS WITH A TREE.  THE VEHICLE MADE CONTACT WITH THE TREE ON THE DRIVER'S DOOR POST, KILLING HIM INSTANTLY AND INJURING THE PASSENGER.  UPON INSPECTION OF THE CAR, WE FOUND THAT THE DRIVER'S SIDE BALL JOINT SEPERATED FROM THE A-ARM.  IT APPEARED THAT THE THREADS ON THE BALL JOINT WERE WORN EXCESSIVELY AND MAY HAVE SEPERATED OR WERE SEPERATING PRIOR TO THE COLLISION.  WE SUSPECT THAT THIS COULD HAVE EVEN CAUSED THE LOSS OF CONTROL.  I KNOW THE CAR HAS AN EXCELLENT SAFETY RECORD, BUT WE CONTACTED SUBARU ABOUT THE BALL JOINT/A-ARM.  THEIR RESPONSE WAS THAT IT IS NOT A KNOWN PROBLEM.  IN ADDITION, THERE HAVE BEEN NO RECALLS OR SERVICE BULLETINS ON THIS.  WHEN WE SOLD THE CAR FOR SALVAGE, THE DEALER WHO BOUGHT IT TOLD US THAT HE DEALS IN  WRX STI PARTS.  HE TOLD US THAT THIS IS THE FIFTH SUBARU IMPREZA HE HAS PURCHASED WITH THE LOWER BALL JOINT SEPERATED FROM THE A-ARM.  BECAUSE OF THE FREQUENCY OF OCCURENCE, I THINK IT WARRANTS TRACKING, EVEN IF THE BALL JOINTS ARE SEPARATING DURING COLLISION.  THE PURCHASER WISHED TO REMAIN ANONYMOUS AND AGAIN, WE SOLD THE CAR FOR SALVAGE, BUT WE HAVE PICTURES OF THE CAR AND OF THE A-ARM AND BALLJOINT. IN ADDITION, THERE WAS NO APPARENT DAMAGE FROM IMPACT TO THE WHEEL OR TIRE.  *JB",
        "vin": "JF1GD70615L"
    },
    {
        "components": "PARKING BRAKE",
        "crash": true,
        "dateComplaintFiled": "09/26/2007",
        "dateOfIncident": "08/30/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10204208,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 SUBARU IMPREZA.  WHILE PARKED ON AN INCLINE WITH THE PARKING BRAKE ENGAGED, THE VEHICLE ROLLED DOWN A HILL, CRASHED THROUGH FENCES, AND STRUCK A MAILBOX.  THERE WERE NO INJURIES.  THE VEHICLE IS CURRENTLY AT A REPAIR SHOP AWAITING FURTHER INSPECTION TO DETERMINE WHY THE EMERGENCY BRAKE FAILED.  THE POWERTRAIN WAS UNKNOWN.  THE CURRENT AND FAILURE MILEAGES WERE 21,307.",
        "vin": "JF1GG685X5G"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/18/2007",
        "dateOfIncident": "11/27/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10196651,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "POTENZA RE92",
                "productYear": "9999",
                "size": "P205/60R16",
                "type": "Tire"
            }
        ],
        "summary": "I HAVE TWO SUBARUS WITH BRIDGESTONE POTENZA TIRES ON THEM.  ON TWO SEPARATE OCCASIONS, I EXPERIENCED FLAT TIRES WITH THEM.  ON BOTH OCCASIONS, THEY WENT FLAT SO FAST, I COULDN'T EVEN GET TO THE SHOULDER OF THE ROAD BEFORE I WAS RIDING ON THE RIM.  I HAVE NEVER HAD TIRES GO FLAT SO FAST.  IN BOTH CASES THE CAUSE WAS A SCREW IN THE TREAD.  *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/27/2006",
        "dateOfIncident": "11/23/2006",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10177082,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR STRUTS ON MY 2005 SUBARU IMPREZA HAVE BLOWN TREE TIMES SINCE VEHICLE PURCHASE IN JUNE 2005. SUBARU HAS CHANGED THE PN# TO AN UPDATED PART NUMBER BUT REFUSE TO REPLACE AGAIN STATING  MY VEHICLE MILEAGE HAS SURPASSED THEIR WARRANTY LIMITATION. THIS IS KNOWN DEFECT WITH MANY DOCUMENTED CASES. SUBARU IS AWARE OF THE ISSUE AND HAS ISSUED AN UPDATED PART TO REMEDY THE SITUATION. DEFECTIVE STRUTS ARE A SAFETY CONCERN AND CAN CAUSE AN ACCIDENT AND OR DEATH. A STRUT SHOULD NOT BE DEFECTIVE THREE TIMES IN A LITTLE OVER A YEAR ON A BRAND NEW CAR.   *NM",
        "vin": "JF1GD706X5L"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/22/2006",
        "dateOfIncident": "08/05/2006",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10174103,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THE VEHICLE'S CRUISE CONTROL TURNED ITSELF OFF WITHOUT WARNING.  THE SERVICE DEALER DETERMINED THE ELECTRONIC CONTROL MODULE WAS NOT CODED CORRECTLY AND COULD NOT BE FIXED.  UPDATED 1/19/2007 - THE CONSUMER EXPLAINED THAT THIS PROBLEM OCCURRED WHEN THE TANK WAS HALF FULL.  WHEN THE TANK WAS COMPLETELY FULL THE PROBLEM NEVER HAPPENED.  *NM",
        "vin": "JF1GD70645L"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/25/2006",
        "dateOfIncident": "06/08/2006",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10160712,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 6/8/06 I DROVE MY BRAND-NEW SUBARU IMPREZA 2005 (UNDER 6000 MILES AND NOT A WRX) STATION WAGON DOWN A COUNTRY ROAD AT APPROXIMATELY 25-30 MILES PER HOUR. THE ROAD WAS STRAIGHT AND LEVEL; THE SURFACE WAS SMOOTH AND DRY. TRAFFIC IN FRONT OF ME HAD STOPPED BEFORE A TRAFFIC LIGHT AND I APPLIED THE BRAKES IN A NORMAL FASHION. I FELT THE MOST UNUSUAL SENSATION: THE BRAKE PEDAL WENT DOWN EVER SO SLIGHTLY - I GUESS ABOUT ONE HALF INCH AT THE MOST, AND THEN IT FELT AS THOUGH I HAD HIT A BRICK, AS IF SOMEONE PLACED A SOLID OBJECT UNDER THE PEDAL. I PUSHED HARDER ON THE BRAKES AND ENDED ALMOST LYING IN AN EXTENDED POSITION, PUSHING THE BRAKES AS HARD AS I COULD. THE CAR DID NOT EVEN SLOW DOWN. THERE WAS NO ABS ACTIVITY, NO PULSATING BRAKE ACTION OR ANYTHING LIKE IT. I WAS IN SHOCK AS I REAR-ENDED THE CAR IN FRONT OF ME, STILL WAITING FOR THE LIGHT. THE IMPACT WAS SMALL, AND NO AIRBAGS WERE DEPLOYED. NO ONE WAS INJURED, THANK GOD.     MY SUBARU IS BEING FIXED AT THE TUNE OF $ 3500.00. THE OTHER CAR'S DAMAGE WAS MINIMAL AND ALL DAMAGE WOULD PROBABLY HAVE BEEN AVOIDED IF IT WOULD NOT HAVE BEEN A SUV WITH BIG SPARE ON THE BACK, EXTENDING ITS BUMPER.     I SPOKE WITH THE DEALERSHIP AND THEY TOLD ME TO BRING IN THE CAR FOR INSPECTION, ONCE IT IS FIXED. I MOST CERTAINLY PLAN TO DO THIS BUT SOMEHOW I DO NOT EXPECT MUCH HELP, ESPECIALLY AFTER READING OTHER SUBARU OWNER'S EXPERIENCE WITH PROBLEMS OF BRAKE FAILURE. I AM HOPING TO GET THE ABS SYSTEM DISABLED, UNLESS THEY CAN REPLACE IT. I FEEL VERY UNCOMFORTABLE ABOUT DRIVING THIS CAR, AND EVEN MORE UNCOMFORTABLE ABOUT SELLING IT TO SOME UNSUSPECTING SOUL. I WILL REGISTER THIS PROBLEMS WITH ALL POSSIBLE AGENCIES AND WAS COMFORTED TO LEARN ABOUT YOUR WEB-SITE. THANKS FOR BEING THERE. ANY ADVISE?  *JB",
        "vin": "JF1GG68565H"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/24/2006",
        "dateOfIncident": "06/17/2006",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10160660,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2005 WRX STI, AND THE PAINT HAS BEEN CHIPPING OFF!!! I STORE MY CAR PRIVATELY, IT ONLY HAS 18,000 MILES ON IT, AND THE PAINT GETS CHIPPED OFF BY ANYTHING AND EVERYTHING. I WAX THE CAR MONTHLY AND GET IT DETAILED QUARTERLY. WHAT KIND OF PAINT CHIPS THAT FAST? I HAVE OTHER FRIENDS WITH SUBARUS AND THEY HAVE THE SAME PROBLEM. THANKS FOR THE 32,000 DOLLAR LEMON. *JB",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "03/04/2006",
        "dateOfIncident": "12/02/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10151762,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD ONE ACCIDENT AND NUMEROUS ISSUES WITH MY ABS BRAKES NOT WORKING.  *JB",
        "vin": "JF1GD70685L"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/02/2006",
        "dateOfIncident": "01/26/2006",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10149282,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING THE VEHICLE WITHIN A RESIDENTIAL AREA, AROUND 35 MPH AND TRANSMISSION JUST DIED. ENGINE AND POWER WERE WORKING, HOWEVER THE CLUTCH AND TRANSMISSION WERE NOT RESPONDING. CAR WAS PICKED UP AND TOWED TO NEAREST SUBARU DEALER. DEALERSHIP REPORTED THE CLUTCH WAS WORN OUT BY DRIVER AND NEEDED REPLACEMENT. AT ONLY 9,000 MILES.   *NM",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/06/2006",
        "dateOfIncident": "12/17/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10147110,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THE TRANSMISSION STOPPED WORKING WITHOUT WARNING. THE CONTACT WAS DRIVING AT HIGHWAY SPEEDS WHEN THE VEHICLE SUDDENLY LOST POWER. THE VEHICLE WAS MANEUVERED TO THE SIDE OF THE ROAD SAFELY. THEN IT WAS TOWED TO THE LOCAL DEALER WHO DETERMINED THE  MANUAL TRANSMISSION NEEDED TO BE REPLACED.  *AK",
        "vin": "JF1GD29605G"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/05/2005",
        "dateOfIncident": "06/13/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10141830,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "EVENTS UP TO FAILURE - NOT RELATED TO FUEL LEVELS IN TANK. APPROACHING LEFT HAND 60-90 DEGREE TURN AT MODERATE SPEED AT NORMAL OPERATING VEHICLE TEMPERATURE.  FAILURE - FUEL CUTS OFF LEADING TO NO AVAILABLE POWER VIA THE THROTTLE. COMING OUT OF APEX OF THE TURN THE POWER RETURNS.*JB",
        "vin": "JF1GD70685L"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/23/2005",
        "dateOfIncident": "09/19/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10137428,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH AROUND 6,000 MILES ON MY 05 IMPREZA WRX STI A CLUNKING NOISE APPEARED IN THE REAR RIGHT SIDE SUSPENSION ASSEMBLY. THE DEALER INSPECTED AND FOUND A DAMAGED STRUT.  *NM",
        "vin": "JF1GD70625L"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "09/20/2005",
        "dateOfIncident": "08/26/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10137061,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THE CONTACT S IS A MEMBER OF A RELIGIOUS GROUP THAT OWNS A 2005 SUBARU IMPREZA.   THE CONTACT STATED  THAT WHILE DRIVING AND  WHEN PLACING THE VEHICLE IN REVERSE IT ACCELERATED BY ITSELF, CAUSING THE VEHICLE TO HIT A TREE.  THE CONTACT STATED THAT SHE DID NOT ACCELERATE.  DURING  THE FIRST TWO WEEKS OF PURCHASING THE VEHICLE IT ACCELERATED WITHOUT  PRESSING THE PEDAL.  THE AUTO REPAIR SHOP STATED THEY COULD NOT FIND ANYTHING WRONG WITH THE VEHICLE.  THE CONTACT  CONTACTED THE MANUFACTURER, BUT THEY STATED THAT THERE HAD NOT BEEN ANY REPORTS OF THIS HAPPENING.  THE CONTACT STATED THAT THE DEALERSHIP WAS GOING TO INSPECT THE VEHICLE TO DETERMINE THE CAUSE OF THE ACCELERATION.  *AK",
        "vin": "JF1GG67505H"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/08/2005",
        "dateOfIncident": "08/07/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10135856,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT AN 05 WRX IN THE END OF AUGUST. 2 WEEKS AND LESS THAN 500 MILES LATER THERE WAS A QUARTER SIZED SPOT ON THE DRIVER SIDE DOOR WHERE THE PAINT HAD COME OFF DOWN TO THE METAL. I NOTICED THE SPOT IMMEDIATELY AFTER WASHING MY CAR. AFTER SPEAKING WITH THE DEALER I CONTACTED SUBARU AND THEY TOLD ME IT WAS ENVIRONMENTAL DAMAGE AND THEY WOULD NOT COVER IT. FOR THE PAST 5 WEEKS I HAVE BEEN CONTACTING SUBARU AND THEY HAVE AGREED TO REPAINT ONLY THE AFFECTED BODY PANELS. HOWEVER, SINCE THE INITIAL SPOT THERE HAVE BEEN SEVERAL OTHER SPOTS ALL OVER THE CAR. I AM CURRENTLY TRYING TO GET THEM TO REPAINT THE ENTIRE CAR, ALTHOUGH I WOULD RATHER NOT HAVE A 7 WEEK OLD CAR COMPLETELY REPAINTED.  *NM",
        "vin": "JF1GD29625G"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "08/10/2005",
        "dateOfIncident": "08/08/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10132240,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "IT WAS A 95F DAY ,USING MY AIR CONDITIONER AND AFTER PULLING INTO MY GARAGE AT HOME MY DRIVER'S SIDE REAR WINDOW HAD AN EXPLOSIVE FAILURE CAUSING GLASS TO FLY INTO AND OUT OF THE CAR. THE SUBARU IS  A MONTH OLD AND HAD NOT HAD PRIOR IMPACTS TO THE WINDOW GLASS. I BELIEVE THAT IMPROPER TEMPERING AND IMPROPER WINDOW DESIGN/INSTALLATION DIDN'T ALLOW FOR THERMAL EXPANSION / CONTRACTION AND LED TO THE  FAILURE.  *NM",
        "vin": "JF1GD67595H"
    },
    {
        "components": "SUSPENSION,POWER TRAIN,AIR BAGS,SEAT BELTS,SEATS",
        "crash": true,
        "dateComplaintFiled": "04/27/2005",
        "dateOfIncident": "04/23/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10118595,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TRAVAILING 40-45 MPH ON A 2 LANE ROAD IN MY 2005 SUBARU WRX STI. I CAME OUT OF A SMALL S CURVE AND WENT OVER A ROUGH PATCH OF ROAD, AND THE TAIL END OF THE CAR STARTED SLIDING OUT TO THE RIGHT, THE NEXT THING I KNEW I HAD RAN INTO THE BANK AND I WAS FACING TRAFFIC, I HIT THE BANK AT LEAST 40 MPH, THERE WAS A CAR IN FRONT OF ME AND ONE BEHIND ME, AND ONE COMING IN THE OTHER LANE OF TRAFFIC.    IT FELT LIKE THE TAIL OF THE CAR HAD TIGHTENED UP AND SENT POWER TO THE REAR WHEELS AND KEPT ME SLIDING UNTIL RIGHT BEFORE I HIT THE BANK IT SWUNG THE CAR AROUND LIKE IT HAD SENT ALL POWER TO THE FRONT WITCH IN TURN PUT ME INTO THE BANK.    NOTHING WORKED.    NO AIR BAGS DEPLOYED.    THE SEAT BELTS DID NOT RESTRAIN ME, I HIT MY HEAD ON THE SIDE WINDOW    BECAUSE NONE OF THE SAFETY FEATURES WORKED ON THE CAR I SUSTAINED INJURIES INCLUDING: WHIP LASH, SEVERE HEADACHES AND I MAY HAVE A FRACTURED A VERTEBRA IN MY BACK.    CONTACTED SUBARU OF AMERICA AND THEY BLEW ME OFF SAYING THAT THERE WAS NO DEFECTS IN THE CAR, AND THAT THEY WAITED TILL THE GOVERNMENT TOLD THEM TO FIX SOMETHING BEFORE THEY WOULD FIX ANY PROBLEMS.",
        "vin": "JF1GD70625L"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "04/02/2005",
        "dateOfIncident": "02/15/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10116245,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "RAW FUEL ODOR INSIDE CABIN OF VEHICLE.  2005 SUBARU IMPREZA RS, RESEARCH FROM THE WEB RESULTED WITH MANY COMPLAINTS FROM ALL IMPREZA MODELS AND ONGOING PROBLEM PAST FEW YEARS.*AK",
        "vin": "JF1GD67545G"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/31/2005",
        "dateOfIncident": "03/27/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10116170,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LEFT REAR STRUT OF MY 2005 STI HAS FAILED TWICE IN LESS THAN 13K MILES.  THE FIRST FAILED AT AROUND 10K AND THE SECOND AT 12.6K MILES.  STRUT FAILURE ON A BUMPY ROAD AT HIGH SPEED COULD CAUSE LOSS OF VEHICHLE CONTROL AND COULD RESULT IN VERY SERIOUS INJURY OR DEATH.  SUBARU SHOULD ISSUE A RECALL AND REMEDY THE PROBLEM IMMEDIATELY.  ON A WEBSITE FOR STI OWNERS, THERE ARE OVER 100 OWNERS REPORTING THIS SAME PROBLEM.",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/30/2005",
        "dateOfIncident": "12/24/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10116084,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER ~3,000 MILES ON MY 05 IMPREZA WRX STI A CLUNKING NOISE APPEARED IN THE REAR DRIVER SIDE SUSPENSION ASSEMBLY. I DO NOT KNOW IF THIS IS POTENTIALLY HAZARDOUS, BUT IT DEFINITELY IS AN ANNOYANCE. THE DEALER DIAGNOSED IT AS A MISALIGNED SPRING AND CORRECTED THE PROBLEM FOR 3 DAYS, BUT THEN IT REAPPEARED. MANY OTHER OWNERS I'VE SPOKEN TO HAVE THE SAME PROBLEM AND IT'S SUPPOSEDLY A MFR DEFECT WITH THE STRUT ASSEMBLY. *AK",
        "vin": "JF1GD706X5L"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "03/21/2005",
        "dateOfIncident": "03/18/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10114447,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "HI, MY WIFE HAS A NEW SUBARU IMPREZA WRX (4000 MILES). A FEW DAYS AGO WHILE SHE WAS DRIVING IT, THE DRIVER?S SIDE WINDOW COMPLETELY SHATTERED. HERS WAS THE ONLY CAR ON THE ROAD AT THE TIME, AND NO VEHICLES HAD RECENTLY COME BY TO KICK UP A STONE. SUBARU ASSUMES SOMETHING EXTERNAL SHATTERED THE WINDOW, SO THAT WE HAVE TO PAY FOR THE REPAIR (ABOUT $500, WHICH IS OUR INSURANCE DEDUCTIBLE), BUT WE?RE WONDERING WHETHER A STRUCTURAL DEFECT COULD HAVE CAUSED THE PROBLEM. I WAS WONDERING WHETHER YOU HAD EVER HEARD OF A STRUCTURAL PROBLEM LIKE THIS IN GENERAL, AND FOR SUBARUS IN PARTICULAR.     THANK YOU.  *AK",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/08/2005",
        "dateOfIncident": "12/29/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10110137,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "SNOWSTORM DURING WHICH I LEFT WINDSHIELD WIPERS LOCKED OUT AWAY FROM THE WINDOW.  IN MORNING, HEATED VEHICLE UNTIL WIPE OF ICE/WATER (NO SCRAPE).  CLEANED WIPER BLADES OF MOST ICE, SET/DROPPED WIPER BLADE ON WINDSHIELD, CRACKING/PITTING WINDSHIELD, SHORTLY A CRACK HALF THE WINDOW LONG RAN OUT.*AK",
        "vin": "JF1GD67525H"
    }
]