[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/26/2009",
        "dateOfIncident": "08/27/2009",
        "fire": false,
        "manufacturer": "Tiffin Motorhomes, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10289786,
        "products": [
            {
                "manufacturer": "Tiffin Motorhomes, Inc.",
                "productMake": "TIFFIN",
                "productModel": "PHAETON",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 ALLEGRO (TIFFIN) PHAETON ON FREIGHTLINER XC CHASSIS WITH CATAPILLAR C7 ENGINE: TRAVELING FROM SARASOTA, FL TO SAN DIEGO, CA STARTING AUGUST 18, 2009 THE ENGINE BEGAN OVERHEATING ON AN EVER MORE FREQUENT BASIS UNTIL AUGUST 27, 2009, WHEN TRAVERSING THE MOUNTAINS WEST OF SAN DIEGO ON INTERSTATE 8 WE WERE FORCED TO STOP ON THE SIDE OF THE HIGHWAY EVERY ONE HALF TO ONE MILE TO COOL DOWN THE ENGINE TO A WORKABLE LEVEL.  THESE FREQUENT STOPS CREATED A HAZARD FOR EVERYONE ELSE TRAVELING THAT STRETCH OF HIGHWAY AND CREATED A RISK OF ENGINE FAILURE AND/OR FIRE IN A GENERALLY REMOTE AREA.  DURING ONE SUCH STOP WE DID SCRAPE THE SIDE OF THE VEHICLE ON A GUARD RAIL UNDER A RAILROAD TRESTLE. THE DAMAGE HAS NOT YET BEEN ESTIMATED BUT I EXPECT IT TO BE APPROXIMATELY $3,000.    THE PROBLEM WAS EVENTUALLY TRACED BY FREIGHTLINER SAN DIEGO TO A TOO SHORT CRANKCASE BLOWBY VENT ON THE ENGINE THAT ALLOWED CRANKCASE OIL MIST TO BE SPRAYED ON THE FORWARD SIDE OF THE RADIATOR BY THE COOLING FAN. SUBSEQUENTLY, DUST AND DIRT THROWN UP DURING DRIVING WAS ABSORBED BY THE OIL AND ESSENTIALLY BLOCKED THE AIR FLOW OVER THE RADIATOR. AFTER SOME MILES (OURS WAS AT ABOUT 49000+ MILES) THE BLOCKAGE BECOMES GREAT ENOUGH TO CAUSE ALMOST TOTAL FAILURE. GIVEN ITS LOCATION THE SIDE OF THE RADIATOR AFFECTED IS NOT VISIBLE TO INSPECTION WITHOUT SIGNIFICANT EFFORT.    THE SOLUTION WAS TO REMOVE THE RADIATOR AND THE AIR CHARGE COOLER, CLEAN THEM AND REINSTALL THEM.  IN ADDITION, FREIGHTLINER PROVIDED A REPLACEMENT FOR THE CRANKCASE BLOWBY TUBE THAT IS LONGER AND SENDS THE OIL BELOW THE RADIATOR (I.E., THIS IS A KNOWN PROBLEM AT FREIGHTLINER). I DO NOT HAVE THE ORIGINAL TUBE. THE COST FOR THE CLEANING WAS $2,403.78 AND THE PART WAS $256.58 (DONE AT SEPARATE FACILITIES).*TR",
        "vin": "4UZAAHDCX5C"
    }
]