[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/16/2020",
        "dateOfIncident": "10/01/2020",
        "fire": false,
        "manufacturer": "Charles Machine Works, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364629,
        "products": [
            {
                "manufacturer": "Charles Machine Works, Inc.",
                "productMake": "TRAILER",
                "productModel": "T18S",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A CARSON FLAT BED TRAILER N/A EQUIP WITH FOUR COMMODORE TIRES SIZED 205/75R/15, TIRE LINE: UNKNOWNM, DOT RYB30MAC4612/1913. THE CONTACT DISCOVERED THAT THE TREAD HAD SEPARATED ON  BOTH REAR AND FRONT DRIVERS SIDE TIRES. THE CONTACT INDICATED THAT AT THE TIME OF THE FAILURE THE TRAILER WAS PARKED AND HAD NOT BEEN MOVED FOR SEVERAL MONTHS. THE LOCAL DEALER BIG O TIRES LOCATED AT 7690 E. STATE ROUTE 69, PRESCOTT VALLEY AZ. WAS NOTIFIED OF THE FAILURE. THE MANUFACTURER WAS NOT CONTACTED. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. NO ADDITIONAL INFORMATION WAS AVAILABLE.. THE FAILURE MILEAGE WAS APPROXIMATELY 5,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "01/24/2018",
        "dateOfIncident": "11/24/2017",
        "fire": false,
        "manufacturer": "Charles Machine Works, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11064591,
        "products": [
            {
                "manufacturer": "Charles Machine Works, Inc.",
                "productMake": "TRAILER",
                "productModel": "T18S",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Harbor Freight Tools",
                "productMake": "INNOVA",
                "productModel": "ULTRA RUNNER",
                "productYear": "9999",
                "size": "4.80/4.00X12",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 SHELBY TRAILER HARBOR FREIGHT (NA) EQUIPPED WITH INNOVA ULTRA RUNNER UTILITY TRAILER TIRES, TIRE LINE: TINOFCB, TIRE SIZE: 5.3X12 AND 4.80/4.00X12. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17T017000 (TIRES); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER WAS NOT CONTACTED. THE HARBOR FREIGHT MANUFACTURER WAS CONTACTED AT 800-444-3353 AND STATED THAT THEY WERE NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. A CASE NUMBER WAS NOT PROVIDED. THE DOT NUMBER AND VIN WERE UNKNOWN. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/07/2010",
        "dateOfIncident": "09/02/2010",
        "fire": false,
        "manufacturer": "Charles Machine Works, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10354125,
        "products": [
            {
                "manufacturer": "Charles Machine Works, Inc.",
                "productMake": "TRAILER",
                "productModel": "T18S",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "GALAXY TRAILER SPECIAL,14 PLY, LOAD RANGE G, 8-14.5 LT MADE IN CHINA. # ON TIRE GTWDO5-8145T5-O1T.NO DOT # ON TIRE. SOLD BY ECONOLINE, THEIR PHONE # 205 489 5318. EXTRA # ON TIRE H-105-01 & GTWDO5-8-O1B, ALL SO 403-0250. A 12 INCH SEPARATION FROM THE NYLON CORE ON THE SIDE WALL OF THE TIRE THIS HAS HAPPEN FOUR TIMES IN ONE YEAR THE SAME BRAND OF TIRE THAT CAME WITH THE TRAILER.  *TR",
        "vin": "42EDPGG2551"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/12/2010",
        "dateOfIncident": "12/26/2009",
        "fire": false,
        "manufacturer": "Charles Machine Works, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10299114,
        "products": [
            {
                "manufacturer": "Charles Machine Works, Inc.",
                "productMake": "TRAILER",
                "productModel": "T18S",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I RENTED A U-HAUL FROM A U-HAUL VENDOR BEST VALUE INN IN NEPTUNE, NJ ON DECEMBER 24TH. WHEN I RENTED THE TRUCK THERE APPEARED TO BE NO PROBLEMS. ON THE MORNING ON DECEMBER 26TH AFTER THE TRUCK WAS LOADED I WAS LEAVING MY HOME IN WALL, NJ TO DRIVE TO FORT LAUDERDALE, FL FOR COLLEGE. WHEN I REALIZED THAT I HAD FORGOTTEN SOMETHING AT HOME I TURNED AROUND. I NOTICED THAT THE TRUCK SEEMED TO BE MAKING AN ODD NOISE WHEN I TURNED BUT ASSUMED THAT IT WAS CAUSED BY THE WEIGHT IN THE BACK OF THE TRUCK. I ARRIVED HOME AND NOTICED THAT THE SKIRT OF THE TRUCK WAS PUSHED UP AGAINST THE TIRE. I CONTACTED U-HAUL AND THEY SENT OUT A REPAIR SERVICE THEY CONTRACTED WITH. THE REPAIR SERVICE SAID THAT AN AXLE WAS BROKEN ON THE TRUCK WHICH WOULD HAVE CAUSE THE TRUCK TO CRASH ESPECIALLY IF I HAD NOT BEEN LUCKY ENOUGH TO HAVE FORGOTTEN SOMETHING AT HOME. AFTER HOURS LATER WE FINALLY GOT A NEW TRUCK WHICH SET UP BACK RESORTING IN HAVING TO SPEND ADDITIONAL MONEY ON A HOTEL AS WELL AS GAS SINCE WE HAD ALREADY PUT GAS IN THE FIRST TRUCK. I AM GOING AWAY TO COLLEGE AND NOT ONLY DO I HAVE TO WORRY ABOUT MY SAFETY BUT NOW MORE ADDITIONAL PROBLEMS I CAN NOT AFFORD. AFTER WEEKS ON BEING SENT BACK AND FORTH WITH U-HAUL TO DIFFERENT PEOPLE I AM FINALLY CONTACTED BY THERE MARKETING PRESIDENT PAUL KELLY. PAUL TELLS ME THAT IT WAS MY FAULT, THAT I CAUSED THE DAMAGE AND THAT HE WILL NOT DO ANYTHING TO COMPENSATE ME AND WOULD NOT CONDUCT A FURTHER INVESTIGATION OR RELEASE ANY INFORMATION TO ME EVEN REGARDING AN INVESTIGATION. ALL I WANTED TO DO WAS GET TO FLORIDA, SAFE, WITH NO PROBLEMS, AND ATTEND MY FIRST WEEK OF SCHOOL NOT ACCUSED WHEN I WAS NOT AT FAULT AND HAD TO SPEND ADDITIONAL EXPENSES NOT TO RELATED TO THE COST OF MY TRIP. U-HAUL ADMITTED BLAME IN THE BEGINNING AND IT SHOULD BE THE RESPONSIBILITY OF THIS COMPANY TO UPHOLD THERE CONTACTS AS WELL AS PUBLIC SAFETY STANDARDS WHICH THEY CHOOSE TO DISREGARD. THERE OWN MECHANIC STATED HIMSELF THAT IT WAS CAUSED BY A LOOSE BOLT WITH DOCUMENTATION! *TR",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "04/29/2008",
        "dateOfIncident": "07/06/2007",
        "fire": false,
        "manufacturer": "Charles Machine Works, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10226099,
        "products": [
            {
                "manufacturer": "Charles Machine Works, Inc.",
                "productMake": "TRAILER",
                "productModel": "T18S",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "TRAILER MARATHON RAD",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "I WAS PULLING MY TRAVEL TRAILER ON I-10 WEST OF MARIANNA, FL. JULY 2007. LOST BOTH LS TIRES FROM TIRE TREAD SEPARATION. TEMPERATURES AROUND 98 AND NO TIRE IMPACT FOUND. SPOKE WITH SEVERAL INDEPENDENT TIRE DEALERS AND CHECKED THE GOOGLE INTERNET SEARCH FOUND LOTS OF COMPLAINTS ABOUT TIRE FAILURE WITH THE GOODYEAR MARATHON ST TRAILER TIRES.",
        "vin": "4WYT04N2351"
    }
]