[
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/07/2022",
        "dateOfIncident": "12/30/2021",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446561,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "Fuel smell in and around car. Previous recall on cracked fuel pump causing odor was completed by Powell Volvo in 2010. The same defect may have happened recently as the odor was noticed in December 2021 and is now stronger. Volvo may have extended the warranty.",
        "vin": "YV1TS911851"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/08/2021",
        "dateOfIncident": "07/11/2021",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436095,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "When I was closing the passenger door, it did not close tight. So I opened it again and shut it a bit harder. When I shut it harder, the passenger side seat airbag and the top passenger side airbag deployed. If I had been sitting inside the car at the time, I could have been injured as small things exploded inside the car and it filled with a smoky powder. We took it to a Volvo dealership and they inspected it but have not relayed thier findings to me. Even tho I have called several times to find out. They never return my calls. Their was no warning or lights on prior to the incident. I know about the drivers side airbag recall but was wondering if their were other airbag issues they have not told us about? It will cost about $1500 to have the airbags replaced and from what I understand, none of the airbags will work now untill the deployed ones have been replaced. And I think it is a manufacturing issue that has made this problem. I just want to kmow if this has happened to other volvo owners? And if Volvo should be required to fix our airbags.",
        "vin": "YV1TR911951"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/24/2019",
        "dateOfIncident": "12/01/2018",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11257840,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 VOLVO S80. WHILE DRIVING 70 MPH AND DEPRESSING THE ACCELERATOR PEDAL, THE VEHICLE BEGAN TO DECELERATE. THE CONTACT STATED THAT THE CHECK ENGINE, ABS, AND BRAKE FAILURE, STOP SAFELY WARNING INDICATORS ILLUMINATED. THE CONTACT ASSOCIATED THE FAILURE WITH NHTSA CAMPAIGN NUMBER: 09V483000 (FUEL SYSTEM, GASOLINE). THE VEHICLE WAS TAKEN TO MULTIPLE INDEPENDENT MECHANICS FOR DIAGNOSTIC TESTING AND THE FUEL SYSTEM FAULTY CODE WAS FOUND. THE VEHICLE WAS TAKEN TO AUTOBAHN VOLVO FORT WORTH (LOCATED AT 2910 WHITE SETTLEMENT RD, FORT WORTH, TX 76107, (844) 702-9350), BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 140,000.",
        "vin": "YV1TS592351"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/26/2017",
        "dateOfIncident": "05/05/2017",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10991819,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACTS GIRLFRIEND OWNS A 2005 VOLVO S80. THE CONTACT STATED THAT WHILE THE BRAKE PEDAL WAS DEPRESSED, THE VEHICLE WAS DIFFICULT TO STOP. THE CONTACT STATED THAT HE HAD TO APPLY PRESSURE WITH FORCE IN ORDER TO STOP. THE CONTACT ALSO STATED THAT THE ENGINE STALLED. THE ABS AND THE CHECK ENGINE WARNING LIGHTS ILLUMINATED. THE CONTACT CALLED THE LOCAL DEALER AT ONTARIO VOLVO AT PHONE NUMBER: 909-230-9653 AND THE DEALER STATED THAT THE VEHICLE WAS NOT INCLUDED IN ANY RECALL. THE VEHICLE WAS NOT DIAGNOSED. THE CONTACT STATED THAT HE REPLACED THE BRAKES. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 106,000.",
        "vin": "YV1TS592451"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/26/2016",
        "dateOfIncident": "09/21/2016",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10937413,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA",
        "vin": "YV1TS911351"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/29/2015",
        "dateOfIncident": "05/03/2013",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10722149,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 VOLVO S80. WHILE DRIVING APPROXIMATELY 50 MPH, THE VEHICLE STALLED WITHOUT WARNING. AFTER RESTARTING, THE VEHICLE RESUMED NORMAL OPERATION. THE FAILURE RECURRED CONTINUOUSLY. THE VEHICLE WAS TAKEN TO THE DEALER ON MULTIPLE OCCASIONS FOR DIAGNOSTIC TESTING. THE TROUBLE CODE DETECTED A FAILURE WITH THE FUEL PRESSURE SENSOR. IN ADDITION, THE ABS WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 135,000.",
        "vin": "YV1TS592051"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/05/2015",
        "dateOfIncident": "02/11/2013",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10681440,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 VOLVO S80. WHILE DRIVING APPROXIMATELY 65 MPH, THE VEHICLE'S SPEED REDUCED AND \"REDUCED ENGINE PERFORMANCE\" APPEARED ON THE INSTRUMENT PANEL. THE VEHICLE SPUTTERED. THE CONTACT STATED THAT THE VEHICLE WAS NOT ABLE TO BE DRIVEN TWO YEARS AGO. THE FAILURE RECURRED ON MULTIPLE OCCASIONS. THE VEHICLE WAS TOWED TO A DEALER, WHO DIAGNOSED THAT THE ETM NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE CONTACT NOTIFIED THE MANUFACTURER. THE APPROXIMATE FAILURE MILEAGE WAS 81,000. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/05/2015",
        "dateOfIncident": "10/10/2014",
        "fire": true,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10670225,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 VOLVO S80. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 70 MPH, THE VEHICLE STARTED TO RATTLE AND SMOKE WAS EMITTING FROM THE FRONT OF THE VEHICLE WITHOUT WARNING. THE CONTACT TRIED TO MERGE OVER TO THE SLOWER LANE AND DISCOVERED THAT THE BRAKE PEDAL HAD BECOME INOPERABLE.  THE VEHICLE COASTED TO A STOP AND SHORTLY AFTER THE VEHICLE EXPLODED.  A POLICE REPORT WAS FILED BUT THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE VEHICLE WAS DESTROYED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 118,000.",
        "vin": "YV1TS592851"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/06/2014",
        "dateOfIncident": "06/27/2013",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10619365,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 VOLVO S80. THE CONTACT STATED WHEN VEHICLE WAS PARK THE ENGINE ACCELERATED OWN ITS OWN. THE FAILURE OCCURRED NUMEROUS OF TIMES. THE VEHICLE WAS TAKEN TO THE DEALER AND THEY WERE UNABLE TO DIAGNOSE A FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 67,000.",
        "vin": "YV1TS592251"
    },
    {
        "components": "STEERING,SUSPENSION,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/03/2013",
        "dateOfIncident": "05/01/2013",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10510471,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WE OWN A BEAUTIFUL 2005 VOLVO S80 T6 TOP OF THE LINE (FULLY LOADED, TWIN TURBOS,18\" RIMS, METALLIC GREEN PAINT & PARKING SENSORS) ONLY 80,300 MILES. IT'S A $46,000 CAR UNFORTUNATELY IT IS NOT SAFE FOR THE ROAD AND IS A HAZARD TO ALL. IT CANNOT GO OVER SPEED BUMPS WITHOUT SHAKING EVERYONE INSIDE VIOLENTLY. WHEN DRIVING THE CAR THE TRANSMISSION WILL SLIP AND STUTTER AT LOW SPEEDS MEANING WE CANNOT MERGE INTO TRAFFIC! THERE IS ALSO COOLANT LEAKING EVERYWHERE AND SPILLING TO STORM DRAINS AND SEWERS    LIST OF DIAGNOSED PROBLEMS:  -TRANSMISSION REBUILD NEED (EVEN AFTER PAID $150 FOR TRANSMISSION SOFTWARE UPGRADE)  -LEFT SIDE WINDOW COMES UP AND GOES DOWN  -CHECK ENGINE LIGHT COMES AND GOES  -WATER PUMP HAS LEAK  -CRANKCASE VENTILATION SYSTEM IS CLOGGED.  -CAR CANNOT HOLD ALIGNMENT AND VEERS OFF  -CONTROL ARMS AND BUSHINGS ARE BAD    CAR HAS BEEN SERVICED AT A SMALL SWEDE SHOP & VOLVO SANTA ANA FREQUENTLY AND BABIED. IT HAS NEW FRONT STRUTS, NEW BELTS, NEW BRAKES, NEW REAR TIRES, NEW CABIN FILTER, ETC. SPENT MORE THAN $2.5K IN THE LAST YEAR ALREADY. VOLVO CORPORATE DENIED ANY ASSISTANCE AND SAID THERE WERE 800 FIXES MADE IN THE MODEL YEAR 2004. OBVIOUSLY THE CAR IS FLAWED.  *TR",
        "vin": "YV1TS911051"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/02/2013",
        "dateOfIncident": "02/27/2013",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10501036,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL LEAK AT TOP OF PUMP UNDER RECALL, INSPECTION AND REPAIR AT NO COST REFUSED BY VOLVO.    MY VOLVO S80, 2005 WAS PURCHASED AS A USED VEHICLE IN SAN DIEGO CA FROM THE VOLVO DEALER ABOUT 2 YEARS AGO.    THE FUEL LEAK LOCATION WAS DIAGNOSED BY INDEPENDENT SHOP AND THEY CONFIRMED THE PUMP WAS UNDER RECALL. THE INDEPENDENT SHOP RECOMMEND TAKING THE CAR TO THE LOCAL DEALER FOR REPLACEMENT AT NO CHARGE UNDER THE NHTSA RECALL NOTICE. WHEN THE CAR WAS TAKEN TO THE LOCAL DEALER NO INSPECTION WAS PERFORMED AND I WAS TOLD THE RECALL NOTICE DID NOT APPLY TO MY VIN.    I REQUESTED THE DEFECTIVE PART RETURNED TO ME AND ONLY THEN VOLVO DISTRICT SAID THEY WOULD PROVIDE THE PART (APPROX $500) BUT WANTED ME TO PAY FOR LABOR (APPROX $250). THEY ALSO WANTED THE DEFECTIVE PUMP RETURNED TO THEM. I REFUSED VOLVO'S OFFER, TOOK PICTURES OF THE DEFECTIVE PUMP AND CONFIRMED IT MATCHED DESCRIPTION IN THE NHTSA RECALL NOTICE AND THE INDEPENDENT SHOP DIAGNOSES.    THE PUMP FUEL LEAK IS UNDER THE REAR SEAT WHERE CHILDREN IN SAFETY SEATS ARE EXPOSED TO INTENSE FUMES. EVERYBODY IN THE CABIN IS EXPOSED TO HIGH LEVELS OF FUMES FROM RESIDUE FUEL AT ALL TIMES FROM WHEN THE ENGINE WAS LAST OPERATED. THE DEALER FAILED TO FOLLOW THE RECALL NOTICE PROCEDURE FOR INSPECTION. THE NOTICE DOES NOT LIST A VIN RANGE. IF MY VIN AND/OR PUMP MODEL IS NOT INCLUDED IN THE ORIGINAL RECALL IT SHOULD BE!    IT APPEARS VOLVO IS LIMITING THE RECALL SCOPE OR DENYING LEGITIMATE CLAIMS FOR A SERIOUS SAFETY RECALLED ITEM.    I HAVE REQUESTED THE DEALER RETAIN ALL PARTS, RECORDS AND DOCUMENT THE ISSUE OF THE FUEL LEAK ON MY VEHICLE. I PLAN ON PICKING UP THE CAR NO LATER THAN MARCH 6 2013 REPAIRED BY VOLVO AT NO COST OR NOT.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/27/2011",
        "dateOfIncident": "07/23/2011",
        "fire": true,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10415427,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "B+ BATTERY CABLE AT STARTER SOLENOID SHORTED TO STARTER CASE AND GROUNDED.  CAUSING A FIRE IN ENGINE COMPARTMENT.  CAR SHUT DOWN WITHOUT WARNING.  ENGINE WENT OFF, LIGHTS WENT OUT ALL IN AN INSTANT.  EMERGENCY FLASHERS WERE INOPERATIVE.  PULLED OFF TO THE SIDE OF THE ROAD AND STOPPED USING THE EMERGENCY BRAKE.  SMOKE WAS COMING FROM UNDER THE HOOD.  OPENED THE HOOD AND FOUND THE FRONT OF THE ENGINE ON FIRE.  EXTINGUISHED THE FLAMES.  DISCONNECTED THE NEGATIVE TERMINAL ON THE BATTERY LOCATED IN THE TRUNK,  CAR TOWED TO DEALER, IN PROCESS OF REPAIR.  *TR",
        "vin": "YV1TR911751"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "01/12/2011",
        "dateOfIncident": "01/12/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10376459,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNIROYAL TIRE CO.",
                "productMake": "UNIROYAL",
                "productModel": "TIGERPAW",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "WHILE DRIVING ON AN INTERSTATE AT APPROXIMATELY 70MPH A VERY SLIGHT ROAD VIBRATION WAS FELT APPROXIMATELY 1 MINUTE BEFORE THE REAR DRIVER SIDE TIRE COMPLETELY FAILED. THERE WAS A LOUD AUDIBLE THUMP AS THE VEHICLE UNINTENTIONALLY JERKED TO THE LEFT. I WAS ABLE TO MAINTAIN CONTROL OF THE VEHICLE AND STOP SAFELY. UPON INSPECTION, BOTH SIDEWALLS OF THE TIRE HAD SEPARATED FROM TOP TREAD SECTION AND THE TIRE WAS IN THREE COMPLETE PIECES. THE WHEEL INCURRED MINOR DAMAGE. THE VEHICLE WAS NOT OVERLOADED. THE TIRE WAS BELIEVED TO BE AT THE CORRECT PRESSURE AND SHOWED NO SIGNS OF PUNCTURE OR OBVIOUS CAUSE OF FAILURE. THE TIRE WAS PURCHASED AND MOUNTED PROFESSIONALLY 43 DAYS BEFORE THE FAILURE. *TR",
        "vin": ""
    },
    {
        "components": "STEERING,SUSPENSION,POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/08/2007",
        "dateOfIncident": "04/08/2007",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10187290,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 07/21/07 I PURCHASED A 2005 VOLVO S80 T6 FROM MOMENTUM VOLVO IN HOUSTON, TX.  IT WAS DELIVERED ON 08/02/2005 BRAND NEW WITH 7 MILES ON IT. THE FOLLOWING ARE AN ACCOUNT OF THE ISSUES AND SAFETY HAZARDS THIS CAR HAS HAD WITHIN THE LAST 18 MONTHS AND 24,000 MILES.   THE FIRST ISSUE WAS DAMAGE FROM TRANSIT -  FRONT AND REAR BUMPER HAD TO BE REPAIRED AND PAINTED.  THE SECOND ISSUE  - CHECK ENGINE LIGHT CAME ON 01/14/06. IT WAS AN EXHAUST LEAK. I ALSO COMPLAINED OF NO AM RECEPTION (FIXED) .  THE THIRD ISSUE - CHECK ENGINE LIGHT CAME ON AGAIN ON 01/30/06. THIS TIME IT WAS A FAULTY LEAKAGE DETECTION PUMPED IN THE EXHAUST THAT WAS REPLACED. I COMPLAINED AGAIN OF NO AM RECEPTION.   THE FOURTH ISSUE -  CAR WAS IN SHOP FOR RECALL WORK FOR AN ELECTRICAL ISSUE WITH THE STARTER SOLENOID AND THE BATTERY CABLES. I INFORMED THEM THERE WAS A POPPING NOISE UNDER THE HOOD AND THAT THERE WAS NOISE WHEN TURNING LEFT. MOMENTUM BLAMED IT ON THE TIRES NEEDING REPLACED ON A CAR THAT HAD 14,913 MILES ON IT - NO WORK DONE. COMPLAINED OF NO AM RECEPTION.  THE FIFTH ISSUE -  CAR WAS AT MOMENTUM FROM 01/30/07 - 02/08/07 BECAUSE POPPING NOISE UNDER HOOD AND CLICKING NOISE CAR MADE WHEN TURNING SHARPLY TO THE LEFT. EXPLANATION -  POPPING NOISE WAS BECAUSE STRUTS WERE NOT TIGHTENED ORIGINALLY. THE CLICKING NOISE WAS NOT FOUND, BUT THEY DID FIND THAT THE POWER STEERING WAS NOT WORKING AND REPLACED THE POWER STEERING AND REPLACED THE STEERING RACK AND STEERING SHAFT. RESOLVED AM ISSUE.  THE SIXTH ISSUE -  CAR WENT BACK TO SHOP ON 02/09/07 - 02/17/07 BECAUSE OF NOISE WHEN TURNING LEFT. EXPLANATION - FRAME NOT BEING TIGHTENED. CORRECTED.   THE SEVENTH ISSUE THAT THEY DID NOT FIX THE SIXTH ISSUE. I DROVE RIGHT BACK TO MOMENTUM. EXPLANATION - FAULTY ELECTRICAL WIRING UNDER DRIVER'S SEAT WHERE TWO WIRES WERE BEING GROUND OUT. *AK  THE EIGHTH ISSUE WAS ON APRIL 8, 2007 - AUTOMOBILE HAS POPPING SOUND UNDER HOOD AGAIN  THERE IS A METAL GRINDING METAL FROM THE PASSENGER SIDE OF CAR NEAR BACK WHEEL.  *AK",
        "vin": "YV1TS911051"
    },
    {
        "components": "SUSPENSION,ENGINE AND ENGINE COOLING",
        "crash": true,
        "dateComplaintFiled": "09/27/2005",
        "dateOfIncident": "09/17/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10137856,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "1)  EVENTS LEADING UP TO FAILURE:  PURCHASED NEW VOLVO S80 CAR ON 9/3/2005 WITH 813 MILES, DROVE IT HOME.  NO INFORMATION WAS GIVEN ON THE 813 MILES ALREADY ON THE CAR.  THE NEXT DAY THERE WERE OIL PUDDLES UNDERNEATH CAR AND OIL WAS ALL OVER THE PASSENGER SIDE FRAME UNDERNEATH THE CAR.  THE CAR WAS TAKEN IN FOR SERVICE TUES 9/6 MORNING FOR OIL LEAKING.  THE LEAKING OIL PUMP AND SEALS WERE REPLACED.  CAR WAS READY AND PICKED UP ON FRI EVENING 9/9.  FROM TALKING WITH THE SERVICE PEOPLE THE OIL PUMP HAD BEEN CRACKED.  THEY SAID THE CAR HAD BEEN CLEANED OF THE OIL AND THAT THERE WAS NO MORE OIL LEAKING.  ON SAT MORNING 9/10 THERE WAS A NEW OIL PUDDLE AND OIL UNDERNEATH THE PASSENGER SIDE OF THE CAR ON THE FRAME.  SERVICE IS CLOSED ON THE WEEKEND.  ON MON I WAS NOT ABLE TO CHANGE CARS DUE TO WORK COMMITMENTS AND AFTER DRIVING HOME FROM WORK THERE WAS THE SMELL OF BURNING OIL.  THE CAR WAS SERVICED ON TUES 9/13 FOR OIL LEAKING.  THE SERVICE PEOPLE REPORTED THAT THERE OIL COLLECTED IN THE BOTTOM OF THE CAR FROM THE FIRST OIL LEAK.  THEY REPORTED CLEANING THE CAR AGAIN AND DOING A LOT OF TEST DRIVING TO VERIFY THAT THERE WAS NO MORE OIL LEAKING.  I RECEIVED THE CAR BACK TUES AFTERNOON.    2)  FAILURE:  SAT 9/17/2005, I LEFT HOME WITH 2 CHILDREN IN THE NEW VOLVO S80 CAR TO GO SHOPPING.  ONE CHILD WAS IN THE PASSENGER FRONT SEAT AND THE OTHER IN THE PASSENGER SIDE BACK SEAT.  AFTER TURNING ON ANOTHER SIDE STREET, THE CAR WENT TO THE RIGHT AND HIT A MAILBOX.  THE ARM (CONTROL ARM) ON THE PASSENGER SIDE TIRE WAS SPLIT BROKE OFF.  THE CAR HAD DAMAGE FROM THE MAILBOX TO THE HEADLIGHTS, HOOD, AND SIDE PANEL.  THE PASSENGER SIDE WHEEL WAS NO LONGER IN THE CORRECT POSITION BUT PUSHED TOWARD THE REAR OF THE CAR.  THE CAR WAS NOT DRIVABLE AND TOWED BY VOLVO SERVICE TO SAM SWOPE AUTO COLLISION CENTER.     3)  MY INSURANCE COMPANY HAS INSPECTED THE DAMAGE.  THE VOLVO FIELD TECH SPECIALIST (FTS) INSPECTED THE CAR ON THURS 9/22.  NO INFORMATION HAS BEEN RELEASED FROM VOLVO.   *NM",
        "vin": "YV1TS592451"
    }
]