[
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/09/2018",
        "dateOfIncident": "10/01/2017",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11071932,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V50",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 VOLVO V50 HAS INTERMITTENT STARTING ISSUES. THE ENGINE CRANKS AND FUEL PUMP CAN BE HEARD WHEN KEY IS TURNED IN IGNITION BUT THE ENGINE DOES NOT TURN OVER/START. AFTER 10-15 (SOMETIMES MORE) ATTEMPTS AT STARTING THE VEHICLE, FUEL PRESSURE APPEARS TO BUILD SLOWLY WITH EACH ATTEMPT AND THE ENGINE WILL SOMETIMES START. IF THE VEHICLE DOES START IT IS OPERABLE WITHOUT ADDITIONAL PROBLEMS AND CAN BE DRIVEN NORMALLY. THE CAR WILL RE-START WITHOUT ISSUE IF  THE ENGINE HAS RUN WITHIN A FEW HOURS OF THE ATTEMPT. AFTER 24-36 HOURS OF BEING OFF THE VEHICLE WILL HAVE DIFFICULTY STARTING AGAIN. I BELIEVE THE PEM (PUMP ELECTRONICS MODULE) IS FAULTY IN MY VEHICLE - VOLVO ISSUED RECALL 190 TO ADDRESS THIS BUT NOW REFUSES TO REPAIR MY VEHICLE OR PROVIDE ME WITH DOCUMENTATION SUFFICIENT TO ENSURE ME THAT MY VEHICLE IS NOT COVERED BY THIS RECALL CAMPAIGN.",
        "vin": "YV1MW382852"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/21/2017",
        "dateOfIncident": "10/21/2017",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11035452,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V50",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STALLED ON HIGHWAY AT HIGHWAY SPEED AND RAPIDLY LOST SPEED AND POWER STEERING.  RESTARTING WAS VERY DIFFICULT AND RESULTED IN SEVERAL FAILED STARTS AND STALLS.  TRYING TO NAVIGATE TO SAFETY RESULTED IN MORE STALLING.  SYMPTOMS INDICATE A PROBLEM WITH THE FUEL PUMP.  CHECKED WITH VOLVO AND THERE IS A SAFETY RECALL FOR THIS MODEL FOR THE FUEL PUMP ELECTRONIC MODULE, BUT THAT VOLVO LIMITED THE RECALL TO ONLY CERTAIN STATES WHILE STATING THAT THE PROBLEM IS DUE TO SALTY WET CONDITIONS, WHICH ARE PRESENT MOST EVERY WHERE ON THE EAST COAST.  VOLVO EXCLUDED SEVERAL EAST COAST STATES.",
        "vin": "YV1MW382X52"
    },
    {
        "components": "STEERING,SUSPENSION,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/30/2016",
        "dateOfIncident": "06/02/2016",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10899495,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V50",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 VOLVO V50. WHILE PULLING OUT OF THE DRIVEWAY AND MAKING A RIGHT TURN, THERE WAS AN ABNORMAL NOISE COMING FROM THE FRONT OF THE VEHICLE. THE NOISE RECURRED PERIODICALLY. IN ADDITION, WHEN DRIVING OVER A SLIGHT BUMP, THE VEHICLE FELT AS IF THE BOTTOM WOULD DETACH. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE THE TECHNICIAN COULD NOT FIND A FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 82,000.   UPDATED 10/06/16*LJ  THE CONSUMER STATED THE PROBLEM WAS THE RIGHT FRONT ENGINE MOUNT. *TR",
        "vin": "YV1MJ682X52"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/11/2015",
        "dateOfIncident": "08/20/2015",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10781310,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V50",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR HAS HAD POOR STEERING AND NOISE COMING FROM THE FRONT END - REPAIRS MADE TO LEFT FRONT AND RIGHT FRONT - NOISE CONTINUES RIGHT FRONT - REPAIRED AGAIN AND NOW IN VOLVO OF SANTA MONICA FOR 3RD REPAIR TO RIGHT FRONT; ALL REPAIRS INVOLVE SUSPENSION ISSUES AND PART SUCH AS JOINTS AND WHEEL AXEL. NOISES ARE WHEN CAR IS BEING DRIVEN ESPECIALLY TURNING RIGHT.",
        "vin": "YV1MW682152"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/02/2013",
        "dateOfIncident": "06/27/2013",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10523390,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V50",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON HIGHWAY 880 'URGENT ELECTRICAL SERVICE ! WITH BATTERY EMBLEM LIGHT IN RED' CAME ON IN THE CENTER OF THE DRIVER SIDE DASH GAGES;  THIS BLOCKED OUT THE MILEAGE LEFT FOR GAS...  CAR TOWED TO DEALER AND TO DATE THIS HAS NOT BEEN PROPERLY REPAIRED BY SELLING DEALER- THIS APPEARED AGAIN AFTER NEGATIVE BATTERY CABLE REPLACED ON 7/1/2013!  PRIOR INCIDENT WITH WATER LEAKING IN THE CAR PASSENGER SIDE FROM UNDER THE GLOVE BOX ON TO THE PASSENGER FLOOR.",
        "vin": "YV1MW682152"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/20/2013",
        "dateOfIncident": "05/01/2013",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10512860,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V50",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 VOLVO V50. THE CONTACT STATED THAT WHILE DRIVING 5 MPH, SHE ATTEMPTED TO ACCELERATE BUT THE VEHICLE WOULD NOT RESPOND. THE CONTACT STATED THAT SHE DEPRESSED THE ACCELERATOR PEDAL HARDER AND THE VEHICLE ACCELERATED TO 40 MPH. THE CONTACT REGAINED CONTROL OF THE VEHICLE AND TOOK IT TO A LOCAL MECHANIC FOR INSPECTION. THE MECHANIC STATED THAT THE ELECTRONIC MODULE PUMP NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED AND THEY STATED THAT THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 08V033000 (FUEL SYSTEM, GASOLINE). THE FAILURE MILEAGE WAS 155,000.",
        "vin": "YV1MW382X52"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/07/2011",
        "dateOfIncident": "10/01/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10434809,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V50",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS  A 2005 VOLVO V50. THE CONTACT STATED THAT WHILE EXITING A PARKING SPACE THE VEHICLE STALLED. THE VEHICLE WAS TAKEN TO THE DEALER WHO DIAGNOSED THAT THE FUEL PUMP AND THE CENTRAL ELECTRICAL MODULE WERE DEFECTIVE AND NEEDED TO BE REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE WHO DID NOT OFFER ANY ASSISTANCE SINCE THE VEHICLE WAS NO LONGER UNDER WARRANTY. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND THE CURRENT MILEAGE WAS 93,000.",
        "vin": "YV1MW382052"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/09/2011",
        "dateOfIncident": "08/17/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10424498,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V50",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR HESITATED ON ACCELERATION WHEN I WAS GETTING ON THE HIGHWAY AND BRIEFLY STALLED AND THE CHECK ENGINE LIGHT CAME.  THIS HAS HAPPENED SEVERAL TIMES.  I RESEARCHED THE ISSUE AND FOUND A DEFECTIVE FUEL PRESSURE SENSOR  IS THE CAUSE.  THERE ARE NUMEROUS REPORTS OF THIS ON VOLVO RELATED WEBSITES.  THE PART IN QUESTION IS BOSCH #8699449 THAT WAS RECALLED FOR SIMILAR FAILURES ON VOLVO 60 SERIES VEHICLES.  AFTER REPLACING THE PART WITH A NEW BOSH PART #31272732 THE PROBLEM DID NOT REOCCUR.  THIS OLD PART SHOULD BE RECALLED ON ALL VOLVOS AS IT CREATES A REAL SAFETY ISSUE AS THE PROBLEM OCCURS DURING ACCELERATION AND COULD RESULT IN AN ACCIDENT.  *TR",
        "vin": "YV1MJ682052"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/18/2011",
        "dateOfIncident": "06/20/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10420013,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V50",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "1. THE CAR, VOLVO V50 2005, WAS DRIVEN IN A BUSY HIGHWAY AT 65 MPH SUDDENLY THE SPEED DROPPED TO 25 MPH QUICKLY. THE DASHBOARD STARTED SHOWING WARNING REDUCED ENGINE PERFORMANCE. THIS WAS VERY DANGEROUS WHEN I HAD MY CHILDREN IN THE CAR IN A BUSY HIGHWAY. I SEARCHED IN THE WEB, REDUCED ENGINE PERFORMANCE HAPPENS A LOT IN VOLVO VEHICLES.  2. SECOND INSTANCE, THE CAR STALLED OUT WHEN THE CAR WAS AT 25 MPH.  3. ALL THE PROBLEMS WERE RELATED TO MALFUNCTION ENGINE CONTROL MODULE (EMC) SENSOR AND FUEL PRESSURE REGULATOR.  *KB",
        "vin": "YV1MJ682752"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/05/2011",
        "dateOfIncident": "02/08/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10399221,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V50",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "SUN ROOF DRAINS DISCONNECT RESULTING IN WATER BEING BLOWN INTO CAR UNDER DRIVERS AND PASSENGER SEATS.  *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/05/2010",
        "dateOfIncident": "02/01/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10316990,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V50",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR BREAKDOWN REQUIRED THE FOLLOWING PARTS TO BE REPLACED - START CONTROL MODULE, PUMP CONTROL MODULE, FUEL PRESSURE SENSOR. *TR",
        "vin": "YV1MW682552"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/01/2009",
        "dateOfIncident": "10/29/2009",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10290498,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V50",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "AT HIGHWAY SPEED AND WITHOUT WARNING, ENGINE STOPPED AND THE CHECK ENGINE LIGHT CAME ON.  WE WERE ON A HIGHWAY WITH NARROW BREAK-DOWN LANES AND WERE IN SIGNIFICANT PERIL, SURROUNDING BY SINGLE AND DOUBLE TRACTOR-TRAILERS IN MOUNTAINOUS AREA ON INTERSTATE-90 IN WESTERN MASSACHUSETTS.  THIS EVENT WAS TRULY TERRIFYING.  THAT THERE WAS NO LOSS OF LIFE IS SHEER LUCK AND IMMATERIAL. *TR",
        "vin": "YV1MJ682952"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/30/2009",
        "dateOfIncident": "07/23/2009",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10278806,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V50",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 VOLVO V50.  WHILE ATTEMPTING TO PARK THE VEHICLE, THE CONTACT REMOVED HIS FOOT FROM THE BRAKE PEDAL AND THE VEHICLE PROCEEDED TO MOVE FORWARD.  THE CONTACT APPLIED THE EMERGENCY BRAKE AND THE KEY WOULD NOT RELEASE FROM THE IGNITION.  IN ADDITION, THE VEHICLE WOULD NOT DRIVE IN REVERSE.  WHILE WALKING HOME IN THE RAIN, THE CONTACT SLIPPED AND FELL AND BROKE HER RIGHT WRIST IN THREE PLACES.  THE VEHICLE WAS TOWED TO THE DEALER AND THEY STATED THAT THE TRANSMISSION SHIFTER CABLE CLIP FAILED, WHICH CAUSED THE CABLE TO SPLIT IN HALF.  THE SHIFTER CABLE WILL BE REPLACED AT THE ESTIMATED COST OF $450.  THE DEALER WILL ASSIST WITH 50% OF THE REPAIR COST.  A REPORT WAS FILED WITH THE MANUFACTURER.  THE FAILURE AND CURRENT MILEAGES WERE 50,000.",
        "vin": "YV1MJ682X52"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/12/2008",
        "dateOfIncident": "09/12/2008",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10248628,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V50",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 VOLVO V50.  THE CONTACT STATED THAT THE OIL PAN UNDERNEATH HIS VEHICLE RUPTURED TWICE.  WHILE DRIVING VARIOUS SPEEDS, THE FIRST FAILURE OCCURRED AFTER DRIVING OVER A BUMP IN THE ROAD.  THE FAILURE WAS NOTICED THE SECOND TIME WHILE THE VEHICLE WAS PARKED IN THE GARAGE.  THE CONTACT NOTICED OIL LEAKING ONTO THE GARAGE FLOOR.  HE STATED THAT THE FAILURE WAS DUE TO POOR DESIGN.  THE OIL PAN LACKS PROTECTION AND IS PLACED LOW ON THE VEHICLE, WHICH CAUSES SCRAPES AND PUNCTURES ON UNEVEN PAYMENTS, POTHOLES, DIPS, AND SPEED BUMPS.  THE LARGER VOLVO MODELS HAVE HORIZONTAL FRAME MEMBERS, WHICH PROTECT THE OIL PAN FROM ROAD HAZARDS.  THE FAILURE OCCURS IN THE S40, V50, AND C70 MODELS.  THE CONTACT HAD TO HAVE THE OIL PAN REPLACED TWICE WITHIN TWO MONTHS.  THE DEALER STATED THAT THE REPAIR WOULD COST $1,200 EACH TIME.  THE CONTACT HAS PAID A TOTAL OF $2,400 FOR THE TWO REPAIRS.  THE FAILURE MILEAGE WAS 32,000.",
        "vin": "YV1MW682452"
    },
    {
        "components": "SUSPENSION,ENGINE AND ENGINE COOLING,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/23/2008",
        "dateOfIncident": "01/17/2008",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10222071,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V50",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "OIL PAN FAILURE, LEADING TO OIL LEAK. THIS WAS CAUSED BY OIL PAN IMPACT ON ROAD WHILE TRAVERSING A SLIGHT DIP IN THE ROADWAY. PAN CRACKED DUE TO DEFECTIVE DESIGN OF EITHER THE PAN OR THE VEHICLE SUSPENSION. DEALER AND MANUFACTURER DO NOT ACCEPT ANY RESPONSIBILITY FOR THIS.  *TR",
        "vin": "YV1MW390252"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/10/2007",
        "dateOfIncident": "03/03/2007",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10187422,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V50",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE  2005 VOLVO V50 WITH 22,000 MILES DID NOT PERFORM AS I FELT IT SHOULD WHEN I APPLIED THE BRAKES.  I FELT SHAKING AND THE WHEEL FELT OUT OF CONTROL WHEN USING THE BRAKES.*AK",
        "vin": "YV1MW390952"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/09/2006",
        "dateOfIncident": "10/06/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10170297,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V50",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 VOLVO V50 HAS A CHRONIC LIGHT PROBLEM IE THE DIM LIGHT SETTING DOES NOT PROVIDE ENOUGH LIGHT TO DRIVE SAFELY ON RURAL ROADS IN THE \"DIM\" SETTING. MAXIMUM FORWARD VISIBILITY IN THE DIM SETTING IS BETWEEN 48' AND 55' THIS IS MADE MORE HAZARDOUS BY THE DARK LINE THAT APPEARS AT THE 48' TO 55' LINE THIS EFFECTUALLY BLOCKS VISION PAST THIS POINT.  MY  VOLVO V-50 HAS SPENT 44 DAYS AT MODESTO EUROPEAN (VOLVO DEALER)  TO TRY TO REPAIR THIS DEFECT AFTER THE LAST TWO TRIPS I/WE WERE TOLD THAT THIS IS THE BEST THAT IT CAN BE REPAIRED.  IF THIS IS THE BEST IT CAN BE REPAIRED THIS CAR SHOULD BE TAKEN OFF THE ROAD ASAP. THERE IS A STRONG POSSIBILITY THAT ONE COULD HIT A PEDESTRIAN, DISABLED VEHICLE, DEER ,ELK ,ETC AT HIGHWAY SPEEDS OF 55 MPH. WE HAVE A CAR THAT IS NOT SAFE TO DRIVE AFTER DARK WHAT IS VOLVO THINKING.  *NM",
        "vin": "YV1MJ682352"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/09/2005",
        "dateOfIncident": "02/01/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10135944,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V50",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "REMOTE KEY TRANSMITTER ON 2005+ VOLVO V50 IS A PERSONAL SAFETY HAZARD AND POTENTIAL SWINDLE FOR VOLVO ON SELLING REPLACEMENT TRANSMITTERS.  THE DESIGN IS SUCH THAT THE KEY WILL INADVERTENTLY FALL OFF THE VALET KEY (WHICH INCIDENTALLY CANNOT BE USED TO START THE CAR).  THE LATCHING MECHANISM IS IN CLOSE PROXIMITY (+/- 3MM) TO THE KEY RING IT WOULD NORMALLY SIT ON AND WHEN THE KEY RING BUMPS AGAINST THE LATCH IN YOUR POCKET OR PURSE, IT CAN PARTIALLY DISLODGE KEY AND WHEN YOU PULL IT FROM POCKET, THE KEY GOES FLYING ELSEWHERE UNKNOWN TO THE OWNER.      NO THIS COMPLAINT DOESN'T INVOLVE DIRECT PERSONAL INJURY, BUT IMAGINE LOSING YOUR KEY IN AN UNSAFE PLACE OR SITUATION AND HAVING TO CRAWL AROUND AND TRY TO FIND THE THING.  DELPHI IS THE MANUFACTURER OF THE KEYFOB.  THE USE TESTING OF THIS KEY MUST HAVE BEEN NON-EXISTENT AS I HAVE LOST ONE KEY WITHIN 60 DAYS OF OWNERSHIP (COST ME $60, COULD HAVE BEEN MORE SINCE DEALER NORMALLY CHARGES 2 HOURS LABOR TO PROGRAM KEY).  NOW I HAVE MINE HOOKED TOGETHER WITH SAFETY WIRE.  VOLVO WILL NOT RESPOND TO REPEATED EMAILS, CALLS.  DEALER WON'T ADDRESS ISSUE AT ALL.  I CANNOT BE THE ONLY PERSON.  MY WIFES KEY DOES THE SAME THING.  I HAVE SEARCHED INTERNET FORUMS TO FIND OTHER USES WITH SIMILAR ISSUES ON OTHER VOLVO KEYS.  IT'S JUST A SHAME VOLVO WON'T FIX WHAT ISN'T RIGHT.  *NM",
        "vin": "YV1MJ682152"
    }
]