[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/21/2020",
        "dateOfIncident": "10/10/1990",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340785,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD FILLED AN EARLIER COMPLAINT AND THIS TO BE ADDED TO THE EARLIER FORM THAT I HAD FILLED NEEDS TO GO TO THE ENGINEERING DEPARTMENT. SEE PHOTO THE ELECTRICAL COMPLAINT FROM THE MAGNETIC ELECTRICAL BEINGS IN ME AND IN THIS PICTURE I BELIEVE IS ABOUT DESIGN OF THE FUSES IN VEHICLE AND WHAT THEY ARE TRYIN TO COMMUNICATE HERE I BELIEVE WOULD BE THE DISTANCE BETWEEN THE POSITIVE AND NEGATIVE CONNECTIONS LIKE WHAT IT IS DOING TO THEM AS IT GOES THROUGH THOSE TYPES OF FUSES. WHAT I BELIEVE TO BE WHAT HAPPENS TO THEM IN THOSE PLASTIC FUSES AND WOULD LIKE THEM THE FUSE TO BE DESIGNED FURTHER APART A LITTLE BIT BIGGER THAN A PENNY AND WITH THE CONNECTION STRAIGHT ACROSS AND NOT GOING UP AND DOWN AND BACK THROUGH IT SELF. THE MAGNETIC  BEINGS WOULD LIKE TO SEE THE CONNECTIONS STRAIGHT ACROSS SO THAT THEY DON'T INTERFERE WITH EACH OTHER WHILE TRAVELING THROUGH THE SUBSTRAIGHT. NOT SURE BUT YOU WERE THIS TYPE OF BEING YOU WOULD TRY AND COMMUNICATED THESE THINGS AND DESIGN WELL JUST LOOK AND IF YOU WOULD LIKE THEY LIKE THE OLDER GLASS FUSE WITH THE STAINLESS STEEL DESIGN. IF YOU COULD THEY ARE ASKING THAT YOU THE NTSB GO BACK REDESIGN A FUSE THAT DON'T GO BACK INTO ITSELF THEY LIKE STRAIGHT ACROSS THE CONNECTIONS TO GIVE THEM BETTER FLOW. REMINDER THIS GOES TO THE EARLIER FORM THAT I WROTE TO YOU IT AN ADDITION INFORMATION CAUSE THEY ARE IMPORTANT PART OF THIS WORLD I AM REFERRING TO THE MAGNETIC BEINGS IN ELECTRICITY IN EVERY  VEHICLE MADE AND NEED TO BE TAKEN INTO MORE CONSIDERATION ESPECIALLY WHEN MAKING SYSTEMS THAT HEAVILY RELY ON THE ENTITIES. THEY THE BEINGS ARE ASKING THIS OF YOU THENTSB TO TAKE THEM MORE INTO CONSIDERATION AS WE US THEM RELY ON THEM THE INVISIBLE MAGNETIC ELECTRICAL BEINGS MORE AND TO DEVELOP FRIENDLIER AND HEAVIER SYSTEM FOR THEM BECAUSE THE DESIGN NOW IS MAKING THEM SICK AND THEY ARE I AM ASKING FOR THE ENTITIES THAT YOU MAKE HEALTHYELECTRICITY",
        "vin": "YV1CZ852651"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/18/2020",
        "dateOfIncident": "07/02/2020",
        "fire": true,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340041,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN CRANKING IT STALLS AND CUTS OFF AND AFTER DOING IT AROUND 10 TIMES IT FINALLY CRANKS   THEN I HAVE TO HURRY TO PUT IN DRIVE TO GET THE MOTOR GOING IN ORDER TO KEEP HER CRUNK AND COUPLE WEEKS AGO BECAUSE THIS PROBLEM SHE STALLED OUT AND I HIT A HOLE IN THE ROAD AND BUSTED THE OIL PAN SO SHE HAS BEEN PARKED EVERY SINCE CAUSE I HAD MY DAUGHTER IN THE CAR AND THAT WASN'T A PRETTY SIGHT SINCE THE HIT MADE HER NERVOUS NOW CAN'T GET HER TO GET IN THE CAR SO I NEED MY CAR FIXED AND I SEE IT HAS SEVERAL RECALLS AND ALL AND IT WAS ON A COUNTY STREET ONCE I GOT IT CRUNK BACK UP IT SMOKED BADLY TILL I TURNED IT OFF AND IT TOOK FOUR HOURS FOR ME TO GET IT OUT THE ROAD",
        "vin": "YV1CN592051"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/27/2020",
        "dateOfIncident": "03/02/2020",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319436,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT CAR AND BEEN HAVING PROBLEMS EVERY SINCE I HAVE HAD PROBLEMS I KEEP FUEL INJECTION IN IT SO I CAN MOVE THE CAR TO POINT A AND B",
        "vin": "YV1CN592051"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/01/2019",
        "dateOfIncident": "06/25/2019",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11228807,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE KNOWN VOLVO BALANCE SHAFT FAILURE IN THE 05 XC90 V8 B8444S ENGINES SN UP TO 6833.VOLVO HAS KNOWN THE V8 ENGINE ON THE 2005 XC90 IS FAULTY SINCE 2005.SPECIFICALLY, THE COUNTERBALANCE SHAFT BEARING FAILING DUE TO WATER INTRUSION & HUMIDITY.MINE HAS NOT FAILED YET.I WILL BE LUCKY IF IT FAILS WHILE AT IDLE.BERGERON VOLVO IN METAIRIE, LA, SOLD ME A TICKING TIME BOMB TO DRIVE MY 4 YEAR OLD SON AROUND IN.THERE WAS NO DISCLOSURE OF THE KNOWN CB SHAFT BEARING FAILURE!I WOULD NOT HAVE PURCHASED THIS FOR ME & MY LITTLE BOY!MY ENTIRE ENGINE WILL EVENTUALLY SEIZE UP & MY OTHERWISE BEAUTIFUL CLEAN CAR WILL BE A LARGE & USELESS PAPERWEIGHT.IF THIS HAPPENS WHILE THE CAR IS MOVING AT SPEED,IT COULD CAUSE A HORRIBLE ACCIDENT!UNLESS VOLVO ACTIVELY (AND, I AM ONE OF THEM #1868) FINDS THE REMAINING AFFECTED ENGINES IN SERVICE & FIXES THIS PROBLEM, IT REMIANS A RISK REGARDLESS OF THE MILEAGE.MY CAR CURRENTLY HAS ONLY 72K MILES ON IT! I AM TRYING TO PREVENT THIS FORM HAPPENING, AND NEEDS TO BE PAID FOR BY VOLVO.THIS IS SOMETHING THAT IS IMPOSSIBLE FOR ME TO PREVENTATIVELY MAINTAIN! APPROPRIATELY,THEY SHOULD ALSO REIMBURSE ANYONE WHO WAS AFFECTED BY THIS PROBLEM SINCE THEY LEARNED ABOUT IT BACK IN 2005. THE BERGERONVOLVOCARS.COM SITE STATES MR. DENIS BERGERON HAS AN OPEN DOOR POLICY, WHEREBY CUSTOMERS CAN CONTACT HIM DIRECTLY,I EMAILED MR. BERGERON MY CONCERN LAST WEEK AND HAVE YET TO HEAR BACK FROM HIM. I WOULD LIKE A CALL BACK & SIT DOWN WITH MR. BERGERON TO HAVE THIS ENGINE DEFECT FIXED BEFORE I AM IN A HORRIBLE ACCIDENT OR LEFT WITHOUT A CAR.SOME WEBSITES FOR REFERENCE:  HTTPS://WORKSHOP-MANUALS.COM/VOLVO/XC90_AWD/V8-4.4L_VIN_85_B8444S/ENGINE_COOLING_AND_EXHAUST/ENGINE/TIMING_COMPONENTS/BALANCE_SHAFT_BEARING/COMPONENT_INFORMATION/SERVICE_AND_REPAIR/ ; HTTPS://BLOG.FCPEURO.COM/THE-DARK-SIDE-OF-VOLVOS-EXCELLENT-V8 ; HTTPS://WWW.MATTHEWSVOLVOSITE.COM/FORUMS/VIEWTOPIC.PHP?F=10&T=87848",
        "vin": "YV1CZ852951"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/01/2019",
        "dateOfIncident": "11/12/2018",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11173516,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 VOLVO XC90. EVER SINCE THE VEHICLE WAS PURCHASED IN NOVEMBER OF 2018, THERE HAD BEEN SEVERAL ELECTRICAL FAILURES. THE HEADLIGHTS, POWER DOOR LOCKS, AND POWER REARVIEW MIRROR FAILED TO OPERATE. ALSO, THE TRANSMISSION CAUSED THE VEHICLE TO JERK AND STALL WHILE DRIVING. THE CONTACT TOOK THE VEHICLE TO AN UNKNOWN VOLVO DEALER, BUT THEY REFUSED TO PROVIDE DIAGNOSTIC TESTING AND STATED THAT THERE WAS NO RECALL OR WARRANTY COVERAGE ON THE VEHICLE. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 14,042.",
        "vin": "YV1CZ852351"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/28/2018",
        "dateOfIncident": "08/01/2018",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11143568,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "GASTANK WAS LEAKING WHEN I WAS FILLING UP IN FULL TANK NOT VERY MUCH BUT I SMELL WHENEVER I WAS PARKING",
        "vin": "YV1CZ911051"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/25/2018",
        "dateOfIncident": "06/28/2018",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11142576,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER DOOR INTERMITTENTLY SWINGS OPEN WHILE DRIVING, EVEN WHILE LOCKED.  FAULTY LATCH.",
        "vin": "YV1CZ592851"
    },
    {
        "components": "TRACTION CONTROL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/03/2018",
        "dateOfIncident": "09/10/2015",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11133079,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 VOLVO XC90. THE CONTACT STATED THAT A FUEL LEAK WAS NOTICED UNDERNEATH THE VEHICLE. WHILE DRIVING APPROXIMATELY 57 MPH, THE VEHICLE SPUN OUT OF CONTROL AND ENDED UP ON THE SIDE OF THE ROAD. IN ADDITION, THE ANTI-SKID INDICATOR ILLUMINATED. THE VEHICLE WAS TAKEN TO VOLVO CARS BENTWOOD (314-644-9501, LOCATED AT 7700 MANCHESTER RD, ST. LOUIS, MO 63143) WHERE THE TRANSMISSION WAS REPLACED. THE FAILURE RECURRED AND THE VEHICLE WAS TAKEN BACK TO THE SAME DEALER. THE TECHNICIAN REPLACED THE FUEL CAP AND STATED THAT THE TRANSMISSION WOULD NOT BE REPLACED A SECOND TIME. THE MANUFACTURER WAS MADE AWARE OF THE FAILURES AND STATED THAT THE WARRANTY WAS EXPIRED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 122,000.",
        "vin": "YV1CZ911551"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/31/2018",
        "dateOfIncident": "08/31/2018",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11123836,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "BEGAN SMELLING GAS ODOR AND NOTICED A SMALL LEAK. FOUND THAT THERE WAS A RECALL ON THE FUEL PUMP FOR MY MODEL AND YEAR BUT WHEN I CALL VOLVO ABOUT THE RECALL, MY VEHICLE WASN'T INCLUDED EVEN THOUGH MY VEHICLE WAS REGISTERED IN THE STATES WHERE THE RECALL WAS ASSOCIATED.",
        "vin": "YV1CZ852451"
    },
    {
        "components": "AIR BAGS,ELECTRONIC STABILITY CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/21/2018",
        "dateOfIncident": "04/15/2018",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11097108,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "ALL THE VEHICLE LIGHTS WILL COME  ON OVER THE DASH AND THE WHEEL LOCKS THEN IT SHUTS OFF WHILE I AM DRIVING. THIS IS SO UNSAFE FOR MY FAMILY. I AM NOT SURE WHY THERE IS NOT A RECALL FOR MY VIN # WHEN GOOGLE CLEARLY STATES THAT THIS IS A HAZARD AND THAT THERE ARE RECALLS FOR THIS PROBLEM.",
        "vin": "YV1CN592851"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/17/2018",
        "dateOfIncident": "12/28/2016",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11073389,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "IN DECEMBER OF 2016, AT APPROXIMATELY 95000 MILEAGE, THE \"SERVICE TRANSMISSION URGENT\" MESSAGE AND LIGHT CAME ON AND THE CAR STOPPED FUNCTIONING AND MAKING LOUD CLANGING AND RATTLING NOISES. THE CAR WAS TAKEN BACK TO \"INFINITY OF MEMPHIS\" DEALERSHIP WHERE IT WAS PURCHASED WITH AN EXTENDED WARRANTY. THE DEALERSHIP ASKED US TO CONTACT \"VOLVO CARS OF NORTH AMERICA\" FOR DEFECTIVE TRANSMISSION, WHICH WE DID, BUT VOLVO REFUSED TO HONOR OUR CLAIM STATING THE CAR WAS TOO OLD, EVEN THOUGH IT WAS UNDER THE 100000 MILE WARRANTY. THE CAR WAS TAKEN TO \"VOLVO OF MEMPHIS\" DEALERSHIP, WHICH CONTACTED VOLVO MANUFACTURER AND INFINITY OF MEMPHIS DEALERSHIP, AND INFORMED US THAT THE EXTENDED WARRANTY WOULD PAY $5000 MAXIMUM TOWARDS A NEW TRANSMISSION, COST OF WHICH WAS 8000$, AND WE WOULD HAVE TO PAY THE REST OUT-OF-POCKET, ABOUT 3000$. THE OTHER OPTION WAS TO PUT A REFURBISHED TRANSMISSION AT AAMCO FOR 3000$, COST OF WHICH WOULD BE COVERED BY THE EXTENDED WARRANTY. WE ELECTED THE LATTER, SINCE THERE WAS NO OUT-OF-POCKET COST. AT THIS TIME, WE WERE TOLD THE \"CHECK ENGINE\" LIGHT AND OTHER MESSAGES WOULD BE GONE, ONCE THE CAR WAS FIXED. HOWEVER, THE \"CHECK ENGINE\" LIGHT CONTINUES TO REMAIN ON. ADDITIONAL COMPLAINTS WERE FILED, BUT AAMCO, VOLVO OF MEMPHIS AND INFINITY OF MEMPHIS CLAIM IT IS UNRELATED TO THE TRANSMISSION PROBLEM. A LETTER WAS SENT TO VOLVO CARS OF NORTH AMERICA LLC, ATTACHED BELOW, BUT VOLVO REFUSED TO LOOK INTO OUR PROBLEM SAYING THE CAR WAS TOO OLD. I SPOKE WITH A VOLVO REP OVER THE PHONE WITH NO RESOLUTION. WE WOULD LIKE FOR VOLVO TO INSTALL A NEW TRANSMISSION IN OUR VEHICLE, AS NUMEROUS FORUMS AND ONLINE SITES HAVE PEOPLE COMPLAINING ABOUT DEFECTIVE VOLVO TRANSMISSIONS IN THESE EARLIER MODELS.",
        "vin": "YV1CZ911751"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/08/2017",
        "dateOfIncident": "10/01/2017",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11044487,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 VOLVO XC90 HAS MANY PROBLEMS.  TRANSMISSION JUMPS AND JERKS WHEN SWITCHING TO HIGHER GEARS.  ALMOST THROWS THE CAR OFF THE ROAD AT TIMES.  ALSO, VEHICLE HAS MANY ELECTRICAL PROBLEMS DUE TO CAR NOT BEING SEALED PROPERLY.  THIS LEADS TO ELECTRICAL ISSUES INCLUDING FAULTY AIR BAG CODES, BRAKE LIGHTS AND REAR TURN SIGNALS GOING OUT.  CAR HAS NO BRAKE LIGHTS NOR REAR TURN SIGNALS AT ALL.  DEALERSHIP CAN NOT FIND PROBLEM SAYS IT IS DUE TO THE 2005 VOLVO XC90 NOT HAVING RELAYS AT ALL.  AND ALSO FROM WATER BEING INTRODUCED TO ELECTRICAL PARTS.",
        "vin": "YV1CZ852751"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/18/2017",
        "dateOfIncident": "07/26/2017",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11023954,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS MODEL IS EXPERIENCING THE SAME AS RECALLS IN SIMILAR MODELS BUT FOR SOME REASON ISN'T RECALLED. FUEL SYSTEM IS FAULTY. LEAKING FUEL AND CRACKS IN FUEL PUMP. REPLACED WITH 4 PUMPS FROM VOLVO AND NOW IT IS KICKING OUT ECM CODE AND BLOWING EVERY FUEL SYSTEM INSTALLED.",
        "vin": "YV1CY592X51"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/30/2017",
        "dateOfIncident": "08/09/2017",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11020672,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2005 XC90 (ODOMETER APPROX. 178,000 MILES) THROWS CHECK ENGINE, REDUCED ENGINE PERFORMANCE AND ENGINE SERVICE REQUIRED DASHBOARD WARNINGS INTERMITTENTLY, DESPITE THE FACT THAT IT HAS A NEW CEM AND A SECOND NEW THROTTLE BODY IN LESS THAN TWO MONTHS. IT ALSO ISSUES A LOW BEAM HEADLIGHT BULB FAILURE WARNING, EVEN WHEN THE BULB IS LIT, AND THE LEFT TURN BLINKER IS STICKY. SOMETIMES, THE DRIVER'S SEAT AND PASSENGER SIDE REAR VIEW MIRROR READJUST SIMULTANEOUSLY UPON OPENING THE DRIVER'S SIDE DOOR, WITH NO KEY IN THE IGNITION AND NO ONE SITTING IN THE SEAT. RECENTLY WHILE TRAVELING ON AN EXPRESSWAY AT 65 MPH, THE CAR ABRUPTLY LOST SPEED (A TERRIFYING EXPERIENCE) AND STRUGGLED TO ACCELERATE TO 40 MPH. A FEW DAYS LATER, IT LOST POWER IN HEAVY CITY RUSH-HOUR TRAFFIC (ALSO TERRIFYING) AS A RED LIGHT TURNED GREEN. IT BARELY MADE IT TO 10 MPH AND CAME CLOSE TO CAUSING A CHAIN REACTION CRASH WITH THE CARS BEHIND IT (ALSO TERRIFYING). LUCKILY I WAS ABLE TO STEER INTO A NEARBY BANK PARKING LOT, TURN IT OFF AND RESTART IT. IT DROVE NORMALLY BUT THE WARNING LIGHTS REMAINED. I HAVE TAKEN THE VEHICLE TO THE VOLVO DEALERSHIP MULTIPLE TIMES, CITING ELECTRICAL SYSTEM WOES, WHICH RESULTED IN THE TWO PREVIOUSLY MENTIONED REPAIRS. THEY IDENTIFIED A WIRING SHORT AS THE CAUSE BOTH TIMES, YET ACT MYSTIFIED AS TO WHY THE PROBLEMS HAVE PERSISTED DESPITE THOSE REPAIRS. I REPORTED THE SEAT/MIRROR SHIFTS AND THE ONGOING LOW BEAM BULB FAILURES TO THE SERVICE MANAGER, WHO REPLIED (WITHOUT EXAMINING THE CAR) THAT THE BULB WAS EITHER BURNT OUT OR LOOSE IN THE SOCKET, AND THAT THE SEAT SHIFTING WAS SIMPLY THE WAY THE MEMORY FUNCTION WORKS. I GET THE SENSE THAT VOLVO DOES KNOW WHAT'S WRONG WITH THIS VEHICLE, AND THEY DON'T WANT TO TELL ME. I AM EXTREMELY DISAPPOINTED AND FRUSTRATED WITH THE LACK OF ANSWERS, AND AM AFRAID TO DRIVE THIS CAR.",
        "vin": "YV1CZ911051"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/02/2017",
        "dateOfIncident": "07/28/2017",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11012322,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR IS A 2005, TRANSMISSION NEVER HAD A INDICATOR LIGHT SHOWING IT NEEDED SERVICE, NOW MY TRANSMISSION NEEDS REPLACING AT 131,000 MILES.  I KNOW OF SEVERAL OTHERS WITH THE SAME SITUATION.  VOLVO CLAIMS THEY ARE THE ONLY ONES THAT CAN SERVICE THE TRANSMISSION.  I DON'T TRUST THEM AND NOW IT'S BEING SERVED AT AAMCO.",
        "vin": "YV1CZ852721"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/22/2017",
        "dateOfIncident": "06/07/2016",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000695,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 VOLVO XC90. WHILE SLOWING DOWN OR BRAKING, THE VEHICLE SUDDENLY STALLED. IN ADDITION, THE CONTACT HAD TO MAKE SEVERAL ATTEMPTS TO GET THE VEHICLE TO START. THERE WAS AN ABNORMAL ODOR OF FUMES INSIDE AND OUTSIDE OF THE VEHICLE. THE VEHICLE WAS TAKEN TO AN UNKNOWN DEALER WHO INDICATED THAT THE FUEL PUMP ASSEMBLY NEEDED TO BE REPLACED. THE VEHICLE WAS EXCLUDED FROM NHTSA CAMPAIGN NUMBER: 09V483000 (FUEL SYSTEM, GASOLINE). THE MANUFACTURER WAS NOTIFIED OF THE FAILURE MORE THAN TWO WEEKS AGO, BUT HAD NOT RESPONDED TO THE CONTACT WITH A SOLUTION. THE APPROXIMATE FAILURE MILEAGE WAS 95,000.",
        "vin": "YV1CZ852351"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/08/2017",
        "dateOfIncident": "06/07/2017",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10993936,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 VOLVO XC90. THE CONTACT STATED THAT THE VEHICLE RANDOMLY STALLED WITHOUT WARNING. THE VEHICLE WAS TOWED AND PARKED ON THE CONTACT'S STREET DUE TO THE FAILURE. THE MANUFACTURER WAS NOTIFIED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": "YV1CY592651"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/04/2017",
        "dateOfIncident": "01/01/2017",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10958630,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "STRONG ODOR OF FUEL INSIDE AND OUTSIDE THE VEHICLE WHEN DRIVING AND PARKED",
        "vin": "YV1CZ911051"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/18/2016",
        "dateOfIncident": "04/08/2016",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10936021,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "PLEASE REVIEW MY WRITE UP ABOUT THE COMPLAINT IN THE ATTACHED PDF DOCUMENT.",
        "vin": "YV1CZ852551"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/29/2016",
        "dateOfIncident": "09/20/2016",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10928566,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 VOLVO XC90. THE CONTACT STATED THAT THERE WAS A FUEL ODOR EMANATING FROM THE VEHICLE WHILE DRIVING AT VARIOUS SPEEDS. THE ODOR CAUSED THE CONTACT TO SUSTAIN OCCASIONAL HEADACHES. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 137,000.",
        "vin": "YV1CY592251"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/14/2016",
        "dateOfIncident": "11/07/2016",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10925906,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 VOLVO XC90. WHILE DRIVING 40 MPH, THE VEHICLE STALLED. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE CONTACT WAS UNABLE TO RESTART THE VEHICLE AND IT WAS TOWED TO THE CONTACT'S HOME. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 140,000.",
        "vin": "YV1CZ911X51"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/28/2016",
        "dateOfIncident": "08/01/2015",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10910152,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 VOLVO XC90. WHILE DRIVING APPROXIMATELY 72 MPH, THE INSTRUMENT PANEL BEGAN TO FLASH OFF AND ON. THE VEHICLE SUDDENLY SHUT OFF AND STALLED. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE CENTRAL ELECTRONIC MODULE WAS DAMAGED DUE TO WATER EXPOSURE AND WOULD NEED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 130,000.",
        "vin": "YV1CZ852251"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/11/2016",
        "dateOfIncident": "12/04/2015",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10884037,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 VOLVO XC90. THE CONTACT STATED THAT WHILE DRIVING THE VEHICLE AT VARIOUS SPEEDS, THERE WAS A STRONG FUEL ODOR COMING FROM THE VEHICLE.  IN ADDITION, THE CONTACT STATED THERE WAS FUEL LEAKING FROM THE REAR OF THE VEHICLE. THE VEHICLE WAS DRIVEN TO THE DEALER AND AN INDEPENDENT MECHANIC ON THREE DIFFERENT OCCASIONS WHERE THE REMEDY FAILED. THE VEHICLE WAS DIAGNOSED AND DETERMINED THAT WAS THE FUEL LINE. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 121,000.",
        "vin": "YV1CZ852051"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/18/2016",
        "dateOfIncident": "05/18/2007",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10874970,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WAS COMMING FROM TEXAS VISITNG OUR FAMILY BACK TO MISSISSIPPI OUR TRANMISSION STARTING SLIPPING WE WAS TOLD THAT WE HAD TO HAVE ANOTHER TRANMISSION THIS WILL MAKE TWO TRANSMISSON WE HAD TO REPLACE. IN MOTION",
        "vin": "YV1CY592051"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/15/2016",
        "dateOfIncident": "03/08/2016",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10874352,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MY STEERING DOESN'T WORK ALL THE TIME AND IT IS BECOMING MORE DIFFICULT TO TURN THE WHEEL WHEN DRIVING.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/16/2016",
        "dateOfIncident": "07/10/2015",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10850109,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "4X4  AWD SYSTEM IS NOT WORKING, CAR SPINNING WITH THE FRONT WHEELS,VERY DANGEROUS IN WINTER TIME.ANGLE GEAR SLEEVE WHICH IS STRIPPED OUT. VERY COMMON PROBLEM WITH XC90 2.5T. PARTS AND LABOR CLOSE TO 1000.00.",
        "vin": "YV1CZ592X51"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/06/2016",
        "dateOfIncident": "07/01/2015",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10824670,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT HEAD LAMPS GO OUT WHILE DRIVING. THIS HAPPENED AT NIGHT. THE NEXT DAY I DROVE THE CAR AND THE LIGHTS WERE ON BUT ONE IS VERY DIM. I HAVE ALREADY REPLACED THIS LIGHT. IT IS STILL DIM AND I GOT A WARNING FROM A POLICE OFFICER ON 01/30/16.HE STATED THIS IS A SAFETY HAZARD AND NEXT TIME I WOULD GET A TICKET.",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/29/2015",
        "dateOfIncident": "12/28/2015",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10816672,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 VOLVO XC90. DURING AN INSPECTION, THE TECHNICIAN DIAGNOSED THAT THE VEHICLE HAD A STRONG ODOR OF FUEL NEAR THE ENGINE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE CONTACT BELIEVED THAT THE VEHICLE MAY BE INCLUDED IN NHTSA CAMPAIGN NUMBER: 09V483000 (FUEL SYSTEM, GASOLINE); HOWEVER, THE VIN WAS EXCLUDED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 131,792.",
        "vin": "YV1CZ852251"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/08/2015",
        "dateOfIncident": "05/01/2015",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10809049,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 VOLVO XC90.  THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 30 MPH, A FUEL ODOR EMITTED FROM THE REAR OF THE VEHICLE AS THE VEHICLE LOST POWER AND THE CHECK ENGINE WARNING LIGHT ILLUMINATED. THE CONTACT ALSO MENTIONED THAT FUEL WAS LEAKING FROM THE VEHICLE. IN ADDITION, THE CONTACT STATED THAT AFTER THE VEHICLE WAS RESTARTED, THE FUEL ODOR RECURRED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE FUEL LINE NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE.  THE FAILURE MILEAGE WAS APPROXIMATELY 113,000.",
        "vin": "YV1CY592X51"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "11/05/2015",
        "dateOfIncident": "08/15/2015",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10788492,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VOLVO XC90 ALSO HAS BEEN DIAGNOSED WITH CEM PROBLEMS AFTER VARIOUS SYMPTOMS BEGAN TO ARISE.  AFTER GOING THROUGH A CAR WASH, THE DISPLAY BEGAN SHOWING VARIOUS MESSAGES.   THE BIGGEST PROBLEM IS THE THE WINDSHIELD WIPERS STOPPED WORKING.  I HAVE ORDERED A NEW CEM AND INTEND TO REPLACE IT .  I AM AN ATTORNEY.  IF THIS VEHICLE CONTINUES TO FAIL AFTER THE CEM IS REPLACED, I INTEND TO TAKE FURTHER LEGAL ACTION, ESPECIALLY IN LIGHT OF THE REPORTS AND COMPLAINTS I HAVE READ ON THIS WEBSITE.  I INTEND TO CALL THE LOCAL DEALER TOMORROW TO PUT THEM ON NOTICE OF THE PROBLEMS WITH MY VEHICLE.  I CANNOT BELIEVE A REPUTABLE COMPANY LIKE VOLVO DOES NOT TAKE CARE OF THE CUSTOMERS WHO HAVE PURCHASED THEIR VEHICLES.  I AM FORMALLY REQUESTING THAT THE INVESTIGATION INTO THESE PROBLEMS BE REOPENED AS THE PROBLEMS CAUSED BY THE CEM DESIGN FLAWS CAUSE DANGEROUS PROBLEMS THAT CAN THREATEN THE SAFETY AND EVEN THE LIVES OF THOSE WHO DRIVE AND RIDE IN THE VOLVO XC90",
        "vin": "YV1CY592951"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/03/2015",
        "dateOfIncident": "06/15/2015",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10788086,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 VOLVO XC90. THE CONTACT STATED THAT WHEN IT RAINED, WATER ENTERED THE VEHICLE THROUGH THE PASSENGER SIDE AND ONTO THE DASHBOARD, CAUSING THE INSTRUMENT PANEL LIGHTS TO DIM. WHILE DRIVING 40 MPH, THE VEHICLE STALLED WITHOUT WARNING AND THE RADIO NO LONGER WORKED. ADDITIONALLY, THE HEADLIGHTS TURNED ON AND OFF. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO WAS UNABLE TO DIAGNOSE THE FAILURES. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURES. THE FAILURE MILEAGE WAS 162,189.",
        "vin": "YV1CZ592951"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/07/2015",
        "dateOfIncident": "10/01/2015",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10780580,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A RECALL DATED MARCH 2010 FOR 2003-2005 XC90 FOR FUEL SYSTEM PROBLEMS, I AM HAVING PROBLEMS WITH MY CAR HAVING PROBLEMS RUNNING. ENGINE ANALYSIS SHOWS CODE PO087AND P0089, FUEL PRESSURE REGULATOR. CAR WILL NOT CONTINUE TO RUN WHILE DRIVING WITH LESS THAN 3/4 FULL TANK.",
        "vin": "YV1CY592251"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/05/2015",
        "dateOfIncident": "07/13/2015",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10779801,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "ASIDE FROM NORMAL CARE, I HAVE ONLY REPLACED MY TIRES AND A GAS CAP. I STARTED TO EXPERIENCE SOME WATER SEEPAGE ONTO THE DRIVER-SIDE. I COVERED THE VEHICLE WHEN IT RAINED AND FIGURED I WOULD HAVE A LOOK AT IT WHEN I HAD TIME. JULY 2015, I TOOK MY VOLVO TO SAVANNAH VOLVO, FIXED MY BREAKS ALONG WITH OTHER SAFETY FIXES, AFTER 14 HRS OF HAVING MY VEHICLE AND 2800 LATER, PETE STATED EVERYTHING WAS TAKEN CARE OF AND THE WATER SEEPAGE WAS DUE TO THE DRAINS BEING CLOGGED, BUT, THEY ARE ALL CLEAR NOW, WE DID A WATER TEST AND EVERYTHING IS OK. YOU WILL EXPERIENCE SOME MORE WATER SEEPAGE BUT IT SHOULD DRY UP IN A FEW DAYS. HE ALSO MENTIONED SOME OTHER WORK THAT NEEDED TO BE DONE THOUGH NOT UNTIL NOVEMBER, DECEMBER. I SAID GREAT AND GOT ON MY WAY. THREE DAYS LATER IT DID RAIN, CONFIDENT I DID NOT NEED TO COVER MY VEHICLE AND WAS STILL EXPERIENCING WATER SEEPAGE FROM MY VISIT, I DID NOT THINK ANY THING OF IT. THE NEXT DAY, MY CONTROL PANEL STARTED TO LIGHT UP. I CALLED SAVANNAH, AND HE MENTIONED IT MUST JUST BE BECAUSE YOU PUT A FULL TANK OF GAS....WHAT??? OK. AS THE WEEK WENT ON THE CONTROL PANEL CONTINUED TO LIGHT UP ONE BY ONE. THE DAY BEFORE GOING BACK, MY DRIVER SIDE TURN SIGNAL WAS ON. HOPING I DID NOT HAVE A DEAD BATTERY THE NEXT DAY, I HEADED TO VOLVO. AFTER 4 HRS THEY TELL ME THE ROOF DRAINS WERE CLOGGD AND SEEPED ONTO THE CEM, AND IT IS DAMAGED. I SAID TO PETE, I THOUGHT THE DRAINS WERE CLEAR WHEN I LEFT A WEEK AGO??? YEAH, WELL, WE CAN'T CREATE A PROBLEM WITH YOUR DRAINS. THOUGH, AFTER 10 YRS I LEAVE THERE AND 3 DAYS LATER EXPERIENCE A PROBLEM, AFTER YOU TOLD ME MY DRAINS WERE ALL CLEARED? SEVERAL PHONE CALLS TO THE DEALERSHIP AND VOLVO HEADQUARTERS, NOT ONE PERSON IS TAKING RESPONSIBILITY FOR THIS BAD DESIGN, WHICH COULD HAVE CAUSED MY TRANSMISSION TO LIMP AND A POSSIBLE ACCIDENT! IT NOW SITS IN MY DRIVEWAY, AFTER SPENDING 2800.00 I WILL NEVER PURCHASE ANOTHER VOLVO!",
        "vin": "WAULV94E981"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/28/2015",
        "dateOfIncident": "08/25/2015",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10777982,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SPARE TIRE FELL OFF THE UNDER BODY CARRIAGE WHILE I WAS DRIVING, BOUNCED, AND ROLLED DOWN THE BUSY ROAD!  THE CABLE HOLDING IT ON APPEARS TO HAVE BROKEN.",
        "vin": "YV1CZ592351"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/12/2015",
        "dateOfIncident": "04/09/2015",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10705228,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER RAINFALL WE BEGAN EXPERIENCE POWER FAILURES IN OUR VOLVO. NO WINDOWS WERE LEFT OPEN AND THE INTERIOR WAS NOT EXPOSED TO ANY WATER. BUT WHILE DRIVING THE DASHBOARD WENT OUT THE NEEDLES FOR THE FUEL, MILES PER HOUR AND EVERYTHING WENT OUT. IT CAME ON SHORTLY AFTER THEN OFF AGAIN THIS TIME WITH THE RADIO AND WINDOWS COULD NOT ROLL DOWN OR UP. ONCE THE CAR WAS OFF IT CAME BACK ON ONLY TO REPEAT THE SAME ISSUE THE DASH AND RADIO COME ON AND OFF WHILE DRIVING AND AT ONE POINT WILL SHUT OFF EVERYTHING UNTIL THE CAR IS TURNED OFF AGAIN. THE HEADLIGHTS WILL FLICKER AS WELL FROM TIME TO TIME. THIS IS EXTREMELY FRIGHTENING CONSIDERING I HAVE A  TODDLER AND SMALL CHILD AND WHILE DRIVING ON A HIGHWAY TO  HAVE EVERYTHING SHUT OFF WAS BEYOND FRIGHTENING AND EXTREMELY WORRISOME. I HAVE BEEN TOLD IT HAS SOMETHING TO DO WITH THE CEM AND I HAVE READ MANY FORUMS WITH PEOPLE WITH THE SAME PROBLEM AND EVEN A FRIEND WHOSE CAR DID THE SAME THING. I AM EXTREMELY FRUSTRATED THAT I DON'T FEEL SAFE DRIVING MY CAR AND THAT I HAVE TO PAY A LOT OF MONEY FOR SOMETHING THAT DOES NOT SEEM LIKE A NORMAL FAILURE ESPECIALLY SINCE MY CAR DOES NOT EVEN HAVE MANY MILES ON IT. PLEASE INVESTIGATE AND LOOK INTO THIS PLEASE. THANK YOU.    *TR",
        "vin": "YV1CZ911951"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/09/2015",
        "dateOfIncident": "12/17/2014",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10693142,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 VOLVO XC90. THE CONTACT STATED THAT THE CHECK ENGINE WARNING LIGHT ILLUMINATED. IN ADDITION, THE VEHICLE JERKED AND STALLED WHILE DRIVING. THE VEHICLE WAS TAKEN TO A INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE FUEL PUMP INJECTOR NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 98,000.",
        "vin": "YV1CZ852551"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/16/2015",
        "dateOfIncident": "01/15/2015",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10673038,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 VOLVO XC90. WHILE DRIVING APPROXIMATELY 45 MPH, THE VEHICLE EMITTED AN ABNORMAL NOISE AND STALLED. IN ADDITION, THE CHECK ENGINE WARNING LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE WIRE CEM NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 120,000.",
        "vin": "YV1CZ852751"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/12/2015",
        "dateOfIncident": "12/23/2014",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10671814,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BEARING FOR THE COUNTER BALANCE SHAFT HAS FAILED ON MY VEHICLE, CAUSING OVER $3,000 IN REPAIRS NEEDED. VOLVO HAS ADMITTED THAT THIS IS A KNOWN ISSUE WITH OLDER 2005 XC90'S WITH THE V8, BUT ARE NOT WILLING TO COVER MY REPAIRS COSTS. I FEEL THERE SHOULD BE A RECALL.  IF THIS BEARING FAILS WHILE DRIVING THE ENGINE COULD SEIZE CAUSING AN ACCIDENT.   *TR",
        "vin": "YV1CZ852251"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/26/2014",
        "dateOfIncident": "06/16/2014",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10668406,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 XC90 V8 STALLED IN TRAFFIC.  WOULD NOT RESTART, BUT STARTER WOULD CRANK.  FUEL PUMP CONTROLLER WAS FOUND TO BE INTERNALLY CORRODED AND FILLED WITH DRIED SALT.  THIS CONTROLLER IS MOUNTED FORWARD OF THE RIGHT REAR WHEEL WELL.  MANY INSTANCES OF THIS CONTROLLER FAILING DUE TO SALT / MOISTURE INGRESS HAVE BEEN REPORTED BY OTHER OWNERS.  THE CONTROLLER WAS RELOCATED TO THE INSIDE OF THE VEHICLE SOME MODEL YEARS LATER.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/22/2014",
        "dateOfIncident": "10/30/2014",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10660192,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING AT APPROXIMATELY 40 MPH, THE CHECK ENGINE AND OIL WARNING LIGHTS APPEARED.  THE CAR COMPLETELY DIED WHILE I WAS ON THE ROAD.  THE STEERING WHEEL AND BRAKES FROZE UP AND THE SPEED DECREASED TO BARELY NOTHING.  I COULD GET THE CAR TO JUST MAKE IT OFF THE ROAD SAFELY BECAUSE I COULD NOT TURN THE WHEEL OR USE THE BRAKES WELL.  THOUGHT IT WAS MY OIL SO I WAS ABLE TO GET SOMEONE TO ADD OIL TO IT WHILE ON SIDE OF BUSY ROAD.  STARTED CAR UP FINE AND DROVE FOR 5 MORE DAYS UNTIL IT HAPPENED AGAIN.  GOT IT TOWED TO MECHANIC WHO CHANGED THE FUEL PUMP.  OTHER ELECTRICAL PROBLEMS AROUSE WHILE MECHANIC HAD IT SO BROUGHT TO VOLVO WHO SAYS I NEED A NEW CONTROL ELECTRIC MODULE IN MY CAR.    *TR",
        "vin": "YV1CZ592051"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/18/2014",
        "dateOfIncident": "11/17/2014",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10658892,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER PARKING AT RESTAURANT, WE WALKED TO OUR PARKED VOLVO AND WHEN I TURNED THE KEY, IT WOULD ONLY GO FROM 0 TO THE 1 POSITION ( I.E.LIGHTS, RADIO WOULD COME ON) BUT IT WOULD NOT TURN ANY FURTHER TO THE START POSITION HAD TO HAVE IT TOWED TO THE DEALER AND WAS TOLD THIS HAS HAPPENED BEFORE TO THIS MODEL AND IT IS AN IGNITION LOCK FAILURE. THEY NEED TO ORDER THE PART FROM SWEDEN AND HAVE IT MATCH OUR KEYS. $850 !!.  THIS IS A SAFETY ISSUE IN MY MIND HAS WE COULD HAVE BEEN STRANDED ANYWHERE AND IF THIS IS NOT THE FIRST TIME THIS HAS HAPPENED, WHY ARE THEY NOT RECALLING THIS PART?   *TR",
        "vin": "YV1CZ911951"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/03/2014",
        "dateOfIncident": "10/21/2014",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10652117,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS JUST DRIVING ALONG AT 30 MPH OR LESS WHEN I HEARD A PRETTY LOAD NOISE AND THEN FELT A VIBRATION ON THE FLOOR BOARD.  I WAS JUST A BLOCK AWAY FROM MY DESTINATION AND WHEN I GOT THERE THE NOISE CONTINUED.  I ORIGINALLY THOUGHT THE NOISE WAS COMING FROM UNDER THE CAR BUT AFTER FURTHER INVESTIGATION LATER IN THE DAY AFTER LETTING THE CAR SIT FOR AWHILE I REALIZED THE NOISE WAS COMING FROM THE ENGINE.  I HAD THE CAR ORIGINALLY TOWED TO MY MECHANIC WHO INFORMED ME THAT THE ENGINE WAS BLOWN.  I COULD NOT BELIEVE THIS I HAD THE CAR A LITTLE UNDER ONE YEAR AND THE PREVIOUS OWNER ALWAYS HAD THE CAR SERVICED THROUGH A VOLVO DEALERSHIP FROM DAY ONE TO 60,200.  I TOOK OVER THE CAR AND AT THE TIME OF THE INCIDENT MY CAR HAD A LITTLE OVER 85,000 MILES.  ENGINES ARE NOT SUPPOSE TO FAIL AT UNDER 100,000 MILES.  THERE IS SOMETHING SERIOUSLY WRONG WITH THESE ENGINES.  THE INTERNET IS FULL OF THESE STORIES JUST LIKE MINE AND VOLVO IS DOING NOTHING ABOUT IT!  THEY DO NOT CARE, THEY DO NOT STAND BEHIND THEIR CARS. SOMETHING HAS TO BE DONE ABOUT THIS A LOT OF INNOCENT PEOPLE ARE BEING HURT FINANCIALLY BY VOLVO.  A RECALL ON THESE CAR SHOULD BE ISSUED...VOLVO NEEDS TO BE HELD ACCOUNTABLE FOR THIS! VOLVO MADE THE DETERMINATION NOT TO HELP ME...WITHOUT EVEN SEEING THE CAR AND THE SERVICE RECORDS.  ACTION NEEDS TO HAPPEN AND THEY NEED TO BE FORCED TO HELP ME AND THE HUNDREDS IF NOT THOUSANDS OF PEOPLE THAT HAVE BEEN AFFECTED BY THIS.   *TR",
        "vin": "YV1CZ852651"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/24/2014",
        "dateOfIncident": "09/26/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10649735,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS A 2005 VOLVO THAT HAS A HISTORY OF TRANSMISSION FAILURE IN ALL CARS OF THIS MODEL AND YEAR.  IF  ONE GOOGLES THE MODEL AND MAKE OF THIS CAR ONE WILL FIND FORUM AFTER FORUM OF PEOPLE WHO HAVE HAD TO REPLACE THESE FAILED TRANSMISSIONS BEFORE OR SHORTLY AFTER WARRANTY IS UP.    THE DEALERS AND SERVICES HAVE LARGELY PUT THIS ITEM WHICH SHOULD HAVE BEEN A RECALL ISSUE ON TO THE CUSTOMER.   MY TRANSMISSION FAILED WHEN TRYING TO ACCELERATE ON TO A FREEWAY.  I WAS NEARLY IN A LIKELY FATAL COLLISION DUE TO THE TRANSMISSION FAILING TO GO OUT OF 2ND GEAR.    THERE WAS A CLASS ACTION SUIT SURROUNDING THIS ISSUE IN THIS MODEL , BUT FEW VOLVO OWNERS WERE NOTIFIED OF IT.  PLEASE HELP US AND DEMAND THAT VOLVO RECALL THESE CARS, REPAY FOR FAILED TRANSMISSIONS AND LOST VALUE OF THE CARS......ONE CANNOT EVEN GIVE THEM AWAY NO AND THESE WERE 45K$ CARS!!!!!!!!!!FURIOUS.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/24/2014",
        "dateOfIncident": "08/20/2014",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10649780,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING VEHICLE AT 55-60 MPH ALL DASHBOARD LIGHTS CAME ON AND CAR LOST POWER. THIS CAUSED A FRIGHTENING AND EXTREMELY DANGEROUS SITUATION. WITHOUT HEADLIGHTS OR TAIL LIGHTS I COULD NOT BE SEEN BY OTHER DRIVERS. I TRIED TO CROSS 2 LANES AND GET ONTO THE SHOULDER WITH NO POWER STEERING OR ENGINE POWER. WHILE I WAS VERY FORTUNATE I WAS NOT IN OR DID NOT CAUSE A SERIOUS ACCIDENT I HAD AN EXTREMELY CLOSE CALLS.  I CHANGED LANES AND ALMOST COLLIDED WITH ANOTHER VEHICLE TRAVELING AT 55. ONCE IN THE LANE ANOTHER DRIVER WHO WAS UNABLE TO SEE MY VEHICLE (NO LIGHTS) CAME UP BEHIND ME AT A HIGH RATE OF SPEED. ONLY A LAST MINUTE SWERVE AVOIDED A REAR END COLLISION THAT NO DOUBT WOULD HAVE CAUSED A TERRIBLE ACCIDENT WITH VERY SERIOUS IF NOT TRAGIC RESULTS. ADDITIONALLY OTHER DRIVERS HAD TO SWERVE TO AVOID THE VEHICLE-CAUSING A VERY DANGEROUS,  CHAOTIC SITUATION. THE LOSS OF POWER AND LOSS OF LIGHTS CAME CLOSE TO CAUSING A MAJOR MULTI-VEHICLE ACCIDENT. MANY ARE AWARE OF THIS PROBLEM. PLEASE DO NOT WAIT UNTIL PEOPLE ARE KILLED TO REOPEN THE INVESTIGATION AND RE-CONSIDER A SAFETY RECALL.   *TR",
        "vin": "YV1CZ852751"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/07/2014",
        "dateOfIncident": "09/01/2014",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10641999,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION COMPLETELY FAILED. THIS WAS THE 2ND TRANSMISSION, AS THE FIRST ONE FAILED AT 45000 MILES. I HAD TO REPLACE THE TRANSMISSION AT A COST OF $6000. REBUILDING FAILED TRANS WAS SLIGHTLY CHEAPER BUT NOT WORTH IT. I UNDERSTAND THERE IS A CLASS ACTION LAWSUIT, BUT WAS SETTLED BEFORE MY TRANSMISSION FAILED.    *TR",
        "vin": "YV1CZ911X51"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/28/2014",
        "dateOfIncident": "04/08/2014",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10629144,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASE A USED 2005 VOLVO ON APRIL 19, 2013 FROM C& M AUTO SALES CORPORATION.  IN DECEMBER OF 2013 I RECEIVED A RECALL NOTICE  FROM VOLVO.  THEY NOTIFIED ME THAT ALL 2004-2005 VOLVO XC90- WERE RECALLED.  I WAS INFORMED TO TAKE IT TO A VOLVO DEALER.  I DROVE THE VEHICLE TO WHITE PLAINS, N Y.  DEALER THERE I WAS TOLD THEY TOOK CARE OF THE PROBLEM.  UPON RETURNING HOME I NOTICED ALL LIGHTS WERE ON THE DASHBOARD & RETURN THE VEHICLE TO THE DEALER.  THERE WERE MANY ISSUES CLAIMED BY THE DEALERS  AND WAS TOLD TO PICK IT UP WHICH I DID EVER SINCE THEN VEHICLE HAS BEEN PARKED AND NOT DRIVEN.  *TR",
        "vin": "YV1CZ911251"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/05/2014",
        "dateOfIncident": "07/31/2014",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10619092,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 VOLVO XC90. WHILE DRIVING APPROXIMATELY 55 MPH, THE VEHICLE STALLED WITHOUT WARNING. THE CONTACT STATED THAT THE TRANSMISSION FAILED AND THE INSTRUMENT PANEL DIMMED TEMPORARILY. THE CONTACT DISCONNECTED THE BATTERY CABLE TO RESET THE VEHICLE AND MANAGED TO RESTART THE VEHICLE. THE FAILURE OCCURRED MULTIPLE TIMES. AN INDEPENDENT MECHANIC STATED THAT THE CENTRAL ELECTRIC MODULE MALFUNCTIONED WHICH PREVENTS THE VEHICLE FROM DRAINING WATER PROPERLY DURING RAINY CONDITIONS. THE VEHICLE WAS NOT REPAIRED. THE VIN WAS UNAVAILABLE. THE APPROXIMATE FAILURE MILEAGE WAS 165,000.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/02/2014",
        "dateOfIncident": "04/17/2013",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10595522,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "GOOD MORNING,   I PURCHASE A 2005 VOLVO XC90 FROM DRIVE TIME ON MARCH 29, 2013, PRIOR TO PURCHASING THIS VEHICLE IT WAS MY DREAM AUTOMOBILE, ON APRIL 17, 2013 MY CHECK ENGINE LIGHT CAME ON, I WAS LATE FOR WORK BECAUSE I WENT TO DRIVE TIME TO FIND OUT WHERE TO TAKE IT SINCE I DID PURCHASE THE DRIVE CARE PACKAGE. I CALLED THE CLAIM DEPARTMENT AND BECAUSE OF MILES I TRAVEL DAILY THE WARRANTY MILEAGE HAD EXPIRE, WHICH WAS CONFUSING BECAUSE ON THE SALE SLIP ON THE CAR IT STATED 30 DAY WARRANTY, I WAS TOLD TO TAKE IT A VOLVO DEALER FOR SERVICE, I TOOK IT TO MOOERS VOLVO IN RICHMOND, VA  AND THE DIAGNOSTIC TEST INDICATE THERE WERE MISFIRE IN THE SPARK PLUGS ($500) LATER, THEY ALSO STATED THEY WERE THE ORIGINAL PLUGS AND NEEDED TO BE CHANGED AND MY DRIVE CARE PACKAGE DIDN'T COVER MAINTENANCE. FOUR DAYS LATER THE CHECK ENGINE LIGHT WAS BACK ON, INDICATING THE SAME PROBLEM (MISFIRE IN PLUGS 6 &8) AGAIN MISSING TIME FROM WORK TO HAVE THIS CHECKED OUT BECAUSE I DON''T WANT TO BE BROKE DOWN ON THE HIGHWAY. THIS TIME THEY CHANGE THE FUEL FILTER AND PUT A GAS TREATMENT IN MY CAR ($154) LATER, STATING THAT IT WAS SOMETHING TO DO W/FUEL TANK. I HAVE SPENT A LITTLE OVER $1000, IN REPAIRS AND CAR RENTAL AND MY CAR WAS TWO MONTHS OLD AT THAT TIME.   I GOT MY CAR SERVICED ON TIME AND STILL MY CHECK ENGINE IS STILL ON.I WENT TO A SHOP RECENTLY BECAUSE OF THE (A YEAR LATER) CHECK ENGINE LIGHT IS STILL ON. THEY SUGGEST I LOOK UP THE RECALL SAFETY BECAUSE NOW ONE SIDE B1 HAS A MISFIRE READING. NO ONE SEEMS TO KNOW HOW TO FIX THE PROBLEM AND I TRAVEL AN HOUR EACH WAY TO WORK AND WOULD HATE FOR SOMETHING TERRIBLE TO HAPPEN. I'M HOPING YOU WOULD GUIDE ME IN THE RIGHT DIRECTION TO HAVE MY CAR REPAIRED OR WHO I NEED TO DIRECT MY CONCERNS TO. THANK YOU IN ADVANCE FOR ANY ASSISTANCE.  *TR",
        "vin": "YV1CZ852351"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/06/2014",
        "dateOfIncident": "05/01/2014",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10585891,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 VOLVO XC90.  CONSUMER WRITES IN REGARDS TO ENGINE BREAKDOWN.  *SMD  AN INITIAL INDEPENDENT MECHANIC BELIEVED THE PROBLEM WAS DUE TO A DECLARED DESIGN FLAW BY VOLVO IN THEIR 2005 MODELS. THE MECHANIC ADVISED THE CONSUMER, TO HAVE THE VEHICLE TOWED TO THE DEALER. THE DEALER HAD THE VEHICLE FOR 3 WEEKS AND DETERMINED THE CAUSE OF THE ENGINE BREAK DOWN WAS IN FACT A DESIGN FLAW. CORPORATE VOLVO STATED THE ISSUE WAS NOT PROBLEMATIC ENOUGH FOR THEM TO ISSUE A RECALL, AS PROBLEMS WERE EVALUATED ON A CASE-BY-CASE BASIS. VOLVO INFORMED THE DEALER TO RE-BUILD THE ENGINE, INSTEAD OF REPLACING IT. *JB",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/13/2014",
        "dateOfIncident": "03/17/2014",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10579490,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "COMPLETE INSTRUMENT PANEL FAILURE WHILE DRIVING -  NO ABILITY TO LET THE WINDOWS UP OR DOWN, NO SPEEDOMETER VISIBILITY, NO GAS READING . THERE WAS NO ABILITY FOR DEFOGGING WINDOW, NO ABILITY TO TURN ON HEAT OR AIR. THIS IS REALLY DANGEROUS WHEN DRIVING. THE PANEL GOES COMPLETELY BLANK.   *JS",
        "vin": "YV1CM592651"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/08/2014",
        "dateOfIncident": "03/20/2014",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10578331,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WE PURCHASED THIS 2005 VOLVO XC90 USED IN OCTOBER 2011 AND SINCE THAT TIME HAVE HAD TO REPLACE THE HEADLAMP MODULE 3 TIMES.  THE LEFT HEADLIGHTS WOULD SOMETIMES WORK AND OTHER TIMES NOT.  EACH TIME WE TOOK IT IN FOR DIAGNOSIS, WE WERE TOLD THAT THE HEADLAMP MODULE NEEDED TO BE REPLACE.  THIS IS A $460 PART, ONE THAT HAS A LONG HISTORY OF FAILURE.  MY WIFE IS AFRAID TO DRIVE THIS VEHICLE AT NIGHT, FOR FEAR THAT THE HEADLIGHTS WILL GO OUT.  I CAN UNDERSTAND IF THE MODULE FAILED ONCE, OR MAYBE EVEN TWICE, BUT THREE TIMES IN ONLY 2.5 YEARS AND LESS THAN 20,000 MILES.  IT APPEARS THAT THIS IS A RECURRING PROBLEM WITH OTHER VOLVO OWNERS AS WELL, YET VOLVO HAS NOT TAKEN STEPS TO REMEDY THE ISSUE.  I CONSIDER THIS TO BE A SIGNIFICANT SAFETY ISSUE, ONE THAT NEED TO BE ADDRESSED.  I AM VERY DISAPPOINTED WITH VOLVO'S LACK OF ACTION TO CORRECT THIS PROBLEM.  CHECKING ONLINE, I SEE THAT MANY OTHER VOLVO XC90 OWNERS HAVE BEEN EXPERIENCING THE SAME PROBLEM.  ANY ASSISTANCE WILL BE GREATLY APPRECIATED.  THANK YOU.  *TR",
        "vin": "YV1CZ911251"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/24/2014",
        "dateOfIncident": "03/19/2014",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10574506,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 VOLVO XC90. THE CONTACT STATED THAT WHILE DRIVING VARIOUS SPEEDS, THE VEHICLE WOULD JERK AND THE TURNING SIGNALS FAILED. THE CONTACT STATED THAT THE ELECTRONIC POWER STEERING SYSTEM, SRS AIR BAG SERVICE, ANTI-SKID, AND THE IMMOBILIZER WARNING LIGHTS ILLUMINATED. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE CENTRAL ELECTRONIC MODULE, RACK AND PINION NUT, AND PINION SHAFT NEEDED TO BE REPLACED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE AND CURRENT MILEAGE WAS 139,419.",
        "vin": "YV1CZ911951"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/17/2014",
        "dateOfIncident": "03/15/2014",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10572870,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS STARTING TO ACCELERATE AFTER A RED TRAFFIC LIGHT WHEN THE ENGINE SUDDENLY DIED AND CAR STOPPED RIGHT IN THE MIDDLE OF TRAFFIC. CAR WOULD NOT START AGAIN. BATTERY WAS GOOD, STARTED WORKED GOOD BUT IT SOUNDED LIKE NO GAS WAS GETTING TO THE ENGINE. BEING STUCK IN THE MIDDLE OF TRAFFIC, I WAS PUSHED BY THE CAR BEHIND ME TO A SAFE LOCATION OUT OF TRAFFIC. TOWED CAR TO SHOP AND STILL INVESTIGATING THE FAILURE.   *TR",
        "vin": "YV1CZ592151"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/26/2014",
        "dateOfIncident": "09/18/2008",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10565947,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL-     THE CONTACT OWNS A 2005 VOLVO XC90. THE CONTACT STATED WHILE DRIVING 55 MPH THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS TAKEN TO THE DEALER FOR INSPECTION BUT THEY COULD NOT DIAGNOSE THE CAUSE OF FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VIN WAS UNAVAILABLE.  THE FAILURE MILEAGE WAS 45,000.   RK",
        "vin": ""
    },
    {
        "components": "VISIBILITY,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/25/2014",
        "dateOfIncident": "02/25/2013",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10565772,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A  2005 VOLVO XC90. THE CONTACT STATED THAT WATER LEAKED INTO THE VEHICLE THROUGH THE SUN ROOF. THE WATER CAUSED DAMAGED TO THE HEADLINER AND FLOORBOARD CARPET.  THE FAILURE ALSO CAUSED THE SEATS TO MOVE INDEPENDENTLY AND A GROWTH OF MOLD AND MILDEW INSIDE THE VEHICLE. THE CONTACT ALSO STATED THAT THERE WERE SEVERAL WATER BUGS AND OTHER TYPES OF INSECTS INFESTING THE VEHICLE DUE TO THE WATER ACCUMULATION. THE CONTACT SUFFERED FROM MEDICAL DISTRESS AS A RESULT OF THE FAILURE. THE CONTACT TOOK THE VEHICLE TO THE DEALER FOR DIAGNOSIS BUT WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND DECLINED TO REPAIR THE VEHICLE. THE CONTACT TOOK THE VEHICLE TO TWO INDEPENDENT MECHANICS BUT THEY WERE UNABLE TO DRAIN THE SEVERAL GALLONS OF WATER THAT COULD BE HEARD FROM THE VEHICLE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 122,000. THE CURRENT VEHICLE MILEAGE WAS 130,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "STEERING,SUSPENSION,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/12/2014",
        "dateOfIncident": "12/12/2013",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10564127,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT THIS CAR AT 12/12/2013 WHEN I TEST DROVE THE CAR THE DEALER HAD THE RADIO ON AND I NEVER SUSPECTED ANY NOISE AT THE TIME.AFTER I BOUGHT THE CAR I KEPT HEARING THIS KNOCKING NOISE AT FIRST I THOUGHT IS WAS THE SKI RACK MAKING THE NOISE THEN WHEN MY HUSBAND DROVE IT HE SAID IT WAS COMING FROM THE TIRES SO I TOOK THE CAR TO MY MECHANIC AND HE CHECK IT A OUT AND FOUND MULTIPLE PROBLEMS THE SUSPENSION,INNER TIE RODS,AXLES,SWAY BAR, STEERING,BUSHINGS ETC HIS REPLY WAS HOW DID THIS CAR PASS INSPECTION WITH ALL THE PROBLEMS AVAILABLE TAKE THE CAR BACK AND ASK THE DEALER TO FIX THE PROBLEMS.I TOOK THE CAR BACK AND ASK THE DEALER TO COMPLY THEY WOULD NOT I TOLD THEM THEY HAD RECEIVED A FAULTY INSPECTIONS ON THE CAR SO I TOOK IT TO ANOTHER MECHANIC SAME RESPONSE. I THEN CALLED THE SAFETY INSPECTORS AND THEY CAME OUT TO CHECK OUT THE CAR AND FOUND NOTHING. I THEN TOOK IT TO ANOTHER DEALER AND THEY REPORTED THE SAME PROBLEMS AND ADDED A CRACKED ENGINE MOUNT. I THEN ASKED THE INSPECTOR TO COME AND LOOK AT ALL THE THINGS THAT VOLVO FOUND THAT THE SAFETY INSPECTORS MISSED HE AGREED AND SAW BUT ONLY WROTE A REPORT I STILL HAVE A BROKE CAR THAT WAS FAULTY INSPECTED. I WANT THE DEALER TO FIX MY PROBLEM AND THEY HAVE REFUSED I COULD SUE THEM FOR GETTING A FAULTY INSPECTION AND SELLING A LEMON BUT I FELL LIKE I AM STUCK I NEED TO KNOW WHAT TO DO FROM HERE I HAVE ALREADY PAID FOR SEVERAL THINGS THE RACK AND PINION IS THE MOST IMPORTANT I HAVE TO FIX BUT EXPENSIVE AND THE BUSHINGS AND TIE RODS ARE GOING TO BE THE NEXT THING I REPAIR I REALLY DON'T HAVE THE MONEY TO FIX THEM I AM PAYING 7000.00 FOR A USED CAR AND I FELL THAT THE DEALER AND THE INSPECTORS ARE CROOKS AND USED A FAULTY INSPECTION TO SELL A BROKE CAR PLEASE HELP.  *TR",
        "vin": "YV1CZ911151"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/10/2014",
        "dateOfIncident": "01/15/2014",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10563765,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE MOTOR FAILED ON MY 2005 VOLVO XC90 AS A RESULT OF THE COUNTERBALANCE SHAFT BEARINGS FAILING DUE TO MOISTURE IN THE MOTOR. I WAS NOT AWARE THIS MOTOR WAS SUBJECT TO FAILURE AT LESS THAN OR EVEN AROUND 100K MILES. VOLVO DEALERSHIP SAID THIS WAS THE CAUSE OF THE MOTOR FAILURE AND THEY SAID THERE WAS NO RECALL DONE. AFTER THIS HAPPENED I WENT TO SOME VOLVO WEBSITES(SWEDESPEED) ONLY TO FIND THIS SAME EXACT MOTOR FAILURE HAS HAPPENED TO VERY MANY OF THESE 2005 VOLVO XC90'S BECAUSE OF THE COUNTERBALANCE SHAFT BEARINGS FAILING. IN FACE THERE'S A FORUM CATEGORY TITLED \"V8 COUNTERBALANCE SHAFT FAILURE THREAD\" WHERE PEOPLE TALK ABOUT THIS EXACT PROBLEM HAPPENING OVER AND OVER AND VOLVO KNOWS ABOUT THIS ENGINE PROBLEM BUT WILL NOT DO  A RECALL. SOMETHING HAS TO BE DONE WHERE VOLVO BACK THEIR PRODUCTS, ESPECIALLY THE ENGINE IN A VEHICLE.  *TR",
        "vin": "YV1CZ852851"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/08/2014",
        "dateOfIncident": "02/03/2014",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10563531,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS CAR HAS BEEN A CONSTANT PROBLEM - I AM THE ORIGINAL OWNER AND THE COST TO REPAIR IS EXTREMELY HIGH.. I AM A RECENT WIDOW AND A SINGLE MOTHER OF 3 CHILDREN ON A FIXED INCOME... I AM SO TIRED OF THIS CAR BEING SO UNRELIABLE AND THE REPAIR COSTS ARE BANKRUPTING ME. I HAVE NO WHERE TO TURN THIS CAR HAS BEEN A LEMON FROM DAY ONE AND THE MANUFACTURER AND DEALER COULD CARE LESS.  *TR",
        "vin": "WILL SUPPLY"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/31/2014",
        "dateOfIncident": "12/04/2013",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10562413,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "VOLVO IS AWARE OF THE BALANCER SHAFT DEFECT THAT CAUSING A VERY PRICEY AND SERIOUS PROBLEM. THE FIX WAS TO DRILL A HOLE BUT NOT TO REPAIR ANY DAMAGE CAUSED BY THE DESIGN FLAW. I WAS INFORMED BY THE VOLVO DEALERSHIP THAT THIS IS A DESIGN FLAW IN THE 2005 CX90 AND THE COST WOULD BE AROUND $4000 TO FIX THE DAMAGE DONE TO THE BALANCE SHAFT BECAUSE OF THE DESIGN FLAW.  *TR",
        "vin": "YV1CZ852651"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/29/2014",
        "dateOfIncident": "01/23/2014",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10562081,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 VOLVO XC90. THE CONTACT STATED  WHILE DRIVING APPROXIMATELY 35 MPH THE WINDSHIELD WIPERS BECAME INOPERABLE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE THE MECHANIC DIAGNOSED THAT THE CENTRAL ELECTRONIC MODULE NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE CONTACT WAS INFORMED BY THE MANUFACTURER THAT HIS VEHICLE WAS NOT COVERED UNDER NHTSA CAMPAIGN NUMBER: 06V144000 (VISIBILITY). THE APPROXIMATE FAILURE MILEAGE WAS 128,000.",
        "vin": "YV1CZ852751"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/24/2014",
        "dateOfIncident": "12/26/2013",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10561371,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "KNOWN TRANSMISSION DEFECT WITH THIS MODEL HAS MANIFESTED ITSELF IN MY VEHICLE. CAR BEGAN LURCHING WHEN ACCELERATING AND TRANSITIONING INTO THE NEXT GEAR WHILE ATTEMPTING TO MERGE ONTO A BUSY INTERSTATE HIGHWAY. DEALER DIAGNOSED THE PROBLEM AND STATES THAT THE TRANSMISSION NEEDS TO BE REPLACED. APPARENTLY VOLVO HAS ACKNOWLEDGED THIS DEFECT WITH THE POWER-TRAIN AND IN 2012 AGREED TO SETTLE A CLASS ACTION LAWSUIT WITH REGARDS TO THIS PROBLEM. THIS FACT HOWEVER ONLY IMPACTS THOSE WHO PREVIOUSLY PAID TO HAVE THIS PROBLEM FIXED. STILL NO RECALL REGARDING THIS POTENTIALLY HAZARDOUS ISSUE FOR THOSE CURRENTLY IMPACTED. ALL VEHICLES EQUIPPED WITH THEIR ORIGINAL TRANSMISSIONS NEED TO BE RECALLED (2003, 2004 AND 2005).  *TR",
        "vin": "YV1CZ592951"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/05/2014",
        "dateOfIncident": "12/18/2013",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10558552,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CENTRAL ELECTRONIC MODULE (CEM) WILL NOT PERFORM AS INTENDED. AS A RESULT, AUDIO SYSTEM, PARKING ASSIST, AND PASSENGER AIRBAG DOES NOT WORK. AUDIO SYSTEM TURNS ON SPORADICALLY BY ITSELF AND RUNS CONTINUOUSLY(I HAVE TO PULL OVER, TURN THE ENGINE OFF, THEN WAIT 3+ MINUTES TO STOP IT).     AS A RESULT, THE FRONT WINDSHIELD WIPERS MIGHT RUN CONTINUOUSLY WHEN THE IGNITION IS ON. ALSO, THE TURN SIGNALS, HIGH BEAMS, AND HEADLIGHT SWITCH MIGHT NOT WORK.     THIS ISSUE WAS RECALL 2014 VOLVO S60, S80, XC60 AND XC70. 2005 XC90 BUT IT SHOULD BE INCLUDED IN THIS RECALL BECAUSE MALFUNCTIONING ELECTRONIC SYSTEM (PASSENGER AIRBAGS, HEAD LAMPS, AND/OR TURN SIGNALS) INCREASE THE RISK OF A CRASH.    IT'S NOT FAIR, WHEN SAME PROBLEM IS ACCEPTED AS REASON FOR RECALL FOR 2014 MODELS(XC60, S60, S80, XC70) BUT NOT 2005 XC90S. *TR",
        "vin": "YV1CZ911X51"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/25/2013",
        "dateOfIncident": "10/14/2013",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10549471,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE COUNTERBALANCE SHAFT BROKE RESULTING IN ENGINE FAILURE.  VOLVO ESTIMATES REPAIR AT $5,0000.  RIDICULOUS.  WHY DOESN'T VOLVO FIX THIS WELL KNOWN ISSUE FOR LOYAL CUSTOMERS.  I HAVE HAD 5 VOLVOS IN MY LIFE STARTING BACK IN THE 1980'S AND LOVE THE CARS BUT THIS LACK OF CARE FOR CUSTOMER WELFARE IS JUST WRONG.  IT MAY BE MY LAST VOLVO IF THIS IS HOW THEY TREAT CUSTOMERS NOW DAYS.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/23/2013",
        "dateOfIncident": "09/22/2013",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10544906,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 VOLVO XC90 V8 - ENGINE NUMBER 6163 - COUNTER BALANCE SHAFT FAILURE DUE TO ENGINE DESIGN DEFECT. NO RECALL BY VOLVO DESPITE VERY HIGH VOLUME OF INCIDENTS AND THE SAFETY RISK TO DRIVERS AND PASSENGERS OF THEIR VEHICLES. NO CHECK ENGINE LIGHTS. VOLVO KNOWS ABOUT THIS ISSUE AND CHOOSES TO IGNORE IT, AUTHORITIES ARE A AWARE OF IT AND CHOSE NOT TO ENFORCE SAFETY STANDARDS ON VOLVO- \"VOLVO FOR LIFE\"...I THINK NOT.",
        "vin": "YV1CZ852151"
    },
    {
        "components": "POWER TRAIN,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/11/2013",
        "dateOfIncident": "09/03/2013",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10543169,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING BACK FROM WORK THE PASSENGER LOW BEAM WENT OUT. I BOUGHT A NEW BULB AND THE LIGHT STILL DID NOT WORK L THEN CHECKED. THE WIRING GOING INTO THE HEADLIGHT AND THERE WAS NO POWER FOR THE LOW BEAM HOW DOES THIS HAPPEN IT WAS BAD ENOUGH I HAD TO REPLACE THE WHOLE TRANSMISSION JUST 3MONTHS AGO AND NOW THIS I ALSO READ NONLINEAR THEY HAD PROBLEMS WITH THE TRANNYS.  *TR",
        "vin": "YV1CZ911951"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/26/2013",
        "dateOfIncident": "08/13/2013",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10537349,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2005 V8 XC90.  LIKE SO MANY OTHERS I AM A RECENT MEMBER TO THE CB FAILURE CLUB.  YEP.  IT'S A CLUB.  THE COUNTER BALANCE SHAFT FAILURE CLUB.  THIS IS A DESIGN DEFECT THAT VOLVO IS AWARE OF AND DOES NOTHING TO REMEDY THE POOR SAPS WHO OWN A 2005 WITH THE FIRST 6883 ENGINES PRODUCED BY YAMAHA FOR VOLVO.  AFTER 6883 VOLVO MADE CHANGES TO THE DESIGN OF THE COUNTER BALANCE SHAFT, BY DRILLING A WEEP HOLE TO LET MOISTURE OUT.   UNFORTUNATELY, MY ENGINE WAS IN THE 4000S.   I LIVE IN SOUTHERN CALIFORNIA.  ABOUT THE DRIEST CLIMATE YOU CAN GET, BUT YET RUST HAS DESTROYED MY COUNTER BALANCE AND THUS DESTROYED MY ENGINE WITH ONLY 80000 MILES ON IT.BTW, I HAVE HAD MY ENGINE SERVICED REGULARLY. BUT THE COUNTER BALANCE SHAFT IS SOMETHING THAT CAN NOT BE SERVICED WITHOUT TEARING THE ENGINE APART.  IT LIES IN THE VALLEY OF THE V8.   IN MY CASE, AND IN ALL THE OTHER CASES I AM READING ABOUT, THE BEARINGS RUSTED AND THE SHAFT RUSTED AND IT TORE APART MY ENGINE BLOCK.  HAD I BEEN DRIVING ON A FREEWAY WITH MY CHILDREN AND LOST POWER IT COULD HAVE BEEN FATAL.  HOW IS IT THAT THIS DESIGN FLAW WHICH CAUSES CATASTROPHIC ENGINE FAILURE CAN BE ALLOWED NOT TO BE RECALLED? IN FACT, THANKS TO A OVERCHARGED ALTERNATOR, I HAD JUST PUT A NEW $1400 COMPUTER IN THE CAR.  YET, THE COMPUTER NEVER READ CHECK ENGINE.  WHY?  BECAUSE THE COMPUTER IS NOT MONITORING THE LUBRICATION IN A SEALED BEARING.  AND IT IS IMPOSSIBLE WITHOUT TEARING THE ENGINE DOWN FOR 10 HOURS (1200.00 IN LABOR) TO GET TO THE COUNTER BALANCE SHAFT TO SEE THE CONDITION OF IT.    PLEASE, FOR THE SAKE OF OTHERS WHO MIGHT BE UNFORTUNATE ENOUGH TO DRIVE THIS CAR AND FIND THEMSELVES ON A FREEWAY WHEN THE ENGINE BLOWS DUE TO CHEAP RUSTED BEARINGS -- ISSUE A RECALL!!!  *TR",
        "vin": "YV1CZ852951"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/04/2013",
        "dateOfIncident": "06/04/2013",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10514955,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "JUST PURCHASED THIS CAR AND FOUND THAT THERE WERE RECALLS. I WOULD LIKE TO FIND OUT IF MY CAR HAS HAD THEM FIXED. THANK YOU.  *TR",
        "vin": "YV1CZ911751"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/20/2013",
        "dateOfIncident": "05/06/2013",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10512858,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 VOLVO XC90.THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 57 MPH, ALL OF THE DASHBOARD WARNING LIGHTS FAILED. THE VEHICLE WAS TAKEN TO A PRIVATE MECHANIC WHERE IT WAS DIAGNOSED THAT THE CENTRAL CONTROL MODULE NEEDED TO BE REPLACED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE AND CURRENT MILEAGE WAS 106,000.  *TR",
        "vin": "YV1CZ592451"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/29/2013",
        "dateOfIncident": "04/21/2013",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10509963,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 VOLVO XC90 T6 AWD  APRIL 21, 2013 APPROX 8:30 PM    DRIVING AT APPROX 8:30 PM, TRAVELING AT ABOUT 55 MILES PER HOUR, REMOTE 2-LANE HIGHWAY (US191, EASTERN ARIZONA) ON TWISTY MOUNTAINOUS ROAD, SWITCHED FROM HIGH-BEAM TO LOW-BEAMS TO ACCOMMODATE ONCOMING VEHICLE APPROACHING AROUND A BEND. A MOMENT OR TWO AFTER SWITCHING TO LOW BEAMS, THE VOLVO'S HEADLIGHTS LIGHTS FLICKERED AND WENT OUT ALL-TOGETHER. ERROR MESSAGE READING SOMETHING TO THE EFFECT OF \"LOW BEAM BULB FAILURE\" APPEARED ON MESSAGE SCREEN. HIGH-BEAMS DIDN'T APPEAR TO BE OPERABLE EITHER. I ACTIVATED FOG LAMPS AND PROCEEDED CAUTIOUSLY TO DESTINATION (APPROX 25 MILES AWAY). APPROX 15 MILES FROM THAT POINT, I WAS PULLED OVER BY DPS PATROL ADVISING I HAD NO HEADLIGHTS...AND THAT MY LICENSE PLATE LIGHT WAS ALSO NOT OPERATING.    THE NEXT MORNING, INVESTIGATED FURTHER, DISCOVERED THERE WERE NO ISSUES WITH THE HEADLIGHT BULBS (LOW BEAM AND HIGH BEAM) OR WITH LICENSE PLATE BULBS SPECIFICALLY (THEY WERE NOT BURNT OUT), NOR WERE THERE ANY ISSUES WITH ANY BLOWN FUSES RELATED TO THOSE EXTERIOR LIGHTS. I DID DISCOVER THAT THE DRL (DAYTIME RUNNING LIGHTS) WERE STILL OPERATING AS NORMAL (WHICH UTILIZE THE SAME BULB AS THE LOW HEADLIGHTS) CONFIRMING THAT THERE WERE NO ISSUES WITH THOSE BULBS.    ALL RESEARCH SINCE THIS EVENT IS POINTING ME TO CONCLUSION THAT THIS MONUMENTALLY UNSAFE CONDITION WAS CAUSED BY A BAD/FAULTY CEM DESIGN BY VOLVO (ONLINE RESEARCH, SPEAKING WITH VOLVO MECHANICS AND REVIEWING SIMILAR NHTSA COMPLAINTS). THERE IS NO PREVENTATIVE MAINTENANCE THAT I COULD HAVE DONE TO PREVENT THIS FROM HAPPENING. THIS IS NOT AN OWNER MAINTENANCE ISSUE, THIS IS A DESIGN OR MATERIALS ISSUE. VOLVO SHOULD BE REQUIRED TO RECALL & REPAIR TO PREVENT THIS SAFETY ISSUE.    I REQUEST NHTSA OPEN (RE-OPEN?) INVESTIGATION INTO THIS ISSUE, AS THIS VERY DANGEROUS SAFETY ISSUE THAT NEEDS ADDRESSING BEFORE MUCH WORSE CONSEQUENCES RESULT.  *TR",
        "vin": "YV1CZ911051"
    },
    {
        "components": "EXTERIOR LIGHTING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/08/2013",
        "dateOfIncident": "01/03/2013",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10505600,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2005 VOLVO XC90  FOR $16,000. 6 MONTHS LATER THE ENGINE FREEZES UP. THAT COST $10,000.00 TO REPLACE THE ENGINE. LOOKED ON GOOGLE, VERY COMMON FOR THESE V8 ENGINES TO FREEZE UP. NOW THE HEADLIGHTS ARE ACTING UP. LOOKED ON GOOGLE AND FOUND THE HEADLIGHT ISSUE IS VERY COMMON. THIS WILL COST $3,000.00 TO REPAIR. THIS CAR IS GOING TO COST ME ALMOST AS MUCH TO REPAIR IT AS I PAID FOR IT!!  VOLVO IS LOOSING CONTROL.     I WOULD LIKE YOU TO ISSUE A RECALL FOR THESE ENGINE ISSUES AND ISSUE A RECALL FOR THESE HEADLIGHT ISSUES.    PLEASE GOOGLE 2005 VOLVO XC90 V8 ENGINE AND GOOGLE THE SAME YEAR AND MODEL ABOUT THE HEADLIGHT ISSUE. YOU WILL BE ASTOUNDED BY ALL THE PAGES OF COMPLAINTS ABOUT WHAT IS SUPPOSED TO BE A GREAT CAR. THESE CARS WHERE $62,000.00 BRAND NEW, WHAT A JOKE THEY CAN SELL THIS CAR WITH SO MANY PROBLEMS. PLEASE ISSUE A RECALL.    [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "YV1CZ852351"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/13/2013",
        "dateOfIncident": "06/25/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10502696,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "COUNTER BALANCE SHAFT BEARING FAILURE AND COMPLETE DESTRUCTION OF ENGINE WHILE TRAVELING DOWN A CROWDED I-95 GOING INTO NY CITY WITH TWO CHILDREN IN CAR.  THIS IS SUCH A COMMON PROBLEM WITH THE VEHICLE, THAT IT'S CRIMINAL TO NOT HOLD VOLVO ACCOUNTABLE TO FIX THIS.  *TR",
        "vin": "YV1CZ852351"
    },
    {
        "components": "STEERING,ENGINE AND ENGINE COOLING,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/12/2013",
        "dateOfIncident": "02/03/2013",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10502431,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING ON FREE WAY, AS I WAS ACCELERATING I LOST ALL POWER AND STEERING.. THE ENGINE STALLED OUT AND I HAD TO VEER OFF TO SIDE SO THAT I WOULDN'T CAUSE AN ACCIDENT.  *TR",
        "vin": "YV1CZ592551"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/22/2013",
        "dateOfIncident": "02/19/2013",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10499664,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 97000 MILES THE COUNTERBALANCE SHAFT BROKE RESULTING IN ENGINE FAILURE. SERVICE AT VOLVO SAYS I NEED A NEW ENGINE. 7000-10000 FOR A USED ENGINE. CONTACTED MANUFACTURER, WAITING FOR RESPONSE.  *TR",
        "vin": "YV1CZ852551"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/15/2013",
        "dateOfIncident": "02/14/2013",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10498317,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 111,000 THOUSAND MILES THE COUNTER BALANCE SHAFT BEARING WENT INSIDE THE MOTOR. I DID A LITTLE RESEARCH ON LINE AND FOUND OUT THAT IT IS A DESIGN PROBLEM, THAT VOLVO KNOWS ABOUT. IT COULD COST ANY WHERE FROM $5000.00 TO $15000.00. I BELIEVE THAT THEY SHOULD BE FORCED TO DO A RECALL FOR THIS KNOWN PROBLEM, AND HELP THERE CUSTOMERS WITH THE REPAIRS. THANK YOU FOR YOUR HELP IN THIS MATTER.  *TR",
        "vin": "YV1CZ852351"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/19/2013",
        "dateOfIncident": "10/01/2009",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10494343,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRANSMISSION FAILED AT LESS THAN 85,000 MILES. THEN THE SECOND TRANSMISSION'S OUT-PUT SHAFT BEGAN LEAKING WITH LESS THAN 40,000 MILES ON IT, BECAUSE ACCORDING TO THE DEALER IT IS \"OUT-OF-ROUND/TRUE\". THE TRANSMISSION NEEDS TO BE REPLACED. THIS TRANSMISSION FLUID LEAK IS ALSO A FIRE HAZARD.",
        "vin": "YV1CZ911251"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/09/2013",
        "dateOfIncident": "12/20/2012",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10491958,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS COMPLAINT RELATES TO PE10025. I HAVE TO REPLACE CEM AND CASING FOR WIRING COST 5500.00.  VOLVO SHOULD BE RESPONSIBLE FOR PART OR ALL OF THIS REPAIR.  IT IS WATER SEEPAGE INTO THE CEM CASE.  WATER DRIPS DOWN THROUGH HOOD OF THE CAR AND CORRODES THE WIRES.  CAUSES MAJOR ELECTRICAL SHORTS.  I CONSIDER THIS TO BE A MANUFACTURER DEFECT.  WAY TO MANY CARS ARE EXPERIENCING THIS ISSUE AND IT IS EXTREMELY COSTLY.  I WOULD SINCERELY WISH YOU TO CONSIDER MAKING VOLVO RESPONSIBLE.  *TR",
        "vin": "YV1CZ592951"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/03/2013",
        "dateOfIncident": "12/20/2012",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10490848,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON A GENTLE INCLINE THE TRANSMISSION STARTED SLIPPING & SHIFTING BACK & FORTH BETWEEN GEARS. IT LOST POWER WHEN TRYING TO ACCELERATE.  *TR",
        "vin": "YV1CZ911351"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": true,
        "dateComplaintFiled": "01/02/2013",
        "dateOfIncident": "12/27/2012",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10490743,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING IN PITCH BLACK NIGHT ON BACKROADS OF CHARLESTON, SC. LIGHTS WENT OUT AFTER LEFT HEADLIGHT FLICKERED FOR A FEW DAYS. LIGHTS WENT OUT AND CAR WENT OFF ROAD AS WE WERE IN A CURVE. REGAINED CONTROL AFTER SPINNING ON WET GRASS. I NEED THE HEADLIGHTS REPAIRED BY VOLVO AT THEIR EXPENSE AND REIMBURSEMENT FOR THE FAILED ENGINE I HAD TO REPLACE.  *TR",
        "vin": "YV1CZ852351"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/31/2012",
        "dateOfIncident": "10/06/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10490593,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 VOLVO XC90. THE CONTACT STATED THAT THE CHECK ENGINE WARNING LIGHT WAS ILLUMINATED ON THE INSTRUMENT PANEL. THE CONTACT STATED THAT HE TOOK THE VEHICLE TO A MECHANIC FOR INSPECTION WHERE THEY ADVISED THAT THE FUEL PUMP MODULE NEEDED TO BE REPLACED. THE CONTACT NOTIFIED THE DEALER THREE TIMES BUT THEY DID NOT COMPLETE THE REPAIR. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS UNKNOWN.    UPDATED 9/4/13 *CN",
        "vin": "YV1CZ592551"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/18/2012",
        "dateOfIncident": "11/14/2012",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10489205,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "VOLVO KNOWS THE V8 ENGINE ON THE 2005 XC90 IS FAULTY.  SPECIFICALLY, THE COUNTERBALANCE SHAFT BEARING FAILING DUE TO WATER INTRUSION.  FORTUNATELY MINE FAILED WHILE AT IDLE.  UNFORTUNATELY THE ENTIRE ENGINE IS NOW SEIZED UP AND MY OTHERWISE CLEAN CAR IS A LARGE AND USELESS PAPERWEIGHT.  IF THIS WERE TO HAPPEN WHILE THE CAR IS MOVING AT SPEED, IT COULD CAUSE A HORRIBLE ACCIDENT.  UNLESS VOLVO ACTIVELY FINDS THE REMAINING ENGINES IN SERVICE AND FIXES THIS PROBLEM, IT REMAINS A RISK REGARDLESS OF THE MILEAGE.  APPROPRIATELY, THEY SHOULD ALSO REIMBURSE ANYONE WHO WAS AFFECTED BY THIS PROBLEM SINCE THEY LEARNED OF IT BACK IN 2005.  *TR",
        "vin": "YV1CZ852X51"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/07/2012",
        "dateOfIncident": "10/01/2012",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10483622,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LEFT HEADLIGHT WILL SUDDENLY GO OUT, SOMETIMES WHILE DRIVING AND OTHER TIMES THE HEADLIGHT WILL NOT LIGHT WHEN THE VEHICLE IS STARTED.  AT TIMES IT REMAINED OFF FOR ONLY A FEW MINUTES AND OTHER TIMES IT WILL BE FOR DAYS.  I'D TAKEN THE VEHICLE IN FOR SERVICE, BUT EACH TIME I DID, THE LEFT HEADLAMP WAS AGAIN WORKING.  I'D ALSO REPLACED THE HEADLAMP IN QUESTION, BUT STILL THE HEADLAMP WORKED ONLY INTERMITTENTLY.  I JUST RETURNED FROM MY 4TH VISIT TO THE DEALER, AT WHICH TIME THEY REPLACED THE LEFT FRONT LIGHT BALLAST ($440.00).  THE HEADLAMP IS CURRENTLY WORKING.  MY WIFE HAS BEEN RELUCTANT TO DRIVE THE VEHICLE AT NIGHT, FOR FEAR THAT BOTH HEADLAMPS WOULD GO OUT.  IN RESEARCHING ONLINE, I'M FINDING THAT THIS HAS BEEN A RECURRENT PROBLEM WITH 2004 AND 2005 VOLVO XC-90'S.  I UNDERSTAND THAT THE NHTSA HAS BEEN INVESTIGATING THIS PROBLEM WITH THE VOLVO XC-90 AND A RECALL IS BEING CONSIDERED.  WE PURCHASED THE VEHICLE PRIMARILY DUE TO IT'S 5-STAR SAFETY RATING, BUT WE ARE NOT CONVINCED THAT VOLVO HAS ADEQUATELY ADDRESSED A KNOWN PROBLEM.  *TR",
        "vin": "YV1CZ911251"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/16/2012",
        "dateOfIncident": "10/14/2012",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10480745,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "SUNDAY MORNING (10.14.12) CAR MAKING A HORRIBLE NOISE FROM ENGINE BLOCK. SOUNDS LIKE LOOSE BOLTS RATTLING AROUND INSIDE ENGINE BLOCK. CHECKED TRUSTED VOLVO FORUMS ON WEB. I HAVE HAD FOUR VOLVOS BETWEEN MYSELF AND MY WIFE: 2000 S40 (WIFE), 2001 S80 AND NOW 2005 S40 (WIFE) AND MY XC90 - USED THESE FORUMS TO STAY UP ON LATEST ISSUES/MAINTENANCE.  THERE WERE SEVERAL POSTS WITH IDENTICAL ISSUE WITH THIS MODEL, YEAR AND V8 ENGINE. APPARENTLY, ONGOING ISSUE WITH COUNTER BALANCE SHAFT BEARING. DESIGN FLAW ALLOWS RUST TO OCCUR AT BEARING AND THEN THEN CB-SHAFT FAILS. WILL CAUSE INCREDIBLE DAMAGE TO ENGINE - MAYBE EVEN DEATH IF OCCURS AT HIGH SPEEDS. CALLED DEALER THIS MORNING, THEY ARE FAMILIAR WITH ISSUE, WANTED ME TO DRIVE IN OR TOW. COST IS PROHIBITIVE AND BASED ON LEGIONS OF SIMILAR CONSUMER REPORTS, AM ALREADY CERTAIN OF DIAGNOSIS. VOLVO NA EVEN DISTRIBUTED TECHNICAL BULLETIN TO SERVICE DEPTS TO DRILL MOISTURE RELIEF HOLE IN BEARING AREA AS FIX FOR THOSE UNDER WARRANTY!!! THAT'S INSANE!!! LINKS TO POSTS ABOUT ISSUE (ONE OWNER EVEN POSTED VIDEO OF HIS ENGINE NOISE):   HTTP://FORUMS.SWEDESPEED.COM/SHOWTHREAD.PHP?123707-INTERMITTENT-CLATTERING-NOISE-FORM-HEAD-OF-BLOCK-WITH-ROUGH-RUNNING      ALSO     HTTP://S298.PHOTOBUCKET.COM/ALBUMS/MM262/DLRNORDIC/VEHICLE20PICTURES202010/ACTION=VIEW&CURRENT=IMG_0385.MP4     AND      HTTP://WWWODI.NHTSA.DOT.GOV/COMPLAINTS/RESULTS.CFMODI_IDS=10313311&SEARCHTYPE=QUICKSEARCH&SUMMARY=TRUE&REFURL=EMAIL      NEED VOLVO NA TO STEP UP AND HELP, HELP, HELP! HARDWORKING FAMILY MAN WITHOUT ESTIMATED 10-15K TO FIX THIS!!!  ALSO, ISSUE WITH INTERNAL RAIN LEAKS ON 2005 S40 BUT NEVER RAISED FUSS. LOVE OUR VOLVOS BUT IN A REAL SPOT HERE. COME ON VOLVO NA, DO THE RIGHT THING!! WILL ACKNOWLEDGE VOLVO'S COMMITTMENT TO CONSUMER ALL ACROSS WEB!!!  *TR",
        "vin": "YV1CZ852451"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/11/2012",
        "dateOfIncident": "10/07/2012",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10479719,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 VOLVO XC90. THE CONTACT STATED THAT THE INTERIOR OF THE VEHICLE SMELLED OF GASOLINE AND HAD STALLED ON MULTIPLE OCCASIONS. THE VEHICLE WAS TAKEN TO THE DEALER WHO DIAGNOSE THAT THE FUEL PUMP NEEDED TO BE REPLACED. THE DEALER NOTIFIED THE CONTACT THAT THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN ID NUMBER: 09V483000 (FUEL SYSTEM, GASOLINE: DELIVERY: FUEL PUMP). THE FAILURE AND CURRENT MILEAGE WAS 105,000.",
        "vin": "YV1CZ852251"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/25/2012",
        "dateOfIncident": "09/24/2012",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10476961,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR WAS AT TRAFFIC LIGHT, ON GREEN LIGHT, I TRIED TO ACCELERATE , I HEARD A BIG NOISE FROM SOMEWHERE IN ENGINE AREA. AFTER THAT NOISE, A LIGHT COME ON  WITH A MESSAGE \" TRANSMISSION SERVICE URGENT\". THE CAR HAS REAL HARD TIME TO ACCELERATE. EVEN AT 4000 RPM, IT DID NOT ACCELERATE. BROWSE ON INTERNET FOR 3 HOURS AND FINALLY COME TO KNOW THAT THIS PARTICULAR MODEL HAS  TRANSMISSION PROBLEM.  *TR",
        "vin": "YV1CZ911651"
    },
    {
        "components": "EXTERIOR LIGHTING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/21/2012",
        "dateOfIncident": "12/25/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10471742,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 VOLVO XC90. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 35 MPH, THE ENGINE STALLED WITHOUT ANY WARNING. THE VEHICLE FAILED TO RESTART AND WAS TOWED TO AN INDEPENDENT AUTO SHOP FOR DIAGNOSIS. THE TECHNICIAN STATED THE COUNTER BALANCE SHAFT BEARING WAS FROZEN AND THE ENGINE NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. IN ADDITION, THE HEADLIGHTS WOULD INTERMITTENTLY OPERATE AND HAD NOT BEEN REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE PROBLEM. THE APPROXIMATE FAILURE MILEAGE WAS 88,000.   UPDATED 10/3/12 *CN UPDATED 10/09/2012 *JS",
        "vin": "YV1CZ852351"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/18/2012",
        "dateOfIncident": "01/05/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10466349,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I NOTICED A GRINDING NOISE WHILE DRIVING AT NORMAL HIGHWAY SPEED AS IT GOT WORSE OVER THE NEXT DAY OR SO I BROUGHT IT TO MY LOCAL VOLVO SPECIALIST. AFTER SOME RESEARCH I WAS TOLD THAT THE PROBLEM WAS WITH THE BALANCE SHAFT AND WAS SPECIFIC TO THE 2005 XC90 V8. I CONTACTED VOLVO NORTH AMERICA AND RECEIVED NO COMPENSATION OR EVEN SATISFACTORY CUSTOMER SERVICE. MY LOCAL VOLVO TECH RECOMMENDED I BRING THE CAR TO THE VOLVO DEALER, WHO WERE THE ONLY ONE'S AUTHORIZED TO DO THE REPAIR. THE ENGINE HEAD HAD TO BE REMOVED TO REPLACE THE BALANCE SHAFT AND THE BEARINGS NEEDED TO BE REASSEMBLED. IT'S AMAZING THAT THE SAME EXACT PROBLEM CAN BE REPORTED TO THIS EXTENT AND VOLVO STILL DOES NOTHING!! $4200 DOLLARS LATER, THE CAR WAS FIXED. I'M GLAD IT WAS CAUGHT PRIOR TO THE ENGINE NEEDED TO BE REPLACED..  *TR",
        "vin": "YV1CZ852451"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/17/2012",
        "dateOfIncident": "07/11/2012",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10466325,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRANSMISSION IN THIS VEHICLE IS SLIPPING. TRYING TO PASS A CAR ON THE HIGHWAY AND COULD NOT GET THE CAR INTO GEAR.     NOTE: THE VIN # [XXX] - BUT I CAN'T VALIDATE IT ON THIS FORM BUT IT IS THE CORRECT NUMBER.     INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "YC1CZ911151"
    },
    {
        "components": "SUSPENSION,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/11/2012",
        "dateOfIncident": "05/08/2012",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10458080,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I ATTEMPTED TO PASS ANOTHER CAR AND THE ENGINE REVVED VERY HIGH WHILE THE TRANSMISSION WAS SLIPPING AND COULD NOT GO INTO GEAR.  THIS PUT MY CHILDREN AND I IN A VERY DANGEROUS SITUATION WITH ONCOMING TRAFFIC. ALTHOUGH I WAS ABLE TO SWERVE BACK INTO MY OWN LANE IN TIME, IT WAS A VERY SCARY 10 OR 15 SECONDS.  I HAVE BEEN AFRAID TO DRIVE IT UNTIL I CAN GET IT INTO THE REPAIR SHOP, BUT HAVE DRIVEN IT ON SHORT TRIPS AROUND TOWN.  THE TRANSMISSION CONTINUES TO SLIP SOME IN NORMAL DRIVING.  I'M TAKING IT TO VOLVO SERVICE TOMORROW BUT SOME QUICK RESEARCH FOUND THAT THIS IS A VERY COMMON ISSUE WITH THIS SUV, AND THAT VOLVO IS COMPLETELY AWARE OF IT.  IN FACT, THE CUSTOMER SERVICE PERSON I SPOKE WITH FROM VOLVO N.AM SAID \"IT'S AN EPIDEMIC\", AND THE SERVICE WRITER FOR NORTHPOINT VOLVO HAS SEEN IT MANY, MANY TIMES.  IT LOOKS LIKE I'M IN FOR AS MUCH AS $8500 FOR A TRANSMISSION, AND EVEN MORE FOR POSSIBLE DAMAGE TO THE AXLES AS WELL AS A NEW RADIATOR, WHICH SEEMS TO BE THE CAUSE OF THE WHOLE PROBLEM DUE TO FLUID CONTAMINATION (GLYCOL INTO THE TRANSMISSION FLUID).  I WASN'T AWARE OF THE PROBLEM UNTIL NOW, BUT I HAD CERTAINLY WONDERED WHY MY $48,000 VEHICLE HAD PLUMMETED IN VALUE COMPARED TO OTHER CARS!  THIS IS NOT ONLY A SERIOUS SAFETY HAZARD BUT ALSO A FINANCIAL HARDSHIP ON THE MANY PEOPLE WHO PURCHASED THIS SUV BASED ON AN EXPECTATION OF QUALITY AT LEAST IN LINE WITH MINIMUM INDUSTRY STANDARDS. CLEARLY THIS COMPANY IS NOT STANDING BEHIND THEIR PRODUCT AND A RECALL IS IN ORDER.  *TR",
        "vin": "YV1CZ911451"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/12/2012",
        "dateOfIncident": "03/01/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10455001,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I FILL MY TANK UP ALL THE WAY MY GASOLINE ONLY LASTS ABOUT 150 MILES. THE GAS HAS GOT TO BE LEAKING SOMEWHERE!!!  I HAVE TO FILL MY TANK UP SEVERAL TIMES A WEEK.  *TR",
        "vin": "YV1CY592351"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/02/2012",
        "dateOfIncident": "03/16/2012",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10453807,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VOLVO 2005 XC 90 V8 ENGINE FAILED. COULD NOT DRIVE IT SO I HAD IT TOWED TO THE VOLVO DEALERSHIP. I WAS TOLD, AFTER 2 DAYS OF DIAGNOSIS, THAT THE ENGINE HAD TO BE REPLACED. I WAS TOLD THAT VOLVO COULD NOT HELP WITH COST OF NEW ENGINE SINCE I WAS OUT OF WARRANTY, DATE -WISE BUT NOT MILEAGE- WISE. I HAVE SINCE DISCOVERED THAT A LARGE NUMBER OF LIKE ENGINES HAVE SUFFERED THE SAME CATASTROPHIC ENGINE FAILURE DUE TO A DESIGN DEFECT CONCERNING A BEARING/SHAFT. TO DATE, VOLVO HAS DONE NOTHING TO HELP ME. AT A HIGHER SPEED, THIS ENGINE FAILURE COULD HAVE BEEN FATAL.  *TR",
        "vin": "YV1CZ852451"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/27/2012",
        "dateOfIncident": "03/15/2012",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10453277,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION SERVICE URGENT LIGHT CAME OUT.  TRANSMISSION WAS STUCK IN 3RD GEAR.  HAD HARD UP SHIFTS.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/12/2012",
        "dateOfIncident": "03/12/2012",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10451247,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS COMPLAINT REFERS TO NHTSA ACTION NUMBER PE10025.  SERVICE BULLETIN NUMBER TNN 37-35.  IT IS OUTRAGEOUS AND UNACCEPTABLE FOR YOU TO NOT HAVE ISSUED A RECALL ON THIS MATTER. VOLVO SHOULD BE EXPECTED TO REPLACE MY WIRING GROMMET AND/OR PLENUM COVER AT NO CHARGE.  IT IS APPLAUDING THAT VOLVO WOULD NOT TAKE THIS SERIOUS AND ISSUE A RECALL AS IT IS CLEARLY A DEFECT AND A SAFETY HAZARD.  MY CHILDREN AND I WERE ON THE INTERSTATE WHEN THIS HAPPENED TO US AND IT WAS VERY DANGEROUS.  IT IS CLEARLY A PROBLEM AND SAFETY ISSUE THAT VOLVO RECOGNIZES OR THEY WOULD HAVE NOT CHANGED THE DESIGN AND ISSUED A BULLETIN.  I DO NOT UNDERSTAND HOW A COMPANY CAN SELL ME A PRODUCT THAT MALFUNCTIONS AND THEN EXPECT ME TO PAY THEM TO REPAIR IT.  *TR",
        "vin": "YV1CY592051"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/11/2012",
        "dateOfIncident": "01/17/2012",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10447496,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRAINS HAS GONE AND IT ONLY HAS 66,000 MILES ON IT COST TO FIX $ 5500.00.  *TR",
        "vin": "YV1CZ852651"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/06/2012",
        "dateOfIncident": "01/03/2012",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10446874,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 VOLVO XC90. WHILE DRIVING APPROXIMATELY 70 MPH THE FRONT PASSENGER'S SIDE DOOR ABNORMALLY OPENED. THE CONTACT MANEUVERED TO THE SIDE OF THE ROAD WITH CAUTION AND CLOSED THE DOOR SECURELY HOWEVER, THE FAILURE RECURRED ONCE THE VEHICLE WAS IN MOTION. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHERE THE DOOR CABLE WAS REPLACED. THE MANUFACTURER WAS NOTIFIED OF THE DEFECT AND THEY WERE UNABLE TO PROVIDE ASSISTANCE. THE APPROXIMATE FAILURE MILEAGE WAS 98,000.  THE CONSUMER STATED THE DEALER FOUND A BROKEN CABLE. THE CABLE WAS REPLACED AT A COST OF $ 135.93. UPDATED 03/01/12",
        "vin": "YV1CZ592351"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/04/2012",
        "dateOfIncident": "02/06/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10446668,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR CAR WOULDN'T START IN OUR GARAGE ONE MORNING.  TURNS OUT, WE NEEDED A NEW CEM DUE TO A LEAKING PROTECTION BOX (I CAN'T REMEMBER THE NAME OF IT BUT IT STARTED WITH A P).  AFTER 843 IN PARTS AND 816 IN LABOR AND ALMOST A MONTH AT THE DEALER DUE TO A BACKORDERED WIRING HARNESS THE PROBLEM WAS FIXED.  AFTER DOING SOME RESEARCH WE HAVE DISCOVERED THAT THIS IS AN EPIDEMIC AMONG VOLVO OWNERS AND WE ARE ACTUALLY ONE OF THE LUCKY ONES WHOSE CAR DIED WHILE IT WAS PARKED INSTEAD OF WHILE WE WERE DRIVING!  THIS IS RIDICULOUSLY DANGEROUS AND THE FACT THAT THIS LEAKING BOX IS A COMMON PROBLEM AND THAT VOLVO HAS ACTUALLY DEVELOPED A REDESIGNED MODEL TO FIX THE ISSUE WITH THEIR FIRST GEN MODEL LEADS ME TO BELIEVE THAT THEY SHOULD BE FORCED TO REPLACE THEIR FAULTY DESIGN IN ALL OF THEIR XC90S.  AS SOMEONE WHO BOUGHT HER VOLVO FOR ITS REPUTATION FOR SAFETY, I AM DISGUSTED THAT THIS PROBLEM HAS BEEN ALLOWED TO GO ON FOR SO LONG.   *KB",
        "vin": "YV1CM592551"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/28/2012",
        "dateOfIncident": "01/23/2012",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10445712,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 VOLVO XC90 V8 ENGINE NUMBER 5569.  BALANCE SHAFT FAILURE.  OR COUNTER BALANCE SHAFT FAILURE.  DUE TO ENGINE DEFECT.  BALANCE SHAFT BEARINGS IN CLOSED, NON-LUBRICATED AREA.  BEARINGS REST IN AN AREA THAT RETAINS MOISTURE AND THE BEARINGS EVENTUALLY DETERIORATE AND FAIL.  WHEN THIS HAPPENS THERE IS CATASTROPHIC ENGINE FAILURE.  THERE ARE APPROXIMATELY 7000 VEHICLES WITH THIS DEFECT.  THE DEFECT WAS REALIZED AFTER ENGINE 6883.   WE ARE VERY LUCKY THAT THE FAILURE DID NOT OCCUR THE PREVIOUS DAY ON OUR 200 MILE INTERSTATE TRIP.  ENGINE DESTRUCTION AT 75 MPH COULD HAVE PROVED FATAL.  LOUD POPPING AND RATTLING FROM THE ENGINE WAS THE ONLY WARNING...NO CHECK ENGINE LIGHT.  VOLVO IS AWARE OF THIS DEFECT AND HAS SENT SERVICE MEMOS TO DRILL HOLES TO ALLOW WATER IN THIS AREA TO DRAIN AND PREVENT RUSTING OF BEARINGS.  THERE ARE MANY DOCUMENTED CASES ON THIS SITE AND OTHER TRAFFIC SAFETY SITES.    A RECALL NEEDS TO BE ISSUED!  *TR",
        "vin": "YV1CZ852751"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/18/2012",
        "dateOfIncident": "01/13/2012",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10444391,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE LEAVING HOUSE TO GO AND PICK-UP SON FROM SCHOOL .DOWN THE STREET VEHICLE STARTED MAKING A GRINDING NOISE. I PULLED OVER AND HAD VEHICLE TOWED TO THE VOLVO DEALER TO BE REPAIRED. THINKING IT WOULD BE COVERED BY EXTENDED WARRANTY I WAS TOLD NO. THE PROBLEM WAS WITH THE COUNTERBALANCE SHAFT BEARING. EVEN THOUGH IT WAS A MANUFACTURES FLAW WITH THE DESIGN OF THEIR ENGINE REPAIRS RAN CLOSE TO $3500.00 . I WAS PLANNING TO PURCHASE ANOTHER VOLVO VEHICLE BUT MAYBE NOT . I THINK I'LL GO AMERICAN.   *TR",
        "vin": "YV1CZ852751"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/18/2012",
        "dateOfIncident": "01/17/2012",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10444427,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I DROVE IN SEVERE DOWN POUR YESTERDAY AND EXPERIENCED AN YELLOW ERROR MESSAGE FOLLOWED BY AN ELECTRICAL SHORT AND ANTI SKID MESSAGE.  I REDUCED MY SPEED TO 50 MPH ON THE INTERSTATE AND PROCEEDED HOME.  AFTER STOPPING THE LIGHTS WOULD NOT TURN OFF AND I IMMEDIATELY TOOK IT IN FOR SERVICE WHERE THE TECHNICIAN ADVISED ME THAT THIS WAS A PROBLEM WITH WATER GETTING INTO THE ENGINE COMPARTMENT WIRING HARNESS AND CAUSING THE CENTRAL ELECTRONIC MODULE TO SHORT CIRUIT AND RUST.  THIS REPAIR ALONE COSTS OVER $5000 DUE THEIR DEFECTIVE DESIGN AND IMPROPER SEALING OF IMPORTANT ELECTRICAL COMPONENTS.  I AVOIDED ANY POSSIBLE ACCIDENTS BY DRIVING SLOWLY BUT DO NOT FEEL SAFE WERE I TO TRAVEL IN INCLEMENT WEATHER IN THE FUTURE. I DO BELIEVE THAT THE ELECTRICAL SYSTEM WOULD SHORT CIRCUIT LEAVING ME WITHOUT ESSENTIAL POWER AND POSSIBLY HURT OR STRANDED.      I CAN SEE FROM YOUR DATABASE THAT AN INVESTIGATION WAS COMPLETED ON 11/22/2010  UNDER ID PE10025 CITING NO REAL SAFETY ISSUES. I DISAGREE AND WOULD ENCOURAGE YOU TO REVISIT THIS ISSUE IMMEDIATELY.  VOLVO HAS CONCEDED TO REPLACE THE CEM ($753.52)  UNIT BUT NOT THE ENGINE COMPARTMENT ($3034.71) THAT HOUSES IT, THEREFORE OWNERS LIKE MYSELF WILL CONTINUE TO EXPERIENCE THE SAME PROBLEM AND REAL DANGER FROM IT.",
        "vin": "YV1CY592X51"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/11/2012",
        "dateOfIncident": "01/11/2012",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10443420,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "STRONG FUEL ODOR WITHIN CABIN AFTER FUEL FILLUP, THERE IS A RECALL ON FUEL PUMPS DUE TO FIRE RISK ON THIS EXACT MODEL, JUST NOT ON MY VEHICLE.  SHOULD I WAIT FOR A FIRE BEFORE A RECALL IS ISSUED?  *TR",
        "vin": "YV1CZ592251"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/06/2012",
        "dateOfIncident": "01/06/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10442647,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 VOLVO XC90. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 45 MPH, THE VEHICLE SUDDENLY STALLED WITHOUT ANY WARNING. THE CONTACT WAS ABLE TO RESTART THE VEHICLE AFTER WAITING A FEW MOMENTS. THE VEHICLE HAD NOT BEEN INSPECTED BY A DEALER AND WAS NOT REPAIRED. THE DEALER WAS LATER NOTIFIED, BUT THE CONTACT HAD YET TO RECEIVE A RESPONSE. THE FAILURE MILEAGE WAS APPROXIMATELY 75,000.  UPDATED 02/15/12*BF  UPDATED 02/27/12",
        "vin": "YV1CZ911651"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/05/2012",
        "dateOfIncident": "01/05/2012",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10442570,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "SLUDGE BUILD UP IN THE ENGINE EVEN AFTER SCHEDULED OIL CHANGES.  WAS TOLD THE ENGINE/TURBO WOULD HAVE TO BE PLACED AFTER 100,000 MILES. *TR",
        "vin": "YV1CY592X51"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/27/2011",
        "dateOfIncident": "10/01/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10441365,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 VOLVO XC90. THE CONTACT STATED THAT THE VEHICLE STALLED WHILE DRIVING AT VARIOUS SPEEDS. THE FIRST OCCURRENCE OCCURRED WHILE DRIVING APPROXIMATELY 55 MPH. THE CONTACT WAS ABLE TO SUCCESSFULLY RESTART THE VEHICLE AFTER THE FAILURES OCCURRED. THE VEHICLE WAS NOT TAKEN TO HAVE THE FAILURE DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 110,000.",
        "vin": "YV1CY592751"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/13/2011",
        "dateOfIncident": "12/08/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10439784,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "COUNTER BALANCE SHAFT FAILURE LEADING TO COMPLETE ENGINE FAILURE. DEFECTIVE DESIGN.  *TR",
        "vin": "YV1CZ852051"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/06/2011",
        "dateOfIncident": "12/21/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10438789,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 VOLVO XC90. WHILE STOPPED AT A TRAFFIC STOP, THE VEHICLE BEGAN TO SHAKE BACK AND FORTH UNCONTROLLABLY. THE CONTACT APPLIED PRESSURE TO THE BRAKE PEDAL IN ORDER FOR THE VEHICLE TO STOP SHAKING. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSTIC TESTING WHERE THE TECHNICIAN ADVISED THAT THE FOUR WHEEL DRIVE MOTOR WAS NOT ENGAGING AND WOULD HAVE TO BE REPLACED. THE FOUR WHEEL DRIVE WARNING LIGHT WAS NOT INDICATING THAT THERE WAS A FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 39,000.",
        "vin": "YV1CM592951"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/05/2011",
        "dateOfIncident": "11/01/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10438548,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BALANCER BEARING AND SHAFT ON THE 2005 VOLVO XC90 SUV IS DEFECTIVE IN THE FIRST 6000 VEHICLES MANUFACTURED FOR THAT MODEL YEAR. THE BALANCER SHAFT BEARING CAN GO BAD AT ANY TIME WITHOUT WARNING, CAUSING CATASTROPHIC ENGINE DAMAGE.  IF THIS HAPPENS ON A HIGHWAY WHILE TRAVELING AT A HIGH RATE OF SPEED, THE RESULTS COULD BE DEADLY. VOLVO NORTH AMERICA IS AWARE OF THIS AND DOES NOTHING TO ADDRESS THIS SERIOUS, POTENTIALLY DEADLY SITUATION. WE HAVE BEEN WORKING TO GET VOLVO OF NORTH AMERICA TO RECOGNIZE THIS ISSUE AND THEY HAVE DOING NOTHING TO DATE EXCEPT POINT TO MAINTENANCE, WHICH HAS NO IMPACT ON THE PROBLEM.  THERE IS NO MAINTENANCE PROCEDURE TO INSURE THIS DOES NOT HAPPEN AND VOLVO WILL NOT PAY FOR DAMAGES. THE REMEDY IN MOST CASES IS AN ENGINE REPLACEMENT WHICH COSTS ABOUT $15,000 , AND  AS MENTIONED, VOLVO WILL NOT PAY FOR IT.  VOLVO MUST BE FORCED TO RECALL THESE VEHICLES AND FIX THE PROBLEM AND COMPENSATE OWNERS WHO HAVE BEEN IMPACTED.     THESE VEHICLES MUST BE RECALLED AND THE PROBLEM MUST BE FIXED BEFORE COUNTLESS LIVES ARE PUT AT RISK BY THIS TICKING TIME BOMB THAT WILL GO OFF.  AT 70 MILES AN HOUR , A FAILED ENGINE COULD LEAD TO DEATH.  THERE ARE 6000 VOLVO XC90'S WITH THIS PROBLEM.  *TR  THE DEALER DIAGNOSED THE PROBLEM AS A COMPLETE ENGINE FAILURE DUE TO THE BALANCER BECOMING DAMAGED AND CAUSING CATASTROPHIC ENGINE FAILURE. THE CONSUMER WAS INFORMED IT WOULD COST $ 14,700 TO REPLACE THE ENGINE. UPDATED IVOQ 03/09/12",
        "vin": "YV1CZ852X51"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/03/2011",
        "dateOfIncident": "08/21/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10434122,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 VOLVO XC90. WHILE DRIVING APPROXIMATELY 25 MPH, THE CONTACT HEARD A LOUD NOISE EMITTING FROM THE FRONT END OF THE VEHICLE. IMMEDIATELY THERE WAS A SLIGHT LOSS OF ENGINE POWER DURING ACCELERATION. THE MALFUNCTION PROGRESSED AND THE VEHICLE WAS TOWED TO AN AUTHORIZED DEALER WHO STATED THE ENGINE WOULD NEED TO BE REPLACED AS A RESULT TO THE ENGINE BALANCE SHAFT FRACTURING. THE VEHICLE HAD NOT BEEN REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE PROBLEM. THE APPROXIMATE FAILURE MILEAGE WAS 60,000.",
        "vin": "YV1CZ852X51"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/16/2011",
        "dateOfIncident": "09/04/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10425724,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "HEARD LOUD TICKING NOISE COMING FROM ENGINE AT 86330K MILES. VEHICLE RIDE BECAME SOMEWHAT ROUGH. DIAGNOSED AT VOLVO DEALERSHIP AS BALANCE SHAFT BEARING \"PART FAILURE\".  EST. TO FIX: ~$3800. VOLVO AGREED TO COMPENSATE FOR THE PARTS, APPROX $1500.  BALANCE OF $2325.50 PAID BY VEHICLE OWNER. TOOK 1 WEEK FOR VOLVO TO OBTAIN PARTS AS THEY ARE NOT COMMONLY STOCKED OR WERE BACK ORDERED. ON LINE RESEARCH REVEALED THIS TO HAVE BEEN A PROBLEM WITH EARLY 2005 XC90 V8'S. WATER/CONDENSATION/VAPOR IS ABLE TO GET IN AND RUST THE BEARING LEADING TO ENGINE FAILURE. A TSB WAS ISSUED (? WHEN) FOR A FIX TO DRILL A \"WEEPING HOLE\" IN ENGINE BLOCK TO DRAIN WATER FROM THE BEARING.   *TT",
        "vin": "YV1CZ852851"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/02/2011",
        "dateOfIncident": "08/30/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10423007,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "A COMPLAINT WAS PREVIOUS FILED REGARDING TO TURN SIGNAL PROBLEM. SITUATION GETTING WORSE.  VOLVO XC90 V8 2005;  REPLACED CEM UNIT TWO YEARS BACK. RECENTLY FOLLOWING PROBLEMS HAPPENED.  1. TURN SIGNAL STOP WORKING  2. NO HIGH BEAM   3. NO WINDSHIELD WASHING  4. NO CRUISE CONTROL  5. NO VEHICLE INFORMATION FUNCTION    PROBLEMS LOOK LIKE ASSOCIATED WITH FAULTY CEM AGAIN. VEHICLE IS VERY RISKY TO DRIVE WITH UNRELIABLE OR NOT-FUNCTIONING TURN SIGNAL.  *TR",
        "vin": "YV1CZ852451"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/26/2011",
        "dateOfIncident": "08/03/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10421666,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "VOLVO XC90 2005, TURNING SIGNAL ACTS DANGEROUSLY. SOMETIMES IT WORKS BUT MOST TIME NO ACTION HAPPENS. COMPLETELY DEAD AND RESTARTING CAR SOMETIMES FIX THE PROBLEM. MULTIPLE CASES OF DANGEROUS INCIDENTS DUE TO NO SIGNAL.  *TT",
        "vin": "YV1CZ852451"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/21/2011",
        "dateOfIncident": "08/20/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10420879,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "VOLVO XC90 2005  LOW BEAM BULB FAILURE ERROR AND ONE BEAM TURNS OFF.  THEN COMES BACK ON, AND SOMETIMES ALL LIGHTS GO OFF.  VERY DANGEROUS AT NIGHT.  IF YOU TURN THE HEADLIGHT DIAL TO ANOTHER SETTING THEY WILL COME BACK ON, BUT THEN BLINK OFF AGAIN, AND SOMETIMES OFF COMPLETELY.  THE BIGGEST ISSUE IS THE INTERMITTENT OCCURRENCE OF THIS.  THE CAR IS NOT SAFE TO DRIVE.  *TR",
        "vin": "YV1CZ852351"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/18/2011",
        "dateOfIncident": "07/17/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10419955,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED USED 2005 VOLVO XC90 IN SPRING OF 2010. DURING THE NEXT YEAR EXPERIENCED VERY INTERMITTENT ELECTRICAL ISSUES.  EXAMPLES ARE LOCKS NOT WORKING, BLINKER, RADIO.  THESE ISSUES LITERALLY ONLY HAPPENED A COUPLE TIMES. IN APRIL 2011 HAD BIYEARLY SAFETY AND EMISSIONS DONE AT LOCAL DEALERSHIP (NON VOLVO) AND IT DID NOT PASS EMISSIONS. NEXT DAY TOOK MY VOLVO XC90 TO WEISS VOLVO AND IT PASSED EMISSIONS (WITHOUT ME KNOWING THEY CLEARED ERRORS ON THE CAR TO GET IT TO PASS. THIS MUST BE THE REASON IN EUROPE THAT DEALERSHIPS CAN'T INSPECT THEIR OWN MAKE OF CARS)  ON JULY 17 2011  I WAS DRIVING DOWN THE HIGHWAY WITH MY 1 YEAR OLD IN THE BACK SEAT.  RADIO WENT OUT.  A FEW MINUTES LATER ALMOST EVERYTHING IN THE CAR SHUT DOWN EXCEPT FOR THE ENGINE.  LOST A/C (IT WAS 110 THAT DAY), LOST POWER STEERING, BRAKING WAS INTERMITTENT, NO BLINKERS, NO HEADLIGHTS, NO LIGHTS IN INTERIOR, WHILE I WAS AT FULL SPEED ON THE HIGHWAY.  I AM NOT SURE IF ENGINE WAS INTERMITTENT OR NOT BECAUSE I GOT OFF AS SOON AS I COULD. I WAS VERY CLOSE TO WEISS VOLVO SO DROPPED IT OFF THERE AGAIN ON THE DATE OF THE TOTAL FAILURE. CALLED VOLVO CUSTOMER CARE ON JULY 18 2011 TO FILE COMPLAINT. WEISS VOLVO CALLED BACK AND TOLD US CAR WOULDN'T START. CALLED BACK LATER IN THE DAY AND SAID THEY SAW THAT EVERYTHING WENT OUT AND CAR WAS FULL OF CODES. WEISS SENT IN AN ESTIMATE FOR $1500 TO REPLACE ECM. I ASKED WEISS TO PERFORM AN EMISSIONS TEST (BY MO LAW MANUFACTURER'S CARS MUST PASS EMISSIONS TEST UP TO 80K MILES AND MY CAR HAD 61K) I RESEARCHED ECM AND FOUND VERY SIMILAR STORIES TO MINE AND BROUGHT THIS UP TO VOLVO NA. VOLVO NA TOLD WEISS VOLVO TO \"RESET\" MY CAR (AGAIN WITHOUT MY PERMISSION).  THE CAR THEN WAS FUNCTIONAL AFTER RESET. WEISS THEN \"TESTED\" MY CAR FOR ALMOST 3 WEEKS TO FIGURE OUT THE DESIGN FLAW FOR A TOTAL OF 451 MILES.  THE MECHANIC TOLD ME IT WAS THE ECM BUT VOLVO NA SAID IT WAS VARIOUS OTHER REASONS AND WOULDN'T REPLACE IT. CAR STILL BROKE.  REACHED LIMIT.  *KB",
        "vin": "YV1CZ911251"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/12/2011",
        "dateOfIncident": "08/12/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10419178,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 VOLVO XC90. WHILE DRIVING APPROXIMATELY 65 MPH, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS TOWED TO THE DEALER WHERE THE TECHNICIANS STATED THAT THE TRANSMISSION HAD TO BE REPLACED. AFTER THE REPLACEMENT, THE FAILURE RECURRED  APPROXIMATELY 40,000 MILES AFTER THE TRANSMISSION WAS REPLACED. THE VEHICLE WAS NOT FURTHER REPAIRED. THE VIN WAS NOT AVAILABLE. THE APPROXIMATE FAILURE MILEAGE WAS 60,000.",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/09/2011",
        "dateOfIncident": "07/01/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10418848,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I'D LIKE TO ADD MY COMPLAINT TO THE LIST OF THOSE ALREADY REPORTING THE ABRUPT LOSS OF ALL ELECTRONICS, INCLUDING WINDSHIELD WIPERS AND ALL DASHBOARD GAUGES, DURING A RAINSTORM.  MY ISSUE WAS ALSO IDENTIFIED AS A PREMATURELY CORRODED CENTRAL ELECTRONIC MODULE (CEM) CAUSED BY A DESIGN FLAW ALLOWING WATER TO ACCESS THE CEM CONNECTOR.  I'M SHOCKED TO FIND OUT VOLVO KNEW ABOUT THIS IN 2005, WELL WITHIN THE WARRANTY PERIOD FOR MOST OF THESE AFFECTED VEHICLES, AND DID NOTHING TO CORRECT OR EVEN ALERT THEIR OWNERS.  I URGE THE NHTSA TO REVISIT THEIR INVESTIGATION, AND FORCE A RECALL IF VOLVO CONTINUES TO REFUSE.  I CAN ASSURE YOU AS A DRIVER DURING THIS EVENT, THIS IS INDEED A SAFETY ISSUE, AND I HOPE WE AREN'T WAITING FOR ENOUGH INJURIES OR DEATHS BEFORE YOU GET TO THAT OBVIOUS CONCLUSION.",
        "vin": "YV1CZ852X51"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/05/2011",
        "dateOfIncident": "07/25/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10417710,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES LIGHTS ALWAYS ON. TOOK CAR TO DEALER AND THEY ADVISED THAT WATER HAD LEAKED INTO CEM MODULE AND MAIN WIREHARNESS AND REQUIRED REPLACEMNET AT A COST OF $7000.  KNOWN ISSUE TO VOLVO WITH SERVICE BULLETIN SENT TO DEALERS.  FOUND INDEPENDENT VOLVO REPAIR SHOP WILLING TO REPLACE MODULE ONLY (SOFTWARE DOWNLOAD FROM DEALER) AND CLEAN BUILD-UP ON HARNESS CONNECTORS.  REQUIRING REMOVAL OF PART OF DASH, DRIVER SEAT.  TOOK 4 DAYS AT REPAIR SHOP.  REPAIR COMPLETED FOR UNDER $2000.  *TT",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/28/2011",
        "dateOfIncident": "07/08/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10415470,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "1.JULY 8, 2011. 2005 VOLVO XC90 BALANCE SHAFT BROKE OFF WITHIN CAR ENGINE.    HEARD A LOUD SOUND COMING FROM CAR ENGINE, AND LOST A GREAT DEAL OF POWER WHILE DRIVING ON HIGHWAY.    2.FURTHER DAMAGE TO THE VEHICLE ENGINE COULD HAVE BEEN DONE DUE TO ACCELERATING TO GET OF THE HIGHWAY IN ORDER TO AVOID A COLLISION FROM VEHICLES COMING FROM BEHIND. THIS WAS A SCARY LIFE AND DANGEROUS EXPERIENCE.  3.VOLVO HAVING EXPLAINED WHAT CREATED THE PROBLEM TO DATE.  THE ENGINE WILL HAVE TO BE PULLED OUT AND ALMOST RE-BUILT AT A COST TO ALMOST $8500.00  EXTENDED WARRANTY I PAID $4,100 FOR IS NOT COVERING FULL COST. I AM RESPONSIBLE FOR OVER $2000 + COST OF CAR RENTALS TO DATE. JULY 28, 2011, CAR IS STILL WITH VOLVO.  *TR",
        "vin": "YV1CZ852X51"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/24/2011",
        "dateOfIncident": "05/03/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10414917,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "1. HEARD MARBLE NOISES UNDERHOOD AFTER 56,000 MILES OF NORMAL DRIVING. WELL MAINTAINED.     2. BALANCE SHAFT BEARING BROKE APART AND PUT OUT METAL SHARDS BETWEEN CYLINDER HEADS. LOUD METALLIC NOISE FROM ENGINE.  VEHICLE WAS SHUT DOWN IMMEDIATELY AFTER PULLING OVER TO AVOID ENGINE DESTRUCTION AND TRAFFIC ACCIDENT DUE TO HALTED VEHICLE.  HAD TO BE TOWED.      3. BALANCE SHAFT BEARING IS BEING REPLACED.  OLD PART (IN PIECES) AVAILABLE FOR ANALYSIS.  *TR",
        "vin": "YV1CZ852851"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "07/11/2011",
        "dateOfIncident": "07/09/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10411735,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING AT HIGHWAY SPED IN 2005 VOLVO XC 90 WHEN SUNROOF GLASS EXPLODED.  GLASS REPAIR FACILITY SAID THERE WAS LIKELY A FLAW IN THE GLASS.  VOLVO SAYS NOT LIKELY.  IF I HAD HAD THE SHADE OPEN ALL THAT GLASS WOULD HAVE FALLEN ONTO ME/PASSENGERS AND INTO EYES.  SHATTERED INTO A THOUSAND LITTLE PIECES.  COULD HAVE CAUSED A ACCIDENT AND/OR PERSONAL INJURY.  *TT",
        "vin": "YV1CZ592551"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/24/2011",
        "dateOfIncident": "06/13/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10408783,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION PROBLEM ON 2005 XC90 T6.  SLIPPING AND SHIFTING PROBLEMS.  FOUND METAL CHUNKS IN TRANSMISSION OIL PAN.  REPORTED TO VOLVO NA FOR \"GOODWILL\" REPAIR OR REPLACEMENT.  DENIED BECAUSE VEHICLE HAS OVER 100K MILES. VEHICLE IS ONLY USED ON WEEKENDS AN LONG TRIPS.  NOT BEING DRIVEN HARD.  VOLVO NOT LIVING UP TO EXPECTATIONS OR REPUTATION.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/21/2011",
        "dateOfIncident": "05/20/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10407737,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION COMPLETE FAILURE AT 92,000 MILES. APPEARS TO BE A MATERIAL MANUFACTURING DEFECT.  VOLVO TECH SPEC DESCRIBES DEFECTIVE PART, YET VOLVO DEALERSHIP REQUIRING COMPLETE REPLACEMENT OF TRANSMISSION.  *TR",
        "vin": "YV1CZ852451"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/09/2011",
        "dateOfIncident": "08/01/2009",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10405718,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "1.  NORMAL CITY/HIGHWAY DRIVING.  2. TURN SIGNALS SPORADICALLY DO NOT FUNCTION.  AMBIENT TEMPERATURE DOES NOT MATTER, WHETHER IN WINTER OR SUMMER.  3.  NOTHING WAS DONE TO CORRECT. *TR",
        "vin": "YV1CM592X51"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/09/2011",
        "dateOfIncident": "06/01/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10405733,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING RAIN THE WINDSHIELD WIPERS STOP WORKING, HEADLIGHTS GO OUT AND CAR LOSES POWER. I HAVE COME DANGEROUSLY CLOSE TO HIGH SPEED ACCIDENTS DUE TO THE LOSS OF POWER. ALSO CAR HAS A SEVERE JERK IN THE TRANSMISSION WHEN ACCELERATING AFTER A TURN. SO STRONG I THOUGHT I WAS HIT FROM BEHIND. THERE IS A PROBLEM NHTSA INVESTIGATED WITH WATER GETTING INTO THE CEM.  VOLVO ACKNOWLEDGED MANUFACTURER DEFECT THAT RESULTS IN WATER GETTING IN CEM BUT WILL NOT REPLACE THE DEFECTIVE COVER.     THERE IS NO WAY OF KNOWING WHEN THIS MIGHT HAPPENS-APPEARS TO DEPEND ON HOW HEAVY THE RAIN, IF ROADWAY HAS A LOT OF WATER. THIS NEEDS TO BE RECALLED FOR SAFETY REASONS-VOLVO CONTINUES TO PUT CONSUMERS AT RISK.  *TR",
        "vin": "YV1CZ852751"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/03/2011",
        "dateOfIncident": "06/03/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10404373,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2005 VOLVO XC90 V8 THE CAR HAS BEEN DEVELOPING A SHAKE, I BROUGHT IT TO VOLVO FOR A CHECK UP, NOTHING WAS REPORTED AS UNUSUAL.  YESTERDAY I HEARD KNOCKING IN THE ENGINE AND IMMEDIATELY FLATBEDDED IT TO THE DEALERSHIP, THE WENT TO DIAGNOSE AND THE ENGINE HAS FROZE.  THE DEALER IS RESEARCHING AND EXPLAINED IT IS OUT OF WARRANTY WITH A NEW ENGINE COSTING $14,000.00, READING OTHER BULLETINS I SUSPECT THIS IS A COUNTERBALANCE SHAFT BEARING FAILURE AND IS OCCURRING WITH ALL 2005 V8 XC90'S AS THEY INCREASE IN AGE AND EXIT ANY WARRANTY PERIOD.  I HOPE SOMEONE CAN DO SOMETHING, A NEW ENGINE COST AS MUCH AS IT'S TRADE-IN VALUE.  SUCH A KNOW ISSUE SHOULD BE INVESTIGATED WITH VOLVO PICKING UP THE COST.  *TR",
        "vin": "YV1CZ852651"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/26/2011",
        "dateOfIncident": "06/11/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10403529,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "A NATIONAL DISTRIBUTOR OF REPLACEMENT AUTOMOBILE PARTS PROVIDED THE INCORRECT SIZE FRONT BRAKE ROTORS FOR A 2005 VOLVO XC-90.   A OWENS CROSS ROAD, AL AUTO REPAIR SHOP THAT INSTALLED THESE FRONT BRAKE ROTORS BLAMED THE NATIONAL DISTRIBUTOR'S CATALOG ERROR FOR SMALLER (APPROXIMATELY 0.50 INCH) FRONT BRAKE ROTORS WHICH ARE SOLD AS AN EXACT REPLACEMENT FOR THE ORIGINAL VOLVO ROTORS.  THE FRONT BRAKE PADS ACTUALLY EXCEEDED THE FRONT ROTORS OUTER DIAMETER AND SHOULD HAVE BEEN OBVIOUS TO ANY RESPONSIBLE AUTO MECHANIC.    THE NATIONAL DISTRIBUTORS CATALOG ERROR IS RECKLESSLY ENDANGERING PEOPLE ALL OVER THE UNITED STATES.  THE NAME OF THE NATIONAL DISTRIBUTOR IS UNKNOWN BUT CERTAINLY COULD BE OBTAINED FROM THE OWENS CROSS ROAD AUTO REPAIR SERVICE.  THE NATIONAL DISTRIBUTOR SHOULD BE FINED AND REQUIRED TO NOTIFY EVERY AUTO REPAIR SHOP WHICH THEY HAVE SUPPLIED WITH THE INCORRECT SIZE FRONT ROTORS.",
        "vin": "YV1CY592651"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/20/2011",
        "dateOfIncident": "01/12/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10402177,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 VOLVO XC90. THE CONTACT STATED WHILE DRIVING 30 MPH THE VEHICLE SHUT OFF WITHOUT WARNING. THE CONTACT HAD THE VEHICLE TOWED TO A LOCAL MECHANIC. THE MECHANIC NOTICE THE TIMING CHAIN BROKE CAUSING THE ENGINE TO LOCK UP. THE MECHANIC STATED THE ENGINE NEEDS TO REPLACED.  THE MECHANIC REPLACED THE ENGINE.  THE CONTACT NOTICE NUMEROUS COMPLAINT REGARDING ENGINE MALFUNCTIONS FOR THIS YEAR MAKE AND MODEL.  THE CONTACT CALLED THE MANUFACTURER AND THE MANUFACTURER STATED SINCE THE VEHICLE HAS NOT BEEN SERVICED AT A DEALER THEY ARE NOT RESPONSIBLE FOR THE REPAIRS. THE CONTACT STATED IF THE VEHICLE WAS ON THE HIGHWAY AND THE ENGINE FAILED A CRASH COULD HAVE OCCURRED. THE FAILURE MILEAGE WAS 75,000.",
        "vin": "YV1CZ852751"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/14/2011",
        "dateOfIncident": "08/10/2009",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10400868,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 XC90 V8. POWER REDUCTION, ENGINE NOISE, ENGINE FAILURE DUE TO DEFECTIVE REAR COUNTER BALANCE SHAFT BEARING. FAILURE AT 35,000 MILES ON ENGINE, 4 YR OLD, DEALER SERVICED. LONG BLOCK REPLACED WHILE UNDER EXTENDED 7-YR WARRANTY. BY DEALER.  TOTAL REPAIR COST (W/O WARRANTY) WOULD HAVE BEEN $15,000.  *TR",
        "vin": "YV1CZ852051"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/12/2011",
        "dateOfIncident": "10/30/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10400706,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 VOLVO  XC90 V8 AWD-NUMEROUS ELECTRICAL ISSUES SINCE PURCHASING VEHICLE FROM A LOCAL DEALER IN UPSTATE NY IN 2010. ODD PROBLEMS SUCH AS HEADLIGHTS FAILING, POWER WINDOWS OPENING AND \"ANTI\" THEFT FEATURES (KEY LOCK) BEING ACTIVATED FOR UNKNOWN REASON-THE VEHICLE REQUIRED A BALANCE SHAFT REPLACEMENT AT ABOUT 70K MILES (I BELIEVE IT HAD 65K MILES WHEN I PURCHASED IT) WHICH APPARENTLY WAS DUE TO MANUFACTURER NOT HAVING DRIP HOLES IN ENGINE COMPARTMENT. I BELIEVE THE ELECTRICAL ISSUES ARE SOMEWHAT RELATED TO THAT PROBLEM IN THAT WATER SEEMS TO BE A PROBLEM FOR THIS VEHICLE. THE ODD ELECTRICAL ISSUES DON'T ALWAYS HAPPEN WHEN ITS RAINING BUT MOISTURE APPEARS TO BE A FACTOR. LATEST ISSUE WAS A LOCKED SHIFTER IN THE PARK POSITION-CAR WOULD START BUT COULD NOT PUT INTO ANY GEAR-TOWED TO DEALER  AND THEY REPLACED THE CEM (CENTRAL ELECTRONICS MODULE) FOR $2300.00. I MADE THEM GIVE ME THE DEFECTIVE MODULE SO HAVE IT IF YOU WOULD LIKE TO EXAMINE IT EXAMINE IT. LUCKILY, I ONLY HAD ONE DANGEROUS ISSUE AND THAT IS WHEN THE HEADLIGHTS FAILED DURING A DARK/RAINY NIGHT. TOO EARLY TO TELL IF THE CEM FIXES THE PROBLEM AS JUST HAD IT FIXED TODAY 5/13/2011. STARTED RESEARCHING WHY THIS WOULD BE AN ISSUE AND THAT'S WHEN I STARTED READING OTHER VOLVO DRIVERS EXPERIENCES THAT SEEMED QUITE SIMILAR TO MINE. I NEVER HAD COMPLETE VEHICLE FAILURE BUT LOSING THE HEADLIGHTS WAS NOT FUN...I THINK VOLVO KNOWS EXACTLY WHAT THE ISSUE AS  THEY DIDN'T HESITATE IN INSTALLING THE CEM...I AM LISTING THE SPECIFIC DATE THAT THE HEADLIGHTS FAILED BELOW-THEY FAILED SEVERAL OTHER TIMES BUT CANT RECALL THE SPECIFIC DATES.  *TR",
        "vin": "YV1CZ852251"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/29/2011",
        "dateOfIncident": "04/27/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10398189,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE AN 2005 VOLVO XC90 WITH ONLY 53,000 MILES AND THE TRANSMISSION HAS ALREADY GONE OUT LEAVING MY FAMILY STRANDED ON THE SIDE OF THE FREEWAY.  *TR",
        "vin": "YV1CZ911251"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/29/2011",
        "dateOfIncident": "04/20/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10398294,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 VOLVO XC90. WHILE DRIVING APPROXIMATELY 70 MPH, THE VEHICLE BEGAN TO JERK EXCESSIVELY WITH A SUBSTANTIAL LOSS OF ENGINE POWER. THE CONTACT WAS ABLE TO MANEUVER TO THE SIDE OF THE ROAD AS THE ENGINE STALLED. IN ADDITION, THE CONTACT NOTICED A STRONG ODOR OF FUEL BOTH INSIDE AND OUTSIDE OF THE VEHICLE. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC WHERE THE FUEL PUMP WAS REPLACED. THE SIMILAR FAILURE RECURRED AND THE FUEL PUMP WAS REPLACED THREE DIFFERENT TIMES. THERE WAS A RECALL ASSOCIATED WITH NHTSA CAMPAIGN  ID NUMBER: 09V483000 (FUEL SYSTEM, GASOLINE:DELIVERY:FUEL PUMP). THE CONTACT EXPERIENCED THE IDENTICAL FAILURE AS MENTIONED IN THE RECALL YET THE VIN WAS NOT INCLUDED IN THE RECALL. THE FAILURE MILEAGE WAS 50,000. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/04/2011",
        "dateOfIncident": "02/24/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10394215,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "OUT OF THE BLUE A WELL-MAINTAINED AND WELL CARED FOR 2005 VOLVO XC90 V8 SUV DEVELOPED A SEVERE ENGINE KNOCKING/BANGING SOUND (ALL SERVICE RECORDS COMPLETED AT REQUIRED TIME PERIODS). ACTUALLY SOUNDED LIKE BALL BEARINGS ROLLING AROUND INSIDE THE ENGINE COMPARTMENT. 58,000 MILES ON THE VEHICLE. ENGINE WAS SHUT DOWN IMMEDIATELY AND VEHICLE FLATBEDDED TO THE SERVICE DEALER.      UPON INSPECTION, THE COUNTERBALANCE BEARING AND SHAFT FAILED. IF ENGINE HAD NOT BEEN SHUT DOWN THERE WAS A VERY REAL POSSIBILITY OF THE BEARING SEIZING AND THE SHAFT HITS THE INSIDE OF THE ENGINE BLOCK BREAKING THE TIMING CHAIN BENDING ALL THE VALVES(I.E. CATASTROPHIC ENGINE FAILURE)!      AS THE MANUFACTURER, VOLVO SHOULD BEAR THE FULL MONETARY RESPONSIBILITY   WHEN IT COME TO THIS REPAIR. A SERIOUS DESIGN FLAW IN THEIR ENGINE IS THE   CAUSE OF THIS FAILURE.     THE SERVICE TECH MUST TEAR YOU ENGINE APART (LITERALLY REMOVE THE ENGINE FROM THE VEHICLE AND OPEN THE ENGINE BLOCK!) TO PROPERLY COMPLETE THE REPAIR.      VOLVO SHOULD BE PICKING UP THE ENTIRE COST OF THIS FIASCO. PARTS AND LABOR. PERIOD.    TO DATE VOLVO MAKING OWNERS PAY FOR THE REPLACEMENT PARTS. THE PARTS ARE BETWEEN $1200-2000. IT IS NOT THE CORRECT WAY FOR A SO-CALLED 'QUALITY AUTOMOBILE MANUFACTURER' TO HANDLE THE SITUATION. WHEN CUSTOMERS PAY $45000-$55,000 FOR AN AUTOMOBILE, THEY EXPECT THE CAR (AND THE ENGINE!) TO LAST A WEE LONGER  THAN 55,000-75,000 MILES (SARCASM INTENDED). FRANKLY, THIS WILL BE MY LAST VOLVO.  *TR",
        "vin": "YV1CZ852951"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/26/2011",
        "dateOfIncident": "06/06/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10392958,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "SAFETY COMPLAINT - SUDDEN VEHICLE DISABLED ? 2005 VOLVO XC90 V8 ? JUNE 2010 130000 MILES. WIFE WAS DRIVING BUSY URBAN ROAD AND VEHICLE SUDDENLY STOPPED WITHOUT WARNING IN THE MIDDLE OF THE INTERSECTION. VEHICLE HAD TO BE PUSHED FROM MIDDLE OF INTERSECTION.  COUNTERBALANCE SHAFT BEARING FAILURE. THE TIMING CHAIN HAD BROKEN AND THE ENGINE HAD A CATASTROPHIC FAILURE. REPAY WAS $10,000 WITH A USED 60,000 MILE ENGINE INSTALLED. VOLVO WOULD NOT COVER ANY COST EVEN THOUGH A PRODUCT BULLETIN WAS PUT OUT. VEHICLE ALWAYS SERVICED BY DEALER AND NO MENTION EVER MADE OF POTENTIAL FOR FAILURE OR THE BULLETIN.  *TR",
        "vin": "YV1CZ852X51"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/26/2011",
        "dateOfIncident": "02/02/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10392960,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "SAFETY COMPLAINT 'SECOND OCCURRENCE SAME VEHICLE - SUDDEN VEHICLE DISABLED ' 2005 VOLVO XC90 V8 ' FEBRUARY 2011 153,000 MILES. DAUGHTER WITH LEARNER PERMIT DRIVING DOWN BUSY URBAN ROAD AND VEHICLE SUDDENLY STOPPED WITHOUT WARNING IN THE RIGHT OF WAY.  VEHICLE HAD TO BE PUSHED TO SIDE OF ROAD   SECOND COUNTERBALANCE SHAFT BEARING FAILURE. THIS FAILURE OCCURRED ON THE REPLACED ENGINE FROM THE PRIOR OCCURRENCE ' SEE COMPLAINT NUMBER 10392958. THIS ENGINE HAD 77,000 MILES AT TIME OF FAILURE. THE TIMING CHAIN HAD NOT BROKEN AND THE BALANCER SHAFT, IDLER GEAR COULD BE REPLACED AND ENGINE REPAIRED AFTER THE ENGINE HAD TO BE REMOVED - $3,000 REPAIR. VOLVO WOULD NOT COVER ANY COST EVEN THOUGH A PRODUCT BULLETIN WAS PUT OUT. VEHICLE ALWAYS SERVICED BY VOLVO DEALER AND NO MENTION EVER MADE OF POTENTIAL FOR FAILURE OR THE BULLETIN. RESEARCH NOW INDICATES THIS TO BE A COMMON PROBLEM FOR THIS MODEL YEAR CONFIGURATION. WE HAVE PURCHASED ANOTHER BRAND DUE TO SAFETY CONCERN, FAILURE TO PROVIDE SERVICE BY THE DEALER AND FAILURE OF VOLVO TO ACKNOWLEDGE ANY RESPONSIBILITY. THE % OF 2005 VOLVO XC 90 V8 VEHICLES WITH THIS SAFETY ISSUE AND ENGINE FAILURE RATE NEEDS TO BE ANALYZED. PLEASE REVIEW AND INITIATE AN INVESTIGATION.  *TR",
        "vin": "YV1CZ852X51"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "03/24/2011",
        "dateOfIncident": "03/16/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10392720,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 VOLVO XC90. WHILE DRIVING APPROXIMATELY 40 MPH IN RAINY WEATHER, THE DRIVER ATTEMPTED TO TURN ON THE WINDSHIELD WIPERS BUT THEY WOULD NOT ENGAGE. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHERE THE CONTACT WAS TOLD THAT THE CENTRAL ELECTRONIC MODULE WOULD NEED TO BE REPLACED BECAUSE RAIN WAS SEEPING INTO THE CENTRAL ELECTRONIC MODULE. THE VEHICLE WAS  REPAIRED.  UPDATED 05/05/11*LJ  UPDATED 05/13/11",
        "vin": "YV1CZ592851"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/22/2011",
        "dateOfIncident": "03/13/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10392462,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2005 XC90 V8 AWD WITH 65000, AFTER A MONTH OR SO I NOTICED HARD SHIFTING, YESTERDAY WE TOOK A TRIP UP THE MOUNTAIN AND I ACTUALLY LOST MY TRANSMISSION FOR A MIN, IT SLIPPED OUT OF PLACE WHILE PASSING A VEHICHLE, RPM SHOT UP TO 5-6K, IT KICKED BACK IN AGAIN ONCE WE SLOWED AND WE PULLED TO THE SIDE TO MAKE SURE IT WOULD STAY IN GEAR BEFORE GOING AGAIN. NOW IT HAS GONE BACK TO HARD SHIFTING OCCASIONALLY. I FEEL VERY UNSAFE AND FOUND LOTS OF REPORTS OF SIMILAR INCIDENTS. CONTACTING VOLVO HAS NOT BEEN HELPFUL AT ALL THEY WANT 7K FOR A NEW CRAPPY BUILT TRANSMISSION. NEW VEH 45K AND NEW TRANSMISSION EVERY 50K MI, WHAT A DEAL THIS CAR IS. I DONT WANT TO WAIT TILL ME OR MY FAMILY IS HURT OR KILLED TO REPORT IT.",
        "vin": "YV1CZ852X51"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/01/2011",
        "dateOfIncident": "11/23/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10386045,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 VOLVO XC90.  WHILE DRIVING APPROXIMATELY 30 MPH, THE CONTACT BEGAN TO HEAR A KNOCKING NOISE COMING FROM THE ENGINE.  THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHERE THE CONTACT WAS TOLD THAT THE BEARING AND CAM SHAFTS WOULD NEED TO BE REPLACED.  THE VEHICLE WAS REPAIRED.  THE FAILURE MILEAGE WAS 126,000 AND THE CURRENT MILEAGE WAS 128,000.",
        "vin": "YV1CZ852951"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/21/2011",
        "dateOfIncident": "02/19/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10383884,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE HIGHWAY IN RAIN, THE HEADLIGHTS OF THE CAR BEGAN FLASHING ON AND OFF (SOMETIMES DRIVERS SIDE, SOMETIMES PASSENGER SIDE, SOMETIMES BOTH) INTERMITTENTLY.  I PULLED OVER AND TURNED OFF AND RESTARTED CAR.  THIS SOLVED THE PROBLEM FOR A FEW MILES, THEN IT DID IT AGAIN.  NOW, THE RIGHT LIGHT IS OUT COMPLETELY, BUT AT LEAST THE LEFT SEEMS TO BE STAYING ON.  THIS EXACT SAME THING HAPPENED ONE OTHER TIME.  THE DEALERSHIP CLAIMED THEY COULD FIND NOTHING WRONG WITH THE VEHICLE.  *TR",
        "vin": "YV1CZ911651"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/18/2011",
        "dateOfIncident": "01/06/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10383297,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 VOLVO  XC90 COUNTER BALANCE SHAFT BROKE AND SEIZED ENGINE. ONLY 68,000 MILES AND A WELL MAINTAINED VEHICLE! VOLVO REFUSES TO TAKE ANY RESPONSIBILITY FOR THIS POORLY DESIGNED SYSTEM. QUOTED $16,850 PLUS TAX FOR REMANUFACTURED UNIT. INCIDENTALLY, JUST THIS PAST SEPT ALSO HAD TO REPLACE OIL COOLER, THERMOSTAT AND EXPANSION TANK WHEN THE VEHICLE BROKE DOWN AS WERE DRIVING THROUGH VIRGINIA. THIS IS ANOTHER WELL DOCUMENTED ISSUE WITH THIS VEHICLE! *LN",
        "vin": "YV1CZ852151"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/03/2011",
        "dateOfIncident": "12/15/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10380677,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "COUNTERBALANCE SHAFT BEARING FAILURE AT 113,000 MILES LUCKILY FAILURE HAPPENED ON THE WAY TO THE REPAIR SHOP.  IF THIS WOULD HAVE TAKEN PLACE ON THE HIGHWAY MY WIFE AND KIDS COULD HAVE BEEN SERIOUSLY INJURED.  VOLVO KNOWS THIS IS AN ISSUE OR WOULD NOT HAVE RELEASED A TECHNICAL SERVICE BULLETIN ON WAYS TO REMEDY THE PROBLEM BY DRILLING WEEP HOLES IN THE BLOCK TO SHED MOISTURE.  THE TRAPPED MOISTURE CAUSES THE BEARING TO RUST AND FINALLY FAIL CAUSING CATASTROPHIC ENGINE FAILURE.  VOLVO HAS OFFERED A MERE $3,000.00 TO CORRECT A $15,000.00 PROBLEM.  I HAVE READ NUMEROUS TESTIMONIES FROM OTHER 2005 XC-90 OWNERS WITH ENGINE FAILURE ALWAYS FROM THE FAILED COUNTERBALANCE SHAFT BEARING.  HOW DO WE FORCE VOLVO TO  ISSUE A RECALL BEFORE SOMEONE GETS SERIOUSLY INJURED.",
        "vin": "YV1CZ852451"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, OTHER,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/31/2011",
        "dateOfIncident": "01/18/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10379781,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 XC90 V8-MANY PROBLEMS WITH CHECK ENGINE LIGHT COMING ON AND CAR LOSING POWER. LOST POWER ON INTERSTATE-CAR WOULD LOSE POWER AND SPEED-NEEDED TOW-HAPPENED TWICE. CURRENT ISSUE CHECK ENGINE LIGHT CAME ON FOLLOWED BY ALL LIGHTS COMING ON STATING BRAKE FAILURE, POWER OVERLOAD, LIMP MODE AND BRAKE FAILURE. DEALER REPLACED ALTERNATOR AT COST OF $1006. 10 DAYS LATER CHECK ENGINE LIGHT AND ANTI SKID LIGHT CAME ON FOLLOWED BY BRAKE FAILURE LIGHT. CAR LOST HEADLIGHTS AND WINDSHIELD WIPERS-9 PM AND SLEETING. DEALER NOW SAYS NEED TO REPLACE CEM AND BATTERY AT A COST OF $3,000 DUE TO WATER IN CEM. IT WAS RAINING OR SLEETING BOTH TIMES THE CHECK ENGINE LIGHT CAME ON. VOLVO REDESIGNED THE COVER TO PREVENT WATER INTRUSION BUT NEEDS TO ISSUE RECALL. VERY DANGEROUS- TICKING TIME BOMB. SOMEONE WILL HAVE AN ACCIDENT ON RAINY NIGHT ON INTERSTATE. PLEASE CONSIDER REQUIRING RECALL-OWNERS OF THIS VEHICLE ARE SPENDING THOUSANDS OF DOLLARS DUE TO VOLVO XC90 V8 DESIGN FLAWS. HOW CAN VOLVO BE ALLOWED TO SELL VEHICLES THAT SHOULD NOT BE DRIVEN OUTSIDE/OR IN THE RAIN.  *TR",
        "vin": "YV1CZ852751"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/27/2011",
        "dateOfIncident": "01/20/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10379327,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 VOLVO XC90. THE CONTACT STATED THAT FUEL WAS LEAKING FROM THE FUEL TANK WHEN HE WAS DRIVING 25 MPH. THE CONTACT REFERENCED RECALL 09V483000 (FUEL SYSTEM, GASOLINE: DELIVERY: FUEL PUMP) BUT WAS INFORMED BY THE MANUFACTURER THAT THE VEHICLE WAS NOT INCLUDED. THE FAILURE MILEAGE WAS 64,000.",
        "vin": "YV1CN592251"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/06/2011",
        "dateOfIncident": "01/06/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10375029,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "BALANCE SHAFT FAILURE ON 2005 VOLVO XC90 V8 WITH 115K MILES.  UNBELIEVABLE THAT VOLVO WILL NOT ISSUE A RECALL FOR THIS. BALANCE SHAFT FAILED TODAY AT JUST UNDER 115K MILES... UNBELIEVABLE... AND I THOUGHT IT WAS JUST AN INTERNET RUMOR. IF YOU HAVE A 2005 XC90, SELL IT NOW!  SERIOUSLY, THIS IS UNACCEPTABLE FOR A $50,000 VEHICLE, AND EVEN MORE UNACCEPTABLE FOR VOLVO NOT TO ISSUE A RECALL. NEEDLESS TO SAY, I SERIOUSLY DOUBT WE WILL EVER BUY ANOTHER VOLVO AGAIN SIMPLY BECAUSE THEY SHOULD HAVE ISSUED A RECALL FOR THIS PROBLEM. SHOULD HAVE STUCK WITH THE GERMANS (AUDI OR BMW), OR DARE I SAY IT THE JAPANESE, OR EVEN THE AMERICANS! I CAN REPLACE A LOT OF WHEEL BEARINGS ON A YUKON FOR WHAT THIS BALANCE SHAFT IS GOING TO COST ME. VOLVO NEEDS TO MAKE IT RIGHT WITH EVERY OWNER OF A 2005 XC90. VOLVO KNOWS OF THIS PROBLEM AND THAT IS WHY THEY ISSUED A TSB TO DRILL A DRAIN HOLE IN THE BLOCK, BUT THEY NEED TO STEP UP AND ISSUE A RECALL OR, AT THE VERY LEAST IF AN OWNER COMES INTO THE DEALERSHIP WITH THIS PROBLEM, THEY NEED TO FIX IT AT NO CHARGE. IT WAS THEIR MISTAKE, OWN UP TO IT AND FIX IT! *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/19/2010",
        "dateOfIncident": "12/19/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10371228,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING WITH MY DAUGHTER ON A VERY LONG BRIDGE AT NIGHT IN MY 2005 VOLVO XC90.  THE CHECK ENGINE LIGHT CAME ON AND WHILE THE CAR STAYED ON, IT APPEARED TO HAVE LOST POWER.  I HAVE HAD OTHER ELECTRICAL PROBLEMS WITH THE CAR AND HAVE HAD IT TO THE DEALER 3 TIMES BUT THEY SAY THEY CAN'T FIND ANYTHING WRONG WITH IT.  THIS WAS BY FAR THE MOST DANGEROUS INCIDENT!  AFTER DOING SOME INTERNET RESEARCH, I HAVE READ HUNDREDS OF REPORTS SIMILAR TO MINE.  THERE IS A DEFINITE ISSUE WITH THIS CAR AND IT SHOULD BE RECALLED. *TR",
        "vin": "YV1CY592351"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/29/2010",
        "dateOfIncident": "08/28/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10368105,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 VOLVO XC90. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, THE DRIVER SIDE HEADLIGHT WOULD SHUT OFF INTERMITTENTLY. THE VEHICLE WAS INSPECTED BY A DEALER WHERE THE CONTACT WAS INFORMED THAT THEY WOULD HAVE TO REPLACE THE CEM UNIT. THE VEHICLE HAD NOT BEEN REPAIRED. THE FAILURE MILEAGE WAS  APPROXIMATELY 70,000.",
        "vin": "YV1CZ592951"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/03/2010",
        "dateOfIncident": "10/24/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10363820,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "OCTOBER 10, 2010 PURCHASED CASH 2005 XC90 V8. WENT THROUGH SAFETY AND EMISSION SERVICE FOR REGISTRATION-- OKAY.  OCTOBER 22 HEARD A STRANGE NOISE FROM ENGINE, CALLED VOLVO DEALERSHIP TO REQUEST SERVICE. DIDN'T DRIVE ON OCTOBER 23, 2010. ON SUNDAY, OCTOBER 24, WENT OUT TO MOVE THE CAR FOR OPPOSITE SIDE PARKING AND TO GAS UP FOR DRIVE TO SERVICE CENTER.  CAR STOPPED AT SERVICE STATION, AND HAD TO BE TOWED TO DEALERSHIP. DEALERSHIP DIAGNOSTICS OCTOBER 25, 2010 CONFIRMED:  NOISE IS FROM EITHER BROKEN CONNECTING ROD OR BALANCE SHAFT....ADVICE TO CUSTOMER \"NEEDS ENGINE\" AT A COST OF $14,000+.  THE CAR DID NOT COME WITH A WARRANTY AND EVEN NOW THE DEALER IS BECOMING INCREASINGLY EVASIVE--AS HE SAYS HE WAS THE OWNER/DEALER AT THE TIME OF SALE, AND AS INDIVIDUAL SELLER REGISTERED IN ANOTHER STATE AND NOT NEW YORK, SO DOES NOT HAVE TO HONOR WARRANTY OR ASSUME RESPONSIBILITY.  CALL VOLVO NORTH AMERICA ON OCTOBER 26, 2010 WITH NO KNOWLEDGE OF  OUR OWNERSHIP, (STILL HAVEN'T RECEIVED TITLE TO CAR). RESPONSE WAS --NO WARRANTY NO ASSISTANCE WITH THIS COUNTER BALANCE OR ANY OTHER ISSUE BEYOND 4 YEAR/50,000 MILES.  CONCERN: BEFORE PURCHASE WHEN ASKING THE DEALER NO MENTION NOR WHEN RESEARCHED NO REVELATION OF THE COUNTERBALANCE SHAFT BEING AN ONGOING ISSUE FOR THE 2005 XC90 V8.  HOWEVER, FURTHER EVIDENCE CLEARLY SHOWS DESIGN FLAWS IN THE ORIGINAL YAMAHA ENGINES, AND A SLIGHT COVERT ATTEMPT BY VOLVO TO FIX IT VIA ITS LIMITED EDITION TECHNICAL SERVICE BULLETIN(TSB) TO DRILL THE HOLE IN THE SHAFT TO LET BUILD UP MOISTURE ESCAPE.  ADDITIONALLY, VOLVO'S SECOND ATTEMPT TO SLIGHTLY ADDRESS THE COUNTER BALANCE ISSUE IS EVIDENCED VIA ITS LIMITED AND PAY-TO-GET TSB INFORMING DEALERSHIPS NOT CONSUMERS  'OF NOT WASHING THE ENGINE,' WHICH MAY LEAD TO MOISTURE BUILD UP AND TOTAL ENGINE FAILURE. OUR ATTEMPTS ARE NOW BEING MADE FOR VOLVO TO MAINTAIN ITS SLOGAN OF \"SAFETY FOR LIFE.\" WE WANT THE SAFETY ATTRIBUTE TO BE EFFECTIVE AND USEFUL WHEN THE CAR IS OPERABLE, AND NOT WHEN THE CAR IS INOPERABLE. *TR",
        "vin": "YV1CZ852X51"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/01/2010",
        "dateOfIncident": "11/01/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10363533,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "60,000 MILES ON A 1995 VOLVO XC90 AND THE TRANSMISSION JUST FAILED FOR THE FOURTH TIME.  THE TRANSMISSION WAS ALREADY REPLACED THREE TIMES.  FAILURE RESULTS IN CAR STOPPING WITHOUT WARNING.  ANYTIME, ANYPLACE, IT JUST LOSES POWER. *TR",
        "vin": "YV1CZ852651"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/29/2010",
        "dateOfIncident": "04/10/2009",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10362949,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2005 VOLVO XC90 T6.  BOUGHT THIS CAR BRAND NEW. HAD SO MANY PROBLEMS INCLUDING TRANSMISSION OUT;  THE BLINKERS DO NOT WORK.   THE QUALITY AND SAFETY OF THIS VEHICLE IS MISLEADING AND THIS IS A HORRIBLE SAFETY ISSUE SINCE BLINKER DON'T WORK.  LOOKING INTO IT, SEEMS LIKE THIS IS AN ONGOING ISSUE WITH MANY OWNER OF VOLVO XC90 2005.  THEY REALLY NEED TO RECALL THIS BEFORE IT'S TOO LATE AND CAUSE FATALITIES. *TR",
        "vin": "YV1CM911651"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/14/2010",
        "dateOfIncident": "08/14/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10360458,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS DRIVER'S SIDE HEADLIGHT FAILURE.  REPLACED BULB WITH CERTIFIED VOLVO REPLACEMENT AND STILL DID NOT WORK.  CERTIFIED VOLVO MECHANIC TRACED FUSES AND ALL ELECTRICAL COMPONENTS (5 HOURS PAID SERVICE) AND FOUND THAT A PLASTIC PART DESIGNED TO KEEP WATER OUT OF THE INTERIOR (VIA WINDSHIELD) WAS DEFECTIVE,         THEREFORE, CAUSING WATER LEAKAGE TO DAMAGE THE CENTRAL ELECTRICAL MODULE . *TR",
        "vin": "YV1CZ592451"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/03/2010",
        "dateOfIncident": "09/28/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10358892,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 VOLVO XC 90 T6 TRANSMISSION FAILURE AND TURN SIGNAL NOT OPERATING. *TR",
        "vin": "YV1CZ911351"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/02/2010",
        "dateOfIncident": "12/01/2009",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10358883,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2005 VOLVO XC90 AWD. MY HEAD LIGHTS HAVE INTERMITTENT FAILURES ALMOST EVERY TIME I AM DRIVING AT NIGHT. IT STARTED ABOUT 10 MONTHS AGO AND HAS BEEN GETTING MORE FREQUENT. SOMETIMES LEFT HEAD LIGHT FAILS, SOMETIMES RIGHT HEAD LIGHT FAILS, SOMETIMES BOTH GO OUT. THEY WILL RESUME WORKING, SOMETIMES IF I DO NOTHING, BUT ALWAYS IF I  TURN THEM OFF & BACK ON. BUT WILL CONTINUE TO FAIL. THE DEALER SAID THEY CANNOT FIND ANY PROBLEM. *TR",
        "vin": "YV1CZ852251"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/15/2010",
        "dateOfIncident": "09/13/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10355742,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "ME AND MY WIFE JUST BOUGHT OUR FIRST VOLVO 4 DAYS AGO!!! AND MY WIFE WAS ON THE HIGH WAY WITH OUR 7 MONTH OLD SON WHEN THE TRANSMISSION FAILED ON HER AND THEY ALMOST GOT INTO A CAR ACCIDENT. THANK GOD SHE WAS ABLE TO PULL OVER ON THE SIDE OF THE HIGH WAY AND CALL AAA AND WE HAD THE CAR TOWED TO THE VOLVO DEALER WERE WE BOUGHT IT FROM BECAUSE THEY GAVE US A 3 MONTH/ 3000 MILE WARRANTY. AND NOW IT'S BEEN 3 DAYS AND WE HAVE NO CAR AND THE DEALER IS SAYING THAT THEY ARE TRYING TO REPROGRAM THE TRANSMISSION.   I WISH THAT I WOULD HAVE READ SOME OF THESE REVIEWS ON THIS MODEL CAR. BECAUSE THEY ALL SEEM TO HAVE TRANSMISSION PROBLEMS AND THEY SHOULD HAVE RECALLED THAT PROBLEM.   WHAT SHOULD WE DO?    [XXX]  INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *TR",
        "vin": "YV1CZ911751"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/12/2010",
        "dateOfIncident": "09/03/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10355043,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2005 VOLVO XC 90 MODEL T6 WITH ABOUT 60,000 MILES ON IT. RECENTLY, THE CAR FAILED AND I GOT THE \"URGENT TRANSMISSION SERVICE\" WARNING. VOLVO INITIALLY WANTED TO CHARGE ME NEARLY $7000 TO REPLACE THE TRANSMISSION BUT FINALLY AGREED TO COVER THE COST (MINUS A $160 \"DIAGNOSIS PLUS MY TOWING COSTS). AFTER SOME INTERNET RESEARCH I SAW THAT THIS HAS BEEN A COMMON PROBLEM IN MODEL YEAR 2003-2005 T6 MODELS; ALL CATASTROPHIC TRANSMISSION FAILURES WITH LOW MILEAGE, IN SOME CASES MULTIPLE TRANSMISSIONS INVOLVED.    SEE ATTACHED LINK:  HTTP://TOWNHALL-TALK.EDMUNDS.COM/DIRECT/VIEW/.F18A651    TALKING TO THE SERVICE REPRESENTATIVE, THEY CLAIMED IT WAS BECAUSE THEY USED A GM TRANSMISSION THAT WAS NOT ABLE TO HANDLE THE POWER OF THE ENGINE (OR PERHAPS THE WEIGHT OF THE CAR). THEY INSTALLED A \"REMANUFACTURED\" TRANSMISSION, THEY CLAIM WITH \"BEEFED UP\" CLUTCH PARTS.    THERE HAVE BEEN SERVICE BULLETINS SINCE 2008 ABOUT LEAKS FROM THE RADIATOR CONTAMINATING THE TRANSMISSION FLUID (LEADING TO FAILURES AS WELL). IT IS MY UNDERSTANDING THAT THERE HAVE BEEN HUNDREDS OF THESE FAILURES. THERE IS ALSO A CLASS ACTION LAWSUIT UNDERWAY AS WELL.    IN MY CASE, I WAS ON A MAJOR HIGHWAY, AND IT WAS A VERY DANGEROUS SITUATION. I DON'T UNDERSTAND WHY THE GOVERNMENT IS NOT DOING ANYTHING ABOUT THIS, AS I WAS ABLE TO FIND A GREAT DEAL OF INFORMATION AFTER JUST A FEW SIMPLE INTERNET SEARCHES.    I WOULD LIKE TO REQUEST AN INVESTIGATION, AND IF WARRANTED, A RECALL AND COMPENSATION (THE USED CAR VALUE FOR THIS CAR HAVE DROPPED BECAUSE OF THE LACK OF RELIABILITY OF THE TRANSMISSIONS). I BELIEVE VOLVO IS TRYING TO DEAL WITH THIS ON A CASE BY CASE BASIS TO COVER IT UP AND MINIMIZE THEIR COSTS. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "08/27/2010",
        "dateOfIncident": "11/23/2009",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10352409,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "COUNTERBALANCE SHAFT BEARINGS BREAKDOWN IN NOV 2009 AND HAD REPAIRS DONE AT INDEPENDENT  REPAIR SHOP; AUGUST 2010 CYLINDER HEAD LEAK/CRACK WHICH BRINGS OIL TO WATER COOLANT. REPAIR SHOP ADVISED TO GET RID OF CAR 2005 XC 90 V8 VOLVO.  I AM FEARFUL OF DRIVING THIS CAR.  TO REPAIR AND REPLACE ENGINE  AND NEW TRANSMISSION TOO MUCH $$$ FOR THIS VOLVO.  WITH NO GUARANTEE. VOLVO NEEDS TO OWN UP TO THE BAD QUALITY OF THIS PARTICULAR MODEL.  I FEEL IT IS DANGEROUS TO DRIVE WITH SO MANY CARS ON THE ROAD.  IT'S AN ACCIDENT WAITING TO HAPPEN. *TR",
        "vin": "YV1CZ852851"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/20/2010",
        "dateOfIncident": "08/20/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10350864,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS A SECOND REPORT I SUBMIT. THE OTHER DAY I JUST REPORTED MALFUNCTION OF TURN SIGNAL SWITCH OF MY VOLVO XC90, 2.5T, 2005. I TESTED AND OBSERVED THE PERFORMANCE OF THE TURN SIGNAL SWITCH CAREFULLY AND I THINK THE POTENTIAL SEVERE DESIGN DEFECT IN THE TURN SIGNAL SWITCH, OR, MAYBE THE ELECTRONIC CONTROL MODULE, WILL CAUSE FATAL INCIDENTS. ITS PERFORMANCE IS TOTALLY UNPREDICTABLE. IT REFUSED TO RESPOND AT ANY TIME, EITHER STOPPED OR RUNNING. MOREOVER, I FOUND THAT SOMETIMES A RIGHT MOVEMENT OF THE LEVER GIVES A LEFT SIGNAL, WHICH IS EXTREMELY DANGEROUS. HERE I WOULD LIKE TO STRONGLY REQUEST THAT THE INVESTIGATION OF VOLVO XC90 ELECTRONIC SYSTEM BE CONDUCTED THOROUGHLY. I WOULD NOT BE SURPRISED AT ALL TO HEAR ANY FATAL INCIDENT CAUSED BY THE UNPREDICTABLE MALFUNCTION. AND I HOPE THIS COULD BE PART OF A RECALL.  INTERESTINGLY, I OBSERVED THAT ALL THE FUNCTIONS RELATED TO THE SWITCH LEVER EITHER DISAPPEAR ALTOGETHER OR WORKS WELL ALTOGETHER. THIS PARTIALLY SUPPORT THAT THERE IS DEFECT IN THE CONTROL MODULE. I WOULD LIKE TO HELP THE INVESTIGATION. I ALSO HAVE TWO WITNESSES WHO HELPED ME TO TEST DRIVE MY XC90. *TR",
        "vin": "YV1CN592151"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/19/2010",
        "dateOfIncident": "08/17/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10350579,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A USED VOLVO XC90, 2.5T MODEL, MANUFACTURED IN 2005. AND YESTERDAY I DROVE IT FOR ABOUT 30 MILES. VOLVO IS FAMOUS FOR VARIOUS SAFETY FEATURES. HOWEVER, I FOUND THAT FOR MANY TIMES THE TURN SIGNAL LEVER DID NOT WORK WELL, WHICH REALLY SCARED ME AND ALMOST CAUSED CRASHES ON HIGHWAY 610 OF HOUSTON. THE SYMPTOM OF MALFUNCTION IS THAT SOMETIMES WHEN I MOVE THE TURN SIGNAL LEVER, IT EITHER DID NOT RESPOND OR SHOWED A \"LAG\". AND SOMETIMES THE SIGNAL KEPT FLASHING LEFT, EVEN I GAVE LEFT TURN TO THE RIGHT.     I REPORTED THIS POTENTIAL MALFUNCTION TO YOU BECAUSE I JUST READ THE NEWS ON HTTP://WOT.MOTORTREND.COM/6669043/RECALLS/NHTSA-INVESTIGATES-2004-2005-VOLVO-XC90-FOR-FAULTY-LIGHTS-SIGNALS/INDEX.HTML, WHICH MAKES ME BELIEVE THAT IT IS NOT ONLY AN INDIVIDUAL CASE.     HOPE YOU CAN HAVE A THOROUGH INVESTIGATION, FOR THE SAFETY OF ALL.    THANK YOU. *TR",
        "vin": "YV1CN592151"
    },
    {
        "components": "EXTERIOR LIGHTING,TIRES",
        "crash": false,
        "dateComplaintFiled": "08/16/2010",
        "dateOfIncident": "08/05/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10349713,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "EAGLE GT",
                "productYear": "9999",
                "size": "225/55R16",
                "type": "Tire"
            }
        ],
        "summary": "2005 VOLVO XC90 V8  TURN SIGNAL DOES NOT WORK PROPERLY. SOMETIMES NEED TO FLIP THE CONTROL BAR FOR MULTIPLE TIMES. FAIRLY DANGEROUS FOR CHANGING LANES OR TURNING TO LEFT OR RIGHT.  PUSHING THE TURN SIGNAL CONTROLLER DOWNWARD MAKES THE SIGNAL WORK.   PROBLEM IS CONSISTENT. *TR",
        "vin": "YV1CZ852451"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/01/2010",
        "dateOfIncident": "07/23/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10346640,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 VOLVO XC90 T6, TRANSMISSION FAILED AFTER 64K MILES. TRANSMISSION FAILED AT HIGHWAY SPEEDS NEARLY CAUSING AN ACCIDENT AS THE VEHICLE SLOWED UNEXPECTEDLY ON I95 IN HEAVY TRAFFIC. TRANSMISSION FAILED AFTER A PROGRAM UPGRADE 3 WEEKS EARLIER.   TRANSMISSION WAS SLIPPING AND TRANSMISSION SERVICE LIGHT APPEARED CAUSING THE VEHICLE TO BE TOWED TO THE DEALER. DEALER UNABLE TO FIND ANY FAULT CODES BUT UPGRADED THE SOFTWARE, \"HOPING THIS FIXES IT...\"     AFTER COMPLETE FAILURE, VEHICLE TAKEN ON FLATBED TO DON BEYER VOLVO WHO DIAGNOSED FAILURE AS A \"TRANSMISSION FAILURE\" THE DEALERSHIP OFFERED TO REPLACE TRANSMISSION AND SEVERAL OTHER PARTS AT NO COST. *TR",
        "vin": "YV1CZ911051"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/31/2010",
        "dateOfIncident": "03/15/2009",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10346533,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2005 VOLVO XC90 IN WHICH MY LOW BEAM LIGHT JUST CUTS OUT. IT STARTED ABOUT A YEAR AGO. IT HAPPENS ALL OF THE TIME NOW.  IT HAS NOT BEEN FIXED YET.  I WAS LOOKING FOR POSSIBLE INFORMATION ON THIS PROBLEM AND LEARNED THAT AN INVESTIGATION IS UNDERWAY NOW AND THAT A RECALL MAY BE ISSUED.  I JUST WANTED TO MAKE YOU AWARE OF ANOTHER VEHICLE WITH THE SAME PROBLEM.  I ALSO LEARNED TODAY THAT A FRIEND WITH A VOLVO CROSSCOUNTRY WAGON HAD THE SAME PROBLEM UNTIL THE CEM WAS REPLACED. *TR",
        "vin": "YV1CZ911X51"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/15/2010",
        "dateOfIncident": "06/16/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10343465,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "VOLVO XC90 2005 V8 - COUNTER BALANCE SHAFT FAILURE LEADING TO TOTAL ENGINE FAILURE AND REQUIRING ENGINE REPLACEMENT. *TR",
        "vin": "YV1TS97D0X1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/07/2010",
        "dateOfIncident": "07/07/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10341911,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION FAILURE OF VOLVO XC90 T6. KNOWN PROBLEM THAT THE TRANSMISSION IN THIS CAR IS BAD. LEFT STRANDED IN THE MIDDLE OF AN INTERSECTION AND WAS ALMOST REAR-ENDED! \"TRANSMISSION SERVICE URGENT\" LIGHT CAME ON AND TOOK TO BE CHECKED OUT. WAS TOLD COULDN'T FIND PROBLEM AND REPLACED FLUID. TO NO AVAIL AND WAS LEFT STRANDED! I HAVE FOUND COUNTLESS COMPLAINTS ONLINE FROM OTHERS WITH THIS SAME ISSUE!! *TR",
        "vin": "YV1CZ911751"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/01/2010",
        "dateOfIncident": "05/27/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10333984,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2005 VOLVO XC90'S TRANSMISSION UNEXPECTEDLY FAILED DURING ACCELERATION WHILE I WAS TURNING LEFT ACROSS TRAFFIC CAUSING A SIGNIFICANT DECREASE IN POWER WHICH IN TURN REQUIRED SEVERAL CARS TO HAVE TO \"SLAM\" ON THEIR BRAKES TO AVOID HITTING ME. THEIR \"SLAMMING\" ON THE BRAKES CAUSED THE CARS BEHIND THEM TO HAVE TO BRAKE HARD TO AVOID REAR-ENDING THEM. AFTER TAKING THE SUV TO THE DEALERSHIP FOR DIAGNOSTIC CHECK AND LEARNING THAT OUR TRANSMISSION NEEDED TO BE REPLACED, I DID A SEARCH ON OUR CAR MAKE AND MODEL AND FOUND THAT I WAS NO WHERE NEAR THE FIRST PERSON TO EXPERIENCE A TERRIFYING EVENT LIKE THIS DUE TO VOLVO'S TRANSMISSION FAILURES. I FOUND PAGE AFTER PAGE OF ACCOUNTS WHERE PEOPLES CARS SUDDENLY WOULD NOT ACCELERATE AS USUAL DUE TO TRANSMISSION FAILURE. THIS IS A MAJOR SAFETY ISSUE THAT I THINK THE NTSB NEEDS TO INVESTIGATE DUE TO VOLVO'S REFUSAL TO EITHER ACKNOWLEDGE OR CORRECT THE PROBLEM. PLEASE DON'T WAIT UNTIL AN ENTIRE FAMILY IS HURT OR KILLED BEFORE TAKING ACTION. PLEASE DO NOT REPEAT THE TOYOTA MISTAKES. *TR",
        "vin": ""
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "05/15/2010",
        "dateOfIncident": "08/01/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10330543,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2005 VOLVO XC-90 DOES NOT AUTOMATICALLY LOCK ANY OF THE VEHICLE DOORS WHEN THE CAR IS PUT IN DRIVE AND STARTS MOVING.  THIS IS A SERIOUS SAFETY DEFECT THAT I COMPLAINED ABOUT TO VOLVO, FORD AND NHTSA IN 2005.    FORD MOTOR COMPANY AND VOLVO ADVERTISE THE XC-90 AS THE SAFEST VEHICLE ON THE ROAD.  FORD AND VOLVO HAVE OTHER CARS BEFORE AND AFTER THE XC-90'S INTRODUCTION THAT AUTOMATICALLY LOCKS THE DOORS WHEN THE VEHICLE IS PUT IN DRIVE AND STARTS MOVING.  FORD MOTOR COMPANY HAS HAD AUTOMATIC DOOR LOCKS ON MANY OF THEIR OTHER VEHICLES FOR YEARS SO THEY TRAINED US TO EXPECT IT, AND THEN THEY LEAVE THIS FEATURE OFF!  I BELIEVE THIS DESIGN FLAW HAS BEEN IN EXISTENCE SINCE THE XC-90 WAS FIRST INTRODUCTION INTO THE UNITED STATES IN 2004.    THIS IS UNCONSCIONABLE!!! *TR",
        "vin": "YV1CY592651"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/15/2010",
        "dateOfIncident": "05/15/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10330570,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2005 VOLVO XC90 T6. THE TRANSMISSION FAILED ON THE HIGHWAY TODAY,AND I WAS NEARLY REAR ENDED WITH TWO SMALL CHILDREN IN THE TRUCK. THE LIGHT CAME ON NOW THAT SAID TRANSMISSION SERVICE URGENT. I COMPLAINED TO THE VOLVO DEALER 7 MONTHS AGO. THEY DID A SOFTWARE UPGRADE AND SAID ALL WAS FINE.VOLVO IS WELL AWARE OF THIS PROBLEM WITH MANY MANY 2005 XC 90 T6 VEHICLES. *TR",
        "vin": "YV1CZ911151"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/14/2010",
        "dateOfIncident": "04/14/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10325607,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2005 VOLVO XC90 WITH ONLY 88000 MILES IS HAVING TRANSMISSION PROBLEMS JUST THIS MORNING A MESSAGE READS URGENT TRANSMISSION PROBLEM AND I RESEARCH AND NOTICE THAT MANY CUSTOMERS HAVE HAD THIS SAME PROBLEM WITH THE SAME VEHICLE MODEL AND YEAR YET VOLVO HAS NOT DONE A RECALL ON IT. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/07/2010",
        "dateOfIncident": "11/16/2009",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10324165,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "COUNTER BALANCE BEARING FAILED AT 55,504 MILES.  NON-GREASED BEARING FAILURE, CAUSED BY RUSTING, DUE TO MOISTURE BUILD UP INSIDE OF ENGINE CHAMBER.  VEHICLE HAD ALL REQUIRED SERVICE DONE A VOLVO DEALERSHIPS.  ENGINE WAS REPAIRED NOT REPLACED, FOR A COST OF $5000.00. REPAIR WORK WAS DONE AT VOLVO DEALERSHIP.  VOLVO MECHANIC DRILLED WEEPING HOLE IN CHAMBER WHERE COUNTER BALANCE SHAFT SITS TO ALLOW WATER CAUSED BY MOISTURE BUILD UP TO ESCAPE.  DRILLING WEEPING HOLE WAS PART OF A TECH BULLETIN ISSUED BY VOLVO.  V8 ENGINES FOR THE XC90 PRODUCED IN 2005 DID NOT INITIALLY HAVE THIS WEEPING HOLE IN THEM.  THIS DESIGN CHANGE WAS IMPLEMENTED PART WAY THROUGH THE PRODUCTION YEAR (I BELIEVE POST ENGINE #6833).  LETTER WAS WRITTEN TO THE CEO OF VOLVO CARS OF N.A. LLC AND REPRESENTATIVE FROM HIS OFFICE REFUSED TO PROVIDE ANY SUPPORT, STATING THAT THE VEHICLE IN QUESTION WAS OUT OF WARRANTY AND THAT THERE WERE NO RECALLS WITH REGARDS TO THIS ISSUE. INFO PROVIDED TO VOLVO FROM SWEDESPEED.COM (SEE ODI ID #10313311), HOWEVER, THIS WAS REJECTED BY VOLVO AS A NON-VALID SOURCE OF INFORMATION (THEIR OWN CUSTOMERS!).  THE REPAIR JOB TO REPLACE THE CB SHAFT AND BEARING WAS OVER 30 HOURS, NOT TO MENTION THE PARTS COST.  WHAT WILL IT TAKE VOLVO TO ADMIT THERE IS A PROBLEM HERE AND ISSUE A RECALL TO REPLACE BEARINGS AND DRILL WEEPING HOLES IN THEIR 2005 XC90'S WITH V8 ENGINES? CONSIDERING THE COST THEY WILL INCUR, I'D SUGGEST THEY WILL NEED TO BE PUSHED.  THE COST OF ENGINE REPAIR IS ($5,000) AND ENGINE REPLACEMENT ($15,000+). ALL BEARING FAILURES OUTSIDE OF WARRANTY ARE FALLING ON THE SHOULDERS OF THE CONSUMER.  RECALLS ARE ABOUT SAFETY NOT COST TO THE MANUFACTURE.  JUST BECAUSE THIS PROBLEM MAY ONLY BE LINKED TO THE 2005 V8 ENGINES DOESN'T MEAN IT IS NOT IMPORTANT ENOUGH TO BE ADDRESSED FOR NOT ONLY CONSUMER FINANCIAL PROTECTION BUT ALSO FOR SAFETY REASONS. THANKFULLY MY ENGINE DIDN'T FAIL WHILE MY FAMILY WAS DRIVING ON A BUSY INTERSTATE! *TR",
        "vin": "YV1CZ852251"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/31/2010",
        "dateOfIncident": "03/31/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10323233,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A VOLVO 2005 XC90 AND ONLY 58,000 MILES NEED TO REPLACE THE TRANSMISSION. I SEARCH IN THE INTERNET FOR VOLVO XC90 TRANSMISSION AND IT SEEMS ALOT OF PEOPLE HAVING THE SAME PROBLEM WITH THIS MODEL.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/26/2010",
        "dateOfIncident": "03/26/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10322397,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2005 VOLVO XC90 T6 TRANSMISSION HAS FAILED FOR A SECOND TIME AT 95,000 MILES.  THIS IS THE SECOND DEFECTIVE TRANSMISSION FOR THE VEHICLE, WHICH WAS ORIGINALLY REPLACED AT 35,000 MILES.  WHILE DRIVING ON THE INTERSTATE AND ATTEMPTING TO ACCELERATE INTO TRAFFIC, THE VEHICLE SUDDENLY WENT INTO HIGH RPMS AS IF IN \"NEUTRAL\", FAILED TO PROPERLY ACCELERATE, AND THE \"SERVICE TRANSMISSION WARNING\" LIGHT CAME ON.  THIS DEALER SAYS THE TRANSMISSION MUST BE REPLACED A SECOND TIME.  VOLVO IS AWARE OF THE CHRONIC PROBLEM WITH THE 2003-2005 T6 VERSION OF THE XC90 BUT THUS FAR HAS NOT ISSUED A RECALL.  IT IS NOT UNHEARD OF FOR THE VEHICLES TO REQUIRE 2 OR THREE TRANSMISSIONS BY 100,000 MILES.  THERE ARE HUNDREDS IF NOT THOUSANDS OF SIMILAR REPORTS AVAILABLE ON INTERNET WEBSITES.  THIS IS A DANGEROUS SITUATION BECAUSE THE VEHICLE SUDDENLY STALLS WITHOUT WARNING WHILE THE DRIVER IS ATTEMPTING TO ACCELERATE, SUCH AS WHEN MERGING INTO INTERSTATE TRAFFIC.",
        "vin": "YV1CZ911851"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/10/2010",
        "dateOfIncident": "02/15/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10318392,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR STALLS WHILE DRIVING.  WHEN CHECKED OUT BY DEALERSHIP THEY IDENTIFIED PROBLEMS WITH THE FUEL PUMP.  ON YOUR WEB SITE THERE IS A RECALL FOR 2005 VOLVO XC90, WHICH MY CAR.  HOWEVER, VOLVO IS DECLINING MY REQUEST TO FIX THE FUEL PUMP. *TR",
        "vin": "YV1CZ592651"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/23/2010",
        "dateOfIncident": "02/13/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10313311,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "UNGREASED BEARING FAILING ON 2005 V8 VOLVO XC90    A BALANCE SHAFT BEARING IS FAILING DUE TO THE FACT THAT THE BEARING IS NOT GREASED AND WATER CAN ENTER INTO THE BEARING CAVITY AND MAKE IT RUST. ONCE THIS HAPPENS, IT CAN PRODUCE A TOTAL ENGINE FAILURE, AND BESIDES THE FACT THE ENGINE IS TOTALLY COMPROMISED AND NEEDS REPLACEMENT, IT WOULD OBVIOUSLY IMPAIR THE ABILITY TO DRIVE THE VEHICLE, ESPECIALLY AT HIGHWAY SPEEDS.  THIS PARTICULAR CAR HAS AN ENGINE WITH ONLY 60K MILES, SERVICED REGULARLY AND WITH THE LAST MAJOR SERVICE PERFORMED AT A VOLVO DEALER AT ABOUT 50K MILES. THE CAR HAS BEEN DRIVEN VERY LIGHTLY AND IT ONLY HAS MADE ABOUT 10K MILES IN ABOUT TWO YEARS.  HERE IS IN SUMMARY WHAT I FOUND ABOUT THIS:  -THE BEARING THAT IS FAILING IS NOT LUBRICATED (SO NOTHING TO DO WITH OIL IN THIS CASE), AND IT FAILS DUE TO THE FACT THAT WATER AND/OR HUMIDITY GETS TO IT, BY WASHING THE ENGINE(?) ' NEVER DID THAT ANYWAY - OR BY THE CAR JUST SITTING IN A LOT..  -THERE IS A VOLVO BULLETIN THAT DETAILS WHAT NEEDS TO BE DONE, INCLUDING DRILLING A WEEPING HOLE INTO THE ENGINE BLOCK TO DRAIN WATER; THIS SHOWS THAT THE PROBLEM IS ACKNOWLEDGED AND A FIX HAS BEEN PUT INTO PLACE; IT ALSO SHOWS THAT THERE IS SIGNIFICANT NUMBER OF VEHICLES OUT THERE THAT HAVE THE SAME ISSUE.  -THIS SEEMS TO BE A VERY COMMON PROBLEM WITH THIS TYPE OF ENGINE AND YEAR (2005 XC90, V8 ENGINE, ENGINE SERIES LESS THAN #6800) ' I HAVE POINTED OUT A FEW THREADS BELOW THAT MENTION THE SAME ISSUE.  GIVEN ALL THE REASONS ENUMERATED ABOVE, I AM ASKING FOR AN EVALUATION OF THIS ISSUE AND I REALLY FEEL VOLVO SHOULD RECOGNIZE THIS AS A DESIGN PROBLEM, ISSUE A RECALL AND STEP UP TO FIX THIS ISSUE.  HERE ARE SOME POINTERS TO DIFFERENT ARTICLES DISCUSSING THIS:  HTTP://FORUMS.SWEDESPEED.COM/ZEROTHREAD?ID=132172  HTTP://FORUMS.SWEDESPEED.COM/ZEROTHREAD?ID=123707  HTTP://FORUMS.SWEDESPEED.COM/ZEROTHREAD?ID=126698  HTTP://FORUMS.SWEDESPEED.COM/ZEROTHREAD?ID=123707  HTTP://WWW.V70XC.COM/FORUMS/SHOWTHREAD.PHP?P=104935. *TR",
        "vin": "YV1CZ852851"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/16/2010",
        "dateOfIncident": "02/14/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10310974,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE A 2005 VOLVO XC90 T6 WE HAD COMPLAINED TO VOLVO OF A SLIPPING TRANSMISSION. THEY SAID IT HAD NO PROBLEMS. NOW THE TRANSMISSION FAILED. WE ALMOST HAD AN ACCIDENT WITH OUR 3 SMALL CHILDREN. THESE CARS NEED TO BE INVESTIGATED. MANY HAVE EXPERIENCED PROBLEMS AND VOLVO IS JUST REPLACING THEM WITH THE SAME DEFECTIVE UNITS. *TR",
        "vin": "YV1CZ911551"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/15/2010",
        "dateOfIncident": "01/23/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10310444,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I WANT TO BRING TO YOUR ATTENTION THAT THERE SEEMS TO BE A PROBLEM WITH THE VOLVO XC90 2005 RACK AND PINION GOING BAD. I HAVE BEEN SEARCHING OVER THE INTERNET AND THERE ARE SO MANY PEOPLE THAT ARE HAVING THE SAME PROBLEM. THERE MUST BE AN INFERIOR WORKMANSHIP/COMPONENT, THAT IS CAUSING THIS PART TO BECOME DEFECTIVE FOR SO MANY CUSTOMERS. THIS PROBLEM IS SERIOUSLY DANGEROUS AS IT CAUSES THE VEHICLE TO DEVELOP SUDDEN STEERING PROBLEM CAUSING THE VEHICLE TO SHIFT STEERING UNCONTROLLABLY AS SOON AS THE BRAKES ARE APPLIES WHEN DRIVING OVER 30 MPH WHICH CAN RESULT IN ACCIDENT. THE TYPE PF SHIFT (PULL) TENDS TO BE EVEN MORE DANGEROUS WHEN DRIVER 60 MILES AN HOUR AND IT HAPPENS IN VERY SUDDEN AND UNEXPECTED WAY.  I HOPE THAT YOU TAKE THIS SERIOUSLY AND YOU ARRANGE FOR VOLVO TO COMPLETE A RECALL OR CONTACT ME ABOUT THIS  AS SOON AS POSSIBLE. *TR  THE CONSUMER STATED THERE WAS A LOT OF STIFFNESS WHEN DRIVING ON THE HIGHWAY.  THE PROBLEM WORSENED AFTER A FEW WEEKS AND THE VEHICLE BECAME TOO DANGEROUS TO DRIVE.  THE CONSUMER TOOK THE VEHICLE TO A LOCAL MECHANIC AND IT WAS DETERMINED THAT THE TIE ROD END WAS FAULTY.  THE CONSUMER CALLED A LOCAL DEALERSHIP AND WAS INFORMED THERE WAS A RECALL ON THE TIE ROD ENDS,  BUT THEY WERE REPLACED BACK IN 2006. THE CONSUMER STATED THE REPLACEMENTS PARTS WERE NOT UP TO STANDARDS. THE LOCAL DEALER DID NOT WANT TO REPLACE THE DEFECTIVE PARTS, SO THE LOCAL MECHANIC SHOP REPLACED THE TIE RODS AT A COST OF $401.83. UPDATED 06/16/10. *JB",
        "vin": "YV1CZ911751"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/19/2010",
        "dateOfIncident": "01/08/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10300323,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 VOLVO XC90. WHILE DRIVING 45 MPH, HE HEARD A LOUD NOISE. HE SHUT THE ENGINE OFF AND HAD THE VEHICLE   TOWED TO A MECHANIC. HE WAS TOLD BY THE MECHANIC THAT THE REAR BEARING NEEDED TO BE REPLACED BECAUSE THERE WAS NO OIL GETTING TO THE BEARING (BY DESIGN). HE CALLED THE MANUFACTURER AND WAS INFORMED THAT THEY COULD NOT ASSIST HIM. THE VEHICLE WAS BEING REPAIRED WHEN THE COMPLAINT WAS FILED. THE CURRENT MILEAGE WAS 76,431. THE FAILURE MILEAGE WAS APPROXIMATELY 76,380.",
        "vin": "YV1CZ852551"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/16/2010",
        "dateOfIncident": "01/13/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10299965,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM THE OWNER OF A 2005 XC90 VOLVO WITH 79,000 MILES ON IT AND THE TRANSMISSION HAS FAILED AND NEEDS TO BE REPLACED. MY CAR BROKE DOWN ON A BUSY INTERSTATE AND I BARELY EVADED A CATASTROPHIC ACCIDENT WHEN THE TRANS FAILED AND MY VEHICLE CAME TO AN ABRUPT STOP (ENDANGERING THE LIFE OF MY FAMILY OF 7 TRAVELING IN THE CAR). THIS COMMON PROBLEM IN THE 2005 XC90'S  AUTOMATIC TRANSMISSIONS ARE WELL DOCUMENTED THROUGHOUT THE INTERNET BY VOLVO OWNERS.  ADDITIONALLY, SHREDDED METAL REACHED THE RADIATOR AND OTHER COOLANT DEPARTMENTS THAT ALSO NOW NEED TO BE REPLACED. THE TOTAL COST OF REPAIRING THE DAMAGE CAUSED IS $6,700.00. I BOUGHT THIS CAR TO PROVIDE MY FAMILY A SECURE VEHICLE WHILE I AM DEPLOYED.  I EXPECTED THE VEHICLE TO LAST AT LEAST TO 100,000 MILES. THE CAR IS ONLY 4 YEARS OLD AND ALREADY NEEDS THE TRANSMISSION REPLACED.. I CONTACTED VOLVO AND IT IS TAKING THEM A LONG TIME TO GET BACK TO ME. MY CAR IS SITTING AT A REPAIR SHOP WHILE I WAIT FOR A PHONE CALL TO SEE IF THEY WILL HELP COVER THE COSTS OR NOT. A VOLVO TECHNICAL SUPPORT REPRESENTATIVE ADMITTED TO ME THAT THEY ARE AWARE THAT THIS IS A COMMON PROBLEM WITH THE 2005 MODEL BUT ARE NOT SAYING THAT THEY WOULD COVER THE EXPENSES OR INITIATE A RECALL, RATHER SHE SAID THAT THEY WOULD \"SEE\" IF THEY COULD ASSIST ME IN SOME WAY.  AGAIN, I HAVE NOT HEARD FROM THEM AND CONTINUE TO CALL BUT HAVE NOT MADE ANY PROGRESS WITH THEM. AFTER DOING SOME RESEARCH IT IS OBVIOUS THAT MANY VOLVO OWNERS OF THE XC90 2005 ARE HAVING THE SAME PROBLEM AND THIS NEEDS TO BE ADDRESSED BY THE NHTSA SO THAT VOLVO IS HELD ACCOUNTABLE FOR A FAULTY PRODUCT THAT HAS BEEN CLEARLY DOCUMENTED. THERE ARE THOUSANDS OF POSTS ON VARIOUS FORUMS DETAILING SIMILAR EXPERIENCES. VOLVO HAS DONE NOTHING TO ADDRESS THIS IRREFUTABLE PROBLEM. WHAT IS THE NHTSA DOING TO FORCE VOLVO TO INITIATE A RECALL? *TR",
        "vin": "YV1CZ911551"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/11/2010",
        "dateOfIncident": "01/01/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10298981,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE RECENTLY HAD TRANSMISSION FAILURE ON 2005 VOLVO XC90 T6 AWD AT 59,700 MILES. WE ARE 2ND OWNER AND BOUGHT 12/31/09 WITH 59,074 AND CARFAX CHECK WAS STELLAR. THE VEHICLE IS JUST 9,700 MILES OUT OF WARRANTY.  WE HAVE CONTACTED VOLVO USA CONCERNING 'GOODWILL POLICY' AND VEHICLE IS AT TULSA DEALER WHO ARE ALSO WORKING FROM THEIR END. *TR",
        "vin": "YV1CZ911651"
    },
    {
        "components": "POWER TRAIN,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "12/29/2009",
        "dateOfIncident": "12/15/2009",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10297370,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Volvo Trucks North America",
                "productMake": "VOLVO",
                "productModel": "SEAT BELT ASSEMBLY",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "WE OWN A 2005 VOLVO XC90 AND IT HAS 54K MILES ON IT. WE HEARD A WHINING SOUND FROM THE REAR AND TOOK IT TO THE DEALER AND THEY SAID THE REAR HUB BEARINGS NEED TO BE CHANGED. WE WERE NOT CONVINCED AND TOOK IT TO OUR AUTO MECHANIC WHO WORKS ON OUR AVALON, HE LOOKED AT IT AND AFTER SPENDING 5HRS ON IT CAME TO THE CONCLUSION THAT IT WAS THE REAR DIFFERENTIAL. WE WENT BACK TO THE VOLVO DEALER AND ASKED HIM TO CHECK AGAIN AND SAID IT MAY BE THE TRANSMISSION. THEY CAME BACK AND SAID YES IT IS THE REAR DIFFERENTIAL AND IT NEEDS TO BE REPLACED. THE PRICE TAG WAS FOR $5200. THIS SEEMS TO BE THE PROBLEM WITH ALL THE XC90'S. WE ARE AFRAID TO DRIVE THIS CAR ON THE HIGHWAY NEVER KNOWING WHEN OUR TRANSMISSION WILL GIVE WAY. *TR",
        "vin": "YV1CZ911951"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/28/2009",
        "dateOfIncident": "12/13/2009",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10297250,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM WRITING THIS LETTER TO NOTIFY THE NHTSA OF A TOTAL SYSTEM FAILURE OF MY 2005 VOLVO XC90 THAT I BELIEVE WAS DUE TO A MANUFACTURER DEFECT WHICH SHOULD BE PART OF A RECALL.   AFTER DRIVING ON THE INTERSTATE (IN EXTREME RAINY CONDITIONS) FOR APPROX 2 HRS, THE CAR DISPLAYED A WARNING MESSAGE THAT READ ?ANTI-SKID DISABLED?  AND THEN ?BRAKE SYSTEM FAILURE? AT WHICH  POINT WE EXPERIENCED TOTAL BRAKE FAILURE.  W/IN A MINUTE OF THIS HAPPENING, THE ENTIRE CONTROL PANEL ILLUMINATED THEN WENT BLANK AND ALL THE ELECTRONIC COMPONENTS IN THE CAR TURNED OFF, INCLUDING THE WINDSHIELD WIPERS.  FORTUNATELY WE WERE ABLE TO MANEUVER THE CAR SAFELY TO SIDE OF THE ROAD (AFTER THE BRAKES REENGAGED)T.  THE CAR WAS TOWED TO FREEDOM VOLVO IN VA BEACH, VA FOR INSPECTION AND REPAIR.  UPON EXPLAINING THE INCIDENT TO THE SERVICE MGR, WE WERE INFORMED THAT THEY WERE WELL AWARE OF THE PROBLEM WE WERE DESCRIBING AS THEY HAD SEEN ?A RASH? OF THIS EXACT ISSUE A FEW YEARS BACK.  I SUSPECT THAT MY CAR, WITH RELATIVELY LOW MILEAGE FOR A 2005 (32,000), WAS JUST CATCHING UP WITH THE OTHER 2005 XC90?S THAT HAD ALREADY EXPERIENCED THE PROBLEM.    THE CAR WAS REPAIRED WITHOUT DELAY AND READY FOR PICK-UP WITHIN TWO DAYS.  WE WERE TOLD THE PROBLEM STEMMED FROM WATER LEAKING IN ?OVER TIME? THROUGH THE ENGINE BAY HARNESS WHICH IN EFFECT CAUSED THE CENTRAL ELECTRONIC MODULE (CEM) TO SHORT OUT.   AFTER ASKING THE SERVICE TECHNICIAN WHY THIS PROBLEM WAS NOT IDENTIFIED DURING THE RECOMMENDED MAINTENANCE CHECK-UPS (WHICH WAS COMPLETED ON OUR CAR JUST A FEW MONTHS PRIOR TO THIS INCIDENT), WE WERE INFORMED THAT THIS IS NOT SOMETHING THAT IS INSPECTED.  HE DID GO ON TO STATE THAT HE HAS NOT SEEN ANY REPEAT PROBLEMS FOR THE VEHICLES THAT HE HAD COMPLETED THIS EXACT REPAIR.  HE ALSO NOTED THAT THE ENGINE BAY HARNESS FOR THE XC90 WAS REDESIGNED AFTER '06.  I REQUEST THAT THIS PROBLEM WITH THE ENGINE BAY HARNESS ON OLDER MODEL VOLVO XC90 BE INVESTIGATED. *TR",
        "vin": "YV1CZ592051"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/09/2009",
        "dateOfIncident": "11/03/2009",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10295099,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 VOLVO XC90. THE BEARINGS THAT WERE INSTALLED ARE STEEL.  THE  BEARINGS HAVE DETERIORATED  BECAUSE THEY ARE NOT GREASED.. THE VEHICLE WAS TAKEN TO THE DEALER FOR INSPECTION. HE WAS ADVISED  THAT THE ENGINE NEEDED TO BE REPLACED AT AN EXPENSE OF $16,000.   THE MANUFACTURER HAS NOT BEEN CONTACTED. THE FAILURE MILEAGE WAS 67,000.",
        "vin": "YV1CZ852851"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/09/2009",
        "dateOfIncident": "12/08/2009",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10295111,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "YESTERDAY, OUR 2005 VOLVO XC90 STALLED COMPLETELY AT AROUND 84,000 MILES AND WAS TOWED FOR SERVICE. A DIAGNOSIS DETERMINED THAT THE RADIATOR LEAKED INTO THE TRANSMISSION CAUSING A MECHANICAL FAILURE. THIS WILL LIKELY REQUIRE THE REPLACEMENT OF THE TRANSMISSION AND POSSIBLY THE RADIATOR. OUR EXTENDED WARRANTY WILL COVER THE COST OF MAJOR COMPONENTS SUCH AS THE TRANSMISSION AND RADIATOR BUT WILL NOT COVER THE NEW HOSES AND OTHER REQUIRED ACCESSORIES. THE NHTSA NEEDS TO ACT ON THIS SOON. AS A BRIEF SEARCH OF THE INTERNET WILL SHOW, THESE PROBLEMS ARE FAR TOO COMMON TO BE CONSIDERED \"NORMAL WEAR AND TEAR.\" MOST FAILURES ARE OCCURRING AT AROUND 4 YEARS OF AGE AND BETWEEN 50,000-88,000 MILES. THE FREQUENCY OF FAILURES IN THIS MAKE AND MODEL AT THE SAME AGE/MILEAGE ARE CLEARLY A RESULT OF A DESIGN AND/OR MANUFACTURING DEFECT. A MANDATORY SAFETY RECALL SEEMS TO BE THE ONLY LOGICAL RESOLUTION TO THIS DEFECT AND WOULD PROTECT THE SAFETY OF TENS OF THOUSANDS OF US DRIVERS WHO HAVE YET TO EXPERIENCE A TRANSMISSION FAILURE IN THIS MAKE AND MODEL. *TR",
        "vin": "YV1CZ911751"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/04/2009",
        "dateOfIncident": "11/25/2009",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10294466,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "URGENT SERVICE TRANSMISSION LIGHT CAME ON 2005 VOLVO XC90 T6 WITH 80,000 KM. FLUSH AND NEW SOFTWARE TRIED TO FIX PROBLEM. IT DIDN'T SOLVE ANYTHING. ONE MONTH OR TWO LATER THE GEARS STARTING SLIPPING FROM STOPPED POSITION AND WHILE DRIVING. LIGHT CAME ON AGAIN. A LARGE AMOUNT OF SLUDGE AND FILING WERE FOUND IN THE PAN. HAD TO HAVE TO A COMPLETE REBUILD OF THE TRANSMISSION. *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/19/2009",
        "dateOfIncident": "11/13/2009",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10292960,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM THE OWNER OF A 2005 XC90 VOLVO.  THIS CAR ONLY HAS 69,000 MILES ON IT AND THE TRANSMISSION HAS FAILED AND NEEDS TO BE REPLACED. MY CAR BROKE DOWN ON A SHORT ROAD TRIP IN THE MIDDLE OF NO WHERE ON TOP OF A SNOWY MOUNTAIN. DUE TO THE POOR QUALITY OF TRANSMISSION COUPLED WITH THE POWERFUL ENGINE THE TRANSMISSION SHREDDED METAL THAT REACHED THE RADIATOR AND OTHER COOLANT DEPARTMENTS THAT ALSO NOW NEED TO BE REPLACED.  THE TOTAL COST OF REPAIRING THE DAMAGE CAUSED IS $6,700.00.  I BOUGHT THIS CAR IN HOPES TO HAVE A SECURE VEHICLE TO DRIVE MY KIDS AROUND WHILE MY HUSBAND IS DEPLOYED AND EXPECTED TO IT LAST AT LEAST TO 100,000 MILES.  THE CAR IS ONLY 4 YEARS OLD AND SHOULD NOT BE NEEDING SUCH EXTENSIVE REPAIRS.  I CONTACTED VOLVO AND IT IS TAKING THEM A LONG TIME TO GET BACK TO ME.  MY CAR IS SITTING AT A REPAIR SHOP WHILE I WAIT FOR A PHONE CALL TO SEE IF THEY WILL HELP COVER THE COSTS OR NOT.  A VOLVO TECHNICAL SUPPORT REPRESENTATIVE ADMITTED TO ME THAT THEY ARE AWARE THAT THIS IS A COMMON PROBLEM WITH THIS YEAR AND MAKE BUT WERE NOT SAYING THAT THEY WOULD COVER THE EXPENSES, RATHER SHE SAID THAT THEY WOULD SEE IF THEY COULD ASSIST ME IN SOME WAY.  I AM DISSATISFIED WITH THEIR LACK OF RESPONSE AND UNWILLINGNESS TO HELP CORRECT THEIR MISTAKE.  AFTER DOING SOME RESEARCH IT IS OBVIOUS THAT MANY VOLVO OWNERS OF THE CX90 2005 ARE HAVING THE SAME PROBLEM AND THIS NEEDS TO BE ADDRESSED AND VOLVO NEEDS TO BE HELP ACCOUNTABLE FOR THEIR FAULTY PRODUCT, THEY NEED TO SELL CARS THAT ARE SAFE FOR FAMILIES TO DRIVE.  *TR",
        "vin": "YV1CZ911051"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/30/2009",
        "dateOfIncident": "09/28/2009",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10285742,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD TO WEAR WIDE WIDTH SHOES DUE TO MY TOE BEING PINCHED. I WAS DRIVING A 2005 VOLVO XC90. A COUPLE OF TIMES, INSTEAD OF APPLYING THE BRAKE, THE SHOE WAS ON THE ACCELERATOR. THE GAP BETWEEN THE ACCELEROMETER AND BRAKE IS VERY LITTLE. WHEN I WAS DRIVING WITH A NON-WIDE WIDTH SHOE, I DID NOT NOTICE THIS PROBLEM. THIS HAPPENS ALMOST ALL THE TIME WEARING THIS ONE PARTICULAR SHOE (4E WIDE). *TR",
        "vin": "YV1CY592751"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/09/2009",
        "dateOfIncident": "04/02/2009",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10279847,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "ADD ME TO THE LIST OF XC90 T6 OWNERS THAT HAD TO REPLACE A DEFECTIVE TRANSMISSION.  I BARELY EVADED A CATASTROPHIC ACCIDENT WHEN THE TRANS FAILED AT A BUSY INTERSECTION.  THERE ARE THOUSANDS OF POSTS ON VARIOUS FORUMS DETAILING SIMILAR EXPERIENCES.  VOLVO HAS DONE NOTHING TO ADDRESS THIS IRREFUTABLE PROBLEM.  WHAT IS THE NHTSA DOING TO POTENTIALLY SAVE LIVES?  LIKE SO MANY OTHERS, I HAVE BEEN QUIET HOPING THAT OTHERS SPEAK UP ON MY BEHALF.  THERE ARE CLASS ACTION SUITS BEING INITIATED AROUND THE COUNTRY.  ENOUGH IS ENOUGH.  EITHER VOLVO ISSUE A RECALL AND CORRECT THE ISSUE OR THESE VEHICLES SHOULD BE REPLACED.  I WAITED TWO MONTHS FOR THE LAST TRANSMISSION THAT WAS ON BACK-ORDER.  HMMM, I WONDER WHY IT IS ON BACK-ORDER?  ONE DOESN'T NEED TO BE A GENIUS TO FIGURE THAT OUT.  I AM 3K INTO THE NEW TRANS AND ALREADY EXPERIENCED A SLIPPED GEAR SHIFT.  I SENSE THAT THERE AREN'T MANY SURPRISED BY THIS.  IT IS SAD TO SAY, BUT IT WILL LIKELY TAKE SOME LOST LIVES THAT ARE ATTRIBUTED TO THE FAULTY TRANSMISSION BEFORE SOMETHING IS DONE.  I DIDN'T BUY A VOLVO TO WORRY ABOUT MY FAMILY'S WELFARE EVERYTIME THEY DRIVE THIS VEHICLE.  PLEASE HELP! *TR",
        "vin": "YV1CZ911051"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/29/2009",
        "dateOfIncident": "07/24/2009",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10278646,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2005 VOLVO XC90 T6 WITH 71000 MILES ON IT.  ON 7/23/09 THE TRANSMISSION BEGAN TO \"SLIP\" AND I TOOK IT TO THE VOLVO DEALERSHIP ON 7/24/09 FOR THEM TO DIAGNOSE THE PROBLEM.  THE TRANSMISSION ON THIS 4 YEAR OLD VEHICLE NEED TO BE REPLACED AT A COST OF $5,300.00.  VOLVO HAS BEEN AWARE OF THE PROBLEM AND SO FAR HAS NOT OWNED UP TO RESPONSIBILITY.  THE TRANSMISSION SLIPS IN LOW GEARS AND UPON ACCELERATION.  IT IS A SAFETY ISSUES BECAUSE IF THE TRANSMISSION SLIPS WHILE MERGING ONTO THE HIGHWAY IT COULD CAUSE AN ACCIDENT OR AT ANY OTHER TIME FOR THAT MATTER.  IT IS A VERY COMMON PROBLEM AND VOLVO SHOULD MAKE THIS A RECALL TO PROTECT THE SAFETY OF THEIR CUSTOMERS BUT THUS FAR THERE HAS BEEN NO RECALL.  THE TRANSMISSION IS ON BACK ORDER FOR 1 - 2 MONTHS WHICH IS COMPLETELY UNACCEPTABLE FROM ANY CONSUMER OR SAFETY STANDPOINT. *TR",
        "vin": "YV1CZ911051"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/24/2009",
        "dateOfIncident": "07/18/2009",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10278245,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 VOLVO XC-90, TRANSMISSION FAILURE. \"TRANSMISSION SERVICE URGENT' LIGHT CAME ON AND THE TRANSMISSION BEGAN SLIPPING AT 131,997 MILES; IN JULY 2009. THIS WAS A NEW TRANSMISSION, REPLACED BY THE DEALER AT 76,994 MILES IN JANUARY 2008. THE VEHICLE HAS ONLY BEEN SERVICED BY THAT DEALERSHIP. THE NEW TRANSMISSION LASTED LESS THAN 18 MONTHS AND LESS THAN 54,000 MILES AT A COST OF OVER $5,000.00.  THE REPLACEMENT TRANSMISSION WAS EITHER DEFECTIVE OR NOT NEW, WHICH IS WHAT WAS PROCLAIMED. *TR",
        "vin": "YV1CZ911251"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/23/2009",
        "dateOfIncident": "07/23/2009",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10278145,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION ON A 2005 VOLVO XC90 FAILED WHILE DRIVING ON I-95 HEADING ONTO RI RT 37.  THIRTY-FIVE MILES PRIOR TO THIS FAILURE VOLVO DEALER UPGRADED THE SOFTWARE TO REMEDY THE \"TRANSMISSION SERVICE URGENT\" PROBLEM AT A COST OF $200.  THIS SEEMS TO BE A COMMON AND EXTREMELY COSTLY PROBLEM AMONG XC90S AND MUST BE REMEDIED BY VOLVO. *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/14/2009",
        "dateOfIncident": "06/02/2009",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10273725,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2005 VOLVO XC90 T6 THE TRANSMISSION JUST FAILED AT ONLY 75000 MILES. MY SON BOUGHT THE SAME CAR AT THE SAME TIME AS ME BRAND NEW. HIS TRANSMISSION HAS BEEN REPLACED TWICE. *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/31/2009",
        "dateOfIncident": "06/19/2008",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10263722,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION FAILURE AT LESS THAN 65000 MILES. ORIGINALLY REPORTED AT 54756 MILES. OEM WARRANTY EXPIRED AT 50,000 MILES. OWN EXTENDED WARRANTY BUT SO FAR DEALER HAS HAD VEHICLE 3 TIMES OVER COURSE OF LAST 9 MONTHS AND UNABLE TO GET EXTENDED WARRANTY COMPANY TO REPLACE TRANSMISSION. *TR",
        "vin": "YV1CZ911951"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/27/2009",
        "dateOfIncident": "01/22/2009",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10260199,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "COMING TO A STOP SIGN, ON A RURAL ROAD, FUNNY NOISE, THEN URGENT TRANSMISSION LIGHT CAME ON.  DIDN'T HEAR ANYTHING, TRIED TO MOVE VEHICLE, GO UP A HILL AND IT SEEM AS IF I LOST FIRST AND SECOND GEAR.  TOWED TO SHOP, THEY GOT THE LIGHT TO COME OFF, THEY BELIEVE IT NEEDS A TRANSMISSION BUT WON'T DO ANYTHING.  I'M TRYING TO DRIVE IT OCCASIONALLY AND I'VE ALMOST GOTTEN STUCK TWICE.  TRANSMISSION IS SLIPPING BADLY AND LOCKING INTERMITTENTLY. *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/12/2009",
        "dateOfIncident": "01/20/2009",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10258423,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE THE ILL FATED XC90 T6...LIKE CLOCKWORK AT 53000 MILES THE DREADED TRANSMISSION SERVICE URGENT LIGHT COMES ON....NOW I AM SUPPOSED TO FORK OVER 7000 BUCKS FOR A COMPLETELY DEFECTIVE TRANSMISSION! *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,TIRES,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/05/2009",
        "dateOfIncident": "02/04/2008",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10257656,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY 2005 VOLVO XC90 (54,414 MILES) ON A BUSY CALIFORNIA FREEWAY (THE 405), THE ENGINE STOPPED SUDDENLY WITH NO WARNING OR WARNING LIGHT.  FORTUNATELY, I WAS ABLE TO MAKE IT OVER TO THE SIDE OF THE ROAD TO CALL FOR A TOW WITHOUT INJURY (ALTHOUGH I WAS ALMOST REAR ENDED SINCE THE FAILURE WAS SO SUDDEN AND WITHOUT WARNING) AND HAD IT TOWED TO A VOLVO DEALER IN TORRANCE, CA.  IT IS A TRANSMISSION PROBLEM.  SINCE THEN, WE HAVE FOUND HUNDREDS OF OTHER CONSUMERS WHO HAVE HAD THE SAME PROBLEM WITH THEIR XC90 VOLVOS TOO.  VOLVO HAS NOT RECALLED OR PROVIDED ANY NOTICE TO CONSUMERS OF THE PROBLEM.  VOLVO HAS PROVIDED REPLACEMENT TRADES AND CASH TO SOME CONSUMERS WHO COMPLAINED, BUT NO OVERALL NOTICE TO CONSUMERS.  WE DIDN'T FIND OUT UNTIL IT HAPPENED TO US AND STARTED TO RESEARCH.  ADDITIONALLY, THE WEEK BEFORE, THE FRONT LEFT TIRE BLEW OUT WHEN MY WIFE WAS DRIVING AND I WAS OUT OF TOWN. UNEVEN TIRE WEAR, UNEVEN WEAR EVEN WITH CONSTANT REALIGNMENT, IS ANOTHER COMMON ISSUE WITH THE 18\" TIRES ON VOLVO.  THEY KNOW OF THE ISSUE, BUT NOT HOW TO FIX IT.  VOLVO DID AT LEAST SEND A TOW TRUCK TO PUT THE SPARE ON AND MY WIFE WAS NOT INJURED (FORTUNATELY).  WE DIDN'T KNOW OF THE SAFELY FLAWS IN THE XC90 WHICH WAS PURCHASED BECAUSE OF VOLVO'S MARKETING CAMPAIGN OF \"SAFETY\" AND \"VOLVO FOR LIFE\" CAMPAIGN.  VOLVO IS ADVERTISING FALSELY AND THE XC90 HAS SAFETY ISSUES.  PLEASE HELP PROTECT OTHERS! *TR",
        "vin": "YV1CZ911451"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/09/2009",
        "dateOfIncident": "12/18/2008",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10254441,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRANSMISSION IN MY 2005 VOLVO XC 90, FAILED IN TRAFFIC ON DEC. 18TH.  AFTER DOING SOME RESEARCH THIS IS A VERY COMMON ISSUE.  THE CAR ONLY HAD 63,200 MILES ON IT AND HAD BEEN REGULARLY SERVICED.  THE LINKS BELOW, SHOW THAT THIS IS A COMMON ISSUE WHICH VOLVO IS AWARE OF BUT FAILING TO MAKE PUBLIC.    HTTP://TOWNHALL-TALK.EDMUNDS.COM/DIRECT/VIEW/.F18A651/132  HTTP://WWW.CONSUMERAFFAIRS.COM/AUTOMOTIVE/VOLVO.HTM  HTTP://TOWNHALL-TALK.EDMUNDS.COM/DIRECT/VIEW/.EF21566/1030    I BELIEVE THERE SHOULD BE A RECALL, AS PEOPLE ARE HAVING TO PAY $3000 - $5000, TO REPLACE A DEFECTIVE PART.  IF YOU CHECK THE LINKS, SOME USERS HAVE HAD TO REPLACE THE TRANSMISSION MULTIPLE TIMES. *TR",
        "vin": "YV1CZ911151"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/06/2008",
        "dateOfIncident": "10/05/2008",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10244460,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD MY 2005 T6 XC90 FOR 5 MONTHS AND UNTIL TODAY HAVE ONLY DEALT WITH SMALL ISSUES.  TODAY I WAS ON THE FREEWAY AND LOST TRANSMISSION POWER AT 65 MPH AND THE EVENT COULD HAVE BEEN CATASTROPHIC, HOWEVER I WAS LUCKY ENOUGH TO REGAIN TRANSMISSION CONTROL AND COULD GET TO AN EXIT AND PARK MY VEHICLE IN A SAFE PLACE TO AWAIT A TOW.       I HAD NO IDEA THAT THE T6 WAS KNOWN FOR THIS TYPE OF FAILURE WITH THE TRANSMISSION OR I WOULD NEVER HAVE BOUGHT IT.  I HAVE TWO LITTLE GIRLS AND THEIR SAFETY WAS THE KEY ELEMENT IN MY PURCHASING THIS VEHICLE.  ALL THINGS CONSIDERED, TODAY COULD HAVE BEEN MUCH WORSE BUT ACCORDING TO MANY ACCOUNTS THIS ISN'T THE FIRST T6 TO HAVE TRANNY PROBLEMS AND IT WON'T BE THE LAST.  UNTIL VOLVO IS MADE TO ACKNOWLEDGE THAT THEIR DESIGN WAS FAULTY OTHER FAMILIES' LIVES ARE AT STAKE.    I KNOW MY XC90 WILL NEED A NEW TRANSMISSION, AND THE COST IS GOING TO BE UPWARDS OF $6,000. AND FOR A \"VOLVO FOR LIFE\" THIS IS UNACCEPTABLE!!  *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/24/2008",
        "dateOfIncident": "09/20/2008",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10243300,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 VOLVO XC90.  THE CONTACT NOTICED THAT THE SPACE BETWEEN THE ACCELERATOR AND BRAKE PEDALS WAS ONLY 4 1/2 INCHES WIDE.  THE WIDTH OF HIS FOOT IS 5 INCHES WIDE.  THERE IS AN INSUFFICIENT AMOUNT OF SPACE TO ADEQUATELY APPLY PRESSURE TO THE ACCELERATOR PEDAL WITHOUT ALSO DEPRESSING THE BRAKE PEDAL.  THE DEALER STATED THAT THEY WERE AWARE OF THE FAILURE, BUT HAVE NOT MADE ANY EFFORTS TO CORRECT THE DESIGN.  THE VIN WAS UNKNOWN.  THE FAILURE AND CURRENT MILEAGES WERE 54,000.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/18/2008",
        "dateOfIncident": "07/15/2008",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10234817,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY 2005 VOLVO XC90 NOTICED THE TRANSMISSION SLIPPING.  THE SLIPPING STARTED IN THE JUST TWO AFTER PURCHASED AND IT WAS TAKEN TO THE DEALERSHIP AT THE FACTORY SCHEDULE MAINTENANCE INTERVALS.  ON JULY 15, 2008 WHILE MY WIFE WAS DRIVING THE VEHICLE WITH MY TWO CHILDREN THAT TRANSMISSION SLIPPED AND GOT STUCK IS A GEAR THAT PREVENTED MY WIFE GOING MORE THAN TWENTY MILES PER HOUR ON A VERY BUSY STREET.  THE VEHICLE HAS 72,000 MILES ON IT.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/14/2008",
        "dateOfIncident": "07/02/2008",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10234240,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2005 VOLVO XC90 T6.  THE TRANSMISSION FAILED AT 60,000 MILES AND WILL COST $4600+ TO REPAIR.  THE TRANSMISSION SHOULD LAST LONGER THAN 60,000 MILES UNLESS THERE IS A DEFECT IN DESIGN.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/20/2008",
        "dateOfIncident": "06/17/2008",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10231691,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I CURRENTLY OWN A VOLVO XC90 T-6 2005.  THE TRANSMISSION BEGAN TO SLIP IN FIRST GEAR, I HAD A VOLVO DEALERSHIP TAKE A LOOK AT IT ABOUT 6,000 MILES AGO.  NOW, THE URGENT SERVICE LIGHT CAME ON AND VOLVO STATES THAT THE TRANSMISSION NEEDS TO BE REPLACED.  MANY OTHERS HAVE EXPERIENCED THESE SAME ISSUES, SO WHAT IS VOLVO NOT FIXING THESE ISSUES.  I WILL NEVER, NEVER PURCHASE A VOLVO AGAIN.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/10/2008",
        "dateOfIncident": "12/10/2007",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10220743,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ALL WHEEL DRIVE FEATURE WENT OUT HENCE LEAVING THE DRIVE TO TWO WHEEL DRIVE ;  THE TWO WHEEL DRIVE IS VERY UNBALANCE IN SNOW / ICE  AS OPPOSE TO A NORMAL FRONT WHEEL DRIVE VEHICLE; ENDED UP ON THE SIDE OF THE ROAD AVOIDING ACCIDENT; CONTACTED THE MANUFACTURER AND THEY CLAIM THIS IS NOT A SAFETY ISSUE WHICH I DISAGREE;  CURRENTLY DO NOT DRIVE THE VEHICLE IN SNOW / ICE DUE TO UNSAFE DRIVING CONDITION.  CONTACTED DIFFERENT VOLVO DEALERS AND CLAIM A HIGH FAILURE RATE OF THIS FEATURE.  VOLVO REQUESTED $3,000 TO FIX ISSUE;  HAVE NOT AGREED TO THESE COSTS YET.  *TR",
        "vin": "YV1CZ592451"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/17/2008",
        "dateOfIncident": "02/12/2008",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10218274,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR STALLED TWICE AT 65MPH WHILE ON FREEWAY. FIRST INCIDENT WAS 24NOV06, 2ND INCIDENT WAS 12 FEB 07. ON FIRST INCIDENT ALL CAR FUNCTIONS COMPLETELY DIED AND WENT INTO \"LIMP MODE\" AFTER SWERVING TO STOP, AND WAS TOWED TO BELLINGHAM WA (KING VOLVO) DEALER FOR \"SOFTWARE UPGRADE ON FUEL PUMP\".  ON 2ND INCIDENT CAR WENT INTO \"REDUCED ENGINE PERFORMANCE\" AFTER RESTART. I DROVE THE CAR HOME 350MILES ALTHOUGH VOLVO SUGGESTED TOWING.  I JUST TRADED THE CAR IN TODAY ON AN ACURA AS VOLVO WASN'T INTERESTED IN HELPING ME BEYOND A $3K INCENTIVE TOWARDS A NEW VOLVO.  *TR",
        "vin": "YV1CZ911451"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/26/2008",
        "dateOfIncident": "01/06/2008",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10216138,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "ANGLE IRON FAILED IN VOLVO XC90.  *TR",
        "vin": ""
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "01/22/2008",
        "dateOfIncident": "11/01/2007",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10215616,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER'S DOOR WILL NOT LATCH PROPERLY.  MUST RECYCLE THE LOCK (LOCK THEN UNLOCK, SOMETIMES MORE THAN ONCE) IN ORDER TO GET THE DOOR TO LATCH SHUT.  *TR",
        "vin": "YV1CY592651"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/21/2008",
        "dateOfIncident": "01/11/2008",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10215546,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE FREEWAY, THE INSTRUMENT PANEL WENT DAK, SIGNALS STOPPED WORKING, STEREO AND OTHER ELECTRICAL DEVICES QUIT WORKING.  THE CAR STILL RAN.  THE DEALER HAS BEEN UNABLE TO DETECT AND FIX THE PROBLEMS AFTER ONE WEEK AND DOES NOT KNOW WHEN AND STATES THAT THE PROBLEM IS IN THE CENTRAL COMPUTER.  ON THREE OTHER OCCASION THIS CAR HAS BEEN TO VOLVE DEALER FOR COMPUTER SYSTEM UPGRADE; ONCE FOR IDLING ERRATICALLY, ONCE FOR PASSENGER SIDE WINDOW NOT STOPPING WHEN IT REACHED MAXIMUM CLOSURE HEIGHT AND ONCE FOR STEREO SYSTEM NOT EJECTING CDS.  *TR",
        "vin": "YV1CZ592351"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/08/2008",
        "dateOfIncident": "12/02/2007",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10214202,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION WENT OUT AT 62K MILES AND HAD TO BE REPLACED.  CHECKING ON EDMUNDS WEBSITE, THIS APPEARS TO BE A VERY COMMON PROBLEM WITH THIS VEHICLE.  *TR",
        "vin": "YV1CZ911X51"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/18/2007",
        "dateOfIncident": "12/11/2007",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10212179,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEATER PIPES THAT GO THROUGH THE FIREWALL HAVE CORRODED IN LESS THAN 2 YEARS AND NORTH POINT VOLVO WANTS A $1,000.00 TO TAKE OF THE DASH AND REPLACE THIS PART ON THE HEATER WHICH IN AND OF ITSELF IS ONLY A $40.00 PART.  THIS PIPE SHOULD NOT BE DEFECTIVE ON A CAR THAT'S LESS THAN TWO YEARS OLD.  POOR QUALITY!!!!!!!!!! *TR",
        "vin": "YV1CY592151"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/29/2007",
        "dateOfIncident": "10/27/2007",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10207336,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 VOLVO XC90.  THE CONTACT NOTICED A BURNING SMELL INSIDE THE PASSENGER COMPARTMENT.  THE VEHICLE WOULD NOT START AND WAS TOWED TO THE REPAIR SHOP.  THE MECHANIC STATED THAT THE JACK CRANK HANDLE CAUSED THE FAILURE.  THE CONTACT WAS UNSURE IF THE VEHICLE WAS INCLUDED IN NHTSA CAMPAIGN ID NUMBER 07V221000 (ELECTRICAL SYSTEM:BATTERY:CABLES).  THE CURRENT AND FAILURE MILEAGES WERE 25,000.",
        "vin": "YV1CY592151"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/28/2007",
        "dateOfIncident": "02/28/2007",
        "fire": true,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10186341,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* - THE CONTACT OWNS A  2005 VOLVO X90.  WHILE DRIVING 10 MPH SMOKE   CAME  FROM UNDER THE HOOD.  THERE WERE NO WARNING INDICATORS.    THE VEHICLE WAS PULLED OVER, AND THE FIRE WAS EXTINGUISHED BY THE FIRE DEPARTMENT.  THE CAUSE OF THE FIRE WAS UNDETERMINED.  THE FAILURE MILEAGE WAS 23,000.  THERE WERE NO INJURIES. THE VEHICLE WAS DESTROYED.  A FIRE REPORT FILED, AND THE CONTACT HAS PICTURES. *AK",
        "vin": "YV1CZ592751"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/25/2007",
        "dateOfIncident": "03/21/2007",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10186118,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE WAS PURCHASED OUTRIGHT AS A NEW  VEHICLE IN FEBRUARY 2005.  THIS 2005 XC90, FWD WITH APPROXIMATELY 13,880 MILES  HAD  A COMPLETE TRANSMISSION FAILURE ON 03/21/2007.  DAY PRIOR TO THE EVENT, AN ODD NOISE WAS HEARD ON DRIVER'S SIDE OF VEHICLE.  UPON ACCELERATION VEHICLE WOULD HESITATE THEN LUNGE FORWARD.  SERVICE DEPARTMENT CALLED UPON ARRIVAL AT HOME.  THE FOLLOWING MORNING, ON WAY TO DEALERSHIP/SERVICE, 2 BLOCKS FROM THERE VEHICLE LOST POWER AND WOULD NO LONGER ACCELERATE.  WAS NOTIFIED THAT A NEW TRANSMISSION WAS NEEDED.  CURRENTLY AM AWAITING NEW TRANSMISSION.  AS PER SERVICE THIS WAS UNDER WARRANTY. SERVICE DEPT AND VOLVO NA, STATED THAT THE NEW TRANSMISSION WILL ONLY BE COVERED FOR THE REMAINDER OF THE NEW CAR WARRANTY PERIOD WHICH WOULD BE APPROXIMATELY  2 YEARS.*AK",
        "vin": "YV1CN592351"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/13/2007",
        "dateOfIncident": "02/28/2007",
        "fire": true,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10184920,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY 2005 VOLVO XC90 AWD A  FROM MY HOME TO WORK(ABOUT 20 MILES) WHEN I WAS PARKING THE CAR ON A PARKING LOT, I NOTICED SMOKE COMING FROM UNDER THE HOOD. THE NEXT MOMENT I SAW A LITTLE FIRE COMING FROM UNDER THE HOOD. I STOPPED THE CAR AND GOT OUT. THE FIRE WAS GETTING BIGGER AND BIGGER. I IMMEDIATELY CALLED 911. BY THE TIME THE FIRE ENGINE ARRIVED THE CAR WAS IN FLAMES, AND THE FRONT WINDSHIELD CRACKED AND FELL INSIDE THE CAR.  THE FRONT SEATS AND MY PERSONAL PROPERTY WERE BURNED.  *JB",
        "vin": "YV1CZ592751"
    },
    {
        "components": "STEERING,TIRES",
        "crash": false,
        "dateComplaintFiled": "02/01/2007",
        "dateOfIncident": "01/20/2007",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10181317,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* - THE CONTACT  OWNS A 2005 XC90 VOLVO.  THE CONTACT STATED THAT THERE  WAS  A SAFETY RECALL ON  THE VEHICLE WHICH WAS ISSUED MAY 3 2006.  SHE WAS NOT NOTIFIED OF THE SAFETY RECALL UNTIL SHE TOOK THE  VEHICLE  TO DEALER  FOR SCHEDULED MAINTENANCE IN JANUARY 2007.  THE CONTACT BELIEVED THAT THE PROBLEMS SHE CURRENTLY  HAD  WITH  THE  TIRES HAVING UNEVEN WEAR AND WEARING  DOWN TO THE INDICATORS, AND CRACKED TREAD  WERE  CAUSED BY THE DEFECT STATED IN SAFETY RECALL 06V155000.THE RECALL STATED THAT THE OUTER TIE ROD BALL JOINT COULD DEFORM AT HIGH LOADS CAUSING A LOSS OF THE CLAMPING FORCE ,AND THE NUT MAY LOOSEN, WHICH MAY EVENTUALLY LEAD TO A FATIGUE FRACTURE OF THE OUTER TIE ROD BALL JOINT.  THE CONTACT STATED THAT THE TIRES CURRENTLY HAVE 17,000 MILES, THE FAILURE MILEAGE WAS 12000.  THE CONTACT WOULD LIKE TO HAVE  THE TIRES REPLACED BY THE MANUFACTURER.   *AK  THE TIRES WEARING WERE DUE TO THE RECALL. UPDATED 03/19/07. *JB",
        "vin": "YV1CY592851"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "01/23/2007",
        "dateOfIncident": "01/07/2007",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10179457,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "THE TYPE OF TIRES VOLVO IS PUTTING ON THE XC90 IS TOO SOFT LEADING TO PREMATURE TIRE FAILURE. VOLVO REPLACED THE TIRES WITH THE SAME TYPE/BRAND AND THE TIRES HAVE AGAIN WORN.  I HAVE HAD TWO SETS OF TIRES WITH IN 35,000 MILES.  RESEARCHING THE WEB HAS CONFIRMED THIS IS A PROBLEM VOVLO XC90 WIDE.  *NM",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "11/26/2006",
        "dateOfIncident": "11/15/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10174269,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "I  BROUGHT MY 2005 XC90 IN FOR  ROUTINE MAINTENANCE AT 25,500 MILES.  AT THAT TIME,   IT WAS DETERMINED THREE OF THE FOUR TIRES WERE  WORN ON THE OUTER EDGES AND SHOULD BE REPLACED.  THIS IS UNACCEPTABLE FOR A VEHICLE TO HAVE THREE OF ITS TIRES REPLACED WITHIN THE FIRST 25K MILES OF SERVICE.  SOMETHING IS OBVIOUSLY WRONG WITH EITHER THE TIRES OR THE VEHICLE DYNAMICS.  *JB",
        "vin": "YV1CZ911X51"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/14/2006",
        "dateOfIncident": "03/01/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10173453,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THE PASSENGER FRONT AIRBAG LIGHT ILLUMINATED INTERMITTENTLY.  THE VEHICLE WAS TAKEN TO A LOCAL DEALER WHO COULD NOT DUPLICATE THE PROBLEM.  THE GENERAL MANAGER SUGGESTED THAT THE CONTACT TAKE THE VEHICLE TO ANOTHER DEALERSHIP FOR SERVICE BECAUSE THE DEALER WAS NOT WILLING TO SERVICE OR FURTHER EXAMINE THE VEHICLE.",
        "vin": "YV1CZ592251"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "11/08/2006",
        "dateOfIncident": "11/08/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10172906,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDSHIELD WIPERS LEAVE A STREAK ACROSS WINDSHIELD, SIGNIFICANTLY IMPAIRING VISION AND MAKING DRIVING IN RAIN HAZARDOUS.  BOTH WIPER BLADES AND WINDSHIELD WIPER ARMS WERE REPLACED BY DEALER - PROBLEM PERSISTS.  THIS HAS BEEN AN ONGOING ISSUE SINCE THE CAR WAS PURCHASED; DEALER ACKNOWLEDGE THE PROBLEM BUT HAS NOT ADEQUATELY REPAIRED THE CAR.   *JB",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/17/2006",
        "dateOfIncident": "10/16/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10171029,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS  BOUGHT BACK IN 10/31/04.  WITHIN WEEKS OF HAVING THE VEHICLE, WE NOTICED LOST OF POWER AND PERFORMANCES IF THE VEHICLE. WE CALLED THE DEALER ABOUT IT AND SAID THAT IT MIGHT JUST BE DUE TO THE GAS CAP. AS IT TURNED OUT THEY HAD TO REPLACE A SOLENOID WHICH PART OF THE STARTER OR SOME TYPE OF FIRING MECHANISM FOR THE ENGINE. AFTER THAT PROBLEM WAS FIXED, WE HAD TO CONTINUALLY BRING THE VEHICLE BACK TO THE DEALER FOR THE CHECK ENGINE CONSTANTLY COMING ON. THIS WENT ON FOR NUMEROUS TIMES UNTIL THEY FOUND A RELAY PROBLEM. LAST FRIDAY MY WIFE, WHO PRIMARILY DRIVES THE CAR, COMPLAINED ABOUT THE PERFORMANCE AND LOST OF POWER ISSUE. I TEST DROVE THE VEHICLE AND CONFIRMED HER WORRIES ABOUT THE VEHICLE. THE VEHICLE DOES NOT ACCELERATE PROPERLY AND A SUDDEN JERK OR RISE OF RPM  WHEN IT HITS ITS MARK. ALSO AROUND 60 MPH AND 70 MPH YOU CAN HEAR OBVIOUS NOISE FROM THE ENGINE. AT IDLE FOR ABOUT A MINUTE YOU CAN SMELL SOMETHING BURNING IN THE ENGINE COMPARTMENT. THE VEHICLE WILL BE TAKEN TO DEALER ON 10/17/06.  *NM",
        "vin": "YV1CZ911751"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/12/2006",
        "dateOfIncident": "09/12/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10168086,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "DT*: THE CONTACT STATED WHILE ROUTINE MAINTENANCE AT 15,000 MILES WAS PERFORMED, IT WAS DETERMINED ALL FOUR TIRES WERE 60% WORN, AND SHOULD BE REPLACED.  THESE ARE PIRELLI SCORPION TIRES.*AK  UPDATED 10/25/2006 - *NM",
        "vin": "YV1CZ592351"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/25/2006",
        "dateOfIncident": "07/19/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10163449,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOOK MY 2005 VOLVO XC-90 TO THE DEALERSHIP TO HAVE THE OUTER TIE  RODS REPLACED IN CONJUNCTION WITH A RECALL NOTICE I RECEIVED FROM VOLVO. WHEN I ARRIVED AT THE DEALERSHIP, I WAS TOLD BY THE SERVICE ADVISER THAT I SHOULD HAVE THE REAR WHEELS ALIGNED BECAUSE THEY WERE FINDING THAT WHEN THIS RECALL SERVICE WAS BEING PERFORMED, THE REAR WHEELS NEEDED ALIGNMENT AS WELL AS THE FRONT WHEELS.  I WAS ALSO TOLD THAT VOLVO WOULD BE PAYING FOR THE FRONT WHEELS TO BE ALIGNED, BUT THAT I WOULD HAVE TO PAY FOR THE  REAR WHEEL ALIGNMENT AT THE SPECIAL PRICE OF $59.95.  I DECLINED THE  REAR WHEEL ALIGNMENT BECAUSE I FELT IT WOULD BE FOOLISH TO PAY FOR SOMETHING LIKE THIS BEFORE KNOWING WHETHER A PROBLEM REALLY EXISTED. SEVERAL HOURS LATER, I RECEIVED A CALL FROM THE DEALERSHIP SAYING THAT THEY WERE WORKING ON MY CAR AND THAT MY REAR WHEELS REALLY DID NEED TO BE ALIGNED.  NOT KNOWING WHAT ELSE TO DO, I CONSENTED TO PAY TO HAVE THE WORK DONE.  I RETURNED FROM THE DEALERSHIP WITH THE RECALL WORK COMPLETED  AND MY WALLET HAVING BEEN EMPTIED OF $66.37 ($59.95 + TAX AND  MISCELLANEOUS CHARGES).  I DECIDED TO WRITE TO YOU SINCE I BELIEVE THIS WHOLE PROCESS IS  BLATANTLY UNFAIR TO THE CONSUMER.  VOLVO RECALLS DEFECTIVE PARTS BUT ONLY PAYS FOR THE FRONT WHEELS TO BE ALIGNED, YET THE DEALERSHIP IS SAYING THAT THEY ARE FINDING THAT ALL OF THE WHEELS NEED TO BE REALIGNED?  MY CAR IS ABOUT 15  MONTHS OLD, AND I HAD MY 15,000 MILE SERVICE DONE IN EARLY JUNE.  AT  THAT TIME, MY WHEELS WERE ROTATED AND BALANCED AND NOTHING WAS SAID INDICATING I HAD AN ALIGNMENT PROBLEM EITHER IN THE FRONT OR THE REAR OF THE CAR.  IT SEEMS TO ME THAT VOLVO IS TAKING ADVANTAGE OF ITS CUSTOMERS BY HAVING THEM COME IN TO HAVE PARTS REPLACED \"FREE\" OF CHARGE ONLY TO WALK OUT WITH A BILL FOR \"NECESSARY\" SERVICES WHICH ARE \"NOT COVERED\".  I DON'T KNOW IF OTHERS HAVE EXPERIENCED THIS, BUT I WANTED TO GO ON  RECORD WITH WHAT HAPPENED TO ME.    THANK YOU FOR YOUR TIME AND ATTENTION.  *JB",
        "vin": "YV1CN592751"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,TIRES",
        "crash": false,
        "dateComplaintFiled": "05/07/2006",
        "dateOfIncident": "05/05/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10156932,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "MICHELIN TIRE CORP.",
                "productMake": "MICHELIN",
                "productModel": "MX4",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "BRAKE PROBLEM AT 13000 MILES AND AGAIN AT 25000, COSTLY REPAIR, THE TRUCK WEIGHS 6000 LBS AND BRAKE SYSTEM IS NOT ADEQUATE FOR VEHICLE. CALIPER HAD TO BE REPLACED ON NEW VEHICLE! PLEASE INVESTIGATE, I KNOW THIS WILL HAPPEN AGAIN, BRAKES HAVE EXCESSIVE DUST, WEAR FAST.  *NM",
        "vin": "YV1CZ911151"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "02/08/2006",
        "dateOfIncident": "08/17/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10149708,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED THE TOWING CAPACITY LISTED IN THE OWNER'S MANUAL CONFLICTS WITH A BROCHURE PROVIDED BY THE DEALER.  THE BROCHURE MADE NO MENTION OF THIRD ROW SEATING HAVING AN IMPACT ON TOWING CAPACITY WHILE THE OWNER'S MANUAL INDICATED THE THIRD ROW SEATING REDUCED TOWING CAPACITY.  WHILE TOWING A SNOWMOBILE TRAVELING 30MPH THE VEHICLE EXPERIENCED A LOSS OF POWER, THE REAR OF THE VEHICLE DROPPED DOWN AND THE FRONT WHEELS LOST TRACTION.  THE VEHICLE WAS INSPECTED BY A REGIONAL REPRESENTATIVE FROM THE MANUFACTURER WHO WAS UNABLE TO DETERMINE THERE WAS A PROBLEM. *AK",
        "vin": "YV1CZ911651"
    },
    {
        "components": "FUEL SYSTEM, OTHER,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "01/24/2006",
        "dateOfIncident": "12/15/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10148501,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "TOW HITCH",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "VOLVO XC90 AWD:  THIS VEHICLE HAS FAILED THREE TIMES WITH ME AND ONCE WITH THE DEALER. DECEMBER  2005 THE VEHICLES FAILED TO START. I HAD IT TOWED TO THE LOCAL DEALERSHIP. THE PROBLEM WAS A FUEL PUMP MALFUNCTION. FUEL PUMP WAS REPLACED, AND I DROVE THE TRUCK MAYBE A GOOD TWO WEEKS AND EARLY ONE MORNING ON THE INTERSTATE THE VEHICLE JUST SLOWED SPEED TO 20 MPH. I MERGED RIGHT AND THE VEHICLE CUT OF AFTER WAITING A SHORT TIME I STATED THE VEHICLE AGAIN AND IT CONTINUED WITH THE SAME MALFUNCTIONS. AFTER ABOUT 1 HOUR  AND A HALF I ARRIVE TO MY 20-MINUTE DESTINATION AND CALLED ROADSIDE SERVICE AGAIN AND HAD THE VEHICLE TOWED IN TO THE SAME DEALER. AFTER APPROXIMATELY THREE DAYS THE SERVICE DEPARTMENT CALLS ME IN AND TELLS ME THE VEHICLE WAS READY TO BE PICK-UP. THE PROBLEM WAS THEIR TECHNICIAN FORGOT TO RESET THE COMPUTER SYSTEM, WHICH CASED THE VEHICLE TO QUIT WHILE DRIVING. I ACCEPTED MY VEHICLE AND REPRESENTATIVE INFORMED ME THAT THE PROBLEM WAS TAKEN CARE OF IT WAS THEIR FAULT AND HE APOLOGIZED..... OKAY, THREE DAYS LATER THE VEHICLE DID THE SAME THING WITH MY CHILDREN AND I ON THE INTERSTATE AGAIN I CALLED ROADSIDE, VEHICLE WAS TOWED IN AND I WAS TOLD THAT THE FUEL SENSORS WERE FAULTY AND THEY NEEDED TO BE REPLACED. IT'''''S BEEN ABOUT 8 DAYS LATER MY VEHICLE IS STILL AT VOLVO. I CALLED TODAY AND THE SERVICE MANAGER WITH ALL HONESTY INFORMED ME THAT THEY DIDN'T KNOW WHAT THE PROBLEM WAS HOWEVER; THERE'S DEFINITELY A PROBLEM, BECAUSE THE VEHICLE CUT OFF AGAIN WHEN THEY TEST DROVE THE VEHICLE.*AK",
        "vin": "YV1CZ592451"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/14/2005",
        "dateOfIncident": "10/14/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10139754,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "AT TIME OF PURCHASE, A VIBRATION FROM THE FRONT OF VEHICLE OCCURS UPON TURNING, MANUFACTURER REPLACED ENTIRE STEERING ASSEMBLY AFTER 5K MILES. OTHER VOLVO XC90 OWNERS HAVE HAD SIMILAR PROBLEMS AND REPAIRS OF STEERING ASSEMBLY  AT THIS TIME I WOULD LIKE TO BRING THE ISSUE TO NSTB  AS  IT MAY REFLECT POTENTIAL SAFETY ISSUES IF NOT REPAIRED.",
        "vin": "YV1CZ852051"
    },
    {
        "components": "INTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/10/2005",
        "dateOfIncident": "08/20/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10136106,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LIGHTING OF DASH INSTRUMENTS, I.E. RADIO AND HVAC CONTROLS IS TOO DIM TO READ DURING NORMAL SUNNY DAYLIGHT CONDITIONS.  THIS CONDITION CREATES A SAFETY HAZARD IN THAT THE DRIVER CANNOT SEE IMPORTANT INFORMATION.*JB",
        "vin": "YV1CZ592451"
    },
    {
        "components": "TIRES,WHEELS,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "09/08/2005",
        "dateOfIncident": "08/16/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10135911,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "MICHELIN NORTH AMERICA",
                "productMake": "MICHELIN",
                "productModel": "XJS",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            },
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "TOW HITCH",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "ON FEBRUARY 16 OF THIS YEAR, I HIT SOME BLACK ICE THAT CAUSED ME TO HIT A CURB SIDEWAYS.  THE IMPACT KNOCKED THE FRONT DRIVER'S SIDE WHEEL OFF.  THE CAR WAS TOWED TO THE KEN GARFF SERVICE DEPARTMENT AT THE SOUTHTOWNE LOCATION IN SANDY, UT WHERE IT WAS \"REPAIRED\".   A FREE LOANER CAR WAS GIVEN TO ME, AND THE CHARGES WERE COVERED BY MY INSURANCE.  AT THAT TIME THE CAR HAD APPROX 3700 MILES ON IT.    SINCE THAT REPAIR I HAVE DRIVEN THE CAR APPROX 5000 MILES.  I HAD THE 7500 MILE SERVICE COMPLETED AT THE KEN GARFF DOWNTOWN SLC LOCATION AROUND JULY 15TH.  AT THAT TIME, IT IS MY UNDERSTANDING THAT THEY CHECK THE CAR OVER FOR ANY AND ALL SAFETY ISSUES. ON AUGUST 15TH, I DROVE FROM ELKO, NV TO LAKEWOOD, CO, WITH MY 14 MONTH OLD BABY.  THE 750 MILE DRIVE TOOK US VIA I-70 AND THE MOUNTAINS OF COLORADO.  ON AUG 16TH, I DROVE 1 BLOCK FROM MY PARENT'S HOUSE TO A STORE, WHEN I WAS PULLING OUT OF THE PARKING PLACE THE CAR WOULDN'T MOVE.  I GOT OUT TO SEE WHAT THE TROUBLE WAS AND THE LEFT FRONT WHEEL WAS LYING COMPLETELY SIDEWAYS.  A BOLT HAD COME OUT OF THE A FRAME AND THEREFORE THE WHEEL FELL OFF.  THE CAR WAS TOWED TO RICKENBAUGH VOLVO IN DOWNTOWN DENVER TO BE REPAIRED.  *NM",
        "vin": "YV1CZ592X51"
    }
]