[
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/20/2021",
        "dateOfIncident": "10/14/2021",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444426,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2005 Volvo XC70. The contact received notification of NHTSA Campaign Number:  21V800000  ( Air Bag ) however, the part to do the recall repair was unavailable till approximately 2 weeks to 2 months. The contact stated that the manufacturer exceeded a reasonable amount of time for the recall repair. The manufacturer was made aware of the issue. The contact stated that the vehicle was displaying a warning message that stated \"Safety Check,\" however, they were not sure if it was or was not directly related to the air bags. The approximate failure mileage was 126,000.  Vin tool confirms parts distribution disconnect.",
        "vin": "yv1sz592351"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/06/2018",
        "dateOfIncident": "11/20/2018",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11156652,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CHECK ENGINE LIGHT FLASHED WHILE DRIVING ON TUESDAY NOVEMBER 20TH AT ABOUT 4:45PM. I WAS NEAREST MY LOCAL MECHANIC SHOP (ELDORADO AUTOMOTIVE) AND THE TECH PLUGGED IN THE COMPUTER GADGET THAT READS WHAT IS HAPPENING AND TOLD ME A HOUSING UNDER THE HOOD NEEDED TO BE REMOVED TO INVESTIGATE FURTHER. I TOOK THE CAR IN THE NEXT MORNING AND FOUND OUT THE MY TIMING BELT WAS ABOUT 1/2 SHREDDED AND READY TO BREAK AT ANY MOMENT. I WAS TOLD I COULDN'T DRIVE IT AND THAT THE REPAIRS WOULD NOT BE COMPLETED UNTIL TUESDAY NOVEMBER 27 FOLLOWING THE THANKSGIVING HOLIDAY. I HAVE A 2005 WAGON AND THE TIMING BELT WAS REPLACED BY VOLVO AT 125K. THE CAR NOW HAS 165K MILES. I WAS VERY LUCKY THAT I DID NOT HAVE A CATASTROPHIC FAILURE AND A RUINED ENGINE. IT WAS JUST COINCIDENCE THAT THIS UNRELATED ISSUE REQUIRED A MORE THOROUGH INVESTIGATION OF THE HOUSING WHERE THE TIMING BELT IS. TIMING BELTS ARE NOT WARRANTIED BY THE VOLVO 2015 LIFETIME WARRANTY PLAN (NO SURPRISE THERE) BUT AN AVERAGE BELT LASTS UPWARDS OF 100K MILES AND IS RECOMMENDED TO BE REPLACED AT/NEAR THAT TIME. I HAVE ALL DOCUMENTS SHOWING WHEN THE BELT WAS REPLACED AND YET VOLVO IS NOT STANDING BEHIND THIS PRODUCT. I DON'T SEE ANY GREY AREA HERE. THIS COULD IN NO WAY BE SOMETHING THAT WAS DONE BY ME. IT LOOKS AS THOUGH THE LOCAL VOLVO DEALER EITHER DID NOT INSTALL THE BELT AT 125K OR IT WAS CLEARLY A FAULTY UNIT. I SUBMITTED A CLAIM TO VOLVO CORPORATE FOR REIMBURSEMENT AND WAS DENIED. I HAVE REQUESTED A WRITTEN ACCOUNTING OF WHY THE CLAIM WAS DENIED. I HAVE BEEN UNABLE TO SPEAK WITH ANYONE OTHER THAN A CUSTOMER SERVICE REP WHO HAS ZERO AUTHORITY TO DO ANYTHING. I HAVE ALSO REQUESTED NAMES OF THE PERSONS IN MANAGEMENT WHO MADE THE DECISION. FEELS LIKE A HUGE SAFETY RISK. THANKS IN ADVANCE FOR YOUR HELP.",
        "vin": "YV1SZ592851"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/25/2017",
        "dateOfIncident": "10/16/2017",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11039586,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Giti Tire (USA), Ltd.",
                "productMake": "PRIMEWELL",
                "productModel": "VALERA TOURING II",
                "productYear": "9999",
                "size": "235/60R17 102T",
                "type": "Tire"
            }
        ],
        "summary": "TIRE INFO PRIMEWELL VALERA TOURING 215/65/R16 98H MADE IN CHINA. DOT #5WA6 00A 4813  IN MARCH 2016 I GOT A NEW/USED CERTIFIED CAR FROM A DEALER IN ORLANDO FL THE CAR CAME WITH NEW TIRES. NOT SURE WHERE THE TIRES WERE SOLD/INSTALLED, BUT AFTER I DROVE ABOUT 11 000 MILES, ONE OF THE REAR TIRE STARTS TO LOSE PRESSURE ABOUT 1 PSI/DAY. ON 8/14/2016 I TOOK THE CAR TO LOCAL TIRE PLUS STORE IN GAINESVILLE FL FOR INSPECTION ADDRESS: 2605 SW 34TH ST, GAINESVILLE, FL 32608, PHONE: (352) 231-8422-THE TECHNICIAN CHECKED THE TIRE AND SAID IT IS FINE AND SOME AIR LOSS IS NORMAL-EVEN I TOLD HIM THAT ONLY ONE TIRE DOES THAT AND I HAVE TO PUMP AIR EVERY WEEK TO PREVENT RUNNING FLAT. ONE MONTH LATER 10/16/2017 ON THE HIGHWAY GOING 70MPH I SUDDENLY I FELT AN EXPLOSION/STRONG VIBRATION AND LOST CONTROL. THE ROAD WAS CLEAR I DID NOT HIT ANY DEBRIS THAT CAN AFFECT THE TIRES. I WAS LUCKY THERE WAS NO OTHER CARS AROUND ME, SO I COULD PULL ON THE SHOULDER SAFELY. THE POLICE OFFICER(COLLINS)CAR THAT STOPPED TO SEE IF I AM OK ,SAW THE TIRE AND TOLD ME IT WAS DEFECTIVE AND I WAS LUCKY TO BE ALIVE SINCE THE DEFECTIVE TIRE WAS ON THE BACK NOT ON THE FRONT AND TRAFFIC WAS LIGHT.   I DISCOVERED THE SAME REAR TIRE I HAD PROBLEMS WITH BEFORE EXPLODED, LOST PART OF THE TREAD DUE TO THE BREAK OF INTERNAL STEEL BELT . I CHANGED THE TIRE WITH THE RESERVE AND I TOOK THE CAR AGAIN TO TIRE PLUS STORE  FOR REPLACEMENT. THE TECHNICIAN RECOGNIZED THE TIRE IS DEFECTIVE BUT REFUSED TO REPLACED BECAUSE IT WAS NOT ON THE LAST RECALL FROM PRIMAEWELL .(17T-013) SO I HAD TO PAY OVER $190 FOR A NEW PAIR TIRE SINCE THE CAR IS AWD AND CANNOT HAVE DIFFERENT TIRE AND STORE DO NOT SELL ANYMORE THIS BRAND(WANDER WHY?) PROBABLY MORE OF THIS PRIMEWELL VALERA TOURING TIRES ARE DEFECTIVE NOT ONLY THOSE LISTED ON THE RECALL, CHINESE MANUFACTURING IS FAMOUS FOR KILLING CONSUMERS WITH AMERICAN BUSINESS COMPLICITY-THIS IS ANOTHER SUCH CASE.. I AM CONCERNED THAT OTHER 2 SIMILAR TIRES STILL ON MY CAR TODAY AND I FEAR THEY WILL EXPLODE",
        "vin": "YV1SZ592051"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/22/2016",
        "dateOfIncident": "08/22/2016",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10897812,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "EGNISSION TURNS BUT TURNS OFF AFTER A HALF SECOND AFTER TURNING KEY TO START CAR. HALF TANK STILL WON'T START. IT WAS PARKED AND TRYING TO START CAR. THE DAY BEFORE THE CAR WAS IN PARK AND IN PARK WITH AC RUNING AND CAR WAS MAKING NOISE AS SHUTTERING OR GOING IN AND OUT OF GEARS. CODE READS FULE PUMP MODAL",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/07/2015",
        "dateOfIncident": "09/01/2015",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10780469,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AWD SYSTEM IS NOT WORKING. THE VEHICLE WAS TO SPIN THE FRONT WHEELS CONSTANTLY. ALSO TRAVELING ON THE HIGHWAY, THE VEHICLE WANTS TO DRIFT INTO THE OTHER LANES ON ITS OWN. DEALER TELLS ME IT IS THE ANGLE GEAR SLEEVE ON THE TRANSFER CASE OR THE TRANSFER CASE GEAR. TO ME ITS OBVIOUS THAT VOLVO DESIGNED THE PART TO FAIL. HOW CAN GEAR THAT IS SEALED FAIL WITH NORMAL USE? SO THE REPAIR WILL COULD COST UP TO $3600. AFTER DOING SOME RESEARCH ON THE WEB. THIS IS SO COMMON ITS RIDICULES.  NEVER BUY A VOLVO AGAIN. I BOUGHT THIS CAR TO HAVE A SAFE AWD. OH IT S SAFE... AS LONG AS ITS IN YOUR DRIVEWAY.",
        "vin": "YV1SZ592551"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/03/2015",
        "dateOfIncident": "11/25/2014",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10779461,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR OCCASIONALLY LOOSES POWER OR STALL WHEN DRIVING ON HIGH WAY, CHECK ENGINE LIGHT ON AND OFF. SYMPTOMS OFF AND ON. DANGEROUS DRIVING ON FREEWAY BECAUSE IT LOST POWER FOR 2 SECONDS THEN REGAIN MORE POWER IN ACCELERATING SPEED.  IT HAD RECALLED NO 181 ON 2004 MODEL, MINE IS 2005 SOLD ON 2005 JANUARY. THE REPORT DESCRIBES AS FUEL SENSOR PROBLEM",
        "vin": "YV1SZ592051"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/02/2014",
        "dateOfIncident": "12/10/2013",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10640695,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE'S 2005 VOLVO XC70 PROBLEM IS THAT PERIODICALLY WHEN YOU SHUT OFF THE CAR AND ATTEMPT TO REMOVE THE KEY YOU CAN'T. THE CAR MAKES A NOISE LIKE IT CONTINUES TO RUN FOR SEVERAL MINUTES AND SOMETIMES YOU CAN THEN REMOVE THE KEY. UNFORTUNATELY THIS PROBLEM IS HAPPENING MORE FREQUENTLY.    *TR",
        "vin": "YV1SZ592851"
    },
    {
        "components": "STEERING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/24/2014",
        "dateOfIncident": "07/26/2014",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10638924,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "SUBMISSION FROM CONSTITUENTS RE 2005 XC70 VOLVO STEERING SHAFT BROKEN.  *SMD  THE CONSUMER STATED THERE WAS NO COLLISION OR IMPACT THAT COULD HAVE CAUSED THE STEERING SHAFT TO BREAK. HE WAS SIMPLY MAKING A RIGHT TURN, ONTO HIS STREET WHEN THE STEERING STOPPED WORKING. *JB  THE TRANSMISSION WAS REPLACED AT A COST OF $4,000. UPDATED 10/01/14. *JB",
        "vin": "YV1SZ592851"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/14/2014",
        "dateOfIncident": "07/08/2014",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10610333,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2005 VOLVO XC70. WHILE DRIVING APPROXIMATELY 15 MPH, THE INSTRUMENT PANEL FAILED AND THE ABS, ALTERNATOR, AND URGENT WARNING SYSTEM INDICATORS ILLUMINATED. DURING THE FAILURE, THE WINDSHIELD WIPERS ACTIVATED AND COULD NOT BE TURNED OFF. AN INDEPENDENT MECHANIC STATED THAT THE CENTRAL ELECTRICAL MODULE WAS CORRODED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED AND THE MANUFACTURER WAS NOTIFIED. THE FAILURE MILEAGE WAS 115,000.",
        "vin": "YV1SZ592951"
    },
    {
        "components": "SEAT BELTS,SEATS",
        "crash": false,
        "dateComplaintFiled": "10/04/2013",
        "dateOfIncident": "10/04/2013",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10546809,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN ATTEMPTING TO LATCH OUR CHILD'S CAR SEAT IN REAR FACING POSITION TO THE CAR'S LATCH SYSTEM ANCHORS, ONE OF THE LATCH ANCHORS BROKE OFF COMPLETELY FROM THE CAR.  WE RETRIEVED THE BROKEN OFF ANCHOR PIECE AND IT HAD BROKEN OFF COMPLETELY FROM THE CAR AT THE SOLDER POINTS.  *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/07/2013",
        "dateOfIncident": "02/01/2013",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10542379,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STARTED TO UNCONTROLLABLY HARD-SHIFT AND JERK UPON DECELERATION. ACCORDING TO VOLVO DEALER TRANSMISSION NEEDS TO BE REPLACED EVEN THOUGH CAR HAS UNDER 100K MILES.",
        "vin": "YV1SZ592651"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/29/2013",
        "dateOfIncident": "05/28/2013",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10514051,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT DRIVER SIDE SUSPENSION SPRING COIL BROKE, PROBABLY DUE TO CORROSION! IF THIS WAS WHEN THE CAR WAS DRIVEN IT WOULD HAVE PROBABLY RIPPED THE TIRE AND RESULTED IN A VERY SERIOUS ACCIDENT. THIS IS 7 YEARS OLD VOLVO IN AS NEW CONDITION.  *TR",
        "vin": "YV1SZ592851"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/05/2012",
        "dateOfIncident": "12/14/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10443048,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR WAS PARKED OVER NIGHT AT HOME. WHEN REVERSING THE CAR OUT OF THE GARAGE THE FOLLOWING MORNING A GRINDING NOISE WAS HEARD FROM THE LEFT FRONT WHEEL. ON INSPECTION IT WAS APPARENT THAT THE FRONT DRIVER'S SIDE HELICAL SUSPENSION SPRING HAD FRACTURED IN THE FIRST NINE INCHES OF ITS LOWER ARC. THE CAR WAS TOWED TO THE GARAGE AND THEY INFORMED ME THAT THE SPRING WAS IN CONTACT WITH THE TIRE AND THE SPRING RECESS IN THE TOP OF THE WHEEL ARCH. ON INSPECTION IT WAS APPARENT THAT THE SPRING HAD SUDDENLY FAILED DUE TO METAL FATIGUE AND THAT THE FRACTURED SURFACES WERE PARTIALLY RUSTED. THE CAR WAS SERVICED TWO WEEKS PRIOR TO THIS FAILURE AND NO PROBLEMS IN THE FRONT SUSPENSION OR WHEEL ALIGNMENT WERE NOTICED. I HAVE RETAINED THE SPRING FOR INSPECTION AND NOTED THAT THE POWDER COATING ON THE LOWER PART OF THE SPRING WAS MISSING AND THAT THE SPRING'S BARE METAL SURFACE WAS CORRODED. IF THE SPRING HAD FAILED WHILE DRIVING AT SPEED THE BROKEN END WOULD HAVE CAUSED A TIRE FAILURE WITH ACCOMPANYING LOSS OF CONTROL WITH SERIOUS INJURIES TO PASSENGERS OR DRIVER.",
        "vin": "YV1SZ592051"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/06/2011",
        "dateOfIncident": "11/25/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10438720,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 VOLVO XC70. THE CONTACT WAS DRIVING 70 MPH WHEN THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS ABLE TO BE RESTARTED AFTER THE FAILURE AND TAKEN TO THE DEALER WHERE THE DEALER CONFIRMED THAT THE FUEL PRESSURE SENSOR NEEDED TO BE REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND THE VEHICLE WAS REPAIRED. THE FAILURE MILEAGE WAS 109,900 AND THE CURRENT MILEAGE WAS 110,150.     UPDATED 03/07/12",
        "vin": "YV1SZ592151"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/13/2011",
        "dateOfIncident": "01/01/2009",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10412094,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION STARTED CLANKING ON THE GO AGAIN WHENEVER AFTER AN ABRUPT STOP. IT HAS PROBLEM SWITCHING IN THE LOW GEARS, BUT IS FINE ON THE HIGH GEARS WHEN IN HIGHWAY. IT HAS DIFFICULTY GOING BETWEEN DRIVE AND REVERSE ALSO. IT MAKES A LOUD NOISE AS IF A HAMMER HIT IT.  THIS CAR WAS NEVER IN AN ACCIDENT. IT WAS REGULARLY SERVICED BY THE DEALER. BUT WHEN THIS PROBLEM WAS FIRST REPORTED TO THEM WHEN IT FIRST STARTED, THEY GAVE THE USUAL SUGGESTION LIKE THE SOFTWARE UPGRADE WHICH I DECLINED AFTER READING OTHER OWNERS' STORIES OF ITS INEFFECTIVENESS. THEY FURTHER REFUSED TO REBUILD THE TRANSMISSION BECAUSE THEY SAID THEY SIMPLY DO NOT DO THAT. AND WHEN QUESTION IF THE PROBLEM COULD BE FIXED IF REPLACING THE TRANSMISSION, THEY SAID THEY COULD NOT PROMISE THAT EITHER.  THE CAR WAS THEN TAKEN TO A REPUTABLE LOCAL MECHANIC. HE REFUSED TO WORK ON THE CAR. A 2ND MECHANIC CHANGED THE TRANSMISSION FLUID BUT DID NOT REALLY SOLVE THE PROBLEM.  THE VOLVO DEALER SHOULD HAVE CHANGED THE TRANSMISSION FLUID IF AND WHEN NEEDED DURING THE REGULAR MAINTENANCE SERVICES. BUT THEY NEVER DID BECAUSE IT WAS CHARACTERIZED AS UNNECESSARY.  BASED ON ALL THESE FACTS, I HIGHLY SUSPECT THE TRANSMISSION ON THIS 2005 XC70 IS A FAULTY PIECE OF EQUIPMENT THAT FAILS PREMATURELY.  *TR",
        "vin": "YV1SZ592251"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/06/2011",
        "dateOfIncident": "07/06/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10410664,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "1. LEAK FOUND IN PASSENGER-SIDE TRANSMISSION SEAL WHILE CAR WAS GETTING REGULAR  SERVICE  2. TOOK CAR TO CERTIFIED VOLVO MECHANIC  3.VOLVO USA TOLD MECHANIC THAT THE PART, AS SUCH, IS NOT AVAILABLE AS A PART FOR REPAIR ; INSTEAD THAT THE ENTIRE LARGER PART,THE BEZEL GEAR, WHICH IS WORKING QUITE WELL, WILL HAVE TO BE REPLACED AT A COST OF $2000!  *TR",
        "vin": "YV1SZ592451"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/30/2010",
        "dateOfIncident": "11/29/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10368455,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED 2005 VOLVO AND NOW HAVE 75,000 MILES AND BEGAN TO HAVE TRANSMISSION FAILURE. I TOOK TO DEALER AND SPENT OVER $3000 TO FIX SOFTWARE PROBLEM. THE PROBLEM GOT WORSE AND THE TRANSMISSION SLIPS AND THEN JUMPS INTO GEAR. I ALMOST CRASHED THE CAR IN FRONT OF ME. I SUSPECT MANY PEOPLE ARE HAVING PROBLEMS AND HOPEFULLY NO GETS HURT. *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/11/2010",
        "dateOfIncident": "08/11/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10348720,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION WHEN COMING TO A STOP ON DOWNSHIFT FROM 3,2 TO 1 CLUCKS AND CLUCKS AGAIN WHEN RESTARTING. IT MAKES A HARD STOP AND YOU SCARES YOU THINKING YOU GOT HIT WITH SOMEONE. *TR",
        "vin": "YV1SZ592051"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/26/2010",
        "dateOfIncident": "06/06/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10340224,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR XC70 BEGAN OVERHEATING AND WAS TAKEN IN FOR DIAG. IT NEEDS A TRANSMISSION AND RADIATOR BECAUSE THE TRANSMISSION COOLER IS BUILT INTO THE RADIATOR AND IT BEGAN EXCHANGING ENGINE COOLANT WITH TRANSMISSION FLUID. THIS IS A HORRIBLE DESIGN. WHY WOULD THEY NOT BE SEPARATE LIKE MY VW TOUAREG. THIS IS A VERY EXPENSIVE VEHICLE AND NOW I AM LOOKING AT A $7000 REPAIR. I CAN'T BELIEVE THAT AFTER TALKING TO THE DEALER AND CORPORATE VOLVO THAT NOTHING WILL BE DONE. THE CAR HAS 78,000 MILES ON IT. I'M SO UPSET BY THIS. *TR",
        "vin": ""
    },
    {
        "components": "SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "12/17/2009",
        "dateOfIncident": "11/10/2009",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10296299,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS A CORRECTION TO COMPLAINT #10296298. VEHICLE IN CONNECTION TO THIS COMPLAINT IS A 2005 VOLVO XC70, NOT A 2009. *TR",
        "vin": "YV1SZ592151"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "12/11/2008",
        "dateOfIncident": "10/10/2008",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10251508,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2005 VOLVO XC70.  THE CONTACT STATED THAT THE FRONT DRIVER'S SIDE WINDSHIELD WIPER FAILED.  HE CANNOT SWITCH THE LEFT BLADE WITH THE RIGHT BLADE OR PURCHASE A BLADE FROM SOMEWHERE OTHER THAN THE DEALER AT A LOWER PRICE.  IT WOULD COST $60 TO REPLACE THE WINDSHIELD BLADE.  THE MANUFACTURER STATED THAT THE VEHICLE WAS DESIGNED IN THIS MANNER; THEREFORE, THEY WOULD NOT ASSIST WITH THE REPAIR.  THE WINDSHIELD HAS NOT BEEN REPAIRED.  THE CURRENT AND FAILURE MILEAGES WERE 31,900.",
        "vin": "YV1SZ592751"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "10/11/2006",
        "dateOfIncident": "10/10/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10170524,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED WHILE THE BRAKE WAS DEPRESSED AND THE ENGINE WAS RUNNING, THE ENGINE REVVED UP AND THE VEHICLE LURCHED FORWARD.  THE HARDER THE BRAKE WAS DEPRESSED, THE FASTER THE ENGINE WOULD REV AND LURCH FORWARD, UNTIL THE TRANSMISSION WAS SHIFTED INTO PARK AND THE IGNITION WAS SWITCHED OFF.  WHEN RESTARTED, EVERYTHING OPERATED NORMALLY.  THE PROBLEM HAD OCCURRED 5 TIMES AND A MINOR COLLISION HAPPENED, ALTHOUGH NO INJURIES WERE SUSTAINED AND NO POLICE REPORT WAS TAKEN.  THE SERVICE DEALER COULD NOT RECREATE THE PROBLEM OR FIND ANYTHING WRONG ON THE COMPUTER DIAGNOSTIC. THE MANUFACTURER WAS NOTIFIED.  UPDATED 11/21/2006 - *NM",
        "vin": "YV1SZ592351"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/11/2006",
        "dateOfIncident": "10/20/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10167920,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION HAD A JERK TO IT WHEN YOU CAME OUT OF A STOP. WHEN YOU ACCELERATED FROM  A STOP THE ENGINE THEN WOULD STOP. WE HAVE THE DEALER SHIP VOLVO ( BARRIER LOOKING AT THE PROBLEM AND HAVE FIXED THE PROBLEM. THERE IS STILL HOWEVER A SMALL JERK IN THE TRANSMISSION AND A SLIGHT HESITATION IN THE ENGINE TO ENGAGE THE TRANSMISSION.  *NM",
        "vin": "YV1SZ58D111"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/15/2005",
        "dateOfIncident": "11/28/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10145308,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE CONTACT COMPLAINED ABOUT INTERMITTENT POWER FAILURE WHILE ACCELERATING.  HE WAS ABLE TO RESTART THE VEHICLE IN THE PAST, HOWEVER,  AFTER THE THIRD OCCURRENCE , THE VEHICLE HAD TO BE TOWED TO THE DEALER.  THE DEALER DETERMINED THE IN TANK THE  FUEL PUMP PART # 30741993 NEEDED TO BE REPLACED. THE CONTACT FELT THIS PART WAS FAULTY BY DESIGN.  THE MANUFACTURER STATED THERE WERE NO PARTS AVAILABLE DUE TO HIGH DEMAND.*AK UPDATED 02/07/06.*JB",
        "vin": "YV1SZ592551"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/25/2005",
        "dateOfIncident": "05/09/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10140773,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TRAVELLING AT 75 ON THE INTERSTATE WHEN THE CAR SUDDENLY LOST POWER DOWN TO 10 MILES PER HOUR AND WOULDN'T EXCEED THAT SPEED. I FINALLY WAS ABLE TO GET OFF THE INTERSTATE. IT HAPPENED SEVERAL TIMES AGAIN AS I WAS RETURNING TO COLORADO SPRINGS. I HAVE A VOLVO V70XC 2001. I HAD TO HAVE THE COMPUTER REPLACED AT A COST OF ALMOST $1000.THE SITUATION WAS VERY DANGEROUS.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/13/2005",
        "dateOfIncident": "07/27/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10132721,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WOULD NOT START ON ONE OCCURRENCE THEN STARTED AGAIN LATER THAT DAY THEN A WEEK LATER IT WOULD NOT ACCELERATE OVER 25 MILES  AND THE ENGINE THROTTLE CONTROL UNIT HAD TO BE REPLACED AT OUR EXPENSE. *JB",
        "vin": "YV1SZ58DX11"
    }
]