[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/24/2020",
        "dateOfIncident": "10/12/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376238,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRANSMISSION IN THIS CAR HAS ISSUES WITH ACCELERATION AND DECELERATION. I NOTICE THAT THERE IS TRANSMISSION JUDDER BETWEEN 20-45 MPH",
        "vin": "2HNYD18656H"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/14/2020",
        "dateOfIncident": "01/19/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309235,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 ACURA MDX. THE CONTACT STATED WHILE DRIVING AT 40 MPH, THE ACCELERATOR PEDAL WAS RELEASED AND THE VEHICLE STOPPED INDEPENDENTLY. THE CONTACT STATED THAT THE VEHICLE STABILITY ASSIST (VSA) WARNING LIGHT WAS ILLUMINATED. THE CONTACT ASSOCIATED THE FAILURE WITH NHTSA CAMPAIGN NUMBER: 13V092000 (SERVICE BRAKES, HYDRAULIC) WITH THE FAILURE. THE VEHICLE WAS TAKEN TO LOS GATOS ACURA LOCATED AT 16151 LOS GATOS BLVD, LOS GATOS, CA 95032, AND THE DEALER WAS INFORMED OF THE FAILURE. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS NOT INFORMED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 148,000. *DT     CONSUMER ALSO STATED WHILE DRIVING PARTIAL BRAKE FORCE WAS APPLIED BY THE VEHICLE WITHOUT BRILLANCE OF THE BRAKE LIGHTS,  EVEN WHEN BRAKES ARE NOT IN USE. CONSUMER'S MECHANIC DIAGNOSED FAILURE TO BE ASSOCIATED WITH NHTSA RECALL NUMBER:13V-092. CONSUMER STATED MANUFACTURE  REFUSED TO DIAGNOSE AND REPAIR WITHOUT PRETENSE OF PAYING UPFRONT NON RELATED SERVICE CHARGES. MANUFACTURER WAS INFORMED AND WAS GIVEN CASE NUMBER [XXX].    ('PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).')*JB",
        "vin": "2HNYD18666H"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/29/2019",
        "dateOfIncident": "12/29/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11291923,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR STARTED LEAKING WATER EVERY TIME IT RAINS IN THE DRIVERS SIDE OF THE CAR INTO THE FLOOR AND THE PASSENGER SIDE FLOOR.  I HAVE FOUND SEVERAL POSTS ABOUT THE SAME ISSUE WITH ACURA AND HONDA.",
        "vin": "2HNYD189X6H"
    },
    {
        "components": "SEAT BELTS,SEATS",
        "crash": true,
        "dateComplaintFiled": "11/18/2019",
        "dateOfIncident": "10/02/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11280937,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2006 ACURA MDX. WHILE THE CONTACT'S VEHICLE WAS IDLING AT A TRAFFIC LIGHT, IT WAS REAR ENDED BY ANOTHER VEHICLE. THE CONTACT HEARD AN ABNORMAL NOISE AND THE FRONT DRIVER'S SEAT FRACTURED IN HALF. ALSO, THE SEAT BELT BECAME DETACHED DURING THE IMPACT. THE AIR BAG DEPLOYED. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE CONTACT SUSTAINED INJURIES TO THE LEFT KNEE, BACK, NECK, AND HIP. THE CONTACT WAS TRANSPORTED VIA AMBULANCE TO THE HOSPITAL FOR MEDICAL ATTENTION. THE CONTACT WAS CURRENTLY SEEING A CHIROPRACTOR AND RECEIVING TREATMENT FOR HER BACK AND NECK. THE VEHICLE WAS UNABLE TO BE DRIVEN AND WAS TOWED TO AN IMPOUND LOT. THE VEHICLE WAS NOT DIAGNOSED. THE DEALER AND MANUFACTURER WERE NOT INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS 145,000. *MP *DL",
        "vin": "2HNYD18936H"
    },
    {
        "components": "AIR BAGS,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/12/2019",
        "dateOfIncident": "07/12/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11231391,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I'M LOOKING OVER RECALLS ON KELLEY BLUE BOOK SITE",
        "vin": "2HNYD18876H"
    },
    {
        "components": "UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/11/2019",
        "dateOfIncident": "05/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11230957,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS DRIVING IN A PARKING LOT, I WENT TO APPLY MY BRAKES AS I AM TURNING MY CAR. THE BRAKES FELT HARD ALL OF A SUDDEN EVEN THOUGH I BARELY APPLIED PRESSURE. THE BREAK PETAL HAD A GRINDING SOUND AND APPLIED EXTREME PRESSURE TO BREAK MY CAR BY ITSELF. IT FELT AS IF MY CAR WAS BEING THROWN FROM SIDE TO SIDE. THIS HAPPENED SEVERAL TIMES IN PARKING LOTS. THIS HAS ALSO HAPPENED ABOUT 3 TIMES ON THE HIGHWAY. WHILE DRIVING AND GOING DOWN A SMALL HILL ON THE HIGHWAY I BARELY APPLIED THE BREAK BUT THE CAR BREAK FELT HARD AND WEIRD AS I BARELY PRESSED IT. IT FELT AND SOUNDED LIKE A GRINDING LOUD NOISE AND  CAUSE MY CAR TO PULL VERY HARD TO THE RIGHT AS IF IT WAS GOING TO THROW ME OFF THE HIGHWAY. THANKFULLY EACH OF THOSE FEW TIMES I WAS DRIVING AROUND 30 MPH. EACH OCCASION THE VSA LIGHT CAME ON AND/OR STARTED BLINKING. I HAVE TAKEN MY CAR TO THE GARY FORCE ACURA  DEALERSHIP IN BRENTWOOD, TN ON AUGUST 9, 2019. THEY PROCEEDED TO DO BREAKDOWN OF MY CAR AND TOLD ME I NEEDED A NEW WIRING HARNESS AND CAPACITOR THAT WOULD COST OVER $1500. THEY TOLD ME MY CAR WASN'T INCLUDED IN THE RECALL THAT WAS ISSUED ON MARCH 13, 2013. MY VSA LIGHT CONTINUES TO STAY ON AND I STILL AM EXPERIENCING THESE PROBLEMS. I CAN NOT AFFORD THESE PARTS FOR MY CAR AND FEEL THAT ACURA SHOULD INCLUDE MY VEHICLE IN THIS RECALL. I FEAR FOR THE SAFETY OF MYSELF, MY HUSBAND, AND MY 17 YEAR OLD DAUGHTER AS SHE HAS STARTED DRIVING AND USING OUR ACURA MDX 2006. NHTSA RECALL 13V-092 MFR CAMPAIGN ID S89 RECALL DATE 3/13/2013",
        "vin": "2HNYD18926H"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/29/2019",
        "dateOfIncident": "08/01/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11192365,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "VSA STOPPED WORKING AND WHEN YOU PRESS ON THE BRAKE IT DOESN'T LIGHT UP. THE VSA LIGHT TURNS ON WHEN PRESSING THE BRAKE SOON AFTER DRIVING A SHORT DISTANCE.",
        "vin": "2HNYD189X6H"
    },
    {
        "components": "AIR BAGS,STRUCTURE,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "03/28/2019",
        "dateOfIncident": "03/09/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11192247,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 3/9, I WAS PARKING MY 2006 MDX IN AN INDOOR PARKING GARAGE. ABOUT 15 FEET FROM A WALL, IT TOOK OFF REAL FAST. I PRESSED HARDER ON THE BRAKES, BUT IT SLAMMED INTO THE WALL SO HARD. THE AIR BAG DEPLOYED, SMOKE CAME OUT & THE ALARM WENT OFF UNTIL A PASSERBY DISCONNECTED THE BATTERY. I COULDN'T STAND UP FOR A FEW MINUTES.   MY INSURANCE CO. DECIDED IT WAS TOTALLED & HAD IT TOWED TO OUR HOUSE INSTEAD OF A BODY SHOP, THEN ONLY GAVE ME ITS BOOK VALUE.  I STILL HAVE MANY BRUISES ALL OVER MY BODY AND MY NOSE BLED FOR A WHILE AND WAS SWOLLEN FOR A WEEK. THE SEAT BELT CUT INTO MY NECK AND ITS IMPACT LEFT SEVERE BRUISES ON MY CHEST. THE IMPACT MADE BOTH MY REPLACED KNEES BRUISE AND HURT. I HAD LOWER BACK FOR MANY DAYS.  POHANKA ACURA DEALERSHIP TOLD ME THIS IS AN ACURA COMPANY ISSUE. GOOGLE DIDN'T SHOW ANY RECALLS ON ACURA MDX ACCELERATORS. BUT, MANY PEOPLE HAVE HAD THE SAME PROBLEM I HAD WITH THEIR MDX. WHILE BRAKING, THE CAR GOES FASTER INSTEAD.   ON 3/11, AND AFTER MANY LEFT MESSAGES TO ACURA, ACURA FINALLY CALLED. I REQUESTED THAT SOMEONE WILL CHECK THE ACCELERATOR, B4 IT WAS TOWED AWAY. HE SAID I NEEDED TO FIX THE CAR AND BRING IT BACK TO ITS ORIGINAL NEW STATE. AFTER THAT, ACURA WILL THEN LOOK AT IT AND DETERMINE IF THE ACCELERATOR HAD ISSUES.   I'M VERY RELIEVED I DIDN'T DIE. I'M STILL NOT SURE IF I MIGHT DEVELOP ANY PERMANENT PHYSICAL PROBLEMS FROM THIS ACCIDENT. THE SHOCK, TRAUMA AND INJURIES WERE UNNECESSARY. I'M ALSO VERY GLAD I DIDN'T KILL ANYONE. I WOULD NEVER HAVE BEEN ABLE TO LIVE WITH MYSELF.   I WASN'T PREPARED TO BUY ANOTHER CAR NOW. I WAS PLANNING ON KEEPING IT FOR AT LEAST 2 MORE YEARS. BESIDES LOSING MY CAR, I WAS EXPOSED TO EXTREME DANGER, STRESS, FEAR AND PHYSICAL HARM, BECAUSE OF THE THE NEGLIGENCE ON ACURA'S PART.  I HOPE THIS MATTER WILL BE TAKEN SERIOUSLY AND ACURA WILL STAND BEHIND ITS REPUTABLE NAME AND FIX THE PROBLEM.",
        "vin": "2HNYD18936H"
    },
    {
        "components": "AIR BAGS,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "03/04/2019",
        "dateOfIncident": "12/24/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183883,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 ACURA MDX. WHILE DRIVING 45 MPH, THE VEHICLE FAILED TO COME TO A COMPLETE STOP WHILE THE BRAKE PEDAL WAS DEPRESSED. THE CONTACT STATED THAT THE VEHICLE STARTED TO JERK AND, AS A RESULT, REAR ENDED ANOTHER VEHICLE. THE AIR BAGS DID NOT DEPLOY. THERE WERE NO INJURIES. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO THE CONTACT'S RESIDENCE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE DEALER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 202,185.",
        "vin": "2HNYD18716H"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/06/2018",
        "dateOfIncident": "10/24/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11127916,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 ACURA MDX. THE CONTACT STATED THAT THERE WAS A FAILURE WITH THE ELECTRIC POWER STEERING AND POWER STEERING PUMP. ALSO, THE POWER STEERING RACK HAD AN INTERNAL LEAK. THE VEHICLE WAS REPAIRED BY DAVID MCDAVID ACURA PLANO (4051 W PLANO PKWY, PLANO, TX 75093, 972-964-6150) UNDER THE CONTACT'S INDEPENDENT WARRANTY. AFTERWARDS, THE HIGH PRESSURE HOSE HAD AN INTERNAL LEAK. ALTHOUGH THE STEERING WHEEL FUNCTIONED NORMALLY, THE SAME DEALER DIAGNOSED THAT THE HIGH PRESSURE HOSE NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURES. THE APPROXIMATE FAILURE MILEAGE WAS 87,650.",
        "vin": "2HNYD18926H"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "05/08/2018",
        "dateOfIncident": "05/07/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11092402,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 ACURA MDX. THE CONTACT PARKED THE VEHICLE, REMOVED THE KEY FROM THE IGNITION, AND EXITED THE VEHICLE. MOMENTS LATER, IT WAS NOTICED THAT THE VEHICLE HAD ROLLED BACKWARDS APPROXIMATELY 50 FEET. THE CONTACT STATED THAT THE VEHICLE CAME TO A STOP WHEN IT CRASHED INTO A BARRIER POLE. NO INJURIES WERE SUSTAINED AND A POLICE REPORT WAS NOT FILED. THE VEHICLE WAS NOT TAKEN TO A DEALER FOR DIAGNOSTIC TESTING OR REPAIRS. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 200,000.",
        "vin": "2HNYD18976H"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/01/2018",
        "dateOfIncident": "12/31/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11057828,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS IN MOTION WHEN I HEARD A LOUD POOPING SOUND.  A DIAGNOSIS WAS DONE AT PEP BOYS, RALEIGH NC AND I WAS TOLD THE NUMBER ONE SPARK PLUG EXPLODED AND THEREFORE MESSED UP THE COIL.  I WAS TURNING ON A CITY STREET.",
        "vin": "2HNYD18886H"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/30/2017",
        "dateOfIncident": "07/19/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11057633,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ACURA A DIVISION OF HONDA HAS KNOW FOR MANY YEARS NOW ABOUT A DEFECTIVE DRAW ON THE BATTERY FROM THE HANDS FREE BLUETOOTH IN THIS VEHICLE EVEN WHEN THE VEHICLE IS SHUT OFF WITH THE IGNITION KEY OUT OF THE IGNITION. I HAVE READ NUMEROUS COMPLAINTS FROM THE 2004 TO 2012 MODELS OF ALL TYPES OF ACURA MODELS. I HAVE INSTALLED TWO NEW BATTERIES IN THE LAST TWO YEARS. VEHICLE SETS MORE THAN TWO DAYS AND THE BATTERY IS DRAWN DOWN ENOUGH THAT VEHICLE NOT ONLY NOT START, BUT YOU CAN'T EVEN GET VEHICLE OUT OF PARK POSITION SO YOU CAN BE TOWED OR PULLED OFF THE ROAD SAFELY UNLESS YOU DRAG IT LOCKED UP. AND YES THIS HAS HAPPENED IN A DANGEROUS SITUATION. WHAT IF YOU LOSE BATTERY POWER FOR SOME REASON GOING DOWN THE ROAD? VERY DANGEROUS TO YOU AND OTHERS ON THE ROAD. I THINK THIS SHOULD BE A RECALL ON ACURAS, HONDA AS MANY YEARS AS THIS PROBLEM HAS PERSISTED AND AS MANY TYPES OF VEHICLES THAT I'M HEARING THIS PROBLEM IS BEING REPORTED ON. I ALSO HAVE READ ONE ARTICLE ABOUT A CLASS ACTION LAWSUIT AGAINST HONDA MOTOR COMPANY FOR THIS VERY PROBLEM FROM A INDIVIDUAL IN THE STATE OF CALIFORNIA. ITS TIME IN MY HUMBLE OPINION THAT ACURA - HONDA MOTORS OWN UP TO THIS MISTAKE WHEN WHEN IT GOES BACK SO FAR AND SO MANY TYPES OF VEHICLES WITH THIS ISSUE.",
        "vin": "2HNYD18676H"
    },
    {
        "components": "ELECTRICAL SYSTEM,WHEELS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/06/2017",
        "dateOfIncident": "05/02/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11052694,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STOPPED ON THE ROAD BECAUSE TRANSMISSION FAILURE, BATTERY WAS REPLACED TWICE BECAUSE OF BLUETOOTH  BOARD FAILURE, ALWAYS HAVE RANDOM MISSFIRE CODES ON ENGINE, CHECK ENGINE LIGHT ON.",
        "vin": "2HNYD18856H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/21/2017",
        "dateOfIncident": "08/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11035480,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM THE OWNER OF THIS AUTOMOBILE & HAD THIS MATTER TAKEN CARE OF SUMMER 2016. I TOOK IT TO SUPERIOR ACURA OF DAYTON; 60 LOOP RD. CENTERVILLE, OHIO 45459. BUSINESS # (937)435-5115. THE PASSENGER FRONTAL AIRBAG INFLATOR WAS REPLACE FREE OF CHARGE. I'M SURE SOMEONE THERE WILL BE ABLE TO CALL HERE & CLARIFY. MY NAME IS [XXX]. THANK YOU    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "2HNYD18246H"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/19/2017",
        "dateOfIncident": "07/09/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11016366,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "RE: AMERICAN HONDA FAILED TO REPLACE UNSAFE AIRBAG AND REFUSES TO TAKE ANY RESPONSIBILITIES    ON JULY 9, 2016, WE TOOK OUR 06' ACURA MDX TO LOCAL DEALER FOR THE UNSAFE PASSENGER SIDE AIRBAG REPLACEMENT (NHTSA RECALL 16V-334).  THE DEALER INFORMED US THAT THEY COULDN'T REPLACE THE AIRBAG DUE TO AN UNKNOWN WIRING OBSTRUCTING THE AIRBAG (EXHIBITS A, B).  THEY WANTED TO CUT THE WIRING FOR AIRBAG REPLACEMENT.  HOWEVER, THEY WILL NOT TAKE ANY RESPONSIBILITY IF SOMETHING GOES WRONG.  WE REFUSED THEIR IDEA OF CUTTING THE UNKNOWN WIRE, BECAUSE IT MAKES NO SENSES WHEN NO ONE KNOWS THE OUTCOMES IS GOING TO AFFECT VEHICLE SAFETY OR FUNCTIONALITY.  WE ARE THE ORIGINAL OWNERS AND TO OUR BEST KNOWLEDGE NO ONE HAS EVER SERVICED THE PASSENGER SIDE AIRBAG.  THUS, IT IS REASONABLE TO SUSPECT THIS MIGHT BE A RARE DEFECT.    WE CONTACTED HONDA TO EXPLAIN THIS UNUSUAL SITUATION, RECEIVED A CASE #04828622; WE SENT AN EMAIL WITH ALL THE DETAILS (EXHIBITS C).  WE HAD BEEN WAITING AND FOLLOWING UP, BUT HONDA MADE NO PROGRESS UNTIL WE EXPRESSED OUR EXTREME ANGER AFTER ONE YEAR OF ANXIOUS WAITING.    FINALLY, OUR CASE HAS BEEN ASSIGNED TO A REPRESENTATIVE AT 'AIRBAG RECALL DEPARTMENT' AROUND JULY, 2017.  HOWEVER, THIS HAS BEEN PLAYING THE GAME OF 'THIS AIRBAG RECALL DID NOT EXIST LAST YEAR', 'NOT RETURNING PHONE CALL AS SHE PROMISED', AND 'SENDING A NONSENSE LETTER TO CONFIRM THAT OUR AIRBAG IS UNSAFE!'.  EVENTUALLY, WE HAVE GOTTEN VERY FRUSTRATED AND ALSO BEING WORRY ABOUT OUR OWN SAFETY WITH THE DANGEROUSLY DEFECTED AIRBAG.  WE TOOK THE 06' ACURA MDX TO THE DEALER AGAIN; HOWEVER, ACURA DEALER WANTS ALMOST $300 FOR TRYING TO FIGURE OUT WHY THEY COULDN'T REPLACE THE AIRBAG WITHOUT ANY GUARANTEE OF REPLACING THE UNSAFE AIRBAG!    WE HOPE NHTSA WOULD IMMEDIATELY START TO INVESTIGATE THIS CASE, AND AMERICAN HONDA SHOULD BE SEVERELY PUNISHED DUE TO THEIR EGREGIOUS CONDUCTS.",
        "vin": "2HNYD18846H"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "05/24/2017",
        "dateOfIncident": "10/14/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10991524,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 ACURA MDX. WHILE THE VEHICLE WAS PARKED IN A SCHOOL PARKING LOT WITH THE KEY OUT OF THE IGNITION, THE VEHICLE BEGAN TO ROLL AWAY INDEPENDENTLY WITHOUT WARNING, A SCHOOL COACH JUMPED INTO THE VEHICLE AND WAS ABLE TO STOP IT FROM ROLLING. THE FAILURE RECURRED TWICE. THE VEHICLE WAS TAKEN TO APPLE TREE ACURA DEALER IN ASHEVILLE NC WHERE IT WAS DIAGNOSED, BUT THE TECHNICIAN COULD NOT FIND THE CAUSE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. IN ADDITION, WHILE THE VEHICLE WAS PARKED IN A SHOPPING CENTER PARKING LOT, IT ROLLED AWAY INDEPENDENTLY WITHOUT WARNING AND CRASHED INTO A PARKED VEHICLE. THE FRONT PASSENGER SIDE FENDER OF THE CONTACT'S VEHICLE AND THE REAR TAILGATE OF THE OTHER VEHICLE WERE DAMAGED. THERE WERE NO INJURIES AND A POLICE REPORT WAS NOT FILED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC (MYERS), BUT WAS NOT DIAGNOSED OR REPAIRED. THE BODY DAMAGE OF THE CONTACT'S VEHICLE WAS REPAIRED. THE CONTACT STATED THAT THE VEHICLE WAS REPAIRED PER NHTSA CAMPAIGN NUMBER: 12V573000 (ELECTRICAL SYSTEM). THE CONTACT NOTIFIED THE MANUFACTURER AND WAS INFORMED THAT THERE WAS NOTHING THEY COULD DO SINCE A DIAGNOSTIC TEST WAS DONE AND THE TECHNICIAN COULD NOT FIND THE CAUSE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 180,000.",
        "vin": "2HNYD18606H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/22/2017",
        "dateOfIncident": "05/02/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10990965,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SUV WAS JUST BROUGHT IN FOR A JUDDER FROM THE FRONT END TO THE LOCAL ACURA/ HONDA IN TOWN WHERE WE RESIDE AND THEY CLAIM ITS THE TORQUE CONVERTER IS FAILING WELL AFTER SOME RESEARCH WE NOTICED THERE WAS RECALLS AND A CLASS ACTION SUIT FOR THIS PROBLEM. I AM JUST MAKING THIS COMPLAINT BECAUSE THE DEALER STATES WE HAVE TO PAY 5000 DOLLARS TO HAVE IT REPLACED. I FEEL WE SHOULD BE EITHER GIVEN A DISCOUNT OR THEY SHOULD COVER THE COST DUE TO IT BEING AN ONGOING THING WITH PROBABLY THOUSANDS OF THESE ACURA MDX  . I HAVE SEEN LOTS OF FORUMS WHERE THEY PAY 75% OF COST FOR SOME AND 100% FOR OTHERS BUT NOT AFTER THE DEALERS TRY TO GET OUT OF PAYING FOR IT. MOST OF THEM LIKE THIS ONE HAVE ALREADY HAD THE PROBLEM AND HAD IT FIXED IF NOT ONCE SEVERAL TIMES. THIS IS A SAFETY ISSUE BECAUSE I KNOW THAT A TORQUE CONVERTER CAN LOCK UP AND IN A AWD VEHICLE THAT WOULD MOST CERTAINLY CAUSE AN ACCIDENT.  I HAVE YOUNG CHILDREN AND ALL THE DEALER SAYS IS TO KEEP HAVING THE TRANSMISSION FLUID CHANGED OR PAY 5000 TO REPLACE THE TRANSMISSION. I ALSO HAVE A HONDA ACCORD THAT HAD RECALLS FOR EXPLODING AIRBAGS AND IT TOOK MONTHS FOR THEM TO FINALLY GET IT IN FOR THE RECALLS. THE ACURA MDX ALSO SAYS BY THE VIN ON ACURA.COM IT HAS 4 RECALLS BUT THEY SAY AT THE DEALER IT DOESNT. I HAVE SEEN AND SPOKE WITH MANY PEOPLE WHO ARE VICTIMS OF THESE BILLION DOLLAR COMPANIES, ACURA THAT HAVE ALL THE SAME ISSUES . EVERY TIME WE GO TO HAVE AN ISSUE LOOKED AT OR ADDRESSED THEY TRY TO HAVE US HAVE OTHER IRRELEVANT ISSUES FIXED INSTEAD OF THE LIFE THREATENING ONES OR SAFETY RECALLS TAKING CARE OF. PLEASE SOMEONE HELP.",
        "vin": "2HNYD18906H"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/21/2017",
        "dateOfIncident": "04/19/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10979798,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY MDX VSA RANDOMLY CAME ON WHILE DRIVING DOWN INTERSTATE 65 IN NASHVILLE CAUSING ME TO HAVE TO PULL OFF TO THE SIDE OF THE ROAD. WHILE RESEARCHING THIS ISSUE ONLY CERTAIN VEHICLES HAVE BEEN INCLUDED IN A VSA RECALL AND UNFORTUNATELY MINE IS NOT ONE OF THEM. THE ENTIRE VSA SYSTEM IN THESE VEHICLES NEEDS TO BE RECALLED TO MAKE THESE VEHICLES SAFE.",
        "vin": "2HNYD18286H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/09/2017",
        "dateOfIncident": "01/09/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10943982,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2006 ACURA MDX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V344000 (AIR BAGS). THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "2HNYD18866H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/02/2016",
        "dateOfIncident": "08/10/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10923746,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL - I HAVE CONTACTED CRISWELL ACURA IN ANNAPOLIS, MD TWICE TO SCHEDULE THE RECALL REPAIR; 8/10/2016, 9/6/2016.  THE FIRST TIME I WAS TOLD I WOULD RECEIVE A RETURN CALL TO SCHEDULE AN APPOINTMENT AND WAS NEVER CALLED BACK.  THE SECOND TIME I WAS TOLD TO LEAVE A MESSAGE WITH JEANETTE IS SERVICE, WHICH I DID, AND ONCE AGAIN DID NOT RECEIVE A CALL BACK.  IT IS NOW NOVEMBER AND I HAVE NOT BEEN ABLE TO GET MY CAR REPAIRED.",
        "vin": "2HNYD18606H"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/13/2016",
        "dateOfIncident": "09/13/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10906191,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 ACURA MDX. WHILE DRIVING 40 MPH, THE VEHICLE STRUCK AN ELK. THE AIR BAGS FAILED TO DEPLOY. A POLICE REPORT WAS FILED AND THERE WERE NO INJURIES. THE VEHICLE WAS TOWED TO A DEALER. THE FAILURE MILEAGE AND VIN WERE UNKNOWN.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/26/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10898743,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS 2006 ACURA MDX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V344000 (AIR BAGS) HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PART DISTRIBUTION DISCONNECT.",
        "vin": "2HNYD18866H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/23/2016",
        "dateOfIncident": "08/23/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10897940,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 ACURA MDX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V344000 (AIR BAGS); HOWEVER, THE PART FOR THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "2HNYD18856H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/18/2016",
        "dateOfIncident": "07/12/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10885604,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2006 ACURA MDX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V344000 (AIR BAGS). THE PART WAS NOT MADE AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "2HNYD18896H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/07/2016",
        "dateOfIncident": "06/02/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10873030,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2006 ACURA MDX. THE CONTACT RECEIVED A NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 15V320000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED. THE CONTACT STATED THAT THE DEALER HAD NOT ACCOMMODATED THEM AS A CONSUMER TO HELP GET THE RECALL REMEDIED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "2HNYD188668"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/01/2016",
        "dateOfIncident": "04/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10852997,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE BEEN TRYING TO GET ACURA TO ACT ON THIS AIRBAG RECALL, BUT WE HAVE BEEN WAITING SINCE THIS PAST SUMMER.  WE ONCE LIVED A MERE 20 MINUTES FROM A DEALERSHIP, BUT NOW WE HAVE SINCE MOVED WHERE THERE IS NOT A DEALERSHIP WITHIN OUR STATE.  IT WAS ARRANGED FOR A HONDA DEALERSHIP TO ASSIST US, BUT ACURA HAS BALKED ON ASSISTING US WITH OUR 2.5 OF TRAVEL TIME TO THE HONDA DEALERSHIP DESPITE OFFERING TO PAY FOR TRANSPORTATION COSTS OR A RENTAL CAR, BUT WE CONTINUE TO WAIT.  WE ARE DRIVING DANGEROUSLY WITH THESE DAMAGED AIR BAGS THAT CAN CAUSE DEATH OR SERIOUS INJURY, AND ACURA HAS BEEN NEGLECTFUL IN THEIR RESPONSE AND DISINGENUOUS IN THEIR WANT TO ASSIST.",
        "vin": "2HNYD18866H"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/16/2015",
        "dateOfIncident": "05/13/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10790631,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "HAD VEHICLE IN ACURA OF WICHITA KS IGNITION SWITCH RECALL AND THE ALSO SAID THEY DID RECALL ON VSA  ECU MALFUNCTION RECALL13V-092  ID 589. PROBLEM CAME BACK SHORTLY AFTER VISIT TOO DEALERSHIP ,CALLED THEM AND TOLD THEM ABOUT WARNING LIGHTS STILL ON. THEY SAID ALREADY DONE RECALL. NOT A SATISFIED CUSTOMER AT ALL.IWONDER IF THEY EVEN CHANGED OUT WIRE HARNESS OR MAY OF EVEN INSTALLED USED PARTS. I LIVE 150 MILES FROM THE CLOSEST ACURA DEALER YOU WOULD THINK THEY WOULD OF AT LEAST OFFERED TO CHECK RECALL PART?",
        "vin": "2HNYD18676H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/14/2015",
        "dateOfIncident": "10/12/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10782242,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE TRANSMISSION CAN NOT SHIFT WHILE DRIVING ON THE ROAD .NO REVERSE AND FORWARD .THE VEHICLE HAVE 76000 MILES ON IT.",
        "vin": "2HNYD18996H"
    },
    {
        "components": "TRACTION CONTROL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/13/2015",
        "dateOfIncident": "05/15/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10781547,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 ACURA MDX. WHILE DRIVING APPROXIMATELY 35 MPH, THE VSA AND THE ECU WARNING LIGHTS ILLUMINATED. THE FAILURE RECURRED NUMEROUS TIMES. THE VEHICLE WAS TAKEN TO A DEALER WHERE THE FAILURE WAS UNDETERMINED. THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 13V092000 (SERVICE BRAKES, HYDRAULIC, TRACTION CONTROL SYSTEM). THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 105,000.",
        "vin": "2HNYD18856H"
    },
    {
        "components": "SERVICE BRAKES,ENGINE",
        "crash": true,
        "dateComplaintFiled": "08/26/2015",
        "dateOfIncident": "08/24/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10759584,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 ACURA MDX. WHILE ATTEMPTING TO PARK IN A RESIDENTIAL GARAGE, AN ABNORMAL NOISE EMITTED FROM THE ENGINE. THE BRAKES WERE ENGAGED AND THE VEHICLE SUDDENLY ACCELERATED AND CRASHED INTO THE GARAGE DOOR. THE VEHICLE THEN ACCELERATED INDEPENDENTLY IN REVERSE, MADE A TURN, AND CRASHED INTO A PARKED VEHICLE BEFORE STOPPING IN A NEIGHBOR'S FRONT YARD. THE FRONT DRIVER SIDE CURTAIN AIR BAG DEPLOYED. THE CONTACT MENTIONED THAT THE VEHICLE SPUN AROUND APPROXIMATELY FOUR TIMES IN THE MIDDLE OF THE STREET BEFORE COMING TO A COMPLETE STOP. A POLICE REPORT WAS FILED. THE CONTACT AND PASSENGER SUSTAINED MINOR INJURIES AND BOTH REQUIRED MEDICAL ATTENTION. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 101,000. ...UPDATED 09/28/15 *BF    *CN",
        "vin": "2HNYD18856H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/30/2015",
        "dateOfIncident": "03/02/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10722419,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED RECALL NOTICE 14V-351 REGARDING THE REPLACEMENT OF THE AIRBAG. I CONTACTED SOUTH COAST ACURA IN COSTA MESA, CA AND I WAS INFORMED THAT THE PART WOULD HAVE TO BE ORDERED. APPROXIMATELY 6 WEEKS LATER I CALLED TO FIND THE STATUS. I WAS INFORMED THAT THE PARTS HAD STILL NOT ARRIVED. IN ADDITION, I CALLED MISSION VIEJO ACURA IN MISSION VIEJO, CA TO SEE IF THEY HAD THE PARTS AVAILABLE. NOT ONLY WAS I INFORMED THAT THE PART WAS NOT AVAILABLE, BUT THAT REPLACEMENT OF THE PARTS WAS HIGHER PRIORITY IN STATES WITH HIGH HUMIDITY. I READ THE RECALL, AND IT SAYS NOTHING ABOUT STATES WITH HIGH HUMIDITY.    I THINK I AM BEING LIED TO BY THESE ACURA DEALERSHIPS, AND I WOULD LIKE TO HAVE MY COMPLAINT INVESTIGATED.THE RECALL CLEARLY SAYS THE DEFECT COULD KILL OR INJURE PEOPLE, AND I DON'T BELIEVE ACURA IS TAKING SUFFICIENT MEASURES TO MAKE SURE THE PARTS ARE AVAILABLE TO ENSURE MY SAFETY.",
        "vin": "2HNYD18896H"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/08/2015",
        "dateOfIncident": "04/21/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10671104,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN CRUISING 20-30 MILES, THE TRANSMISSION WOULD SHUTTER OR MAKE LOUD GRINDING NOISES AND VEHICLE WOULD SHAKE. DEALER COULDN'T DUPLICATE NOISE AND NOTHING WAS DONE UNTIL 2014. TRANSMISSION OIL WAS CHANGED AND IF PROBLEMS COMES BACK, THEY WOULD CHANGE IT. PROBLEM CAME BACK AND NOW MAKES TREMBLING NOISE AND FEEL IT WHEN REACHING SPEED OF 49 EXACTLY AND 1500RPM, DURING SHIFTING GEARS AND COULD GET STUCK. DEALER STATED IS NORMAL SOUND. NOW I HAVE CHECK ENGINE LIGHT WITH CODE P0706, WHICH IS OPEN IN TRANSMISSION RANGE SWITCH CIRCUIT PROBABLE CAUSE. SEARCHED AND IT SEEMS THAT THIS YEAR MODEL, ACURA MDX 2006, HAS HAD PROBLEMS WITH TRANSMISSIONS AND NO RECALLS. CAR MAKES NOISE WHILE THIS IS HAPPENING WHILE ON THE HIGHWAY. SOMETIMES THE TRUCK GETS STUCK DOING THIS UNTIL I ACCELERATE OR BRING DOWN THE SPEED ON THE HIGHWAY. THERE ARE MANY COMPLAINS WITH THIS ISSUE, AN ACURA HAS NOT ACKNOWLEDGE THE PROBLEM. I AM AFRAID TO HAVE AN ACCIDENT ON THE HIGHWAY OR THE VEHICLE GETS STUCK TRYING TO CHANGE GEARS.   *TR",
        "vin": "2HNYD18616H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/12/2014",
        "dateOfIncident": "11/03/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10663960,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 ACURA MDX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 14V351000 (AIR BAGS). THE CONTACT STATED THAT THE VEHICLE WAS UNABLE TO BE REPAIRED WITHIN A REASONABLE AMOUNT OF TIME. THE DEALER WAS CONTACTED, BUT DID NOT PROVIDE AN ESTIMATED DATE FOR WHEN THE VEHICLE COULD BE REPAIRED. THE MANUFACTURER STATED THAT THE VEHICLE WOULD BE SCHEDULED FOR REPAIR WITHIN 3-5 BUSINESS DAYS; HOWEVER, THE DEALER WAS UNABLE TO HONOR THE SCHEDULED REPAIR. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "2HNYD18946H"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/01/2014",
        "dateOfIncident": "06/15/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10640535,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "LIKE OTHERS WITH THE 06 MDX I HAD TO HAVE THE MOTOR MOUNTS REPLACED.  IT IS VERY POSSIBLE THE \"JUDDER\" AS HONDA CALLS THEM FROM THE TORQUE CONVERTER CAUSED THIS EVEN THOUGH I HAD THE COMPUTER SOFTWARE FIX.  THIS BECAME AN ISSUE AS THE VIBRATIONS FROM THE BAD MOTOR MOUNTS DAMAGED THE FRONT RIGHT HALF SHAFT/AXIAL AND I WAS TOLD I WAS VERY LUCKY IT DID NOT BREAK WHILE I WAS DRIVING ON THE HIGHWAY.  *TR",
        "vin": "2HNYD18226H"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/11/2014",
        "dateOfIncident": "07/10/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10609928,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION HAS PROBLEM SHIFTING AND DOWN SHIFTS WITHOUT NOTICE EVEN WHEN APPLYING PRESSURE ON GAS - CAUSING CAR TO SLOW.  DANGEROUS FOR CARS FOLLOWING BEHIND - ALMOST REAR ENDED.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/11/2014",
        "dateOfIncident": "01/14/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10563805,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JANUARY 14, 2014 MY DAUGHTER TOOK OUR 2006 MDX TO THE DEALER FOR MECHANICAL EVALUATION. THE CAR HAS BEEN HESITATING WHILE DRIVING, TRYING TO STOP THE CAR WHILE DRIVING. THE DIAGNOSE CAME BACK WITH THE FOLLOWING: TRANSMISSION NEEDS TO BE REPLACED AND ENGINE MOUNTS HAVE TO BE REPLACED AS WELL FOR THE TOTAL OF AROUND $7,200.  IN OCTOBER 2008 (MILEAGE 55K) THE ORIGINAL TRANSMISSION HAS BEEN REPLACED WITH A RE-MANUFACTURED PART. DECEMBER 2009 ORIGINAL SYMPTOMS (WHINING NOISE, SHUTTER AT 40-50 MPH) HAVE RECURRED AND HAVE BEEN REPORTED TO DEALER'S MECHANICS. THEY COULD NOT SEE ANY PROBLEMS.  DECEMBER 2010 WHINING NOISE STARTED COMING BACK AGAIN. DEALER'S MECHANICS COULD NOT FIND ANYTHING WRONG.  NOW WE ARE FACED WITH A TRANSMISSION THAT IS MALFUNCTIONING PLUS ENGINE MOUNTS HAVE TO BE REPLACED.  IN SPEAKING WITH ACURA'S CUSTOMER CARE I WAS INFORMED THAT THE TRANSMISSION REPLACED IN 2008 WAS NOT AN AUTHENTIC ACURA PART. I KEPT INSISTING ON MORE IN DEPTH EXPLANATION BUT DID NOT RECEIVE ANY.   IT IS MY UNDERSTANDING THAT IMPROPERLY WORKING TRANSMISSION CAUSES DAMAGE TO ENGINE MOUNTS. IT SEEMS ACURA DEALER'S MECHANICS HAVE SOMEWHATHOW MISSED IT.  ACURA IS NOT WILLING TO TAKE RESPONSIBILITY FOR ANY OF THEIR OMISSIONS. NOW THE CAR IS NO LONGER UNDER WARRANTY.  ALL OF DESCRIBED INSTANCES ARE A HUGE SAFETY HAZARD. PUTTING IN NON-AUTHENTIC PARTS UNDER THE LABEL OF WARRANTY IS A FRAUDULENT STEP. ALL SERVICES HAVE BEEN PERFORMED AT JERRY DAMSON HONDA DEALERSHIP IN HUNTSVILLE, ALABAMA.  I WOULD LIKE A FORMAL INVESTIGATION. IN ADDITION I FEEL THAT DEALERSHIP'S MECHANICS SHOULD GO THROUGH ADDITIONAL TRAINING TO AVOID FUTURE MISDIAGNOSES AND A REDUCE DANGER TO CONSUMERS.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/04/2014",
        "dateOfIncident": "02/03/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10562984,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TWO SEPARATE RELATED INCIDENTS TO TRANSMISSION LISTED FROM MOST RECENT:    1)  3FEB2014- TOTAL TRANSMISSION FAILURE ON HIGHWAY (APPROX. 65MPH) AT 116,804MI.  DEALERSHIP SERVICE NOTED THAT THE TRANSMISSION FLUID WAS OVERFILLED AND THE FAILURE IS INTERNAL.  THEY RECOMMENDED TRANSMISSION REPLACEMENT    2)  4APR2013-  NOTED THAT VEHICLE DID NOT ENGAGE IN PARK AFTER SHIFTED TO \"P\".  AFTER PLACING IT IN PARK, IT ROLLED BACK DOWN THE DRIVEWAY.  THIS FAULT IS INTERMITTENT AND OCCASIONALLY WILL EXHIBIT A RATCHET LIKE SOUND.  THE FAULT IS ONGOING.  DEALERSHIP CANNOT RECREATE FAILURE.  *TR",
        "vin": "2HNYD18886H"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/22/2014",
        "dateOfIncident": "11/20/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10560994,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "IN NOVEMBER 2013 WHILE THE MDX WAS PARKED OVERNIGHT, THE DRIVER SIDE REAR WINDOW REGULATOR FAILED AND THE WINDOW DROPPED DOWN INTO THE DOOR. TWO MONTHS LATER, IN JANUARY 2014, THE IDENTICAL FAILURE OCCURRED ON THE PASSENGER SIDE REAR WINDOW REGULATOR AND THAT WINDOW FELL INTO THE DOOR. IN BOTH CASES A PLASTIC PIECE THAT ANCHORS A CABLE SUDDENLY BROKE IN THE SAME MANNER WITHOUT WARNING. THIS FAILURE DOES NOT APPEAR TO BE AN IMPROBABLE EVENT, GIVEN THESE FACTS. I HAVE RETAINED BOTH BROKEN PARTS AND OFFERED THEM TO ACURA. HOWEVER, THEY ARE NOT INTERESTED IN INVESTIGATING THE INCIDENT.     WHEN THIS FAILURE OCCURS, THE WINDOW CANNOT BE ROLLED UP. THIS COULD BE A DRIVING HAZARD IF IT OCCURS IN WINDY, FOGGY, AND/OR RAINY WEATHER. BESIDES GREATLY DISTRACTING THE DRIVER, THERE IS NO WAY TO PREVENT EXCESSIVE MOISTURE FROM ENTERING THE CAR. THIS SITUATION MAY CAUSE WINDOWS TO FOG OR BECOME WET ON THE INTERIOR OF THE VEHICLE, IMPAIRING VISIBILITY. OBVIOUSLY, THE SECURITY OF THE VEHICLE IS COMPROMISED, AS WELL.  *TR",
        "vin": "2HNYD18936H"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/01/2013",
        "dateOfIncident": "12/21/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10554246,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "HFL ON MY 2006 MDX STOPPED WORKING A WHILE BACK. WHEN YOU PRESS THE TALK SWITCH, NOTHING HAPPENS. OCCASIONALLY, IT COMES ON, BUT NOT OPERATIONAL. WHAT I MEAN IS IT PROMPTS AND I CAN GO THROUGH THE MAIN MENU. BUT WHEN I TRY TO PAIR MY PHONE IT GOES INTO A NEVER ENDING SCANNING LOOP. IT DOESN'T APPEAR THAT ANY HANDSHAKING WITH THE PHONE IS ESTABLISHED. THIS SAME PHONE WORKS FINE WITH BLUETOOTH IN MY OTHER CAR AND OTHER DEVICES. SO, IT'S NOT THE PHONE.    FOR ALMOST AN YEAR, THE BATTERY ON THE MDX KEEP DRAINING AND I WOULD REQUIRE A JUMP START IF I DON'T USE IT FOR 2-3 DAYS.   IT LOOKS LIKE THE FAULTY BLUETOOTH HFL IS CAUSING THE BATTERY DRAIN.    MANY PEOPLE OUT THERE HAVE THE SAME PROBLEM, NOT ONLY WITH 2006 ACURA MDX, BUT ALSO WITH SOME DIFFERENT ACURA MODELS.   *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "08/07/2013",
        "dateOfIncident": "08/03/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10534171,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD THE RECALL FOR THE INTERLOCK DEFECT DONE ON MY ACURA 2006 MDX ON MARCH 15, 2015.  PARKED IN MY GARAGE, I GOT OUT OF THE CAR TAKING THE KEYS OUT OF THE IGNITION NOT REALIZING IT WAS IN NEUTRAL.  I WALKED BRIEFLY INTO THE HOUSE AND BACK OUT ONLY TO FIND MY CAR WAS STARTING TO ROLL OUT OF MY GARAGE.  I RAN TO JUMP IN AND TRY TO STOP THE CAR, ONLY TO HAVE THE OPEN DOOR CATCH MY OTHER VEHICLE IN THE DRIVE AND DAMAGE IT ALONG WITH THE ACURA. NEIGHBORS CAME TO MY RESCUE AFTER HEARING ME CALL OUT FOR HELP. ONE MAN PUSHED THE DOOR FURTHER FORWARD AS IT WAS IN A FORWARD, HYPER-EXTENSION POSITION WEDGED AGAINST THE OTHER CAR. THE OTHER MAN MANEUVERED MY OTHER CAR AWAY FROM THE ACURA.  A THIRD NEIGHBOR WENT INTO MY HOUSE FOR THE KEYS TO THE ACURA SO I COULD GET IT INTO PARK.  I FEEL THIS SHOULD BE AN ACURA PROBLEM SINCE I DID THE RECALL AND SUGGESTED AND THERE IS STILL A PROBLEM RESULTING IN AN ACCIDENT.  ACURA'S CUSTOMER RELATIONS WILL NOT HELP ME ON THE DAMAGE TO BOTH CARS AND WILL ONLY ADDRESS THE RECALL ONCE AGAIN.  I FEEL LUCKY THAT I ONLY HAD SOME BRUISES AND STRAINED MUSCLES.  I FEAR OTHERS MAY HAVE HAD THE RECALL DONE AND HAVE THE FAILURE AS I DID AND NOT BE SO LUCKY.  I WOULD APPRECIATE HELP IN PURSUING AN ACTION AGAINST ACURA TO GET THEM TO FIX BOTH MY CARS AND GET TO THE BOTTOM OF WHY THIS REPLACEMENT PART DIDN'T WORK. WAS THE PART ACTUALLY REPLACED AS SAID, WAS IT DONE WRONG, OR WAS THE PART REPLACED NOT THE ANSWER TO THE PROBLEM.   I HAVE FILED WITH USAA FOR HELP, BUT STILL FEEL ACURA IS RESPONSIBLE FOR THE DAMAGES TO BOTH VEHICLES.  A FRIEND OF MINE WAS ABLE TO DUPLICATE THIS PROBLEM THE NEXT DAY BY STARTING THE CAR, PUTTING THE CAR IN NEUTRAL, AND THEN SHUTTING OFF THE CAR AND PULLING THE KEY OUT WHILE STILL IN NEUTRAL.    OBVIOUSLY, THE  NEW LEVER KIT DID NOT CORRECT THE PROBLEM.  ANY SUGGESTIONS ON WHAT I CAN DO NOW?  *TR",
        "vin": "2HNYD18876H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/17/2013",
        "dateOfIncident": "04/29/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10525487,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING BETWEEN 20 AND 45 MPH TRANSMISSION JUDDER AND LOSES POWER. THE JUDDER NOISE CAUSE DAMAGE TO THE TRANSMISSION GEAR AND TORQUE CONVERTER.  *TR",
        "vin": "2HNYD18266H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/17/2013",
        "dateOfIncident": "09/21/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10525498,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "SECOND COMPLAINT-I OWN A 2006 ACURA MDX  I AM THE FIRST OWNER BOUGHT SUV NEW-ON NOVEMBER 2010 I RECEIVE A RECALL NOTICE  FROM AMERICAN HONDA MOTOR CO., INC. TO BRING SUV IN TO ACURA DEALER FOR TECHNICIAN TO UPDATE SOFTWARE FOR TRANSMISSION. THE UPDATE WILL HELP TRANSMISSION OPERATE PROPERLY, ASSURE LONGER LIFE-BEFORE TAKING SUV IN I HAD NO COMPLAINT SUV WAS OPERATING GREAT. AFTER RECALL FIX I STARTED TO HEAR AND FEEL SHUDDERING ,JUDDER, VIBRATION AT 20-45 MPH-MY MILEAGE THEN WAS 45,610- I IMMEDIATELY TOOK SUV BACK TO DEALER AND AFTER DIAGNOSTIC THEY CONFIRM NOISE, REPLACED TORQUE CONVERTER-THE NOISE RETURNED AFTER 2 MONTHS BETWEEN 20-45 MPH-MILEAGE THEN WAS 56,300- I RETURNED TO DEALER FOR A SECOND TIME-I INFORMED DEALER IT WAS THE SAME PROBLEM FROM THE PREVIOUS ISSUE THEY REPAIRED-THEY DISAGREED, TOLD ME IT WAS THE DRIVESHAFT AND REPLACED IT-THE NOISE RETURNED, SAME DAY I CALLED SERVICE MANAGER AND MADE COMPLAINT, HE SAID I SHOULD DRIVE SUV UNTIL NOISE BECOME LOUDER SO  TECHNICIAN WILL HEAR THE NOISE CLEARLY-  BY 62,536 MILEAGE NOISE BECAME LOUDER, I BROUGHT THE SUV IN A  3RD TIME, SAME PROBLEM-THEY KEPT SUV 2 DAYS RAN TEST AND CONFIRMED EVERYTHING I SAID-THE TRANSMISSION WAS BAD AND THEY REPLACED IT AND ALSO REPLACED THE TORQUE CONVERTER A SECOND TIME-SUV PERFORMED GREAT UNTIL 120,000 MILES WHICH IS ONLY 57,464 MILES FOR THE NEW TRANSMISSION WHEN THE SAME NOISES AND VIBRATIONS RETURNED, HOWEVER MY WARRANTY WAS UP-THERE  IS CLEARLY SOMETHING WRONG WITH TRANSMISSION-I TAKE GREAT CARE OF MY SUV-ITS PAID OFF IN FULL AND CURRENTLY I CANT AFFORD A CAR PAYMENT-I HOPED THIS CAR TOOK ME OVER 200,000 MILES LIKE MY1991 HONDA I PREVIOUSLY OWNED-I BUY ACURA BECAUSE OF QUALITY- THE NAME HONDA USE TO STAND FOR-I CONTACTED THE DEALER AGAIN AND WAS TOLD BRING SUV IN, THEY WILL PAY HALF THE COST TO FIX IT-TIME IS HARD THEY NEED TO COVER TOTAL BILL OR TRADE ME UP TO A NEWER SUV.  *TR",
        "vin": "2HNYD18266H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/10/2013",
        "dateOfIncident": "07/09/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10524068,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 ACURA MDX. THE CONTACT STATED THE TRANSMISSION OF THE VEHICLE SHUTTERED WHILE DRIVING 40 MPH. THE CONTACT STATED THE SHUTTERED STOPPED WHEN HE REMOVED HIS FOOT OFF OF THE ACCELERATOR PEDAL, BUT IT STARTED TO SHUTTER AGAIN WHEN THE PEDAL WAS ENGAGED. THE VEHICLE SHUTTERED BETWEEN THIRD AND FORTH GEAR. THE FAILURE WAS NOT DIAGNOSED BY THE DEALER. THE FAILURE AND CURRENT MILEAGE WAS 66,000.  *TR",
        "vin": "2HNYD18686H"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "03/04/2013",
        "dateOfIncident": "11/01/2011",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10501173,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 ACURA MDX. THE CONTACT STATED THAT WHILE PARKING HER VEHICLE, SHE HEARD A LOUD POPPING NOISE AND THE VEHICLE ERRONEOUSLY ACCELERATED CAUSING HER TO CRASH INTO A BUILDING. THE CONTACT RECEIVED MINOR ABRASIONS. THE POLICE WERE CONTACTED AND A REPORT WAS AVAILABLE. THE VEHICLE WAS LATER TOWED TO AN INDEPENDENT MECHANIC. AFTER DIAGNOSIS, THEY ADVISED HER THAT THE FAILURE OCCURRED DUE TO HER POSSIBLY DEPRESSING ON THE ACCELERATOR VERSUS THE BRAKES. THE MANUFACTURER WAS CONTACTED AND THEY OFFERED NO ASSISTANCE. THE FAILURE MILEAGE WAS APPROXIMATELY 98,000. THE CURRENT MILEAGE WAS APPROXIMATELY 103,000. THE VIN WAS UNAVAILABLE. *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "05/29/2012",
        "dateOfIncident": "05/27/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10459910,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ON WINDOW ROLLUP, REAR WINDOW SLID OUT OF DRIVE MECHANISM AND FELL TO THE BASE BEHIND DOOR PANEL.  GLASS DID NOT SHATTER, AND I WAS ABLE TO MANEUVER IT BACK INTO POSITION TEMPORARILY TO TAKE TO DEALERSHIP FOR REPLACEMENT OF DRIVE MECHANISM.  NO WEIGHT OR OBSTRUCTION WAS PUT ON WINDOW AS IT WAS BEING ELECTRICALLY CLOSED.  THIS IS THE THIRD TIME A REAR DRIVE MECHANISM HAS FAILED ON THIS VEHICLE.  BOTH OTHER REPLACEMENTS WERE HANDLED UNDER WARRANTY AND GOOD FAITH.  THIS UNFORTUNATELY IS GOING TO BE AN OUT OF POCKET FIX TO THE TUNE OF 350 DOLLARS.  I BELIEVE THAT THIS IS A FLAWED DESIGN AND COULD HAVE RESULTED IN BROKEN GLASS, AN UNSAFE SITUATION CONSIDERING MY DAUGHTER WAS IN CAR SEAT NEXT TO WINDOW. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/19/2012",
        "dateOfIncident": "03/24/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10459441,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "FIVE DAYS AFTER PASSING THE STATE CAR INSPECTION AT A HONDA DEALERSHIP, MY WIFE AND TWO SONS WERE DRIVING OUR MDX ON 146N WHEN THE CHECK ENGINE LIGHT CAME ON AND THE VEHICLE STALLED.  AFTER HAVING THE CAR TOWED TWICE, FIRST TO A LOCAL GARAGE (AS IT WAS AFTER 7 PM AND ON THE WEEKEND) AND THEN TO THE ACURA DEALERSHIP, ACURA TECHNICIANS CONFIRMED THE DIAGNOSIS OF THE GARAGE AND STATED THAT A SPARK PLUG HAD BEEN SUCKED INTO THE ENGINE RENDERING THE VEHICLE UNUSABLE WITH SIGNIFICANT ENGINE DAMAGE.  THE INITIAL COST ESTIMATE FOR REPAIR WAS $8,100 AS THE FOLLOWING PARTS NEEDED TO BE REPLACED:  ENGINE SHORT BLOCK, CYLINDER HEAD, GASKET KITS, COIL PACK, SPARK PLUG(S), ETC.  THE OWNER OF THE INDEPENDENT GARAGE HELPED MY WIFE TAKE SIDE-BY-SIDE PICTURES OF THE DAMAGE WHICH ARE AVAILABLE IF YOU WOULD LIKE TO SEE THEM.  AS THE DAMAGED PARTS HAD BEEN TAKEN OUT OF MY VEHICLE, AGAINST MY REQUEST, THESE PICTURES ARE ALL THAT I HAVE TO SHOW THE EXTENT OF THE DAMAGE.  I BELIEVE THIS IS A DEFECT IN THE VEHICLE AND SHOULD BE INVESTIGATED.    PLEASE NOTE THAT ACURA DOES NOT INSPECT SPARK PLUGS UNTIL 100K MILES AND THIS DAMAGE OCCURRED AT 84,553 MILES.  WE HAVE FOLLOWED THE MAINTENANCE SCHEDULE RECOMMENDED BY ACURA AND WERE JUST OUTSIDE OF OUR POWER TRAIN WARRANTY PERIOD AND BELIEVE THAT A LUXURY MANUFACTURER SHOULD STAND BEHIND THEIR PRODUCT ESPECIALLY FOR DAMAGE CAUSED BY A SPARK PLUG THAT IS NOT REQUIRED TO BE INSPECTED FOR ANOTHER 15,000 MILES.",
        "vin": "2HNYD18986H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/10/2011",
        "dateOfIncident": "10/10/2011",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10429369,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR HAD BEGUN SHUDDERING AT BETWEEN 30-40 MILES AN HOUR AND THEN AT A VERY LOW RPM IN 1ST GEAR, THE CAR STARTED JERKING HEAVILY.   THE DEALERSHIP FIRST SAID THEY WOULD CHARGE ME 125$ TO DIAGNOSE THE PROBLEM, UNLESS IT WAS THE TORQUE CONVERTER AS I HAD MENTIONED.    NOW THEY WANT 2800$ TO FIX THE PROBLEM.   - AT WHAT POINT IN TIME - AS I'VE NOW SEEN THIS AS A RECURRING PROBLEM WITH MDX'S DO THEY GIVE A RECALL?  THIS IS A YOUNG CAR.  *KB",
        "vin": "2HNYD18986H"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "09/07/2011",
        "dateOfIncident": "08/10/2011",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10424089,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 ACURA MDX. THE CONTACT STATED AFTER GETTING OUT OF HIS VEHICLE, IT BEGAN TO ROLL BACKWARDS CRASHING INTO ANOTHER VEHICLE. THE POLICE WERE NOT NOTIFIED NOR WAS ANYONE INJURED. THE VEHICLE WAS TAKEN TO THE DEALER WHO ADVISED HIM THAT THE IGNITION KEY CONVERTER FAILED AND NEEDED TO BE REPLACED. THE VEHICLE HAS NOT BEEN REPAIRED. THE MANUFACTURER WAS CONTACTED AND THEY OFFERED NO ASSISTANCE. THE FAILURE MILEAGE WAS APPROXIMATELY 100,200.  UPDATED 10/4/11 *CN  THE CONSUMER STATED THE VEHICLE WOULD ROLL IN ANY GEAR POSITION.  THE CONSUMER WAS ABLE TO REMOVE THE KEY FROM THE IGNITION WITH THE HEAR STILL IN DRIVE. THE DEALER PERFORMED A PCM UPDATED AND REPROGRAM. UPDATED 01/19/12",
        "vin": "2HNYD18886H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/13/2011",
        "dateOfIncident": "01/30/2011",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10400723,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 ACURA MDX 77,000 MILES BAD TORQUE CONVERTER. MY CONCERN IS I AM WARRANTEED UNTIL 10/2012 OR 100,000 MILES WHAT HAPPENS IF THIS HAPPENS AGAIN AND I DO NOT HAVE A WARRANTY. THERE ARE QUITE A FEW COMPLAINTS IN REGARDS TO THE TORQUE CONVERTER GOING ON ACURA MDX FROM 2001-2006 MODELS AT LOW MILES.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/15/2011",
        "dateOfIncident": "11/13/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10390309,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 ACURA MDX SHUDDERS AND VIBRATES WHEN ACCELERATING, APPROXIMATELY BETWEEN 30 - 40 MPH.  THE SHUDDERING IS PREDICTABLE, OCCURS NEARLY EVERYTIME THE CAR IS DRIVEN.  ACURA SERVICE ADVISED US THE TORQUE CONVERTER IS SLIPPING INTERNALLY AND NEEDS REPLACEMENT (IN WRITING).  NOW ACURA SERVICE STATES THEY WILL CONDUCT THE TRANSMISSION SOFTWARE UPDATE WHICH SHOULD FIX THE ISSUE.  THE CAR IS STILL UNDER WARRANTY, HOWEVER, ONLY 1100 MILES ARE REMAINING ON THE WARRANTY.  FROM RESEARCHING THE ISSUE, IT IS CLEAR OTHER ACURA MDX OWNERS ARE EXPERIENCING SIMILAR ISSUES.  THE DEALER TOLD ME THEY HAD NEVER HEARD OF THIS ISSUE WHEN I ORIGINALLY REPORTED MY CONCERN IN NOVEMBER 2010, HOWEVER, THEY WOULD LOOK INTO IT.  THE ISSUES BEING EXPERIENCED WITH THIS CAR APPEAR TO BE ON PAR WITH OTHER MDX TRANSMISSION ISSUES, THIS APPEARS TO BE NOTHING NEW.  *TR",
        "vin": "2HNYD182X6H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/17/2011",
        "dateOfIncident": "11/15/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10383033,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE SHUDDERS AND VIBRATES BETWEEN 35-40 MPH. WILL BE TAKING TO A DEALER ON FRIDAY 18FEB2011 FOR INSPECTION. THIS HAS HAPPENED BEFORE ALSO BUT I WAS NOT SURE WHAT IT WAS. THIS NORMALLY OCCURS WHEN ACCELERATING AT SPEEDS BETWEEN 30 AND 45 MPH.       ALSO RECEIVED A LETTER REGARDING SOFTWARE UPDATES FOR THE TRANSMISSION IN DECEMBER 2010. IT SAID THAT THIS UPDATE HAS BEEN ISSUED IN SEPTEMBER 2009, BUT I WAS NEVER INFORMED OF THIS UPDATE EARLIER. ACURA MYACURA.COM WEBSITE ALSO DOES NOT HAVE ANY INFORMATION ON THIS.  *TR",
        "vin": "2HNYD18756H"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/27/2011",
        "dateOfIncident": "01/17/2011",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10380249,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "RECENTLY PURCHASED 06 MDX.  DIDN'T NOTICE THE TRANSMISSION ISSUE RIGHT AWAY.  ABOUT MONTH AFTER PURCHASE, I NOTICED SHUTTER/GRINDING/JUDDER/WHISTLING COMING FROM THE TRANSMISSION.  TOOK IT INTO ACURA DEALER.  ACURA REPLACED TORQUE CONVERTER AND UPDATED PCM SOFTWARE UNDER WARRANTY.  ABOUT WEEK LATER, STARTED NOTICING THE SAME SHUTTERING NOISE COMING FROM TRANSMISSION AGAIN BUT ITS NOT AS NOTICEABLE BUT DEFINITELY NOTICEABLE AND THE PROBLEM IS STILL THERE. ACURA DID NOT \"FIX\" THE PROBLEM.  IT SEEMS ACURA HAD FIXED THE \"SEVERITY\" OF IT TO THE POINT WHERE YOU CAN ONLY SLIGHTLY HEAR IT.  AFTER BEING THOROUGHLY FRUSTRATED WITH THIS ISSUE, I STARTED RESEARCHING THE INTERNET AND FOUND OUT THERE ARE MANY MANY MANY MANY OTHERS WITH THIS SAME PROBLEM.  IT SEEMS THAT THERE IS NO PERMANENT FIX.  NUMEROUS OWNERS HAVE SAME REPEAT PROBLEMS EVEN AFTER REPLACING THE ENTIRE TRANSMISSION.  THE PROBLEM SEEMS TO BE THAT OF A \"DESIGN\" OF TRANSMISSION ERROR BY THE ACURA SO ESSENTIALLY, ONLY PERMANENT FIX WOULD BE TO REPLACE THE TRANSMISSION WITH THE NEWLY REDESIGNED TRANSMISSION.  IF YOU REPLACE THE SAME PARTS OVER AND OVER, YOU WILL HAVE SAME PROBLEMS OVER AND OVER.  ACURA FAILS TO ACKNOWLEDGE THIS.  IF YOU TAKE THE CAR TO ANY ACURA DEALER, THEY WILL VEHEMENTLY DENY THERE IS TRANSMISSION PROBLEMS(I AM SURE THEY'RE TRAINED BY THE CORPORATE TO DENY, DENY, DENY).  UNFAIR.  ESSENTIALLY, MY CAR IS A \"LEMON\" ALBEIT A USED LEMON....",
        "vin": "2HNYD18216H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/14/2010",
        "dateOfIncident": "04/15/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10370685,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 ACURA MDX WITH 34000 MILES, START TO HAVE INTERMITTENT TRANSMISSION \"SHUDDER\" AROUND 40MPH, BRING TO THOMAS ACURA DEALER TO CHECK FOR TWO TIMES AND WAS TOLD TO CHANGE THE CONVERTER BECAUSE OF \"NORMAL\"STRESS OF THE TRANSMISSION. IN ADDITION, DEALER SUGGEST TO CHANGE TRANSMISSION OIL BUT I JUST DID IT 6 MONTHS AGO.   *TR",
        "vin": "2HNYD18236H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/03/2010",
        "dateOfIncident": "12/03/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10369044,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "1.  NORMAL DRIVING MY 2006 ACURA MDX (ORIGINAL OWNER 55000 MILES)  2. ACURA TOLD ME THE TORQUE CONVERTER IS BAD  3. THEY WILL PAY FOR THIS 2600.00 REPAIR, BUT THE PROBLEM IS KNOWN TO COME BACK. *TR",
        "vin": "2HNYD18976H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/12/2010",
        "dateOfIncident": "09/03/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10365474,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ACURA MDX 2006 AT 70,000 MILES BEGAN MAKING A GRINDING NOISE, SPORADICALLY AT FIRST, WHEN CAR WAS RUNNING BETWEEN 30-35 MILES PER HOUR.  RPM'S ALSO JUMPED WHEN GRINDING OCCURRED.  TOOK IT TO AN INDEPENDENT TRANSMISSION SHOP AND WAS DIAGNOSED AS NEEDING A NEW TRANSMISSION.  TOOK IT TO AN ACURA DEALER FOR A SECOND OPINION.  THEY DIAGNOSED IT AS NEEDING A NEW TORQUE CONVERTER.  NOW IN NEGOTIATIONS WITH ACURA FOR THE REPAIR.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/11/2010",
        "dateOfIncident": "11/08/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10365343,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I CURRENTLY OWN A 2006 ACURA MDX. THE VEHICLE CURRENTLY HAS 86,000 MILES AND HAS BEEN SERVICED EXCLUSIVELY BY ACURA. ALL RECOMMENDED SERVICES HAVE BEEN PERFORMED BY ACURA. THE CAR WAS JUST RETURNED TO ME AFTER HAVING ITS 3RD TRANSMISSION REPLACED. THIS TIME THE CAR BROKE DOWN DURING AN ACCELERATION ONTO A MAJOR HIGHWAY ALMOST CAUSING A TRAFFIC INCIDENT. THE TRANSMISSION HAS BEEN IDENTIFIED AS A FAILURE BY ACURA AND HAS BEEN REPLACED BY THEM EACH TIME UNDER WARRANTY. *TR",
        "vin": "2HNYD18896H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/27/2010",
        "dateOfIncident": "10/20/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10362600,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TORQUE CONVERTOR FAILED AT 81,000.  REPLACED AT DEALERSHIP, VERY EXPENSIVE TO REPLACE AND NO GUARANTEE IT WON'T CAUSE PROBLEMS TO TRANSMISSION OR TRANSMISSION WILL NEED TO BE REPLACED. *TR",
        "vin": "2HNYD18836H"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "10/08/2010",
        "dateOfIncident": "06/11/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10359768,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 ACURA MDX. ATTORNEY WRITES ON BEHALF OF CLIENT REGARDING A DEFECTIVE SEAT BELT *TGW  THE ATTORNEY STATED HER CLIENTS SON WAS INJURED WHEN HIS 4 YEAR OLD SON HAD WRAPPED THE OVERHEAD SEAT BELT AROUND HIS NECK AND APPEARED TO BE CHOKING. WHEN THE CONSUMER APPLIED THE BRAKE IN A PANIC, THE SEAT BELT BEGAN CONSTRICTING. THE CONSUMERS WIFE THEN WEDGED HER FINGERS BETWEEN HER SON'S NECK AND THE NOOSE CREATED BY THE SEAT BELT.  THE CONSUMER THEN RUSHED TO THE NEAREST EXIT AND WAS ABLE TO RETRIEVE A PAIR OF SCISSORS, AND CUT THE SEAT BELT WHICH HAD CONTINUED TO TIGHTEN UPON APPLICATION OF THE BRAKES.  THE CONSUMERS SON SUFFERED ABRASIONS AND CONTUSIONS TO HIS NECK. *JB  UPDATED 10/20/10.*JB",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "09/12/2010",
        "dateOfIncident": "01/01/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10355063,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "08L14-E09-200",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "TORQUE CONVERTER SHUDDER AND VIBRATE BETWEEN 35-40 MPH. *TR",
        "vin": "2HNYD18266H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/27/2010",
        "dateOfIncident": "07/01/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10345591,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT 2006 MDX MAY 2010 WITH 107,000 KM, NOW COMING TO 110,000 AFTER PUTTING 3K I AM STARTING TO GET VIBRATION/SHUDDER/GRINDING BETWEEN 40-65KMH WHILE ACCELERATING, LUGGING POWER WHEN I TURN RIGHT OR LEFT ON SLOW 20KMH.  I GUESS THIS VEHICLE STILL UNDER POWER TRAIN WARRANTY TO FIX THIS ISSUES OR DO I HAVE ANY OTHER OPTION TO RESOLVE THIS ISSUES. *TR",
        "vin": "2HNYD189X6H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/05/2010",
        "dateOfIncident": "07/04/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10341493,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE SHUDDERS AT 30 -40MPH. *TR",
        "vin": "2HNYD18666H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/01/2010",
        "dateOfIncident": "07/01/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10341042,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 06 MDX TORQUE CONVERTER WAS REPLACED IN DEC 09, JUNE 2010 BACK IN FOR THE SAME THING. HONDA DOESN'T HAVE A FOR SURE FIX, SO IT IS POSSIBLE I WILL HAVE TO DRIVE IT UNTIL THEY COME UP WITH SOMETHING ELSE THAT WILL FIX THE PROBLEM. WHO KNOWS HOW LONG THAT WILL TAKE? THIS PROBLEM IS UNFAIR TO THOSE OF US WHO OWN THESE CARS, HONDA NEEDS TO MAKE THIS RIGHT AND NOT BE ALLOWED TO GET AWAY WITH THIS. I'VE OWNED THIS CAR FOR 8MONTHS, THE DEALERSHIPS ARE ALL AWARE OF THE PROBLEM WITH THESE CARS, BUT FAILED TO DISCLOSE THIS INFORMATION. I'VE ENJOYED THIS CAR MAYBE ONE MONTH BEFORE THE PROBLEMS AROSE. NEED HELP! *TR",
        "vin": "2HNYD18286H"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/09/2010",
        "dateOfIncident": "05/06/2006",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10329438,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TOPIC:  UNCOMMANDED ACCELERATION; LACK OF ACCELERATION;    INCIDENTS OCCURRED OVER THE COURSE OF 3 WEEKS (USED 2006 ACURA MDX PURCHASED ON APRIL 12, 2010).    SHORTLY AFTER PURCHASE, VEHICLE EXHIBITED \"STUMBLE\" WHEN ACCELERATOR WAS PUSHED.  THAT IS, THE ENGINE RPM DECREASED WITH INCREASING PEDAL PRESSURE.  PRESSING DOWN AGGRESSIVELY RESULTED IN ENGINE IDLE CONDITION.  THIS OCCURRED 0.5 MILES FROM HOME.  PROBLEM DID NOT CONTINUE THE NEXT MORNING.    ON MAY 3, 2010, WHILE COASTING THROUGH AN INTERSECTION AT APPROXIMATELY 35MPH, VEHICLE SUDDENLY ACCELERATED WITHOUT PEDAL INPUT.  CRUISE CONTROL LIGHT WAS OBSERVED ON (CRUISE CONTROL HAD NOT BEEN ENGAGED PRIOR TO INCIDENT).  LIGHT BRAKE PRESSURE STOPPED ACCELERATION AND VEHICLE RETURNED TO NORMAL OPERATION.    ON MAY 6, 2010, VEHICLE \"STUMBLE\" RE-OCCURRED.  PULLING THROUGH AN INTERSECTION WHILE PRESSING ON ACCELERATOR, VEHICLE RPM DROPPED.  MORE ACCELERATOR PRESSURE RESULTED IN MORE RPM DROP.  PULLED TO SIDE OF ROAD AND STOPPED.  WITH VEHICLE IN NEUTRAL OR PARK, ENGINE RESPONDS NORMALLY TO ACCELERATOR.  PUTTING VEHICLE IN ANY FORWARD GEAR, PROBLEM PERSISTS.  I WAS ABLE TO SLOWLY ACCELERATE WITH VERY GENTLE ACCELERATOR PRESSURE, BUT RATE OF ACCELERATION WAS VERY SLOW AND POTENTIALLY DANGEROUS DUE TO HEAVY RUSH HOUR TRAFFIC.    I WAS ABLE TO SLOWLY DRIVE THE VEHICLE APPROXIMATELY 3 MILES BACK TO THE USED CAR DEALER WHERE THE VEHICLE WAS BOUGHT.  AT END OF TRIP, VEHICLE WAS UNABLE TO CLIMB A MODEST INCLINE AND I HAD TO STOP.  TURNED OFF ENGINE HOPING THAT PROBLEM WOULD CLEAR.  WAITED SEVERAL MINUTES AND TRIED TO RE-START.  TOOK SEVERAL ATTEMPTS BEFORE ENGINE WOULD \"CATCH\" AND RUN NORMALLY.  WAS ABLE TO SLOWLY CLIMB THE INCLINE BACK TO THE CAR LOT.  PROBLEM PERSISTED AT USED CAR LOT.    VEHICLE WAS TOWED THE NEXT MORNING TO ACURA DEALERSHIP IN CHAPEL HILL, NC.  PROBLEM CLEARED AND DEALER WAS UNABLE TO OBSERVE SYMPTOMS.  DEALER CLAIMS THAT THERE ARE NO ANOMALOUS COMPUTER CODES.    I BELIEVE VEHICLE IS UNSAFE TO DRIVE. *TR",
        "vin": "2HNYD18286H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/22/2010",
        "dateOfIncident": "04/22/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10327019,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 ACURA MDX CAN BE STOPPED AND KEYS REMOVED WITHOUT SHIFTING TO PARK.   WE NOTICED THIS IN AN INCIDENT IN A SHOPPING MALL PARKING LOT WHEN CAR WAS PARKED AND MISTAKENLY LEFT IN DRIVE.   KEYS WERE REMOVED AND CARS STARTED ROLLING AS IF IT WERE IN NEUTRAL.   SINCE THE INCIDENT WE HAVE VERIFIED THAT KEYS CAN BE REMOVED WHEN IT IS NOT IN PARK. THE CAR WILL ROLL FREELY WHEN IT IS IN DRIVE OR REVERSE.   FROM ANOTHER REPORT ON YOUR SITE ON 3/24/2009 WE ARE NOT THE ONLY ONES WITH THIS ISSUE.   WHILE THERE WAS NO LOSS FOR US THIS APPEARS THAT IT IS AN ISSUE THAT NEEDS TO BE ADDRESSED. *TR",
        "vin": "2HNYD18256H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/08/2010",
        "dateOfIncident": "10/13/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10324508,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2006 MDX AND WHEN IT HAD ABOUT 55,000 MILES ON IT I STARTED TO NOTICE A SHAKING/LURCHING FEELING WHEN GOING ABOUT 30-40MPH WHILE ACCELERATING.  I TOOK THE CAR INTO AND ACURA DEALERSHIP AND THEY REPLACED THE TORQUE CONVERTER, UNDER WARRANTY.  WHEN I PICKED THE CAR UP THEY SAID THAT IT SHOULD NEVER HAPPEN AGAIN AND IF IT DID THEN THERE SHOULD BE SOME KIND OF RECALL DONE.  WELL, 10,000 MILES LATER AND IT IS HAPPENING AGAIN.  I TOOK THE CAR BACK TO THE DEALERSHIP AND OF COURSE THEY CAN'T RECREATE THE PROBLEM WHICH MEANS THEY DON'T HAVE TO FIX THE REAL PROBLEM.  THE CAR IS NO LONGER UNDER WARRANTY!! *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/18/2010",
        "dateOfIncident": "10/08/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10320778,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 ACURA MDX. WHEN THE CONTACT DROVE THE VEHICLE BETWEEN 35-40 MPH,  THE CONTACT HEARD A RUMBLING SOUND COMING FROM THE DRIVE TRAIN AND THE VEHICLE BEGAN TO VIBRATE. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THE CONTACT HAD THE TORQUE CONVERTER AND THE ECU REPLACED. THERE WERE NO PRIOR WARNINGS. THE CURRENT AND FAILURE MILEAGES WERE 67000.",
        "vin": "2HNYD18916H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/24/2010",
        "dateOfIncident": "02/23/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10313553,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2006 ACURA MDX WITH FUNNY SOUNDS COMING FROM DRIVETRAIN AREA. IF U DECELERATE TO 30-40 MPH, THEN SLIGHTLY ACCELERATE, THERE IS A VIBRATING/SHUTTERING SOUND FOLLOWED BY A CLUNKING SOUND AS ATTEMPTS TO SHIFT GEARS. I HAD A SERVICE MANAGER RIDE WITH ME AND HE SAID HE HAS NEVER HEARD ABOUT THIS.  I DID SOME RESEARCH AND FOUND OUT ON EDMUNDS.COM THAT THERE ARE NUMEROUS CONSUMERS HAVING THE SAME ISSUE AND THEY HAD TO HAVE THE TORQUE CONVERTER AND IN MOST CASES A NEW TRANSMISSION AT THEIR EXPENSE, BECAUSE THE CAR IS OUT OF WARRANTY WHEN THIS OCCURS.  I AM ABOUT TO BE IN THE SAME POSITION, SINCE I AM HAVING NOISE ISSUES, I IMAGINE IT IS ONLY A MATTER OF TIME BEFORE I HAVE TO HAVE IT REPLACED AT MY EXPENSE. I WAS TOLD THERE ISN'T A RECALL AS OF YET ON THE 2006 ACURA MDX, BUT READ MANY PEOPLE HAVING THIS SAME ISSUE.  CAN YOU PLEASE HELP ME BECAUSE I CAN NOT AFFORD TO OUTLAY 5000 TO 6000 DOLLARS DUE TO MANUFACTURER'S ISSUE. *TR",
        "vin": "2HNYD18606H"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/06/2010",
        "dateOfIncident": "01/01/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10307107,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKES MAKE A LOUD CLANKING, CLICKING NOISE. IT SEEMS LIKE THE PADS ARE SHIFTING AND SOMETIMES IT SOUNDS LIKE THEY ARE ABOUT TO TEAR RIGHT OUT OF THE CALIPERS. WE PURCHASED THE VEHICLE USED STILL UNDER WARRANTY AND WITHIN A WEEK RETURNED TO THE DEALER AND IT HAS BEEN THERE 3 TIMES SINCE IN THE PAST 10 MONTHS AND THEY CONTINUE TO TELL ME ITS NORMAL. THE NOISE IS SO LOUD PEOPLE TUNR AROUND IN PARKING LOTS JUST TO SEE WHERE THE NOISE IS COMING FROM AND WE ARE AFRAID IT IS NOT SAFE. I FOUND THAT MANY PEOPLE ARE COMPLAINING OF THE SAME PROBLEM ONLINE. SOMETHING NEEDS TO BE DONE.  *CN",
        "vin": "2HNYD18826H"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "02/01/2010",
        "dateOfIncident": "01/30/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10303549,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I FEEL THERE IS A GENERIC PROBLEM FOR ALL ACURA MDXS RELATING TO THE  DOOR LOCK ACTUATOR.  THE POWER DOOR LOCK IN THE REAR PASSENGER DOOR IN MY 2006 ACURA MDX STOPPED LOCKING/UNLOCKING 2,500 MILES PAST THE WARRANTY.  I NOW HAVE TO MANUALLY LOCK/UNLOCK THE DOOR.  IF I FORGET THE POWER LOCK IN THE DOOR ISN'T WORKING, MY CHILD SITTING NEXT TO THE DEFECTIVE DOOR CAN OPEN IT ANDS FALL OUT OF THE CAR.  I'VE BEEN READING A LOT OF COMPLAINTS ON THE INTERNET ABOUT THIS GENERIC PROBLEM FOR ALL ACURA MDXS. *TR",
        "vin": "2HNYD18246H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/08/2009",
        "dateOfIncident": "11/15/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10294929,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ACURA MDX TRANSMISSION FAILURE / CATALYTIC CONVERTER. *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/07/2009",
        "dateOfIncident": "08/15/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10286675,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 ACURA MDX WITH 68,500 MILES HAS A SHUDDER FEELING AT SPEEDS BETWEEN 35 AND 45 MPH.  THE VEHICLE HAS BEEN INTO THE DEALER TWICE AND THE SERVICE TECHNICIAN HAS STATED THAT IT IS A TORQUE CONVERTER PROBLEM, HOWEVER REFUSE TO FIX THE PROBLEM.  *TR",
        "vin": "2HNYD18696H"
    },
    {
        "components": "STEERING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/31/2009",
        "dateOfIncident": "07/17/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10278991,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ACURA MDX 2006 LOST STEERING POWER WHILE DRIVING AND HAD TO EMERGENT STOP AND THE VEHICLE CANNOT BE DRIVEN ANYMORE.  TOW TRUCK DRIVER FOUND THE CRANK PULLEY LYING ON THE GROUND.  OBVIOUSLY IT'S SEPARATED FROM THE VEHICLE. *TR",
        "vin": "2HNYD18206H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/24/2009",
        "dateOfIncident": "03/21/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10262871,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECENTLY PURCHASED A 2006 CERTIFIED USED ACURA MDX BASE MODEL. I WAS EXITING THE VEHICLE AND ACCIDENTALLY LEFT THE GEAR IN PARK (AUTOMATIC TRANSMISSION). I REMOVED THE KEY WITHOUT NOTICING IT WAS IN DRIVE AND WHEN I GOT OUT OF THE VEHICLE IT STARTED ROLLING BACKWARDS. I NOTICED AND JUMPED IN AND HIT THE BRAKE, BUT WAS SURPRISED TO REALIZE IT WAS IN GEAR AND ALLOWED ME TO REMOVE THE KEY. SO I TRIED AGAIN AND SAME THING HAPPENED WHETHER I WAS IN DRIVE OR REVERSE, I AM ABLE TO REMOVE THE KEY AND THE CAR WILL ROLL LIKE IT IS IN NEUTRAL. I CANNOT REINSERT THE KEY WITHOUT MOVING THE SHIFTER BACK TO PARK. I BELIEVE THIS IS AN ISSUE WITH THE VEHICLES INTERLOCK AFTER DOING SOME RESEARCH ON SIMILAR INCIDENTS WITH JEEP AND PONTIAC. THIS IS VERY DANGEROUS AND I WOULD REALLY LIKE TO SEE A RECALL BE DONE TO FIX THIS PROBLEM. *TR",
        "vin": "2HNYD182X6H"
    },
    {
        "components": "ELECTRICAL SYSTEM,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "02/25/2009",
        "dateOfIncident": "02/24/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10259906,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Interstate Trailer, Inc.",
                "productMake": "INTERSTATE",
                "productModel": "BATTERY",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "BOUGHT A NEW MDX. BATTERY FAILED THE FIRST DAY(8/28/2006). 100 MONTH BATTERY REPLACED. BATTERY FAILED 2/24/2009. ACURA HAD NO EXPLANATION FOR BATTERY PROBLEMS. WARRANTY BOOK SAID DO NOT DRIVE CAN CAUSE SOMEONE BEING KILLED. WE HAD CAR TOWED. *TR",
        "vin": "2HNYD18806H"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "12/30/2008",
        "dateOfIncident": "12/14/2008",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10253221,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 ACURA MDX.  WHEN PLACING HER CHILD IN THE THIRD ROW SEAT, THE CONTACT NOTICED THAT THERE WAS NO SETTING FOR THE MIDDLE HEADREST FOR SMALL KIDS.  THE CONTACT FEELS THAT THIS IS A SAFETY ISSUE FOR YOUNG KIDS BECAUSE THE HEADREST ONLY HAD TWO POSITIONS.  IF THE CHILD IS NOT THE CORRECT HEIGHT, HE OR SHE WOULD BE UNABLE TO UTILIZE THE HEADREST.  THE MANUFACTURER ADVISED THE CONTACT TO READ THE OWNER'S MANUAL AND TAKE THE VEHICLE TO THE DEALER TO BE INSPECTED.  THE FAILURE MILEAGE WAS 69,000 AND CURRENT MILEAGE WAS 74,000.",
        "vin": "2HNYD28468H"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "03/10/2007",
        "dateOfIncident": "03/10/2007",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10184705,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "A/C COMPRESSOR FAILS, WHEN AC IS TURNED ON NO COOL AIR COMES OUT.  *JB",
        "vin": "2HNYD18646H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/10/2006",
        "dateOfIncident": "10/08/2006",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10170337,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "YESTERDAY AFTERNOON WHEN I  TOOK IT OUT, THE VSA AND THE VTM4-LOCK LIGHTS WERE ON AND WOULDN'T GO OFF.  AND THE DRIVE  EXTREMELY SLUGGISH.   NO ACCELERATION AND IT WOULDN'T GO ANY HIGHER THAT 25 MPH.  EVEN GETTING IT TO 25 MPH TOOK OVER 1-2  MINUTES, FELT LIKE ETERNITY.  MADE IT TO POHANKA FINALLY.  COULDN'T ACCELERATE TO MERGE, COULDN'T GO UPHILL ON EVEN SLIGHT INCLINES, THIS IS A SAFETY ISSUE.       WHAT IF THIS HAPPENS .  *NM",
        "vin": "2HNYD18946H"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/15/2006",
        "dateOfIncident": "09/09/2006",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10168342,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE DRIVING 65 MPH, THE ACCELERATOR PEDAL BECAME STUCK IN THE DOWN POSITION.  AS THE VEHICLE ACCELERATED, THE CONTACT APPLIED THE VEHICLE BRAKES FOR 5 MILES, RESULTING IN THE BRAKES AND ROTORS OF THE VEHICLE BURNING OUT.  THERE WERE NO WARNING SIGNALS PRIOR TO THE INCIDENT.  THE VEHICLE WAS TAKEN TO A SERVICE DEALER, WHO WAS UNABLE TO DETERMINE THE PROBLEM, AND CONSIDERED IT TO BE DRIVER ERROR.",
        "vin": "2HNYD18656H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/17/2006",
        "dateOfIncident": "08/17/2006",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10165757,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A NEW 2006 ACURA MDX AND FROM THE FIRST TIME I DROVE IT HOME, I COULDN'T DRIVE OVER 55 MPH WITHOUT THE STEERING WHEEL SHAKING SO BAD I COULD BARELY HOLD IT. SINCE THEN, WITHIN THE LAST MONTH AND HALF IT HAS BEEN IN LINDSEY ACURAS REPAIR SHOP 3 TIMES AND THEY STILL CANNOT REPAIR THE PROBLEM. IS THERE A LEMON LAW FOR THIS PROBLEM WERE WE COULD REPLACE THE VEHICLE. IT IS NOT SAFE TO DRIVE ON THE FREEWAY. MAYBE YOU COULD HELP ME PLEASE. THANK YOU.  *NM",
        "vin": "2HNYD18296H"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "08/15/2006",
        "dateOfIncident": "08/05/2006",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10165543,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 ACURA MDX WITH 12000 MI HAS A PPG (WINDSHIELD MANUFACTURE) WINDSHIELD DEFECT.  WINDSHIELD HAS A 20 INCH (HOOK SHAPE) EDGE CRACK FROM PASSENGER SIDE STARTING FROM THE FIRST TWO INCHES OF THE PERIMETER.  PROBABLY CAUSE IS \"RESIDUAL STRESS\" AND \"INDUCE STRESS\" DUE TO INSTALLATION OR DESIGN FLAW.  BOTH ARE MANUFACTURE DEFECTS.  ACURA DEALER REFUSED TO INVESTIGATE AND REPLACE WINDSHIELD DEFECT.  SERVICE MANAGER CLAIMED THAT IT WAS A 140 MPH IMPACT.  IF THAT WAS TRUE, THE WHOLE WINDSHIELD WOULD OF BEEN SHATTERED.  FACT IS, THE POINT OF IMPACT IS THE SIZE OF A PENCIL TIP.  PRIOR TO DISCOVERING THE CRACK, THERE IS NO APPARENT OR OBVIOUS DEBRIS IMPACT.  ACTUALLY, MY WIFE WAS SITTING IN THE PASSENGER SIDE THE WHOLE TIME UNTIL THE CRACK STARTED AND NOTHING HAD STRUCK THE WINDSHIELD.  PLEASE INVESTIGATE THIS ISSUE.  POSSIBLE LINK TO HONDA ELEMENT'S SAME ISSUES.  AFTER ALL, HONDA MAKES ACURA.            *NM",
        "vin": "JH4DC444XTS"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/27/2006",
        "dateOfIncident": "05/25/2006",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10158433,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BLUE-WHITE HALOGEN LIGHTS SHOULD BE OUTLAWED.  THE GLARE IS OVERWHELMING AND DANGEROUS.  IT IS A DISTRACTION WHILE DRIVING AND LIKELY LEADS TO ACCIDENTS, LIKE ANY OTHER DISTRACTION INTERFERES WITH ATTENTIVENESS.  THE GLARE IN REAR VIEW MIRRORS CAUSES DRIVERS TO UNNECESSARILY PLACE THE REAR VIEW MIRROR IN \"NIGHT DRIVING\" POSITION, WHICH LIMITS ABILITY TO SEE ORDINARY OBJECTS.  *NM",
        "vin": ""
    }
]