[
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/13/2007",
        "dateOfIncident": "09/01/2006",
        "fire": false,
        "manufacturer": "4-Star Trailers, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10202960,
        "products": [
            {
                "manufacturer": "4-Star Trailers, Inc.",
                "productMake": "4-STAR TRAILERS",
                "productModel": "HORSE TRAILER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 COVENANT ENCLOSED CARGO TRAILER (NA).  THE CONTACT STATED THAT THE AXLES WERE STRIKING THE BODY OF THE VEHICLE AND SEVERED THE BRAKE WIRES.  THE AXLE WAS REPLACED, BUT THE FAILURE REMAINS.  NO OTHER VEHICLE INFORMATION WAS AVAILABLE.",
        "vin": "5RMBE16236D"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/30/2007",
        "dateOfIncident": "06/20/2007",
        "fire": false,
        "manufacturer": "4-Star Trailers, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10197866,
        "products": [
            {
                "manufacturer": "4-Star Trailers, Inc.",
                "productMake": "4-STAR TRAILERS",
                "productModel": "HORSE TRAILER",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "MARATHON",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "20 JUNE 2007 WAS TRAVELING ON I-75 NORTH @ MILE 72 AT 65 MPH LEFT CAMPER TIRE FAILED, TOOK ALL PLUMBING OFF CAMPER, RIM DESTROYED. THERE'S WAS NOTHING LEFT TO SAVE. HIT NOTHING IN ROAD, TIRE WAS AT 52 PSI 1 HOUR BEFORE. TIRE WAS A GOODYEAR MARATHON. REPLACED BOTH TIRES. GOODYEAR DEALER DIDN'T CARRY MARATHONS REPLACED WITH CARLYSES.  *TR",
        "vin": ""
    },
    {
        "components": "TRAILER HITCHES,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "04/09/2007",
        "dateOfIncident": "10/15/2006",
        "fire": false,
        "manufacturer": "4-Star Trailers, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10187332,
        "products": [
            {
                "manufacturer": "4-Star Trailers, Inc.",
                "productMake": "4-STAR TRAILERS",
                "productModel": "HORSE TRAILER",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "TL*-  THE CONTACT OWNS A 2006 STEHL TOW DOLLY BY TRAILER CORPORATION OF AMERICA.  THE HITCH DISCONNECTED WHILE DRIVING ON  AN INCLINE.  THE SAFETY CHAINS YANKED THE TRAILER INTO THE BACK OF A BUS, CAUSING $5,000 IN DAMAGE. THE CONTACT CONTINUED UP THE INCLINE WHEN THE PASSENGER NOTICED THAT THE TRAILER SEPARATED FROM THE BUS.  THE TRAILER AND THE VEHICLE ATTACHED TO IT WERE 6 FEET FROM BACKING INTO WHEN THE CONTACT WAS ABLE TO JUMP IN AND STOP THE VEHICLE.*AK",
        "vin": "5JGBH11106E"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "11/12/2006",
        "dateOfIncident": "06/20/2006",
        "fire": false,
        "manufacturer": "4-Star Trailers, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10173301,
        "products": [
            {
                "manufacturer": "4-Star Trailers, Inc.",
                "productMake": "4-STAR TRAILERS",
                "productModel": "HORSE TRAILER",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "WHILE DRIVING APPROXIMATELY 55 MPH IN HEAVY HIGHWAY TRAFFIC, THE FRONT RIGHT TIRE (KENDA USA LOADSTAR) ON OUR APPALACHIAN 22 FOOT DECKOVER TRAILER BLEWOUT.  THE TIRE RUBBER PEELED AWAY FROM THE NYLON CORDS AND LEFT A VERY LARGE HOLE IN THE SIDEWALL.  WHILE CHANGING THIS TIRE, IT WAS NOTICED THAT ONE OF THE OTHER TIRES HAD AN EGG SHAPED BUBBLE.  DUE TO THE CONDITION OF THE OTHER TIRE, WE DIDN'T FEEL THAT IT WOULD BE SAFE FOR US TO CONTINUE OUR TRIP.  (WE DIDN'T HAVE AND COULDN'T GET ANOTHER SPARE.)  ONCE HOME, WE LOOKED MORE CLOSELY AT ALL OF THE TIRES AND NOTICED THAT NOT ONE, BUT TWO OF THE OTHER TIRES HAD AN EGG SHAPED BUBBLE IN THEM.  THE TRAILER DEALER ASSURED US THAT WE WOULD BE TAKEN CARE OF, BUT THAT IT WAS A MANUFACTURER PROBLEM.  WE CONTACTED KENDA USA (RODGER)... HE SAID \"WE'RE GOING TO GET YOU COMFORTABLE\" AND TO GO AHEAD AND HAVE THE FAULTY TIRES REPLACED? THEY WOULD REIMBURSE US AT REPLACEMENT COST OF $85 PER TIRE.  WE DECIDED THAT IT WOULD BE BEST FOR US TO REPLACE ALL OF THE TIRES RATHER THAN TAKING OUR CHANCES THAT THEY WERE ALL DEFECTIVE.  WHEN WE BROUGHT THE TIRES INTO OUR LOCAL TIRE DEALER TO BE REPLACED, THEY NOTED THAT ALL OF THEM WERE DEFECTIVE? YOU COULD SEE THE CORDS AROUND THE BEAD AREA.    WE NOW HAVE FIVE AFFIDAVITS FROM DEALERS AND MANUFACTURERS SAYING THAT THESE TIRES SHOULD HAVE NEVER BEEN INSTALLED ON RIMS IN THE FIRST PLACE.    WHEN WE SENT THE BILL TO KENDA, THEY DECIDED THAT THEY WERE NOT GOING TO REPLACE THE TIRES UNTIL THEY HAD THEM FOR FURTHER INSPECTION.  WHEN I WENT TO SEND THEM THEY THEN SAID TO GO TALK TO THE TRAILER MANUFACTURER AND THAT IT WASN'T THEIR PROBLEM (EVEN THOUGH THEY HAVE THE STATEMENTS MENTIONED ABOVE AS WELL AS SEVERAL PICTURES THAT WE SENT TO THEM AT THE BEGINNING).    I CALLED APPALACHIAN TRAILERS WHO SAID THAT IT WASN'T THEIR PROBLEM I HAD TO TALK TO THE MOUNTING COMPANY... AMERICANA.  AMERICANA HAS REPEATEDLY TOLD ME THAT THEY WOULD GET BACK TO ME.  NOW, FIVE WEEKS LATER THEY HAVE YET TO CALL ME BACK.  *JB",
        "vin": "5NRHF22286S"
    }
]