[
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/09/2021",
        "dateOfIncident": "01/13/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407165,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "OWNER OF AUDI A3 2006 2.0TFSI.  RECENTLY GOT THE PROBLEM WITH THE ENGINE CHECK LIGHT. ENGINE CHECK LIGHT INDICATES THAT SOMETHING IS WRONG WITH THE FUEL SYSTEM LEAK. THE CAR WAS ORIGINALLY CREATED FOR US, BUT ITS NOW ACTIVE IN EUROPE. ALREADY SEEN SOME CAR REPAIR CENTERS, BUT NONE COULD FIX THE ENGINE CHECK PROBLEM. TODAY, I READ INFORMATION FROM OFFICIAL AUDI SITES.   \"FUEL SYSTEM, GASOLINE:STORAGE:TANK ASSEMBLY RECALL'    ENGINE CHECK LIGHT SHOWED UP WHEN I WAS DRIVING HIGHWAY, FIRST, COMPUTER TOLD ME TO CLOSE FUEL CAP, WHICH WAS FULLY CLOSED, AFTER FUEL CAP LOGO WENT AWAY, ENGINE CHECK LIGHT STARTED TO BLINKING AND THE MOTOR STARTED TO SHAKE BADLY AND I NEEDED TO DO EMERGENCY STOP. I THINK ITS NOT SAFE TO DRIVE AROUND WHEN ENGINE CHECK LIGHT STILL SHOWS UP.",
        "vin": "WAUNF78PX6A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/01/2021",
        "dateOfIncident": "01/22/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405956,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "REPLACED AIRBAGS BY AUDI IN LATHAM, NEW YORK AND CHARGED OVER $176 FOR DIAGNOSTIC FOR BAD AIRBAGS AND WARNING LIGHTS FOR AIRBAGS.  BAD AIRBARGS INSTALLED DURING RECALL. AUDI NEVER REPLACED THE BAD AIRBAGS. VERY BAD.",
        "vin": "WAUKD78PX6A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/23/2020",
        "dateOfIncident": "08/19/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301401,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 AUDI A3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER 18V082000 (AIR BAGS) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER (UNKNOWN DEALER INFORMATION) WAS CONTACTED AND STATED THE PARTS WERE NOT AVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THIS ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "WAUHF78P06A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/21/2020",
        "dateOfIncident": "01/21/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300838,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "REPLACED AIRBAGS BY AUDI ARE OFF AND DEFECTIVE.  DEALER REQUIRES HUNDREDS OF DOLLARS TO INSPECT BAD AIRBAG CHANGED BY RECALL OF AIRBAGS.  AIRBAG OFF WARNING LIGHT FROM REPLACED AIRBAG CHANGED BY DEALER. INCREDIBLE, REPLACED RECALLED AIRBAGS TO HAVE BAD AIRBAGS INSTALLED AND BE CHARGED HUNDREDS OF DOLLARS BY AUDI DEALER IN LATHAM NEW YORK.",
        "vin": "WAUKD78PX6A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/18/2019",
        "dateOfIncident": "10/01/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11180903,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL I HAVE BEEN CALLING THE AUDI DEALER FOR OVER 4 MONTHS ABOUT THIS AIR BAG. THEY KEEP TELLING ME THAT THEY ARE WAITING FOR PARTS FROM TAKATA, NOTHING MUCH ELSE THAT THEY CAN DO. I NEED TO KNOW THAT IF SOMETHING WERE TO  HAPPEN THAT I CAN DEPEND ON THE AIR BAG IN MY CAR TO HELP KEEP ME SAFE, AT THIS POINT I AM VERY WORRIED.",
        "vin": "WAUMF78P76A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/14/2018",
        "dateOfIncident": "02/10/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11151462,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2006 AUDI A3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V079000 (AIR BAGS). THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR AS THE RECALL NOTICE WAS RECEIVED OVER A YEAR AGO. THE DEALER (AUDI FARMINGTON HILLS, 37911 GRAND RIVER AVE, FARMINGTON HILLS, MI 48335, (248) 471-0800) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS CONTACTED SEVERAL TIMES AND WAS UNABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WAUNF78P36A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/01/2018",
        "dateOfIncident": "10/18/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11144781,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2006 AUDI A3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 18V082000 (AIR BAGS); HOWEVER, THE PART NEEDED FOR THE REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT CALLED AUDI SERVICE PORTLAND DEALER ((877) 868-3792, 14811 NE AIRPORT WAY, PORTLAND, OR 97230) AND WAS INFORMED THAT THE PART WAS NOT AVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND DID NOT OFFER ANY ASSISTANCE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "WAUMF78P36A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/18/2018",
        "dateOfIncident": "10/17/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11141301,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL: WE KEEP RECEIVING URGENT SAFETY RECALL NOTICES FOR OUR AIRBAGS BUT THERE ARE NO DEALERSHIPS THAT HAVE THE PARTS TO COMPLETE THIS RECALL. EVERY SINGLE DEALERSHIP THAT I HAVE CONTACTED INSIDE AND OUTSIDE OF THE BAY AREA HAVE ALL SAID THE MATERIALS ARE 'ON BACK ORDER' 'THIS CONTINUES TO BE SO SINCE JANUARY 2017. WE HAVE TWO CHILDREN AND RELY ON OUR AUDI WHICH IS ALSO OUR ONLY CAR. WE CANNOT AFFORD TO GET ANOTHER CAR AT THIS TIME AND TRY TO USE PUBLIC TRANSIT AS MUCH AS POSSIBLE BUT NOT ALWAYS REALISTIC OR SAFE FOR A BABY WHO WAS BORN PREMATURELY. WE HAVE TO HAVE OUR CAR FIXED BUT AUDI SIMPLY MAILING OUT RECALL NOTICES WITHOUT THE SUPPLIES IN PLACE TO CORRECT THIS POTENTIALLY FATAL DEFECT IS NOTHING MORE THAN THEIR LEGAL DUE DILIGENCE ON PAPER AND NOT CORRECTIVE. PLEASE HELP US.",
        "vin": "WAUKD78P76A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/16/2018",
        "dateOfIncident": "10/16/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11140757,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY COMPLAINT IS REGARDING THE GLACIAL PACE WHICH AUDI HAS TAKEN TO REMEDY THE RECALL ASSOCIATED WITH MY AUTOMOBILE. WE WERE PROVIDED WITH A TEMPORARY FIX THAT REPLACED THE ORIGINAL AIRBAG INFLATION DEVICE WITH A NEW ONE THAT HAS THE SAME PROBLEM IN APRIL OF 2016. I FIRST CONTACTED AUDI ON MAY 3RD. OF 2017 TO INQUIRE ABOUT THE STATUS OF A PERMANENT REPAIR FOR A FAULTY, AND POTENTIALLY DEADLY, AIRBAG IN MY 2006 AUDI A3 AND NO PARTS WERE AVAILABLE AT THE TIME. I CONTACTED THEM AGAIN TODAY, OCTOBER 16TH 2018 AND THERE ARE STILL NO PARTS AVAILABLE TO COMPLETE THE REPAIR. THIS IS ALL WELL AFTER I WAS INITIALLY NOTIFIED OF THE RECALL TO BEGIN WITH. IT WILL HAVE BEEN YEARS SINCE THIS RECALL WAS PUT IN PLACE BY THE TIME I RECEIVE A PERMANENT FIX WHILE MY WIFE DRIVES OUR TWO CHILDREN AROUND IN A CAR WITH A POTENTIALLY LETHAL AIRBAG IN IT. I'M SHOCKED AND DISGUSTED BY THE LACK OF URGENCY THAT AUDI HAS DISPLAYED IN NEGLECTING TO FIX MY CAR AS WELL AS, WHAT I IMAGINE, ARE THOUSANDS OF OTHER AUDI OWNERS WAITING ON A FIX WHILE DRIVING A DEATH TRAP. SOMETHING NEEDS TO BE DONE TO FORCE AUDI'S HAND AND COMPLETE THE RECALL REPAIRS THEY ARE BEHOLDEN TO.",
        "vin": "WAUNF78P86A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/15/2018",
        "dateOfIncident": "10/15/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11140441,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2006 AUDI A3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 18V082000 (AIR BAGS). THE DEALER (AUDI OF NORTH MIAMI, 1995 NE 142ND ST, NORTH MIAMI, FL 33181, 305-952-5900) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS NOTIFIED AND DID NOT ASSIST. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "WAUMF78P76A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/04/2018",
        "dateOfIncident": "04/01/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11124309,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "\"TAKATA RECALL\"  I HAVE RECEIVED NUMEROUS NOTICES FROM AUDI OF AMERICA, INC., MOST RECENTLY MAY, JUNE AND JULY 2018. THESE NOTICES ASK ME TO CONTACT AN AUDI DEALER REGARDING A SAFETY RECALL FOR DRIVER FRONTAL AIRBAG INFLATOR (TAKATA) AS SOON AS POSSIBLE TO HAVE THE AIRBAG REPLACED FREE OF CHARGE.  I CONTACTED AUDI STEVENS CREEK IN SAN JOSE, CA, AND WAS ABLE TO HAVE A TEMPORARY AIRBAG REPLACEMENT INSTALLED ON JUNE 2, 2017.  AT THAT TIME, I WAS TOLD A PERMANENT AIRBAG WOULD NEED TO BE REPLACED IN THE FUTURE WHEN THE PART ARRIVED.  I HAVE CALLED THIS DEALER SEVERAL TIMES, MOST RECENTLY SEPT. 4, 2018, AND WAS TOLD EACH TIME THAT THEY DO NOT HAVE THE PART AND DO NOT KNOW WHEN THEY WILL GET IT. I NOW WANT TO SELL MY CAR AND MAY BE UNABLE TO DO SO BECAUSE OF THIS PROBLEM. I ALSO FEEL I AM AT RISK IF GETTING INTO AN ACCIDENT IF THIS BAG IS NOT PERMANENTLY REPLACED. THE VERY FIRST NOTICE I RECEIVED FROM AUDI AMERICA WAS APRIL 2016 REGARDING ITS SAFETY RECALL OF THIS TAKATA AIRBAG.  IT IS NOW SEPT. 2018, AND I STILL DO NOT HAVE A PERMANENT AIRBAG REPLACEMENT.  THIS IS UNACCEPTABLE.",
        "vin": "WAUKD78P36A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/29/2018",
        "dateOfIncident": "02/09/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11104804,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. NHTSA RECALL NUMBER 16V079. AUDI ACTION CODE 69N2. RECALL START DATE FEB 09, 2016. MY ISSUE IS THAT I HAVE BEEN WAITING FOR AN \"INTERIM REPAIR\" FOR MY DEFECTIVE TAKATA AIRBAG INFLATOR FOR 2 YEARS 4 MONTHS AND 20 DAYS AT THE DATE OF WRITING THIS COMPLAINT. I DRIVE MYSELF AND MY FAMILY IN MY VEHICLE, AND ACCORDING TO THE AUDI NATIONAL CUSTOMER SERVICE REPRESENTATIVE I SPOKE WITH, IT IS BOTH MY PASSENGER AND DRIVER AIRBAG INFLATORS THAT NEED TO BE REPLACED. THIS IS EXTREMELY CONCERNING AS I DRIVE MY FAMILY IN MY VEHICLE. THE LACK OF INFORMATION AUDI HAS BEEN ABLE TO GIVE TO ME REGARDING WHEN PARTS WILL BE AVAILABLE HAS LED ME HERE. QUITE FRANKLY, I HAVE RUN OUT OF PATIENCE, AS I'M DRIVING A VEHICLE THAT CAN POTENTIALLY CAUSE MY FAMILY AND MYSELF HARM/DEATH, WHERE THE DEVICE (INFLATOR/AIRBAG) SHOULD BE KEEPING US SAFE. THERE IS NO WAITING LIST TO BE ADDED TO FOR THE PARTS, AND THE LACK OF ANY SPECIFICITY OF WHEN THE PARTS WILL BE AVAILABLE IS BEYOND ABSURD, ESPECIALLY SINCE I'VE BEEN WAITING AND CALLING THEM EVERY SO OFTEN FOR MORE THAN 2 YEARS NOW. I HAVE CALLED ALL OF THE LOCAL AUDI DEALERSHIPS IN MY AREA FOR INFORMATION REGARDING THE TAKATA RECALL AND PART AVAILABILITY, ALONG WITH THE AUDI NATIONAL NUMBER, ALL TO NO AVAIL OR ANY SPECIFICITY OF GETTING THIS PROBLEM ADDRESSED.",
        "vin": "WAUKD78P56A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/29/2018",
        "dateOfIncident": "05/29/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11098702,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  I LIVE ON THE ISLAND OF MAUI AND AUDI USA HAS STILL NOT PROVIDED SERVICE TECHNICIANS TO REPLACE RECALLED TAKATA AIRBAGS.  THEY EXPECT RESIDENTS TO SHIP THEIR CARS TO OAHU AT $600 FOR THE RECALL! WE HAVE TRAINED AUDI SERVICE TECHS AT THE MAUI VOLKSWAGON DEALER KARMART, BUT AUDI USA WILL NOT APPROVE THEM TO DO THE SERVICE.",
        "vin": "WAUNF78P16A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/17/2018",
        "dateOfIncident": "05/16/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11096498,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "RECEIVED NOTICE OF RECALL FROM AUDI AMERICA IN APRIL 2016.  BEGINNING IN JANUARY 2018 HAVE RECEIVED THREE NOTICES TO CONTACT DEALER FOR REPAIRS.  WAS FIRST TOLD BY DEALER THAT THE AIRBAG REPLACEMENT WAS NOT IN STOCK.  AFTER THE THIRD NOTICE WAS RECEIVED IN APRIL THE DEALER NOW INDICATES THAT THE CAR IS \"CLEAR\" AND NO RECALLS (INCLUDING AIR BAG) ARE IN EFFECT.  AFTER CALLING AUDI AMERICA THEY HAVE NOW GIVEN ME NOTICE BY PHONE THAT THEY ALSO NOTE THAT THERE ARE NO RECALLS FOR THIS VEHICLE.  I HAVE LEFT MESSAGES NOW ASKING FOR THIS IN WRITING BUT HAVE RECEIVED NO REPLY.",
        "vin": "WAUNF78P36A"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/15/2018",
        "dateOfIncident": "04/11/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11085169,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRANSMISSION STOPS WORKING WHILE DRIVING ( AS IF IT WERE IN NEUTRAL).  WHILE DRIVING UP A BRIDGE IT JUST STOPPED WORKING AND STARTED ROLLING BACKWARDS AND NOW WILL NOT WORK AT ALL .ITS MY UNDERSTANDING THAT AUDI RECALLED THIS TRANSMISSION IN THE UK.",
        "vin": "WAUNF68P86A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/10/2018",
        "dateOfIncident": "04/10/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11084395,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2006 AUDI A3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 18V082000 (AIR BAGS); HOWEVER, THE PART NEEDED FOR THE REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT CALLED AUDI OF TYSONS CORNER AT (877) 460-3588 (LOCATED AT 8598 LEESBURG PIKE, VIENNA, VA 22182) AND WAS INFORMED THAT THE PART WAS NOT AVAILABLE. THE MANUFACTURER WAS CONTACTED AND ADVISED THE CONTACT TO CALL THE DEALER TO BE PLACED ON A WAITING LIST. NO FURTHER ASSISTANCE WAS OFFERED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WAUMF78P76A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/09/2018",
        "dateOfIncident": "04/09/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11084034,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL.  LOCAL DEALER CANCELLED MY RECALL APPOINTMENT THE DAY BEFORE SAYING THEY DID NOT HAVE PARTS.  2 WEEKS LATER CALLED FOR AN UPDATE, STILL NO PARTS.  THEY SAID \"CALL AUDI AND ASK, WE HAVE NO IDEA WHEN WE'RE GETTING PARTS.\"  TALKED TO AUDI OF AMERICA, THEY POINT YOU TO THE DEALERS AND A WAITING LIST.",
        "vin": "WAUNF78PX6A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/13/2018",
        "dateOfIncident": "02/13/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11072714,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  UNABLE TO OBTAIN REPLACEMENT PART. HAVE BEEN ON WAITING LIST FOR 8 MONTHS, AND UNABLE TO OBTAIN ANY ESTIMATE OR PROMISE OF REPAIR. ONE DEALER SERVICE MANAGER TOLD US 2 - 3 YEARS.",
        "vin": "WAUKD78P06A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/08/2018",
        "dateOfIncident": "01/04/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11061119,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. AUDI REFUSES TO REPAIR THE TAKATA RECALL ISSUE FOR U.S. MILITARY STATIONED OVERSEAS.    WE ARE A U.S. MILITARY FAMILY STATIONED IN GERMANY WITH A 2006 AUDI A3 REGISTERED WITH LOCAL MILITARY BASE VEHICLE REGISTRATION SERVICES. OUR 'AMERICAN SPECIFICATION\" AUDI IS PART OF THE TAKATA AIRBAG RECALL THAT HAS IMPACTED MILLIONS OF VEHICLES WORLDWIDE.     I HAVE SPOKEN IN PERSON TO SEVERAL LOCAL DEALERSHIPS HERE IN GERMANY TO HAVE THE RECALL REPAIR COMPLETED. RESULT: THEY HAVE REFUSED TO DO ANYTHING.     I HAVE ALSO USED ONLINE CHAT SERVICES WITH AUDI USA TO GAIN CLARIFICATION ON THE PROCESS. RESULT: THEY HAVE CONFIRMED IN WRITING THAT AUDI GERMANY WILL NOT BE FIXING ANY AMERICAN SPECIFICATION VEHICLES WITH THE TAKATA RECALL ISSUE (SEE ATTACHED SCREENSHOT OF CONVERSATION).     AUDI USA CURRENTLY HAS A NOTICE ON THEIR WEBSITE (HTTPS://WWW.AUDIUSA.COM/ABOUT/TAKATA): \"I'M IN THE MILITARY OVERSEAS WITH MY VEHICLE. WHAT CAN I EXPECT? OVERSEAS MILITARY PERSONNEL WILL RECEIVE NOTICES LIKE U.S. CUSTOMERS, AND BE SIMILARLY DIRECTED WHEN TO SCHEDULE THE REMEDY SERVICE WITH THEIR AUTHORIZED AUDI DEALER.\" THIS IS CLEARLY FALSE AND MISLEADING (SCREENSHOT ATTACHED).    THERE ARE THOUSANDS OF U.S. SERVICEMEMBERS AND FAMILIES IN GERMANY WITH AMERICAN SPECIFICATION VEHICLES SUCH AS OURS. WE WANT TO FIX THIS RECALL ISSUE. PLEASE HELP US.",
        "vin": "WAUMF78PX6A"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/30/2017",
        "dateOfIncident": "11/24/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11051630,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN CHANGING FROM HIGHWAY DRIVING TO STOP AND GO TRAFFIC, CAR TRIES TO SHIFT UP AND DOWN FREQUENTLY VERY HARSHLY, THEN ALL GEARS FLASH AND CAR ENTERS LIMP MODE. HAVE TO RESTART ENGINE TO ALLOW IT TO ALLOW CAR TO DRIVE NORMAL. THIS REPEATS UNTIL ABLE TO DRIVE IN FREE FLOWING TRAFFIC. CAR DRIVES NORMAL UNDER ALL OTHER DRIVING CONDITIONS.",
        "vin": "WAUMF78P06A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/09/2017",
        "dateOfIncident": "11/09/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11044838,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA AIRBAG RECALL.  MANUFACTURER HAS FAILED TO REMEDY.",
        "vin": "WAUNF68P06A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/04/2017",
        "dateOfIncident": "05/20/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11043146,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. DEALER SAID THEY DID NOT HAVE PARTS",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/31/2017",
        "dateOfIncident": "10/30/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11041697,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL - AUDI DEALERSHIPS ARE EITHER DENYING THAT THERE IS A RECALL OR REFUSING REPAIR ON THE BASIS OF AIRBAG UNAVAILABILITY. I HAVE BEEN IN CONTACT WITH BOTH OF THE FOLLOWING DEALERSHIPS REGARDING THIS RECALL FOR ABOUT 1 YEAR WITH NO SATISFACTION.  ROCKVILLE AUDI, BRYAN WEBSTER, CHECKED THE AUDI RECALL SITE AS LATE AS 10/30/2017 AND SHOWED ME ON THE SCREEN THAT THERE WERE NO OPEN RECALLS ON MY VEHICLE, AND DENIED REPLACEMENT.  SILVER SPRING AUDI (MILE ONE) (ORIGINAL SELLING DEALER) ACKNOWLEDGED RECALL BUT INDICATED REPEATEDLY THAT THEY COULD NOT OBTAIN A REPLACEMENT FROM TAKATA AND THEREFORE COULD NOT COMPLY WITH THE REPLACEMENT OF THE RECALLED AIRBAG.  THIS HAS EFFECTIVELY DENIED ME THE USE OF MY CAR FOR 12 MONTHS.",
        "vin": "WAUNF68P26A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/20/2017",
        "dateOfIncident": "02/06/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11035312,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL, WE WERE NOTIFIED OF A RECALL ON OUR AIRBAGS AND WERE NEVER CONTACTED AGAIN NOT KNOWING WHETHER OR NOT IF THERE WAS A FIX.",
        "vin": "WAUNF78P76A"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/04/2017",
        "dateOfIncident": "06/28/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11002964,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "LOSS OF POWER AT ANY TIME WITHOUT WARNING THE CAR WILL LOSE POWER WHILE IN MOTION, ON A HIGHWAY, JUST DRIVING DOWN A STREET OR TURNING.  ALMOST REAR ENDED SEVERAL TIMES.",
        "vin": "WAUMF78P96A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/17/2017",
        "dateOfIncident": "04/15/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10978793,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2006 AUDI A3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V079000 (AIR BAGS). THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "WAUMF78P96A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/14/2017",
        "dateOfIncident": "04/14/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10978593,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A LETTER FROM AUDI RELATED TO THE TAKATA AIRBAG RECALL THAT TOLD ME TO IMMEDIATELY SCHEDULE A TEMPORARY FIX WITH THEM.  I CALLED THE DEALERSHIP (AUDI OF DES MOINES, IOWA), AND THEY SAID THEY HAVE NO PARTS TO DO THE FIX AND DO NOT HAVE ANY ETA ON WHEN THE PARTS WILL BE AVAILABLE.",
        "vin": "WAUMF78P26A"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/13/2017",
        "dateOfIncident": "04/13/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10972339,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "JUST BOUGHT THE CAR 1 MONTH AGO AND I GOT A GEARBOX MALFUNCTION. CAR DOES NOT WANT TO REVERSE.IT JERKS FROM 1ST-2ND GEAR, AND IT ALSO JUMPS FORWARD WHEN KM TRYING TO STOP.  ITS A SAFETY CONCERN FOR ME ANS MY FAMILY. ITS A COMMON PROBLEM WITH THE 2010 AUDI S4'S DSG TRANSMISSION. AUDI OF AMERICA SHOULD BE REPLACING THESE AT NO COST.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/13/2017",
        "dateOfIncident": "04/13/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10972340,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL.   I LIVE ON THE ISLAND OF MAUI AND THE ONLY AUTHORIZED DEALER TO PERFORM THE SAFETY RECALL OF TAKATA INFLATORS, IS ON OAHU. NEITHER THE DEALER, OR AUDI OF AMERICA, INC. WILL PAY FOR THE SHIPPING OF THE VEHICLE FOR THIS RECALL. THIS WILL COST HUNDREDS OF DOLLARS FOR SHIPPING BOTH WAYS, AND IS ONLY A TEMPORARY FIX. ADDITIONAL COST WILL BE REQUIRED WHEN THERE IS A \"FINAL REMEDY.\"",
        "vin": "WAUNF78P16A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/28/2017",
        "dateOfIncident": "03/28/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10969095,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "\"TAKATA RECALL\" JUST CONTACTED THE AUDI DEALER IN SAN ANTONIO AND THE SERVICE DEPARTMENT TOLD THEY HAVE NO PART TO REPLACE THE AIRBAGS, WHICH IS TOTALLY UNSAT.  THEIR CONTACT INFORMATION IS:   AUDI NORTH PARK  , SELMA, SAN ANTONIO TX  (210) 960-6000",
        "vin": "WAUHF78P96A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/21/2017",
        "dateOfIncident": "02/10/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10967480,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2006 AUDI A3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V079000 (AIR BAGS) HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "WAUMF78P76A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/16/2017",
        "dateOfIncident": "02/15/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10955169,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL   HOW CAN I BE BETTER INFORMED OF PROGRESS ON THIS RECALL AND MORE SPECIFICALLY WHEN I CAN EXPECT MY REPAIR",
        "vin": "WAUNF78P46A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/11/2017",
        "dateOfIncident": "01/01/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10953990,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTHING",
        "vin": "WAUNF78P76A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/20/2017",
        "dateOfIncident": "02/09/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10946614,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2006 AUDI A3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V079000 (AIR BAGS). THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WAUHF78P46A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/20/2017",
        "dateOfIncident": "02/09/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10946732,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AKATA HAS REPORTED THAT THE DRIVER FRONTAL AIRBAG INFLATOR COULD POTENTIALLY RUPTURE IF THE VEHICLE IS INVOLVED IN A CRASH WHERE THE FRONTAL AIRBAGS ARE DESIGNED TO DEPLOY. IN THE EVENT OF AN INFLATOR RUPTURE, METAL FRAGMENTS COULD PASS THROUGH THE AIRBAG CUSHION MATERIAL, WHICH MAY RESULT IN SERIOUS INJURY OR DEATH TO VEHICLE OCCUPANTS.  REMEDY: REPLACE DRIVER AIRBAG INFLATOR.  RECALL STATUS: RECALL INCOMPLETE. REMEDY NOT YET AVAILABLE     ALMOST A YEAR  LATER AND REMEDY NOT YET AVAILABLE!!!!",
        "vin": "WAUNF78P26A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/19/2017",
        "dateOfIncident": "01/15/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10946364,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "RANDOM LOSS OF POWER, THE TRANSMISSION WILL RANDOMLY SLIP WHILE THE CAR IS IN REVERSE FROM A PARKED POSITION. IT WILL ALSO SLIP RANDOMLY WHILE IN FORWARD MOTION AND DURING TURNING. THIS IS VERY DANGEROUS AND COULD CAUSE AN ACCIDENT RESULTING IN BEING REAR ENDED. PLEASE HELP! LAST TIME IT HAPPENED WAS 1/15/2017.",
        "vin": "WAUMF78P96A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/19/2017",
        "dateOfIncident": "03/15/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10946432,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2006 AUDI A3. THE CONTACT RECEIVED A RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 16V079000 (AIR BAGS). THE CONTACT STATED THAT THE PARTS NEEDED FOR THE RECALL REMEDY WERE NOT AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WAUNF98PX6A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/19/2017",
        "dateOfIncident": "01/18/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10946416,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL    I WANT THIS AIRBAG REMEDIED NOW AS IT HAS BEEN OVER A YEAR AND NO LETTER TO CHANGE!!!  IF ONE OF US ARE KILLED BY TGIS DEFECTIVE BAG THEN SOMEONE WILL BE PAYING. GET THIS DONE IMMEDIATELY!!!",
        "vin": "WAUMF78P16A"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/16/2017",
        "dateOfIncident": "01/01/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10945554,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHT INTERNAL COIL THAT IS REPONSIBLE FOR HEADLIGHTS HIGHBEAM TO COME ON GOES BAD TO CAUSE THE HEADLIGHT TO STOP COMING ON.  KNOWN PROBLEM IN AUDI A3 2006 HEADLIGHT ASSEMBLY",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/14/2017",
        "dateOfIncident": "01/13/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10945227,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL - THIS RECALL WAS STARTED IN FEBRUARY OF 2016 YET I WAS NEVER INFORMED BY AUDI THAT MY VEHICLE NEEDED THE AIR BAG FIXED AND THE AUDI WEBSITE STATES THAT A SOLUTION IS STILL PENDING. I NEED TO KNOW IF THE VEHICLE CAN ALREADY BE FIXED AND UNTIL WHAT DATE I HAVE TO TAKE IT TO AN AUDI DEALER FOR REPAIR.",
        "vin": "WAUMF78PX6A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/12/2016",
        "dateOfIncident": "02/09/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10934713,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. RECALL HAS BEEN IN PLACE SINCE 02/09/2016 WITH NO REMEDY. DELAYED REMEDY CONTINUES TO PLACE THE DRIVER IN HARMS WAY. WHEN WILL THIS BE CORRECTED?",
        "vin": "WAUMF98P86A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/09/2016",
        "dateOfIncident": "02/09/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10934314,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL - REMEDY NOT AVAILABLE YET",
        "vin": "WAUNF78P46A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/06/2016",
        "dateOfIncident": "05/16/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10930269,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 AUDI A3. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 16V079000 (AIR BAGS). THE PART NEEDED WAS UNAVAILABLE TO PERFORM THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.  ...UPDATED 01/23/17 *BF  UPDATED 03/01/17.*JB",
        "vin": "WAUNF78P96A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/03/2016",
        "dateOfIncident": "04/01/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10911165,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "\"TAKATA RECALL\"  I WAS NOTIFIED IN APRIL 2016 OF THE RECALL BY AUDI OF AMERICA.  AS OF TODAY, OCT. 3, 2016 I WAS TOLD THAT THEY STILL HAVE NO TIMELINE AS TO WHEN THE PARTS WILL BE AVAILABLE  TO REPAIR MY VEHICLE.  AS THIS IS A DANGEROUS SITUATION, POTENTIALLY FATAL, IT IS MIND BOGGLING THAT 6MONTHS HAVE ELAPSED SINCE THE INITIAL NOTIFICATION.",
        "vin": "WAUNF78P36A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/19/2016",
        "dateOfIncident": "09/19/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10907565,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2006 AUDI A3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V079000 (AIR BAGS). THE PART NEEDED TO REPAIR THE VEHICLE WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.  VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WAUMF78P06A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/26/2016",
        "dateOfIncident": "02/09/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10898997,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL WAS ISSUED FEBRUARY9,2016.I PURCHASED THIS CAR NEW, AND LTHE LDEALERSHIP CERTAINLY KNOWS MY ADDRESS WHEN THEY SEND ME ADS. I LEARNED OF THIS RECALL ON MY OWN, NO NOTIFICATION HAS BEEN SENT TO ME.",
        "vin": "WAUHF78P16A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/17/2016",
        "dateOfIncident": "08/01/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10896635,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2006 AUDI A3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V079000 (AIR BAGS) HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE AND FAILED TO PROVIDE A LOANER VEHICLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WAUMF78P06A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/08/2016",
        "dateOfIncident": "04/01/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10894031,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL - WE GOT A RECALL BACK IN APRIL ABOUT THE AIR BAG AND WHEN WE CALLED AUDI, THEY SAID THAT THEY HAD NO REMEDY PLANNED AS THEY WERE NOT HAVING ANECDOTAL PROBLEMS REPORTED. THEN JUST LAST WEEK, WE MISSED OUT ON A \"SWEET DEAL\" FROM AUDI TO HAVE OUR AIR BAG REPLACED BECAUSE THEY HAD TOLD SOUTH ORLANDO AUDI TO CALL CUSTOMERS AND REPLACE THE FIRST FIVE AIR BAGS OF THE OWNERS WHO RESPONDED. WHEN WE FINALLY GOT A HOLD OF SOMEONE IN THE SERVICE DEPARTMENT, THE \"SWEET DEAL\" WAS GONE. NEEDLESS TO SAY THAT WE ARE FURIOUS THAT OUR AIR BAG WAS NOT ONE OF THE ONES TO BE REPLACED. LIVING IN FLORIDA, I FEEL AS IF WE ARE DRIVING AROUND WITH A SHRAPNEL GRENADE FOR AN AIRBAG JUST INCHES FROM OUR FACE. WE HAVE EVEN CALLED A LAWYER AND THEY HAVE NO INTEREST IN HELPING US EITHER PROBABLY BECAUSE THEY ARE WAITING FOR US TO GET HURT BY THE AIRBAG SO THEY CAN GET MORE MONEY. WHEN ARE YOU GOING TO FORCE AUDI TO REPLACE OUR AIRBAG?",
        "vin": "WAUNF98P26A"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/03/2016",
        "dateOfIncident": "08/02/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10892891,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2ND TIME THIS HAS HAPPENED IN JUST A FEW DAYS. I WANT TO START DOCUMENTING EVERY TIME THIS HAS HAPPENED.  I WAS PULLING INTO FAST MOVING TRAFFIC FROM A SIDE STREET.  I WAS MAKING A LEFT HAND TURN AND THE CAR HESITATED PUTTING ME INTO THE WAY OF ON COMING TRAFFIC AT 50 MPH.  THIS WAS VERY DANGEROUS BECAUSE I WAS ACCELERATING TRYING TO REACH 50 MPH COULD HAVE BEEN REAR ENDED ONLY GOING ABOUT 10 MPH.",
        "vin": "WAUMF78P96A"
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/28/2016",
        "dateOfIncident": "07/28/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10891479,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "FROM A STOPPED POSITION ON A SIDE STREET IN A LEFT HAND TURN LANE I STEPPED ON THE GAS PEDAL AND THE CAR STARTED TO  MOVE THEN IMMEDIATELY HAD A LOSS OF POWER IN MAKING A LEFT HAND TURN ONTO A MAJOR STREET. THE CAR LURCHED FORWARD THEN HESITATED. IT IS REALLY DANGEROUS BECAUSE IT CAN SURPRISE PEOPLE AND CAUSE CARS TO CRASH INTO ME. IT HAS DONE THIS A FEW OTHER TIMES. I FEEL GIVEN THE RIGHT CIRCUMSTANCES THIS COULD CAUSE AN ACCIDENT.",
        "vin": "WAUMF8P96A0"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/18/2016",
        "dateOfIncident": "04/01/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10887308,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 AUDI A3.  CONSUMER WRITES IN REGARDS TO THE LACK OF COOPERATION WITH REPLACEMENT OF DEFECTIVE AIRBAG RECALL NOTICE 16V-079.  *SMD",
        "vin": "WAUNF68P56A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/17/2016",
        "dateOfIncident": "02/16/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10885358,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL -    SINCE THE PARTS AREN'T AVAILABLE TO REPAIR MY VEHICLE I HAVEN'T BEEN ABLE TO SELL IT.  I WANTED TO SELL IT SINCE MARCH AND I BELIEVE THE RECALL WAS ANNOUNCED IN FEB.  THE DEALERSHIP CAN'T FIX IT, WON'T TAKE IT IN ON TRADE OR SELL ON CONSIGNMENT DUE TO THE RECALL.   SO I'M STUCK, AND THE VEHICLE CONTINUES TO DEPRECIATE AND I REALLY DON'T WANT TO DRIVE IT.   I ACQUIRED A COMPANY ISSUED CAR IN FEBRUARY SO THAT PROMPTED MY TO DO SOMETHING WITH MY AUDI.  ONE THOUGHT WAS TO KEEP IT FOR MY SO TO BE 16 YEAR OLD DAUGHTER AS HER CAR TO DRIVE TO SCHOOL, PRACTICE, ETC.  BUT WITH THE DISCOVERY OF THE RECALL,  I IMMEDIATELY DECIDED AGAINST THAT...... SO WE ARE STUCK WITH A VEHICLE THAT I STILL MAKE PAYMENTS ON, AND COVER WITH INSURANCE.       SINCE I DIDN'T HAVE THE OPPORTUNITY TO MAKE AN INFORMED DECISION WHEN I PURCHASE THE VEHICLE IN 2012  AS TO HE DANGER OF THE \"TAKATA\" MADE AIRBAG AND DON'T HAVE ANY OPTION TO REPLACE THIS DANGEROUS PART,  I THINK THE MANUFACTURER SHOULD TAKE OWNERSHIP AND OFFER TO BUYBACK MY VEHICLE.  CERTAINLY THIS SAFETY ISSUE IS MORE IMPORTANT THEN THE SCANDAL OF VW'S LYING ABOUT THE DIESEL EMISSIONS.....",
        "vin": "WAUMF78P26A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/14/2016",
        "dateOfIncident": "07/14/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10884880,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2006 AUDI A3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V079000 (AIR BAGS); HOWEVER, THE PART NEEDED TO REPAIR THE VEHICLE WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WAUNF78P16A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/10/2016",
        "dateOfIncident": "06/10/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10873601,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL:  AUDI USA STATES THAT THEY DO NOT HAVE REPLACEMENT PARTS AVAILABLE.  IT HAS BEEN ALMOST 2 MONTHS SINCE I RECEIVED THE ORIGINAL NOTICE AND YET THEY STILL DO NOT HAVE A REVIEW AVAILABLE.",
        "vin": "WAUHF78P36A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/16/2016",
        "dateOfIncident": "05/01/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10865109,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A LETTER FROM AUDI STATING THAT THE AIRBAGS IN MY CAR, PROVIDED BY TAKATA, ARE RECALLED AS \"METAL FRAGMENTS FROM THE AIRBAG COULD KILL PASSENGERS IN THE CAR\".  YOU KNOW THIS ALREADY OF COURSE BUT WHAT I DON'T GET AND WHY I AM WRITING IS WHY ARE THEY BEING GIVEN SO MUCH TIME TO CORRECT OR CHANGE THE AIRBAGS OUT?   THE THOUGHT THAT I AM SUPPOSED TO KEEP DRIVING IT WITHOUT THE REPAIR AND MAYBE GET KILLED FROM A FENDER BENDER IS RIDICULOUS.   WHY DID THEY EVEN SEND ME THE RECALL LETTER IF IN THE LETTER ITSELF THEY STATE THAT CAN'T REPAIR IT \"YET\"?   SO EVERY TIME I GET BEHIND THE WHEEL I AM SCARED TO DRIVE?  I DON'T FEEL SAFE IN MY OWN CAR?  I FEEL LIKE I NEED TO TURN OFF MY AIRBAGS COMPLETELY?  NOW THAT EVERYONE KNOWS, EVEN ME AS THE CAR OWNER, DOES IT SOMEHOW LET THEM OFF THE HOOK IF I DIE BEFORE IT'S REPAIRED TO HAVE TOLD ME?  AND AREN'T YOU, THE US GOVERNMENT NOT RESPONSIBLE AS WELL NOW THAT YOU KNOW SINCE YOU ARE NOT MAKING THEM REPLACE THE BAGS ASAP?    [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "WAUHF78P77A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/13/2016",
        "dateOfIncident": "04/21/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10864751,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WE ARE A LOYAL AUDI CUSTOMERS, HAVING 2 AUDIS NOW.  WE BOUGHT THE CARS BECAUSE OF THEIR SAFETY RATING, KNOWING OUR TEENAGE DAUGHTER WOULD BE SAFE DRIVING HER CAR.  I HAVE GOTTEN A SAFETY RECALL FOR HER CAR AND WANT TO KNOW WHAT THEY ARE DOING TO FIX THE RECALL AND HOW SOON WE CAN GET HER CAR FIXED. WHEN THE AIRBAG ISSUE WAS FEATURED IN THE MEDIA A YEAR AGO, WE ASKED OUR AUDI DEALERSHIP IF AUDI WAS AFFECTED. THEY SAID NO.  SO WE WENT AHEAD AND BOUGHT OUR DAUGHTER AN AUDI. PLEASE LET US KNOW HOW WE CAN FIX THIS PROBLEM, BECAUSE NEXT YEAR I WILL HAVE MY SON DRIVING THE AUDI AS WELL.  KEEP OUR CHILDREN SAFE!",
        "vin": "WAUKD78P26A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/13/2016",
        "dateOfIncident": "05/12/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10864841,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2006 AUDI A3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V079000 (AIR BAGS). THE CONTACT CALLED SEVERAL DEALERS WHO INDICATED THAT THE PART WAS NOT AVAILABLE TO RECEIVE THE RECALL REPAIR APPOINTMENT. THE MANUFACTURER WAS UNABLE TO DETERMINE WHEN THE PARTS WOULD BE SUPPLIED TO THE DEALER. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WAUMF78P56A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/08/2016",
        "dateOfIncident": "04/08/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10854298,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL.  IT HAS BEEN MORE THAN 60 DAYS SINCE AUDI, AUDIUSA AND THEIR PARENT COMPANY, VW, CONCEDED THAT SOME AUDI VEHICLES MAY HAVE DEFECTIVE TAKATA AIRBAGS.  DESPITE THIS FACT, NO RECALL NOTIFICATION LETTERS HAVE BEEN SENT OUT.  MORE IMPORTANTLY, NO ACTUAL REPLACEMENT OF POTENTIAL DEFECTIVE TAKATA AIRBAGS HAVE BEEN INITIATED BY ANY OF THE MENTIONED COMPANY.  NHTSA SHOULD REMIND THESE COMPANIES TO COMPLY WITH FEDERAL LAW AND SEND OUT THE RECALL NOTIFICATION LETTERS AND TO COMMENCE THE RECALL OF POTENTIALLY DEFECTIVE TAKATA AIRBAGS.     I CALLED AUDIUSA TODAY ASKING ABOUT THE RECALL NOTIFICATION LETTER.  AUDIUSA'S REPRESENTATIVE SEEMED OBLIVIOUS TO THE OBLIGATION TO NOTIFY OWNERS IN A TIMELY MANNER AS REQUIRED BY FEDERAL LAW.                               [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "WAUNF78PX6A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/17/2015",
        "dateOfIncident": "06/10/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10811038,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING, PRNDS FLASHES AND CAR GOES INTO LIMP MODE (LOSES POWER). MUST STOP CAR AND TURN OFF. AFTER TURNING ON AGAIN, WILL DRIVE AND WILL HAPPEN AGAIN.",
        "vin": "WAUNF78P56A"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/05/2015",
        "dateOfIncident": "09/26/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 10788632,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2006 AUDI A3. WHILE DRIVING AT APPROXIMATELY 35 MPH, ANOTHER VEHICLE CRASHED INTO THE CONTACT'S VEHICLE. THE AIR BAGS DID NOT DEPLOY. THREE OCCUPANTS WERE INJURED. THE CONTACT SUSTAINED HEAD, LEFT ARM, AND LEFT LEG INJURIES THAT NEEDED MEDICAL ATTENTION. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO AN UNKNOWN AREA. THE VEHICLE WAS DESTROYED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VIN AND FAILURE MILEAGE WERE UNKNOWN.",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/06/2015",
        "dateOfIncident": "10/06/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10780097,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "FAULTY DESIGN IN AUDI A3 TAIL-LIGHTS CAUSE MELTING OF THE BRAKE LIGHT/TAIL-LIGHT HOUSING. MELTED COMPONENTS, DEFORM AND  BREAK THE CONTINUITY OF THE CIRCUIT AND BRAKE LIGHTS FAIL. BULBS ARE GOOD, AND FUNCTIONAL, CIRCUIT IS AFFECTED (BULB HOLDERS MELT AND FAIL) CAUSING BRAKE LIGHT FAILURE. THIS HAPPENS UNDER ANY DRIVING CONDITION, INCLUDING DRIVING.",
        "vin": "WAUMF78P46A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/22/2015",
        "dateOfIncident": "09/19/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10767560,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "NO ACCIDENT HAS HAPPENED YET, BUT IS ONE JUST WAITING TO HAPPEN. THE VEHICLE DOES NOT RESPOND AFTER A ROLL STOP. THE ACCELERATOR HAS TO BE COMPLETELY DEPRESS AND WAIT A FEW SECONDS IN ORDER FOR THE VEHICLE TO START ROLLING. IF I WOULD NEED TO MERGE INTO TRAFFIC AFTER A STOP AT AN INTERSECTION THERE IS A GREAT RISK OF A CRASH  SINCE THE VEHICLE DOES NOT RESPOND TO EQUALIZE THE SPEED OF INCOMING TRAFFIC. THE PROBLEM SEEMS TO AFFECT MANY, MANY OF THESE VEHICLES YEAR AND MODEL ACCORDING TO MULTIPLE COMPLAINTS FROM OWNERS FORUMS. OWNERS HAVE COMPLAINED EVEN WHEN THE VEHICLE WAS BRAND NEW AND AUDI HAVE DISREGARDED THE COMPLAINTS.  ACCORDING TO OWNER'S FORUMS THE MECHATRONIX UNIT INSIDE THE TRANSMISSION IS AT FAULT, AND A SIMPLE SOFTWARE REFLASH FROM AUDI WOULD SOLVE THE PROBLEM. THIS IS QUITE SIMILAR TO THE IGNITION PROBLEM RECENTLY DISCOVERED IN GM VEHICLES.",
        "vin": "WAUHF78P96A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/29/2015",
        "dateOfIncident": "04/15/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10731012,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 AUDI A3. WHILE DRIVING APPROXIMATELY 40 MPH, THE VEHICLE SHIFTED TO NEUTRAL AND THE SELECTOR LEVER ON THE INSTRUMENT PANEL ILLUMINATED. THE CONTACT STATED THAT THE VEHICLE VEERED TO THE SIDE, THE ENGINE STALLED, AND THE VEHICLE RESTARTED. THE FAILURE RECURRED ON SEVERAL OCCASIONS. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC, BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 09V333000 (POWER TRAIN). THE FAILURE MILEAGE WAS 48,000.",
        "vin": "WAUNF98PX6A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/28/2014",
        "dateOfIncident": "09/28/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10639662,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TODAY MY AUDI A3 2.0T WENT INTO NEUTRAL WHILE AT HIGHWAY SPEED.  WE WERE MERGING FROM I-80 TO I-55.  WITHOUT WARNING OR ANY INDICATOR LIGHTS WE LOST POWER.  THE ENGINE WAS RUNNING AND THE SHIFTER IN D-DRIVE BUT NO POWER WAS GOING TO THE WHEELS. WE WERE ABLE TO GET OUT OF TRAFFIC ON THE RAMP BUT IT WAS A CLOSE CALL WITH THE CAR BEHIND US ALMOST HITTING US.   THE CAR EXHIBITED THE SAME PROBLEM ABOUT A HALF HOUR BEFORE AT A GAS STOP BUT I TURNED THE CAR OFF AND THE CAR FUNCTIONED NORMALLY.   THE DASH INDICATORS FLASHED DNRS WHEN WE TRIED TO MOVE AGAIN.   WHILE WAITING FOR THE TOW TRUCK I LOOKED UP RECALLS AND IT SEEMS THE 2007-2009 A3 HAVE RECALL FOR THIS ISSUE AS DO OTHER AUDI MODELS WITH THE SAME DSG TRANSMISSION.   THERE ARE DOZENS OF COMPLAINTS LISTED HERE FOR THIS SAME ISSUE.  WHY IS NOT THE 2006 RECALLED AS WELL?  THIS IS A PROBLEM THAT PUT MY WIFE AND I IN HARMS WAY.  EVEN MORE DISTURBING IS THIS IS A KNOWN ISSUE.  *TR",
        "vin": "WAUNF78P46A"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/08/2014",
        "dateOfIncident": "08/06/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10620796,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR CONDITIONING UNIT WENT OUT.   *TR",
        "vin": "WAUNF78P06A"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/23/2014",
        "dateOfIncident": "07/13/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10615556,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AN INTERRUPTION OF MOTIVE POWER . THE DASH GEAR POSITION INDICATOR (PRNDS) FLASHING.  *TR",
        "vin": "WAUMF78P16A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/04/2014",
        "dateOfIncident": "05/26/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10596188,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "REFERENCE NHTSA ACTION NUMBER: PE09035, RECALL NUMBER: 09V333000 I HAD EXACTLY THE SAME TYPE OF ISSUE OCCUR ON MY 2006 AUDI A3. THIS A3 HAS A 2.0T ENGINE AND 6 SPEED DSG TRANSMISSION. TODAY WHILE DRIVING IN TOWN ON A VERY BUSY STREET, THE VEHICLE SUDDENLY AND WITH NO WARNING DOWNSHIFTED AND THEN ALL PRNDS LIGHTS BEGAN TO FLASH. I WAS STUCK IN HEAVY TRAFFIC AND GOT INTO THE CENTER LANE WHERE I EVENTUALLY MAKE A LEFT HAND TURN. IT APPEARED TO HAVE ONLY ONE FORWARD GEAR (1ST). I HAD TO DRIVE IT HOME 20 MILES AWAY WITH NO REVERSE AT 15 MPH AND 3500 RPM.  I HAVE KEPT THE CAR WELL MAINTAINED AND IT WAS ONLY DEALER MAINTAINED UNTIL RECENTLY. THIS TYPE OF FAILURE IS RIDICULOUS. HAD I BEEN GOING FASTER, I WOULD HAVE LIKELY HAD AN ACCIDENT. THE DOWNSHIFT WAS ABRUPT AND CAUSED A VIOLENT JERKING IN THE CAR. THE CAR HAS NOT DISPLAYED ANY EVIDENCE OF HARDER SHIFTING OVER TIME. THIS IS THE SAME GEARBOX SYSTEM AS IN THE RECALLED LATER MODEL YEARS. THE RECALL MUST BE ADJUSTED TO INCLUDE EARLIER MODELS WITH THE SAME SYSTEM. THIS IS A SYSTEMIC DEFECT. I HAVE FOUND THIS ISSUE ACROSS NUMEROUS AUDI OWNER FORUM WEBSITES COVERING WIDER MODEL YEARS THAN LISTED ON THIS RECALL. I CONTACTED AUDI OF AMERICA AND THEY SAID THAT IT IS OUT OF WARRANTY; TOO BAD. THE CLOSEST DEALER IS 150 MILES AWAY. I REQUEST NHTSA INVESTIGATE.   *TR",
        "vin": "WAUMF78P26A"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/18/2014",
        "dateOfIncident": "03/20/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10583580,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "RIGHT HEADLIGHT FLICKERS AND GOES OUT. CONSOLE MESSAGE: RIGHT HEADLIGHT DIPPED.  *TR",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/24/2013",
        "dateOfIncident": "08/01/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10553608,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT LIGHT HEADLIGHT FLICKERS AND THEN GOES OFF.  CAN COME BACK ON BY MANUALLY TURNING OFF AND ON THE LIGHTS.  GOES BACK OFF WITHIN 10 SECONDS.  HAVE GONE FOR REPAIR MULTIPLE TIMES AND HAVE BEEN PULLED OVER AND WARNED BY POLICE.  HELP US-IF YOU GOOGLE THIS PROBLEM THOUSANDS OF OWNERS HAVE THE SAME ISSUE AND HAVE DUMPED HUGE AMOUNTS OF MONEY INTO THE VEHICLE WITHOUT REPAIR.   *TR",
        "vin": "WAUKD78P16A"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/24/2013",
        "dateOfIncident": "12/21/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10545081,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS CAR WAS PURCHASED USED - SO IT MAY HAVE BEEN A PREVIOUS ISSUE.  HOWEVER, INITIALLY, THE DASHBOARD PANEL INDICATED THAT THERE WAS A \"RIGHT DIPPED HEADLIGHT.\"  THEN THE HEADLIGHT ISSUE WOULD SWITCH TO THE LEFT AND IT WOULD HAPPEN INTERMITTENTLY.  FOR A SHORT PERIOD OF TIME IF I TOGGLED THE HEADLIGHT SWITCH ON THE DASHBOARD BACK AND FORTH - THE LIGHTS WOULD GO BACK TO NORMAL FOR A SHORT PERIOD OF TIME. HOWEVER, NOW THE ISSUE DOES NOT RESOLVE ITSELF BY DOING THIS.  AND, ON OCCASION IN THE DARK - BOTH HEADLIGHTS WILL GO OUT COMPLETELY.  I HAVE RESEARCHED PUBLIC FORUMS AND IT SEEMS TO BE A COMMUNITY ISSUE WITH SOME AUDI VEHICLES.  THIS IS A HUGE SAFETY PROBLEM AND SOMEONE IS EVENTUALLY GOING TO GET HURT OR WORSE.  PLEASE INVESTIGATE. THIS IS A FORUM LISTING YEARS OF COMPLAINTS FROM SEVERAL AUDI DRIVERS:  HTTP://WWW.AUDIZINE.COM/FORUM/ARCHIVE/INDEX.PHP/T-332613.HTML  *JS",
        "vin": "WAUNF78P16A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/07/2013",
        "dateOfIncident": "07/06/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10523555,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 AUDI A3 2.0T WITH DSG. TRANSMISSION IS SLIPPING SOMETIMES ON ACCELERATION, SOMETIMES WITH STEADY DRIVING. STEPPED ON ACCELERATOR AT STOP LIGHT AND TRANSMISSION ENGAGED FOR ABOUT 5 FEET, THEN CAR LURCHED TO A STOP, THEN TRANSMISSION CAUGHT AND IT ACCELERATED FORWARD AGAIN. ISSUE REPEATED TWO MORE TIMES WITHIN THE HOUR.    TODAY I WAS CRUISING AT A STEADY 70 MPH, 6TH GEAR, ABOUT 2800 RPM, AND THE TRANSMISSION LET GO AND RPMS DROPPED TO ABOUT 2200 BEFORE THE TRANSMISSION RE-ENGAGED AND THE VEHICLE WAS AGAIN AT 2800 RPM. HAPPENED ONCE PER MILE AFTER THAT, AND THEN TWICE AGAIN ON SURFACE STREETS IN 4TH GEAR.    APPEARS TO MATCH EXACTLY THE SYMPTOMS OWNERS EXPERIENCE WITH RECALLED 2007-2010 VEHICLES WITH THE SAME TRANSMISSION.  *TR",
        "vin": "WAUNF78P96A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/18/2013",
        "dateOfIncident": "06/18/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10520495,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "REFERENCE NHTSA ACTION NUMBER:  PE09035, RECALL NUMBER: 09V333000    I HAD EXACTLY THE SAME TYPE OF ISSUE OCCUR ON MY 2006 AUDI A3.  THIS A3 HAS A 2.0T ENGINE AND 6 SPEED DSG TRANSMISSION.  TODAY WHILE DRIVING ON THE HIGHWAY, THE VEHICLE SUDDENLY AND WITH NO WARNING DOWNSHIFTED AND THEN ALL PRNDS LIGHTS BEGAN TO FLASH. I WAS ABLE TO NAVIGATE THE CAR TO THE RIGHT SHOULDER.  IT APPEARED TO HAVE ONLY ONE FORWARD GEAR (3RD). I WAS ABLE TO DRIVE IT TO A PLACE FOR TOWING.  EVEN REVERSE WAS NOT AVAILABLE.  THIS TRANSMISSION WAS RECENTLY SERVICED.  I HAVE KEPT THE CAR WELL MAINTAINED AND IT WAS ONLY DEALER MAINTAINED UNTIL RECENTLY.  THIS TYPE OF FAILURE IS RIDICULOUS.  HAD THE TRAFFIC NOT BEEN LIGHT, I WOULD HAVE LIKELY HAD AN ACCIDENT. THE DOWNSHIFT WAS ABRUPT AND CAUSED A VIOLENT JERKING IN THE CAR.  THE CAR HAS NOT DISPLAYED ANY EVIDENCE OF HARDER SHIFTING OVER TIME.      THIS IS THE SAME GEARBOX SYSTEM AS IN THE RECALLED MODEL YEARS. THE RECALL MUST BE ADJUSTED TO INCLUDE EARLIER MODELS WITH THE SAME SYSTEM.  THIS IS A SYSTEMIC DEFECT. I HAVE FOUND THIS ISSUE ACROSS NUMEROUS AUDI OWNER FORUM WEBSITES COVERING WIDER MODEL YEARS THAN LISTED ON THIS RECALL. I REQUEST NHTSA INVESTIGATE.  *TR",
        "vin": "WAUMF78P56A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/11/2013",
        "dateOfIncident": "06/02/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10516203,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE GOES OUT OF GEARS WHILE DRIVING ON THE FREEWAY FOR ABOUT 20MINS IN HOT WEATHER, THIS WAS GOING ABOUT 70 MPH.  THE \"PRNDS\" LIGHT FLASH FOR A QUICK SECOND AND BACK INTO GEAR AGAIN.  I HAVE VARIOUS ISSUES WITH HARSH SHIFTS UP AND DOWN, ESPECIALLY IN THE LOWER GEARS.  WHILE SLOWING DOWN TO A STOP THE VEHICLE HAS A HOT TIME GOING IN TO SECOND GEAR AND SOMETIME FIRST.  IT MAKES A VERY NOTICEABLE CLUNK SOUND WHEN IT DOES.  FROM A STOP, GIVING JUST A BIT OF GAS AND THE CAR DON'T SEEM TO MOVE THEN IT WILL SURGE UNTIL THE SPEED COMES UP.  WHILE GETTING UP TO SPEED IT WILL TRY TO GET INTO THE HIGHEST GEAR AS SOON AS POSSIBLE, I WOULD BE IN 6TH GEAR WHILE ONLY GOING 35MPH.  THERE ARE SOME SAFETY ISSUES INVOLVED AND THAT IS WHY I'M TAKING THE TIME TO FILE.  *TR",
        "vin": "WAUKD78P66A"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/16/2013",
        "dateOfIncident": "05/15/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10512368,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR SWIVELS SIDEWAYS EVEN ON GOOD, FLAT ROADS AND AT LOW SPEEDS.  IT'S BEEN HAPPENING QUITE FREQUENTLY AND I DON'T FEEL SAFE DRIVING IT, KNOWING THAT IT CAN SHIFT TO THE SIDES AND CAN HIT THE CAR NEXT TO ME.  I'VE HEARD THIS IS A CUPPING OR FEATHERING EFFECT AND I'VE READ THAT THIS PARTICULAR BRAND AND MODEL IS PRONE TO DEVELOPING SUCH ISSUES.  *TR",
        "vin": "WAUNF68P16A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/17/2013",
        "dateOfIncident": "09/01/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10498447,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN COMING SLOWLY TO A STOP THE CAR WILL SUDDENLY SURGE FORWARD.  TRAVELING SLOWLY FORWARD OR REVERSE WILL ALSO CAUSE UNEXPECTED SURGES.  *TR",
        "vin": "WAUMF78PX6A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/26/2012",
        "dateOfIncident": "10/07/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10482343,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 AUDI A3. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 25 MPH, THE VEHICLE STARTED TO JUMP ABNORMALLY BEFORE STALLING. THE VEHICLE WAS ABLE TO BE RESTARTED BUT WOULD NOT ACCELERATE FORWARD. THE VEHICLE WAS LATER TAKEN TO AN INDEPENDENT MECHANIC FOR DIAGNOSIS WHO INFORMED HIM THAT THE MECHATRONIC UNIT FOR THE TRANSMISSION HAD FAILED. THE MECHATRONIC UNIT WAS REPAIRED. THE MANUFACTURER WAS CONTACTED AND OFFERED NO ASSISTANCE. THE FAILURE AND CURRENT MILEAGES WERE APPROXIMATELY 91,000.    UPDATED 10/22/13 *CN",
        "vin": "WAUNF78P96A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/02/2012",
        "dateOfIncident": "10/01/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10468942,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE AN AUDI A3 2006. SEVERAL YEARS AGO (END OF 2009/BEGINNING OF 2010), I STARTED FEELING AND HEARING A CLUNKING NOISE AND THE CAR WOULD LUNGE FORWARD A FEW INCHES WHEN APPROACHING STOP SIGNS OR RED LIGHTS AND DOWNSHIFTING FROM 2ND TO 1ST GEAR. THIS WOULD HAPPEN PERIODICALLY AND HAS BEEN INCREASING IN STRENGTH. I WAS TOLD BY AUDI THAT IT WAS A DUE TO A FAULTY MECHATRONIC SYSTEM, WHICH IS LIKE THE BRAINS OF THE CAR. AUDI SERVICE QUOTED ME A COST OF APPROXIMATELY $2500 TO REPLACE THE MECHATRONIC SYSTEM. I HAVE READ ON MANY FORUMS THAT THIS HAS BEEN HAPPENING TO MANY AUDI A3 OWNERS AND THAT THEY HAVE NOT ISSUED A RECALL FOR THIS ISSUE. GIVEN THE FREQUENCY OF THE ISSUE, I THINK THIS SHOULD BE ADDRESSED BY AUDI AND RECALLED. *TR",
        "vin": "WAUKD78P76A"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/13/2012",
        "dateOfIncident": "05/09/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10458247,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON THE FREEWAY BACK TO THE HOTEL IN LAS VEGAS FROM THE WEST RIM OF THE GRAND CANYON, 100+ DEG OUTSIDE TEMP. SUDDEN FUEL CUT OFF/LOSS POWER FOR ABOUT 1 SEC. TOOK IT THE DEALERSHIP AND THE IN TANK FUEL PUMP/CONTROL MODULE FAILED THUS CUT OFF SENDING FUEL TO THE ENGINE.   UPON PICKING MY VEHICLE THE SERVICE ADVISOR COMMENTED THAT SEVERAL CARS FROM CALIFORNIA WITH COOLER TEMPERATURES HAVE HAD EXPERIENCED THIS ISSUE.   THIS PUT ME AND MY FAMILY IN A VERY DANGEROUS SITUATION AND COMPROMISED OUR SAFETY. I'VE DONE SOME RESEARCH AND FOUND OUT PROBLEM OCCURRED ON SAME YEAR HAS MY VEHICLE.  *TR",
        "vin": "WAUNF78P36A"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/15/2011",
        "dateOfIncident": "03/31/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10435689,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PROBLEM STARTED WITH AN INTERMITTENT RIGHT HEADLIGHT TILT MESSAGE. THE RIGHT BULB WAS REPLACED PER TSB 2013829/6 ON 4/15/09 BY THE DEALER UNDER WARRANTY. WE HAVE BEEN HAVING THIS PROBLEM ON THE LEFT SIDE FOR THE PAST YEAR OR MORE.  THE LEFT HEADLIGHT NOW TURNS OFF INTERMITTENTLY AFTER THE DIP WARNING LIGHT COMES ON. WHEN THE LIGHTS ARE TURNED OFF AND ON AGAIN, THE LIGHT TURNS ON. THIS  IS A SAFETY ISSUE AS THE LEFT HEADLIGHT SHUTS OFF RANDOMLY. WE ARE OUT OF WARRANTY NOW AND FEEL BOTH HEADLIGHTS SHOULD HAVE BEEN REPAIRED UNDER THE ORIGINAL TSB WHILE THE CAR WAS UNDER WARRANTY. THE BULBS ARE XENON AND VERY EXPENSIVE. THIS PROBLEM APPEARS TO BE A COMMON PROBLEM WITH AUDI'S BASED ON THE SERVICE ORDER AND INTERNET DISCUSSION GROUPS.  *TR",
        "vin": "WAUNF78P96A"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/28/2011",
        "dateOfIncident": "09/23/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10427701,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS VERY KNOW PROBLEM WITH VW/AUDI 2.0T ENGINES THAT I WAS NOT AWARE OF BEFORE IT HAPPENED TO ME.  BASICALLY CAMSHAFT FOLLOWER BROKE CAUSING DAMAGE TO HIGH PRESSURE FUEL PUMP AND CAMSHAFT.  THE CAM SHAFT FOLLOWER IS TOO WEAK AND IT BRAKES TOO OFTEN FOR SOME OTHER PEOPLE.  THERE IS TON OF COMPLAINS ON THE INTERNET ABOUT TJIS SPEVIFIC PROBLEM.  NOW THE HIGH PRESSURE FUEL PUMP IS ON BACK ORDER SINCE JULY AND NO ONE KNOWS WHEN IT WILL BE AVAILABLE.  I'M STOCK WITHOUT A CAR AND NO ONE CAN HELP OR EVEN TELL ME WHEN THE PART WILL BE AVAILABLE.  AUDI IS NOT DOING ANYTHING TO HELP.  I DON'T KNOW WHAT ELSE I CAN DO.  PLEASE HELP!  *TT",
        "vin": "WAUHF68PX6A"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/13/2011",
        "dateOfIncident": "09/30/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10425140,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHT INTERMITTENTLY FAILS TO COME ON. \"RIGHT DIPPED HEADLIGHT\" OR \"LEFT DIPPED HEADLIGHT\" WARNING MESSAGE APPEARS ON DASHBOARD. AUDI REPLACED THE \"RIGHT CONTROL IGNITER\" ON 9/30/09, BUT PROBLEM CONTINUED. AUDI REPLACED THE RIGHT HEADLIGHT BULB ON 10/2/09, AND THE PROBLEM WAS MUCH REDUCED BUT NOT TOTALLY ELIMINATED. BOTH THESE REPAIRS WERE DONE UNDER WARRANTY WITH NO CHARGE. ON 5/16/11, AFTER CAR WAS OUT OF WARRANTY, I STATED THAT THE PROBLEM PERSISTED, BUT AUDI COULD NOT DUPLICATE THE PROBLEM, SO NO REPAIRS WERE DONE. THE PROBLEM CONTINUES TO GET WORSE, BUT THE REPAIRS THAT AUDI PERFORMED SO FAR HAVE NOT CORRECTED THE PROBLEM. *TR",
        "vin": "WAUNF78P76A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/11/2011",
        "dateOfIncident": "06/01/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10419093,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE FAILED ON THREE DIFFERENT OCCASIONS  - FAILED TO MOVE ON A STOP SIGN  - MOVED VERY WEAKLY WHEN TAKING A LEFT TURN WHILE IN THE CENTER TURN LANE. CARS WERE COMING FROM THE OPPOSITE DIRECTION AND I BARELY MISSED HAVING AN ACCIDENT.   - VEHICLE WENT INTO NEUTRAL AND COMPLETELY FAILED TO MOVE WHILE STILL IN HEAVY TRAFFIC. WHEN THIS HAPPENED \"PRNDS\" FLASHED ON THE DASH.   - I HAVE THE VIDEO OF THE PROBLEM WHEN IT HAPPENED.     THIS PROBLEM IS A VERY COMMON PROBLEM AND AUDI HAS RECALLED MANY CARS (2007 ONWARDS), BUT MY CAR WASN'T RECALLED. THE RECALL NOTICE FROM AUDI IS IN 2009 AND MY CAR WAS NOT IN IT. WHY IS THAT? HOW DOES AUDI DECIDE WHICH CARS TO INCLUDE IN THE RECALL? I THINK THAT PROCESS IS COMPLETELY FLAWED.  I BELIEVE AUDI CUT CORNERS AND DID NOT RECALL ALL THE CARS THEY SHOULD HAVE. JUST ENOUGH TO CALM PEOPLE DOWN AS THIS PROBLEM WAS ALSO SHOWN ON TV NEWS.    THE PROBLEM WAS FIXED BY THE DEALER BY CHANGING THE \"MECHATRONICS UNIT\" OF MY CAR. THIS FIX IS EXACTLY THE SAME AS THEY DID FOR 2007 YEAR MODELS, SO WHY WAS 2006 NOT INCLUDED IN THE RECALL NOTICE OF AUG 2009.     I BELIEVE THAT THERE ARE STILL MANY CARS ON THE STREET THAT STILL HAS THIS DANGEROUS PROBLEM, JUST WAITING TO HAPPEN. NHTSA SHOULD USE ALL ITS POWER TO RESTART THIS INVESTIGATION AND MAKE AUDI WORK RESPONSIBLY TOWARDS FIXING THIS ISSUE.  *TR",
        "vin": "WAUNF78P86A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/01/2011",
        "dateOfIncident": "06/28/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10410156,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2006 AUDI A3 WITH DSG TRANSMISSION SOMETIMES SLIPS WHEN HOT WHILE PULLING OUT INTO TRAFFIC FROM A STOP.  ALSO SURGES IN FIRST GEAR OCCASIONALLY WHEN HOT.   I HAVE NOT TAKEN IT IN FOR REPAIRS AS THEY ARE TOO EXPENSIVE. THERE HAS BEEN MANY COMPLAINTS OF THIS SAME ISSUE ON AUTO FORUMS. IM GOING TO TAKE IT IN THIS WEEK AND SEE WHAT THE CHARGE WOULD BE TO CHECK IT OUT. BUT IM SURE ITS THE SAME PROBLEM AS ALL THE OTHER AUDI AND VW CARS OUT THERE WITH THE DSG TRANNY.IM SCARED TO PULL OUT INTO TRAFFIC AND GET HIT.  *TR",
        "vin": "WAUMF68P56A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/01/2011",
        "dateOfIncident": "06/01/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10410268,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AUDI DSG TRANSMISSION SAFETY ISSUE - THE\"PRNDS\" ON MY DASH OFTEN STARTS FLASHING, AND THE TRANSMISSION IS NOW IN A \"LIMP\" MODE.  I THEN HAVE TO PUT THE CAR IN NEUTRAL, TURN THE IGNITION OFF, START THE CAR, AND PUT IT BACK IN DRIVE MODE.  I DO ALL OF THIS WHILE EITHER ROLLING DOWN THE ROAD OR THE ALTERNATIVE IS FIND A PLACE TO PULL OVER.  AUDI RECOGNIZES THIS AS A PROBLEM ON DSG EQUIPPED VEHICLES JUST A FEW MONTHS NEWER THAN MINE.  I DON'T UNDERSTAND WHY THEY WILL NOT ADMIT IT IS A SAFETY ISSUE ON CARS BUILT WITH THE SAME EQUIPMENT JUST A LITTLE EARLIER.  PLEASE HELP ME RESOLVE THIS SAFETY ISSUE WITH AUDI.  THEY CLAIM IT NEEDS A NEW TRANSMISSION THAT WILL COST $4800 AND CAN ONLY BE DONE AT A DEALER.  THIS HAS BEEN AN ONGOING PROBLEM FOR OVER 1.5 YEARS AND HAS GOTTEN MUCH MORE FREQUENT IN THE LAST HALF YEAR.  *TR",
        "vin": "WAUNF78P16A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/29/2011",
        "dateOfIncident": "05/30/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10409291,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I NOTICE AFTER DRIVING MY 06 AUDI A3 FOR ABOUT 30 MINUTES AND WITH THE ENGINE WARMED UP, THE CAR WOULD JERK VIOLENTLY EVERY TIME AFTER WARM UP, AND IT WOULD SOMETIMES STALL. MY CAR IS A AUTOMATIC WITH DSG. THE JERKING HAPPENS WHEN I APPLIED THE GAS AND IT WOULD HAPPEN IN ALL THE GEARS. THERE WOULD BE TIMES WHERE I'D BE MAKING A TURN TO CROSS ON COMING TRAFFIC, I HIT THE GAS AND THE CAR WOULD JERK GIVING ME NO POWER AND STALL IN THE MIDDLE OF THE STREET WITH ON COMING TRAFFIC! GOOD THING THEY STOPPED FOR ME! BUT WHAT IF I'M NOT SO LUCKY THE NEXT TIME AROUND? WHAT IF THEY DON'T STOP IN TIME? AND WHAT IF I HAVE MY LITTLE SISTER, NIECES AND NEPHEWS IN MY CAR WHEN IT HAPPENS? I TOOK IT TO THE AUDI DEALER AND TOLD THEM ABOUT THE PROBLEM BUT THEY FOUND NOTHING THAT WOULD CAUSE THE JERKING AND STALLING. TWICE! I FEEL LIKE AUDI KNOWS ABOUT THE PROBLEM BUT WONT ADMIT TO IT AND DO NOTHING. SO MANY VW OR AUDI OWNERS HAVE THE SAME ISSUES. THIS ISN'T JUST ABOUT MONEY, IS ABOUT HUMAN LIVES WHICH SHOULD BE MORE VALUED THAN MONEY TO AUDI.  *TR",
        "vin": "WAUNF78P06A"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/06/2011",
        "dateOfIncident": "06/01/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10406308,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER THE VEHICLE CAME TO A STOP AT A STOP SIGN, AND I TRIED TO GET THE VEHICLE TO MOVE AGAIN, ITS RESPONSE WAS VERY WEAK AS IF IT HAD LOST POWER. COUPLE OF TIMES EARLIER, THE VEHICLE REFUSED TO ENGAGE INTO REVERSE GEAR, STRANDING ME IN A PARKING LOT FOR A WHILE. ON SHOWING THE DEALER, THE FAULT WAS IN THE MECHTRONICS UNIT OF THE DSG (DIRECT SHIFT GEARBOX). AUDI HAS RECALLED CARS FROM YEAR 2007 ONWARDS FOR THIS ISSUE, CLAIMING THAT 2006 AND BEFORE ARE NOT AFFECTED. THIS IS NOT THE CASE AS IT HAS HAPPENED WITH MY CAR, WHICH IS A 2006. THE SYMPTOMS AND FAILED UNIT ARE EXACTLY THE SAME, WITH THE SAME RESOLUTION PROPOSED BY THE DEALER AS THEY WOULD FOR 2007 YEAR ONWARD MODELS. AT THE TIME OF WRITING THIS COMPLAINT, AUDI HAS REFUSED RESPONSIBILITY AND ARE NOT SUPPORTING THE RECALL FOR MY VEHICLE. I THINK THIS IS SERIOUS OVERSIGHT THAT AUDI IS UNWILLING TO ACCEPT RESPONSIBILITY FOR AND SHOULD BE CORRECTED BY NHTSA'S HELP.  THE EXACT SYMPTOMS ARE ALSO MENTIONED IN THIS NEWS ARTICLE  HTTP://WWW.AUTOINSANE.COM/2009/08/28/NEWS/RECALLS-TSBS/VOLKSWAGEN-RECALLS-53300-NEW-VEHICLES-ANNOUNCES-SERVICE-PROGRAM-TO-ADDRESS-DSG-COMPLAINTS/",
        "vin": "WAUNF78P86A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/21/2011",
        "dateOfIncident": "01/01/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10397011,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE THE DAY I BOUGHT MY 2006 AUDI A3 2.0T, I AM HAVING THIS ISSUE. WHEN I START MOVING FROM A COMPLETE STOP (SUCH AS ON A RED LIGHT), THE CAR JERKS BACK AND FORTH 1-2 TIMES ROUGHLY. THIS HAPPENS ALL THE TIME WITHOUT FAIL. THE JERK IS SO POWERFUL THAT IT MAKES ALL PASSENGERS' BODIES SHIFT FORWARD WITH ITS MOMENTUM. IT FEELS AS IF I SLAMMED ON THE BRAKE SUDDENLY. ALSO, AT TIMES, FROM A STOP WHEN I PUT MY FOOT ON THE GAS, THE CAR HESITATES BEFORE SLAMMING INTO GEAR AFTER 2-3 SECONDS OF NOT RESPONDING TO MY THROTTLE INPUT. THIS HAS SCARED HELL OUT OF ME AT COUPLE OF INSTANCES BECAUSE I ALMOST GOT INTO A READ REND COLLISION FROM SOMEONE BEHIND ME NOT PAYING ATTENTION AND ALMOST SLAMMING INTO THE BACK OF MY CAR. LUCKILY, AS I KNOW MY CAR HAD THIS CHARACTERISTIC SO I REACT QUICKLY IN SUCH OCCASIONS. FROM WHAT I UNDERSTAND AFTER READING PLENTY OF STUFF ONLINE, THIS IS A PROBLEM WITH THE MECHATRONICS UNIT. MANY PEOPLE HAVE HAD SUCCESS FIXING THE PROBLEM BY GETTING A REPLACEMENT DSG/TRANSMISSION/MECHATRONICS UNIT INSTALLED. WHEN I VISIT AUDI DEALER, THEY SAY EVERYTHING IS FINE. I HAD BEEN TO AUDI DEALER FOR 3 TIMES. BUT, I'M SURE THAT EVERYTHING IS DEFINITELY NOT FINE. SOMETHING NEEDS TO BE DONE TO FIX THIS PROBLEM AS EVERYONE I HAVE MET WITH THE SAME CAR HAS THE SAME PROBLEM. INSTEAD OF ENDING INTO THE HOSPITAL BEDS FOR WHIPLASH FROM READ END COLLISION OR WORSE, THIS HAS TO FIXED IN ALL THE AUDI A3S.  *TR",
        "vin": "WAUNF78P66A"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/04/2011",
        "dateOfIncident": "03/28/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10394205,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 AUDI A3 WITH 20T ENGINE.  MALFUNCTION INDICATOR LAMP ILLUMINATED AND CAR DID NOT WANT TO ACCELERATE AND WENT INTO LIMP MODE.      TOOK IT TO THE AUDI DEALER WHERE I PURCHASED THE VEHICLE NEW IN 2005 AND THEIR ANALYSIS INDICATED A BAD INTAKE CAMSHAFT, BAD HIGH PRESSURE FUEL PUMP ALONG WITH BAD CAM FOLLOWER.    QUOTED WORK WAS $1000 LABOR AND $950 IN PARTS.  *TR",
        "vin": "WAUMF78P66A"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/10/2011",
        "dateOfIncident": "01/01/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10381422,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY LEFT HEADLIGHT HAS BEEN DIPPING FOR NO APPARENT REASON. SOMETIMES IF I TURN THE CAR OFF THEN ON AGAIN IT WILL FIX ITSELF. *TR",
        "vin": "WAUNF78P66A"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/31/2011",
        "dateOfIncident": "01/30/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10379788,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 AUDI A3 2.0T.  ABOUT A MINUTE AFTER TURNING THE HEADLIGHTS ON, THE LEFT HEADLIGHT FLICKERS AND THE GOES OUT. I HAVE BEEN UNABLE TO DETERMINE THE CAUSE SO I SEARCHED THE INTERNET AND FOUND THOUSANDS OF PEOPLE WITH THE SAME ISSUE. THIS IS A SAFETY HAZARD BECAUSE THERE SEEMS TO BE KNOW WAY TO GET A PERMANENT FIX AND AUDI WILL NOT RECALL THE VEHICLE FOR A FIX.  EVEN THE DEALERSHIPS HAVE SEVERAL TSB'S ABOUT THE ISSUE.  *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/25/2010",
        "dateOfIncident": "11/10/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10372950,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE STARTED TO STALL AND WAS NOT RESPONSIVE TO ACCELERATION. IT DANGEROUSLY LOST ALMOST ALL OF ITS POWER IN THE MIDDLE OF THE ROAD. THE NEXT DAY IT FAILED TO START.  THE PROBLEM IS A VERY COMMON PROBLEM THAT AUDI HAS PUBLISHED IN THEIR SERVICE BULLETIN 15 07 02 FOR REPLACEMENT OF INTAKE CAMSHAFT AND HIGH PRESSURE FUEL PUMP FOLLOWER. AUDI IS AWARE OF THIS ISSUE AND SHOULD BE HELD RESPONSIBLE FOR THIS DEFECT IN MANUFACTURING AND WORKMANSHIP.   FAILED COMPONENTS: 1) INTAKE CAMSHAFT 2) FOLLOWER AND HIGH PRESSURE FUEL PUMP",
        "vin": "WAUNF78P86A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/15/2010",
        "dateOfIncident": "06/12/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10370805,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AS WITH A LOT OF PEOPLE THAT HAVE COMPLAINED ABOUT THE AUDI A3 TRANSMISSION. THE TRANS STARTED TO LAG THRU THE GEARS ESPECIALLY AROUND 40MPH. ALSO IN REVERSE, YOU WOULD PRESS ON THE GAS PEDAL TO GO BACK AND THE ENGINE WOULD REV BUT WOULDN'T MOVE AND THEN ALL OF A SUDDEN IT WOULD LAUNCH BACKWARDS. VERY DANGEROUS. THE CAR WOULDN'T GET OUT OF ITS OWN WAY SOMETIMES.  *TR",
        "vin": "WAUNF68P86A"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/29/2010",
        "dateOfIncident": "10/15/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10368191,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR SUSPENSION/SETUP LEADS TO EXCESSIVE TIRE WEAR.  LATEST SET OF TIRES (FALCON) ARE CUPPED AT 10,000.  HAS HAPPENED TO THREE PRIOR SETS OF TIRES (TOTAL OF 4 SETS AT 80,000 MILES).  DEALER CLAIMS IT IS THE WRONG TIRE COMPOSITION, BUT OFFERS NO SOLUTION OTHER THAN BUYING THE EXPENSIVE CONTINENTAL TIERS THEY SELL.  *TR",
        "vin": "WAUKD78P36A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/26/2010",
        "dateOfIncident": "10/11/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10362365,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS FOR A 2006 AUDI A3 2.0T WITH THE FSI ENGINE AND THE DSG TRANSMISSION. BOTH MY WIFE AND I EXPERIENCE A FEW DANGEROUS SITUATIONS WHERE THE AUTOMATIC TRANSMISSION DISENGAGED UNEXPECTEDLY AND WE LOST THE ABILITY TO MAKE THE CAR MOVE VIA THE GAS PEDAL. THE CAR'S LCD GEAR SELECTOR DISPLAY THEN BEGAN TO FLASH INTERMITTENTLY TO INDICATE A TRANSMISSION FAILURE OF SOME TYPE. WE DID REGAIN 1ST GEAR AFTER A FEW SECONDS AS WELL BUT THIS PUT US AT DANGER AND IS NOT ACCEPTABLE FOR A FAMILY CAR WITH ONLY 42590 MILES ON IT. THE PROBLEM THEN RE-OCCURRED WITHIN THE NEXT FEW DAYS ABOUT 3 MORE TIMES AND EVEN FAILED WHILE DRIVING INTO THE DEALERSHIP. I HAD TO CALL A COUPLE OF DEALERSHIPS TO GET A STRAIGHT ANSWER AS WELL ON WHETHER THIS WAS COVERED UNDER ANY KIND OF RECALL WARRANTY AS WELL AS THEY WERE ABOUT TO TRY AND MAKE ME PAY FOR THIS UNTIL I ASKED. THE SERVICE FOR A FAILED DSG TRANSMISSION IS EXORBITANTLY PRICED AND ALSO UNACCEPTABLE FOR A CAR THAT ONLY HAS 42590 MILES ON IT AND IS DRIVEN AS A FAMILY CAR STRICTLY. NOT TO MENTION IT HAS BEEN ROUTINELY SERVICED UNDER WARRANTY AND IS NOT DUE TO ANY NEGLECT OR ABUSE. THE DEALER DID REPLACE THE FAILED MECHATRONIC UNIT AND EVEN NOTED THAT THE TRANSMISSION FLUIDS WERE ALL AT THE PROPER LEVELS. THE OLD PART WAS NOT AVAILABLE FOR ME TO VIEW AND I DID NEGLECT TO ASK FOR IT AS THAT IS USUALLY MY PRACTICE WHEN GETTING PARTS REPLACED. *TR",
        "vin": "WAUMF78P16A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/07/2010",
        "dateOfIncident": "07/05/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10341775,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 06 AUDI A3 WITH ABOUT 57K MILEAS AND WHILE TRAVELING TO CALIFORNIA, ACCELERATING ON THE FREEWAY I FELT THE CAR HESITATE SEVERAL TIMES AND I LOST ALL CONTROL OF ACCELERATION. MY ONLY ACTION WAS TO STOP PUSHING THE GAS PEDAL AND DOWNSHIFT TO ANOTHER GEAR. *TR",
        "vin": "WAUMF78P46A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/24/2010",
        "dateOfIncident": "06/24/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10339931,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR TWO DAYS IN A ROW, I HAVE HAD ISSUES WITH MY AUTOMATIC TRANSMISSION SHIFTING DOWN TO FIRST GEAR.  IT OCCURS AFTER A SLOW COMMUTE OVER A PROLONGED HILL.  ONCE I REACH THE TOP AND ACCELERATE, THE TRANSMISSION DOWNSHIFTS TO FIRST, RESULTING IN EXTREME RPMS.  I HAVE TO SHIFT THE CAR DONE TO LOW GEAR THEN BACK TO D(RIVE) TO RESET IT.  THE ISSUE SOUNDS EXTREMELY SIMILAR TO ISSUES ENCOUNTERED WITH THE DGS SYSTEM.  MY VEHICLE IS A 2006 AND THEREFORE DOES NOT FALL WITHIN THE 2007-2009 VW AND AUDI RECALL.  I'M EXTREMELY CONCERNED ABOUT THE COST I AM ABOUT TO INCUR TO RECTIFY THIS SITUATION. *TR",
        "vin": "WAUMF78P96A"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/31/2010",
        "dateOfIncident": "01/01/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10333927,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 AUDI A3 REAR WHEEL VIBRATION/SUSPENSION \"LOOSENESS\" AND TIRE CUPPING.   EXCESSIVE NOISE AT NORMAL SPEEDS. *TR",
        "vin": "WAUMF78PX6A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/01/2010",
        "dateOfIncident": "04/01/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10323328,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I GOT A 2006 A3 (AUTOMATIC) WITH 90K MILES ON IT. WE STARTED EXPERIENCING TRANSMISSION PROBLEMS 2 WEEKS AGO, BASICALLY WHILE DRIVING (AT ANY SPEED) TRANSMISSION WOULD SPORADICALLY SHIFT TO NEUTRAL FOLLOWED BY A JOLTING/CLUNKING NOISE, AND THEN PRNDS LIGHTS WOULD GO OFF ONTHE DASHBOARD. THE SAME THING HAS HAPPENED 3-4 TIMES WITHIN 1 WEEK. THE SCARY THING IS THAT DRIVING ON HIGHWAYS, SUCH I-95, MY WIFE ALMOST GOT REAR ENDED BY A 18-WHEELER.  THIS IS A SAFETY ISSUE. TALKED TO AUDI NA COMPLAIN LINE, AND THEY MENTIONED THERE WASN'T ANYTHING REPORTED TO THEM, THERE WAS NO RECALL ON THIS ITEM, AND NO WILLINGS TO HELP TO COVER THE COST OF REPLACING PARTS. I DON'T SEE THIS ANY DIFFERENT FROM THE GAS PEDAL ISSUE THAT TOYOTA IS ADDRESSING. MANY COMPLAINS OR CASES HAVE BEEN REPORTED ON AUDI/VW FORUMS.",
        "vin": "WAUNF78P66A"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/19/2010",
        "dateOfIncident": "03/10/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10321090,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "HIGH PRESSURE FUEL PUMP DEFECTIVE. CAR WILL NOT MOVE WHEN GAS PEDAL IS APPLIED. VEHICLE ALSO DOES NOT ACCELERATE AT TIMES WHEN MERGING WITH TRAFFIC BECAUSE OF LACK OF COMBUSTION IN ENGINE. HAVE HAD CLOSE CALLS WHEN CROSSING LANES OF TRAFFIC BECAUSE OF THIS. MANY TIMES THERE IS A 2-3 SECOND DELAY BEFORE ACCELERATION OCCURS. *TR",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/03/2010",
        "dateOfIncident": "08/15/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10316031,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "LEFT DIPPED (LOW BEAM) HEADLIGHT INTERMITTENTLY GOES OUT.  SPOKE WITH DEALERS AND OTHER MECHANICS.  IT DOES NOT SEEM TO BE THE BULB.  MAY BE THE BALLAST, BUT MAYBE NOT.  DEALER HAS NO INDICATION OF PROBLEM.  MANY INCIDENCES OF THE PROBLEM REPORTED ON INTERNET FORUMS.  VERY EXPENSIVE REPAIR FOR A TRIAL FIX.  BALALSTS ARE 400+ AND BULBS 300+.  MANY PEOPLE HAVE SPENT THE MONEY AND HAD NO GOOD RESULTS. *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/03/2010",
        "dateOfIncident": "02/28/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10316362,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY AUDI A3 DYNAMIC SHIFT GEARBOX, HAS BEEN HAVING ISSUES FROM ABOUT 30K MILES, WHICH IN THE LAST FEW DAYS HAVE ESCALATED TO A COMPLETE FAILURE OF THE GEARBOX.  DESPITE THE FACT THAT I HAVE COMPLAINED TO THE AUDI SERVICE AT 48000 MILES, ABOUT:  JERKINESS WHILE SHIFTING FROM 2ND TO 1ST GEAR;  LACK OF ADEQUATE ACCELERATION WHEN STARTING FROM A COMPLETE STOP;  CAR DIES WHEN STOPPING ON INTERSECTIONS WHILE DRIVING IN CITY CONDITIONS;  SHIFTING TO INCORRECT (NEUTRAL) GEAR WHILE OPERATING AT HIGHWAY SPEEDS;  AUDI DOES NOT WANT TO COVER THE REPAIR COSTS UNDER WARRANTY, AND IT DOES NOT ACKNOWLEDGE THE FACT  THAT IT HAS SHOWN NEGLIGENCE IN DIAGNOSTIC THE PROBLEM, PRIOR TO A COMPLETE MECHANICAL FAILURE.  THE CAR IS CURRENTLY IS SERVICE AWAITING A REPLACEMENT OF THE DSG (MECHATRONIC AND GEARBOX) WHICH ARE ESTIMATED TO COST AT ABOUT 7000 - 10000 DOLLARS.  ACCORDING TO THE FACTS AND MY SERVICE RECORDS, IT IS MY BELIEVE THAT AUDI SHOULD BE FULLY RESPONSIBLE FOR THE REPAIR COST OF THIS PROBLEM. *TR",
        "vin": "WAUKD78PX6A"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/02/2010",
        "dateOfIncident": "02/02/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10303831,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERMITTENT HEADLIGHT MALFUNCTION. OVER THE COURSE OF A YEAR OF OWNERSHIP, THE RIGHT HEADLIGHT HAS MALFUNCTIONED (TURNED OFF), WITH NO CONSISTENT CAUSE APPARENT.  JUST RECENTLY THE LEFT HEADLIGHT HAS STARTED TO MALFUNCTION AS WELL.  WHILE DRIVING BOTH HEADLIGHTS HAVE GONE OUT! THIS CONDITION IS BOTH UNSAFE, AND ILLEGAL - AS MANY STATES WILL ISSUE A TRAFFIC VIOLATION FOR DRIVING WITH A NON-FUNCTIONING HEADLIGHT. THE RIGHT LIKE MALFUNCTIONS EVERY TIME I USE THE LIGHTS AND THE LEFT HAS MALFUNCTIONED 4 TIMES IN THE PAST MONTH, THE HEADLIGHT FLICKERS, THEN GOES OUT, BUT WILL COME BACK ON WHEN THE LIGHTS ARE TURNED OFF THEN ON AGAIN.  BUT THE FLICKERING OCCURS WITH IN MINUTES OF SWITCHING THEM BACK ON.  THE DEALERSHIP HAS BEEN NOTIFIED OF THE PROBLEM AND HAS CLAIMED THAT EVERYTHING IS FINE AND THEY CAN NOT REPRODUCE. THEY HAVE SUGGESTED I WAIT UNTIL BOTH GO OUT TO REPLACE THEM. NO PARTS HAVE BEEN REPAIRED OR REPLACED, HOWEVER THEY HAVE CLAIMED TO PERFORM A VISUAL INSPECTION OF THE ELECTRICAL CONNECTIONS. ANNECDOTAL EVIDENCE (CONVERSATIONAL, AND VIA INTERNET OWNERS' FORUMS) SUGGESTS THAT THE PROBLEM IS WIDESPREAD AMONG A SUBSTANTIAL PORTION OF AUDI'S MODEL RANGE AND YEARS. *TR",
        "vin": "WAUMF78P36A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/10/2009",
        "dateOfIncident": "10/02/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10286997,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE IS TRAVELING A LONG TRIP.  SHE IS DRIVING A 2006 AUDI A3.  SHE HAD BEEN HAVING WEIRD THINGS HAPPEN DURING HER TRIP.  IT STARTED WHEN SHE MADE A RIGHT HAND TURN FROM A STOP SIGN.  SHE PUSHED THE GAS, BUT THE CAR DID NOT MOVE FOR A FEW SECONDS AND THEN IT WENT.  THIS HAPPENED A FEW TIMES, ALL THE SAME SORT OF WAY.  THEN AFTER A RIGHT-HAND CORNER TURN, THE CAR MADE THIS HUGE NOISE AND CLUNK UPON ACCELERATION.  AGAIN, IT DROVE OK AFTER THAT.  HOWEVER, THE BIG UNSAFE PROBLEM FIRST OCCURRED @ APX. 49,870 ON ODOMETER, IRONICALLY, JUST BEFORE THE WARRANTY WAS OUT.  SHE WAS DRIVING ABOUT 45 MPH & BACKED OFF OF THE GAS TO SLIDE IN BETWEEN TWO CARS & THEN PRESSED ON THE GAS TO ACCELERATE TO THE SPEED OF THE MOVING TRAFFIC & SUDDENLY WITHOUT WARNING, THE CAR SEEMED TO GO INTO NEUTRAL BUT BECAUSE THE GAS WAS INCREASING, THE ENGINE KEPT REVVING.  SHE SEEMED TO COAST, NO INCREASE IN SPEED.  THE CAR BEHIND HER SWERVED OVER IN TIME, BUT IT WAS TOO CLOSE! SHE BACKED OFF OF THE GAS OR BRAKED, SHE COULDN'T REMEMBER AND THE CAR CLUNKED INTO GEAR.  WHEN SHE CALLED ME, THE CAR HAD 50,150 & SHE WAS CONCERNED BECAUSE THIS HAD JUST HAPPENED A 2ND TIME.  IT HAPPENED THE SAME WAY, WHEN SHE WAS ACCELERATING.  I CALLED MY LOCAL AUDI DEALER & SPOKE WITH THE SERVICE MANAGER WHO AGREED TO PROVIDE A FREE DIAGNOSTIC TEST.  WE HAVE SINCE DISCOVERED THAT THERE IS A RECALL FOR THIS SAME PROBLEM IN EFFECT FOR THE 2007-2009 AUDI (INCLUDING A3) AS WELL AS FOR 2007-2009 VW'S WITH THE SAME TRANSMISSION PROBLEM. 2006'S NEED TO BE INCLUDED IN THE RECALL TOO. *TR",
        "vin": "WAUMF78P86A"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/09/2009",
        "dateOfIncident": "06/04/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10286900,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "LOSS OF POWER AND DTC P2293, P0087 IN ECM CAUSED BY PREMATURE WEARING OF THE CAMSHAFT FOLLOWER THAT DRIVES THE HIGH PRESSURE FUEL PUMP. THE DTC ARE REFERENCED IN NHTSA ITEM 10025965, AND SERVICE BULLETIN NUMBER 15-08-05. THE CAMSHAFT WEARS THROUGH AND DAMAGES THE FUEL PUMP.  OUTSIDE INVESTIGATION HAS DETERMINED THAT THIS PREMATURE WEAR IS CAUSED BY AN IMPROPERLY HARDENED  CAMSHAFT. THIS IS A MANUFACTURING PROBLEM AFFECTING A LARGE NUMBER AUDI AND VW VEHICLES UTILIZING THE 2.0 ENGINE. *TR",
        "vin": "WAUHF78P86A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/28/2009",
        "dateOfIncident": "09/27/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10285587,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY AUDI A3 WITH DSG HAS BEEN EXPERIENCING SHIFTING PROBLEMS FROM 1-2 AND 2-3. ON THE 29TH, WHILE ACCELERATING FROM A LIGHT IN HEAVY TRAFFIC, THE TRANSMISSION SHIFTED VERY ROUGHLY AND THE ENGINE SEEMED TO HAVE LOST POWER. WHEN I LOOKED INTO MY MIRROR, THE CAR DIRECTLY BEHIND ME DIDN'T EXPECT MY SUDDEN LOSS OF ACCELERATION AND CAME CLOSE TO REAR ENDING ME. THIS ROUGH SHIFTING IS GETTING PROGRESSIVELY WORSE AND I AM GOING TO TAKE IT TO THE DEALER TO HAVE IT CHECKED OUT SOON. *TR",
        "vin": "WAUNF78P66A"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/07/2009",
        "dateOfIncident": "08/13/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10283048,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "1. NORMAL DRIVING.    2. THE CAMSHAFT FOLLOWER ON MY HIGH PRESSURE FUEL PUMP IN MY 2006 AUDI A3 WAS PUNCHED CLEAN THROUGH AND THE PLUNGER ON MY FUEL PUMP WAS EATING AWAY AT MY CAMSHAFT... I SUBSEQUENTLY RECEIVED NO CHECK ENGINE LIGHTS, BUT HAD FUEL CUTS AND BOOST CUTS IN MEDIUM TO HIGH RPMS.    3. I HAD TO BUY A NEW CAMSHAFT, CAMSHAFT FOLLOWER, AND HIGH PRESSURE FUEL PUMP. VW/AUDI REFUSED TO HELP ME BECAUSE I AM AT 60,000 MILES, EVEN THOUGH MY MANUAL SAYS THE PART SHOULD BE CHECK, AND MAYBE REPLACED STARTING AT 100,000 MILES...    THEY SAID THAT MY AFTERMARKET INTAKE MIGHT HAVE CAUSED THE DAMAGE BY \"OVER SPINNING THE ENGINE\"... THIS IS IMPOSSIBLE, AS THE ENGINE HAS A REV LIMITER, AND I NEVER HAVE GONE OVER 4K RPM YET, PLUS MY \"AFTERMARKET INTAKE\" IS NOTHING MORE THAN THE STOCK INTAKE, BUT WRAPPED IN CARBON FIBER, WITH A K&N FILTER REPLACING THE FACTORY ONE. *TR",
        "vin": "WAUNF78P36A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/07/2009",
        "dateOfIncident": "07/24/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10279735,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2006 AUDI A3 3.2 QUATTRO WITH THE DSG TRANSMISSION. I WAS DRIVING HOME FROM MY 45K MILE SERVICE(THE LAST ONE BEFORE IT GOES OUT OF WARRANTY). I WAS DOING ABOUT 45-50 MPH GOING THROUGH THE SUNPASS EXPRESS LANE. I LIFTED OFF OF THE THROTTLE FOR A SECOND AND THEN, WHEN I WENT BACK TO THE GAS, NO DRIVE, NO GEARS. THE RPMS SHOT UP TO AROUND 7500 RPM'S AND THE GEAR INDICATOR SCREEN LIGHTS (P,R,N,D,S) WERE FLASHING AND I HAD TO PULL OFF OF TO THE SHOULDER. AND TRYING TO PULL OVER WITH NO DRIVE ON THE PALMETTO EXPRESSWAY IN MIAMI ALMOST GOT ME INTO 2 DIFFERENT ACCIDENTS. I TRIED TO SELECT REVERSE THEN DRIVE AND SPORT MODE ON THE SHIFTER, NOTHING, SCREEN STILL FLASHING AND THE CAR WOULD NOT MOVE. I CALLED MY DEALER AND HE TOLD ME TO CALL AUDI ROAD SERVICE AND HAVE IT FLAT BEDDED BACK TO THEM. ABOUT 15 MINUTES AFTER THE OCCURRENCE, I TURNED THE CAR OFF AND BACK ON AND IT NOW WAS ABLE TO SELECT A GEAR AND THE FLASHING STOPPED. I DROVE IT VERY DELICATELY BACK TO THE DEALER AND WAS AWAITING A DIAGNOSIS. THEY SAID THEY ARE REPLACING THE FAULTY TRANSMISSION CONTROL/MECHATRONICS UNIT. THIS HAPPENED ON 7/24 AND I AM STILL WAITING ON THE NEW PART TO COME IN. I WANT TO REPORT THIS BECAUSE, IT HAS COME TO MY ATTENTION THAT I AM NOT THE ONLY PERSON TO EXPERIENCE THIS FAILURE ON AN AUDI OR VOLKSWAGEN CAR USING THE DSG OR S-TRONIC GEARBOX.I WANT THIS TO BE DOCUMENTED IN CASE SOMETHING HAPPENS. I'M ALSO WORRIED THAT MY CAR IS JUST ABOUT TO COME OUT OF THE WARRANTY PERIOD AND, IF I HAVE THIS FAILURE AGAIN, IT COULD COST ME THOUSANDS OF MY OWN DOLLARS TO HAVE IT FIXED. *TR",
        "vin": "WAUKD78P66A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/28/2009",
        "dateOfIncident": "03/12/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10278603,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN EXPERIENCING DSG SHIFTING ISSUES. ON SLIGHT INCLINES SUCH AS DRIVEWAY ENTRANCES, WHEN IN REVERSE, I'LL ACCELERATE AND THERE IS NO RESPONSE. MANY TIMES, NEIGHBORS THINK I AM REVVING MY CAR. ALSO, WHEN ACCELERATING FROM START OR A SLOW SPEED ON D OR S MODE, THE ENGINE WILL REV VERY HIGH CLOSE TO 4000-5000RPM. A DSG SERVICE HAD BEEN DONE BY THE DEALER A FEW YEARS AGO AND I HAD ANOTHER ONE DONE LAST MONTH SUSPECTING THAT IT COULD BE THE FLUID BUT TO NO AVAIL, I AM STILL EXPERIENCING THIS ISSUE. *TR",
        "vin": "WAUMF78P86A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/19/2009",
        "dateOfIncident": "07/18/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10277376,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 AUDI A3 3.2 QUATTRO DSG TRANSMISSION FAILS TO ENGAGE WHEN ATTEMPTING TO ACCELERATE FROM A STOP. TRANSMISSION ALSO UPSHIFTS AND DOWN SHIFTS ABRUPTLY DURING ROUTINE DRIVING. *TR",
        "vin": "WAUKD78P56A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/15/2009",
        "dateOfIncident": "06/08/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10276831,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2006 AUDI A3 3.2 W/ DSG.  THE CAR WAS DRIVING FINE UNTIL ONE DAY, COMPLETE DISASTER.  WHAT HAPPENS NOW IS WHEN YOU START UP THE CAR, DRIVE ANY DISTANCE AND COME TO A STOP, THE CAR WILL GO NEUTRAL, THE PRNDS WILL START TO FLASH, AND COME TO A JOLTING STOP.  THE ONLY WAY TO GET IT GOING AGAIN, IS TO POWER OFF THEN START UP AGAIN.  THERE HAS BEEN TIMES WHEN THE CAR HAS GONE NEUTRAL WHILE DRIVING AND I'LL HAVE TO COME TO A STOP.  THIS OCCURS 99% OF THE TIME.  BEING IN THE D.C. AREA, THERE'S LOTS OF TRAFFIC SO POWERING DOWN AND UP AGAIN AT EACH STOP AND GO TRAFFIC ISN'T SAFE FOR ME AND OTHERS AROUND.  THE CAR HAS BEEN AT THE DEALER FOR 5 WEEKS NOW B/C THE REPLACEMENT PART (TRANSMISSION CONTROL UNIT / MECHATRONIC UNIT / DSG) IS FROM GERMANY AND HAS TO BE \"CODED TO YOUR VIN\".  IT ALSO HAS TO GO THROUGH US CUSTOMS BEFORE ARRIVING AT THE DEALER.  BEING OUT OF WARRANTY, THIS IS GOING TO BE A COSTLY REPAIR FOR WHAT SEEMS TO BE A FAULT THAT MANY OTHERS ARE HAVING. *TR",
        "vin": "WAUKD78P66A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/14/2009",
        "dateOfIncident": "07/13/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10276715,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS A NORMAL DAY OF DRIVING, CAR WAS WARMING UP. I LIVE IN FLORIDA SO IT WARMS UP PRETTY QUICKLY. I WAS PULLING OUT ONTO 4TH STREET WHEN I GAVE THE CAR A LOT OF GAS, BUT THE TRANSMISSION DID NOTHING. IT JUST REVVED UP AND THEN AFTER ABOUT 1 OR 2 SECONDS, THE TRANSMISSION ENGAGED AND THE CAR BEGAN TO SLOWLY ACCELERATE. AFTER THIS 1-3 SECOND DELAY, THE CAR WAS DRIVING LIKE NORMAL. BUT THE INITIAL HESITATION ALMOST CAUSED ME TO BE REAR ENDED BECAUSE I WAS PULLING INTO TRAFFIC. MY DSG HAS NO FAULT CODES, YET IT HESITATES AT TIMES AND SOMETIMES SCARES ME.    MY OTHER COMPLAINT HAS TO DO WITH IT HESITATING AND JERKING IN REVERSE. IT HAS ALMOST CAUSED ME TO BACK INTO STUFF. REVERSE IS VERY INCONSISTENT.    MY FINAL COMPLAINT IS IN REGARD TO THE FUEL PUMP SYSTEM. THE FUEL PUMP USES A CAM FOLLOWER. THESE CAM FOLLOWERS WEAR OUT, AND CAN CAUSE FAILURE OF THE HIGH PRESSURE FUEL PUMP SYSTEM. MY FUEL PUMP FAILED UNDER WARRANTY AND WAS REPLACED. LESS THAN 10,000 MILES LATER I INSPECTED MY NEW PUMP AND FOLLOWER AND FOUND EXCESSIVE WEAR ON THE FACE OF THE CAM FOLLOWER. THIS IS UNHEARD OF WITH A CAR LIKE THIS. WHEN THE CAM FOLLOWER FAILS, THE FUEL SYSTEM FAILS - HOW CAN VW/AUDI MANUFACTURE SOMETHING THIS UNRELIABLE. *TR",
        "vin": "WAUNF78P26A"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/05/2009",
        "dateOfIncident": "04/19/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10272929,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "CHRONIC TIRE CUPPING DUE TO A MISMATCH BETWEEN VEHICLE SPECIFICATIONS, SUCH AS WEIGHT, AND SUSPENSION TYPE.  AFTER EXPERIENCING THIS PROBLEM MYSELF AND THEN RESEARCHING THE ISSUE ONLINE ON MULTIPLE DISCUSSION BOARDS THE SAME PROBLEM IS MENTIONED OVER AND OVER AGAIN.  ASSESSMENT BY EXPERIENCED MECHANIC IS THAT CAUSE MUST BE INAPPROPRIATE SUSPENSION SYSTEM. *TR",
        "vin": "WAUNF68PX6A"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "01/22/2009",
        "dateOfIncident": "12/18/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10256050,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "CENTER SEATBELT LOCKS IN THE FULLY RETRACTED POSITION EVERY TIME THE REAR SEAT IS LOWERED AND REQUIRES TAKING THE VEHICLE TO DEALER TO REPAIRED. *TR",
        "vin": "WAUNF68P56A"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "11/12/2008",
        "dateOfIncident": "08/06/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10248566,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I BELIEVE THERE IS A DESIGN ISSUE WITH THE AUDI A3'S OPEN SKY (SUNROOF) SUN SHADE LATCHING MECHANISM.     THE SUNSHADE HAS A PLASTIC CLIP ASSEMBLY WHICH ALLOWS THE SHADE TO COVER THE SUNROOF AREA. THIS DESIGN IS WEAK AND PRONE TO BREAK. THIS HAS BEEN NOTED BY NUMEROUS OTHER A3 OWNERS.    IN APPROXIMATELY 2 YEARS, WE BROKEN THE CLIPS 3 TIMES AND THIS IS WITH VERY INFREQUENT USAGE AND EXTREME CARE.     AUDI SERVICE STAFF OPENLY ADMIT THIS IS AN ISSUE, HOWEVER AUDI ONLY SELLS THE ENTIRE SUNSHADE ASSEMBLY AS A FIX - NOT JUST THE CLIP. THIS IS A $200+ PART, NOT INCLUDING LABOR.     I BELIEVE AUDI SHOULD REDESIGN/RECALL THIS ASSEMBLY OR AT LEAST OFFER A STANDALONE LOCKING REPLACEMENT PART. *TR",
        "vin": "WAUMF78P16A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/04/2008",
        "dateOfIncident": "11/03/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10247628,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DROVE OVER A RAISED MANHOLE COVER. (1.5-2 INCHES ABOVE GROUND) BOTTOM OF CAR HITS COVER & DEPLOYS AIRBAGS. WAS GOING LESS THAN 15 MPH. IMPACT WAS SO MINOR THAT NEITHER MYSELF NOR MY FRIEND'S FACES TOUCHED EITHER AIRBAG. CAR WAS NOT STOPPED BY MANHOLE COVER. WE ROLLED ANOTHER 50 FEET BEFORE I STOPPED THE CAR WITH THE BRAKE. AIRBAG SENSOR MISREAD SITUATION WHICH PUT US AND OTHERS IN DANGER. *TR",
        "vin": "WAUMF78P76A"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,VISIBILITY,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/15/2008",
        "dateOfIncident": "12/20/2005",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10245535,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 AUDI A3.  THE CONTACT STATED THAT THE SHADE COVERING THE SUNROOF FAILED IN HER VEHICLE.  ALSO, THE STEERING COLUMN HAD TO BE REPLACED BECAUSE THE HORN WOULD NOT FUNCTION ALONG WITH THE TURN SIGNALS.  MOREOVER, THE ELECTRICAL SYSTEM ALSO HAD TO BE RE-WIRED.  SHE TOOK THE VEHICLE TO THE DEALER EACH TIME A FAILURE OCCURRED AND THEY WERE REPAIRED UNDER WARRANTY.  MOST RECENTLY, THE BATTERY FAILED AND THE CONTACT HAD TO PAY $257 FOR THE REPAIR.  IN  JULY OF 2007, SHE WAS INVOLVED IN A CRASH; HOWEVER, THE AIR BAGS FAILED TO DEPLOY.  SHE HAS SPOKEN WITH THE DEALER MANY TIMES REGARDING THE FAILURES.  THE MANUFACTURER REIMBURSED HER FOR THE BATTERY REPAIR.  THE CURRENT MILEAGE WAS 22,837 AND FAILURE MILEAGE WAS APPROXIMATELY 300.",
        "vin": "WAUHF78PX6A"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/16/2008",
        "dateOfIncident": "08/12/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10238460,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN WEATHER HEAT CONDITIONS ARE ABOVE 90F THE CAR'S FUEL PUMP WILL SPORADICALLY GLITCH/SHUT -OFF AND PREVENT FUEL TO BE TRANSFERRED FROM THE TANK TO THE ENGINE FOR COMBUSTION.  THIS MAKES THE CAR STALL MOMENTARILY WHEN ACCELERATING FROM A START POINT AND WHILE DRIVING.  I TOOK THE CAR TO AUDI SERVICE CENTER, AND THEY VERIFIED AND CONFIRMED THE PROBLEM AND SAID THAT THE FUEL PUMP NEEDS TO BE REPLACE WITH A SUPERCEEDING PUMP.  AUDI SERVICE CENTER STATED THAT THIS PROBLEM HAS OCCURRED IN THE 2006-2008 A3, AND A4 VEHICLES.  MY CAR HAS 66,000 MILES AND HAS GONE PAST THE WARRANTY LIMITS FOR A NO-CHARGE REPLACEMENT.  THIS FAULT CONDITION IS A POTENTIAL HAZARD FOR DRIVERS.  *TR",
        "vin": "WAUMF78P66A"
    },
    {
        "components": "AIR BAGS,TIRES,EQUIPMENT,CHILD SEAT",
        "crash": false,
        "dateComplaintFiled": "03/14/2008",
        "dateOfIncident": "04/03/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10221162,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Michelin North America, Inc.",
                "productMake": "112S UNIROYAL LAREDO A/S",
                "productModel": "P265/75R15SL",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            },
            {
                "manufacturer": "ALL OUR KIDS JUVENILE PRO",
                "productMake": "ALL OUR KIDS",
                "productModel": "602",
                "productYear": "9999",
                "type": "Child Seat"
            },
            {
                "manufacturer": "ADVANCED CARBON COMPOSITES INC.",
                "productMake": "ACC",
                "productModel": "EXT-001",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "PLEASE DISREGARD THIS A TEST FOR THE NEW DEPLOYMENT.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/09/2007",
        "dateOfIncident": "02/07/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10182139,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE COOLANT LINE FLANGE FAILURE. CAUSES ENGINE COOLANT TO DRAIN FROM VEHICLE  .THE DEALER INDICATES THAT THIS IS COMMON ON THE 2.0 ENGINES.  PART UNAVAILABLE IN THE US (ON BACK ORDER). THE CAR WAS PARKED, LUCKILY.   COULD HAVE BEEN A MAJOR EXPENSE IF ON THE HIGHWAY. DRAINED WITHIN SEVERAL HOURS WHILE PARKED.  IF THIS IS AN ISSUE, WHY ISN'T AUDI REPLACING THIS WITH A METAL FLANGE INSTEAD OF A PLASTIC ONE?  *NM",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/13/2006",
        "dateOfIncident": "07/07/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10162278,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A3",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "1) NO PROBLEM LEADING UP TO TRANSMISSION FAILURE. 3 MONTHS AND 7100 MILES.  2) TRANSMISSION FAILED MID-COMMUTE HOME FROM WORK...CAR STILL IN SHOP, WILL TAKE AT LEASE A FEW WEEKS TO FIX DUE TO LACK OF PARTS  3) NOTHING DONE...PARTS ARE ON ORDER.  *JB",
        "vin": "WAUKD78PX6A"
    }
]