[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/11/2013",
        "dateOfIncident": "11/06/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10551800,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "TT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING DOWN THE ROAD AND MY CAR STOPPED RUNNING. ALL THE BATTERY-OPERATED FUNCTIONS (LIGHTS, WINDOWS, ETC.) WORKED BUT THE ENGINE WOULD NOT START. I HAD IT TOWED TO A REPAIR SHOP THAT TOLD ME THE TIMING BELT BROKE WHILE I WAS DRIVING, DESTROYING THE ENGINE. THIS WAS NOT LISTED IN MY MANUAL UNDER \"SCHEDULED MAINTENANCE\" AND EVERY SHOP I CALLED SAID THE TIMING BELT SHOULD NOT HAVE GONE OUT SO SOON. THIS IS SOMETHING I SHOULD NOT HAVE EVEN HAD TO CHECK FOR ANOTHER 20,000 MILES AND IT IS RIDICULOUS FOR ME TO HAVE TO REPLACE THE ENTIRE ENGINE OF A \"LUXURY\" VEHICLE. I HAVE DRIVEN CHEAPER MADE CARS AND HAVE NEVER HAD AS MANY PROBLEMS AS THIS AUDI HAS CAUSED ME. I AM AT AN IMPASSE WHETHER I SHOULD INVEST IN A NEW ENGINE FOR THIS CAR WHEN I CANNOT TRUST THAT IT DOESN'T HAVE OTHER MANUFACTURER'S DEFECTS THAT I MIGHT NOT HAVE FOUND YET. I KNOW THE 2000-2003 WERE RECALLED FOR THE TIMING BELT AND THE OWNER'S MANUAL WAS NOT UPDATED UNTIL 2008. SOMETHING SHOULD BE DONE FOR THE CARS THAT HAVE THESE DEFECTS IN THE 2004-2007 RANGE.  *TR",
        "vin": "TRUTC28NX61"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/12/2013",
        "dateOfIncident": "02/15/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10506070,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "TT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 AUDI TT. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 45 MPH, THE VEHICLE STALLED. THE VEHICLE WAS TOWED TO THE DEALER FOR DIAGNOSIS. THE TECHNICIAN STATED THE TIMING BELT HAD SLIPPED OFF CAUSING DAMAGE TO THE TURBO ENGINE. THE TECHNICIAN STATED THE TIMING BELT, THE TIMING BELT KIT AND TENSIONER, THE WATER PUMP, AND VARIOUS VALVES AND PLUGS WOULD HAVE TO BE REPLACED. AFTER THE REPAIR, THE ENGINE WARNING LIGHT ILLUMINATED ON AND THE ENGINE CONTINUED TO STALL. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 75,000.   *TR",
        "vin": "TRUTC28NX61"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "07/30/2007",
        "dateOfIncident": "05/20/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10197854,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "TT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING MY 2006 AUDI TT AT 10-15MPH TO MAKE RIGHT TURN. I APPLIED BRAKE LIGHTLY TO SLOW DOWN CAR TO MAKE RIGHT TURN. BRAKES FAILED RESULTING IN COLLISION. *TR",
        "vin": "TRUSC28N561"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/18/2007",
        "dateOfIncident": "07/09/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10196780,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "TT",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "CONTINENTAL",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "HELLO!  I OWN  AN AUDI TT WHICH I GOT FROM TISHER AUDI IN SILVER SPRING IN MARCH 2006.  I  HAD 2 TIRE BLOW OUTS SINCE FEBRUARY 2007.  AUDI TOLD ME THAT THE TIRE IT RECOMMENDED  FOR THE CAR  WAS A LOW ASPECT RATIO TIRE , WHICH WAS  EASILY SUSCEPTIBLE   TO BLOW OUT.  THEY FELT THAT I PURCHASED A TIRE PROTECTION POLICY  THAT COVERED THE COST OF REPLACING TIRES FREQUENTLY AND  THAT  THE  PROBLEM  WAS  RESOLVED.  THEY REFUSED TO ACKNOWLEDGE THERE WAS  A SAFETY PROBLEM  WITH FITTING CARS WITH TIRES THAT WERE  EASILY SUSCEPTIBLE TO BLOW OUTS DUE TO A SHORTER TIRE WALL, AND THEY BLAMED THE ROAD CONDITIONS RATHER THAN THE EASILY SUSCEPTIBLE TIRES.  MORE THAN ONE PERSON AT TISHER AUDI ACKNOWLEDGED THAT MULTIPLE CUSTOMERS HAD  TO REPLACE FREQUENTLY TIRES DUE TO BLOW OUTS.  I FOUND  IT UNCONSCIONABLE THAT AUDI REFUSED  TO ADDRESS THIS AS A CONSUMER SAFETY CONCERN.  MY LAST BLOW OUT OCCURRED WHILE I WAS DRIVING ON THE INTERSTATE AND WAS A VERY PRECARIOUS SITUATION.  PLEASE INVESTIGATE THIS CONSUMER CONCERN.  YOUR CONSIDERATION  WAS  MUCH APPRECIATED. *AK",
        "vin": "TRUWD28N661"
    }
]