[
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/11/2019",
        "dateOfIncident": "10/02/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11267990,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 BMW R1200 RT. WHILE DRIVING 55 MPH, THE CONTACT SMELLED FUEL COMING FROM THE FUEL PUMP. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE CONTACT STOPPED THE VEHICLE AND NOTICED FUEL LEAKING OVER THE ENGINE. THE CONTACT ASSOCIATED THE FAILURE WITH NHTSA CAMPAIGN NUMBER: 13V617000 (FUEL SYSTEM, GASOLINE). THE CONTACT CALLED BMW MOTORCYCLES MCDONOUGH (LOCATED AT 755 INDUSTRIAL BLVD, MCDONOUGH, GA 30253, (770) 957-7404) AND INFORMED THEM OF THE FAILURE. THE MOTORCYCLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 41,109. *LN  CONSUMER STATED THIS ISSUE WAS ADDRESSED ONCE IN RECALL 13V617 IN 2014.  REPAIR HISTORY INDICATES MY BIKE WAS CHECKED FOR THIS ISSUE BUT THERE IS NO INFORMATION ON WHETHER REPAIRS WERE  PERFORMED. GIVEN THE INFORMATION IN THE TECHNICAL DOCUMENT, EITHER THE PUMP WAS REPLACED ENTIRELY OR THERE WAS  NOTHING DONE. NO METAL REINFORCING RING WAS PLACED ON THE FUEL PUMP, SO EITHER THE PUMP WAS REPLACED WITH ANOTHER FAULTY PUMP OR NO REPAIRS WERE MADE. THIS RECALL WAS NOT ADDRESSED ON MY BIKE EVEN THOUGH THE BIKE WAS CHECKED. I AM HAVING THE EXACT ISSUE MENTIONED FOR SIEMENS FUEL PUMPS IN BMW MOTORCYCLES UNDER THE RECALL. PHOTOS, FUEL LEAK NHTSA INVESTIGATION, AND 2006 BMW REPAIR HISTORY ATTACHED.*JB",
        "vin": "WB10388026Z"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/26/2017",
        "dateOfIncident": "06/23/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11001490,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FUEL STRIP THAT READS GASOLINE LEVEL IS DEFECTIVE. FIRST REPAIR LASTED LESS THAN 200 MILES. RECENT REPLACEMENT FAILED AS I MADE THE TURN OUT OF THE DEALERSHIP FROM THE LAST REPAIR.",
        "vin": "WB10388026Z"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/18/2016",
        "dateOfIncident": "07/17/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10885480,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING SOUTHBOUND ON I-79 NEAR PITTSBURGH AT APPROXIMATELY 70 MPH THE REAR UNIVERSAL JOINT LET GO. THIS CAUSED THE MOTORCYCLE REAR WHEEL  TO INTERMITTENTLY LOCK UP AND RELEASE. THE UNIVERSAL HAS NO MEANS TO LUBRICATE IT AND NO NOISE OR VIBRATION WAS HEARD OR FELT BEFORE FAILURE.",
        "vin": "WB10388066Z"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/13/2015",
        "dateOfIncident": "12/27/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10672199,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS DECELERATING FOR A TURN I FELT A SHUDDER AND HEARD A GRINDING NOISE AND LOST REAR WHEEL BRAKING. I PULLED TO THE SIDE OF THE ROAD AND UPON EXAMINATION OF THE REAR WHEEL DISCOVERED THAT THE REAR BRAKE DISC WAS SEPARATED FROM THE BRAKE MOUNTING FLANGE. EACH OF THE FIVE MOUNTING HOLES HAD FAILED AND ALLOWED THE DISC TO SEPARATE. THE REAR WHEEL IS ALSO BOLTED TO THIS FLANGE. SUBSEQUENT RESEARCH HAS REVEALED THAT THIS IS NOT AN UNCOMMON PROBLEM. MY FEELING IS THAT THIS TYPE FAILURE COULD CAUSE A CATASTROPHIC FAILURE SINCE IT INVOLVES A FAILURE AT SPEED AND RELATES TO THE REAR WHEEL AND REAR BRAKE MOUNTING FLANGE. DEFINITELY A SAFETY ISSUE!  *TR",
        "vin": "WB10388086Z"
    },
    {
        "components": "WHEELS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/27/2014",
        "dateOfIncident": "09/26/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10639539,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE CHANGING MY REAR BRAKES, I NOTICED THAT THE REAR SPACER FLANGE THAT ATTACHES THE WHEEL TO THE ROTOR IS CRACKED IN 3 DIFFERENT MOUNTING AREAS.  I DO NOT RIDE OFF ROAD OR OTHERWISE ABUSE THE BIKE.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/17/2014",
        "dateOfIncident": "09/14/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10637145,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS TRAVELING AT 70 MPH ON THE HIGHWAY I FELT MY MOTORCYCLE ALL OF A SUDDEN WOBBLE AND LOST CONTROL. I STRUGGLE TO REGAIN CONTROL OF THE MOTORCYCLE AND WAS ABLE TO BRING THE MOTORCYCLE TO A STOP BY THE SHOULDER OF THE ROAD. IT APPEARED MY FINAL DRIVE (TRANSMISSION ) HAD FAILED PREMATURELY. THERE WERE OIL FROM THE FINAL DRIVE SPLATTERED ALL OVER MY REAR WHEEL.  THIS WAS A FREIGHTING EXPERIENCE AND COULD HAVE RESULTANT IN SERIOUS INJURY TO ME BECAUSE OF A PREMATURE FAILURE OF THE FINAL DRIVE.  *TR",
        "vin": "WB10388056Z"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/17/2014",
        "dateOfIncident": "08/12/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10625854,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL LEAK: THE PLASTIC AROUND THE FUEL PUMP OUTPUT FITTING IS CRACKED AND LEAKING.  MY LEFT LEG WAS COVERED IN GASOLINE AS WELL AS MY LEFT FAIRING.  *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/28/2014",
        "dateOfIncident": "03/08/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10617031,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE RIDING MY BIKE ON 280 SOUTH, I HAD TO MAKE AN EMERGENCY STOP.  THE REAR BRAKES LOCKED UP, & THE BIKE'S REAR SLID OUT.  THE ABS WAS INOPERATIVE, DUE TO A FAULTY ABS MODULATOR.  THIS IS A COMMON PROBLEM, WHICH BMW IS WELL AWARE OF.  THEY REFUSE TO HAVE A FACTORY RECALL ON THIS PART.   *JS",
        "vin": "WB103880X6Z"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/28/2014",
        "dateOfIncident": "06/27/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10606706,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS CRUISING ALONG ON MY BMW R1200 RT AT THE 70MPH SPEED LIMIT WHEN ALL THE SUDDEN THE BRAKE FAILURE LIGHT  FLASHED REPEATEDLY ON THE DASH, ALONG WITH A RED WARNING TRIANGLE. I IMMEDIATELY LOOK FOR THE NEXT EXIT, BUT BEFORE I GET TO THE EXIT, I ENCOUNTER A HEAVY RAIN.  WHEN I TRY TO SLOW THE BIKE, THE BRAKES ARE NUMB, AND VERY DIFFICULT TO PRESS.  THIS CAUSES AN IMMEDIATE PANIC, BUT I'M ABLE TO SLOW THE BIKE AFTER A VERY LONG INTERVAL.  I PARK THE BIKE AND READ THE OWNERS MANUAL ABOUT THE FAILURE.  IT IS DESCRIBED AS A SERIOUS FAILURE WHICH WILL CAUSE THE SERVO ASSIST TO BE DEACTIVATED, BUT THE BIKE IS STILL RIDEABLE.  SINCE I WAS OVER 300 MILES FROM HOME, I ATTEMPTED TO MANAGE THE PROBLEM AS THE MANUAL RECOMMENDED.      THE BIKE IS BASICALLY UNRIDEABLE AND NOT CONTROLLABLE WHEN THIS ERROR APPEARS.  THERE IS NO WAY TO CONTROL YOUR STOP, AND THIS IS NOTHING LIKE JUST LOSING YOUR ABS, AND HAVING TO RESORT TO REGULAR BRAKES.  THIS IS LIKE HAVING ABOUT 30% OF YOUR BRAKES AVAILABLE! WHICH IS TERRIFYING.  I DON'T KNOW WHY THIS SYSTEM IS DESIGNED THIS WAY,OR WHY BMW WOULD SUGGEST IT'S OKAY TO CONTINUE TO RIDE IN THIS MANNER. I FELT LIKE MY CHANCES OF BEING IN AN ACCIDENT WERE INCREASED BY 120%.  THIS BRAKING SYSTEM IS DANGEROUS.  SO MUCH SO, THAT I FOUND OUT THAT BMW DISCONTINUED ITS USE AFTER THE 2006 PRODUCTION AND WENT WITH A TOTALLY NEW SYSTEM.  THIS SYSTEM WAS ONLY USED FOR 2 YEARS ON THE R1200RT.  I WOULD LOVE TO KNOW WHY THIS SYSTEM WASN'T RECALLED, AND WHAT BMW KNOWS ABOUT THE FAILURE POTENTIAL.  MAYBE THAT'S WHY THEY DISCONTINUED IT.  I FELT MY LIFE WAS PUT IN DANGER BY RIDING THIS MOTORCYCLE. BMW SHOULD BE HELD ACCOUNTABLE.   THANKS.  *TR",
        "vin": "WB10388056Z"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/01/2013",
        "dateOfIncident": "10/30/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10550550,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "IN-TANK FUEL PUMP LEAKS FUEL AT THREADED CONNECTION TO OUTLET QUICK-RELEASE FITTING. I PURCHASED AND INSTALLED A REINFORCEMENT CLAMP MADE BY A THIRD-PARTY SUPPLIER AND REINSTALLED THE QUICK-RELEASE FITTING WITH A FUEL-RESISTANT THREAD SEALANT, BUT THE FITTING STILL LEAKS. I'LL TRY ADHESIVE INSTEAD, ON THE ADVICE OF OTHERS WITH THE SAME PROBLEM.    FUEL LEAKS ARE NOT ACCEPTABLE ON ANY VEHICLE, PARTICULARLY NOT ON A SUPPOSEDLY HIGH-QUALITY MOTORCYCLE.  *TR",
        "vin": "WB10388036Z"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/30/2013",
        "dateOfIncident": "10/25/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10550138,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I SMELLED FUEL (ON AND OFF) ON THE HIGHWAY ON THE WAY TO WORK. WHEN I CAME TO MY PARKING SPACE, THEN I REALLY SMELLED IT. WHEN I LEANED THE BIKE TO PUT IS ON THE SIDE STAND SOME FUEL DRIPPED OUT FROM UNDER THE COWLING, RIGHT BY THE EXHAUST PIPE.   AFTER WORK, IN THE PARKING LOT, I DISASSEMBLED THE COWLING AND FOUND THAT THE BASE OF THE FUEL PUMP ASSEMBLY PACKAGE WHERE THE FUEL LINE CONNECTOR FITTING GOES INTO, WAS CRACKED, (NOT ENOUGH PLASTIC AROUND THE FITTING).  I CALLED THE DEALER AND HE KNEW EXACTLY WHAT I WAS REFERRING TO, AND WAS TOLD THE PART WAS $550 BECAUSE IT INCLUDED THE FUEL PUMP (WHICH I DON'T NEED). I DECIDED THAT I WOULD NOT BUY ANOTHER DEFECTIVELY DESIGNED PIECE, SO I GOT A CLAMP AND PUT IT OVER THE CRACKED PART, AND EPOXIED IT. MAKING IT A BETTER DESIGN.  THE NEXT DAY, I ALSO WAS TOLD THAT THE NEW PIECE FROM BMW HAS THE SAME SOLUTION TO THE PROBLEM, A STEEL BAND. I DON'T KNOW IF THEIRS IS STAINLESS STEEL LIKE MINE.   AT FIRST, I WOULD HAVE SETTLED FOR JUST THE PART I NEEDED, BUT TO BE SOLD THE SAME CRAP PLUS A PART I DIDN'T NEED, I WASN'T GOING TO DO IT.  AT THE URGING OF ANOTHER DEALER I CALLED BMW CUSTOMER SERVICE AND THEY SAID THEY DIDN'T CARE ABOUT MY  PROBLEM, IN A PROFESSIONAL WAY OF COARSE.  I TRY NOT TO PANIC ABOUT SAFETY ISSUES (I AM AN INSPECTOR OF EQUIPMENT IN ANOTHER LINE OF WORK). HOWEVER,  THEIR LACK OF CORRECTIVE BACKING OF A BADLY DESIGNED PART CAUSED ME TO FILE THIS COMPLAINT.  IT IS AT IT'S CORE A SAFETY ISSUE.  *TR",
        "vin": "WB10388096Z"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/06/2013",
        "dateOfIncident": "10/04/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10546949,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE RIDING MOTORCYCLE NOTED FUEL SMELL AND DISCOVERED LEAKING FUEL FROM CRACKS IN THE FUEL PUMP ASSEMBLY TOP PLATE WHERE THE PLASTIC HIGH PRESSURE LINE QUICK DISCONNECT FITTING SCREWS IN TO THE TAPERED PIPE THREADS OF THE PLASTIC PLATE. NOTED EVIDENCE OF FUEL LEAKAGE POOLING WITH POTENTIAL OF DRIPPING ONTO HOT EXHAUST COMPONENTS. IF FUEL WERE TO BE IGNITED THERE WOULD LIKELY BE A CATASTROPHIC FIRE AND POTENTIAL CRASH. THERE IS ALSO THE POSSIBILITY OF LOSS OF TRACTION FOR THE REAR TIRE DUE TO LEAKAGE ON THE GROUND, ALSO POTENTIALLY LEADING TO A CRASH. I BELIEVE THIS IS A SERIOUS DESIGN SPECIFICATION FLAW THAT MAY OCCUR ON ALL THE MOTORCYCLES SIMILARLY EQUIPPED. I ALSO BELIEVE THIS WARRANTS IMMEDIATE ACTION BY BMW, BOTH FOR MOTORCYCLES THAT HAVE YET TO FAIL, AND FOR THOSE THAT HAVE FAILED AND HAVE BEEN REPAIRED BY THE OWNERS.  *TR",
        "vin": "WB10388056Z"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/09/2013",
        "dateOfIncident": "08/03/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10534549,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS LEAKING FROM LEFT SIDE FAIRING AFTER RIDING WITH SMALL SPILL OF GAS ON GARAGE FLOOR.  TAKEN TO MORTONS BMW DEALER TODAY WHERE DEFECTIVE O-RING AND CRACKS IN FUEL PUMP FLANGE WERE NOTED. PRIOR # JBN1-18051.  *TR",
        "vin": "WB10388046Z"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/08/2013",
        "dateOfIncident": "07/17/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10534389,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL SMELL ON CLOTHING AND LEAKING FUEL FOUND DRIPPING ON HOT EXHAUST DURING STOP AT GAS STATION TO REFUEL. IMMEDIATELY PUSH MOTORCYCLE TO SAFE AREA AWAY FROM GAS STATION TO ASSESS CAUSE OF LEAK. FOUND MULTIPLE CRACKS IN PLASTIC FUEL PUMP HOUSING FLANGE THAT WHICH THE HIGH PRESSURE FUEL LINE QUICK DISCONNECT THREADS INTO. FUEL WAS POOLING APPROXIMATELY ONE INCH DEEP ON TOP OF THE FUEL PUMP HOUSING AND NEXT TO FUEL PUMP ELECTRICAL CONTROL RELAY AND WIRING. MOTORCYCLE HAD TO BE TOWED 75 MILES TO NEAREST BMW MOTORCYCLE DEALER FOR FUEL PUMP AND HOUSING REPLACEMENT.   *TR",
        "vin": "WB10388076Z"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/02/2013",
        "dateOfIncident": "08/05/2010",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10505404,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL GAUGE SHOWED 1/3 OF TANK OF FUEL REMAINING AND 110 MILES LEFT BEFORE RUNNING OUT OF GAS.  BIKE RAN OUT OF GAS WHILE RIDING DOWN HIGHWAY AS TANK WAS EMPTY.  WAS ABLE TO PULL OVER TO SIDE OF ROAD SAFELY AND CALL FOR ASSISTANCE.  FUEL GAUGE HAS NOT READ ACCURATELY SINCE.  *TR",
        "vin": "WB10388066Z"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/07/2012",
        "dateOfIncident": "12/06/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10487624,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I STARTED THE MOTORCYCLE ENGINE. A FEW SECONDS AFTER IT STARTED, GASOLINE STARTED TO GUSH FROM THE FRONT OF THE BIKE ONTO THE ENGINE. BEFORE I KNEW IT, I WAS IN A PUDDLE OF GASOLINE. I SHUT IT OFF AS SOON AS I REALIZED WHAT WAS HAPPENING. I MOPPED UP THE GASOLINE OFF OF THE FLOOR TO ELIMINATE THE FIRE DANGER. I LOCKED THE STEERING AND PUT THE KEY AWAY AFTER THAT.  *TR",
        "vin": "WB10388056Z"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/20/2012",
        "dateOfIncident": "08/06/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10471642,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HIGH PRESSURE OUTLET PORT ON THE FUEL PUMP ASSEMBLY DEVELOPED CRACKS THAT EXTENDED FROM THE OUTSIDE OF THE FEMALE PORTION OF THE OUTLET INTO THE THREADS. THIS ALLOWED GASOLINE TO SPRAY ONTO THE INNER PORTION OF THE BODY MOLDING AND RAN DOWN ONTO THE ENGINE AND THE RIDERS LEG ON THE LEFT SIDE.  *TR",
        "vin": "WB10388046Z"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/13/2012",
        "dateOfIncident": "06/27/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10465491,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING REAR WHEEL BRAKE REPLACEMENT, FOUND CRACK IN ONE BOLT HOLE THAT SECURES REAR WHEEL TO DRIVE FLANGE. CRACK COULD ALLOW BOLT SECURING THE REAR WHEEL TO LOOSEN WHILE DRIVING. *TR",
        "vin": "WB103880X6Z"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/25/2012",
        "dateOfIncident": "05/06/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10459714,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE BEGAN STALLING FREQUENTLY AT END OF RIDING SEASON (FALL 2011) WHEN THE ENGINE WAS AT ITS NORMAL OPERATING TEMPERATURE.  ENGINE STALLING OCCURRED WHEN DECELERATING WITH CLUTCH ENGAGED OR AT IDLE, ENGINE WOULD NOT RETURN TO NORMAL IDLE SPEED WITHOUT STALLING. THE ENGINE WAS SERVICED/MAINTAINED BY AN AUTHORIZED LOCAL BMW MOTORCYCLE DEALER ON 3/10/2012 ? 3/13/2012 WITH HOPES THAT ENGINE WOULD RETURN TO NORMAL OPERATING BEHAVIOR FOR THE FOLLOWING RIDING SEASON (2012).  THIS SERVICE/ MAINTENANCE INCLUDED BUT WAS NOT LIMITED TO BMW INSPECTION WITH ANNUAL SERVICE, INCLUDES ALL FLUIDS AND VALVE ADJUSTMENT AND THROTTLE BODY SYNCHRONIZATION.    BUT ON 5/6/2012 THE BIKE WAS RIDDEN ON ITS FIRST LONG RIDE OF THE SEASON.  AFTER RIDING APPROXIMATELY 65 MILES THE BIKE BEGAN TO HAVE THE SAME SYMPTOMS AS DURING THE LAST RIDE IN THE FALL OF 2011.  ON 5/8/2012 THE BIKE WAS TAKEN TO THE SAME LOCAL BMW MOTORCYCLE DEALER THAT PERFORMED THE ANNUAL MAINTENANCE IN MARCH.  DURING THE WEEK OF 5/15/2012 THE BIKE WAS DIAGNOSED, REPAIRED AND AVAILABLE TO BE PICKED UP ON 5/18/2012.  THE DIAGNOSIS FROM THE DEALER'S SERVICE TECHNICIAN IS STATED ON THE SERVICE INVOICE AS FOLLOWS:  PLASTIC FUEL CONNECTOR HAD HAIRLINE CRACK CAUSING FUEL CUT RELAY TO NOT ACTIVATE WHEN DECELERATING CAUSING ENGINE TO STALL.  UPGRADED PLASTIC FUEL CONNECTOR WITH METAL CONNECTOR.  PARTS REPLACED WERE BMW PART NUMBERS:  16 12 1 176 918:HOSE CLAMP  13 53 7 700 800:PLUG (METAL FUEL LINE MALE CONNECTOR)  N/A:FUEL HOSE CUT 1FT.  *TR",
        "vin": "WB10388096Z"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/24/2012",
        "dateOfIncident": "04/04/2009",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10459544,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "FINAL DRIVE BEARING FAILURE IN 2009, REPLACED BEARING THEN HAD FINAL DRIVE HUB FAILURE AT APPROX12K MILES IN 2011, MAY OF 2012 AGAIN HAVE FINAL DRIVE BEARING FAILURE AT JUST OVER 13K MILES. EACH TIME WAS CAUGHT EARLY AND HAD NO OIL LEAKAGE.  *TR",
        "vin": "WB10388036Z"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/16/2012",
        "dateOfIncident": "10/12/2011",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10448216,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "OUTPUT PRESSURE BUNG (PLASTIC) IN FUEL PUMP ASSEMBLY WHERE QUICK DISCONNECT FITTING IS SCREWED IN.  THE BUNG DEVELOPED SMALL RADIAL CRACKS THAT BEGAN TO LEAK GASOLINE THAT WOULD DRIP ONTO THE LEFT ENGINE CYLINDER OR ONTO DRIVER'S LEFT LEG WHILE MOVING.  *TR",
        "vin": "WB103880X6Z"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/15/2012",
        "dateOfIncident": "02/13/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10448104,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "SEVERE DEEP CRACKS ALL AROUND THE PLASTIC COLLAR OF THE OUTPUT PORT OF THE SIEMENS HIGH-PRESSURE FUEL PUMP. FUEL LEAK IMMINENT, WHICH WOULD SPRAY FUEL ALL OVER THE ENGINE.  IT'S COMPLETELY HIDDEN BY THE BODYWORK/FARING SO IT WAS LUCKY THAT I NOTICED IT WHILE SERVICING. EXTREMELY DANGEROUS.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/03/2012",
        "dateOfIncident": "02/01/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10446579,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR WHEEL FLANGE CRACKS AROUND LUG BOLT HOLES.  *KB",
        "vin": "WB10388076Z"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/15/2011",
        "dateOfIncident": "03/12/2011",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10435968,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "HIGH PRESSURE FUEL LEAK WHERE THREADED PLASTIC QUICK DISCONNECT MATES WITH PLASTIC FLANGE ON TOP OF THE FUEL PUMP.  PLASTIC FLANGE IS MOLDED INTO THE TOP OF FUEL PUMP AND HAS MULTIPLE HAIRLINE CRACKS.  SPRAYED GAS WHILE BIKE WAS IDLING.  NO INJURY, BUT DANGEROUS ENOUGH SITUATION TO REPORT.  USE OF USED PUMPS IS NOT RECOMMENDED.  I FOUND THAT USED PUMPS HAD SIMILAR CRACKING; ONLY OPTION WAS TO HAVE BMW DEALERSHIP REPLACE WITH NEW PUMP.  *TR",
        "vin": "WB10388076Z"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/27/2011",
        "dateOfIncident": "05/10/2010",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10433013,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE RIDING MOTORCYCLE NOTED FUEL SMELL, THEN DISCOVERED LEAKING FUEL FROM CRACKS IN THE FUEL PUMP ASSEMBLY TOP PLATE WHERE THE HIGH PRESSURE LINE QUICK DISCONNECT FITTING SCREWS IN TO THE PLATE. NOTE THAT THE FITTING ITSELF AND THE PLATE ARE BOTH MADE OF PLASTIC, AND THE THREADS ARE TAPERED \"PIPE\" THREADS. THE EXHAUST SYSTEM RUNS NEARLY DIRECTLY BENEATH THE AREA OF THE LEAK, AND IF THE FUEL WERE TO BE IGNITED THERE WOULD LIKELY BE A CATASTROPHIC FIRE AND POTENTIAL CRASH. THERE IS ALSO THE POSSIBILITY OF LOSS OF TRACTION FOR THE REAR TIRE DUE TO LEAKAGE ON THE GROUND, ALSO POTENTIALY LEADING TO A CRASH. I BELIEVE THIS IS A SERIOUS DESIGN SPECIFICATION FLAW THAT MAY OCCUR ON ALL THE MOTORCYCLES EQUIPED SIMILARLY. I ALSO BELIEVE THIS WARRANTS IMMEDIATE ACTION BY BMW, BOTH FOR MOTORCYCLES THAT HAVE YET TO FAIL, AND FOR THOSE THAT HAVE FAILED AND HAVE BEEN REPAIRED BY THE OWNERS. I HAVE PICTURES AVAILABLE OF THE FAILED AREA, AND HAVE POSTED ABOUT THIS IN THE PAST AT THE FOLLWING LINK.  HTTP://BMWSPORTTOURING.COM/UBBTHREADS/UBBTHREADS.PHP?UBB=SHOWFLAT&MAIN=54059&NUMBER=598196#POST598196  *TT",
        "vin": "WB10388096Z"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/11/2011",
        "dateOfIncident": "02/10/2011",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10381635,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS NOT EXPERIENCING ANY PROBLEMS. I TOOK OF THE REAR TIRE OFF TO CHANGE THE REAR ROTOR.  I NOTICED CRACKS ON THE FLANGE.  THE FLANGE HOLDS ON THE REAR TIRE. WOW IM GLAD I SAW THE CRACKS.  TWO OF THE FIVE BOLTS WERE VERY LOOSE DUE TO THE CRACKS.  THIS IS A COMMON PROBLEM WITH THE BMW R1200.  AND YET BMW WILL NOT RECOGNIZED IT!  THERE ARE PHOTO ON THE INTERNET WERE THE BOLT HAVE COME OFF AND THE FLANGE FAILS.  I AM VERY LUCK I CAUGHT THIS.  IF THE TIRE CAME OF WHILE I WAS MOVING I WOULD HAVE BEEN HURT OR KILL !!!!  THE BMW DEALER ACTED AS IF IT WAS NOTHING OUT OF THE ORDINARY.  THERE SHOULD BE A RECALL ON ALL BMW R1200 FLANGE.  IT ONLY A MATTER OF TIME FOR SOMEONE TO DIES.  NO FAULTIES HAVE BEEN DOCUMENTED. BUT WHO WOULD KNOW TO LOOK AT THE FLANGE TO SEE IF IT FAILED WHEN THERE IS DEATH ON A BMW.  THIS IS UNSATISFACTORY!!   I AM WAITING ON THE PART. I WILL COST $265.00 AND $80.00 FOR LABOR. *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/17/2010",
        "dateOfIncident": "09/16/2010",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10356151,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 BMW R1200 RT.  WHILE DRIVING APPROXIMATELY 50 MPH, THE CONTACT ATTEMPTED TO DOWN SHIFT BUT THE VEHICLE WOULD NOT SHIFT GEARS.  AS A RESULT, THE VEHICLE WOULD NOT DECELERATE UNTIL THE CONTACT BEGAN TO REPEATEDLY APPLY PRESSURE TO THE CLUTCH.  AS THE CONTACT WAS MOVING THE VEHICLE FROM THE ROADWAY, IT STALLED WITHOUT WARNING. THE VEHICLE WAS TOWED TO HIS RESIDENCE AND AN AUTHORIZED DEALER WAS CONTACTED. THE DEALER ADVISED THAT EITHER THE MASTER CYLINDER OR THE SLAY CYLINDER WAS THE CAUSE OF THE FAILURE.  THE VEHICLE WAS NOT REPAIRED.  THE FAILURE AND CURRENT MILEAGE WAS 77,400.",
        "vin": "WB10388056Z"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/17/2010",
        "dateOfIncident": "10/01/2009",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10356156,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 BMW R1200 RT.  THE CONTACT STATED THAT THERE WAS AN ABNORMALLY OVERPOWERING ODOR OF GASOLINE FROM THE EXTERIOR OF THE VEHICLE. THE VEHICLE WAS PARKED AND SHUT OFF WHEN HE NOTICED THE ODOR. THE ODOR WAS ALSO PRESENT WHENEVER THE VEHICLE WAS IN OPERATION. THE CONTACT LATER DISCOVERED A PUDDLE OF GASOLINE ON TOP OF THE FUEL PUMP. THE CONTACT WAS ABLE TO LOCATE A LEAK IN THE FUEL PUMP. THE VEHICLE WAS NOT EXAMINED FOR THE CAUSE OF FAILURE. THE CONTACT MADE REPAIRS TO CORRECT THE FAILURE.  THE FAILURE MILEAGE WAS 65,000 AND THE CURRENT MILEAGE WAS 77,400.",
        "vin": "WB10388056Z"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/02/2009",
        "dateOfIncident": "10/31/2009",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10290546,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE RIDING SUDDEN UNEXPECTED ENGINE SHUT DOWN  HAS HAPPENED ONCE, 10/31/2009  ENGINE DOES NOT RUN, QUIT WHILE RIDING IN TRAFFIC ON HIGHWAY.   WAS ABLE TO COAST OFF ROAD WITHOUT ACCIDENT  REPLACED FUEL PUMP CONTROLLER, FOUND FAILED CONTROLLER HAD BEEN CONTAMINATED  WITH WATER THAT COLLECTS IN FUEL PUMP ACCESS PLATE.    OLD PART IS AVAILABLE. *TR",
        "vin": "WB103880X6Z"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/31/2008",
        "dateOfIncident": "11/22/2006",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10253347,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 BMW R1200 RT.  APPROXIMATELY 4 TO 5 MONTHS LATER, THE CONTACT NOTICED THAT THE GEAR SELECTION INDICATOR WOULD DISPLAY NEUTRAL WHEN IN FACT IT WAS IN FIRST GEAR.  THE VEHICLE'S REAR WHEEL WOULD TURN AS SOON AS THE VEHICLE WAS STARTED.  DUE TO THE FAILURE, THE CONTACT WAS THROWN FROM THE VEHICLE AFTER STARTING THE ENGINE.  THE VEHICLE SUSTAINED COSMETIC DAMAGE AND THE PASSENGER WAS UNINJURED.  THE VEHICLE WAS DRIVEN TO THE DEALER AND THE MECHANIC WAS ABLE TO DUPLICATE THE FAILURE.  THE MECHANIC LATER STATED THAT THE POTENTIOMETER WAS DEFECTIVE AND THE PART WAS REPLACED.  THE FAILURE HAS BEEN PERSISTENT FOR THE PAST TWO YEARS.  THE MANUFACTURER WAS NOTIFIED AND THEY STATED THAT THERE WERE NO DEFECTS.  THE CURRENT MILEAGE WAS 19,500 AND FAILURE MILEAGE WAS 4,800.",
        "vin": "WB10388056Z"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,POWER TRAIN,WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/03/2008",
        "dateOfIncident": "07/27/2008",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10244337,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE MOTORCYCLE WAS IN NORMAL USE.  I WAS ACTUALLY RETURNING HOME FROM A 3300 MILE TRIP WHEN THE FAILURE OCCURRED.  AT FIRST I DETECTED A REAR WHEEL \"WOBBLE\" WHICH I ATTRIBUTED TO A TIRE PROBLEM.  AFTER PULLING OFF THE ROAD AND INSPECTING THE REAR WHEEL I DISCOVERED THAT THE TIRE WAS FINE BUT THE WHEEL ITSELF WAS LOOSE AND COULD BE MOVED NEARLY AN INCH SIDE TO SIDE.  THIS IS THE SECOND FAILURE OF THE REAR WHEEL ASSEMBLY ON THIS BIKE.  I REPORTED THE FIRST OCCURRENCE IN 2006 AS WELL.  AT THE SHOP THE MECHANICS WERE ABLE TO REMOVE THE WHEEL BY SIMPLY PULLING ON IT.  AT THAT TIME I REALIZED HOW LUCK I WAS TO HAVE PULLED OFF BEFORE THE WHEEL SEPARATED FROM THE VEHICLE ON THE ROAD.  THE MANUFACTURER, BMW NA, INSPECTED THE VEHICLE AND AUTHORIZED REPLACEMENT OF THE ENTIRE FINAL DRIVE ASSEMBLY INCLUDING THE BRAKES (WHICH WERE DAMAGED BY THE WHEEL MOVEMENT). *TR",
        "vin": "WB10388076Z"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/02/2008",
        "dateOfIncident": "07/18/2007",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10244210,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "IN JULY 2007 I EXPERIENCED SIGNIFICANT PLAY IN THE REAR WHEEL OF MY 2006 BMW R1200RT MOTORCYCLE.  THE REAR WHEEL BOLTS TO A FLANGE WHICH IS PRESSED ONTO THE AXLE TUBE OF THE FINAL DRIVE.  THIS IS A COMPRESSION FIT, TOGETHER WITH A CIRCLIP.  WHEN I DETECTED THE PROBLEM, AFTER REMOVING THE CIRCLIP, I COULD REMOVE THE REAR WHEEL WITH NO RESISTANCE WHATSOEVER, I.E., THERE WAS NO RESISTANCE AS THE SPLINED SURFACE OF THE FLANGE, AND THE SPLINED SURFACE OF THE AXLE TUBE, HAD WORN AWAY TO SUCH AN EXTENT.  I TRUCKED THE BIKE TO SALT LAKE CITY WHERE IT WAS REPAIRED UNDER WARRANTY (REPLACEMENT OF THE FINAL DRIVE ASSEMBLY, WHICH INCLUDES THE FLANGE), REAR BRAKE ROTOR AND ALL LUG NUTS.  I CHECK THE PLAY IN THE REAR WHEEL REGULARLY, AND IT DETERIORATED TO THIS DANGEROUS CONDITION IN VERY SHORT ORDER.  FIRST SIGN OF TROUBLE WAS A BLACK METALLIC RESIDUE ON THE REAR WHEEL,AND THE PLAY IN THE REAR WHEEL. *TR",
        "vin": "WB10368036Z"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/25/2007",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10204884,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 BMW R1200RT WITH REAR END FAILURE. CUSTOMER STATES THAT BMW WON'T GIVE HIM ANY INFORMATION ABOUT THIS PROBLEM. HE STATES THAT THE SEALS ARE LEAKING CAUSING THE FINAL DRIVE TO FAIL. CUSTOMER WOULD LIKE INFORMATION.  *KB  THE CONSUMER STATED THE PROBLEM STARTED WHEN BMW INTRODUCED A NEW MAINTENANCE FREE FINAL DRIVE. WHICH MEANT THE DIFFERENTIAL OIL DIDN'T NOT NEED TO BE CHANGED BECAUSE THE REAR END WAS SEALED. YET, A  NUMBER OF REAR ENDS HAVE LEAKED AND CAUSED DIFFERENTIAL FAILURE. *JB",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/18/2007",
        "dateOfIncident": "09/13/2007",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10203344,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "FAILURE OF THE REAR DRIVE ON A 2006 BMW MOTORCYCLE (R1200RT). FAILURE CAUSED BY A BAD BEARING AFTER ONLY 2,600 MILES. *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/07/2006",
        "dateOfIncident": "09/13/2006",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10170189,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "BMW R1200RT FINAL DRIVE. *JB",
        "vin": "WB10388056Z"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "09/19/2006",
        "dateOfIncident": "08/27/2006",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10168628,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE RIDING MY 2006 BMW R1200RT MOTORCYCLE IN HARRIMAN STATE PARK THE REAR TOP CASE CAME OFF OF MY VEHICLE AND NARROWLY MISSES MY FRIEND WHO WAS FOLLOWING ME ON AN AFTERNOON RIDE.   THE CASE OPENED UPON IMPACTING THE GROUND DROPPING MY PERSONAL BELONGINGS ON THE ROADWAY........  THE MANUFACTURER AND DEALER REFUSED TO REPAIR MY VEHICLE AND I HAVE HEARD OF THIS HAPPENING MORE AND MORE WITH THE 2005/2006 R1200 MODELS OF GS AND RT.  PEOPLE COULD BE HURT IF THIS IS NOT LOOKED INTO ....ALSO GREAT LOSSES TO OWNERS IN TIME AND MONEY TO REPAIR DAMAGED EQUIPMENT AND PERSONAL BELONGINGS.  *JB",
        "vin": "WB10388086Z"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/18/2006",
        "dateOfIncident": "09/09/2006",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10168560,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER 3500 MILES OF NORMAL USE MY 2006 BMW R1200RT'S REAR WHEEL BEGAN TO COME OFF THE REAR DRIVE ASSEMBLY POSING A SAFETY THREAT TO ME.  THE MECHANICAL LINK BETWEEN THE WHEEL AND FINAL DRIVE APPARENTLY FAILED CAUSING EXCESS PLAY IN THE REAR WHEEL AND RESULTING IN ABNORMAL TIRE WEAR, POOR HANDLING, AND WOULD HAVE EVENTUALLY FAILED CATASTROPHICALLY.   *JB",
        "vin": "WB10388076Z"
    }
]