[
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/19/2021",
        "dateOfIncident": "07/28/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437278,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "So we bought the car. In 2012 or 2013. And in 2014 we received a yellow letter in the mail saying that our car needed to be serviced for a recall. We set it up. Ended up taking it in To be serviced for the recalls. Not knowing in 2008 they recalled what is now going wrong in the car, I didn’t say anything at the time we repaired it.  It they didn’t either I believe and even if we didn’t say anything they honestly should’ve just repaired the part that was messed up for us and then let us know: now we have spent so much money towing our car back to our house so that it is safe, and have missed appointments, been stranded, I mean we have really, honestly and truly, very very compromised but this issue with the electrical system Our car is having all the time since this recall repair was administered:  NOW IT HAS JUST GOTTEN SO BAD WE CAN NOYT EVEN DRIVE IT. We will get stuck where ever we turn it off unfortunately. I’ve not looked online at information taken all the necessary needs to find out if my vehicle was given the recall before we owned it just to be sure too, it was not. I know that everything that I have read relates directly perfectly to Every single issue that we are have ig Now on our car. The recall from 2014 the key doesn’t come out the ignition anymore and that’s very good, but I know that The CADILLAC Dealer, DID NOT!! Install any other part into the car but that service it asked for. Like beyond a doubt I don’t know what to do and would love to be able to get some answers soon. Thank you very much. [XXX]  INFORMATION Redacted PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "1G6KD57Y76U"
    },
    {
        "components": "STEERING,VEHICLE SPEED CONTROL,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "07/06/2021",
        "dateOfIncident": "07/06/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423685,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "Stabilitrak light on",
        "vin": "1G6kd57y16U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/19/2021",
        "dateOfIncident": "04/19/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11417802,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2006 Cadillac DTS. The contact stated while inspecting the vehicle, he became aware that the oil pan was leaking. There was no warning light illuminated. The vehicle was taken to an independent mechanic to be diagnosed. The contact was informed that the oil pan needed to be replaced. The vehicle was not repaired. The manufacturer was not informed of the failure. The failure mileage was approximately 104,000. Consumer stated leak in the oil pan and vehicle is at the dealership.",
        "vin": "1G6KD57Y96U"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/06/2021",
        "dateOfIncident": "01/01/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406723,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT STATED THAT HE NOTICED AN OIL LEAK UNDER HIS VEHICLE. THE CONTACT STATED NO WARNING LIGHT WAS ILLUMINATED. THE VEHICLE WAS TAKEN TO AN UNKNOWN DEALER AND WAS DIAGNOSED WITH NEEDING THE HEAD GASKET TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER HAD BEEN INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 55,000.",
        "vin": "1G6KD57Y66U"
    },
    {
        "components": "EXTERIOR LIGHTING,VEHICLE SPEED CONTROL,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "03/01/2021",
        "dateOfIncident": "09/22/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398595,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT THIS CAR, AND THE STEERING WHEEL CONTROLS(AUDIO/CRUISE CONTROL) HAVE NOT WORKED, PRIOR OWNER WAS ADVISED TO REPLACE THE BCM. FRONT DRIVER'S HEADLIGHT INTERMITTENTLY GOES ON AND OFF WHEN DRIVING. THE STEERING WHEEL SWITCH TO ADJUST THE HEIGHT, ANGLE, AND SETTINGS FOR EACH DRIVER ALSO ARE NOT WORKING. APPARENTLY THESE ARE KNOWN ISSUES. I HAD SIMILAR ISSUES WITH MY 2000 CHEVY IMPALA, AND MY 2004 CHEVY IMPALA SS.",
        "vin": "1G6KD57956U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/28/2021",
        "dateOfIncident": "01/21/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390489,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEER SYSTEM IS DEFECTIVE. I ACTUALLY LOOKED UP SEVERAL RECALLS ON ALLDATA.COM AND THEY'RE ARE NUMEROUS OF RECALL. THESE RECALLS ARE SPECIFICALLY REFERRING TO THE POWER STEERING SYSTEM. THE RECALLS ARE ACTUALLY SAFETY RECALLS. I CAN'T SEEM TO GET THE RECALLS SERVICED BY ANY LOCAL DEALERS. THIS IS A SAFETY HAZARD TO THE GENERAL PUBLIC.",
        "vin": "1G6KD57Y06U"
    },
    {
        "components": "STEERING,SUSPENSION,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/04/2020",
        "dateOfIncident": "01/20/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377841,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY LIGHTS I HAVE CHANGED AND TRIED EVERY THING ONLY GOT 1 TO WORK SO FAR ! I SMELL A ! BURNING SMELL ! MY POWER STEERING IS SCREWED AND LIKES A SMALL LEEK  ALL ELECTRIC SOME THINGS HAS HAD  ISSUES ! BLOW FUSES CIGARETTE LIGHTER STOPS WORKING CAN'T CHARGE PHONE ! BACK REAR POWER STRUTS ONLY WORK PART TIME ME L BACK UP LIGHTS THAT WARNS  DON'T  WORK MOST OF THE TIME ! MY KEY CAN TURN THE CAR BUT DRIVE WITH OUT KEY IN THE IGNITION THE IGNITION CAN SWITCH IT SELF ! HAVE HAD TO FIX BATTERY AND ALTERNATOR PROBLEMS AND FRONT TIRE PROBLEMS!",
        "vin": "1G6KD57956U"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/29/2020",
        "dateOfIncident": "10/26/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11367038,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT STATED THE VEHICLE WAS LEAKING ENGINE OIL. THE VEHICLE WAS TAKEN TWO INDEPENDENT MECHANICS FOR INSPECTION AND THE CONTACT WAS INFORMED THAT THE ENGINE NEEDED TO BE REMOVED TO LOCATE WHERE THE ENGINE OIL LEAK ORIGINATED FROM. THE CONTACT STATED THAT THE VEHICLE WAS ALSO TAKEN TO AN UNKNOWN CADILLAC DEALER FOR A DIAGNOSTIC TEST AND THE CONTACT WAS INFORMED THAT ENGINE OIL LEAK WOULD GET WORSE OVER TIME. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT CONTACTED NOR INFORMED OF THE FAILURE.  THE FAILURE MILEAGE WAS 93,000. *BF*JB",
        "vin": "1G6KD57Y86U"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/29/2020",
        "dateOfIncident": "07/01/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361692,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE LEAKS OIL, NOT JUST SPOTS, ACTUAL DRIPS, HAVE TO ADD MUCH OIL IN BETWEEN OIL CHANGES.",
        "vin": "1G6KD57YX6U"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/08/2020",
        "dateOfIncident": "04/27/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338171,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT STATED THAT WHEN THE VEHICLE WAS MOVED FROM THE PARKING SPOT AT THE RESIDENCE, THERE WAS AN EXCESSIVE AMOUNT OF OIL ON THE GROUND. THE VEHICLE WAS TAKEN TO NISSANI BROS CHEVROLET LOCATED AT 6101 W SLAUSON AVE, CULVER CITY, CA 90230, TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THE ENGINE NEEDED TO BE REPLACED. THE CONTACT WAS ALSO INFORMED THAT IF THE ENGINE WAS NOT REPLACED, CAREFUL ATTENTION SHOULD PLACED ON THE OIL LEVEL AT ALL TIME. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 114,600.",
        "vin": "1G6KD57Y76U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/23/2020",
        "dateOfIncident": "05/03/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330397,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "PARASITIC BATTERY DRAIN. AFTER CHECKING ALTERNATOR, CURRENT WHILE REMOVING FUSES, CURRENT WHILE IN 'SLEEP' MODE, AND REPLACING BATTERY THREE TIMES THE CAR WILL RUN FOR TWO DAYS, ON THE THIRD DAY IT WILL NOT CRANK AND THE BATTERY IS TOTALLY DEAD.  *TR",
        "vin": "1G6KD57Y26U"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/06/2020",
        "dateOfIncident": "04/06/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11320301,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT STATED THAT THERE WAS EVIDENCE OF AN EXCESSIVE OIL LEAK UNDERNEATH THE VEHICLE. THE VEHICLE WAS TAKEN TO HUBER CADILLAC SERVICE (11102 W DODGE RD, OMAHA, NE 68154) WHERE THE OIL LEAK WAS CONFIRMED. THE VEHICLE WAS NOT REPAIRED. TH  *JSE MANUFACTURER WAS NOTIFIED OF THE FAILURE HOWEVER, NO ASSISTANCE WAS OFFERED. THE FAILURE MILEAGE WAS APPROXIMATELY 75,000.",
        "vin": "1G6KD57Y56U"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/12/2020",
        "dateOfIncident": "02/11/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11308675,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT STATED THAT WHEN THE VEHICLE WAS MOVED FROM THE PARKING SPOT IN THE DRIVEWAY AT THE RESIDENCE, THERE WAS AN EXCESSIVE AMOUNT OF OIL ON THE GROUND. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THE OIL LEAKED FROM THE CAMSHAFT. THE VEHICLE WAS NOT REPAIRED. NEITHER THE DEALER NOR THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 143,000.",
        "vin": "1G6KD57Y86U"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/20/2020",
        "dateOfIncident": "01/18/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300519,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A USED 2006 DTS CADILLAC FROM A DEALER IN OH. BROUGHT IT HOME AND HAD MY MECHANIC GO THRU IT. HE SHOWED ME AN OIL LEAK AND SAID THE OIL PAN GASKET HAD BEEN REPAIRED. MY MECHANIC SAID HE WOULD NOT FIX THE LEAK BECAUSE THERE WAS TOO MUCH INVOLVED. I HAVE SINCE SEEN THAT THIS A COMMON PROBLEM WITH THIS YEAR VEHICLE. SHOULD BE A RECALL. I CAN NOT AFFORD TO GET THIS FIXED. ALSO FOUND OUT THERE WERE 4 OTHER RECALLS ON THIS CAR. CADILLAC SHOULD HAVE A RECALL FOR THIS OIL LEAK. MILEAGE IS 81,000",
        "vin": "1G6KD57Y36U"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/24/2019",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281981,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2006 CADILLAC DTS WHICH I BOUGHT AT AN AUCTION WITH 138,000 MILES. WELL MAINTAINED AND ZERO OBD2 CODES. IT RAN GREAT BUT HAD A SMALL OIL LEAK WHICH HAS PROGRESSED TO THE WHOLE UNDERSIDE OF THE PASSENGER ENGINE BEING WET WITH OIL. SEEMS TO BE COMING FROM EITHER THE CRANKCASE OR OIL PAN GASKET WHICH ARE BOTH REQUIRED TO PULL THE ENGINE TO REPAIR, EXTREMELY EXPENSIVE AND THE AVERAGE PERSON CANNOT AFFORD THESE REPAIRS. HORRIBLE DESIGN FOR SUCH A DIFFICULT ENGINE TO WORK ON. OTHER THEN THAT THE CAR RUNS EXTREMELY WELL, NO OTHER PROBLEMS AND HAS BEEN WELL MAINTAINED BY ME AND PREVIOUS OWNER. I LOVE THE CAR BUT IF I HAVE TO PAY OVER $2K FOR THESE KIND OF REPAIRS THAT I CANNOT DO MYSELF THEN I WILL NEVER OWN ANOTHER GM CAR. NEEDS TO BE A RECALL ON BOTH THE CRANKCASE AND OIL PAN AS THERE ARE MANY COMPLAINTS OF THESE ISSUES. OIL SHOULD NOT LEAK FROM A PARKED CAR NOT RUNNING. DANGEROUS FOR THE ENVIRONMENT AND OTHER DRIVERS. NO WONDER WERE HAVING ISSUES WITH THE ENVIRONMENT, ALL GM CARES ABOUT IS THE MONEY THEY WILL HAVE TO PUT OUT. BUT THIS IS THE REASON THEY'RE SALES HAVE DECLINED AND HAD TO STOP MAKING DEVILLED, NOBODY BUYS THEM BECAUSE GM WON'T RECALL THESE ISSUES. DUH GM ALMOST WENT OUT OF BUSINESS YRS AGO FROM STUFF LIKE THIS, THEY DON'T CARE. SO WHY WOULD ANYONE BUY A GM VEHICLE? THIS WILL BE MY LAST IS THESE ISSUES ARE NOT RECALLED AS THE LABOR IS THE ONLY REASON CADILLACS ARE EXPENSIVE TO REPAIR, PARTS ARE REASONABLE.",
        "vin": "1G6KD57986U"
    },
    {
        "components": "SERVICE BRAKES,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/05/2019",
        "dateOfIncident": "09/17/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11278312,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. WHILE UNDERGOING AN OIL CHANGE AT LINDSAY CADILLAC OF ALEXANDRIA (1525 KENWOOD AVE, ALEXANDRIA, VA 22302, (703) 935-4445), THE DEALER NOTICED THAT THE BRAKE AND FUEL LINES WERE CORRODED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO INSPECTED THE VEHICLE AND CONFIRMED CORROSION WAS PRESENT ON THE FUEL LINE AND BRAKE LINE. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS APPROXIMATELY 44,000.*CW *DL",
        "vin": "1G6KD57Y56U"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/19/2019",
        "dateOfIncident": "05/01/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11244981,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT NOTICED THAT THE VEHICLE WAS LEAKING OIL FROM THE FRONT OF THE VEHICLE UNDER THE ENGINE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO CONFIRMED THE LEAK. THE VEHICLE WAS TAKEN TO DALE EARNHARDT JR. BUICK GMC (1850 CAPITAL CIR NE, TALLAHASSEE, FL 32308, (850) 270-1453) WHERE IT WAS DIAGNOSED AND REPAIRED. THE CONTACT WAS UNAWARE OF THE DIAGNOSIS AND REPAIR SPECIFICS; HOWEVER, THE FAILURE RECURRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 72,000.",
        "vin": "1G6KD57Y26U"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/30/2019",
        "dateOfIncident": "06/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11240549,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. WHILE OPERATING THE VEHICLE, OIL FROM THE ENGINE WOULD LEAK ONTO THE EXHAUST MANIFOLD AND CAUSED SMOKE TO APPEAR INSIDE THE VEHICLE. THE VEHICLE WAS TAKEN TO CENTRAL CADILLAC (2801 CARNEGIE AVE, CLEVELAND, OH) WHERE IT WAS DIAGNOSED THAT THE ENGINE NEEDED TO BE REPAIRED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 92,000.",
        "vin": "1G6KD57Y66U"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/18/2019",
        "dateOfIncident": "07/17/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11233076,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. WHILE THE VEHICLE WAS PARKED IN THE DRIVEWAY, THE CONTACT NOTICED OIL WAS LEAKING. THE CONTACT PLACED CARDBOARD UNDER THE VEHICLE TO VERIFY IF THE LEAK WAS STOPPABLE. THERE NO WARNING INDICATORS ILLUMINATED. AN INDEPENDENT MECHANIC DIAGNOSED THAT THE OIL CHAMBER NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED AND THE FAILURE RECURRED. LEXUS OF ARLINGTON (1510 W DUNDEE RD, ARLINGTON HEIGHTS, IL 60004, (847)-794-4819) WAS CONTACTED AND STATED THAT THE VIN WAS NOT INCLUDED IN A RECALL. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND INFORMED THE CONTACT TO FILE A COMPLAINT WITH NHTSA. THE FAILURE MILEAGE WAS APPROXIMATELY 93,000.  *BF  *TR",
        "vin": "1G6KD57YX6U"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/21/2019",
        "dateOfIncident": "09/01/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11202741,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "STABILITRAC/BRAKES WARNING LIGHTS ON THE DASHBOARD COME ON INTERMITATELY, WHEN IT'S HOT OUT. OR JUST SITTING AT IDLE FOR 30 SECONDS. FRONT BRAKES PUMP ON AND OFF, WHEN MOVING",
        "vin": "1G6KD57Y26U"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/29/2019",
        "dateOfIncident": "01/25/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11192334,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVERS SIDE HEADLIGHT SHUTS OFF AND ON OR FLICKERS - MOST NOTICEABLE DURING NIGHT TIME DRIVING.  OUR DEALER, ED SHULTS CHEVROLET, ADVISED US THAT THIS PARTICULAR MODEL OF THE CADILLAC CTS WAS NOT UNDER RECALL.  WE WANTED AN EXPLANATION AS TO WHY WHEN ALL OF THE TESTIMONIALS FROM OTHER 2006 CADILLAC OWNERS REPORTED THE SAME PROBLEM. THEY DEALER STATED IT HAD TO DO WITH WHERE THE CAR WAS MANUFACTURED.  THE TOTAL CHARGE TO US WAS $901.80 TO REPLACE THE LIGHT + LABOR.  THIS WAS PROBABLY HAPPENING ALL THE TIME WE WERE DRIVING BUT WE ONLY BEGAN TO NOTICE IT DURING NIGHT TIME DRIVING, MOST ESPECIALLY DRIVING BACK FROM THE BUFFALO INTERNATIONAL AIRPORT ON THE THRUWAY.  WE LIVE IN THE CITY OF JAMESTOWN, NY SO IT WASN'T REALLY NOTICEABLE BECAUSE OF THE CITY LIGHTS.  AFTER THAT, WE WERE MORE DILIGENT WHEN DRIVING AT NIGHT AND DISCOVERED0 IT WAS ON A DAILY THING.   THAT WAS VERY SCARY.",
        "vin": "1G6KD57YX6U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/18/2018",
        "dateOfIncident": "12/18/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11162296,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "HEAD LIGHTS GO OFF BY THEMSELVES WHILE DRIVING, EITHER THE LEFT ONE OR THE RIGHT ONE. SOMETIMES EVEN WHILE SITTING IN THE GARAGE WARMING UP THE VEHICLE THE HEADLIGHTS WILL START TO FLICKER AND THEN ONE WILL GO OUT. SHUT OFF THE LIGHT SWITCH WEATHER ITS IN THE AUTO MODE OR OFF MODE AND LIGHTS WILL COME BACK ON AND MY GO OUT AGAIN. VERY DANGEROUS WHEN DRIVING. BEEN GOING ON FOR MONTHS NOW AND CADILLAC DEALER SAYS THEY HAVE NO IDEA WHAT THE PROBLEM IS AND NO FIX. WHY NOT A RECALL FROM GM AS A NUMBER OF OTHERS WITH THE SAME VEHICLE ARE HAVING THE SAME PROBLEM",
        "vin": "1G6KD57Y16U"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/09/2018",
        "dateOfIncident": "12/09/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11157172,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST PURCHASED A 2006 CADILLAC DTS, WE GOT GAS FOR IT AND VERY SOON AFTER WE STOPPED AT A RED LIGHT AND THE VEHICLE SHUT OFF BUT STARTED BACK UP IMMEDIATELY. NONE OF THE CLIMATE CONTROL OR ANYTHING TURNED OFF JUST THE ENGINE. ALSO SOMETIMES WHILE THE VEHICLE IS IDILING IN PARK,DRIVE, OR AT LOW SPEEDS THE VEHICLE WILL IDLE VERY LOW THEN THE RPM'S WILL INCREASE TO NORMAL AFTER ABOUT A SECOND. IF YOU ARE DRIVING AT LOW SPEEDS AND THE CAR DOES THAT WHEN IT REVS UP TO NORMAL IT JERKS. THE LAST PART IS WHEN YOU GET TO LOWER THAN HALF A TANK IT STARTS STUDDERING WHEN YOU COAST THEN ACCELERATE.",
        "vin": "1G6KD57Y96U"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/02/2018",
        "dateOfIncident": "11/28/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11155473,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "BREATHING  POISONOUS FUMES WHEN DRIVING CAR CAUSEING ME TO GETTING SICK.SEEMS TO BE COMING FROM VENT FROM BURNING OIL LEAKING OFF ENGINE,CANNOT DRIVE CAR DUE TO FUMES VERY POISONOUS AND WITH OUT KNOWLEDGE CAN CAUSE DRIVER TO PASS OUT ,CRASH AND CAUSE MANY DEATHS WHEN CRASHING INTO MAJOR HIGH TRAFFIC AREAS FROM PASSING OUT FROM FUMES",
        "vin": "1G6KD57Y36U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/22/2018",
        "dateOfIncident": "06/14/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11130723,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHTS NORMAL (LOW) BEAM INTERMITTENTLY GO OFF WHILE DRIVING, USUALLY INDIVIDUALLY (BOTH LEFT AND RIGHT) AND ON OCCASION BOTH HAVE GONE OUT ALTHOUGH SOMETIMES ONE GOES OFF, DON'T REALIZE IT AT FIRST UNTIL THE OTHER GOES OFF..  THERE IS NO COMMONALITY (FOR EXAMPLE, CAN HAPPEN ON SMOOTH ROADS, ON BUMPS, BUT ALSO CAN GO OVER BUMPS AND LIGHTS STAY ON) AND WHEN THE HEADLIGHT GOES OUT, THE ONLY WAY TO GET IT BACK ON IS TO TURN THE LIGHTS OFF AND ON.  THIS HAPPENS WHETHER USING THE AUTOMATIC LIGHT FEATURE OR HAVING THEM MANUALLY TURNED ON.  THIS HAS BEEN GOING ON FOR OVER A YEAR.  I'VE SEEN SIMILAR COMPLAINTS ONLINE FOR THIS PARTICULAR CAR, AND GM APPEARS TO HAVE DONE A RECALL FOR SIMILAR CARS IN THEIR BUICK AND OTHER LINES BUT NOT FOR CADILLAC.",
        "vin": "1G6KD57Y56U"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/24/2018",
        "dateOfIncident": "07/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11122226,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. WHILE DRIVING 25 MPH, THE VEHICLE STALLED AND OIL WAS LEAKING FROM THE ENGINE COMPARTMENT. THE ALTERNATOR, OIL, AND ENGINE INDICATORS ILLUMINATED. THE VEHICLE WAS TOWED TO GREAT RIVER CHEVROLET GMC (264 DEVEREUX DRIVE, NATCHEZ, MS 39120, 601-653-4829) WHERE IT WAS DIAGNOSED THAT THERE WAS AN OIL LEAK AND THE VEHICLE WAS NOT ABLE TO BE REPAIRED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 62,000.",
        "vin": "1G6KD57Y66U"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/07/2018",
        "dateOfIncident": "08/06/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11118233,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE 70.000 MILES AND NOT ONLY JUST HAVE TO GET NEW AIR CONDITIONING NOW I AM BACK IN SHOP AND MY CAR IS NOW MISFIRING ON 3 PISTONS.  I SHOULD NOT HAVE TO BUY A NEW CAR AND 70,000 MILES I HAVE BABIES I HIS CAR WITH MOST EXCEPT ENDIVE HAS AND OIL CHANGES PER R COMMENDED MILEAGE.  I HAVE ANOTHER CAR AT DEALERSHIP TOO AND WOULD HATE TO THINK IT IS DEALERSHIP BUT BETWEEN THE 2 I HAVE SPENT OVER 15,999 IN REPAIRS AND THE DENELLLI NOW ALSO HAS ISSUE WITH AIR.  THAT TOO IS 2006 AND 70,000 MILES.",
        "vin": "1G6KD57Y36U"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/28/2018",
        "dateOfIncident": "01/18/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11081807,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "FAULTY FACTORY GASKETS AND SEALS CAUSING OIL LEAK FROM OIL PAN. CAR ONLY HAS 92700 MILES. MANY COMPLAINTS ABOUT THIS AND NO ACTION TAKEN. REPAIRS  WILL BE OVER $1000",
        "vin": "1G6KD57Y46U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/28/2018",
        "dateOfIncident": "03/27/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11081804,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHT BALLAST FAILURE DUE TO POOR HEADLIGHT DESIGN WITH HOUSING ETC... CAUSES HEADLIGHTS TO SHUT OF WHILE DRIVING DUE TO MOISTURE. HAPPENED AT NIGHT.    I  HAVE SEEN NUMEROUS REPORTS ABOUT THIS ISSUE AND CURIOUS AS TO WHY NO RECALLS?",
        "vin": "1G6KD57Y46U"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/26/2018",
        "dateOfIncident": "03/26/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11081216,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT CALLED ON BEHALF OF HIS SPOUSE THE DRIVER WHOM INFORMED HIM THAT OIL WAS LEAKING UNDERNEATH THE VEHICLE. THE CONTACT STATED THAT OIL WAS BEING ADDED ON A DAILY BASIS AS THE VEHICLE WAS BEING DRIVEN. THE CONTACT CONTACTED A LOCAL DEALER WHOM INFORMED HIM THE REPAIRS WOULD BE COSTLY. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 149,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/20/2018",
        "dateOfIncident": "11/15/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080391,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Giti Tire (USA), Ltd.",
                "productMake": "DEXTERO",
                "productModel": "TOURING DTR1",
                "productYear": "9999",
                "size": "225/50R17 94V",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS EQUIPPED WITH DEXTERO TOURING DTR1 TIRES, SIZE: 225/55/R17 (NA). THE CONTACT STATED THAT HIS WIFE'S CO-WORKER NOTICED BUBBLES ON THE SIDEWALL OF THE FRONT DRIVER'S SIDE TIRE. THE VEHICLE WAS TAKEN TO AN AUTO CENTER WHERE IT WAS DIAGNOSED THAT THE TIRE NEEDED TO BE REPLACED. THE CONTACT WAS ADVISED TO PAY OUT OF POCKET AND SEEK REIMBURSEMENT; HOWEVER, THE TIRE WAS OUT OF STOCK. THE TIRE WAS NOT REPLACED. THE MANUFACTURER WAS NOTIFIED AND DID NOT ASSIST. THE CONTACT WAS ADVISED TO CALL NHTSA. THE APPROXIMATE VEHICLE AND TIRE FAILURE MILEAGE WAS 148,000. THE DOT NUMBER WAS NOT AVAILABLE.",
        "vin": "1G6KD57Y86U"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/21/2018",
        "dateOfIncident": "02/14/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11074025,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT STATED THAT THE FRONT PASSENGER SIDE HEADLAMP FLICKERED AND FAILED TO ILLUMINATE. BENNETT CHEVROLET (6721 E BLACK HORSE PIKE, EGG HARBOR TOWNSHIP, NJ) WAS CONTACTED, BUT DIAGNOSTIC TESTING WAS NOT PROVIDED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS NOT PROVIDED.",
        "vin": "1G6KD57Y86U"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/20/2017",
        "dateOfIncident": "01/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11055726,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "OIL LEAKS FROM THE ENGINE. LEAKS HAPPEN BOTH WHILE DRIVING AND WHEN PARKED IN ALL SITUATIONS.",
        "vin": "1G6KD57Y86U"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/20/2017",
        "dateOfIncident": "10/30/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11047651,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ON OCT,30,2017 I WAS SITTING IN THE CAR WITH IT IDLING. AFTER ABOUT 10 MINUTES THE CAR STARTED REGISTERING \"HOT\".  THE DASH BOARD SAID IT WAS RUNNING HOT.  THE THERMOSTAT HAND HAD MOVED TO THE RED POINT . I CUT THE CAR OFF AND WAITED FOR ABOUT 5 MINUTES AND STARTED BACK UP AND DROVE IT TO CREST DEALERSHIP .  AT THIS POINT THE HAND OR NEEDLE HAD GONE BACK TO NORMAL LEVEL. THE CUSTOMER SERVICE PERSON INFORMED US THAT IT COULD BE THE GASKET.  WE LEFT THE CAR WITH THEM AND WAS TOLD 2 DAYS LATER THAT IT WAS INDEED THE GASKET GOING OUT AND WOULD COST AROUND $6300.00 TO FIX.  THE PROBLEM IS THAT THE CAR IS SERVICED ON A REGULAR BASIS, OIL CHANGES, WINTERIZED BELTS CHECKED,ETC.  I HAVE HAD NUMEROUS PROBLEMS WITH THE ENGINE AND HAD IT FIXED. THE CAR HAS ABOUT 45,000 ON IT. THIS ENGINE HAS GIVEN MORE TROUBLE AND I HAVE SPENT A LOT OF MONEY. I FEEL THAT THE ENGINE, WHICH IS A NORTHSTAR ENGINE AND IS A  \"LEMON\" AND SHOULD BE RECALLED.  I SHOULD NOT HAVE TO SPEND SO MUCH MONEY ON GETTING THIS CAR FIXED AND I KEEP IT UP TO DATE ON THE MAINTENANCE OF THIS VEHICLE.  PLEASE TAKE TO THE TIME TO CONTACT CREST CADILLAC IN NASHVILLE TENNESSEE FOR MY RECORDS.",
        "vin": "1G6KD57Y36U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/27/2017",
        "dateOfIncident": "09/25/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11040569,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLITES KEEP GOING OFF AT NITE WHILE DRIVING I NOTICE PLENTY OF COMPLANTS WHY GM NEEDS A RECALL PLEASE FOLLOW THU ASAP",
        "vin": "1G6KD57976U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/24/2017",
        "dateOfIncident": "10/18/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11039347,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHTS FLICKER AND CUT IN AND OUT. JIGGLING THE SWITCH SEEMS TO HELP DEALERS COULD NOT FIX'BEEN GOING ON SEVERAL YEARS",
        "vin": "1G6KD579X6U"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,INTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/29/2017",
        "dateOfIncident": "04/01/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11020282,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. WHILE OPERATING THE VEHICLE AT NIGHT, THE HEADLIGHTS CONTINUSLY FLASHED OFF AND ON. OCCASIONALLY, ONLY ONE HEADLIGHT WOULD ILLUMINATE AND THE SECOND LIGHT WOULD RANDOMLY SHUT OFF. ALSO, THE INTERIOR DOME LIGHTING WOULD REMAIN ILLUMINATED WHILE DRIVING. THE CAUSE OF THE FAILURES WAS NOT DIAGNOSED. THE VEHICLE WAS NOT REPAIRED. THE LOCAL DEALER (ED MORRIS CADILLAC OF TAMPA, FLORIDA) WAS NOTIFIED OF THE FAILURES. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 48,000.",
        "vin": "1G6KD57Y96U"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/19/2017",
        "dateOfIncident": "09/01/2012",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11006408,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. WHILE OPERATING THE VEHICLE, THE ODOR OF BURNING OIL WAS PRESENT. WHILE PARKED, THE CONTACT NOTICED OIL LEAKING UNDER THE ENGINE COMPARTMENT. THE VEHICLE WAS TAKEN TO THE DEALER (BUD DAVIS CADILLAC LOCATED IN MEMPHIS, TENNESSEE) WHERE IT WAS DIAGNOSED THAT THE ENGINE GASKETS AND SEALS WERE FAULTY AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 75,000.",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/08/2017",
        "dateOfIncident": "07/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10993996,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT STATED THAT THE EXTERIOR BRAKE LIGHTS FAILED WITHOUT WARNING. NINE MONTHS PRIOR, THE BRAKE LIGHTS WERE REPLACED FOR THE SAME FAILURE. THE VEHICLE WAS TAKEN TO CREST CADILLAC WHERE THE FAILURE WAS NOT DIAGNOSED; HOWEVER, THEY STATED THE BRAKE LIGHT NEEDED TO BE REPLACED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND REFERRED THE CONTACT TO NHTSA. THE FAILURE MILEAGE WAS APPROXIMATELY 121,000.",
        "vin": "1G6KD57Y96U"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/12/2017",
        "dateOfIncident": "05/12/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10985107,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. WHILE DRIVING VARIOUS SPEEDS, THE HEADLIGHTS FAILED TO ILLUMINATE. THE CONTACT HAD TO RESET THE LIGHT SWITCH BY FLIPPING THE SWITCH BACK AND FORTH FOR THE LIGHTS TO ILLUMINATE. THE FAILURE RECURRED EACH TIME THE VEHICLE WAS DRIVEN AT NIGHT. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THAT A BULB OR WIRE CAUSED THE HEADLIGHTS TO FAIL. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 70,000.",
        "vin": "1G6KD57YX6U"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/17/2017",
        "dateOfIncident": "02/20/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10966567,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT STATED THAT THERE WAS A PROGRESSING OIL LEAK WITHOUT WARNING. THE DEALER INDICATED THAT THEY WOULD NEED TO PUT IN A NEW SEAL OR GASKET TO RESEAL THE AREA, BUT WOULD NOT GUARANTEE THAT THE REPAIR WOULD PROVIDE A PERMANENT REMEDY. THE DEALER INDICATED THAT IF THE REPAIR FAILED, THE ENGINE ASSEMBLY MAY NEED TO BE REPLACED. THE CONTACT WAS EXCLUDED FROM ANY MANUFACTURER CAMPAIGNS TO SERVICE THE ENGINE. THE APPROXIMATE FAILURE MILEAGE WAS 29,000.",
        "vin": "1G6KD57976U"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEATS",
        "crash": false,
        "dateComplaintFiled": "01/21/2017",
        "dateOfIncident": "12/27/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10946856,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "HEATED SEAT ELEMENT NOT WORKING ON PASSENGER SIDE FRONT SEAT.",
        "vin": "1G6KD57Y36U"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEATS",
        "crash": false,
        "dateComplaintFiled": "01/21/2017",
        "dateOfIncident": "12/27/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10946858,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER SIDE SEAT HEATING ELEMENT NOT WORKING.",
        "vin": "1G6KD57Y36U"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/05/2016",
        "dateOfIncident": "11/30/2016",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10930048,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. WHILE APPROACHING A STOP SIGN, AN OIL ODOR WAS COMING FROM THE ENGINE. THE CONTACT  NOTICED THAT GRAY SMOKE WAS COMING FROM THE HOOD OF VEHICLE. THE VEHICLE WAS TAKEN TO A INDEPENDENT MECHANIC WHERE HE WAS INFORMED THE OIL PAN GASKET WAS LEAKING. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 130,450.",
        "vin": "1G6KD57YX6U"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "10/25/2016",
        "dateOfIncident": "09/05/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10918769,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "HEATED AND COOLED SEATS STOPPED WORKING WHILE DRIVING AFTER BURNING SMELL AND SMOKE THAT WAS COMING FROM UNDER PASSENGER SEAT.  *TR",
        "vin": "1G6KD57906U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/01/2016",
        "dateOfIncident": "08/31/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10903080,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING FLUID IS SQUIRTING ALL OVER MY ENGINE COMPARTMENT. THERE IS A RECALL FOR THE MAKE MODEL AND YEAR OF MY VEHICLE, BUT CADILLAC KEEPS TELLING ME THAT IT'S NOT A PROBLEM FOR MY VIN. WHEN I DRIVE THE CAR, POWER STEERING FLUID CONTACTS THE HOT ENGINE PARTS AND BEGINS SMOKING. THEY'VE HAD A RECALL FOR THIS. I DON'T WANT MY CAR TO CATCH FIRE SO I STOPPED DRIVING IT. I SHOULDN'T HAVE TO PAY FOR SOMETHING THAT THEY ALREADY KNOW IS A PROBLEM, HENCE THEIR OWN RECALL. THEY TELL ME I'LL HAVE TO PAY FOR THE REPAIR AND IF IT'S PART OF THE RECALL, I MIGHT GET REIMBURSED.",
        "vin": "1G6KD57Y26U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/05/2016",
        "dateOfIncident": "06/06/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10882661,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. WHILE DRIVING 40 MPH, THE STEERING WHEEL REQUIRED MORE FORCE TO MANEUVER AND SMOKE APPEARED FROM THE HOOD. THE CONTACT PULLED THE VEHICLE OVER TO THE ROAD SIDE AND OBSERVED THAT THE POWER STEERING HOSE WAS LEAKING SEVERELY. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 06V105000(STEERING). THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 141,179.",
        "vin": "1G6KD57Y96U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/24/2016",
        "dateOfIncident": "05/24/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10870683,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT STATED THAT THE KEY FOBIK AND IGNITION KEY FAILED TO OPEN THE DOORS OF THE VEHICLE. AS A RESULT, THE CONTACT WAS UNABLE TO ENTER THE VEHICLE. THE CONTACT MENTIONED THAT THE KEY FOBIK BATTERY WAS REPLACED BUT THE FAILURE CONTINUED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 99,000.",
        "vin": "1G6KD57Y96U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/07/2016",
        "dateOfIncident": "05/02/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10863707,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHTS FLICKERS AND THEN TURNS OFF.  RANDOM LEFT AND RIGHT SIDE, TOOK CAR TO DEALER WHILE STILL UNDER WARRANTY 4 TIMES, THEY SAID THEY COULDN'T FIND ANYTHING WRONG ... BS &#128545; !! I FIRST NOTICED THE PROBLEM AT 28,000 MI  & STILL THE SAME AT 50,000 MI ... WAITING FOR A RECALL  ??  COME GM THIS CAR WAS NOT CHEAP !!!",
        "vin": "1G6KD57Y26U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/06/2016",
        "dateOfIncident": "06/20/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10863559,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "HAD TO REPLACE THE POWER STEERING HOSE (#06V105000) AND WHEN I NOTICED THAT THIS WAS A RECALL ITEM I CALLED CADILLAC FOR REIMBURSEMENT.  I WAS TOLD MY VIN WAS NOT INCLUDED IN THIS RECALL.",
        "vin": "1G6KD57Y86U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/10/2016",
        "dateOfIncident": "12/15/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10854634,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHTS FLICKER AND GO OUT. IF YOU TURN AUTO OFF AND BACK ON, THE HEADLIGHTS COME BACK ON, BUT DO NOT STAY ON. . RIGHT SIDE MORE OFTEN THEN LEFT, BUT BOTH FLICKER AND TURN OFF. THIS CONDITION WAS THERE WHEN THE CAR WAS ONLY A YEAR OLD BUT WASN'T VERY BAD SO DIDN'T GET IT FIXED UNDER WARRANTEE. NOW THE PROBLEM IS A SAFETY HAZARD, BUT CANNOT GET ANY DEALER TO EVEN LOOK AT THE PROBLEM. THERE WAS A BROAD RECALL BY GM COVERING MANY OTHER MODELS AND YEARS, BUT THIS ONE WASN'T LISTED. IF THERE IS EVER A LOSS IN HEADLIGHTS AT NIGHT RESULTING IN AN ACCIDENT, GM MAY FINALLY SHOW SOME INTEREST. THIS USUALLY OCCURS WHEN MOTION HOWEVER NOT 100%. THIS STARTED BACK IN 2007 AND HAS BEEN INTERMITTENT SINCE THEN. THIS HAS BEEN DISCUSSED WITH DEALERS IN WISCONSIN AND FLORIDA TO NO SATISFACTION BECAUSE THE CAR IS NOT ON ANY RECALL LIST FOR THIS PROBLEM.",
        "vin": "1G6KD57Y96U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/06/2016",
        "dateOfIncident": "02/16/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10840169,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "LEFT HEADLIGHT FLICKERS & WILL GO OFF ON IT'S OWN. HAVE REPLACED EXTERIOR LIGHT ASSEMBLY TWICE. ONE USED AND ONE  WITH NEW BUT NOTHING HAS CHANGED. STATIONARY AND IN MOTION.",
        "vin": "1G6KD57Y96U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/15/2016",
        "dateOfIncident": "02/13/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10836236,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH HEADLIGHTS WILL RANDOMLY COME ON AND THEN GO OFF. TURNING THE SWITCH OFF AND BACK ON WII RE ILLUMINATE THE LIGHTS. THIS WILL HAPPEN SEVERAL TIMES, ANDI FEEL THIS TO BE A SERIOUS SAFTEY ISSUE. GENERAL MOTORS HAS YET TO OFFER ANY RECALL ON THIS ISSUE THAT I KNOW OF. THIS HAPPENS USUALLY WHEN DRIVING OR IN MOTION.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/25/2016",
        "dateOfIncident": "12/10/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10822009,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. WHILE PULLING OUT OF THE DRIVEWAY, THE CONTACT NOTICED THAT THE STEERING WAS DIFFICULT TO TURN. UPON FURTHER EXAMINATION, THE CONTACT NOTICED A SLIGHT FLUID LEAK AND THE VEHICLE HAD A SMELL OF BURNING FLUID. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE RACK AND PINION NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 45,000.",
        "vin": "1G6KD57Y96U"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/15/2016",
        "dateOfIncident": "01/15/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10820527,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT STATED THAT THERE WAS AN OIL LEAK COMING FROM THE ENGINE OF THE VEHICLE. THE VEHICLE WAS TAKEN TO BE REPAIRED AND WAS DIAGNOSED THAT THE ENGINE NEEDED TO BE REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE VIN WAS INVALID. THE FAILURE MILEAGE WAS 110,000.",
        "vin": "1G6KD579X6U"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/29/2015",
        "dateOfIncident": "01/25/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10816725,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH BLOCK HALVES AND THE CAM COVERS BEGAN LEAKING AND THEY TELL ME THE REPAIR WILL COST $3,500.00. THE VEHICLE HAS ALWAYS HAD REGULAR OIL CHANGES AND MAINTENANCE AND HAS LOW MILEAGE FOR A 2006. I HAVE HEARD THIS IS A REGULAR PROBLEM WITH THIS YEAR CADILAC.",
        "vin": "1G6KD57916U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/28/2015",
        "dateOfIncident": "03/06/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10816562,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "LEFT HEADLAMP FLICKERS AND GOES OUT INTERMITTENTLY WHILE DRIVING. FIRST NOTICED WHEN PULLING INTO PARKING GARAGE GOING TO WORK IN 2014, BUT WHEN I CHECKED BEFORE LEAVING OFFICE-LIGHTS WERE WORKING. WHILE DRIVING LONG DISTANCE ON FREEWAY IN MAR 2015, PROBLEM BECAME VERY APPARENT. LIGHTS FLICKERED BRIGHT, THEN DIMMED, THEN FLICKERED OUT (JUST LEFT SIDE) REPEATEDLY DURING 3 HOUR DRIVE IN MIDDLE OF THE NIGHT. LIGHTS TURNED BACK ON BY TURNING SWITCH ON/OFF. OF COURSE, CARS IN FRONT OF ME THOUGHT I WAS SIGNALING THEM TO GET OUT OF THE WAY. (ALSO POTENTIALLY DANGEROUS) DEALER COULD FIND NO CAUSE AND RECOMMENDED NEW SWITCH.  REPLACED SWITCH BUT PROBLEM CONTINUES.  TOOK BACK TO DEALER - NOW STATING CAR NEEDS A NEW HEADLAMP ASSEMBLY FOR $1300. OTHER FORUMS INDICATE REPLACING HEADLAMP HAS NOT \"FIXED' THE PROBLEM.  THIS IS A SERIOUS SAFETY ISSUE.",
        "vin": "IG6KD57Y26U"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/16/2015",
        "dateOfIncident": "06/16/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10810710,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. WHILE DRIVING VARIOUS SPEEDS, THE HEADLIGHTS FAILED WITHOUT WARNING. THE FAILURE RECURRED. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VIN WAS UNKNOWN. THE FAILURE MILEAGE WAS APPROXIMATELY 140,000.  UPDATED 03/10/16*LJ",
        "vin": "1G6KD57Y16U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/25/2015",
        "dateOfIncident": "08/25/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10806694,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT STATED THAT THE REAR OF THE ENGINE WAS LEAKING OIL ON THE EXHAUST MANIFOLD AND THERE WAS AN ABNORMAL ODOR. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DIAGNOSED THAT THERE WAS A GASKET LEAK ON THE EXHAUST MANIFOLD. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 87,000.",
        "vin": "1G6KD57926U"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/20/2015",
        "dateOfIncident": "04/15/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10795047,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHTS GO OUT WHEN MOVING ESPECIALLY AT NIGHT, ALSO CAUSES MOTOR TO RUN ROUGH WHEN THIS HAPPENS. VERY DANGEROUS WHEN LIGHTS GO COMPLETELY OUT DOING 70 MPH...BEGINS FLICKERING, AND THEN OUT. HAVE READ 2006 CADILLAC COMPLAINT FORUMS AND THEY ARE NUMEROUS..BOUGHT CAR USED FROM DEALER...PREVIOUS ONE-OWNER",
        "vin": "1G6KD57Y26U"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/29/2015",
        "dateOfIncident": "07/15/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10786938,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT STATED THAT THERE WAS OIL LEAKING FROM THE VEHICLE. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS CONFIRMED THE VEHICLE WAS LEAKING COOLANT AND OIL AND THAT THE INTAKE MANIFOLD, ASSOCIATED GASKETS, SEALS, AND WATER PUMP NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 90,000.  UPDATE 01/13/16 MA    THE CONSUMER STATED THE VEHICLE WAS REPAIRED AND REQUESTED TO BE REIMBURSED. *JS",
        "vin": "1G6KD57Y96U"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/22/2015",
        "dateOfIncident": "06/15/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10785392,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. WHILE DRIVING AT NIGHT, THE HEADLIGHTS BECAME INOPERABLE INTERMITTENTLY WITHOUT WARNING. THE VEHICLE WAS NOT DIAGNOSED REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 52,000.",
        "vin": "1G6KD57YX6U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/11/2015",
        "dateOfIncident": "07/29/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10763063,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. WHILE DRIVING APPROXIMATELY 60 MPH, THE GAUGES FAILED TO OPERATE, ALL OF THE WARNING LIGHTS ON THE INSTRUMENT PANEL ILLUMINATED, AND ALL OF THE DOORS LOCKED AND UNLOCKED INDEPENDENTLY. THE FAILURE RECURRED MULTIPLE TIMES. THE VEHICLE WAS TAKEN TO A DEALER BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 118,000.",
        "vin": "1G6KD57Y46U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/27/2015",
        "dateOfIncident": "08/26/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10759701,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. WHILE DRIVING AT APPROXIMATELY 35 MPH, AN ABNORMALLY LOUD NOISE WAS HEARD FROM THE STEERING WHEEL. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE POWER STEERING INLET HOSE NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE VIN WAS NOT INCLUDED IN THE NHTSA CAMPAIGN NUMBER: 06V105000(STEERING). THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 30,684.",
        "vin": "1G6KD57Y16U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/26/2015",
        "dateOfIncident": "06/20/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10730609,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. WHILE DRIVING 45 MPH, THE ELECTRICAL SYSTEM FAILED AND THE VEHICLE STALLED. THE CONTACT WAS ABLE TO RESTART THE VEHICLE ON THE FIRST ATTEMPT. THE VEHICLE WAS TAKEN TO THE DEALER TO BE DIAGNOSED. THE DEALER WAS UNABLE TO DUPLICATE THE FAILURE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 45,400.",
        "vin": "1G6KD57Y36U"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEATS",
        "crash": false,
        "dateComplaintFiled": "06/22/2015",
        "dateOfIncident": "10/10/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10726529,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AS PART OF STATE INSPECTION, TOLD DEALER THAT FRONT SEATS ARE NOT HEATING. TOLD BY DEALER THAT PROBLEM WAS \"CONNECTOR TO CLIMATE CONTROL SEAT MODULE BURNED/SHORTED OUT MODULE\" AND TO REPLACE CONNECTOR AND MODULE WOULD COST $1016. ASKED DEALER PERSONNEL IF A SAFETY ISSUE AND THEY SAID  IT IS A ROUTINE/RECURRING PROBLEM WITH THESE COMPONENTS MELTING FROM THE HEAT BUT DON'T WORRY IT'S NOT A SAFETY ISSUE (DESPITE REFERENCE TO \" BURNED/SHORTED OUT\"). INTERNET SEARCH SHOWED SIMILAR PROBLEM WITH SAME COMPONENTS IN OTHER CADILLACS BUT ACCOMPANIED  BY/WITH SMOKE AND/OR FIRE-- IF OCCURS WHILE OPERATING VEHICLE AT A HIGH SPEED ON A BUSY STREET OR HIGHWAY, COULD RESULT IN A MAJOR ACCIDENT INVOLVING SERIOUS INJURY OR DEATH. NEEDS TO BE INVESTIGATED.   *TR",
        "vin": "1G6KD57Y46U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/02/2015",
        "dateOfIncident": "05/29/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10722885,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. WHILE STARTING THE VEHICLE, THE KEYS COULD BE REMOVED OUT OF THE IGNITION SWITCH WHILE IN THE ON POSITION. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STATED THAT THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 14V355000 (ELECTRICAL SYSTEM). THE FAILURE MILEAGE WAS 123,000.",
        "vin": "1G6KD57Y56U"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/22/2015",
        "dateOfIncident": "05/20/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10721045,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE NOTICED THAT WHEN IT RAINS AND THE STREETS ARE WET MY STEERING WHEEL LOCKS UP",
        "vin": "1G6KD57Y76U"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/31/2015",
        "dateOfIncident": "03/01/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10702929,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT STATED THAT WHILE ATTEMPTING TO DECELERATE, THERE WAS A SUDDEN INCREASE IN ENGINE RPMS AND THE VEHICLE CONTINUED TO ACCELERATE. THE FAILURE WAS EXPERIENCED NUMEROUS TIMES. THE VEHICLE WAS NOT TAKEN TO THE DEALER FOR DIAGNOSTIC TESTING. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 87,000. ...UPDATED 06/09/15 *BF    UPDATED 10/3/2017*CN",
        "vin": "1G6KD57Y36U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/12/2015",
        "dateOfIncident": "04/16/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10693843,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. WHILE DRIVING VARIOUS SPEEDS WITH THE AUTOMATIC HEADLIGHTS ACTIVATED, THE DRIVER SIDE LOW BEAM HEADLIGHTS UNEXPECTEDLY FAILED TO ILLUMINATE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE APPROXIMATE FAILURE MILEAGE WAS 20,000.",
        "vin": "1G6KD57Y26U"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEATS",
        "crash": false,
        "dateComplaintFiled": "03/06/2015",
        "dateOfIncident": "01/13/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10692598,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "HEATED/COOL SEATS STOP WORKING. *TR",
        "vin": "1G6KD57Y2U1"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/02/2015",
        "dateOfIncident": "02/23/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10691410,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. WHILE DRIVING AT APPROXIMATELY 50 MPH, THE ENGINE STALLED AND THE CHECK ENGINE WARNING INDICATOR ILLUMINATED. THE VEHICLE RESTARTED, BUT THE FAILURE RECURRED TWO TIMES. THE VEHICLE WAS TAKEN TO A DEALER, WHERE IT WAS DIAGNOSED THAT THE CATALYTIC CONVERTER AND THE UPSTREAM OXYGEN SENSORS NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 117,700.",
        "vin": "1G6KD57Y36U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/06/2015",
        "dateOfIncident": "12/23/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10681703,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHTS WILL GO OUT RANDOMLY ON EITHER SIDE.   *JS",
        "vin": "1G6KD57Y26U"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/05/2015",
        "dateOfIncident": "02/02/2015",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10681452,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. WHILE DRIVING APPROXIMATELY 45 MPH, THE VEHICLE DECELERATED WITHOUT WARNING AND CAUGHT FIRE. THERE WERE NO INJURIES AND A POLICE REPORT WAS NOT FILED. THE VEHICLE WAS TAKEN TO A DEALER, BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 100,000.",
        "vin": "1G6KD57Y76U"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/26/2015",
        "dateOfIncident": "09/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10679015,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT STATED THAT THERE WAS OIL LEAKING FROM THE OIL PAN OF THE VEHICLE. THE VEHICLE WAS TAKEN TO A DEALER. THE TECHNICIAN DIAGNOSED THAT THE OIL PAN NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE VEHICLE WAS THEN TAKEN TO AN INDEPENDENT MECHANICS WHO ALSO DIAGNOSED THAT THE OIL PAN NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE RECURRED ON NUMEROUS OCCASIONS. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 52,000.",
        "vin": "1G6KD57Y96U"
    },
    {
        "components": "POWER TRAIN,WHEELS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/20/2015",
        "dateOfIncident": "01/08/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10676557,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING A FAMILY OUTING, I NOTICED A REAR TIRE THAT HAD LOST AIR PRESSURE AGAIN.  I HAD NO CHOICE BUT TO VISIT A DISCOUNT TIRE, TO DIAGNOSE THE PROBLEM.  WE HADN'T RUN OVER A NAIL NOR A SCREW, BUT  HAD BECOME THE VICTIMS OF CADILLAC'S INFERIOR PRODUCTION.  THE CHROME PLATING BEGAN TO PEEL, AND SEPARATE FROM THE ALLOY WHEELS. I WAS FORCED TO PURCHASE INFERIOR AFTERMARKET WHEELS IN ORDER TO GET MY FAMILY HOME. THE INFORMATIVE, AND INTEGRATIVE AGENT AT DISCOUNT TIRE SHOWED ME THAT ALL FOUR OF MY STOCK, CHROME, CADILLAC WHEELS HAD PREMATURELY CORRODED, FORCING MY WIFE AND I TO REPLACE THE WHEELS. WE HAVE BEEN SPUN,  DISMISSED,  AND IGNORED BY NUMEROUS CADILLAC CUSTOMER EXPERIENCE AGENTS, REGARDING THIS ISSUE, IN SPITE OF NUMEROUS COMPLAINTS LOGGED BY OTHER DTS OWNERS, POSTED ONTO GMINSIDER.COM. CADILLAC HAS BEEN WELL ADVISED OF THIS FAILURE, YET CADILLAC FAILS TO ACCEPT THAT THEIR PRODUCT IS SUBSTANDARD. MY LOCAL DEALERSHIP, COUGHLIN MOTORS OF MARYSVILLE, OHIO, IS RETICENT TO RESOLVE THIS ISSUE, BUT, MY QUESTION IS, DOESN'T THE PRESIDENT OF OUR GREAT NATION, RIDE IN A DTS? IF I'M NOT MISTAKEN,  WHAT ARE THE CONDITIONS OF HIS WHEELS? WELL, OUR VEHICLE HAD THE SAME WHEELS. IT IS MY PROFESSIONAL OPINION,  CADILLAC HAS PRODUCED AN INFERIOR PRODUCT, AND THEY SHOULD BE HELD ACCOUNTABLE FOR IT. AFTER ALL, THE PRESIDENT OF THE UNITED STATES, AND HIS FAMILY, SHOULD BE WELCOMED TO THE SAME DURABILITY AND LONGEVITY, OF CADILLAC'S PRODUCT, MY FAMILY AND I, ARE ENTITLED TO? AFTER ALL, DIDN'T ALL OF US BAIL OUT GENERAL MOTORS IN ADVERSE CONDITIONS?   IN SHORT, CADILLAC HAS PRODUCED YET ANOTHER INFERIOR PRODUCT. ISN'T IT TIME THAT GM ANSWERS FOR ANOTHER INFERIOR PRODUCT, THAT AFFECTS OUR SAFETY? GRANTED, THE POTUS HAS ANOTHER DTS LIMO AT HIS DISPOSAL; AND I'M GRATEFUL FOR THAT. SADLY, MY FAMILY OF FIVE, DOES NOT. *TR",
        "vin": "1G6KD57Y86U"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/15/2015",
        "dateOfIncident": "08/05/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10672803,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 60 MPH, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS RESTARTED AND RESUME NORMALLY OPERATION. THE FAILURE RECURRED TWICE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 31,000.",
        "vin": "1G6KD57Y26U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/05/2015",
        "dateOfIncident": "01/05/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10670280,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "HEATED AND COOLED FRONT SEATS STOPPED WORKING. NOTICED BURNT WIRE INSULATION SMELL.  *TR",
        "vin": "1G6KD57Y56U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/30/2014",
        "dateOfIncident": "11/15/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10669078,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT STATED THAT THE DRIVER SIDE HEADLIGHT INTERMITTENTLY ACTIVATED. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE DRIVER SIDE BALLAST NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 40,000.",
        "vin": "1G6KD57YX6U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/16/2014",
        "dateOfIncident": "11/06/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10664499,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE POWER STEERING QUIT WORKING WHILE I WAS DRIVING...THEN A FEW SECONDS LATER, THE CAR SHUT OFF WHILE I WAS STILL DRIVING. I WAS ONLY GOING ABOUT 35 MPH AND I WAS ABLE TO TURN ONTO A SIDE STREET, THOUGH IT WAS VERY DIFFICULT TO TURN THE CAR BECAUSE THE POWER STEERING HAD QUIT WORKING.  I WAS LATER INFORMED BY A MECHANIC AT AAA THAT A BRACKET THAT CONNECTS THE ENGINE TO THE CAR'S FRAME HAD COME LOOSE AND THE ENGINE WAS VIBRATING, WHICH CAUSED THE ELECTRICAL WIRING FOR THE POWER STEERING TO BECOME WORN, WHICH CAUSED IT TO SHORT OUT.  I WAS LUCKY I WAS ONLY GOING 35 MPH.  IF I HAD BEEN ON THE HIGHWAY ON A CURVE WHEN THIS HAPPENED, IT IS VERY POSSIBLE THAT I WOULD HAVE CRASHED.  *TR",
        "vin": "1G6KD57YX6U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/09/2014",
        "dateOfIncident": "12/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10658461,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 CADILLAC DTS.  IGNITION SWITCH RECALL. TWO IGNITION KEYS MODIFIED.  *MW  THE CONSUMER WOULD LIKE TWO REPLACEMENT KEYS FOR HIS AUTOMOBILE OR SEND MODIFICATION PARTS. *JB",
        "vin": "1G6KD57Y46U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/08/2014",
        "dateOfIncident": "09/13/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10662907,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT STATED THAT THE HEADLIGHTS WOULD SPORADICALLY GO OUT. THE CONTACT STATED THAT IN ORDER FOR THE LIGHTS TO WORK, THE HEADLIGHT HAD TO BE SWITCH ON & OFF CONTINUOUSLY. THE DEALER WAS MADE AWARE OF THE FAILURE. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 42,000.",
        "vin": "1G6KD57Y56U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/04/2014",
        "dateOfIncident": "12/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10654375,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 CADILLAC DTS. CONSUMER STATES THE IGNITION KEY SLIPS OUT OF IGNITION. *SS.  THE CONSUMER STATED THE RECALL LETTER WAS MISLEADING, ABOUT THE PARTS NOT BEING AVAILABLE.  GM'S INTENT WAS TO PUT A SMALL HOLE INTO THE IGNITION KEY OPENING. *JB",
        "vin": "1G6KD57Y76U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/02/2014",
        "dateOfIncident": "06/02/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10661633,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "LOW BEAM HEADLIGHTS FLICKER AND/OR GO OUT WHILE DRIVING.  *JS",
        "vin": "1G6KD57Y96U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/25/2014",
        "dateOfIncident": "11/25/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10660864,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR THE ELECTRICAL SYSTEM, BUT THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE NHTSA CAMPAIGN NUMBER WAS UNKNOWN.",
        "vin": "1G6KD57Y76U"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/25/2014",
        "dateOfIncident": "11/13/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10660870,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. WHILE DRIVING VARIOUS SPEEDS, BOTH HEADLIGHTS AND TAIL LIGHTS FLASHED AND LOST POWER. THE FAILURE RECURRED ON NUMEROUS OCCASION. THE VEHICLE WAS NEVER DIAGNOSED OR REPAIRED. THE FAILURE MILEAGE WAS UNKNOWN.  UPDATED 02/02/15*LJ",
        "vin": "1G6KD57Y76U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/17/2014",
        "dateOfIncident": "11/10/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10658669,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. WHILE DRIVING APPROXIMATELY 20 MPH, THE VEHICLE HIT A BUMP AND THE FRONT HEADLIGHTS BECAME INOPERABLE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 30,000. UPDATED 01/07/14*LJ     UPDATED 9/6/2017*CN",
        "vin": "1G6KD57Y36U"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/15/2014",
        "dateOfIncident": "11/14/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10655184,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "GM RECALL 14299 SHOULD CORRECT THE PROBLEM OF IGNITION SHUTTING OFF WHILE DRIVING. THE KEY MOVES OUT OF THE 'RUN' POSITION DISABLING THE BRAKES AND STEERING,. THE FIX WAS PUTTING A PIECE OF PLASTIC IN MY KEY.  THIS DOES NOT FIX THE PROBLEM.  I EXPECT THE IGNITION SWITCH TO BE REPLACED.  I DID NOT PAY $50,000 FOR A CHEAP 'FIX'.  *TR",
        "vin": "1G6KD57Y76U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/12/2014",
        "dateOfIncident": "11/11/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10654511,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT STATED THAT THE KEY BECAME LODGED IN THE IGNITION SWITCH AND THE ANTI THEFT WARNING INDICATOR ILLUMINATED INTERMITTENTLY. THE VEHICLE WAS TAKEN TO THE DEALER. THE TECHNICIAN WAS UNABLE TO DIAGNOSE THE FAILURE.  THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 30,000.",
        "vin": "1G6KD57936U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/06/2014",
        "dateOfIncident": "10/02/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10653102,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER:14V355000 (ELECTRICAL SYSTEM); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "1G6KD57Y26U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/27/2014",
        "dateOfIncident": "10/24/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10650295,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. WHILE DRIVING VARIOUS SPEEDS, THE POWER STEERING FAILED AND UNKNOWN FLUIDS LEAKED ONTO THE ENGINE. THE CONTACT REFERENCED NHTSA CAMPAIGN NUMBER: 06V105000 (STEERING) AND STATED THAT THE FAILURE MIGHT BE RELATED TO THE RECALL. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 38,000.",
        "vin": "1G6KD57Y06U"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/26/2014",
        "dateOfIncident": "09/10/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10650023,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FUEL PUMP MALFUNCTIONED AND HAD TO BE REPLACED. THIS WAS THE FIRST FUEL PUMP THAT I'VE EVER REPLACED ON ANY AUTOMOBILE.  *TR",
        "vin": "IG6KD57YX6U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/26/2014",
        "dateOfIncident": "09/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10650022,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LED REAR TAIL LIGHT ON THE PASSENGER SIDE WAS DEFECTIVE. THE LIGHT KEPT BLOWING FUSES. I WAS NOT AWARE OF THE PROBLEM. I ARRIVED HOME FROM WORK LATE AFTER DARK AND NOTICED THE TAIL LIGHT WAS NOT WORKING. I THINK IT HAD NOT BEEN WORKING FOR MONTHS AND I DIDN'T NOTICE BECAUSE IT WAS SUMMER.  THE PROBLEM WAS ORIGINALLY DIAGNOSED AS A BLOWN FUSE BUT AFTER THE FUSE BLEW THREE TIMES, THE PROBLEM WAS DIAGNOSED AS A BAD LED LIGHT WHICH CAUSED THE FUSES TO BLOW. THE TOTAL COST TO DIAGNOSE AND REPLACE THE LIGHT WAS ABOUT $900.    THIS WAS THE SECOND LED LIGHT THAT I HAD TO REPLACE.  I REPLACED A LED BRAKE LIGHT LAST YEAR AT AT COST OF ABOUT $500. THIS BRAKE LIGHT WAS THE LARGE HORIZONTAL LIGHT THAT GOES ACROSS THE REAR OF THE TRUNK. *TR",
        "vin": "1G6KD57YX6U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/23/2014",
        "dateOfIncident": "07/22/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10649440,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING HOSE LEAKING CAUSING THE WHEEL TO LOCK UP. HAVE CALLED GM ABOUT THIS AND THEY SAID IT WASN'T A RECALL... TOOK IT TO EASTON CADILLAC SERVICES AND THE GAVE ME THE SHEET THAT SHOWED IT WAS BETWEEN THE VIN# THAT WAS AFFECTED IN THE POWER STEERING HOSE RECALL. 6U146663-6U550288... MY VIN#6U187900... IT HAS THE SAME PROBLEMS THAT WAS INDICATED ON THE RECALL AND GM IS UNWILLING TO RIGHT THEIR WRONG.  *TR",
        "vin": "1G6KD57Y06U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/21/2014",
        "dateOfIncident": "10/21/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10649050,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TODAY I HAD THE GM RECALL 14299 PERFORMED ON MY CADILLAC DTS AT MY LOCAL CADILLAC DEALERSHIP. THE REPAIR TOOK ABOUT 1 HOUR AND THE CAR WAS RETURNED TO ME WITH THE INSTRUCTIONS FROM THE DEALERSHIP THAT ONE KEY HAD A \"CLAMP\" ON IT AND IF I REMOVED THE \"CLAMP\" AND THE NEW KEY INSERT DID NOT STAY IN PLACE THAT THEY WOULD NEED TO \"FIGURE SOMETHING OUT\". I WAITED AN HOUR FOR THE GLUE TO DRY AND ATTEMPTED TO REMOVE THE \"CLAMP\" AND THE INSERT WAS ADHERED TO THE CLAMP AS IT APPEARED RESIDUAL GLUE HAD STUCK TO THE FACE OF THE INSERT AND THE UNDERNEATH SLIDE OF THE CLAMP. I THEN WENT TO PUT A KEY CHAIN ON MY GM VALET KEY AND THE INSERT POPPED OUT OF PLACE ON THAT KEY AS WELL. I HAVE NOT YET CONTACTED THE GM DEALERSHIP, BUT THIS RECALL REPAIR IS VERY TROUBLING AS IT DOES NOT APPEAR THAT THIS REPAIR WILL HAVE THE LONGEVITY NEEDED TO STAY IN PLACE AND PROTECT THE CONSUMER. I HAVE PHOTOS OF THE KEYS IF NEEDED.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/20/2014",
        "dateOfIncident": "10/20/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10648742,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATE 20 MPH, THE INSTRUMENT PANEL ILLUMINATED AS THE VEHICLE STALLED. THE VEHICLE WAS TOWED TO THE DEALER. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 160,000.",
        "vin": "1G6KD57Y56U"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/16/2014",
        "dateOfIncident": "09/17/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10645055,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT STATED THAT WHILE DRIVING AT APPROXIMATELY 45 MPH, ANOTHER VEHICLE CRASHED INTO THE REAR OF THE VEHICLE. ON ANOTHER OCCASION, THE CONTACT LOST CONTROL OF THE VEHICLE AND ROLLED OVER. AS A RESULT, THE CONTACT CRASHED INTO A DITCH AND THE WAS ABLE TO EXIT THE VEHICLE ONLY THROUGH THE FRONT DRIVER'S SIDE WINDOW. THE AIR BAGS FAILED TO DEPLOY AND THE VEHICLE FAILED TO RESTART. A POLICE REPORT WAS FILED. THE DRIVER SUSTAINED INJURIES TO THE ARM THAT REQUIRED MEDICAL ATTENTION. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN ID NUMBER: 14V355000 (ELECTRICAL) AFTER THE CRASH. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 100,000.",
        "vin": "1G6KD57Y96U"
    },
    {
        "components": "STEERING,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/15/2014",
        "dateOfIncident": "08/17/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10644939,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT STATED WHILE DRIVING APPROXIMATELY 25 MPH, THE VEHICLE VEERED TO THE RIGHT WITHOUT WARNING AND CRASHED INTO ANOTHER VEHICLE. THE AIR BAGS FAILED TO DEPLOY. THE CONTACT SUSTAINED A SHOULDER INJURY THAT REQUIRED MEDICAL ATTENTION. A POLICE REPORT WAS FILED. THE VEHICLE WAS DESTROYED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 24,995.",
        "vin": "1G6KD57Y66U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/08/2014",
        "dateOfIncident": "10/05/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10643286,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. WHEN THE KEY WAS REMOVED FROM THE IGNITION SWITCH, THE KEY FOB WAS DAMAGED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 77,105.",
        "vin": "1G6KD57Y66U"
    },
    {
        "components": "EQUIPMENT,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/07/2014",
        "dateOfIncident": "09/25/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10641959,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. WHILE DRIVING VARIOUS SPEEDS, THE INSTRUMENT PANEL AND THE GLOBAL POSITIONING SYSTEM FAILED NUMEROUS TIMES. THE DEALER WAS UNABLE TO DIAGNOSE THE CAUSE OF THE FAILURE. THE MANUFACTURER WAS NOTIFIED. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "1G6KD57986U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/07/2014",
        "dateOfIncident": "04/16/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10643095,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, THE HEAD LAMPS POWERED OFF INTERMITTENTLY. THE PROBLEM OCCURRED NUMEROUS TIMES. THE DEALER WAS CONTACTED AND THE TECHNICIAN ADVISED THAT THE HEAD LAMPS SHOULD BE REPLACED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 20,000.",
        "vin": "1G6KD57Y86U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/07/2014",
        "dateOfIncident": "10/06/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10643167,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT RECEIVED A NOTIFICATION FOR RECALL NHTSA CAMPAIGN NUMBER: 14V355000 (ELECTRICAL SYSTEM). HOWEVER, THE PART NEEDED TO DO THE RECALL WAS UNAVAILABLE. THE CONTACT STATED THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE...UPDATED 11/13/14 *BF  THE CONSUMER STATED THE PROBLEM WAS RESOLVED. UPDATED 12/02/14*JB",
        "vin": "1G6KD57Y16U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/02/2014",
        "dateOfIncident": "10/02/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10640757,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 14V355000 (ELECTRICAL SYSTEM). THE CONTACT STATED THAT THE NOTIFICATION STATED THAT THE RECALL PART WAS AVAILABLE, BUT THE DEALER STATED THAT THE PART WAS UNAVAILABLE. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.   UPDATED 11/20/14*CN        THE CONSUMER STATED THE VEHICLE WAS REPAIRED UNDER THE RECALL. UPDATED 5/5/2015  *JS",
        "vin": "1G6KD57Y16U"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/02/2014",
        "dateOfIncident": "09/08/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10640893,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHY IS THE AUBURN, AL CADILLAC DEALERSHIP (LYNCH) NOT RECEIVING REPLACEMENT PARTS FOR THE GM RECALL 1499.  I HAVE INQUIRED ABOUT HAVING MY CAR SERVICED FOR THIS RECALL. THEY STATED THAT \"THEY ONLY RECEIVE A FEW REPAIR KITS AT A TIME\" AND AT THE TIME OF  MY INQUIRY \"THEY DID NOT HAVE ANY MORE KITS.\"   *TR",
        "vin": "1G6KD57Y96U"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/01/2014",
        "dateOfIncident": "01/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10640642,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 60 MPH, THE STEERING WHEEL SEIZED WITHOUT NOTICED. THE CONTACT HAD TO RESTART THE VEHICLE IN ORDER FOR IT TO RESUME NORMAL FUNCTION. ALSO, THE CONTACT STATED THAT THE KEY FAILED TO RELEASE FROM THE IGNITION. THE CONTACT HAD TO MAKE SEVERAL ATTEMPTS AND WAIT OVER THIRTY MINUTES FOR THE KEY TO RELEASE. IN ADDITION, THE KEY WOULD BECOME HOT. THE DEALER CONDUCTED REPAIRS THAT WERE UNKNOWN. HOWEVER, THE FAILURE PERSISTED. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE VEHICLE WAS INCLUDED IN RECALL NHTSA CAMPAIGN NUMBER: 14V355000 (ELECTRICAL SYSTEM). THE APPROXIMATE FAILURE MILEAGE WAS 154,000.",
        "vin": "1G6KD57Y86U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/29/2014",
        "dateOfIncident": "09/29/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10639885,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 14V355000 (ELECTRICAL SYSTEM); HOWEVER, THE PARTS WERE UNAVAILABLE TO REMEDY THE RECALL. THE DEALER WAS UNCERTAIN WHEN THE PARTS WOULD BECOME AVAILABLE TO REPAIR THE VEHICLE. THE MANUFACTURER WAS NOTIFIED AND STATED THAT THE PARTS SHOULD BECOME AVAILABLE ON OR AFTER OCTOBER 1ST. THE DEALER WAS NOTIFIED, BUT THEY CONTINUOUSLY SATED THAT THEY WERE NOT SCHEDULING APPOINTMENTS BECAUSE THE PARTS WERE UNAVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "1G6KD57Y06U"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/22/2014",
        "dateOfIncident": "07/15/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10638122,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS 2006 CADILLAC DTS. THE CONTACT STATED WHILE DRIVING APPROXIMATELY 10 MPH, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 83,000.",
        "vin": "1G6KD57Y06U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/16/2014",
        "dateOfIncident": "09/09/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10633532,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT STATED THAT THE VEHICLE FAILED TO START AND THE KEY REMAINED STUCK IN THE IGNITION. THE VEHICLE WAS JUMPSTARTED AND THEN THE KEY WAS RELEASED FROM THE IGNITION. THE FAILURE OCCURRED ON SEVERAL OCCASIONS. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE CONTACT RECEIVED A RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 14V355000 (ELECTRICAL SYSTEM); HOWEVER, THE PART NEEDED TO REPAIR THE VEHICLE WAS UNAVAILABLE. THE CONTACT WAS INFORMED TO WAIT FOR THE SECOND NOTICE. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 39,000.",
        "vin": "1G6KD57936U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/16/2014",
        "dateOfIncident": "07/16/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10633737,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING PRESSURE HOSE.  *TR",
        "vin": "1G6KD57Y06U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/16/2014",
        "dateOfIncident": "08/06/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10633740,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT STATED THAT THE STEERING WHEEL WAS DIFFICULT TO TURN. ADDITIONALLY, THE CONTACT SMELLED AN ABNORMAL ODOR AND DISCOVERED THAT THE POWER STEERING FLUID WAS LEAKING. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STATED THAT THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 06V105000 (STEERING). THE FAILURE MILEAGE WAS 94,000.",
        "vin": "1G6KD57Y06U"
    },
    {
        "components": "STEERING,EXTERIOR LIGHTING,AIR BAGS,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "09/02/2014",
        "dateOfIncident": "08/24/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10630087,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. WHILE DRIVING APPROXIMATELY 45 MPH, ALL OF THE EXTERIOR LIGHTING FAILED AND THE STEERING WHEEL SEIZED. THE CONTACT ALSO STATED THAT THE VEHICLE FAILED TO RESPOND WHEN THE BRAKE PEDAL WAS DEPRESSED. AS A RESULT, THE CONTACT CRASHED THE PASSENGER SIDE OF THE VEHICLE INTO A TREE. THE AIR BAGS FAILED TO DEPLOY. THE CONTACT AND THE PASSENGER SUSTAINED NECK AND SHOULDER INJURIES, BUT MEDICAL ATTENTION WAS NOT RECEIVED. THE VEHICLE WAS TOWED TO THE CONTACT'S RESIDENCE AND WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER STATED THAT THE VIN WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 14V355000 (ELECTRICAL SYSTEM). THE APPROXIMATE FAILURE MILEAGE WAS 89,000.",
        "vin": "1G6KD57Y36U"
    },
    {
        "components": "ELECTRICAL SYSTEM,TIRES",
        "crash": false,
        "dateComplaintFiled": "08/22/2014",
        "dateOfIncident": "08/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10627544,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TIRE MONITORING SYSTEM STAYS ON EVEN WHEN TIRES ARE PROPERLY INFLATED.  *TR",
        "vin": "1G6KD57Y86U"
    },
    {
        "components": "STEERING,AIR BAGS,TIRES",
        "crash": true,
        "dateComplaintFiled": "08/21/2014",
        "dateOfIncident": "08/18/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10626992,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. WHILE DRIVING APPROXIMATELY 50 MPH, THE FRONT PASSENGER SIDE TIRE BLEW OUT AND THE VEHICLE STALLED. THE CONTACT STATED THAT THE STEERING WHEEL SEIZED, CAUSING THE VEHICLE TO SPIN AND CRASH INTO A FENCE. THE AIR BAGS FAILED TO DEPLOY.  A POLICE REPORT WAS FILED AND THERE WERE NO INJURIES REPORTED.  THE VEHICLE WAS TAKEN TO A DEALER, BUT THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE VEHICLE WAS NOT REPAIRED. THE CONTACT STATED THAT THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 14V355000 (ELECTRICAL SYSTEM). THE MANUFACTURER WAS NOT NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 90,000.",
        "vin": "1G6KD57YX6U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/20/2014",
        "dateOfIncident": "06/23/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10626558,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 14V355000 (ELECTRICAL SYSTEM ); HOWEVER, THE PART NEEDED FOR THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE DELAY. THE CONTACT HAD NOT EXPERIENCED A FAILURE.  UPDATED 10/03/14*LJ       UPDATED 3/10/2015 *JS",
        "vin": "1G6KD57Y66U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/19/2014",
        "dateOfIncident": "08/17/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10626274,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT RECEIVED A NOTIFICATION FOR RECALL NHTSA CAMPAIGN NUMBER: 14V355000 (ELECTRICAL SYSTEM). HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "1G6KD57Y96U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/19/2014",
        "dateOfIncident": "08/15/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10626311,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 14V355000 (ELECTRICAL SYSTEM); HOWEVER, THE PART NEEDED TO REMEDY THE RECALL WAS UNAVAILABLE. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "1G6KD57Y36U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/19/2014",
        "dateOfIncident": "10/09/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10626383,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. WHILE DRIVING APPROXIMATELY 45 MPH, THE INSTRUMENT PANEL INDICATORS FAILED TO ILLUMINATE. THE FAILURE OCCURRED MULTIPLE TIMES. THE DEALER WAS UNABLE TO DETERMINE THE CAUSE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED AND THE MANUFACTURER WAS NOT NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 34,000.",
        "vin": "1G6KD57Y36U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/06/2014",
        "dateOfIncident": "06/26/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10619403,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT STATED THAT THE HEADLIGHTS FLICKERED SPORADICALLY AND BECAME DIM. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE HEAD LAMPS BULBS NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 22,000.",
        "vin": "1G6KD57YX6U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/18/2014",
        "dateOfIncident": "01/01/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10614613,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT STATED THAT THE HEADLIGHTS FLICKERED SPORADICALLY AND HAD BECOME DIMMER THAN NORMAL. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE HEAD LAMPS BULBS AND THE DRIVER SIDE HEADLIGHT DEFLECTOR NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE AND CURRENT MILEAGE WAS 24,093.",
        "vin": "1G6KD57YX6U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/11/2014",
        "dateOfIncident": "07/07/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10609834,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT STATED THAT THE POWER STEERING FAILED AND THE STEERING WHEEL SEIZED. THE CONTACT ALSO MENTIONED THAT THE STEERING WHEEL WAS VIBRATING AND WAS MAKING A LOAD ABNORMAL NOISE. THE CONTACT NOTICED THAT THERE WAS POWER STEERING FLUID LEAKING. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE POWER STEERING HOSE NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND STATED THAT THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN ID NUMBER: 06V105000 (STEERING). THE APPROXIMATE FAILURE MILEAGE WAS 115,000.",
        "vin": "1G6KD57996U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/17/2014",
        "dateOfIncident": "04/23/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10598890,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT STATED THAT THE VEHICLE FAILED TO START UPON TURNING THE KEY IN THE IGNITION. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER. THE TECHNICIAN DIAGNOSED THAT THE IGNITION SWITCH AND THE IGNITION MODULE WERE DEFECTIVE AND NEEDED TO BE REPLACED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 87,341.",
        "vin": "1G6KD57Y26U"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/13/2014",
        "dateOfIncident": "06/01/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10598007,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTED WITH A FEW DROPS OF OIL FROM UNDER ENGINE, KEEPS GETTING WORSE. DRIPPING OIL GETTING ON EXHAUST OR OTHER HOT FIXTURE AND BURNING SMELL COMES INTO PASSENGER COMPARTMENT UNLESS AIR REICIRC IS TURNED ON.I TOOK IT TO THE DEALER AND THE DIAGNOSIS WAS A LEAKING GASKET BEHIND THE OIL FILTER HOUSING .I REPLACED THAT GASKET AND OIL STILL LEAKING FROM THE OIL PAN ENGINE HOUSING .HAVE BEEN TOLD THE GASKET AT THE PAN IS BAD AND TO FIX THE MOTOR WILL NEED TO BE REMOVED @ APX. $3,000.  CADILLAC DEALER AND GM KNEW ABOUT THIS PROBLEM  IN 06. BUT NO RECALL .  I'VE SPOKE TO A COUPLE OF OTHER DTS OWNERS AND THEY HAVE THE SAME PROBLEM AND FROM THE REPORTS HERE AND ON OTHER SITES I CANNOT BELIEVE THIS HASN'T BEEN MADE A RECALL.   JUST TYPE IN CADILLAC DTS OIL LEAKS ON THE INTERNET AND YOU WILL SEE THE PROBLEMS WITH THESE CARS.     *JS",
        "vin": "1G6KD57Y56U"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEATS",
        "crash": false,
        "dateComplaintFiled": "06/13/2014",
        "dateOfIncident": "05/01/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10598150,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "SHORTLY AFTER PURCHASING MY DTS I BEGAN TO NOTICE A MELTING PLASTIC/SMOKE SMELL WHENEVER I WOULD TURN ON THE DRIVER'S SIDE HEATED/VENTILATED SEAT HEATER. I TOOK THE CAR TO THE DEALERSHIP AND WAS ADVISED THIS IS A COMMON WIRING PROBLEM ON THE BUICK AND CADILLAC MODELS AND THAT I SHOULD STOP USING THE HEATED SEAT FUNCTION BECAUSE THE WIRING IS UNDERSIZED AND CAN MELT AND BURN. THE DEALERSHIP TOLD ME THE NEW PART HAS BEEN REVISED TO INCLUDE LARGER WIRING BUT THE PART HAS NOT BEEN RECALLED AT THIS TIME SO THERE WAS NOTHING THEY COULD DO FOR ME.   *JS",
        "vin": "1G6KD579X6U"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEATS",
        "crash": false,
        "dateComplaintFiled": "06/09/2014",
        "dateOfIncident": "06/06/2014",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10597263,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "HIGH AMPERAGE CONNECTORS CONTROLLING DRIVER AND PASSENGER HEATED AND COOLED SEATS SHORTED AT MODULE UNDER PASSENGER SEAT INSIDE PASSENGER COMPARTMENT. CAR FILLED WITH SMOKE AND I HAD TO SEARCH AND PULL  THE FUSE UNDER THE REAR SEAT CUSHION FOR THE WIRE THAT SHORTED UNDER FRONT PASSENGER SEAT.  TROLLING FORUMS YIELDED VERY QUICK RESULTS WITH MANY THAT HAD SAME ISSUE. THE MODULE AND ASSOCIATED WIRING SHOULD BE RECALLED BY GM (NOT TO MENTION THE STEALERSHIP CHARGES WELL OVER 1,200 FOR THE PART ALONE).  *TR",
        "vin": "1G6KD57Y86U"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/29/2014",
        "dateOfIncident": "11/23/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10594988,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY CAR THE RIGHT HEADLIGHT WILL GO OFF. YOU CAN TURN THE SWITCH TO THE OFF POSITION AND THEN ON AGAIN AND THE LIGHTS WILL COME BACK ON. AFTER THAT SOMETIMES BOTH HEADLIGHTS WILL GO AND THAT'S A VERY SCARY. THING WHEN YOU HAVE THE FAMILY THAT YOU LOVE AND CARE FOR IN THERE WITH YOU...I  HAVE TAKEN THE CAR TO THE DEALERSHIP AND BEEN TOLD THE BALANCE CONTROLS ARE OVER HEATING, BUT IN WINTER I CAN START THE CAR IN THE DRIVE WAY AND THE LIGHTS WILL FLICKER AND GO OUT BOTH OF THEM.....CAN GM STAND BEHIND THERE PRODUCT SO WE CAN KEEP OUR HARD EARNED DOLLARS IN AMERICA......  *TR",
        "vin": "1G6KD57Y66U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/22/2014",
        "dateOfIncident": "06/20/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10593398,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT STATED THE HEADLIGHTS WERE ACTIVATED AND WOULD UNEXPECTEDLY FAIL TO ILLUMINATE AS A RESULT THE CONTACT WAS UNABLE TO VIEW THE ROAD. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER, WHO WAS UNABLE TO DUPLICATE THE FAILURE. THE VEHICLE HAD NOT BEEN REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 80,000. DR",
        "vin": "1G6KD57Y66U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/22/2014",
        "dateOfIncident": "07/14/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10593407,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE TRAVELING AFTER DARK WHEN THE HEADLIGHTS FLICKERED A COUPLE OF TIMES BEFORE GOING COMPLETELY OUT. THIS HAS HAPPENED SEVERAL TIMES. SOMETIMES THEY FLICKER, ONE HEADLIGHT GOES OUT, OR BOTH GO OUT MOMENTARILY. ONE TIME IT HAPPENED WHEN WE WERE THE ONLY CAR ON A DARK HIGHWAY AND WE WERE NOT ABLE TO SEE THE HIGHWAY OR THE SHOULDER. WE HAD TO OPEN THE FRONT PASSENGER DOOR AND LOOK FOR THE SHOULDER. WE DON'T DRIVE THIS CAR AFTER DARK. I DON'T UNDERSTAND WHY THIS ISSUE HAS NOT BEEN RECALLED. THE DEALER SAID THAT THE FAILURE HAS TO HAPPEN WHILE THEY ARE EXAMINING THE CAR.  *TR",
        "vin": "1G6KD57Y66U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/19/2014",
        "dateOfIncident": "05/18/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10592367,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2006 CADILLAC DTS.  THE CONTACT STATED THAT THE HEADLIGHTS WOULD BECOME ABNORMALLY DIM WITHOUT WARNING.  THE VEHICLE WAS NOT TAKEN TO THE DEALER AND THE MANUFACTURER WAS NOT NOTIFIED.  THE VEHICLE WAS NOT REPAIRED.  THE FAILURE MILEAGE WAS 59,000.     UPDATED 8/11/14*CN",
        "vin": "1G6KD57Y66U"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "04/29/2014",
        "dateOfIncident": "04/29/2014",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10585502,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "IN REGARDS TO:    HEATED / COOLED SEAT INOPERATIVE -    KEYWORDS CLIMATE CONTROL COOL COOLED DRIVER FRONT HEAT HEATED INOPERATIVE INTERMITTENT LEFT     MODULE PASSENGER RIGHT - (MAR 18, 2008)   SUBJECT:HEATED/ COOLED SEAT INOPERATIVE      MODELS:2006- 2008 BUICK LUCERNE W/ RPO KB6        2006- 2008 CADILLAC DTS W/ RPO KB6    I HAD MY HEATED/COOLED SEAT MODULE REPLACED IN AUGUST 2013. THROUGH THE WINTER MY HEATED SEATS WORKED FINE. TODAY I TURN ON MY SEAT HEATERS ONLY TO HEAR A CLICKING NOISE COMING FROM UNDER THE PASSENGER SEAT FOLLOWED BY PUFFS OF WHITE SMOKE. I QUICKLY TURNED THE CAR OFF AND DISCONNECTED THE BATTERY. UPON VISUAL INSPECTION OF THE AREA WHERE THE SMOKE CAME FROM. I FOUND THE MODULE MELTED TO THE CONNECTOR SO MUCH SO I HAD TO REMOVE THE RELAY FOR THE SEAT MODULE. THIS FIRE COULD HAVE GROWN DANGEROUS VERY QUICKLY. I KNOW A NUMBER OF FELLOW CADILLAC/BUICK OWNERS THAT THIS HAS HAPPENED TO. IF GM DOES NOT RESOLVE THIS ISSUE WITH A RECALL THERE WILL LIKELY BE LEGAL ACTION TAKEN.   *JS",
        "vin": "1G6KD57Y26U"
    },
    {
        "components": "EXTERIOR LIGHTING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/11/2014",
        "dateOfIncident": "04/01/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10579276,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT STATED THAT WHILE DRIVING VARIOUS SPEEDS, THE HEADLIGHTS INTERMITTENTLY FAILED. THE CONTACT ALSO INDICATED THAT THE VEHICLE STALLED OCCASIONALLY. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO WAS UNABLE TO DIAGNOSE THE FAILURE. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 80,000.",
        "vin": "1G6KD57Y86U"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/09/2014",
        "dateOfIncident": "01/01/2014",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10578580,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT STATED THAT ENGINE OIL LEAKED INTO THE EXHAUST SYSTEM AND CAUSED THE EXHAUST TO SMOKE. THE DEALER ADVISED THE CONTACT THAT THE OIL PAN COVER AND GASKET NEEDED TO BE REPLACED THE MANUFACTURER DENIED ASSISTANCE WITH THE REPAIR. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 85,605 AND THE CURRENT MILEAGE WAS 87,100.",
        "vin": "1G6KD57YX6U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/01/2014",
        "dateOfIncident": "05/01/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10576475,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS PROBLEM - THE CAR DIES AND I LOSE ALL POWER ASSISTED FUNCTIONS LIKE STEERING AND BRAKES - HAS HAPPENED MULTIPLE TIMES, PROBABLY TWO DOZEN, OVER A PERIOD OF TIME BEGINNING SOME TIME IN 2006, WITH MODEL YEARS 2000, 2001, AND 2006 SEDANS. SINCE 1995 I HAVE DRIVEN ONLY CADILLAC. IT OCCURS ONLY WHEN I'M STOPPED, OR ROLLING AT A SLOW SPEED, AND THEN BEGIN TO ACCELERATE THE CAR, SUCH AS HAS HAPPENED MANY TIMES WHEN I'M IN A NON-RAISED CENTER MEDIAN ATTEMPTING A LEFT TURN AGAINST ONCOMING TRAFFIC (I HAVE LEARNED TO LEFT LOTS OF ROOM NOW). I HOPE I, OR SOMEONE ELSE IN A CADILLAC, WON'T HAVE TO DIE OR BE SERIOUSLY INJURED BEFORE THEY ADMIT THIS PROBLEM IN THEIR FLAGSHIP VEHICLE. I CALLED GM'S 'IGNITION SWITCH RECALL' LINE AND WAS TOLD THAT THIS SOUNDS EXACTLY LIKE THE PROBLEM IN THE OTHER VEHICLES.  *TR",
        "vin": "1G6KD57Y76U"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "04/01/2014",
        "dateOfIncident": "04/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10576539,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN THE HIGHWAY AT 65 MPH AND SUDDENLY I SAW A FLASH OUT OF THE CORNER OF MY EYE OVER MY HEAD FOLLOWED BY A TREMENDOUS \"BOOM\" ABOVE ME.  THE SUNROOF THEN DISINTEGRATED INTO MANY SHARP SHARDS AND RAINED AROUND THE DRIVER AND PASSENGER GETTING INTO THE SHIFTING MECHANISM, ELECTRIC SEATS, SEATBELT CONNECTORS AND ALL OVER THE PASSENGERS.  THERE WAS NO IMPACT AND THE SUNROOF BLEW UP AND OUTWARDS FROM THE INSIDE OF THE CAR.  *TR",
        "vin": "1G6KD57Y86U"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/13/2014",
        "dateOfIncident": "08/01/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10568461,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 CADILLAC DTS.  CONSUMER WRITES IN REGARDS TO VEHICLE HEADLIGHT PROBLEMS.  *SMD  THE CONSUMER NOTICED WHILE DRIVING AT NIGHT, THE HEADLIGHTS FLICKERED AND EVENTUALLY WENT OUT. THE CONSUMER HAD TO TURN OFF THE SWITCH AND TURN IT BACK ON AGAIN, IN ORDER FOR THE LIGHTS TO COME BACK ON. HE HAD TO REPEAT THE PROCEDURE OVER AND OVER AGAIN.",
        "vin": ""
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/14/2014",
        "dateOfIncident": "02/12/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10564343,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I STARTED THE CAR, APPLIED THE BRAKE, PUT IT IN DRIVE AND BEGAN TO PULL OUT OF PARKING SPACE. I APPLIED THE BRAKES AND THE PEDAL HIT THE CARPET. I BUMPED THE CAR IN FRONT OF ME. NO DAMAGE.  I TOWED THE CAR TO A GARAGE AND THEY FOUND THAT THE BRAKE LINES, 2 OF THEM HAD RUSTED THRU AND THERE WAS DAMAGE TO A THIRD. THE FRONT CALIPERS ARE ALSO SO RUSTED OUT THAT THEY CANNOT BE ADJUSTED TO BLEED THE LINES AND THE MASTER CYLINDER IS LEAKING. THE ENTIRE SYSTEM IS RUST EFFECTED.  THE CAR IS A MASSACHUSETTS CAR I JUST TRANSPORTED TO CALIF.  GM SHOULD BE RESPONSIBLE FOR THESE FAULTY VEHICLES AND BRAKE PROBLEMS.   TO COMPLETELY REPLACE THE BRAKE LINES WILL COST THOUSANDS.  THIS IS A MAJOR SAFETY ISSUE. IF IT HAD HAPPENED AT HIGHWAY SPEEDS, IT WOULD HAVE BEEN VERY SERIOUS.  *TR",
        "vin": "1G6KD57926U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/07/2014",
        "dateOfIncident": "12/19/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10558918,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT NIGHT ON I-70 MY HEADLIGHTS WHEN OUT.  I PULLED OFF THE ROAD FOR A MINUTE OR SO AND THEY STARTED WORKING.  OCCASIONALLY THEY WILL BLINK AND THEN SETTLE DOWN. IN INVESTING THIS ON THE COMPUTER I DISCOVERED THIS HAPPENS FREQUENTLY ON THIS MODEL.  I THINK THE MFG. SHOULD ANNOUNCE A RECALL ON THIS DEFECT.  VISUALIZE DRIVING AT 65 MPH IN TOTAL DARKNESS.  *TR",
        "vin": "1G6KD57906U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/02/2014",
        "dateOfIncident": "10/01/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10558200,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT STATED THAT THE HEADLIGHTS FAILED. THE FAILURE WAS RECURRING HOWEVER, THE DEALER WAS UNABLE TO CORRECT THE ISSUE BECAUSE THE FAILURE WOULD ONLY RECUR INTERMITTENTLY. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 127,000 AND THE CURRENT MILEAGE WAS 130,000.",
        "vin": "1G6KD57Y36U"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEATS",
        "crash": false,
        "dateComplaintFiled": "12/30/2013",
        "dateOfIncident": "12/29/2013",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10557887,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE VEHICLE DOWN THE ROAD WITH THE HEATED SEAT (DRIVERS SIDE) ON, I BEGAN TO NOTICE A BURNING SMELL AND SMOKE COMING FROM THE PASSENGER SEAT AREA.  STOPPED THE VEHICLE TO INSPECT TO FIND A SMOLDERING WIRING HARNESS AND MODULE, THERE WAS A SMALL FLAME.  THE FLAME WAS EXTINGUISHED.  THE VEHICLE WAS THEN TURNED OFF AND BROUGHT TO A GM DEALERSHIP THAT DIAGNOSED IT AS HAVING A BAD CONNECTOR.  DEALERSHIP ALSO STATED THAT THIS IS A COMMON ISSUE ON THESE CARS.  IN ORDER TO FIX THIS AND MAKE IT SAFE IT REQUIRED THE MODULE UNDER THE PASSENGER SEAT AND THE CONNECTOR TO BE REPLACED.  WAS INFORMED THAT THE NEW MODULE IS AN IMPROVED DESIGN THAT SHOULDN'T HAVE THE SAME ISSUE.  ALL SERVICE WAS PERFORMED AND THE VEHICLE AND ACCESSORIES IS NOW FUNCTIONING AS THEY SHOULD.  *TR  ....UPDATED 09-03-14 *BF   UPDATED 09/8/2014  *JS",
        "vin": "1G6KD579X6U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/18/2013",
        "dateOfIncident": "08/15/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10552764,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT STATED THAT THE PASSENGER'S SIDE HEADLIGHT FAILED INTERMITTENTLY. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSIS. THE TECHNICIAN STATED THE PASSENGER'S SIDE HEADLIGHT WOULD NEED TO BE REPLACED. THE VEHICLE WAS REPAIRED HOWEVER, THE FAILURE LATER OCCURRED ON THE DRIVER'S SIDE HEADLIGHT. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 80,000.",
        "vin": "1G6KD57Y16U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/15/2013",
        "dateOfIncident": "10/15/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10552463,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT STATED THAT THE DRIVER'S SIDE HEAD LIGHT WOULD FAIL SPORADICALLY. THE CONTACT MENTIONED THAT IT WAS NOT THE BULB BURNING SINCE THE LIGHT WOULD ILLUMINATE INTERMITTENTLY. THE VEHICLE WAS TAKEN TO THE DEALER BUT NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE.  THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 110,000 AND THE CURRENT MILEAGE WAS 111,000.",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/13/2013",
        "dateOfIncident": "11/05/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10552022,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN HEADLIGHTS ARE ON AUTO, OR MANUAL, THE LIGHTS FLICKER, TURN OFF, SHUT OFF WHILE DRIVING.  I HAVE TO TURN THE HEADLIGHTS OFF AND THEN BACK ON THUS FAR.  I FIND THIS TO BE A SAFETY ISSUE AND DON'T KNOW THE CAUSE, HAVE CONTACTED GENERAL MOTORS TO FIND IF THERE ARE ISSUES KNOWN TO THEM.  *TR",
        "vin": "1G6KD57Y16U"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/11/2013",
        "dateOfIncident": "09/26/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10551781,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE ON A TRIP IN WISCONSIN, I WAS TRAVELING AT NIGHT ON A 4-LANE HIGHWAY WITH TWO FRIENDS IN THE CAR AT A SPEED OF 65 MPH.  BOTH HEADLIGHTS WENT OUT WITH NO INDICATION OF FAILURE ON THE DASH.  THANKFULLY, WE WERE THE ONLY ONES ON THE ROAD.  I SLOWED DOWN AND PULLED TO THE SIDE AS BEST AS I COULD SEE.  UPON STOPPING THE CAR, I SWITCHED THE LIGHT SWITCH ON AND OFF SEVERAL TIMES UNTIL BOTH HEADLIGHTS CAME ON AGAIN.  I PULLED BACK ON THE ROAD TO PROCEED - AGAIN NO INDICATION ON THE DASH THAT ANYTHING WAS WRONG WITH THE HEADLIGHTS.  A FEW MILES DOWN THE ROAD, ONE HEADLIGHT WENT OUT.  I SWITCHED THE HEADLIGHTS ON-OFF SEVERAL TIMES AND BOTH CAME ON AGAIN.  I TOOK THE CAR TO THE DEALER ON 28SEP2009 AND THEY REPLACED BOTH HEADLIGHTS UNDER WARRANTY.  A FEW WEEKS LATER ON 4DEC2009, I RETURNED THE CAR TO THE DEALER BECAUSE THE RIGHT HEADLIGHT CONTINUED TO GO OUT WITH NO INDICATION ON THE DASH.  THE DEALER REPLACED THE RIGHT HEADLAMP AND I HAD NO FURTHER PROBLEMS UNTIL RECENTLY.  I RETURNED THE CAR TO THE DEALER 8NOV2013 BECAUSE THE LEFT HEADLIGHT WOULD GO OUT, COME BACK ON, GO OUT, COME BACK ON, ETC.  WITH NO WARNING OR INDICATION ON THE DASH.  THIS IS A BIG SAFETY ISSUE!!!!!  IF YOU READ SOME BLOGS ON THIS PROBLEM ON THE INTERNET, YOU WILL FIND THAT THIS IS NOT A UNIQUE CASE - AND THERE IS NO EXPLANATION WHY IT OCCURS.  IF THE HEADLIGHTS GO OUT, YOU SHOULD GET AN INDICATION ON THE DASH THAT A LAMP IS BAD.  CERTAINLY, BOTH LIGHTS SHOULD NEVER GO OUT AT ONCE WHILE YOU ARE TRAVELING.  IT IS EXTREMELY EXPENSIVE TO REPLACE HEADLAMPS IN THIS CAR >$550 PER LIGHT!!!!!  MORE IMPORTANTLY, I CANNOT BELIEVE THERE IS NO INVESTIGATION INTO THIS PROBLEM.  *TR",
        "vin": "1G6KD57Y26U"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEATS",
        "crash": false,
        "dateComplaintFiled": "10/13/2013",
        "dateOfIncident": "10/01/2013",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10547780,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE AND I TURNED ON OUR SEAT HEATERS, AND BOTH NOTED A SMELL OF BURNING WIRE AND PLASTIC. WE EVACUATED THE VEHICLE. I THEN PROCEEDED TO CHECK UNDER THE PASSENGER SEAT WHERE THE SMELL WAS COMING FROM. I VISUALLY NOTED A SMALL AMOUNT OF WHITE SMOKE. I HAVE SINCE PULLED THE FUSE FOR THE HEATED/COOLED SEAT MODULE, AND REPAIRED IT. THERE SHOULD BE A RECALL ON THIS IF NOT I'M ALMOST SURE A CLASS ACTION LAWSUIT WILL BE IN GM'S NEAR FUTURE FOR SUCH A DANGEROUS FAULT. UPON REPLACEMENT OF THE MODULE I NOTE SEVERAL BURNT WIRES AND MELTED CONNECTORS ON THE MODULE. NOT EVEN A WEEK AFTER I REPLACED THE MODULE IT HAPPENED A SECOND TIME! THIS TIME THERE WAS EVEN MORE SMOKE AND I WAS SURE THERE WAS A FIRE. THERE WASN'T; JUST BURNING WIRES AGAIN. DEALERS CHARGE UPWARDS OF $800.00 FOR THIS REPAIR!! A HIGH PRICE TO PAY FOR NOT WANTING TO BE SET ABLAZE FOR WARM OF VENTILATED SEATS JUST FOR IT TO DISASTROUSLY FAIL AGAIN! DO SOMETHING ABOUT IT GM!  *TR",
        "vin": ""
    },
    {
        "components": "EQUIPMENT ADAPTIVE/MOBILITY",
        "crash": false,
        "dateComplaintFiled": "10/02/2013",
        "dateOfIncident": "10/02/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10546555,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT STATED THAT THE FACTORY JACK FAILED TO HOLD THE VEHICLE WHILE THE CONTACT WAS CHANGING A TIRE. THE MANUFACTURER WAS CONTACTED ABOUT THE FAILURE. THE JACK WAS NOT REPLACED. THE VIN AND FAILURE MILEAGE WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/03/2013",
        "dateOfIncident": "08/02/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10533340,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHAT WOULD APPEAR TO BE A BURNED OUT BLINKER BULB HAS NOW TURNED INTO A RIDICULOUS MESS  ESPECIALLY WITH THE FEW SEARCHES I HAVE CONDUCTED ON THIS ISSUE SO FAR  ESPECIALLY OWNING THE VEHICLE FOR LESS THAN 5 DAYS (PURCHASED USED)    NOT ONLY IS THIS A HEAT ISSUE FROM THE BULB  THE PLASTIC HOUSING HAS BECOME SO BRITTLE THAT IT IS FALLING APART INTO SMALL PIECES & DUST  SO, ONCE MY BULB FELL OUT OF ITS RESPECTIVE PLACE IN ITS SOCKET IT WAS RESTING ON THE HOUSING    I WOULD SAY I HAVE A UNEVEN LARGE OPENING THE SIZE OF A TANGERINE WHERE THE BLINKER BULB USED TO RESIDE.  GOOD THING I CHECKED TO SEE WHERE ALL THE SMOKE WAS COMING FROM  AND TO INVESTIGATE THE BURNING GOING ON    I AM EXTREMELY DISAPPOINTED IN WHAT I HAVE READ ABOUT THIS THUS FAR  SO MUCH SO, IT MAKES ME WONDER ABOUT THE REST OF THE VEHICLE  IT MAKES ME WONDER IF I HAVE MADE A MISTAKE    SO TO THINK THAT A NEW REPLACEMENT COST WELL OVER $700.00  I AM NOT HAPPY OVER THIS ISSUE  OVER POOR PLASTICS DETERIORATING WITHIN 7 YEARS IN MY CASE    EXTREMELY DISAPPOINTED...THIS IS A CADILLAC!!!  MY STANCE IS...IF CADILLAC IS NOT HELD RESPONSIBILITY FOR THE QUALITY OF THEIR PARTS OR EVEN THEIR PRODUCT  THEN THE MANUFACTURERS SHOULD BE!    AND THIS IS A SAFETY ISSUE IN MORE THAN ONE WAY  I DO NOT HAVE A USABLE BLINKER WHEN WANTING TO MAKE A RIGHT TURN  UPON INSPECTING THE BURNING SMELL & SMOKE I DO BELIEVE A FIRE COULD HAVE HAPPENED!  *TR",
        "vin": "1G6KD57Y26U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/03/2013",
        "dateOfIncident": "07/03/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10523140,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ALONG THE TURNPIKE ALL OF THE CAR'S WARNING LIGHTS CAME ON AND LOCKS BEGAN TO MALFUNCTION AND THERE WAS A BURNING SMELL, I THOUGHT THE CAR MAY OF BEEN ON FIRE WITH THE SMOKE AND ELECTRICAL SMELL. THE VEHICLE BEGAN TO SLOW SO I PULLED TO THE SIDE OF THE ROAD AS THE CAR WAS UNABLE TO BE DRIVEN AND HAD TO BE TOWED TO MECHANIC. THERE IS A SEVERE ELECTRICAL PROBLEM WITH THIS CAR.  *TR",
        "vin": "1G6KD57Y26U"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/15/2013",
        "dateOfIncident": "07/17/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10512179,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2006 CADILLAC DTS HID HEADLIGHT WILL INTERMITTENTLY, BUT NOT FREQUENTLY, SHUT OFF. YOU CAN RESTORE THE HEADLIGHT BY JUST SHUTTING THE HEADLAMP OFF AND BACK ON. MY UNDERSTANDING IS THIS IS A COMMON PROBLEM WITH THE EARLY GM HID SYSTEMS INCLUDED ON THE CADILLAC AND CORVETTE. I BELIEVE THIS IS DUE TO A DESIGN DEFECT. THERE IS NO INDICATION THIS WILL OCCUR AND THERE IS NO WARNING ON THE DASH OF ANY KIND. YOU SIMPLY HAVE DIMINISHED VIEW SUDDENLY WHICH IS A RISK TO BEING ABLE TO SEE WHAT IS IN THE ROADWAY.  *TR",
        "vin": "1G6KD579X6U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/04/2013",
        "dateOfIncident": "04/01/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10507053,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, THE HEADLIGHTS FLICKERED ON AN INTERMITTENT BASIS. THE CONTACT HAD TO PULL THE LEVER ON AND OFF IN ORDER FOR THE LIGHTS TO ILLUMINATE AGAIN. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS CONTACTED AND THEY OFFERED NO ASSISTANCE. THE FAILURE MILEAGE WAS APPROXIMATELY 100,000. THE CURRENT MILEAGE WAS APPROXIMATELY 130,000.  *TR",
        "vin": "1G6KD57976U"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/17/2013",
        "dateOfIncident": "03/16/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10503372,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE DRIVING ON I-40 WEST IN SAMPSON COUNTY, NORTH CAROLINA WHEN THE HEADLIGHTS WENT OUT. THEY CAME BACK ON SHORTLY. THEY BLINKED A FEW TIMES AFTER THAT. WE WERE NEARLY 100 MILES FROM HOME AT NIGHT AND TRAFFIC WAS HEAVY. THIS WAS VERY FRIGHTENING.  *TR",
        "vin": "1G6KD57Y66U"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/11/2013",
        "dateOfIncident": "01/18/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10497758,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT STATED THAT THE POWER STEERING ASSIST AND THE WASHER PUMP SENSORS FAILED. THE CONTACT ALSO MENTIONED THE VEHICLE EXPERIENCED A ELECTRICAL WIRING FAILURE. THE VEHICLE WAS TAKEN TO A PRIVATE MECHANIC WHO DIAGNOSED  THAT THE HEATED WASHER FLUID MODULE, THE POWER STEERING GEAR INLET HOSE, AND A WIRE HARNESS NEEDED TO BE REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STATED THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 10V240000 (ELECTRICAL SYSTEM), NHTSA CAMPAIGN NUMBER: 06V105000 (STEERING), OR NHTSA CAMPAIGN NUMBER: 08V441000 (ELECTRICAL SYSTEM). THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 160,000 AND THE CURRENT MILEAGE WAS 185,000.",
        "vin": "1G6KD57Y46U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/07/2013",
        "dateOfIncident": "01/24/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10496801,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER EXPERIENCING A LOSS OF POWER STEERING, I TOOK THE VEHICLE TO VERA CADILLAC IN PEMBROKE PINES, FLORIDA.  IT WAS DETERMINED THAT THE POWER STEERING HOSE WAS LEAKING AT THE CRIMP.  ALSO, THE FLUID LEAKED DOWN TO THE SERPENTINE BELT WHICH SPRAYED THE FLUID ALL OVER THE ENGINE COMPARTMENT.  THE HOSE AND THE BELT WERE REPLACED AT MY EXPENSE (OVER $500).  I KNEW THERE WAS A RECALL (NHTSA CAMPAIGN ID NUMBER 06V105000) FOR THIS VEHICLE CONCERNING THIS EXACT PROBLEM BUT I WAS TOLD THAT BASED ON MY VIN THAT MY VEHICLE WAS NOT INCLUDED IN THE RECALL.  BASED ON THE AMOUNT OF COMPLAINTS I'VE READ ONLINE FROM PEOPLE WHO HAVE EXPERIENCED THE EXACT SAME SCENARIO, I FIND IT HARD TO BELIEVE THIS IS A COINCIDENCE.  I HAVE THE EXACT SAME VEHICLE WITH THE EXACT SAME FAILURE AS STATED IN THE RECALL.  MY VEHICLE WAS MANUFACTURED ON 2/06 AND HAS VERY LOW MILEAGE.  SOMEONE NEEDS TO INVESTIGATE WHY THESE OTHER VEHICLES WERE NOT INCLUDED IN THE RECALL.  IT SEEMS TO ME THAT SOMEONE SIMPLY MADE A MISTAKE WHEN GM FIRST INVESTIGATED WHICH VEHICLES TO INCLUDE.  *TR",
        "vin": "1G6KD57Y76U"
    },
    {
        "components": "STEERING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/06/2013",
        "dateOfIncident": "01/03/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10496661,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING HOSES LEAKS,  AND   OIL PAN GASKET LEAKS I HAVE OIL IN THE STREET AND IN MY DRIVE WAY/GARAGE BECAUSE THE POWER STEERING  HOSES ARE LEAKING THEY WILL ONLY REPAIR SOME  VIN # CARS FOR THE POWER STEERING.  OIL PAN GASKET ON THE OIL PAN IS LEAKING  I HAVE FOUND OUT THERE IS NO RECALL BUT GM HAVE BEING HAVING PROBLEM WITH THESE 4.6L  NORSTAR ENGINE  OIL PANS GASKETS  FOR A LONG TIME THIS IS A MAJOR PROBLEM BECAUSE THEY HAVE ISSUE--  BULLETIN NO.: 03-06-01-027A  THAT STATE  YOU MUST REMOVE THE ENGINE TO DO THE REPAIR THIS IS VERY COSTLY THIS IS ALSO A ENVIRONMENTAL ISSUE  THIS SHOULD BE A  RECALL ISSUE.  *TR",
        "vin": "1G6KD57Y56U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/23/2013",
        "dateOfIncident": "01/19/2013",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10494470,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT STATED THAT A BURNING ODOR WAS EMITTED INTO THE VEHICLE AND THE POWER STEERING FAILED. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THE TECHNICIAN DIAGNOSED THAT THE HIGH PRESSURE POWER STEERING HOSE WAS LEAKING AND NEEDED TO BE REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE BUT DID NOT OFFER ANY ASSISTANCE SINCE THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN ID NUMBER: 06V105000 (STEERING:HYDRAULIC POWER ASSIST:HOSE, PIPING, AND CONNECTIONS). THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGE WAS UNKNOWN.",
        "vin": "1G6KD57Y66U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/22/2013",
        "dateOfIncident": "11/15/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10493720,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT STATED THAT THE HEADLIGHTS FLICKERED ON AND OFF WITHOUT ANY WARNING. THE DRIVER HAD TO USE THE SWITCH TO GET THEM TO TURN BACK ON. THE VEHICLE WAS TAKEN TO A DEALER. AFTER DIAGNOSIS, THE CONTACT WAS INFORMED THAT THE BULBS AND THE BALLASTS WERE BURNED OUT AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS APPROXIMATELY 85,000. THE CURRENT MILEAGE WAS APPROXIMATELY 89,000. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/20/2013",
        "dateOfIncident": "01/11/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10493534,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "( JUST BOUGHT THIS USED CAR , FIRST TIME DRIVING IT HOME FROM DEALER)  SPEED CONTROL WAS SET AT 70 MPH ON I-88 STARTED DOWN A STEEP HILL, SPEED KEEP GOING UP . I KEEP MY FOOT ON HE BRAKE AS THE SPEED WAS UP TO 85 MPH . THE CAR NEVER SLOWED DOWN.  I HAVE HAD CADILLACS BEGINNING IN 1991, NEVER HAD A CAR DO THIS BEFORE, IF YOU ARE ON A FLAT ROAD DOING 50 MPH, TAKE YOUR FOOT OF THE  GAS THE CAR WILL START SLOWING DOWN AFTER YOU DRIVE 3/10 OF A MILE AND THAN SLOW VERY SLOWLY. THERE IS SOMETHING WRONG WITH THIS CAR, AFTER DRIVING FOR 50 YEARS ALL MAKES AND MODELS , I NEVER HAD A CAR DO WHAT THIS CAR  IS DOING. THERE IS SOMETHING WRONG FOR SURE.  *TR",
        "vin": "1G6KD57Y96U"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/08/2013",
        "dateOfIncident": "11/29/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10491914,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS 2006 CADILLAC DTS WAS PURCHASED USED IN NOVEMBER OF 2011. AT THE TIME OF PURCHASE THE VEHICLE ONLY HAD 30,743 MILES, WAS LIGHTLY USED AND NEVER INVOLVED IN ANY ACCIDENTS. THE VEHICLE CURRENTLY HAS APPROXIMATELY 69,000 MILES. A COUPLE OF MONTHS AGO, I NOTICED THE RIGHT SIDE HID HEADLIGHT FLICKERING AND GOING OUT WHILE DRIVING.  THINKING IT WAS A BULB, I SPOKE TO THE DEALER BY PHONE WHO ADVISED IT MAY BE A BULB, BALLAST OR LOOSE CONNECTION. FROM RESEARCH AND DEALER CONVERSATION, I LEARNED IT WAS A COSTLY AND TIME CONSUMING REPAIR JUST TO REPLACE THE BULB, DUE TO DESIGN ISSUES REQUIRING REMOVAL OF THE ENTIRE BUMPER COVER JUST TO ACCESS THE HEADLIGHT. I TOOK IT TO THE DEALER FOR REPAIR, BUT WAS TOLD THAT THEY COULD NOT DUPLICATE THE PROBLEM. SINCE THEN, THE FLICKERING HAS GOTTEN WORSE, NOW AFFECTING BOTH HEADLIGHTS. THEY RANDOMLY FLICKER OFF AND ON WHILE DRIVING PROVING TO BE A DISTRACTION TO ME, AS WELL AS DRIVERS OF OTHER VEHICLES.  IT IS ALSO A SAFETY ISSUE AS THERE IS NO WARNING WHEN THEY ARE GOING TO GO OUT. A SEARCH OF THIS ISSUE VIA GOOGLE REVEALS THIS IS NOT AN ISOLATED INSTANCE WITH MY VEHICLE, BUT IN FACT, IS VERY WIDESPREAD WITH MANY DOCUMENTED CASES MIRRORING MY SITUATION. CADILLAC / GM TO MY KNOWLEDGE HAS NOT OFFERED ANY RELIEF TO AN ISSUE THAT IS OBVIOUSLY A DEFECT. PER THE DEALER, REPAIR OF THE BALLAST COULD BE WELL OVER $1000. HOWEVER, REVIEWING OTHER'S EXPERIENCE, THERE HAS BEEN LITTLE SUCCESS IN FINDING OR REPAIRING THE ISSUE.  CADILLAC IS SUPPOSED TO BE A FLAGSHIP FOR GM AND A PREMIUM AUTOMOBILE. I WOULD THINK RELIABLE, SAFE AND FUNCTIONAL HEADLIGHTS WOULD BE A MINIMUM THRESHOLD FOR SAFETY. I ASK YOUR ASSISTANCE IN REVIEWING THE DOCUMENTED ISSUES FROM MANY FRUSTRATED CADILLAC OWNERS WHO EXPERIENCE THE SAME ISSUES THAT I AM HAVING AND EXERT SOME PRESSURE ON GM / CADILLAC TO RECTIFY THIS KNOWN ISSUE.  *TR",
        "vin": "1G6KD57Y86U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/27/2012",
        "dateOfIncident": "07/08/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10490258,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING IS NOT IN EFFECT WHILE TURNING STEERING WHEEL. HAVE TO USE EXTRA EFFORT WHILE TURNING, ESPECIALLY IN TIGHT SPACING OR LOW SPEEDS.  *TR",
        "vin": "1G6KD57976U"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/16/2012",
        "dateOfIncident": "12/03/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10488916,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG FAILURE - 2006 LUX III CAR TOTALED 12-03-12  51558 MILES TOTALED CAR.  WE WERE HIT ON THE DRIVER SIDE DOOR BY A 2003 1/2 TON EXTENDED CAB CHEVROLET PICKUP TRUCK AT 35 TO 40 MILES PER HR., THE DRIVER WAS DRUNK AND BEING PURSUED. HE WENT INTO THE CENTER OF THE INTERSECTION WITH STOP SIGNS ON ALL SIDES AND HIT ME AS I WAS TURNING LEFT.  THERE WERE SEVERAL CARS AT THE INTERSECTION TAKING THEIR TURNS.  THE ACCIDENT WAS A HIT AND RUN DUI.  THEY DID CATCH HIM LATER.  THE SIDE AIR DID NOT GO OFF, ALSO ONSTAR DID NOT GO OFF.  I HAD MY CELL PHONE IN MY POCKET AND CALLED 911.  WE WERE TRANSPORTED TO THE HOSPITAL.  I HAD A LACERATION TO THE HEAD AND MY WIFE HAD 2 BROKEN RIBS.  WE WERE REALLY SHAKEN UP , DAZED AND MY WIFE WAS SCREAMING FOR HELP..  REPORTED TO GENERAL MOTORS, NO EXPLANATION OF THE AIRBAG FAILURE YET (12-16-12).  I HAVE TALKED TO AT LEAST 5 PEOPLE AT GM.  ONSTAR SAID THE ONSTAR HELP IS NOT NOTIFIED IF THE AIR BAGS DO NOT GO OFF.  WE HAD NO DASHBOARD WARNINGS ABOUT THE AIR BAGS.  ALL  OF OUR MONTHLY ONSTAR REPORTS HAVE HAD NO PROBLEMS REPORTED.  *TR",
        "vin": "1G6KD57Y86U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/15/2012",
        "dateOfIncident": "10/15/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10480178,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT STATED THAT WHEN DRIVING AT VARIOUS SPEEDS, THE HEADLIGHTS WOULD FLICKER ON AND OFF BEFORE COMPLETELY FAILING. THE CONTACT WOULD HAVE TO TURN THE HEADLIGHT SWITCH ON AND OFF IN ORDER TO GET THEM TO REMAIN ILLUMINATED. THE VEHICLE WAS NOT INSPECTED BY A DEALER OR AN INDEPENDENT MECHANIC. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS APPROXIMATELY 50,000. THE CURRENT MILEAGE WAS APPROXIMATELY 54,000.  UPDATED 11/14/12*LJ  THE CONSUMER STATED SINCE FILING THE COMPLAINT, HE CONTACTED THE MANUFACTURER AND THE VEHICLE WAS INSPECTED BY THE DEALER. THEY STATED THERE WAS WATER INTRUSION IN THE HEADLIGHTS WHICH SHORTED OUT THE BALLAST. IT HAS NOT BEEN FIXED, BECAUSE HE DID NOT WANT TO PAY $2,000. UPDATED 11/15/12",
        "vin": "1G6KD57Y16U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/29/2012",
        "dateOfIncident": "08/22/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10472970,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT WAS DRIVING 50 MPH WHEN AN ABNORMAL GROWLING SOUND WAS EMITTED FROM THE STEERING WHEEL. UPON INSPECTION, THE CONTACT NOTICED THAT THE POWER STEERING PRESSURE HOSE EXHIBITED A HOLE, WHICH WAS LEAKING POWER STEERING FLUID ONTO THE ENGINE.  THE CONTACT DID NOT TAKE THE VEHICLE TO A DEALER OR A LOCAL MECHANIC DUE THE VEHICLE BEING INOPERABLE. THE CONTACT REFERENCED NHTSA CAMPAIGN I.D. 06V105000 (STEERING:HYDRAULIC POWER ASSIST:HOSE, PIPING, AND CONNECTIONS) AND CALLED THE MANUFACTURER. THE MANUFACTURER STATED THAT THE RECALL (GM RECALL NUMBER:06026) WAS NON- EXISTENT. THE FAILURE MILEAGE WAS 50,000.    UPDATED 9/26/12 *CN",
        "vin": "1G6KD57946U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/26/2012",
        "dateOfIncident": "04/05/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10467780,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT STATED THAT THE DRIVER'S SIDE HEADLIGHT WOULD FAIL SPORADICALLY. THE DEALER WAS NOTIFIED AND AN APPOINTMENT WAS SCHEDULED FOR REPAIRS. THE MANUFACTURER WAS NOTIFIED BUT OFFERED NO ASSISTANCE TO THE CONTACT. THE VEHICLE WAS  REPAIRED. THE FAILURE AND CURRENT MILEAGES WERE 69,700.   UPDATED 08/28/12*LJ  THE DEALER REPLACED THE BALLAST, WHICH WAS FAULTY. UPDATED 08/29/12",
        "vin": "1G6KD579X6U"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/09/2012",
        "dateOfIncident": "07/09/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10464683,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "CONTINUED PROBLEM WITH LEFT HEADLIGHT GOING OUT.  *TR",
        "vin": "1G6KD579X6U"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/19/2012",
        "dateOfIncident": "06/14/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10462238,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE OWNED THIS CADILLAC SINCE FEB 2010 (APPROX 28 MONTHS) AND HAVE HAD THIS VEHICLE BACK TO THE DEALER 16 TIMES.   EACH REPAIR REQUIRES A RENTAL VEHICLE, ANYWHERE FROM 2-5 DAYS PER SERVICE VISIT.  WE HAVE HAD 7 WHEEL BEARINGS REPLACED AND 12 SENSORS REPLACED.   THERE DOESN'T SEEM TO BE A DAY WHEN THE SERVICE ENGINE LIGHT IS NOT ON.  THE QUALITY OF THIS $52,000 AUTOMOBILE IS VERY POOR.   THE VEHICLE IS BACK AT THE CADILLAC DEALER NOW, WITH COOLANT & ENGINE ISSUES ONCE AGAIN.      *JS",
        "vin": "1G6KD57966U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/15/2012",
        "dateOfIncident": "09/15/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10455287,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LEFT HEADLIGHT WILL TURN A ROSE COLOR & THEN GO OUT. THE RIGHT IS O.K. I BOUGHT THE CAR USED LAST JULY & POSSIBLY THE RIGHT HAS BEEN REPAIRED ALREADY. THE HIGH COST TO CHANGE A BULB IS BECAUSE OF THE DESIGN OF THE FRONT. THE INNER FENDER & THE FRONT FASICA HAS TO COME OFF TO ACCESS THE BALLAST OR BULB. I THINK G.M. SHOULD PICK UP THE COST FOR HEADLIGHT REPAIRS.  *TR",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/10/2012",
        "dateOfIncident": "02/01/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10454768,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT STATED THAT THE HEADLIGHTS ILLUMINATED INTERMITTENTLY. THE VEHICLE WAS TAKEN TO THE DEALER, WHO DIAGNOSED THAT WATER ENTERED THE HEAD LIGHT CAPSULE THROUGH A FAULTY VENT, CAUSING IT TO CORRODE. THE DEALER STATED THAT THE HEAD LIGHTS NEEDED TO BE REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE, BUT OFFERED NO ASSISTANCE BECAUSE THE VEHICLE WAS NO LONGER UNDER WARRANTY. THE VEHICLE WAS REPAIRED. THE FAILURE MILEAGE WAS 65,000 AND THE CURRENT MILEAGE WAS 77,000.  UPDATED 05/10/12*LJ",
        "vin": "1G6KD57Y16U"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/11/2012",
        "dateOfIncident": "07/01/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10451110,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHT FAILURE BEGAN AT APPROXIMATELY 90,000 MILES.  INITIALLY, IT STARTED WITH THE INTERIOR INSTRUMENT PANEL LIGHT GROWING DIM AND THEN BRIGHT AT ANY GIVEN TIME.  THEN, HEADLIGHTS STARTED DOING THE SAME THING.  SOON THEREAFTER, THE RIGHT HEADLIGHT STARTED GOING OUT ON A REGULAR BASIS.  IT WOULD INITIALLY FLICKER, THEN GO TOTALLY OUT.  AFTER A FEW MONTHS, THE LEFT HEADLIGHT STARTED DOING IT.  RECENTLY, ABOUT 18 MONTHS AFTER THE FIRST INCIDENT, THEY BOTH GO OUT AT THE SAME TIME!  DURING AN 80 MILE TRIP I MAKE ON A REGULAR BASIS, AT LEAST TWICE A WEEK, MY HEADLIGHTS WILL GO OUT BETWEEN 8 AND 20 TIMES!  I CAN GET THEM BACK ON BY JIGGLING THE ON/OFF LIGHT SWITCH.  BUT, ONE OR BOTH WILL TURN BACK OFF WITHIN A MATTER OF A FEW MINUTES.  I TRY TO DRIVE DURING DAYLIGHT HOURS AS MUCH AS POSSIBLE, BUT THIS TRIP IS USUALLY JUST BEFORE DAWN OR AFTER DUSK.    I HAVE CALLED THE DEALER WHERE  I PURCHASED THE CAR, AND HAVE BEEN TOLD THEY'VE NOT HEARD OF THIS PROBLEM.  I DON'T BELIEVE THAT... ALL THEY HAVE TO DO IS TALK TO OTHER CADILLAC OWNERS, AS I HAVE; OR LOOK ON THE INTERNET.  THIS HAS TO BE A WIDESPREAD PROBLEM!   IN CHECKING WITH ANOTHER DEALER, THEY TOLD ME IT WAS A BALLAST PROBLEM, AND WOULD BE BETWEEN $1400 AND $1800 TO REPAIR.  THIS IS A $7000 CAR.  FOR CADILLAC TO EXPECT ME TO PAY 20% PLUS OF THE CAR'S VALUE TO HAVE HEADLIGHTS THAT WORK, IS WAY OUT OF LINE.  I PURCHASED THIS CAR NEW AT A COST OF $44,000.  I EXPECT TO HAVE HEADLIGHTS THAT WORK!!  THIS IS A SAFETY ISSUE AND CADILLAC SHOULD BE RESPONSIBLE FOR PROVIDING A FIX!  *TR  *JS",
        "vin": "1G6KD57Y06U"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "01/17/2012",
        "dateOfIncident": "10/06/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10444306,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I TURNED RIGHT OUT OF MY PLACE OF EMPLOYMENT. I WAS LESS THAN A HALF BLOCK FROM THE LIGHT. I PULLED INTO THE CENTER LANE INTENDING TO TURN LEFT AT THE LIGHT. SUDDENLY MY CAR ACCELERATED RAPIDLY. I SLAMMED ON THE BRAKE SO HARD MY LEG HURT FOR DAYS.  THE CAR ACCELERATED MORE AND THE BRAKE DID NOT STOP IT COMPLETELY. I REAR ENDED A LARGE PICKUP. I WENT BACK TO MY OFFICE AND CONTACTED CADILLAC CUSTOMER SERVICE IMMEDIATELY. I REQUESTED THEY CHECK THE \"BLACK BOX\" COMPUTER MODULE.  THEY DID EVENTUALLY DO THAT BUT SAID THEY FOUND NO PROBLEM. NOBODY SEEMS TO BE LISTENING TO WHAT HAPPENED. I OFFERED CADILLAC TO JUST TRADE ME FOR ANY IDENTICAL CAR THEY REFUSED ANY KIND OF HELP.  I EVENTUALLY SOLD THE CAR AT A GREAT LOSS. I HAD TO BUY ANOTHER CAR, MY INSURANCE HAS GONE UP DRAMATICALLY AND I AM MORE THAN DISCOURAGED. I WAS TERRIFIED EVERY TIME I DROVE THE CAR I HAD LOVED BEFORE. I CONSTANTLY DROVE WITH ONE HAND ON THE STEERING WHEEL AND THE OTHER HAND ON THE GEAR SHIFT IN CASE IT HAPPENED AGAIN HOPING IT WOULD STOP IT TO SHIFT INTO NEUTRAL. *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/02/2012",
        "dateOfIncident": "03/15/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10442085,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TAMPA FL  THE HEADLIGHTS WILL FLICKER THEN ONE OF THEM WILL SHUT OFF, TURN THE SWITCH ON AND OFF THE LIGHTS WILL COMEBACK ON AND THEN THE OTHER WILL FLICKER AND GO OFF. THIS WILL HAPPEN WHILE DRIVING .I HAVE REPLACED ONE BULB , IT STOPPED FOR ONE DAY THEN THE PROBLEM IS ONGOING,SAME AS THE OTHER POSTINGS ON THIS SIDE, MAYBE A RECALL SHOULD BE PUT IN PLACE,BEFORE SOMEBODY WILL GET HURT DO TO THIS PROBLEM WITH  THE HEADLIGHTS SHUTTING OFF WHILE DRIVING @ NIGHT. THANK YOU.  *TR",
        "vin": "1G6KD57Y36U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/23/2011",
        "dateOfIncident": "11/03/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10441127,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "RIGHT LIGHT FLICKERS THEN WENT OFF. RESET WENT ON AGAIN FOR A WHILE,THEN SAME PROBLEM.  *TR",
        "vin": "1G6KD57Y66U"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/28/2011",
        "dateOfIncident": "07/20/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10433099,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RIGHT HEADLIGHT STARTED GOING ON AND OFF FOR NO REASON.  IT MIGHT GO OFF WHILE DRIVING OR SITTING STILL.  IT MIGHT COME BACK ON IN A FEW MINUTES OR STAY OFF FOR A FULL EVENING.   SOMETIMES TURNING LIGHTS FROM AUTOMATIC TO MANUAL WILL MAKE IT WORK, BUT NOT ALWAYS.  IT HAS BEEN DOING THIS SINCE JULY 2010, OR FOR ABOUT 33,000 MILES.  IT IS DANGEROUS WHEN DRIVING, PLUS I HAVE BEEN PULLED OVER BY POLICE AND SO FAR I HAVE BEEN ABLE TO CONVINCE THEM THE LIGHT HAD JUST GONE OUT THAT EVENING.  NOW I HAVE TO LIMIT MY NIGHT DRIVING NEAR HOME, AS I DO NOT WANT THE SAME OFFICER TO STOP ME.    I HAVE READ MANY FORUMS PLUS YOUR SITE, AND I SEE MANY, MANY PEOPLE WITH THE SAME PROBLEM.  I HAVE CALLED THE CADILLAC CONSUMER COMPLAINT DEPARTMENT AND THEY JUST SAY THEY HAVE NEVER HEARD OF SUCH A PROBLEM.  I TOLD THEM TO CHECK THE INTERNET.  TODAY, I CALLED THE DEALER THAT I BOUGHT IT FROM, OUT OF STATE, 15 MONTHS AGO. I EXPLAINED IT AND HE SAID HE HAS BEEN SELLING THEM FOR 20 YEARS AND HAS NEVER HEARD OF SUCH A PROBLEM.  I TOLD HIM TO CHECK THE INTERNET. I ALSO ASKED HIM TO TRY AND GET ME A NUMBER FOR THE CADILLAC AREA REP, SO I CAN TALK TO HIM.  PLEASE HELP BEFORE I GET A TICKET OR WORSE YET HIT WHILE TURNING LEFT AT NIGHT.  THANK YOU  *TR",
        "vin": "1G6KD57Y76U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/28/2011",
        "dateOfIncident": "01/10/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10433097,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN A 3 OR 4 LANES, EACH WAY, ROAD IN ORLANDO, FLORIDA AT ABOUT 30 MPH WHEN IT DIED.  NO WARNING OR SPUTTER, JUST DIED.  IT HAS HAPPENED OFF AN ON SINCE THAT TIME.  PROBABLY 10 OR 12 TIMES, AS I AM TURNING INTO MY DRIVEWAY, PULLING UP TO A STOP SIGN, OR SLOWING TO MAKE A LEFT TURN IN TRAFFIC.  THIS IS VERY DANGEROUS WHEN TURNING LEFT AND TRAFFIC HEADED TOWARD YOU.  THE CAR DIES INSTANTLY.  IT HAS ALWAYS RE-STARTED SO FAR.   I NOW HAVE 80,000 MILES ON THE CAR, AND I AM AFRAID TO DRIVE ON LONG TRIPS. TRY TO STAY NO FARTHER AWAY THAN ABOUT 100 MILES.  I HAVE SEARCHED ALL SORTS OF FORUMS AS WELL AS YOUR SITE AND THERE ARE MANY, MANY OTHERS WITH THIS PROBLEM.  IN FACT MY NIECE IN MISSOURI HAS ONE THAT HAS STARTED DOING IT ALSO.  I HAVE CALLED CADILLIAC CONSUMER COMPLAINT DEPARTMENT TWICE IN LAST 30 DAYS, AND THEY BLOW ME OFF.  THEY SAY WE CAN NOT BELIEVE WHAT WE READ ON THE INTERNET..  WOW, WHY WOULD PEOPLE SIT AROUND WASTING TIME MAKING UP STORIES??  I KNOW MINE AND MY NIECE'S ARE VERY REAL.  PLEASE HELP AND THANK YOU  *TR",
        "vin": "1G6KD57Y76U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/01/2011",
        "dateOfIncident": "09/01/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10424798,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHTS FLICKER ON AND OFF THEN ONE OR BOTH WILL JUST GO OUT.",
        "vin": "1G6KD57Y16U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/21/2011",
        "dateOfIncident": "11/04/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10407709,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL-THE CONTACT OWNS A 2006 CADILLAC DTS.  THE CONTACT WAS DRIVING 25 MPH WHEN THE DRIVER SIDE HEADLIGHT MALFUNCTIONED INTERMITTENTLY.  THE CONTACT STATED THAT THE VEHICLE WAS UNSAFE TO DRIVE AT NIGHT. THE CONTACT WAS UNCLEAR AS TO WHAT WAS CAUSING THE FAILURE.  THE VEHICLE WAS NOT TAKEN TO THE DEALER FOR INSPECTION OR REPAIRS.  THE FAILURE MILEAGE WAS 85,000.",
        "vin": "1G6KD57Y76U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/10/2011",
        "dateOfIncident": "03/15/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10405897,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 30 MPH THE HEADLIGHTS UNEXPECTEDLY TURNED OFF. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE THE HEADLIGHT BULBS WERE REPLACED. THE FAILURE CONTINUED AFTER THE REPLACEMENT OF THE BULBS. THE CONTACT ALSO STATED THE HEAD LIGHTS WOULD UNEXPECTEDLY FLICKER. THE VEHICLE WAS TAKEN TO ANOTHER INDEPENDENT MECHANIC WHERE THE FAILURE WAS DIAGNOSED. THE CONTACT DID NOT KNOW THE REPAIRS THAT NEEDED TO BE PERFORMED. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 100,000.",
        "vin": "1G6KD57976U"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/28/2011",
        "dateOfIncident": "01/23/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10403628,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SON WAS DRIVING MY CAR FROM JACKSON,MS AND A DEER CAME OUT IN FRONT OF HIM HE TRIED TO MISS THE DEER AND LOST CONTROL OF THE CAR AND IT FLIPED AND WENT INTO SOME TREES AND LANDED UPSIDE DOWN THE STERNING WHEEL  AIRBAG DIDN'T DEPLOY THE CAR WAS TOTAL LOSS.  *TR",
        "vin": "1G6KD57Y86U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/13/2011",
        "dateOfIncident": "10/15/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10400746,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. WHILE DRIVING APPROXIMATELY 30 MPH, THE CONTACT NOTICED THAT BOTH THE DRIVER AND PASSENGER SIDE HEADLIGHTS WERE FLICKERING ABNORMALLY AND SUDDENLY STOPPED FUNCTIONING. THE CONTACT STATED THAT THE FAILURE OCCURRED WHEN DRIVING AT ANY SPEED, INTERMITTENTLY. THE VEHICLE WAS TAKEN TO TWO DIFFERENT INDEPENDENT MECHANICS WHO WERE UNABLE TO DIAGNOSE THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 75,000.",
        "vin": "1G6KD57Y26U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/10/2011",
        "dateOfIncident": "03/01/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10390751,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS AUTOMOBILE HAS AN OIL LEAK THAT COULD CAUSE A FIRE AND GENERAL MOTORS ARE REPAIRING VEHICLES, BUT WILL NOT MAKE A RECALL. THESE AUTOMOBILES ARE CADILLAC, OLDSMOBILE AND BUICK MODELS DATING BACK TO 1993 THROUGH 2008. A BULLETIN # 03-06-01-027 DATED MAY 1, 2008 VERIFIED GM'S KNOWLEDGE OF THE PROBLEM. THERE IS A FAULTY DESIGN BETWEEN THE MOTOR AND OIL PAN IN THESE AUTOMOBILES TO CAUSE THEM TO LEAK SO SOON. PLEASE INVESTIGATE THIS MATTER.     UPDATED  03/10/11  *BF",
        "vin": "1G6KD57Y06U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/10/2011",
        "dateOfIncident": "10/16/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10375482,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 CADILLAC DTS LEFT HEADLIGHTS FLICKER ON AND OFF, TURN ON MANUALLY TO GET THEM BACK ON. SOMETIMES BOTH OF THEM. IT'S VERY DANGEROUS BECAUSE IT HAPPENS WITHOUT WARNING. DEALER SAYS THEY CANNOT DUPLICATE.  *TR",
        "vin": "1G6KD57Y06U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/10/2011",
        "dateOfIncident": "10/01/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10375488,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. THE VEHICLE WAS PARKED AND THE CONTACT ATTEMPTED TO REMOVE THE KEY FROM THE IGNITION BUT WAS UNABLE TO BECAUSE THE BATTERY WAS DEAD. THE CONTACT STATED THAT THE BATTERY WOULD FAIL PREMATURELY APPROXIMATELY EVERY TEN DAYS. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THE TECHNICIAN STATED THAT THE ACCESSORIES ON THE VEHICLE WERE DRAINING THE BATTERY PREMATURELY. THE BATTERY WAS REPLACED BUT THE FAILURE PERSISTED. THE VEHICLE WAS NOT FURTHER REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 50.",
        "vin": "1G6KD57YX6U"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "01/05/2011",
        "dateOfIncident": "12/22/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10374803,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 CADILLAC DTS. WHILE DRIVING APPROXIMATELY 55 MPH, THE CONTACT NOTICED THAT THE LOW TIRE PRESSURE SENSOR DISPLAYED AN INACCURATE READING OF TWENTY THREE POUNDS. THE CONTACT DROVE TO A NEARBY SERVICE STATION TO INFLATE THE TIRE; HOWEVER, THE TIRE WARNING INDICATOR CONTINUED TO READ TWENTY THREE POUNDS. AFTER THE CONTACT REACHED HIS DESTINATION THE TIRE AIR PRESSURE WAS MEASURED BY A TIRE GAUGE WHICH READ FORTY POUNDS. THE FAILURE WAS NOT DIAGNOSED OR REPAIRED. THE FAILURE MILEAGE AND VIN WERE UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/04/2011",
        "dateOfIncident": "05/01/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10374109,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT STATED THAT THE RIGHT HEADLIGHT FAILED INTERMITTENTLY; IT WOULD TURN OFF AND ON. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHILE UNDER WARRANTY AND THE RIGHT HEADLIGHT ASSEMBLY WAS REPLACED BUT THE FAILURE CONTINUED. THE MANUFACTURER OFFERED NO ASSISTANCE. THE VEHICLE HAD NOT BEEN REPAIRED. THE VIN WAS UNAVAILABLE. THE FAILURE MILEAGE WAS APPROXIMATELY 42,000 AND THE CURRENT MILEAGE WAS APPROXIMATELY 68,000.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/03/2011",
        "dateOfIncident": "12/30/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10373997,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT WAS DRIVING APPROXIMATELY 40 MPH WHEN HE CRASHED INTO THE FRONT OF ANOTHER VEHICLE. THE AIR BAGS DID NOT DEPLOY. THE CONTACT AND THE DRIVER OF THE OTHER VEHICLE WERE INJURED AND TRANSPORTED TO THE HOSPITAL VIA AMBULANCE.  A POLICE REPORT WAS AVAILABLE. THE VEHICLE WAS UNABLE TO BE DIAGNOSED DUE TO IT BEING DEEMED AS DESTROYED. THE FAILURE MILEAGE WAS APPROXIMATELY 50,000.",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/01/2011",
        "dateOfIncident": "12/20/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10373698,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 CADILLAC DTS LEFT HAND HEADLIGHT WAS INTERMITTENT AND HAD SIGNS OF WATER INSIDE THE LENS. COMPLETE ASSY. REPLACED  AT DEALER EXPENSE WITHIN 30 DAYS OF VEHICLE PURCHASE. RIGHT HAND LIGHT ASSY HAS NOW BECOME INTERMITTENT AND ALSO SHOWS SIGNS OF WATER INSIDE LENS.  *TR",
        "vin": "1G6KD57Y16U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/28/2010",
        "dateOfIncident": "10/10/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10372624,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "[XXX] FROM MEMPHISTN. 2006 CADILLAC DTS LEFT HEADLIGHTS FLICKER ON AND OFF, TURN ON MANUALLY  TO GET THEM BACK ON. CIGARETTE LIGHTERS SEEM TO WORK WHEN THEY WANT TO. MY CAR PULLS TO THE LEFT FOR NO APPARENT REASON, HAD THE FRONT END CHECKED,NOTHING WAS FOUND WRONG WITH MY FRONT END , HEADLIGHTS WERE CHECKED FOR LOOSE CONNECTION,NOTHING FOUND WRONG BUT THEY CONTINUE TO FLICKER WHEN I DRIVE AT NIGHT, UNTIL I KEEP TURNING THE LIGHT SWITCH ON AND OFF. I HAD THE CIGARETTE LIGHTERS FIXED TWICE, ONLY TO HAVE THE FRONT LIGHTER ON THE CONSOLE TO QUIT WORKING FOR NO APPARENT REASON.      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *TR",
        "vin": "1G6KD57Y56U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/04/2010",
        "dateOfIncident": "02/01/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10369172,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHTS FLICKER AND SHUT OFF EVERYTIME HEAD LIGHT ARE TURNED ON IN AUTOMATIC OR MANUAL MODES. HEADLIGHTS WERE REPLACED AND PROBLEM CONTINUES. BALLAST IS THE NEXT STEP BUT IS VERY EXPENSIVE AND DIFFICULT TO DO.  THIS IS A MANUFACTURING / ENGINEERING CRITICAL PROBLEM.  GM SHOULD BE RESPONSIBLE FOR THIS REPAIR.  YOU PURCHASE A CAR AND EXPECT A CRITICAL ITEM LIKE YOUR HEAD LIGHTS TO WORK PROPERLY EVERYTIME. *TR",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/04/2010",
        "dateOfIncident": "11/25/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10369214,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHTS TURN OFF BY THEMSELVES WITHOUT WARNING. THEY DO COME BACK ON WHEN TURNED ON MANUALLY BUT CONTINUE TO TURN OFF FOR NO APPARENT REASON.  THEY TURN OFF IN NO PARTICULAR ORDER, SOMETIMES ONE OR THE OTHER OR SOMETIMES BOTH OF THEM. IT'S VERY DANGEROUS BECAUSE IT HAPPENS WITHOUT WARNING. *TR",
        "vin": "1G6KD57Y76U"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "11/30/2010",
        "dateOfIncident": "11/25/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10368280,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "SUBJECT 2006 DTS VIN NO  [XXX]  I HAD MY FIRST FLAT TIRE IN ABOUT 15 YRS. I DECIDED TO SAVE TIME AND CHANGE THE TIRE MYSELF. ONCE I JACKED THE CAR UP FAR ENOUGH TO LET WEIGHT OFF THE RIM THE JACK BUCKLED WHICH COULD HAVE BEEN VERY UNSAFE. THANKFULLY I WAS ONLY LEFT STRANDED.  ARE THE QUALITY OF ALL GM JACKS MADE SO POORLY? I CONTACED A FAMILY MEMBER WHO PROVIDED AN ADEQUATE JACK. I AM GLAD I NOR ANYONE ELSE WAS HURT DUE TO THIS JACK FAILURE. I INTEND TO PURCHASE A NEW TROLLEY JACK TO CARRY WITH ME AS A REPLACEMENT FOR THE LESS THAN ACCEPTABLE JACK WHICH CAME WITH THE CAR.   INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "1G6KD57Y26U"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/05/2010",
        "dateOfIncident": "11/03/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10364228,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2006 CADILLAC DTS WITH LESS THAN 30,000 MILES. I JUST HAD TO REPLACE THE BRAKE LINES DUE TO CORROSION AT MY EXPENSE. ALTHOUGH I DID NOT EXPERIENCE ANY BRAKE FAILURE, AS THE VEHICLE SENSORS WARNED THERE WAS A PROBLEM, I FEEL THAT THIS IS A RESULT OF INFERIOR WORKMANSHIP OR MATERIALS AND COULD RESULT IN SERIOUS INJURIES. *TR",
        "vin": "1G6KD57Y16U"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/23/2010",
        "dateOfIncident": "10/13/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10361922,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVERS SIDE AIR BAG DIDN'T DEPLOY IN ACCIDENT.  WHOLE DRIVERS SIDE SMASHED IN AND PERSON WOULDN'T HAVE BEEN INJURED AS BADLY HAD IT GONE OFF LIKE IT WAS SUPPOSED TO. *TR",
        "vin": "1G6KD57Y46U"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/07/2010",
        "dateOfIncident": "10/17/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10359563,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 CADILLAC DEVILLE. THE CONTACT STATED THAT WHILE DRIVING 60 MPH AND APPLYING THE BRAKES, THE FRONT END BEGAN TO SHAKE. THE VEHICLE WAS TOWED TO AN AUTHORIZED DEALER WHERE THE BRAKES PADS WERE REPLACED AND THE ROTORS WERE REFINISHED. AFTER THE REPAIR, THE VEHICLE BEGAN TO SHAKE EVERYTIME THE CONTACT APPLIED THE BRAKES. THE DEALER REPLACED ALL THE BRAKE PADS AND RESURFACED THE ROTORS. THE FAILURE MILEAGE WAS APPROXIMATELY 21,000.",
        "vin": "1G6KD57Y96U"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,VISIBILITY,SEATS,INTERIOR LIGHTING,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "09/20/2010",
        "dateOfIncident": "04/01/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10356544,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "06 CADILLAC DTS HAS HAD SERIOUS ELECTRICAL/COMPUTER SYSTEM FAILURES SINCE NEW.  VEHICLE WILL SUDDENLY LOSE ALL ELECTRONICS, INSTRUMENTS, LIGHTS BUT ENGINE WILL STILL RUN.  AFTER DEALER ATTEMPTED REPAIR, PROBLEMS CONTINUE.  HEADLIGHTS FLICKER AND SOMETIMES GO OUT.  GPS GOES TO NIGHT SCREEN DURING THE DAY.  AUTO HEADLIGHT DIMMER FAILS.  POWER POINTS, INSTRUMENTS, SEATS PERIODICALLY FAIL.  ONE DAY SEAT COOLER WILL WORK, OTHERS IT WON'T.  WINDSHIELD WIPERS AUTOMATIC FUNCTION, \"RAINSENSE\" STARTS NORMALLY BUT THEN STOPS IN HEAVY RAIN REQUIRING MANUAL OPERATION.  ALL ITEMS REPORTED TO DEALER MULTIPLE TIMES WITH THE SAME RESULT \"UNABLE TO DUPLICATE CUSTOMER'S PROBLEM.\"  PROVIDED CELL PHONE VIDEO OF SYSTEM FAILURES BUT DEALER STILL SAYS THEY CANNOT DUPLICATE.  *TR",
        "vin": "1G6KD57Y06U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/15/2010",
        "dateOfIncident": "09/14/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10355739,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT STATED THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER AND REPAIRED FOR A RECALL ASSOCIATED WITH NHTSA CAMPAIGN ID NUMBER 10V240000 (ELECTRICAL SYSTEM). THE CONTACT DISAGREED WITH THE REMEDY PERFORMED ON THE VEHICLE, WHICH CONSISTED OF PERMANENTLY REMOVING THE HEATED WASHER FLUID MODULE WHICH WAS A SAFETY FEATURE EQUIPPED ON THE VEHICLE. THE CONTACT HAD CONCERN OF POTENTIAL SAFETY ISSUES DURING INCLEMENT WEATHER CONDITIONS. THERE HAD NOT BEEN A FAILURE RELATED TO THE RECALL DEFECT.",
        "vin": "1G6KD57Y46U"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/13/2010",
        "dateOfIncident": "12/30/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10355291,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. WHILE THE CONTACT WAS DRIVING APPROXIMATELY 25 MPH, THE TIRE PRESSURE WARNING LIGHT INDICATOR ILLUMINATED. THE VEHICLE WAS TAKEN TO A NEARBY AUTO SERVICE STATION WHERE THE TECHNICIAN DETECTED THAT THE FRONT DRIVER SIDE ALLOY WHEEL RIM EXHIBITED CORROSION WHICH CAUSED A LOSS OF AIR PRESSURE IN THE FRONT DRIVER SIDE TIRE. THE WHEEL RIM WAS CLEANED. THE TIRE WAS RE- MOUNTED AND RE-BALANCED. THE IDENTICAL FAILURE WOULD OCCUR EVERY THREE MONTHS ON A DIFFERENT WHEEL RIM. THE CONTACT STATED THAT ALL FOUR ALLOY WHEELS WERE REPAIRED OVER A PERIOD OF TIME.  THE FAILURE MILEAGE WAS 18,000.     UPDATED 12/21/10*BF  UPDATED 12/29/10.*JB",
        "vin": "1G6KD57Y16U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/24/2010",
        "dateOfIncident": "07/17/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10345029,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLAMP INTERMITTENTLY FLICKERS AND THEN EVENTUALLY GOES OUT AND STAYS OUT. HEADLAMP COMES BACK ON IF SWITCH IS MANUALLY TURNED OFF OR IF VEHICLE IS SHUT OFF AND RESTARTED.  DEALER DID NOT DO ANYTHING TO CORRECT PROBLEM BECAUSE LIGHTS WERE WORKING WHEN VEHICLE WAS BROUGHT INTO SHOP. I ASKED THAT LAMP BE REPLACED, BUT DEALER REFUSED AND STATED THERE WERE NO COMPLAINTS  OR SERVICE BULLETINS ABOUT THIS ISSUE. THERE ARE TONS OF COMPLAINTS ON THE INTERNET ABOUT 2006 DTS HID LIGHTS OR BALLAST FAILING. THE VEHICLE HAS A SHORT WARRANTY TIME LEFT SO I FEEL THAT AT LEST THE BULB SHOULD BE REPLACED AS IT IS THE MOST LIKELY CAUSE.  THE SERVICE DEPARTMENT DID NOT DOCUMENT THE PROBLEM OR STATE WHAT WAS DONE. I HAVE CALLED BACK AND ASK THAT THEY  SEND ME DOCUMENTATION AND STATE WHAT WAS DONE TO FIX MY ISSUE. *TR",
        "vin": "1G6KD57Y46U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/22/2010",
        "dateOfIncident": "03/30/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10344781,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 CADILLAC DTS. WHILE DRIVING APPROXIMATELY 62 MPH THE CONTACT STATED THAT ALL OF THE LIGHTS ON THE DASHBOARD ILLUMINATED. HE ALSO STATED THAT HE DROVE INTO A SERVICE STATION AND TURNED THE VEHICLE OFF.  HE ATTEMPTED TO RESTART THE VEHICLE BUT IT WOULD NOT RESTART. THE VEHICLE WAS TOWED TO AN AUTHORIZED DEALER. THE DEALER WAS UNABLE TO DUPLICATED THE FAILURE. THE FAILURE OCCURRED AGAIN AND WHEN THE CONTACT WAS IN ANOTHER STATE. THE VEHICLE WAS NOT TAKEN TO THE DEALER A SECOND TIME. THE APPROXIMATE FAILURE MILEAGE WAS 42,000. THE CURRENT MILEAGE WAS 46,000.",
        "vin": "1G6KD57Y56U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/13/2010",
        "dateOfIncident": "07/07/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10342908,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS. WHILE DRIVING AT 55 MPH, THE VEHICLE BEGAN TO LOSE POWER BUT DID NOT STALL. THE DEALER ADVISED THE CENTRAL COMPUTER WAS DEFECTIVE AND WAS FAILING. THE DEALER MADE UNKNOWN REPAIRS TO THE VEHICLE. THE FAILURE MILEAGE WAS 5,000 AND CURRENT MILEAGE WAS 23,100.",
        "vin": "1G6KD57Y26U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/08/2010",
        "dateOfIncident": "07/08/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10342070,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 CADILLAC DTS. THE CONTACT STATED THAT THE LEFT HEADLIGHT ON THE VEHICLE WAS NOT WORKING. THE DEALER INFORMED THE CONTACT THAT THE REPLACEMENT FOR THE HEADLIGHT WOULD COST APPROXIMATELY $700.00.  THE FRONT PASSENGER SIDE HEADLIGHT WAS PREVIOUSLY REPLACED AT HIS INSURANCE COMPANIES EXPENSE. CADILLAC WAS NOT NOTIFIED. THE HEADLIGHT WILL BE REPLACED AT THE OWNERS EXPENSE.  THE FAILURE MILEAGE AND CURRENT MILEAGES WERE 50,000.  THE VIN WAS UNKNOWN.",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "06/30/2010",
        "dateOfIncident": "06/30/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10340760,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ON RECALL 10153, I CONSIDER THE WASHER HEATER A SAFETY COMPONENT SINCE THE DEFROSTERS ARE WEAK AND I FEEL THEY SHOULD FIND A FIX FOR THIS RATHER THAN REMOVING IT FROM THE CAR. *TR",
        "vin": "1G6KD57Y76U"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/12/2010",
        "dateOfIncident": "06/01/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10325114,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 CADILLAC DTS. WHILE THE CONTACT WAS DRIVING APPROXIMATELY 15 MPH A SQUEAKING NOISE WAS COMING FROM THE STEERING WHEEL. THE FAILURE WOULD NOT OCCUR WHENEVER THE VEHICLE WAS TRAVELING AT A HIGHWAY SPEED. THE VEHICLE HAD BEEN TAKEN TO THE DEALER ON NINE SEPARATE OCCASIONS FOR THE IDENTICAL FAILURE. THE STEERING VALVE AND STEERING GEAR WERE REPLACED FOR THE MALFUNCTION. ADDITIONALLY, THE FRONT PASSENGER TIRE EXHIBITED SEVERE DEFECTS AND WAS REPLACED AT 20,000 MILES. THE FAILURE CONTINUED TO OCCUR. THE DEALER WAS UNABLE TO PROVIDE OTHER RESOLUTIONS TO ADDRESS THE PROBLEM. THE FAILURE MILEAGE WAS 17,386. THE CURRENT MILEAGE WAS 48,881. UPDATED 06/02/10. *LJ  THE VEHICLE WOULD PULL TO THE RIGHT. THE POWER STEERING PUMP WAS REPLACED. UPDATED 10/12/10",
        "vin": "1G6KD57YX6U"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "04/12/2010",
        "dateOfIncident": "04/12/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10325221,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 CADILLAC DTS. THE VEHICLE WAS PARKED WHEN THE CONTACT OBSERVED THAT THE SUPPORT ARM WHICH SECURED THE HOOD IN AN UPRIGHT POSITION FAILED TO FUNCTION. AN AUTHORIZED DEALER WAS NOTIFIED OF THE MALFUNCTION. THE TECHNICIAN STATED THAT THE FAILURE OCCURRED EXTREMELY EARLY AT RELATIVELY LOW MILEAGE, AND STATED THAT THE PART WOULD BE REPLACED. THE FAILURE AND CURRENT MILEAGES WERE 44,000.",
        "vin": "1G6KD57946U"
    },
    {
        "components": "EXTERIOR LIGHTING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/19/2010",
        "dateOfIncident": "09/27/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10321031,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CADILLAC DTS.  THE CONTACT STATED THERE IS AN INTERMINTENT ISSUE WITH THE HEADLIGHT AND DASHBOARD INSTRUMENT PANEL.THEY GO INTO THE NIGHTTIME MODE IN THE DAYTIME AND IT IS VERY HARD TO SEE THE DASHBOARD WHEN DRIVING.  THE CONTACT STATED THAT THE DASHBOARD INSTRUMENT PANEL GOES INTO NIGHT MODE WHEN STARTING THE ENGINE AS WELL. THE CONTACT STATED THAT THE VEHICLE HAD BEEN TAKEN TO THE DEALER  FOR DIAGNOSTIC AND TESTING TWENTY TIMES,  IN REGARDS TO THE EXTERIOR LIGHTING AND ELECTRICAL SYSTEM.  THE DEALER WAS ABLE TO DUPLICATE  HEADLIGHT FAILURE, HOWEVER NO REPAIRS HAD BEEN MADE TO THE VEHICLE AT THE TIME OF THE COMPLAINT.THE APPROXIMATE FAILURE MILEAGE WAS 800. THE APPROXIMATE CURRENT MILEAGE WAS 15000.",
        "vin": "1G6KD57Y26U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/27/2010",
        "dateOfIncident": "01/31/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10314767,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6)    MY 2006 CADILLAC DTS [XXX] HAS AN INTERMITTENT HID HEADLIGHT PROBLEM THAT OCCURS IN COLDER TEMPERATURES.  THE LAMPS WILL FLICKER AND ONE OR THE OTHER WILL GO OUT.  THE ONLY WAY TO GET THE HEADLIGHT TO COME ON AGAIN IS TO TURN OFF THE HEADLIGHTS AND TURN THEM ON AGAIN.  THE VEHICLE HAS BEEN IN TO THE LOCAL CADILLAC DEALER, AND IS IN THERE NOW, BUT THEY DON'T SEEM TO BE ABLE TO FIX THE PROBLEM.  ALSO, THE RIGHT TAILLIGHT/BRAKELIGHT/TURNSIGNAL WILL OCCASIONALLY GO OUT COMPLETELY.  THE SIDE-MARKER LED LIGHTS STILL ILLUMINATE, BUT THE REST OF THE LIGHT ASSEMBLY GOES DARK AND THE TURN SIGNAL IN THE BACK DOESN'T WORK.  THIS ALSO HAPPENS IN COLD WEATHER.  THE DEALER HASN'T BEEN ABLE TO FIX THIS PROBLEM EITHER.  SIMILAR PROBLEMS ARE BEING DOCUMENTED IN THE CADILLAC OWNERS FORUM ONLINE. *TR",
        "vin": "1G6KD579X6U"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/17/2010",
        "dateOfIncident": "05/18/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10311345,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2006 CADDILLAC DTS. THERE IS AN INTERMINTENT ISSUE WITH THE HEADLIGHT AND DASHBOARD. THEY SOMETIMES GO INTO THE NIGHTTIME MODE IN THE DAYTIME AND IT IS VERY HARD TO SEE THE DASHBOARD WHEN DRIVING. I' SEARCHED GOOGLE AND FOUND THAT OTHER PEOPLE HAVE THE SAME ISSUE. GM TOLD ME THEY HAVE NO FIX FOR THIS AND IT IS NOT A BIG ISSUE. SINCE THEY ONLY HAVE FEW COMPLAINTS.THEY DI D FIX THIS IN THE 2007 MODEL BUT THEY SAY EVEN THOUGH IT IS THE SAME MODEL AND BODY THEY CANNOT DO ANYTHING.  YOU ALSO CANNOT USE THE FLASH YO PASS HEADLIGHT IN THE DAYTIME.IT ONLY WORKS IN THE NIGHT MODE. *TR",
        "vin": "1G6KD57Y26U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/12/2010",
        "dateOfIncident": "02/11/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10308858,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A PERIODIC PERSISTENT STALLING PROBLEM WITH MY 2006  CADILLAC DTS THAT THE DEALER HAS BEEN UNABLE TO RESOLVE FROM ABOUT 60,000 MILES.  THE CAR SOMETIMES JUST STALLS OUT WHILE AT A RED LIGHT OR A STOP. THIS IS A DANGEROUS SITUATION WITH MY 2006 CADILLAC DTS. THE DEALER HAS BEEN UNABLE TO RESOLVE THIS ISSUE SINCE IT BEGAN AT ABOUT 60,000 MILES.  IS THIS AN UNSAFE MANUFACTURER DEFECT IN THESE CARS? *TR",
        "vin": "1G6KD57Y36U"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/05/2010",
        "dateOfIncident": "11/16/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10306230,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS HAPPENED 6 TIMES. MY ENGINE SPEED WOULD NOT DROP AFTER FOOT REMOVED FROM ACCELERATOR. 4 OF THE SIX TIMES WAS ON FREEWAY EXIT RAMP. I VERIFIED THAT THE FLOOR MAT WAS NOT IN ANY WAY INTERFERING AFTER THE FIRSTIME THIS HAPPENED. I CONTACTED MY DEALER  3 TIMES - CENTRAL CADILLAC, AND THEY SAID THEY CHECKED AND FOUND NOTHING WRONG AND THAT IT MUST HAVE BEEN MY FLOOR MAT. I KNOW IT WAS NOT!    I DON'T BELIEVE THIS TO BE CRUISE CONTROL RELATED AS IT HAPPENED IN CITY TRAFFIC TWICE. WHEN EXITING THE FREEWAY AFTER BRAKING TO STOP ENGINE WOULD STAY AT 1800 RPM TO 2300 RPM DEPENDENT ON OCCASION. THE SAME RPM RANGE WAS IN CITY ALSO.   *TR",
        "vin": "1G6KD579X6U"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/16/2009",
        "dateOfIncident": "11/21/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10296111,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AN EXAMPLE OF THE CRUISE CONTROL CONCERN IS AS FOLLOWS; IF THE CRUISE CONTROL HAS BEEN ENGAGED AT SOME SPEED,LETS SAY 40 MPH AND THEN DISENGAGED AND THE CAR DECELERATES TO SAY ABOUT 30MPH THEN ENGAGE THE CRUISE CONTROL AGAIN  INSTEAD OF SMOOTHLY ACCELERATING BACK UP TO THE PREVIOUSLY SET 40 MPH THE CAR ABRUPTLY ACCELERATES AND SOMETIMES DOWNSHIFTS AND THE SPEED CAN GO UP TO 45 OR 50 MPH BEFORE IT SETTLES BACK DOWN TO THE PRESET 40MPH.THIS SEEMS TO BE A VERY RANDOM OCCURRENCE AND CANNOT BE ALWAYS DUPLICATED. THE SPEEDS AT WHICH THIS CAN OCCUR ARE VARIED.   THIS UNEXPECTED ACCELERATION CAN BE VERY UPSETTING AND I BELIEVE IN SOME SITUATIONS MAY EVEN PRESENT A DANGEROUS SITUATION. *TR",
        "vin": "1G6KD57Y76U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/04/2009",
        "dateOfIncident": "12/04/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10294523,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A USED 2006 CADILLAC DTS IN OCTOBER OF '06.  IN THE SPRING OF 2009, THE HEADLIGHTS ON SAID VEHICLE BEGAN TO FLICKER.  I THOUGHT IT WAS A BAD HEADLAMP.  I TOOK IT TO A MECHANIC AND THEY COULD NOT DUPLICATE THE PROBLEM TO DETERMINE WHY THIS WAS HAPPENING.  I'VE BEEN DRIVING THE VEHICLE FOR 8 - 9 MONTHS SINCE THIS PROBLEM STARTED AND NOW ONE HEADLIGHT OR THE OTHER OR SOMETIMES BOTH WILL GO OUT.  TOOK IT BACK TO THE MECHANIC AND IT WAS DETERMINED AFTER 4 HOURS OF TESTING THAT THE BALLASTS IN THE HEADLIGHT UNIT ARE BOTH BAD CAUSING THE HEADLIGHTS TO DO THIS.  REPAIR COST AT A NON-GM MECHANIC WAS $1700 - $2000.  A GM CERTIFIED MECHANIC VERIFIED THE PROBLEM AND REPAIR COST WILL BE $1403.82.  THIS IS TO REPLACE THE BALLASTS, HEADLAMPS AND THE LABOR COSTS.  I FEEL THIS IS A RIDICULOUS COST FOR REPAIR OF HEADLIGHTS, BUT HAVE ORDERED PARTS AND HOPEFULLY WILL HAVE MY CAR REPAIRED NEXT WEEK.  THIS IS VERY UNSAFE, AS I CAN BE DRIVING DOWN THE ROAD AT NIGHT AND HAVE MY HEADLIGHTS JUST SHUT OFF.  THE ONLY WAY TO GET THE HEADLIGHTS BACK ON IS TO TURN THEM OFF AND BACK ON, BUT EVEN THEN IT ONLY WORKS FOR A SHORT PERIOD OF TIME BEFORE REPEATING THE SAME PROBLEM.  IN RESEARCHING THIS, I HAVE SEEN OTHER INTERNET POSTS FROM CADILLAC OWNERS EXPERIENCING SIMILAR ISSUES WITH THE HEADLIGHTS.  I DID COMPLAIN TO GM/CADILLAC AND THEY ARE OFFERING TO COVER 25% OF THE REPAIR COSTS.  IN THE INTERIM, I HAVE BEEN PULLED OVER BY POLICE FOR HAVING HEADLIGHTS NOT WORKING AND I HAVE NOT EVEN BEEN AWARE THAT THEY HAD GONE OUT WHILE I'VE BEEN DRIVING. *TR",
        "vin": "1G6KD57Y56U"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/02/2009",
        "dateOfIncident": "09/01/2009",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10282703,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 CADILLAC DTS. WHILE DRIVING 75 MPH A FUSE WHICH CONTROLS THE ECM BURNED OUT AND DISABLED THE ENGINE THREE TIMES. THE DEALER REPROGRAMMED THE ECM; HOWEVER, THE FAILURE CONTINUED TO OCCUR. THE CONTACT STATED THAT THIS WAS A SAFETY ISSUE SINCE THERE WERE NO PRIOR WARNINGS WHEN THE VEHICLE SHUT OFF WHILE DRIVING. THE CURRENT MILEAGE WAS 70,000 AND THE FAILURE MILEAGE WAS 59,000.",
        "vin": "1G6KD57Y76U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/04/2009",
        "dateOfIncident": "07/07/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10279370,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING HOSE CONNECTION FAILED, GM REFUSED TO FIX RECALL (NHTSA CAMPAIGN ID NUMBER 06V105000), THEY SAID THAT MY \"VIN\" WAS NOT APART OF THE RECALL, ONLY ON UNITS BUILT FROM DEC 06 THROUGH FEB 06, MY CAR WAS BUILD IN MAR 06.... DEALER SAID THAT THIS IS THE FAULTY PART... PAID 519.49 FOR THE FIX AND 110.00FOR A TOW... WERE AFRAID TO DRIVE MIGHT START ENGINE FIRE.... GM SHOULD RECALL ALL OF THESE CARS WITH FAULTY HOSES. *TR",
        "vin": "1G6KD57Y36U"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/16/2009",
        "dateOfIncident": "03/06/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10261951,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 CADILLAC DTS INVOLVED IN MODERATE FRONT END CRASH. AIR BAGS DID NOT DEPLOY AND ONSTAR'S AUTOMATIC CRASH RESPONSE DID NOT ACTIVATE. *TR",
        "vin": "1G6KD57Y26U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/20/2009",
        "dateOfIncident": "01/08/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10259435,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 CADILLAC DTS.  THE CONTACT TOOK HIS VEHICLE TO THE DEALER TO HAVE IT REPAIRED ACCORDING TO NHTSA CAMPAIGN ID NUMBER 08V441000 (ELECTRICAL SYSTEM).  HE STATED THAT THERE WAS A RECALL FOR THE THIRD BRAKE LIGHT, BUT THE PARTS FOR THE REPAIR WERE UNAVAILABLE.  THE VEHICLE HAS NOT YET BEEN REPAIRED ACCORDING TO THE RECALL.  CURRENTLY, THE THIRD BRAKE LIGHT IS FRACTURED AND THE BRAKE LIGHT DOES NOT ILLUMINATE WHEN BRAKING.  THE FAILURE MILEAGE WAS 38,917 AND CURRENT MILEAGE WAS 40,000.  UPDATED 3/16/09 *CN  THE CONSUMER STATED THE PROBLEM HAS BEEN CORRECTED.UPDATED 03/19/09.*JB",
        "vin": "1G6KD57Y26U"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/18/2009",
        "dateOfIncident": "01/01/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10259292,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 CADILLAC DTS - BRAKES SHUDDER WHEN TRAVELING DOWN STEEP GRADES.  MANUFACTURE HAS TSB ON THIS, WITH LARGER BRAKE PADS.  BUT THEY ARE UNWILLING TO COVER THIS UNDER THEIR BUMPER TO BUMPER WARRANTY. *TR",
        "vin": "1G6KD57Y26U"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/20/2009",
        "dateOfIncident": "04/16/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10255712,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 CADILLAC DTS.  WHILE DRIVING VARIOUS SPEEDS, THE CONTACT WOULD SPORADICALLY HEAR A LOUD GROWLING NOISE COMING FROM THE FRONT DRIVER'S SIDE OF THE VEHICLE.  HE TOOK THE VEHICLE TO THE DEALER AND THEY REPLACED THE DIFFERENTIAL COURIER.  IMMEDIATELY AFTER THE REPAIR, THE FAILURE RECURRED.  THE DEALER STATED THAT THEY WERE AWARE OF THE FAILURE, BUT COULD NOT DETERMINE THE CAUSE OR PROVIDE A REMEDY.  THE FAILURE MILEAGE WAS 16,000 AND CURRENT MILEAGE WAS 23,000.",
        "vin": "1G6KD57Y06U"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ELECTRICAL SYSTEM,TIRES",
        "crash": false,
        "dateComplaintFiled": "12/17/2008",
        "dateOfIncident": "12/30/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10252428,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 CADILLAC DTS HAS HAD SEVERAL PROBLEMS FROM DAY ONE.  *NJ  THE DAY THE CONSUMER DROVE THE VEHICLE OFF THE LOT, THE TIRE PRESSURE MONITOR LIGHT ILLUMINATED. THE VEHICLE WOULD NOT START AFTER SITTING IN THE CARPORT OVERNIGHT. ROADSIDE ASSISTANCE REPLACED THE BATTERY. 3 MONTHS LATER THE VEHICLE FAILED TO START AGAIN. THE VEHICLE HAS BEEN TO THE DEALER SEVEN TIMES FOR BRAKING PROBLEMS. THE CONSUMER STATED EVERY TIME HE APPLIED THE BRAKES, THE ENTIRE VEHICLE VIBRATED/SHIMMIED AND WHEN HE RELEASED THE BRAKES, THE NOISE STOPPED.  *JB",
        "vin": "1G6KD57Y36U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/29/2008",
        "dateOfIncident": "09/01/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10243748,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 CADILLAC DTS RECALL NOTICE FOR WASHER FLUID HEATER.  CONSUMER HAVE QUESTIONS ABOUT CHANGES TO THE OWNERS MANUAL AND HOW WILL THE OWNER KNOW IF WASHER FLUID HEATER WILL WORK AFTER THE REPAIRS.   *NJ",
        "vin": "1G6KD57Y36U"
    },
    {
        "components": "ELECTRICAL SYSTEM,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "08/27/2008",
        "dateOfIncident": "07/28/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10240410,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 CADILLAC DTS HAS PROBLEMS WITH THE COLLISION AVOIDANCE WARNING SENSORS.  CONSUMER STATES THAT THE PROBLEMS ARE ONGOING AND BELIEVE THAT GM SHOULD BUY THE VEHICLE BACK.  *NJ  THE CONSUMER STATED THE WARNING SENSORS FAILED TWICE. THE CONSUMER STATED THE FAILURE OF THE WARNING SENSORS, RESULTED IN TWO MINOR ACCIDENTS.*JB",
        "vin": "1G6KD57Y96U"
    },
    {
        "components": "STEERING,TIRES",
        "crash": false,
        "dateComplaintFiled": "06/17/2008",
        "dateOfIncident": "06/16/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10231407,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "CONTINENTAL TOURINGCONTACT AS",
                "productYear": "9999",
                "size": "205/65R15",
                "type": "Tire"
            }
        ],
        "summary": "2006 CADILLAC DTS WITH 23,000 MILES ON IT AND AT A STAND STILL AND WHEN COMING UP TO A STOP AND MAKING A TURN THERE IS A DEFINITE CLICK OR KNOCK IN THE FRONT WHEELS OR STEERING COLUMN THAT YOU CAN ACTUALLY FEEL. EVEN WHEN SITTING STILL YOU JUST TURN THE WHEEL A LITTLE BIT BACK AND FORTH AND THERE IS KNOCK THAT CAN BE FELT. HAVE REPORT TO LOCAL CADILLAC DEALER AND TOLD NOTHING CAN BE DONE AND TO LIVE WITH IT.  TRIED ANOTHER DEALER SHIP 45 MILES AWAY AND THEY HEARD THE NOISE ALSO AND CANNOT FIGURE WHERE IT COMES FROM THEN TRIED 3 OTHER CARS IN LOT OF SAME VINTAGE AND THE ONES WITH MORE MILES ON THEM HAD THE SAME NOISE. I WOULD EXPECT THAT FROM A LESS EXPENSIVE CAR BUT NOT A CADILLAC. ALSO HAVE A TIRE NOISE THAT CADILLAC AND CONTINENTAL TIRE SAID IS NORMAL. BUT THIS IS EMBARRASSING WHEN YOU PULL UP TO STOP OR DRIVING AT LOW SPEEDS YOU CAN HEAR NOISE LIKE A SQUEAK OR RUBBING NOISE LIKE THE BRAKE PADS ARE RUBBING. TOLD THIS IS COULD BE THE DESIGN OF THE TIRES, BUT HAVE NO PROOF AND CADILLAC FIELD REP WOULD NOT GIVE ME THE PLEASURE OF TALKING TO HIM, I HAD TO DISCUSS THROUGH A 3RD PARTY THAT DID NOT UNDERSTAND THE ISSUES AND I WAS BY HIM THAT THE REP DO NOT TALK TO CUSTOMERS THEY ONLY GIVE THEIR OPINION TO THE 3RD PARTY AND THEY IN TURN PASS INFO ON TO CUSTOMER. NOT SURE WHAT A CUSTOMER FIELD REP DOES IF HE DOES NOT TALK TO A CUSTOMER, THEY SHOULD CHANGE THEIR TITLE THEN. AM NOW FEARFUL THAT WITH THE TIRE ISSUES AND THE STEERING CLUCKING THAT THIS COULD LEAD TO PARTS FAILURE OR ACCIDENT LEADING TO A DEATH ETC.  *TR",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": true,
        "dateComplaintFiled": "04/22/2008",
        "dateOfIncident": "04/01/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10226151,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 CADILLAC DTS DRIVER SIDE MIRROR DOES NOT EXTEND OUT FAR ENOUGH TO ELIMINATE A BLIND SPOT AND AT THE SAME TIME UP FAR ENOUGH TO SEE ANY DISTANCE BEHIND HIM. *CW  THE CONSUMER ALSO STATED IF HE ELIMINATES THE BLIND SPOT, HE CAN NOT SEE TRAFFIC IN ORDER TO MERGE ONTO THE HIGHWAY.  THE CONSUMER STATED ON ONE OCCASION, HE BACKED INTO A SMALL PICKUP TRUCK AND DAMAGED HIS LEFT REAR BUMPER. *JB",
        "vin": "1G6KD57Y76U"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/30/2008",
        "dateOfIncident": "07/09/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10217168,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 CADILLAC DTS SWITCHING LANES WHEN STEERING WHEEL IS RELEASED. CONSUMER STATES THAT THE VEHICLE HAS SWITCHED LANES ON THE HIGHWAY AT 60 OR MORE MPH. HE ALSO STATES THAT THE VEHICLE PULLS HARD TO THE LEFT.  *KB  THE CONSUMER HAS TAKEN THE VEHICLE TO THE DEALER FOR SEVERAL ALIGNMENTS, BUT THE PROBLEM REMAINED THE SAME. *JB",
        "vin": "1G6KD57Y06U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/03/2007",
        "dateOfIncident": "12/03/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10210654,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHTS STOP WORKING ON OUR SEDAN FLEET. THE HIGH INTENSITY HEADLIGHTS WILL JUST STOP WORKING. WE HAVE HAD THIS HAPPEN ON EIGHT OF OUR CARS SO FAR. IT IS NOW STARTING TO REOCCUR ON THE CARS. THEE IS A PROBLEM WITH THE HIGH INTENSITY BALLAST ASSEMBLY. WE HAVE TWO ADDITIONAL CARS THAT HAVE TO GO BACK TO THE DEALER THIS MORNING, WITH A CAR AT THE DEALER NOW FOR THE SAME PROBLEM. THE VEHICLES STARTED FAILING AT ABOUT 25,000 MILES AND IT IS A CONSTANT OCCURRENCE.  *TR",
        "vin": "1G6KD57YX6U"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "12/03/2007",
        "dateOfIncident": "01/14/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10210651,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 CADILLAC DTS.  THE FRONT WINDSHIELD HAS LINES GOING ACROSS THE WINDSHIELD.  THE LINES WERE WAVY AND CAUSED BLURRY VISION.  THE DEALER STATED THAT THE FAILURE WAS CAUSED BY HIGH MILEAGE AND FREQUENT WASHING OF THE VEHICLE.  THE FAILURE MILEAGE WAS 25,000 AND CURRENT MILEAGE WAS 51,376.  UPDATED 12/31/07",
        "vin": "1G6KD57Y36U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/20/2007",
        "dateOfIncident": "12/16/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10209519,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 CADILLAC DTS.  THE CONTACT STATED THAT HER VEHICLE WOULD OCCASIONALLY FAIL TO START.  THE FAILURE HAS OCCURRED NUMEROUS TIMES AND THE BATTERY HAS BEEN CHANGED TWICE.  THE VEHICLE WAS TAKEN TO THE DEALER FOR SERVICE, BUT THE FAILURE CONTINUES.  THE CURRENT AND FAILURE MILEAGES WERE 1,000.  UPDATED 01-30-08.  *KB  UPDATED 01/18/08  *TR",
        "vin": "1G6KD57Y26U"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/20/2007",
        "dateOfIncident": "08/01/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10200110,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 CADILLAC DTS.  THE CONTACT STATED THAT THE STABILITY CONTROL SERVICE LIGHT CONTINUOUSLY ILLUMINATES.  IN ORDER FOR IT TO DIM, HE MUST SHUT OFF AND RESTART THE VEHICLE.  THE ON-STAR FUNCTION STATED THAT THE VEHICLE IS DRIVABLE, BUT NEEDS TO BE TAKEN TO THE DEALER.  THE VEHICLE HAS BEEN TO THE DEALER BETWEEN 8-10 TIMES AND THEY CLAIMED TO HAVE REPAIRED THE FAILURE.  HOWEVER, THE FAILURE ALWAYS RECURS WITHIN 15 MILES OF LEAVING THE DEALER.  THE CURRENT MILEAGE WAS 29,611 AND FAILURE MILEAGE WAS 9,087.",
        "vin": "1G6KD57Y26U"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/13/2007",
        "dateOfIncident": "04/18/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10196311,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PLASTIC UNDERCARRIAGE COVER BEGAN DRAGGING ON THE GROUND. I PLACED DUCK TAPE ON IT IN ORDER TO GET IT TO THE DEALER. THE DEALER REMOVED THE TAPE AND REFASTENED ONE OF THE PLASTIC BOLTS AND SAID IT HAD BEEN HIT WITH SOMETHING SO THE WARRENTLY WOULD NOT COVER IT. I AM THE ONLY DRIVER AND  I DID  NOT HIT ANYTHING. BEFORE I GOT  HOME IT WAS DRAGGING AGAIN. PART OF IT HAD TO BE CUT OFF BECAUSE IT WAS SO TORN UP AND MANY OF THE BOLTS WERE LOST. WE ULTIMATELY HAD TO WIRE IT ON TO HOLD IT UP.",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM,STRUCTURE,TIRES,SEATS",
        "crash": false,
        "dateComplaintFiled": "07/11/2007",
        "dateOfIncident": "07/01/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10196926,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 CADILLAC DEVILLE CONSOLE DESIGN IS FAULTY, CARS SLIDES WHEN MAKING SHARP TURN.  THE CONSUMER STATED WHILE TRYING TO START THE VEHICLE, THE VEHICLE WOULD NOT START AND WOULD NOT LET HIM PULL THE KEY OUT OF THE IGNITION. THE CONSUMER STATED THAT THE CONSOLE IS IN THE WAY,  IT IS LOCATED ON THE WRONG SIDE OF THE CAR , THEREFORE MAKING IT DIFFICULT SO  THAT THE RIGHT DRIVING FOOT GETS CAUGHT WHILE OPERATING THE VEHICLE. THE CONSUMER STATED THE GAS TANK CAP IS DIFFICULT TO OPEN AND THE CONSUMER BEING SO TALL HE WOULD HAVE TO BRING AN OBJECT ALONG TO CLOSE THE DOOR SO HE WOULD NOT  FALL OUT OF THE VEHICLE. ALSO, THE CONSUMER STATED THAT THE VEHICLE IS SLIDING WHILE MAKING A SLIGHT TURN AND THE LEATHER SEATS GET REALLY HOT WHILE CONSUMER IS DRIVING.  *TR",
        "vin": "1G6KD57Y96U"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/09/2007",
        "dateOfIncident": "07/07/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10195673,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 CADILLAC DTS.  WHILE THE CONTACT WAS DRIVING, A LARGE PLASTIC PIECE DETACHED FROM THE UNDERCARRIAGE AND DRAGGED ON THE GROUND.  AS A RESULT, HE HAD TO TEAR THE PIECE OFF.  HE TOOK THE VEHICLE TO THE DEALER WHO STATED THAT THE FRONT ENGINE SPLASH SHIELD DETACHES OFTEN AND COULD NOT BE REPAIRED.  THE CURRENT AND FAILURE MILEAGES WERE 20,000.",
        "vin": "1G6KD57Y66U"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/13/2007",
        "dateOfIncident": "06/06/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10193121,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "CRUISE CONTROL DOES NOT MAINTAIN SPEED DOWNHILLS WITHIN REASON. FREEWHEEL ON ALL DOWNHILL GRADE AS FAST AS GRAVITY ALLOWS. EASILY CAN GO 15-20 OVER SET SPEED ON NORMAL HIGHWAY CONDITIONS. FIRST VEHICE OWNED WITH THIS CONDITION. POTENTIAL SAFETY AND SPEEDING TICKET PROBLEM. DEALER STATES THATS THE WAY IT IS. FIX IS DON'T USE CRUISE WHEN THERE ARE HILLS PER OWNERS MANUAL.*AK",
        "vin": "1G6KD57Y86U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/29/2007",
        "dateOfIncident": "04/29/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10189210,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "IN LESS THAN A YEAR THIS CAR HAS HAD THE BATTERY GO DEAD. CAR WOULDN'T START. *TR",
        "vin": "1G6KD57Y46U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/13/2007",
        "dateOfIncident": "10/13/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10187810,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEADLIGHTS FLASH-TO-PASS FEATURE ONLY FUNCTIONED ON 20'06 CADILLAC DTS WHEN THE HEADLIGHTS  WERE TURNED ON. ALSO, ON ALL OF MY PREVIOUS AUTOMOBILES  THE HEADLIGHTS WOULD ILLUMINATE AND FLASH-TO-PASS EVEN THOUGH THE HEADLIGHTS WERE NOT TURNED ON AT THE TIME.  I DEMONSTRATED  THIS TO THE DEALER, AND HE TRIED IT ON A SIMILAR VEHICLE AND IT DID NOT WORK EITHER.  I CONSIDER THIS AN IMPORTANT SAFETY FEATURE AND WOULD USE IT FREQUENTLY.*AK",
        "vin": "1G6KD57Y16U"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/28/2007",
        "dateOfIncident": "04/19/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10186352,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 CADILLAC DTS.  AT APPROXIMATELY 55 MPH THE VEHICLE ACCELERATED WHILE DRIVING DOWNHILL AND UTILIZING THE CRUISE CONTROL.  THE CONTACT STATED THAT THE VEHICLE MUST BE DOWNSHIFTED IN ORDER FOR IT TO REGAIN NORMAL SPEED.  THE CONTACT HAD TAKEN THE VEHICLE TO THE DEALER SEVERAL TIMES.  THE DEALER PERFORMED A DIAGNOSTIC AND  FOUND  NOTHING WRONG WITH THE VEHICLE.  THE DEALER STATED THAT THE FAILURE WAS DUE TO THE VEHICLE'S DESIGN.  THE FAILURE MILEAGE WAS 80, THE CURRENT MILEAGE WAS 14,800.*AK",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/22/2007",
        "dateOfIncident": "02/13/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10183259,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 CADILLAC DTS, MILEAGE APPROX. 7,000.  SUDDEN, TOTAL FAILURE OF LOWER CONTROL ARM.  MY FATHER WAS DRIVING THE VEHICLE AT LOW SPEED IN A RESIDENTIAL NEIGHBORHOOD IN HUNTINGTON BEACH, CA WHEN THE RIGHT LOWER CONTROL ARM FAILED WITHOUT WARNING, CAUSING THE VEHICLE TO GO UP OVER THE CURB.  SIGNIFICANT DAMAGE TO THE VEHICLE.  NO INJURIES.  LOCAL CADILLAC DEALER HAS ACCEPTED RESPONSIBILITY AND WILL REPAIR THE VEHICLE UNDER WARRANTY.  *NM",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/05/2007",
        "dateOfIncident": "11/15/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10177910,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*- THE CONTACT STATED THAT WHILE DRIVING  ABOUT 2 MONTHS AGO AT A SPEED OF 20-25 MPH IN A RESIDENTIAL AREA,THE VEHICLE UNEXPECTEDLY ACCELERATED TO A SPEED OF 50 MPH.  THE CONTACT STATED THAT THE CONDITION OF THE ROAD AND WEATHER WERE BOTH GOOD.  THE CONTACT S WASN'T CONCERNED AT THE TIME , BUT WHEN A SECOND FAILURE OCCURRED HE THOUGHT HE WOULD REPORT IT. THE MOST RECENT INCIDENT HAPPENED ON 12/26/06 WHILE DRIVING 20 MPH THE VEHICLE ACCELERATED TO 40 MPH AND THE DRIVER HAD TO APPLY THE BRAKES WITH FORCE STOP THE VEHICLE.  THE CONTACT CALLED ON STAR FOR ROAD SIDE ASSISTANCE AND HAD VEHICLE TOWED TO THE DEALERSHIP.  THE DEALERSHIP INFORMED THE CONTACT THEY WERE HAVING IT SENT TO ANOTHER CADILLAC DEALERSHIP TO HAVE THEM TAKE A LOOK AT THE VEHICLE.  *AK  UPDATED 01/31/07. *JB",
        "vin": "1G6KD57Y56U"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/27/2006",
        "dateOfIncident": "09/05/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10177037,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2006 CADILLAC DTS HAS ADAPTIVE CRUISE CONTROL.  I HAVE EXPERIENCED 3 EPISODES OF POLICE RADAR INTERFERENCE WITH THIS FEATURE.  THE SYMPTOM IS THAT THE CC INDICATES THAT A CAR IS IMMEDIATELY IN FRONT OF THE VEHICLE.  IT SOUNDS THE ALARM AND APPLIES THE BRAKES AS STRONGLY AS THE FEATURE ALLOWS.  THE WORKAROUND IS TO IMMEDIATELY HIT THE GAS OR KILL THE CC TO GET BACK UP TO SPPED AND AVOID A REAR END COLLISION.    I HAD MY DEALER TEST THE UNIT AND VALIDATE THE ALIGNMENT.  THE UNIT TESTED ERROR FREE.  I HAVE EXPERIENCED THE PROBLEM WITH A FLORIDA STATE POLICE CAR 1 TIME AND HILLSBOUROGH COUNTY POLICE CARS 2 TIMES.  I CONTACTED THE COUNTY AND THEY TOOK A FIRM POSITION THAT IT COULDN'T BE THEIR RADAR UNITS.    I FRANKLY DON'T CARE WHERE THE PROBLEM IS.  IF OTHER PEOPLE ARE EXPERIENCING THIS IT WILL ESCALATE TO A FATALITY INDUCING SITUATION.    I MAY ALO TAKE THE PFOBLEM TO THE FCC AS THIS IS OBVIOUSLY A BANDWIDTH PROBLEM ON THE PART OF THE POLICE RADAR UNITS OR THE CADILLAC ADAPTIVE CC MODULE.    FIRSY FAILURE OCCURRED WHEN I WAS FOLLOWING A POLICE CRUISER WHO WAS APPROX 200 FEET AHEAD OF ME AND IN THE ADJACENT LANE (THE ONE TO MY RIGHT)  THERE WAS NO ONCOMING TRAFFIC AND NO ONE WITHIN 500 FEET TO THE REAR.  WITHOUT WARNING MY CAR WENT INTO EMERGENCT STOP AND SPUNDED THE PROXIMITY WARNING.  I TAPPED THE ON/OFF SWITCH AND BROUGHT THE CAR UP TO SPEED.    IT HAS ALSO FAILED AS I PASS A POLICE CAR THAT IS SITTING PERPENDICULAR TO THE ROAD.  THE DURATION IS SHORT AS YOU ARE RAPIDLY PASSING THRU THE RADAR CONE.  HOWEVER, I HAD THIS HAPPEN ON THE HOWARD FRANKLIN BRIDGE OVER TAMPA BAY AND THAT IS A TERRIBLE PLACE OF A CAR TO SUDDENLY SLOW DOWN WITH NO APPARANT WARNING.    I WOULD VENTURE TO GUESS THAT FEW PEOPLE ACTUALLY USE THIS FEATURE.  IT IS A FANTASTIC FUNCTION BUT IT IS SOMEWHAT COMPLEX TO USE AND LEARN HOW TO ANTICIPATE.    PLEASE FEEL FREE TO CONTACT ME FOR ADDITIONAL INFORMATION.  AGAIN, NO IDEA AS TO WHICH ELEMENT IS A FAULT.",
        "vin": "1G6KD57966U"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/17/2006",
        "dateOfIncident": "12/15/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10176326,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "CRUISE CONTROL FAILS TO HOLD SET SPEED AT DOWNGRADES OF 3% OR GREATER.  VEHICLE CONTINUES TO INCREASE SPEED, CAUSING UNSAFE DRIVING CONDITION.  DRIVER MUST PROVIDE EXCESSIVE BRAKING TO CONTROL VEHICLE SPEED ON DOWNGRADES.  *NM",
        "vin": "1G6KD57YX6U"
    },
    {
        "components": "STEERING,AIR BAGS,SEAT BELTS,LATCHES/LOCKS/LINKAGES",
        "crash": true,
        "dateComplaintFiled": "11/15/2006",
        "dateOfIncident": "12/31/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10157290,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STEERING IN THE CONSUMER 2006 CADILLAC DTS WAS SENSITIVE.  THE VEHICLE WAS INVOLVED IN A SINGLE CAR ACCIDENT WHEN THE DRIVER OVERCORRECTED TO AVOID COLLIDING WITH ANOTHER VEHICLE.  THE VEHICLE HIT TWO GUARDRAILS AND OVERTURNED ONTO IT'S TOP.  *NM    THE AIR BAGS FAILED TO DEPLOY AND THE SEAT BELTS DID NOT SECURE THE OCCUPANTS DURING THE IMPACT. THE CONSUMER STATED THE PRE-TENSIONERS DID NOT ACTIVATE.  *JB  THE CONSUMER WAS UNABLE TO UNLOCK THE TRUNK DOOR MANUALLY. UPDATED *JB  *NM   UPDATED",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "11/13/2006",
        "dateOfIncident": "10/10/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10173369,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "CONTINENTAL",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THE VEHICLE'S CONTINENTAL FRONT PASSENGER SIDE TIRE BLEW OUT WHILE TRAVELING 70 MPH.  THE TIRE WAS TOO NEW TO HAVE BEEN ROTATED.  THE TIRES WERE KEPT AT REGULAR PRESSURE AND THERE WAS NO ABNORMAL BULGING.  THE SERVICE DEALER DETERMINED THE TIRE HAD A TEAR IN THE SIDE THAT CAUSED THE BLOWOUT.  THIS WAS A CONTINENTAL, SIZE: P235/55R17.",
        "vin": "1G6KD5Y96U2"
    },
    {
        "components": "TIRES",
        "crash": true,
        "dateComplaintFiled": "11/01/2006",
        "dateOfIncident": "08/22/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10172334,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "CONTI PRO CONTACT",
                "productYear": "9999",
                "size": "235/55R17 99 H",
                "type": "Tire"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE DRIVING 70 MPH ON DRY ASPHALT, THE LEFT FRONT TIRE VIOLENTLY DEFLATED WITHOUT WARNING, SPINNING THE VEHICLE 360 DEGREES.  THE VEHICLE WAS THROWN INTO A GUARD RAIL.  THERE WAS A POLICE REPORT FILED AT THE SCENE.  THE TIRE SIZE WAS P235/55R17.*AK",
        "vin": "1G6KD57Y86U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/10/2006",
        "dateOfIncident": "01/01/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10170445,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "CADILLAC VEHICLES WITH VERTICAL STRIP LED TAIL LIGHTS ARE HIGHLY DISTRACTING.  I CAN SEE THE LIGHTS \"BLINK\" AS I LOOK AT THEM AND AWAY FROM THEM.  MANY OF THE NEWER CADILLAC VEHICLES EXHIBIT THIS SAME PROBLEM.  THIS IS BY FAR THE MOST DISTRACTING THING ON THE ROAD TODAY.  I BELIEVE THAT I AM IN THE MINORITY AS MY WIFE DOESN'T EVEN NOTICE THEM.  BUT I CAN SEE THEM FROM SOME DISTANCE AND IT'S ALL WITHOUT ANY CONCERTED EFFORT TO LOOK AT THEM OR STARE AT THEM.  IT'S AS IF SOMEONE HAD A STROBE LIGHT ON!  *JB",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/23/2006",
        "dateOfIncident": "06/01/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10166393,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "FAILURE OF CRUISE CONTROL TO MAINTAIN SPEED WITHIN REASONABLE BOUNDARIES ON EVEN MINIMAL DOWNHILL GRADES CREATES UNSAFE CONDITION.  *JB",
        "vin": "1G6KD57Y16U"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/19/2006",
        "dateOfIncident": "07/01/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10163694,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 CADILLAC DTS-L3, SUN REFLECTS INTO THE CHROME BEZEL SURROUNDING THE ANALOG JEWEL CLOCK. *KB  THE CLOCK IS MOUNTED AT AN ANGLE OF APPROX 45 DEGREES.  DEPENDING ON THE TIME OF DAY AND THE DIRECTION OF TRAVEL THE CLOCK ACTS LIKE A MIRROR AND REFLECTS THE BRIGHT SUN FROM THE GLASS AND CHROME INTO THE DRIVER'S EYES.  DARK SUNGLASSES PROVIDED LITTLE, IF ANY,  RELIEF FROM THE GLARE.  THE CONSUMER HAD TO TAPE A PIECE OF CLOTH OVER THE CLOCK TO GET SOME RELIEF.  *NM",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/23/2006",
        "dateOfIncident": "03/02/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10160619,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE CONTACTED CADILLAC AND THEY TELL US THERE IS NO FIX FOR THIS PROBLEM. THE DEALER HAS HAD THE CAR FOR TESTING TWO TIMES FOR SEVERAL DAYS.  RICH TRETHEWAY, THE HEAD TECHNICIAN AT THE WEAVER DEALERSHIP IN GRASS VALLEY WHO DROVE MY CAR AND THEN EXPLAINED TO US WHAT THE CAR DOES.  HERE IS WHAT THE CAR DOES FROM A DRIVING POINT OF VIEW.  WHEN GOING DOWN HILL OR TRYING TO SLOW DOWN, WHEN THE CAR REACHES ABOUT 25 MILES PER HOUR OR ABOUT 1000 RPM, IT THEN GIVES ITSELF GAS WHICH CAUSE A FEELING THAT ONE WOULD HAVE IF THE CRUISE CONTROL WAS ON (IT IS NOT). THAT IS; THAT THE CAR SURGES FORWARD GOING UP ABOUT 600 OR 700 RPM.  THIS OCCURS WHEN I HAVE SHIFTED THE CAR DOWN TO 1ST  OR 2ND.  SINCE I LIVE IN AN AREA WITH MANY HILLS THIS HAPPENS EVERY TIME I DRIVE.  I SHIFT DOWN TO KEEP THE CAR FROM GOING EXCESSIVELY FAST DOWN THE HILLS.   WHEN I AM DRIVING AND WANT TO TAKE A CURVE AT 20 TO 25 MILES PER HOUR, THE CAR MANY TIMES SURGES FORWARD WHILE MY FOOT IS OFF THE THROTTLE; I HAVE TO USE THE BRAKE CONTINUALLY TO GET AROUND THE CURVES AND DOWN HILLS AT A SLOW ENOUGH SPEED TO BE SAFE.    THIS SURGING HAPPENED ONCE IN A PARKING LOT AS WE WERE TRYING TO PARK.  RICH WAS NOT ABLE TO REPRODUCE THIS PROBLEM, BUT WAS ABLE TO REPRODUCE THE OTHER SURGING PROBLEM.  THE CURE FOR THIS IS AS I UNDERSTAND IT FROM RICH AND ONE OF THE OWNERS OF WEAVER IS TO ALWAYS DRIVE IN OVERDRIVE AND USE THE BRAKE INSTEAD OF SHIFTING DOWN.  IT ALSO DOES THIS IN OVERDRIVE.  I CAN UNDERSTAND THAT IF THERE IS NO MECHANICAL REPAIR THAT GENERAL MOTORS HAS MADE FOR THIS CAR THEN SOMETHING HAS TO BE DONE TO BE HELPFUL TO US. *JB",
        "vin": "1G6KD57Y86U"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/13/2006",
        "dateOfIncident": "06/01/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10159747,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR GAINS EXCESSIVE SPEED ON DOWNHILL SLOPES.  15 MPH ON HILLS THAT OTHER CARS GAIN 3 TO 5 MPH. *JB",
        "vin": "1G6KD57Y16U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/06/2006",
        "dateOfIncident": "06/01/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10164782,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 CADILLAC DTS SURGES WHILE ACCELERATOR PEDAL IS NOT DEPRESSED, RPM'S GET HIGHER, SHUTS OFF WITHOUT WARNING. *KB ***NAR***  THE VEHICLE HAS BEEN TAKEN TO THE DEALER TWICE FOR TESTING.  THE MANUFACTURER INDICATED THAT THERE WAS NO FIX FOR THE PROBLEM.  THE TECHNICIAN AT THE DEALER TEST DROVE THE CAR AND INDICATED THAT THE VEHICLE WAS OPERATING AS DESIGNED.  THE VEHICLE WOULD OCCASIONALLY HESITATE WHEN SLOWING DOWN TO A STOP. *NM",
        "vin": "1G6KD57Y86U"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/03/2006",
        "dateOfIncident": "05/01/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10158887,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 CADILLAC DTS INADVERTENT ACCELERATION PROBLEM.  *NM",
        "vin": "1G6KD57Y86U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/02/2006",
        "dateOfIncident": "05/02/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10156593,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WILL NOT START.  I HAVE HAD THE CAR SINCE THE END OF NOVEMBER 2005 AND ON TWO OCCASIONS THE CAR WAS DEAD.  I DID NOT BUY THE CAR TO RUN EVERYDAY OR IN BAD WEATHER.  *JB",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/10/2006",
        "dateOfIncident": "04/09/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10154996,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "FLICKERING TAIL LIGHTS.     RECENT MODELS OF CADILLAC (E.G. DTS), USE LED TAIL LIGHTS. ON THIS CAR, THEY FLICKER AT ABOUT 50 HZ. I WORK IN THE SOFTWARE INDUSTRY AND CAN CLEARLY SEE COMPUTER MONITORS FLICKERING AT 60 HZ OR BELOW. AT NIGHT, AND ESPECIALLY WHILE IN MOTION, THESE TAIL LIGHTS ARE EXTREMELY DISTRACTING, AND OCCASIONALLY NAUSEATING. I HAVE NOTICED THIS BEGINNING TO OCCUR ON MORE TYPES OF VEHICLES EACH YEAR. I AM VERY CONCERNED ABOUT THE EFFECT ON SAFETY AND COMFORT SHOULD THIS TREND BE ALLOWED TO CONTINUE.    I BELIEVE THE DOT SHOULD MANDATE THAT LED LIGHTS ON ALL VEHICLES HAVE A REFRESH RATE OF 100HZ OR GREATER IN EACH MODE (DIM: TAIL LIGHT, BRIGHT: BRAKE LIGHT...). THERE ARE EXAMPLES OF LED TAIL LIGHTS THAT DO NOT FLICKER, IN PARTICULAR, MOST LARGE SEMI-TRAILERS DO NOT HAVE THIS FLICKER EFFECT.  *NM",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "02/06/2006",
        "dateOfIncident": "02/05/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10149522,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE DRIVING 55 MPH THE VEHICLE HAD A BLOW OUT OF THE SIDEWALL IN THE PASSENGER SIDE FRONT TIRE.  A FEW WEEKS LATER THE CONTACT DISCOVERED BOTH THE RIGHT FRONT AND REAR TIRES WERE FLAT.  AIR APPEARED TO BE SEEPING THROUGH SECTIONS OF THE SIDEWALL.  THE VEHICLE HAS BEEN INSPECTED BY THE DEALER AND THE TIRES WERE REPLACED.  THE TIRES ARE GOODYEAR VOGUE Y TRAC TOURING II H RATED.    UPDATED 3/20/2006 - *NM",
        "vin": "1G6KD57Y56U"
    }
]