[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/09/2020",
        "dateOfIncident": "11/09/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11373786,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS 1500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE SECURITY LIGHT COMES ON INTERMITTENTLY FOR YEARS, I THEN CANNOT START THE VEHICLE. I HAVE REPORTED THE PROBLEM TO GM, I HAVE HAD IT TO THE CHEVROLET DEALERSHIP TWICE, WHICH COST ME OVER A THOUSAND DOLLARS FOR THEM TO REPLACE PARTS WHICH HAD NO EFFECT IN SOLVING THE PROBLEM. THE VEHICLE WILL NOT START UNTIL YOU TURN THE KEY TO THE ON POSITION, WAIT 10 MINUTES FOR THE LIGHT TO GO OUT, THEN TURN OFF THE IGNITION FOR 10 SECONDS, THEN IT WILL START. I HAVE PUT UP WITH IT FOR YEARS, BUT WHEN I AM STRANDED IN THE DEAD OF WINTER, THAT POSES A SAFETY HAZARD. YOUR REPORT WANTS TO KNOW WHEN IT HAPPENS, IT HAPPENS WITHOUT NOTICE, RHYME OR REASON, AT ANYTIME SINCE I BOUGHT IT IN 2009.",
        "vin": "1GBFG15T861"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/08/2016",
        "dateOfIncident": "12/15/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10894065,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CHEVROLET EXPRESS. WHILE DRIVING 30 MPH, THE VEHICLE VIBRATED SEVERELY AND STOPPED WHEN THE BRAKE PEDAL WAS DEPRESSED. THE FAILURE OCCURRED CONSTANTLY. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED, BUT THE CAUSE OF THE FAILURE WAS NOT FOUND. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 40,000.",
        "vin": "1GAGG25U861"
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/21/2016",
        "dateOfIncident": "05/18/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10887623,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A CHEVROLET VAN EXPRESS WITH A 6.0 V8 ENGINE A YEAR AGO WITH ONLY 37000  MILES. APPROXIMATELY 2 MONTHS AFTER PURCHASE, I BEGAN HAVING TROUBLE WITH THE ENGINE AND STABILITRAK SYSTEM IN ADDITION TO THE LOW BEAM HEADLIGHT FAILURE DETAILED BELOW SAME ACROSS THE ENTIRE V8 6.0 ENGINES PRODUCED BY CHEVROLET. THE VAN VEHICLE SHOOK VIOLENTLY STRESSING ALL THE OCCUPANTS.  WHILE TRAVELING ON THE HIGHWAY MY CHECK ENGINE AND TRACTION LIGHT ILLUMINATED SIMULTANEOUSLY. I WAS ALSO ALERTED THAT \"ENGINE POWER WAS REDUCED\" AND MY VEHICLE SHUT DOWN TWO TIMES IN A 30 MINUTE SPAN OF TIME. NOW WITH ONLY 41,000 MILES I HAVE PARKED THE VAN UNTIL A RECALL CORRECTS THE DANGEROUS SAFETY PROBLEMS.     AGAIN WHILE TRAVELING ON THE HIGHWAY MY AIR BAG SENSOR WENT OFF WITH THE CHECK ENGINE AND TRACTION LIGHT AGAIN ILLUMINATED SIMULTANEOUSLY. THE VAN VEHICLE SHOOK VIOLENTLY STRESSING ALL THE OCCUPANTS.   I WAS ALERTED THAT \"ENGINE POWER WAS REDUCED\" AND MY VEHICLE STOPPED COLD. I WILL NEVER BUY ANOTHER GM PRODUCT THEY ARE FRAUGHT WITH ELECTRICAL PROBLEMS.  THIS IS CAUSING SAFETY ISSUES BEING IN A COMPROMISING POSITION 3 TIMES WITH 9 PEOPLE AND 2 ARE INFANTS IN THE VAN. RESEARCH SHOWS THIS TO BE AN ONGOING ISSUE. THIS HAS BEEN A NIGHTMARE. SOMETHING AS DRAMATIC AS A TOTAL ENGINE FAILURE IN A CAR THAT IS AS POPULAR AS THE V8 6.0 ENGINE IS A FRIGHTENING ISSUE THAT EVERYONE ACROSS THE INDUSTRY IS GOING TO WANT TO KNOW MORE ABOUT. F THE ENGINE WON'T RESTART .   TTHE STEERING WILL FEEL INCREASINGLY HEAVIER, MAKING IT HARDER TO STEER. ALSO THE POWER BOOST FOR THE BRAKES DISAPPEARS AFTER ONE OR TWO APPLICATIONS, MAKING THE VAN HARDER TO STOP.  IN THE AFFECTED VEHICLES, THE UNDERHOOD BUSSED ELECTRICAL CENTER (UBEC) HOUSING CAN EXPAND AND CAUSE THE HEADLAMP LOW BEAM RELAY CONTROL CIRCUIT WIRE TO BEND. IF THE WIRE IS REPEATEDLY BENT, IT MAY FRACTURE CAUSING A LOSS OF LOW BEAM HEADLAMP ILLUMINATION.",
        "vin": "1GBGG29U661"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/12/2014",
        "dateOfIncident": "12/01/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10632737,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CHEVROLET EXPRESS. WHILE DRIVING 50 MPH, THE VEHICLE JERKED AND STALLED. THE VEHICLE WOULD NOT RESTART AND WAS TOWED TO THE DEALER. THE TECHNICIAN STATED THAT THE IGNITION NEEDED TO BE REPAIRED. THE IGNITION WAS ORIGINALLY REPAIRED AT 54,322 MILES. THE VEHICLE WAS REPAIRED AND THE MANUFACTURER WAS NOTIFIED. THE FAILURE MILEAGE WAS 70,000.",
        "vin": "1GBFG15T661"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/21/2014",
        "dateOfIncident": "05/31/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10592953,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY FRONT PASSENGER AIRBAG SEAT SENSOR IS NOT FUNCTIONING.  IT WILL NOT TURN ON AT ALL WHEN PEOPLE OF ALL DIFFERENT SIZES ARE IN THE SEAT.  IF AN ACCIDENT WERE TO HAPPEN THE AIRBAG WOULD NOT DEPLOY.  *TR",
        "vin": "1GNFH15T161"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/02/2012",
        "dateOfIncident": "07/01/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10460376,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS CUTAWAY VAN",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "SUMMER TIME NOTICED ALUMINUM CORNER PANELS STARTED TO BUCKLE OR FLARE OUT FROM THE BOTTOMS THOUGHT IT POSSIBLY GOT HIT BYE A TRAILER BUT AS TIME WENT ON THEY FLARED OUT EVEN MORE THEN IN 2011 THEY STARTED PEELING OFF ON ONE SIDE ON EACH CORNER SO WE CONTACTED OUR DEALERSHIP WITH THE PROBLEM IN WITCH THEY TOLD US IT WAS RECALLED FOR THAT REASON THEIR WAS NO RIVETS IN THE CORNER PANELS SO THEY WOULD FALL OFF. SO WE CONTACTED SPARTAN SUPREME CORP WHO MADE THE BOX AND WAS TO WARRANTY THE BOX WHO CLAIMED OUR WARRANTY WAS UP. SO WE WENT DOWN BOUGHT PARTS SENT PICTURES AND WAS GOING TO FIX IT OUR SELVES. BUT AT LOOKING AT FIXING IT  HAD GOTTEN SO BAD THAT THE CORNERS WAS NO LONGER STRAIGHT THE ENTIRE BOX IS SHIFTED AND IS BOWING OUT ON THE SIDES WITH JARRED SIDE PANEL SORS WHICH ARE RUBBING WHEN U SHUT THEM AND LOOKS UNREPAIRABLE. WE THEN CALLED AGAIN TO SPARTAN AND THEY TOLD ME IT WOULD HAVE BEEN UNDER WARRANTY WHEN WE CALLED THE FIRST TIME (EARLY 2011) AND NOW IT'S OUT OF WARRANT (LATE 2011). SO AT THIS POINT WE HAVE A BOX TRUCK WITH ON MISSING CORNER PANEL WHICH BLEW OFF SOMEWHERE OFF DOWN THE ROAD AND A LEANING BOX WITH WHICH COULD FALL APART AT ANYTIME.  *TR",
        "vin": "1GBJG312161"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/29/2011",
        "dateOfIncident": "04/29/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10441629,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ON APRIL 29, 2011, A PASSENGER AND I WERE INVOLVED IN A VERY SERIOUS NEAR-FATAL MOTOR VEHICLE ACCIDENT.  I WAS THE DRIVER OF THE VEHICLE, WHICH WAS A 2006 CHEVY EXPRESS CARGO VAN.  WE WERE DRIVING FROM MEDFORD, OREGON TO KLAMATH FALLS, OREGON ON HWY 140 EAST.  THE ACCIDENT OCCURRED NEAR MILE MARKER 59 AT APPROXIMATELY 8 A.M.  THIS STRETCH OF HIGHWAY RUNS PARALLEL TO KLAMATH LAKE. THE VEHICLE SPUN OUT OF CONTROL WHEN WE DROVE OVER A PATCH OF UNSEEN BLACK ICE.  AS THE VEHICLE SPUN OUT OF CONTROL WE WENT ACROSS THE HIGHWAY AND INTO THE LAKE WHERE WE COLLIDED HEAD ON INTO A HUGE BOLDER (NOT A ROCK) THAT WAS PROTRUDING FROM THE WATER.  THE IMPACT CAUSED THE VEHICLE TO ROLL OVER LENGTH WISE AND THEN CAME TO REST UPRIGHT IN THE WATER. THE VAN SANK INTO THE WATER AND STOPPED SINKING WHEN THE WATER LEVEL HAD RISEN TO OUR CHINS. HIGHWAY PATROL AND AN AMBULANCE TEAM WERE DISPATCHED TO THE SCENE AND IT WAS NOTED THAT THE DUAL AIRBAG SYSTEM DID NOT DEPLOY.  AS A RESULT I SUSTAINED SERIOUS INJURIES INCLUDING A FRACTURED STERNUM AND A VERY SERIOUS SHOULDER INJURY WHICH REQUIRED RECONSTRUCTIVE SURGERY AND A LENGTHY RECOVERY PERIOD.  MY PASSENGER SUSTAINED MINOR INJURIES.  I BELIEVE, AS WELL AS OTHERS, THAT HAD THE AIRBAGS DEPLOYED, AS THEY SHOULD HAVE, THE INJURIES I RECEIVED WOULD NOT HAVE OCCURRED OR WOULD HAVE BEEN GREATLY MINIMIZED.  *KB",
        "vin": "1GCFG15X261"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/07/2011",
        "dateOfIncident": "11/25/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10434425,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ABS BRAKING SYSTEM ACTIVATES FOR NO REASON AND GREATLY EXTENDS THE STOPPING DISTANCE. THIS HAS PUT OUR DRIVERS IN VERY DANGEROUS SITUATIONS. WE HAVE SEVERAL GM LIGHT DUTY VANS AND TRUCKS AND THIS HAS BEEN A PROBLEM WITH ALMOST ALL OF THEM. THE WHEEL SENSOR MECHANISM IS A FAULTY DESIGN AND CAUSES A VERY DANGEROUS SITUATION FOR THE DRIVERS. GM SHOULD RECALL AND REPLACE ALL OF THESE WITH A NEWLY DESIGNED UNIT THAT WORK SAFELY.   *TR",
        "vin": "1GCGG25V961"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/11/2011",
        "dateOfIncident": "09/06/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10429461,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE ALSO EXPERIENCED PROBLEMS WITH BOTH THE PASSENGER AND DRIVERS SIDE CARGO DOOR HINGES NOT OPERATING PROPERLY AND BINDING.  THIS PROBLEM WITH THE HINGES HAS OCCURRED DESPITE OUR EFFORTS TO KEEP THE HINGES LUBRICATED TO TRY TO PREVENT THE DOORS FROM BINDING SO BADLY THAT IT MADE OPENING THE DOORS ALMOST IMPOSSIBLE EVEN FOR A STRONG, GROWN MAN.  I HAD TO HAVE BOTH OF THESE PROBLEMS ADDRESSED BY EITHER THE HANDICAPPED VEHICLE CONVERSION COMPANY OR THORNTON CHEVROLET ON THOSE OCCASIONS WHEN THESE PROBLEMS BECAME SO SEVERE THAT THEY PREVENTED MY UTILIZATION OF THE VEHICLE.  THE MOST RECENT OCCURRENCE OF PROBLEMS WITH THE HINGES TOOK PLACE ON SEPTEMBER 6, 2011.  I CONTACTED THE COLLISION REPAIR SHOP AT THORNTON CHEVROLET AND HAD THEM ATTEMPT TO CORRECT THE ISSUE BY REPLACING THE HINGE PIN ASSEMBLY ON THE PROBLEM DOOR ON THE PASSENGER SIDE (WHERE MY WHEELCHAIR LIFT IS INSTALLED AND USED TO ALLOW ME TO ENTER AND EXIT THE VEHICLE).  HOWEVER, THE TRAINED COLLISION REPAIR SPECIALISTS AT THORNTON CHEVROLET REALIZED THAT THE PROBLEM WAS MORE SERIOUS THAN THIS AND INFORMED ME THAT THE ENTIRE LOWER HINGE ASSEMBLY ON THE REAR PASSENGER CARGO DOOR NEEDED TO BE REPLACED BECAUSE OF A CRACK IN THE METAL OF THE HINGE ASSEMBLY WHERE IT IS WELDED TO THE VEHICLE.  AS YOU WILL REALIZE, THIS COULD HAVE BEEN AN EXTREMELY SERIOUS SAFETY PROBLEM HAD I NOT BEEN OUTSIDE OF THE VEHICLE ON THE THREE SEPARATE INSTANCES WHEN THE LATCH MECHANISM FAILED TO OPERATE PROPERLY.  HAD I BEEN INSIDE THE VEHICLE OR NOT AT MY RESIDENCE (SUCH AS BEING AT MY PLACE OF EMPLOYMENT) WHEN THIS OCCURRED, I WOULD HAVE BEEN TRAPPED INSIDE THE VEHICLE.  *KB",
        "vin": "1GCGG25V461"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/25/2010",
        "dateOfIncident": "09/10/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10313231,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED ANOTHER FLY WHEEL. *DT  THE CONSUMER WAS INFORMED THERE WAS NOTHING WRONG WITH THE REDESIGNED FLYWHEEL AND THERE MUST BE ANOTHER REASON FOR IT WEARING OUT. THE CONSUMER TOOK THE VEHICLE TO ANOTHER MECHANIC FOR A SECOND OPINION AND WAS TOLD THE ORIGINAL FLYWHEELS WERE MADE STRONGER AND HAD DIFFERENT HOLES IN THEM. THE REDESIGNED FLYWHEEL WAS MUCH THINNER AND LESS EXPENSIVE. *JB",
        "vin": "1GCGG29V461"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "11/17/2009",
        "dateOfIncident": "08/15/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10292562,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS 1500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "FAULTY FUEL GAUGE SENSOR ON 2006 CHEVY EXPRESS VAN.    MY FUEL GAUGE READ APPROX 1/8TH OF A TANK.  THE LOW FUEL LIGHT HAD NOT COME ON.  THE VAN STOPPED RUNNING AND COULD NOT BE STARTED.  IT WAS TOWED TO NUCAR IN NEW CASTLE.  SENSOR AND FUEL PUMP WERE REPLACED AS THE DEALER SAID THEY WOULD NOT GUARANTEE THE SENSOR WITHOUT REPLACING THE FUEL PUMP. THE COST > $1,000.  I READ YOUR ARTICLE AND NOW FRIENDS OF MINE HAVE EXPERIENCED SIMILAR PROBLEMS. *TR",
        "vin": ""
    },
    {
        "components": "STRUCTURE,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "10/04/2009",
        "dateOfIncident": "04/13/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10286227,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS 1500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HINGES ON THE DOORS OF CHEVY VANS ARE DEFECTIVE IN THAT THEY ARE IMPROPERLY DESIGNED AND CORRODED AND BECOME DIFFICULT IF NOT IMPOSSIBLE TO OPEN AND CLOSE THE HINGES ARE INVERTED AND ALLOW DIRT AND WATER TO INVADE THE SWIVEL PORTION OF THE HINGE I HAVE REPORTED THIS TO THE DEALERS ARE THREE OCCASIONS AND THEY BASICALLY SAID TUFF LUCK THEY WERE AWARE OF THE PROBLEM WHEN I WENT IN THEY SAY ADDITIONAL MAINTENANCE IS REQUIRED BUT MAKE NO MENTION OF IT NOR DO THEY DO ANYTHING SPECIAL AT THEIR FACILITY I HAVE HAD MY VEHICLES SERVICED THERE AND IT MAKES NO DIFFERENCE. *TR",
        "vin": "1GNFG15T061"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/16/2009",
        "dateOfIncident": "08/12/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10284175,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS 1500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM WRITING TO FILE A COMPLAINT AGAINST SUPREME CORPORATION 2581 EAST KERCHER RD. GOSHEN, IN 46527.  I RECEIVED A SAFETY RECALL NOTICE FROM THEM DATED AUGUST 12, 2009 WHICH INDICATED A DEFECT IN CERTAIN SPARTAN SERVICE AND CARGO BODIES MANUFACTURED BETWEEN JANUARY 2006 TO JUNE 2008. I OWN A 2006 VEHICLE WITH A SPARTAN CARGO BODY.    THE RECALL APPLIES TO A POTENTIAL DEFECT IN THE BONDING OF THE ROOF SKIN TO ROOF RAIL EXTRUSION AND ROOF RAIL EXTRUSION TO SIDE WALL AND INDICATES THAT  WHILE THE VEHICLE IS IN OPERATION PARTS OF THE ROOF SKIN OR ROOF ITSELF COULD DELAMINATE OR DISLODGE. THE RECALL FURTHER STATES THE  POTENTIAL FOR DEATH OR SERIOUS INJURY EXISTS TO OTHER VEHICLES OR THE GENERAL PUBLIC SHOULD ANY PART OF THE ROOF BECOME UNBONDED.    THE RECALL STATES THAT THERE IS AN ATTACHED LIST OF SHOPS APPROVED BY SUPREME CORPORATION TO PERFORM THE RECALL REPAIR, HOWEVER NO LIST WAS ATTACHED.    FURTHER, I CONTACTED SUPREME CORPORATION AT 800-557-2785 FOUR TIMES AND REQUESTED THE LIST OF REPAIR SHOPS. I WAS TOLD ON FOUR OCCASIONS THAT THE LIST WOULD BE EMAILED TO ME.   I NEVER RECEIVED ANY EMAILS OR OTHER COMMUNICATION FROM SUPREME CORPORATION.    SUPREME CORPORATION IS BEING NEGLIGENT AND IRRESPONSIBLE IN THE MATTER. *TR",
        "vin": "1GBHG31UX61"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/11/2009",
        "dateOfIncident": "01/10/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10254660,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS 1500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ALONG THE HIGHWAY, MY WARNING LIGHT CAME ON STATING THERE WAS AN ENGINE PROBLEM.  I WAITED TO GET IT CHECKED OUT.  AS I WAS MAKING A DELIVERY THE 2006 EXPRESS CARGO STALLED ON THE HIGHWAY.  HAD IT TOWED TO THE CHEVROLET DEALERSHIP AND THEY STATED IT WAS THE FUEL SENSOR IN THE GAS TANK THAT BURNT OUT. *TR",
        "vin": "1GCFG15X161"
    },
    {
        "components": "SEAT BELTS,SEATS",
        "crash": false,
        "dateComplaintFiled": "09/21/2006",
        "dateOfIncident": "09/21/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10168815,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 CHEVROLET EXPRESS 15 PASSENGER VAN  THE VAN IS EQUIPPED WITH 4 BENCH SEATS. THE FIRST THREE BENCHES SEAT THREE PEOPLE AND THE LAST BACK BENCH SEATS FOUR. THIS LEAVES A VERY SMALL WALKWAY TO ACCESS THE SEATS FROM THE DOOR.   THE SEAT BELTS FOR THE OUTER POSITIONS OF THE BENCH SEATS ARE AFFIXED TO THE SIDE WALLS PROVIDING SHOULDER BELTS FOR THESE SEATS.  THESE BELTS HAVE TWO BUCKLE ENDS ON EACH BELT. THE CLIP ON THE END OF THE BELT SPANS THE WALKWAY AND ATTACHES TO THE WALKWAY SIDE OF THE BENCH SEAT. THE OTHER SLIDING CONNECTOR THEN IS ATTACHED TO THE OTHER SIDE OF THE OCCUPANT PROVIDING A SHOULDER AND LAP RESTRAINT.   ONCE CONNECTED, THIS BUCKLE IS NOT INTENDED TO BE REMOVED IT LACKS A USABLE BUTTON TO DISCONNECT THE BELT. IT DOES HAVE A SMALL RECTANGULAR HOLE IN THE FRONT TO STICK IN AN OBJECT, FLAT SCREWDRIVER, OR SUCH TO DISCONNECT THE BELT.    WITH THIS CONFIGURATION THE OCCUPANTS OF THE FRONT BENCH CAN ENTER OR EXIT THE VEHICLE WITHOUT BEING IMPEDED. THE OCCUPANTS OF THE REMAINING SEATS ARE FORCED TO TRANSVERSE THE BELTS OF THE SEATS IN FRONT OF IT AS THEY ENTER OR EXIT THE VEHICLE.      THIS CONFIGURATION PRODUCES A STRANGULATION HAZARD FOR 10 OF THE 15 OCCUPANTS IN THE REAR OF THE VEHICLE AS THEY ENTER OR EXIT THE VEHICLE. THIS PROBLEM CAN BE COMPOUNDED IN AN ACCIDENT SITUATION.  *JB",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "05/21/2006",
        "dateOfIncident": "04/25/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10157947,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS LEAVING A MILITARY HOSPITAL AFTER DROPPING OFF MILITARY PEOPLE AND TURNED LEFT AND DROVE ABOUT 200 YARDS WHEN SOMETHING HAPPENED TO THE STEERING AND I COULDN'T STEER THE VEHICLE AND THE VEHICLE WENT TO THE RIGHT HITTING A ROAD SIDE LIGHT POLE.  THE RIGHT FRONT TIRE WAS BLOWN ON THE INSIDE SIDEWALL.  I CAN'T SAY THAT IT HAD BLOWN BEFORE OR AFTER THE CRASH.  *NM",
        "vin": ""
    }
]