[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/28/2022",
        "dateOfIncident": "02/28/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454497,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "the electronic brake control computer has malfunctioned. this renders the ABS and traction control systems inoperable. No replacement part or repair is available from the dealership.",
        "vin": "1gnfk16z56j"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/20/2021",
        "dateOfIncident": "08/15/2021",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429880,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "We had the 2006 Suburban parked with the engine running while our family was just starting to get in. A couple of them noticed a slight smoke smell which we followed and we trailed it to the rear of the vehicle. While I was pulling off a left rear column trim piece to locate where the smoke was coming from, the far rear dome light fixture started dripping melted and burning plastic close by my head. I looked up and saw the rear dome light fixture on fire and flicked it down into the rear cargo area. One of the family was already fetching a fire extinguisher and as they arrived I used it to put out what fire was left in the headliner.",
        "vin": "1gnfk16z96j"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/28/2019",
        "dateOfIncident": "05/27/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11210451,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "YESTERDAY WAS THE THREE YEAR ANNIVERSARY OF TAKATA'S FAILURE TO REPAIR MY AIRBAG.  THAT IS THREE YEARS THAT THEY HAVE WANTONLY PLACED MYSELF AND MY FAMILY MEMBERS IN DANGER.  FORCE THESE SCOFFLAWS TO REPLACE THOSE  IEDS THEY HAVE SET IN FRONT OF MY FAMILY.",
        "vin": "1GNFK16317J"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/18/2019",
        "dateOfIncident": "03/15/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11187432,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "SUDDEN AND COMPLETE BRAKE FAILURE DUE TO A BROKEN REAR BRAKE LINE. BRAKES WORKED NORMALLY AND AT THE NEXT STOP THEY WENT COMPLETELY TO THE FLOOR WITH NO BRAKING ACTION. I HAD TO USE DOWN SHIFTING TO SLOW AND THEN A SNOW BANK TO COMPLETELY STOP. THERE WAS NO INDICATOR WARNING LIGHTS UNTIL THE BRAKE PEDAL HIT THE FLOOR AND WENT OUT IMMEDIATELY AFTER THE PEDAL WAS RELEASED. THIS HAPPENED ON A CITY STREET WITH NO TRAFFIC AT 3 AM ON MY WAY TO WORK. I WAS DRIVING STRAIGHT AT ABOUT 25 TO 30 MPH. AFTER LOOKING AT THE BRAKE LINES THEY ARE DRAMATICALLY RUSTED. THE SERVICE SHOP HAS EXPLAINED COMPLETE REPLACEMENT OF ALL LINES NEEDS TO BE DONE (APPOINTMENT TO DO THIS IS 3/20/2019).",
        "vin": "1GNFK16Z46J"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/09/2018",
        "dateOfIncident": "03/23/2017",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11084068,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 1500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2006 CHEVROLET SUBURBAN 1500. AFTER THE VEHICLE WAS DRIVEN AND PARKED, IT CAUGHT ON FIRE. THE FIRE DEPARTMENT WAS NOTIFIED AND WAS ABLE TO EXTINGUISH THE FIRE. A FIRE REPORT WAS FILED. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC AND DEEMED DESTROYED. THE VEHICLE WAS TOWED TO A PERSONAL STORAGE LOT. THE DEALER WAS NOT CONTACTED. THE CONTACT STATED THAT THE MANUFACTURER INSPECTED THE CAUSE OF THE FIRE TWICE AND REQUESTED TO INSPECT IT A THIRD TIME. THE INVESTIGATOR CHECKED THE FUSE BOX AND THE HVAC ELECTRICAL SYSTEM; HOWEVER, A DETERMINATION HAD NOT BEEN MADE. THE CONTACT WAS CONCERNED THAT THE MANUFACTURER WOULD NOT BE FORTHCOMING WITH THE CAUSE OF THE FIRE. THE APPROXIMATE FAILURE MILEAGE WAS 130,000.",
        "vin": "1GNFK16ZX6J"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/28/2017",
        "dateOfIncident": "06/01/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11011322,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 1500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR LOCK ACTUATOR BECAME FAULTY AND WAS REPLACED 6/13.  JUST SHORT OF 4YRS,THE ACTUATOR BECAME FAULTY AGAIN IN 6/1/17.  THE DEALER WAS CONTACTED AN WAS TOLD SORRY, THE WARRANTY (1YR) HAD EXPIRED.    2 THINGS ARE THE PROBLEM WITH THIS ACTUATOR.  BECAUSE THE BACKHATCH IS KEYLESS AND HAS NO RELEASE FROM THE INSIDE, THIS POSES AS A SAFETY RISK IF TRAPPED INSIDE THE VEHICLE.  THERE ARE OTHER NUMEROUS SIMILAR COMPLAINTS FOR THE ACTUATOR BECOMING FAULTY WITHIN A SHORT PERIOD OF TIME, COSTING $700+ TO REPLACE.",
        "vin": ""
    },
    {
        "components": "STEERING,SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/07/2017",
        "dateOfIncident": "05/06/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10993754,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CHEVROLET SUBURBAN. WHILE MAKING A LEFT TURN, A LOUD CLUNKING NOISE WAS HEARD COMING FROM THE REAR PASSENGER SIDE OF THE VEHICLE. THE CONTACT CALLED THE DEALER, WOOD CHEVROLET AT (814) 344-8250, AND WAS INFORMED THAT THEY NEVER HEARD OF THE FAILURE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND REFERRED THE CONTACT TO NHTSA. THE FAILURE MILEAGE WAS APPROXIMATELY 55,000.",
        "vin": "1GNFK16Z36J"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/22/2017",
        "dateOfIncident": "05/02/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10967852,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL.  WHAT IS A TIMELY MANNER EXPECTED FOR A RESOLUTION FOR MY RECALL? I RECEIVED A RECALL LETTER ON MY PASSENGER AIR BAG DATED MAY 2016 AND I NOW SEE THAT GM HAS BEEN GIVEN UNTIL AUGUST 2017 TO RESOLVE THE RECALL (15 MONTHS OF LITIGATION).  IN THE MEAN TIME I CANNOT TRADE IN OR SELL THAT VEHICLE.  GM SAYS WAIT UNTIL AUGUST 2017 FOR THE RESOLUTION.  THE GM REPRESENTATIVE SAID I PROMISE IT IS SAFE TO DRIVE AND I SAID IT DOESN'T ALLOW THE TRADE BECAUSE DEALERS WONT TAKE IT WITH AN OUTSTANDING RECALL NOT REPAIRED.  I AM CONCERNED ABOUT MINE AND MY FAMILY'S SAFETY AND WOULD APPRECIATE THE OPPORTUNITY TO BETTER UNDERSTAND WHY THE GM REPRESENTATIVE HAS TELL ME IT IS ABSOLUTELY SAFE AND WE HAVE HAD ZERO ACCIDENTS FROM IT. PLEASE HELP ME UNDERSTAND WHAT IS A TIMELY MANNER FOR GM TO RESOLVE A RECALL SENT TO ME BY THEM.",
        "vin": "3GNFC16067G"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/10/2016",
        "dateOfIncident": "12/09/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10934362,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 1500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TOWING THE FAMILY BOAT ON SECONDARY ROADWAYS, I ATTEMPTED TO STOP IN HEAVY TRAFFIC, WHEN I PRESSED ON THE BRAKE PEDAL IT WENT COMPLETELY TO THE FLOOR AND BOTH THE TRUCK AND BOAT CONTINUED ROLLING TOWARDS STOPPED TRAFFIC.  I WAS ONLY ABLE TO STOP THE VEHICLE BY MANUALLY OPERATING THE PARKING BRAKE. HAD I NOT HAD THE PRESENCE OF MIND TO UTILIZE THE PARKING BRAKE I WOULD HAVE COLLIDED WITH THE TRAFFIC STOPPED IN FRONT OF ME. UPON INSPECTION I NOTICED A LARGE MOUNT OF BRAKE FLUID UNDER THE DRIVER'S SIDE FRONT WHEEL. I TRANSPORTED THE VEHICLE TO MY SERVICE STATION WHERE THEY PLACED IT ON A LIFT AND SHOWED ME THE EXTENSIVE CORROSION ON ALL OF THE BRAKE LINES AND TRANSMISSION COOLING LINES. THE LINE WHICH HAD FAILED RESULTED IN NO BRAKING CAPABILITIES WHATSOEVER. THERE IS NOT ONE SERVICEABLE BRAKE LINE LEFT ON THE VEHICLE. THE VEHICLE HAS 75K MILES ON IT AND IS IMMACULATE BOTH INSIDE AND OUT AND HAS BEEN REGULARLY SERVICED. THE BRAKE FAILURE RESULTING IN A TOTAL LOSS OF BRAKES, CAME WITHOUT ANY WARNING.",
        "vin": "1GNFK16Z36J"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/05/2016",
        "dateOfIncident": "12/02/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10930005,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 1500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ON DECEMBER 2, 2016,  I WAS DRIVING THE SUV WITH MY FAMILY MEMBERS INSIDE. I WAS TRAVELING IN STATE HIGHWAY ABOUT 55 MPH WHEN A CAR IN FRONT OF ME BEGAN SLOWING DOWN. I ATTEMPTED TO SLOW DOWN AS WELL BY PRESSING THE BRAKE PEDAL BUT THE BRAKES DID NOT IMMEDIATELY ENGAGE. I THEN PRESSED THE BRAKE PEDAL HARD WHICH FOR ABOUT 1 SECOND CAUSED THE WHEELS TO LOCK. AS THE BRAKE PEDAL CONTINUED TO BE PRESSED DOWN, THE PEDAL SANK TO THE FLOOR AND THE ACTUAL BRAKES DISENGAGED AND THE SUV ONCE AGAIN BEGAN FREE-ROLLING. I PUMPED THE BREAK PEDAL AND I GOT SOME BRAKING ACTION OUT OF THAT, ALTHOUGH NO SIGNIFICANTLY. I VEERED THE SUV INTO ONCOMING TRAFFIC LANE TO AVOID COLLISION WITH THE REAR OF CAR IN FRONT OF  ME, NEARLY CAUSING A HEAD ON COLLISION WITH THE ONCOMING CAR.  I WAS ABLE TO VEER BACK INTO MY LANE AND SLOW DOWN TO GET OUT OF THE ROADWAY, BUT THE BRAKES DID NOT WORK EXCEPT ONCE THE CAR WAS MOVING AT MINIMAL SPEED. WHEN I GOT OUT OF THE CAR, I EXAMINED THE ROTORS TO SEE IF THEY WERE HOT; THEY WERE NOT. I PUMPED ON THE BRAKE PEDAL SEVERAL TIMES, EACH TIME THE PEDAL SINKING TO THE FLOOR. AS I WAS PUMPING THE BRAKE PEDAL, LIQUIDS WERE SQUIRTING OUT FROM SOMEWHERE UNDER THE DRIVER'S DOOR. THE LIQUID CONTINUED LEAKING EVEN AS I STOPPED PUMPING THE BRAKE PEDAL. THERE WAS NO WARNING FOR THIS BRAKE FAILURE, AND THE BRAKES FUNCTIONED PROPERLY UP TO THIS POINT. I HAD THE CAR TOWED TO A MECHANIC. THIS WAS A SCARY EXPERIENCE FOR ME AND EVERYONE IN THE CAR. THE NEXT DAY, I CALLED THE DEALER TO REPORT THE INCIDENT TO GM, BUT THE DEALER COULD NOT PROVIDE ME ANY SPECIFIC INFORMATION HOW TO MAKE THE REPORT.  *TR",
        "vin": "1GNFK16Z36J"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "05/12/2016",
        "dateOfIncident": "05/09/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10864614,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 2500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TRAILER HITCH BROKE AT WELD AND RESULTED IN LOSS OF $25,000 TRAVEL TRAILER WHILE TRAVELING DOWN HILL",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,TRACTION CONTROL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/13/2015",
        "dateOfIncident": "10/01/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10790233,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CHEVROLET SUBURBAN. THE CONTACT STATED THAT WHILE ACCELERATING FROM A STOP, THE VEHICLE INITIALLY ACCELERATED THEN HALTED. THE \"TRACTION CONTROL ACTIVE\" MESSAGE WAS DISPLAYED ACROSS THE MESSAGE BOARD. THE FAILURE RECURRED ON NUMEROUS OCCASIONS. THE VEHICLE WAS TAKEN TO A DEALER MULTIPLE TIMES WHERE IT WAS DIAGNOSED THAT THE SHOCK ABSORBER AND HUBS NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED ON MULTIPLE OCCASIONS; HOWEVER, THE FAILURE PERSISTED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 50,000. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/19/2015",
        "dateOfIncident": "10/06/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10783463,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 2500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CHEVROLET SUBURBAN 2500. THE CONTACT STATED THAT THE HEATING AND AIR CONDITIONING FAILED TO SHUT OFF WHILE THE VEHICLE WAS NOT POWERED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 91,000.",
        "vin": "3GNFK16Z96G"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/01/2015",
        "dateOfIncident": "09/30/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10779106,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 1500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "CORROSION OF HARD BRAKE LINE AT DRIVER / LEFT SIDE REAR, PARTLY HIDDEN FROM VIEW. NOT SEEN DURING INSPECTIONS.     CONDITION DISCOVERED FOLLOWING SURFACE ROADWAY INCIDENT. VEHICLE WAS STATIONARY, IN DRIVE, POINTED DOWNHILL AT STOPLIGHT.  BRAKE PEDAL SLOWLY STARTED GOING DOWN.  PUMPING BRAKE HELPED A BIT, BUT SOON THE PEDAL STARTED FALLING AGAIN AND THE VEHICLE STARTED MOVING FORWARD.  PUTTING VEHICLE IN PARK PREVENTED VEHICLE FROM STRIKING STOPPED VEHICLES IN FRONT.   GOT OFF THE ROADWAY SHORTLY THEREAFTER AND DISCOVERED THE CORROSION AND LEAD MENTIONED ABOVE.   VEHICLE IS CURRENTLY IN REPAIR SHOP WITH $1800 SERVICE BILL.  BODY IS REQUIRED TO BE LIFTED OFF FRAME FOR REPLACEMENT LINES TO BE INSTALLED AND THAT IS *VERY* LABOR INTENSIVE.    RESEARCHED ONLINE AND FOUND NHTSA HAS INVESTIGATED THESE VEHICLES DURING THEIR PRODUCTION RUN OF 1999-2006 ON C/K/SUBURBAN/TAHOE MODELS.  VEHICLE WAS PURCHASED IN WASHINGTON STATE, WHERE SALT IS NOT USED ON ROADWAYS.",
        "vin": "1GNFK16T36J"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/15/2015",
        "dateOfIncident": "06/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10705990,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 1500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER YEARS OF HAVING MY SUBURBAN THE LIFT GATE LOCK ACTUATOR STOPPED WORKING LAST YEAR. I SEARCHED ONLINE AND FOUND A REPLACEMENT OEM ACTUATOR WHICH I PURCHASED. I HAD IT INSTALLED BUT WHEN I TRIED TO USE IT, IT WOULD NOT WORK PROPERLY. THE TRUNK WOULD UNLOCK WHEN THE REST OF THE VEHICLE WAS LOCKED AND VICE VERSA. THE COMPANY THEN SENT ME REPLACEMENT AS THAT WAS A DEFECTIVE PART. THE NEW PART WORKED UP UNTIL MID MARCH OF THIS YEAR AND HAS NOW STOPPED WORKING ALSO. CURRENTLY, WHEN I TRY TO UNLOCK THE TRUCK ALL I HEAR IS A SMALL BUZZ COMING FROM THE ACTUATOR, BUT IT DOESN'T MOVE, IT'S FROZEN AT THE LOCK SETTING. I AM SURPRISED CHEVY HAS NOT ISSUED A RECALL ON THIS PART BECAUSE I FIND THE SAME ISSUE OCCURRING TO OTHER PEOPLE'S VEHICLES ALL OVER THE WEB.  *TR",
        "vin": "1GNEC16Z36J"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/12/2015",
        "dateOfIncident": "03/07/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10693999,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS PULLING INTO MY DRIVEWAY AT APPROXIMATELY 15 MILES PER HOUR. MY BRAKE PEDAL WENT ALL THE WAY TO THE FLOOR AND TWO OF MY DASH LIGHTS ILLUMINATED (T/C (TRACTION CONTROL), AND BRAKE LIGHT, ALSO HAD THE READOUT \"SERVICE BRAKE SYSTEM\".  LUCKILY, I WAS ROLLING TO A STOP IN MY OWN DRIVEWAY AND AVOIDED HITTING MY OTHER PARKED CARS.  I INSPECTED THE BRAKE SYSTEM AND FOUND THAT BRAKE FLUID WAS LEAKING BETWEEN THE ABS UNIT AND THE DRIVER SIDE REAR TIRE (MORE SPECIFICALLY NEAR THE FUEL TANK) FROM THE METAL BRAKE LINE. THE BRAKE RESERVOIR WAS HALF FULL OF BRAKE FLUID AND COMPLETELY DRAINED WITHIN TEN MINUTES OF JUST SITTING IN MY DRIVEWAY . I INSPECTED FROM WHAT I COULD SEE CONCERNING THE  UNDERSIDE METAL BRAKE LINES; ALL BRAKE LINES ARE RUSTED AND BRITTLE AND WILL NEED REPLACED.   *TR",
        "vin": "3GNFK16ZX6G"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/30/2014",
        "dateOfIncident": "09/26/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10640102,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 1500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE APPROACHING EXIT RAMP IN DELAWARE (EXIT 1A) TRAFFIC SLOWED SO I BEGAN TO HIT MY BRAKES TO SLOW AND ALL OF A SUDDEN THE BRAKE PEDAL HIT THE FLOOR AND I COULD NOT STOP I ALMOST HIT THE VEHICLE IN FRONT OF ME WITH THE EXCEPTION OF FAST MANEUVERING OF WHICH MY DASH CAM CAUGHT, I SWERVED TO THE LEFT LANE TO AVOID A COLLISION THEN HIT THE EMERGENCY BRAKES AND GOT BACK INTO THE OFF RAMP THEN I REALIZED THAT THERE WAS NO BREAK PRESSURE AND SMOKE BELLOWING FROM UNDER THE HOOD OF MY VEHICLE I PULLED OVER TO INSPECT AND NOTICE BRAKE FLUID LEAKING. I TOOK THE VEHICLE TO NATIONAL TIRE AND BATTERY WHERE THEY INFORMED ME THAT I HAD A DOUBLE FRONT BRAKE LINE RUPTURE - I AM HAVING THEM REPLACE (A $1000 JOB) HOWEVER I'VE ASKED TO RETAIN THE BRAKE LINES AS PROOF.   *TR",
        "vin": "3GNFK16Z96G"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/16/2014",
        "dateOfIncident": "08/13/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10622651,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 1500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING WITH MY FRIEND AND OUR 6 CHILDREN AND I APPLIED THE BRAKES WHEN ANOTHER CAR IN FRONT STOPPED SUDDENLY. THE BRAKES DID NOT WORK AND THE PEDAL WENT TO THE FLOOR.  AT THE REPAIR SHOP ALL THE BRAKE LINES ARE BRITTLE.    *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/29/2014",
        "dateOfIncident": "05/19/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10606811,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 1500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 SUBURBAN WITH REAR DOOR ACTUATOR FAILURE STARTING MAY 19 2014, MILEAGE OF 68000 APPROXIMATELY, LOUD NOISE WITH LOCKING OF REAR DOOR BY EITHER REMOTE OR WHEN ENGAGED IN DRIVING. PERIODICAL FAILURE OF DOOR TO OPEN AT ALL.  *TR",
        "vin": "3GNFK16Z66G"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/24/2014",
        "dateOfIncident": "04/04/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10593893,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 1500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TRIED TO OPEN REAR LIFT GATE AND WINDOW. COULD NOT ACCESS EITHER. THERE IS NO EMERGENCY ACCESS, NO KEY OR MANUAL ENTRY. TOOK IT TO MECHANIC, CHECKED ALL FUSES, NO FAILURES THERE. APPARENTLY, THERE IS A SEPARATE MOTOR FOR THE LIFT GATE AND WINDOW. I WAS TOLD BY THE DEALER, YOU CAN NOT JUST BUY THE PART THAT IS FAILING, YOU MUST BUY THE WHOLE MOTOR, AND COST IS $450+ ,JUST FOR THE MOTOR !!  *TR",
        "vin": "3GNFK16U36G"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/22/2014",
        "dateOfIncident": "05/21/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10593369,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 1500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "JUST BOUGHT THIS VEHICLE A MONTH AGO WENT TO OPEN THE REAR LIFTGATE AND IT WON'T OPEN.  *TR",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/27/2013",
        "dateOfIncident": "10/01/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10557419,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SPECIFIC VEHICLE IS A 2006 SUBURBAN Z71 4-WHEEL DRIVE, 1/2-TON SUV.  ON MANY TAHOES, SUBURBANS AND OTHER GENERAL MOTORS SUV-TYPE VEHICLES, THE LIFT GATE ASSEMBLY CAN BECOME STUCK IN THE LOCKED POSITION OR IN THE UNLOCKED (UNSECURED) POSITION ANY TIME THE BATTERY HAS NO VOLTAGE.  IN THE CASE OF IT BEING LOCKED, THE LIFT GATE HAS NO MANUAL MEANS OF BEING OPENED - NO KEY INSERTION LOCATION WHATSOEVER.  (THIS APPLIES ALSO TO THE LIFT-GATE GLASS.)  THIS IS INDEED A VERY DANGEROUS SITUATION AND SHOULD HAVE BEEN RESOLVED MANY YEARS AGO. THIS COULD OCCUR IN A CRASH AS WELL AS ANY TIME THE BATTERY IS OLD OR HAS OTHERWISE LOST ITS CHARGE.  ELDERLY FOLKS SHOULD NOT BE EXPECTED TO CLIMB OVER THE REAR SEATS TO RETRIEVE THINGS STORED 'IN THE BACK,' BUT EVEN IF THEY COULD GET BACK THERE, THERE IS NO INSIDE MANUAL OPENER MECHANISM TO OPEN THE REAR LIFT GLASS OR LIFT GATE.  THERE ARE TIMES WHEN AN INFIRM PERSON MIGHT VERY WELL HAVE PLACED BABIES (OR PETS) IN THAT REAR COMPARTMENT AND IF IT IS NOT ABLE TO BE OPENED, AN EXTREME HAZARD COULD OCCUR.  FURTHERMORE, REPLACEMENT OF BRAKE LAMPS, PARKING LAMPS, AND SIGNAL LAMPS FOR THE REAR ARE ALL IMPOSSIBLE WITHOUT BEING ABLE TO OPEN THE REAR LIFT-GATE.  SIMPLY PUT, THERE SHOULD BE A MANUAL METHOD FOR OPENING THE LIFT GLASS AND THE LIFT GATE.  *TR",
        "vin": "1GNFK16Z86J"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/11/2013",
        "dateOfIncident": "11/01/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10551845,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 1500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING AT 60 MPH AND APPLIED BRAKES HARD TO AVOID HITTING DEER THAT CAME ON TO ROAD. VEHICLE BEGAN TO SLOW THEN SUDDENLY LOST NEARLY ALL BRAKING POWER AS PEDDLE WENT TO FLOOR . WENT WELL PAST AN UNCONTROLLED INTERSECTION THAT WAS THANKFULLY EMPTY OF TRAFFIC. SUBSEQUENT INSPECTION REVEALED TWO BURST BRAKE LINES WHERE 4 LINES ARE GROUPED ON FRAME NEAR BACK OF FRONT DRIVER DOOR. SEVERE RUST.  *TR",
        "vin": "3GNFK16Z06G"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/26/2013",
        "dateOfIncident": "08/01/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10549607,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 1500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BACK HATCH WON'T OPEN WITH POD AND THERE ARE NO OTHER WAYS TO GET IN.  I CAN'T OPEN IT FROM THE INSIDE OR OUTSIDE, AND THE WINDOW WON'T OPEN EITHER.  THIS IS A SAFETY HAZARD, AND I AM FINDING MANY OTHER PEOPLE ONLINE ARE HAVING THE SAME ISSUE AS I AM. *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "10/16/2013",
        "dateOfIncident": "10/14/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10548062,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 1500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "GM DESIGNED THIS CAR WITH A NO KEY ENTRY FOR THE REAR HATCH.  IT DOES NOT HAVE AN INTERNAL MANUAL UNLOCKING MECHANISM FOR THE HATCH.  IF THE CAR IS IN AN ACCIDENT, THERE WOULD BE NO WAY TO OPEN THE REAR HATCH.    ON TOP OF THIS, THE REAR HATCH LOCK ACTUATOR FAILS FOR THOUSANDS OF CUSTOMERS.  THIS EITHER LOCKS THE HATCH IN PLACE, OR LEAVES IT UNABLE TO BE LOCKED.      GM NEEDS TO DO A RECALL TO FIX THIS ISSUE.  IT IS UNSAFE, AND COSTING THOUSANDS OF CUSTOMERS UPWARDS OF A $400 REPAIR JUST TO CORRECT IT AT THE DEALER.  *TR",
        "vin": "1GNEC16Z66J"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "04/03/2013",
        "dateOfIncident": "05/01/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10507010,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "LATCH/ LOCK  JUST STOP WORKING, HAD TO CRAWL OVER SEAT AND TAP ON THE LATCH TO RELEASE TO OPEN. MAJORITY OF THE TIME I HAD NO SUCCESS IN OPENING LATCH TCH IS OPEN AND I DON'T HAVE A KEY TO UNLOCK OR TO LOCK. THE LATCH APPEARS TO BE DEFECTIVE.   *TR",
        "vin": "3GNFK16Z66G"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/17/2013",
        "dateOfIncident": "02/16/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10498414,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 1500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR LIFTGATE WILL NOT UNLOCK WITH KEY FOB OR INTERIOR DOOR LOCKS FROM THE DRIVER SIDE OR THE PASSENGER SIDE DOORS. THERE IS NO WAY TO MANUALLY UNLOCK OR OPEN THE LIFTGATE FROM INSIDE OR OUTSIDE THE VEHICLE.  *TR",
        "vin": "3GNFK16Z36G"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/12/2012",
        "dateOfIncident": "11/02/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10484049,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WOULD DRIVE FINE AT TIMES.  WHEN RESTARTED, ENGINE WOULD LOSE POWER, VERY SLUGGISH, UNABLE TO PICK UP SPEED. ON DASH, MESSAGE WOULD READ 'SERVICE STABILITY'. TOOK TO OUR LOCAL CHEVROLET DEALER, THEY WERE UNABLE TO REPAIR, THEY COULD NOT TELL ME WHY MESSAGE WOULD APPEAR, ABSOLUTELY CLUELESS TO THE PROBLEM. THEN TOOK MY VEHICLE TO MY LOCAL MECHANIC, HE STATED HE HAD FOUR OTHER GMC VEHICLES COME IN WITH THE SAME MESSAGE ON DASH.  HE STATED IT HAS SOMETHING TO DO WITH THE TRANSFER CASE.  THAT'S MORE THAN WHAT THE DEALER SAID.  MY MECHANIC STATED HE ATTEMPTED TO GET THE PART, BUT ITEM IS ON BACK ORDER FROM MANUFACTURER. DOES THIS INDICATE THAT MANY MANY MORE VEHICLES ARE EXPERIENCING THE SAME PROBLEM?  HAVE BEEN EXPERIENCING THIS PROBLEM FOR A WHILE. MY VEHICLE ONLY HAS 60,000 MILES, WAY UNDER THE AMOUNT OF MILES FOR A VEHICLE 6 YEARS OLD.  THIS HAS TO BE A DEFECT.  PLEASE HELP!!!!!  *TR",
        "vin": "1GNFK16Z76J"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/10/2012",
        "dateOfIncident": "05/09/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10458071,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2006 CHEVY SUBURBAN Z71 WITH JUST OVER 95,500 MILES.  THE REAR HATCHBACK/LIFTGATE LOCKING MECHANISM APPEARS TO HAVE FAILED.  THE VEHICLE WAS NOT IN AN ACCIDENT, AND NO OTHER EVENT OCURRED.  THE LOCK SIMPLY QUIT WORKING.  NEITHER THE DOOR NOR THE GLASS WILL UNLOCK.  THERE IS NO MANUAL WAY TO UNLOCK OR OPEN THE REAR DOOR WHEN THE POWER LOCKS ARE NOT WORKING.  THERE IS NOT AN EMERGENCY RELEASE TO POP THE REAR DOOR OR GLASS IN CASE OF EMERGENCY.  ALL OTHER DOORS ON THE VEHICLE ARE STILL FUNCTIONAL MANUALLY AND ELECTRONICALLY.  NO FUSES HAVE FAILED.  I HAVE NOT BEEN NOTIFIED OF A RECALL AND HAVE NOT FOLLOWED UP WITH THE DEALERSHIP OR A MECHANIC YET.    IN 2006/2007 WE ALSO EXPERIENCED AN ODD ELECTRICAL PROBLEM THAT THE DEALERSHIP COULD NOT REPRODUCE.  THE VEHICLE WOULD HAVE AN OBVIOUS ELECTRICAL ODOR/BURNING SMELL AND VARIOUS LIGHTING FAILURES AFTER BEING IN HEAVY SNOW ON THREE SEPARATE OCCASSIONS.  THE PROBLEM WAS LOGGED BUT NEVER OCCURRED AGAIN.  *TR",
        "vin": "3GNFK16Z36G"
    },
    {
        "components": "STEERING,ENGINE AND ENGINE COOLING,ELECTRONIC STABILITY CONTROL,TRACTION CONTROL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/23/2012",
        "dateOfIncident": "02/15/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10456128,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "STABILITY SYSTEM INDICATOR/TRACTION ACTIVE/TRACTION CONTROL INDICATOR COME ON WHEN MAKING LEFT HAND TURN SOMETIMES VEHICLE STALLS WHEN ACCELERATOR IS PRESSED AND \"TRACTION ACTIVE\" WILL ILLUMINATE ON THE DIC.  DEALER STATED THAT IT WAS A \"WHEEL HUB SENSOR\".  REPLACED LEFT WHEEL HUB ASSEMBLY, STILL HAVE SAME ISSUE.  IN WORK ON REPLACING RIGHT HAND WHEEL HUB ASSEMBLY TO SEE IF THIS CORRECTS ISSUE, BUT BY THE LOOK OF SOME OF THE OTHER RESPONSES IT WILL NOT.  NEED A RECALL IF THIS IS HAPPENING, POSSIBLE LIFE THREATENING SITUATION IF CAR STALLS WHEN TURNING THROUGH ONCOMING TRAFFIC.  *TR",
        "vin": "3GNEC16Z96G"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/17/2012",
        "dateOfIncident": "03/23/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10455582,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LIFT GATE ACTUATOR STOPPED WORKING.  WE ARE UNABLE TO OPEN THE LIFTGATE BY USING THE FOB OR UNLOCK BUTTON ON THE DRIVER/PASSENGER DOOR.  THERE IS NO EMERGENCY RELEASE OR KEY HOLE ON THE OUTSIDE OF THE LIFTGATE.  THE ONLY WAY TO UNLOAD OUR CARGO IS FROM THE REAR PASSENGER DOORS AND THEN REMOVE THE PANEL AND RELEASE THE DOOR LATCHES TO OPEN.  WE WERE ABLE TO \"FIX\" IT FOR A SHORT TIME, BUT THIS RESULTED IN A JOY BUZZER SOUND COMING FROM THE LIFTGATE ACTUATOR EVERYTIME THE DOOR LOCKED.  WE WERE HOPING TO TRY LOCKING THE DOOR LESS TO TRY NOT TO WEAR OUT THE PART, BUT WE HAVE ONLY 2 OPTIONS WITH LOCKING THE DOORS (WHEN PUTTING INTO GEAR OR REACHING 15 MPH) WHEN WE WOULD LIKE TO CHOOSE TO NOT HAVE THE DOORS AUTOMATICALLY LOCK AT ALL.  I'VE FOUND MANY PEOPLE ONLINE HAVE HAD THE SAME ISSUE/FRUSTRATION AND NO RECALL HAS BEEN MADE.        *JS",
        "vin": "3GNFK16Z86G"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/17/2012",
        "dateOfIncident": "04/16/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10455584,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "STABILITY SYSTEM WAS DISABLED WITH ENCODER ACTUATOR HAVING NO COMMUNICATION.  NEEDED TO REPLACE TRANSFER CASE TWO/FOUR WHEEL DRIVE ACTUATOR.  VEHICLE HAS NOT BEEN IN 4 WHEEL DRIVE IN MONTHS AND RANDOMLY \"FRIED.\"        *JS",
        "vin": "3GNFK16Z86G"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/23/2011",
        "dateOfIncident": "10/01/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10436855,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2006 SUBURBAN LOSES POWER IMMEDIATELY AFTER INITIAL ACCELERATION AND A \"TRACTION ACTIVE\" WARNING APPEARS ON MY DASHBOARD. THIS HAS CAUSED MY VEHICLE TO BECOME TRAPPED IN FRONT OF ONCOMING TRAFFIC WHEN ATTEMPTING TO MAKE LEFT HAND TURNS. THIS HAS HAPPENED REPEATEDLY AND MY WIFE NOW FEARS FOR HER LIFE AND REFUSES TO DRIVE THE TRUCK. IT HAPPENED TO ME LAST NIGHT AND AN ONCOMING CAR HAD TO SWERVE INTO TRAFFIC TO AVOID RAMMING MY STALLED VEHICLE. THE INTERNET IS LITTERED WITH SIMILAR STATEMENTS. THIS APPEARS TO BE A SYSTEMIC PROBLEM WITH GM VEHICLES AND IT POSES A THREAT OF FATALITIES SUBSEQUENT TO SUCH A FAILURE.    WHY HAVE THERE BEEN NO RECALLS FOR WHAT APPEARS TO BE A DESIGN FLAW THAT IS IMPACTING AND THREATENING THE SAFETY OF EVERY GM TRUCK OWNER?  *TR",
        "vin": "3GNFK16U56G"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/19/2011",
        "dateOfIncident": "09/17/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10425999,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CHEVROLET SUBURBAN. THE CONTACT STATED THAT THE REAR LIFTGATE WOULD NOT OPEN FROM THE INTERIOR OR EXTERIOR OF THE VEHICLE. THE KEY WOULD ALSO NOT ALLOW THE LIFTGATE TO BE OPENED.  THE VEHICLE WAS NOT TAKEN TO THE DEALER NOR WAS THE MANUFACTURER NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 96,000.",
        "vin": "1GNFK16Z06J"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "08/23/2011",
        "dateOfIncident": "06/15/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10421221,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS  A 2006 CHEVROLET SUBURBAN. THE CONTACT STATED THAT THE REAR LIFTGATE WOULD NOT LOCK OR UNLOCK WITHOUT FORCE. THE VEHICLE WAS NOT TAKEN TO THE DEALER. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE WHO ADVISED THAT THE FAILURE MAY HAVE BEEN CAUSE BY A DEFECTIVE LOCKING MECHANISM AND REFERRED HIM TO THE DEALER TO VERIFIED THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGE WAS 89,000.  UPDATED 09/21/11 *BF  THE CONSUMER STATED WHEN HE WENT TO USE THE REMOTE KEY TO UNLOCK THE REAR HATCH BACK DOOR, IT WOULD NOT UNLOCK. THE DOOR DOES NOT HAVE A KEY LOCK, SO HE WAS UNABLE TO UNLOCK THE DOOR WITH THE KEY. THERE IS NO WAY TO GET IN OR OUT OF THE REAR HATCH BACK DOOR, WHEN THE ELECTRIC LOCK IS NOT WORKING.  UPDATED 10/11/11",
        "vin": "3GNEC16Z96G"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "08/05/2011",
        "dateOfIncident": "07/28/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10417179,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE A 2006 Z-71 SUBURBAN , AND THE REAR LIFT GATE AND GLASS WILL NOT OPEN , CAN'T HEAR IT LOCK OR UNLOCK , NO INSIDE HANDLE OR WAY TO UNLOCK MANUALLY, NOT SAFE .....*TT",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/26/2011",
        "dateOfIncident": "01/01/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10415238,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 1500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WE LEFT THE HOTEL IN DAYTONA BEACH AND STOPPED FOR BREAKFAST. WE THEN WERE GOING TO SEE THE RACETRACK ,AFTER GOING ABOUT 3 MILES THE \"ENGINE COOLANT OVERHEATING\" LIGHT CAME ON. I IMMEDIATELY PULLED INTO A NAPA STORE AND CHECKED THE COOLANT LEVEL WHICH WAS NORMAL.   I CHANGED THE THERMOSTAT WHICH DIDN'T HELP SO I CHANGED THE WATERPUMP WHICH DIDN'T HELP.I HAD THE CAR TOWED TO A GARAGE. ON MONDAY THE MECHANIC HAD PULLED ONE HEAD AND THE VALVES WERE WARPED.   AFTER DISCUSSING MY OPTIONS I HAD A NEW ENGINE INSTALLED ALONG WITH A RADIATOR.  THE OVERHEATING HAPPENED SO FAST (3 MILES ),THERE WAS NO WARNING OTHER THAN ENGINE COOLANT OVERHEATING.THERE WAS NO STEAM FROM THE OVERFLOW SO THERE MUST HAVE BEEN BLOCKAGE IN THE MOTOR.(MY OPINION).  *TR",
        "vin": "1GNFK16Z06J"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/22/2011",
        "dateOfIncident": "09/21/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10414741,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 1500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE A/C WORKS INTERMITTENT AND THEN NOT AT ALL.  BURNING SMELL COMING FROM VENTS. THE RESISTOR AND CONNECTOR HAVE BEEN THE PROBLEM AND REPLACED. FIRST TIME UNDER WARRANTY BY DEALERSHIP. SECOND TIME BY ME A YEAR AGO AND NOW IT IS HAPPENING AGAIN.  VERY UNSAFE. THE WIRES GET VERY HOT AND MELT. IT IS A FIRE HAZZARD.  *TT",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/14/2011",
        "dateOfIncident": "12/02/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10395859,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 1500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG LIGHT INTERMITTANTLY ILLUMINATES.  SOMETIMES FOR MINUTES, SOMETIMES FOR MONTHS.  HAS BEEN HAPPENING FOR THE LAST 3 YEARS.  TOOK VEHICLE INTO LASH CHEVROLET, THEY COULD FIND NOTHING AND RESET THE SYSTEM.  AIRBAG LIGHT ILLUMINATED THE NEXT DAY.  I TRAVEL EXTENSIVELY, AND AM CONSTANTLY COMING IN CONTACT WITH GM 1500/2500 SERIES TRUCKS, VANS AND SUV'S WITH THE AIRBAG LIGHT ILLUMINATED.  THE OWNERS OF THESE VEHICLES HAVE STORIES THAT MIRRIOR MY EXPERIENCE.  *TR",
        "vin": "3GNFK16Z96G"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/24/2011",
        "dateOfIncident": "03/15/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10392804,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CHEVROLET SUBURBAN. THE CONTACT STATED THAT THE VEHICLE LIFTGATE AND REAR GLASS WOULD NOT OPEN. THE VEHICLE WAS NOT TAKEN TO THE DEALER NOR WAS THE MANUFACTURER CONTACTED TO REPORT THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGE WAS 67,000.",
        "vin": "3GNFK16Z16G"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/25/2010",
        "dateOfIncident": "06/24/2010",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10339968,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 1500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNED A 2006 CHEVROLET SUBURBAN 1500. THE CONTACT STATED WHILE THE VEHICLE WAS PARKED IN THE GARAGE, THE VEHICLE CAUGHT ON FIRE. THE FIRE DEPARTMENT WAS CALLED AND THE FIRE WAS EXTINGUISHED. THERE WERE NO INJURIES. A FIRE REPORT WAS AVAILABLE. THE ORIGIN OF THE FIRE WAS AN ELECTRICAL WIRING WITHIN THE INSTRUMENT PANEL. THE VEHICLE WAS LEFT ON THE CONTACT'S PROPERTY WHERE HE WAS AWAITING AN INVESTIGATION BY HIS INSURANCE COMPANY. THE MANUFACTURER WAS NOT CONTACTED AS OF YET. THE FAILURE AND CURRENT MILEAGE WAS 32,000.",
        "vin": "1GNFK16ZX6J"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/27/2010",
        "dateOfIncident": "05/02/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10332556,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 1500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING IN A 55MPH ZONE, VEHICLE TRANSMISSION FAILED. IT APPEARED THAT THE AUTO 4X4 SWITCH WAS CHANGING. PLACED VEHICLE BACK IN 2 WHEEL DRIVE, DRIVING 55MPH, TRANSMISSION FAILED AGAIN. WHEN SWITCH WAS SET IN AUTO 4X4, THE VEHICLE RAN IN 4 WHEEL DRIVE BUT NO OTHER SETTINGS WORKED PROPERLY. I HAVE HAD MULTIPLE DIAGNOSIS ATTEMPTS. THERE ARE BULLETINS ON THE AUTO 4X4 ACTUATOR AND ON A TRANSFER CASE MOTOR SENSOR. *TR",
        "vin": "1GNFK16Z56J"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/26/2010",
        "dateOfIncident": "05/26/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10332365,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 1500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 CHEVROLET SUBURBAN 1500. THE REAR LIFT GATE FAILED AND COULD NOT BE OPENED MANUALLY. THE CONTACT PLANNED TO TAKE THE VEHICLE TO THE DEALERSHIP FOR DIAGNOSIS. THE FAILURE AND THE CURRENT MILEAGES WERE 34,500.",
        "vin": "1GNFK16ZX6J"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/25/2010",
        "dateOfIncident": "04/24/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10327327,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 1500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I WENT TO MY LOCAL CHEVY DEALER SERVICE DEPT. TO REPORT A PROBLEM WITH MY STEERING MECHANISM - SEVER CLUNKING, RATTLING FELT IN THE STEERING WHEEL WHILE DRIVING.  THE SERVICE REP STATED THAT THIS IS A VERY COMMON PROBLEM WITH THE SUBURBANS.  THIS HAS BEEN AN ONGOING PROBLEM WITH MY VEHICLE, STARTING AT ABOUT 32K MILES. *TR",
        "vin": "1GNEC16Z86J"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/25/2010",
        "dateOfIncident": "02/20/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10314244,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 1500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "LAST SATURDAY, FEBRUARY 20, 2010, AS I ACCELERATED FROM A RAMP TO JOIN TRAFFIC ON THE CAPITAL BELTWAY OUTSIDE WASHINGTON DC, THE CAR'S GAS PEDAL GOT STUCK AND DID NOT RETRACT WHEN I GOT MY FOOT OFF THE ACCELERATOR. BY NOW I WAS IN THE MIDDLE LANES AND WAS ONLY ABLE TO MAINTAIN THE SPEED OF THE VEHICLE BY DEPRESSING THE BRAKE PEDAL ' WHICH THANKFULLY WAS STILL OPERATIONAL. THE GAS PEDAL GOT UNSTUCK ON ITS OWN AFTER A SHORT WHILE AND I PROCEEDED ON MY TRIP WITHOUT INCIDENT.    MY WIFE TOLD ME SHE HAS HAD TWO ALMOST SIMILAR EXPERIENCES WITH THIS VEHICLE, IN 2007 AND 2008. BOTH TIMES THE CAR KEPT MOVING EVEN AFTER SHE TOOK HER FOOT OFF THE GAS PEDAL.  AT THE TIME SHE THOUGHT SHE HAD ACCIDENTALLY ENGAGED THE CRUISE CONTROL, WHICH SHE NORMALLY NEVER USES. BOTH TIMES THE PROBLEM DISAPPEARED AFTER A LITTLE WHILE. *TR",
        "vin": "1GNFK16Z16J"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/11/2010",
        "dateOfIncident": "01/01/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10308798,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING CLUNKS AND LOOSE, WORSE WHEN GOING AROUND CURVES AND DURING BRAKING.    THIS IS A KNOW FAULTY DESIGN OF THE INTERMEDIATE STEERING SHAFT  THAT CAUSED THE MANUFACTURE TO REDESIGN PART.  HOW MANY PEOPLE HAVE TO BE INJURED BEFORE GM ISSUES A RECALL???? *TR",
        "vin": ""
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "10/29/2009",
        "dateOfIncident": "08/01/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10290254,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 1500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTIFICATION OF FAULTY SEAT BELT IN CHEVY SUBURBAN   I AM WRITING TO NOTIFY YOU ABOUT A SEAT BELT DEFECT IN OUR 2006 CHEVY SUBURBAN THAT COULD HAVE RESULTED IN THE INJURY OR DEATH OF OUR 8-YEAR OLD SON.    MY WIFE LEFT TWO OF OUR KIDS READING IN THE MIDDLE ROW BUCKET SEATS OF THE CAR WITH THEIR SEAT BELTS ON, AND WAS GONE VERY BRIEFLY. WHEN SHE GOT BACK OUR SON WAS ALL ENTANGLED IN THE SEAT BELT AND WAS HAVING DIFFICULTY BREATHING BECAUSE OF THE TIGHTNESS OF THE BELT'S COILS AROUND HIS LOWER ABDOMEN. THE SON LATER EXPLAINED THAT HE GOT ENTANGLED WHEN HIS BOOK FELL INSIDE THE CAR AND HE TRIED TO RETRIEVE IT BEFORE RELEASING THE SEAT BELT. MY WIFE'S ATTEMPTS TO GET THE BELT TO RELEASE ONLY SEEMED TO MAKE IT TIGHTER. SHE FLAGGED DOWN TWO OFF-DUTY POLICE OFFICERS WHO ALSO FAILED TO GET THE BELT LATCH TO RELEASE. IN THE END, THE POLICE OFFICERS OPTED TO SIMPLY CUT THE BELT AND FREE THE BOY. WE ARE THANKFUL THAT THIS INCIDENT HAD A HAPPY ENDING, BUT HOPE YOU CAN LOOK INTO THIS MATTER AND TAKE ANY NECESSARY CORRECTIVE ACTION. *TR",
        "vin": "1GNFK16Z16J"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "10/27/2009",
        "dateOfIncident": "10/24/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10289931,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006   CHEVY SUBURBAN REAR HATCH DOES NOT UNLOCK, LOCK HAS FAILED, AND HAS NO MANUAL ABILITY TO UNLOCK , WHICH IS A SAFETY ISSUE. *TR",
        "vin": ""
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "08/15/2009",
        "dateOfIncident": "08/14/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10280495,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 1500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 CHEVY SUBURBAN REAR LIFTGATE WILL NOT UNLOCK. I'VE INVESTIGATED THIS MATTER ON THE INTERNET AND FOUND TONS OF PEOPLE WITH OTHER CHEVY MODELS EXPERIENCING THE SAME ISSUES. CHEVY DIDN'T INSTALL ANY TYPE OF KEY ENTRY FROM OUTSIDE OR A RELEASE HANDLE INSIDE. WITH THIS OCCURRING ALL THE TIME WITH NUMEROUS VEHICLES ALL OVER THE COUNTRY, CHEVY SHOULD BE RECALLING THIS PRODUCT TO FIX IT. IF SOMETHING HAPPENED IN ONE OF THESE VEHICLES LIKE A FIRE AND A CHILD WAS TO GET TRAPPED OR AN ADULT THIS WOULD BE DISASTER... *TR",
        "vin": "3GNEC16Z66G"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/18/2008",
        "dateOfIncident": "07/28/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10238705,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 1500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY CAB STARTING FILLING WITH SMOKE AND THE SMELL OF BURNING WIRES. I PULLED OVER TO SEE WHAT IT COULD BE AND TURNED OFF THE RADIO AND AIR CONDITIONER. I DID NOT NOTICE ANYTHING THAT LOOKED LIKE IT WAS SMOKING OR ON FIRE SO I CONTINUED ON. WHEN I TRIED TO TURN THE AIR CONDITIONER ON IT DIDN'T COME ON FOR A MINUTE SO I LOOKED UNDER THE HOOD AT THE RELAY CENTER AND THERE WAS NOTHING WRONG THERE WHEN I GOT BACK IN THE TRUCK IT WAS RUNNING AGAIN. A FEW DAYS LATER THE SAME THING HAPPENED SO I PULLED MY DASH APART AND CHECKED THE WIRING COULDN'T FIND ANYTHING WRONG. THEN IT HAPPENED WHERE MY AIR CONDITIONER SHUT OFF AND HEAVY SMOKE STARTED COMING FROM UNDER THE GLOVE BOX AREA. I PULLED THE AIR CONDITIONING SILENCER OFF AND NOTICED THE WIRING HARNESS PLUGGED INTO THE BLOWER MOTOR RESISTOR WAS ABOUT TO CATCH ON FIRE SO I UNPLUGGED IT BEFORE IT COULD HAPPEN.  *TR",
        "vin": "1GNFK16Z86J"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "07/22/2008",
        "dateOfIncident": "07/02/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10235329,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 1500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 CHEVROLET SUBURBAN 1500.  THE CONTACT STATED THAT THE TRUNK LIFT WOULD NOT OPEN ON THE VEHICLE.  CURRENTLY, THERE IS NO ACCESS TO THE TRUNK FROM THE EXTERIOR NOR THE PASSENGER COMPARTMENT OF THE VEHICLE.  THE FAILURE MILEAGE WAS 45,000 AND CURRENT MILEAGE WAS 45,023.",
        "vin": "1GNEC16Z66J"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "08/02/2007",
        "dateOfIncident": "08/01/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10198251,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 1500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 CHEVROLET SUBURBAN 1500.  WHEN THE CONTACT SHUT OFF THE VEHICLE AND CLOSED THE DOOR, SHE NOTICED THAT THE CHILD'S HEAD WAS WEDGED AND STUCK IN THE WINDOW.  THE CHILD WAS SEATED IN THE REAR SEAT.  HIS HEAD WAS COMPLETELY OUT OF THE VEHICLE.  THE CONTACT QUICKLY RAN TO RESTART THE VEHICLE AND ROLLED THE WINDOW DOWN.  SHE BELIEVES THAT THE WINDOW SHOULD HAVE A SENSOR TO PREVENT A CHILD OR ANYONE ELSE FROM BECOMING STUCK WHILE THE WINDOW IS ROLLING UP.   THE CURRENT AND FAILURE MILEAGES WERE 18,000.  UPDATED 09/12/07. *JB",
        "vin": "1GNFK16U16J"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/07/2007",
        "dateOfIncident": "02/06/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10181862,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 1500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*- THE  CONTACT TOOK HIS 2005 CHEVROLET SUBURBAN INTO THE DEALER TO GET A STANDARD WHEEL ALIGNMENT.  AT THE DEALER FOUND THAT THE SUSPENSION WAS NOT EVEN, DUE TO A BRACKET NOT BEING INSTALLED CORRECTLY.  THE DEALER STATED THAT THEY WOULD HAVE TO REPLACE THE FRONT SUSPENSION BRACKET AND WILL NEED A FRONT END ALIGNMENT ONCE BRACKETS ARE FIXED.  THE CONTACT DOES NOT HAVE VIN AND WILL CALL BACK LATER.",
        "vin": ""
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "05/24/2006",
        "dateOfIncident": "05/23/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10158145,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 1500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE THE VEHICLE WAS PARKED; A CHILD IN THE REAR SEAT, OUTSIDE OF A CHILD SAFETY SEAT, BECAME ENTANGLED IN THE REAR PASSENGER SEAT BELT.  THE SEAT BELT LOCKED AND ALL ATTEMPTS TO FREE THE CHILD ONLY MADE THE BELT TIGHTER.  ASSISTANCE WAS OBTAINED FROM AN OUTSIDE SOURCE THAT PROVIDED SCISSORS TO CUT THE BELT AND FREE THE CHILD. THE CHILD  SUSTAINED BRUISES TO THE NECK.  TOOK THE CHILD TO THE DOCTOR  TO CHECK THE NECK BRUISES. THE DOCTOR STATED THAT THEY WILL WARN  OTHER PATIENTS OF THE DANGER ASSOCIATED WITH THE SEAT BELTS.  THE CONTACT STATED THERE SHOULD BE A SAFETY RELEASE TO ELIMINATE A SERIOUS  SITUATION, A RELEASE BUTTON HAS TO BE ADDED.  UPDATED 06/05/2006.  *AK  *TS",
        "vin": "1GNFK16966J"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "11/14/2005",
        "dateOfIncident": "09/30/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10142572,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 1500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "UNABLE TO GET IN TO REAR HATCH DUE TO A BATTERY FAILURE     CHEVY HAS REMOVED THE KEY LOCK ON THE REAR HATCH.  *NM",
        "vin": "1GNFK16Z06J"
    }
]