[
    {
        "components": "STEERING,ELECTRICAL SYSTEM,STRUCTURE,LATCHES/LOCKS/LINKAGES,TIRES,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "09/19/2006",
        "dateOfIncident": "08/01/2006",
        "fire": false,
        "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10169079,
        "products": [
            {
                "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
                "productMake": "FLEETWOOD",
                "productModel": "AMERICAN HERITAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "SUBMISSION OF DEFECTIVE 2006 AMERICAN HERITAGE COACH PURCHASED. *TS  ON THREE OCCASIONS THE ELECTRICAL SYSTEM FAILED CAUSING THE LIGHTS TO GO OUT ON THE COACH.  ON ONE OCCASION THE ONLY WAY THE OWNERS COULD GET THE COACH BACK TO THE CAMPGROUND WAS FOR THEIR SON TO SIT ON THE FRONT DASH SHINING A FLASHLIGHT SO THEY COULD SEE THE ROAD.  THE CONSUMER RESCINDED THE CONTRACT AND DEMANDED FULL REFUND BECAUSE THE COACH DID NOT CONFORM TO THE REQUIREMENTS OF THE CONTRACT.  THE NAVIGATION SYSTEM HAD THE INCORRECT SOFTWARE AND WOULD NOT FUNCTION.  A FAULTY SOLENOID CAUSED THE COACH NOT TO CRANK.  THE CONSUMER FOUND THREE WATER LEAKS, TWO IN THE FRONT AND ONE ON THE DRIVER'S SIDE NEAR THE TABLE.  THE AIR BAG TOUCHTONE WENT OFF.  THE CONSUMER WAS ABLE TO PULL OVER AND RESET IT.  THE HEADLIGHT FAILED DURING A RAIN STORM.  THE CONSUMER WAS ABLE TO REPLACE A FUSE TO GET THEM TO FUNCTION.  TWO ROWS OF INTERIOR LIGHT BLEW OUT WHILE THE CONSUMER WAS USING THE ROTISSERIE.   THE ROTISSERIE CONTINUED TO WORK BUT THE LIGHT WOULD NOT COME BACK ON.  THE LEVELING SYSTEM MALFUNCTIONED AND STARTED BEEPING CONSTANTLY. ONE REAR TIRE WAS OUT OF ROUND.  THE GENERATOR SURGED.  THE STEERING WHEEL PERIODICALLY LOCKED IN PLACE AND WOULD NOT MOVE.  THE SCREEN DOOR LATCH NEEDED TO BE ADJUSTED.  *NM",
        "vin": "4VZAU1P916C"
    }
]