[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/22/2011",
        "dateOfIncident": "08/20/2011",
        "fire": false,
        "manufacturer": "UNIVERSAL TRAILER CORP. INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10426810,
        "products": [
            {
                "manufacturer": "UNIVERSAL TRAILER CORP. INC.",
                "productMake": "ELITE",
                "productModel": "LIVING QUARTER",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "614RST",
                "productYear": "9999",
                "size": "P235/85R16",
                "type": "Tire"
            }
        ],
        "summary": "I OWN A 2006 ELITE 3 HORSE W/LIVING QUARTERS TRAILER THAT HAS GOODYEAR 614RST, SIZE (235/85/R16) TIRES.  ON 8-20-11,  DRIVING 70 MPH ON I-90 IN MN,HEARD LOUD BOOM AND NOTICED THAT  RIGHT REAR TIRE HAD BLOWN OUT AND  TREAD FROM TIRE WAS GONE.  A JEEP PATRIOT PASSED AND IMMEDIATELY STOPPED IN FRONT OF US. THAT VEHICLE WAS DAMAGED FROM  TREAD HITTING WINDSHIELD (SHATTERED) AND FRONT PASSENGER FENDER, ALSO DAMAGE WAS DONE TO OUR ELITE TRAILER.  AFTER REPLACING TIRE WITH  SPARE,PROCEEDED TO SIOUX FALLS,. PURCHASED A NEW 614 RST GOODYEAR TIRE.  ON 8-21-11, 40 MILES FROM RAPID CITY, SD ON I-90, LEFT REAR TIRE BLEW OUT AND DAMAGED LEFT REAR OF ELITE TRAILER.  TIRE WAS REPLACED WITH SPARE.  UPON ARRIVAL TO CUSTER CAMPGROUND, ANOTHER TIRE WAS GOING FLAT. AT   GOODYEAR DEALER IN RAPID CITY, I WAS INFORMED THAT THESE TIRES WERE MADE THE 8TH WEEK OF 2006 AND THEY RECOMMENDED THAT REMAINING 3 TIRES AND SPARE BE REPLACED. I WAS INFORMED THAT RECREATIONAL VEHICLE TIRES AFTER 5 YEARS OF AGE WOULD BLOW OUT.  REMAINING TIRES AND SPARE WERE REPLACED.  THE DEALER THAT SOLD THE ELITE TRAILER WAS CALLED AND ALSO INFORMED ME WITHOUT KNOWING OF WHY I CALLED, THAT HE BET I WAS HAVING TIRE BLOWOUTS.  THE DEALER KNEW THAT MY VEHICLE WAS 5 YEARS OLD AND HAD SEVERAL  RECREATIONAL VEHICLES/ HORSE TRAILERS THAT AFTER TIRES TURNED 5 YEARS OLD, THE OWNERS HAD TIRES BLOWOUTS. THIS PROBLEM IS MORE SEVERE WITH ANY RECREATIONAL VEHICLE THAT IS ONLY USED A COUPLE TIMES OUT OF THE YEAR.  OUR TRAILER IS STORED INSIDE AND THE TIRES WERE ON WOOD BLOCKS, THE TIRES HAD LESS THAN 14,000 MILES.  WE WERE NOT INFORMED THAT RV'S OR HORSE TRAILERS THAT SIT MORE THAN 3 MONTHS IN A ROW SHOULD BE JACKED UP TO TAKE ALL WEIGHT OFF THE TIRES.  GOODYEAR HAS PLACED THIS INFORMATION ON THEIR WEB SITE UNDER RV TIRE STORAGE.  THEIR WAS NO INFORMATION ABOUT THIS DURING PURCHASE OF ELITE TRAILER OR TIRES,  OUR TRAILER IS JACKED UP NOW AND ALL WEIGHT IS REMOVED FROM TIRES. ( SEE 10423917  UPDATED 10/11/11  *BF  *TR",
        "vin": "5MKWG272260"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/06/2011",
        "dateOfIncident": "08/20/2011",
        "fire": false,
        "manufacturer": "UNIVERSAL TRAILER CORP. INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10423917,
        "products": [
            {
                "manufacturer": "UNIVERSAL TRAILER CORP. INC.",
                "productMake": "ELITE",
                "productModel": "LIVING QUARTER",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "614RST",
                "productYear": "9999",
                "size": "P235/85R16",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 ELITE LIVING QUARTER WITH GOODYEAR 614RST, SIZE (235/85/R16) TIRES. WHILE DRIVING APPROXIMATELY 70 MPH THE CONTACT HEARD A LOUD BOOMING NOISE AND NOTICED THROUGH HIS SIDE MIRROR THAT THE REAR DRIVERS SIDE TIRE BLEW OUT. THE CONTACT REPLACED THE TIRE WITH THE SPARE. THE REAR PASSENGER TIRE ALSO BLEW OUT ALMOST IMMEDIATELY. THE VEHICLE WAS TAKEN TO THE TIRE SHOP WHERE ALL OF THE TIRES WERE REPLACED. THE VIN AND DOT WERE NOT AVAILABLE. THE APPROXIMATE FAILURE MILEAGE WAS 14,000.     UPDATED 10/11/11  *BF  UPDATED 3/29/12 *CN",
        "vin": ""
    }
]