[
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/18/2021",
        "dateOfIncident": "05/17/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11417656,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "Not quite sure what component or system is failing/malfunctioning. Best way to describe what is happening, \"Death Wobble\". No other simpler way to put it. No auto store/dealer has any solid answer. Simply put, almost killed my entire family on the highway and not to mention other drivers on the highway. Driving fine then any bumps/grooves in the road instantly sends the entire vehicle into this VIOLENT shaking mess. To stop the shaking, we have to TRY (because once it starts shaking, it's almost like the steering is freezing up) to stop the vehicle completely. Once stopped, we take off like nothing ever happened until the next set of bumps/grooves. We have taken the truck to auto mechanics, we explain what is going on and INSTANTLY they inform us that we are not alone in this and there's really nothing you can do without constantly changing parts, etc. but there is \"no\" fix. No warnings, messages, nothing. Basically have to hold on for dear life and ride in the far right lanes so you have a better chance of pulling off on the side of the road without being smashed to death. We literally fear for our families lives in this truck but what can you do when it's pretty much all you got.",
        "vin": "1FTSW21P56E"
    },
    {
        "components": "STRUCTURE,WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/02/2021",
        "dateOfIncident": "02/18/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398709,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TRAVELING STRAIGHT ON THE INTERSTATE JUST BELOW THE SPEED LIMIT. I HEARD AN ODD NOISE FELT THE TRUCK FEEL UNSTABLE. I SLOWLY COASTED TO A HALT TO FIND THAT MY REAR PASSENGER TIRE HAD BLOWN OUT. THE ENTIRE SIDEWALL WAS DISINTEGRATED AND THE TIRE WAS DETACHED FROM THE RIM. IT BENT IN MY THE REAR QUARTER PANEL OF MY BED CAUSING AN ESTIMATED $1200 IN DAMAGE.",
        "vin": "1FTSW21P46E"
    },
    {
        "components": "STEERING,SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/19/2020",
        "dateOfIncident": "09/19/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11359926,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DEATH WOBBLE WHILE ON FREEWAY GOING 45 + MPH",
        "vin": "1FTSW21P66E"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/18/2020",
        "dateOfIncident": "08/15/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350093,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2006 FORD F 250,  ON SATURDAY WHILE DRIVING THE VEHICLE ON THE HIGHWAY I NOTICED A WET STREAK BEHIND ME SO I PULLED OVER AND NOTICED GAS GUSHING OUT OF A HOLE IN THE TANK. FORTUNATELY I WAS IN A RURAL AREA CLOSE TO HOME, SO I DROVE IT THE REST OF THE WAY HOME AND PARKED IT IN A FIELD, AWAY FROM ANY BUILDINGS TO ALLOW THE 30+ GALLONS OF GAS TO DRAIN OUT.  THE CAUSE OF THE LEAK WAS ONE OF THE STRAPS THAT SECURES THE FUEL TANK BROKE (RUSTED IN HALF) AND THE GAS TANK DROPPED DOWN AND WAS DRAGGING AGAINST THE HIGHWAY.  I ATTACHED A PHOTO OF THE STRAP THAT BROKE",
        "vin": "1FTNF205X6E"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/06/2020",
        "dateOfIncident": "07/31/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343646,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING ON PENNSYLVANIA TURNPIKE AT APPROX. 75 MPH I HIT BUMP  AND THE FRONT END OF MY TRUCK STARTED  BOUNCING AND STEERING WHEEL WAS SHAKING SO BAD I COULD HARDLY CONTROL MY TRUCK.  ONCE I SLOWED DOWN ENOUGH X THE SHAKING STOPPED.",
        "vin": "1FTSW21586E"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/21/2020",
        "dateOfIncident": "06/26/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11340768,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TRAVELING ON I-40 EAST BETWEEN I-95 AND WILMINGTON NC. I WAS TRAVELING 75 MPH  WHEN I HIT A BUMP AND THE TRUCK FRONT END STARTED SHAKING VIOLENTLY AND UNCONTROLLABLY. I THOUGHT THE STEERING WHEEL WAS GOING TO COME LOOSE. I IMMEDIATELY HIT THE BRAKES, AND HAD TO ALMOST COME TO A COMPLETE STOP TO RECOVER CONTROL. THANKFULLY THERE WAS NO ONE TRAVELING TO CLOSE BEHIND ME OR IT WAS HAVE PROBABLY BEEN A BAD ACCIDENT. THIS HAPPENED 2 MORE TIMES BEFORE I GOT TO MY DESTINATION. IT HAS ALSO HAPPENED AT 45 MPH AFTER HITTING A POTHOLE OR A BUMP IN THE ROAD. IT IS VERY FRIGHTENING WHEN IT HAPPENS.",
        "vin": "1FTSW21P56E"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/04/2020",
        "dateOfIncident": "10/10/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316066,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ALONG AT HIGHWAY SPEED OR SPEED AS LOW AS 35 MPH, ON AN UNEVEN SURFACE OR OVER MINOR POTHOLES THE FRONT SUSPENSION WILL BEGIN TO VIOLENTLY SHAKE EFFECTING STEERING AND CONTROL OF THE VEHICLE. IN ORDER TO REGAIN CONTROL YOU NEED TO RAPIDLY DECREASE SPEED THAT CAN AT TIMES BE UNSAFE UNDER CERTAIN DRIVING SITUATIONS.",
        "vin": "1FTSW21P16E"
    },
    {
        "components": "STEERING,SUSPENSION,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/03/2020",
        "dateOfIncident": "03/03/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11315945,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AT SPEEDS OF OVER 50 MPH, THE VEHICLE SHAKES VIOLENTLY TO THE POINT OF LOSING CONTROL OF STEERING. IN ADDITION, AT SPEEDS OF OVER 15 MPH, THE STEERING WHEEL HAS SO MUCH PLAY THAT ROUGH ROADS CAUSE THE VEHICLE TO TRAVEL LEFT OR RIGHT AND HUGE CORRECTIONS NEED TO BE MADE IN ORDER TO KEEP FROM DRIFTING INTO OTHER LANES. BOTH THESE ISSUES ARE CONSITENT",
        "vin": "1FTSW21Y06E"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/25/2019",
        "dateOfIncident": "12/23/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11291160,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS TRAVELING DOWN INTERSTATE 24 AFTER JUST FUELING UP WHEN HIT A ROUGH SPOT ON THE HIGHWAY AND THE FUEL TANK DROPPED OUT OF THE TRUCK LEAVING ME AND MY STEPSON STRANDED ON THE SIDE OF THE INTERSTATE COST ME 1200 DOLLARS TO BE TOWED HOME NOT TO MENTION WHAT THE REPAIR COST ARE GOING TO COST ME",
        "vin": "1FTSX21P36E"
    },
    {
        "components": "SERVICE BRAKES,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/04/2019",
        "dateOfIncident": "06/23/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11253246,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT TRUCK CASH HAD IT 3 WEEKS BRAKE LINES WE CORRODED NEVER LOOKED AT GOT TOLD GARAGE WON'T FIND TRANNY COOLER FITTING AND THE GAS STRAP BROKE OFF AND I HAVE ONLY HAD TRUCK 3 MONTHS NOW AND DEALERSHIP WON'T HELP AND GARAGE WON'T FIX TRUCK AND GOT TURNED AWAY FROM FORD DEALERSHIP..AND I HAVE A 6 MONTH UNLIMITED MILEAGE WARRANTY ON TRUCK..THE TRUCK WAS IN MOTION COMING FROM CHURCH WHEN BRAKE LINES BY ENGINE BLOCK SPRAYED ALL OVER  ENGINE..WE WE DRIVING ON A STREET BEHIND OTHER CHURCH GOERS.. I NEEDED THIS TRUCK FOR HAULING AND SUCH AND HAD STRAP BREAKING AND MAY CAUSE FIRE IF TO DRIVE DOWN MAIN HIGHWAY AND IT FALL OUT..",
        "vin": "1FTSX21596E"
    },
    {
        "components": "STRUCTURE,WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/02/2019",
        "dateOfIncident": "07/29/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11241289,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TRAVELING SOUTH ON I-85 IN MEBANE, NC ON THE NIGHT OF 07/29/19 WHEN THE RIGHT REAR TIRE BEGAN TO VIBRATE EXCESSIVELY.  I BEGAN TO SLOW DOWN WHEN THE RIGHT REAR TIRE EXPLODED.  APPROXIMATELY ONE-HALF OF THE TREAD DETACHED FROM THE TIRE CAUSING DAMAGE TO THE RIGHT SIDE OF THE TRUCK BED.  MICHELIN LT 265 70 R 17 LTX AT/2, 10 PLY TIRES WERE ON THE TRUCK. I REPLACED ALL FOUR TIRES WITH A DIFFERENT BRAND OF TIRE.  I CONTACTED MICHELIN ON 08/02/19 TO FILE A CLAIM AND WAS TOLD THAT WITHOUT THE TIRE THAT EXPLODED, A CLAIM COULDN'T BE FILED.  I CONTACTED THE TIRE SHOP AND THE TIRES THAT WERE REMOVED FROM MY TRUCK HAVE ALREADY BEEN DISPOSED OF.  I HAVE PROOF OF PURCHASE AND PHOTOS OF THE DEFECTIVE TIRE AND DAMAGE DONE TO MY TRUCK.  MICHELIN STATED THAT PROOF OF PURCHASE AND PHOTOS WERE NOT ACCEPTABLE.  I'M BEING OVERLOOKED FOR MICHELIN'S DEFECTIVE PRODUCTS AND THIS IS NOT GOOD CUSTOMER SERVICE.  I GOT A AUTO BODY REPAIR ESTIMATE FOR THE TRUCK ON 08/02/19.",
        "vin": "1FTSW21586E"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/15/2019",
        "dateOfIncident": "05/01/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11232090,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 145,000 MILES, A STEERING ISSUE DEVELOPED. 3 MILES AWAY FROM HOME, AT A 4-WAY STOP, I TURN RIGHT TO GO TO WORK. THE STEERING WHEEL GETS \"STUCK\" AND IS HARD TO TURN BACK TO THE LEFT TO CENTER THE F250 IN MY LANE. 1 MILE LATER, ANOTHER RIGHT TURN, AND THE PROBLEM BECOMES SCARY. THE WHEEL IS STIFF TO TURN TO THE LEFT AND THEN ALL OF A SUDDEN THE STEERING WHEEL AND THE TRUCK ZOOM TO THE LEFT, I STEER RIGHT AND IT IS SLOW AND STIFF AND THEN RESPONDS WITHOUT WARNING ZIPPING ME TO THE RIGHT. I'M ON THE HIGHWAY AT THIS POINT, DOING 35MPH WAITING FOR THE PROBLEM TO CLEAR UP. AT FIRST, THE PROBLEM CLEARED UP WITHIN A MILE, BUT TODAY IT TOOK 5 MILES. THE PROBLEM IS THEN GONE FOR THE REST OF MY 30 MILE TRIP TO WORK. SAME THING, SAME PLACE EVERYDAY. THIS ALSO HAPPENS ON THE WAY HOME FROM WORK. A MILE AWAY FROM THE PARKING SPACE I HAVE THE FIRST SYMPTOM AND THEN ALL HELL BRAKES LOOSE ON THE NEXT TURN. CRAZY STEERING FOR A FEW MILES AND THEN SMOOTH SAILING THE REST OF THE WAY HOME. PLANNING ON REPLACING THE STEERING GEARBOX AND POWER STEERING PUMP THIS WEEKEND.",
        "vin": "1FTSX21586E"
    },
    {
        "components": "STEERING,SUSPENSION,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/04/2019",
        "dateOfIncident": "06/04/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217782,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2006 FORD F250 SUPER DUTY 4X4 PICK UP W/ 61.00 MILES , THAT HAS A DEATH WOBBLE WHEN DRIVING OVER 45 MPH. I HAVE REPLACED BOTH HUBS AND SEALS, SHOCKS, STEERING DAMPER, STABILIZER BAR LINKS AND INNER & OUTER TIE RODS. HAVE HAD THE TIRES BALANCED TWICE AND A FRONT END ALIGNMENT. DOES THIS FALL UNDER A RECALL? I HAVE SEEN SERVICE BULLETINS ON THIS. THEY SEEM TO HAVE REPLACED THE SAME PARTS THAT I DID. IS THERE A FIX, AS THIS IS VERY DANGEROUS? THIS DEATH WOBBLE HAPPENS EVERY DAY, SMOOTH OR ROUGH ROADS.",
        "vin": "1FTNF215X6E"
    },
    {
        "components": "STEERING,SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/25/2019",
        "dateOfIncident": "04/09/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11203660,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING ABOUT 55  AND IT STARTED SHAKING AND WOBBLING LIKE THOUGHT WE WERE GOING TO FLIP OR SOMETHING.  IVE READ A LOT OF OTHER PEOPLE HAVING THIS ISSUE.",
        "vin": "1FTSF20P36E"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/21/2019",
        "dateOfIncident": "06/15/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11190420,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-250. WHILE DRIVING VARIOUS SPEEDS, THE VEHICLE STALLED WITHOUT WARNING. THE CONTACT MENTIONED THAT THE VEHICLE WAS ABLE TO RESTART ON SOME OCCASIONS. THE FAILURE RECURRED NUMEROUS TIMES. IN ADDITION, THE VEHICLE WAS ACCELERATING INDEPENDENTLY. WHEN THE BRAKE PEDAL WAS DEPRESSED, THE VEHICLE HESITATED TO ACCELERATE. THE VEHICLE WAS TAKEN TO WEST HILLS FORD (1100 OYSTER BAY AVE S, BREMERTON, WA 98312) WHERE IT WAS DIAGNOSED THAT THE THROTTLE BODY NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 52,500.",
        "vin": "1FTSX21Y16E"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/06/2019",
        "dateOfIncident": "02/01/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11174773,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING OVER UNEVEN PAVEMENT, TRUCK STARTS VIBRATING AND SHAKING VIOLENTLY WITHOUT WARNING. NEW CORRECT SIZE AND PROPERLY INFLATED TIRES AND SHOCKS INSTALLED 2 MONTHS AGO.",
        "vin": "1FTSW21556E"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "12/08/2018",
        "dateOfIncident": "12/02/2018",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11157059,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS PARK OVER NIGHT IN FRONT OF MY HOUSE .5 AM NEIGHBOR CAME OUT TO GET NEWSPAPERS AND SAW TRUCK WAS SMOKING FROM INSIDE CAB N SAW FLAME. NEIGHBOR CALL FIRE DEPARTMENT, FIRE DEPARTMENT PUT OUT FIRE FROM INSIDE CAB AND VERIFY IT WAS THE HEATED SEAT MODULE THAT'S CAUSE THE SEAT TO GO UP IN FLAME. HAVE A REPORT FROM THE FIRE DEPARTMENT AND FIRE MARSHAL. WHERE DO I FILE A COMPLAINT FOR WHO IS LIABLE FOR MY REPAIR.? CAUSE THIS IS CLEARLY A MANUFACTURED DEFECT. WHAT IF I WAS IN MY CAR WITH MY KIDS. ? PLEASE HELP DIRECT ME IN THE PATH OR WHOM MAY HELP ME WITH MY SITUATION. THANKS",
        "vin": "1FTSW21P16E"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/24/2018",
        "dateOfIncident": "10/24/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11142500,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING VEHICLE DASH CONTROLS, WINDOWS, RADIO ALL SHUT OFF AND TURN BACK ON OCCASIONALLY. IF THE VEHICLE STARTS AND THE CONTROLS ARE NOT CURRENTLY WORKING THE TRUCK IDLES HIGH AND CHUGS. WHEN GAGES ARE NOT WORKING THE BATTERY DOES NOT CHANGE EITHER. THE GAGES SHUT OFF WHILE MOVING, NOT MOVING AND AT TIME S ARE OFF RIGHT WHEN THE TRUCK STARTS. DOES IT WHILE DRIVING STRAIGHT, TURNING, BACK ROADS HIGHWAY AND ALSO DRIVEWAY. WHILE LOOKING ON GOOGLE THERE HAVE BEEN AT LEAST 30 OTHER COMPLAINTS OF THE SAME EXACT ISSUE WITHOUT A 100% FIX FOR THE PROBLEM. FORD NEEDS TO INSPECT AND FIND A WAY TO FIX THIS PROBLEM.",
        "vin": "1FTSW21P76E"
    },
    {
        "components": "STRUCTURE,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/20/2018",
        "dateOfIncident": "07/16/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11121030,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "EXHAUST MANIFOLD IS SEPARATING FROM THE HEADS (BOTH SIDES);  CAB CORNERS AND REAR OUTSIDE FENDERS RUSTED THROUGH NECESSITATING REPLACEMENT;  BACK OF MUFFLER BLEW OUT REQUIRING REPLACEMENT.",
        "vin": "1FTSX21526E"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/06/2018",
        "dateOfIncident": "02/20/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11075937,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 FORD F-259. CONSUMER WRITES IN REGARDS TO VEHICLE SHAKING WHILE DRIVING AT SPEEDS OVER 70 MPH. *LD    THE CONSUMER STATED THE SHAKING BECAME SO VIOLENT IT FELT AS IF THE FRONT END WAS GOING TO RIP OFF.   *JS",
        "vin": "1FTSW21P76E"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/15/2018",
        "dateOfIncident": "02/20/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11073044,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-250. WHILE DRIVING 35 MPH, THE VEHICLE SHOOK AND JERKED WITHOUT WARNING. THE LOCAL DEALER WAS NOT CONTACTED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED AND OPENED SPECIAL FIELD ACTION NUMBER: 09L02, BUT NO FURTHER ASSISTANCE WAS PROVIDED. THE FAILURE MILEAGE WAS 120,000.",
        "vin": "1FTSW21546E"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/09/2018",
        "dateOfIncident": "06/01/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11071877,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "SHIMMY CREATING EARLY WEAR IN STEERING GEAR AND FRONT END COMPONENTS.",
        "vin": "1FTSW21P86E"
    },
    {
        "components": "STEERING,SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "02/01/2018",
        "dateOfIncident": "01/07/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11066503,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AT FREEWAY SPEEDS THE TRUCK HAS ENCOUNTERED THE \"DEATH WOBBLE\".  FORD KNOWS OF THIS PROBLEM AND HAS MAILED ME A LETTER ABOUT.  WHEN THIS HAPPENED I THOUGH I BLEW OUT ONE OF THE FRONT TIRES.  THE STEERING SHOCK VIOLENTLY ALONG WITH THE FRONT END OF THE TRUCK.  IT WAS VERY SCARY AND DANGEROUS.  AT THE TIME OF THE DEATH WOBBLE I WAS ON THE FREEWAY DRIVING AT APPROXIMATELY 65 MPH.  THIS OCCURRED FOUR TIMES IN JULY OF 2013 AND ON JANUARY 7TH, 2018.",
        "vin": "1FTSW21516E"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEAT BELTS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/29/2018",
        "dateOfIncident": "01/01/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11065690,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE LIGHT THAT FORD DEALERSHIP COULDN'T FIX, COULDN'T FIND THE PROBLEM EVEN AFTER FULL INSPECTION. CODES APPEARED: P0299, P0401, P0404, P1335.",
        "vin": "1FTSW21P36E"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/19/2017",
        "dateOfIncident": "03/31/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10990676,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 09/12/2013, I PURCHASED 4 GEO-TRAC PATAGONIA A/T TIRES P265/70/17 TIRES FOR MY 2006 FORD F250 SUPER DUTY. FROM RICK'S TIRES AND BRAKES IN CANTON, NC.  THIS TIRE SHOP PURCHASED THE TIRES FROM FREE SERVICE TIRES IN SWANNANOA, NC.  FREE SERVICE TIRES BOUGHT THE TIRES FROM TEIRECO, INC IN GARDENA, CA.  THE DOT NUMBER ON THE FOUR TIRES IS DOT JENJ FPL 1911. THE TRUCK HAD 53,023 MILES ON IT WHEN THESE TIRES WERE PURCHASED.  IN JANUARY 2017, THE RIGHT FRONT TIRE DEVELOPED A TERRIBLE BOUNCE AT SPEEDS LESS THAN 30 MPH.  I RETURNED THE TRUCK TO RICK'S TIRES AND HE CONTACTED FREE SERVICE TIRES.  THE FREE SERVICE MANAGER SAID THE BELTS HAD SEPARATED AND REPLACED THE TIRE.  ON 03/21/2017 WHILE TOWING A BOAT ON I-40 IN NORTH CAROLINA, THE RIGHT REAR TIR EXPLODED AT 55 MPH.  I WAS UNABLE TO IMMEDIATELY EXIT THE ROADWAY AND DROVE A SHORT DISTANCE TO SAFELY PARK ON THE SHOULDER.  THE TIRE HAD A LARGE HOLE AND PART OF THE TREAD HAD SEPARATED FROM THE INNER TIRE.  THIS SEPARATION CAUSED EXTENSIVE DAMAGE TO MY RIGHT PICKUP BED OUTER WALL AND BRACING SUPPORTS.   I IMMEDIATELY CALLED RICK'S TIRES AND MADE HIM AWARE OF THE ISSUE.  HE IMMEDIATELY CALLED FREE SERVICE TIRES.  I TOOK THE TRUCK TO RICK'S TIRES ON 04/02/2017.  I FILED A CLAIM WITH TIRECO ON 04/13/2017.THE REMAINING TIRES HAVE TRAVELED ABOUT 13,000 MILES.    I HAVE DISCUSSED THIS ISSUE MS SCRIVENS AND MS TORRES WITH TIRECO.  I HAVE HAD TO INITIATE EVERY DISCUSSION WITH THEM.  THEY SEEM TO BE UNCONCERNED THAT TWO OF THE FOUR ORIGINAL TIRES THEY MANUFACTURED OR IMPORTED HAVE FAILED.  MS. TORRES TOLD ME TODAY THAT A ROAD HAZARD CAUSED THE SECOND FAILURE.   I HAD A RETIRED OPERATOR FROM A RUBBER VULCANIZING OPERATION LOOK AT THE TIRE. HE STATED THAT THE TIRE HAD NOT BEEN \"COOKED\" LONG ENOUGH OR THE TEMP WAS NOT HOT ENOUGH TO ADEQUATELY BIND THE RUBBER COMPONENTS.  TIRECO SHOULD  IMMEDIATELY REPAIR MY TRUCK AND COMPENSATE FOR TIRES.",
        "vin": "1FTSW21516E"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/12/2017",
        "dateOfIncident": "04/30/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10985076,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-250. THE CONTACT STATED THAT THE FRAME OF THE VEHICLE RUSTED AND ROTTED AWAY. THE DEALER STATED THAT THE VEHICLE WAS OUT OF WARRANTY AND NOTHING WAS DONE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STATED THAT THE VEHICLE WAS OUT OF WARRANTY. THE FAILURE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 12,000. THE VIN WAS NOT PROVIDED.",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/09/2017",
        "dateOfIncident": "03/06/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10959794,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-250. THE CONTACT STATED WHILE DRIVING AT 35 MPH, THERE WAS AN ABNORMAL SOUND COMING FROM THE VEHICLE. THE CONTACT MERGED TO THE SHOULDER OF THE ROAD AND NOTICED THAT THE FUEL TANK STRAP FAILED CAUSING THE FUEL TANK TO HANG. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 180,000.",
        "vin": "1FTNF21546E"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/14/2017",
        "dateOfIncident": "02/11/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10954403,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "STALLING 2006 FORD F-250 6.0 DIESEL, I WAS DRIVING ON THE FREEWAY WITH MY 2 BOYS DOING PROBLAY 60 MPH IN A 65MPH ZONE WHEN I NOTICED THAT THE TRUCK STARTED FIRST SEEMED TO LOOSE POWER THEN SPURTED, THEN 20SECONDS LATER THE RPMS DROPPED FINDING MY SELF WITHOUT NO CONTROL OF THE TRUCK WHAT SO EVER, MEANING IT HAD NO POWER BRAKES NO STEERING AND THE ENGINE COMPLETLY SHUT OFF ! , COASTING TO THE SIDE OF THE FREEWAY BARELY MAKING IT WITHOUT GETTING REAR ENDED ! I COULDNT BELIEVE THIS. I GOT TO THE SIDE OF THE FREEWAY AND TRIED FOR A GOOD 5 TO 7 MINUTES BEFORE CALLING TRIPLE A FOR A TOW, THEN WHILE WAITING FOR THEM TO ARRIVE I TRIED IT ONCE AGAIN TO START THE TRUCK AND GIVE IT GAS WHILE DOING SO IT FIRED UP BUT FOR ABOUT 15 SECONDS IT SOUNDED LIKE IT WAS FIRING ON 4 CYLINDERS OR MISFIRING THEN IT WENT BACK TO NORMAL AND MADE IT HOME. I THEN TOOK THE VEHILE TO THE LOCAL FORD DEALERSHIP, I DON'T KNOW AS OF YET WHATS WRONG WITH IT BUT I CAN TELL YOU I WAS SCARED OVER THIS HAPPENING!",
        "vin": "1FTSW21P96E"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/04/2016",
        "dateOfIncident": "10/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10924202,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-250. WHILE DRIVING APPROXIMATELY 30 MPH, A LOUD SNAPPING SOUND WAS HEARD FROM THE FRONT END OF THE VEHICLE. THE DRIVER SUDDENLY LOST CONTROL OF THE STEERING. THE VEHICLE WAS TOWED TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE FRONT TIE RODS FRACTURED DUE TO RUST AND CORROSION. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 120,000. UPDATED 04/06/17LJ  UPDATED 09/1/2017 *JS",
        "vin": "1FTSX21546E"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/27/2016",
        "dateOfIncident": "09/15/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10909912,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON THE HIGHWAY WITH NOTHING BEING TOWED. I FELT A BUMP STARTING ON ONE OF THE BACK TIRES. I SLOWED DOWN AND BEFORE I COULD PULL OVER I HEARD A LOUD BANG. I SEEN RUBBER GOING ALL OVER THE HIGHWAY THAT ALMOST HIT THE CARS BEHIND ME. I GOT THE TRUCK PULLED OVER ON THE EDGE OF THE HIGHWAY. CHECKING THE RIGHT REAR QUARTER PANEL OF THE BOX ON THE TRUCK. THE BOX WAS DAMAGED, AND WAS PUSHED OUT ABOUT 1.5 FEET FROM THE TRUCK. THE TREAD HAD COME OFF OF THE TIRE. THE TIRE WAS STILL HOLDING AIR. I DROVE ALONG THE EDGE OF THE HIGHWAY TO THE NEXT EXIT WERE I CHANGE THE TIRE. THIS TIRE STILL HAD 70LBS OF AIR IN IT. THERE WAS ONLY ABOUT 20,000 MILES ON THIS TIRE. THIS IS THE SECOND TIME I HAVE HAD PROBLEMS WITH THIS TYPE OF TIRE, BUT NOT THIS BAD. I TOOK MY TRUCK TO THE BODY SHOP AND WAS TOLD THAT THERE WAS $8,000.00 IN DAMAGE TO THE TRUCK. THE TIRE IS A BFGOODRICH LT275/70 R18 125R E1 DOT BE15 0211 2512",
        "vin": "1FTSX21P56E"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/10/2016",
        "dateOfIncident": "04/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10905548,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "FIKM, INJECTORS, GLO PLUGS, IPR, HARMONIC BALANCER, PRV LOW OIL PUMP, HIGH OIL PUMP, FUEL FILTERS ALL REPLACED BETWEEN 277,000 AND 290,000 MILES ( 1ST TIME ON INJECTORS AND GLO PLUGS AT 277,000 MILES ON A 6.0L 2006 SUPER DUTY DIESEL)DUE TO LACK OF POWER DURING ACCELERATION BETWEEN 65 AND 75 MPH MORE THAN ONCE! SPENT MORE THAN $3,000.00 TO DATE TO CORRECT THIS ISSUE AND NOTHING HAS WORKED! FORD HAS SOME EXPLAINING TO DO, AND IT HAS BAFFLED EVEN ONE OR MORE OF THEIR BEST MECHANICS, AS WELL AS THE TOW TRUCK PERSON THAT HAD TO TOW IT AT  10:00 PM THIS PAST WEEK! NOW WHO IS RESPONSIBLE????? WE HAVE OWNED THIS TRUCK FROM NEW STATUS TO PRESENT AND YES 290,000 MILES ON A 6.0L DIESEL 2006..SURPRISE! THE VEHICLE WAS IN MOTION WHEN THIS ISSUE HAPPENED.... ON BOTH  CITY STREETS AND INTERSTATES, AND IN THE DRIVEWAY WITH EMER. BRAKE ON AND  ACCELERATION UP TO 2000 RPM'S AND IT  CHUGS AND SPITS AND SPUTTERS AND THEN DIES AND WON'T RESTART UNTIL THE NEXT DAY! I CAN PROVIDE YOU  SEVERAL RECEIPTS, BUT I AM NOT PUTTING THEM ONLINE FOR ALL TO VIEW VIN NUMBERS, ETC.  ANY INFORMATION WILL BE GREATLY APPRECIATED! ALL THIS TROUBLE HAS GONE ON SINCE APRIL OF 2016 TO PRESENT. MY TRUCK IS A WORK VEHICLE AND HAS BEEN A GOOD ONE UNTIL  NOW AND HAS TRAVELLED WELL FOR 10 YEARS OLD AND 290,000 MILES. I AM CURRENTLY STUCK IN GEORGIA TRYING TO FIX THIS ISSUE.",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/14/2016",
        "dateOfIncident": "07/04/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10884744,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JULY 4, 2016 MY GIRLFRIEND AND I WERE TRAVELING HOME, ABOUT AN HOUR AND HALF INTO OUR TRIP WE NOTICED A WEIRD VIBRATION, WE DECIDED TO GET OFF ONTO SATE RD 429, WE SLOWED WAY DOWN LOOKING FOR A PLACE TO PULL OVER, WHEN THE BACK PASSENGER TIRE TREAD COMPLETELY SEPARATED FROM THE TIRE. ONCE WE PULLED OVER WE NOTICED THE DAMAGE THE SEPARATED TIRE TREAD DID TO THE TRUCK BODY. I HAVE CALCULATED THE TOTAL MILEAGE OF 25196 ON THE TIRES, SINCE I BOUGHT THE TRUCK FROM KISSELBACK FORD IN ST. CLOUD FLORIDA WHO INSTALLED THE TIRES. I DECIDED TO REPLACE THE OTHER 3 TIRES FOR OUR SAFETY EVEN THOUGH THESE TIRES ARE RATED FOR 50,000 MILES. THE TIRE SHOP THAT INSTALLED THE NEW TIRES DID NOTE THE FRONT TIRE HAD BUBBLES FORMING, THIS IS AN INDICATION THAT THIS TIRE WAS ALSO PRONE TO TREAD SEPARATION POSSIBLY LEADING TO A MORE SERIOUS ACCIDENT. THE TIRES THAT ARE IN QUESTION IS CAPITOL HT 265-70-17 DOT NUMBER SKVR RC 4713. I HAVE RECEIVED 3 ESTIMATES FOR THE BODY WORK ESTIMATING AROUND $2500 PLUS THE COST OF FOUR NEW TIRES. I HAVE SEVERAL PICTURES THAT I CAN SEND.",
        "vin": "IFTSX20596E"
    },
    {
        "components": "STEERING,SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/19/2016",
        "dateOfIncident": "10/11/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10850525,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUCK \"DEATH WOBBLE\" -  DRI\\VING ON I 25 AT ABOUT 60 MPH WE HIT A SMALL BUMP IN THE ROAD AND THE TRUCK BEGAN TO VIOLENTLY SHAKE.  WE THOUGHT WE HAD A BLOWOUT, BUT THE TIRES WERE OK.  IN FACT, BEFORE OUR TRIP WE HAD OUR TIRES CHECKED AND WERE TOLD THEY WERE FINE.  AFTER GOING TO A DEALER I HAVE DISCOVERED THAT THIS IS A KNOWN PROBLEM CALLED THE \"DEATH WOBBLE\". IT IS  AN ENGINEERING DEFECT AND HAS NOTHING TO DO WITH TIRES AS FORD WOULD LIKE TO ASSUME.    I RECEIVED A NOTICE FROM FORD  IN DEC 2015 ACKNOWLEDGING THE \"SEVERE VIBRATION\" AND BLAMING IT ON THE TIRES.  IT IS NOT THE TIRES IT IS AN ENGINEERING DEFECT.    WHAT IS BEING DONE REGARDING A RECALL TO FIX THIS PROBLEM?  UNLESS YOU HAVE EXPERIENCED THE VIOLENT SHAKING YOU HAVE NO IDEA HOW TERRIFYING IT IS AND THE POTENTIAL TO CAUSE A SERIOUS IF NOT DEADLY ACCIDENT.  I KNOW I AM NOT THE ONLY ONE COMPLAINING AS I HAVE READ NUMEROUS ACCOUNTS ON FORUMS, SEEN YOUTUBE VIDEOS AND HAD THE ACKNOWLEDGEMENT FROM A DEALER ABOUT THE PROBLEM!!!.    PLEASE HELP.",
        "vin": "1FTSX21596E"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/14/2016",
        "dateOfIncident": "03/13/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10849567,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "PLEASE REOPEN THIS INVESTIGATION.   EVERY PERSON THAT I KNOW WITH A FORD F250 4X4 HAS THIS PROBLEM ON OCCASION.    YOUR FAILURE TO MAKE FORD FIX WILL KILL SOMEONE.   HOW MANY PEOPLE HAVE TO DIE?      DATE INVESTIGATION OPENED: MAR 14, 2008  DATE INVESTIGATION CLOSED: MAR 31, 2009  NHTSA ACTION NUMBER: EA08007  COMPONENT(S): SUSPENSION     MY TRUCK HAS 60,000 MILES NOW AND I HAVE REPLACED ALL 4 TIRES NEARLY 3 DIFFERENT TIMES IN THE LAST 15,000 MILES. THAT'S AN AVERAGE OF TIRES LAST 5000 MILES.  I HAVE ENCOUNTERED THIS PROBLEM MANY TIMES, AND CONSTANTLY GET A \"RUN-AROUND\"  THAT IT'S THE TIRES. MY TIRES ARE PROPERLY INFLATED.      YESTERDAY, I WAS TRAVELLING ON INTERSTATE 45 YESTERDAY AT 70 MPH'S AND TRAFFIC SUDDENLY SLOWED TO A CRAWL.  I HAD TO APPLY MY BRAKES AGGRESSIVELY AND WHEN I HIT A CERTAIN SPEED BETWEEN 35MPH AND 60 MPH, THE TRUCK BEGAN TO RANDOMLY BOUNCE AND WAS COMPLETELY UNCONTROLLABLE.  I COULDN'T EVEN STEER.  I NEARLY CRASHED INTO SEVERAL VEHICLES ON THE ROAD. WHILE THE FRONT END OF THE VEHICLE WAS VIOLENTLY BOUNCING (IT BOUNCED SO VIOLENTLY IT BROKE A FOLDING DOWN TV MOUNT / MOUNTED IN THE CEILING OF THE TRUCK), I HUNG ONTO THE STEERING WHEEL FOR DEAR LIFE (LIKE HANGING ONTO A BULL 8 SECONDS) AND CONTINUED TO SLOW EVEN FURTHER, AND ULTIMATELY HAD TO DRIVE OFF INTO THE GRASS ELSE I WAS GOING TO CRASH.   THE DEATH WOBBLE WENT AWAY WHEN I APPROACHED A COMPLETE STOP < 15MPH.    IN THE SAME TRUCK, I HAVE HAD THIS DEATH WOBBLE INCIDENT HAPPEN OVER 200 TIMES SINCE OWNING THE VEHICLE.  I HAVE EVEN HAD THIS SAME PROBLEM HAPPEN WHILE HAULING CAR'S ON CAR TRAILERS.   IT IS SCARY.      AFTER MARKET MFRS MAKE CLAIMS THAT IT'S DUE TO THE TRACK BAR AND BUSHINGS AND THESE KITS ARE AVAILABLE TO FIX THE ISSUE, BUT FORD AND THE TSA DENIES ITS A REAL PROBLEM.  BEFORE I PAY OUT THOUSANDS FOR A AFTERMARKET SUSPENSION, I EXPECT FORD TO FIX THIS, THE CORRECT WAY.",
        "vin": "1FTSW21PX6E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/20/2016",
        "dateOfIncident": "11/15/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10821167,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I REPLACED THE RADIATOR 3 TIMES AND CHANGE THE THERMOSTAT TO ,THE RADIATOR KEEPS POPPING, IT'S GETTING OLD,I ALSO CHANGED THE HEATER CORE AND IT POPPED . MAN WHAT IS GOING ON.IT HAPPENS WHEN I'M STATIONERY SITTING OVER NIGHT AT HOME.",
        "vin": "1FTSX20P96E"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/18/2016",
        "dateOfIncident": "12/12/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10820811,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUCK VIOLENTLY SHAKES AFTER HITTING A BUMP OR DIP IN THE ROAD AND DOESN'T STOP UNTIL I SLOW DOWN TO ALMOST A COMPLETE STOP. RECEIVED A LETTER FROM FORD ABOUT THIS PROBLEM BUT THE ONLY SOLUTION THEY OFFER IS TO CHECK TIRE PRESSURE WHICH I DID AND OF COURSE DID NOTHING.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/15/2016",
        "dateOfIncident": "05/26/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10820526,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON A CITY STREET AND MADE A LEFT TURN.  HALF WAY THROUGH THE TURN THE TRUCK STARTED SHAKING(SHIMMING) TO THE POINT WHERE IT WAS BASICALLY NOT DRIVE ABLE.  FORTUNATELY I WAS NOT GOING FAST AT THE TIME SO I COULD SLOW DOWN QUICKLY AND PULL OFF TO THE SIDE OF THE ROAD.  WHEN THE EVENT HAPPENED IT WAS QUICK, FROM NOTHING TO THE TRUCK SHAKING VIOLENT.  I ENDED UP HAVING THE STEERING GEAR AND U JOINTS REPLACED.",
        "vin": "1FTSX21P16E"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/12/2016",
        "dateOfIncident": "12/08/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10819843,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-250. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS AND GOING OVER A BUMP ON THE ROAD, THE FRONT OF THE VEHICLE WOBBLED. THE VEHICLE WAS TAKEN TO THE DEALER WHERE A STABILIZATION BAR WAS INSTALLED HOWEVER, THE FAILURE PERSISTED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 15,000.",
        "vin": "1FTSW21P56E"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/09/2015",
        "dateOfIncident": "10/03/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10781030,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 FORD F250 MOVING, 2 LANE ROAD, IN MOUNTAINS ,SUDDENLY STARTED TO STEER ERRATICALLY - MANAGED TO KEEP IT OUT OF THE OPPOSITE LANE MORE BY GOOD FORTUNE THAN ANYTHING. POWER STEERING PUMP HAD BEGUN TO FAIL.",
        "vin": "1FTSX21576E"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/09/2015",
        "dateOfIncident": "10/03/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10781041,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-250. THE CONTACT STATED THAT WHILE DRIVING 30 MPH, THE STEERING WHEEL BECAME DIFFICULT TO TURN WITHOUT WARNING. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE POWER STEERING PUMP NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 78,000.     UPDATED 1/12/16  *CN",
        "vin": "1FTSX21576E"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/05/2015",
        "dateOfIncident": "07/30/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10746508,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-250. WHILE THE VEHICLE WAS BEING INSPECTED, THE TAIL LIGHTS FAILED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THAT THE REAR LIGHTS NEEDED TO BE REPLACED AND THAT THERE WAS AN ELECTRICAL FAILURE.  THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 100,000.",
        "vin": "1FTSX21516E"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/01/2015",
        "dateOfIncident": "06/29/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10731516,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-250. WHILE DRIVING 40 MPH OVER UNEVEN PAVEMENT, THE VEHICLE BEGAN TO SHAKE VIOLENTLY WITHOUT WARNING. THE CONTACT STATED THAT THIS WAS AN ONGOING ISSUE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE DRAG LANE BAR AND STEERING LINKAGE NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 120,000.",
        "vin": "1FTSW21P86E"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "03/27/2015",
        "dateOfIncident": "02/01/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10702141,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD F-250. THE CONTACT STATED THAT WHILE DRIVING AT A VARIOUS SPEEDS, THE FRONT PASSENGER, FRONT MIDDLE AND REAR MIDDLE SEAT BELTS FAILED TO BUCKLE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE FAILURE RECURRED ON NUMEROUS OCCASIONS. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 83,000.",
        "vin": "1FTSW21P96E"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/15/2015",
        "dateOfIncident": "09/16/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10694333,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUCK STALLED AT INTERSECTION. COMPLETE POWER OUTAGE, NO BRAKES, ETC. MANAGES TO RESTART. PROBLEM RECURRED TWO ADDITIONAL TIMES. I LIMPED TO A LOCAL MECHANIC SHOP WHO SCANNED THE ENGINE CODES. HE TOLD ME IT WAS THE THROTTLE BODY AND CHARGED ME $550.00 TO REPLACE IT. TRUCK HAD 47,000 ON IT AT THE TIME. IN MY OPINION THIS PART SHOULD LAST WELL INTO THE 100,000 MILE MARK.   *TR",
        "vin": "1FDNF20516E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/29/2015",
        "dateOfIncident": "09/10/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10679720,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD F-250. THE CONTACT STATED THAT WHILE DRIVING AT 3 MPH, THE ACCELERATOR PEDAL WAS DEPRESSED BUT IT FAILED TO RESPOND. IN ADDITION, THE CONTACT NOTICED SMOKE COMING FROM THE EXHAUST PIPE. THE VEHICLE WAS TAKEN TO A DEALER. THE TECHNICIAN STATED THAT THE OIL COOLER, THE EXHAUST BACK PRESSURE SENSOR, THE TURBO AND THE EGR VALVE NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED HOWEVER, THE FAILURE RECURRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 160,000.",
        "vin": "1FTSX21P36E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/26/2015",
        "dateOfIncident": "09/19/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10678993,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TOWED ON  SEPT/19/2014 KN MILEAGE  DEALER SAID NO PROBLEM FOUND;.  2ND TOW 11/02/2014 MILEAGE 187190  EGR VALVE FAILED WILL NEED ENGINE REPLACED.  DEALER WHERE BOUGHT DID NOT DISCLOSE.   THE TRUCK HAD THE MOTOR REBUILD IN 2008.  AND MANY CLASS ACTION SUITS HAVE BEEN FILED.  ON 6.0L ENGINES.  *TR",
        "vin": "1FTSW21P76E"
    },
    {
        "components": "STEERING,TIRES,WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/26/2015",
        "dateOfIncident": "02/19/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10679011,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "HELLO,   I HAVE A FORD F 250 SUPER DUTY KING RANCH 4X4 DIESEL THAT MY WIFE AND I ALWAYS WANTED. WE BOUGHT FROM A USED CAR/TRUCK LOT. THE RIMS AND TIRES ARE BRAND NEW AS IS ALIGNMENT WAS ALSO HAD DONE TO FIX THE PROBLEM RIGHT OUT OF THE GATE BUT IT DIDN'T.. WHEN THE TRUCK GETS TO 44 MILES AN HOUR AND UP TO 50 MPH MY F 250 HOPS LAND I DON'T KNOW IF ITS FROM THE FRONT OR BACK BUT I THINK ITS HAPPENING IN THE FRONT THE WAY IT FEELS ON THE STEERING WHEEL.. MY TRUCK STEERING WHEEL DOES NOT MOVE BACK AND FORTH LIKE THE TIRES ARE WIGGLING RIGHT AND LEFT , IT IS MORE LIKE WHEN YOU HAVE A BAD RIM OR UNEVEN TIRE HOP, LIKE WHEN I WAS A KID AND COULDN'T AFFORD TIRES AND BOUGHT SOME USED ONES AND GET A BUM TIRE IN THE SET OR MAYBE A RIMS THAT I HAD TRADED FOR AND ONE WAS BAD..    WE LOVE THIS F 250 AND HAVE PUT A LOT OF MONEY INTO IT, NOT KNOWING ANYTHING ABOUT DIESEL TRUCKS, ONLY LOVING THE SOUND AND POWER OF THEM SO THE PROBLEMS THE DEALERSHIP FAILED TO POINT OUT OR MENTION TO US WE HAVE HAD ALL FIXED PROPERLY AND THIS HOP OR BOUNCE THAT MY F 250 IS EXPERIENCING IS REALLY A WORRY TO US SEEING HOW WE BOUGHT IT TO PULL A TRAVEL TRAILER WE PURCHASED TO EXPLORE THIS GREAT U.S.A. SO WE WILL BE CONSTANTLY DRIVING IT ATTACHED TO THE TRAILER OR NOT.    I HAVE REPLACED RIMS, TIRES AND HAD AN ALIGNMENT AS STATED BEFORE AND WOULD REALLY LIKE TO SOLVE THIS PROBLEM WHICH IF YOU GOOGLED IT AND SEEING ALOT OFL OTHERS EXPERIENCING THIS SAME PROBLEM AND SOME EVEN LIFE THREATENING WHICH WORRIES ME ALSO IF WHATEVER THE PROBLEM IS, CAUSES SOMETHING TO BREAK OR HAPPEN.  I THANK YOU FOR YOUR TIME AND CONCERNS TO REMEDY THIS SAFETY HAZARD ON  FORD SUPER DUTY TRUCKS..  [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "1FTSW21P76E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/26/2015",
        "dateOfIncident": "01/25/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10679037,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRUCK WAS ON A MAJOR INTERSTATE (I-81 NEAR BLACKSBURG EXIT 118A,B,C) DRIVING UPHILL. WHILE TRYING TO MERGE INTO THE RIGHT LANE FROM THE MIDDLE LANE, WHILE LETTING OF THE ACCELERATOR THE ENGINE DIES. AT THIS POINT LOST ALL POWER INCLUDING BRAKES AND STEERING CONTROL. SINCE THERE WAS NO TRAFFIC IMMEDIATELY BEHIND THE TRUCK THEN WAS ABLE TO PULL OVER TO THE FIRST LANE AND GET OFF THE SHOULDER. THE TRUCK DIED AND FORTUNATELY DUE TO LOW TRAFFIC ABLE TO MANEUVER TO THE SHOULDER.  AT THAT POINT, TRIED TO START THE TRUCK AND IT WOULD NOT START SO HAD TO REMAIN ON THE SIDE OF INTERSTATE UNTIL HELP COULD ARRIVE. STRANDED ON THE SIDE OF THE INTERSTATE. TRUCK WAS TOWED TO DEALERSHIP. FORD BLOGS INDICATE THERE IS A KNOWN PROBLEM THAT HAS GONE UNADDRESSED.  *TR",
        "vin": "1FTSW21P66E"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "01/23/2015",
        "dateOfIncident": "12/18/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10678572,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD F-250. THE CONTACT STATED THAT THE SUN ROOF WINDOW WAS DETACHING FROM THE VEHICLE. THE VEHICLE WAS TAKEN TO A DEALER. THE TECHNICIAN MADE THE CONTACT AWARE THAT THERE WAS A MANUFACTURER RECALL RELATED TO THE SUN ROOF FAILURE. THE SUN ROOF WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 21,000.",
        "vin": "1FTSW21P66E"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/05/2014",
        "dateOfIncident": "10/29/2014",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10652762,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "SMELLED SOMETHING AS TRAVELING DOWN THE ROAD AT 55 MPH.  STOP THE VEHICLE ALONG SIDE THE ROAD.  CHECKED THE TRAILER.  CAME BACK TO THE TRUCK AND SMOKE WAS ROLLING OUT OF THE DASH VENTS, RIGHT REAR PASSENGER SIDE OF THE HOOD WAS BURNING THE PAINT, THEN FLAMES CAME OUT FROM UNER THE HOOD.  *TR",
        "vin": "1FTSX21P96E"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/20/2014",
        "dateOfIncident": "10/05/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10648898,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "CONTITRAC TR",
                "productYear": "9999",
                "size": "LT275/70R18",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-250 EQUIPPED WITH CONTINENTAL CONTITRAC TR TIRES, SIZES LT275/70R/ 18,  DOT NUMBER P515 46XB. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 55 MPH, THERE WAS VIBRATION AND THE LEFT REAR TIRE BLEW OUT. ALSO, THE TIRE EXHIBITED TREAD SEPARATION. THE TIRE HAD NOT BEEN REPLACED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 65,000. ..UPDATED12/11/14 *BF  UPDATED 12/19/14*CN    THE CONSUMER STATED SOME OF THE VEHICLE'S FAILURES WERE REPAIRED PRIOR TO HAVING KNOWLEDGE OF THE RECALL.   UPDATED 11/10/2015*JS",
        "vin": "1FTSW21P26E"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/22/2014",
        "dateOfIncident": "06/02/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10638130,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DASHBOARD INSTRUMENT PANEL GAUGES AND LIGHTS STOP FUNCTIONING  ALSO LOW FUEL LIGHT COMES ON WITH FULL TANK OF FUEL.  *TR",
        "vin": "1FTSX21P46E"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/22/2014",
        "dateOfIncident": "07/14/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10615287,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I PULLED AWAY FROM A STOP SIGN I THROTTLED UP TO REACH THE APPROPRIATE SPEED LIMIT AND MY 2006 FORD F250 6.0 WENT WIDE OPEN THROTTLE OUT OF NOWHERE. I MASHED ON MY BRAKES TO TRY TO SLOW THE TRUCK DOWN, TO NO SUCCESS. I FLASHED MY LIGHTS AND STROBE LIGHTS AT ON COMING TRAFFIC AS WELL AS BLEW THE HORN TO MAKE OTHER DRIVERS AWARE THAT I COULD NOT STOP. LUCK BEING AGAINST ME THIS DAY THE FIRST VEHICLE I APPROACHED WAS A NC STATE TROOPER. I HAD TO TURN OFF MY IGNITION TO STOP THE TRUCK BUT THE ENGINE KEPT RUNNING AT 4500 RPM SO I SLAMMED IT IN PARK. THE STATE TROOPER GAVE ME A TICKET FOR PASSING HIM AT 80MPH IN A 45. KEEP IN MIND THAT MY TRUCK IS EQUIPPED WITH AN SCT LIVEWIRE TUNER, SO WHEN IT OPENED UP IT LAUNCHED LIKE A ROCKET. THIS IS THE SECOND TIME I'VE HAD THE THROTTLE ISSUE, THE FIRST TIME WAS THE SAME CASE EXCEPT I DID NOT HAD A TUNE ON THE VEHICLE. THERE HAS BEEN SEVERAL REPORTED CASES OF THIS HAPPENING, WITH AND WITHOUT TUNERS ON THE VEHICLE. PLEASE SHARE YOUR INSIGHT IF ANY ONE KNOWS THE CAUSE OF THIS ISSUE.  *TR",
        "vin": "1FTSW21P36E"
    },
    {
        "components": "SUSPENSION,EXTERIOR LIGHTING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/16/2014",
        "dateOfIncident": "06/10/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10611014,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "GOING 55MPH THE TRUCK STARTS SHAKING AND SHIMMING. ALL LIGHTS GO IN AND OUT AND BLOWS WHENEVER ANYTHING IS HOOKED UP.  *TR",
        "vin": "1FTS21P66E1"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/24/2014",
        "dateOfIncident": "11/10/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10605754,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DEATH WOBBLES OR SHIMMY BEEN.GOING ON SINCE 2010. THE WHOLE TRUCK WOULD SHAKE AND SHAKE HARD. UNTIL I SLOW DOWN TO 30MPH. THEN FORD SENT ME A LITTER (09L02) SAYING IT'S CALLED THE SHIMMY AND ITS MY TIRE PRESSURE.  I CHECKED TIRE STILL KEPT HAPPENING.  YESTERDAY 6/23/2014 MY WIFE AN TWO SONS WHERE ON THE FREEWAY WHEN IT HAPPEN AND THE STEERING DAMPER BROKE OFF.  *TR",
        "vin": "1FTSW21P96E"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/04/2014",
        "dateOfIncident": "06/16/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10596089,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2006 FORD F-250. THE CONTACT STATED THAT WHILE DRIVING 55 MPH, THE VEHICLE BEGAN SHAKING VIOLENTLY AFTER DRIVING OVER A BUMP IN THE ROAD. THE CONTACT MENTIONED THE VEHICLE VEERED INTO ANOTHER LANE. THE VEHICLE WAS TAKEN TO A MECHANIC, AND THERE WAS NO DIAGNOSIS. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 110,000, AND THE  CURRENT MILEAGE WAS 120,000.",
        "vin": "1FTSW21576E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/07/2014",
        "dateOfIncident": "03/20/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10587105,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F250 DIESEL.  THE CONTACT STATED THAT WHILE TRAVELING 65 MPH, THE CHECK ENGINE WARNING LIGHT ILLUMINATED AS THE VEHICLE LOST POWER. THE VEHICLE WAS TOWED TO A PRIVATE MECHANIC WHERE IT WAS FOUND THAT THE HEAT SENSOR NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE FAILURE RECURRED ON SEVERAL OCCASIONS.  THE FAILURE MILEAGE WAS 128,000 AND THE CURRENT MILEAGE 128,691.",
        "vin": "1FTSW21R58E"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/29/2014",
        "dateOfIncident": "04/15/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10585524,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-250. THE CONTACT STATED WHILE TURNING AT 25 MPH, THE STEERING WHEEL SHOOK. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO STATED THAT THE STEERING BOX, DRAG LINK BAR, TIE ROD END, UPPER AND LOWER BALL JOINTS, AND SUSPENSION DRIVE LINK CYLINDER NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 77,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/10/2014",
        "dateOfIncident": "04/30/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10578795,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING AT 45 MPH THE TRUCK DRIFTS TO THE RIGHT THEN SNAPS BACK TO THE LEFT , AFTER APPLYING THE BRAKES THE STEERING WHEEL SHAKES VIOLENTLY. AFTER COMING TO A FULL STOP AND STARTING OFF AGAIN IT IS FINE FOR A FEW MILES THEN IT STARTS ALL OVER. I HAVE HAD UPPER AND LOWER BALL JOINTS REPLACED, STEERING BOX REPLACED, BRAKES REPLACED, JUST ABOUT ANYTHING TO DO WITH THE FRONT END HAS BEEN REPLACED AND IT STILL GOES ON.  *TR",
        "vin": "1FTSW21PX6E"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/07/2014",
        "dateOfIncident": "05/02/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10577858,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F250. THE CONTACT STATED THAT THERE WAS AN EXTREME VIBRATION IN THE STEERING WHEEL. THE CONTACT DROVE OVER A BUMP OR UNEVEN PAVEMENT WHILE DRIVING THE VEHICLE AT ANY SPEED AND HAD TO USE FORCE IN ORDER TO GAIN CONTROL OF THE STEERING WHEEL ON MULTIPLE OCCASIONS. THE VEHICLE SHOOK VIOLENTLY AND THE STEERING CONTINUED TO BE UNSTABLE. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHO WAS UNABLE TO DIAGNOSE THE FAILURE. THE CONTACT CONTINUED TO EXPERIENCE THE STEERING FAILURE WHICH CAUSED THE VEHICLE TO DRIVE ROUGH. THE VEHICLE WAS TAKEN BACK TO AN  AUTHORIZED DEALER WHO WAS UNABLE TO REPLICATE THE FAILURE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 50000.",
        "vin": "1FTSX21536E"
    },
    {
        "components": "STEERING,SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "02/20/2014",
        "dateOfIncident": "02/19/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10565061,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY 2006 FORD F250 FX4, AT SPEEDS BETWEEN 45-65 MPH, A SLIGHT VIBRATION IS FELT. WITHIN A FEW SECONDS IT TURN INTO A VIOLENT SHAKING MOTION AS IF I'M DRIVING ON LARGE COBBLE STONES. IT HAS BEEN SO BAD I HAVE ALMOST LOST CONTROL ON THE HIGHWAY AND CAME WITHIN INCHES OF HITTING ANOTHER VEHICLE. WHEN IT STARTS THERE IS NO STOPPING IT, AS THE STEERING WHEEL JERKS VIOLENTLY. FORD HAS SENT A LETTER OUT THAT SAY INFLATE YOUR TIRES AND IF IT STILL HAPPENS SLOW DOWN UNTIL IT STOPS. THAT'S NOT RIGHT. THIS IS DANGEROUS. I HAVE TO SLOW DOWN TO 30 MPH FOR IT TO STOP. I CAN'T DO THAT ON THE HIGHWAY. THE DEALERS AND FORD SAY THERE IS NOTHING THEY WILL DO.  THIS ISSUE IS EXTREMELY DANGEROUS DUE TO FORDS ENGINEERING MISHAP.MY TIRES ARE STOCK, ROTATED, BALANCED, AND ALIGNED,  THIS HAPPENS AT LEAST ONCE EVERY OTHER WEEK  2005-2013 F250,350 OWNERS REPORT THE SAME ISSUE.  GOOGLE: FORD DEATH WOBBLE,  AND WATCH THE F250 AT CRUISING SPEED.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/07/2014",
        "dateOfIncident": "02/04/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10563417,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2006 F250 LARIAT CREW CAB 6.0.  THERE ARE NO MODIFICATIONS FROM STOCK ON THE VEHICLE.  I WAS AND CONTINUE TO RUN RECOMMENDED AIR PRESSURE IN THE TIRES.  WHILE DRIVING THE VEHICLE AT A SPEED OF 50 MPH IN A SLIGHT TURN, IMMEDIATELY AFTER HITTING A DIP IN THE ROAD,  I EXPERIENCED A VIOLENT SHAKE IN THE FRONT END.  IT FELT AS THOUGH THE TIRES WERE HOPPING WHICH MADE THE TRUCK EXTREMELY HARD TO CONTROL.  AS THE FRONT END HOPPED IT PUSHED THROUGH THE TURN.  THIS SEEMS TO BE IN INTERMITTENT CONDITION BROUGHT ON BY SPEEDS OVER 40MPH, IN TURNING SITUATIONS, WHERE THERE IS A BUMP AND OR DIP IN THE ROAD.  BASED ON MY RESEARCH LATELY THIS SEEMS TO BE A KNOW SAFETY ISSUE THAT FORD HAS CHOSEN TO IGNORE.       *TR",
        "vin": "1FTSW21P66E"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/21/2014",
        "dateOfIncident": "08/12/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10560777,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING THRU ATLANTA TRAFFIC THE F 250  HAD A VIOLENT SHAKING OF THE FRONT TIRES. IT REQUIRED BRAKING OUT OF TRAFFIC TO CONTROL THE STEERING.  TWO PRIOR INCIDENTS HAD OCCURRED BUT WITH LESS INTENSITY IN THE PRIOR MONTHS.   *TR",
        "vin": "1FTSW21P76E"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/19/2013",
        "dateOfIncident": "11/13/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10552902,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY FORD F250 SUPER DUTY 2006 MODEL TRUCK STARTED UP JUST FINE ON WAY TO JOB SITE AND THEN ABOUT 1:00 P.M. THAT DAY MY TRUCK OVER-HEATED EVEN THOUGH NO INDICATION ON THE ELECTRICAL PANEL.  I SAW WHITE SMOKE COMING OUT OF TAIL PIPE, STARTED OVER-HEATING, AND I WAS LOSING POWER IN MOTOR.  I PUT WATER IN COOLANT OVER-FILL BECAUSE ALL OF MY ANTIFREEZE DRAINED OUT AND I JUST HAD PUT IN PRIOR TO THIS DATE ABOVE ABOUT TWO WEEKS.  I REGULARLY  CHANGE THE OIL AND MAINTAIN ALL THE FLUIDS AND DO REQUIRED MAINTENANCE ON TRUCK PER THE MILEAGE.  I WAS ABLE TO MAKE IT TO MY HOUSE WHERE I WAITED 30 MINUTES FOR TRUCK TO COOL AND THEN DROVE IMMEDIATELY TO DIESEL MECHANIC NAMED [XXX] WHO KNEW IMMEDIATELY WHAT HAD HAPPENED BECAUSE (6) OTHER TRUCKS CAME IN THE SAME WEEK WITH THE SAME ISSUE WHICH WAS TO REPLACE THE EGR'S AND ALSO THE OIL COOLER.  MY BILL FOR THIS WAS OVER $3,000.00.  I WAS VERY LUCKY THAT I HAD WORK AND WAS ABLE TO PAY FOR THIS HUGE EXPENSE OTHERWISE I WOULD BE OUT-OF-POCKET IN A BAD WAY BECAUSE THE TRUCK IS MY LIVELIHOOD IN MY MAKING MONEY AS I AM A GENERAL CONTRACTOR AND NEED A HEAVY DUTY TRUCK.  I THINK THAT THERE SHOULD BE A RE-CALL ON THIS PART BECAUSE OF THE SIX OTHER TRUCKS THAT CAME INTO HIS DIESEL SHOP THE SAME WEEK.  THIS WAS A VERY EXPENSIVE EXPERIENCE AND I FEEL LIKE FORD SHOULD KNOW ABOUT THIS AND CORRECT THE ERROR BECAUSE THIS PART SHOULD NOT GO OUT ON A SUPER DUTY TRUCK LIKE THIS.       INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "1FTSW20P86E"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "10/21/2013",
        "dateOfIncident": "10/01/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10548765,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-250. THE CONTACT STATED THAT HE ATTEMPTED TO CONNECT THE SEAT BELT BUT THE BUCKLE WOULD NOT SECURE WITH THE CONNECTOR. THE VEHICLE WAS TAKEN TO THE DEALER FOR INSPECTION WHERE THEY STATED THAT THE SEAT BELT BUCKLE NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 100,000.   UPDATED 12/18/13*CN",
        "vin": "1FTSX21P96E"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/18/2013",
        "dateOfIncident": "01/02/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10548360,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-250 SD. THE CONTACT STATED THAT WHILE REFUELING, FUEL SPEWED FROM THE FILLER NECK. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THE TECHNICIAN DIAGNOSED THAT THE CHECK VALVE WAS STICKING AND AS RESULT, THE FUEL PUMP NEEDED TO BE REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 56,935 AND THE CURRENT MILEAGE WAS 58,827.",
        "vin": "1FTSX21526E"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/15/2013",
        "dateOfIncident": "10/14/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10548009,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN THE HIGHWAY AT APPROX. 65 MPH AND HIT A SERIES OF BUMPS/ ROUGH PAVEMENT AND MY TRUCK STARTED TO SHACK.  IT SHOCK SO BAD THAT I HAD TO SLOW DOWN TO AROUND 30 MPH IN THE FAST LANE WITH A LOT OF TRAFFIC TO EVEN TRY TO CONTROL THE TRUCK.  LUCKILY THERE WAS NOBODY NEXT TO ME OR IT WOULD HAVE ENDED IN A BAD WRECK.  I LOOKED UNDER THE CAR AND DON'T SEE ANY DEFECTIVE PARTS AND FROM WHAT I HAVE RESEARCHED ITS HARD TO DETERMINE THE EXACT PROBLEM.  THE PROBLEM IS SO BAD THAT I AM SCARED TO EVEN DRIVE IT.  *TR",
        "vin": "1FTSX21P76E"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/04/2013",
        "dateOfIncident": "04/01/2005",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10546727,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-250. THE CONTACT STATED THAT THE GAUGES ON THE INSTRUMENT PANEL FAILED. THE VEHICLE WAS TAKEN TO A DEALER FOR DIAGNOSIS AND THE CONTACT WAS INFORMED THAT THE INSTRUMENT CLUSTER WOULD NEED TO BE REPLACED. THE FAILURE RECURRED TWICE OVER THE COURSE OF SEVEN YEARS AND WITH EACH FAILURE, THE INSTRUMENT CLUSTER WAS REPLACED. AFTER THE LAST REPLACEMENT, THE FAILURE RECURRED AND THE VEHICLE BEGAN TO EMIT WHITE SMOKE. THE VEHICLE WAS TAKEN TO A DEALER FOR DIAGNOSIS AND THE CONTACT WAS INFORMED THAT THE EGR COOLER WOULD NEED TO BE REPLACED. THE CONTACT STATED THAT IF THE GAUGES HAD BEEN WORKING PROPERLY, SHE WOULD HAVE BEEN ALERTED TO THE EGR COOLER FAILURE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGE WAS 52,000.",
        "vin": "1FTSW21P96E"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/23/2013",
        "dateOfIncident": "09/22/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10544942,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Hankook Tire & Technology Co., Ltd.",
                "productMake": "HANKOOK",
                "productModel": "DYNAPRO AS",
                "productYear": "9999",
                "size": "P265/65R17S",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-250 EQUIPPED WITH HANKOOK TIRES, SIZE: LT 265/70/17. THE CONTACT STATED THAT THE TREAD WAS SEPARATED ON THE DRIVER'S SIDE REAR TIRE AND THE PASSENGER'S SIDE FRONT TIRES. THE TIRES WERE REPLACED. THE MANUFACTURER WAS CONTACTED ABOUT THE FAILURE. THE FAILURE MILEAGE, VIN, AND DOT NUMBER WERE UNAVAILABLE. ..UPDATED 02/06/14 *BF",
        "vin": "1FTSW20P26E"
    },
    {
        "components": "STEERING,SUSPENSION,WHEELS",
        "crash": true,
        "dateComplaintFiled": "09/18/2013",
        "dateOfIncident": "09/03/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 4,
        "odiNumber": 10544242,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD NEVER HEARD OF A DEATH WOBBLE UNTIL I WAS ON MY WAY TO THE HOSPITAL WITH MY THREE CHILDREN AFTER BEING INVOLVED IN A ROLLOVER ACCIDENT.  WE WERE TRAVELING NORTH BOUND ON THE M53 VAN DYKE EXPRESSWAY WHICH HAS A POSTED SPEED OF 70 MPH.  I HAD JUST PASSED A VEHICLE THAT WAS IN THE RIGHT LANE.  JUST AFTER PASSING THIS VEHICLE I DEVELOPED THIS DEATH WOBBLE, I WAS SWITCHING LANES BACK TO THE RIGHT LANE WHEN MY STEERING WHEEL STARTED TO SHAKE, NOT JUST A LITTLE SHACKING EITHER.  I HAD APPLIED MY BRAKES AND HELD THE WHEEL WITH BOTH MY HANDS.  MY STEERING WHEEL WAS SHACKING SO BADLY THAT MY DASHBOARD WAS FALLING APART, AND I WAS HAVING MAJOR PROBLEMS CONTROLLING MY VEHICLE.  IT FELT AS IF MY DRIVER?S WHEEL WAS BOUNCING UP AND DOWN AND MY STEERING WHEEL WAS ALSO SHAKING SO BADLY THAT IN JUST A SECOND I HAD LOST TOTAL CONTROL OF MY VEHICLE.  MY TRUCK DRIFTED TO THE RIGHT AND MY LEFT FRONT WHEEL HIT THE TURF FOLLOWED BY MY LEFT REAR WHEEL HITTING THE TURF AND WE STARTED TO ROLL.  WE ROLLED TWO IN HALF TIMES BEFORE COMING TO A STOP UPSIDE DOWN.  THE CAB OF THE TRUCK WAS CRUSHED, THE RIGHT REAR CORNER OF THE CAB WAS PUSHED DOWN FURTHER THAN THE HEADRESTS ON THE SEAT WERE MY YOUNGEST WAS SITTING, AND THANK GOD MY 7 YEAR OLD WASN?T KILLED.  ON THE PASSENGER?S SIDE THE ROOF WAS SMASHED AGAINST THE HEAD REST WERE MY DAUGHTER WAS SEATED.  I AM VERY THANKFUL THAT MY 3 CHILDREN AND I LIVED THROUGH THIS NIGHT MARE.  I HAVE DRIVEN A PICKUP TRUCK FOR OVER 20 YRS., AND I HAVE NEVER FELT THIS DEATH WOBBLE BEFORE.",
        "vin": "1FTSW21556E"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/10/2013",
        "dateOfIncident": "09/01/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10542833,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS COMPLAINT IS FOR STEERING OSCILLATION, OR \"DEATH WOBBLE\".  THE VEHICLE IN QUESTION IS COMPLETELY STOCK, WITH NO LIFT.  THIS EVENT HAS OCCURRED NUMEROUS TIMES UNDER A VARIETY OF DRIVING CONDITIONS AND SPEEDS. THE VIOLENCE OF THIS HAPPENING WHILE DRIVING AT ANY SPEED IS FRIGHTENING AND DANGEROUS, PARTICULARLY AT 70 MPH ON THE INTERSTATE. FORD HAS ISSUED SEVERAL TECHNICAL BULLETINS RELATING TO THIS PROBLEM, BUT NO SOLUTIONS HAVE BEEN OFFERED BESIDES CHECKING YOUR TIRE PRESSURE. TO ME AND THE THOUSANDS OF CONSUMERS THAT HAVE HAD THIS PROBLEM, THAT SEEMS TO BE A CONVENIENT WAY TO SAY IT IS NOT A DESIGN PROBLEM THAT SHOULD BE CORRECTED, BUT OPERATOR ERROR. IT IS INCREDIBLE THAT SOMETHING THIS DANGEROUS AND POTENTIALLY LIFE THREATENING IS NOT BEING ADDRESSED BY THE NHTSA AND THAT FORD IS NOT BEING HELD ACCOUNTABLE FOR THEIR DESIGN PROBLEM. THIS IS A DANGEROUS SITUATION THAT NEEDS TO BE ADDRESSED.  *TR",
        "vin": "1FTSX21P96E"
    },
    {
        "components": "UNKNOWN OR OTHER,EQUIPMENT ADAPTIVE/MOBILITY,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/31/2013",
        "dateOfIncident": "07/14/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10532866,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON A TWO LANE BLACKTOP ROAD AT 35 MPH, WHEN THE VEHICLE UNEXPECTLY DIED LOSING ALL POWER, INCLUDING STEERING AND BRAKES.  THIS OCCURRED AFTER I HAD JUST EXITED A U.S. HIGHWAY WHERE THE SPEED LIMIT WAS 65 MPH.   DUE TO THE FACT THAT I AM A FORMER POLICE DEFENSIVE DRIVING INSTRUCTOR I WAS ABLE TO STEER THE VEHICLE TO A SIDE STREET.  I BOUGHT THIS VEHICLE TO TOW A 14,000 LB. FIFTH WHEEL TRAILER AND I AM GLAD IT WAS NOT ATTACHED.. IT TURNED OUT THAT THE PROBLEM WAS THE STC FITTING. FORD TOLD ME THAT THIS PART HAS A COMMON FAILURE PROBLEM AND IT HAS BEEN REPLACED WITH THE REVISED STC FITTING.  MY CONCERM IS THAT FAILURE OF THIS PART WITH AN INEXPERIENCED DRIVER ON AN INTERSTATE COULD BE FATAL. THE STC FITTING IS APPARENTLY ATTACHED TO THE HIGH PRESSURE OIL PUMP, AND WHEN IT FAILS YOU LOSE ALL POWER AND THE VEHICLE WILL NOT RESTART.  *TR",
        "vin": "1FTSW21P16E"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": true,
        "dateComplaintFiled": "06/07/2013",
        "dateOfIncident": "06/07/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10515705,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-250. THE CONTACT STATED THAT WHILE DRIVING 70 MPH, THE VEHICLE STALLED WITHOUT WARNING CAUSING THE DRIVER'S SIDE REAR TO CRASH INTO A GUARD RAIL. THE CONTACT SUSTAINED NECK INJURIES. NO POLICE REPORT WAS FILED. THE VEHICLE WAS TAKEN TO DEALER FOR DIAGNOSIS WHERE IT WAS ADVISED THAT THE ALTERNATOR NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED BUT THE PROBLEM PERSISTED. THE MANUFACTURER WAS NOT NOTIFIED. THE VIN WAS NOT AVAILABLE. THE APPROXIMATE FAILURE MILEAGE WAS 1,000.  *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, DIESEL,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/29/2013",
        "dateOfIncident": "01/22/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10514140,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-250. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 65 MPH, THE VEHICLE STALLED. THE VEHICLE WAS TOWED TO THE DEALER WHERE THE CONTACT WAS ADVISED THAT THE FUEL PUMP, CIRCUIT AND THE FUEL INJECTORS WOULD HAVE TO BE REPLACED. THE VEHICLE WAS REPAIRED BUT TO NO AVAIL.  THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 106,000.  *TR",
        "vin": "1FTWW33P86E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/02/2013",
        "dateOfIncident": "03/31/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10505315,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PULLING A TRAVEL TRAILER, ENGINE BEGAN TO OVERHEAT. PULLED OVER AND NOTICE COOLANT RESERVOIR IS EMPTY. TOOK VEHICLE INTO A REPAIR SHOP, MOTOR COOLANT AND BOTH EGR COOLER FAILED. SERVICE SHOP REPORTED THAT FORD INFORMED THEM THAT THIS IS A COMMON ISSUE. THEY KEEP EXTRA EGR PARTS ON HAND FROM THE MASSIVE AMOUNT OF FAILURES REPORTED.   *TR",
        "vin": ""
    },
    {
        "components": "STRUCTURE,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "03/21/2013",
        "dateOfIncident": "02/04/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10503882,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY HUSBAND DRIVES A 2006 FORD F250 SUPERCAB PICKUP TRUCK WITH APPROXIMATELY 53,000 MILES (LOW MILEAGE FOR THE YEAR OF THE TRUCK). RECENTLY, THE LATCH CABLES ON THE REAR SUICIDE DOORS BOTH BROKE WITHIN 1 MONTH OF EACH OTHER, RENDERING THE REAR DOORS COMPLETELY INOPERABLE. FROM RESEARCHING BLOGS ONLINE, THIS IS CAUSED BY A DEFECTIVE PLASTIC PART IN THE LATCH MECHANISM AND IS QUITE COMMON ON THIS TYPE FORD TRUCK DOOR. THE PARTS AND LABOR ARE QUITE COSTLY ($400 PER DOOR), AS THE WHOLE MECHANISM MUST BE REPLACED, RATHER THAN JUST THE DEFECTIVE PLASTIC PIECE. THIS IS CERTAINLY A SAFETY CONCERN, AS ANYONE IN THE REAR OF THE VEHICLE IS TRAPPED INSIDE, AS THE DOORS WILL NOT UNLATCH AND OPEN. WE WERE TOLD BY FORD CUSTOMER CARE THAT THEY WILL NOT CORRECT THIS PROBLEM AND MUST REPLACE THE LATCH WITH THE SAME TYPE LATCH CABLE THAT HAS ALREADY BROKEN (CASE # [XXX]). THERE IS NO GUARANTEE WITH THE REPLACEMENT THAT IT WILL NOT HAPPEN AGAIN AND IS QUITE A SAFETY CONCERN, ESPECIALLY IF A CHILD IS IN THE REAR SEAT, AS PASSENGERS MAY NOT BE ABLE TO EXIT DURING AN EMERGENCY. WE FEEL THIS SHOULD BE A RECALL ISSUE AND THE DEFECTIVE PIECE SHOULD BE REPLACED AT NO CHARGE.  PERHAPS YOUR AGENCY CAN LOOK INTO THIS MATTER TO SEE IF THIS IS AS COMMON A PROBLEM AS IT APPEARS AND IS NOT ISOLATED TO MODEL AND YEAR OF OUR FORD TRUCK. THESE DOORS ARE COMMON ON MANY FORD TRUCKS. FORD WILL NOT PROVIDE A REMEDY OR RELIEF FOR THIS SITUATION. THANKS FOR YOUR TIME.     INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *TR",
        "vin": "1FTSX21536E"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/26/2013",
        "dateOfIncident": "11/07/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10500135,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-250. THE CONTACT STATED THAT WHEN DRIVING APPROXIMATELY 40 MPH OVER A ROAD BUMP, THE STEERING WHEEL BEGAN TO EXHIBIT A VIOLENT VIBRATION. THE FAILURE RECURRED WHEN TRAVELING BETWEEN 40-60 MPH OVER A ROAD BUMP, POTHOLE OR UNEVEN ROAD SURFACES.  THE MANUFACTURER WAS NOT NOTIFIED OF THE PROBLEM. THE FAILURE MILEAGE WAS UNAVAILABLE.",
        "vin": "1FTSW21P26E"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/18/2013",
        "dateOfIncident": "02/15/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10498483,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKE CALIPERS ON THE F-250 S.D. [RIGHT SIDE ONLY] LOCKED UP CAUSING IT TO PULL VERY HARD TO THE RIGHT. ON THE REAR I HAD TO REPLACE: ROTOR, CALIPER, AND PADS. ON THE FRONT, [RIGHT] JUST THE PADS.  *TR",
        "vin": "1FTNF21516E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/28/2013",
        "dateOfIncident": "12/16/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10494918,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS PULLING A 3 HORSE TRAILER HOME FROM AN EVENT LOCATED IN JACKSON, MS . WHEN WE REACHED MCCOMB, MS THE TRUCK DIED. WE WERE RUNNING ABOUT 50 MPH WHEN THAT HAPPENED, POWER STEERING WAS GONE AND TRUCK HAD TO ROLL TO A STOP. I PUT THE EMERGENCY FLASHERS ON, WAITED A MINUTE AND ATTEMPTED TO RESTART THE TRUCK. IT CRANKED AND I WAS ABLE TO LIMP HOME. THERE WERE NO WARNING INDICATORS. THE TRUCK IS STILL IN THE SHOP AND THE MECHANICS ARE CHANGING PARTS BUT CANNOT SEEM TO CORRECT THE PROBLEM. IN FRUSTRATION, I DID A LOT OF RESEARCH ON THE INTERNET AND IT APPEARS THAT THIS NOT AN UNCOMMON PROBLEM FOR 03-07 POWERSTROKE DIESELS. I FEEL THIS IS A SAFETY HAZARD, A DEFECT IN THE ENGINEERING AND THAT  FORD SHOULD CORRECT THE PROBLEM. THE PUBLIC NEEDS TO BE INFORMED. PLEASE INVESTIGATE THIS ISSUE.  *TR",
        "vin": "1FTSW21P16E"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/23/2013",
        "dateOfIncident": "01/09/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10494444,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN TRAVELING DOWN THE HIGHWAY AT 60 MILES PER HOUR THE TRUCK STATED VIOLENTLY SHAKING IN THE FRONT END AND THE STEERING WHEEL DID AS WELL WHEN I HIT A BUMP IN THE ROAD. THE SHAKING STOPPED AS I REDUCED SPEED TO 20 MILES PER HOUR. VERY DANGEROUS , AND HAS ALMOST CAUSED ME TO HIT OTHER CARS TWICE. AFRAID TO DRIVE ON HIGHWAY!! NEEDS TO BE FIXED BY FORD BEFORE SOMEONE DIES!!  *TR  ## VIN PASSED ##",
        "vin": "1FTNF21556E"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/31/2012",
        "dateOfIncident": "01/31/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10490616,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT END OF THE TRUCK BEGINS TO VIOLENTLY SHAKE AT 60 MILES AN HOUR.  SOMETIMES A BUMP CAUSES IT, OTHER TIMES IT OCCURS WHEN SIMPLY DRIVING STRAIGHT.  HAVE HAD REGULAR SERVICE AT FORD DEALER, BUT THE ISSUE HAS GOTTEN PROGRESSIVELY WORSE OVER THE YEARS.  HAVE ALERTED THEM OF THE PROBLEM FOR YEARS.  IT'S ALL OVER THE INTERNET AS \"FORD F250 FRONT END SHAKE\" OR MORE CONCERNINGLY AS THE \"FORD DEATH WOBBLE.\"  IT'S NOT A TIRE PRESSURE ISSUE, AS I'VE ONLY USED PROPERLY INFLATED FACTORY TIRES THAT WERE DEALER INSTALLED.  PROBLEM HAS CONTINUED TO GET WORSE, AND THE SHAKE HAS NOW MADE THE TRUCK VIRTUALLY UNDRIVABLE AT 60 MPH.  PLEASE GOOGLE THE ISSUE.  IT'S REAL.  LOVE MY FORD, BUT MY FAMILY COMES FIRST, AND THE WOBBLE IS TOO SCARY TO IGNORE.  JUST PAID ANOTHER $2800 TO TRY ANOTHER FIX (TRACK BAR AND BALL JOINTS), PLUS ANOTHER $2000 FOR  NEW TIRES.  SOMEONE WILL GET HURT WITH THIS.  *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/28/2012",
        "dateOfIncident": "12/27/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10490410,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE BACKING UP APPLYING BRAKING, HEARD POP THEN HAD BRAKE PEDAL PRESSURE FAILURE. VEHICLE STOPPED AFTER STRIKING EMBANKMENT. APPLYING BRAKE PEDAL AGAIN PRESSURE RETURNED WITH GRINDING AND ERRATIC WHEEL BRAKING. MECHANIC FOUND BROKEN CALIPER SUPPORT BRACKET DEFECTIVE CALIPER AND ROTOR DUE TO INTERFERENCE  HAD THIS OCCURRED AT A GREATER SPEED OR OTHER LOCATION THE OUTCOME WOULD HAVE BEEN CATASTROPHIC. *TR",
        "vin": "1FTNF21586E"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/11/2012",
        "dateOfIncident": "10/10/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10488019,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-250.  THE CONTACT STATED THAT WHEN THE VEHICLE WAS BEING DRIVEN 50 MPH OR MORE, THE FRONT END OF THE VEHICLE WOULD VIBRATE VIOLENTLY. THE FAILURE WOULD ALSO OCCUR WHEN DRIVING OVER A SLIGHT ROAD BUMP. THE CONTACT TOOK THE VEHICLE TO THE DEALER WHERE THE FRONT SHOCKS, STRUTS AND STEERING STABILIZER WAS REPLACED, BUT THE REPAIRS DID NOT PERMANENTLY CORRECT THE FAILURE. THE VEHICLE WAS NOT FURTHER REPAIRED.  THE FAILURE MILEAGE WAS UNKNOWN, BUT THE CURRENT MILEAGE WAS 150,000.",
        "vin": "1FTSW21526E"
    },
    {
        "components": "SUSPENSION,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/03/2012",
        "dateOfIncident": "12/05/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10487269,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE OVER 118 PAGES OF REPAIRS DEALING FROM ELECTRICAL, SUSPENSION, ENGINE FAILURE, TURBO, FLUID LEAKAGE, OIL COOLER FAILURE. EJECTORS, GLOW PLUGS AND COUNTING. THEY CONTINUE TO REOCCUR TIME AFTER TIME AND DEALER WILL NOT COVER. I MET ALOT OF CONSUMERS THAT HAS THE SAME VEHICLE AND THEY ALL ARE HAVING THE SAME PROBLEM. I KNOW THAT FORD HAS SUED THE DESIGNER OF THE 6.0 ENGINE AND WON BILLIONS BUT WILL NOT ATTEMPT TO ASSIST THE CONSUMER. THE RIGHT THING TO DO IS, IF YOU KNOW THAT IF THERE'S A PROBLEM WITH A PROBLEM WHY NOT ASSIST THE CONSUMER IN CORRECTING INSTEAD OF DOING A PATCH JOB. THEY WILL NOT ATTEMPT TO DO THE RIGHT THING UNLESS SOMEONE FORCE THEM TO DO SO. THANKS   *TR",
        "vin": "1FTSW21P56E"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/04/2012",
        "dateOfIncident": "10/13/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10483320,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY F250 P/U HAS A DEATH WOBBLE ABOVE 50 MPH. THAT HAS ALMOST MADE ME CRASH ON SEVERAL OCCASIONS.  *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/16/2012",
        "dateOfIncident": "03/17/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10480772,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "FROM THE VERY FIRST DAY I GOT THE TRUCK WHEN YOU GO DOWN THE HIGHWAY AT A SPEED OF 60 OR HIGHER THE FRONT END SHAKES VIOLENTLY AND PULLS THE TRUCK TO THE LEFT. AND IT DOES IT TO THIS DAY 6YRS LATER. FORD KNOWS OF THE PROBLEM AND STATED IN A LETTER TO ME FROM FORD THAT 2006 F250 TRUCKS HAVE THIS PROBLEM AND IS DANGEROUS. BUT THEY HAVE NOT COME UP WITH A FIX FOR IT AS OF THIS DATE. IT WAS DANGEROUS WHEN I BOUGHT IT IN 2006 AND IT IS STILL DANGEROUS TODAY. YOU COULD POSSIBLY GO INTO ANOTHER LANE AND HIT ANOTHER CAR OR CROSS OVER INTO ON COMING TRAFFIC. FORD SHOULD BE MADE TO FIX THE PROBLEM AT NO COST TO THE OWNERS.  *TR",
        "vin": ""
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/13/2012",
        "dateOfIncident": "10/13/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10480018,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A KING RANCH 2006 F-250 SD WITH 20\" ALUM RIM'S AND THIS IS THE SECOND TIME IN 8 MONTHS A MAJOR CRACK BETWEEN THE SPOKES WAS DISCOVERED.  THE TIRE WAS ALMOST COMPLETELY FLAT WAS CAUSE THE VEHICLE TO PULL HARD TO THE RIGHT AND WHEN PULLED OVER, I DISCOVERED A 6\" LONG CRACK ABOUT 1/16\" WIDE.  WENT BACK TO DEALER AGAIN AND HE SAID THE SAME THING, \"I CANNOT HELP AND FORD DOES NOT THINK THIS IS A PROBLEM.  YOUR AGENCY NEEDS TO START AN INVESTIGATION BEFORE SOMEONE DIES DUE TO FORD NOT WANTING TO ADMIT THEY HAVE A MAJOR PROBLEM. *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/10/2012",
        "dateOfIncident": "07/06/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10470086,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-250. THE CONTACT STATED THAT WHILE DRIVING 60 MPH, THE STEERING WHEEL WOULD JERK AND THE VEHICLE WOULD LUNGE WITHOUT WARNING  THE DEALER WAS NOT NOTIFIED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE.  THE FAILURE MILEAGE WAS 29,000 AND CURRENT MILEAGE WAS 29,500.    UPDATED 10/17/12 *CN",
        "vin": "1FTFX1ET4CF"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/26/2012",
        "dateOfIncident": "07/20/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10467864,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F250. THE CONTACT STATED THAT THE VEHICLE WOULD NOT START. THE VEHICLE WAS TOWED TO THE DEALER FOR DIAGNOSIS. THE DEALER STATED THAT THE HIGH PRESSURE OIL WOULD NEED REPLACING. THE VEHICLE WAS REPAIRED HOWEVER THE FAILURE CONTINUED. THE MANUFACTURER WAS CONTACTED AND STATED THAT THE VEHICLE WAS NOT UNDER WARRANTY. THE FAILURE MILEAGE WAS 110,000 AND THE CURRENT MILEAGE WAS 120,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/22/2012",
        "dateOfIncident": "05/01/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10462727,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-250. THE CONTACT STATED THAT WHILE DRIVING 75 MPH, THE FIRST BRAKES ENGAGED INDEPENDENTLY. THE BRAKE DISENGAGED AS THE ABS WARNING LIGHT ILLUMINATED. ON A SEPARATE OCCASION, THE REAR PASSENGER BRAKE ENGAGED INDEPENDENTLY AND EMITTED SMOKE. THE BRAKE UNLOCKED AFTER THE SYSTEM COOLED DOWN BUT THE ROTORS SHOWED SIGNS OF OVERHEATING. IN ADDITION, THE FRONT PASSENGER BRAKE OVERHEATED AND CAUSED THE PASSENGER SIDE TIRE TO BLOW. THE VEHICLE WAS TAKEN TO A LOCAL MECHANIC AND THE FAILURE WAS LOCATED AT THE FRONT PASSENGER SIDE CALIPER. THE VEHICLE WAS REPAIRED. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 45,000 AND THE APPROXIMATE CURRENT MILEAGE WAS 75,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/18/2012",
        "dateOfIncident": "04/29/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10458898,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON HITTING AN EDGE OF BRIDGE BUMP, THE TRUCK VIOLENTLY VIBRATED UNTIL I SLOWED TO UNDER 45 MPH ON INTERSTATE. I WAS FRIGHTENED SO MUCH THAT I THOUGHT I WOULD CRASH. MY TIRES WERE INFLATED AND VEHICLE ALIGNED PROPERLY.  *TR",
        "vin": "1FTSW21P76E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/01/2012",
        "dateOfIncident": "02/08/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10456978,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON ACCELERATION, FROM STOP AT A RED LIGHT, VEHICLE HESITATED (STALLED) TO ACCELERATE.  UPON ACCELERATION, AFTER SEVERAL SECONDS, THICK CLOUD OF BLACK SMOKE APPEARED FROM EXHAUST PIPE, AND WHITE SMOKE DISCHARGED FROM ENGINE OIL (FILL) TUBE.  VEHICLE CONTINUED WITH DESCRIBED PROBLEM(S) FOR THE REST OF THE TRIP, WHICH WAS APPROXIMATELY TEN (10) MINUTES, AND HAS CONTINUED WITH DESCRIBED PERFORMANCE PROBLEMS FOR MANY DAYS SINCE.  THIS PROBLEM AROSE AFTER SPENDING OVER $2000 TO HAVE SIMILAR ENGINE PROBLEMS FIXED, AT FORD AUTHORIZED DEALERSHIP.  UPON CONTACTING FORD MOTOR COMPANY, DIRECTLY (FOR FINANCIAL ASSISTANCE ON FIXING THE PROBLEM FOR THE SECOND TIME), I WAS INFORMED THAT THERE WOULD BE NO SUCH ASSISTANCE GRANTED.  PERIOD.     *JS",
        "vin": "1FTSW21P56E"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/30/2012",
        "dateOfIncident": "05/02/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10456886,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-250. THE CONTACT STATED THAT A CRACK HAD ACCUMULATED ON THE FACTORY WHEEL DIRECTLY IN THE CENTER. THE CONTACT STATED THAT THE CRACK ON THE WHEEL CAUSED THE VEHICLE TO SHAKE WHILE DRIVING 35 MPH. THE CONTACT TOOK THE VEHICLE TO A DEALER TO HAVE THE WHEEL REPLACED AND THE DEALER COULD NOT FIND A REPLACEMENT WHEEL. THE FAILURE MILEAGE WAS 12,000.",
        "vin": "1FTSW21P96E"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/23/2012",
        "dateOfIncident": "04/23/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10456196,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING DOWN THE ROAD AND HIT A SMALL BUMP AND THE FRONT END STARTS SHAKING SO VIOLENTLY THAT YOU CAN'T CONTROL THE VEHICLE.  APPLYING BRAKES DOES NOT STOP THE SEVERE WOBBLE.  I ALMOST WENT THROUGH A GUARD RAIL DUE TO LOSS OF CONTROL.  THIS HAS HAPPENED SEVERAL TIMES AND FORD SAYS IT TIRE PRESSURE.  NOT!  THIS PROBLEM IS ALL OVER THE INTERNET.  FORD NEEDS TO MAN UP AND FIX THERE PROBLEM.  *TR",
        "vin": "1FTSW21P46E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/17/2012",
        "dateOfIncident": "04/02/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10456213,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 FORD F-250. CONSUMER STATES PROBLEM WITH EGR COOLER/EGR VALVE *TGW  THE CONSUMER STATED THE PURPOSE OF THE EGR COOLER WAS TO COOL THE EXHAUST. AFTER MAKING SOME INQUIRIES, IT WAS BROUGHT TO HER ATTENTION THAT IT WAS A VERY COMMON PROBLEM.  THE CONSUMER WAS INFORMED SINCE THE EGR VALVE WAS NOT MANUFACTURED PROPERLY, IT WAS GETTING PLUGGED UP WITH WET CARBON. THE CONSUMER WAS INFORMED IT WOULD COST $3,000 TO FIX THE PROBLEM. *JB",
        "vin": "1FTSX21P86E"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/09/2012",
        "dateOfIncident": "12/07/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10454624,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2006 FORD F-250 POWER STROKE 4 DOOR 4X4 TRUCK WITH STOCK 20 INCH MAG RIMS. TWO OF THEM ARE CRACKING IN THE FRONT . THE CRACK ON ONE OF THE RIMS IS ABOUT 6 INCHES LONG FROM SPOKE TO SPOKE ALONG SIDE THE BEAD OF THE TIRE. MY TRUCK ONLY HAS 86,000 MILES ON IT. TALKED TO FORD DEALER SHIP AND THEY TOLD ME TRUCK WAS OUT OF WARRANTY BUT OFFERED A  EXTENDED WARRANTY. THE ONLY HELP FORD GAVE ME WAS A PRICE ON TWO RIMS FOR ABOUT $3,000.00 DOLLARS. CALLED FORD MOTOR COMPANY THEY SAID TRUCK WAS OUT OF WARRANTY THEY COULD NOT DO A THING ABOUT IT. THEY ALSO OFFERED A EXTENDED WARRANTY.  *TR",
        "vin": "1FTSW21PX6E"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/26/2012",
        "dateOfIncident": "11/30/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10454088,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "SEE ATTACHED DESCRIPTION WITH THIS REPORT USING TCN: CCN26-19640 DESCRIPTION WRITE-UP... ..UPDATED 04/19/12 *BF  THE CONSUMER STATED THE DEFECT INVOLVED SEVERE FRONT SUSPENSION AND STEERING WHEEL OSCILLATION THAT CAN RESULT IN LOSS OF CONTROL AND LANE CHANGE AT HIGHWAY SPEEDS. THE CONSUMER STATED THE VEHICLE PERFORMS PERFECT WHEN NOT TRANSPORTATION A LOAD AT ANY SPEED ON ANY ROAD CONDITION.  HOWEVER, WHEN TRAVELING DOWNGRADES OF 6% OR MORE WITH THE 5TH WHEEL TRAILER AT SPEEDS ABOVE 50 MPH, A LIGHT TOUCH OF THE BRAKES TO SLOW THE COMBINATION VEHICLE DOWN INITIATES THE OSCILLATION WHICH WILL NOT STOP THE UNTIL THE VEHICLE SPEED FALLS BELOW 50 MPH. UPDATED 05/02/12",
        "vin": "1FTSW21P36E"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/20/2012",
        "dateOfIncident": "03/19/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10452381,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRUCK NOW THREE TIMES IN LESS THAN 5 MONTHS HAS SHOOK SO BAD THAT WE COULDN'T HOLD ONTO THE STEERING WHEEL, WHEN JUST RIDING OVER A BRIDGE SEAM. THE TRUCK SHOOK SO BAD THAT THE CAR IN THE NEXT LANE RAN OFF THE ROAD AND WE ENDED UP IN THE MEDIAN. WE HAVE PURCHASED NEW TIRES AND WE CHECK OUR PRESSURE DAILY. WHICH HAS NOTHING TO DO WITH THIS ISSUE. SOMEONE IS GOING TO BE KILLED WITH THIS HYPER SHAKING. I KNOW IF THERE ISN'T SOMETHING DONE THERE ARE GOING TO BE ACCIDENTS. WE LIVE IN THE NORTHEAST WHERE WE HAVE SNOW AND ICE WITH THE ROADS IN THAT CONDITION WE WOULD HAVE NEVER BEEN ABLE TO CONTROL THE TRUCK IF WE WOULD HAVE BEEN ON ICE AND SNOW. LUCKY IT WAS NOT SNOWING AND IT WAS DRY PAVEMENT.   I KNOW IF SOMETHING ISN'T DONE ABOUT THIS AND ALL THE OTHER COMPLAINTS THAT HAVE BEEN FILED FORD IS GOING TO BE SORRY WHEN SOMEONE IS KILLED. THE PROBLEM IS SO BAD YOU HAVE NO CONTROL OVER THE STEERING AND HAVE NO PLACE TO GO WHEN THIS HAPPENS. WE ALMOST SIDESWIPED THE CAR NEXT TO US THANK GOODNESS THEY WERE PAYING ATTENTION WHEN IT HAPPENED. THEY STOPPED AND ASKED IF WE WERE OK. THEY SAID THEY NEVER SAW ANYTHING LIKE THAT BEFORE. WE HAVE OWNED AT LEAST 6 F-150 TRUCKS AND 4 FORD EXPLORERS SO YOU COULD SAY WE ARE FORD PEOPLE. BUT I AM NOT SO SURE WE WILL STAY A FORD FAMILY SINCE THEY DON'T SEEM TO WANT TO DO ANYTHING TO REMEDY THIS ISSUE AND IT IS HAPPENING IN THE NEW ONES ALSO. WE HAVE A FRIEND THAT HAS A 2011 AND IT DOES THE SAME THING. I KNOW YOU HAVE DISMISSED COMPLAINTS BEFORE BUT SOMEONE IS GOING TO BE KILLED. THEN MAYBE SOMETHING WILL BE DONE BY YOU OR FORD WHEN THAT HAPPENS IT IS A SHAME THAT IT TAKES A DEATH TO MAKE SOMEONE DO SOMETHING.   *KB",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/13/2012",
        "dateOfIncident": "03/05/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10451566,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS  DRIVING ON THE FREEWAY AND HIT A SMALL BUMP.  FRONT END STARTED SHAKING SEVERLY.  TRUCK WAS FORCED TO CHANGED LANES AND THANK GOODNESS NO ONE WAS BESIDE ME.  EVERYTHING IN THE TRUCK WAS SHAKING.  ONCE I PULLED OVER OT THE SIDE OF THE ROAD, I COULD SMELL A BURNT SMELL.  *TR",
        "vin": "1FTSW21P76E"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/04/2012",
        "dateOfIncident": "05/03/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10450223,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "F250SD DIESEL    ABOUT 65 MI.S.OF ELI,NV. THE CK ENGINE SYMBOL CAME ON,SO I PULLED OVER AND LOOKED UNDER THE HOOD. THERE WAS OIL ALL OVER THE TOP OF THE ENGINE,[MAYBE 1 GAL.]. OIL WAS COMING OUT OF PLASTIC COOLANT OVERFLOW BOX.  NO OIL SHOWED ON CHECK STICK.  I GOT 2 GAL OF OIL FROM SOMEONE PASSING BY AND LIMPED INTO ELI NV.  THE PICKUP SEEMED TO RUN OK AND NO OTHER WARNINGS SHOWED.  [I WATCHED TEMPS CLOSELY].  TURNED OUT THE OIL COOLER INTERNAL [UNDER THE INTAKE MANIFOLD] SPRUNG A LEAK AND FORCED OIL INTO THE COOLANT SYSTEM.  MY TRUCK WAS BARELY OVER THE 5 YR. WARRANTY SO NO HELP THERE FROM FORD.  I ALWAYS WANTED A FORD DIESEL BUT NOT ANYMORE. COST $2200. FOR REPAIRS, AND LOST 3 WEEKS WITH THE TRUCK.  HAD TO HIRE A U-HAUL TO GET HOME TO BOISE AND COME BACK FOR MY PICKUP. MY QUESTION IS WHY NO HELP FROM FORD? I STILL HAVE THE BAD COOLER.  *TR",
        "vin": "1FTSX21P66E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/26/2012",
        "dateOfIncident": "02/20/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10449348,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "EGR AND OIL COOLER FAILURE...CAUSED ENGINE FAILURE AND HYDROLOCK SITUATION. THE ENGINE STOPPED THE TRUCK RIGHT IN THE MIDDLE OF AN INTERSECTION ALMOST CAUSING AN ACCIDENT. TOTAL COST OF REPAIRS TO MY VEHICLE $2542.42. SURE WOULD BE NICE FOR FORD TO HAVE A HAND IN THE REPAIRS DUE TO THEIR FAULTY ENGINE DESIGN. I HAVE READ 100'S OF REPORTS ONLINE ABOUT THIS AND FORD STILL WILL NOT FIX OR HELP PAY FOR THEIR ENGINE. FORD REFUSED TO HELP WITH REPAIR COST. I ONLY HAVE 98000K MILES. PLEASE LAUNCH AN INVESTIGATION INTO THESE COMPLAINTS. I BELIEVE YOU WILL FIND ENOUGH EVIDENCE TO WARRANT AN INVESTIGATION. I AM SURE THAT THE LOBBYIST AT FORD ARE DOING THEIR JOB TO KEEP THIS FROM BECOMING A RECALL SITUATION. IT IS HURTING NO ONE BUT THE OWNERS OF THIS 6.0L DIESEL ENGINE!!! WE NEED YOUR HELP!   *TR",
        "vin": "1FTSX21P46E"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/26/2012",
        "dateOfIncident": "11/01/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10445453,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FICM (FUEL INJECTOR CONTROL MODULE) ON THE 6.0L POWERSTROKES ARE A KNOWN ITEM TO FAIL. THEY LOSE VOLTAGE AND MAKE INJECTORS NOT WORK, WHICH SHUTS OFF THE VEHICLE. THIS CAN HAPPEN AT ANY TIME WHILE AT AN IDLE OR GOING DOWN THE HIGHWAY. ONCE THIS HAPPENS, THE TRUCK SHUTS OFF AND YOU LOSE POWER STEERING AND BRAKING ABILITY. MINE SHUT OFF WHILE GOING DOWN THE ROAD SEVERAL TIMES NOW, BUT FORD DOES NOT WANT TO WARRANTY IT. MY SMALL TOWN FORD DEALERSHIP REPLACES SEVERAL OF THESE PARTS A WEEK. DOES SOMEONE HAVE TO DIE FOR THEM TO ISSUE A RECALL ON THESE? *TR",
        "vin": "1FTSW21P76E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE,EQUIPMENT ADAPTIVE/MOBILITY",
        "crash": false,
        "dateComplaintFiled": "01/19/2012",
        "dateOfIncident": "01/06/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10444599,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2006 FORD F250 6.0 IT HAS BEEN TOWED 8 TIMES, I VE HAD TURBO,INJECTOR,ELECTRICAL,WHEEL,TRANS PROBLEMS SINCE DAY ONE OF PURCHASE. THERES OVER 16 PAGES OF MECHANICAL PROBLEMS THAT HAS BEEN PERFORMED AND COUNTING. I KNOW I AM NOT THE ONLY ONE THATS HAVING THESE PROBLEMS AND I CAN'T GET MUCH ASSISTANCE FROM FORD. IT GOING TO TAKE SOMEONE LIKE THIS AGENCY TO HELP US. THIS IS ALOT WHEN YOU PAY $51000.00 PLUS ADDITION REPAIRS FOR A VEHICLE WITH A EXTENTED WARR.  *TT",
        "vin": "1FTSW21P56E"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/15/2012",
        "dateOfIncident": "11/12/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10443876,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE \"DEATH WOBBLE\" OCCURRED IN MY VEHICLE WHILE TRAVELING ALONE WITH NO TRAILER AND THE BED WAS EMPTY.  THIS HAS OCCURRED SEVERAL TIMES, THE FIRST WHILE TRAVELING NORTHBOUND ON THE 5FWY IN SOUTHERN CALIFORNIA.  AT THE TIME THE SHAKING WAS SO VIOLENT THAT I THOUGHT THAT I HAD BLOWN A TIRE AND PULLED OVER.  I HAD JUST PURCHASED THE VEHICLE.  THE SAME ISSUE IS ALREADY UNDER INVESTIGATION: PE07057.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/30/2011",
        "dateOfIncident": "12/27/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10441724,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A OWNS A 2006 FORD F-250. THE CONTACT STATED THAT THE VEHICLE EXPERIENCED DIFFICULTY ACCELERATING AT ALL SPEEDS. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER AND THE CONTACT WAS INFORMED THAT ALL OF THE SPARK PLUGS FRACTURED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND OFFERED NO ASSISTANCE. THE FAILURE MILEAGE WAS 128,000.",
        "vin": "1FTSX20526E"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/30/2011",
        "dateOfIncident": "12/18/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10441780,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-250.  THE CONTACT WAS DRIVING 60 MPH OVER A ROAD BUMP WHEN THE VEHICLE BEGAN TO SHAKE VIOLENTLY.  THE CONTACT TOOK THE VEHICLE TO THE DEALER FOR A DIAGNOSTIC TEST BUT  THE DEALER WAS UNABLE TO DEFECT THE CAUSES OF THE FAILURE.  THE MANUFACTURER SUGGESTED ADDING FRONT DAMPERS TO THE VEHICLE BUT THE VEHICLE WAS ALREADY EQUIPPED WITH STOCK DAMPERS THAT DID NOT NEED TO BE REPLACED.  THE VEHICLE WAS NOT REPAIRED. THE CONTACT WAS CONCERNED WITH THE POSSIBILITY OF LOSING CONTROL OF THE VEHICLE WHEN THE FAILURE OCCURRED.  THE FAILURE MILEAGE WAS 62,000.",
        "vin": "1FTSW21P26E"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/27/2011",
        "dateOfIncident": "11/02/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10441407,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER \"SHUTTER\" INCIDENT (THIS HAS OCCURRED SINCE PURCHASED NEW) VEHICLE STEERING WOULD NO TURN TO THE LEFT. AFTER REPEATED ATTEMPTS A FULL RIGHT TURN THEN FAST FORCED LEFT TURN A POP/ CRACK OCCURRED WHICH THEN ALLOWED RESTRICTED LEFT TURN. STEERING LOCKED SEVERAL MORE TIMES WHILE TRYING TO SAFELY EXIT THE HIGHWAY.  *TR",
        "vin": "1FTNF21586E"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/21/2011",
        "dateOfIncident": "08/01/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10440829,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F250. THE CONTACT STATED THAT THE STEERING WHEEL AND THE FRONT END OF THE VEHICLE WOULD VIBRATE EXCESSIVELY WHEN TRAVELING OVER A ROAD OR SPEED BUMP. THE DEALER WAS CONTACTED AND THEY ADVISED THE CONTACT THAT THE AIR PRESSURE IN THE TIRES CAUSED THE VEHICLE TO VIBRATE. THE CONTACT RECEIVED A MANUFACTURER'S RECALL NOTICE CONCERNING THE VIBRATION, BUT THE MANUFACTURER WOULD NOT REPAIR THE VEHICLE STATING THAT THE VEHICLE HAD BEEN ALTERED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 2,000 AND THE CURRENT MILEAGE WAS 39,000.  KMJ",
        "vin": "1FTSX21516E"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/15/2011",
        "dateOfIncident": "12/10/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10440021,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUCK BEGAN TO HAVE A STEERING WOBBLE. STEERING WHEEL WOULD VIBRATE BECAUSE WHEELS WERE JUMPING ON THE PAVEMENT.   PROGRESSIVELY GOT WORSE.  CURRENTLY AT 70K MILES DRIVING SPEED ANYWHERE BETWEEN 30 AND 70 MPH, WHEN I DRIVE OVER A BUMP, HIT A SMALL POT HOLE OR EVEN THE SMALLEST DIP ON THE ROAD SURFACE THE TRUCK BEGINS TO SHAKE VIOLENTLY, BEST WAY TO STOP IT IS TO APPLY BRAKES HARD UNTIL TRUCK REACHES A MUCH LOWER SPEED.  I HAVE BEEN DRIVING BEHIND OTHER TRUCKS THAT ARE EXPERIENCING IT AND CAN SEE THE FRONT WHEELS SHAKING HARD AND QUICK,  LEFT, RIGHT, UP AND DOWN ( VIBRATING) ON THE ROAD.  *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/13/2011",
        "dateOfIncident": "10/06/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10439799,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-250. THE CONTACT STATED THAT WHEN DRIVING OVER ANY ROAD BUMP OR UNEVEN ROAD SURFACE, THE FRONT END OF THE VEHICLE WOULD SHAKE VIOLENTLY. THE VEHICLE WAS TAKEN TO A MECHANIC WHERE IT WAS DETERMINED THAT THE UPPER AND LOWER BALL JOINTS ON THE FRONT PASSENGER AND DRIVER SIDE OF THE VEHICLE NEEDED TO BE REPLACED. THE CONTACT SPOKE WITH THE DEALER AND THE DEALER ADVISED THAT THE FAILURE WAS CAUSED BY THE TIRES AND RECOMMENDED CHECKING THE TIRE PRESSURE. THE FAILURE MILEAGE WAS 53,500 AND THE CURRENT MILEAGE WAS 54,000.",
        "vin": "1FTSW21P06E"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/12/2011",
        "dateOfIncident": "09/21/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10439666,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM HAVING SEVERE VIBRATION AND STEERING ISSUES THE THIS MODEL. I CAN NOT DRIVE IT WITHOUT HURTING MY BACK. THE TRUCK NEEDS A COMPLETE SUSPENSION OVERHAUL. SHOULD BE TAKING OFF THE ROAD. VERY DANGEROUS!  *TR",
        "vin": "1FTSX21556E"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/10/2011",
        "dateOfIncident": "12/08/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10439269,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "SHIMMING VIOLENTLY, HARD TO GET THE VIBRATION TO STOP. THE WHOLE STEERING COLUMN AND STEERING WHEEL WAS SHAKING BACK AND FORTH. THE FRONT TIRES MUST HAVE BEEN SHAKING ALSO, SINCE THE AUTO ALONG SIDE OF ME PULLED WAY BACK AWAY FROM MY RIGHT SIDE. I DROVE OVER A DIP AND A BUMP IN THE ROADWAY AND THEN IT HAPPENED. THE TIRES ARE AT THE RIGHT AIR PRESSURE. I AM THE ORIGINAL OWNER AND THE PRIMARY DRIVER OF THIS VEHICLE. ALSO THE TRUCK IS A DIESEL 4X4.  *TR",
        "vin": "1FTSW21P16E"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "12/09/2011",
        "dateOfIncident": "11/22/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10439218,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-250. THE CONTACT STATED THAT THE FRONT DRIVER'S SIDE WHEEL DEVELOPED A CRACK. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER, WHO WAS UNABLE TO DIAGNOSE THE FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE, BUT OFFERED NO ASSISTANCE BECAUSE THE VEHICLE WAS NOT INCLUDED IN ANY RECALLS. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGES WERE 150,000.",
        "vin": "1FTSW21P66E"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "11/30/2011",
        "dateOfIncident": "11/07/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10437820,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "CONTINENTAL",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TIRE SEPARATION.  *KB",
        "vin": "1FTSW21P96E"
    },
    {
        "components": "SUSPENSION,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/19/2011",
        "dateOfIncident": "05/11/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10430766,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "VIOLENT SHAKING/ VIBRATIONS @ HIGHWAY SPEEDS.  I PULLED OVER TO COMPLETE STOP, WAITED, STARTED UP AND VIBRATION STOPPED. THIS HAS HAPPENED ON 3 OCCASIONS SINCE. *TR",
        "vin": "1FTSW21Y56E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/19/2011",
        "dateOfIncident": "09/05/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10427254,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING ON VACATION WITH A TRAVEL TRAILER IN TOW, THE TEMPERATURE GAUGE ON OUR 2006 FORD-F-250 (WITH A 5.4 LITER ENGINE) INDICATED THE ENGINE WAS OVERHEATING.  AFTER STOPPING SEVERAL TIMES ON THE BERM OF AN INTERSTATE, THERE WAS NO INDICATION THAT THE ENGINE WAS HOT.  SINCE WE WERE TRAVELING ON A HOLIDAY, THE TRUCK WAS FIRST TAKEN TO A PEP BOYS LOCATION WHERE THEIR EVALUATION SHOWED THERE WAS NO SIGN OF OVERHEATING.  WE WERE ADVISED OF A SERVICE BULLETIN ISSUED ON THIS VEHICLE STATING THAT IT MIGHT EXHIBIT FALSE OVERHEATING.  SO, WE CONTINUED OUR TRIP.  TRUCK CONTINUED TO DISPLAY FALSE READINGS AND THE ENGINE STARTED TO DERATE.  AT THIS TIME, WE HAD TO HAVE THE TRUCK TOWED TO A FORD DEALERSHIP, WHERE THEY INSTALLED AN UPDATED COOLANT CROSSOVER TUBE AND THERMOSTAT HOUSING TO CORRECT THE PROBLEM OF FALSE OVERHEATING.  THIS WORK WAS DONE (PARTS & LABOR) AT A COST TO US OF $645.67  AFTER AAA DISCOUNT.  THE COST TO US WAS A SURPRISE, AS THE DEALERSHIP WAS AWARE OF THE PROBLEM AND KNEW EXACTLY WHAT WAS NEEDED TO BE DONE TO RECTIFY IT. WE WERE TOLD THAT THIS KNOWN PROBLEM WAS A SERVICE BULLETIN NOT A RECALL BECAUSE IT IS NOT CONSIDERED A SAFETY ISSUE.  HOWEVER, IT WAS VERY MUCH A SAFETY ISSUE FOR US AS WE WERE COMPELLED TO STOP SEVERAL TIMES ON THE SIDE OF A BUSY INTERSTATE BEFORE HAVING TO REQUEST THAT THE PICKUP AND TRAVEL TRAILER BE TOWED TO A SAFE LOCATION.",
        "vin": "1FTSX21546E"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/13/2011",
        "dateOfIncident": "01/18/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10425288,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER TRAIN HAD REAR MAIN SEAL FAILURE AROUND THIS DATE. POWER TRAIN HAS ANOTHER FAILURE AND LEAK IN SEPTEMBER OF THE SAME YEAR WHICH FORD WILL NO LONGER FIX. VEHICLE HAS LESS THAN 100,000 MILES AND ONLY APPROX 81,000 WHEN THE POWER TRAIN BEGAN TO HAVE PROBLEMS. THIS VEHICLE HAS SEVERAL OTHER ISSUES WHICH FORD WILL NOT ADDRESS. THE CUSTOMER ASSISTANCE CENTER AND THE COMPANY REP WILL ONLY OFFER HALF OFF ON REPAIRS WHICH THEY CLAIM THEY ARE NOT RESPONSIBLE FOR AND WILL NOT ACKNOWLEDGE THE PAST OR OTHER CURRENT PROBLEMS THE VEHICLE IS HAVING. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/21/2011",
        "dateOfIncident": "07/14/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10413993,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-250. THE CONTACT STATED THAT THE VEHICLE WAS EMITTING SMOKE FROM THE TAIL PIPE. THE VEHICLE WAS TAKEN TO THE DEALER, WHO STATED THAT EGR COOLER, ENGINE COOLER, FUEL INJECTOR AND TURBO NEEDED TO BE REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE, BUT DID NOT OFFER ANY ASSISTANCE AND REFERRED THE CONTACT TO NHTSA. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGES WAS 63,500.",
        "vin": "1FTSW21P16E"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/18/2011",
        "dateOfIncident": "07/18/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10413448,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY FORD F-250 ON THE HIGHWAY, I HIT A MINOR BUMP IN THE ROAD.  THE TRUCK IMMEDIATELY STARTED SHAKING OUT OF CONTROL.  I LITERALLY HAD TO STOP IN THE MIDDLE OF THE HIGHWAY BEFORE THE SHAKING WOULD STOP.  THIS IS THE 11TH TIME THAT THIS HAS HAPPENED TO ME.  IT HAPPENS AT A SPEED OVER 50 MPH.  LUCKILY I HAVE NEVER WRECKED THE TRUCK. I HAVE BEEN ABLE TO MAINTAIN SOME SORT OF CONTROL.  I HAVE READ FORD'S REQUEST TO MAINTAIN ADEQUATE TIRE PRESSURE.  I READ THAT AFTER THE FIRST TIME IT HAPPENED.  IT HAS HAPPENED AN ADDITIONAL TEN TIMES.  WHEN IS ENOUGH ENOUGH?  DOES SOMEONE HAVE TO DIE BEFORE FORD REALIZES THAT THERE IS A PROBLEM?  *KB",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/16/2011",
        "dateOfIncident": "06/14/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10413160,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2006 F250 SUPER DUTY TRUCK THAT WILL HAVE VIOLENT FRONT END SHAKES AFTER HITTING A POT HOLE AT AVERAGE ROAD SPEEDS (55-70).  IT HAS OCCURRED WHILE TOWING AND DURING NORMAL DRIVING WITHOUT TOWING.  WHEN IT OCCURRED I HAD TO IMMEDIATELY PULL OF TO THE SIDE OF THE ROAD TO REGAIN CONTROL OF THE TRUCK.  I BELIEVE THIS TO BE A VERY UNSAFE CONDITION THAT FORD NEEDS TO RESOLVE.   *TT",
        "vin": "1FTSW21P36E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/15/2011",
        "dateOfIncident": "04/01/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10412417,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-250. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 65 MPH THE VEHICLE BEGAN TO ABRUPTLY DECELERATE UNTIL STOPPING. THE VEHICLE WAS TOWED TO AN AUTHORIZED DEALER WHERE THE CONTACT WAS INFORMED THAT THE EGR VALVE WAS STUCK IN AN OPENED POSITION. THE EGR VALVE WAS REPLACED. THE FAILURE HAD SINCE RECURRED TWICE. THE VEHICLE WAS TOWED BACK TO THE DEALER WHERE THE CONTACT WAS INFORMED THAT THE EGR COOLER AND OIL COOLER NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 136,000.",
        "vin": "1FTSW21P76E"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/15/2011",
        "dateOfIncident": "06/22/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10413071,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F250. THE CONTACT WAS DRIVING 25 MPH WHEN THE STEERING WHEEL BECAME DIFFICULT TO TURN. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO INSPECTED THE VEHICLE AND FOUND THAT THE TIE ROD SLEEVE ASSEMBLY TREAD HAD DETACHED. HE THE TIE ROD AND SLEEVE WERE REPLACED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 51,000.  UPDATED 09/19/11  *BF     UPDATED 2/9/2012 *CN",
        "vin": "1FTSX21506E"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/20/2011",
        "dateOfIncident": "06/03/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10407612,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2006 FORD F-250 LARIAT CREW CAB FOUR WHEEL DRIVE TRUCK.  I AM THE ORIGINAL OWNER.  THREE WEEKS AGO THE TRUCK STARTED EXPERIENCING VIOLENT FRONT-END SHAKING.  DURING AN EPISODE OF LEFT-TO-RIGHT SHAKING, THE TRUCK IS VERY DIFFICULT TO CONTROL.  WITH MY HAND PLACED ON THE 12:00 POSITION ON THE STEERING WHEEL, THE SHAKING VIOLENTLY TURNS THE STEERING WHEEL TO WHERE MY HAND IS GOING BACK AND FORTH BETWEEN 10:00 AND 2:00.  SLOWING DOWN TO 30MPH HAS STOPPED EACH OF THE THREE EPISODES.  THIS TRUCK HAS THE FACTORY INSTALLED WRANGLER ATS TIRES AND DOES NOT HAVE A LIFT KIT ON IT.  AIR PRESSURE IN THE TIRES EQUAL MANUFACTURERS RECOMMENDATION.  I AM TAKING THE TRUCK TO MY LOCAL FORD DEALERSHIP IN TWO DAYS FOR DIAGNOSTICS.  THEY ACT AS IF THIS IS AN UNCOMMON PROBLEM, BUT FOLLOWING AN INTERNET SEARCH, IT APPEARS TO BE VERY COMMON.  IT APPEARS THAT FORD MOTOR COMPANY HAS BLAMED TIRE PRESSURE, GIANT AFTERMARKET TIRES, AND LIFT KITS FOR THIS PROBLEM.  MY TRUCK HAS NONE OF THESE POSSIBLE CAUSES.  *TT",
        "vin": "1FTSW21P36E"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/24/2011",
        "dateOfIncident": "05/21/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10402591,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-250. THE CONTACT WAS DRIVING APPROXIMATELY 60 MPH AND DROVE OVER A POT HOLE WHEN THE ENTIRE VEHICLE BEGAN TO VIBRATE VIOLENTLY AND CAUSED THE DRIVER TO ALMOST LOSE CONTROL OF THE VEHICLE. THE FAILURE WAS EXPERIENCED ON AN INTERMITTENT BASIS. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THEY ADVISED HIM THAT THEY WERE UNABLE TO DIAGNOSE THE FAILURE. THE MANUFACTURER WAS CONTACTED AND THEY OFFERED NO ASSISTANCE. THE FAILURE MILEAGE WAS APPROXIMATELY 15,000.",
        "vin": "1FTSX215X6E"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/11/2011",
        "dateOfIncident": "02/16/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10401539,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2/15/10 ~ FUEL REGULATOR CHANGED. 2/16/10 ~ SENSOR AND CONNECTOR CHANGED. 3/1/2010~ FUEL INJECTORS REPLACED, EGR COLLOR CONNECTOR, HIGH PRESSURE OIL PUMP PRELACED. NOW 1 YEAR LATER ALL INJECTORS NEED TO BE REPLACED AGAIN.",
        "vin": "1FTSW21P56E"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "04/28/2011",
        "dateOfIncident": "04/20/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10398134,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR CONDITIONING ISSUE:   IN TURNING ON THE AIR CONDITIONING IN MY F250 FORD TRUCK THIS YEAR IT DID NOT COOL THE CAB.   IN TAKING IT TO A MECHANIC TO SEE WHAT WAS THE PROBLEM, I WAS TOLD THAT 3 TECHNICAL BULLETINS HAD BEEN ISSUED ON THE A/C UNIT.   UNLESS THERE WAS A PROBLEM, NO ONE WOULD HAVE CHECKED THE A/C.  BULLETINS 06-17-12, 08-13-5 AND 08-13-5 - LACK OF A/C COOLING DUE TO DEFICIENT MATERIAL CLOGGING ORIFICE TUBE.   NOW IT IS COSTING OVER $800 FROM MY POCKET TO FIX A PROBLEM THAT FORD ACKNOWLEDGES THAT IT KNOWS ABOUT AND BECAUSE OF THE BAD PART, THE ENTIRE A/C SYSTEM HAS BEEN COMPROMISED.  *TR",
        "vin": "1FTSX215X6E"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/24/2011",
        "dateOfIncident": "04/23/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10397273,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "UNCONTROLLABLE WOBBLE TO VEHICLE AFTER HITTING BUMP ON FREEWAY AT 65 MPH.  NOT FIRST TIME AND LUCKY I DIDN'T END UP OFF THE FREEWAY.  HAD SERVICE DONE AT FORD DEALERSHIP FOR THE SAME PROBLEM IN AUG 2010, REPLACED CAMBER CASTING AND TWO WHEEL ALIGNMENT, AND TIRE PRESSURE.  PROBLEM IS BACK.  *TR",
        "vin": "1FTSW21546E"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/14/2011",
        "dateOfIncident": "05/10/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10390092,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 F250 WITH 36,000 MILES. FRONT END SHAKES VIOLENTLY AFTER HITTING BUMPS IN ROAD. APPEARS  TO BE MORE PRONOUNCED WHEN  ENCOUNTERING A SERIES OF BUMPS AND GOING DOWN HILL. THERE IS A LOSS OF EFFECTIVE BRAKING WHEN FRONT END IS SHAKING . CAN NOT UNDERSTAND WHY NO RECALL WHEN THERE ARE SO MANY SIMILAR POSTINGS SUBMITTED. ALSO FRONT DRIVE UNIVERSALS ARE BEING REPLACED AT 45,000 MILES AND VACUUM LINE FOR 4 WHEEL ACTIVATION HAS BURNED OFF THREE TIMES, REPAIRED TWICE MY DEALER AT CUSTOMERS COST. *TR",
        "vin": "1FTSX21586E"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/11/2011",
        "dateOfIncident": "03/10/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10389849,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD F-250. THE CONTACT STATED THAT WHEN TRYING TO DECELERATE HE SMELLED A STRONG ODOR. WHEN HE  INSPECTED THE VEHICLE, THE CALIPERS ON THE BRAKE LINE HAD DISINTEGRATED. THE MANUFACTURER WAS NOTIFIED AND OFFERED NO ASSISTANCE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGE WAS APPROXIMATELY 108,400. UPDATED 04/12/11*LJ  THE CONSUMER STATED WHEN HE PULLED THE BRAKE APART, HE NOTICED ONE OF THE TWO CALIPER PISTONS HAD DISINTEGRATED. UPDATED 04/13/11",
        "vin": "1FTSW21P36E"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/03/2011",
        "dateOfIncident": "03/13/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10386266,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-250.  THE CONTACT WAS DRIVING 70 MPH AND DROVE OVER A ROAD BUMP. THE VEHICLE BEGAN TO SHAKE VIOLENTLY. THE CONTACT RECEIVED A LETTER FROM THE MANUFACTURER REGARDING THE \"DEATH WOBBLE\" THAT INFORMED OWNERS TO CHANGE THE TIRES, LOWER THE TIRE PRESSURE AND HAVE A WHEEL ALIGNMENT PERFORMED.  THE CONTACT FOLLOWED THE DIRECTIONS ACCORDING TO THE LETTER BUT TO NO AVAIL. THE CONTACT STATED THAT THERE WERE NUMEROUS COMPLAINTS ONLINE REGARDING THE \"DEATH WOBBLE\" AND BELIEVED THAT THE MANUFACTURER SHOULD ISSUE A RECALL. THE FAILURE MILEAGE WAS 30,000.",
        "vin": "1FTSW21P76E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/12/2011",
        "dateOfIncident": "02/12/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10381722,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2006 FORD F 250 WITH THE TRITON 54 . I HAD IT FOR 2 DAYS WHEN THE MOTOR STARTED TICKING. I'M TOLD THAT IT'S A SPARK PLUG ISSUE AND NO ONE IS WILLING TO WORK ON IT DUE TO THE HIGH COST OF FIXING THE PROBLEM WHEN THE PLUGS BREAK OFF IN THE HEAD AND THEY ALSO SAID IT WILL PROBABLY BLOW A SPARKPLUG OUT . THIS WILL COST APROX. $3000 TO FIX . *TR",
        "vin": ""
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "12/26/2010",
        "dateOfIncident": "12/01/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10372435,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS STOLEN OFF LARSON FORDS LOT WITHIN 30 SECONDS. I WAS TOLD BY A DETECTIVE THAT THIS THE F150, 250, 350 ARE VERY EASY TO STEAL BY JABBING A SCREW DRIVER UP AND BEHIND THE DOOR HANDLE WHICH UNLOCKS THE DOOR THEN PUT THE SCREW DRIVER IN THE IGNITION AND START IT UP AND FORD COMPANY KNOWS ALL ABOUT THIS AND DID NOTHING TO FIX THE PROBLEM. *TR",
        "vin": ""
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/13/2010",
        "dateOfIncident": "09/30/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10360390,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2006 FORD F-250 SUPER DUTY TRUCK. WHEN I HIT A ROUGH SPOT IN THE ROAD THE FRONT END SHAKES SO BAD YOU HAVE NO CONTROL OF THE STEERING. THE ONLY WAY TO GET IT TO STOP SHAKING IS TO GET ON THE BRAKES AND STOP. I HAVE BEEN BACK TO THE DEALER AND THEY TELL ME THERE IS NOTHING WRONG. SOMEONE IS GOING TO GET KILLED IF THIS IS NOT CORRECTED.  *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/07/2010",
        "dateOfIncident": "12/08/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10359500,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F250. THE CONTACT ATTEMPTED TO ACCELERATE FROM A COMPLETE STOP, BUT THERE WAS NO ENGINE POWER. THE VEHICLE WAS TOWED TO THE DEALER WHERE THE FUEL FILTER WAS REPLACED. THE FAILURE REOCCURRED TWO DAYS AFTER THE REPAIR. THE CONTACT WAS ABLE TO DRIVE THE VEHICLE BACK TO THE DEALER FOR DIAGNOSIS. THE TECHNICIAN INFORMED THE CONTACT THAT THE FAILURE COULD POSSIBLY BE CONTRIBUTED TO THE FUEL INJECTORS. THE VEHICLE WAS IN THE PROCESS OF BEING REPAIRED. THE VEHICLE HAD NOT BEEN DRIVEN FOR ONE YEAR DUE TO THE INTERMITTENT FAILURES AND INSUFFICIENT REPAIRS. THE FAILURE OCCURRED FOUR DIFFERENT TIMES. THE FAILURE MILEAGE WAS APPROXIMATELY 120,000. THE VIN WAS UNAVAILABLE.  UPDATED 12/10/10. *LJ",
        "vin": ""
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/19/2010",
        "dateOfIncident": "05/01/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10356330,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "FORD 2006 F250 SD DIESEL, HAS HAD VIOLENT SHAKING OF THE STEERING, HAPPENS ATLEAST TWICE PER TRIP, STARTED AROUND 15000 MILES ON TRUCK, HAVE 44000 MILES NOW, SEEMS TO BE GETTING WORSE, THIS STARTED LITTLE OVER A YEAR AFTER I PURCHASED IT BRAND NEW TIL CURRENT, 9/18/10, WAS TOLD BY THE DEALER THAT IT WAS A TIRE PRESSURE ISSUE, IT IS NOT THAT, IT DID NOTHING FOR THE PROBLEM, THIS VEHICLE IS TRULY UNSAFE TO CARRY ME AND MY FAMILY IN. VERY SCARY. *TR",
        "vin": "1FTSW21P46E"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/03/2010",
        "dateOfIncident": "09/02/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10353642,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "FORD 2006 F250 DEATH WOBBLE. I WAS DRIVING MY TRUCK TODAY AND I HIT A LITTLE POT HOLE IN THE ROAD AND NEARLY LOST CONTROL OF MY TRUCK. THE TRUCK WAS SHAKING SO BAD I THOUGHT FOR SURE THE FRONT WHEELS WERE OFF AND WE WERE DEAD. SCARIEST THING EVER. FORD NEEDS TO RECALL THIS ISSUE BEFORE IT KILLS SOMEONE IF IT HASN'T ALREADY. THIS IS VERY SERIOUS WE PAY GOOD MONEY FOR THESE VEHICLES AND SHOULD NOT HAVE TO PAY OUT OF POCKET FOR THE FIX. THANK YOU VERY MUCH FOR TAKING THE TIME TO READ THIS HOPE FORD DOSE THE RIGHT THING AND RECALLS THIS ISSUE. *TR",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/18/2010",
        "dateOfIncident": "08/08/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10350257,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-250. THE CONTACT STATED THAT WHENEVER HE WOULD RIVE OVER A ROAD BUMP, THE VEHICLE WOULD SHAKE EXCESSIVELY. THE FAILURE WOULD OCCUR MOST PROFOUNDLY WHEN DRIVING AT A SPEED OF AT LEAST 50 MPH.  THE MANUFACTURER ADVISED THAT THE FAILURE WAS CAUSED BY IMPROPER INFLATION OF THE TIRES. THE CONTACT INFLATED THE TIRES TO THE SPECIFICATIONS RECOMMENDED BY THE MANUFACTURER AND THE SHAKING BECAME WORSE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 30,000 AND THE CURRENT MILEAGE WAS 39,000. UPDATED 11/16/10. *LJ",
        "vin": "1FTSX21536E"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/14/2010",
        "dateOfIncident": "07/07/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10343265,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "VIOLENT SHAKING OF FRONT END AFTER HITTING A BUMP ON THE ROAD.  ONE STRIP OF HIGHWAY IN OUR TOWN WE CAN RECREATE ISSUE EVERYTIME.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/24/2010",
        "dateOfIncident": "06/19/2010",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10339837,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F250. THE VEHICLE WAS SITTING IDLE WHEN THE CONTACT WENT TO START THE ENGINE. THE GEAR SHIFTER OPENING ERUPTED INTO FLAMES AND SMOKE. THE CONTACT REMOVED THE KEY FROM THE IGNITION AND WAS ABLE TO EXTINGUISH THE SMALL FIRE. A TOW TRUCK COMPANY ARRIVED TO TOW THE VEHICLE AND THE FAILURE RECURRED. THE FIRE WAS EXTINGUISHED A SECOND TIME AND THE VEHICLE WAS TOWED TO THE DEALER. THE DEALER ADVISED THE FAILURE WAS AN ELECTRICAL FAILURE. THE VEHICLE WAS LEFT WITH THE DEALER WHERE THE CONTACT WAS AWAITING UNKNOWN REPAIRS. THE FAILURE AND CURRENT MILEAGES WERE 75,550.",
        "vin": "1FTSW21P16E"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/24/2010",
        "dateOfIncident": "09/18/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10339848,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-250. THE CONTACT STATED WHEN DRIVING OVER AN UNEVEN ROAD SURFACE AT SPEEDS LESS THAN 70 MPH, THE FRONT END WOULD WOBBLE ABNORMALLY. THE DEALER REPLACED THE TRANSMISSION SHIFT AND INSTALLED A DAMPER ON THE FRONT END OF THE VEHICLE. THE FAILURE RECURRED WITHIN FOUR MONTHS. THE VEHICLE WAS NOT DIAGNOSED OR FURTHER REPAIRED. THE FAILURE MILEAGE WAS 17,000 AND THE CURRENT MILEAGE WAS 47,000.",
        "vin": "1FTSW215X6E"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,TRACTION CONTROL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/30/2010",
        "dateOfIncident": "05/30/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10333888,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A FORD SUPER DUTY F 250 2006 WAS BOUGHT 03-18-10 .APROX 2 1/2 MONTHS  THE TRUCK VIOLENTLY SHAKES AND LOSES CONTROL WHEN HITTING THE SMALLEST BUMP IF EXCEEDING 45 KLM OUR HIGHER. IF YOU APPLY YOUR BRAKES WHILE THIS HAPPENS THE BACK END WILL 360 THIS IS A DEATH TRAP. THIS HAS HAPPENED ABOUT 15 TIMES BUT IT COULD OF BEEN MORE I ONLY DRIVE VERY SLOW AND IN THE SLOW LANE SO IF IT HAPPENS I CAN PULL OVER. I HAVE HAD EVERYTHING REPAIRED ON THIS TRUCK I REPLACED ALL THE HEAVY DUTY SHOCKS THE TIE RODS THE STEERING DAMPER THE ALIGNMENT THE PRESSURE IN MY TIRES AND EVEN THE BRAKES, AT FIRST I THOUGHT THE GARAGE JUST WANTED MY MONEY BUT ONCE SEARCHING ON THE INTERNET I FOUND MANY OTHERS WITH THE EXACT SAME PROBLEMS NO ONE HAS FOUND A SOLUTION TO THE PROBLEMS AND MY OWN MECHANIC SAYS HE HAS EXHAUSTED ALL AVENUES WITH THIS TRUCK. MY BIGGEST FEAR IS SOMEONE WILL HAVE TO DIE TO MAKE FORD UNDERSTAND THERE IS A DEFECT WITH THIS TRUCK AND I DON'T WANT IT TO BE ME. I HAVE NOT DRIVEN THIS TRUCK IN THE WINTER AS OF YET AND CAN TELL YOU WITH EXPERIENCE IF THE TRUCK SHAKES VIOLENTLY AND I HAVE A HAD A TOUGH TIME CONTROLLING IT IN THE SUMMER IMAGINE THE WINTER. SOMEONE NEEDS TO TAKE THIS SERIOUS. JUST TELL ME HOW TO FIX IT AT LEAST I CAN MAKE IT SAFE. *TR",
        "vin": "1FTSX21566E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/27/2010",
        "dateOfIncident": "05/27/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10332479,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING REPLACEMENT OF SPARKPLUGS IN A 2006 FORD F-250, 5 PLUGS HAD TO BE BORED OUT DUE THE PLUGS DISINTEGRATING UPON ATTEMPTS TO REMOVE THEM.  THE REPAIR COSTS ARE $600-800 TO REMOVE THE REMAINDER OF THE PLUGS AND INSTALL NEW PLUGS.  WHEN THE FORD SERVICE REPRESENTATIVE WAS ASKED WHAT CAUSED THIS PROBLEM AND IF IT WOULD OCCUR AGAIN THE FOLLOWING ANSWER WAS PROVIDED.  DURING PRODUCT ASSEMBLY AT THE FACTORY , NO LUBRICANT WAS PLACED ON THE SPARKPLUG THREADS IN \"SOME MODELS\", CAUSING THE BASE TO WELD ITSELF TO THE ENGINE.  THIS CAUSED WHAT SHOULD BE A $300 REPAIR TO MORE THAN DOUBLE IN COST.  FORD SHOULD HAVE TO BEAR REPAIR COSTS TO BORE OUT THE PLUGS, NOT THE CAR OWNER.  THIS PROBLEM IS WIDELY KNOWN, BUT THE CONSUMER HAS NO COURSE OF ACTION EXCEPT A COSTLY LEGAL REMEDY.  I WILL NO LONGER PURCHASE FORD PRODUCTS BASED ON MY RECENT PROBLEMS WITH THEIR PRODUCTS. *TR",
        "vin": "1FTSX21586E"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/24/2010",
        "dateOfIncident": "05/24/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10332063,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE SHIMMIES WHEN I HIT ANY SIZE BUMP ON THE ROAD. IT IS VERY VIOLENT AND HAS CAUSED ME TO MOVE ACROSS LINES IN THE ROAD. *TR",
        "vin": "1FTSW21P56E"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/19/2010",
        "dateOfIncident": "05/18/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10331252,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD F-250 EXTENDED CAB. WHILE CHANGING THE BRAKES, THE CALIPER PISTON THE DRIVER SIDE CRUMBLED, THE FRONT PASSENGER SIDE CALIPER PISTON WAS LOCKED. THE CONTACT TOOK THE VEHICLE TO AN AUTHORIZED DEALERSHIP WHERE HE WAS INFORMED THAT THE CALIPER WAS LOCKED, FROZEN OR BUSTED. THE CURRENT AND FAILURE MILEAGES WERE APPROXIMATELY 60,000.",
        "vin": "1FTSX21P86E"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/03/2010",
        "dateOfIncident": "08/01/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10328683,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "OVER THE PAST 9 MONTHS I HAVE NOTICED A FRONT END/STEERING WHEEL VIBRATION AT HIGHWAY SPEEDS IN MY 2006 FORD F250.  AT FIRST, THE VIBRATION WOULD GO AWAY IF I ACCELERATED THROUGH IT OR SLOWED DOWN.  IT HAS WORSENED TO THE POINT WHERE IT HAS CAUSED ME TO PARTIALLY LOSE CONTROL OF THE TRUCK.      I FIRST BOUGHT FOUR NEW TIRES.  I THEN HAD THE LARGE RETAIL CHAIN WHERE I PURCHASED THE NEW TIRES ROTATE AND BALANCE THE THEM MULTIPLE TIMES WITH NO IMPROVEMENT.  THEY SUGGESTED TAKING THE TRUCK TO THE DEALERSHIP TO HAVE IT CHECKED.  I HAVE SINCE HAD THE TRUCK INTO THE DEALERSHIP MULTIPLE TIMES (BALANCING AND ROTATING, STEERING DAMPENER, AND CARRIER BEARING). *TR",
        "vin": "1FTSW21P96E"
    },
    {
        "components": "AIR BAGS,EQUIPMENT",
        "crash": true,
        "dateComplaintFiled": "04/19/2010",
        "dateOfIncident": "03/30/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10326448,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "THIS WAS A SINGLE VEHICLE CRASH INVOLVING A 2006 FORD F-250 EXTENDED CAB 4X4 PICKUP ON A COUNTY MAINTAINED GRAVEL SURFACED ROAD.  UPON LEAVING THE ROADWAY THE FRONT OF THE VEHICLE STRUCK A TREE HEAD ON, JUST TO THE RIGHT SIDE OF CENTER.  THERE WERE NO PASSENGERS, JUST THE OPERATOR IN THE VEHICLE.  THE ESTIMATED SPEED WAS 30-35 MPH.  THE AIRBAG DID NOT DEPLOY.  THE DRIVER WAS TREATED AT A MEDICAL FACILITY AND RELEASED. *TR",
        "vin": "1FTSX21527E"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/16/2010",
        "dateOfIncident": "02/13/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10326010,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY FORD F250 4X4 TRUCK HAS A SEVERE SHIMMY OF THE FRONT WHEELS WHICH CAN OCCUR WHEN DRIVING AROUND 55-60 MILES PER HOUR. IN ORDER TO CALM THE SHIMMY OR OSCILLATION, I HAVE TO SLOW DOWN AT LEAST 10 MILES PER HOUR.  THIS HAS HAPPENED ON SEVERAL TIMES, BOTH WHEN TOWING A 5TH WHEEL AND WITHOUT THE 5TH WHEEL.  HOWEVER, IT IS MORE PRONE TO OCCURRING WHEN DOWNING THE 5TH WHEEL.  I TOOK MY TRUCK INTO THE FORD DEALER TO INSPECT THE SUSPENSION AND ADJUST THE TIRE PRESSURE, BUT THEY SAID IT WAS ALL FINE.  I HAD AN OCCURRENCE OF THIS SHIMMY WITHIN 3 DAYS FROM TAKING IT FROM THE DEALER.  I HAVE SEEN THERE HAS BEEN SOME REPORT ON THIS TYPE OF BEHAVIOR, AND FORD HAS STATED IT IS A TIRE INFLATION PROBLEM, BUT AFTER TAKING IT INTO THE FORD DEALER AND THEM CHECKING IT OUT AND THEN IT HAPPENING, I THINK IT IS SOMETHING MORE SERIOUS. *TR",
        "vin": "1FTSW21P46E"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/12/2010",
        "dateOfIncident": "02/15/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10325110,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD F-250. THE CONTACT WAS DRIVING APPROXIMATELY 65 MPH WHEN THE TRUCK BED CRACKED WITHOUT WARNING. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER. THE VEHICLE HAD NOT BEEN REPAIRED AT THE TIME OF THE COMPLAINT. THE FAILURE MILEAGE WAS 117,000. THE CURRENT MILEAGE WAS 121,000.  UPDATED 06/25/10. *LJ  UPDATED 06/29/10",
        "vin": "1FTSX20P56E"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "04/10/2010",
        "dateOfIncident": "04/09/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10324810,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SON WAS DRIVING HIS 2006 FORD F 250 TRUCK WHEN THE STEERING LINKAGE BROKE AND HE LOST ALL ABILITY TO STEER HIS TRUCK. HE CRASHED INTO A PIECE OF EQUIPMENT. *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/17/2010",
        "dateOfIncident": "03/17/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10320462,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL * THE CONTACT OWNS A 2006 FORD F250. THE CONTACT STATED THAT WHILE TRAVELING AT SPEEDS OF 40 MPH IN CLEAR WEATHER CONDITIONS, THE ENTIRE FRONT END OF THE VEHICLE WOULD SHAKE EXCESSIVELY. HE ATTEMPTED TO SHUT OFF AND RESTART THE ENGINE TO CORRECT THE FAILURE TO NO AVAIL. THE FAILURE WOULD OCCUR SEVERAL TIMES WHILE OPERATING THE VEHICLE. THE MANUFACTURER WAS CONTACTED AND ADVISED TAKING THE VEHICLE TO THE DEALER FOR FURTHER INSPECTION. THERE HAD BEEN NO REPAIRS TO THE VEHICLE AS OF YET. THE FAILURE MILEAGE WAS 18,000 AND THE CURRENT MILEAGE WAS 28,000.",
        "vin": "1FTSW21P76E"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/13/2010",
        "dateOfIncident": "01/05/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10319477,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT END DEATH RATTLE. GOING INTO A CURVE ON A HIGHWAY AND HITTING A BUMP. THE FRONT END SHAKES AND RATTLES TO THE POINT WHERE I HAVE TO HIT THE BRAKES UNTIL THE SPEED SLOWS DOWN TO ABOUT 40 MPH. I HAVE CHANGED THE STEERING DAMPENER, THE SHOCKS AND NOTHING SEEMS TO HELP. FORD SAID TO CHECK THE TIRE PRESSURE. I'VE SET IT TO THE RECOMMENDED TIRE PRESSURE FROM FORD AND I'VE SET IT FROM THE  TIRE MANUFACTURES RECOMMENDATIONS. NOTHING WORKS. I'VE SHIMMIED ACROSS SEVERAL LANES OF TRAFFIC AND AM TOTALLY SURPRISED THAT I HAVE NOT GOTTEN INTO A ACCIDENT YET. *TR",
        "vin": "1FTSW21P36E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "03/12/2010",
        "dateOfIncident": "02/12/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10319347,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD F-250. WHEN THE CONTACT WOULD ATTEMPT TO START HIS VEHICLE HE NOTICED THAT THE KEY WOULD TURN INSIDE THE IGNITION BUT THE ENGINE WOULD NOT START. THE VEHICLE WAS TAKEN TO A LOCAL MECHANIC SHOP WHERE THE CONTACT WAS INFORMED THAT THE INJECTOR DRIVING MODULE WAS DEFECTIVE AND NEEDED TO BE REPLACED. THE VEHICLE HAD NOT  BEEN REPAIRED AT THE TIME OF THE COMPLAINT. THE CURRENT AND FAILURE MILEAGES WERE 160000.",
        "vin": "1FTSW21P66E"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/04/2010",
        "dateOfIncident": "11/28/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10316933,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A PROBLEM WITH MY 2006 FORD F-250. MY FRONT END WANTS TO VEER OFF THE ROAD WHEN I HIT POT HOLES IN THE ROAD. I HAVE TRAVELED THE SAME ROADS WITH MY WORK TRUCK, 2006 F-150 AND HAVE LITTLE OR NO PROBLEMS COMPARED TO THE F250.  I HAVE TAKEN MY TRUCK TO THE DEALER I PURCHASED THE TRUCK FROM AND HAVE NO SUCCESS GETTING THE PROBLEM RESOLVED.*TR",
        "vin": "1FTSW205X6E"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/25/2010",
        "dateOfIncident": "02/13/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10314410,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6)    WITHIN THE LAST YEAR AND A HALF I PURCHASED A 2006 FORD F-250, DIESEL, 4 WHEEL DRIVE TRUCK. ON 3 DIFFERENT OCCASIONS,WHILE DRIVING AT INTERSTATE SPEEDS AND IMMEDIATELY AFTER HITTING A POT HOLE OR BUMP,MY TRUCK WENT INTO A VIOLENT FRONT END WOBBLE/CAVITATION CAUSING A SUDDEN REDUCTION OF SPEED TO ZERO FROM APPROX 70 MPH. ALL THREE TIMES IT FELT AS IF THE TRUCK WAS COMING APART AND HAD TO DODGE TRAFFIC AND GET TO THE SHOULDER TO INSPECT THE TRUCK. AFTER FINDING NOTHING WRONG I CONTACTED OUR LOCAL DEALERSHIP TO LOOK AT THE TRUCK AND THEY TRIED DIFFERENT AIR PRESS CHANGES IN THE TIRES, AND RE-ALIGNMENT, NOTHING HAS HELPED AND THEY REFUSE TO LOOK ANY FURTHER. I STARTED RESEARCHING THIS ON THE INTERNET AND FOUND HUNDREDS IF NOT THOUSANDS OF FORD F-250 TRUCK OWNERS WHO ARE EXPERIENCING THE SAME PROBLEM. YOU CAN GOOGLE \"FORD 250 DEATH WOBBLE\" OR \"FORD F250 VIOLENT SHAKING\" AND READ FOR YOUR SELF THE STORIES OF NEAR ACCIDENTS AND PROBLEMS FORD REFUSES TO RECOGNIZE IN THE DESIGN OF THESE TRUCKS. HERE RECENTLY FORD MOTOR CO. HAS CAME OUT WITH A SERVICE BULLETIN WERE I HAVE TO PAY TO HAVE FORD FIX THIS PROBLEM. WHY SHOULD I HAVE TO PAY $40,000 FOR A TRUCK THAT HAS A DESIGN FLAW AND PAY FOR THE FIX,OUT OF MY OWN POCKET AS WELL. A RECALL NEEDS TO BE DONE ON THESE TRUCKS BEFORE PEOPLE GET KILLED,WHY SHOULD SOMEONE HAVE TO DIE FIRST BEFORE FORD WILL DO ANYTHING. ANY HELP YOU CAN GENERATE ON THIS WOULD BE AWESOME.\"THIS IS NOT A TIRE PRESS PROBLEM, BUT RATHER A DESIGN FLAW.\" YOUR REPORT SOUNDS LIKE YOU SIDE WITH MONEY INSTEAD OF CONSUMER SAFETY.                                 [XXX]  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "01/30/2010",
        "dateOfIncident": "01/29/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10303287,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TIE ROD BROKE AND I LOST ALL STEERING.  I ARRIVED AT AN INTERSECTION WHERE THE STREET I WAS ON IS REQUIRED TO STOP.  I WAS TURNING TO THE LEFT SO AS I WAS ACCELERATING THROUGH THE TURN AND THE INTERSECTION ALL STEERING DISAPPEARED AND I FOUND MYSELF IN THE DITCH AND FRONT YARD OF A NEIGHBOR'S HOUSE ROLLING OVER HIS GAS MAIN.  THIS OF COURSE CREATED ADVERSE SECONDARY EFFECTS, BUT WHAT IF THE TIE ROD HAD BROKEN WHILE I WAS ON THE FREEWAY, THE RESULTS WOULD HAVE BEEN MUCH DIFFERENT.  I WAS NOT HURT NOR WAS ANYONE ELSE, BUT A TIE ROD IS DESIGNED TO OUT LAST THE LIFE OF A VEHICLE.  THERE WAS OBVIOUSLY A FLAW IN THIS PARTICULAR PIECE OF EQUIPMENT. *TR",
        "vin": "1FTSX21P56E"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/01/2010",
        "dateOfIncident": "12/15/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10297729,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 F250 FRONT END SHAKES VIOLENTLY I HAD NEAR MISS ON A HEAD ON COLLISION. *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/04/2009",
        "dateOfIncident": "10/31/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10290898,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING NORTH ON I-95 ON 31 OCT 2009 WITH A 12' TRAILER FULL OF POTTERY IN TOW SPEED BETWEEN 75 AND 80.  JUST COMPLETED TRANSITION FROM BRIDGE BACK TO HIGHWAY WHEN TRUCK BEGAN TO SHAKE VIOLENTLY.  INITIAL REACTION WAS A BLOWOUT BUT QUICKLY REALIZED THAT THIS WAS THE SAME PROBLEM MY DAUGHTER INCURRED A WEEK EARLIER.  SLOWED TRUCK DOWN AND WORKED WAY ACROSS HIGHWAY TO SHOULDER OF ROAD TO CHECK OUT THE SITUATION.  AFTER VERIFYING NO TIRES WERE FLAT AND STEERING WAS ALL IN TACT RESUMED TRIP (VERY CAUTIOUSLY) TO NC. *TR",
        "vin": "1FTSW21P46E"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/28/2009",
        "dateOfIncident": "10/27/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10290181,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FAILURE OCCURS WHEN YOUR 2006 FORD F250 SUPER DUTY IS MOVING 45-65 MPH AND YOU HIT A BUMP, THE TRUCK STEERING BECOMES OSCILLATING AND YOU CAN EASILY LOOSE CONTROL IF YOU DON'T SLOW DOWN IMMEDIATELY. IT FEELS LIKE THE TIRE IS COMING LOOSE.  WE HAVE TALKED TO OUR LOCAL MECHANIC AND HE CURRENTLY HAS TWO OTHER TRUCKS WITH THE SAME PROBLEMS AND IS NOT SURE HOW TO FIX IT. *TR",
        "vin": "1FTSX21P86E"
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/15/2009",
        "dateOfIncident": "07/15/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10288602,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "EXTREME SHAKING AND NEAR LOSS OF CONTROL AFTER CROSSING OVER A MINIMAL BUMP AT SPEEDS ABOVE 55 MPH. HAPPENED 9 TIMES WITHIN THE LAST TWO YEARS. ONLY WAY TO END SHAKING WAS TO LEAVE THE ROADWAY AND SLAM ON THE BRAKE. *TR",
        "vin": ""
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/09/2009",
        "dateOfIncident": "09/08/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10283392,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2006 FORD F250 SUPER DUTY. IT HAS JUST PASSED 16,000 MILES ON IT. WHEN I DRIVE ON A HIGHWAY AND HIT A BUMP OR POTHOLE THE FRONT END OF THE VEHICLE BEGINS TO SHAKE VIOLENTLY. IT RADIATES THROUGH THE WHOLE VEHICLE AND IT BECOMES VERY HARD TO CONTROL AND YOUR ONLY OPTION IS TO SLOW DOWN AND WAIT FOR IT TO PASS. I WILL NO LONGER ALLOW MY CHILDREN TO RIDE IN MY TRUCK AS I FEEL IT IS VERY UNSAFE. THIS HAS HAPPENED ON SEVERAL OCCASIONS AND APPEARS TO BE GETTING WORSE. FORD SENT OUT A BULLETIN TO OWNERS OF THESE VEHICLES THAT WE MUST CHANGE OUR TIRE PRESSURE TO 65 PSI, BUT THIS STILL DOES NOT RESOLVE THE PROBLEM. *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/20/2009",
        "dateOfIncident": "05/01/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10281230,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2006 FORD F250 4WD SUPERDUTY PICKUP SHAKES VIOLENTLY WHENEVER I HIT THE SMALLEST POTHOLE OR DRIVE OVER RAILROAD TRACKS. IT IS A DANGER TO MYSELF, MY CHILDREN AND ANYONE DRIVING AROUND ME ON THE ROAD. TOOK THE TRUCK TO MY DEALER AND ALMOST GOT THROWN OUT AFTER GETTING INTO AN ARGUMENT WITH BOTH THE MECHANIC AND SVC MANAGER WHO SAID THERE WAS NOTHING WRONG WITH THE TRUCK, THEY NEVER HEARD OF THIS PROBLEM AND I NEED TO BUY NEW TIRES. TIRES ARE BRAND NEW WITH LESS THAN 20K ON THEM. *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/15/2009",
        "dateOfIncident": "07/15/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10276935,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I DRIVE A 2006 F250 AND IT HAS BEEN EXPERIENCING VIOLET FRONT END VIBRATIONS.  THIS OCCURS AT VARIOUS SPEEDS AND I HAVE TO SLOW DOWN OR STOP TO GET IT TO RETURN TO NORMAL.  IT ALMOST CAUSED AN ACCIDENT THE OTHER DAY WHEN I HAD TO SLOW DOWN TO 10 MILES PER HOUR ON THE FREEWAY TO GET IT TO STOP.  FORD CLAIMS IT IS TIRE PRESSURE BUT HAD TIRES ROTATED AND BALANCED TWO DAYS PRIOR.  THIS APPEARS TO BE A MAJOR DESIGN ISSUE AND A VERY DANGEROUS ONE. *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/15/2009",
        "dateOfIncident": "06/01/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10274491,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 FORD F250 HAS A STEERING PROBLEM.  *NJ  THE CONSUMER WAS TOWING A CAMPER. THE CONSUMER STATED WHILE DRIVING, THEY HIT A ROUGH SPOT IN THE ROAD AND THE VEHICLE BEGAN TO SHAKE VIOLENTLY. THE CONSUMERS HUSBAND IMMEDIATELY LET OFF THE GAS AND MERGED INTO THE SLOW LANE. A BOLT, BRACKET AND E-DAMPER ASSEMBLY WERE REPLACED. THE CONSUMER RECEIVED A LETTER FROM FORD STATING THAT SOME F-250 TRUCKS DID HAVE A VIBRATION/SHAKING IN THE STEERING. *JB *JB",
        "vin": "1FTSX21546E"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/05/2009",
        "dateOfIncident": "02/11/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10272974,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD F-250.  WHILE DRIVING APPROXIMATELY 60 MPH, THE VEHICLE DROVE OVER A BUMP IN THE ROAD AND BEGAN TO SHIMMY AND VIBRATE EXCESSIVELY.  THE FAILURES OCCURRED WHENEVER THE VEHICLE TRAVELED OVER ROUGH ROAD SURFACES.  THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER FOR INSPECTION, BUT THEY WERE UNABLE TO DUPLICATE THE FAILURES.  THE DEALER SUGGESTED THAT A LOSS OF TIRE PRESSURE MAY HAVE POSSIBLY CONTRIBUTED TO THE FAILURES.  THE FAILURES OCCURRED ON TWENTY SEPARATE OCCASIONS.  THE SERVICE WARRANTY EXPIRED AND THE VEHICLE HAS NOT BEEN REPAIRED.  THE FAILURE MILEAGE WAS 38,000 AND CURRENT MILEAGE WAS 50,500.",
        "vin": "1FTSX215X6E"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/01/2009",
        "dateOfIncident": "05/26/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10272506,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD F-250.  WHILE DRIVING 65 MPH, THE VEHICLE WOULD SHIMMY WHEN IT DROVE OVER A BUMP IN THE ROAD.  THE DEALER COULD NOT PROVIDE A REMEDY; THEREFORE, THE VEHICLE COULD NOT BE REPAIRED.  THE CONTACT FEELS THAT A CRASH COULD OCCUR ONE DAY.  THE CURRENT MILEAGE WAS 74,000 AND FAILURE MILEAGE WAS 32,000.",
        "vin": "1FTSW21536E"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "05/31/2009",
        "dateOfIncident": "05/31/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10272439,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 06 F250 SD, AND EVERYTIME I HIT A SMALL BUMP IN THE ROAD WHEN DOING 65+ SPEED I GET EXTREME SHAKING. I GOT A LETTER FROM FORD RECENTLY ABOUT THE SHIMMY THING, AND I TRIED WHAT THEY SAID AND ADJUSTED THE TIRE PRESSURE BUT I FOUND THIS DOES NOT WORK I STILL GET IT.  IT SAID IN THE LETTER THAT YOU ALL APPROVED THIS BUT I DON'T SEE HOW YOU COULD LET SUCH AND UNSAFE THING STILL BE ON THE ROADS. *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/23/2009",
        "dateOfIncident": "04/07/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10269777,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT END BOUNCING OUT OF CONTROL, AFTER HITTING A SLIGHT BUMP, OR POTHOLE AT A SPEED OF SIXTY OR MORE. *TR",
        "vin": "1FTSX21596E"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/01/2009",
        "dateOfIncident": "04/21/1997",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10267467,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD F-250.  WHILE DRIVING 45 MPH, THE FRONT END OF THE VEHICLE JUMPED UP AND DOWN.  IT FELT AS IF THE FRONT TIRE WAS DETACHING FROM THE VEHICLE.  THE CONTACT PULLED OVER AND THE WOBBLING DID NOT CEASE UNTIL THE VEHICLE CAME TO A COMPLETE STOP.  THE DEALER COULD NOT FIND ANY FAILURES WITH THE VEHICLE.  THE FAILURE WAS LABELED AS THE DEATH WOBBLE AND HAS OCCURRED ON FIVE OCCASIONS.  THE VEHICLE WAS REPAIRED AT THE CONTACT'S EXPENSE.  HEAVIER SHOCKS AND A STEERING STABILIZER WERE INSTALLED ON THE VEHICLE.  THE CONTACT RECEIVED A LETTER IN THE MAIL FROM FORD REGARDING THESE ONGOING FAILURES.  THE FAILURE MILEAGE WAS 6,000 AND CURRENT MILEAGE WAS 69,000.",
        "vin": "1FTSW21P66E"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/29/2009",
        "dateOfIncident": "10/24/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10267286,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "3-13-09 I TOOK MY FORD F-250 TO THE DEALERSHIP I PURCHASED IT FROM DUE TO A SEVERE STEERING WHEEL AND FRONT WHEEL VIBRATIONS.  THIS IS CAUSING SEVERE SHIMMY AND LOSS OF CONTROL OF THE VEHICLE AT APPROX 35-39 MPH. THEY CHECKED IT OUT AND TOLD ME THAT I NEEDED TO MAKE SURE MY TIRE PRESSURE IS AT 65 LBS AT ALL TIMES.  THEY SAID THEY DIDN'T FIND ANYTHING WRONG OTHER THAN THE TIRE PRESSURE WAS LOW AND IT TOOK CARE OF 85% OF THE SHIMMY. THE SHIMMY HAS WORSENED SENSE I LEFT THE DEALERSHIP AND IS NOW SHIMMING VIOLENTLY AT THIS TIME. I'VE SENSE RECEIVED A LETTER ABOUT THIS PROBLEM FROM FORD MOTOR COMPANY AND THEY ARE RESEARCHING THIS COMMON PROBLEM WITH THE F-250 & F-350 MODELS. *TR",
        "vin": "1FTSW21P46E"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/28/2009",
        "dateOfIncident": "04/27/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10267104,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 F250 CREW 4X4 XL - AROUND 50 MPH THE FRONT END SHAKES ME OFF OF THE ROAD - EITHER HAVE TO ACCELERATE THROUGH 50 OR HIT THE BRAKES - FRONT END IS TIGHT AND RIMS AND TIRES GOOD. *TR",
        "vin": "1FTSW21526E"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/20/2009",
        "dateOfIncident": "06/18/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10266146,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD F-250.  WHILE DRIVING BETWEEN 40-45 MPH IN RAINY CONDITIONS, THE CONTACT'S VEHICLE STRUCK AN OPPOSING VEHICLE ON THE DRIVER'S SIDE.  THE FRONTAL AIR BAGS FAILED TO DEPLOY, BUT THE CONTACT WAS UNINJURED.  THE POLICE WAS CALLED TO THE SCENE AND FILED A REPORT.  THE VEHICLE WAS TOWED TO AN AUTHORIZED DEALER AND REPAIRED.  ON APRIL 10, 2009, THE MASTER CYLINDER FAILED AND THE CONTACT CRASHED INTO TWO OTHER VEHICLES.  THE AIR BAGS FAILED TO DEPLOY AGAIN.  THE DRIVER WAS UNINJURED, BUT HIS VEHICLE SUSTAINED SEVERE BODY DAMAGE.  THE VEHICLE WAS TOWED TO A COLLISION CENTER AFTER BEING TOWED TO HIS RESIDENCE.  HOWEVER, THE OTHER TWO VEHICLES WERE COMPLETELY DESTROYED THE OCCUPANTS WERE INJURED.  THE VEHICLE IS IN THE PROCESS OF BEING INSPECTED AND REPAIRED.  THE CAUSE OF THE AIR BAG FAILURES HAS NOT BEEN DETERMINED.  THE VIN WAS UNKNOWN.  THE FAILURE MILEAGE WAS 36,000 AND CURRENT MILEAGE WAS 46,000.  UPDATED 05/18/09. *LJ  UPDATED 05/20/09.*JB",
        "vin": "1FTSW21P86E"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/15/2009",
        "dateOfIncident": "01/15/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10265460,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SHIMMY ISSUE ON MY 2006 FORD 250 PICK UP HAS NEVER BEEN RESOLVED. I SPENT APPROX 6 MONTHS WORKING WITH THE DEALERSHIP TO TRY TO RESOLVE THE ISSUE . THEY  EVENTUALLY TOLD ME THEY HAVE DONE EVERYTHING THAT FORD TOLD THEM TO DO . THIS VERY DANGEROUS PROBLEM STILL EXISTS. I RECEIVED A LETTER FROM FORD THAT THE PROBLEM WAS RELATED TO TIRE PRESSURE.              THAT IS ABSOLUTELY NONSENSE.   AFTER THE SECOND SET OF FRONT TIRES BEFORE 10000 MILES THEY STARTED TO CUP SEVERELY AFTER 1000 MILES. I TOOK IT BACK AND THEY PUT NEW TIRES ON ALL THE WAY AROUND. AND THEN I WAS TOLD THERE WAS NOTHING ELSE THAT COULD BE DONE. THE SHIMMY IS SO SEVERE AT TIMES IT WILL ACTUALLY SHIMMY ACROSS THE CENTER LINE. *TR",
        "vin": "1FTNF21506E"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/10/2009",
        "dateOfIncident": "12/18/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10264951,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2006 F-250 SUPER DUTY WITH ONLY 17,000 MILES, FROM THE DAY I PICKED IT UP NEW AT THE DEALER I NOTICE THAT EVERY TIME I HIT A RUT OR BUMP IN THE ROAD THERE WAS HUGE VIBRATIONS IN THE REAR END AND VERY NEAR LOSING CONTROL.  RECENTLY I WAS TRAVELING ON A MAJOR INTERSTATE AT APPROXIMATELY 80 MPH AND ALL OF A SUDDEN THE FRONT END FELT LIKE BOTH WHEELS WERE COMING OFF AND THE STEERING WHEEL WAS SHAKING SO VIOLENTLY I NEARLY LOST CONTROL.  I WAS BESIDE AN 18 WHEELER AND I THOUGHT THIS WOULD PROBABLY BE MY LAST DAY BUT SOMEHOW I GOT IT BACK UNDER CONTROL.  CAN'T TELL YOU HOW NERVOUS I WAS BUT YOU CAN IMAGINE.  I CALLED OUR LOCAL FORD DEALER TODAY AND HE SAID SOUNDS LIKE SOMETHING TERRIBLE IS WRONG, WE'LL SEE WHAT THE OUTCOME IS.  EVERYTHING I'VE READ ON THIS SAYS FORD DOESN'T THINK THEY HAVE A PROBLEM, FROM THE STORIES OUT THERE I DISAGREE. *TR",
        "vin": "1FTSW21Y56E"
    },
    {
        "components": "STEERING,SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/06/2009",
        "dateOfIncident": "02/10/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10264320,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING DOWN THE HIGHWAY, IF YOU HIT A POT HOLE OR ROUGH AREA ON THE PAVEMENT THE 2006 F250 WILL SHAKE VERY BAD AND YOU MUST SLAM ON THE BRAKES AND COME TO A FULL STOP TO GET CONTROL OF THE TRUCK. IT IS EVEN WORSE WHEN TOWING A TRAILER IN  CORNER. *TR",
        "vin": ""
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/02/2009",
        "dateOfIncident": "05/13/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10263931,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE BEGINS VIOLENTLY SHAKING WHEN A BUMP IS HIT IN THE ROAD, VEHICLE IS TEMPORARILY UNCONTROLLABLE UNTIL SPEED IS REDUCED.  FORD HAS TOLD ME I NEED TO PURCHASED A 400 DOLLAR DAMPENER, HOWEVER THIS NEVER HAPPEN FOR THE FIRST FEW YEARS OF VEHICLE OWNERSHIP SO I AM CONFUSED AS TO WHY I SUDDENLY NEED TO PURCHASE NEW EQUIPMENT TO MAKE THE VEHICLE OPERATE IN A SAFE MANNER. *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/27/2009",
        "dateOfIncident": "03/27/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10263289,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2006 FORD F250.  IT SHAKES VIOLENTLY WHEN I HIT A POTHOLE OR GO OVER A BRIDGE.  TRUCK ONLY HAS 60,000 MILES ON IT.  MY LIFE IS IN DANGER.  FORD NEEDS TO TAKE CARE OF THIS PROBLEM. *TR",
        "vin": "1FDWF37L62E"
    },
    {
        "components": "STEERING,SUSPENSION,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/25/2009",
        "dateOfIncident": "03/25/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10263064,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "FORD 250 SWB 4X4 2006, WHEN CROSSING BRIDGES, HITTING BUMPS IN THE ROAD OR HITTING POT HOLES, THE TRUCKS FRONT END WILL GO INTO A VIOLENT SHIMMY AND SHAKE EPISODE, THE ONLY WAY TO CORRECT IT IS TO SLOW DOWN - THIS CAN BE VERY DANGEROUS ON INTERSTATE OR HIGH SPEED ROADWAYS. FRONT END ALIGNMENTS, TIRE BALANCING, NEW TIRES AND STEERING STABILIZERS HAVE BEEN INSTALLED.NOTHING STOPS THIS FRONT OF FROM VIOLENTLY SHAKING. FORD DEALERSHIPS HAVE BEEN NO HELP. THIS IS A VERY DANGEROUS PROBLEM IN WHICH FORD PROBABLY NEEDS TO RE-ENGINEER THE FRONT END. PLEASE HELP PUT SOME PRESSURE ON FORD TO MAKE A RECALL ON THESE FRONT ENDS. *TR",
        "vin": "1FTSW21556E"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/26/2009",
        "dateOfIncident": "11/25/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10260034,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 FORD F250 HAD VIOLENT SHAKING IN FRONT END AFTER HITTING BUMP AT 70MPH. LASTED APPROX 30 SECONDS. VERY DANGEROUS, SCARED TO DRIVE. FORD MOTOR CO CLAIMS NO PROBLEM. KEEP TIRES INFLATED. *TR",
        "vin": "1FTSW21576E"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/27/2009",
        "dateOfIncident": "01/02/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10256478,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "SPEEDOMETER AND TACHOMETER WOULD NOT INDICATE THE CORRECT SPEED OR RPM. DRIVING ON THE HIGHWAY THE SPEEDOMETER WILL DROP TO LOWER SPEED OR WILL GET STUCK ON CERTAIN SPEED.  THE TACHOMETER WILL ALSO DROP TO ZERO WHILE YOU STILL HAVE POWER.   *TR",
        "vin": "1FTSX21526E"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/05/2008",
        "dateOfIncident": "05/12/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10250870,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "1. TRAVELING ON FREEWAYS, HIGHWAY, AND PUBLIC ROADS  2. SEVERAL TIMES A MONTH, VIOLENT SHAKING IN FRONT STEERING  3. OUR LOCAL DEALER REPLACED A STEERING STABILIZER STRUT ON THE FRONT AXLE OF THE AFFECTED VEHICLES. PROBLEMS STILL OCCURS I AM MECHANIC WITH ABOUT THIRTY YEARS EXPERIENCE AND I BELIEVE THE STEERING GEARS ON 2006-07 F-250 2X AND 4X IS DEFECTIVE. *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/01/2008",
        "dateOfIncident": "02/01/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10250343,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD F-250.  WHILE DRIVING 65 MPH, THE VEHICLE SHOOK VIOLENTLY AND FELT AS IF IT WOULD FLIP OVER.  IT TOOK A WHILE FOR THE CONTACT TO REGAIN CONTROL OF THE VEHICLE.  THE DEALER TEST DROVE THE VEHICLE, BUT WAS UNABLE TO DUPLICATE THE FAILURE.  A REPORT WAS FILED WITH THE MANUFACTURER AND THEY STATED THAT THE DEALER WOULD CALL THE CONTACT WITHIN FOUR DAYS.  THE FAILURE MILEAGE WAS 25,000 AND CURRENT MILEAGE WAS 30,000.  UPDATED 12/30/08  *BF  THE HORN WOULD RANDOMLY BLOW ON ITS OWN. UPDATED 01/05/09. *JB",
        "vin": "1FTSX21596E"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/25/2008",
        "dateOfIncident": "10/19/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10249791,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TEMPORARY LOSS OF POWER STEERING AT LOW SPEEDS AND TIGHT TURNS.  PROBLEM IS INTERMITTENT AND HAS CAUSED ME TO ALMOST RUN OFF THE ROAD WHILE PULLING MY BOAT OR MOTORCYCLE TRAILER.  FORD DEALER CHECKED POWER STEERING PUMP AND FOUND IT WAS PUMPING LESS FLUID THAN REQUIRED.  REPLACED PUMP.  PROBLEM STILL EXISTS. *TR",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/21/2008",
        "dateOfIncident": "08/23/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10246245,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "KELLY SPRINGFIELD TIRE CO",
                "productMake": "DELTA",
                "productModel": "DELTA",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "I PURCHASED THE TIRES (4) IN APRIL 2008 THROUGH A WHOLESALER FRIEND. I HAD THE TIRES INSTALL AND LIKED THEM.  ON AUGUST 23, 2008 I WAS ON MY WAY HOME AND ABOUT 6 OR 7 MILE FROM THE HOUSE I FELT A VIBRATION IN THE FRONT OF THE TRUCK (06 FORD F250).  IT GOT A LITTLE WORSE THAN THERE WAS A SCRAPING NOISE THAN BOOM AND THE TREAD FLIES OUT FROM THE RIGHT OF THE TRUCK.  I PULLED OFF ONTO THE SHOULDER AND GOT OUT AND COULD HARDLY BELIEVE WHAT I SAW.  LUCKILY NO ONE WAS TO MY RIGHT AS THE TRUCK SWERVED TO THE RIGHT.  THE TIRE WAS ALMOST GONE, THE RIM WAS DAMAGED THE RIGHT FENDER AND DOOR DAMAGED AND ALL THE PLASTIC PARTS WERE GONE.  THIS WAS ON A SATURDAY EVENING AND I PULLED THE TRUCK INTO A BUSINESS SO IT WAS THE TRUCK WAS OFF THE ROAD.  THE NEXT DAY WE FOUND SOME OF THE PLASTIC PIECES ABOUT 75 FEET FROM WHERE THE TIRE BLEW.  WE TOOK PICTURES AND HAD TO WAIT TILL MONDAY TO FIND OUT WHAT NEED TO HAPPEN.  MONDAY MORNING I CONTACTED THE WHOLESALER AND HE GAVE ME THE NUMBER TO COOPER TIRE.  I CALLED AND THEY TOOK DOWN INFORMATION AND SAID I WOULD RECEIVE A LETTER EXPLAINING WHAT I NEEDED TO DO TO FILE A CLAIM.  THAT AFTERNOON I WAS TRAVELING HOME WITH MY SON AND JUST BEFORE WE TURN ON OUR ROAD I START FEELING ANOTHER VIBRATION AND AS I SLOW TO TURN THE LEFT FRONT TIRE LETS GO AND LUCKILY THE EAST BOUND TRAFFIC NOTICED AND MOVED TO THE RIGHT BECAUSE THE TRUCK SWERVED TO THE LEFT.  IF THE TRACTOR TRAILER DRIVER DID NOT NOTICE SOMETHING WAS WRONG MY SON AND I WOULD HAVE GONE HEAD ON INTO THE TRACTOR TRAILER.  THIS TIME THERE WAS LITTLE DAMAGE TO THE TRUCK AND WE WERE BOTH ALIVE PRAISE THE LORD.  NOW I WAS ON THE PHONE A SECOND TIME TO COOPER TIRE AND TURNING IN A SECOND CLAIM.  THIS IS MONDAY AFTERNOON AUGUST 25, 2008.  WE GOT THE TRUCK OFF THE ROAD AND I REMOVED ALL THE REMAINING TIRES AND REPLACED THEM.  REMEMBER THESE TWO TIRES SEPARATED ABOUT 48 HOURS APART.  I JUST GOT A LETTER FROM COOPERS INSURANCE COMPANY AND THEY CLAIM I CAUSED THE TIRES TO SEPARATE SO THEY ARE NOT REPSONSIBLE.  *TR",
        "vin": "1FTSW21P26E"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "09/23/2008",
        "dateOfIncident": "09/22/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10243184,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD F-250.  WHILE DRIVING 63 MPH, THE VEHICLE STRUCK A SMALL DIP IN THE ROAD.  THE STEERING BEGAN TO SHAKE VIOLENTLY AND THE CONTACT LOST CONTROL.  THE VEHICLE WILL NOT BE REPAIRED BECAUSE THE CONTACT WANTS THE VEHICLE REPLACED.  THE MANUFACTURER STATED THAT THEY WERE AWARE OF THE FAILURE; HOWEVER, ADVISED HIM TO FOLLOW THE TSB INSTRUCTION TO REPAIR THE FAILURE.  THE FAILURE MILEAGE WAS 51,000 AND CURRENT MILEAGE WAS 65,000.",
        "vin": "1FTSX21536E"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/22/2008",
        "dateOfIncident": "05/15/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10239261,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "VIOLENT SHAKING IN FRONT SUSPENSION AND WHEELS AFTER HITTING ROUGH PAVEMENT AT APPROX 65 MPH. TRUCK ALWAYS HAS EXCESSIVE WHEEL HOP BUT EXTREME SHAKING HAS OCCURRED 5 TIMES IN 66K MILES. FORD TECHNICAL BULLETIN USELESS FOR RESOLVING PROBLEM. DEALER SUGGESTED CHECK TIRE INFLATION, TOW SETTINGS, AND STEERING COMPONENTS. NO RESULTS. THIS IS A DEATH TRAP. IT SHOOK TWO DRINKS OUT OF THE CUPHOLDER. LOST STEERING ABILITY, CROSSED LANES AND STOPPED SHAKING ONLY AFTER COMING TO A COMPLETE STOP.  *TR",
        "vin": "1FTSW21P66E"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/24/2008",
        "dateOfIncident": "06/18/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10235638,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2006 F-250 FORD TRUCK.  WHILE DRIVING ON THE INTERSTATE THE FRONT END OF THE TRUCK STARTED VIOLENTLY SHAKING.  I ALMOST LOST CONTROL AND COULD HAVE BEEN KILLED.  THIS HAPPENED YET AGAIN THE VERY SAME DAY.  I TOOK MY FORD TRUCK TO THE FORD DEALERSHIP IN BOONE AND WAS TOLD THERE WAS NOTHING WRONG WITH MY TRUCK.  THEY CLAIMED IT WAS PROBABLY DUE TO LOW AIR PRESSURE IN THE TIRES.  AFTER RESEARCHING THIS PROBLEM ON MY OWN I DISCOVERED THAT THIS IS QUITE A COMMON PROBLEM AND MANY MANY FORD TRUCK OWNERS ARE CURIOUS AS TO WHY NOTHING HAS BEEN DONE.  AFTER CLEARLY TELLING THE FORD DEALERSHIP THAT I WILL NOT ACCEPT MY TRUCK BACK UNTIL IT HAS BEEN FIXED, THEY REVEAL THAT THEY DO HAVE A SERVICE BULLETIN ABOUT THIS PROBLEM AND REVEAL TO ME THAT FORD TOLD THEM TO CHANGE THE AIR PRESSURE IN THESE TRUCKS.  THIS DOES NOT CORRECT THIS DANGEROUS AND POTENTIALLY LIFE THREATENING PROBLEM!  THESE TRUCKS NEED TO BE RECALLED AND HAVE THEIR STEERING DAMPNERS REPLACED!  AFTER FIVE DAYS OF ARGUING WITH THE FORD DEALERSHIP  I HAVE YET TO GET MY TRUCK BACK. I DEMANDED A LETTER STATING THAT MY FORD TRUCK WOULD BE SAFE AND THAT THEY WOULD BE LIABLE IN THE EVENT OF MY DEATH DUE TO THIS PROBLEM THAT NO ONE WILL TAKE CARE OF!  I HAVE YET TO RECEIVE THEIR ANSWER.  *TR",
        "vin": "1FTSX21586E"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/23/2008",
        "dateOfIncident": "06/18/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10232065,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR COMPANY HAS 2 FORD F250 4X4 TRUCKS (2006 & 2007)THE 2006 SHAKES UNCONTROLLABLY/VIOLENTLY WHEN HITTING BUMPS IN THE ROAD. THIS CONDITION HAS HAPPENED SINCE WE PURCHASED THE VEHICLE 7/05. THE VEHICLE HAS BEEN DRIVEN BY SEVERAL EMPLOYEES THAT HAVE EXPERIENCED THIS UNCONTROLLABLE SHAKE AND THEY HAVE ALL REPORTED THAT THE VEHICLE SHAKES SO BAD IN THE FRONT END THAT THEY REFUSE TO DRIVE IT AGAIN FOR FEAR OF THEIR LIFE OR SOMEONE ELSE'S. AFTER SEVERAL COMPLAINTS TO THE DEALER WE TOOK THE VEHICLE OUT OF SERVICE AND WARNED THE FORD DEALERSHIP IN WRITING. THE DEALER CHANGED THE TIRES AND SENT US OUT THE DOOR BUT THE TRUCK FEELS NO DIFFERENT AND THEY TOLD US AGAIN IT HAD BEEN REPAIRED. THE 2007 HAS BEEN OK UNTIL RECENTLY IT STARTED THE SAME SHAKE AND WE HAVE THE SAME FEELINGS ABOUT IT --SINCE WE HAVE BEEN THROUGH HECK WITH THE 2006.   SEARCHING ON THE INTERNET HAS BEEN AN EYE OPENING EXPERIENCE--THE SAME COMPLAINTS ARE POSTED FROM FL. ALL THE WAY TO CALIF. AND IT SEEMS FROM OUR READING THAT MOST OF THE COMPLAINTS ARE BEING AVOIDED OR SHOVED OFF AS TIRE SIZE OR TIRE PRESSURE.  *TR",
        "vin": "1FTSX21556E"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/10/2008",
        "dateOfIncident": "03/25/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10225049,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 FORD F-250 AMBULANCE AIRBAGS DID NOT DEPLOY. CONSUMER STATES THAT THE AMBULANCE WAS INVOLVED IN AN ACCIDENT AND THE AIRBAGS FAILED TO DEPLOY. HE STATES THAT THE AMBULANCE WAS GOING AROUND 50-55 MPH.  *KB  THE DRIVER OF THE AMBULANCE WAS INJURED, BUT NOT SERIOUSLY. THE DRIVER OF THE VEHICLE, THAT THE AMBULANCE HIT WAS KILLED. *JB",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/19/2008",
        "dateOfIncident": "01/31/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10218491,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "RECURRING OSCILLATION IN THE STEERING. IT HASN'T CURRENTLY LED TO ANY WRECKS OR COMPLETE LOSS OF CONTROL. WE ATTEMPTED TO FIX IT BY PUTTING ON HEAVIER DUTY STEERING DAMPERS. THIS PROBLEM NEEDS TO BE ADDRESSED. THERE ARE HUNDREDS OF COMPLAINTS. IF YOU WILL FOLLOW THIS LINK YOU WILL SEE SOME OF THE MANY OTHER OCCURRENCES OF THIS EXACT PROBLEM:     HTTP://WWW.TOPIX.NET/FORUM/AUTOS/FORD-F-250-SUPER-DUTY/T0SGDCTMOBHE5JER1  *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/19/2007",
        "dateOfIncident": "11/15/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10209295,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRUCK (FORD 2006 F250) WAS SHAKING VIOLENTLY TO THE POINT OF ALMOST LOSING COMPLETE CONTROL OF IT. SHAKING DID NOT STOP UNTIL THE VEHICLE CAME TO A COMPLETE STOP. THIS VEHICLE IS DANGEROUS AND YOU NEED TO TAKE ACTION IMMEDIATELY.  *TR",
        "vin": "1FTSX21Y16E"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/27/2007",
        "dateOfIncident": "03/15/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10207073,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I DRIVE A COMPANY 2006 FORD F250 4X4 THAT I HAVE HAD MULTIPLE STEERING PROBLEM INCIDENTS WITH. THE PROBLEM IS WHEN YOU HIT A POT-HOLE IN THE ROAD AT HIGHWAY SPEED. THE TRUCK GOES INTO A NEARLY COMPLETE OUT OF CONTROL SHIMMY. IF UNCHECKED THE TRUCK WOULD LITERALLY SHAKE ITS SHELF APART. IN ONE INCIDENT THE TRUCK VIBRATED INTO THE NEXT LANE. LUCK HAD IT THAT NO ONE WAS IN THAT LANE. TO STOP THE VIOLENT VIBRATION YOU HAVE TO DROP THE SPEED OF THE TRUCK BELOW 40MPH AND BECAUSE THE  FRONT END IS VIBRATING SO VIOLENTLY BRAKING IS VERY LIMITED DUE TO THE LIMITED TIRE CONTACT WITH THE PAVEMENT. MY COMPANY HAS A NUMBER OF THESE TRUCKS IN ITS FLEET AND HAS HAD SIMILAR COMPLAINTS REGARDING OTHER TRUCKS. IT HAS MADE THE COMPANY ISSUE A SITE WIDE BAN FROM DRIVING THESE TRUCKS ON THE HIGHWAY IN FEAR OF POSSIBLE INJURIES. AS THESE TRUCKS AGE AND PARTS BECOME WORN IT IS ONLY A MATTER OF TIME WHEN AN INCIDENT AS DESCRIBED ABOVE HAPPENS AND THE TRUCK WILL COME APART AND CAUSE A CRASH WITH INJURIES OR DEATHS.  *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/22/2007",
        "dateOfIncident": "10/21/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10206527,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD F-250.  WHILE DRIVING 60 MPH, THE CONTACT REAR ENDED ANOTHER VEHICLE.  THE ENTIRE FRONT END OF THE CONTACT'S VEHICLE WAS DESTROYED.  NONE OF THE AIR BAGS DEPLOYED.  TWO PASSENGERS WERE INJURED IN THE CRASH.  SHE NOTIFIED THE MANUFACTURER, BUT THEY DID NOT PROVIDE ANY ASSISTANCE.  THE CURRENT AND FAILURE MILEAGES WERE 60,000.",
        "vin": "1FTSW21P46E"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/19/2007",
        "dateOfIncident": "10/02/2007",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10206364,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD F-250.  WHILE DRIVING APPROXIMATELY 55 MPH, THE CONTACT NOTICED THAT ALL OF THE INSTRUMENT PANEL LIGHTS ILLUMINATED AND THEN DIMMED.  SECONDS LATER, SMOKE APPEARED.  SHE PULLED THE VEHICLE OFF THE ROAD AND IT CAUGHT FIRE.  THE VEHICLE WAS COMPLETELY DESTROYED.  A FIRE REPORT WAS FILED.  SHE NOTIFIED THE DEALER AND MANUFACTURER, BUT THEY WOULD NOT PROVIDE ANY ASSISTANCE BECAUSE HER VEHICLE WAS NOT INCLUDED IN THE VEHICLE SPEED CONTROL:CRUISE CONTROL RECALL.  THE RECALL NUMBER WAS UNAVAILABLE.  THE CURRENT AND FAILURE MILEAGES WERE 26,000.",
        "vin": "1FTSW20556E"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/01/2007",
        "dateOfIncident": "09/30/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10204604,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON INTERSTATE AT 75 MPH WHEN I HIT A SMALL BUMP IN THE ROAD WHEN MY TRUCK WENT VIOLENTLY OUT OF CONTROL UNTIL I BROUGHT IT TO A COMPLETE STOP ALMOST CAUSING A FATAL ACCIDENT.  *JB",
        "vin": "1FTSW21516E"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/09/2007",
        "dateOfIncident": "09/09/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10202327,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A FORD F250 FROM A DEALERSHIP, I BELIEVE AFTER DOING MY RESEARCH THAT THIS MODEL HAS A DEFECT IN IT AND IS TO DANGEROUS TO DRIVE.  IF I DRIVE OVER 45 MPH AND I HIT A POTHOLE OR A BUMP IT VIOLENTLY SHAKES TO THE POINT WHERE WE FEEL WE ARE GOING TO TIP OVER.  WE HAVE TO COME TO A COMPLETE STOP FOR IT TO STOP SHAKING AND WHEN YOU ARE ON A FREEWAY THAT IS VERY DANGEROUS.  FORD DOES NOT SEEM TO CARE ABOUT THIS ISSUE AND HAS NOT BEEN ABLE TO FIX IT.  I SPENT A LOT OF MONEY ON THIS VEHICLE AND AM AFRAID TO PUT MY 3 CHILDREN IN THE CAR.  DO I HAVE TO WAIT FOR SOMEONE TO DIE FOR FORD TO HANDLE IT.   I HAVE FOUND 1000'S OF PEOPLE WITH THE SAME PROBLEM AND WANT TO KNOW IF THERE IS ANYTHING YOU CAN DO TO HELP US FIX THIS.  *JB",
        "vin": "1FTSW21P96E"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/05/2007",
        "dateOfIncident": "03/10/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10198533,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY F250 SUPERDUTY TRUCK AT LESS THAN 6,000 MILES STARTED SLIPPING GEARS BETWEEN 1 AND 2 WHEN TRYING TO GET INTO ONCOMING TRAFFIC TRUCK WOULD STALL. RETURN TO DEALER  THEY REBUILT TRANSMISSION DIDN'T FIX PROBLEM! RETURNED 4 MORE TIMES STILL SAME PROBLEM. HAVING TO FILE A LEMON LAWSUIT!  *TR",
        "vin": "1FTSX21P86E"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/03/2007",
        "dateOfIncident": "06/30/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10198445,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MINOR BUMP OR DIP IN THE ROAD AT NORMAL HIGHWAY SPEED LEADING TO VIOLENT VERTICAL BOUNCE WHICH CAUSES COMPLETE LOSS OF CONTROL OF VEHICLE. *JB",
        "vin": "1FTSW21566E"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/17/2007",
        "dateOfIncident": "07/16/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10196580,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AT AROUND 8000 MILES NOTICE WEAR OF ENDS OF MY FRONT TIRES TOOK IT TO MY FORD DEALER  AND FINDOUT TRUCK WAS OUT OF ALIGMENT THEY RECOMEND TO HAVE TIRE ROTATION WICH I DID AS ASOON I GOT HOME THEN AT 12000 MILES NOTICE IT START TO WEAR MY FRONT TIRES AGAIN AND ALSO  CHUNKS OF RUBBER COMING OFF  THE TREADS  TOOK TRUCK BACK TO FORD DEALER AGAIN  THEY SAID NOTHING WRONG WITH TRUCK  NOW NEED HELP HOW TO SOLVE THIS PROBLEM",
        "vin": "1FTSW21P96E"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/11/2007",
        "dateOfIncident": "07/08/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10196039,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 F-250 SUPER DUTY FRONT END BOUNCES DANGEROUSLY OUT OF CONTROL.     *AK",
        "vin": "1FTSW21516E"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/08/2007",
        "dateOfIncident": "07/05/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10195560,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS COMING BACK HOME FROM VACTION IN LAS VAGAS AROUND JUST PASS STATE LINE,WHEN MY FORD F-250 HD 2006 WENT INTO 4X4 LOW ALL BY IT SELF.MY SPEED WAS AROUND 75 MILES PER HOUR WHEN THE TRUCK WENT INTO 4X4 LOW BY IT SELF.IF THIER WHOULD HAVE BEEN A CARS BEHIND ME THIS WOULD BEEN A MAJOR CRASH.MY SPEED WENT FROM  75 MPH TO 20 MPH IN ABOUT 10 -20 SECONDS,I HEARD SOMETHING LOUD FROM MY TRANSMISSION AND OR ENGINE.MY TRUCK IS AT THE DEALERSHIP,I GOT A CALL ABOUT MY TRUCK FROM THE DEALERSHIP THE SAID THE TRANSFER CASE WAS BAD ON THE 4X4 CONTROL AND THEY WERE GOING TO LOOK AT THE TRANSMISSION.*AK",
        "vin": "1FTSW21P16E"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/13/2007",
        "dateOfIncident": "05/31/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10193127,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD F-250.  WHEN HE ATTEMPTED TO USE THE AUTOMATIC LOCK FOR THE VEHICLE, THE DRIVER SIDE DOOR LOCK REMAINED IN THE UP (OPEN) POSITION.  THE CONTACT NOTICED THAT THE CYLINDER INSIDE THE DOOR WAS DISLOCATED.  THE DEALER STATED THAT IT APPEARED AS IF SOMEONE TRIED TO BREAK INTO THE VEHICLE.  NO ONE HAS ATTEMPTED TO OR HAS BROKEN INTO THE VEHICLE AT HIS HOME OR OFFICE.  THE COST TO REPAIR THE VEHICLE WAS $500.  THE VEHICLE IS CURRENTLY BEING REPAIRED.  THE CURRENT MILEAGE WAS 13348 AND THE FAILURE MILEAGE WAS 13148.",
        "vin": "1FTSX21P06E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/09/2007",
        "dateOfIncident": "05/05/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10190290,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "NO PSI FOR TURBO,  AND TURBO BLEW  OUT.  *AK",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/03/2007",
        "dateOfIncident": "12/15/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10186834,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD F250 SUPERCREW.  THE CONTACT STATED THAT THE 4X4 HIGH DID  NOT ENGAGE, THE ENTIRE FRONT END VIBRATED VIOLENTLY, AND THE 4X4 LOW WAS  DIFFICULT TO DISENGAGE.  THE VEHICLE WAS TAKEN TO A DEALER FIVE TIMES, AND THE FAILURE HAD NOT BEEN DIAGNOSED.  THE VEHICLE HAD NOT BEEN REPAIRED.  THE CURRENT MILEAGE IS 4,200 AND FAILURE MILEAGE WAS 1,000.*AK",
        "vin": "1FTPW14516K"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/06/2007",
        "dateOfIncident": "05/01/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10184300,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F 250.  THE TRANSMISSION WAS SLIPPING.  ALSO, THE ENGINE AND THE 3RD CYLINDER  FAILED.  THE FAILURE MILEAGE WAS 28,000.  THE CONTACT STATED THAT DUE TO THE YEAR OF THIS VEHICLE THE ENGINE AND TRANSMISSION SHOULD BE OPERATING NORMALLY.    THE VEHICLE  WAS  REPAIRED.   THE CURRENT MILEAGE WAS 34,000. *AK",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/25/2007",
        "dateOfIncident": "12/06/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10183420,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "FORD 250 BOUNCES DANGEROUSLY WHEN HITTING POTHOLES. *JB",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/26/2006",
        "dateOfIncident": "07/18/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10163471,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD A FLAT TIRE ON MY 2004 FORD F250. I TOOK THE LUG BOLTS OFF BUT THE TIRE WOULD NOT COME OFF OF THE AXLE. I CALLED THE DEALER AND THEY TOLD ME TO GET UNDER THE TRUCK AND HIT THE TIRE WITH A SLEDGEHAMMER. THIS HAS TO BE VERY DANGEROUS, PARTICULARLY SINCE THE TRUCK WAS RAISED UP ON A JACK.  ACCORDING TO THE FORD DEALER THIS IS A VERY COMMON PROBLEM WITH FORD TRUCKS.  I BELIEVE THAT THIS IS A VERY HAZARDOUS SITUATION AND SHOULD BE CORRECTED.  *JB",
        "vin": ""
    },
    {
        "components": "VISIBILITY,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/25/2006",
        "dateOfIncident": "07/25/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10163404,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THAT LIGHT REFLECTS ONTO THE DASHBOARD, RESULTING IN VISIBILITY ISSUE WITH THE SPEEDOMETER.  THE DEALERSHIP HAS BEEN ALERTED.   UPDATED 8/16/2006 - THE PROBLEM IS NOT PRIMARILY A GLARE PROBLEM.  THE GAUGES ARE RECESSED WHICH MAY ALSO BE A CAUSE OF THE VISIBILITY ISSUE.  *NM",
        "vin": "1FTSX21576E"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/21/2006",
        "dateOfIncident": "07/19/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10163052,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE DRIVING AT VARIOUS SPEEDS THE GAUGES MALFUNCTIONED AND THE VEHICLE STALLED.  THE VEHICLE WAS TOWED TO THE DEALER. IN AN ATTEMPT TO CORRECT THE PROBLEM THE BATTERY WAS REPLACED WITH NO SUCCESS, THE INSTRUMENT PANEL CLUSTER WAS REPLACED WHICH CORRECTED THE PROBLEM.",
        "vin": "1FTSX21P96E"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/13/2006",
        "dateOfIncident": "04/13/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10155324,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE DRIVING 45 MPH THERE IS A VIBRATION IN THE VEHICLE.  THE STEERING WHEEL DOES NOT VIBRATE HOWEVER THE TRUCKS FRAME AND BODY DOES.  THE VEHICLE WAS TAKEN TO THE DEALER FOR REPAIRS ON 4 OCCASIONS.  ON THE FIRST OCCASION THE LEFT FRONT TIRE WAS REPLACED AND ALL TIRES WERE BALANCED.  THE SECOND TIME THE DRIVE SHAFT WAS REPLACED.  ON THE THIRD VISIT ALL FOUR TIRES WERE REPLACED.  ON THE FOURTH OCCASION ANOTHER DRIVE SHAFT AND PINION GEAR WAS REPLACED.  THE VEHICLE STILL HAS THE SAME PROBLEM AFTER ALL OF THE REPAIR ATTEMPTS.  THE CONTACT BELIEVES THE PROBLEM IS WITH THE AUTOMATIC TRANSMISSION TORQUE CONVERTER.  THE MANUFACTURER HAS BEEN ALERTED.",
        "vin": "1FTSX20P36E"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/13/2006",
        "dateOfIncident": "03/13/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10152552,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WITHOUT WARNING, WHILE DRIVING AT ANY SPEED, THE ENGINE WOULD CUT OUT AND STALL WHILE THE ACCELERATOR PEDAL WAS BEING RELEASED.  THE VEHICLE RESTARTED AFTER 15 MINUTES.  THE DEALERSHIP DETERMINED THE INJECTORS WENT OUT, CAUSING DIESEL TO GET INTO THE OIL.  THE INJECTORS WERE REPLACED AND THE OIL CHANGED.  SINCE THE REPAIRS, THE TRANSMISSION SLIPS WHILE PULLING A HORSE TRAILER OVER A MOUNTAIN.  THE VEHICLE HAS NOT BEEN RETURNED TO THE DEALERSHIP.",
        "vin": "1FTSX21P96E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": true,
        "dateComplaintFiled": "02/06/2006",
        "dateOfIncident": "12/29/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10149583,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "F 250 2006 HD 4X4   LESS THAN 2000 MILES - DRIVING VEHICLE, WHILE TURNING AND GOING DOWN A HILL, STALLED OUT COMPLETELY:DASH BOARD LIGHTS ALL CAME ON. NO BRAKES OR STEERING. WENT OFF THE ROAD, INTO FRONT YARD OF HOME WHICH WAS FOR SALE, HIT FOR SALE SIGN, NICKED A TREE IN FRONT YARD AND INTO HANDICAP VAN IN DRIVEWAY, PUSHED VAN INTO NEIGHBORS YARD. HEAVY FRONT END DAMAGE SUSTAINED AND SIGHTED BY POLICE FOR \"FAILURE TO CONTROL VEHICLE\"!!! PURCHASING DEALER COULD FIND NO ISSUES. FIRST TIME THIS OCCURRED WAS 3 WEEKS AFTER NOV. 2005 PURCHASE.  VEHICLE HAS BEEN REPAIRED, BUT DID IT AGAIN ON 2-3-2006. DEALER HAS BEEN NOTIFIED OF THIS AGAIN. STILL NO SOLUTION.  OVER $10,000.00 DAMAGE TO BRAND NEW VEHICLE. FREE LOANER VEHICLE PROMISED WHEN PURCHASED \"DOESNT APPLY TO BODY SHOP\" OUT OF WORK WITH NO VEHICLE FOR 2.5 WEEKS. *JB",
        "vin": "1FTNF21596E"
    },
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/24/2006",
        "dateOfIncident": "12/31/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10148489,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THE VEHICLE'S SPEEDOMETER STICKS AT 80 MPH.  THE VEHICLE WAS TAKEN TO THE DEALERSHIP WHERE THE SPEEDOMETER WAS REPAIRED.  WHILE ON THE WAY HOME IT FAILED AGAIN.  THE VEHICLE WAS TAKEN BACK TO THE DEALERSHIP.  THE DEALERSHIP DETERMINED THEY COULD NOT DUPLICATE THE PROBLEM.  THE AIR BAG LIGHT WAS INOPERATIVE. UPDATED 03/28/06",
        "vin": "1FTSX21506E"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "01/09/2006",
        "dateOfIncident": "12/28/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10147273,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE F-250 ON A RURAL EXPRESSWAY AT APPROXIMATELY 75 MPH THE DRIVERS SIDE WINDOW IMPLODED INTO THE VEHICLE WITH NO APPARENT PRIOR IMPACT TO THE GLASS. THE OUTSIDE TEMPERATURE AT THE TIME WAS AROUND 17 DEGREES F AND THE INTERIOR OF THE VEHICLE WAS APPROXIMATELY 73 DEGREES F.  DRIVER WAS HIT WITH SHATTERED GLASS BUT NO MAJOR CUTS OCCURRED.  THE WINDOW WAS NOT COVERED BY WARRANTY AND THE OWNER HAD TO PAY FOR REPLACEMENT.  *JB",
        "vin": ""
    }
]