[
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/16/2022",
        "dateOfIncident": "02/01/2022",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11452299,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "8 years ago was crossing RR tracks and vehicle started violently shaking had to slow to 10mph for it to stop. Checked found nothing wrong finished drive home. Took to Ford dealership and they said some tricks shake when tire pressure is wrong and didn't find anything wrong with vehicle. Truck did this once more and after that when I approach RR tracks I slow to 5- 10 mph to keep it from happening. Took it back to Ford 1 time and again they spoke about tire pressure but tire pressure was fine. In the last 2 weeks anytime I hit a bump the truck violently shakes I took to a mechanic shop and they said something was wrong with front end but not sure what. I called Ford and they said to bring it in. We will see what happens because this truck has done this off and on for the last 8 years, but now it does it all the time. It has been shaking so violently I wouldn't be surprised if other damages have happened from it.",
        "vin": "1ftww33p46e"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/05/2021",
        "dateOfIncident": "10/02/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435542,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "At highway speeds hitting a bump or small pothole the steering wheel vibrates to the point of almost losing control. If I didn't have two hands on the wheel I possibly could have lost control of my vehicle and crashed",
        "vin": "1FTWW33P46E"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/02/2021",
        "dateOfIncident": "03/09/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419405,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "My truck experiences what I have learned is called the death wobble. The condition occurs intermittently but usually at speeds above 50mph and seems to be initiated by hitting any small bump. The whole front end shakes violently like the tires have been half filled with lead causing them to rotate wildly out of round. The truck actually bounces up and down rapidly and the steering wheel shakes violently creating a very unsafe driving circumstance. My research into this issue uncovered that this is a well-known condition that has been reported multiple times by many different Ford truck owners and that it occurs on Ford trucks of various year make and model. I also am aware of Fords service letter 09L02 advising owners to maintain proper air pressure to combat the issue. It is my opinion that Fords efforts to address this issue are woefully inadequate and the NHTSA has allowed this manufacturer to produce and provide an unsafe vehicle to the public for way to long. This is a hazardous condition that needs to be properly addressed.",
        "vin": "1FTWW31PX6E"
    },
    {
        "components": "STEERING,SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/26/2021",
        "dateOfIncident": "10/01/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404937,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING EAST ON  INTERSTATE I10 EAST OF BENSON, AZ AT AROUND 75MPH, HIT A ROUGH PATCH OF ROAD AND THE VEHICLE WENT WILD, SHAKING, VIBRATING, LOSS OF CONTROL. I HIT THE BRAKES AND WENT ACROSS 3 LANES OF TRAFFIC INTO THE MEDIUM, WHERE I SKIDDED TO A STOP. I SEE FROM THE INTERNET THIS IS CALLED THE F350 DEATH WOBBLE! THE FORD F350 AND ALL RELATED VEHICLES NEED TO BE TAKEN OFF THE ROADS, THEY ARE A POTENTIAL DEATH TRAP. I COULD HAVE BEEN KILLED OR SERIOUSLY INJURED IN THIS ACCIDENT OR EVEN WORSE SOME INNOCENT FAMILY COULD HAVE BEEN KILLED IN A HEAD ON ACCIDENT! MY FORD F350 VEHICLE HAS AROUND 60,000 MILES, SUPERDUTY, 4X4. IT IS IN EXCELLENT CONDITION WITH A CAB OVER CAMPER.",
        "vin": "1FTWW31536E"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/11/2021",
        "dateOfIncident": "02/27/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11402525,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUCK VIBRATES UNCONTROLLABLY AFTER HITTING BUMPS OR UNEVEN PAVEMENT AT HIGHWAY SPEEDS I REPLACE THE BRAKES THREE TIMES AND THAT DIDN'T FIX IT THIS HAS BEEN GOING ON SINCE IT HIT ABOUT 60K MILES. IT NOW HAS 108K I CAN NOT TRUST THIS TRUCK ANYMORE.",
        "vin": "1FTWW33P16E"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/09/2021",
        "dateOfIncident": "02/28/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399954,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 2/28/21 AND 3/6/21 WHILE DRIVING AT HIGHWAY SPEED,  I EXPERIENCED TWO SEPARATE VIOLENT SHAKING EVENTS OF THE FRONT SUSPENSION AND STEERING. BOTH EVENTS OCCURED AT APPROXIMATELY 70MPH UPON CROSSING PAVEMENT JOINTS. THE SHAKING IS SO VIOLENT YOU LOSE THE ABILITY TO CONTROL THE VEHICLE AND JUST HOPE IT DOESN'T CAUSE A WRECK. THE SHAKING WILL NOT STOP UNTIL SPEED IS REDUCED TO APPROXIMATELY 20MPH, WHICH IN ITSELF IS DANGEROUS ON AN INTERSTATE HIGHWAY.  A PASSENGER IN MY TRUCK DURING FIRST INCIDENT SAID HE THOUGHT I HAD HIT A LOAD OF PIPES IN THE ROAD. DURING THE SECOND EVENT, NEARBY MOTORISTS LOOKED AT ME LIKE MY TRUCK WAS FALLING APART.     I AM VERY UPSET THAT FORD AND NHTSA HAVE NOT ISSUED A RECALL. THIS PROBLEM STARTED WHEN VEHICLE WAS BRAND NEW. FIRST DEALER TOLD ME THERE WAS NOTHING THEY COULD DO. A SECOND DEALER TIGHTENED VARIOUS FASTENERS ON FRONT SUSPENSION AND MADE STEERING BOX VERY TIGHT. I WAS ALSO GIVEN NEW ALIGNMENT SPECS (WHICH I GAVE TO TIRE INSTALLER), AND ADVISED INFLATING TIRES TO MUCH HIGHER PRESSURE THAN TRUCK WAS DELIVERED NEW WITH. IT IS UNWORKABLE BECAUSE IT RESULTS IN BRUTAL RIDE IF TRUCK IS OPERATED WITHOUT PAYLOAD.    I BELIEVE THESE EVENTS ARE CAUSED BY UNDAMPED RESONANCE IN THE FRONT SUSPENSION.  IT FEELS LIKE THE WHEELS ARE ALTERNATELY POUNDING UP AND DOWN, LEFT AND RIGHT SIDE. THE STEERING WHEEL OSCILLATES SO HARD YOU CAN'T HOLD ON.",
        "vin": "1FTWW33P46E"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/28/2020",
        "dateOfIncident": "09/27/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361469,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS RIDING DOWN HWY55 AT ABOUT 65 TO 70 MPH AND TRUCK STARTS TO WOBBLE AND BOUNCE UNCONTROLLABLY. THE TRUCK BOUNCED TO THE OTHER SIDE OF THE ROAD. I THOUGHT I HAD A FLAT. AFTER GATHERING MYSELF I GOT OUT TO CHECK TRUCK AND THERE WAS NO FLATS AND ALL LUGS WAS THERE. I THOUGHT MAYBE I RAN OVER SOMETHING BUT ABOUT 12 MILES DOWN THE TRUCKS DOES IT AGAIN. BUT THERE ARE MANY CARS BEHIND AND ON THE SIDE OF ME. CARS AND TRUCKS ARE GOING DOWN THE OF ROAD TO GET OUT OF WAY. THIS IS SO A VERY FRIGHTEN AND HORRIBLE EXPERIENCE WHEN YOU ARE NOT PREPARED OR AWARE OF ABOUT THIS TRUCK. FORD TO BE ON OF THE TOP TRUCK MANUFACTURE IT GREATLY SADDEN ME TO KNOW THAT YOU ARE VISUALLY AWARE OF THE TRUCKS DEATHLY DEFECT FOR OVER 15 YEARS. YOU HAVE NOT MADE AN EFFORT TO PROVIDE A SAFE  DURABLE PRODUCT TO PROTECT YOUR ROYAL CUSTOMERS OR YOURSELVES. TECHNOLOGY HAS AFFORDED MANY SEEN  APPLICATION TO DO SO. YET YOU HAVE IGNORE WHAT IS YOUR COMPANY FUTURE.",
        "vin": "1FTWW31546E"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/20/2020",
        "dateOfIncident": "01/20/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300513,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DEATH WOBBLE, THE  TRUCK SHAKES VIOLENTLY WHEN I DRIVE ON THE FREEWAY SINCE DAY ONE WHEN I BOUGHT IT . THE DEALER WON'T FIX IT THAT , THERE'S NOTHING WRONG WITH IT .AND THE DEALER SAYS TO REMOVE AIR FROM THE TIRES AND IT SHOULD STOP THE SHAKING .",
        "vin": "1FTWW31P96E"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/25/2019",
        "dateOfIncident": "09/23/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11258188,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUCK HAS A STEERING PROBLEM.MOST OF THE TIME TRUCK TRAVELS STRAIT.SOME TIMES AFTER MAKING A TURN RIGHT OR LEFT THE TRUCK CONTINUES TRAVEL IN THAT DIRECTION! I HAVE TO YANG HARD ON THE STEERING WHEEL BACK IN OPPOSITE DIRRECTION TO GET TRUCK BACK IN ITS LANE!ALSO SOMETIMES THE TRUCK OUT OF THE CLEAR BLUE TRUCK TAKE OFF TO THE RIGHT OR LEFT AN I HAVE T PULL THE WHEEL IN OPPOSITE DIRECTION TO GET TRUCK BACK IN IT'S LANE!OTHER TIMES GOING THAN THE ROAD THE TRUCK HITS A BUMP IN THE ROAD AN TRUCK WILL EITHER GO RIGHT OR LEFT AN STEERING WHEEL HAS TO BE PULL THE OPPOSITE DIRECTION TO GET IT BACK IN IT'S LANE! I NOTICE THIS SAME PROBLEM HAS BEEN REPORTED BEFORE AN NO ONE HAS BEEN ABLE TO FIX IT! MECHANICS SAY IT'S THE STEERING PUMP OR STEERING BOX WHICH HAS NOT CORRECTED ANY BODY'S TRUCK THAT THAT HAS BOTH THESE PARTS REPLACE! THIS CAN CAUSE A MAJOR ACCIDENT FORD SHOULD FIX THIS PROBLEM",
        "vin": "1FTWW31516E"
    },
    {
        "components": "STEERING,SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/05/2019",
        "dateOfIncident": "08/05/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11241718,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON INTERSTATE AT APPROX 60 MPH, HIT PATCH IN ROAD, LOST CONTROL OF VEHICLE, DEATH WOBBLE, ALMOST CAUSED CRASH WITH 6 OTHER VEHICLES. WENT STRAIGHT TO DEALERSHIP TOLD IT WAS STEERING SHIMMY SHOCK FAILURE. ALIGNMENT. PAY FOR OUT OF POCKET, ALTHOUGH HAD SAME TRUCK IN SHOP FOR FRONT END REPAIRS IN JANUARY 2019.",
        "vin": "1FTWW33P66E"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/24/2019",
        "dateOfIncident": "04/19/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11203415,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT SUSPENSION WOBBLES VERY BAD WHEN GOING 40-60 MILES OVER A SMALL UNEVEN PAVEMENT. JUST REPLACED THE TIRES AND GOT AN ALIGNMENT. STILL HAVING THE SAME PROBLEM, I'M NOT ABLE TO DRIVE MY TRUCK CAUSE IT WOBBLES SO BAD THAT I HAVE TO COMPLETELY STOP FOR THE WOBBLING TO STOP. I PURCHASED MY TRUCK NEW AND NOW HAS 92K AND HAD NEVER BEEN IN AN ACCIDENT OR AFTER MARKET TIRES OR PARTS. I HAVE ALWAYS KEPT IT WITH GENUINE PARTS DON'T KNOW THE PROBLEM AND NEED HELP.",
        "vin": "1FTWW33P56E"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/14/2018",
        "dateOfIncident": "11/14/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11151586,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I SLOWED TO LET A VEHICLE PASS ON A NARROW STREET. WHEN I PRESSED THE ACCELERATOR TO GET MY 2006 FORD F350 WITH THE 6.0L POWERSTROKE DIESEL ENGINE BACK UP TO 25 MILES PER HOUR, THE GAS PEDAL PULLED ITSELF TO THE FLOOR AT ABOUT 15 MILES PER HOUR AND WOULD NOT COME OFF THE FLOOR. I HAD TO STAND ON THE BRAKES AND PUT THE TRUCK IN NEUTRAL, THEN USE MY FOOT TO GET UNDER THE GAS PEDAL AND RETURN IT TO IT'S NORMAL OPERATING POSITION. AFTER, I DROVE TO MY MECHANIC AND HE SAID THE ELECTRICAL SENSOR IN THE GAS PEDAL WAS PROBABLY BAD AND THE ENTIRE ASSEMBLY NEEDED REPLACED. THIS INCIDENT ALMOST CAUSE ME TO REAR END A PERSON AT THE STOP SIGN IN FRONT OF ME AND PEDESTRIANS CROSSING THE ROAD IN THE CROSSWALK.",
        "vin": "1FTWW31P96E"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/24/2018",
        "dateOfIncident": "04/05/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11089841,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "CRACKED POLISHED FORGED ALUM 20\" WHEEL. ORIGINAL FORD EQUIPMENT. DID NOT HIT POT HOLE. DID NOT HIT ANYTHING! WHEEL IS CRACKED/SPLIT OPEN SPOKE TO SPOKE PARALLEL WITH TIRE BEAD. TIRE IS FINE. WHEEL IS OBVIOUSLY UNSAFE!",
        "vin": "1FTWW31P46E"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "01/03/2018",
        "dateOfIncident": "08/11/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11058183,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "CONTITRAC TR",
                "productYear": "9999",
                "size": "LT275/70R18",
                "type": "Tire"
            }
        ],
        "summary": "HAD A CONTINENTAL CONTITRAC 275/70R18 BLOW OUT ON THE HIGHWAY WHILE TOWING. IT WAS A REAR DRIVE TIRE ON A 2006 F350 DIESEL. THE TIRE BLEW RIGHT APART, TREAD SEPARATED FROM THE TIRE, CAUSING ENTIRE LEFT SIDE BED DAMAGE, RESULTING IN OVER $3,000 OF DAMAGE TO THE TRUCK",
        "vin": "1FTWX31P86E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/22/2017",
        "dateOfIncident": "09/09/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11048083,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE DIES WHILE DRIVING. DOES NOT DO IT ALL THE TIME. MAINLY WHEN ACCELERATING AND IF LET OFF GAS AND APPLY BRAKES.",
        "vin": "1FTWW31P96E"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/09/2017",
        "dateOfIncident": "10/10/2017",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11044809,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "CORRUPTED V.I.N CALIBRATION IN PCM CAUSING A.B.S MODULE TO LOCK FRONT BRAKES AND NOT FULLY RELEASE. 2 FRONT ABS SENSORS READ 14% DIFFERENT SPEED FROM REAR CAUSING ABS TO SENSE AN ISSUE WHEN THERE IS NOT AN ACTUAL MECHANICAL ISSUE. WHEN A.B.S TRIES TO SLOW FRONT WHEELS IT DOES NOT FULLY RELEASE FRONT WHEELS CAUSING BRAKES TO OVERHEAT TO THE POINT OF CAUSING BRAKE FIRE. I HAVE WORKED WITH FORD DEALERSHIP TRYING TO RESOLVE THIS ISSUE BUT THEY CANNOT COME UP WITH A SOLUTION.",
        "vin": "1FTWW31P06E"
    },
    {
        "components": "STEERING,SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "05/24/2017",
        "dateOfIncident": "05/21/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10991433,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TOWING MY LARGE CAMPER, ON THE FREEWAY, I HIT A BUMP.  THE FRONT END OF THE TRUCK STARTED SHAKING VIOLENTLY.  IT WAS ALL I COULD DO TO STOP THE TRUCK WITHOUT WRECKING.  I HAD TO STOP IN THE TRAFFIC LANE.  THIS WAS AN EXTREMELY DANGEROUS SITUATION.  AFTER RESUMING TRAVEL, THE FRONT END WOULD SHIMMY AT ABOUT 45 MPH.  I HAD TO DRIVE HOME AT 40 MPH...ROUGHLY ANOTHER 75 MILES.  I THINK I HAVE SEEN AN ADVISORY LETTER FROM FORD, TO OWNERS, CONCERNING THIS.  THERE ARE MANY, MANY INSTANCES OF THIS HAPPENING.  ONE CAN FIND DOZENS OF EXAMPLES OF THIS HAPPENING IF ONE LOOKS ON LINE.  NEITHER FORD NOR THE LOCAL FORD DEALER SEEMS TO BE AWARE OF THE PROBLEM.  WE WERE TRAVELING AT ABOUT 60 MPH AT THE TIME OF THE INCIDENT.",
        "vin": "1FDWX37Y66E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/17/2017",
        "dateOfIncident": "12/19/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10966475,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-350. WHILE THE VEHICLE WAS PARKED, THE CONTACT NOTICED LIQUID UNDER THE VEHICLE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THERE WAS A DAMAGED HEAD GASKET THAT NEEDED REPLACEMENT. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "1FTWW31P66E"
    },
    {
        "components": "AIR BAGS,SEATS",
        "crash": true,
        "dateComplaintFiled": "02/06/2017",
        "dateOfIncident": "01/07/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 10949883,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-350. WHILE DRIVING 35 MPH ON THE INTERSTATE, THE DRIVER LOST CONTROL DUE TO BLACK ICE. THE CONTACT DROVE INTO A DITCH. THE AIR BAGS DID NOT DEPLOY. THE VEHICLE WAS TOWED OUT OF THE DITCH. THE CONTACT STRUCK THE CENTER CONSOLE AND SUSTAINED A CONCUSSION, AND SEVERE PAIN TO THE HEAD, NECK, AND SHOULDERS. THE DRIVER SUSTAINED A CONCUSSION AND ANOTHER PASSENGER SUSTAINED UNDISCLOSED INJURIES. MEDICAL ATTENTION WAS REQUIRED. A POLICE REPORT WAS FILED. THE VEHICLE WAS NOT DESTROYED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE MANUFACTURER INFORMED THE CONTACT THAT THE VEHICLE'S SEAT WAS CONSIDERED A FIFTH SEAT FOR ANY INDIVIDUAL. THE FAILURE MILEAGE AND VIN WERE UNKNOWN.",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/13/2016",
        "dateOfIncident": "06/05/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10873902,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-350. WHILE DRIVING 65 MPH OVER BUMPS IN THE ROAD, THE VEHICLE SHOOK VIOLENTLY. THE DEALER DIAGNOSED THAT THE FRONT AXLE FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED BECAUSE THE REMEDY WAS NOT AVAILABLE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "1FTWW33P26E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/31/2016",
        "dateOfIncident": "03/06/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10871626,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-350. WHILE DRIVING APPROXIMATELY 60 MPH, THE EXHAUST PIPE SMOKED AND/OR STEAMED AND THE ENGINE OVERHEATED. THE CHECK TEMPERATURE LIGHT ILLUMINATED ON THE INSTRUMENT PANEL. THE CONTACT FILLED THE ENGINE WITH WATER AND DROVE HOME. THE DEALER DIAGNOSED THAT THE EGR COOLER LEAKED; THEREFORE, THE EGR COOLER AND THE OIL COOLER NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED.  THE APPROXIMATE FAILURE MILEAGE WAS 84,000. THE MANUFACTURER WAS NOT NOTIFIED.",
        "vin": "1FTWW31P36E"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/26/2016",
        "dateOfIncident": "05/20/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10871068,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "FORD F-350 2006 OSCILLATION  I HAVE FILED A PREVIOUS COMPLAINT BEFORE RE THE VIOLENT OSCILLATION THAT HAPPENS WITH OUR FORD F-350 TRUCK.  WE HAVE HAD MORE EVENTS AT SLOWER SPEEDS AND THE SHAKING IS ALMOST UNMANAGEABLE NOW.    WEDNESDAY MAY 11 APPROX 1PM EXITING THE BOURNE BRIDGE MA.  I WAS DRIVING AT APPROX 40MPH AND EXITING THE BRIDGE.  THERE WAS A ROUGH CONSTRUCTION PATCH ON THE ROAD RIGHT WHERE THE ROAD CONNECTS TO THE BRIDGE.  AS I HIT THE ROUGH PATCH, THE OSCILLATION BEGAN AND THE TRUCK SHOOK UNCONTROLLABLY APPROACHING THE ROTARY.  THERE WAS A LOT OF TRAFFIC AND CARS IN THE LANE BESIDE ME THAT COULD HAVE BEEN DAMAGED.    MAY 20, 2016 AT APPROX 5PM.  MY HUSBAND WAS DRIVING WEST ON HIGHWAY  ROUTE 6, CAPE COD MA AT APPROX 55MPH.  AS HE PASSED EXIT 6, HE HIT A ROUGH PATCH AND THE TRUCK BEGAN OSCILLATING VIOLENTLY.  HE WAS UNABLE TO CONTROL IT AND SWERVED IN BOTH LANES OF THE WESTERLY 2-LANE HIGHWAY ALSO RUBBING AGAINST THE CURB.   LUCKILY THE TRAFFIC STOPPED WHEN SEEING HIS TRUCK OUT OF CONTROL AND NO ONE WAS HURT OTHER THAN MY HUSBAND BEING TOTALLY SHAKEN.    THE TIRES HAVE BEEN INFLATED AS RECOMMENDED BY FORD WHEN THE SENT A LETTER RE THIS DEFECT.  THIS TRUCK IS DANGEROUS, NOT ONLY TO US BUT OTHERS WHO ARE ON THE ROAD.  I HAVE CONTACTED THE PLYMOUTH FORD DEALER WHERE THE TRUCK WAS PURCHASED, FORD CUSTOMER SERVICE AND FORD HEAD OFFICE.  EVEN THOUGH THEY ACKNOWLEDGE THE TRUCKS ARE DEFECTIVE, THEY SAY THEY ARE NOT RESPONSIBLE FOR REPAIRING THEM.  OUR TRUCK IS OSCILLATING REALLY BADLY AND IS DANGEROUS TO DRIVE.  THIS SHOULD BE A RECALL, NOT ONLY FOR THOSE OF US DRIVING THESE DEFECTIVE FORD F-350 2006 TRUCKS, BUT FOR THE OTHER INNOCENT LIVES ON THE ROAD.",
        "vin": "1FTWW31566E"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/09/2016",
        "dateOfIncident": "02/08/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10825158,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN MERGING ON FREEWAY. TRUCK KEPT ACCELERATING AFTER LETTING OFF GAS PEDAL. SLAMMED ON BRAKES TO SLOW TRUCK. TRUCK KEPT GOING FASTER AND HAD NO CONTROL OF SPEED OR WAY TO STOP TRUCK. AFTER INCIDENT NOW TAC ODOMETER ON DASH  NEEDLE WONT GO BACK TO ZERO AFTER YOU SHUT TRUCK OFF    CRUISE CONTROL WAS OFF AND NO FLOOR MATS IN TRUCK.",
        "vin": "1FTWW31P96E"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/25/2016",
        "dateOfIncident": "02/28/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10822088,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-350. WHILE DRIVING OVER A BUMP AT 35 MPH, THE VEHICLE VIBRATED VIOLENTLY. IN ADDITION, THE STEERING WHEEL ALSO VIBRATED. THE FAILURE RECURRED ON NUMEROUS OCCASIONS. THE VEHICLE WAS TAKEN TO A DEALER, BUT THE CONTACT WAS UNSURE AS TO WHAT REPAIR WAS PERFORMED ON THE FRONT SUSPENSION OF THE VEHICLE. THE FAILURE PERSISTED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 120.",
        "vin": "1FTWW33P26E"
    },
    {
        "components": "STEERING,SUSPENSION,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/18/2016",
        "dateOfIncident": "08/08/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10820797,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "FORD F-350 2006 COMPLAINT.  WE HAVE EXPERIENCED VIOLENT SHAKING (SHIMMYING) WHEN THE TRUCK HITS A BUMP ON THE HIGHWAY AND AS A RESULT, EXTREME DIFFICULTY MAINTAINING THE VEHICLE ON THE ROAD.  OUR FIRST EXPERIENCE WAS IN AUGUST 2015, ON THE INTERSTATE HIGHWAY WHILE TRAVELLING AT 75MP.  WE HIT A BUMP AND THE TRUCK / STEERING WHEEL SHOOK VIOLENTLY FOR ABOUT 10 SECONDS CAUSING US TO SWERVE ACROSS LANES AND STRUGGLE TO KEEP THE TRUCK IN THE LANE AND OUT OF TRAFFIC'S WAY.  WE HAVE SINCE EXPERIENCED THIS PROBLEM FOUR MORE TIMES HITTING BUMPY HIGHWAYS AT SPEEDS AS LOW AS 50MMP AND AS RECENT AS 2 WEEKS AGO.   WE HAVE CHECKED IT OUT AND OUR MECHANIC ADVISED THAT HE COULD NOT FIND ANYTHING WRONG.  IT HAS BEEN A GREAT CONCERN OF OURS AS IT PUTS OUR LIVES (AND THOSE ON THE ROAD WITH US) AT DANGER WHEN THIS ISSUE OCCURS.   ADDITIONALLY, EVERY TIME THE VIOLENT SHAKING OCCURS, IT THROWS OFF THE ALIGNMENT AND BALANCING FOR THE TRUCK.  WE HAVE JUST RECEIVED A LETTER FROM FORD ADVISING OF THIS PROBLEM AND I HAVE CALLED THE SERVICE CENTER FROM THE FORD DEALER WE BOUGHT THE VEHICLE FROM.  FORD IS NOT ASSUMING RESPONSIBILITY FOR ANY DIAGNOSIS OR REPAIRS TO THESE DEFECTS AT THIS TIME.  OUR TIRE PRESSURE IS IN KEEPING WITH FORD'S RECOMMENDATIONS AS THEY SUGGEST IN THEIR LETTER.  FORD F-350 TRUCKS SHOULD NOT BE APPROVED FOR USE ON HIGHWAYS AS THIS DEFECT COULD RESULT IN FATAL ACCIDENTS IF THE SHAKING CANNOT BE CONTROLLED.  ALSO, FORD SHOULD BE RESPONSIBLE FOR REPAIRING THE FAULTY TRUCKS.",
        "vin": "1FTWW31566E"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/12/2016",
        "dateOfIncident": "01/07/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10819574,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "SHIMMY IN FRONT END FORCES LOSS OF STEERING CONTROL. SHIMMY OCCURS AT SPEEDS OVER 50 MPH. HAS NOTHING TO DO WITH TIRE PRESSURE, CONTRARY TO FORD MOTOR COMPANY CLAIMS. THIS IS A PROBLEM WITH THE FRONT END STEERING DESIGN AND SHOULD BE REVIEWED IN GREATER DETAIL BY THE NHTSA AND FIXED WITH MORE THAN A LETTER FROM FORD TELLING ME TO CHECK THE AIR PRESSURE IN MY TIRES. AIR PRESSURE IS PERFECT AND THE PROBLEM STILL EXISTS.",
        "vin": "1FTWW33P26E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/30/2015",
        "dateOfIncident": "02/28/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10807516,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-350. THE CONTACT STATED THAT WHEN THE IGNITION WAS TURNED TO THE ON POSITION, THE ENGINE DID NOT START. AFTER SEVERAL ATTEMPTS, THE ENGINE STARTED. THE FAILURE RECURRED NUMEROUS TIMES. THE VEHICLE WAS NOT TAKEN TO A DEALER OR DIAGNOSED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 170,000. UPDATED 08/02/16*LJ  UPDATED 08/09/16.*JB",
        "vin": "1FTWW31PX6E"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/18/2015",
        "dateOfIncident": "07/18/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10749381,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-350. WHILE DRIVING APPROXIMATELY 70 MPH, THE BRAKE PEDAL WAS DEPRESSED AND FAILED TO RESPOND WITHOUT WARNING. THE CONTACT WAS ABLE TO AVOID A CRASH. THE VEHICLE WAS TOWED TO A DEALER WHERE IT WAS DIAGNOSED THAT THE REAR DRIVER AND PASSENGER SIDE BRAKE CALIPERS NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE CONTACT MENTIONED THAT THE REAR BRAKES WERE PREVIOUSLY REPLACED 10,000 MILES PRIOR TO THE FAILURE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 75,000.  MA 10/22/2015   THE CONSUMER STATED HE EXPERIENCED COMPLETE BRAKE FAILURE ALONG WITH THE LOSS OF BRAKE FLUID. ALSO, THE BRAKES BECAME DISABLED ON THE TRAILER, THE CONSUMER WAS TOWING. UPDATED 12/09/15.*JB",
        "vin": "1FTWW31P96E"
    },
    {
        "components": "SUSPENSION,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/24/2015",
        "dateOfIncident": "06/19/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10730174,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-350. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 70 MPH, THE VEHICLE INDEPENDENTLY SWAYED SIDE TO SIDE WITHOUT WARNING. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC, WHERE IT WAS DIAGNOSED THAT THE DRIVE SHAFT, CASE SHIFTER, TRANSMISSION, LIFT PUMP, TRANSFER CASE, LEFT CALIBER, FUEL LINE AND REAR SHAFT NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 131,000. MA 08/13/15  UPDATED 09/01/2015*LJ   UPDATED 10/14/2015*JS",
        "vin": "1FTWX31P36E"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/01/2015",
        "dateOfIncident": "11/04/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10714112,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON NORTHBOUND FM 920 BETWEEN PEASTER AND POOLVILLE, TEXAS IN THE RAIN.  BECAUSE OF THE RAIN, I WAS NOT DRIVING THE SPEED LIMIT OF 60 MPH, ONLY DRIVING APPROXIMATELY 50 MPH.    THERE WERE TWO VEHICLES APPROACHING ME SOUTHBOUND ON FM 920.  ONE OF THEM WAS PASSING A VEHICLE AND WAS DRIVING HEAD ON TO ME WHILE PASSING THE OTHER VEHICLE IN THE RAIN.  I DID NOT WANT HER TO HIT ME SO I SWERVED TO MISS HER AND ENDED UP IN A DITCH AND HIT A TREE HEAD ON.  THE AIRBAGS DID NOT DEPLOY. MY PICKUP WAS TOTALED. BOTH OF THE OTHER VEHICLES LEFT THE SCENE OF THE ACCIDENT.  *TR",
        "vin": "1FTWW32P46E"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/16/2015",
        "dateOfIncident": "04/11/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10706022,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE SHOOK AT 65 MPH AND SHIMMIED WHEN THE BRAKES WERE APPLIED.   WE FIRST HAD TIRE ROTATED AND BALANCED AND A FRONT END ALIGNMENT WITH THE REPLACEMENT OF RIGHT SIDE BALL JOINTS.   IT DID NOT CORRECT THE PROBLEM.   WHEN WE RETURNED THE VEHICLE TO THE DEALER FOR FURTHER REPAIR, THE DEALER TOOK US BACK TO LOOK AT THE REAR BRAKES.   THE BACKING PLATES HAD FAILED DUE TO RUST AND THE PINS FOR THE PARKING BRAKE SHOES HAD PULLED THROUGH.  THE DEALER REPLACED BOTH ROTORS, BOTH BRAKE SHOES, THE BACKING PLATES AND THE PADS FOR THE DISK BRAKES.",
        "vin": "1FTWW31PX6E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/26/2015",
        "dateOfIncident": "06/30/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10690881,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-350. WHILE DRIVING AT AN UNKNOWN SPEED, THE CONTACT STATED THAT EXHAUST FUMES WERE EMITTING FROM THE EXHAUST MANIFOLD IN FRONT OF THE VEHICLE. IN ADDITION, THE CONTACT STATED THAT THERE WERE EXHAUST FUMES IN THE VEHICLE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 25,000.",
        "vin": "1FDWF37506E"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/05/2014",
        "dateOfIncident": "11/02/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10652785,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-350. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 70 MPH, THE CONTACT CRASHED INTO A DEER AND THE AIR BAGS FAILED TO DEPLOY. A POLICE REPORT WAS FILED AND NO INJURIES WERE REPORTED. THE VEHICLE WAS TOWED TO A DEALER. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 2,018. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/30/2014",
        "dateOfIncident": "10/07/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10651475,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-350. THE CONTACT STATED THE ENGINE OVERHEATED. THE VEHICLE WAS TAKEN TO A DEALER. THE TECHNICIAN DIAGNOSED THAT THE EGR COOLER WAS FAULTY AND NEEDED TO BE REPLACED. THE FAILURE RECURRED ON NUMEROUS OCCASIONS. THE FAILURE WAS REPAIRED BUT THE PROBLEM PERSISTED. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE APPROXIMATE FAILURE MILEAGE WAS 65,000. PAM",
        "vin": "1FTWW32P56E"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/29/2014",
        "dateOfIncident": "02/05/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10651012,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING WOBBLE AND SHAKES.  THIS HAS BEEN GETTING WORSE AS TIME GOES ON. ANYTIME I HIT A BUMP ON THE FREEWAY MY TRUCK STARTS TO VIOLENTLY SHAKE AND WOBBLE. IT IS EVEN WORSE ON A ROAD CURVE. IT IS VERY DANGEROUS TO DRIVING ON THE FREEWAY IN THE MOUNTAINS. I FEW TIMES I ALMOST LOST CONTROL. THE SHAKE DOES NOT GO AWAY UNTIL I SLOW DOWN BELOW 40MPH WHICH CAUSES ANOTHER DANGEROUS SITUATION WHILE ON THE FREEWAY. I HAVE CHANGED TIRES, CHECKED PRESSURE AND ROTATED TIRES. ALSO, I REPLACED STEERING DAMPENER. NOTHING HAS WORKED TO DIMINISH THE SHAKE. I ALSO HAD THE 4 WHEEL ALIGNMENT CHECKED AND THE SHOP SHOWED ME THAT IT WAS CORRECT. THEY CHECKED EVERYTHING AND COULD NOT FIND ANYTHING THAT WAS WORN OUT AND NEEDED CHANGING. I WAS TOLD NO REPAIRS NEEDED. THIS IS A VERY DANGEROUS SITUATION AND NEEDS TO BE CORRECTED BEFORE BODIES START PILING UP.  *TR",
        "vin": ""
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/22/2014",
        "dateOfIncident": "10/20/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10649276,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PARKED, A CRACK IN THE CIRCUMFERENCE OF THE DRIVERS SIDE ALUMINUM WHEEL WAS NOTICED. THE CRACK EXTENDS FROM SPOKE TO SPOKE ON THE 20\" FACTORY FORD RIM. AFTER SOME RESEARCH ON THE INTERNET, I AM NOT THO ONLY ONE EXPERIENCING THIS SITUATION. IN MOST CASES SUCH AS MINE THE RIMS ARE CRACKING IN THE SAME PLACE AND IN MOST CASES THERE WAS NO DAMAGE NOTED TO THE WHEEL FROM POTHOLES OR IMPACTS, THE RIM IS DEFECTIVE AND CRACKING. I HAVE CONTACTED FORD AND THERE IS NO RECALL AT THIS POINT AND THE TRUCK IS NOT UNDER WARRANTY. HOWEVER THIS APPEARS TO BIG A HUGE SAFETY ISSUE, AS IF THE WHEEL WOULD CONTINUE TO CRACK, IT WOULD NOT HOLD AIR AN THE TIRE COULD GO FLAT IMMEDIATELY. I WOULD LIKE TO SEND A PICTURE OF THIS TO SHOW THE ISSUE. THERE ARE SEVERAL PICTURES ON THE INTERNET OF THE SAME WHEEL (5 SPOKE 20\" ALUMINUM WHEEL 2006 F-350 TRUCKS).  *TR",
        "vin": "1FTWW31P16E"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/21/2014",
        "dateOfIncident": "11/09/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10649047,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 FORD F-350 6.0 DIESEL CAB AND CHASIS -- EGR VALVE 1ST TIME FIXED BY FORD DEALER NO COST, EGR VALVE 2ND TIME FIXED AT COST, EGR VALVE 3RD TIME BY-PASSED, 16 FUEL INJECTORS REPLACED. DELAMINATING GAS TANK, OVER A DOZEN FUEL FILTERS AT $60,00 A POP, NEW FUEL PUMP, NEW GAS TANK, 8 MORE NEW FUEL INJECTORS. POSSIBLE TURBO ISSUES AND I MAY BE FORGETTING SOMETHING.  *TR",
        "vin": "1FDWW37P66E"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/02/2014",
        "dateOfIncident": "04/02/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10576849,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-350. THE CONTACT STATED THAT THE SUSPENSION WAS UNSTABLE AND WOULD SHAKE WHILE THE VEHICLE WAS BEING DRIVEN AROUND A CURVE OR AT VARIOUS SPEEDS SPORADICALLY. THE CONTACT TOOK THE VEHICLE TO THE DEALER FOR DIAGNOSTIC TESTING WHERE THE DEALER REPLACED THE POWER STEERING HOSES AND THE STEERING STABILIZER HOWEVER, THE FAILURE PERSISTED. THE VEHICLE WAS THEN TAKEN TO AN INDEPENDENT MECHANIC, WHO STATED THAT A CASTER ADJUSTMENT WOULD NEED TO BE PERFORMED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE BUT DECLINED TO PROVIDE THE CONTACT A REMEDY TO REPAIR THE VEHICLE. THE FAILURE MILEAGE WAS 20,000.",
        "vin": "1FTWX31P66E"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/03/2014",
        "dateOfIncident": "12/22/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 1,
        "numberOfInjuries": 0,
        "odiNumber": 10566823,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-350 . THE CONTACT STATED THAT THE DRIVER WAS TRAVELING AN UNKNOWN SPEED AND CRASHED INTO AN EMBANKMENT. THE IMPACT CAUSED THE VEHICLE TO FLIP IN REVERSE AND LAND ON THE PASSENGER'S SIDE. THE AIR BAGS FAILED TO DEPLOY. THE DRIVER WAS KILLED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT INSPECTED OR REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 161,000.   *TR",
        "vin": "1FTWF30P86E"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/11/2014",
        "dateOfIncident": "05/02/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10563867,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-350. THE CONTACT STATED THAT THE WHILE DRIVING APPROXIMATELY 35 MPH, THE FRONT END OF THE VEHICLE AND THE STEERING WHEEL EXPERIENCED SEVERE VIBRATION AFTER THE CONTACT DROVE OVER A ROAD DIP. THE CONTACT STATED THAT THE DEFECT WOULD RECUR WHEN DRIVING AT ANY SPEED AND ANYTIME THE VEHICLE WAS DRIVEN OVER A DIP OR ROAD WINE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED AND NO SOLUTION WAS OFFERED. THE FAILURE MILEAGE WAS 60,000.",
        "vin": "1FTWW33P36E"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/16/2014",
        "dateOfIncident": "11/02/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10560235,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING VEHICLE WITH FIFTH WHEEL 31 FT CAMPER IN TOW VEHICLE LURCHED TO THE LEFT AND ATTEMPTS TO CORRECT FOUND GREAT RESISTANCE IN STEERING RESPONSE. ON SEVERAL OCCASIONS SINCE AND AT NO SPECIFIC SPEED THE VEHICLE WILL LURCH TO THE LEFT OR RIGHT OR SHIMMY TO THE POINT THAT STEERING BECOMES ALMOST UNRESPONSIVE. I HAD THE VEHICLE CHECKED AND WAS ADVISED NOTHING WAS IN NEED OF REPLACEMENT. THEN I RECEIVED A LETTER FROM FORD MOTOR CO DESCRIBING THE EXACT STEERING SITUATION THAT I AM EXPERIENCING ALONG WITH RECOMMENDATIONS TO KEEP TIRES INFLATED PROPERLY, WHICH I HAVE AND CONTINUE TO HAVE CORRECT. I CONTACTED FORD TO VOICE MY CONCERN AND WAS ADVISED THIS IS \"JUST A NORMAL QUALITY OF A SOLID FRONT AXEL 4 WHEEL DRIVE TRUCK\".  I USE THIS VEHICLE TO PULL A CAMPER AND WHEN THIS \"SEVERE VIBRATION AND OSCILLATION\" OCCURS IT CAUSES THE TRUCK/TRAILER TO LURCH SO FAR AS TO CAUSE IT TO SHIFT LANES. THIS PROBLEM OCCURS AT ALL SPEEDS, EVEN HIGHWAY SPEEDS OF 70MPH. I WAS ALSO TOLD THAT THE LETTER WAS ONLY A \"NOTIFICATION OF THE SITUATION AND HOW TO AVOID\" AND NOT A RECALL. FURTHERMORE, FORD ADVISED THAT I TAKE THE VEHICLE IN TO A FORD DEALER AT MY COST TO ENSURE THAT THIS WAS THE CAUSE OF THE PROBLEM. THIS SITUATION IS SEVERE ENOUGH THAT IT COULD AND PERHAPS HAS BEEN THE CAUSE OF TRAFFIC ACCIDENTS. HOW LONG WILL THIS BE ALLOWED TO GO ON BEFORE A RECALL IS ISSUED? HAVING IDENTIFIED A VEHICLE STEERING PROBLEM, THAT IN MY OPINION COULD BE LIFE THREATENING, SHOULD BE SUFFICIENT CAUSE FOR A RECALL TO BE ISSUED.  *TR",
        "vin": "1FTWW33P46E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/19/2013",
        "dateOfIncident": "01/01/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10552880,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-350. THE CONTACT STATED THAT WHILE DRIVING 40 MPH, THE VEHICLE STARTED TO EMIT WHITE SMOKE. THE VEHICLE TAKEN TO THE DEALER WHERE THE TECHNICIAN DIAGNOSED THAT THE TURBO BOOSTER AND FUEL INJECTORS WAS DEFECTIVE AND NEEDED TO BE REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS REPAIRED. THE FAILURE MILEAGE WAS 112,000 AND THE CURRENT MILEAGE WAS 124,000.",
        "vin": "1FTWW33P66E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/20/2013",
        "dateOfIncident": "07/14/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10536370,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON HIGHWAY F-350 LOST POWER, SHUT OFF AND WOULD NOT RESTART.  NUMEROUS PROBLEMS WITH FUEL/TURBO.  REPLACE TURBO INJECTORS, EGR VALVE, FICM, FUEL INJECTOR, REGULATOR, AND HIGH PRESSURE OIL PUMP.  *TR",
        "vin": "1FTWX31P06E"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/01/2013",
        "dateOfIncident": "08/01/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10533024,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR TRUCK EXPERIENCED A SEVERE, VIOLENT WOBBLE THAT STARTED AFTER TRAVELING OVER A UNEVEN SPOT ON THE ROAD. WE FEARED FOR OUR LIVES AS THIS OCCURRED WHILE PASSING ANOTHER TRUCK ON A BRIDGE WITH HEAVY TRAFFIC BEHIND US. THE SHAKING AND WOBBLE CONTINUED FOR ABOUT 20 SECONDS, AND DID NOT STOP UNTIL THE TRUCK SLOWED DOWN TO ABOUT 40 MILES AN HOUR.   ALL OUR TIRES HAVE BEEN RECOMMENDED AND INSTALLED AT THE FORD DEALERSHIP. I MAINTAIN TIRE PRESSURES AS INDICATED ON DOOR JAM. 75 LB ON FRONT AND 60 LB ON REAR TIRES. THERE ARE NO AFTERMARKET MODIFICATIONS ON OUR TRUCK.   I CONSIDER THIS ISSUE VERY DANGEROUS, AND WONDER HOW MANY FOLKS MAY HAVE BEEN INJURED OR KILLED AS A RESULT OF THEIR TRUCK SUDDENLY BECOMING UNCONTROLLABLE, AS OURS DID.  *TR",
        "vin": "1FTWX33P16E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/05/2013",
        "dateOfIncident": "06/23/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10523280,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F350. THE CONTACT STATED THAT WHILE DRIVING 55 MPH, THERE WAS A LOUD NOISE FROM THE UNDER THE HOOD. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC FOR DIAGNOSIS WHERE IT WAS ADVISED THAT THE TURBO BARON NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED AND THE MANUFACTURER WAS NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 42,000. *TR",
        "vin": "1FDWX37P06E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/27/2013",
        "dateOfIncident": "06/22/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10522056,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-350. THE CONTACT STATED WHILE APPLYING THE BRAKES TO ATTEMPT A TURN, THE VEHICLE STALLED. IN ADDITION, THE POWER STEERING ASSIST FAILED. THE VEHICLE WAS TAKEN TO A LOCAL MECHANIC WHO ADVISED THAT THE OIL PUMP WAS DEFECTIVE AND THE OIL PRESSURE WAS ABNORMALLY LOW. THE VEHICLE WAS NOT REPAIRED.   THE FAILURE MILEAGE WAS 49,600.",
        "vin": "1FTWX32P76E"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/26/2013",
        "dateOfIncident": "06/07/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10521960,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-350. THE CONTACT STATED THAT WHILE DRIVING 10 MPH, THE VEHICLE LOST ACCELERATION POWER AND STALLED. THE CONTACT STATED THAT SHE RESTARTED THE VEHICLE AND DROVE IT TO THE DEALER FOR INSPECTION WHERE THEY STATED THAT THE TURBO CHARGER NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED BUT THE FAILURE RECURRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": "1FTWX31P16E"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/03/2013",
        "dateOfIncident": "09/19/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10510586,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT TRUCK USED WITH APPROXIMATELY 35,000 MILES. DRIVING DOWN THE ROAD FROM 45 TO 55 THE FRONT SUSPENSION GETS A TERRIBLE SHIMMY.  WHEN THIS OCCURS, ITS HARD TO HANDLE THE TRUCK.  THE FRONT END SHAKES VIOLANTLY.  A DANGEROUS SITUATION SINCE I AM NORMALLY PULLING A RACE CAR WITH THIS TRUCK. TRUCK IS NOT A DAILY DRIVER.  IT'S AVERAGE USE IS 4 TO 6 TIMES PER MONTH. IN ORDER TO GET THE SHIMMY TO STOP, SOMETIMES I CAN SLOW DOWN BELOW 40 MPH. OTHERWISE, I HAVE TO STOP.  IT MAY OR MAY NOT GO AWAY. THE STRANGE THING IS THAT IT DOES NOT ALWAYS DO THIS.  THE TRUCK HAS NEW SHOCKS, NEW TIRES, BALANCED, AND ALIGNED. TIRES ARE APPROVED FOR THE TRUCK.  THE SHIMMY HAS BECOME MORE FREQUENT AND IS PREMATURLY WEARING THE TIRES.  TIRES ARE INFLATED PROPERLY FOR USE OF THE VEHICLE.  PROBLEM HAS RECENTLY STARTED WITHIN THE LAST 6 TO 7 MONTHS.  MILEAGE IS CURRENTLY 78,490.  THEREFORE SHIMMY STARTED AT APPROXIMATELY 75, 000 MILES.  *TR",
        "vin": "1FTWW33P76E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/16/2013",
        "dateOfIncident": "07/05/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10493193,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-350. THE CONTACT STATED THAT THE VEHICLE STALLED WHILE DRIVING 70 MPH. THE CONTACT TOOK THE VEHICLE TO THE DEALER AND WAS TOLD THAT THE OIL PUMP FAILED. THE DEALER RECOMMENDED HAVING THE OIL PUMP, INJECTORS AND FUEL INJECTION MODULE REPLACED. THE VEHICLE WAS REPAIRED. AFTER SOME TIME WHILE DRIVING AT AN UNKNOWN SPEED, THE CONTACT HEARD A LOUD EXPLOSION AND THE VEHICLE STALLED. THE VEHICLE WAS NOT FURTHER REPAIRED. THE FAILURE MILEAGE WAS 63,000 AND THE CURRENT MILEAGE WAS 117,000.",
        "vin": "1FDWW36P56E"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/05/2013",
        "dateOfIncident": "09/19/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10491526,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON DRIVING AT HIGHWAY POSTED SPEED, I ENCOUNTERED A BUMP IN THE ROAD WHILE IN A TURN. UPON HITTING THE BUMP, IT SENT MY FRONT-END INTO A VIOLENT SPEED-WOBBLE WHICH ALMOST PUT MY FAMILY AND I INTO THE RETAINING WALL. BEING THAT I'M A FORMER STATE POLICE OFFICER, I MAY HAVE \"SAVED\" US ONLY BY BEING HIGHLY TRAINED WITHIN DRIVING AND VEHICLE CONTROL. I HAVE READ FORUMS WITH MANY STATING THAT THEY HAVE EXPERIENCED THE SAME FLAW, SOME WITH NOT VERY GOD ENDINGS.  *TR",
        "vin": "1FTWW33P06E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/30/2012",
        "dateOfIncident": "11/29/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10486602,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-350. THE CONTACT STATED THAT THE VEHICLE FAILED TO START. THE CONTACT HAD THE VEHICLE TOWED TO THE DEALER FOR A DIAGNOSTIC TEST. THE DEALER ADVISED THE CONTACT THAT THE PARK BLOCK AND THE INJECTOR CONTACT MODULE NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 123,823.",
        "vin": "1FTWW33P86E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/10/2012",
        "dateOfIncident": "11/02/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10483952,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL TANK LINER IS DELAMINATING CAUSING FUEL SYSTEM TO CLOG UP AND TRUCK TO LOSE POWER. FORD REFUSES TO COVER THIS PROBLEM UNDER WARRANTY SAYING IT IS NOT THEIR FAULT.  *TR",
        "vin": "1FTWW31P06E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/21/2012",
        "dateOfIncident": "06/05/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10462602,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-350. THE CONTACT STATED THAT THE VEHICLE WAS STARTED AND WHILE ACCELERATING, BLUE SMOKE WAS SEEN COMING FROM THE VEHICLE AND THE TACHOMETER INDICATED THAT THE VEHICLE HAD NOT RESPONDED. THERE WAS A LOUD ROAR FROM THE ENGINE THAT WOULD BECOME PROGRESSIVELY LOUDER AS THE ACCELERATOR WAS DEPRESSED. THE CONTACT WAS ABLE TO ACCELERATE AFTER SEVERAL MINUTES HOWEVER, THE VEHICLE DID NOT EXHIBIT ENOUGH POWER TO ACCELERATE UPHILL. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSIS AND THE CONTACT WAS ADVISED THAT THE HEAD GASKETS, TURBO AND TWO FUEL INJECTORS WOULD NEED REPLACING. IN ADDITION, THE EGR WOULD NEED TO BE BYPASSED WITH A KIT IN ORDER TO CORRECT THE ENGINE FAILURE. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE BUT OFFERED LITTLE ASSISTANCE. THE FAILURE AND THE CURRENT MILEAGES WERE 227,000.    UPDATED 7/16/12 *CN  THE CONSUMER STATED THE PROBLEM WAS WITH THE EGR VALVE, WHICH CLOGGED THE EXHAUST AND TURBO FILTERS, WHICH CAUSE CARBON BUILD-UP.  UPDATED 07/24/12",
        "vin": "1FTWX31P46E"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/16/2012",
        "dateOfIncident": "01/01/2008",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10455372,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-350. THE CONTACT STATED THAT WHILE DRIVING 30 MPH, THE FRONT PASSENGER WHEEL SEIZED. THE FAILURE OCCURRED BECAUSE THE CALIPER SEIZED. THE CONTACT ALSO STATED THAT THE WHEEL WAS EXTREMELY HOT AFTER THE FAILURE OCCURRED. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER AND THE CALIPER WAS REPAIRED. THE FAILURE HAD SINCE RECURRED ON AN INTERMITTENT BASIS. THE VEHICLE WAS EITHER TAKEN BACK TO THE DEALER FOR REPAIR OR THE CONTACT PERFORMED THE REPAIRS HIMSELF. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 7,000.",
        "vin": "1FTWX31576E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "04/02/2012",
        "dateOfIncident": "04/27/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10453843,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS A 2006 FORD AMBULANCE THAT HAS BEEN HAVING ISSUE'S WITH THE FUEL SYSTEM OVER THE PAST TWO YEARS THE MOST RECENT WAS DURING A EMERGENCY RESPONSE WHEN THE AMBULANCE LOST POWER AND SHUT DOWN THE CREW WAS UNABLE TO COMPLETE THEIR RESPONSE TO THE EMERGENCY BECAUSE THE AMBULANCE WOULD NOT RESTART.    THE AMBULANCE WAS TOWED TO THE FORD  DEALERSHIP THEY REPORTED THE FUEL TANK WAS COMING APART ON THE INSIDE AND CLOGGING THE FUEL SYSTEM.  WE CONTACTED FORD AND COMPLAIN OF ALL THE FUEL PROBLEM AND THE MOST RESENT THE FUEL TANK THE END RESULT WAS THEIR CLAIMING ITS NOT THEIR PROBLEM BUT OURS THE REPAIR EST IS OVER $7000.00   THIS AMBULANCE HAS SPENT MORE TIME IN THE SHOP THEN RESPONDING TO EMERGENCY CALLS AND HAS LEFT OUR CREWS SIT WHILE IN ROUTE OR ON THE SCENE OF  MEDICAL EMERGENCY.     THE FORD DEALER AND FORD MOTOR COMPANY REFUSE TO DO ANYTHING TO CORRECT THIS PROBLEM WE HAVE NEVER HAD THESE TYPE OF PROBLEMS WITH ANY AMBULANCE WE OWNED OVER THE PAST 15 YEARS AND A AMBULANCE BREAKING DOWN IN THE MIDDLE OF A EMERGENCY CALL IS A DANGEROUS ISSUE TO THE PATIENT AND CREW ......  *TR",
        "vin": "1FDWF36P96E"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "02/24/2012",
        "dateOfIncident": "02/18/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10449171,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "STOPPED AT A TRAFFIC LIGHT AT A THREE WAY INTERSECTION. WHEN LIGHT CHANGED PROCEEDED THROUGH THE INTERSECTION TO THE LEFT SPEED WAS BETWEEN 10-15 MPH HALF WAY THROUGH THE INTERSECTION WHEN THE STEERING BOX FAILED. LOST ALL STEERING AND COLLIDED WITH TELEPHONE POLE OPPOSITE THE INTERSECTION.THERE WAS NO PRIOR WARNING OR PREEMPTIVE SIGNS OF EQUIPPED FAILURE. THE VEHICLE WAS IN PERFECT WORKING ORDER AT THE TIME OF FAILURE. THE COLLISION CENTER WHO DID THE ESTIMATE ON THE TRUCK STATED HE HAD NEVER SEEN A STEERING BOX FAIL THE  WAY THIS ONE DID THE PINION GEAR IN SIDE EXPLODED!   *TR",
        "vin": "1FTWW31P86E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/19/2012",
        "dateOfIncident": "01/10/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10444580,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-350. THE CONTACT WAS DRIVING 60 MPH WHEN THE VEHICLE EXHIBITED AN ABNORMALLY LOUD NOISE AND STALLED. THE CONTACT MENTIONED THAT THE FAILURE OCCURRED ONCE PRIOR. THE VEHICLE WAS TAKEN TO THE DEALER WHO DIAGNOSED THAT THE TURBO CHARGER WAS DEFECTIVE AND NEEDED TO BE REPLACED. THE MANUFACTURER WAS MADE AWARE OF FAILURE WHO DID NOT OFFER ANY ASSISTANCE SINCE THE VEHICLE WAS NO LONGER UNDER WARRANTY. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 65,000 AND THE CURRENT MILEAGE WAS 85,000.",
        "vin": "1FTWW31P06E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/10/2012",
        "dateOfIncident": "06/12/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10443255,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WOULD NOT START,A/C , PERFORMANCE, ENGINE LIGHT SLUGGISH TAKE OFF, PERFORMANCE, WHITE SMOKE AND EGR LEAKING DIESEL FUEL ON TOP OF MOTOR, THIS TRUCK HAS HAD TWO REBUILT ENGINES UPON THE FIRST 50,000MILES.ENGINE COVERED IN OIL, FUEL INJECTOR MAIN PROBLEM STARTED WITH OVERHEATING.  *TR",
        "vin": "1FDWF37P76E"
    },
    {
        "components": "STEERING,SUSPENSION,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/09/2012",
        "dateOfIncident": "11/15/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10443216,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE SINCE NEW HAS HAD NUMEROUS INCIDENTS WITH A SEVERE UNCONTROLLABLE SHIMMY IN FRONT END AND STEERING WHEEL.I HAVE HAD IT TO THE DEALER NUMEROUS TIMES AND THEY TELL ME THERE IS NOTHING WRONG WITH IT.   FORD HAS SENT A FEW NOTIFICATIONS STATING THAT THEY ARE AWARE OF THE PROBLEM,BUT THAT IT IS JUST CAUSED FROM IMPROPER INFLATION.I HAVE SET THE TIRES TO MANUFACTURERS RECOMMENDED PSI WEEKLY,AND DOESN'T MAKE A BIT OF DIFFERENCE.FORD IS CLOSING THEIR EYES ON THIS ONE, AND IT IS GOING TO COST LIVES!!!.WHEN THIS OCCURS YOU HAVE ABSOLUTELY NO CONTROL OF THE VEHICLE.ANOTHER PROBLEM WITH THIS VEHICLE IS THE ENGINE IS JUNK. MY VEHICLE HAS 43000 MILES CURRENTLY,AND HAS HAD THE MOTOR TAKEN OUT OF IT TWICE ALREADY FOR REPAIRS!!!,AND HAS BEEN TO DEALER AT LEAST 6 OR 7 TIMES.I OWN A SMALL TREE CARE COMPANY AND REALLY CANT AFFORD A $45000 MISTAKE TO A MULTI BILLION DOLLAR COMPANY.  *TR",
        "vin": "1FDWF37P66E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/04/2012",
        "dateOfIncident": "03/29/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10442383,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ABOVE MENTIONED TRUCK WHICH HAS 11,750 MILES ON IT. SINCE IT WAS PURCHASED AT THE END OF 2005, THE TURBOCHARGER HAS BEEN REPLACED FIVE TIMES OR AT APPROXIMATELY 2000 MILE INTERVALS.  THE VEHICLE IS WELL MAINTAINED WITH OIL AND FILTER CHANGES MORE FREQUENT THAN FORD RECOMMENDS.    DUE TO A PREVIOUS COMPLAINT REGARDING FAULTY TURBOS, FORD EXTENDED MY WARRANTY UNTIL 2011 THROUGH AN OASIS SERVICE CONTRACT.   FORD ACKNOWLEDGED PROBLEMS WITH FAULTY TURBOS THROUGH THE ISSUANCE OF SIX OR MORE TECHNICAL SERVICE BULLETINS.   A FAULTY TURBO CAUSES THE TRUCK TO RUN POORLY AND FAIL CONNECTICUT EMISSIONS TESTS AND RISKS FURTHER ENGINE DAMAGE.    I HAVE CONTACTED FORD CUSTOMER SERVICE.  I HAD SENT THEM REPAIR RECORDS, PHOTOS AND DOCUMENTATION.   THEY NEVER RESPONDED IN WRITING, BUT PHONED AND SAID THERE WAS NOTHING FURTHER THAT THEY WOULD DO.        IT IS APPARENT THAT THERE IS AN ENGINEERING OR DESIGN FLAW ASSOCIATED WITH THE TURBOS.   FORD HAS REPLACED EACH TURBO WITH THE SAME TYPE AND HAS FAILED TO CORRECT THE ROOT CAUSE OF THE FAILURES.       I'M NOT REQUESTING REPLACEMENT OF THE VEHICLE, NOR MONETARY COMPENSATION ALTHOUGH THIS PROBLEM HAS CAUSED CONSIDERABLE INCONVENIENCE AND LOSS OF TIME.     I AM REQUESTING, THAT IF FORD CANNOT REPAIR THIS PROBLEM, ONCE-AND-FOR-ALL, THAT THEY EXTEND THE WARRANTY FOR THE LIFE OR THE TRUCK OR AT LEAST FOR AS LONG AS I OWN THE TRUCK. *TR",
        "vin": "1FTWX31P36E"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/03/2012",
        "dateOfIncident": "04/01/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10442234,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-350. THE CONTACT STATED THAT THE VEHICLE WOULD SHAKE ABNORMALLY WHEN DRIVING OVER ROAD BUMPS AT APPROXIMATELY 55 MPH. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER AND THE CONTACT WAS INFORMED THAT THE TIRE PRESSURE MAY BE THE CAUSE OF THE FAILURE. TIRE PRESSURE ON EACH TIRE WAS CHECKED, BUT THE FAILURE CONTINUED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND OFFERED NO ASSISTANCE. THE FAILURE MILEAGE WAS 60,000.",
        "vin": "1FTWW33P66E"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/14/2011",
        "dateOfIncident": "11/02/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10439931,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-350. THE CONTACT STATED THAT THE FRONT END OF THE VEHICLE WOULD SHAKE VIOLENTLY WHEN DRIVING OVER ANY ROAD BUMP. THE CONTACT WAS TOLD BY THE MANUFACTURER THAT THE FAILURE COULD LIKELY BE CAUSED BY IMPROPER TIRE INFLATION AND THAT THE CONTACT SHOULD INSPECT THE TIRE PRESSURE. THE TIRE PRESSURE WAS ADJUSTED BUT THE CONTACT STATED THAT IT DID NOT CORRECT THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS UNKNOWN AND THE CURRENT MILEAGE WAS 29,000.  PROBLEMS HAPPENS REGULARLY. PROBLEM BECOMES MORE FREQUENT AND SEVER WHEN PULLING A TRAILER. UPDATED 1/20/2012 *BF  UPDATED 01/27/12",
        "vin": "1FTWW33P66E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/13/2011",
        "dateOfIncident": "11/01/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10439708,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-350. WHILE DRIVING APPROXIMATELY 50 MPH, THE CONTACT DROVE OVER AN UNEVEN ROAD SURFACE AND THE FRONT END OF THE VEHICLE BEGAN TO SHAKE VIGOROUSLY. THE VEHICLE WOULD ALSO SHAKE ABNORMALLY WHEN DECELERATING. THE CONTACT STATED THAT IN ADDITION, THE CHECK ENGINE WARNING LIGHT WAS ILLUMINATED, THE VEHICLE WOULD ERRATICALLY SHIFT, AND THE FUEL TANK WAS DELAMINATING. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSTICS BUT THE TECHNICIANS WERE UNABLE TO DETERMINE THE CAUSE OF THE SHAKING. THE TECHNICIANS WERE ABLE TO DETERMINE THAT THE TRANSMISSION SHIFT SENSOR AND THE FUEL TANK WOULD HAVE TO BE REPLACED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE THE TRANSMISSION WAS REBUILT. AND THE TRANSMISSION SHIFT SENSOR WAS REPLACED. THE FUEL TANK WAS NOT REPLACED. THE VIN WAS NOT AVAILABLE. THE APPROXIMATE FAILURE MILEAGE WAS 80,000.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/08/2011",
        "dateOfIncident": "12/03/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10438989,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-350. THE CONTACT STATED THAT HE DROVE OVER A ROAD BUMP AT 30 MPH AND THE VEHICLE BEGAN TO VIBRATE UNCONTROLLABLY. THE CONTACT WAS UNABLE TO CONTROL THE VEHICLE AS IT STEERED INTO THE ONCOMING LANE OF TRAFFIC. THE CONTACT RELEASED THE ACCELERATOR PEDAL AND REGAINED CONTROL AS THE VEHICLE DECELERATED. THE VEHICLE WAS NOT TAKEN TO HAVE THE FAILURE DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE, BUT OFFERED NO ASSISTANCE. THE FAILURE MILEAGE WAS 60,500.     UPDATED 1/20/12 *CN  UPDATED 02/01/12",
        "vin": "1FTWX31P66E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/28/2011",
        "dateOfIncident": "11/08/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10437584,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUCK RUNS ROUGH, CHECK ENGINE LIGHT COME ON, FUEL SENSOR ERROR.  THERE SEEMS TO BE QUITE A FEW SIMILAR COMPLAINTS. DEALERS STATED FUEL TANKS ARE CORRODING. WHY HAS THERE NOT BEEN A RECALL? THIS IS A MANUFACTURING PROBLEM. FORD SHOULD DEAL WITH IT OR MADE TO.  *KB",
        "vin": "1FTWW31P96E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/14/2011",
        "dateOfIncident": "10/02/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10435497,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD F350. THE CONTACT STATED WHILE ATTEMPTING TO REVERSE, THE VEHICLE LOST POWER AND RELEASED SMOKE. THE VEHICLE WAS TOWED TO DEALER WHO PERFORMED A DIAGNOSTIC THAT LOCATED THE FAILURE AT THE ENGINE EXHAUST EGR VALVE. THE MANUFACTURER DENIED ASSISTANCE WITH THE REPAIR. THE EGR VALVE WAS REPLACED. THE FAILURE MILEAGE WAS 113,048 AND THE CURRENT MILEAGE WAS 114,232.  UPDATED 02/03/12*LJ  UPDATED 02/08/12",
        "vin": "1FTWX31P26E"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/02/2011",
        "dateOfIncident": "10/24/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10433982,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY FORD F350 TURBO DIESEL TRUCK WOULD NOT GO FASTER THAN APPROX. 25 MPH, COULD NOT GET ANY POWER.  CAME TO A STOP LIGHT AND IT DIED AND WOULD NOT RESTART.  HAD IT TOWED TO THE NEAREST FORD DEALER THINKING IT WOULD BE COVERED BY THE WARRANTY. THEY HAVE CHANGED THE FUEL INJECTOR CONTROL MODULE-NO FIX, THE FUEL PUMP AND FILTERS AND FOUND FOREIGN SUBSTANCE/CORROSION, PULLED THE FUEL TANK AND FOUND THE SOURCE OF THE CORROSION, DELAMINATING FUEL TANK.  THE REPAIRS ARE UP TO $2500, THE FUEL TANK STILL TO COST $1300 TO REPLACE THE PART BUT STILL HAVE LABOR INVOLVED.  ALSO THE FUEL INJECTORS, 5 OF THE 8 ARE EXHIBITING NO POWER AND VARIOUS OTHER FUEL FILTERS THAT THEY NAMED OFF WILL ALSO NEED TO BE CHANGED.  THAT WILL COST ANOTHER SEVERAL THOUSAND.  I HAVE CONTACTED FORD MANUFACTURER, CUSTOMER ASSISTANCE AND THEY STATE THEY WILL NOT PAY OR ASSIST ME IN THE COST EVEN THOUGH WE ARE ONLY 6 WEEKS OUT OF WARRANTY.  THE TRUCK IS LIKE NEW, ONLY 66K MILES. THIS IS UNBELIEVABLE.  I'VE NEVER EXPERIENCE SUCH A TRAUMATIC COSTLY PROBLEM IN AN AUTOMOBILE WITH ONLY 66K MILES.  I STILL HAVE THE TRUCK AT THE DEALER AND CAN'T AFFORD TO PAY THE COST.  *TR",
        "vin": "1FDWF35P06E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "10/19/2011",
        "dateOfIncident": "06/01/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10430858,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "LINER IN THE FUEL TANK CORRODED AND CLOGGED FUEL SYSTEM CAUSING FAILURE OF VEHICLE.  *TR",
        "vin": "1FDWF37P96E"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/19/2011",
        "dateOfIncident": "03/05/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10430876,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 F-350 LARIAT SUPER DUTY- IN MARCH WHILE DRIVING ON I-70 I HIT A BUMP IN THE ROAD AT 65MPH AND THE FRONT END AND STEERING WHEEL SHOOK VIOLENTLY AND I WAS IMMEDIATELY THROWN INTO THE PASSING LANE.  I TOOK THE TRUCK TO SUMMIT FORD IN SILVERTHORNE, CO WHERE THEY CALLED MY DESCRIPTION THE \"DEATH WOBBLE\" AND THEY REPLACED THE TRACK BAR, BALL JOINT AND STEERING DAMPENER.  I FELT FORTUNATE THAT NO TRAFFIC WAS NEAR ME AND I SURVIVED THE UNCONTROLLABLE EVENT!  NOW WITH THE $600.00 \"REPAIR\" EXPENSE I LEFT THE SERVICE CENTER SATISFIED THAT I WOULD BE SAFE ON THE ROAD.  TWO WEEKS AGO WHILE ON A TRIP, THE SAME \"DEATH WOBBLE\" HAPPENED AGAIN AND I WAS OUT OF CONTROL AND IN THE OTHER LANE AGAIN, THANKFULLY NO TRAFFIC WAS BESIDE ME OR ONCOMING WHICH WOULD HAVE CAUSED AN ACCIDENT.  SO NOW I HAVE LOST ALL CONFIDENCE IN THE SAFETY OF MY TRUCK AND DROVE CONSERVATIVELY TO GET HOME AVOIDING ALL BUMPS AND SLOWING DRAMATICALLY WHEN APPROACHING ANY IMPERFECT ROAD SURFACES.  EVEN WITH MY NEW CAUTIOUS APPROACH TO DRIVING THE \"DEATH WOBBLE\" HAPPENED AGAIN AT ONLY 50MPH.   I HAVE SINCE DISCOVERED NUMEROUS COMPLAINTS AND YOU-TUBE VIDEOS OF OTHERS WITH THE SAME PROBLEM AS WELL AS COMPLAINTS ON THE NATIONAL HIGHWAY TRAFFIC SAFETY ADMINISTRATION'S WEBSITE.  I HAVE FOUND 2 DOCUMENTS ISSUED BY FORD MOTOR COMPANY REGARDING THIS PROBLEM, A TECHNICAL SERVICE BULLETIN 04-26-1, AND A LETTER DATED APRIL 2009 (LITERATURE PROGRAM 09L02) ADDRESSED TO [XXX] REGARDING \"SHIMMY, A SEVERE VIBRATION AND OSCILLATION IN THE STEERING WHEEL...........\".  I AM RUNNING THE TRUCK AT THE LABEL SPECIFIED TIRE PRESSURE AND THERE ARE NO SUSPENSION MODIFICATIONS . I AM CONSIDERING REPLACING THE F-350 WITH ANOTHER VEHICLE THAT I CAN BE ASSURED OF NOT HAVING THIS PROBLEM.  MY QUESTION TO FORD IS, WHAT AM I SUPPOSED TO DO NOW? [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "1FTWX31556E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/14/2011",
        "dateOfIncident": "07/11/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10430267,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY TRUCK STARTING LOSING POWER LITTLE BY LITTLE OVER A SHORT PERIOD OF TIME. THE CHECK ENGINE LIGHT CAME ON & I TOOK IT TO THE FORD DEALERSHIP.THEY ADVISED ME THAT THE EGR SYSTEM WAS FAILING & THE COST IS $2500.00. THEY ALSO TOLD ME THAT FORD KNEW ABOUT THE PROBLEM & SHOULD HAVE RECALLED THIS PROBLEM..NOW I CAN'T DRIVE MY TRUCK WITHOUT WORRYING ABOUT ENGINE FAILURE (UNTIL IT'S FIXED)..INTERSTATE TRAVEL IS JUST ABOUT NON=EXISTENT FOR NOW..I WILL NOT LET MY WIFE DRIVE IT ANYMORE FOR NOW...THIS TRUCK ONLY HAS 75,000 MILES ON IT & FOR NOW IS NOT SAFE TO DRIVE ANYWHERE BUT SHORT DISTANCES...  *TR",
        "vin": "1FTWX31P16E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/12/2011",
        "dateOfIncident": "09/01/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10429644,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F350.  THE CONTACT NOTICED THAT THE WRENCH INDICATOR SYMBOL ILLUMINATED ON THE INSTRUMENT PANEL.  THE CONTACT TOOK THE VEHICLE TO THE DEALER WHERE SHE WAS INFORMED THAT THE ERG VALVE HAD FAILED AND NEEDED TO BE REPLACED.  THE MANUFACTURER WAS AWARE OF THE FAILURE.  THE CONTACT WAS AWAITING REPAIRS.  THE CURRENT AND FAILURE MILEAGES WERE 90,000.",
        "vin": "1FTWW31P26E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/26/2011",
        "dateOfIncident": "07/15/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10427175,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-350. WHILE DRIVING APPROXIMATELY 65 MPH THE CONTACT SMELLED A STRONG ANTI FREEZE ODOR IN THE VEHICLE. THE VEHICLE OVER HEATED AND STALLED. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSTIC TESTING. THE TECHNICIAN STATED THE  EXHAUST GAS RECIRCULATION SYSTEM HAD TO BE REPLACED. AFTER THE VEHICLE WAS REPAIRED THE FAILURE CONTINUED. THE FAILURE OCCURRED THREE TIMES. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 110,000.",
        "vin": "1FTWW31P16E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "09/16/2011",
        "dateOfIncident": "06/01/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10425750,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-350 DIESEL.  THE CONTACT STATED THAT THE FUEL TANK WAS RUSTING DUE TO A FAULTY COATING ON THE INSIDE OF THE TANK.  NEITHER THE DEALER NOR THE MANUFACTURER WERE NOTIFIED OF THE FAILURE.  THE VEHICLE WAS IN THE PROCESS OF BEING REPAIRED.  THE FAILURE MILEAGE WAS 60,000 AND THE CURRENT MILEAGE WAS 61,000. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/01/2011",
        "dateOfIncident": "07/26/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10422936,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-350.  THE CONTACT STATED THAT THE VEHICLE WOULD STALL AT ANY TIME WITHOUT WARNING.  THE DEALER DIAGNOSED THAT THE FUEL TANK WAS RUSTED FROM THE INSIDE.  THE VEHICLE WAS NOT REPAIRED.  THE MANUFACTURER WAS NOT CONTACTED.  THE FAILURE MILEAGE WAS 21,000 AND THE CURRENT MILEAGE WAS 24,500.",
        "vin": "1FDWF37P76E"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/14/2011",
        "dateOfIncident": "07/14/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10412372,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 FORD F350 EXPERIENCE EXTREMELY VIOLENT SHAKING WHEN DRIVING 45 PLUS MPH AND HIT ANY TYPE BUMP. SHAKING IS SO VIOLENT STEERING IS NOT CAPABLE AND BRAKING ONLY MAKES SHAKING WORSE. I'VE CONTACTED DEALER AND THEY SAID THEY REPLACED A BUSHING BUT PROBLEM PERSISTED. THEY HAVE NOT CORRECTED THE PROBLEM. VEHICLE IS BASICALLY OUT OF CONTROL WHEN THIS HAPPENS. LAST DATE OF OCCURRENCE IS JULY 14,2011 AND THIS PROBLEM HAS PERSISTED SINCE TRUCK WAS PURCHASED NEW FROM DEALER. TRUCK HAS NO LIFT AND IS STOCK MODEL.  PLEASE HELP!  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/26/2011",
        "dateOfIncident": "05/23/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10402808,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD F-350. THE CONTACT STATED WHILE DRIVING APPROXIMATELY 60 MPH THE VEHICLE BEGAN TO SHAKE VIOLENTLY ON THE FRONT END. THE VEHICLE WAS NOT INSPECTED BY A DEALER NOR WAS IT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 134,800.",
        "vin": "1FDWF36Y26E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/12/2011",
        "dateOfIncident": "05/15/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10403449,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TRAILER BREAK CONTROLLER FAULTY, REPLACE EGR AND INJECTORS.  3/31/09~ REPLACE EGR COOLER, GASKET, FUEL FILTERS.  6/8/10~ ICP SENSOR & CONNECTOR FAULTY, CAC HOSE LEAKING, INJECTORS FAULTY, EGR VALVES CHANGED. 6/25/10~ 17 DAYS LATER BACK AGAIN IN SHOP FOR SAME ISSUE. TRUCK RUNS THEN WHEN YOU STOP THE TRUCK IN HOT WEATHER, IT WILL NOT RESTART FOR ABOUT 1 HOUR. TRUCK NEEDS TO COOL DOWN BEFORE RESTARTING. AND NO ONE CAN FIGURE OUT WHAT PROBLEM IS AND FIX IT CORRECTLY.",
        "vin": "1FTWW33P26E"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/04/2011",
        "dateOfIncident": "04/02/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10394247,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "FORD F350 DEATH SHAKE HAS HAPPENED MULTIPLE TIMES TRUCK HITS BUMP OR POT HOLE REGARDLESS OF SPEED (BUT SHAKE IS WORSE OVER 40 MPH)AND STARTS A VERY DANGEROUS SHAKE THAT GETS WORSE UNTIL THE WHOLE TRUCK IS OUT OF CONTROL. BRAKING HARD TO STOP WILL STOP IT BUT ACCIDENT SEEMS TO BE AROUND THE CORNER. I HAVE TAKEN TO DEALER AND TIRE SHOP THEY SAY NOTHING WRONG. *TR",
        "vin": "1FTWW31P36E"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/02/2011",
        "dateOfIncident": "02/02/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10379945,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD F-350. THE CONTACT STATED THAT THE STEERING WHEEL SHOOK WHILE DRIVING AT ANY SPEED. THE SHAKING WOULD WORSEN WHEN DRIVING OVER BUMPS AND AROUND TURNS. THE FAILURE OCCURRED INTERMITTENTLY. THE VEHICLE WAS NOT TAKEN TO HAVE THE FAILURE DIAGNOSED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 80,000 AND THE CURRENT MILEAGE WAS 103,000. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/01/2011",
        "dateOfIncident": "01/01/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10380530,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS A COMPANY VEHICLE DRIVEN BY SEVERAL DIFFERENT EMPLOYEES. MANY OF THESE DRIVERS HAVE COMPLAINED OF A SUDDEN VIOLENT SHAKING OF THE VEHICLE WHILE AT HIGHWAY SPEEDS, USUALLY AFTER HITTING A BUMP IN THE ROAD, EXPANSION JOINT, ETC. THIS SHAKING WILL ONLY STOP BY LOWERING SPEED SOMETIMES TO AS LOW AS 10 MPH. WE HAVE TAKEN THE VEHICLE TO A LOCAL FORD DEALERSHIP MULTIPLE TIMES WITH NO SUCCESS IN SOLVING THE PROBLEM. THEY EVEN ADVISED US TO INSTALL AIRBAGS TO THE REAR SUSPENSION TO DISTRIBUTE WEIGHT TO THE FRONT OF THE VEHICLE WHEN LOADED. WE ARE CURRENTLY ON OUR FOURTH SET OF QUALITY E-RATED TIRES (RECOMMENDED TIRE PRESSURE IS MAINTAINED) BUT ARE STILL EXPERIENCING THE PROBLEM.",
        "vin": "1FTWW33P16E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/27/2011",
        "dateOfIncident": "01/03/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10379301,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD F-350 SUPER DUTY. THE CONTACT STATED THAT WHILE DRIVING 35 MPH, HE NOTICED SMOKE BEING EMITTED FROM THE TAILPIPE. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHO STATED THAT THE HEAD GASKET HAD BLOWN AND THE GASKET, EGR, AND OIL COOLANT NEEDED TO BE REPLACED. THE CONTACT CALLED THE MANUFACTURER WHO OFFERED NO ASSISTANCE. THE FAILURE MILEAGE WAS 69,338.",
        "vin": "1FTWW33P36E"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/04/2011",
        "dateOfIncident": "01/03/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10374098,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "APPROXIMATELY 1 MONTH AGO I PURCHASED A 2006 FORD F350 SUPER DUTY.WHILE TRAVELING ALONG HIGHWAYS 45-65MPH, AFTER HITTING A ROUGHER PORTION OF THE ROAD, THE FRONT WHEELS BEGIN TO HOP/SHAKE IN A HIGHLY UNSAFE MANNER TO WHICH THE VEHICLE IS ALMOST UNCONTROLLABLE. THIS HAPPENS ALMOST EVERYTIME I TRAVEL ON THE HIGHWAYS WHICH IS EVERYDAY. I HAVE RESEARCHED THIS ISSUE QUITE EXTENSIVELY ONLINE IN SUCH FORUMS AS THIS. MANY HAVE TRIED REPLACING PARTS BUT IT SEEMS TO BE A MANUFACTURING DEFECT. I WANTED TO MAKE SURE NOTHING WAS OUT OF THE ORDINARY BEFORE I WASTE HUNDREDS OR THOUSANDS OF DOLLARS TRYING TO FIX. SAFETY IS OF THE MAIN CONCERN FOR MYSELF AND ESPECIALLY OTHERS ON THE ROAD DUE TO THE SIZE OF THE VEHICLE. I HAVE CONTACTED A LOCAL REPUTABLE FORD DEALER AND THEY INFORMED ME THAT THERE ARE NO RECALLS AS OF TODAY JANUARY 4 2011. *TR",
        "vin": "1FTWW31P86E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/31/2010",
        "dateOfIncident": "11/12/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10373623,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2006 FORD CREW CAB POWERSTROKE TURBO DIESEL HAS AN ENGINE OIL COOLER AND EGR/EGR COOLER PROBLEMS THAT KEEPS THE TRUCK FROM FULL POWER UP HILLS AND WITH LOADS. EXTREMELY DANGEROUS PULLING TRAILER UP GRADE'S, IT LOSES POWER, BLOWS WHITE SMOKE AND BECOMES UNSTABLE. THE TEMP. BETWEEN THE OIL COOLER AND THE EGR COOLER SHUTS DOWN THE TRUCKS COMPUTER, LEAVING THE TRUCK INOPERABLE. COSTS TO REPAIR  $6793. WHY HAS THERE BEEN NO RECALL ON THIS ISSUE  I'M STARTING TO SEE THERE ARE MANY OTHER COMPLAINS ON THIS ENGINE DESIGN ARE YOU WAITING FOR SOMEONE TO BE KILLED BEFORE YOU DO SOMETHING? *TR",
        "vin": ""
    },
    {
        "components": "STEERING,SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/16/2010",
        "dateOfIncident": "10/20/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10366396,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD F-350 HEAVY DUTY. THE CONTACT STATED THAT THERE WERE FOUR BOLTS ATTACHED TO THE ENGINE THAT CONTROLLED BRAKES AND STEERING. WHILE DRIVING AT APPROXIMATELY 5 MPH, HE ATTEMPTED TO BRAKE AND WAS UNABLE TO SLOW DOWN; HE WAS ALSO UNABLE TO STEER. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALERSHIP WHERE THE CONTACT WAS INFORMED THAT THE FOUR BOLTS BROKE AND CAUSED THE FAILURE. THE FOUR BOLTS WERE REPLACED AT THE DEALERSHIP. THE CONTACT CALLED THE MANUFACTURER WHO OFFERED NO ASSISTANCE. THE VIN WAS UNAVAILABLE. THE CURRENT MILEAGE WAS APPROXIMATELY 36,000. THE FAILURE MILEAGE WAS APPROXIMATELY 35,000.",
        "vin": ""
    },
    {
        "components": "SUSPENSION,TIRES",
        "crash": false,
        "dateComplaintFiled": "10/28/2010",
        "dateOfIncident": "10/26/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10362821,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Michelin North America, Inc.",
                "productMake": "BFGOODRICH",
                "productModel": "LAND TERRAIN",
                "productYear": "9999",
                "size": "P235/75R15",
                "type": "Tire"
            }
        ],
        "summary": "1. TRAVELING AT 65 MPH HITTING A BUMP IN THE ROAD  2. FRONT AXLE BEGINS OSCILLATING WITH SUCH VIOLENCE THAT CONTROL OF THE TRUCK IS DIFFICULT UNTIL SLOWED DOWN, THE ENTIRE VEHICLE SHAKES TO THE POINT YOU FEEL IT WILL COME APART. I WAS TRAVELING ON A HIGHWAY WHEN I EXPERIENCED THIS. I NEARLY CAUSED AN ACCIDENT. I'M TERRIFIED WHEN THIS WILL HAPPEN ON A ICY ROAD. SOMEONE IS GOING TO GET KILLED.  3. NOTHING. APPARENTLY THERE IS NO FIX AS IT IS UNKNOWN. FORD IS AWARE OF THE PROBLEM BUT REFUSES TO BE HELD RESPONSIBLE.     VEHICLE INFORMATION:  ? 2006  ? FORD  ? F350  ?? ENTIRE FRONT SUSPENSION COMPONENT  ? VIN - [XXX]  ? TIRES BFG ALL TERRAIN 325/65 R18.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *TR",
        "vin": "1FTWW31P86E"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/30/2010",
        "dateOfIncident": "09/28/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10358378,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE AN '06 F-350.  AT 55MPH+, HITTING A BUMP WILL ALMOST CAUSE THE TRUCK TO SELF DESTRUCT.  THE STEERING WHEEL SHAKES VIOLENTLY.  FORD SEEMS TO NOT BE ABLE TO FIX THE ISSUE.  PLEASE FORCE A RECALL BEFORE PEOPLE ARE KILLED. *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/22/2010",
        "dateOfIncident": "05/17/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10356965,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F350.  THE CONTACT STATED THAT THE BATTERIES IN THE VEHICLE KEEP GOING DEAD AND THE ALTERNATOR IS ALSO DEFECTIVE.  THE DEALER CANNOT FIND THE FAILURE BUT THE OWNER THINKS THE FAILURE IS AN ELECTRICAL SHORT.  THE VEHICLE HAD NOT BEEN REPAIRED.  THE MANUFACTURER HAD BEEN NOTIFIED BUT DID NOT OFFER ANY ASSISTANCE.  THE FAILURE AND CURRENT MILEAGE WAS APPROXIMATELY 100,000.",
        "vin": "1FTWW31P06E"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/20/2010",
        "dateOfIncident": "09/17/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10356553,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-350 DIESEL SD. THE CONTACT STATED THAT THE BRAKES WOULD NOT OPERATE PROPERLY WHEN HAULING A FOREST RIVER CEDAR CREEK RV TRAILER. THE CONTACT STATED THAT THE DEALER COULD NOT REPAIR THE VEHICLE BUT A CERTIFIED MECHANIC WAS ABLE TO REPLACE THE PRODIGY. THE FAILURE WAS CORRECTED. THE FAILURE AND CURRENT MILEAGE WAS 44,504.  THE CONSUMER PURCHASED THE VEHICLE WITH A FACTORY INSTALLED TOWING PACKAGE TO PULL HIS 5TH WHEEL TRAVEL TRAILER. THE CONSUMER THEN PURCHASED A NEW 5TH WHEEL TRAVEL TRAILER THAT WAS EQUIPPED WITH FACTORY INSTALLED  BRAKE CONTROLLER FOR THE TRAILER. THE CONSUMER SOON DISCOVERED THAT THE TOWING PACKAGE FOR THE F-350  DID WORK WHEN APPLYING THE BRAKE WHEN TOWING THE TRAVEL TRAILER.  THE CONSUMER STATED THE FACTORY INSTALLED BRAKE SYSTEM ONLY WORKED WHEN IT WAS APPLIED MANUALLY, WHEN TRYING TO AVOID AN ACCIDENT OR STOP SUDDENLY.  UPDATED 06/22/11",
        "vin": "1FTWW32P46E"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/08/2010",
        "dateOfIncident": "09/08/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10354463,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD F-350. AFTER REFUELING THE VEHICLE HE ATTEMPTED TO START THE VEHICLE BUT IT WOULD NOT START. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHERE THE FUEL FILTER AND EGR VALVE WERE REPLACED. THE FAILURE CONTINUED TO RECUR EACH TIME HE ATTEMPTED TO START THE VEHICLE. THE VEHICLE WAS TAKEN BACK TO ANOTHER AUTHORIZED DEALER WHERE THEY WERE UNABLE TO DIAGNOSE THE FAILURE; THEREFORE, IT WAS NOT REPAIRED. HE ALSO STATED THAT WHITE SMOKES WAS COMING OUT OF THE EXHAUST PIPE. THE FAILURE MILEAGE WAS UNKNOWN AND THE CURRENT MILEAGE WAS 33,000.",
        "vin": "1FTWX31P26E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/03/2010",
        "dateOfIncident": "02/01/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10353702,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD SUPERDUTY. THE EXHAUST MANIFOLD LEAKED INTO THE ENGINE MADE A NOISE GIVES AN ODOR THAT MADE THE CONTACT NAUSEOUS. THE VEHICLE WAS TAKEN TO THE DEALER NUMEROUS TIMES FOR THE FAILURE. THE DEALER DIAGNOSIS  STATED THAT THE EXHAUST MANIFOLD AND STUD WERE INSTALLED INCORRECTLY WHICH CAUSED THE GASKET TO FAIL.  THE MANUFACTURER STATED THAT THE WARRANTY WAS NO LONGER VALID; THEREFORE THEY WOULD NOT ASSIST WITH THE REPAIR. THE FAILURE MILEAGE WAS 3,000 AND THE CURRENT MILEAGE WAS 66,000.",
        "vin": "1FTSW21516E"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "08/18/2010",
        "dateOfIncident": "05/01/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10350462,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT CENTER SEAT BACK HAS FAILED DUE TO CRACK IN PLASTIC BODY STRUCTURE. RESULTS IS THE BACK REST IS NOT SUPPORTING CENTER PASSENGER BACK PROPERLY. *TR",
        "vin": "1FTWW31P66E"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/23/2010",
        "dateOfIncident": "06/10/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10339629,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2006 FORD F350 SUPER DUTY TRUCK I PURCHASED NEW AND AFTER 40,000 MILES I NOTICES ONCE THE FRONT END SHOOK SO BAD I ALMOST CRASHED .  I THOUGHT IT WAS THE ROAD BUT A MONTH LATER IT HAPPENED AGAIN.  I TOOK IT TO THE FORD DEALER  AND THEY SAID THEY COULD DO AN ALIGNMENT AND ALSO REPLACE THE STEERING STABILIZER.  AFTER ABOUT $600 IT HAPPENED 2 MORE TIMES .  IT IS SUCH A BAD SHAKE WHEN YOUR GOING ABOUT 60-65 YOU COULD RESULT IN A SERIOUS ACCIDENT . SOMETHING NEEDS TO BE DONE.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/16/2010",
        "dateOfIncident": "06/15/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10336691,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS IN REFERENCE TO ODI #10336687 FILED ON 6/16, 2010 CONCERNING \"WHEEL SHIMMY\" ON FORD F 350 TRUCKS.  AFTER READING \"DEFECT INVESTIGATIONS\" CONCERNING THIS TOPIC, THE NHTSA SUMMARY WAS THAT IT SEEMED THAT THE PROBLEM WAS CAUSED BY UNDERINFLATED TIRES.  IT APPEARS THAT THE NHTSA AND FORD, JUST LIKE BP OIL AND THE MINERAL DEPARTMENT ARE GREASING EACH OTHERS PALMS. FOR A SAFETY ARM OF THE GOVT. TO SAY THAT THIS IS A TIRE PRESSURE PROBLEM IS BULL!  PLEASE CHECK OUT WWW.TOPIX.COM/FORUM/AUTOS/FORD-F-350-SUPER-DUTY AND READ HUNDREDS OF POSTS WITH THE SAME PROBLEM.  WHAT IS IT GOING TO TAKE, ANOTHER OIL SPILL LIKE BP HAS CREATED, CRASHES WITH DEATHS LIKE TOYOTA IS RESPONSIBLE FOR?  I CAN SEE THAT IT IS USELESS TO REPORT THIS. *TR",
        "vin": "1FTWW33P56E"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/16/2010",
        "dateOfIncident": "06/15/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10336687,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2006 FORD F  350 SUPERDUTY 1 TON PICKUP WITH APPROXIMATELY 40,000 MILES.  I HAVE EXPERIENCED WHAT IS CALLED \"DEATH WOBBLE\" WHEN HITTING A BUMP, CROSSING RAILROAD TRACKS OR GOING OVER A ROUGH ROAD.  THE STEERING WHEEL WILL SHAKE VIOLENTLY AT SPEEDS FROM 30-60+ CAUSING A POTENTIAL LOSS OF CONTROL.  FORD HAS SENT OUT A MEMO STATING THAT \"YOU NEED TO CHECK YOUR TIRE PRESSURE\".  I HAVE READ HUNDREDS OF SIMILAR COMPLAINTS ON THE INTERNET DATING BACK SEVERAL YEARS INTO THE 1990'S.  FORD REFUSES TO DO ANYTHING ABOUT IT AND FROM WHAT I HAVE READ ON THE INTERNET, TRYING TO FIND A FIX FOR THE PROBLEM, MANY HAVE HAD REALLY BAD SAFETY ISSUES INCLUDING ACCIDENTS INVOLVING WOMEN DRIVERS WITH CHILDREN AS PASSENGERS. *TR",
        "vin": "1FTWW33P56E"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "05/26/2010",
        "dateOfIncident": "04/10/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10332404,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD F-350. THE CONTACT STATED THAT WHILE DRIVING AT 50 MPH ON APRIL 10, 2008, THE LEFT DRIVER SIDE WHEEL VIBRATED VIOLENTLY. THE CONTACT HAD TO APPLY THE BRAKES TO SLOW THE VEHICLE DOWN. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALERSHIP WHERE HE WAS INFORMED THAT THE RIMS WERE DEFECTIVE. THE RIMS AND TIRES WERE REPLACED AND A FRONT END ALIGNMENT WAS PERFORMED. THE FAILURE CONTINUED TO OCCUR. THE CONTACT CALLED THE MANUFACTURER WHO STATED THAT THE VEHICLE WAS NO LONGER UNDER WARRANTY. THE FAILURE MILEAGE WAS APPROXIMATELY 33,000. THE CURRENT MILEAGE WAS APPROXIMATELY 92,000.",
        "vin": "1FTWW33PX6E"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/09/2010",
        "dateOfIncident": "04/06/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10324672,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F350. WHILE DRIVING AT A SPEED OF  60 MPH, THE ENGINE STALLED WITHOUT WARNING. THE CONTACT WAS ABLE TO PULL OVER TO THE SHOULDER OF THE ROAD AND WAS ABLE TO RESTART THE VEHICLE WITHIN MINUTES. THE DEALER ADVISED THE FUEL TANK WAS DEFECTIVE AND WOULD NEED TO BE REPLACED. THIS WAS THE FIRST INCIDENT OF THE FAILURE. THE VEHICLE WAS LEFT IN POSSESSION OF THE DEALER FOR REPAIRS. THE FAILURE MILEAGE WAS 57,390 AND THE CURRENT MILEAGE WAS 57,400.",
        "vin": "1FDWW36P26E"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/03/2010",
        "dateOfIncident": "02/23/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10316030,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY AIRBAG DID NOT DEPLOY DURING A COLLISION. MY 2006 F350 TRUCK WAS STRUCK (T-BONE STYLE) BY A 1998 TOYOTA ?CAMRY. THE TOYOTA WAS OUT OF CONTROL, SLIDING SIDEWAYS AT SPEED, AND SLAMMED INTO THE TRUCK. THE DRIVER'S DOOR OF THE TOYOTA WAS LEFT IMPALED UNDER MY FRONT BUMPER. DAMAGE TO THE FRONT END OF THE TRUCK WAS EXTENSIVE FROM THE AREA OF THE DRIVER'S SIDE WHEEL WELL THROUGH TO PAST THE CENTER LINE OF THE FRONT BUMPER. THE TRUCK IS JUST GOING IN TO THE BODY SHOP TODAY. INITIAL ESTIMATE OF DAMAGES IS $8700, ALTHOUGH THEY EXPECT TO FIND PROBLEMS WITH THE SUSPENSION/FRAME WHEN THEY GET UNDER THE VEHICLE. PERSONAL INJURIES: I HIT THE WHEEL, SUSTAINING BRUISING TO MY CHEST, R SHOULDER MUSCULAR INJURIES, AND WHIPLASH INJURY TO MY NECK. CHEST X-RAYS, SHOULDER X-RAYS, AND CT SCAN OF MY NECK SHOW NO BONE INJURIES, HOWEVER, AT 1 WEEK, I'M STILL TAKING QUITE A BIT OF PAIN AND MUSCLE RELAXING MEDS AND AM NOT ABLE TO COMPLETE MY DAILY WORK. I AM SELF EMPLOYED. *TR",
        "vin": "1FTSX31PX6E"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/25/2010",
        "dateOfIncident": "02/25/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10314061,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 200AM TODAY MY HORN ON MY 2006 F 350 STARTED BLOWING. BY THE TIME I REALIZED WHAT WAS GOING ON THE WIRES HAD STARTED TO SMOKE UNDER THE HOOD.  I HAD TO DISCONNECT BOTH BATTERIES IN ORDER FOR THE HORN TO STOP.  THIS IS THE FIRST TIME THIS IS HAS HAPPENED TO THIS TRUCK.  NO OTHER PROBLEMS TO REPORT AT THIS TIME.  I WILL BE HAVING IT TOWED TO A DEALER TODAY",
        "vin": "1FTWW33P16E"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/01/2009",
        "dateOfIncident": "11/30/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10294097,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 FORD F350 SUPERDUTY DIESEL DRIVING ON THE FWY MAKING A CURVE ABOUT 55MPH THE FRONT END STARTS TO HOP VIOLENTLY AND BOUNCING. ALMOST LOST CONTROL DUE TO OTHER CARS ON THE ROAD. I HAD TO APPLY MY BRAKES ON THE FWY IN A VERY UNSAFE MANNER AND LOCATION CAUSING CAR BEHIND ME TO VEER OFF IN MANY DIRECTIONS AS I CAME TO A HALT.  THIS LOSS OF CONTROL HAPPENED ABOUT A DOZEN TIMES NOW IN THE LAST 2YEARS WITH ALWAYS THE SAME SITUATION FWY SPEEDS AND ANY TYPE OF BUMP IN THE ROAD SURFACE. HAPPENED ON UPHILL CURVES AS WELL AS FLAT OR DOWN HILL CURVES. A LESSER OF DRIVER MAY FAIL TO MAKE PROPER ADJUSTMENTS WHICH I SURE WILL LEAD TO A CRASH OR WORSE A DEATH. *TR",
        "vin": "1FTWW31P16E"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "12/01/2009",
        "dateOfIncident": "11/01/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10294150,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2006 FORD F350 PURCHASED OCTOBER 2005. WHILE DRIVING AT SPEEDS  LESS THAN 45 MPH AND TOWING A 30 FOOT TRAILER IN LIGHT SNOW, THE STEERING WHEEL SUDDENLY TURNED TO THE RIGHT. HE ATTEMPTED TO TURN THE STEERING WHEEL BACK TO THE STRAIGHT POSITION, BUT IT TURNED IN A FULL 365 DEGREE TURN WITHOUT INTERFERENCE OF THE DRIVER. HE ATTEMPTED TO ADJUST THE WHEEL HOWEVER THE TIRES WOULD NOT RESPOND. THE DRIVER THEN CRASHED INTO THE MEDIAN AND WAS TURNED APPROXIMATELY 180 DEGREES. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THEY STATED THEY HAVE SEEN THIS TYPE OF FAILURE ON HIS YEAR, MAKE AND MODEL NUMEROUS TIMES. THEY ALSO FOUND THAT THE  STEERING BOX IN THE VEHICLE WAS MANUFACTURED WITH THE STEERING BOX DESIGNED FOR THE F450 MODEL AS OPPOSED TO THE F350 MODEL. THE HIGHWAY PATROL ARRIVED TO THE SCENE SHORTLY AFTER AND A REPORT WAS FILED. THE FAILURE MILEAGE WAS 30,000. THE CURRENT WAS 31,000.",
        "vin": "1FTWW31P66E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "11/24/2009",
        "dateOfIncident": "11/09/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10293340,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "F-350 EGR COOLER WENT BAD AND SMOKED UP ENTIRE NEIGHBORHOOD.  OTHER MOTORISTS COULD NOT SEE AS THE SMOKE EMITTED FROM MY F-350 WAS LIKE A VERY VERY THICK FOG.  I CONTACTED FORD, WHO KNOWS ABOUT THE ONGOING AND EXTENSIVE PROBLEM, BUT THEY REFUSE TO DO ANYTHING BUT \"DOCUMENT\" THE PROBLEM AND WANT  NHTSA TO MAKE IT A RECALL.  APPARENTLY THERE ARE A LOT OF OTHER F-350 OWNERS WITH THE SAME PROBLEM.  THIS IS VERY DANGEROUS.  I'M NOT SURE IF THE FUMES THAT ARE EMITTED FROM THIS PROBLEM ARE SAFE EITHER. *TR",
        "vin": "1FTWW31P06E"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/13/2009",
        "dateOfIncident": "02/17/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10287227,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2006 FORD F350. WHILE DRIVING BETWEEN 40 TO 60 MPH AND WHEN HITTING BUMPS ON THE ROAD THE FRONT END OF THE VEHICLE ALONG WITH THE STEERING COLUMN SHIMMIES. AROUND MAY SHE RECEIVED A NOTICE ABOUT VEHICLE VIBRATION . THE DEALER WAS CONTACTED AND A TECHNICIAN CONCLUDED THAT 4- WHEEL ALIGNMENT WAS NEEDED AS WELL AS A STEERING DAMPNER.   UPDATED.  THE FAILURE MILEAGE WAS 24200. THE CURRENT MILEAGE WAS 42500.  UPDATED 11/04/09. *LJ  UPDATED 11/05/09",
        "vin": "1FTWW33P26E"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/31/2009",
        "dateOfIncident": "08/10/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10282412,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2006 F350 4X4 XLT AND WHEN I HIT A BUMP AT OVER 55MPH THE FRONT SHAKES AND FEELS LIKE IT IS COMING OFF.  I KNOW THIS IS A PROBLEM THAT NUMEROUS SUPER DUTY OWNERS HAVE.  I HAVE DONE EXTENSIVE RESEARCH AND KNOW THAT THIS HAS CAUSED SERIOUS INJURY AND I AM SURE DEATH. *TR",
        "vin": "1FTWW31526E"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/24/2009",
        "dateOfIncident": "06/01/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10281566,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD F350 CREW CAB 4X4 WHICH WAS PURCHASED IN 2005. WHILE DRIVING APPROXIMATELY 25 MPH, THE CONTACT LOST STEERING CONTROL WHEN THE STEERING WHEEL BEGAN SHAKING EXCESSIVELY. THE MANUFACTURER STATED THAT THEY WERE AWARE OF THE FAILURE. THE MANUFACTURER ALSO CONFIRMED THAT THERE WERE NO RELATED RECALLS; HOWEVER, THERE WERE TECHNICAL SERVICE BULLETINS. THE FRONT END OF THE VEHICLE WAS REPLACED AS WELL AS PREVIOUS REPAIRS WERE PERFORMED TO CORRECT THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 10,000 AND THE CURRENT MILEAGE WAS 29,000.",
        "vin": "1FTWW33P46E"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/17/2009",
        "dateOfIncident": "08/17/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10280681,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED NEW A 2006 F350 4X4 3 YEARS AGO. I HAVE HAD NUMEROUS (SO THERE ARE MANY DATES THIS HAS OCCURRED) LEFT FRONT END DEATH WOBBLES WHEN TAKING A SWEEPING TURN TO THE LEFT AT ABOUT 70 MPH ON A FREEWAY WITH SOME BUMPS UNDER THE LEFT FRONT TIRE. THIS WOBBLE IS SO BAD THAT I HAVE TO IMMEDIATELY SLOW THE VEHICLE TO ALMOST 30 MPH ON THE FREEWAY FOR IT TO GO AWAY. I HAVE TAKEN THIS TRUCK IN TO THE DEALER SEVERAL TIMES FOR THIS WOBBLE TO NO AVAIL.  I HAVE ROTATED TIRES AND MADE SURE THE TIRES ARE INFLATED PROPERLY BY THE DEALER.  TIRE INFLATION DOES NOT RESOLVE THIS ISSUE.  AFTER PROPER INFLATION BY THE DEALER AND CHECKED BY ME, I STILL GET THE \"DEATH WOBBLE\".    RECENTLY, I RECEIVED A GENERIC LETTER FROM FORD ACKNOWLEDGING THE FACT THAT THIS ISSUE IS NOT UNCOMMON AND THAT I SHOULD MAKE SURE MY TIRES ARE INFLATED PROPERLY. I HAVE DONE THIS SEVERAL TIMES.  I HAVE NOW SEARCHED THE INTERNET AND FIND THAT THIS PROBLEM IS NOT UNCOMMON. I NEED TO KNOW HOW TO GET THIS PROBLEM FIXED.  IT IS DANGEROUS TO ME AND MY FAMILY. *TR",
        "vin": "1FTWW33P96E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "06/24/2009",
        "dateOfIncident": "06/22/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10274803,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 F-350 HAVING FUEL TANK LINER FAILURE PROBLEMS. *TR",
        "vin": "1FDWW36P06E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "06/18/2009",
        "dateOfIncident": "04/15/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10274257,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 FORD F-350 FUEL TANK LINER FAILURES.  TANK LINER COMING APART CAUSING THE FUEL TANK NEEDING TO BE RELINED, AND REPLACING THE FUEL PUMP AND FUEL FILTER. *TR",
        "vin": "1FDWW36P06E"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/05/2009",
        "dateOfIncident": "09/13/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10272981,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD F-350.  WHILE DRIVING APPROXIMATELY 65 MPH, THE VEHICLE DROVE OVER A BUMP IN THE ROAD.  THE STEERING WHEEL VIBRATED AND SHIMMIED SEVERELY.  THE VEHICLE BEGAN TO VEER ACROSS THE ROAD WITHOUT ASSISTANCE.  THE FAILURES OCCURRED WHENEVER THE VEHICLE TRAVELED OVER ROUGH ROAD SURFACES.  THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC FOR INSPECTION AND THEY STATED THAT THE FRONT SUSPENSION WAS FAULTY DUE TO A MANUFACTURER DESIGN DEFECT.  THE MANUFACTURER WAS NOTIFIED, BUT DID NOT ASSIST.  THE CONTACT WAS ADVISED TO CHECK THE TIRE INFLATION PRESSURE.  THE CONTACT IS IN THE PROCESS OF TAKING THE VEHICLE TO AN AUTHORIZED DEALER.  THE FAILURE MILEAGE WAS 42,000 AND CURRENT MILEAGE WAS 57,000. UPDATED 07/17/09. *LJ  UPDATED 07/20/09.*JB",
        "vin": "1FTWW31P36E"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/19/2009",
        "dateOfIncident": "05/14/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10269346,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "EXCESSIVE FRONT END SHIMMY ON OCCASION WITH MY FORD F350 4X4.  I HAVE RECEIVED A LETTER FROM FORD DISCUSSING THIS ISSUE.  THE FIRST TIME THE PROBLEM OCCURRED, MY TIRE PRESSURE WAS LOW AND SUBSEQUENTLY MAINTAINING PROPER TIRE PRESSURE SEEMED TO PREVENT THE PROBLEM FOR A WHILE.  HOWEVER, RECENTLY I HIT SOME BUMPS WHILE TRAVELING ON THE HIGHWAY AT A SPEED OF APPROXIMATELY 65 MPH AND THE FRONT END BEGAN TO SHIMMY VERY VIOLENTLY.  I KNEW TO HIT THE BRAKES TO REGAIN CONTROL OF THE STEERING, BUT I HAD TO STAY ON MY BRAKES UNTIL I SLOWED TO APPROXIMATELY 40 MPH BEFORE I COULD REGAIN CONTROL OF THE STEERING WHEEL.  I CALLED A LOCAL FORD SERVICE CENTER, BUT THEY SAID THEY WOULD \"ONLY BE GUESSING\" AT THE PROPER WAY TO FIX THE PROBLEM.  I THEN CALLED FORD CUSTOMER SERVICE TO DISCUSS THE ISSUE, AS I AM NERVOUS ABOUT RIDING ON THE HIGHWAY WITH THE VEHICLE.   THEY SUGGESTED THAT I CALL SEVERAL SERVICE CENTERS UNTIL I FIND ONE THAT HAS EXPERIENCE WITH TRYING TO FIX THIS PARTICULAR PROBLEM.  I HAVE DONE THAT AND I HAVE MADE AN APPOINTMENT FOR SERVICE TOMORROW.  THE REASON FOR MY WRITING THIS COMPLAINT IS THAT THE LAST OCCURRING WAS SO SEVERE, THAT I WAS AFRAID OF CAUSING AN ACCIDENT DUE TO THE QUICK DECELERATION I WAS FORCED INTO IN ORDER TO REGAIN STEERING CONTROL OF THE VEHICLE. *TR",
        "vin": "1FDWX37Y86E"
    },
    {
        "components": "STEERING,SERVICE BRAKES, HYDRAULIC,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/15/2009",
        "dateOfIncident": "05/15/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10268818,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FORD F-350 TRUCK I BOUGHT IS DEFECTIVE, AS EVIDENCED BY THE 7 POWER STEERING AND BRAKE REPAIRS REQUIRED IN THE PAST 3 YEARS, ALONG WITH THE ELECTRICAL SYSTEM AND RING AND PINION REPAIR.  I HAVE CONTACTED FORD 24 TIMES, I HAVE FILED A COMPLAINT WITH THE MN BETTER BUSINESS BUREAU AND THE MN ATTORNEY GENERAL'S OFFICE.  I BELIEVE THE TRUCK WAS MANUFACTURED IN A FAULTY MANNER, AND I AM AFRAID THE TRUCK MAY BE DANGEROUS TO DRIVE.  I NEED YOUR HELP IN OBTAINING CREDIT TOWARDS A NEW TRUCK OR A NEW TRUCK DUE TO THE UNACCEPTABLE NUMBER AND TYPE OF REPAIRS REQUIRED. *TR",
        "vin": "1FTWW31P86E"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/12/2009",
        "dateOfIncident": "04/15/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10268509,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A FORD F350 DUALLY SUPER DUTY TRUCK.  FORD SENT A LETTER STATING THAT SOME DRIVERS HAVE EXPERIENCED A SEVERE STEERING WHEEL VIBRATION.  THEY SAID IT ISN'T A RECALL, JUST A NOTICE.  WE HAVE HAD TROUBLE W/THIS TRUCK DOING THIS PRIOR TO THE LETTER.  IT'S DOCUMENTED AT BRAD HOWELL FORD IN GREENTOWN IN.  AFTER RECEIVING THE LETTER WE AGAIN WENT TO BHF.  WE CALLED FORD MOTOR AND TOLD THEM, THEY SAID PUT STABILIZERS ON IT AT OUR COST.  WE DID. PLUS NEW FRONT SHOCKS.  THE PROBLEM IS STILL THERE.  IT IS EXTREMELY DANGEROUS WHEN THE VIBRATION HAPPENS.  WE HAVE TO COME TO A COMPLETE STOP SOMETIMES.  AND WE PULL TRAILERS BEHIND THE TRUCK FREQUENTLY.  NEEDLESS TO SAY, WE HAVE NOT BEEN GIVEN ANY CAUSE OR SOLUTION TO THE PROBLEM.  FORD MOTOR TOOK OUR INFORMATION, PASSED IT ON TO BHF, AND THEY INTURN SAID WE WERE RESPONSIBLE FOR PUTTING THE STEERING STABILIZERS ON.  AND THAT'S PRETTY MUCH IT.    WE HAVE TO DRIVE THE TRUCK TO TN IN 3 WEEKS, PULLING A TRAILER.  IF THIS VIBRATION OCCURS WHILE ON THE INTERSTATE WE PRAY AN ACCIDENT DOES NOT OCCUR.  I DON'T HAVE ANOTHER CHOICE FOR VEHICLES.  I FEEL THAT FORD KNOWS THERE IS A SERIOUS PROBLEM W/THE STEERING, I'VE TAKEN IT TO BHF FOR THIS PARTICULAR ISSUE PRIOR TO THE LETTER, AND STILL DRIVING A TRUCK THAT I CONSIDER UNSAFE, BUT MY ONLY OPTION.  FORD KNOWS THERE IS A PROBLEM, THEY SHOULD PROTECT THEIR CONSUMERS AND FIND OUT THE CORRECT WAY TO FIX THE PROBLEM. *TR",
        "vin": "1FDWW37Y16E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "05/02/2009",
        "dateOfIncident": "04/30/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10267565,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DIESEL FUEL TANK FAILURE ON 2006 F350 POWERSTROKE. *TR",
        "vin": "1FDWF37P16E"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/27/2009",
        "dateOfIncident": "08/20/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10266799,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 F-350 DUALLY HAS A SHIMMER OR SEVERE VIBRATION OF THE STEERING WHEEL THAT   BEGINS WHEN A BUMP OR DIP IN THE ROAD OCCURS AND DOES NOT CORRECT ITSELF.  EVEN  THOUGH THE TIRES ARE IN GOOD ORDER.  FORD MOTOR CO SAYS THERE IS NOTHING THAT CAN  BE DONE TO CORRECT THIS SITUATION.  THEIR LETTER OF NOTIFICATION IS DATED APRIL 2009. *TR",
        "vin": "1FTWW33P86E"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/27/2009",
        "dateOfIncident": "04/24/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10266842,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD F-350.  WHILE DRIVING 55 MPH, THE FRONT END OF THE VEHICLE STRUCK A BUMP AND DRIFTED FROM SIDE TO SIDE.  THE CONTACT RECEIVED A TSB REGARDING THE \"SHIMMY\" OF THE VEHICLE.  THE VEHICLE IS CURRENTLY AT A FORD DEALER FOR SUSPENSION REPAIR.  FORD DOES NOT RECOGNIZE THE FAILURE AS A SAFETY ISSUE; THEREFORE, NO RECALL HAS BEEN ISSUED.  THE CURRENT AND FAILURE MILEAGES WERE 11,000.",
        "vin": "1FDWF37556E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/07/2009",
        "dateOfIncident": "03/13/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10264326,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS A F350 KING RANCH DIESEL.  THE VEHICLE SUFFERED A SEVERE LOSS OF POWER AND WAS LIMPED IN (10 MPH) TO ROKSTAD FORD IN SANDPOINT, ID.  THEY DIAGNOSED LOW FUEL INJECTOR PRESSURE AND REPLACED THE FUEL CONTROL MODULE.  THE VEHICLE WAS DRIVEN HOME AND THE CHECK ENGINE LIGHT CAME ON.  LOW INJECTION PRESSURE WAS DIAGNOSED AND AN OIL PRESSURE LINE WAS REPLACED.  THE CHECK ENGINE LIGHT CAME BACK ON THE NEXT DAY AS WELL AS INTERMITTENT LOSS OF POWER EXPERIENCED AND LOW INJECTOR PRESSURE WAS STILL THE PROBLEM.  A SENSOR WAS REPLACED.  THE LIGHT CAME BACK ON THE SAME DAY.  THE PROBLEM HAS NOT BEEN CORRECTED. *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/24/2009",
        "dateOfIncident": "03/01/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10262891,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "HIGH PRESSURE POWER STEERING HOSE DEFECTIVE.  425 HOSES ARE ON BACK ORDER WITH FORD.  NO ESTIMATE OF WHEN A HOSE WILL BE AVAILABLE.  CUSTOMERS HAVE ALREADY BEEN WAITING 2 MONTHS. MEANWHILE I AM FILLING MY POWER STEERING RESERVOIR EVERY COUPLE OF DAYS. *TR",
        "vin": ""
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/28/2009",
        "dateOfIncident": "05/20/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10256667,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 4WD F350 DUALLY. WHILE TRAVELING AT HIGHWAY SPEEDS APPROX. 45MPH AND ABOVE AND AFTER TRAVELING OVER AN UNEVEN ROAD SURFACE OR BUMP IN THE ROAD, THE FRONT END GOES INTO AN UNCONTROLLABLE SHIMMY/OSCILLATION.  THIS CAN ONLY BE STOPPED BY PULLING OVER AND COMPLETELY STOPPING THE VEHICLE. I HAVE TAKEN THE TRUCK TO A FORD DEALERSHIP WHO CHECKED THE FRONT END AND SAID THERE WAS NOTHING WRONG W/ THE TRUCK AND THAT IT WAS A TIRE PROBLEM. I HAVE SINCE THEN BOUGHT NEW TIRES WHICH SOMEWHAT LESSENED THE PROBLEM BUT DID NOT CORRECT IT. I ALSO HAVE TAKEN THE TRUCK TO A REPUTABLE INDEPENDENT ALIGNMENT SHOP, AND THEY TOLD ME THAT THEY HAVE SEEN A LOT OF TRUCKS W/ THE SAME PROBLEM, BUT ARE UNABLE TO FIX IT DUE TO THE DESIGN OF THE FRONT END. THE INDEPENDENT SHOP SAID THERE IS TO MUCH CASTOR IN THE FRONT END AND NO WAY TO ADJUST IT. I AM NOW ON MY THIRD SET OF TIRES W/ ONLY 45000 MILES ON THE TRUCK. I BOUGHT THIS TRUCK FOR AROUND   $ 48,000.00 AND HAVE HAD THIS PROBLEM SINCE THE TRUCK HAD ABOUT 23000 MILES ON IT. I CANT EVEN DRIVE IT ON THE INTERSTATE DUE TO THE UNCONTROLLABLE FRONT END SHIMMY. THE FORD DEALERSHIP WILL NOT ACKNOWLEDGE THAT I HAVE A PROBLEM. I HAVE SEARCHED THE INTERNET AND HAVE FOUND POST AFTER POST OF PEOPLE WHO HAVE THE SAME PROBLEM WITH THEIR TRUCK AND THE LACK OF ACKNOWLEDGMENT FROM FORD. THIS IS A VERY SERIOUS PROBLEM AND TO DATE I HAVE SPENT OVER $ 1,600.00 TRYING TO REMEDY IT. I HOPE SOME ONE FROM YOUR DEPT. IS FAMILIAR W/ THIS AND COULD POSSIBLY HELP ME.    THANK YOU   STEPHEN HALL *TR",
        "vin": "1FTWW33P46E"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/05/2009",
        "dateOfIncident": "12/19/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10253789,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM HAVING A VIOLENT SHAKING (STEERING WHEEL OSCILLATION) IN MY 2006 FORD F-350 AMARILLO WITH ONLY 7K MILES.  THIS SHAKING HAS ALMOST CAUSED SEVERE INJURY AND OR DEATH AT SPEEDS OF 35-60 MPH.  THE INCIDENT OCCURS FREQUENTLY ENOUGH JUST NOT TO DRIVE THE VEHICLE ANYMORE.  I FEAR FOR MY FAMILY AND OTHERS ON THE ROAD NEAR THE TRUCK AS IT SHAKES UNTIL IS  COMPLETELY STOPPED WHEREVER IT OCCURS.  PLEASE HELP BEFORE OTHERS ARE INJURED OR KILLED! *TR",
        "vin": "1FTWW31P36E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "10/22/2008",
        "dateOfIncident": "07/30/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10246339,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A NEW 2006 FORD F-350 DIESEL TRUCK FROM MONACO FORD IN GLASTONBURY, CT.  THE VEHICLE NOW HAS 52,000 MILES AND HAS BEEN IN FOR SERVICE TWICE FOR LACK OF POWER.  THE SERVICE DEPT AT MONACO SAYS THE PROBLEM IS THAT THE GAS TANK IS DETERIORATING & THE FUEL PUMP IS COMPROMISED.  I HAVE RESEARCHED THE PROBLEM AND FOUND NUMEROUS COMPLAINTS FROM FORD OWNERS RE: THIS EXACT ISSUE.    FORD REFUSES TO TAKE RESPONSIBILITY.  THEY INSIST THAT THE PROBLEM IS FUEL, NOT THEIR PRODUCT.  I DO NOT USE BIO-DIESEL FUEL OR BUY FROM DISCOUNT FUEL SUPPLIERS.  HOW CAN SO MANY OWNERS HAVE THE IDENTICAL PROBLEM?  FORD MOTOR COMPANY NEEDS TO RECALL THESE VEHICLES.  SUDDENLY LOOSING POWER ON THE HIGHWAY IN A LARGE, HEAVY TRUCK BECAUSE AN INFERIOR PART WAS USED, IS A REAL SAFETY ISSUE.  I RESPECTFULLY REQUEST THAT YOU REGISTER THIS COMPLAINT AND LOOK INTO THE ISSUE OF RECALLING DETERIORATING GAS TANKS IN FORD PRODUCTS. *TR  UPDATED 11/07/08. *JB",
        "vin": "1FDWF37P26E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/04/2008",
        "dateOfIncident": "05/26/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10240872,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MANUFACTURERS DEFECT. THE HEAD GASKETS KEPT BLOWING UP AND LOSS OF POWER ESPECIALLY UP THE HILL  THE COMPANY DOES NOT MAKE THAT ENGINE ANYMORE. ANYONE WITH THAT ENGINE IS OUT OF LUCK AS SOON AS THE RUN OUT OF WARRANTY",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/05/2008",
        "dateOfIncident": "01/10/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10233224,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN TRAVELING DOWN THE FREEWAY A BRIDGE DECK OR POT HOLE WILL CAUSE MY 06 F-350 TO SHIMMY UNCONTROLLABLY.  THIS HAS HAPPENED ABOUT A DOZEN TIMES.  I HAVE TO COME TO A COMPLETE STOP TO GET THE TRUCK TO STOP SHAKING.  FORD SAYS THERE ISN'T ANYTHING WRONG WITH THE TRUCK.  *TR",
        "vin": "1FTWX31516E"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/26/2008",
        "dateOfIncident": "05/10/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10228887,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "06 F350 DUALLY DIESEL CREW CAB. WHEN DRIVING ANYWHERE BETWEEN 50-70 MPH AND HIT A POTHOLE THE FRONT END GOES INTO A DEATH WOBBLE AND IS NOT CONTROLLED UNTIL VEHICLE IS SLOWED TO 30 MPH. ALMOST LOST CONTROL OF VEHICLE ON LOS ANGELES FREEWAYS. HAS HAPPENED MULTIPLE TIMES AND HAVE BEEN TO FORD DEALER WITH NO ASSISTANCE. LAST EPISODE WAS LAST WEEK, THEN MY INSURANCE CO TOLD ME TO FILE COMPLAINT IN CASE OF ACCIDENT THAT IS NOT MY FAULT BUT A VEHICLE DEFECT. AAA ALSO SENT ME TO THIS FORUM OF OTHER FORD OWNERS THAT HAVE HAD THE SAME COMPLAINT.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/19/2008",
        "dateOfIncident": "04/26/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10228202,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 F-350 FRONT END SHAKES VIOLENTLY ON OCCASION.  USUALLY OCCURS WITH A CHANGE IN LEVEL OF INTERSTATE AS IN DRIVING OVER AN OVERPASS BACK ONTO THE NORMAL ROAD SURFACE.  SPEED IS USUALLY AROUND 65-70 MPH WHEN IT HAPPENS.  IMMEDIATE REDUCTION TO APPROXIMATELY 30 MPH IS REQUIRED TO MAKE IT STOP.  HAS HAPPENED 6 TIMES SO FAR AND ALMOST CAUSED AN ACCIDENT ON 3 OF THOSE OCCASIONS.   *TR",
        "vin": "1FTWW31P36E"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/02/2008",
        "dateOfIncident": "03/24/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10226511,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "SEVERE SUSPENSION AND STEERING WHEEL SHIMMY.  *TR",
        "vin": "1FTWW31P16E"
    },
    {
        "components": "STEERING,SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/23/2008",
        "dateOfIncident": "04/22/2007",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10225511,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD F350.  THE CONTACT STATED THAT THE BRAKES WILL LOCK AND CAUSE THE CALIPERS TO BURN.  A SMALL FIRE OCCURRED DURING ONE OF THE FAILURES.  THE BRAKES AND CALIPERS HAVE BEEN REPLACED FOUR TIMES, MOST RECENTLY ON APRIL 22, 2007.  THE DEALER STATED THAT THE CAUSE OF THE FREQUENT FAILURES COULD BE DUE TO SEVERAL REASONS; HOWEVER, THEY WERE UNABLE TO DIAGNOSE THE EXACT CAUSE OF THE FAILURES.  THE MANUFACTURER ASSISTED WITH THE FIRST FOUR FAILURES, BUT WOULD NOT ASSIST WITH THE CURRENT ONE.  THE VEHICLE IS CURRENTLY AT THE DEALER BEING REPAIRED.  THE CURRENT MILEAGE WAS 66,672 AND FAILURE MILEAGE WAS 800.    UPDATED 10/14/08  *BF  THE CONSUMER ALSO STATED HE HAS HAD A PROBLEM WITH THE STEERING WHEEL. UPDATED 10/16/08. *JB",
        "vin": "1FTWX31P86E"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/18/2008",
        "dateOfIncident": "03/12/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10224921,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECENTLY HAD A FLAT TIRE ON MY F-350 PICKUP.  I NEEDED A SLEDGE HAMMER TO REMOVE  THE TIRE!  I CALLED THE  DEALERSHIP WHERE I PURCHASED THE TRUCK,  STILL UNDER WARRANTY, AND ASKED THEM ABOUT THE PROBLEM. THEY SAID, WE NORMALLY  BEAT IT OFF THE TRUCK OURSELVES. SO I CONTACTED 2ND DEALERSHIP TO SEE HOW THEY HANDLED IT, THEY SAID THEY HAD TO BEAT THE  RIM OFF  THE TRUCK AS WELL.  I CONTACTED FORD MOTOR COMPANY AND ASKED THEM IF I COULD BRING IT IN AND HAVE THEM BEAT THE TIRES AND RIMS OFF  AND PUT SOME KIND OF ANTICEASE ON THE RIMS SO THEY WON'T RUST AND FREEZE ON THE TRUCK. I EXPLAINED TO HER THAT WHEN I WAS BEATING THE RIM OFF OF MY TRUCK I HAD CRAWLED OUT FROM UNDER THE TRUCK, IT FELL OFF THE JACK, IT CRACKED MY DRIVEWAY, AND I COULD HAVE BEEN KILLED. I TOLD FORD THIS SOUNDED LIKE A PRETTY DANGEROUS PROBLEM, WHAT WOULD THEY DO ABOUT THE COMPLAINT. THEY REFERRED ME TO THE  MAINTENANCE GUIDE,TO ROTATE THE TIRES EVERY 5000 MILES. IT DOESN'T MENTION  IT BEING DANGEROUS IF YOU DON'T ROTATE YOUR TIRES, JUST TO REDUCE TIRE WEAR ROTATE THE TIRES EVERY 5000 MILES. I  THINK THIS TYPE OF PROBLEM SHOULD BE COVERED BY THE WARRANTY. NOT THE CUSTOMERS EXPENSE. I WAS TOLD TO TAKE THE TRUCK IN AND MAYBE I COULD WORK SOMETHING OUT WITH THE DEALERSHIP. I SHOULDN'T HAVE TO WORK IT OUT, BUMPER TO BUMPER SHOULD MEAN BUMPER TO BUMPER. NOT JUST WHAT THEY  THINK SHOULD BE COVERED. APPARENTLY A LOT OF PEOPLE HAVE BEEN HAVING THIS  PROBLEM. IF YOUR ON THE ROAD AND HAVE A FLAT IT COULD COST 2-300 DOLLARS TO BE TOWED IN,HAVE THE TIRES REMOVED TO CHANGE THE FLAT. SINCE THE RIM HAS TO BE BEAT OFF THE TRUCK. A WHEEL PULLER MIGHT WORK, SOMETHING YOU DON'T  CARRY WITH YOU WHEN TRAVELING. THIS PUTS THE CONSUMER IN A VERY HAZARDOUS CONDITION. ALL FORD WAS INTERESTED IN WAS THE TIRE MIGHT NOT WEAR PROPERLY IF TIRES ARE NOT ROTATED. IT DOESN'T MENTION THE RIMS BEING FROZE UP  BECAUSE I DID NOT ROTATE THEM. THERE IS ONLY 29,000 MILES ON MY VEHICLE. WHAT DO YOU THINK?  CONCERNED CONSUMER.  *TR",
        "vin": "1FTWF31Y16E"
    },
    {
        "components": "STEERING,ENGINE AND ENGINE COOLING,POWER TRAIN,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "02/14/2008",
        "dateOfIncident": "09/20/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10218040,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD F-350.  THE VEHICLE WOULD CRANK, BUT NOT START.  THE VEHICLE WAS TOWED TO THE DEALER AND THEY STATED THAT THE OIL CONTROL MODULE DID NOT HAVE ENOUGH PRESSURE TO START THE MOTOR.  THE DEALER REPLACED THE HEAD GASKET.  THE RADIO VOLUME TURNED ALL THE WAY UP INTERMITTENTLY AND WAS REPLACED.  WHILE DRIVING BETWEEN 5-10 MPH IN TOW HAUL MODE, THE TRANSMISSION WOULD NOT SWITCH GEARS WHEN MAKING A LEFT HAND TURN.  THE DEALER UPDATED THE CODES FOR THE TRANSMISSION; HOWEVER, THE FAILURE CONTINUED.  WHEN THE BRAKES WERE APPLIED, THERE WAS A LOSS OF STEERING.  THE FAILURE MILEAGE WAS 12,000 AND CURRENT MILEAGE WAS 34,234.",
        "vin": "1FTWW33P16E"
    },
    {
        "components": "SUSPENSION,TIRES",
        "crash": false,
        "dateComplaintFiled": "02/08/2008",
        "dateOfIncident": "01/02/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10217478,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD TWO (2) F350 2006 SUPER DUTY FORD TRUCKS THAT THE WHEEL BEARINGS ARE COMPLETELY GONE AT 54,000 MILES AND AT 58,000 MILES.   COSTING AT TOTAL OF $2,200.00.  *TR",
        "vin": "1FDWF36P96E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/22/2008",
        "dateOfIncident": "12/01/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10215667,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD F350.  WHILE DRIVING 50 MPH, THE VEHICLE SUDDENLY LOST POWER WITH THE EXCEPTION OF THE INSTRUMENT PANEL LIGHTS.  THE VEHICLE COULD NOT BE RESTARTED AND WAS TOWED TO THE DEALER.  THE DEALER KEPT THE VEHICLE FOR SEVEN DAYS AND STATED THAT THE FAILURE WAS DUE TO LOW OIL PRESSURE.  THEY FURTHER STATED THAT THE FAILURE WAS VERY COMMON AND THAT THERE WERE NO RECALLS AVAILABLE.  THE FAILURE RECURRED TEN MONTHS LATER AT 36,000 MILES.  THE VEHICLE HAS BEEN IN AND OUT OF THE SHOP SINCE OCTOBER OF 2007 AND THE CAUSE OF FAILURE HAS YET TO BE DETERMINED.  THE VEHICLE HAS LOST POWER AT LEAST THREE TIMES SINCE THE INITIAL REPAIR.  THE VEHICLE IS CURRENTLY IN THE SHOP AND HAS BEEN FOR THE PAST 60 DAYS.  THE FAILURE MILEAGE WAS 8,200 AND CURRENT MILEAGE WAS 41,000.",
        "vin": "1FTWW31P16E"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "12/03/2007",
        "dateOfIncident": "03/09/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10210721,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD F-350.  WHILE DRIVING 45 MPH, THE STEERING BECAME LOOSE AND THE VEHICLE SIDESWIPED A DUMP TRUCK.  THE DRIVER WAS WEARING A SEAT BELT, BUT SUSTAINED BRUISES TO HIS CHEST.  THE VEHICLE WAS PREVIOUSLY TAKEN TO A REPAIR SHOP FOR AN ALIGNMENT.  THE DEALER STATED THAT THERE WAS A HOSE LEAKING POWER STEERING FLUID.  AFTER THE HOSE WAS REPLACED, THE FAILURE CONTINUED.  THE VEHICLE WAS TAKEN BACK TO THE REPAIR SHOP AFTER THE CRASH AND THEY STATED THAT THE STEERING GEAR BOX NEEDED TO BE REPLACED.  THE VEHICLE HAS NOT BEEN DRIVEN SINCE THE CRASH.  THE PURCHASE DATE WAS UNKNOWN.  THE FAILURE MILEAGE WAS 35,000 AND CURRENT MILEAGE WAS 37,000.",
        "vin": "1FTSW31P26E"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "11/14/2007",
        "dateOfIncident": "03/01/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10208891,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "CONTITRAC TR BSW",
                "productYear": "9999",
                "size": "LT275/70R18 125/122S",
                "type": "Tire"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD F-350.  THE VEHICLE HAS CONTINENTAL CONTITRAC TR BSW, SIZE LT275/70R18 125/122S TIRES.  WHILE DRIVING 5 MPH, THE VEHICLE VIBRATED.  THE CONTACT INSPECTED THE VEHICLE AND NOTICED THAT THE PASSENGER SIDE REAR TIRE WAS FLAT.  THE FACE OF THE TIRE DETACHED AND HE NOTICED PREMATURE WEAR ON ALL FOUR TIRES.  AS OF NOVEMBER 14, 2007, THE DEALER HAD NOT INSPECTED THE TIRES.  THE TOW TRUCK OPERATOR FELT THAT THE TIRE WAS DEFECTIVE.  THERE IS A RECALL FOR THE TIRES: TREAD/BELT (NHTSA CAMPAIGN ID NUMBER 05T022000); HOWEVER, THE MANUFACTURER HAD NOT VERIFIED IF HIS TIRES WERE INCLUDED.  THE FAILURE MILEAGE WAS 16,000 AND CURRENT MILEAGE WAS 25,000.",
        "vin": "1FTWX31P16E"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "10/31/2007",
        "dateOfIncident": "08/20/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10208269,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "FAX FROM SENATOR TRANSMITTING LETTER FOR CONCERNS WITH THE STEERING ON HIS 2006 FORD PICKUP AND FORD'S REFUSAL TO PAY DAMAGES DUE TO AN ACCIDENT.  *KB  THE CONSUMERS DAUGHTER WAS COMING INTO THE CURVE, AND AS SHE TURNED THE STEERING WHEEL, THERE WAS NO STEERING CONTROL. SHE APPLIED THE BRAKES ON THE WET PAVEMENT AND LOST CONTROL OF THE VEHICLE WHICH RESULTED IN HER SLIDING OFF THE ROADWAY STRIKING SEVERAL TREES.  THE STEERING ARM ON THE TRUCK WAS BROKEN, IT APPEARED THE ARM BROKE AS SHE STARTED OUT ON THE TURN. *JB",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/10/2007",
        "dateOfIncident": "09/21/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10205374,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT END OF MY 2006 F-350 WILL SHAKE WHEN GOING OVER A BUMP AT SPEEDS OF +65 MPH. IT IS ALMOST UNCONTROLLABLE. I HAVE TAKEN IT TO FORD AND THEY SAY THERE ISN'T ANYTHING WRONG, THIS HAS HAPPENED 6 TIMES. I HAVE CHECKED NUMEROUS WEB-SITES AND THERE ARE AT LEAST 500 OTHER COMPLAINTS ON THIS SUBJECT. IT IS A DANGER TO ME AND ALL THE OTHER MOTORISTS AROUND ME.  *JB",
        "vin": "1FTWW31P66E"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/19/2007",
        "dateOfIncident": "03/12/2007",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10185536,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* - THE CONTACT OWNS A 2006 FORD F350.  THE VEHICLE CAUGHT ON FIRE.  THE FRONT DRIVER'S SIDE HALF OF THE MOTOR WAS REPORTED TO BE THE CAUSE OF THE FIRE.  THE FAILURE MILEAGE WAS 10,000.  THE CONTACT HAS PICTURES.  A FIRE REPORT WAS FILED.  THERE WERE NO WARNING INDICATORS.  THE VEHICLE WAS DESTROYED.  A HOUSE AND TWO VEHICLES WERE ALSO DAMAGED. THERE WERE NO INJURIES.",
        "vin": "1FTWW33P96E"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "01/20/2007",
        "dateOfIncident": "01/12/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10179222,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "CONTITRAC TR BSW",
                "productYear": "9999",
                "size": "LT275/70R18 125/122S",
                "type": "Tire"
            }
        ],
        "summary": "CONTINENTAL CONTITRAC TR LT275/70R18 TIRES BOUGHT 3 FORD F-350 BRAND NEW WITH THESE TIRES ON THEM AND WE HAD A BLOWOUT ON ONE TRUCK ON THE HIGHWAY AND YOU CAN SEE THE SIDEWALL IS BLISTERING ON THE OTHERS- 15 TIRES IN TOTAL. THERE IS A RECALL ON THESE TIRES IN CANADA BUT NOT IN THE US.*JB",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/07/2006",
        "dateOfIncident": "06/23/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10161791,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE TOWING A DOUBLE AXLE TRAILER AT 55 MPH ON NORMAL ROAD CONDITIONS ONE OF THE TRAILER'S TIRES EXPLODED.  THE TIRE FAILURE WAS NOT APPARENT UNTIL THE CONTACT WAS ALERTED BY ANOTHER DRIVER.  THE TRAILER DOUBLE AXLE PREVENTED THE CONTACT FROM LOOSING CONTROL OF THE VEHICLE.  THERE IS NOT DOT# FOR THE MISSSION TIRES.",
        "vin": "4YDF285264B"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "03/01/2006",
        "dateOfIncident": "02/22/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10151538,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THAT WHILE DRIVING AT 30 MPH AND PULLING A TRAILER, THE STEERING MECHANISM DETACHED.  THE VEHICLE VEERED OUT OF CONTROL AND STRUCK A WALL.  THE ACCIDENT WAS REPORTED TO THE POLICE.  THERE WAS NO WARNING PRIOR TO THE FAILURE, AND THE CONTACT WAS INJURED IN THE ACCIDENT.  THE VEHICLE WAS TAKEN TO A DEALER.  THE DEALER WAS UNABLE TO DETERMINE THE CAUSE OF THE FAILURE, BUT WAS ABLE TO REPAIR THE STEERING MECHANISM.",
        "vin": ""
    }
]