[
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/26/2016",
        "dateOfIncident": "01/18/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10822431,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "\"DELAMINATION OF FUEL TANK\" AFTER ONLY HAVING THE VEHICLE FOR SHORTLY OVER FOUR MONTHS, THE TRUCK WOULD NOT CRANK.  THE TRUCK WAS PARKED ON A CITY STREET IN WASHINGTON, DC WHERE I RACKED UP 2 PARKING TICKETS.  I HAD IT TOWED TO THE DEALER AND THEY SAID THAT THE TANK IS CORRODING.  I'VE HAD ISSUES WITH THE TRUCK SINCE I PURCHASED IT.  THE GAS GAUGE WOULD GO OUT PERIODICALLY ALONG WITH THE POWER.  I CALLED THE DEALER AND HAD IT CHECKED OUT, AND THEY SAID THEY COULDN'T FIND ANY ISSUES.  NOW THAT THE 90 DAY WARRANTY IS OVER, THE GOES OUT COMPLETELY IN 120 DAYS.  IT TOOK THE DEALER A MONTH TO DELIVER THE TRUCK TO ME AFTER I PURCHASED IT.",
        "vin": "1FDXF46P06E"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/03/2015",
        "dateOfIncident": "09/03/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10761226,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DELAMINATION OF DIESEL FUEL TANK. REQUIRING FUEL TANK, FUEL LINES,AND FILTERS REPLACED.",
        "vin": "1FDXF46P46E"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/05/2015",
        "dateOfIncident": "02/05/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10681504,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-450 SD. THE CONTACT STATED THAT THE INNER LINING OF THE FUEL TANK WOULD FLAKE CAUSING THE FUEL SYSTEM TO BECOME CLOGGED. AS A RESULT, THE VEHICLE WOULD LOSE POWER WHILE DRIVING. THE FAILURE RECURRED NUMEROUS TIMES. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC, WHERE IT WAS DIAGNOSED THAT THE INJECTORS AND FRONT FUEL TANK HAD TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 156,000.",
        "vin": "1FDXW46P96E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, DIESEL,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/11/2014",
        "dateOfIncident": "09/18/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10584830,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS 2006 FORD E450 SUPER DUTY WITH A 6.0L ENGINE HAS BEEN TROUBLE RIGHT FROM THE START. THE FIRST THING TO GO WRONG WAS THE TURBO THAT WENT OUT ON 09/18/2007 WITH ONLY 12,000 MILES. NEXT AT 15,000 MILES THE VEHICLE HAD STARTING AND RUNNING PROBLEMS AND THE DEALER REPLACED SEVERAL PARTS ON TOP OF MOTOR. FROM THIS TIME FORWARD UP TO 29000 MILES THE SQUAD WAS TOWED SEVERAL TIMES FOR MORE ENGINE REPAIRS AND REPLACEMENT PARTS. FROM 29,000 TO 53,000 THINGS GOT WORSE. THE VEHICLE WAS TOWED IN AGAIN FOR EGR COOLER PROBLEMS, INJECTOR PROBLEM AND RADIATOR FAILED. TWO OF THESE TIMES WAS WHEN WE HAD A PATIENT AND HAD TO CALL FOR A BACK UP UNIT TO RESPOND. FROM 53,000 MILES TO 62,000 MILES WE HAD SEVERAL MORE TIMES OF NO START AND NO POWER PROBLEM THAT LEFT THE SQUAD ONLY ABLE TO GO 35 MPH. WE HAD MORE ENGINE PARTS REPLACED AND COMPUTERS. THE LAST EVENT WAS WHEN WE HAD FUEL GETTING INTO THE COOLANT AND FOUND BOTH HEADS CRACKED AND EGR COOLER BAD AGAIN. WE HAD ENGINE REPAIRED WITH ALL AFTER MARKET PARTS COSTING OVER $9000. IN ONE YEAR SQUAD WAS OUT OF SERVICE FOR OVER 2 MONTHS  WITH ENGINE PROBLEMS. SQUAD HAS BEEN OUT OF SERVICE FOR ABOUT 12 MONTHS SINCE NEW. ALL PROBLEMS HAVE BEEN ENGINE RELATED.",
        "vin": "1FDXE45P86H"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/27/2013",
        "dateOfIncident": "08/06/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10537455,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F450 SD. THE CONTACT STATED THAT WHILE DRIVING 20 MPH, SMOKE EMERGE FROM THE EXHAUST AS THE VEHICLE FAILED TO PROPERLY ACCELERATE WHILE TRAVELING UPHILL. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC FOR DIAGNOSIS WHERE IT WAS STATED THAT THE FUEL TANK WAS CORRODED AND THE FUEL TANK SYSTEM AND MODULE NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED AND THE MANUFACTURER WAS NOTIFIED. THE FAILURE MILEAGE WAS 56,000.",
        "vin": "1FDXF47P76E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/01/2013",
        "dateOfIncident": "01/30/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10496098,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 FORD 6.0 DIESEL ENGINE. ENGINE HEAD IS CRACKED, NEED TO REPLACE HEAD GASKETS, OIL COOLER IN QUESTION. THESE ARE COMMON PROBLEMS WITH THIS ENGINE. FORD REFUSES TO PAY OR HELP PAY FOR ANY REPAIRS. OUT OF WARRANTY BECAUSE OF TIME NOT MILES. I AM A GOOD FORD CUSTOMER AND CURRENTLY OWN 10 FORD VEHICLES. I THINK IT IS TIME FOR FORD TO STEP UP AND TAKE CARE OF THESE ISSUES ON A NATIONAL LEVEL.  *TR",
        "vin": "1FDXF46P06E"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/12/2012",
        "dateOfIncident": "12/02/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10488089,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-450. WHILE THE VEHICLE WAS PARKED IT WOULD NOT START. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSTIC TESTING. THE TECHNICIAN STATED THE FUEL FILTER HAD TO BE REPLACED. THE TECHNICIAN STATED THE FAILURE WAS CAUSED BY BAD FUEL. AFTER THE VEHICLE WAS REPAIRED THE FAILURE CONTINUED TO OCCUR. THE CONTACT DRAINED THE DIESEL FUEL TANK AND NOTICED FLAKES IN THE FUEL. THE CONTACT STATED THE FUEL TANK WAS DELAMINATING CAUSING SILVER FLAKES TO ENTER THE FUEL SYSTEM AND CLOG THE FUEL FILTER. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE BUT DID NOT PROVIDE ASSISTANCE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 23,000.",
        "vin": "1FDXF47P06E"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/16/2012",
        "dateOfIncident": "08/01/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10481661,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "LETTER FROM CONGRESSMAN NOEM ON BEHALF OF CONSTITUENT RE HIS DIFFICULTIES WITH THE WARRANTY ON HIS 2007 WINNEBAGO MOTOR HOME (DOT/I# H 2012 242 ) *TGW  2006 FORD 4-450 SD CHASSIS. THE CONSUMER STATED HE PURCHASED THE MOTORHOME IN APRIL OF 2008. THE WARRANTY STARTED IN 2008 AS IT WAS A MODEL YEAR CARRY OVER UNIT. THE WARRANTY IS SET TO EXPIRE IN APRIL 2013. THE CONSUMER STATED THE IGNITION COILS WERE BAD. ON SEVERAL OCCASIONS, THROUGH CORRESPONDENCE AND PHONE CALLS, HE REQUESTED THE FORD REPLACE THE IGNITION COILS. SIX OUT OF TEN COILS HAVE FAILED.  SO FAR, FORD HAS REFUSED.",
        "vin": "1FDXE45S66D"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/25/2012",
        "dateOfIncident": "09/12/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10476986,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SEPTEMBER 12, 2012, MY TRUCK ENGINE STOPPED WORKING. THE VEHICLE, (2006 FORD F-450 SUPERDUTY TRUCK) WAS TOWED TO A DEALERSHIP, WHERE I ASKED FOR A DIAGNOSTIC TEST. THE VEHICLE HAS 51,193 MILES ON IT.  FORD REPORTED THAT THE ENGINE HAD A \"CATASTROPHIC FAILURE.\" THE MECHANIC SAID HE HAD NEVER EXPERIENCED SUCH A PROBLEM AND WAS PUZZLED. HE SAID THE ENGINE LITERALLY BLEW APART SENDING FRAGMENTS THROUGH THE SYSTEM, DAMAGING OTHER ENGINE COMPONENTS. TO REPAIR THE ENGINE WOULD COST ME $14,000.00 DOLLARS.  I CALLED FORD'S HOTLINE TO ASK WHAT COULD BE DONE ABOUT THE DEFECTIVE ENGINE GIVEN THE LOW MILEAGE. I WAS TOLD BY FORD THEY WOULD NOT HELP IN THE REPAIRS BECAUSE OF THE TIME FRAME ASSOCIATED WITH THE VEHICLE'S WARRANTY. HOWEVER, THE NUMBER OF MILES ON THE TRUCK WOULD HAVE QUALIFIED THE TRUCK FOR WARRANTY WORK HAD IT BEEN WITHIN THE TIME FRAME. I FILED A COMPLAINT WITH FORD SHOULD A FUTURE RECALL BE ISSUED, BUT WAS TOLD THERE WOULD BE NO FURTHER ACTION OR ASSISTANCE WITH THE VEHICLE.    WHILE SEARCHING FOR A MECHANIC WHO COULD FIX THE TRUCK, I FOUND A NUMBER OF LOCAL MECHANICS WHO WERE VERY CRITICAL OF THE 6.0 LITER DIESEL FORD ENGINE. ONE PARTICULAR MECHANIC TOLD ME THAT HE CURRENTLY HAD 7 OF THE 6.0 LITER DIESEL ENGINES HE WAS WORKING ON THAT HAD SIMILAR ISSUES. HE MENTIONED ONE CUSTOMER THAT HAD THE SAME TRUCK AND YEAR MODEL AS MINE, BUT THE TRUCK ONLY HAD 22,000 MILES ON IT WHEN ITS ENGINE FAILED. ANOTHER LOCAL FLEET MECHANIC TOLD ME THAT YOU COULD CALL \"ANY DIESEL MECHANIC IN ARKANSAS\" AND THEY WOULD TELL YOU WHAT A TERRIBLE ENGINE THE 6.0 LITER FORD DIESEL ENGINE IS.    GIVEN THE INFORMATION I DISCOVERED CONCERNING THE FAULTY ENGINES, IT IS MY FIRM BELIEF THAT IF THE NHTSA OFFICE CONDUCTED AN INVESTIGATION, THEY WOULD FIND CLEAR EVIDENCE THAT THE FORD 6.0 LITER DIESEL ENGINE USED IN A NUMBER OF THEIR TRUCK MODELS HAVE NUMEROUS DEFECTS AND SERIOUS DEFICIENCIES.  *TR",
        "vin": "1FDXW46PX6E"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/25/2012",
        "dateOfIncident": "06/25/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10467620,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-450 SD. THE CONTACT STATED THAT THE VEHICLE STALLED WHILE DRIVING 55 MPH. THE CONTACT WAS ABLE TO RESTART THE VEHICLE AFTER WAITING A FEW MINUTES. THE FAILURE HAD SINCE RECURRED INTERMITTENTLY. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER AND THE CONTACT WAS INFORMED THAT THE FUEL TANK WAS DETERIORATING. THE CONTACT WAS ALSO INFORMED THAT THE FUEL TANK NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 75,000.",
        "vin": "1FDXF46P16E"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/23/2012",
        "dateOfIncident": "04/14/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10456108,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AMBULANCE, 2010 FORD F450 TRAVELING AT APPROXIMATELY 35MPH COLLIDED WITH A MEDIUM SEDAN.  AIRBAGS DID NOT DEPLOY.   *TR",
        "vin": "1FDXE4FP7AD"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "01/20/2011",
        "dateOfIncident": "01/18/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10378003,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD F-450. THE CONTACT STATED THAT THE FUEL TANK BEGAN TO DETERIORATE DUE TO CORROSION FROM THE DIESEL FUEL; THE CONTACT WAS INFORMED DURING A ROUTINE OIL CHANGE. THE MECHANIC STATED THAT THE LINING WAS BEING EATEN THROUGH BY THE FUEL. THE MANUFACTURER OFFERED NO ASSISTANCE. THE CURRENT AND FAILURE MILEAGES WERE APPROXIMATELY 21,000.  THE CONSUMER WAS INFORMED THERE WAS CONDENSATION IN THE FUEL TANK CAUSING IT TO RUST.",
        "vin": "3FRLL45Z46V"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "12/03/2010",
        "dateOfIncident": "11/30/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10369050,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD F-450 DIESEL TOW TRUCK. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 65 MPH, THE VEHICLE STALLED AND WAS UNABLE TO BE RESTARTED. THE VEHICLE WAS TOWED TO A LOCAL REPAIR SHOP WHERE THE CONTACT WAS INFORMED THAT THE FAILURE OCCURRED BECAUSE THE FUEL TANK HAD DELAMINATED. THE VEHICLE WAS REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 100,000.",
        "vin": "1FDXX46P16E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "11/15/2010",
        "dateOfIncident": "08/17/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10365724,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-450. THE CONTACT STATED THAT THE FUEL TANK HAD TO BE REPLACED ONCE UNDER WARRANTY AND WAS FAILING AGAIN. THE LINER IN THE TANK WAS ERODING, RUSTING AND CAUSING THE VEHICLE TO LEAK DIESEL FUEL. WHEN THE FAILURE WOULD OCCUR, THE VEHICLE WOULD STALL WITHOUT WARNING. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGE WAS UNKNOWN.",
        "vin": "3FRLL45Z26V"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/08/2010",
        "dateOfIncident": "03/14/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10354442,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD F450 . WHILE DRIVING AT VARIOUS SPEEDS THE VEHICLE WOULD CONSTANTLY SMOKE, RUN HOT AND LOSE POWER . THE VEHICLE WAS THEN TAKEN TO THE DEALER WHO STATED THAT THIS WAS A KNOWN FAILURE AND THAT THE EGR OIL COOLER NEEDED TO BE REPLACED. THE EGR WAS REPLACED TWICE. THE VEHICLE WAS IN THE DEALERS POSSESSION FOR 2 WEEKS FOR DIAGNOSTIC TESTING. THE CONTACT WILL NOT HAVE THE VEHICLE REPAIRED AT THE DEALER SINCE HE BELIEVES THAT THE PART WAS DEFECTIVE. THE VEHICLE WAS NOT REPAIRED. THE VEHICLE IDENTIFICATION NUMBER WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 60000 AND THE CURRENT MILEAGE WAS 102000.",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "08/24/2010",
        "dateOfIncident": "09/30/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10351469,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "SEPT. 30, 2008 - VEHICLE ENGINE STARTED MISSING - TAKEN TO SHOP FUEL FILTER CHANGED ALONG WITH REGULAR SERVICE OF ENGINE.  JULY 19, 2010 -  VEHICLE MISSING AND SMOKING, TAKEN TO REPAIR SHOP , DIAGNOSTICS WERE DONE, SHOWED INJECTOR PROBLEM, INJECTOR PROBLEM COVERED UNDER WARRANTY TRANSFERRED TO FORD GARAGE. CHECKED CODES AND INSPECT TEST CYLINDER BALANCE COMPRESSION FUEL TET CODE PO281, CODE PAA9U REPLACED # 7 FUEL INJECTOR, BLEED , ROAD TESTED AFTER COMPLETION, RETURNED TO REPAIR SHOP REPLACED FUEL FILTER AT REPAIR SHOP DURING STATE INSPECTION. TICKET CLOSED AND RETURNED TRUCK TO US ON JULY 19, 2010.    AUG.  12, 2010 - TRUCK STARTED MISSING AGAIN AND STALLED WOULD NOT START, TOWED TO A DIFFERENT FORD GARAGE.   CHECKED AND ADVISED TO CHANGE INJECTOR # 1 AND  # 5, TEST DROVE TO VERIFY REPAIR,  KEY ON ENGINE OFF CHECK, KEY ON ENGINE OFF SELF TEST, FUEL CONTAMINATION CHECK, ELECTRIC FUEL PUMP PRESSURE TEST,  DIESEL HARD START/ NO START- DIAGNOSTIC / PIN POINT TEST , FUEL INJECTOR OR NOZZLE FOR INJECTION PUMP, REMOVE AND  REPLACE,    AUG. 18, 2010 VEHICLE WAS TOWED FROM FORD GARAGE TO REPAIR SHOP TO REPLACE FUEL TANKS DUE TO PEELING AND SLIVERS INSIDE OF THE FUEL TANK .    THIS IS THE 4TH VEHICLE THAT WE HAVE HAD TO REPLACE THE FUEL TANK ON AMONG OTHER REPAIRS THAT THIS PROBLEM HAS CAUSED MY COMPANY.  THE FUEL TANK IS STORED AT MY SHOP AND AVAILABLE FOR INSPECTION UPON REQUEST. *TR",
        "vin": "1FDXW46P66E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "07/16/2010",
        "dateOfIncident": "09/16/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10343569,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F450. WHILE DRIVING APPROXIMATELY  40-45 MPH, THE VEHICLE STALLED. THE CONTACT WAS ABLE TO MOVE OFF THE ROADWAY AND AFTER SEVERAL ATTEMPTS TO RESTART THE VEHICLE; THE VEHICLE WAS TOWED TO AN AUTHORIZED DEALER. THE DEALER REPLACED THE FUEL TANK, FUEL PUMP, FILTERS AND FUEL INJECTORS AT THE CONTACT'S EXPENSE.  THE MANUFACTURER WAS NOT CONTACTED. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 135,000 AND THE CURRENT MILEAGE WAS 150,000.",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "03/30/2010",
        "dateOfIncident": "01/03/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10322808,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE COATING ON THE INTERIOR OF FORD DIESEL FUEL TANKS CORRODES AND COLLECTS AS SEDIMENT IN THE FUEL SYSTEM. THE SEDIMENT, COLLECTS AT THE BOTTON OF THE FUEL TANK AND IS SUCKED INTO THE FUEL SYSTEM. THE FUEL LINES BECOME FOULED, THE FUEL PUMPS BECOME CLOGGED AND REQUIRE REPLACEMENT. AS THE COATING CONTINUES TO DETERIORATE, THE ONLY RECOURSE IT TO CHANGE THE FUEL TANK, THE SENSORS, AND ENTIRE FUEL DELIVERY SYSTEM. WE HAVE HAD 3 FORD VEHICLES F SERIES EXPERIENCE THIS PROBLEM. IN THIS INSTANCE, THE TRUCK WAS RETURNED TO THE DEALER FOR REPAIR.  AFTER SPENDING $1912.11 IN REMEDIES, THE FINAL RECOURSE WAS TO HAVE OUR OWN MECHANICS REPLACE THE FUEL SYTEM FROM THE TANK ITSELT UPTO AND INCLUDING THE FUEL PUMP. THIS WAS AN ADDITIONAL EXPENSE OF APPROXIMATELY $1000. WE ARE REPORTING THIS AS IT SEEMS TO BE A DEFECT IN ALL THE FORD DIESEL FUEL SYSTEMS. AS THE FUEL SYSTEMS BECOME CLOGGED, THE VEHICLES LOSE POWER WITHOUT WARNING AND CREATE A SAFETY ISSUE AND DRIVING HAZARD NOT ONLY TO THE VEHICLE OPERATOR BUT OTHER MOTORISTS.  UPON COMPLAINTS TO THE DEALER, AND TO FORD, THE DEALER REFERRED US TO THE ODI WEBSITE TO FINAL A SAFETY COMPLAINT AS THIS HAS OCCURRED OVER AND OVER.",
        "vin": "1FDXX47P56E"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/12/2010",
        "dateOfIncident": "03/03/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10319188,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD 450. HE STATED THAT THE FUEL TANK HAD DELAMINATED, CAUSING SHARDS OF THE TANK TO BREAK OFF INTO THE FUEL LINE. THE VEHICLE WAS DIAGNOSED BY A LOCAL DEALER WHO CONFIRMED REPAIRS WOULD NEED TO BE MADE TO THE FUEL TANK, AT THE OWNER'S EXPENSE. THE CONTACT WAS CONCERNED WITH THE DEFECTIVE FUEL TANK AFFECTING THE FUEL INJECTORS AND THE MOTOR. REPAIRS WERE MADE TO THE VEHICLE BY THE OWNER AND AN INDEPENDENT MECHANIC. THE APPROXIMATE FAILURE MILEAGE WAS 135,000 AND THE CURRENT MILEAGE WAS 135,000.",
        "vin": "3FRLL45Z96V"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/02/2010",
        "dateOfIncident": "02/24/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10315711,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD F450. WHILE DRIVING 25 MPH HE TRIED APPLY THE BRAKES AND THE VEHICLE BEGAN TO SLIDE TO THE LEFT AND HE ALMOST HIT A FEW VEHICLES. THE DRIVER STATED THAT HIS FRONT TIRES LOCKED UP. HE CONTACTED THE DEALER AND THEY SAID IT WAS DUE TO LOW VOLTAGE. THE DEALER THEN REPLACED HIS ALTERNATOR FOR $500.00. THE DRIVER STATED THAT THERE WAS ALSO SMOKE COMING FROM THE TIRES. THE FAILURE MILEAGE WAS 75,000. THE CURRENT MILEAGE WAS 76,000.",
        "vin": "1FDXW47PX6E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "02/25/2010",
        "dateOfIncident": "11/09/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10314146,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD F450.  THE CONTACT STATED THAT THE MATERIAL IN THE FUEL TANK HAS DETACHED FROM THE INNER STRUCTURE OF THE TANK.  THE MATERIAL WAS IN THE FUEL INJECTOR AND CAUSED THE VEHICLE TO STALL AND SHUT OFF INTERMITTENTLY WHILE DRIVING 65 MPH.  THE CONTACT HAS TAKEN THE VEHICLE TO THE DEALER TO REPLACE THE FUEL TANK, FUEL PUMP, FUEL SENDER, FUEL FILTERS, AND THE FUEL INJECTORS.  THE REPAIRS HAVE REMEDIED THE FAILURE. THE CONTACT STATED THAT THE VEHICLE COULD HAVE CAUSED A CRASH WHILE STALLING ON THE HIGHWAY.  THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "1FDXF46P26E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "01/16/2010",
        "dateOfIncident": "01/14/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10299959,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING ON  THE 290 HWY AROUND BUFFALO NY THE TRUCK STALLED IN THE MIDDLE LANE AT 60 MPH FORTUNATELY  THE DRIVER WAS ABLE TO COAST OVER TO THE RIGHT SHOULDER. UPON EXAMINATION OF THE PROBLEM WE FOUND THE FUEL FILTERS PLUGGED WITH DEBRIS FROM THE DETERIORATING LINER OF THE FUEL TANK. WHEN I CONTACTED THE DEALER IT WAS FOUND THAT FORD WAS REPLACING THESE UNDER ITS EMISSIONS WARRANTY AND THAT IF PAST THAT YOU WERE ON YOUR OWN , TO THE TUNE OF $1000.00.  WE HAVE HAD FORD DIESELS SINCE 1974 AND OVER 250,000 MILES ON THEM WITHOUT THIS PROBLEM. WHAT EVER FORD DID IS CAUSING FUEL PUMP, INJECTER , AND GAS TANK ISSUES ON THE 6.0 DIESEL, WHICH IS THE WORST DIESEL FORD EVER MADE. THIS TRUCK HAS 90,000 MILES AND A VERY FREQUENT REPAIR HISTORY,IN 10,000 MILES IT WILL BE OUT OF THEIR ENGINE WARRANTY LEAVING OWNERS LIKE ME SADDLED WITH EXPENSIVE REPAIRS  FROM THE SERVICE MANAGERS TO THEIR CUSTOMER RELATIONS DEPT., YOU GET THE SAME SONG, THERE IS NOTHING WE CAN DO!!!!  I HAVE SAMPLES OF THE DETERIORATED LINER AND FUEL. IF IT HAD BEEN RUSH HOUR WHEN THE TRUCK QUIT, I AM SURE THERE WOULD HAVE  BEEN AN ACCIDENT. *TR",
        "vin": "1FDXX46P36E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "11/10/2009",
        "dateOfIncident": "11/10/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10291782,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 FORD F-450.  THE LINING ON THE INSIDE OF THE FUEL TANK IS DISINTEGRATING, PLUGGING THE FILTERS AND CAUSING FUEL RELATED PROBLEMS. THE TRUCK ONLY HAS 54,000 MILES ON IT. THE DEALERSHIP IS WANTING TO CHARGE ME $2100 FOR A NEW FUEL TANK. I TOLD THEM THIS IS A MANUFACTURING DEFECT AND FORD SHOULD STAND BEHIND IT. THEY SAID IT WAS CAUSED BY FUEL. I CANNOT AFFORD TO HAVE THE VEHICLE REPAIRED. *TR",
        "vin": "1FDXX47P56E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "05/29/2009",
        "dateOfIncident": "05/11/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10272344,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "FORD DIESEL FUEL TANK DELAMINATION. SUDDEN LOSS OF POWER ON THE FREEWAY, DUE TO DELAMINATION PARTICLES CLOGGING THE INJECTORS. *TR",
        "vin": "1FDXF46P56E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "05/07/2009",
        "dateOfIncident": "05/07/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10267965,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD F450.  WHILE REPLACING THE FUEL FILTER, THE MECHANIC FOUND CHIPS OF PAINT FROM THE LINING OF THE FUEL TANK.  THE CONTACT WAS INFORMED THAT THIS FAILURE COULD POSSIBLY CLOG UP THE FUEL INJECTORS AND CAUSE THE ENTIRE FUEL LINE TO FAIL.  THE VEHICLE IS CURRENTLY BEING REPAIRED AT THE COST OF $400.  THE CONTACT IS IN THE PROCESS OF NOTIFYING THE MANUFACTURER.  THE FAILURE AND CURRENT MILEAGES WERE 45,000.",
        "vin": "1FDXX47P26E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/09/2009",
        "dateOfIncident": "03/09/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10261337,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER DRIVING VEHICLE SO APPROX 1 HR AND THEN STOPPING FOR GAS AND RESTARTING VEHICLE IT OVERHEATS.  THEY HAVE ISSUED A TECHNICAL SERVICE BULLETIN ABOUT THE PROBLEM (TSB 06-21-15 )  HOWEVER THEY WILL NOT WARRANTY REPLACE THE PARTS THAT ARE CAUSING THE PROBLEM. *TR",
        "vin": "1FDXF46Y47E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "01/15/2009",
        "dateOfIncident": "01/09/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10255207,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "1)TRAFFIC SYSTEMS HAS A FLEET OF VEHICLES TO PERFORM OUR BUSINESS WHICH INCLUDE ALL MANUFACTURES(CHEVY,FORD,INTERNATIONAL,ISUZU,ETC).THE EVENTS THAT LEAD TO FAILURE IS THE DETERIORATION OF THE FUEL SYSTEM,WHICH LEADS TO ENGINE SHUT DOWN. 2)THE FAILURE OCCURS EVERY 4000,5000 MILES. 3)EVERYTIME THIS HAPPENS THE TRUCKS SHUTDOWN IN THE MIDDLE OF DRIVING ANYWHERE THEY ARE. OUR BUSINESS HAS EMPLOYEES THAT DRIVE AND WORK OUT OF THESE TRUCKS, EVERY TIME THIS HAPPENS WE HAVE TO GET THE TRUCKS TOWED TO DEALER AND PICKUP OUR EMPLOYEES. *TR",
        "vin": "1FDXF46P96E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/15/2008",
        "dateOfIncident": "09/17/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10214902,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN SEVERAL FORD TRUCKS, F450, VANS AND OTHERS.  ALL THE TRUCKS HAVE PROBLEMS WITH THE GAS TANKS, WHERE THE PAINT PEELS OFF AND CLOGS THE GAS TANK. I HAVE ATTEMPTED TO REACH THE DEALERS WHERE I PURCHASE THE TRUCKS FROM AND THEY DON'T WANT TO DO ANYTHING ABOUT THIS.  *TR",
        "vin": "1FDXX47P56E"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "12/21/2007",
        "dateOfIncident": "10/10/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10212543,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 FORD F-150 ACCELERATED UNEXPECTED WHILE STOPPED. ALTHOUGH I APPLIED THE BRAKE PEDAL AS HARD AS POSSIBLE THE TRUCK ACCELERATED UNCONTROLLABLY AND HIT A BUILDING BECAUSE I AVOIDED HITTING A CROWD A PEOPLE.  THE TRUCK WAS NEARLY NEW, APPROX 2000 MI CAUSING $20K DAMAGE.  *TR",
        "vin": "1FTPW14576K"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/06/2007",
        "dateOfIncident": "05/01/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10192607,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2006 FORD F250 4X4 THAT WHEN YOU HIP POT HOLE WITH ONE TIRE AT 55 MPH OR HIGHER THE TRUCK GOES INTO A VERY BAD SHIMMY AND GOES FROM BAD TO WORSE IF YOU DON'T GET ON THE BRAKES FAST AND HARD.",
        "vin": "VBKEXM4016M"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "01/18/2007",
        "dateOfIncident": "12/22/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10179012,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE IS AN AMBULANCE  IT HAS FAILED START NUMEROUS TIMES. IT HAS BEEN TO THE DEALER NUMEROUS TIMES AND THE FAILURE TO START CONDITION STILL PERSISTS.  THIS IS PUTTING THE SAFETY  OF THE PUBLIC AT RISK...WHEN AN AMBULANCE FAILS TO RESPOND IN A TIMELY MANNER DEATHS CAN OCCUR.  *JB",
        "vin": "1FDXF46PX6E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "01/18/2007",
        "dateOfIncident": "01/01/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10179015,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WON'T START  THIS IS AN AMBULANCE AND ON REPEATED OCCASIONS IT HAS FAILED TO START. THE FAILURE TO START PUTS THE PUBLIC SAFETY AND WELFARE AT RISK. FAILURE TO RESPOND WITH AN AMBULANCE WHEN CALLED CAN LEAD TO THE DEATH OF CITIZENS. *JB",
        "vin": "1FDXF46PX6E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "01/18/2007",
        "dateOfIncident": "01/03/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10179016,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WON'T START.  THIS IS AN AMBULANCE. THIS UNIT HAS REPEATEDLY FAILED TO START. THIS PUTS THE PUBLIC AT RISK. WHEN AN AMBULANCE DOES NOT START THERE IS A SERIOUS POTENTIAL FOR DEATH. *JB",
        "vin": "1FDXF46PX6E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "01/18/2007",
        "dateOfIncident": "01/13/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10179045,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WON'T START  THIS IS AN AMBULANCE. WE ARE UNABLE TO RESPOND TO EMERGENCY CALLS WHEN THE AMBULANCE DOESN'T START. THIS COULD RESULT IN A LOSS OF LIFE, IF WE DO NOT REACH THE DISTRESSED CITIZEN IN A TIMELY MANNER TO PERFORM ADVANCED LIFE SUPPORT.  *JB",
        "vin": "1FDXF46PX6E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "01/18/2007",
        "dateOfIncident": "01/05/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10179044,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WON'T START  THIS IS AN AMBULANCE. WHEN IT DOESN'T START WE CAN NOT RESPOND TO CALLS TO TRANSPORT AND PERFORM ADVANCED LIFE SUPPORT EFFORTS. THIS LEAVES THE PUBLIC AT RISK. *JB",
        "vin": "1FDXF46PX6E"
    }
]