[
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/09/2020",
        "dateOfIncident": "10/03/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363545,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WIRING HARNESS FLEXES WHERE IT PASSES FROM THE BODY TO THE TAILGATE CAUSING THE IINSULATION AND WIRING TO BREAK AND SHORT TO THE BODY RESULTING IN A BLOWN FUSE AND NO REAR LIGHTS.  THIS HAS OCCURRED WHILST DRIVING AND WHEN STATIONARY OPENING THE HATCHBACK.",
        "vin": "1FAHP37N66W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/14/2020",
        "dateOfIncident": "03/12/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11317983,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG WARNING LIGHT STAYED  ON AFTER CAR WAS PARKED AND THEN STARTED. ENGINE STARTED, AND THE AIR BAG SRS LIGHT CAME ON AS PART OF SELF TEST, WENT OFF FOR ABOUT 5 SECONDS, CAME BACK ON THEN STAYED ON. CAR WAS NEVER IN A SIGNIFICANT ACCIDENT. ONLY ACCIDENT WAS SCRATCHED BUMPER FROM SIDESWIPE WHEN VEHICLE WAS STATIONARY. CHECKED UNDER AND AROUND 2 FRONT SEATS FOR DEBRIS PER OWNER'S MANUAL. ALL OK WITH INSPECTION. LATCHED AND UNLATCHED SEAT BELTS (DR AND PASS), PULLED AND RETRACTED SEAT BELTS. NO CHANGE, AIR BAG LIGHT STILL ON.",
        "vin": "1FAFP37N66W"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/15/2020",
        "dateOfIncident": "02/12/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309310,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING DOWN THE ROAD AND GAS PEDDLE GET STUCK AND SOMETIMES WONT PUSH DOWN TO GO SOMETIMES WHILE ON THE HIGHWAY THE HEADLIGHTS AND ALL LIGHTS FLICKER ALL THE TIME WHEN I HAVE THEM ON AT NIGHT GOTTIN PULLED OVER A COUPLE OF TIMES TOOKIN IT TOO THE SHOP AND THEY SAID EVERYTHINGS OK ON HIGHWAY 36 BETWEEN BROOKFIELD AND CHILLICOTHE MO",
        "vin": "1FAFP34N76W"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/13/2020",
        "dateOfIncident": "10/01/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11298928,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD FOCUS. THE CONTACT STATED THAT WHEN THEY ATTEMPT TO FILL THE FUEL TANK, THE FUEL WOULD BEGIN TO LEAK FROM THE VEHICLE. THE CONTACT STATED THE FUEL WOULD LEAK OUT OF THE SAME OPENING THEY WERE ATTEMPTING TO PUT THE FUEL INTO AS IF THE FUEL WAS SPEWING BACK AT THEM. THE CONTACT CONTACTED THE DEALER (MULLINAX FORD OF PALM BEACH LOCATED AT 1210 NORTHLAKE BLVD, LAKE PARK, FL 33403;  PHONE NUMBER 888-856-1675) WHO INFORMED THE CONTACT THAT THEIR VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER:  06E056000 (FUEL SYSTEM, GASOLINE). THE VEHICLE HAD NOT BEEN REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND REFERRED THE CONTACT TO NHTSA. THE APPROXIMATE FAILURE MILEAGE WAS 128,156.",
        "vin": "1FAFP34N56W"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/29/2019",
        "dateOfIncident": "09/18/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11276950,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, THE VEHICLE BEGAN TO ACCELERATE ON IT'S OWN. WHEN BRAKES WERE APPLIED THE RPMS SKY ROCKETED. TURNS OUT IT WAS A BROKEN CRUISE CONTROL MODULE CABLE THAT WOULD CAUSE THE THROTTLE TO GET \"STUCK\". AT THE SAME TIME IT WAS ALSO BOGGING OUT AND SHUTTING ITSELF OFF WHILE DRIVING. THE CHECK ENGINE LIGHT REMAINED ON THROWING A P071? CODE WHICH IS ASSOCIATED WITH O2 LEVELS.THIS TURNED OUT TO BE A BROKEN \"BREATHER HOSE\" WHICH IS CONNECTED TO THE AIR INTAKE. BOTH PARTS HAVE PROVEN TO BE EXTREMELY DIFFICULT TO TRACK DOWN. AFTER REPLACING THE \"BREATHER HOSE\", CCM THROTTLE CABLE, AND ALSO AN O2 SENSOR THE OVERALL COST FOR PARTS WAS $300 AND LABOR WAS $300. THANKFULLY NO INJURIES.",
        "vin": "1FAHP36N36W"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/12/2019",
        "dateOfIncident": "05/09/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11219518,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED 2 BF GOODRICH G-FORCE SPORT COMP-2 RADIAL 205/50.R16 87Z SL TIRES ON APRIL 15, 2019 FROM AMAZON, INSTALLED ON FRONT TIRE POSITIONS ON MAY 9, 2019. REAR TIRES ARE GENERAL G-MAX AS-03 WHICH ARE THE SAME SIZE AND WERE USED THE SUMMER BEFORE WITH NO ISSUES, STILL SIGNIFICANT TREAD LIFE LEFT AND NO DAMAGE. ALL FOUR TIRES WERE INFLATED TO 36 PSI AFTER INSTALLATION. WHEN DRIVING ON ANY KIND OF MOISTURE, RAIN NIGHT BEFORE OR DRIZZLE OR POURING RAIN, FRONT TIRES DO NOT GRIP ROAD SURFACE AND HAVE ALMOST LED TO NUMEROUS ACCIDENTS AT VARYING SPEEDS ON RURAL ROADS, CITY STREETS, AND HIGHWAYS, ANYWHERE FROM 20MPH TO 75MPH. I HAVE NOW BECOME USED TO THE DANGER OF THE BF GOODRICH TIRES AND DRIVE EXTREMELY SLOWLY IN WET CONDITIONS. AS I HAVE A MANUAL TRANSMISSION FRONT WHEEL DRIVE VEHICLE, I ALWAYS PUT THE NEW TIRES ON THE FRONT TO ENSURE TRACTION IN BAD WEATHER CONDITIONS, THE BF GOODRICH TIRES HAVE ALMOST GOTTEN ME KILLED MORE THAN A HANDFUL OF TIMES. AS STATED BY ANOTHER CONSUMER, I ALSO HAD TROUBLE MOUNTING ONE OF THE BF GOODRICH TIRES TO THE WHEEL AS IT DID NOT WANT TO BEAD AND NOW THE TIRE PRESSURE IN THAT TIRE WILL FLUCTUATE, WHICH HAS LED TO DAILY PRESSURE CHECKS. I HAVE NEVER HAD ANY ISSUES WITH ANY GENERAL BRAND TIRES. THIS IS THE FIRST TIME THAT I HAVE PURCHASED BF GOODRICH TIRES AND I NEVER WILL EVER AGAIN. I HAVE DRIVEN UP TO 180KPH ON THE GERMAN AUTOBAHN IN LESSER QUALITY VEHICLES WITH COOPER BRAND TIRES, AND I HAVE NEVER BEEN AS SCARED AS I HAVE BEEN DOING 70MPH IN DRIZZLE WITH BF GOODRICH TIRES. IT FEELS LIKE DRIVING ON ICE, NO HANDLING, NO CONTROL, JUST SLIDING. I'M GRATEFUL FOR THE GENERAL TIRES ON THE REAR WHICH HAVE KEPT ME FROM CRASHING, AND WILL BE PURCHASING AS SOON AS POSSIBLE(THE ONLY REASON I HAVE KEPT THE BF GOODRICH FOR THIS LONG IS BECAUSE I HOPED THEY JUST NEEDED TO BE BROKEN IN A LITTLE BUT IT HAS BEEN OVER A MONTH AND IT'S STILL SCARY).",
        "vin": "1FAHP38Z76W"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "04/25/2019",
        "dateOfIncident": "04/04/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11203719,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2006 FORD FOCUS. WHILE DRIVING AT AN UNKNOWN SPEED, THE BRAKES FAILED AND THE VEHICLE CRASHED INTO A TELEPHONE POLE. THE AIR BAGS DID NOT DEPLOY. A POLICE REPORT WAS FILED. THE CONTACT WAS NOT INJURED, BUT WAS TAKEN TO A MEDICAL EMERGENCY CENTER FOR OBSERVATION. THE DEALER AND MANUFACTURER WERE NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS TOWED AND DEEMED TOTALED BY THE INSURANCE COMPANY. THE CAUSE OF THE BRAKE FAILURE WAS NOT DETERMINED. THE FAILURE MILEAGE WAS 117,459.",
        "vin": "1FAFP31N16W"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/21/2019",
        "dateOfIncident": "12/10/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11190515,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TAMARA RECALL. MY OUTSIDE DRIVERS SIDE DOOR HANDLE BROKE BECAUSE THE MECHANISM IS PLASTIC. NO ONE CAN FIX IT CORRECTLY AND IT KEEPS BREAKING SO NOW I CAN'T GET MY CAR INSPECTION DONE.",
        "vin": "1FAFP31N56W"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/02/2019",
        "dateOfIncident": "02/01/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183626,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER BACK DOOR LATCH BROKE. CAR DOOR TAPED",
        "vin": "1FAFP34NX6W"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "10/11/2018",
        "dateOfIncident": "09/03/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11139735,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD FOCUS. THE CONTACT STATED THAT THE REAR PASSENGER AND DRIVER SIDE DOOR LATCHES FAILED. SHORTLY AFTER, THE FRONT DRIVER SIDE DOOR WAS UNABLE TO BE OPENED FROM OUTSIDE THE VEHICLE. THE DEALER WAS NOT CONTACTED. AN INDEPENDENT REPAIR FACILITY REPLACED THE REAR LATCHES AND STATED THAT THE DRIVER'S DOOR LATCH ALSO NEEDED TO BE REPLACED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": "1FAHP34N56W"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/17/2018",
        "dateOfIncident": "07/12/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11111811,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR HATCH WIRING HARNESS HAS FRAYED WIRES AND CAN CAUSE A FIRE THERE IS RUBBING AGAINST WIRING HARNESS FROM THE RUBBER BOOT COVERING IT. THESE WIRES ARE LIVE AND CAUSE A FIRE AND ARE ALWAYS ON DUE TO CONNECTION TO ALL REAR ELECTRICAL COMPONENTS. I FOUND THIS OUT WHEN TRYING TO FIGURE OUT WHY MY REAR HATCH WOULD NOT OPEN UNLESS UNLOCKED WITH THE KEY.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "05/14/2018",
        "dateOfIncident": "09/21/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11093622,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "HELLO NATIONAL HIGHWAY TRAFFIC SAFETY ADMINISTRATION,     I WOULD LIKE TO CREATE A VEHICLE COMPLAINT REGARDING THE FORD FOCUS 2006 SEDAN ZX4 THAT I PURCHASED THE VEHICLE SEPTEMBER 20, 2017. WHILE DRIVING WITHIN A SERVICE ROAD, THE VEHICLE'S STALLED AND STOPPED RUNNING WHILE DRIVING UPON MULTIPLE INSTANCES OVER THE SAME DAY OF PURCHASING AND THROUGH OUT THE WEEKEND OF SEPTEMBER 22 - SEPTEMBER 30TH. AS A RESULT, I RETURNED THE VEHICLE TO THE DEALER OF LANSING POWER MOTORS INC. FOR AN INSPECTION SEPTEMBER 23, 2017. UPON COMPLETION OF THE INSPECTION, THE MECHANICS CONFIRMED THAT \"NOTHING WAS WRONG WITH THE VEHICLE\" AND SUGGESTED TO PURCHASE A NEW COMPUTER FOR THE VEHICLE. ON OCTOBER 30, 2017 I WAS INVOLVED IN A CAR ACCIDENT WHICH I THINK WAS DUE TO BAD ELECTRICAL BRAKES WHICH RESULTED IN THE VEHICLE BEING T-BONED BY ANOTHER DRIVER WITHIN A RESIDENTIAL INTERSECTION. THE VEHICLE CONTINUES TO STALL OR STOP COMPLETELY WHILE DRIVING AS OF MAY 14, 2018. IN ADDITION, NOTICED THAT ALL LIGHTS ON THE DASHBOARD DISPLAYED WHILE THE CAR STALLED AND DURING START-UP OF THE VEHICLE. UNCERTAIN ABOUT THE CAR NOT BEING RECALLED, DUE TO RECEIVING A MAILED NOTIFICATION REGARDING THE RECALL OF THE VEHICLE FROM THE ORIGINAL MANUFACTURER. CAN PROVIDE THE NAME UPON CONTACT REGARDING THE VEHICLE COMPLIANT SUBMISSION OF THE FORM. THANKS FOR YOUR TIME, CONSIDERATION, AND I HOPE THAT THIS INFORMATION MAY ASSIST YOU REGARDING THE CREATION OF A VEHICLE COMPLAINT.",
        "vin": "1FAHP34N46W"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/07/2018",
        "dateOfIncident": "03/06/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11076610,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY KEY WONT WORK ANYMORE. CAR WONT START. I WAS AT THE GAS STATION. WHEN I WENT TO TURN ON THE CAR IT JUST WOULDLN'T START UP THE CAR. ON THE DASHBOARD THE CAR AND LOCK LIGHT CAME ON AND KEPT FLASHING. I TRIED DIFFERENT WAYS AND NOTHING WORKED. I HAD TO TOW MY CAR HOME",
        "vin": "1FAFP34N76W"
    },
    {
        "components": "POWER TRAIN,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "03/06/2018",
        "dateOfIncident": "03/06/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10980748,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 FORD FOCUS. CONSUMER WRITES IN REGARDS TO ANTI THEFT SYSTEM AND MANUAL TRANSMISSION ISSUES. *LD  *JS",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/22/2018",
        "dateOfIncident": "01/21/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11064273,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "\" TAKATA RECALL \" DON'T FEEL SAFETY AFTER GOT AIRBAG RECALL NOTICE.FEEL IN SHOCK SOMETHING COULD HAPPEN TO ME AND MY FAMILY.",
        "vin": "3FAHP07106R"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/06/2018",
        "dateOfIncident": "01/01/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11060915,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "CABIN FILTER - FILTER IS EXCLUDED IN THIS MODEL OF VEHICLE.  ELECTRIC WINDOWS NEVER WORKED CORRECTLY .  AIRBAG- WAS NEVER INSPECTED BY DEALER",
        "vin": "1FAFP37N96W"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/22/2017",
        "dateOfIncident": "06/01/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11024955,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "EVERY FOCUS OWNER I HAVE TALKED WITH HAS HAD THE SAME ISSUE WITH THE DOOR HANDLES BREAKING. THIS IS THE 3RD TIME SINCE 2013 THAT THIS HAS HAPPENED TO ME, AND IF I DON'T FIX IT MYSELF, DEALERSHIPS WANT TO CHARGE $250 TO FIX A PROBLEM THAT NEEDS TO BE RECALLED, AND COVERED ON FORD'S EXPENSE. THE SECOND TIME IT HAPPENED, FEBRUARY 2017, IT BROKE NOT ONLY ON THE OUTSIDE, BUT ALSO THE INSIDE HANDLE OF THE PASSENGER SIDE. SO NEITHER THE OUTSIDE, NOR INSIDE LATCH WILL OPEN ON, AND THAT'S A DEATH SENTENCE IF (KNOCK ON WOOD) I GET INTO A BAD ACCIDENT. SEPTEMBER 19TH 2017, THE EXTERNAL HANDLE IS BROKEN AND I AM CURRENTLY NOW UNABLE TO OPEN NEITHER DOOR (IT'S A 2 DOOR). I LITERALLY HAVE TO CRAWL THROUGH THE HATCH UNTIL THAT DECIDES TO BREAK ON ME. I CAN LEAVE MY WINDOW DOWN JUST ENOUGH TO STICK MY ARM IN TO UNLATCH IT, BUT U LOVE IN RAIN ASS OHIO, AND DON'T FEEL LIKE HAVING FLOOD ISSUES ONTOP OF THIS MESS.  WHY HASN'T THIS BEEN RECALLED? I SWEAR I WILL NEVER OWN ANOTHER FORD IN MY LIFE AFTER HAVING TO DEAL WITH THIS. IT'S ABSOLUTELY RIDICULOUS AND SADLY WILL TAKE SOMEONE DYING TO GET THIS ACKNOWLEDGED BY FORD.  VERY DISAPPOINTED, AND I'M RISKING MY LIFE EVERYTIME I GET BEHIND THE WHEEL.",
        "vin": "1FAFP31N36W"
    },
    {
        "components": "STRUCTURE,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "09/06/2017",
        "dateOfIncident": "09/01/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11021674,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "RAINFALL ON/OFF/MODERATE. TIRES ~5/32\" TREAD; MICHELIN; AGE? WHILE NAVIGATING INTERCHANGE FROM I-64W TO I-81N (STAUNTON, VA) CAR LOST TRACTION. SEVERAL ATTEMPTS TO STEER TO INSIDE CURVE SHOULDER RESULTED IN VIOLENT FISHTAILING & TOTAL LOSS OF CONTROL. VEHICLE SLID ABOUT 100 YDS. IN GRASSY DITCH, FLIPPING \"1+?\" TIMES, LEAVING DRIVER HANGING UPSIDE DOWN. LEFT TEMPLE HEAD INJURY. STERNUM INJURY UNDER SHOULDER BELT. DRIVER WALKED AWAY DIZZY BUT ORIENTED. \"RECKLESS DRIVING\" CITATION ISSUED. CAR TOTALLED. GROCERY TRIP ENDED BADLY BUT DRIVER GLAD TO BE \"ALIVE\". OWNER PURCHASED AUTO USED IN 2013 SEEKING ESC AS STANDARD EQUIPMENT. FORD DENIED PROVISION OF SAME. ACCIDENT ENTIRELY PREVENTABLE/UNNECESSARY DUE TO MANUFACTURER NEGLECT OF KEY SAFETY EQUIPMENT AS STANDARD ISSUE (ELECTRONIC STABILIZATION CONTROL.)",
        "vin": "1FAHP36N96W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/01/2017",
        "dateOfIncident": "03/01/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10981717,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD FOCUS. THE CONTACT STATED THAT THE AIR BAG WARNING INDICATOR REMAINED ILLUMINATED. THE VEHICLE WAS NOT DIAGNOSED BY A DEALER. THE CONTACT WAS CONCERNED THAT THERE WAS NO MANUFACTURER AIR BAG RECALL. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": "1FAFP34N16W"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/19/2017",
        "dateOfIncident": "08/19/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10946304,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD FOCUS. THE CONTACT STATED THAT WHILE DRIVING AT AN UNKNOWN SPEED, THE SUN ROOF EXPLODED WITHOUT ANY IMPACT. NO INJURIES WERE SUSTAINED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 56,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/12/2017",
        "dateOfIncident": "07/03/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10944952,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED NEW, HAVE HAD IN TO FORD DEALER MULTIPLE TIMES FOR AIR BAG LIGHT ON BOTH ON CLUSTER AND ON DASH.  FORD DID WHAT AMOUNTED TO TEMP FIX 3 TIMES, I MOVED LATER PAID NEARLY $1OOO TO REPLACE PARTS.  FIX LASTED FEW WEEKS.  LIGHT OUT RIGHT NOW BUT ONE OR BOTH LIGHTS COME ON AND STAY ON ABOUT EVERY OTHER WEEK.  FORD HAS BEEN USELESS AS TO PERMANENT FIX.  HAD SIMILAR PROBLEMS WITH FORD F-250 BUT WITH ENGINE.  MOVING OR STOPPED SOMEONE IN BOTH SEATS OR NOT IT KEEPS HAPPENING.",
        "vin": "1FAFP37N36W"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/09/2017",
        "dateOfIncident": "10/15/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10943777,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD FOCUS. WHILE DRIVING AT A LOW SPEED AND APPROACHING A STOP SIGN, THE BRAKE PEDAL WAS DEPRESSED, BUT THE VEHICLE ACCELERATED INDEPENDENTLY. AS A RESULT, THE CONTACT ALMOST CRASHED INTO THE REAR OF ANOTHER VEHICLE. THE FAILURE RECURRED TWO TIMES. THE VEHICLE WAS NOT TAKEN TO A DEALER OR DIAGNOSED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 100,000.",
        "vin": "1FAFP34N16W"
    },
    {
        "components": "VEHICLE SPEED CONTROL,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "12/14/2016",
        "dateOfIncident": "12/04/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10935301,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2006 FORD VENT SELECTOR THAT MOVES FROM DEFROST TO VENT HAS BROKEN TWICE NOW. I AM TOLD IT IS A 600 FIX BUT I SEE SO MANY COMPLAINTS ABOUT THIS ISSUE WHY IS THERE NO RECALL..  NEXT SAME CAR THE GAS PEDAL STICKS IN COLD WEATHER TAKE TO A AUTO SHOP THEY CLEAN THROTTHLE BODY AND RUNS FINE FOR A BIT BUT AGAIN A LOT OF COMPLAINTS YET NO RECALL WHY. THEY BOTH HAPPEN WHILE IN MOTION",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/21/2016",
        "dateOfIncident": "07/07/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10927191,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE PROBLEM WITH GAS PEDAL STICKING SINCE VEHICLE WAS 2 YEARS OLD, HAD FORD DEALERSHIP FIX IT UNDER WARRANTY WHICH THEY CLEANED STICKING THROTTLE BODY. UNIT STICKING AGAIN AFTER A FEW MONTHS AND FORD REPLACED IT WITH NEW ONE WHICH I PAID OVER 500 DOLLARS OUT OF POCKET AFTER WARRANTY WAS UP. AFTER A YEAR  THROTTLE BODY STICKING AGAIN WHICH CAUSES HIGH IDLE PROBLEM UNTIL VEHICLE COMES TO A STOP THEN IDLE TURNS TO NORMAL RPM'S.",
        "vin": "1FAFP31N06W"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/14/2016",
        "dateOfIncident": "06/03/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10874167,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Toyo Tire Holdings of Americas, Inc.",
                "productMake": "TOYO",
                "productModel": "EXTENSA A/S",
                "productYear": "9999",
                "size": "P225/60R16 97T",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD FOCUS EQUIPPED WITH TOYO EXTENSA A/S TIRES, SIZE: P195/60/R15 (NA). WHILE INSTALLING A BRAND NEW TIRE AND INFLATING THE TIRES (38 TO 40 PSI), THE TIRE BLEW OUT. AS A RESULT, THE CONTACT SUSTAINED FACE, LEFT ARM, EYE, AND EAR INJURIES THAT REQUIRED MEDICAL ATTENTION. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE AND VIN WERE NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "AIR BAGS,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "05/27/2016",
        "dateOfIncident": "03/01/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10871202,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIRBAG SAFETY LIGHT INDICATOR IS 'ON' ON THE DASH BOARD. I AM AFRAID OF A FRONT END ACCIDENT AND NOT HAVE THE AIRBAG WORK.   ALSO, THE WIPERS SCRAPE OR SKIP ACROSS THE WINDSHIELD.  BOTH THE WINDSHIELD AND BLADES HAVE BEEN REPLACED AND THE SKIPPING CONTINUES NO MATTER THE AMOUNT OF WATER ON THE WINDSHIELD.",
        "vin": "1FAHP34N66W"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/21/2016",
        "dateOfIncident": "05/19/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10870174,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "RIGHT REAR PASSENGER DOOR WILL NOT LOCK PRESENTING A SAFETY HAZARD FOR YOUNG CHILDREN AND ELDERLY PASSENGERS. FALSE SENSE OF SECURITY KNOWING THAT YOUR PASSENGERS ARE SAFELY SECURED AND NOT AT RISK FOR ACCIDENTALLY OPENING DOOR AND THRUST OUT OF THE VEHICLE. DOOR WAS ACIDENTALLY OPEN WHILE IN MOTION.",
        "vin": "1FAFP34N564"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "02/11/2016",
        "dateOfIncident": "02/10/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10825700,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR WAS INVOLVED IN A COLLISION AND AIRBAGS DID NOT DEPLOY WHEN THEY SHOULD HAVE.",
        "vin": "1FAHP31N56W"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/08/2016",
        "dateOfIncident": "01/08/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10824965,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE SLID ON BLACK ICE, UP AN EMBANKMENT AND INTO A UTILITY POLE.  THE AIRBAGS DID NOT DEPLOY. OPERATOR WAS WEARING SEATBELT, STRUCK FOREHEAD ON STEERING WHEEL SUSTAINING A LACERATION THAT REQUIRED 20 STITCHES.  OPERATOR WAS TRANSPORTED TO HOSPITAL BY AMBULANCE, WHERE HE WAS SUBSEQUENTLY PUT ON A VENTILATOR BECAUSE OF POSSIBLE BLEEDING IN THE BRAIN.  OPERATOR, THANKFULLY MADE A FULL RECOVERY, BUT WILL BE PERMANENTLY SCARRED.",
        "vin": "1FAFP34N66W"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/25/2015",
        "dateOfIncident": "11/24/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10806712,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD FOCUS. THE CONTACT STATED THAT WHEN THE IGNITION KEY WAS TURNED, IT WOULD REMAIN STUCK IN THE ON OR OFF POSITION. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS INFORMED THAT THE KEY MIGHT NEED TO BE REPLACED. THE CONTACT MENTIONED THAT THE VEHICLE WAS LEFT AT THE DEALER. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 123,000.",
        "vin": "1FAHP34N96W"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/27/2015",
        "dateOfIncident": "10/26/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10786231,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE SPEED (RPM) INTERMITTENTLY INCREASES, OR FAILS TO DECREASE WHEN THROTTLE IS RELEASED.  PROGRESSIVELY WORSENENING.  LAST NIGHT, STUCK AT INTERSTATE SPEED AND KEPT ENGINE AT HIGH RPM.  WIFE SEMI PANICKED HIT BRAKES AND PULLED OFF ON SHOULDER.  AFTER 2 HOUR WAIT, STILL STICKY, BUT DRIVEABLE.  MANY IDENTICAL REPORTS/FIXES ON UTUBE. POSSIBLY RELATED FAULT CODES P0410 , P0491",
        "vin": "1FAFP36N76W"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "09/30/2015",
        "dateOfIncident": "08/23/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10778841,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "HVAC BLEND DOOR STUCK IN VENT POSITION.  MOVING, 55 MPH, RURAL 2 LANE HIGHWAY.  ATTEMPTED TO ADJUST FROM VENT MODE AND HEARD A SNAPPING SOUND AND THE KNOB MOVED FREELY WITHOUT ADJUSTING THE VENT SELECTION.  TOOK THE ASSEMBLY APART LATER AND DETERMINED THE STEEL CABLE GOING TO THE HVAC BLEND DOOR HAD BROKEN FREE FROM THE ADJUSTER KNOB.  UNABLE TO USE THE DEFROST VENTS TO CLEAR THE WINDSHIELD UNTIL THE PROBLEM WAS REPAIRED.      PROBLEM REPAIRED FOR $60 FOR A NEW ASSEMBLY AND HALF AN HOUR OF PERSONAL LABOR.",
        "vin": "1FAFP34NX6W"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/27/2015",
        "dateOfIncident": "02/16/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10743726,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD MULTIPLE INCIDENTS SINCE I INHERITED THE CAR FROM MY FATHER WHERE THE KEY STICKS IN THE STEERING COLUMN AND CANNOT BE REMOVED.  IT APPEARS TO BE A YEARLY EVENT WHERE I NEED TO TAKE THE CAR IN TO HAVE THE KEY REMOVED FROM THE STEERING COLUMN.  I'VE OWNED MANY CARS IN MY 50 YEARS OF DRIVING AND HAVE NEVER HAD A PROBLEM REMOVING THE KEY FROM THE IGNITION IN ANY OF THE OTHERS.",
        "vin": "1FAFP36N46W"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "07/27/2015",
        "dateOfIncident": "07/01/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10743243,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 FORD FOCUS.  CONSUMER WRITES IN REGARDS TO PASSENGER SEAT BELT REPAIR ISSUES.  *SMD  THE CONSUMER STATED WHENEVER A PASSENGER, NOT A CHILD SAT IN THE RIGHT FRONT PASSENGER SEAT WITH THE SEAT BELT FASTENED PROPERLY, AT SOME POINT, EITHER RIGHT AWAY OR AFTER DRIVING SEVERAL MILES, THE SEAT BELT DISABLE LIGHT WOULD ILLUMINATE. IT WOULD ONLY GO OUT WHEN THE SEAT BELT WAS UN-BUCKLED. IN FACT, IF THE PASSENGER  WAS SEATED AND NOT WEARING THE SEAT BELT, THE DISABLE LIGHT DID NOT ILLUMINATE.  THE CONSUMER WAS INFORMED A NEW PASSENGER SEAT CUSHION WOULD NEED TO BE ORDERED DUE TO THE SENSORS BEING LOCATED THERE. THE CONSUMER SPENT OVER $2100 AND THE PROBLEM CONTINUED. *JB",
        "vin": "1FAHP34N36W"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "06/24/2015",
        "dateOfIncident": "12/10/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10727046,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD FOCUS. THE CONTACT STATED THAT THE DRIVER SIDE SEAT BELT FAILED TO FASTEN. THE VEHICLE WAS TAKEN TO THE DEALER; HOWEVER, THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 55,000.",
        "vin": "1FAFP34N56W"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "06/10/2015",
        "dateOfIncident": "07/15/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10724499,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD FOCUS. THE CONTACT STATED THAT THE WINDOW DEFROSTER BECAME INOPERABLE, WHICH MADE IT DIFFICULT TO SEE THROUGH THE WINDSHIELD. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 140,000.",
        "vin": "1FAHP34N06W"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/29/2015",
        "dateOfIncident": "05/04/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10722231,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "KEY IS STUCK IN IGNITION DUE TO BROKEN PLASTIC RING ON GEAR SHIFT IT BROKE IN SEVERAL PIECES AND WILL NOT GO UP SINCE THE WHOLE PLASTIC SLEEVE IS BROKEN TOO SHIFT WILL NOT GO IN PARK ALL THE WAY SO KEY IS STUCK I HAVE TO LEAVE KEY IN IGNITION",
        "vin": "1FAFP34NX6W"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/21/2015",
        "dateOfIncident": "05/15/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10720936,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR DOOR LOCKS WILL NOT OPERATE.  THE DOOR WILL LATCH, BUT THE REAR DOORS WILL NOT LOCK.  THIS IS A SAFETY HAZARD AS CHILDREN IN THE BACK SEAT CAN OPEN AN UNLOCKED DOOR WHILE THE CAR IS IN MOTION.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/02/2015",
        "dateOfIncident": "02/07/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10691681,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING ON THE NYS THRUWAY MY CAR BEGAN TO ACCELERATE ON ITS OWN.  I TOOK MY FOOT OFF THE GAS PEDAL & IT BEGAN GOING FASTER. AT 85 MILES PER HOUR I PRESSED THE BRAKE PEDAL & SHIFTED THE CAR INTO NEUTRAL (5 SPEED MANUAL). THE GAS PEDAL FELL TO THE FLOOR. I EVENTUALLY GOT OVER TO THE SHOULDER BUT THE CAR WAS REVVING EXTREMELY HIGH. I IMMEDIATELY TURNED THE CAR OFF. I WAITED A FEW MINUTES,STARTED IT UP AGAIN & IT STILL WAS REVVING VERY HIGH. I REMOVED THE FLOOR MAT & INSPECTED THE GAS PETAL, THERE WAS NO INTERFERENCE. I PUSHED ON THE GAS PEDAL SEVERAL TIMES. IT NOW HAD SOME PRESSURE BUT WAS A BIT STICKY FEELING LIKE IT WAS CATCHING. WHEN I STARTED THE CAR UP AGAIN, IT RAN NORMALLY. I GOT OFF AT THE NEXT EXIT & DROVE IT HOME. WHILE DRIVING HOME IT BEGAN ACCELERATING ON IT'S OWN AGAIN. I HAD TO USE THE BRAKE PEDAL SEVERAL TIMES TO KEEP MY SPEED DOWN. I TOOK IT INTO THE REPAIR SHOP & THE MECHANIC COULD NOT FIND ANY PROBLEM. THE CAR RAN FINE FOR ABOUT A WEEK BUT THEN WHILE AT STOP SIGNS/TRAFFIC LIGHTS IT WOULD BEGIN CUTTING OUT & DYING. I HAD TO PUT THE CAR IN NEUTRAL, HAVE ONE FOOT ON THE BRAKE & PUMP THE GAS PETAL TO KEEP THE CAR RUNNING. WHILE IN TRAFFIC IT WOULD DIE ON ME. I TOOK IT TO THE REPAIR SHOP AGAIN. THE CAR WAS RUNNING FINE BY THE TIME I GOT TO THE SHOP. THE MECHANIC CLEANED THE THROTTLE BODY & THE IYAK WAS REPLACED.  MINOR CARBON DEPOSITS WERE FOUND BUT NOT ENOUGH THAT SHOULD CAUSE A PROBLEM.THE CAR IS STILL RUNNING WITH THE INTERMITTENT UNINTENTIONAL ACCELERATION/HIGH REVVING THEN LACK OF POWER/ROUGH RUNNING. THESE SITUATIONS ARE VERY SCARY BECAUSE I NEVER KNOW WHEN IT WILL BEGIN ACCELERATING, REVVING/CUTTING OUT & HAVING NO ACCELERATION...EVEN WHEN THE PETAL IS TO THE FLOOR.  MY MECHANIC CONTACTED OUR LOCAL FORD DEALERSHIP (ALL AMERICAN FORD) AND THEY DENIED THAT THERE HAVE BEEN ANY ISSUES LIKE THIS.  HOWEVER, WHEN I RESEARCH ONLINE, I FIND MANY.  *TR",
        "vin": "1FAFP34N66W"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/01/2015",
        "dateOfIncident": "02/28/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10691370,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR PASSENGER SIDE DOOR LOCK DOES NOT LOCK. THIS IS THE SIDE THE BABY CARSEAT IS LOCATED. ALL THE OTHER DOORS DO LOCK/UNLOCK. IT HAPPENED SUDDENLY WITHOUT ANY REASON. I HAVE NOTICED MULTIPLE OCCURRENCES OF THIS ISSUE ON INTERNET FORUMS FOR FORD AND FORD DOES NOT HAVE A RECALL OR A MANDATORY FIX BUT THEY NEED TO AS THIS IS A REAL SAFETY AND SECURITY ISSUE!  *TR",
        "vin": "1FAFP34N36W"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/18/2015",
        "dateOfIncident": "02/18/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10684066,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN OPENING THE DRIVER DOOR, THE MECHANISM THAT OPENS THE DOOR FROM THE OUTSIDE BROKE. I AM ABLE TO OPEN IT FROM THE INSIDE.  *TR",
        "vin": "1FAFP34N26W"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/31/2015",
        "dateOfIncident": "11/01/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10680129,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS PEDAL STICKS.  *TR",
        "vin": "1FAFP31N96W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/30/2015",
        "dateOfIncident": "01/30/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10680016,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD FOCUS. THE CONTACT STATED THAT THE AIR BAG WARNING LIGHT ILLUMINATED CONTINUOUSLY. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE AIR BAG NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 70,000.    UPDATED 3/31/15*CN",
        "vin": "1FAFP36N56W"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/16/2015",
        "dateOfIncident": "01/16/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10673021,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD FOCUS. THE CONTACT STATED THAT WHILE DRIVING AT APPROXIMATELY 50 MPH, THE ACCELERATOR PEDAL FAILED TO RETRACT AFTER BEING DEPRESSED. THE FAILURE OCCURRED ON SEVERAL OCCASIONS. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE THROTTLE BODY NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 100,000.",
        "vin": "1FAFP34N06W"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/19/2014",
        "dateOfIncident": "12/01/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10667373,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN IT IS UNDER  32 DEGREES. GAS PEDAL FREEZES UP WHEN TRYING A ACCELERATE FROM A STOPPED POSITION. I WHEN TRYING TO CORRECT CAUSES SUDDEN ACCELERATION.  *TR",
        "vin": "1FAFP31N56W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/11/2014",
        "dateOfIncident": "12/11/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10663517,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIR BAG LIGHT WILL NOT GO OFF ON THE CLUSTER BUT GOES OFF ON THE DASH.  *TR",
        "vin": "1FAHP34N76W"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/10/2014",
        "dateOfIncident": "12/06/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10663325,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 FORD FOCUS WAS INVOLVED IN A TWO CAR ACCIDENT WHILE TRAVELING AT 50 MPH. A LARGE PICKUP TRUCK PULLED OUT IN FRONT OF THE FORD FOCUS, AND THE FRONT PASSENGER SIDE OF THE CAR WAS SEVERELY DAMAGED. AS A RESULT OF THE IMPACT, THE DRIVER SIDE AIR BAG DEPLOYED (NO ONE WAS IN THE PASSENGER SEAT), BUT DRIVER SUSTAINED SEVERE INJURIES OF THE LEFT EYE INCLUDING ABRASIONS, BURNS, BRUISING, AND SWELLING/INFLAMMATION AFTER HITTING A HARD SURFACE. DRIVER REQUIRED MEDICAL ATTENTION. IT IS SUSPECTED THAT THERE WAS A DELAYED DEPLOYMENT OF THE AIR BAG WHICH RESULTED IN THE INJURIES.    *TR",
        "vin": "1FAFP34NX6W"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/06/2014",
        "dateOfIncident": "12/05/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10662518,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS PEDAL STARTED STICKING IRREGULARLY AT AROUND 30,000 MILES, EVEN AT LOW SPEEDS.  WAS VERY SPORADIC.  MOST RECENT EVENT HAPPENED 12/5/2014 WHEN GAS PEDAL WAS FROZEN COMPLETELY WHILE TRAVELING AT 70 MPH.  IT WOULDN'T BUDGE.  THEN I PUT MY FOOT ON THE LOWEST EDGE OF THE PEDAL AND IT STARTED WORKING AGAIN.  IF YOU GOOGLE \"FORD FOCUS GAS PEDAL STICKS\", THERE ARE NUMEROUS COMPLAINTS.  THE THROTTLE BODY IS THE APPARENT CAUSE.  FORD SHOULD RECALL THESE VEHICLES DUE TO THE NUMBER OF COMPLAINTS ONLINE.   *TR",
        "vin": "1FAFP34N26W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/22/2014",
        "dateOfIncident": "11/04/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10660213,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG WARNING LIGHT STAYS ON AT ALL TIMES.  *TR",
        "vin": "1FAFP34N56W"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/17/2014",
        "dateOfIncident": "11/16/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10655401,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE SUDDENLY STARTED REVVING UP AND WHEN BRAKES APPLIED COULDN'T STOP VEHICLE COMPLETELY AND LUNGED FORWARD. WAS ABLE TO KEEP CONTROL BY APPLYING BRAKES AND GETTING TO A PARKING AREA, WHEN PLACED IN PARK THE ENGINE WENT UP TO 50000 RPMS.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/23/2014",
        "dateOfIncident": "09/02/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10638328,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD ONLY TWO PROBLEMS WITH  MY 2006 FORD FOCUS. FIRST WE HAVE HAD TO CHANGE THE IGNITION SWITCH TWICE DUE TO THE KEY BEING STICK IN LOCK  WOULD RESTART BUT WOULD NOT COME OUT. SECOND THE INNER DOOR ON THE DEFROST STICKS  WHEN ON FULL DEFROST OR FULL AIR CONDITIONING AND THE  CABLES BRAKE KEEPING THE DRIVER FROM USING THE AIR CONDITIONER OR DEFROST AT THIS POINT IT IS STUCK ON AIR.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "09/16/2014",
        "dateOfIncident": "08/27/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10633516,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR DRIVERS SIDE DOOR WILL NOT LOCK.  NOT WITH THE KEY REMOTE OR MANUALLY.  CHILDREN IN THE BACK SEAT CAN OPEN DOOR ANY TIME.  *TR",
        "vin": "1FAFP34NX6W"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/12/2014",
        "dateOfIncident": "09/12/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10632649,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "A CAR PULLED OUT IN FRONT OF ME HITTING THE FRONT RIGHT TIRE, THEN PUSHED INTO ONCOMING LANE (STOPPED CAR) THE WHOLE FRONT OF MY CAR WAS DESTROYED. MY CAR WAS TOTALED. THE ONLY AIR BAG TO GO OFF WAS THE DRIVERS AIR BAG (MINE.) I HAD MY SISTER IN THE FRONT PASSENGER SEAT & MY BROTHER IN THE BACK SEAT RIGHT SIDE. THE MAIN POINT OF CONTACT WAS THE FRONT RIGHT SIDE, MAINLY WHERE THE TIRE WAS. I STRONGLY FEEL AT LEAST THE PASSENGER AIR BAG SHOULD HAVE WENT OFF.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "08/27/2014",
        "dateOfIncident": "08/18/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10628763,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING DOWN THE STREET AND VEHICLE JUST STOPPED RUNNING/DIED. IT HAS BEEN AT THE DEALER FOR ALMOST TWO WEEKS AND THEY HAVEN'T FIGURED IT OUT YET. NO CALL, SAME RUN AROUND WHEN I CALL ABOUT UPDATE....    *TR",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/06/2014",
        "dateOfIncident": "08/05/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10619421,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "EAGLE GT",
                "productYear": "9999",
                "size": "195/60R15",
                "type": "Tire"
            }
        ],
        "summary": "I WAS COMMUTING TO WORK ON HIGHWAY 59 NORTHBOUND JUST SOUTH OF THE GESSNER EXIT AT 65 MILES PER HOUR WHEN I HEARD A LOUD EXPLOSION AND I NEARLY LOST CONTROL OF THE CAR. MY VEHICLE IS A 2006 FORD FOCUS ZX4 WITH 15 INCH STANDARD ALLOY RIMS. THE LEFT REAR GOODYEAR EAGLE GT TIRE HAD EXPLODED WITHOUT WARNING. I SAW SMOKE EMERGE FROM THE WHEEL WELL AS I BROUGHT MY CAR TO A STOP ON THE EXIT RAMP AT BISSONNET. I CALLED MY HUSBAND WHO CAME OUT TO CHANGE THE TIRE AND UPON REMOVAL WE DISCOVERED THAT THE ENTIRE TREAD SECTION FROM ONE EDGE OF THE RIM TO THE OTHER HAD COMPLETELY COME OFF AND WAS STUCK IN THE WHEEL WELL, LEAVING THE RIM BARE. THERE WAS LIGHT CRACKING ON THE REST OF THE SET ON THE INNER PART OF THE TIRE NEAR THE RIM. THE TIRES WERE PURCHASED ON JUNE 17TH 2011 AT DISCOUNT TIRE AND ONLY HAD 23,000 MILES OF WEAR ON THEM. THEY HAD BEEN REGULARLY ROTATED AND INSPECTED AT DISCOUNT TIRE ON SCHEDULE. THE DOT NUMBER ON THE TIRES IS M7RB K11R 1511. I CONTACTED GOODYEAR CUSTOMER SERVICE TODAY AND THEY TOLD ME THE TIRES ARE NOT UNDER RECALL. MY WIFE COULD HAVE BEEN KILLED BY THIS INCIDENT.   *TR",
        "vin": "1FAFP34N36W"
    },
    {
        "components": "STEERING,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/22/2014",
        "dateOfIncident": "07/01/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10615512,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM REPORTING ONLY THE MOST RECENT INCIDENT I HAVE EXPERIENCED WITH THE STEERING WHEEL CLOCK SPRING ON THIS CAR. THIS VEHICLE HAS HAD THE 4TH CLOCK SPRING IN UNDER 80000 MILES INSTALLED! I BELIEVE THE FIRST WAS REPLACED WITH UNDER 20,000 MILES ON THE CAR. THIS IS CONCERNING, BECAUSE OF THE SRS SYSTEM RELIANCE ON A RELIABLE ELECTRICAL CONNECTION WITH THE CLOCK SPRING. A LETTER TO FORD HAS GONE WITHOUT RESPONSE. THIS IS AN OBVIOUSLY DEFECTIVE PART IN EITHER DESIGN OR MANUFACTURE. IN ALL OF THE TIME I HAVE BEEN DRIVING, WHICH IS 30+ YEARS, I HAVE NEVER NEEDED TO REPLACE A CLOCK SPRING ON ANY VEHICLE I EVER OWNED.  *TR",
        "vin": "1FAHP38Z66W"
    },
    {
        "components": "STRUCTURE,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "07/20/2014",
        "dateOfIncident": "07/15/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10614786,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR PASSENGER DOOR WILL NOT LOCK AND FRONT DRIVER SIDE DOOR HANDLE BROKE WILL NOT OPEN ON THE OUTSIDE,, WENT TO OPEN TO GET IN AND IT JUST PULLED UP BUT DIDN'T OPEN.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/04/2014",
        "dateOfIncident": "07/02/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10608191,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRUCK LATCH ON MY 2006 FORD FOCUS ZXW WOULD NOT ACTUATE ELECTRICALLY WHEN THE BUTTON ON THE FOB OR ON THE DASH WAS PRESSED DUE TO BROKEN WIRE IN A WIRING HARNESS RUNNING FROM THE INTERIOR TO THE REAR HATCH DOOR.  IT WOULD ALSO BLOW FUSE #63 ON THE BACK OF THE INTERIOR FUSE PANEL WHICH MADE REPLACEMENT DIFFICULT (THE FUSE IS REALLY ON THE BACK OF THE FUSE BOX, THE MANUAL RECOMMENDS THAT ONLY THE DEALER SERVICE OR REPLACE THIS FUSE MAKING THIS ISSUE DIFFICULT OR IMPOSSIBLE TO PARTIALLY RESOLVE IMMEDIATELY).    UNTIL THIS FUSE COULD BE REPLACED, MY INTERIOR DOOR LOCKS COULD NOT BE ACTUATED ELECTRICALLY (POWER LOCKS OR FOB) WHICH WAS A SAFETY CONCERN AS ANY CHILDREN IN THE BACK SEAT COULD NOT BE EASILY REACHED IN THE EVENT OF AN EMERGENCY.  ONE WOULD NEED TO MANUALLY UNLOCK ANY AND ALL DOORS FROM THE INSIDE OF THE VEHICLE.    THE CULPRIT WAS WIRING HARNESS THAT HAD WIRES WITH DAMAGE TO THE INSULATION AND TWO BROKEN WIRES.  I WOULD BE HAPPY TO SEND ANY AND ALL PICTURES OF THE DEFECTS.  THE DAMAGE OCCURS WHEN THE HARNESS BENDS AS THE REAR HATCH IS SHUT DUE TO POOR DESIGN THAT DID NOT INCORPORATE A STAIN RELIEF TO EITHER END OF THE HARNESS WHERE MAXIMUM BENDING STRESSES WOULD OCCUR.    THE WIRES MAY HAVE ALSO SHORTED AFFECTING THE BRAKE LIGHT OPERATION, MARKER LAMP OPERATION, AND NUMEROUS OTHER FUNCTIONS AS THERE ARE AN ESTIMATED TEN WIRES THAT RUN IN PARALLEL IN THIS HARNESS AND ALL WIRE EXCEPT TWO HAD MULTIPLE INSULATION DEFECTS THAT POTENTIALLY RESULTING IN SHORTS.     THIS IS A DEFINITE SAFETY ISSUE AND ALL HARNESSES THAT HAVE THE POTENTIAL FOR THIS TYPE OF FAILURE SHOULD BE REPLACED OR REPAIRED IMMEDIATELY.  *TR",
        "vin": "1FAFP36N56W"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "04/07/2014",
        "dateOfIncident": "03/19/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10578100,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2006 FORD FOCUS ZX5. IN MARCH 2014, I NOTICE THE PASSENGER BACK DOOR WOULD NOT LOCK. I DID SOME RESEARCH BUT FOUND OUT THERE WAS NO RECALL ON MY 2006. I DID SEE 2005, 2008 BUT NOT MINES. I DID SPEND OVER 300.00 DOLLARS TO HAVE IT REPAIRED AND NOW TWO WEEKS LATER MY FRONT DOOR PASSENGER SIDE STOP WORKING. THIS IS A PROBLEM WITH THE VEHICLE. I AM THE ONLY DRIVER AND I HAVE NO CHILDREN PLAYING WITH MY LOCKS. I WISH SOMEONE COULD ASSIST ME WITH THIS ISSUE.  *TR",
        "vin": "1FAHP37N36W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/30/2014",
        "dateOfIncident": "03/15/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10575675,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "1ST TIME, 08/21/2008, 35950, AIR BAG FAILURE OF DRIVERS SIDE, BILL SUMMERS FORD  OF NORTH PLATTE FIXED.    2ND TIME APPROX. 09/2011AT 49000 MILES DRIVERS SIDE AIR BAG FAILURE  AND BILL SUMMERS FORD FIXED IT AGAIN    3RD TIME AT APPROXIMATELY 90,000 MILES DRIVERS AIR BAG WARNING IS ON AGAIN OF DRIVERS SIDE AIR BAG FAILURE.    I DON'T BELIEVE SAFETY FEATURES SUCH AS AIRBAGS SHOULD BE AN ONGOING MAINTENANCE PROBLEM.  *TR",
        "vin": "1FAFP34N26W"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/11/2014",
        "dateOfIncident": "01/01/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10563815,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THIS CAR AND RECENTLY MY CAR HAS BEEN BOGGING DOWN AND LOSING POWER. I WAS TOLD IT WAS A OXYGEN SENSOR . NOW MY SHIFT IS OFF , CANNOT TELL WHAT GEAR IT'S IN . AND MY DRIVERS DOOR HANDLE HAS BROKEN NOT ONCE BUT TWICE .  *TR",
        "vin": "1FAFP34N36W"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/11/2014",
        "dateOfIncident": "10/01/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10559480,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HATCH ON THE DRIVERS SIDE DOOR OF MY FORD FOCUS 2006 DOES NOT FUNCTION AND CAUSES THE DOOR TO OPEN WHILE I AM DRIVING. IT HAS ALSO PROHIBITED ME FROM MANUALLY LOCKING THE DOOR.  *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/25/2013",
        "dateOfIncident": "11/23/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10553664,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS SPEED CONTROL PROBLEM NEARLY COST ME MY LIFE THE OTHER NIGHT AND FORTUNATELY NO ACCIDENT.  I WAS DRIVING ON HIGHWAY AND IT FELT LIKE PEDDLE STUCK...CAR ACCELERATED AND WOULD NOT SLOW DOWN .  I KEPT HITTING GAS TO TRY TO RELEASE IT, THOUGHT MAT IN WAY AND IT WASN'T.  LET THE RECORD REFLECT THIS CAR HAS THIS PROBLEM FOR MANY AND IF I GET KILLED.  GOOD LUCK FORD MOTOR CO.  THIS IS THE 3RD TIME. AND EVERYONE SAYS ITS JUST A PROBLEM WITH CAR.  WELL, THIS PROBLEM COULD KILL SOMEONE.  *TR",
        "vin": "1FAHP34N46W"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "11/16/2013",
        "dateOfIncident": "05/08/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10552564,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER'S SEAT BACK FRACTURED AT SUPPORTING STRUCTURE CAUSING LACERATIONS, CONTUSION, AND SPRAIN RELATED INJURIES INVOLVING WHIPLASH AND INSTABILITY FOR THE DRIVER.  *TR",
        "vin": "1FAFP37N56W"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "09/17/2013",
        "dateOfIncident": "06/03/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10544163,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIR VENT SELECTOR JAMMED WHEN IT SUDDENLY WAS NEEDED FOR DEFROST, THEN THE CABLE BROKE AND THE AIR VENT SETTING FOR DEFROST COULD NOT BE SELECTED, LEADING TO A DANGEROUS SITUATION WITH NO FORWARD VISIBILITY WHILE ON THE HIGHWAY. I FOUND MANY OTHER FOCUS OWNERS WITH THE SAME PROBLEM ONLINE, DUE TO A DEFECTIVE SEAL THAT TURNS TO GUM AND STICKS SHUT. THIS CAN LEAD TO UNEXPECTED AND SUDDEN LOSS OF DEFROSTING CAPABILITY, AND VISIBILITY CAN BE LOST IN SECONDS. WE ALSO HAVE ANOTHER FOCUS THAT IS STARTING TO STICK, SO THIS IS NOT AN ISOLATED PROBLEM WITH THESE CARS, APPROXIMATELY FROM MODEL YEAR 2005 - 2007.  *TR",
        "vin": "1FAHP36N56W"
    },
    {
        "components": "POWER TRAIN,AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "09/16/2013",
        "dateOfIncident": "09/15/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10543805,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I CHOSE 'CRASH' ABOVE ONLY BECAUSE THERE WAS CONTACT BETWEEN TWO VEHICLES.  AT A RED LIGHT, THE FOCUS ROLLED INTO THE CAR IN FRONT AT NO MORE THAN 3-5 MPH.  AIR BAG DEPLOYED, SEAT BELTS LOCKED.  ZERO DAMAGE TO EITHER VEHICLE, EXCEPT SMALL DENT TO THE LICENSE PLATE,  I TOOK THE VEHICLE TO MY BODY SHOP.   AFTER INSPECTING THE VEHICLE, THEY ARE ALSO CONFUSED AS TO WHY IT DEPLOYED.   ESTIMATE TO REPAIR IS $1800.   IS THIS NORMAL?  IS THIS A KNOWN ISSUE WITH THE 2006 FOCUS?  *TR",
        "vin": "1FAFP34N96W"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/19/2013",
        "dateOfIncident": "08/25/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10536079,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE HAD COMPLETE ELECTRICAL FAILURE 3 TIMES WITH MY CAR FIRST TIME WAS AT 12,500 MILES, 2ND. 61 MILES LATER AND LAST WEEK WITH 20,500 MILES.  EACH TIME DEALERSHIP TOLD ME THAT MY ALTERNATOR HAD GONE BAD.  WAYNE AKERS FORD, LAKE WORTH, FL PUT IN THE FIRST TWO REPLACEMENT ALTERNATORS AND CAR IS NOW AT AN INDEPENDENT MECHANIC FOR A SECOND OPINION.  *TR",
        "vin": "1FAFP34N66W"
    },
    {
        "components": "ELECTRICAL SYSTEM,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "08/13/2013",
        "dateOfIncident": "08/01/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10535054,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR PASSENGER DOOR WON'T LOCK.  MY WIFE \"APPARENTLY\" LOCKED THE CAR AT WORK IN AN OPEN PARKING LOT AND LATER WENT TO RETRIEVE SOMETHING FROM BACK SEAT TO FIND THAT THE DOOR WAS NOT LOCKED.  NO INDICATION WAS GIVEN WHEN LOCKING THE CAR USING THE REMOTE LOCKING MECHANISM THAT THERE IS AN ISSUE BECAUSE IT SOUNDS LIKE IT IS FULLY LOCKED. IT ISN'T.  I CHECKED THE ISSUE BY HAVING HER DRIVE UP AND DOWN THE ROAD MAKING SURE SHE THOUGHT ALL DOORS WERE LOCKED AND WHILE SHE HAD STOPPED, I OPENED THE REAR PASSENGER DOOR AND JUMPED IN THE BACK SEAT MUCH AS AN ATTACKER OR CARJACKER MIGHT DO.  THIS IS A SAFETY ISSUE BECAUSE ANYONE CAN JUMP IN THE BACK OF THE CAR WHILE STOPPED AT TRAFFIC LIGHTS EVEN THOUGH THE OWNER MAY THINK THAT THE CAR IS SECURELY LOCKED, IT JUST MIGHT NOT BE.  BEWARE AND CHECK ALL YOUR DOOR LOCKS ON A REGULAR BASIS AS THIS SEEMS TO BE REPORTED ON MULTIPLE OCCASIONS ON FORD FOCUS INTERNET FORUMS.  TO THIS DATE, WE HAVE NO IDEA WHEN THE ACTUAL LOCKING MECHANISM FAILED AS IT IS NOT SOMETHING WE, OR ANY OTHER DRIVER WOULD CHECK ON A REGULAR BASIS.  *TR",
        "vin": "1FAFP37N96W"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/08/2013",
        "dateOfIncident": "01/16/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10534250,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLES SHIFTER BUTTON FAILED TO ENGAGE. INITIALLY DISCOVERED IT WAS DUE TO A BLOWN FUSE (#32.) AFTER REPLACING, VEHICLE OPERATED FINE FOR A FEW DAYS, BUT AGAIN SHIFTER BUTTON FAILED TO ENGAGE. INVESTIGATED ON THE INTERNET AND FOUND OUT THE BLOWN FUSE WAS DUE TO CRACKED WIRING INSULATION CAUSING EXPOSED WIRES IN THE REAR HATCH.  ALSO LEARNED THIS ISSUE CAUSED THE REAR TAIL AND BRAKE LIGHTS NOT TO OPERATE. FOUND MULTIPLE COMPLAINTS ON THE INTERNET REGARDING THIS SAME ISSUE OF WHICH IT WAS ULTIMATELY DUE TO A DESIGN FLAW BECAUSE THE WIRES ON THE REAR WIRING HARNESS ARE TOO SHORT.  *TR",
        "vin": "1FAFP31N56W"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/09/2013",
        "dateOfIncident": "11/27/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10515889,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FIRST INCIDENT OF KEYS GETTING STUCK IN THE IGNITION WAS ON NOVEMBER 27, 2009 IN IOWA. WE LIVE IN MINNESOTA AND HAD TO GO TO THE FORD DEALERSHIP TO HAVE THE IGNITION REPLACED FOR $485.91. LESS THAN FIVE YEARS LATER ON JUNE 4, 2013 THE KEYS GOT STUCK IN THE IGNITION AGAIN. THIS TIME LUCKILY WE WERE AT HOME. I RESEARCHED ONLINE AND FOUND THAT THIS HAS BEEN A PROBLEM WELL KNOWN TO FORD SINCE 2000, YET THEY REFUSE TO FIX THE ISSUE.   AFTER SOME MORE RESEARCH I FOUND A SOLUTION. THERE IS A THREE RING PIECE BETWEEN THE SHIFTER HANDLE AND THE SHAFT. SIMPLY PUSH IT BACK UP TOWARD THE HANDLE AND PRESTO THE KEYS COME OUT. THIS IS A FREE SOLUTION. I AM CURIOUS IF I CALLED FORD IF THEY WOULD TELL ME  THIS SOLUTION OR FOR THAT MATTER EVEN FIX THE PART SINCE IT IS LESS THAN FIVE YEARS. IS IT UNDER WARRANTY?     ANOTHER PROBLEM IS OUR CD PLAYER HAS A CD STUCK THAT WE CANNOT GET OUT. WE WERE TOLD THAT IT WOULD BE CHEAPER TO GO TO BEST BUY AND BUY AN UPGRADED ONE THAN TO HAVE A DEALERSHIP FIX IT.     AT 85000 MILES ANOTHER PROBLEM IS WE HAD TO GET OUR HEAT SHIELD REPLACED BECAUSE IT WAS RUSTING AND ABOUT TO FALL OFF.   *TR",
        "vin": "1FAHP34N26W"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/05/2013",
        "dateOfIncident": "06/01/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10515300,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD FOCUS. THE CONTACT STATED THAT THE TRANSMISSION FAILED WHILE DRIVING 65 MPH AND THE CONTACT WAS UNABLE TO ACCELERATE OVER 35 MPH. IN ADDITION, THE GEAR SHIFT LEVER COULD NOT BE SHIFTED.  THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGE WAS 121,000.",
        "vin": "1FAHP34N66W"
    },
    {
        "components": "ELECTRICAL SYSTEM,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "05/20/2013",
        "dateOfIncident": "05/11/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10512912,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR PASSENGER DOOR DOES NOT LOCK ON OUR 2006 FORD FOCUS ZX4. IT OPENS AND CLOSES CORRECTLY. IT JUST WON'T LOCK, EVEN WITH CHILD LOCK ON. ALL OTHER DOORS OPERATE CORRECTLY. THIS DOOR OPERATED CORRECTLY BEFORE. WE HEARD FORD HAD A PROBLEM WITH THIS ON PREVIOUS FOCUS MODELS. CUT OFF WAS THE YEAR 2005 FOR THIS PROBLEM. WE FEEL UNSAFE FROM THIS PROBLEM BECAUSE WE TRANSPORT OUR SENIOR MOMS TO SHOPPING TRIPS.  *TR",
        "vin": "1FAHP34N96W"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/19/2013",
        "dateOfIncident": "03/19/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10508879,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY KEY KEEPS GETTING STUCK IN THE IGNITION. MY HUSBAND GOT IT OUT THE FIRST TIME BUT THIS TIME EVEN OUR CAR SERVICE MAN COULD NOT GET IT OUR. WE WERE TOLD TO CONTACT A LOCKSMITH, SO WE HAD ONE COME OUT, HE TOLD US BEFORE HE CAME IT IS A KNOW PROBLEM ON THE FOCUS FROM YEAR 2000 TILL CURRENT. IT COST ME $170.00 FOR HIM TO TAKE IT OUT. HE TOLD ME TO CALL AND SEE IF THEY EVER HAD A RECALL ON IT. WHEN I CALLED THE FORD DEALER, THE SERVICE TECH TOLD ME SHE NEVER HEARD OF ANY KEYS GETTING CAUGHT, SHE TOLD ME TO BRING IT IN. I REALLY THINK IF THIS IS AN ONGOING PROBLEM SOMETHING NEEDS TO BE DONE. I AM RETIRED AND CANT AFFORD TO TAKE IT IN EVERY TIME THE KEY IS STUCK. I AM SURE IT WILL HAPPEN AGAIN.I ASKED SOMEONE AT WORK WHO KNOWS A LOT ABOUT CARS IF THIS EVER HAPPENED TO HIM HE SAID NO BUT I HEAR FORD FOCUS IS A BAD ONE FOR THAT, HE DOESN'T EVEN KNOW I DRIVE ONE. HE TOLD ME TO CONTACT YOU AND FILE A REPORT.  *TR",
        "vin": "1FAFP4N66W1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/12/2013",
        "dateOfIncident": "02/24/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10502533,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD FOCUS. THE CONTACT STATED THAT THE VEHICLE WOULD NOT RUN AS SMOOTH WHEN DRIVING AT 45 MPH AND THE VEHICLE WOULD ALSO JERK ABNORMALLY. THE VEHICLE WAS TAKEN TO A LOCAL MECHANIC, WHO PERFORMED A DIAGNOSTIC BUT WAS UNABLE TO GENERATE A FAILURE CODE. THE TRANSMISSION WAS ALSO INSPECTED AND THE FAILURE WAS LOCATED AT THE TRANSMISSION SOLENOID SPRINGS. THE TRANSMISSION WAS REBUILT BY THE MECHANIC AND THE FAILURE WAS REMEDIED. THE MANUFACTURER WAS CONTACTED AND ADVISED THAT THE VEHICLE WAS NOT INCLUDED IN ANY RECALLS PERTAINING TO THE TRANSMISSION. THE APPROXIMATE FAILURE MILEAGE WAS 48,000 AND THE APPROXIMATE CURRENT MILEAGE WAS 49,000.   UPDATED 05/08/13*LJ",
        "vin": "1FAFP34N26W"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/27/2013",
        "dateOfIncident": "06/25/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10500577,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2006 FOCUS ZX5 STARTED INTERMITTANTLY UNLOCKING THE HATCHBACK WHEN I STEPPED ON THE BRAKE PEDAL. I WAS DRIVING ON THE FREEWAY WHEN I PULLED OVER TO TAKE A PHONE CALL. I LEFT THE CAR IN DRIVE WITH MY FOOT ON THE BRAKE PEDAL. AFTER ABOUT 5 MINUTES I COMPLETED MY CALL AND MERGED BACK INTO TRAFFIC. WHEN I REACHED MY DESTINATION I PARKED MY CAR AND GOT OUT. I RETURNED TO MY CAR, STARTED THE ENGINE AND COULD NOT GET THE GEAR SHIFT OUT OF PARK. I HAD SOMEONE WATCH MY BRAKE LIGHTS WHILE I STEPPED ON THE BRAKE PEDAL. THE LIGHTS DID NOT WORK AND I FOUND THE FUSE FOR THE BRAKE LIGHTS WAS BAD. I TOOK A FUSE FROM ANOTHER CIRCUIT AND GOT HOME. I HAD BEEN DRIVING FOR 20 MILES WITH NO BRAKE LIGHTS. I TOOK THE CAR TO A FORD DEALER AND THEY FOUND A BROKEN WIRE AND 6 OTHER WIRES WITH CRACKING INSULATION. THEY SAID THEY FIXED THE PROBLEM AND THE CAR WORKED OK. IN JANUARY OF 2013 I NOTICED AFTER CLOSING MY HATCHBACK AND GETTING IN THE CAR MY THE \"DOOR OPEN\" INDICATOR STAYED ON. I CHECKED ALL DOORS AND THE HATCHBACK AND ALL WERE CLOSED. AFTER FINDING OUT ON-LINE THAT THERE HAVE BEEN COMPLAINTS ABOUT THE FOCUS WIRING SINCE THE 2000 MODELS, I TOOK OFF THE CARBODY END OF THE RUBBER CONDUIT TO THE HATCHBACK. I FOUND A BROKEN WIRE (FIXED MY DOOR OPEN INDICATOR PROBLEM WHEN I REPAIRED IT) AND 6 WIRES WITH BLACK ELECTICAL TAPE ON THEM. I FOUND THAT THE ELECTRICAL TAPE IS WEARING THROUGH JUST LIKE THE WIRE INSULATION DID. I CONTACTED THE DEALER AND COMPLAINED ABOUT THE HALF ASS REPAIR THEY DID. THE SERVICE MANAGER STATED THAT WAS THE REPAIR AUTHORIZED BY THE EXTENDED WARRANTY. I ASKED WHAT REPAIR WAS AUTHORIZED BY THE ORIGINAL WARRENTY AND HE SAID THE SAME REPAIR. FORD HAS KNOWN THAT THIS HARNESS IS A PROBLEM SINCE 2000 AND I WAS TOLD THEY ARE STILL USING THE WIRING IN THEIR 2013'S. WHY HAVEN'T THESE CARS BEEN RECALLED!  *TR",
        "vin": "1FAFP37N76W"
    },
    {
        "components": "VEHICLE SPEED CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/22/2013",
        "dateOfIncident": "01/05/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10499675,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2006 FORD FOCUS HAD A GAS PEDAL STICKING ON TWO OCCASIONS.  THE DEALER EVENTUALLY FIGURED OUT THE THROTTLE CABLE FROM THE CRUISE CONTROL HAD KINKED.  THE RESULT IS A PEDAL THAT COMPLETELY STOPS AND FREEZES.  IT FEELS LIKE IT IS A LEAD WEIGHT.  THE CAR TEMPORARILY HAS NO ACCELERATION.   IN A CONGESTED TRAFFIC AREA THIS IS AN EXTREMELY DANGEROUS SITUATION.  IT MOST LIKELY ONLY HAPPENS AT HIGH SPEEDS, BECAUSE OF WHERE THE KINK IS.  THIS HAPPENED WITH NO WARNING.   THERE APPEARS TO BE SIMILAR EVENTS HAPPENING TO OTHER OWNERS.  THE DEALER DID NOT OFFER TO FIX THE CABLE (POST WARRANTEE), BUT DID DISCONNECT IT, AFTER I PAID $100 DIAGNOSES.  THE PROBLEM HAS NOT RE-OCCURRED YET.  *TR",
        "vin": "1FAFP36N06W"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/16/2013",
        "dateOfIncident": "01/02/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10493185,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD FOCUS. THE CONTACT WAS DRIVING APPROXIMATELY 65 MPH WHEN THE ACCELERATOR PEDAL WAS DEPRESSED AND BECAME STUCK IN OPEN THROTTLE POSITION. THE VEHICLE DID NOT ACCELERATE BUT INSTEAD, INDEPENDENTLY DECELERATED TO 30 MPH. THE ACCELERATOR PEDAL WAS RELEASED AFTER THE CONTACT REPEATEDLY DEPRESSED THE PEDAL. THE VEHICLE WAS NOT TAKEN TO THE DEALER FOR INSPECTION OR REPAIRS.  THE FAILURE RECURRED SPORADICALLY. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE PROBLEM. THE APPROXIMATE FAILURE MILEAGE WAS 77,000.",
        "vin": "1FAFP36N16W"
    },
    {
        "components": "VEHICLE SPEED CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/31/2012",
        "dateOfIncident": "12/29/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10490545,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE GAS PEDDLE STICK WIDE OPEN ABOUT 6000 RPM COLD OUT SIDE WITH SNOW, 10 DEGREES F.  YOUNG GIRL 2 YEARS OF DRIVING EXPERIENCE DROVE OUT OF CONTROL UNTIL TOLD TO SHUT ENGINE OFF AND PUT IN NEUTRAL. DROPPED OFF AT CERTIFIED MECHANIC HE CLEANED CARBURETOR TRIED TO LOOK AT CONTROL CABLE THINGS CHECKED OUT FINE. NO WARNING CODES CAME UP.  DROVE HE NEXT DAY AFTER PICKING UP 10 DEGREES F, SAME ISSUE STICKING ACCELERATOR.  I LOOK AGAIN AT IN TAKE CLEANED IT OUT AGAIN, ISSUE HAPPENED AGAIN BUT NOT AS BAD.  VERY DANGEROUS FOR A YOUNG GIRL WITH 2 YEARS DRIVING EXPERIENCE.   *TR",
        "vin": "1FAFP34N76W"
    },
    {
        "components": "STRUCTURE,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "12/26/2012",
        "dateOfIncident": "12/17/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10490081,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR THE 3RD TIME A REAR DOOR LOCK  ON MY FORD FOCUS HAS FAILED. TWICE ON RIGHT ONCE ON LEFT. THE LOCK JAMS. CANNOT LOCK. BUT A DANGER TO A CHILD IN THE CAR AS YOU CANNOT OPEN THE DOOR FROM THE INSIDE. NOR CAN YOU SECURE THE CAR FROM CAR JACKERS SINCE IT WILL NOT LOCK,.  *TR",
        "vin": "1FAHP34N46W"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/11/2012",
        "dateOfIncident": "12/03/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10488059,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I TRY TO START MY CAR IT DOESN'T WANT TO STAY RUNNING UNLESS I PUSH THE ACCELERATOR PEDAL AND AT THE SAME TIME MY ACCELERATOR PEDAL WANTS TO STICK WHEN I PUSH IT TO GO. I HAD IT  CHECKED AND NOBODY CAN SEEM TO FIND THE ISSUE.  *TR",
        "vin": "1FAFP34N16W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/29/2012",
        "dateOfIncident": "11/21/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10486458,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD FOCUS. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 65 MPH, THE DRIVER'S SIDE CURTAIN AIR BAG DEPLOYED WITHOUT WARNING. THE CONTACT WAS NOT INJURED. THE VEHICLE WAS LATER TAKEN TO AN INDEPENDENT MECHANIC WHERE THEY ADVISED THE CONTACT THAT THERE WAS A DEFECT WITH THE AIR BAGS AND THAT THEY SHOULD ONLY HAVE DEPLOYED IN THE EVENT OF A CRASH.  THE MANUFACTURER WAS LATER CONTACTED BUT OFFERED NO ASSISTANCE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGES WERE APPROXIMATELY 54,000.",
        "vin": "1FAHP34N46W"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "11/01/2012",
        "dateOfIncident": "10/20/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10482843,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD FOCUS. THE CONTACT STATED THAT WHILE TRYING TO OPEN THE PASSENGER SIDE REAR DOOR IT SEIZED. THE CONTACT WAS ABLE TO OPEN THE DOOR FROM THE INSIDE. THE CONTACT WAS ABLE TO DRIVE TO THEIR DESTINATION. THE VEHICLE WAS NOT TAKEN TO A MECHANIC. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS CONTACTED ABOUT THE ISSUE AND INFORMED THE CONTACT THAT THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN ID NUMBER 05V030000 (LATCHES/LOCKS/LINKAGES: DOORS: LATCH). THE FAILURE MILEAGE WAS 190,250 AND THE CURRENT MILEAGE WAS 191,080.",
        "vin": "1FAFP34N96W"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/11/2012",
        "dateOfIncident": "07/15/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10479747,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SUNDAY JULY 15, 2012 I WAS IN AUTO ACCIDENT IN WHICH CAR ROLLED OVER THREE TIMES ON THE INTERSTATE SLIDE DOWN INTERSTATE AND LANDED UPSIDE DOWN I HAD TO CLIMB OUT THRU DRIVER SIDE WINDOW TO EXIT CAR. THE DRIVER NOR PASSENGER SIDE AIRBAGS DEPLOYED IN THE CAR. SUFFERED LIGAMENT DAMAGE IN NECK FROM SEAT BELT AND WHIPLASH BURN MARK ON LEFT ARM FROM SPARKS FLYING OFF THE CAR, AND BAD CONTUSIONS TO LUNGS FROM CHEST HITTING STEERING WHEEL. CONTACTING FORD MOTOR COMPANY TO FILE CLAIM NO RESPONSE FROM THEM EVEN THO THEY WERE SUBMITTED PHOTOS OF PROOF THAT AIRBAGS DIDN'T DEPLOY ETC.  *TR",
        "vin": "1FAFP34N36W"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/10/2012",
        "dateOfIncident": "10/01/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10479590,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAD BEEN TAKEN IN TO FORD DEALERSHIP  ON SEPT. 17, 2012 BECAUSE BRAKES HAD BEEN INTERMITTENTLY BEEN LOCKING/STICKING UP WHILE DRIVING AND GETTING HOT (COULD TELL DUE TO BURNING SMELL). BASICALLY THE BRAKES WOULD ENGAGE AND LOCK UP CAUSING THE VEHICLE TO RUN WITH BRAKES IN CLOSED (BRAKING) POSITION AND WOULD NOT RELEASE.  THE PROBLEM WAS INTERMITTENT AND DID NOT HAPPEN EVERYTIME THE VEHICLE WAS DRIVEN DUE TO SHORT DISTANCES THE VEHICLE IS NORMALLY DRIVEN. SOMETIMES BY SIMPLY TURNING THE CAR OFF AND THEN RESTARTING WOULD THE BRAKES RELEASE, BUT NOT ALWAYS. TOOK VEHICLE TO SPIKES FORD IN MISSION TEXAS AND AFTER ABOUT A WEEK THEY FINALLY DIAGNOSED IT  AS BEING A PROBLEM WITH THE \"HCU AND ECU MODULE\".   VEHICLE WAS RETURNED TO ME ON 9/24/2012. CAR WAS DRIVEN FOR ABOUT A WEEK AND BRAKES STILL DID NOT SEEM NORMAL, SO WE ASSUMED IT WAS SINCE THEY HAD JUST BEEN WORKED ON. ON OCTOBER 1,2012 VEHICLE WAS BEING DRIVEN ON EXPRESSWAY WHEN SUDDENLY THE BRAKES LOCKED UP OVERHEATED AND VEHICLE WAS FORCED TO THE RIGHT OF EXPRESSWAY AND OFF THE ROAD. BRAKES WERE SO HOT THAT A BURNT SMELL WAS NOTICED INSIDE OF VEHICLE.  CAR WAS TURNED OFF, LET COOL DOWN AND THEN DRIVEN HOME @ 3-4 MILES AT LOW SPEED, BUT BRAKES WERE NOT LOCKED ANYMORE.  VEHICLE WAS RETURNED TO DEALERSHIP (SPIKES FORD- MISSION , TEXAS) AND IS STILL THERE AT THIS TIME. THEY ARE NOT SURE YET WHAT PROBLEM IS, BUT OBVIOUSLY IT WAS NOT THE PARTS INSTALLED AND THEY CAN'T FIGURE WHAT THE PROBLEM IS LUCKILY WHEN VEHICLE PULLED TO SIDE OF EXPRESSWAY, IT WAS ALREADY ON FAR RIGHT LANE AND DID NOT IMPACT ANY OTHER VEHICLES OR BARRIERS.  IF THIS WOULD HAVE HAPPENED A MILE UP THE ROAD IT COULD HAVE BEEN A BIG PROBLEM DUE TO NO SHOULDER AND CEMENT BARRIERS DUE TO CONSTRUCTION POSSIBLY CAUSING A BIG ACCIDENT.  *TR",
        "vin": "1FAHP34N56W"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/07/2012",
        "dateOfIncident": "09/15/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10478911,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2006 FORD FOCUS ZX4 5 SPEED.     I HAVE HAD TO REPLACE THE CLUTCH MASTER CYLINDER 3 TIMES WITHIN A YEARS TIME. THE PROBLEM IS THE PART IS PLASTIC AND OVER TIME IT STARTS TO LEAK DUE TO THE PRESSURE IT TAKES TO CHANGE GEARS. I'M IN RUSH HOUR TRAFFIC DAILY AND HAVING TO STOP AND START. THE MASTER CYLINDER SHARES FLUID FROM THE BRAKE RESERVOIR. I HAVE HAD LOW TO NON EXISTENT BRAKING POWER. THE MASTER CLUTCH HAS LEAKED INSIDE MY CAR AND OIL DRIPPED ONTO THE CLUTCH AND BRAKE PEDDLES CAUSING FOOT SLIPPAGE. THE LATEST SITUATIONS I WAS STUCK IN TRAFFIC,STOP AND GO, AND BEGAN HAVING PROBLEMS GETTING THE CAR IN GEAR. NEXT I WAS BACKING UP SLOWLY WHEN I EXPERIENCED NO CLUTCH PEDDLE AND THE CAR BEGAN SPEEDING UP I COULD NOT GET IT OUT OF GEAR I HAD TO SHUTDOWN THE ENGINE TO STOP THE CAR FROM PULLING AND GET IT OUT OF GEAR. THE CAR IDLES HIGH WHEN I COME TO A LIGHT OR STOP SIGN AND EVENTUALLY COMES DOWN. THE GAS PEDDLE STICKS IN COOLER WEATHER. THERE ARE TIMES WHEN I'M IN TRAFFIC I HAVE TO PRESS REALLY HARD.  *TR",
        "vin": "1FAFP34N36W"
    },
    {
        "components": "ELECTRICAL SYSTEM,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "08/29/2012",
        "dateOfIncident": "08/29/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10472973,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVERS SIDE REAR DOOR ELECTRIC DOOR LOCK WILL NOT LOCK. THE SAME THING HAPPENED ON THE PASSENGERS SIDE ABOUT TWO YEARS AGO.  *TR",
        "vin": "1FAFP36N16W"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/10/2012",
        "dateOfIncident": "10/01/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10465124,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRANSMISSION WENT OUT AT 43,000 MILES.  THE POWERTRAIN WAS UNDER WARRANTY AT THE TIME, BUT THE FORD DEALER REPAIRED ONLY CERTAIN PARTS OF THE TRANSMISSION.  NOW, 25K MILES LATER, THE TRANSMISSION IS AGAIN BAD.   FORD REFUSES TO FIX BECAUSE THE CAR IS NO LONGER IN WARRANTY, AND THERE IS NO RECALL.  I THINK THE CAR'S TRANSMISSION WAS DEFECTIVELY MANUFACTURED.  *TR",
        "vin": "1FAFP34N66W"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/21/2012",
        "dateOfIncident": "10/25/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10459138,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN ACCELERATING FROM STOP THE TRANSMISSION WOULDN'T GO INTO GEAR, WHEN IT DID IT WOULD JERK AND SOMETIMES THERE WOULD BE A SQUEELING NOISE AS IF IT WAS TRYING TO STOP THE CAR. IT JERKS AS IF THE TRANSMISSION IS GOING TO FALL OUT AND THE OVER DRIVE COMES ON WHILE DRIVING AND WON'T GO OFF. SOMETIMES THE TRANSMISSION JUST JERKS AND JERKS CONTINUOUSLY SO BAD IT WON'T GO INTO GEAR AND WON'T GAIN ANY SPEED. I HAVE TO PULL OFF THE ROAD. THANK GOD I HAVEN'T BEEN HIT BY SOMEONE, IT'S VERY SCARY AND DANGEROUS WHEN THIS HAPPENS.. THE CAR IS IN THE SHOP ON DIAGNOSTICS AND SO FAR WE ARE BEING TOLD THERE IS NO COMMUNICATION FROM THE CAR COMPUTER TO THE DIAGNOSTIC ANALYZER. I'VE FOUND OTHER COMPLAINTS ABOUT THIS SAME TRANSMISSION PROBLEM WITH THIS CAR ONLINE AND I'M WONDERING WHY FORD HASN'T ISSUED A RECALL FOR THIS PROBLEM. ONE PERSON SAID HE HAD TO HAVE HIS TRANSMISSION REPLACED. WHEN THESE SAME KIND PROBLEM OCCURS IT SOUNDS LIKE IT IS A FORD MOTOR PRODUCT PROBLEM AND SHOULD BE TREATED AS SUCH. WHAT IS CAUSING THIS AND WHERE'S THE RECALL FORD???  *TT",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING,INTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/18/2012",
        "dateOfIncident": "10/26/2010",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10455652,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FUSE FOR MY DASH AND NIGHT RUNNER LIGHTS BLOW AND REPLACED THE FUSE ABOUT 4 OR 5 TIMES THEN THE WIRING CAUGHT ON FIRE THAT WAS 6 MONTHS AGO GOT IT FIXED AND NOW MY DASH AND NIGHT RUNNERS LIGHTS HAVE STOP WORKING AGAIN CHANGED THE FUSE AND THEY ARE NOT WORKING STILL AND I CANT MOVE THE SHIFTER THIS CAR ISN'T SAFE ANYMORE AND I NEED A SAFE CAR FOR MY DAUGHTER AND I.     *JS",
        "vin": "1FAFP31N86W"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "02/07/2012",
        "dateOfIncident": "01/27/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10447022,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2006 FORD FOCUS. THE CONTACT STATED THAT WHILE DRIVING 55 MPH, SHE CRASHED INTO THE REAR OF A VEHICLE THAT WAS STOPPED. THE AIR BAGS DID NOT DEPLOY AND THE FRONT PASSENGER SEAT BELT BECAME LOOSE. THERE WERE NO INJURIES. A POLICE REPORT WAS FILED. THE VEHICLE WAS DESTROYED. THE FAILURE AND CURRENT MILEAGES WERE 148,000.",
        "vin": "1FAHP34N96W"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/13/2012",
        "dateOfIncident": "11/01/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10443667,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD FOCUS. THE CONTACT STATED THAT THE ACCELERATOR PEDAL WAS EXTREMELY RESISTANT AND COULD ONLY BE DEPRESSED PARTIALLY. THE PEDAL WAS ABLE TO BE PUSHED WHEN THE VEHICLE WAS SHUT OFF AND WHEN DRIVING, THE CONTACT WOULD HAVE TO PUMP THE ACCELERATOR PEDAL IN ORDER TO OPERATE THE VEHICLE.  IN ADDITION, THE PEDAL WOULD BECOME STUCK INTERMITTENTLY AND THE VEHICLE WOULD DECELERATE BEFORE RESISTING ANY ACCELERATION ATTEMPTS. THE VEHICLE WAS NOT INSPECTED BY A DEALER. THE FAILURE MILEAGE WAS 80,000 AND THE CURRENT MILEAGE WAS 81,000.     UPDATED 02/15/12*BF  UPDATED 02/28/12",
        "vin": "1FAFP34N06W"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/12/2011",
        "dateOfIncident": "06/12/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10439406,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD FOCUS. THE CONTACT WAS DRIVING 5 MPH AND ENTERING A PARKING SPACE WHEN THE ACCELERATOR PEDAL WOULD BECAME STUCK IN OPEN THROTTLE. THE CONTACT STATED THAT THE FAILURE WAS MOST PROMINENT IN COLDER TO FREEZING TEMPERATURES. THE VEHICLE HAD NOT BEEN INSPECTED BY A DEALER NOR REPAIRED. THE MANUFACTURER WAS CONTACTED AND THEY OFFERED NO ASSISTANCE. THE FAILURE MILEAGE WAS APPROXIMATELY 90,000. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/26/2011",
        "dateOfIncident": "10/19/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10437315,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED 2006 FORD FOCUS ZX3 IN MAY OF 2006. IT WAS A BRAND NEW CAR WITH ONLY 8 MILES ON IT.   WHEN I PURCHASED THE CAR IT WAS VERY LOUD AND ROUGH. I THOUGHT IT WAS BECAUSE IT WAS NEW AND NEEDED SOME TIME TO BE DRIVEN. AFTER THREE AND HALF YEARS NOTHING HAS CHANGED. I CALLED FORD COMPANYAND WAS TOLD TO TAKE IT TO FORD DEALER. (I TOOK IT TO FORD DEALERSHIP AND TOLD THEM WHAT THE PROBLEM WAS. I ALSO STATED THAT IT STOPS SHIFTING INTO 4TH GEAR AND WILL NOT SHIFT UP IF I HAVE TO ACCELERATE QUICKLY. THE DEALER INFO: FORD BREDEMANN 2038 WAUKEGAN ROAD  GLENVIEW, IL 60025  (847) 510-5585). I LEFT THE CAR FOR ABOUT A WEEK AND WHEN I CAME TO PICK IT UP I WAS TOLD THAT ENGINE AND TRANSMISSION WERE ON GOOD CONDITION. THERE ARE SOME THINGS THAT NEEDED TO BE CHANGED LIKE TIRES..ETC..  HOWEVER, I HAVE HAD INSTANCES ON THE ROAD WHERE I ALMOST COULD HAVE ENDED UP KILLED JUST BECAUSE THE CAR WONT ACCELERATE. IT HAPPENED TO ME ABOUT TWO WEEKS AGO.   2ND PROBLEM IS STEERING WHEEL. IT IS SO STIFF THAT ITS HARD TO TURN IT LEFT AND RIGHT.   I FEEL LIKE IT IS SO UNSAFE FOR ME TO DRIVE THIS CAR..NOT JUST UNSAFE FOR ME BUT FOR OTHER DRIVERS ON THE ROAD WAS WELL.  *TR",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "11/22/2011",
        "dateOfIncident": "11/09/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10436734,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED FOUR TIRES IN DEC OF 2010 WITH 70 THOUSAND MILES TREAD OUT MILES FOR MY STATION WAGON . 30 THOUSAND MILES LATER, THE REAR TIRES WERE GONE. THERE WERE BALD SPOTS ALL OVER THE INSIDE DRIVERS REAR TIRE. THE CORDS WERE BEGINNING TO SHOW AFTER SIX MONTHS AND 30 THOUSAND MILES. THE OTHER REAR TIRE ON THE PASSENGER SIDE WAS NOT ANY BETTER. ALIGNMENT WAS FINE. IT WAS CHECKED  HAD ANOTHER ALIGNMENT DONE AND PURCHASED TWO NEW TIRES WITH FORTY THOUSAND MILES WHICH WERE REPLACED 8 MONTHS LATER WITH NO TREADING LEFT. FORD HAS DONE EVERYTHING EXCEPT ISSUE A RECALL. FORD DEALER PROVIDED NO REAL ASSISTANT. THEY MUST KNOW, BUT ACTED AS IF NEVER HEARD OF THIS PROVIDE. THEY INSPECTED THE REAR AND TOOK READINGS OF TREAD ETC, BUT DID NOTHING ELSE. TIRE COMPANY SAID NOT A DEFECT IN THE TIRES SO WE DON'T REPLACE TIRES FOR FREE. JUDGING FROM ALL THE OTHER POSTS THIS IS NOT A GOOD SITUATION. I WAS TOLD TO ROTATE TIRES OFTEN AND CHECK OFTEN. SOMETIMES YOU HEAR A THUMPING NOISE AND THE CAR DRIVES HEAVY IN WET CONDITIONS.  *TR",
        "vin": "1FAFP36N26W"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/02/2011",
        "dateOfIncident": "01/23/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10434000,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT THE CAR BRAND NEW IN MAY 2006.  ON 01/23/07 DRIVING ON A SURFACE STREET I REALIZED THE GAS PEDAL SEEMED TO HAVE BROKEN AND I COULD NOT ACCELERATE.  I COULD ONLY COAST AND WAS ABLE TO PULL INTO A SHOPPING CENTER.  HAD THE CAR TOWED TO DEALERSHIP WHERE BOUGHT AND WAS TOLD THE SPEED CONTROL CABLE HAD BROKEN.  ON 10/26/11 IT HAPPENED AGAIN, ONLY THIS TIME I WAS ON A 65MPH FREEWAY IN RUSH HOUR.  (5-LANE FREEWAY IN EACH DIRECTION - MAJOR HIGHWAY.)  (MILEAGE 65040.)  I WAS ABLE TO COAST TO THE SHOULDER AND GET OFF AT THE NEXT EXIT.  HAD IT TOWED AGAIN TO FORD DEALERSHIP AND CONFIRMED IT WAS THE SAME CABLE THAT HAD BROKEN. I HAD THE DEALERSHIP SAVE IT AND YOU CAN SEE HOW THE CABLE WAS COMPLETELY FRAYED.  LUCKILY THE CABLE HAS NOT BECOME STUCK WHILE ACCELERATING LIKE SOME OTHER REPORTS I HAVE READ ON THE 06 FOCUS, BUT I THINK STILL THIS IS A MAJOR SAFETY CONCERN.  *TR",
        "vin": "1FAHP34N96W"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "08/26/2011",
        "dateOfIncident": "06/01/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10421567,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD FOCUS.  THE CONTACT STATED THAT ALL FOUR DOORS WOULD FAIL INTERMITTENTLY, OCCASIONALLY LOCKING HER OUT OF THE VEHICLE. THE DEALER DID NOT OFFER ANY ASSISTANCE AND THE MANUFACTURER WAS MADE AWARE OF THE FAILURE.  NO REPAIRS WERE PERFORMED.  THE CURRENT MILEAGE WAS 66,000 AND THE APPROXIMATE FAILURE MILEAGE WAS 61,000.",
        "vin": "1FAFP34N56W"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/01/2011",
        "dateOfIncident": "06/30/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10410278,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION PROBLEMS.  TRANSMISSION INTERMITTENTLY DOES NOT KICK INTO GEARS WHEN ACCELERATING.  I WENT TO GET ON THE HIGH WAY,(SPEED LIMIT 65MPH), GOT UP TO 55 AND THE TRANSMISSION JUST STARTED REVVING AS IF I WAS LOCKED IN NEUTRAL, ALMOST CAUSED 2 ACCIDENTS FROM MOVING TRAFFIC, AS MY CAR WAS DRIVING CONSIDERABLY SLOWER THAN THE REST GOING THE SPEED LIMIT).  VERY DANGEROUS AND VERY SCARY.  PULLED OFF AT NEXT EXIT(WAS CONSIDERABLY CLOSE).  CAR WOULD THEN NOT GO OVER 25 MPH.  IT'S LIKE IT WOULD NOT SWITCH INTO THE NEXT GEAR.  HAD TO CALL A TOW.  FORD GARAGE SAYS TRANNY DEFINITELY HAS PROBLEMS AND NEEDS REBUILT/REPLACED.  IT HAD HAPPENED A FEW TIMES BEFORE WHERE I WOULD GO TO ACCELERATE AND WOULD GET STUCK IN ONE GEAR, BUT AFTER A FEW SECONDS WOULD FINALLY KICK INTO GEAR - WHEN IT DID FINALLY KICK INTO GEAR, IT WAS A STRONG JERK AS IF I PUNCHED THE GAS.  AFTER LOOKING AROUND ONLINE, APPARENTLY MANY PEOPLE WITH THE SAME YR MAKE MODEL HAVE HAD THIS PROBLEM.  *TR",
        "vin": "1FAHP34N26W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/24/2011",
        "dateOfIncident": "03/18/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10408793,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "RE: 2006 FORD FOCUS ZX4 - IN MARCH 2011, AS I WAS DRIVING HOME UNDER NORMAL DRIVING CONDITIONS, THE DRIVER-SIDE AIRBAG THAT IS LOCATED IN THE DRIVER'S SEAT DEPLOYED FOR NO REASON WHATSOEVER. I WAS NOT IN AN ACCIDENT, DID NOT HIT A POTHOLE, RUN OVER ANYTHING, OR STOP SUDDENLY.     THE DEPLOYMENT CAUSED TEMPORARY HEARING LOSS IN MY LEFT EAR FOR SEVERAL DAYS AND BRUISING TO MY BACK/SHOULDER AREA FOR SEVERAL DAYS. THE DEPLOYMENT OF THE AIRBAG ALSO CRACKED A SECTION OF THE INSIDE OF MY CAR THAT HOUSES THE SEATBELT. WHEN THE AIRBAG DEPLOYED, IT ALSO RIPPED APART THE UPHOLSTERY ON THE ENTIRE LEFT SIDE OF THE DRIVER'S SEAT, SINCE THAT'S WHERE IT WAS LOCATED. THE NOISE AND JOLT OF THE AIRBAG DEPLOYING CAUSED ME TO SWERVE ON THE ROAD, BUT LUCKILY I DID NOT GET INTO AN ACCIDENT.     THE WARRANTY ON MY CAR IS EXPIRED AND I CANNOT AFFORD TO REPLACE THE AIRBAG OR REPAIR THE DRIVER'S SEAT, SO NO ACTION HAS BEEN TAKEN. *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/19/2011",
        "dateOfIncident": "03/22/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10402105,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRUNK LIGHT WOULD NOT COME ON WHEN TRUNK WAS OPENED (REPLACING THE BULB DIDN'T HELP). LATER, THE 'DOOR OPEN' DASH LIGHT CAME ON AND STAYED ON.  THE ELECTRIC TRUNK OPEN  BUTTON SOMETIMES WOULD NOT OPEN TRUNK.  A BIT OF TROUBLESHOOTING WITH A VOM AT THE TRUNK LIGHT POINTED TO AN ELECTRICAL PROBLEM (A VOLTAGE DROP WHEN A NEW BULB WAS PLACED IN THE TRUNK LIGHT SOCKET).  TURNS OUT THAT THE WIRING BUNDLE (CONTAINING SIX INDIVIDUAL MULTISTRAND WIRE LINES) HAD FIVE OF THE WIRES LINES FATIGUED APART , BREAKING THE FIVE CIRCUITS.  THE WIRE LINES WERE SOMETIMES MAKING INTERMITTENT CONTACT WHEN THE TRUNK WAS OPENED AND CLOSED, NOT NECESSARILY WITH THE MATCHING WIRE LINE.  I COULD HEAR NOISE AS THE WIRES WERE MOVED PAST EACH OTHER (NOT SURE IF THIS WAS JUST PHYSICAL SCRATCHING OR, WORSE, ELECTRICAL SPARKING).  SINCE I SOMETIMES CARRY A GASOLINE CONTAINER IN THE TRUNK (LAWNMOWER GAS CONTAINER RETURNING FROM GAS STATION), I FEEL THAT THE DESIGN OF THIS WIRING TO THE TRUNK IS FAULTY AND COULD LEAD TO A FIRE UNDER THE RIGHT (AND NOT UNCOMMON) CIRCUMSTANCES.  AFTER SEVERAL CONVERSATIONS WITH THE FORD MOTOR CO., A REPAIR WAS MADE (I PARTIALLY PAID FOR THE REPAIR) WHERE THE WIRING WAS REPLACED.  I AM NOT SURE IF THE REPAIR WILL BE ANY SAFER THAN THE ORIGINAL DESIGN; HENCE THIS COMPLAINT WITH THE HOPE THAT A SAFER DESIGN (E.G., ONE WITHOUT SUCH A TIGHT RADIUS OF BEND) COULD DEVELOPED AND RETROFITTED INTO THIS CAR.  *TR",
        "vin": "1FAHP34N66W"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "05/19/2011",
        "dateOfIncident": "05/18/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10402111,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WITHIN THE LAST FEW WEEKS, OUR FORD FOCUS STARTED MAKING A THUMPING NOISE WHICH WAS ACCOMPANIED BY A SLIGHT VIBRATION OF THE CAR.  AFTER A FEW WEEKS OF THIS, I TOOK IT TO THE LOCAL FORD DEALER TO GET THE TIRES RE-BALANCED AND ROTATED.  AFTER A ROAD TEST (I WENT ALONG), THE DEALER SAID THAT BOTH REAR TIRES WERE 'CUPPED' AND THAT REBALANCING AND ROTATING WOULD NOT SOLVE THE PROBLEM.  THEY SAID THAT THE SUSPENSION WAS OK.  THE TIRES HAVE ABOUT 20,000 MILES ON THEM, AND ARE THE SECOND SET ON A CAR THAT HAS JUST ABOUT 50,000 MILES ON IT.  I AM CONCERNED THAT THE TIRES ARE WEARING OUT FASTER THAN EXPECTED FOR THE GOOD QUALITY TIRES THAT I PUT ON TO REPLACE THE FACTORY ORIGINALS (WHICH WORE OUT EARLY).  THE THUMPING IS NOISY, BUT I AM WORRIED ABOUT LOSS OF CONTROL IF THINGS GET WORSE WHEN ON A LONG TRIP, OR IF THE TIRES FAIL DUE TO THE STRESS OF THE 'CUPPING'.  FROM CHECKING THE INTERNET, OTHER FOCUS OWNERS HAVE HAD THE SAME PROBLEM (OVER A NUMBER OF MODEL YEARS), IT APPEARS THAT THERE IS SOME SORT OF DESIGN PROBLEM WITH THE REAR OF THIS CAR WHICH CAUSES EXCESSIVE AND RAPID TIRE WEAR LEADING TO THE 'CUPPING' AND RESULTANT NOISE AND (I AM GUESSING) BOUNCING ON THE ROAD.  I EXPECT THAT THE FORD MOTOR COMPANY IS WELL AWARE OF THIS PROBLEM AND HOPEFULLY HAVE SOME SORT OF REPAIR THAT COULD REMEDY THE PROBLEM BEFORE THERE ARE ACCIDENTS.  BUYING NEW TIRES EVERY 20,000 MILES IS NOT THE SOLUTION.  *TR",
        "vin": "1FAHP34N66W"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "05/04/2011",
        "dateOfIncident": "03/04/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10399128,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD FOCUS. THE CONTACT STATED WHILE DRIVING APPROXIMATELY 50 TO 60 MPH HE NOTICED THAT HE WAS LOOSING PRESSURE ON THE FRONT DRIVERS SIDE AND THE TWO REAR TIRES. THE VEHICLE WAS INSPECTED BY AN INDEPENDENT MECHANIC WHO ADVISED HIM THAT HE NEEDED TO REPLACE THE VALVE STEMS DUE DETERIORATION. THE VALVE STEM INFORMATION WAS NOT AVAILABLE. THE VEHICLE WAS REPAIRED ON SEVERAL OCCASIONS. THE FAILURE MILEAGE WAS APPROXIMATELY 89,000.",
        "vin": "1FAHP34N46W"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "04/15/2011",
        "dateOfIncident": "03/16/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10396049,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD FOCUS.  THE CONTACT WAS DRIVING 20 MPH WHEN THE PASSENGER SIDE SEAT EXHIBITED A POPPING SOUND WHILE ACCELERATING.  THE CONTACT TOOK THE VEHICLE TO THE DEALER AND THE DEALER STATED THAT THE SEAT TRACK WOULD NEED TO BE REPLACED. THE PASSENGER SIDE SEAT TRACK WAS NOT REPLACED.  THE CONTACT STATED THAT THE FAILURE WAS A SAFETY ISSUE BECAUSE THE PASSENGER SIDE SEAT COULD MOVE FORWARD AND BACKWARD WHILE DRIVING AND COULD CAUSE INJURY. THE FAILURE MILEAGE WAS 29,000.",
        "vin": "1FAHP34N76W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/14/2011",
        "dateOfIncident": "04/05/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10395892,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2006 FORD FOCUS WITH APROX 65,000 MILEAGE. RECENTLY, THE AIR BAG INDICATOR LIGHT COMES ON OCCASIONALLY, MORE OFTEN AND FOR MORE LENGTHY PERIODS MORE RECENTLY.   IT SEEMS TO MATCH THE ISSUES OF NEW FORD PICKUP TRUCK RECALL IN WHICH AIRBAGS DEPLOY WITHOUT NOTICE OR CAUSE - RESULTING APPARENTLY FROM FRAYED/SHORTED SENSOR WIRES - PRECEDED BY ILLUMINATION OF AIRBAG DASHBOARD INDICATOR, AS OCCURS IN MY 2006 FORD FOCUS.   IS THERE CAUSE FOR CONCERN WITH MY FAMILY'S USE OF THIS CAR?  THANK YOU.  *TR",
        "vin": "1FAFP36N07W"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "04/08/2011",
        "dateOfIncident": "10/01/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10395293,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD FOCUS VX3 COUPE. THE CONTACT STATED THAT THE DRIVER AND PASSENGER SIDE DOOR HANDLES DON'T WORK   WHICH MADE IT IMPOSSIBLE FOR HER TO EXIT OR ENTER THE VEHICLE UNLESS SHE PUSHED ON THE DOOR FOR A FEW MINUTES. SHE REPLACED THE DRIVERS SIDE DOOR HANDLE,  BUT IT MALFUNCTIONED AGAIN. THE VEHICLE WAS NOT  INSPECTED BY A DEALER NOR HAD IT BEEN REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 89,000.",
        "vin": "1FAFP31N26W"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "02/27/2011",
        "dateOfIncident": "01/15/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10384647,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 FORD FOCUS ST. DRIVER SIDE SEAT BACK HAS BROKEN/CRACKED DURING NORMAL OPERATION. REACHING FOR CHANGE IN POCKET TO GO THROUGH A TOLL BOOTH, SEAT BACK FRAME BROKE ON THE RIGHT HAND SIDE CAUSING DRIVER TO LURCH BACK TOWARD BACK SEAT AND TEMPORARILY LOSE CONTROL OF THE VEHICLE. FORD MOTOR COMPANY REFUSES TO ASSIST IN REPAIRS. SEAT BACK SHOULD NEVER BREAK AS IT IS THE ONLY PROTECTION A PASSENGER HAS IN THE EVENT OF A REAR END COLLISION.  SEAT BACK HAS NOT BEEN REPAIRED. *TR",
        "vin": "1FAFP38Z36W"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/26/2011",
        "dateOfIncident": "12/11/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10384611,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "KEY WOULD NOT REMOVE FROM IGNITION.  AFTER A COUPLE OF WEEKS NOTICED THAT THE TRANSMISSION WAS NOT LOCKING WHEN IN PARK.  YOU DIDN'T HAVE TO PUSH IN THE SAFETY BUTTON FOR IT TO GO INTO GEAR.  THIS IS A MAJOR SAFETY ISSUE TO ME SINCE MANY FOCUS OWNERS HAVE SIMPLY GONE  TO LEAVING THE KEY IN THE IGNITION AFTER IT STICKS THERE AND FIND OUT THE COST FROM THE DEALER TO FIX. *TR",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/24/2011",
        "dateOfIncident": "02/18/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10384356,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "FIRST NOTICED WINDSHIELD WIPERS WOULD SLOW DOWN AND BECOME SLUGGISH DURING USE.  AFTER ABOUT 10 MINUTES OF CONTINUOUS USE, THE SEIZED UP AND COMPLETELY STOPPED WORKING.  THIS WAS WHILE DRIVING ON THE FREEWAY DURING A HEAVY STORM.  INSTANTLY, NO VISIBILITY, HAD TO PULLED OFF ONTO THE SHOULDER, TO CALL ROADSIDE ASSISTANCE.  TOOK VEHICLE INTO FORD SERVICE AND THEY STATED NO PROBLEM FOUND...  ABOUT TWO MONTHS LATER, ALMOST THE SAME SCENARIO, WIPERS STOPPED WORKING ON THE FREEWAY, TOOK BACK INTO FORD DEALER, THEY FOUND OUT THE WIPER MOTOR WAS OVERHEATING AFTER 10 MINUTES AND SHORTING OUT.  WIPER MOTOR REMOVED AND REPLACED. $450.  INTERESTINGLY, EVERY OTHER 2006 FORD MODELS WHERE RECALLED FOR A WIPER MOTOR ISSUE, EXCEPT THE FOCUS. PERSONALLY, I BELIEVE THAT THE FOCUS SHOULD HAVE BEEN INCLUDED IN THE RECALL.  *TR",
        "vin": "1FAFP34N46W"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/03/2011",
        "dateOfIncident": "10/15/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10380094,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD FOCUS. THE CONTACT WAS DRIVING APPROXIMATELY 50 MPH WHEN SHE ENGAGED THE ACCELERATOR AND THE VEHICLE DID NOT RESPOND. THE ACCELERATOR PEDAL BECAME STUCK AND THE CONTACT STATED THAT THE FAILURE WOULD OCCUR INTERMITTENTLY IN COLDER WEATHER AND WHEN THE VEHICLE HAD BEEN PARKED FOR MORE THAN EIGHT HOURS. THE MANUFACTURER WAS CONTACTED AND ADVISED THERE WAS NO RECALL FOR THE FAILURE AND THAT SHE SHOULD TAKE THE VEHICLE TO THE DEALER FOR INSPECTION. THE VEHICLE WAS NOT TAKEN TO THE DEALER FOR DIAGNOSIS OR REPAIRS. THE FAILURE MILEAGE WAS 112,000 AND THE CURRENT MILEAGE WAS 116,000.",
        "vin": "1FAFP34N46W"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/03/2011",
        "dateOfIncident": "12/26/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10373954,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "INVOLVED IN AN AUTO ACCIDENT. VEHICLE PULLED OUT INTO MY PATH OF TRAVEL AND I WAS FORCED TO HIT THEIR VEHICLE HEAD ON AT 50 MPH. AFTER THE INITIAL IMPACT I SPUN AROUND AND OUR VEHICLES HIT AGAIN ON THE REAR QUARTER PANELS. NO AIR BAGS IN MY VEHICLE EVER DEPLOYED. *TR",
        "vin": "1FAHP34N16W"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/07/2010",
        "dateOfIncident": "10/10/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10364316,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "KEY STICKS IN IGNITION. *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/20/2010",
        "dateOfIncident": "10/17/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10361453,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON I-75 AND FOR NO REASON WHATSOEVER THE PASSENGER SIDE, SIDE IMPACT AIRBAG WENT OFF CAUSING THE CABIN TO FILL WITH SMOKE AND THE PASSENGER HAVE A SORE SHOULDER.  WE WERE NOT IN A CRASH, DID NOT HIT A POT HOLE, ANIMAL, BUMP OR HAVE ANYTHING HAPPEN TO THE CAR.  THE CRUISE CONTROL WAS ON AT THE TIME OF THE INCIDENT.  I CALLED FORD CUSTOMER SERVICE AND THEY SAID BECAUSE IT WAS OUT OF WARRANTY THEY COULDN'T DO ANYTHING AND TO TURN IT INTO INSURANCE.  THE CAR HAS 69,500 MILES ON IT AND SHOULDN'T MATTER IF IT IS NOT UNDER WARRANTY ANYMORE BECAUSE AN AIRBAG SHOULD NEVER UNDER ANY CIRCUMSTANCE GO OFF UNLESS YOUR IN A CRASH.  INSURANCE WILL NOT COVER THE PROBLEM.  CAR IS AT DEALERSHIP GETTING AN ESTIMATE. *TR",
        "vin": "1FAHP34N76W"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/08/2010",
        "dateOfIncident": "07/18/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10354401,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 FORD FOCUS ZX3 2DR  HEARD A HOLLOW NOISE COULD NOT FIGURE OUT WHAT IS WAS HAD SOME GRINDING CHECKED REAR WHEELS TO SEE IF THERE WAS ANY SLACK IN BEARING OR WHAT...FINALLY I GOT TO WORK AND CHECKED WHEEL AGAIN THIS TIME THERE WAS SLACK CALLED THE DEALER TOLD THEM MY RIGHT REAR WHEEL WAS ABOUT TO COME OFF...DUH! THAT WAS AT 83500 MILES THE DEALER SAID IT WAS NOT OUT OF THE ORDINARY? YEAH RIGHT! I TOLD HIM THEY WERE LUCKY IT DID NOT COME OFF WHILE I WAS OUT IN NO MANS LAND NERVADA SOME PLACE DOING 70 MPH!  DEALER REPLACED RIGHT REAR WHEEL BEARING TO THE TUNE OF $400. *TR",
        "vin": "1FAFP31NX6W"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/20/2010",
        "dateOfIncident": "08/20/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10350779,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "FORD MOTOR CO. REFUSAL TO WARRANT AIR BAG MODULE ON 2006 FORD FOCUS. ACCORDING TO FORD ,MODULE IS IN THE CONSOLE WHERE WATER GOT INTO IT. SHOULD THIS MODULE BE PLACED IN A SPOT WHERE WATER SHOULD NOT LEAK INTO IT. DURING A RAIN STORM ,THE CARPETS GOT WET. I WILL AGREE THAT WATER CAN DAMAGE COMPONENTS.IN THIS CASE THE PASSENGER AIRBAG BECAME DISABLED. I DO NOT FEEL THAT FORD TOOK PROPER CARE IN THE PLACEMENT OR THE MODULE OR IN WATER PROOFING IN SOME MANNER..LET ME ADD THIS .THE FUEL PUMP ON THESE VEHICLES IS ON TOP OF THE GAS TANK,IT IS EXPOSED TO WATER YET SOME HOW IT IS PROPERLY SEALED .. *TR",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/09/2010",
        "dateOfIncident": "08/02/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10348325,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2006 FORD FOCUSZX3 WITH 58,000 MILES. I RECENTLY TOOK THE CAR TO THE DEALERSHIP FOR A TUNE UP/OIL CHANGE AND IT WAS NOTED THAT THE 3RD BRAKELIGHT WAS OUT. I BOUGHT BULBS TO REPLACE THEM AND UPON OPENING THE 3RD BRAKE LIGHT COVER REALIZED THE HOUSING WHICH HOLDS THE BULBS IS PLASTIC, 2 OF THE BULBS HAD MELTED TO THE PLASTIC, THE OTHER 3 BULBS WERE LOOSE INSIDE THE COVER AFTER THE PLASTIC MELTED AND CAUSED THEM TO FALL OUT. I RETURNED TO THE DEALERSHIP SHOWING THEM THE PART TO WHICH THEY STATED \"THERE ARE NO RECALLS ON THIS  AND THE PART IS $49\". I HAVE SEEN SEVERAL HATCHBACK MODELS SUCH AS MY OWN WITH 3RD BRAKE LIGHTS BURNT OUT. I THINK THIS MATTER SHOULD BE ADDRESSED AS THE CONSUMERS SHOULD NOT BE RESPONSIBLE FOR THE COST OF REPAIRING A PROBLEM WHICH IS OBVIOUSLY A DEFECT AND A SAFETY HAZARD. *TR",
        "vin": "1FAFP31N46W"
    },
    {
        "components": "ELECTRICAL SYSTEM,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "06/24/2010",
        "dateOfIncident": "06/23/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10339813,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "KEY STUCK IN IGNITION. *TR",
        "vin": "1FAFP34N86W"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "06/21/2010",
        "dateOfIncident": "06/19/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10339334,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 6/19/10 MY CAR WOULD NOT BRAKE TO A FULL STOP WHILE EXITING THE FREEWAY (SPEED HAD GONE UP TO 80 ON OWN WITHOUT BRAKES APPLIED)  THE LIGHT TURNED GREEN AND I LET MY FOOT OFF THE BRAKE.  THE CAR ACCELERATED ON ITS OWN WITHOUT APPLYING THE GAS.  THE CAR WOULD NOT COME TO A STOP AND I SUBSEQUENTLY CRASHED AT APPROXIMATELY 10-15 MPH TO PREVENT A MAJOR ACCIDENT IN THE INTERSECTION OF A BUSY STREET IN THE MIDDLE OF THE DAY.  (DUE TO MY BACKGROUND AND KNOWLEDGE I WAS ABLE TO PREVENT A FAR WORSE ACCIDENT)  AFTER THE CAR CAME TO A REST AGAINST A PALM TREE I PUT THE CAR IN PARK AND THE RPMS REVVED TO 5-6.  SEVERAL DAYS PRIOR TO THIS WHEN I PUT THE CAR IN PARK IT WOULD REV TO 3-4 RPMS AND THEN SETTLE DOWN AFTER APPLYING THE BRAKE WHILE IN PARK.  THIS HAD NEVER HAPPENED PRIOR.  THE DEALERSHIP HAD JUST PERFORMED A 90000 CHECK OF THE VEHICLE (THOUGH IT WAS AT 85000 DUE TO A CHECK ENGINE LIGHT OF AN UNRELATED PART ISSUE) 2 MONTHS PRIOR TO THIS INCIDENT.  THE DEALERSHIP STATED THE THROTTLE BODY CABLE HAS COME APART.  THEY STATE THAT THE MAINTENANCE OF THIS WOULD NOT HAVE PREVENTED IT AND STATE THAT SINCE THE CAR IS NO LONGER IN WARRANTY THEY WONT PAY.  THIS IS A HUGE SAFETY ISSUE THAT COULD HAVE COST MY LIFE OR SOMEONE ELSE'S.  COULD THIS HAD BEEN CAUGHT BY THE DEALERSHIP OR IS THE PART DEFECTIVE?  FORD SHOULD BE LIABLE FOR THIS AS A CAR ACCELERATING ON ITS OWN IS BEYOND DANGEROUS.  THE VEHICLE IS 4 YEARS OLD, EXTREMELY WELL TAKEN CARE OF, AND I AM THE ORIGINAL OWNER.  NO ACCIDENTS FOR THIS VEHICLE.  POLICE WERE ON SCENE BUT NO REPORT WAS TAKEN.  NO OTHER SIGNS WERE EVER DISPLAYED BESIDES THE CAR REVVING IN PARK 3 DAYS PRIOR. *TR",
        "vin": "1FAFP31N36W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/15/2010",
        "dateOfIncident": "06/14/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10336427,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD FOCUS. WHILE DRIVING AT 45 MPH, THE AIR BAGS SUDDENLY DEPLOYED WITHOUT WARNING. THE CONTACT PULLED OVER AND HAD THE VEHICLE TOWED TO AN AUTHORIZED DEALERSHIP BUT THE DEALER COULD NOT DETERMINE THE FAILURE. THE CONTACT CALLED THE MANUFACTURER AND WAS AWAITING A CALL BACK. THE VIN WAS UNAVAILABLE AT THE TIME OF THE COMPLAINT. THE CURRENT AND FAILURE MILEAGES WERE 46,660.",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/06/2010",
        "dateOfIncident": "02/15/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10334785,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS PEDAL STICKING DUE TO MANUFACTURES DEFECT IN THE WAY THE GAS PEDAL CABLE IS DESIGNED. THERE WAS NOT REALLY A CRASH, BUT WE DID HAVE TO GO OFF OF THE ROAD TO KEEP FORM HITTING THE CAR IN FRONT OF US AT A STOP LIGHT. THE CABLE WAS FRAYED AND WAS GETTING STUCK INSIDE OF THE JACKET  CAUSING THE PEDAL TO STICK AT THE PREVIOUS SETTING. I CONTACTED FORD, I WAS TOLD \"TOO BAD NOTHING WE CAN DO\" IF THIS PROBLEM IS NOT FIXED PEOPLE WILL DIE AND FORD DOESN'T CARE! NOT ANY REAL PROPERTY DAMAGE, JUST MUD AND A FEW SCRATCHES FROM GOING OFF OF THE ROAD. *TR",
        "vin": "1FAFP34N16W"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/17/2010",
        "dateOfIncident": "06/10/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10330809,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE KEY CANNOT BE REMOVED FROM THE IGNITION.  THE CAR DOES STILL START AND DRIVE FINE, BUT NO MATTER WHAT I DO, THE KEY WILL NOT COME OUT.  IT MIGHT JUST BE FOR A FEW HOURS BUT MORE SO IT HAPPENS FOR AT LEAST 24 HOURS.  IT SEEMS TO ALSO HAPPEN AFTER THE CAR HAS BEEN USED ON A WARM DAY, SO IT WILL FIRST GET STUCK THAT EVENING WHEN THE CAR IS PUT INTO USE AGAIN.  IT IS COSTING $285 TO GET IT FIXED BECAUSE IT NEEDS A NEW IGNITION. *TR",
        "vin": "1FAFP37NX6W"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/14/2010",
        "dateOfIncident": "03/15/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10330474,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD FOCUS. WHILE DRIVING AT APPROXIMATE SPEEDS OF 55-60 MPH, THE VEHICLE BEGAN ABNORMALLY ACCELERATING AND THEN STALLED. THE CONTACT WAS ABLE TO COAST OFF THE ROADWAY AND AFTER TWENTY MINUTES HE WAS ABLE TO RESTART THE VEHICLE.  THE FAILURE PERSISTED. THE FUEL FILTER WAS REPLACED BUT THE FAILURE RECURRED. THE VEHICLE WAS TOWED TO THE DEALER WHERE THE FUEL FILTER, PUMP AND DRIVER MODULE WERE REPLACED. THE FAILURE MILEAGE WAS 52,814 AND THE CURRENT MILEAGE WAS 54,000.",
        "vin": "1FAFP34NX6W"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/10/2010",
        "dateOfIncident": "05/10/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10329793,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "KEYS ARE STUCK IN THE IGNITION. *TR",
        "vin": "1FAFP31N46W"
    },
    {
        "components": "ELECTRICAL SYSTEM,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "04/25/2010",
        "dateOfIncident": "04/24/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10327324,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "IGNITION LOCK CYLINDER FAILURE ON A 2006 FORD FOCUS. THE KEY AT ONE TIME COULDN'T TURN THE IGNITION...NOW CAN'T REMOVE KEY FROM LOCK CYLINDER WITHOUT HAVING LOCKSMITH OR DEALERSHIP DO IT AT SUBSTANTIAL COST TO MYSELF. APPARENTLY THIS IS A VERY COMMON OCCURRENCE AND IS WAY MORE WIDESPREAD THEN ANY LITTLE RECALL THAT TOYOTA HAS HAD...WE NEED A RECALL OR A CLASS ACTION LAWSUIT. I*TR",
        "vin": "1FAHP34N86W"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/23/2010",
        "dateOfIncident": "04/02/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10327223,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "KEY STUCK IN IGNITION. WAS TOLD BY DEALER MOST COMMON PROBLEM WITH FORD FOCUS. LOCK ASSEMBLY REPLACED ON 04/0210 AND KEY STUCK IN IGNITION (NEW PART)  04/23/10. *TR",
        "vin": "1FAFP34N06W"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/19/2010",
        "dateOfIncident": "04/14/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10326461,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD FOCUS. THE CONTACT STARTED THE IGNITION AND THERE WAS A RATTLING NOISE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE THE TECHNICIAN DETECTED TWO OF THE FOUR ENGINE MOUNTS WERE BROKEN. THE MECHANIC REPAIRED THE VEHICLE AND STATED THE FAILURE SHOULD NOT OCCURRED ON A FOUR YEAR OLD VEHICLE. THE FAILURE MILEAGE AND CURRENT MILEAGES WERE 131,000.",
        "vin": "1FAFP34N76W"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/12/2010",
        "dateOfIncident": "02/20/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10325206,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD FOCUS. WHILE THE CONTACT WAS TRAVELING APPROXIMATELY 55 MPH THE CHECK ENGINE WARNING LIGHT ILLUMINATED ON THE DASHBOARD. THE VEHICLE BEGAN TO HESITATE IN A JERKING MOTION. THE VEHICLE WAS DRIVEN OFF THE ROADWAY. THE ENGINE WAS TURNED OFF AND RESTARTED AFTER WAITING FOR A FEW MOMENTS. THE VEHICLE WAS ABLE TO OPERATE NORMALLY. THE FUEL FILTER WAS REPLACED BY A CERTIFIED MECHANIC AND THE FAILURE STOPPED. THE ENGINE LIGHT FAILURE OCCURRED ON A SEPARATE OCCASION. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THE TECHNICIAN STATED THE FAILURE WAS CONTRIBUTED TO THE FUEL PUMP AND FUEL PUMP DRIVER MODULE. THE VEHICLE WAS IN THE PROCESS OF BEING REPAIRED AT THE TIME OF THE COMPLAINT. THE FAILURE MILEAGE WAS UNKNOWN. THE CURRENT MILEAGE WAS 50,000. UPDATED 06/04/10.  *LJ  THE FUEL PUMP WAS REPLACED.",
        "vin": "1FAFP34NX6W"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/29/2010",
        "dateOfIncident": "03/27/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10322641,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD FOCUS. THE CONTACT STATED THAT AFTER TURNING THE VEHICLE OFF, SHE COULD NOT REMOVE THE KEY FROM THE IGNITION. THE VEHICLE WAS TAKEN TO THE DEALERSHIP BUT NO REPAIRS WERE PERFORMED. THE CURRENT AND FAILURE MILEAGES WERE APPROXIMATELY 64,000. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/24/2010",
        "dateOfIncident": "12/27/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10321733,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD FOCUS. WHILE DRIVING APPROXIMATELY 45 MPH OR MORE, THE AIR BAG WARNING LIGHT WOULD ILLUMINATE ON THE INSTRUMENT PANEL IF THE FRONT PASSENGERS SEAT WAS OCCUPIED. THE MANUFACTURER WAS CONTACTED BUT DID NOT OFFER ANY ASSISTANCE. THE VEHICLE WAS NOT INSPECTED BY THE DEALER WHEN THE COMPLAINT WAS FILED.  THE FAILURE MILEAGE WAS 34,000. THE CURRENT MILEAGE WAS 38,000.",
        "vin": "1FAHP34N56W"
    },
    {
        "components": "SUSPENSION,TIRES",
        "crash": false,
        "dateComplaintFiled": "03/04/2010",
        "dateOfIncident": "08/23/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10316433,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "FORD FOCUS STATION WAGON WITH 40,000 MILES ON TIRES.  TIRES WORN COMPLETELY DOWN TO BARE METAL ON BOTH REAR TIRES.  I DROVE INTO A PARKING LOT TO SHOP AND HEARD HISSING NOISE.  SAW DAMAGED TIRES CHANGED LEAKING TIRE TO SPARE TIRE.  WEAR ON INSIDE OF REAR TIRES ONLY.  LOCAL TIRE DEALER LOOKED AT ALIGNMENT AND COMMENTED THAT FOCUS TIRES FREQUENTLY BLOW DUE TO \"TOW\" IRREGULARITIES IN ALIGNMENT.  DIFFICULT TO ADJUST TOW TO MANUFACTURER'S SPECIFICATIONS WITHOUT EXCESSIVE WEAR ON REAR TIRES. I REPLACED TIRES.  I WAS ADVISED TO ROTATE TIRES FREQUENTLY AND HAVE ALIGNMENT CHECKED REGULARLY. *TR",
        "vin": "1FAHP36N36W"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/01/2010",
        "dateOfIncident": "12/29/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10315078,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ACCELERATOR PEDAL STICKING. THE PROBLEM JUST BEGAN RECENTLY IN THE LAST 2 MONTHS DURING THE COLD WEATHER. IT DOES IT ALL THE TIME. I HAVE NOT YET TAKEN IT TO GET REPAIRED OR INSPECTED BUT I READ A LOT OF PEOPLE HAVING THE SAME PROBLEM WITH ANOTHER MODEL THE FORD ESCAPE AND IT IS THE SAME RECALL TOYOTA IS DOING. I HAVE BEEN CLOSE TO A COUPLE OF ACCIDENTS BECAUSE OF THIS PROBLEM AT DANGEROUS INTERSECTIONS WHERE MY CAR IS JUST IDLE AND I CANNOT ACCELERATE TO GET OUT OF THE WAY UNLESS I PUSH THE PEDAL ALL THE WAY DOWN WHICH MAKES THE CAR TIRES BURN RUBBER AND SPEED OFF DANGEROUSLY. *TR",
        "vin": "1FAFP34N96W"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/27/2010",
        "dateOfIncident": "11/15/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10314787,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 FORD FOCUS ZX4 YELLOW AIRBAG LIGHT ON DASH WENT ON AND REMAINED ON. DIAGNOSED AS HIGH RESISTANCE IN WIRING SYSTEM,MAKES SAFETY-AIRBAG- SYSTEM INOPERATIVE. DANGEROUS. REPAIRED BY FORD DEALER UNDER 5 YEAR WARRANTY BY REPLACEMENT OF CLOCKSPRING{WIRING PLASTICTAPE} IN STEERING WHEEL HUB. TO DETERMINE SEVERITY OF PROBLEM CHECK FORD REPLACEMENT PARTS RECORDS. *TR",
        "vin": "1FAFP34N36W"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/17/2010",
        "dateOfIncident": "08/10/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10311236,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD FOCUS. WHILE DRIVING  35 MPH OR MORE THE BACK OF THE VEHICLE BEGAN LUNGING TO THE LEFT OR THE RIGHT ON SLIPPERY SURFACES ESPECIALLY WHENEVER IT RAINED OR DURING INCLEMENT WEATHER. THE VEHICLE WAS TAKEN TO THE DEALER WHO STATED THAT THEY ALIGNED THE REAR END; HOWEVER, THE SAME FAILURE CONTINUED TO OCCUR. THE MANUFACTURER WAS CALLED AND STATED THAT THE WARRANTY EXPIRED AND THEY WOULD ASSUME THE REPAIR COST.   THE FAILURE MILEAGE WAS 62,000.",
        "vin": "1FAHP34N36W"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/10/2010",
        "dateOfIncident": "09/06/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10308282,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER ACCIDENT OCCURRED ON SEPT 6, 2009, I NOTICED THAT THE GAS PEDAL SEEMS TO STICK ESPECIALLY AFTER OR DURING USE OF THE CRUISE CONTROL.  CAR ENGINE ALSO REVVED IN PARK ONCE, AND A COUPLE OF TIMES SEEMED HARD TO BRAKE.  CAR TAKEN TO DEALERSHIP AND DIAGNOSED FOR $100.  DEALERSHIP SAYS IT IS NOT RELATED TO ACCIDENT BUT THAT THE THROTTLE BODY NEEDS TO BE REPLACED BECAUSE THE PEDAL IS STICKING AND IT IS A SAFETY ISSUE - COST ALMOST $400 NOT INCLUDING THE COST OF THE DIAGNOSTICS.  SECOND DEALERSHIP CONFIRMED PRICE OF THROTTLE BODY AND SAID THAT I NEEDED TO GET IT FIXED BECAUSE IT'S A SAFETY ISSUE.  MY CAR IS A 2006 FORD.  I WAS NOT ABLE TO GET THE CAR FIXED.  I DON' T HAVE THAT MUCH MONEY, DEALERSHIP PUT THAT I REFUSED SERVICE.  *TR",
        "vin": "1FAHP34NX6W"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/10/2010",
        "dateOfIncident": "02/09/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10308384,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ACCELERATOR PEDAL BINDS IN MY WIFE'S 2006 FOCUS.  THE OTHER DAY IT STUCK OPEN AND WOULD NOT RELEASE WHILE SHE WAS ON THE EXPRESSWAY.  SHE GRABBED THE FLOOR MAT AND PULLED IT AWAY IN CASE IT WAS CAUSING IT TO NO EFFECT.  SHE HIT THE BRAKES AND THE CAR WOULDN'T SLOW DOWN.  THE ACCELERATOR PEDAL WOULDN'T RESPOND TO INPUT IT WAS JAMMED, AFTER STOMPING HER FOOT ON IT SEVERAL TIMES IT FINALLY RELEASED.  DEALER CLAIMED AT FIRST WAS FLOOR MAT BUT POINTED OUT MAT WAS SITTING ON THE OTHER SIDE OF THE CAR - THEN CLAIMED IT WAS CARBON BUILD UP ON THROTTLE BODY CAUSING IT TO JAM. *TR",
        "vin": ""
    },
    {
        "components": "PARKING BRAKE",
        "crash": false,
        "dateComplaintFiled": "02/06/2010",
        "dateOfIncident": "12/01/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10307049,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2006 FORD FOCUS AND I AM A STUDENT AT TEXAS STATE UNIVERSITY IN SAN MARCOS TEXAS. I AM 22 YEARS OLD AND BEEN SELF SUFFICIENT SINCE I WAS 18 YEARS OLD. I CHOSE A FORD FOCUS BECAUSE THE REVIEWS WERE GOOD AND THE PRICE WAS RIGHT. LAST NOVEMBER MY KEY JUST WOULD NOT COME OUT OF THE IGNITION. I HAD SEVERAL MECHANICS LOOK AT IT AND THEY SAY THE FIX IS A LITTLE LESS THEN $800. I HAD LOOKED ONLINE TO SEE IF THE PART WAS RECALLED BUT IT WASN'T. THERE ARE OVER 2 MILLION PEOPLE OFF OF GOOGLE THAT HAVE THE SAME EXACT PROBLEM ESPECIALLY THE 2006 FORD FOCUS. I HAVE CONTACTED FORD BUT THEIR CUSTOMER SERVICE DID NOT REMOTELY CARE THAT ITS A MALFUNCTION ON THEIR PART. I AM UNABLE TO PAY $800 WHEN I PAY ALREADY FOR MY CAR, INSURANCE, MY APARTMENT, AND MOST IMPORTANT SCHOOL. IF THERE IS ANY WAY SOME ONE COULD CONTACT ME I WOULD BE MORE THEN WILLING TO SPEAK ABOUT THIS PROBLEM.  *CN",
        "vin": "1FAFP34N56W"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/26/2010",
        "dateOfIncident": "01/23/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10302328,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 FORD FOCUS KEY GETS STUCK IN IGNITION....THIS HAS HAPPENED NUMEROUS TIMES......HAVE HAD TO SIT AND JIGGLE KEY BACK AND FORTH IN ORDER TO GET IT OUT OF IGNITION. *TR",
        "vin": "1FAFP34N46W"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/15/2009",
        "dateOfIncident": "12/09/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10295892,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD FOCUS.  DURING APPLICATION THE ACCELERATOR BECOMES STUCK.  THE VEHICLE WAS TAKEN TO THE DEALER FOR INSPECTION. SHE WAS ADVISED THAT  THEY MAY HAVE TO MAKE AN ADJUSTMENT, AND THAT THE THROTTLE CABLE WAS SHREDDING . SHE REPAIRED THE VEHICLE AT AN EXPENSE OF $300.00 DOLLARS. THE FAILURE AND CURRENT MILEAGES WERE 58000.",
        "vin": "1FAHP34N96W"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/10/2009",
        "dateOfIncident": "12/10/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10295233,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 FORD FOCUS CONTINUOUSLY GETS THE KEY STUCK IN THE IGNITION IT SEEMS IT IS DUE TO THE GEAR SHIFT NOT LOCKING IN PLACE. I HAVE HAD TO LEAVE THE KEY IN THE IGNITION ON A FEW OF THOSE OCCASIONS AND PLACE THE EMERGENCY BRAKE ON. *TR",
        "vin": "1FAFP34N16W"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/10/2009",
        "dateOfIncident": "10/28/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10295268,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2006 FORD FOCUS.  THE KEY HAS BEEN CONSTANTLY GETTING LOCKED INTO THE IGNITION.  YOU CANNOT TAKE IT OUT AND EVENTUALLY MY KEY BROKE.  THIS HAPPENED MORE THAN ONCE.  I RESEARCHED AND FOUND OUT THAT A LOT OF OTHER FORD FOCUS CUSTOMERS WERE EXPERIENCING THE SAME THING! *TR",
        "vin": "1FAFP34N16W"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "10/29/2009",
        "dateOfIncident": "10/22/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10290236,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVERS SIDE SEAT BACK ON MY 2006 FOCUS BROKE WITHOUT WARNING, CAUSING THE DRIVER TO LOOSE CONTROL OF HER VEHICLE. THE DRIVER WAS ABLE TO STOP THE CAR SAFELY, BUT SUSTAINED A BACK INJURY. *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/28/2009",
        "dateOfIncident": "09/26/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10285517,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD FOCUS. THE CONTACT STATED THAT HE CAN NOT REMOVE THE KEY FROM THE IGNITION. THE DEALER WAS CONTACTED. UPON CONTACT A TECHNICIAN STATED THAT HE WOULD HAVE TO PAY $300.00 TO REPLACE THE IGNITION SWITCH. NO REPAIRS WERE MADE. THE MANUFACTURER  WAS CONTACTED, BUT NO ASSISTANCE WAS PROVIDED BECAUSE THE WARRANTY EXPIRED. THE FAILURE AND CURRENT MILEAGES WERE 32000.",
        "vin": "1FAFP34N76W"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/17/2009",
        "dateOfIncident": "09/16/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10284420,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ABOUT HALF TO 3/4 OF THE TIME MY IGNITION WILL NOT START ON MY FORD FOCUS. THIS PRESENTS A MAJOR PROBLEM WHEN I AM AWAY FROM THE HOME AND MY CAR WILL NOT START DUE TO IGNITION SWITCH PROBLEMS. AT TIMES I HAVE TO TURN THE KEY 20-50 TIMES FOR THE CAR TO COME ON. I AM 76 YEARS OLD AND THIS IS A MAJOR ISSUE FOR ME. I DON'T WANT TO EVEN DRIVE MY CAR FOR FEAR THAT I WILL NOT BE ABLE TO RE-START IT. *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/31/2009",
        "dateOfIncident": "08/29/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10282399,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FUSE FOR THE RUNNING LAMPS KEPT BLOWING. A FEW DAYS LATER I SMELT A BURNING SMELL, PULLED OVER, TURNED OFF THE CAR, REMOVED KEY, BUT CAR WAS STILL RUNNING. A FEW DAYS LATER, BATTERY LIGHT KEPT FLASHING, TURNS OUT, THE ALTERNATOR WAS FRIED. TOOK IT TO FORD, WAS TOLD THERE WAS NOTHING THEY COULD DO BECAUSE MY POWERTRAIN WARRANTY DOES NOT COVER ELECTRICAL WORK. TOOK IT TO AN ELECTRICIAN, WAS TOLD A FEW WIRES TOUCHED METAL AND FUSED TOGETHER AND BURNT ALL THE WAY BACK TO THE FIREWALL. WHEN YOU LOOK AT THE WIRES, THERE IS METAL SITTING UNDER THEM....THERE ARE NO CLIPS TO HELP HOLD THE WIRES AWAY FROM THE METAL. THERE IS SOME FORM OF PROTECTION ON THE WIRES, I DESCRIBE IT AS A FOAM...BUT ITS WORN THROUGH.  WHEN I ASKED HIM HOW THIS COULD HAVE HAPPENED, HE REPLIED WITH \"GOING OVER BUMPS, RAILROAD TRACKS, OR HITTING A POTHOLE. HE ALSO TOLD ME IT WAS A FIRE HAZARD. AS A CONSEQUENCE TO THIS, MY CAR IS NOW JUST SITTING, AND I WILL NOT DRIVE IT WITH IT BEING LABELED A FIRE HAZARD. NOTHING WAS DONE TO CORRECT THE FAILURE. *TR",
        "vin": "1FAFP31N66W"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/19/2009",
        "dateOfIncident": "03/08/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10280950,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY KEY BECAME LOCKED IN THE IGNITION AND COULD NOT BE REMOVED WHILE ON VACATION. I COULD TURN THE CAR ON AND DRIVE IT BUT COULD NOT REMOVE IT, THEREFORE HAD TO END VACATION EARLY TO TAKE CARE TO LOCAL DEALERSHIP. THE CAR WAS 75 DAYS OUT OF WARRANTY AND I HAD NO CHOICE BUT TO FIX THIS- COSTING ME OVER $300.00. THEY (FORD) SAID IT WAS THE SAFETY SWITCH IN THE SHIFTER. VEHICLE HAD A LITTLE OVER 18,000 MILES. THE CAR WAS PURCHASED USED FROM AN ESTATE OF A LADY WHO HAD ONLY DRIVEN 8,000 MILES. *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/04/2009",
        "dateOfIncident": "08/03/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10279303,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD FOCUS.  THE CONTACT STATED THAT THE CALIPER WAS CUTTING INTO THE BRAKE ROTORS.  SHE TOOK THE VEHICLE TO A FIRESTONE CENTER AND WAS INFORMED THAT THERE WAS A DEFECT.  SHE WAS ADVISED TO TAKE THE VEHICLE TO A FORD DEALER.  THE FAILURE MILEAGE WAS 34,000.",
        "vin": "1FAFP34N86W"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/03/2009",
        "dateOfIncident": "07/31/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10279161,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD FOCUS.  THE CONTACT NOTICED THAT THE TAIL LIGHT BULB WAS MELTING DOWN THE PLASTIC COVER ASSEMBLY.  THE VEHICLE WAS TAKEN TO THE DEALER AND THEY STATED THAT THE TAIL LIGHT ASSEMBLY NEEDED TO BE REPLACED.  THE CURRENT AND FAILURE MILEAGES WERE 22,000.  THE TAILLIGHT SOCKET ASSEMBLIES OVERHEATED. UPDATED 09/04/09.*JB",
        "vin": "1FAHP36N36W"
    },
    {
        "components": "ELECTRICAL SYSTEM,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "07/13/2009",
        "dateOfIncident": "05/17/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10276550,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE KEY HAS BECOME STUCK IN THE IGNITION AND WILL NOT COME OUT BECAUSE THE CAR DOES NOT THINK IT IS PARK EVEN THOUGH IT IS PARKED. THE DEALER INSIST THAT THERE WAS A SODA SPILLED ON THE IGNITION AND THIS RESULTED IN THE CHIP IN THE IGNITION SHORTING OUT. THIS KEY HAS BEEN STUCK SINCE MAY AND HAS ONLY COME OUT OF THE IGNITION ONCE SINCE THEN! THE DEALERSHIP SAYS THAT THEY HAVE TO ORDER THIS PART AND CHANGE OUT THE IGNITION TO FIX IT. SO FAR, THIS PROBLEM HAS NOT BEEN RESOLVED AND WE CANNOT LOCK ALL OF THE DOORS BECAUSE OF THIS. *TR",
        "vin": "1FAFP34N56W"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/21/2009",
        "dateOfIncident": "04/10/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10266208,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2006 FORD FOCUS HATCHBACK DEVELOPED FRAYED WIRES IN THE HATCHBACK HARNESS THAT CAUSED A SHORT SO THAT THE DASHBOARD LIGHTS DO NOT COME ON AS THEY SHOULD WHEN THE EXTERIOR LIGHTS ARE TURNED ON UNLESS THE REAR WINDOW DEFROSTER IS ALSO TURNED ON. DESPITE BEING COVERED BY FORD'S 'EXTRA CARE' EXTENDED SERVICE PLAN THAT IS SUPPOSED TO COVER WIRING HARNESSES, FORD IS REFUSING TO PAY FOR THE REPAIR. *TR",
        "vin": "1FAFP31N66W"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/26/2009",
        "dateOfIncident": "03/18/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10263144,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD 3 WHEEL STUDS BREAK OFF WHILE CHANGING TIRES FROM SUMMER TO WINTER AND BACK. TOOK TO 2 DEALERS AND CONTACTED FORD AND NONE OF THESE SOURCES WOULD HONOR 3/36 WARRANTY REGARDING MANUFACTURING DEFECTS. DEALERS STATED THAT STUDS WERE RUSTY AND THAT THEY WERE PROBABLY PUT ON TO TIGHT. THIS FALSE, AS I DO THIS MYSELF WITH A TORQUE WRENCH PER VEHICLE SPECS. THIS COULD BE A VERY DANGEROUS CONDITION IF I WAS CHANGING A FLAT ON SOME RURAL ROAD OR BUSY HIGHWAY AND I COULD NOT GET WHEEL OF WITHOUT BREAKING WHEEL STUDS. RUST ON THE STUDS CAUSED BY ROAD SALT AND DEBRIS THROUGH THE OPEN WHEEL NUT DESIGN IS A PROBLEM THAT SHOULD BE CORRECTED BY FORD. *TR",
        "vin": "1FAFP31N16W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/19/2009",
        "dateOfIncident": "03/10/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10262480,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD FOCUS.  THE CONTACT STATED THAT THE AIR BAG WARNING INDICATOR ILLUMINATED INTERMITTENTLY ON THE INSTRUMENT PANEL.  THE DEALER PERFORMED A DIAGNOSTIC, WHICH INDICATED THAT THERE WAS AN ISSUE WITH THE AIR BAGS.  IN ADDITION, A TRACK HARNESS WAS NEEDED.  THE AIR BAG INDICATOR CONTINUED TO ILLUMINATE AND A SECOND DIAGNOSTIC WAS PERFORMED.  THE TEST SHOWED NO ISSUES WITH THE AIR BAG; THEREFORE, NO REPAIRS WERE MADE.  THE CONTACT WAS CONCERNED FOR HER SAFETY IF THE AIR BAGS FAILED TO OPERATE IN THE EVENT OF A CRASH.  THE CURRENT AND FAILURE MILEAGES WERE LESS THAN 59,828.      UPDATED 04/16/09.*JB",
        "vin": "1FAFP34N06W"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/09/2009",
        "dateOfIncident": "03/07/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10261147,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2006 FORD FOCUS AND MY KEY IS STUCK IN THE IGNITION. I HAVE CONTACTED THE DEALERSHIP AND FORD CUSTOMER SERVICE AND THEY WERE NO HELP. THE IS A COMMON PROBLEM WITH THE FORD FOCUS BUT THEY WON'T ISSUE A RECALL ON IT. THIS IS A SAFETY ISSUE- MY CAR IS AT RISK OF BEING STOLEN AND I DON'T HAVE THE 400.00 THEY ASK TO REPAIR THIS. *TR",
        "vin": "1FAFP34N86W"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/13/2009",
        "dateOfIncident": "12/22/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10258564,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE KEY GETS STUCK IN THE IGNITION AND WON'T COME OUT.  I HAVE TO REMOVE ONE OF THE BATTERY CABLE FROM THE BATTERY, REMOVE THE KEY FROM THE IGNITION, THEN REPLACE THE BATTERY CABLE BACK.  THIS HAS HAPPEN MORE THAN ONCE. *TR",
        "vin": "1FAFP34N46W"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/15/2009",
        "dateOfIncident": "11/01/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10255156,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR OF THE CAR JERKS/PULLS AROUND.  IT IS VERY HARD TO KEEP CONTROL OF THE VEHICLE WHEN THIS HAPPENS.  THOUGHT IT WAS AN ALIGNMENT PROBLEM.  AFTER HAVING FOUR WHEEL ALIGNMENTS DONE, THE PROBLEM STILL EXISTED.  SEVERAL MECHANICS TRIED DIAGNOSING THE PROBLEM WITH NO LUCK.  FINALLY ONE MECHANICS WAS ABLE TO PINPOINT THE PROBLEM.  SEEMS THE REAR LOWER ARM ASSEMBLIES ARE FAILING (DEFECTIVE OR WEAK PARTS).      MY WIFE WAS IN AN ACCIDENT A FEW WEEKS AGO WHICH I BELIEVE MAY HAVE BEEN DUE TO NOT BEING ABLE TO CONTROL THE CAR (BACK END BASICALLY DOES WHAT IT WANTS TO DO)    THIS IS NOT AN ISOLATED PROBLEM.  I KNOW OF THREE OTHER PEOPLE WITHIN A TEN MILE RADIUS WHO ARE ALSO HAVING THE SAME PROBLEM WITH THERE FORD FOCUS.  THIS IS DEFINITELY A SAFETY ISSUE WHEN IT TAKE EVERY LITTLE BIT OF EFFORT TO KEEP YOUR CAR IN CONTROL ESPECIALLY ON SNOW COVERED ROADS. *TR",
        "vin": "1FAHP36N16W"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/29/2008",
        "dateOfIncident": "12/09/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10253123,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 FOR FOCUS 2.0 I-4 BLEW OUT SPARK PLUG OUT OF THE HEAD N WITH IGNITION COIL. END RESULT FINDING THAT THE CAR HAD THE WRONG SPARK PLUGS FROM THE FACTORY. AND FORD WONT FIX THEIR MISTAKE. THE CAR IS UNDER WARRANTY. *TR",
        "vin": "1FAFP31N66W"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "11/14/2008",
        "dateOfIncident": "08/12/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10248829,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD FOCUS.  WHILE DRIVING APPROXIMATELY 25 MPH ON NORMAL ROAD CONDITIONS, THE REAR PASSENGER DOOR OPENED UNEXPECTEDLY.  THE CONTACT PULLED OVER TO THE SIDE OF THE ROAD AND ATTEMPTED TO CLOSE THE DOOR; HOWEVER, IT FAILED TO CLOSE AND HAD TO BE TIGHTLY SECURED WITH A BUNGEE CORD.  IN ADDITION, THE LATCHES FAILED TO SECURE THE REAR LIFTGATE.  ON TWO SEPARATE OCCASIONS, THE  VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC FOR REPAIRS.  THE CONTACT WAS CONCERNED OF THE SAFETY RISK INVOLVED.  THE VIN WAS UNKNOWN.  THE FAILURE MILEAGE WAS 49,000 AND CURRENT MILEAGE WAS 51,000.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/13/2008",
        "dateOfIncident": "10/07/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10245289,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 FORD FOCUS WITH LOW MILEAGE REPLACING BRAKE PADS AND ROTORS FOR THE 3RD TIME, MY CONCERN IS OF FAULTY PARTS FORD COMPANY MAY BE USING AND IF SO, DUE TO THE OBVIOUS SAFETY CONCERNS SHOULD I BE ALARMED AND SHOULD I WORRY WHEN MYSELF AND MY FAMILY ARE TRAVELING IN THE CAR WILL THE BRAKES FELL. FORD CHARGED ME THE FIRST REPAIR COST AND NOW  JUST A FEW MONTHS LATER READY TO CHARGE ME AGAIN FOR THE SAME REPAIRS. *TR",
        "vin": "1FAFP38ZX6W"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/12/2008",
        "dateOfIncident": "10/12/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10245204,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ABOUT 2 MONTHS AGO, MY KEY GOT STUCK IN THE IGNITION.  I COULD START AND DRIVE THE CAR, BUT NOT GET THE KEY.  I DROVE TO A FORD DEALER AND THE PERSON HAD NO TROUBLE GETTING MY KEY OUT.  THIS WAS AT 34,000 MILES.  NOW, AT 36,500 MILES, THE SAME THING HAPPENED.  I AM TAKING TO A FORD DEALER AND THEY BETTER REPAIR UNDER THE 3/36,000 WARRANTY. *TR",
        "vin": "1FAHP34N26W"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/11/2008",
        "dateOfIncident": "10/06/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10245135,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS IN FRONT END COLLISION AND NEITHER OF THE AIR BAGS DEPLOYED. *TR",
        "vin": "1FAHP34N36W"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/19/2008",
        "dateOfIncident": "09/15/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10242956,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 FORD FOCUS ZX4 MODEL SES.   IGNITION KEY STUCK IN IGNITION.  CAR WILL START BUT KEY WILL NOT COME OUT.  CAR CAN BE PUT INTO GEAR WITH SWITCH IN OFF POSITION. SAFETY PROBLEM    CAR HAS 35,000 MILES.   DEALER DID WARRANTY REPAIR TODAY - WE ARE PICKING THE CAR UP TONIGHT SO I DON'T KNOW THE QUALITY OF THE REPAIR YET.  *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/16/2008",
        "dateOfIncident": "07/09/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10238507,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "27500 MILES, 2006 FOCUS ZX3, I NOTICED AS GOING OVER SPEEDBUMPS AND PARKING INTO PARKING SPOT, MY CAR MADE CREAKING NOISES AS IF THE BOTTOM OF THE CAR WAS GOING TO FALL OFF.  I TOOK THIS TO MY DEALERSHIP AND IT TOOK THEM A WHILE AND EVENTUALLY THEY FOUND RUST ON THE SPRINGS.  THEY FILED OFF THE RUST AND PUT THE CAR BACK TOGETHER, NO MORE CREAKING.  *TR",
        "vin": "1FAFP31N06W"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/07/2008",
        "dateOfIncident": "07/14/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10237390,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY KEY GOT STUCK IN THE IGNITION OF MY 2006 FORD FOCUS STATION WAGON AND WOULD NOT COME OUT. WHEN I TOOK IT TO THE REPAIR SHOP I FOUND OUT THAT THE IGNITION SWITCH AND BRAKE/SHIFT INTERLOCK HAD BOTH FAILED. THE SERVICE MANAGER SAID HE HAS SEEN THIS PROBLEM OFTEN IN FORD FOCUS CARS. I HAD BOTH PARTS REPLACED, BUT I FEEL THAT THIS IS NOT PART OF NORMAL WEAR AND TEAR OF MY VEHICLE, WHICH IS NOT QUITE THREE YEARS OLD YET. THE PARTS ARE WORKING FINE NOW THAT THEY HAVE BEEN REPLACED THOUGH. *TR",
        "vin": "1FAHP36N76W"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/16/2008",
        "dateOfIncident": "11/15/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10231176,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT CAR WITH 12,000 MILES ON IT IN 2007.  NOTED VIBRATION AND PULL TO THE RIGHT SHORTLY AFTER PURCHASE.  TOOK TO A DEALERSHIP FOR ALIGNMENT AND TOLD THE ALIGNMENT WAS PERFECT.  AFTER ANOTHER MONTH AND HAVING TO REPLACE ALL THE TIRES DUE TO BALD SPOTS,  TOOK CAR BACK TO THE DEALERSHIP.  THEY SHOWED ME THE COMPUTER PRINT OUT AND CONFIRMED THAT THERE WAS NOTHING WRONG WITH THE ALIGNMENT.  SECOND SET OF TIRES NOW PREMATURELY WEARING AND CAR CONTINUES TO VIBRATE AT HIGHWAY SPEEDS AND PULL TO THE RIGHT.  TIRES ROTATED EVERY 6,000 MILES AND ALL HIGHWAY DRIVING.  LIKE THE CAR BUT FEEL UNSAFE WITH THIS PROBLEM.  *TR",
        "vin": "1FAFP36N26W"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/09/2008",
        "dateOfIncident": "06/06/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10230297,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 FORD FOCUS ZX3 SE  REAR HATCH DOOR WIRING ---BROKEN WIRES AND WIRE INSULATION.  FIRST STARTED WITH PLATE LIGHTS BLOWING OUT. NOW ALL PARKING LIGHTS,TAILLIGHTS AND DASH LIGHTS ARE OUT---BLOWING FUSES!!!  OUT OF CURIOSITY I PULLED DOWN THE RUBBER BOOT OF THE WIRE HARNESS OF THE REAR HATCH DOOR AND FOUND BROKEN WIRES AND INSULATION.  WENT TO FORD WEBSITE TO SEE IF THERE WAS A RECALL ON THIS, FOUND NO RECALLS AT ALL FOR MY CAR!!!!!  UPON FURTHER RESEARCH FOUND THAT THERE IS A RECALL FOR THIS VERY PROBLEM FROM 8 YEARS AGO NOV - DEC OF 2000!!!!!!!!!  *TR",
        "vin": "1FAFP31N36W"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/23/2008",
        "dateOfIncident": "04/21/2008",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10225441,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THE 19TH OF APRIL, MY VEHICLE WAS PERFORMING NORMALLY.  ON THE 20TH OF APRIL, THE VEHICLE WAS UNABLE TO ATTAIN NORMAL DRIVING SPEEDS; TOP SPEED WAS AROUND 20 MPH.  AS A RESULT, WE CHOSE TO RETURN HOME IMMEDIATELY AND TO BRING THE VEHICLE TO THE DEALERSHIP THE NEXT DAY.    ON THE 21ST, AROUND 10:15 A.M., I BEGAN TO DRIVE THE VEHICLE TO THE DEALERSHIP.  HOWEVER, AFTER APPROXIMATELY 1.5 MILES, THE ENGINE BEGAN CUTTING OUT COMPLETELY AND THERE WAS A STRANGE ODOR.  I GOT THE VEHICLE RESTARTED AND PULLED INTO AN ADJACENT PARKING LOT.  I PARKED THE VEHICLE AND SHUT IT OFF.    I FOUND A NEARBY STORE FROM WHICH I COULD CALL HOME.  WHEN I STEPPED BACK OUTSIDE I WAS UNABLE TO SEE THE VEHICLE DUE TO SMOKE.  I RETURNED TO THE STORE AND IMMEDIATELY CALLED 911.  BY THE TIME I STEPPED BACK OUTSIDE, THERE WERE VISIBLE FLAMES.    POLICE AND FIRE RESPONDED, BUT THE VEHICLE WAS A COMPLETE LOSS.  *TR",
        "vin": "1FAHP36N86W"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/11/2008",
        "dateOfIncident": "06/07/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10224250,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "FORD 2006, FOCUS ZXW, WHEN PARKING THE CAR, THE MOVING THE AUTOMATIC TRANSMISSION STICK TO PARK DOES NOT LOCK IN ALL THE TIME. IT DOES SEEMS TO PARK, CAR DOES NOT ROLL, BUT TRANS MISSION STICK EASILY MOVE AWAY AND FLL INTO OTHER GEARS, AND THE CAR MOVES. WHEN IT DOES NOT LOCK UNABLE TO REMOVE THE KEY. MOST OF THE TIME AFTER ABOUT UP TO 3 MIN LATER YOU HEAR  A TING SOUND THEN IT LOCKS. ONCE IT LOCKS KEY CAN BE REMOVED.  I ALSO HAD THE SAME ISSUE WITH 2003 FORD FOCUS 2 YEARS EARLIER, DEALER REPLACED THE LOCK THEN IT WOULD RELEASE THE KEY, EVERY TIME I PARKED.   *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/10/2008",
        "dateOfIncident": "04/05/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10224149,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2006 FORD FOCUS AND THE KEY KEEPS GETTING STUCK INSIDE OF THE IGNITION WITHOUT ANY WARNING.  IT WILL STAY STUCK FOR A FEW WEEKS AND THEN ONE DAY IT WILL JUST COME OUT.  *TR",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "04/03/2008",
        "dateOfIncident": "03/17/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10223224,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "DUNLOP TIRE CORPORATION",
                "productMake": "DUNLOP",
                "productModel": "DUNLOP",
                "productYear": "1974",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "ONE TIRE RUPTURED HOLE IN SIDEWALL RESULTING IN FLAT DRIVING DOWN HIGHWAY.  TOOK TIRE IN TO BE REPLACED.  NONE OF OTHER TIRES REVIEWED BY TIRE CENTER.  INDEPENDENT COMPANY FOUND REMAINING TIRES TO HAVE \"BUBBLED\" SIDEWALLS.  ALL TIRES FROM SAME BATCH.  TIRES ARE ONLY TWO MONTHS OLD AND TIRE CENTER WILL NOT ACKNOWLEDGE THAT THE BATCH IS DEFECTIVE.  (HOW COULD ALL FOUR TIRES GO BAD IN TWO MONTHS?)   *TR",
        "vin": "1FAFP31NX6W"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/02/2008",
        "dateOfIncident": "11/03/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10223193,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*- THE CONTACT OWNS A 2006 FORD FOCUS.  WHILE DRIVING 50 MPH, HE CRASHED INTO THE PASSENGER SIDE OF ANOTHER VEHICLE.  THE CONTACT STATED THAT THE AIRBAGS DEPLOYED ABOUT A MINUTE AFTER THE CRASH.  AS OF APRIL 2, 2008, THE DEALER HAD NOT INSPECTED THE VEHICLE.  THE CRASH DESTROYED THE VEHICLE.  THE CURRENT AND FAILURE MILEAGES WERE 36,000.  THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/01/2008",
        "dateOfIncident": "03/11/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10223066,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "SERIOUS CAR ACCIDENT AND NON DEPLOYMENT OF AIR BAGS.  *TR",
        "vin": "WF0TD94L36V"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/31/2008",
        "dateOfIncident": "03/31/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10222901,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Pirelli Tire, LLC",
                "productMake": "PIRELLI",
                "productModel": "P6",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "VERY LOW TIRE LIFE/TREADWEAR PREMATURE.  *TR",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/26/2008",
        "dateOfIncident": "03/22/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10222431,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Pirelli Tire, LLC",
                "productMake": "PIRELLI",
                "productModel": "P6",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "2006 FORD FOCUS REAR TIRES .  NORMAL DRIVING CONDITIONS WHEN TIRES START TO SHAKE AND THEN WEAR UNEVENLY ON BOTH SIDES.  ONLY 26000 MILES ON TIRES FROM THE DEALER. HAVE TO REPLACE.  DEALER SAYS THEIR IS NOTHING WRONG WITH CAR ITSELF, JUST POOR DRIVING.  FRONT TIRES STILL HAVE CLOSE TO HALF LIFE LEFT.  STILL HAVE REAR TIRES.  *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "03/18/2008",
        "dateOfIncident": "03/10/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10221598,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD FOCUS.  WHILE DRIVING 25 MPH, THE CONTACT'S VEHICLE ACCELERATED AND REAR ENDED ANOTHER VEHICLE.  THE CONTACT'S VEHICLE WAS DAMAGED VERY BADLY.  THE INSURANCE COMPANY STATED THAT THIS FAILURE OCCURRED IN OTHER FORD FOCUS' AS WELL.  THERE WERE NO INJURIES.  A POLICE REPORT WAS FILED.  THE CURRENT AND FAILURE MILEAGES WERE 44,000.    UPDATED 04/21/08 *BF",
        "vin": "1FAFP34N96W"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/07/2008",
        "dateOfIncident": "03/03/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10220358,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR TIRES PREMATURELY WORN AND DAMAGED. 2006 FORD FOCUS WITH 34,000 MILES. THE PASSENGER SIDE REAR TIRE WORE OUT BADLY, (BALD SPOTS, AND IN NEED OF REPLACEMENT. ALSO THE DRIVER'S REAR TIRE WORE OUT WELL BEYOND THE ACCEPTABLE RANGE FOR THE MILEAGE. ALSO NEEDS REPLACEMENT.   REAR END IS UNSTABLE AND I TURNED THE CAR AROUND WHEN REAR OF CAR LOST STABILITY.  HAVE AN ALIGNMENT SCHEDULED BUT IN 50 YEARS OF DRIVING I HAVE NEVER HAD A CAR'S REAR WHEELS TO BE OUT OF ALIGNMENT BAD ENOUGH TO MAKE CAR UNSAFE.  *TR",
        "vin": "1FAFP34N16W"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/14/2008",
        "dateOfIncident": "02/14/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10218092,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD FOCUS.  THE CONTACT STATED THAT HE WAS UNABLE TO REMOVE THE KEY FROM THE IGNITION.  IN ADDITION, THE GEAR SHIFT INDICATOR WOULD ENGAGE WITHOUT DEPRESSING THE BRAKE.  AS OF FEBRUARY 14, 2008, THE DEALER HAD NOT INSPECTED THE VEHICLE.  THE CURRENT AND FAILURE MILEAGES WERE 430,000.",
        "vin": "1FAFP34N26W"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/24/2007",
        "dateOfIncident": "11/15/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10209775,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I NOTICED THAT THERE WAS EXCESSIVE TIRE WEAR ON REAR TIRES.   AT 20K MILES THE REAR TIRES ARE ALMOST BALD 2/32 OF TREAD LEFT.  THERE APPEARS TO BE AN ALIGNMENT ISSUE THAT DEALER WOULD NOT COVER UNDER WARRANTY.   I WAS TOLD THAT ALIGNMENT IS ONLY COVERED FOR FIRST 12K MILES.    THE FRONT WAS ALIGNED UNDER WARRANTY AFTER A BAD TIRE WAS FOUND AT SCHEDULED SERVICE.  IT IS SO BAD NOW THAT WHEN YOU HIS A BUMP IN THE ROAD THE REAR OF THE CAR JUMPS TO ONE SIDE.   *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/25/2007",
        "dateOfIncident": "10/09/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10206843,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAGS DIDN'T DEPLOY.  *JB",
        "vin": "1FAHP31N56W"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/09/2007",
        "dateOfIncident": "09/18/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10205233,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD FOCUS.  THE CONTACT STATED THAT THE BRACKET IN THE FRONT OF THE VEHICLE CAME APART.  THE DEALER STATED THAT THE CONTACT MUST HAVE HIT SOMETHING IN ORDER FOR IT TO COME APART.  AS OF OCTOBER 9, 2007, THE DEALER HAD NOT REPAIRED THE VEHICLE.  THE CURRENT MILEAGE WAS 9,800 AND THE FAILURE MILEAGE WAS 9,750.",
        "vin": "1FAFP34N06W"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/12/2007",
        "dateOfIncident": "11/01/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10202740,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "EAGLE",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD FOCUS.  THE VEHICLE HAS GOODYEAR EAGLE, SIZE 195/60R15.  WHILE DRIVING 40 MPH, THE VEHICLE BEGAN TO SHAKE.  THE VEHICLE WAS TAKEN TO THE DEALER AND THE TIRES WERE REPLACED BECAUSE THEY WERE WORN.  A REAR ALIGNMENT WAS PERFORMED FOUR TIMES PRIOR TO THE FAILURE.  THE TIRE AND VEHICLE FAILURE MILEAGE WAS 31,000 AND CURRENT MILEAGE WAS 48,000.  THE CONSUMER PROVIDED INFORMATION ON THE ROAD HAZARD TIRE COVERAGE, INFORMATION ON WEBSITES PERTAINING TO THE DEFECT, VEHICLE DESCRIPTION AND CONTRACT AND PICTURES OF THE DEFECT. UPDATED 09/24/07  *TR  UPDATED 10/11/07  *TR",
        "vin": "1FAFP34N06W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/11/2007",
        "dateOfIncident": "09/10/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10202578,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING AT LEGAL SPEED MY SIDE DRIVERS AIRBAG DEPLOYS THEN EXPLODES UNDER MY LEFT ARMPIT CAUSING ME TO LOSS CONTROL, BUT WAS ABLE TO GAIN CONTROL WITHOUT AN ACCIDENT. FORD TECHNICIANS PERFORMED DIAGNOSTICS, NOTICED A SCRAPE ON PASSENGER UNDERCARRIAGE. THERE CONCLUSIONS WAS THAT I MUST HAVE HIT SOMETHING ON THE RODE. THIS WAS A SMALL THREE INCH SCRAPE THAT SO CALLED CAUSED THE AIR BAG DEPLOYMENT. I DON'T BUY THAT. IN MY OPINION, THE BAG SHOULD NOT HAVE DEPLOYED BECAUSE NO ACCIDENT OCCURRED. I SUSTAINED BRUSHES AND LACERATIONS. I DO NOT FEEL SAFE IN THIS VEHICLE AND WILL TRADE IN. AGAIN, THE SCRAPE JUST REMOVED THE UNDER COATING, NO OTHER DAMAGE RESULTED. MY BEST GUESS WAS A ROCK. THESE SAFETY BAGS ARE NOT PREVENTING PERSONAL INJURY, BUT CAUSING THEM.  *TR    UPDATED 12-12-2007 *BF  THE CONSUMER STATED WOULD HAVE TO PAY A $500 DEDUCTIBLE BEFORE THE INSURANCE COMPANY WOULD PAY THE ADDITIONAL FEE. THE CONSUMER PROVIDED AN ESTIMATE FOR REPAIRS. UPDATED 12/12/07  *TR",
        "vin": "1FAHP34N86W"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/21/2007",
        "dateOfIncident": "02/16/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10200369,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD FOCUS.  WHILE DRIVING 55 MPH UNDER DRY CONDITIONS, THE CONTACT SWERVED TO AVOID STRIKING AN ANIMAL IN THE ROAD.  AS A RESULT, THE VEHICLE CRASHED INTO THE PASSENGER SIDE OF ANOTHER VEHICLE AND SPUN AROUND A FEW TIMES.  THE CONTACT'S VEHICLE SUSTAINED FRONT END DAMAGE, HOWEVER, THE AIR BAGS NEVER DEPLOYED.  THE POLICE ARRIVED AND FILED A REPORT.  TWO PASSENGERS SUFFERED WHIPLASH, ONE OF WHOM WAS PREGNANT AND WAS HOSPITALIZED.   FORD OFFERED NO ASSISTANCE.  THE VIN, ENGINE SIZE, AND NUMBER OF CYLINDERS WERE UNKNOWN.  THE APPROXIMATE CURRENT AND FAILURE MILEAGES WERE 20,000.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/24/2007",
        "dateOfIncident": "07/15/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10197357,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "SEVERAL WEEKS AGO VEHICLE ( FOCUS ) DEVELOPED A SIGNIFICANT SCREECH WHENEVER BRAKES WERE APPLIED. TOOK IT INTO LOCAL FORD DEALERSHIP AND THEY SAID THAT IF I HAD REPORTED BRAKE NOISE IN FIRST 12 MONTHS OR 18,000 MILES THEY WOULD HAVE FIXED IT. THEY HAD A TECHNICAL ADVISORY FROM FORD INDICATING THERE WAS A PROBLEM WITH A LIMITED NUMBER OF VEHICLES BUT DID NOT WANT TO SEND OUT RECALL NOTICE BECAUSE THEN EVEYONE WOULD COMPLAIN ABOUT BRAKE SQUEAK. SINCE I DID NOT HAVE THE PROBLEM IN THEIR TIME LIMITS THE EXPENSE TO FIX  ( ESTIMATED TO BE OVER $700 ) WOULD BE MY RESPONSIBILITY. I DON'T TRUST FORD BECAUSE THEY HAVE HAD COVER UPS BEFORE. I DON'T BELIEVE THEM WHEN THEY SAY VEHICLE IS SAFE TO DRIVE AND I DON'T HAVE $700 TO SPEND TO REPLACE THE ENTIRE REAR BRAKE SYSTEM. I TALKED TO TWO DEALERSHIPS AND CORPORATE CUSTOMER ASSISTANCE. ALL BASICALLY SAID IT WAS MY TOUGH LUCK. I WANT TO GO ON RECORD AS CHALLENGING THEIR STANCE ON THIS ISSUE AND HOPE YOU CAN INVESTIGATE BRAKE SAFETY ON THIS VEHICLE AFTER 18,000 MILES. *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/18/2007",
        "dateOfIncident": "04/25/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10191137,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "SAME PROBLEM AS ODI #10182755. WHEN ATTEMPTING TO STOP AS FOR A TRAFFIC LIGHT OR PARKING, THE CAR WOULD SUDDENLY KICK INTO HIGH REVS,  (OVER 5000 RPM,  AND ATTEMPT TO ACCELERATE, BUT WOULD STOP IF BRAKES APPLIED VERY STRONGLY. FIRST INCIDENT HAPPENED LESS THAN 24 HOURS AFTER PURCHASING THE CAR IN APRIL 2006. SEVERAL MORE INCIDENTS OVER THE NEXT MONTH, INCLUDING TWO TIMES WHERE THE CAR HAD TO BE TOWED BACK TO THE DEALERSHIP FOR REPAIR. DEALER REPLACED THROTTLE BODY ASSEMBLY AND A CRUISE CONTROL CABLE; NEITHER REPAIR FIXED THE PROBLEM. FINAL ATTEMPT AT REPAIR  DEALER DROVE THE CAR OVER 600 MILES IN 5 DAYS AND REPORTED NO PROBLEM FOUND.  PROBLEM DISAPPEARED UNTIL MARCH 2007 WHEN IT OCCURRED AGAIN.*AK",
        "vin": "1FAHP34N26W"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/07/2007",
        "dateOfIncident": "04/10/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10190088,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STARTING PROBLEMS.  TOOK IT  TO DEALER A FEW TIMES AND  IT STILL DOES IT FROM TIME TO TIME.  AN ADVISORY WAS ISSUES, BUT STILL DID NOT FIX THE PROBLEM. REAR PASSENGER BEARING WENT BAD AROUND 9000 MILES.  FRONT BRAKES WERE ALREADY WORN OUT AT 17000.  THEY REPLACED THEM , AND STILL WENT OUT AROUND 21000.  HAD TO USE OTHER COMPANY PADS/ROTORS TO GO BY.  REAR BRAKE SHOES WERE CRACKED, NOT USED, CRACKED.  THEY SAID IS NORMAL. MANY SUSPENSION NOISES.  THEY SAID ALL WAS  OKAY.  I CHANGED THE SUSPENSION FROM MY OWN MONEY SINCE THEY WERE NO HELP AND STILL SAME NOISES.  NOW THEY BLAME  THE E AFTER MARKET SUSPENSION ON THE PROBLEMS.  *AK    OTHER USERS AND PEOPLE I HAVE TALKED TO COMPLAINED ABOUT SAME OR SIMILIAR ISSUSE.",
        "vin": ""
    },
    {
        "components": "SUSPENSION,TIRES",
        "crash": false,
        "dateComplaintFiled": "04/09/2007",
        "dateOfIncident": "04/01/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10187359,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR TIRES PREMATURELY WORN AND DAMAGED. 2006 FORD FOCUS WITH 21,000 MILES.  THE PASSENGER SIDE REAR TIRE WORE  OUT BADL, (BALD SPOTS,  AND IN NEED OF REPLACEMENT. ALSO THE DRIVER'S REAR  TIRE WORE OUT   WELL BEYOND THE ACCEPTABLE RANGE FOR THE MILEAGE.   ALSO  NEEDS REPLACEMENT.*AK",
        "vin": "1FAHP34N46W"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/01/2007",
        "dateOfIncident": "02/28/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10183862,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I'VE HAD MY 2006 FOCUS ST FOR ABOUT A YEAR NOW. SINCE I BOUGHT MY CAR I HAVE HAD TO HAVE 3 DIFFERENT ENGINES PUT IN IT. THE ORIGINAL MOTOR THREW A PISTON ROD DOWN THE BOTTOM OF MY ENGINE AND OUT. THEY SAID IT WAS POOR CASTING ON THE CRANKSHAFT. THIS WAS AT ABOUT 4,000 MILES.  THEN AT ABOUT 15,000 MILES IT DID THE SAME THING ONLY THIS TIME I CAUGHT IT BEFORE IT BLEW. NEEDLESS TO SAY I HAD TO HAVE A NEW ENGINE ...AGAIN.  WHAT HAPPENED IS MY ROD BEARINGS WENT OUT WHICH IS MOST LIKELY WHAT HAPPENED THE FIRST TIME, CAUSING MY ENGINE TO COMPLETELY THROW A PISTON ROD. NOW I AM ON MY 3RD ENGINE AND HOPING THAT THIS ONE STICKS. THE MECHANICS ARE VERY PUZZLED WHY THIS IS HAPPENING. THEY HAVE RUN ALL THE DIAGNOSTICS TO PROVE I HAVEN'T BEEN RACING AND I GET REGULAR OIL CHANGES THROUGH THE DEALERSHIP. FORD IS TRYING TO GET TO THE BOTTOM OF IT. GOOD NEWS  IS 2 MORE TIMES IT'S A LEMON. BAD NEWS IS I HAVE HAD TO DEAL WITH MISSED TIME AT WORK AND THE INCONVENIENCE OF IT ALL. BEWARE BUT, THIS DOESN'T SEEM TO BE A REGULAR OCCURRENCE AMONG FOCUS OWNERS.  *JB",
        "vin": "1FAFP38Z96W"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/18/2007",
        "dateOfIncident": "02/08/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10182913,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKES BEGAN SQUEAKING HORRIBLY.  I BROUGHT IT TO THE DEALER TO HAVE THEM FIXED.  THEY SAID IT WAS BRAKE SHOES THAT NEEDED TO BE REPLACED--I AUTHORIZED THEM TO DO THE REPAIR.  LESS THAN A DAY LATER, THE SQUEAK WAS STILL AS BAD.  I BROUGHT THE CAR BACK TO THE DEALER A COUPLE OF DAYS LATER TO HAVE THEM  LOOK AT IT AGAIN.  SUPPOSEDLY, THE SHOP MANAGER TEST DROVE IT HIMSELF AND SAID THERE WAS NO SQUEAK.  HE ALSO TOLD ME THAT FORD STATES THAT IT IS \"NORMAL AND EXPECTED THAT THE BRAKES WILL STILL SQUEAK UNTIL APPROXIMATELY 100 TO 150 APPLICATIONS.\"  IT STILL SQUEAKED THE NEXT DAY, AND AT THIS POINT I AM WELL PAST THE 150 BRAKE APPLICATIONS AND IT SOUNDS JUST AS BAD AS IT DID BEFORE I EVER BROUGHT IT TO THE DEALER.  FUNNY THING IS, I WAS ABOUT 8 DAYS OUT OF THE WARRANTY PERIOD TO HAVE IT FIXED FOR FREE.  I DON'T CARE ABOUT SPENDING THE MONEY, I JUST CARE THAT I SPENT $265 AND THE PROBLEM STILL EXISTS.  *JB",
        "vin": "1FAFP34N16W"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/16/2007",
        "dateOfIncident": "02/16/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10182755,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* - THE CONTACT CALLED REGARDING THE  2006 FORD FOCUS.  THE CONTACT STATED THAT THE VEHICLE WILL IDLE HIGH AND THEN ACCELERATE ON ITS OWN.  THE VEHICLE WILL STOP IF HE APPLIED THE BRAKES, THIS FAILURE HAPPENED  INTERMITTENTLY. THERE WERE NO WARNING INDICATORS. THE FAILURE MILEAGE AND CURRENT MILEAGE WERE BOTH 13,000.  THE VEHICLE HAS BEEN TOWED TO A FORD DEALER.  THE VEHICLE HAD NOT BEEN DIAGNOSED AT THIS TIME. *AK",
        "vin": "1FAFP34N56W"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/28/2006",
        "dateOfIncident": "11/16/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10174534,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED THAT GASOLINE OVERFLOWED FROM THE GAS TANK ON AN INTERMITTENT BASIS.  THE VEHICLE WAS TAKEN TO THE LOCAL DEALER WHO UPON EXAMINATION DETERMINED THAT THERE WAS MINOR DEBRIS IN THE VENT HOSE OF THE GAS TANK.  THE DEALER BLEW OUT THE VENT HOSE.  AFTER THE PROCEDURE THERE WERE NO FURTHER PROBLEMS WITH THE GAS TANK.  THERE WAS A NHTSA RECALL # 06E056000 REGARDING FUEL SYSTEM, GASOLINE WHICH WAS FOUND THAT WAS SIMILAR TO THIS ISSUE.  UPDATED 01/10/06. *JB",
        "vin": "1FAHP34N06W"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "10/24/2006",
        "dateOfIncident": "08/28/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10171694,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED WHILE DRIVING 30 MPH AT NIGHT, AND WHILE MAKING A SLIGHT RIGHT TURN, THE RIGHT WHEELS ON THE VEHICLE DROPPED INTO A SHALLOW ROADSIDE DITCH.  THE CONTACT ATTEMPTED TO TURN THE VEHICLE OUT OF THE DITCH, HOWEVER THE STEERING LOCKED.  A LARGER AMOUNT OF FORCE WAS APPLIED TO THE STEERING WHEEL, AND THERE WAS A LOUD SNAPPING NOISE.  THE VEHICLE SPUN 360 DEGREES, AND LANDED IN THE DITCH ON ALL FOUR WHEELS.  THE FOLLOWING MORNING, THE VEHICLE WAS TAKEN TO A SERVICE DEALER  WHO WAS UNABLE TO DETERMINE THE PROBLEM.  UPDATED 11/30/2006 - *NM",
        "vin": "1FAHP34N56W"
    },
    {
        "components": "STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "09/21/2006",
        "dateOfIncident": "09/20/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10168871,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED WHILE ACCELERATING 5 MPH FROM A STOP SIGN ON NORMAL ROAD CONDITIONS, A VEHICLE TRAVELING 35 MPH IMPACTED THE CONTACT'S VEHICLE ON THE DRIVER SIDE FRONT FENDER.  THE VEHICLE WAS TOWED TO A YARD WHO DEEMED THE VEHICLE WAS TOTALED.  THE OTHER VEHICLE INCURRED SLIGHT DAMAGES.  THE CONTACT SUSTAINED MINOR INJURIES.  THE CONTACT EXPRESSED THAT THE VEHICLE MUST BE A SAFETY HAZARD IF THE VEHICLE'S PARTS WOULD BE SCATTER ALL OVER THE ROAD AFTER AN IMPACT OF LOW SPEED.  A POLICE REPORT WAS TAKEN.",
        "vin": "1FAFP34N26W"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/07/2006",
        "dateOfIncident": "09/02/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10167612,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ON FRIDAY THE IGNITION ON MY CAR DID NOT IMMEDIATELY TURN. I DIDN'T THINK ANYTHING OF IT AT THE TIME. SATURDAY AFTERNOON IT REFUSED TO TURN AT ALL. THE KEY WOULD NOT TURN IN THE IGNITION LOCK CYLINDER. IT FIT AND WAS REMOVABLE BUT JUST WOULDN'T TURN.  THE CAR WOULD NOT THEREFORE, START. I WAS LEFT STRANDED IN A PUBLIC PLACE PREGNANT  WITH MY 3 YEAR OLD CHILD FOR SO LONG DRUG DEALERS STARTED SHOWING UP. I HAD TO PAY FOR A TOW TRUCK WHEN IT FINALLY ARRIVED.           THIS IS IN A 2003 FORD FOCUS ZTW WAGON. IT IS 3 YEARS OLD WITH 50,000 MILES ON IT. I SPENT ALL DAY TUESDAY ON THE PHONE SPEAKING WITH VARIOUS LEVELS OF MECHANICS AND MANAGEMENT. THEY ALL AGREED THAT FORD IS NOT TAKING ANY RESPONSIBILITY FOR THIS DEFECT. ONE OPERATOR DID NOT EVEN RECORD MY PHONE CALL. FORD IS RECALLING DIFFERENT MODEL VEHICLES FOR IGNITION CYLINDER PROBLEMS. THEY HAVE NOT SET UP ANY PUBLIC REIMBURSEMENT OR REPAIR FOR THIS SPECIFIC YEAR AND MODEL VEHICLE. I HAD TO PAY A PRIVATE LOCKSMITH TO COME TO MY HOUSE AND BUILD A NEW CYLINDER AROUND MY KEY BECAUSE I COULD NOT AFFORD TO HAVE THE CAR TOWED AGAIN AND PAY THE EXORBANT DEALER PRICE. I WAS WITHOUT MY VEHICLE FOR SATURDAY, SUNDAY, MONDAY AND THE TUESDAY SURROUNDING LABOR DAY WEEKEND. THE PRIVATE LOCKSMITH REPAIRED IT WEDNESDAY IN A TIMELY MANNER. I HAVE NOT BEEN OFFERED TOWING REIMBURSEMENT, A RENTAL VEHICLE, A REPAIR REIMBURSEMENT OR AN APOLOGY. THE OLD PART (WHAT WAS LEFT AFTER DRILLING IT OUT PER FORD INSTRUCTIONS) WAS NOT SAVED.   *NM",
        "vin": "1FAFP36393W"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "08/02/2006",
        "dateOfIncident": "08/01/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10164162,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDSHIELD WILL NOT CLEAR OFF WITH DEFROST ON, EITHER ON COLD OR HOT.  IT LOOKS LIKE CLOUDS OR VAPOR CROSSING THE WINDSHIELD WHEN DEFROST IS ON AND THE WINDSHIELD SEEMS TO BE COATED WITH SOMETHING.  TOOK TO DEALER WITH COMPLAINT AND THEY SAID IT WAS JUST THE HUMIDITY.  *JB",
        "vin": "1FAFP31N26W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/02/2006",
        "dateOfIncident": "07/14/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10164241,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SON WAS ON HIS WAY HOME AND PASSENGER SIDE AIR BAG DEPLOYED. THERE WAS NO CRASH , NO ACCIDENT.  *NM",
        "vin": "1FAHP31N26W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/27/2006",
        "dateOfIncident": "05/17/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10163736,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THAT THE PASSENGER SIDE AIR BAG INDICATOR BLINKS ON AND OFF. WHEN IT AIR BAG INDICATOR IS OFF THE PASSENGER IS NOT PROTECTED BY THE AIR BAG.  THIS BEGAN FOUR DAYS AFTER THE VEHICLE WAS PURCHASED.",
        "vin": "1FAHP34NX6W"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/28/2006",
        "dateOfIncident": "03/29/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10160954,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THAT THE VEHICLE'S VENTING SYSTEM BLEW WHITE FLAKES AND DUST INSIDE THE VEHICLE WHEN THE HEATER OR AIR CONDITIONING UNIT WAS ACTIVATED.   THE FIRST TIME THE INCIDENT OCCURRED THE HEATER WAS ON.  THE VEHICLE WAS TAKEN TO THE DEALER WHO CLEANED INSIDE THE VENTING SYSTEM BUT COULD NOT FIND ANY PROBLEM WITH THE VEHICLE.  THE VEHICLE WAS TAKEN TO THE DEALER SEVERAL TIMES BECAUSE WHITE FLAKES CONTINUED BLOWING THROUGH THE VENTS.  THE DEALER DETERMINED THAT A CLEANING AGENT THAT MAY HAVE BEEN USED TO CLEAN METAL KNOWN AS SOLDERING FLUX MAY BE THE CAUSE OF WHITE FLAKES COMING FROM THE VENTS. THE EVAPORATOR COIL HOUSING WAS REPLACED ON 04/07/06.  THE EVAPORATOR COIL HOUSING WAS CLEANED ON 04/21/06.  THE VEHICLE VENTING SYSTEM WAS CLEANED AGAIN ON 05/23/06, BUT THE PROBLEM PERSISTED.  THE CONTACT EXPRESSED CONCERN ABOUT THIS CAUSING A RESPIRATORY PROBLEM.",
        "vin": "1FAFP31N86W"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/31/2006",
        "dateOfIncident": "04/24/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10158708,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ON FOUR SEPARATE OCCASIONS MY CAR, WITHOUT FOREWARNING, CUT OFF WHILE IN MOTION AND AT VARIOUS RATES OF SPEED. THE CAR IS NOW BEING SERVICED FOR THIS PROBLEM FOR THE THIRD TIME IN THE TWO MONTHS THAT I HAVE HAD IT. THE CAR ALSO HAS A PROBLEM WITH NOT STARTING, FOR NO APPARENT REASON. *JB",
        "vin": "1FAHP36N96W"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/09/2006",
        "dateOfIncident": "05/04/2006",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10157044,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2006 FORD FOCUS ON 12/3/05, IT HAD 4 MILES ON IT WHEN I DROVE OUT OF THE DEALERSHIP.  ON THURSDAY MAY 3, 2006, IT CAUGHT FIRE IN MY CARPORT.  THE MILEAGE IS BETWEEN 2,000-3,000 MILES, I BELIEVE.     I ARRIVED HOME FROM A MEETING AT A LOCAL BANK, HAVING DRIVEN APPROXIMATELY 2 MILES.  I PARKED THE CAR IN THE CARPORT, TURNED OFF THE ENGINE AND ENTERED THE HOUSE.  I DID NOT NOTICE ANY STRANGE NOISES OR ODORS.  MY HUSBAND ARRIVED HOME ABOUT 15-20 MINUTES LATER.  HE BEGAN TOOTING THE HORN ON HIS VEHICLE TO GET MY ATTENTION.  WHEN I OPENED THE DOOR, HE YELLED \"GET YOUR KEYS.\"  I COULD SEE FLAMES UNDER MY CAR AND SMOKE SEEPING OUT THE SIDES OF THE HOOD.  I THREW HIM THE KEYS AND RAN FOR  THE FIRE EXTINGUISHER.  HE ENTERED MY FOCUS GOT THE ENGINE STARTED AND BACKED THE VEHICLE OUT OF THE CARPORT AND AWAY FROM THE HOUSE.  AS HE BACKED UP THE VEHICLE, FLAMING PARTS BEGAN FALLING OUT FROM UNDER THE CAR ONTO THE CONCRETE FLOOR.  HE GOT THE CAR BACKED UP ABOUT 10 FEET AND THE ENGINE QUIT AND WOULD NOT RESTART.  HE EXITED THE CAR AND TRIED TO OPEN THE HOOD.  THE HOOD WAS VERY HOT TO THE TOUCH BUT HE GOT IT OPENED.  THE FLAMES WERE ABOUT A FOOT HIGH AT THE BACK OF THE ENGINE AREA ON THE LEFT SIDE.  WE WERE ABLE TO PUT OUT THE FLAMES WITH THE EXTINGUISHER.  WE THEN EXTINGUISHED THE FLAMES ON THE PIECES THAT WERE LYING ON  THE CARPORT FLOOR.  BOTH CONTINUED TO SMOKE FOR SOME TIME BUT THE FIRE DID NOT RE-IGNITE.  WHEN THE SMOKE CLEARED AND WE FELT IT SAFE TO APPROACH THE VEHICLE, WE COULD SEE THE CHARRED REMAINS AND MELTED PARTS.      IN RETROSPECT I REMEMBER ON TWO OCCASIONS SEEING THE BATTERY ICON LIGHTED ON THE DASH WHILE A SAT OUTSIDE MY OFFICE WAITING FOR THE BANK TO OPEN WITH THE CAR IDLING AND THE RADIO ON.  BOTH TIMES I REVVED THE ENGINE AND THE LIGHT WENT OUT.    *NM",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "04/28/2006",
        "dateOfIncident": "04/21/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10156390,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON TURNING RIGHT ONTO THE HIGHWAY THE CAR DID NOT RESPOND IMMEDIATELY TO THE STRAIGHTENING OF THE STEERING WHEEL.  IT WAS THOUGHT TO BE HYDROPLAINING.  AGAIN UPON MAKING ANOTHER RIGHT 11 MILES LATER IT REACTED THE SAME WAY.  SECONDS LATER THE LEFT FRONT DRIVER TIRE FELL OFF THE VEHICLE CAUSING THE VEHICLE TO DROP AND SKID LEFT OF CENTER HITTING AN ONCOMING CAR HEAD ON.  A WITNESS CLAIMS TO HAVE SEEN THE TIRE LEAVE THE CAR AND CAUSE THE SLIDING TO LEFT OF CENTER.  *JB",
        "vin": "1FAFP31NX6W"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/27/2006",
        "dateOfIncident": "02/06/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10151295,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE SITTING INSIDE THE VEHICLE, A TOXIC VAPOR WAS RELEASED.  THE CONTACT ASSUMED THIS WAS PART OF MATERIALS BEING USED WHEN THE DASHBOARD AND SIDE PANELS WERE MANUFACTURED.  AS A RESULT OF THE VAPOR, THE CONTACT HAS A HEADACHE, SORE THROAT AND ALLERGIES; ALTHOUGH THE CONTACT WAS PLACED ON ANTIBIOTICS FROM THE FAMILY DOCTOR THE SORE THROAT STILL PERSISTED.  THE DEALER WAS NOTIFIED OF THE PROBLEM.       UPDATED 3/22/2006 - *NM",
        "vin": "1FAFP31N76W"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/25/2006",
        "dateOfIncident": "11/13/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 1,
        "numberOfInjuries": 3,
        "odiNumber": 10148522,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE RECENTLY BEEN DOING A REVIEW OF SEVERAL INCIDENTS INVOLVING THE FORD FOCUS ONE OF WHICH WAS RELATING TO MY FATHER, WHERE ON INSTANCES THE AIR BAG DID NOT DEPLOY ON THE VEHICLES DURING THE INCIDENCE OF A CRASH. THIS IS SOMETHING THAT I HAVE NOTED ON SEVERAL ACCIDENTS INVOLVING THE VEHICLE, WHERE IN DETERMINATION OF THE IMPACT SHOULD OF ACTIVATED THE DEPLOYMENT OF THE VEHICLES AIRBAGS BUT RATHER THE SYSTEM HAS NOT REACTED IN ANY FORM AS OF THUS FAR THERE HAS BEEN ON NOTED DEATH THAT I KNOW OF BEING MY FATHER, THEIR COULD BE OTHERS BUT UNSURE...I HAVE 5 NOTATIONS OF THIS HAPPENING THE VEHICLES WERE DIFFRENT PEOPLES, BOUGHT AT DIFFRENT TIMES, AND FROM DIFFRENT DEALERSHIPS.  *AK",
        "vin": ""
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "01/14/2006",
        "dateOfIncident": "01/14/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10147766,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AND RESTING LEFT FOOT NEAR DRIVER'S SEAT, PANTS LEG CAUGHT ON END OF SEAT ADJUSTMENT (BACK/FORWARD) ADJUSTMENT HANDLE, CAUSING DELAYED ABILITY TO UTILIZE CLUTCH.  *JB",
        "vin": "1FAHP34N86W"
    }
]