[
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/02/2016",
        "dateOfIncident": "05/15/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10872221,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE VEHICLE ON THE EXPRESSWAY IN MICHIGAN, IT SUDDENLY BEGAN LOSING POWER.  AFTER FREQUENTLY STOPPING AND RESTARTING THE ENGINE, THE TRUCK STOPPED COMPLETELY.  WHEN THE DEALERSHIP INVESTIGATED THE CAUSE, THEY FOUND SPECKS OF PAINT IN THE DIESEL FUEL.  WHEN THE FACTORY INSTALLED GAS TANK WAS DROPPED, IT WAS DISCOVERED THAT THE COATING INSIDE THE FUEL TANK WAS FLAKING OFF AND HAD PLUGGED THE FUEL FILTERS, CONTAMINATED THE FUEL AS WELL AS DAMAGING 3  INVERTERS.. WHEN INVESTIGATING IF OTHERS HAVE SAME COMPLAINT, WE FOUND MANY OTHERS HAVE HAD THE SAME PROBLEM.  LUCKILY WE WERE NOT PULLING OUR RV.",
        "vin": "1FDAW56P26E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/05/2016",
        "dateOfIncident": "01/04/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10818235,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE HAD THIS VEHICLE FOR 5 YEARS.  BOUGHT USED FROM A DEALER.  HAVE HAD PROBLEMS WITH IT FROM DAY 1.  RECENTLY, TODAY AS MATTER OF FACT, DRIVING DOWN THE HIGHWAY, CANNOT ACCELERATE ABOVE 40 MPH.  THIS IS THE 3RD TIME IN JUST AS MANY WEEKS THAT THIS TRUCK HAS HAD TO BE TOWED TO A CERTIFIED MECHANIC.  THE MECHANIC HAS RUN ALL OR ANY PROBLEMS THROUGH A STATE OF THE ART CODE READER, EVERY TIME COMING UP WITH NO CODE.  AFTER MANY DISCUSSIONS AND GUESSES, WE BOTH STARTED TO WONDER IF THE FORD DEALERSHIP FOUND A WAY TO BYPASS THE ON BOARD DIAGNOSTICS FINDING IT ODD THAT EVERY TIME IT WAS SCANNED NO CODES CAME UP.  TODAY IT WAS DETERMINED THAT THERE IS A FAULTY FUEL TANK DUE TO DELAMINATION.  NOW WHY IN THE WORLD DOES THAT NOT SHOW UP IN ANY OF THE SCANS RELATED TO FUEL SYSTEM PROBLEMS.  THESE FAULTY TANKS ARE NOT COVERED UNDER ANY WARRANTY, ALL OUT OF POCKET.  WHICH JUST LED TO REPLACING NOT ONLY THE FUEL TANK, BUT THE FUEL FILTERS, THE FUEL INJECTORS, ALL FUEL LINES, LUCKILY NOT THE ENGINE ITSELF.  I HAVE OWNED FORDS MY ENTIRE ADULT LIFE.  4 OF THEM BEING DIESELS, AND ALL OF THEM BEING THE 6.0L  SHAME ON ME FOR BEING FOOLED THAT MANY TIMES.  BUT HOW ARE THEY ABLE TO ALWAYS GET AWAY WITH GETTING AROUND THE PROBLEM.  IT IS FACT THAT THERE IS A PROBLEM WITH THE FUEL SYSTEM IN THESE PARTICULAR MODELS, AND IT IS PROVEN IN EVERY INVOICE FOR A MAJOR REPAIR RELATED TO THIS FUEL RELATED PROBLEM IN ALL 6.0L.  THE SERVICE MANAGER AT THE FORD DEALERSHIP ALWAYS TOLD ME \"YOU GOT THE BAD EGG IN THAT BATCH\".  I STILL HAVEN'T SEEN 1 6.0L  THAT HAS NOT HAD THIS PROBLEM.  ARE WE WRONG FOR SAYING THIS NEEDS TO BE INVESTIGATED AND ACTION TAKEN FOR HAVING TO SPEND THOUSANDS SOMETIMES MORE THEN ONCE TO FIX AN OBVIOUS DEFECT ON THE MANUFACTURES END?  CURIOUS MINDS WOULD LIKE TO KNOW.  THANK YOU FOR YOUR TIME AND HOPEFULLY CONSIDERING LOOKING INTO THIS FARTHER.  *TR",
        "vin": "1FDAF57PX6E"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/19/2014",
        "dateOfIncident": "04/07/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10659323,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER REPORTED THAT THE TRUCK WAS NOT RUNNING WELL ON RETURN TO WAREHOUSE. I SENT HIM TO DEALER WITH TRUCK. THE ENGINE QUIT ON THE WAY AND WE HAD TO TOW THE TRUCK TO DEALER. THE DEALER SAID THE FUEL TANK HAD DELAMINATED AND RUINED THE FUEL PUMP AND SEVERAL FUEL INJECTORS. IT WOULD COST OVER $4000 DOLLARS TO REPAIR. I CALLED FORD CUSTOMER SERVICE TO COMPLAIN (THE TRUCK WAS ONLY 1400 MILES OUT OF WARRANTY) AFTER SEVERAL DAYS THE DEALER CALLED AND SAID FORD WOULD BILL IT AS A WARRANTY CLAIM AND SPLIT THE COST WITH ME WHICH MEANT  I WOULD HAVE TO PAY $1133 DOLLARS. I HAD NO CHOICE BUT TO PAY IT. IN OCTOBER 2014 THE TRUCK DID IT AGAIN AT 232886 MILES. I TOOK THE TRUCK TO SOMEONE ELSE AND WAS TOLD THE FUEL TANK HAD DELAMINATED AGAIN. IT COST $4295 TO REPLACE THE FUEL TANK , FUEL PUMP AND THREE FUEL INJECTORS. THIS IS A WELL KNOWN , WIDESPREAD PROBLEM (GOOGLE IT ON THE INTERNET ) AND I THINK FORD SHOULD ISSUE A RECALL AND REIMBURSE OWNERS FOR ALL EXPENSES , INCLUDING RENTALS WHILE REPAIRS WERE MADE.  *TR",
        "vin": "1FDAF56P56E"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/13/2013",
        "dateOfIncident": "11/06/2013",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 1,
        "numberOfInjuries": 0,
        "odiNumber": 10552173,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY TRUCK WAS PARKED FOR AN HOUR AND A HALF IN 55 DEGREE RAINING WEATHER. I WAS UNLOADING MY SHOW HORSES AND HAD MY THREE DOGS IN THE CAB OF THE TRUCK. SUDDENLY SOMEONE ALERTED ME THAT THE CAB WAS FILLED WITH SMOKE. WE WERE ABLE TO GET THE THREE DOGS OUT. THEY HAD TO BE TREATED FOR SMOKE INHALATION VIA HYPERBARIC CHAMBER TREATMENT. UNFORTUNATELY ONE DOG DIED 24 HOURS LATER DUE TO BRAIN DAMAGE FROM LACK OF OXYGEN.   ACCORDING TO THE FIRE DEPARTMENT, MY CAR SEAT HEATER MALFUNCTIONED AND IGNITED. MY CAR SEAT WAS PART OF THE LONGHORN KING RANCH CUSTOM INTERIOR THAT FORD HAD INSTALLED BEFORE SELLING ME THE TRUCK. PLEASE FEEL FREE TO CONTACT ME IF I CAN PROVIDE ANY MORE INFORMATION.  *TR",
        "vin": "1FDAW57P86E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/18/2013",
        "dateOfIncident": "09/15/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10498461,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING AT APPROX. 35-40 MPH TRUCK LOST POWER AND STALLED . I CRANKED SEVERAL TIMES AND THEN IT STARTED . I DROVE ABOUT ANOTHER MILE AND THIS REPEATED TWICE ,THEN I WAS CALLING A WRECKER FOR A TOW.    MY MECHANIC DISCOVERED THE FUEL FILTER & PUMP WAS CONTAMINATED WITH A SLUDGE AND THEN LOOKED IN THE FUEL TANK AND DISCOVERED THE FUEL TANK WAS FLAKING FROM THE INSIDE , MANUFACTURE DEFECT.   THE COST OF PARTS AND REPAIR WAS $2100.00 , THE TANK IS A 40 GAL TANK THAT HOLDS DIESEL FUEL AT $ 4.25 PER GAL.                                                                                                                                                                                       MY WORK ASSOCIATE HAS THE SAME VEHICLE AND NOW THE SAME THING HAPPENED TO HIM,HE WILL ALSO BE FILLING A REPORT WITH HIS WIN. # ,NOW WE ARE HEARING SEVERAL OF THE SAME OCCURRENCES. IT SOUNDS LIKE FORD NEEDS TO DO A RECALL / CLASS ACTION LAW SUIT, REIMBURSEMENT !!!   THE DEFECT IS COSTING CONSUMER THOUSANDS OF DOLLARS AND ADDITIONAL EXPENSES.  *TR",
        "vin": "1FDAF57P96E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "08/02/2012",
        "dateOfIncident": "08/01/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10468722,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 FORD F550. CONSUMER STATES PROBLEM WITH TURBO CHARGERS AND FUEL TANK LINERS *TGW  THE CONSUMER STATED THE TURBO WAS REPLACED TWICE AND THE FUEL TANK WAS REPLACED ONCE. THE FUEL TANK LINING BROKE DOWN AND CLOGGED THE FUEL FILTERS AS WELL AS THE FUEL INJECTORS. FORD INFORMED THE CONSUMER, THE PROBLEM WITH THE FUEL TANK WAS DUE TO THE ADDITIVES IN THE NORTHEAST DIESEL FUEL.  *JB",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/16/2012",
        "dateOfIncident": "06/29/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10465850,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-550 SUPER DUTY. THE CONTACT STATED THAT WHILE DRIVING 55 MPH, THE VEHICLE STALLED AND WITHOUT WARNING. THE VEHICLE WAS TOWED TO A DEALER. THE DEALER INSPECTED THE VEHICLE WHERE THE FUEL TANK AND THE FUEL LINES WERE CLEANED. IN ADDITION, THE FUEL FILTERS WERE REPLACED. THE FAILURE RECURRED SEVERAL TIMES. THE VEHICLE WAS TAKEN TO DEALER WHERE THE EXACT SAME REPAIRS AND MAINTENANCE WERE PERFORMED HOWEVER THE FAILURE WAS NOT CORRECTED. THE CONTACT STATED THAT THE FUEL TANK WAS DELAMINATING AND CAUSING THE OBSTRUCTION. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE HOWEVER NO ASSISTANCE WAS PROVIDED. THE CURRENT MILEAGE WAS 58,300. THE FAILURE MILEAGE WAS 45,963.",
        "vin": "1FDAF56P26E"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/30/2012",
        "dateOfIncident": "03/24/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10453553,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A FORD F550 THAT STALLED IN TRAFFIC WHEN I CHECK THE FUEL FILTER IT WAS FULL OF GRAY PARTICLES FROM THE FUEL TANK. I CHECKED ONLINE IT LOOKS LIKE THE DIESEL TANK IS DELAMINATING IT ONLY HAS 53,000 MILES ON IT.    *JS",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/15/2012",
        "dateOfIncident": "02/15/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10448030,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-550 SD. THE CONTACT STATED WHILE DRIVING VARIOUS SPEEDS , WITHOUT ANY WARNINGS THE VEHICLE WOULD STALL. THE CONTACT HAD TO TURN THE VEHICLE OFF AND THEN ON IN ORDER FOR THE VEHICLE TO FUNCTION NORMALLY. THE FAILURE WAS DIAGNOSED BY THE CONTACT WHO STATED THE FUEL TANK DELAMINATED CAUSING THE FUEL FILTERS TO CLOG UP WITH THE LAMINATES. THE FAILURE WAS NOT DIAGNOSED NOR REPAIRED BY THE DEALER. THE CONTACT ALSO HAS ANOTHER VEHICLE EXPERIENCING THE SAME FAILURE. THE FAILURE AND CURRENT MILEAGE WAS UNKNOWN.",
        "vin": "1FDAF57P56E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "08/23/2011",
        "dateOfIncident": "08/23/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10421164,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-550 SD. THE CONTACT STATED THAT THE VEHICLE WOULD STALL WHILE DRIVING AT VARIOUS SPEEDS. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHERE THE CONTACT WAS INFORMED THAT THE LINING ON THE INTERIOR OF THE FUEL TANK WAS DETERIORATING. THE VEHICLE WAS REPAIRED. APPROXIMATELY ONE HOUR LATER, THE FAILURE RECURRED. THE VEHICLE WAS TAKEN BACK TO AN AUTHORIZED DEALER WHERE IT WAS AGAIN IN THE PROCESS OF BEING REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND THE CONTACT WAS INFORMED THAT THE FAILURE WAS DUE TO THE CORROSION OF THE DIESEL FUEL TANKS. THE FAILURE MILEAGE WAS 15,000.   UPDATED 10/04/11*LJ  UPDATED 3/29/12 *CN",
        "vin": "1FDAF57P66E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/30/2011",
        "dateOfIncident": "06/21/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10410113,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-550. THE CONTACT STATED THAT WHEN DRIVING THE VEHICLE FOR A SHORT PERIOD OF TIME AND SHUTTING OFF THE ENGINE, THE VEHICLE FAIL TO START OR WOULD STALL ONCE RESTARTED. THE VEHICLE WAS INSPECTED BY A DEALER AND THEY ADVISED HER THAT THERE WAS A LOUD KNOCKING NOISE FROM THE ENGINE CAUSED BY A MALFUNCTION IN CYLINDER NUMBER EIGHT. IN ADDITION, THE ROLLING BARRIER HAD ALSO FAILED.  THE VEHICLE WAS REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 164,000.",
        "vin": "1FDAW56P16E"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/19/2011",
        "dateOfIncident": "05/19/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10402099,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-550.  THE CONTACT STATED THAT THE FUEL INJECTORS MALFUNCTIONED.  THE CORROSION CLOGGED THE FUEL INJECTORS AND CAUSED A LACK OF POWER WHILE DRIVING.  THE CONTACT TOOK THE VEHICLE TO THE DEALER TO HAVE THE FUEL INJECTORS REPLACED.  THE DEALER STATED THAT THE FUEL TANK ALSO NEEDED TO BE REPLACED. THE FAILURE MILEAGE WAS 98,254.",
        "vin": "1FDAF57P96E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "04/24/2011",
        "dateOfIncident": "04/16/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10397256,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE FORDF550 DIESEL STALLED ON ROAD.  PROBLEM DIESEL FUEL TANK DELAMINATION CLOGGED FILTER AND FUEL PUMP.    FIX WAS REPLACE FUEL TANK AND REPLACE FUEL PUMP.    HAVE NEVER USED BIO DIESEL FUEL. *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "03/25/2011",
        "dateOfIncident": "10/12/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10392923,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD CONTINUOUS PROBLEMS WITH TWO F550 DIESEL TRUCKS THAT I OWN.  THEY BOTH HAVE HAD CONSTANT PROBLEMS WITH LACK OF POWER/NO POWER WHILE UNDER IT'S MANUFACTURED WARRANTY AND NOW WITH NO WARRANTY.  WHILE DRIVING DOWN THE ROAD THE TRUCK WILL LOOSE ALL POWER.  THE VEHICLES HAVE BEEN REPAIRED AT A FORD DEALERSHIP ON ALL OCCASIONS UNTIL I COULD NO LONER DEAL WITH THE CONTINUED PROBLEMS AFTER SPENDING THOUSANDS OF DOLLARS AND THEM TELLING ME IT'S FIXED AND MONTHS DOWN THE LINE OR WEEKS AT TIMES THE TRUCKS ARE STILL HAVING THE SAME PROBLEMS.  SINCE OCT 2010 I HAVE HAD THE SAME VEHICLE WORKED ON BY TWO INDEPENDENT MECHANICS.  EVERY TIME WHILE IN THE SHOP I HAVE HAD TO REPLACE MULTIPLE INJECTORS.  FINALLY AFTER THOUSANDS AND THOUSANDS OF DOLLARS WORTH OF WORK AND DOWN TIME I HAVE FOUND AN INDEPENDENT MECHANIC THAT LITERALLY TORE THE VEHICLE APART TO FIND THE CULPRIT OF THIS CONTINUOUS PROBLEM.  HE PULLED THE FUEL FILTER WHICH HAD BEEN CHANGED JUST TWO WEEKS PRIOR TO HIM GETTING THE TRUCK WITH THESE ISSUES AND IT WAS LITERALLY COVERED IN SILVER PARTICLES.  SO BAD THAT THERE WERE CREASES IN THE FILTER WHERE THE FUEL WAS TRYING TO GET THROUGH THE FILTER BUT COULD NOT.  THE FUEL TANK IS DELAMINATING WHICH HAS BEEN CAUSING A RESTRICTED FUEL ISSUE WITH THE TRUCK WHICH IN RETURN KNOCKS OUT FUEL PUMPS AND BLOWS INJECTORS.  THUS WHEN THIS HAPPENS THE TRUCK COMPLETELY LOOSES POWER WHILE YOU ARE DRIVING SPEEDS OF 55 PLUS DOWN THE ROAD WITH NO WARNING TO YOU OR ALL THE OTHER VEHICLES BEHIND YOU.  THIS IS A VERY SERIOUS MATTER IN WHICH I BELIEVE FORD IS VERY AWARE OF AND FROM WHAT I HAVE GATHERED ON THE INTERNET IN  READING ABOUT MY PROBLEMS REFUSES TO DO ANYTHING ABOUT IT AND BLAMES THE CONSUMER OF WHERE THEY BUY THEIR FUEL.  I HAVE BEEN TOLD NUMEROUS TIMES WHEN COMPLAINING TO THE DEALERSHIP OF THE SAME PROBLEMS THAT IT WHERE I PURCHASE MY FUEL.  I HAVE ALL MY RECEIPTS AS WELL AS THE FUEL FILTER THAT IS COATED WITH SILVER SHAVING.  *TR",
        "vin": "1FDAF56P36E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/22/2011",
        "dateOfIncident": "01/01/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10392452,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-550. THE CONTACT STATED THAT WHEN DRIVING AT ANY SPEED, THE VEHICLE WOULD STALL WITHOUT WARNING. AFTER EACH FAILURE THE VEHICLE WAS TOWED TO AN AUTHORIZED DEALER WHERE VARIOUS ENGINE REPAIRS WERE PERFORMED YET THE FAILURE PERSISTED. THE FAILURE MILEAGE WAS 10,000 AND THE CURRENT MILEAGE WAS 40,000.",
        "vin": "1FDAF57P66E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "01/24/2011",
        "dateOfIncident": "01/24/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10378442,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD F-550. THE CONTACT STATED THAT WHILE DRIVING 45 MPH, THE VEHICLE BEGAN TO STALL AND SHAKE AS IF IT HAD RUN OUT OF FUEL. THE CONTACT PULLED OVER AND THE VEHICLE SUDDENLY SHUT OFF. THE FUEL GAUGE INDICATED THAT THE VEHICLE CONTAINED A HALF TANK OF FUEL. THE CONTACT RESTARTED THE VEHICLE WHICH SHUT OFF AGAIN. THE VEHICLE WAS TOWED TO AN AUTHORIZED DEALER BUT THE VEHICLE HAD NOT BEEN INSPECTED. PRIOR TO THE FAILURE, THE FUEL TANK HAD BEEN REPLACED THREE TIMES. THE FAILURE MILEAGE WAS 48,318.",
        "vin": "1FDAW56P96E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "01/10/2011",
        "dateOfIncident": "12/28/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10375474,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F550. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, THE VEHICLE WOULD DRIVE SLUGGISH AND OFTEN STALL WITHOUT WARNING. THE CONTACT WAS ABLE TO RESTART THE VEHICLE BY REPLACING THE FUEL FILTERS. HE THEN TOOK THE VEHICLE TO A DEALER FOR AN INSPECTION AND WAS INFORMED THAT THE FUEL TANK WAS DELAMINATING. THE VEHICLE WAS REPAIRED FOR THE FUEL TANK, SENDER, PUMP AND FILTERS. THE MANUFACTURER WAS CONTACTED AND INFORMED HIM THAT THEY WERE AWARE OF THE FAILURE BUT OFFERED NO ASSISTANCE. THE FAILURE MILEAGE WAS APPROXIMATELY 27,700.",
        "vin": "1FDAF57P76E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "01/10/2011",
        "dateOfIncident": "10/15/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10375486,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F-550 DIESEL. THE CONTACT STATED THAT THE FUEL TANK WAS ERODING AND CAUSING THE VEHICLE TO SPORADICALLY LOSE POWER WITHOUT WARNING. THE VEHICLE WAS TAKEN TO THE DEALER AND THE CONTACT WAS INFORMED THAT THE FUEL TANK WOULD NEED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 59,000 AND THE CURRENT MILEAGE WAS 60,000.",
        "vin": "1FDAX57P36E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/19/2010",
        "dateOfIncident": "10/20/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10361266,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD F550 SUPER DUTY DUMP TRUCK. WHILE DRIVING BETWEEN 35 AND 40 MPH THE VEHICLE STALLED IN THE MIDDLE OF THE ROAD. NONE OF THE WARNING LIGHTS ILLUMINATED BEFORE THE VEHICLE STALLED. THE VEHICLE WAS TOWED TO THE DEALER BUT THEY COULD NOT DUPLICATE THE FAILURE. THE FAILURE OCCURRED FOUR TIMES. THE VEHICLE WAS TOWED TO THE DEALER. THE WARRANTY WAS VALID AND EACH TIME THE DEALER NOTIFIED THE MANUFACTURER FOR ASSISTANCE TO HELP WITH THE REPAIRS BUT THEY WERE UNABLE TO DUPLICATE THE FAILURE. THE MANUFACTURER WAS NOTIFIED. THE FAILURE MILEAGE WAS 10,000. THE FAILURE MILEAGE WAS 30,000.  UPDATED 01/12/11*LJ  UPDATED 03/28/111",
        "vin": "1FDAF57P66E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "05/04/2010",
        "dateOfIncident": "05/16/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10328864,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE COATING ON THE INSIDE OF THE FUEL TANK DELAMINATED SENDING DEBRIS THROUGH THE FUEL LINES PUMP AND FILTERS. DUE TO THE DEBRIS THE VEHICLE'S FUEL SYSTEM THE VEHICLE LOST POWER AND EVENTUALLY STALLED. THE VEHICLE INVOLVED IS A 2006 FORD F-550 SD WITH A 6.0 LITER POWERSTROKE DIESEL AMBULANCE. *TR",
        "vin": "1FDAF56P16E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "04/26/2010",
        "dateOfIncident": "04/10/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10327603,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD F550. THE CONTACT STATED THAT THE VEHICLE HESITATED AND WOULD NOT ACCELERATE OVER 40 MPH. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALERSHIP WHERE THE CONTACT WAS INFORMED THAT THE FUEL FILTER, INJECTORS AND FUEL PUMP WERE CLOGGED BECAUSE OF DELAMINATION INSIDE THE FUEL TANK. THE DEALER STATED THAT THE VEHICLE WAS NO LONGER UNDER WARRANTY AND THEY COULD OFFER NO ASSISTANCE WITH THE REPAIR COSTS. THE FAILURE MILEAGE WAS APPROXIMATELY 102,000. THE CURRENT MILEAGE WAS APPROXIMATELY 106,000.",
        "vin": "3FRML55Z06V"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "03/30/2010",
        "dateOfIncident": "03/30/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10322822,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2006 F-550 DIESEL TRUCK HAS HAD PROBLEMS WITH STALLING,ROUGH IDLE.DEALER TELLS ME THAT MY FUEL TANK IS ROTTING FROM THE INSIDE.FORD SERVICE TELLS ME ITS FROM CONTAMIATED FUEL.THIS TRUCK IS STILL UNDER EXTENDED WARRANTY.THEY WANT ME TO PAY2500 TO FIX IT.I OWN A 1983 DIESEL FORD AND A 2001 DIESEL FORD TRUCK. I USE THE SAME FUELING STATION FOR ALL 3 TRUCKS. I HAVE NO PROBLEMS WITH FUEL ISSUES IN THE 83 OR 01 TRUCKS.THIS IS THE 2ND TIME IN FOR REPAIR FOR FUEL PROBLEMS ON MY 06.MAYBE FORDS BAD DESIGN JUNK STEEL FOR FUEL TANKS OR POOR VENT TUBE DESIGN MAY BE AT FAULT.AFTER FORD GIVING ME LIE AFTER LIE ABOUT THIS ISSUE I DON`T KNOW WHAT TO DO.THIS TRUCK HAS 29,000 MILES ON IT.",
        "vin": "1FDAF56P76E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "03/28/2010",
        "dateOfIncident": "12/09/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10322540,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2004 AND 2006 FORD F550 FUEL TANK DELAMINATION.  FUEL SYSTEM IS COMPROMISED WHEN TANKS DELAMINATE CAUSING THE FILTERS TO BE BLOCKED, ROBBING THE ENGINE OF THE FUEL IT NEEDS TO RUN.  HAVE REPLACED TANKS - FORD REFUSES TO PAY.  THIS IS A SAFETY ISSUE AND SHOULD BE RECALLED IMMEDIATELY.  UPON CHANGING THE FILTERS, THEY WERE FOUND WITH RUST PARTICLES WHICH ENABLED THE ENGINE FROM RUNNING.  THE FUEL SENDING UNIT WAS ALSO RUSTING FROM THE INSIDE OUT.  UPDATED 04/28/10",
        "vin": "1FDAW57P96E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "03/05/2010",
        "dateOfIncident": "10/02/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10317069,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE A 2006 FORD 550 DIESEL WITH 37,000 MILES ON IT. THE FUEL TANK HAS CORRODED AND AFFECTED THE FUEL PUMP AND FUEL INJECTORS. THE DEALERSHIP INVALIDATED MY WARRANTY, SAID WE USED BAD DIESEL IN THE TANK. WE HAVE OTHER VEHICLES ON THE SAME FUEL, WITH NO ISSUES. THIS IS MY 15TH FORD TRUCK. THIS IS MY FIRST TRUCK WITH THIS KIND OF ISSUE. FORD SAID IT WOULD COST ME $6,500 TO REPAIR. THE INTERNET IS FULL OF TRUCKS WITH THIS SAME ISSUE. A RECALL. *TR",
        "vin": "1FDAW56P26E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "12/18/2009",
        "dateOfIncident": "06/15/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10296346,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A OF A 2006 FORD F-150. THE VEHICLES LINER IN THE GAS TANK THIS CAUSING THE FUEL LINES TO CLOG AND THE VEHICLE TO STALL. THE CONTACT HAS HAD THE TANK REPLACED TWICE. THE FAILURE MILES WERE 80000 AND THE CURRENT ARE 85000.",
        "vin": "1FDAX57P96E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "11/30/2009",
        "dateOfIncident": "11/02/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10294072,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 FORD F550 WITH 33,000 MILES DIESEL FUEL TANK DELAMINATION. CLOGGED UP FUEL SYSTEM AND WAS NOT COVERED UNDER WARRANTY BY FORD. $2200 TO FIX SO FAR AS LONG AS THE INJECTORS ARE OK. IF NOT $5000 TO FIX. AND WHO IS TO SAY I WONT HAVE THIS PROBLEM AGAIN. *TR",
        "vin": "1FDAF57P76E"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/13/2009",
        "dateOfIncident": "10/30/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10292076,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F550. WHILE ATTEMPTING TO ACCELERATE AT 65 MPH , THE VEHICLE WOULD NOT ACCELERATE.  THEN SMOKE WAS EXPELLED FROM THE EXHAUST SYSTEM.  THE VEHICLE WAS TAKEN TO A LOCAL REPAIR FACILITY, AND THE FUEL PUMP REGULATOR WAS REPLACED.  AFTER THE REPAIR WHILE DRIVING THE ENGINE WOULD STALL WITHOUT WARNING.  THE VEHICLE WAS TAKEN BACK TO THE REPAIR FACILITY MULTIPLE TIMES AND THE FUEL TANK, FUEL TANK LINER, AND FUEL PUMP WERE REPLACED.  THE FUEL FILTER WAS REPLACED TWICE.  THE FAILURE MILEAGE WAS 57,000.  THE CURRENT MILEAGE WAS 58,700.",
        "vin": "1FDAF56P56E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "10/15/2009",
        "dateOfIncident": "10/07/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10288540,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR FORD LCF HAS HAD A CONTINUAL STALLING PROBLEM WHEN WE DRIVE OUT ON THE HIGHWAY.  OUR VEHICLE IS NOW THREE YEARS OLD AND EVERYTIME WE GO OUT OF TOWN WE HAVE STALLING PROBLEMS WITH THE VEHICLE.  THE DEALER HAS REPLACED INJECTORS AND OTHER FUEL COMPONENTS BUT NOTHING DIRECTLY RELATED TO THIS PROBLEM.  THE LAST TIME THE DEALER CHANGED THE OIL SAYING THAT WAS THE PROBLEM.  WE HAD ABOUT 3000 MILES SINCE THE LAST CHANGE. *TR",
        "vin": "3FRML55Z56V"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/21/2009",
        "dateOfIncident": "09/16/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10284763,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD F-550.  WHILE DRIVING 40 MPH HE NOTICED THAT THE VEHICLE SUDDENLY SHUT OFF. THE DEALER INFORMED THE CONTACT THAT THE INSIDE OF THE GAS TANK BEGAN DETERIORATING AND THAT THE ENTIRE FUEL SYSTEM NEEDED TO BE REPLACED. THERE WERE NO PRIOR WARNINGS. THE CURRENT AND FAILURE MILEAGES WERE 25500.",
        "vin": "1FDAW57P86E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL,FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "09/17/2009",
        "dateOfIncident": "09/10/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10284264,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F550. THE CONTACT STATED THAT WHEN DRIVING UPHILL THE VEHICLE DOWHNSHIFTS AND SHAKES. THE  VEHICLE WAS TAKEN TO THE DEALER, IN WHICH A TECHNICIAN CONCLUDED THAT THE FUEL PUMP AND INJECTOR NEEDED TO BE REPLACED AT AN EXPENSE OF $1800.00.  NO REPAIRS HAVE BEEN MADE. THE MANUFACTURER WAS NOTIFIED, BUT NO ASSISTANCE WAS PROVIDED. THE FAILURE MILEAGE WAS 30,444. THE CURRENT MILEAGE WAS 30,560.",
        "vin": "1FDAX57P76E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL,FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "09/17/2009",
        "dateOfIncident": "09/08/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10284407,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FORD F550. THE CONTACT STATED THAT WHEN DRIVING UPHILL THE VEHICLE DOWHNSHIFTS AND SHAKES. THE  VEHICLE WAS TAKEN TO THE DEALER, IN WHICH A TECHNICIAN CONCLUDED THAT THE FUEL PUMP AND INJECTOR NEEDED TO BE REPLACED AT AN EXPENSE OF $1800.00.  NO REPAIRS HAVE BEEN MADE. THE MANUFACTURER WAS NOTIFIED, BUT NO ASSISTANCE WAS PROVIDED. THE FAILURE MILEAGE WAS 30,444. THE CURRENT MILEAGE WAS 30,560.",
        "vin": "1FDAX57P76E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "03/17/2009",
        "dateOfIncident": "03/16/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10262110,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FORD F550 SUPERDUTY DIESEL TRUCK.  THE CONTACT STATED THAT HIS VEHICLE WAS RUNNING ROUGHLY AND WAS DIFFICULT TO START.  THE DEALER SUGGESTED THAT THE PRIMARY FUEL FILTER WAS CLOGGED WITH RUST BECAUSE THE FUEL TANK WAS LAMINATED WITH RUST INSIDE.  THE DEALER WANTS TO REMOVE THE TANK FROM THE VEHICLE SO THAT IT CAN BE REALIGNED AND INSTALLED AGAIN.  THE CONTACT WOULD HAVE TO PAY $650 FOR THIS SERVICE.  THE VEHICLE IS STILL UNDER WARRANTY, BUT THE DEALER DOES NOT WANT TO REPAIR THE VEHICLE UNDER THE WARRANTY.  THE MANUFACTURER IS IGNORING THE CONTACT.  THE FAILURE MILEAGE WAS 22,000.",
        "vin": "1FDAF56P96E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "03/07/2009",
        "dateOfIncident": "02/23/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10261060,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2006 FORD F-550 DIESEL PICK-UP TRUCK. BOUGHT THE TRUCK WHEN IT WAS NEW. AT 4,000 MILES SEVERAL OF THE INJECTORS WENT BAD. OVER THE PAST FEW YEARS I HAVE HAD TO REPLACE THE FUEL FILTER 7 DIFFERENT TIMES IN ORDER TO GET THE TRUCK TO RUN RIGHT. OR WHAT I THOUGHT WAS RIGHT. IT NEVER HAS GOTTEN VERY GOOD FUEL MILEAGE, AND I NOW KNOW WHY. A FEW WEEKS AGO THE TRUCK STARTED RUNNING HORRIBLE. I TOOK THE FUEL FILTER OFF, AS WELL AS CAPTURED THE FUEL INTO A CLEAN GLASS JAR. IT WAS FULL OF WHAT APPEARS TO BE SILVER FLAKES AS WELL AS RUST FROM THE INSIDE OF THE FUEL TANK. NEEDLESS TO SAY IT HAS ALSO CLOGGED THE INJECTORS. THE TRUCK IS STARVING FOR FUEL. FORD SAID THE TANK NEEDED TO BE REPLACED, HOWEVER, AT OUR EXPENSE. THROUGH FURTHER RESEARCH I NOW FIND OUT THIS PROBLEM IS ALL OVER THE US. (I HAVE ALSO CONTACTED THE FTC ABOUT THIS) THE TANKS ARE DELAMINATING. IN OTHER WORDS, THEY ARE ROTTING. EVERY ARTICLE I HAVE READ DESCRIBES THE SAME EXACT ISSUES. FORD CLAIMED THAT NOTHING WAS WRONG WITH THE TANK. I TOOK IT TO A LOCAL RADIATOR SHOP, AND THEY SAID THE WHOLE TOP OF THE TANK IS COMPLETELY RUSTED OUT. THE LAMINATE THAT WAS PUT ON AT THE FACTORY IS FALLING OFF INTO THE TANK, THEN RUNNING THROUGH THE ENTIRE FUEL SYSTEM. THIS CONTINUES TO BE AT THE EXPENSE OF THE CONSUMER, ON A PRODUCT THAT CLEARLY IS DEFECTIVE!!! WHAT IS IT GOING TO TAKE, MY WIFE BREAKING DOWN WITH THIS TRUCK, AND GETTING KILLED WHILE SHE WAITS FOR HELP??? THIS IS A NATIONAL PROBLEM. THEIR ARE THOUSANDS OF PEOPLE WITH FLEETS OF FORD TRUCKS THAT ARE ALL HAVING THE SAME ISSUES. THESE TANKS NEED TO BE RECALLED. IT IS VERY WRONG THAT WE THE CONSUMER SHOULD HAVE TO CONTINUE PAYING FOR REPAIRS ON A DEFECTIVE PRODUCT. MOST OF THESE VEHICLES COST MORE THAN YOUR AVERAGE HOME. THIS IS NOT A SMALL PROBLEM. IT HAS HAPPENED TO FLEETS OF AMBULANCES. I SURE HOPE I DON'T HAVE A FAMILY MEMBER THAT NEEDS TO BE TRANSPORTED TO THE HOSPITAL BY ONE OF THESE DEFECTIVE VEHICLES, AND THEY BREAK DOWN ON THE WAY TO THE HOSPITAL. *TR",
        "vin": "1FDAW57P06E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "03/06/2009",
        "dateOfIncident": "08/28/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10260981,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2006 F-550 FORD 6.0 DIESEL TRUCK WITH 17,000 MILES AND REPLACED 5 FUEL FILTERS AT THIS TIME AND HAD THE TRUCK TOWED IN ON 3-2-09 STUMBLING,HARD START .CALLED THE DEALER AND HE TOLD ME THE GAS TANKS ARE DELAMINATING FROM BIO FUELS,I HAVE A 2004 DIESEL TRUCK WITH NO PROBLEMS,AND FAITHFULLY USE SUNOCO FUEL.THE SHOP FOREMAN AT HOPKINS FORD SAID THIS IS NOT UNDER WARRANTY, I HAVE RUST COME OUT WHEN I CHANGE THE FILTERS AS WELL AS THE WATER SEPARATOR. THIS HAS BEEN AN ON GOING PROBLEM AND AM NOT GETTING ANY WHERE WITH FORD. RED HILL FORD TOLD ME HE NEVER HEARD OF THIS TYPE OF PROBLEM,NORRISTOWN FORD HAVE FUEL TANKS STACKED 10' HIGH,THAT THE REPLACED FOR CUSTOMERS BECAUSE WHO EVER FORD GOT TO COAT THE INSIDE OF FUEL TANKS ,DID A POOR JOB. I HAVE THE NORMAL WARRANTY AND THE EXTENDED WARRANTY.  I HAVE PAID $50,000 FOR THIS VEHICLE AND I'M AFRAID TO DRIVE IT FOR FEAR OF AN ACCIDENT. WATER IN FUEL SENSOR KEEPS COMING ON AND WHEN I DRAIN THE WATER SEPARATOR THE LIGHT GOES OUT, THEIR ARE NO SIGNS OF METAL FLAKES IN THE FUEL SYSTEM FORD IS BLAMING THE FUEL BUT THEY WONT TEST MY FUEL SOMETHING IS VERY FISHY ? *TR",
        "vin": "1FDAF57PX6E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "03/05/2009",
        "dateOfIncident": "12/18/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10260804,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE TWO 2006 F550 THAT THE FUEL TANKS HAVE DELAMINATED AND FOR WILL NOT PAY FOR THEM . THEY BOTH HAD PROBLEMS IN THE PASSED YEAR AND WE WERE JUST TOLD 2 MONTHS AGO THAT IT WAS THE TANKS DELAMINATING. SO WE HAD THEM PUT TWO NEW TANKS IN . WITH THE NEW TAKES IT IS ONLY TIME TILL I HAVE THE SAME PROBLEM . *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "02/05/2009",
        "dateOfIncident": "08/19/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10257534,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL PROBLEMS WITH A 2006 FORD F550 DUMP TRUCK. HAVE ONGOING PROBLEMS WITH TRUCK NOT RUNNING PROPERLY. FIRST INCIDENT SENSORS WERE REPLACED AND I WAS TOLD THAT WAS THE PROBLEM.  NOW BEING TOLD ABOUT A DELAMINATION PROBLEM WITH THE GAS TANK AND FORD IS AWARE BUT REFUSES TO DO ANYTHING ABOUT IT INCLUDING NOT HONORING THE WARRANTY THAT IS STILL ACTIVE ON THE TRUCK. CONTACTED FORD CUSTOMER SERVICE AND THEY CLAIM THE ISSUE IS RELATED TO BAD DIESEL FUEL WHICH MAKES NO SENSE TO ME AS ALL OF MY TRUCKS ARE REFUELED AT THE SAME STATION. *TR",
        "vin": "1FDAF57PX6E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "02/04/2009",
        "dateOfIncident": "01/30/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10257494,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "LOSS OF POWER SO WE PULLED THE FUEL FILTERS.  THE FUEL FILTERS WERE PACKED WITH A GRAY,FLAKY SUBSTANCE LOOKING LIKE PAINT CHIPS.  WHEN WE TOOK THE TRUCK TO THE DEALER THEY SAID THE FUEL TANK WAS \"DELAMINATING\". *TR",
        "vin": "1FDAF56PX6E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "01/30/2009",
        "dateOfIncident": "01/26/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10256942,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WE OWN A 2006 F-550 FORD DUMP TRUCK. WITH 22,000.00 MILES ON IT. IT WAS IN THE SHOP LAST YEAR BECAUSE OF NO TURBO POWER. DEALER COULDN'T FIGURE THE PROBLEM OUT. WE CHANGE THE OIL EVERY 2,000 MILES PLUS CHANGE FUEL FILTERS, ETC. AT THE SAME TIME. LAST WEEK NO POWER. TOOK TO ANOTHER DEALERSHIP  AND UPON INSPECTION TECH FOUND FUEL TANK, SENDING UNIT. FILTERS LINES FAILED/CLOGGED. HAD TO REPLACE FUEL TANK AND FUEL FILTERS. FLUSHED OUT SENDING UNIT AND FUEL LINES. IT COST ME $2,105.91 OUT OF MY POCKET. I CALLED FORD CUSTOMER RELATIONS DEPT. AND WAS TOLD THIS IS NOT FORD'S PROBLEM THAT IT IS THE FUEL THAT DID THE DAMAGE. THIS PROBLEM SHOULD BE A RECALL PROBLEM WITH THIS TRUCK. IT IS STILL UNDER WARRANTY AND THEY WON'T PAY ! *TR",
        "vin": "1FDAW57P86E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "01/02/2009",
        "dateOfIncident": "09/11/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10253570,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "TRUCK RUNS ROUGH AND STALLS. SEPT11 2008 REPLACED RUSTING AND DETERIORATING FUEL TANK AND PUMP AND FUEL SENDER  REPLACED  2 AND 6 INJECTORS. SEPT 28 2008 REPLACED O RINGS HIGH PRESSURE RAIL ,  REPLACE D ROCKER. NOV 26 2008 REPLACED FICM WIRING INJECTOR WIRING HARNESS. DEC 1 2008 REPLACED 2-4-8 INJECTORS. DEC 11 2008 REPLACED   NUMBER 4 INJECTOR.BROKE DOWN DEC 24 HAD TO BE TOWED 32 MILES TO GET TRUCK BACK TO DEALER. TECH FOUND ALL INJECTORS ON RIGHT SIDE FAILED DUE TO LACK OF FUEL PRESSURE .DEALER EST $985 FOR TANK FLUSH ,  FUEL PUMP REPLACEMENT AND FILTERS. HAD PROBLEMS TRUCK FROM DAY 1. *TR",
        "vin": "1FDAX57P36E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "10/10/2008",
        "dateOfIncident": "09/08/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10245063,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TSB 19728 - WE OWN A LIMOUSINE PARTY COACH ON A 2006 FORD F-550 CHASSIS AND HAD THE PLEASURE OF EXPERIENCE THE \"FUEL TANK DETERIORATION\" AND HAVING A TOTAL OF 16 FUEL INJECTORS AND 4 GAS TANKS REPLACED IN A ONE YEAR PERIOD. FORD REFUSES TO ACKNOWLEDGE THAT THIS IS A DEFECT IN THE FUEL TANK.  THERE ARE HUNDREDS OF PEOPLE EXPERIENCING THE SAME PROBLEM THROUGHOUT THE COUNTRY. THE FIRST TIME THE VEHICLE  WAS UNDER WARRANTY FOR THE REPAIR \"AS A COURTESY\" AND NOW ONE YEAR LATER THE SAME PROBLEM HAS OCCURRED AND NOW THEY REFUSE TO WARRANTY OR DO ANYTHING ABOUT IT!     THE TOTAL REPAIR COSTS ON THIS DEFECT IS $5000.00 DOLLARS FOR THE 2 FUEL TANKS $2000.00 FOR THE INJECTORS $1200.00 IN TOWING AND NOT TO MENTION THE LOSS OF REVENUE BECAUSE THE BUS IS OUT OF SERVICE.      FORD IS TRYING TO BLAME THE DIESEL FUEL WHICH IS STATE REGULATED IN NEW JERSEY. THIS IS A TOOL FOR OUR BUSINESS AND THE MAINTENANCE IS OUR HIGHEST PRIORITY SO WE DO NOT USE CHEAP FUEL.     WE HAVE SPOKEN TO FORD CORP IN NY & DETROIT AND THEY KEEP DENYING RESPONSIBILITY. THIS IS UNACCEPTABLE AS THIS VEHICLE IS A 2006 WITH ONLY 37K MILES ON THE CLOCK.  PLEASE DO SOMETHING TO PROTECT THE PEOPLE TRYING TO MAKE A LIVING! *TR",
        "vin": "1FDAF56P36E"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/24/2007",
        "dateOfIncident": "12/28/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10209784,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS PEDAL & BRAKE PEDAL ARE TO CLOSE  I HAVE A 2006  FORD 500   BEING ON A POLICE DEPT AND READING THE NEWS PAPER AND RADIO YOU WILL HEAR WHERE PEOPLE HAVE TROUBLE HITTING THE GAS PEDAL AND NOT THE BRAKE PEDAL.  AFTER GETTING RID OF MY OLDER FORD PICK UP AND FORD CROWN VIC I  HAD NO PROBLEM  WITH,  I BOUGHT A NEW 2006 FORD 500.   THEN I FOUND OUT THAT WHEN I WEAR WALKING SHOES, AND MOVE MY FOOT FROM THE GAS PEDAL TO THE BRAKE, IT WAS CAUGHT UNDER THE BRAKE PEDAL AND GAS PEDAL, AND TO MOVE IT YOU WILL HIT THE GAS PEDAL AND  THE CAR WILL MOVE BEFORE YOU CAN HIT THE BRAKE AGAIN.  I HAVE TALKED TO OTHER PEOPLE WITH DIFFERENT MAKE OF CARS ALSO WHO SAID THEY HAD THE SAME PROBLEM WITH THEIR CAR WHILE WEARING SUMMER SANDALS AND MY SHOES TYPE.  IT SEEMS THAT THIS MAY BE ONE REASON WHY YOU HEAR SO MUCH OF THIS HAPPENING TO PEOPLE NOW DAYS, AND THAT IS, THE GAS & BRAKE PEDAL ARE TO CLOSE TO ONE ANOTHER.  *TR",
        "vin": "1FAFP23176G"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/31/2006",
        "dateOfIncident": "08/31/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10167144,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE ACCELERATING FROM A STOP SIGN, THE VEHICLE HESITATED FOR 3-4 SECONDS THEN TOOK OFF.  THE DEALERSHIP REPLACED THE TURBO, BUT THE PROBLEM PERSISTED.    UPDATED 10/25/2006 - THE VEHICLE'S ENGINE HAD NO POWER UNTIL THE TURBO BOOST CAME ON.  THE 3 TO 4 SECOND DELAY HAS ALMOST CAUSED THE CONSUMER TO BE HIT BY ONCOMING TRAFFIC.  *NM",
        "vin": "1FDAW57P96E"
    },
    {
        "components": "SERVICE BRAKES, ELECTRIC",
        "crash": false,
        "dateComplaintFiled": "07/20/2006",
        "dateOfIncident": "05/31/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10162965,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES ON THE TRAILER THAT I PULL DID NOT WORK PROPERLY. THE BRAKES ON TOWED VEHICLE DID NOT WORK PROPERLY. IT WAS A SHORT IN THE WIRING THAT FORD INSTALLED IN THE VEHICLE WHEN BUILT WHICH INCREASED STOPPING DISTANCE VERY MUCH. THE SHORT WAS FIXED FOR A COST OF $582.62 AT GAUDIN FORD. I FEEL THAT THIS SHOULD BE COVERED BY FORD. I THINK THIS IS A SAFETY ISSUE.",
        "vin": "1FDAW56P26E"
    }
]