[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/18/2010",
        "dateOfIncident": "07/30/2010",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10350370,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "SANDPIPER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 FOREST RIVER SANDPIPER TRAILER. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHERE THE TECHNICIAN DETECTED THAT THE  GOOSE NECK OF THE FRAME EXHIBITED SEVERE CRACKING AND STRESS FRACTURES. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE IN WHICH THEY WOULD NOT ACCEPT RESPONSIBILITY FOR THE REPAIR EXPENSE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 20,000.",
        "vin": "4X4FSAN216C"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/12/2010",
        "dateOfIncident": "07/11/2010",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10342786,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "SANDPIPER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "A FRACTURE OF SPRING SHACKLE PLATES ON THE SUSPENSION OF A FIFTH WHEEL RECREATIONAL VEHICLE.  THE FRACTURED SHACKLE CONNECTS THE LEADING EDGE OF THE REAR AXLE SPRING TO THE CENTER MOUNTED EQUALIZER.  ONE SET ON PASSENGER SIDE HAS FRACTURED, ONE SET ON THE DRIVERS SIDE HAS ELONGATED HOLES.  HAVE NOT REPAIRED THE UNIT AS OF YET.  FOUND THIS AFTER RETURNING FROM A CAMPING TRIP TRAVELING OVER INTERSTATE HIGHWAYS. UNSURE OF THE EXACT MOMENT OF FAILURE, BUT AM CERTAIN IT WAS IN TACT BEFORE LEAVING FROM HOME. *TR",
        "vin": "4X4FSAD296J"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/30/2008",
        "dateOfIncident": "09/01/2008",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10244042,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "SANDPIPER",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "100022",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 (NA) FOREST RIVER SANDPIPER SPORT TRAILER.  THE VEHICLE HAS GREEN BALL TOWMASTER TIRES, SIZE 225/75R/15D (NA).  THE TIRES WERE THE ORIGINAL ONES ON THE VEHICLE.  WHILE DRIVING 55 MPH, THE CONTACT SUDDENLY HEARD A LOUD NOISE AND THE TRAILER BEGAN SWAYING LEFT TO RIGHT.  SHE PULLED THE VEHICLE OVER TO THE SIDE OF THE ROAD AND NOTICED THAT BOTH TIRES WERE BLOWN OUT.  THE TREAD WAS COMPLETELY GONE FROM THE TIRES.  THE VEHICLE WAS LEFT BEHIND AND THE TIRES WERE TAKEN TO A TIRE SHOP.  THE MECHANIC STATED THAT THE TIRES SHOULD NOT HAVE BLOWN BECAUSE THEY WERE PRACTICALLY NEW, AND THEY ALSO HAD 85 PERCENT TREADWEAR.  THE CONTACT WAS ADVISED TO CALL THE MANUFACTURER.  THE MANUFACTURER STATED THAT THEY WOULD COVER THE COST FOR ONE OF THE TIRES, BUT NOT THE OTHER.  THE VIN, FAILURE MILEAGE, AND DOT NUMBER WERE UNKNOWN.",
        "vin": ""
    }
]