[
    {
        "components": "SERVICE BRAKES, AIR",
        "crash": false,
        "dateComplaintFiled": "11/20/2021",
        "dateOfIncident": "11/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441148,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Ewr Volpe Acme Inc.",
                "productMake": "TBD",
                "productModel": "TBD",
                "productYear": "9999",
                "type": "Vehicle"
            }
        ],
        "summary": "My ABS on Rightside of my truck is not working that is what they said anyways not sure what is wrong",
        "vin": "1GTCS138X68"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/09/2021",
        "dateOfIncident": "12/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424055,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2006 GMC Canyon. The contact stated that the rear sub-frame was rusted. The vehicle was taken to an independent mechanic however, the vehicle was not diagnosed nor repaired. The local dealer was not contacted. The manufacturer was notified of the failure. The failure mileage was 135,000.",
        "vin": "1GTDT196X68"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/08/2021",
        "dateOfIncident": "01/04/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11399758,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 GMC CANYON. THE CONTACT STATED THAT WHILE ATTEMPTING TO START THE VEHICLE, THE VEHICLE FAILED TO START-UP. THE SECURITY WARNING LIGHT WAS ILLUMINATED. THE CONTACT STATED THAT AFTER WAITING AN HOUR, THE VEHICLE RESTARTED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED WITH A SECURITY SYSTEM FAILURE. THE VEHICLE WAS NOT REPAIRED. THE CONTACT STATED THAT THE FAILURE PERSISTED. THE LOCAL DEALER WAS NOT MADE AWARE OF THE FAILURE. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 264,124.",
        "vin": "1GTDT148668"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/11/2021",
        "dateOfIncident": "02/17/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11395847,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2006 GMC CANYON AND THE ISSUE IS THE CAR SWITCHES INTO SECURITY MODE A FOR NO REASON VEHICLE WILL NOT START OR WON'T CRANK AT ALL AND IT ONLY GETS WORSE THERE ARE A FEW YOUTUBE VIDEOS SHOWING HOW TO BYPASS SECURITY SYSTEM , BUT I FEEL GM SHOULD SEND OUT NOTICES TO CUSTOMERS ON HOW TO FIX OR DISABLE THIS PROBLEM",
        "vin": "1GTDS148168"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/20/2020",
        "dateOfIncident": "12/19/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384244,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I LIFTED THE TRUCK ON A HYDRAULIC LIFT TO FIND THE SOURCE OF A RATTLE THATS USUALLY A HEAT SHIELD THAT HAS COME LOOSE BUT TO MY SURPRISE I ALSO FOUND THE FRAME OF THIS TRUCK HAS LITERAL HOLES ROTTED THROUGH WITH THE RESPECTIVE SUPPORT STRUCTURES FOR THE TRANSMISSION/TRANSFER CASE, FUEL TANK AND FRONT LEAF SPRING ATTACHMENT POINTS. IN SOME PLACES THE FRAME HAS ROTTED AWAY TO MAYBE 40% OF THE FRAME IS STILL INTACT. VERY DANGEROUS. THE AFFECTED AREAS ARE NOT VISIBLE FROM OUTSIDE THE VEHICLE THE DAMAGE IS ONLY VISIBLE FROM UNDERNEATH. FROM OUTSIDE IT LOOKS LIKE TYPICAL SURFACE RUST COMING THROUGH THE UNDERCOATING. BUT THIS IS FAR FROM TYPICAL",
        "vin": "1GTDT196468"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/10/2020",
        "dateOfIncident": "04/10/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324031,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ABS FAULT LIGHT IS ON TO INFORM THAT THERE IS A PROBLEM. THIS OF COURSE DISABLES THE ABS BRAKE SYSTEM. THE COMPUTER READS ABS WHEEL SPEED SENSOR. THEY HAVE BEEN REPLACED AND THE LIGHT IS STILL ON. THERE ARE SEVERAL PEOPLE WITH THIS SAME PROBLEM ALL OVER THE INTERNET AND NO ONE HAS FOUND A FIX YET. IS THERE A NEW RECALL ON THIS ISSUE OR IS THERE A WAY TO FIX IT? THANK YOU  *TR",
        "vin": "1GTCS148468"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/23/2018",
        "dateOfIncident": "08/15/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11121944,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 GMC CANYON. THE CONTACT STATED THAT THE VEHICLE'S CHASSIS WAS SEVERELY RUSTED AND CREATED HOLES IN THE FRAME. THE VEHICLE WAS NOT TAKEN TO THE DEALER. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 61,000.",
        "vin": "1GTDT136768"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/06/2018",
        "dateOfIncident": "08/06/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11118143,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "CRANKS BUT NO START INTERMITTENTLY. GMC DEALER STATES THAT THERE IS NOT PROBLEM. MUST WAIT 10 MINTURES, THEN TRY AND IT ALWAYS STARTS. NOT ISOLATED...GOOGLE, 2006 CANYON WON'T START AND THERE ARE MULTIPLE DESCRIPTIONS OF THE SAME PROBLEM. SOME HAVE SPECULATED THAT IT IS A 'RELAY', PROBLEM WITH THE IGNITION SYSTEM OR THE \"PASSLOCK\". I AM NOT AWARE OF ANY ACCIDENT BUT IF AVOIDING AN ACCIDENT AND IT WON'T START IT IS JUST A MATTER OF TIME. THIS HAS BEEN AN ONGOING PROBLEM FOR AT LEAST 3-4 YEARS, OCCURRING AT LEAST ONCE PER MONTH. OTHERS RECORDED THE SAME HISTORY. (XXXX)      PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "1GTDT196668"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/14/2017",
        "dateOfIncident": "12/07/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11054688,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE LIGHT SWITCH RECALL NHTSA RECALL CAMPAIGN NUMBER 09V310000. THIS IS A REOCCURRING MALFUNCTION AFFECTING 187,000 VEHICLES, MODEL YEARS 2004-2009. THE REPAIR GMC PERFORMS IS ONLY A TEMPORARY FIX AND PRESENTS A SAFETY DANGER TO OWNERS. MANY OWNERS HAVE HAD THE SAME MALFUNCTIONS OVER AND OVER AGAIN. I HAVE REPAIRED MY GMC CANYON THREE TIMES TO DATE.",
        "vin": "1GTCS136968"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/21/2016",
        "dateOfIncident": "10/20/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10917806,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 GMC CANYON. WHILE DRIVING 45 MPH, THE VEHICLE STALLED IN THE MIDDLE OF THE ROAD. THE CONTACT WAS ABLE TO RESTART THE VEHICLE AFTER TEN MINUTES. PRIOR TO THE FAILURE, THERE WAS A RECURRING ISSUE WITH THE VEHICLE NOT STARTING. THE VEHICLE POWER FAILURE AND SECURITY THEFT WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE CONTACT LEFT A VOICEMAIL WITH THE MANUFACTURER REGARDING THE FAILURE. THE FAILURE MILEAGE WAS 97,000.",
        "vin": "1GTDT136268"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/30/2015",
        "dateOfIncident": "11/18/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10807500,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "IT APPEARS MY IGNITION SWITCH IS DEFECTIVE. THE PASSLOCK SYSTEM ENGAGES FOR NO REASON AND SHUTS OFF/DISABLE IGNITION SWITCH. IF THE FOLKS READING THIS COMPLAINT RESEARCHES IGNITION PROBLEMS/PASSLOCK SYSTEM ON THE INTERNET, THE DOT WILL DISCOVER MORE INFORMATION ABOUT THIS DEFECT. I AM AVAILABLE TO HELP. CONTACT ME ANYTIME AT H. (770) 631-0294. IT APPEARS THERE IGNITION SWITCH MAY CORRODE AND/OR HAVE DEFECTIVE CONTACT THAT SHORT OUT THE SWITCH. GM SAYS MY DEFECT IS RARE AND WOULD NOT HELP ME WITH THE COSTS. I PAID FOR THE REPAIR IN ORDER TO AVOID A TRAGEDY, LIKE MY WIFE OF 31 YEARS OR MY GRANDKIDS DYING IN MY DEFECT CANYON. THANK YOU  *TR",
        "vin": "1GTCS198268"
    },
    {
        "components": "EXTERIOR LIGHTING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/27/2015",
        "dateOfIncident": "04/21/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10713049,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I NOTICED THAT I HAD NO SPEED CONTROL AND THEN FOUND I ALSO DID NOT HAVE ANY BRAKE LIGHTS. BACK IN 2006 OR 2007, GMC ISSUED A RECALL ON THIS ISSUE. ALSO AGAIN IN 2009, BUT IN THE FORM OF EXTENDED WARRANTY TILL 2014. I JUST WANTED TO PASS TO YOU THE CONCERN THAT THIS ISSUE MAY STILL BE A PROBLEM FOR THE TRUCK. I TALKED TO GMC AND THEY DID NOT WANT TO HELP WITH THE FIX SINCE ITS OUTSIDE THE WARRANTY DATE.     I'M CONCERNED THAT DRIVERS WOULD ONLY THINK ITS A PROBLEM WITH THE SPEED CONTROL, AND DON'T REALIZE THEY HAVE NO BRAKE LIGHTS.  IN MY INVESTIGATION, I FOUND THAT IN MOST CASES THE BRAKE LAMP SWITCH WAS ABLE TO FAIL THE SPEED CONTROL.  MOST DRIVERS WOULD NOT GO FOR THE FIX ON THE SPEED CONTROL AND OPEN THEMSELVES UP TO A REAR END ACCIDENT.    *TR",
        "vin": "1GTCS136468"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/22/2015",
        "dateOfIncident": "01/15/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10712192,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 GMC CANYON. WHILE DRIVING AT VARIOUS SPEEDS, THE ENGINE STALLED WITHOUT WARNING. THE VEHICLE RESTARTED AND THE CHECK ENGINE WARNING INDICATOR ILLUMINATED. THE FAILURE RECURRED NUMEROUS TIMES. AFTER THE VEHICLE WAS SHIFTED INTO THE PARK POSITION AND THE KEY WAS TURNED TO THE OFF POSITION, THE ENGINE WAS STILL RUNNING. THE FAILURE RECURRED TWICE. THE VEHICLE WAS TAKEN TO A DEALER, WHERE IT WAS DIAGNOSED THAT THERE WAS NOTHING WRONG WITH THE VEHICLE BESIDES REGULAR WEAR AND TEAR. THE VEHICLE WAS LATER TAKEN TO AN INDEPENDENT MECHANIC, WHERE IT WAS DIAGNOSED THAT THE TIMING KIT FAILED, WATER PUMP FAILED, INTAKE MANIFOLD GASKET AND VALVE COVER GASKET FAILED, COOLANT NEEDED TO BE FLUSHED, FUEL INJECTION NEEDED TO BE FLUSHED, AND THE THERMOSTAT NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED, BUT THE FAILURE STILL RECURRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "1GTCS138668"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/04/2014",
        "dateOfIncident": "12/21/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10652529,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT THIS 2006 GMC CANYON IN DECEMBER OF 2011. YET THEY MYSTERIOUSLY COULDN'T GIVE ME TAGS FOR IT UNTIL APRIL 2012. THEY KNEW THERE WAS AN ON GOING RECALL FOR BAD VALVE SEATS AND SEALS AND SOLD THE TRUCK TO ME ANYWAY. I IMMEDIATELY BEGAN HAVING ENGINE PROBLEMS AS SOON AS I GOT IT AND HAD THE TRUCK BACK TO MOTOR CITY GMC HERE IN BAKERSFIELD, CA. THREE TIMES UNDER THE LIMITED 10,000 MILE WARRANTY MISSING THREE DAY'S OF WORK EACH TIME. EVERY TIME THEY NEVER DIAGNOSED THE PROBLEM AND TOLD ME ALL THREE TIMES, 'WE HAD A SERVICE ADVISER DRIVE THE TRUCK AROUND AND COULDN'T FIND ANYTHING WRONG WITH IT.' AND YET!!! AS SOON AS THE 10,000 WARRANTY WAS UP THEY SUDDENLY WILL BE GLAD TO DIAGNOSE THE PROBLEM FOR OVER A HUNDRED DOLLARS. HOW CONVENIENT. NOW IT WILL COST OVER $3000.00 TO FIX THIS TRUCK THAT THEY WOULD NOT FIX UNDER WARRANTY. THEY SHOULD BE INVESTIGATED AND SUED BY THE COUNTY, THE STATE AND VERY UNHAPPY CONSUMERS SUCH AS MYSELF.    *TR",
        "vin": "1GTCS148668"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/24/2014",
        "dateOfIncident": "06/04/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10605696,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE 2.9 4 CYL. ENGINE IN MY 06 GMC CANYON DIES INTERMITTENTLY. WHEN IT DOES, \"REDUCED POWER\" DISPLAYS IN THE DRIVER INFO CENTER AND THE TRUCK WILL NOT RESTART. THE POWER IS CUT TO THE STARTER AND FUEL PUMP BUT ALL ACCESSORIES STILL FUNCTION PROPERLY. AFTER A FEW MINUTES THE SYSTEM SEEMS TO RESET AND THE TRUCK WILL START AND OPERATE NORMALLY. UNTIL THE NEXT TIME IT DECIDES TO GO OUT.  I WOULD SAY THAT UNDER NO CIRCUMSTANCE SHOULD AN ENGINE DIE UNEXPECTEDLY ON THE HIGHWAY OR AT A RED LIGHT AND NOT ALLOW RESTART FOR SEVERAL MINUTES. THIS IS EXTREMELY DANGEROUS.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/02/2014",
        "dateOfIncident": "03/01/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10576845,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE LIGHT CAME ON, I USED A CODE READER AND P0300 CAME UP. I REPLACED THE APPROPRIATE SENSORS AND RESET IT.  TRUCK RAN FINE.  ONE WEEK LATER THE CHECK ENGINE LIGHT COMES ON AGAIN AND THIS TIME I GET A P0017 CODE. I REPLACED TWO OF THE SENSORS AND REPLACED OIL FILTER WITH A OIL CHANGE. NOW THE TRUCK IS HARD TO  START AND WHEN IT DOES START IT IDLES ROUGH. I HAVE IT IN THE GARAGE RIGHT NOW AND MECHANIC DOESN,T KNOW WHAT IS WRONG WITH IT.  FROM WHAT I HAVE BEEN READING ON HERE THESE ENGINES IN THE CANYON AND COLORADO PICK-UPS  ARE BAD ENGINES THAT WONT LAST. I HAVE THE 4 CYLINDER ENGINE WITH 53 THOUSAND MILES ON IT THAT I BOUGHT USED WITH 19 THOUSAND ON IT.  I FEEL GMC SHOULD FIX THESE MOTORS FOR FREE EVEN THOUGH IM NOT THE ORIGINAL OWNER AND THAT THEY KNOW THAT THESE MOTORS ARE BAD.  ID LIKE THO KNOW HOW MUCH MORE BAD STUFF IS OUT THERE FROM GMC THAT THEY KNOW ABOUT AND REFUSE TO FIX, KNOWING THAT IT IS THERE FAULT FROM THE START. I HAVE PAID TO MUCH MONEY FOR REPAIRS FROM OTHER GM PRODUCTS THAT I HAVE BOUGHT.  THIS WILL BE MY LAST GMC PRODUCT THAT I WILL EVER BYE AND IF I CAN CONVINCE OTHERS NOT TO BYE THEIR JUNK SO BE IT.  *TR",
        "vin": "1GTCSS14876"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "03/28/2014",
        "dateOfIncident": "03/26/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10575290,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DESPITE INFREQUENT USE AND EXCEPTIONALLY LOW MILEAGE, THE PASSENGER'S SEATBELT FAILS TO RETRACT. NO ACCIDENTS OR SAFETY-RELATED INCIDENTS WHICH WOULD HAVE LOCKED THE MECHANISM OR OTHERWISE ENGAGED THE BELT BEYOND STANDARD FASTENING AND UNFASTENING.  *TR",
        "vin": "1GTCS148768"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/13/2013",
        "dateOfIncident": "01/01/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10552125,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 GMC CANYON. THE CONTACT STATED THAT THE ABS WARNING LIGHT ILLUMINATED AND CAUSED THE BRAKE TO ENGAGE WHILE TURNING, BRINGING THE VEHICLE TO A HALT. THE VEHICLE WAS TAKEN TO THE DEALER SEVERAL TIMES FOR THE FAILURE WHERE A DIAGNOSTIC WAS PERFORMED AND LOCATED A FAILURE AT THE ABS HOWEVER, THE DEALER WAS UNABLE TO LOCATE THE SOURCE OF THE FAILURE WITHIN THE ABS SYSTEM BECAUSE THE FAILURE WAS INTERMITTENT. THE VEHICLE WAS NOT TAKEN BACK TO THE DEALER FOR FURTHER INSPECTION. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 2,000 AND THE CURRENT THE FAILURE WAS NOT 16,876.",
        "vin": "1GTDT136368"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/11/2013",
        "dateOfIncident": "11/08/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10551759,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AS WE WERE DRIVING ON A SMOOTH ASPHALT DRY ROAD THE ABS LIGHT AND THE BRAKE FAILURE LIGHT CAME ON ALONG WITH AN ANUNCIATOR SOUND WARNING.   WE IMMEDIATELY PULLED OVER AND BROUGHT THE TRUCK TO A STOP.  WE TESTED THE BRAKES BY PUSHING ON THE PEDAL AND WE STILL HAD GOOD BRAKES.  WE CONTINUED CAREFULLY ON HOME AND INSPECTED THE BRAKE FLUID WHICH WAS OK.  AFTER TURNING OFF AND THEN TURNING ON THE KEY AND STARTING THE ENGINE, THE ABS WARNING LIGHT CAME BACK ON BUT THE BRAKE FAILURE LIGHT WAS NOT ILLUMINATED.  YESTERDAY, (11/10/2013) OUR GRANDSON BROUGHT HIS COMPUTER ANALYZER OUT, HOOKED IT UP AND DETERMINED THE FAILURE WAS IN THE LEFT FRONT WHEEL SENSOR.  HE DID NOT CLEAR THE HISTORY FROM THE VEHICLE'S COMPUTER.  IT SEEMS TO ME THIS IS A PROBLEM AS THIS TRUCK HAS SUCH LOW MILEAGE.  I BOUGHT THIS TRUCK FROM A HYUNDAI DEALER ABOUT THE FIRST OF AUGUST 2013 AND HAVE PUT LESS THAN 2,000 MILES ON IT.  THEY TOLD ME IT HAD NEVER BEEN WRECKED NOR DOES IT SHOW ANY EVIDENCE OF HAVING BEEN REPAIRED.  THE PREVIOUS OWNER APPARENTLY HAD IT SERVICED ON A REGULAR AND PROPER BASIS AND HAS THIS ALL RECORDED IN THE BACK OF THE BOOK THAT CAME WITH THE TRUCK.  I AM THE SECOND OWNER.  *TR",
        "vin": "1GTCS148068"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "04/03/2013",
        "dateOfIncident": "10/02/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10505557,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Cooper Tire & Rubber Co.",
                "productMake": "COOPER",
                "productModel": "311050R15LT",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "I WAS DRIVING AT 65MPH ON THE FREEWAY WHEN THE RIGHT REAR TIRE SEPARATED CAUSING ME TO LOSE CONTROL OF MY 2006 GMC CANYON TRUCK. I NARROWLY AVOIDED CRASHING INTO THE CENTER DIVIDER, AND THE SEPARATED TIRE CAUSED EXTENSIVE DAMAGE TO THE RIGHT-REAR BED PANEL. THE TIRE WAS A COOPER DAKOTA HT SIZE 31X10.50R15L. I STILL HAVE THE TIRE, AND IT IS AVAILABLE FOR INSPECTION.  *TR",
        "vin": "1GTDS136668"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/02/2013",
        "dateOfIncident": "02/10/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10505414,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE PADS WEAR OUT PREMATURELY.  A/C ONLY WORKS ON HIGH.  HAVE HAD TO REPLACE BRAKE PADS 3 TIMES OVER A PERIOD OF 5 MONTHS.  MECHANIC MENTIONED THAT GMC IS AWARE OF THE BRAKE WEAR PROBLEM AND OFFERS VARIOUS SOLUTIONS.  NONE OF WHICH WORK.  WHY IS THIS ISSUE NOT MADE CLEAR WHEN PURCHASING THE VEHICLE!  *TR",
        "vin": "1GTDS198168"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/23/2013",
        "dateOfIncident": "05/12/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10504234,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I NOTICED THAT, A LOT OF PEOPLE ARE HAVING PROBLEMS WITH THE IGNITION, SOMETIMES IF THESE VEHICLES DON'T START THE FIRST TIME YOU WOULD HAVE TO WAIT 15 MINUTES AND YOU HAVE TO STEP OUT AND GET BACK IN, IF YOU STAY INSIDE WAITING FOR THE 15 MINUTE PERIOD, IT WILL NOT START AND YOU HAVE TO WAIT ANOTHER 15 MINUTES. THIS IS ANNOYING SPECIALLY IF YOU'RE IN A HURRY.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/20/2013",
        "dateOfIncident": "03/20/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10503837,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE WILL CRANK BUT NOT TURN OVER. UPON MULTIPLE ATTEMPTS THE ENGINE WILL GET CLOSE TO TURNING OVER AND THEN CUT ITSELF OFF IN THE ANTI-THEFT SECURITY MANNER. WAITING 10-20 MINUTES WILL MOST TIMES ALLOW FOR THE ENGINE TO THEN TURN OVER SUCCESSFULLY.      NUMEROUS WEBSITES AND VEHICLE OWNERS, HAVE POSTED COMPLAINTS AND HAD NO REAL SOLUTION, EVEN AFTER VISITING LOCAL DEALERSHIPS WHO TRY TO INVESTIGATE THE SOURCE OF THE PROBLEM, WITH NO ONE SOLUTION OR FIX.  OWNERS TRY TROUBLE SHOOTING THE PROBLEM THROUGH SENSORS, KEY WEIGHTS, BATTERY CONNECTION, AND THE THROTTLE BODY, ALL WITH NO FIX AND CONTINUING RANDOM RECURRING INCIDENTS.    THE SAFETY ISSUE OF THIS COMPLAINT IS THAT YOU ARE LEAVING DRIVERS IN A POTENTIAL STRANDED SITUATION.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/16/2013",
        "dateOfIncident": "02/15/2013",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10498357,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "HVAC FAN MOTOR RESISTOR & CONNECTOR OVERHEATS MELTS AND BURNS WITH TEMPERATURE EXCEEDING 300 DEG F.  CHRONIC FREQUENT PROBLEM WITH GMC CANYON AND CHEVY COLORADO PICK UPS.  *TR",
        "vin": "1GTDT136X68"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES, HYDRAULIC,VISIBILITY,STRUCTURE,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "01/28/2013",
        "dateOfIncident": "12/13/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10495401,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 GMC CANYON.  CONSUMER WRITES IN REGARDS TO BRAKE CONTROL MODULE MALFUNCTION AND OTHER PROBLEMS WITH VEHICLE .  *SMD  THE CONSUMER STATED THE ABS LIGHT ILLUMINATED, DUE TO THE FAILURE OF THE BRAKE CONTROL MODULE. THE BLOWER MOTOR RESISTOR HAD TO BE REPLACED, BECAUSE THE FAN KNOB OF THE CLIMATE CONTROL WOULD ONLY WORK ON ONE SETTING. THE LEFT FRONT WHEEL BEARING, CD PLAYER, HEATER AND FRONT GRILL WERE REPLACED.",
        "vin": "1GTCS138368"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/23/2012",
        "dateOfIncident": "10/21/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10481998,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 GMC CANYON. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 30 MPH, THE DRIVER CRASHED INTO THE FRONT PASSENGER DOOR OF ANOTHER VEHICLE THAT FAILED TO YIELD RIGHT-OF-WAY. THE CONTACT STATED THAT THE AIR BAGS FAILED TO DEPLOY AND THE DRIVER SUSTAINED INJURIES TO THE HEAD AND ARMS. THE POLICE DEPARTMENT WAS CALLED TO THE SCENE TO ASSIST AND A POLICE REPORT WAS FILED. THE VEHICLE WAS DESTROYED. THE VEHICLE HAD NOT BEEN INSPECTED TO DIAGNOSE THE AIR BAG FAILURE. THE FAILURE AND CURRENT MILEAGE WAS 25,000.",
        "vin": "1GTDT136168"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/11/2012",
        "dateOfIncident": "03/10/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10465323,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRUCK WILL START SOMETIMES AND IT WON'T SOMETIMES. WHEN THE TRUCK DOES NOT START I CAN USUALLY WAIT ABOUT 15 MINS AND THEN IT WILL START.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/19/2012",
        "dateOfIncident": "11/19/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10444537,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "SOMETIMES THE TRUCK WILL START SOMETIMES IT WONT, LIGHTS ON THE PANEL FADE IN AND OUT, SOMETIMES HALF WILL BE ON AND THE OTHER HALF OUT. WE TOOK IT TO THE MECHANIC, HE SAID ITS AN ELECTRICAL PROBLEM SOMEWHERE, HES WORKING ON IT NOW TRYING TO FIGURE OUT WHERE ITS COMING FROM. I'VE LOOKED ON LINE AND SEEN WHERE SEVERAL ARE COMPLAINING OF THE SAME PROBLEM, I'VE ALSO CALLED GMC.  *TT",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/20/2011",
        "dateOfIncident": "07/01/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10413695,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 GMC CANYON. THE CONTACT ATTEMPTED TO START THE VEHICLE BUT IT WOULD NOT START. THE CONTACT WAS ABLE TO START THE VEHICLE WITHIN APPROXIMATELY FIFTEEN MINUTES. THE CONTACT STATED WHENEVER IT WAS RAINING OR SNOWING THE FAILURE WOULD OCCUR. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSTIC TESTING. THE TECHNICIANS WERE UNABLE TO DIAGNOSE THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE VIN WAS NOT AVAILABLE. THERE WAS A RECALL UNDER NHTSA CAMPAIGN ID NUMBER: 09V154000 (FUEL SYSTEM, GASOLINE) THAT WAS SIMILAR TO THE FAILURE EXPERIENCED BUT INCLUDED THE GMC CANYON BUT NOT THE 2007 MODEL. THE APPROXIMATE FAILURE MILEAGE WAS 30,000.   UPDATED 01/10/12*LJ  UPDATED 01/27/17",
        "vin": "1GTCS148X68"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/06/2011",
        "dateOfIncident": "05/26/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10405337,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS 2006 GMC CANYON.  THE CONTACT WAS INVOLVED IN  A CRASH.  THE IMPACT CRASHED INTO THE FRONT END OF THE VEHICLE WHEN THE AIR BAGS DEPLOYED. THE CONTACT WAS BURNED ON THE TOP LEFT SIDE OF HIS ARM; HOWEVER, HE WAS NOT HOSPITALIZED.  A POLICE REPORT WAS FILED. THE INSURANCE COMPANY TOWED THE VEHICLE TO THE DEALER TO BE REPAIRED.  THE FAILURE AND CURRENT MILEAGE WAS 64,000.",
        "vin": "1GTDS136668"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/19/2010",
        "dateOfIncident": "10/01/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10371672,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ABS SYSTEM ACTIVATES RANDOMLY AT LOW SPEEDS RESULTING IN ABS FAULT WARNING LIGHT TO APPEAR.",
        "vin": "1GTDS136668"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "11/19/2010",
        "dateOfIncident": "11/18/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10366892,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 GMC COLORADO, 5 CYL. AUTOMATIC.  DEFOGGER DOES NOT KEEP WINDOWS CLEAR MAKING VISIBILITY SERIOUSLY REDUCED. *TR",
        "vin": "1GTCS136X68"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/24/2010",
        "dateOfIncident": "09/19/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10357305,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "UNABLE TO BRAKE EFFECTIVELY WHEN ABS SYSTEM ACTIVATING AND ALMOST IMPACTED PEDESTRIAN.  ABS SYSTEM ACTIVATING ROUTINELY ON DRY WARM PAVEMENT AT <5 MPH.  SUSPECT SENSOR DEFECTS.  2006 GMC CANYON.  FEAR DAMAGE/INCIDENT WILL RESULT. *TR",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/01/2010",
        "dateOfIncident": "09/01/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10353282,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 GMC CANYON. THE CONTACT RECEIVED A RECALL NOTIFICATION ASSOCIATED WITH THE NHTSA CAMPAIGN ID NUMBER 09V310000 (EXTERIOR LIGHTING: BRAKE LIGHTS: SWITCH). THE AUTHORIZED DEALER AND MANUFACTURER WERE NOTIFIED AND THEY BOTH ADVISED THAT THE VIN WAS INCLUDED IN THE RECALL DEFECT; HOWEVER, THE VEHICLE WAS NOT REGISTERED OR SOLD IN THE STATES MENTIONED IN THE RECALL AND WOULD NOT BE ELIGIBLE FOR THE RECALL REPAIR. THE CONTACT WAS DISPLEASED WITH THE RECALL SPECIFICATION OF THE STATES INCLUSION.  THERE WAS NO FAILURE MILEAGE.",
        "vin": "1GTCS148368"
    },
    {
        "components": "VISIBILITY,LATCHES/LOCKS/LINKAGES,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/12/2008",
        "dateOfIncident": "04/22/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10230875,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 GMC CANYON.  THE VEHICLE WAS PURCHASED ON MARCH 5, 2008 AND TWO DAYS LATER, THE CONTACT REALIZED THAT THERE WAS NO KEYHOLE ON THE PASSENGER SIDE.  THE REARVIEW MIRROR REFLECTED THE INSTRUMENT PANEL INSTEAD OF THE REAR OF THE VEHICLE.  THE REAR WINDOW HAS NO MOLDING, WHICH WILL CAUSE MAJOR DAMAGE TO THE DRIVER'S HEAD IN THE EVENT OF A CRASH.  THE CONTACT TOOK THE VEHICLE BACK TO THE DEALER, BUT THEY WERE UNWILLING TO MAKE THE ADJUSTMENTS.  THE FAILURE MILEAGE WAS 22,900.   UPDATED 06/30/08 *BF",
        "vin": "1GTCS148068"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "04/14/2008",
        "dateOfIncident": "04/14/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10224446,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER DOOR HAS NO EXTERIOR DOOR LOCK.  JUST WHO IS THE BRAIN TRUST THAT DECIDED TO REMOVE THE EXTERIOR DOOR LOCK ?   AHHH, BUT YOU GUYS COMPENSATED BY PLACING A LOCK ON THE TAILGATE.  HAD I NOTICED THIS AT TIME OF PURCHASE, I WOULD HAVE BOUGHT A TOYOTA.  MY FIRST TRUCK WAS A '85 S-15 .... LOVED IT.  THAT IS WHY I RETURNED TO GM FOR THIS TRUCK.  WELL, JUST AS SOON AS I RUN THIS ONE INTO THE GROUND, I WON'T BE BACK.  *TR",
        "vin": ""
    },
    {
        "components": "PARKING BRAKE",
        "crash": false,
        "dateComplaintFiled": "01/08/2008",
        "dateOfIncident": "10/01/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10214169,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 GMC CANYON.  THE PARKING  BRAKE CABLES, WHICH IS ATTACHED BY METAL FASTENERS BENEATH THE SPRING, HANGS DOWN TWO TO THREE INCHES INSTEAD OF BEING ON TOP OF OR ON THE SIDE OF THE SPRING.  THIS IS A DESIGN FLAW.  GM INFORMED THE CONTACT THAT THERE WAS NO ONE HE COULD SPEAK WITH CONCERNING THIS FAILURE.  INSTEAD, HE WAS ADVISED TO WRITE TO A P.O. BOX.  THE CURRENT MILEAGE WAS 2,910 AND FAILURE MILEAGE WAS 100.     UPDATED 03-05-08 *BF  THE CONSUMER STATED THE BRAKE CABLES WERE FASTENED TO END UNDER THE FRAME OF THE VEHICLE, FORMING A LOOP BELOW THE VEHICLE WHICH CAN CATCH DEBRIS AND RIP OUT THE BRAKE CABLES. UPDATED",
        "vin": "1GTCS198668"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/23/2007",
        "dateOfIncident": "08/14/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10200632,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "GENERAL TIRE & RUBBER CO.",
                "productMake": "GENERAL",
                "productModel": "P235/75R15",
                "productYear": "1990",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "PREMATURE INNER AND OUTER TIRE WEAR ON FRONT TIRES.   GM TECHS SAY THERE'S NO PROBLEM.  ALIGNED FRONT END AND REPLACED AT NO COST  DIDN'T REPAIR PROBLEM.  *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,TIRES",
        "crash": false,
        "dateComplaintFiled": "07/18/2007",
        "dateOfIncident": "07/12/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10196669,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "GENERAL TIRE & RUBBER CO.",
                "productMake": "AMERI-TECH",
                "productModel": "AMERI-TECH",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 GMC CANYON.  WHILE DRIVING 25 MPH OR LOWER, THE VEHICLE VIBRATES AND MAKES A GRINDING NOISE.  THE FAILURE HAS CAUSED THE CONTACT TO DRIVE THROUGH A STOP SIGN ON TWO OCCASIONS WHEN THE PAVEMENT WAS WET.  ON APRIL 12, 2007, THE DEALER REPLACED THE BUSHING AND BODY SHAM.  ON APRIL 17, 2007, THE REAR DRUMS WERE REPLACED AND HE RECEIVED A NEW SHOE KIT.  ON JULY 12, 2007, THE DEALER STATED THAT THEY COULD NO LONGER HEAR THE NOISE.  THE CURRENT MILEAGE IS 23,224 AND FAILURE MILEAGE WAS 18,000.  UPDATED 09/05/07  *TR",
        "vin": "1GTDT196868"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE,POWER TRAIN,ELECTRICAL SYSTEM,EXTERIOR LIGHTING,VISIBILITY,STRUCTURE,LATCHES/LOCKS/LINKAGES,INTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/18/2007",
        "dateOfIncident": "03/01/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10185437,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2006 CANYON AND IN THE LAST YEAR I HAVE HAD TO REPLACE TAIL LIGHTS,THREE STERIOS,4X4 BUTTONS,WINDOWS,WIRING HAS BEEN REPAIRED SEVERIAL TIMES,THE TRUCK IS EXCESSIVLY HARD ON GASS,AND AS SOON AS MY INLINE FIVE CYLINDER ENGINE HIT 31.000 KM I HAD TO TAKE IT BACK TO THE DEALER ONCE AGAIN ,THIS TIME FOR A NEW ENGINE. APPARENTLY THERE ONLY GOOD FOR THIRTY THOUSAND AND THEN NEED TO BE REPLACED. HARD TO BELIEVE THIS TRUCK COST ME ALMOST FORTY THOUSAND DALLORS. DONT GET WHAT YOU PAY FOR WITH A GM.MY NEXT TRUCK WILL BE A TOYOTA AND THIS CANYON HAS CONVINCED ME TO NEVER BUY ANOTHER GM PRODUCT AGAIN AND HOPFULLY I CAN SAVE SOME PEOPLE FROM MAKING THE SAME MISTAKE I DID.",
        "vin": "1GTDT196468"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/14/2006",
        "dateOfIncident": "11/23/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10176114,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN MY WIFE WHO IS 5 FEET TALL AND 110-115 POUNDS, SAT IN THE PASSENGER SEAT, THE AIR BAG LIGHT BLINKED OFF AND ON. I TALKED TO THE SERVICE DEPT. THEY SAID IT WAS DUE TO THE MY WIFE'S WEIGHT.  *JB",
        "vin": "1GTCS138X68"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/01/2006",
        "dateOfIncident": "11/23/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10174904,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED EVERY TIME AN OCCUPANT WHO WAS 5 FEET TALL AND 110 POUNDS, SAT IN THE PASSENGER SEAT, THE AIR BAG LIGHT BLINKED OFF AND ON.  THE MANUFACTURER, AND THE DEALER WERE NOT CONTACTED.",
        "vin": "1GTCS138X68"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "09/15/2006",
        "dateOfIncident": "09/13/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10168385,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ON VEHICLES WITHOUT REMOTE DOOR LOCKS THERE IS NO WAY TO UNLOCK AND ENTER THE VEHICLE FROM THE PASSENGER SIDE.  THIS IS A SAFETY HAZARD FOR THOSE OF US WITH SMALL CHILDREN  WE NEED TO SECURE IN A CHILD SEAT AND FOR THOSE OF US WHO HAVE INFIRM AND ELDERLY PARENTS WE TRANSPORT.  IT IS ESPECIALLY BAD IN INCLIMATE WEATHER.  ACCESS TO THE LOCKED PASSENGER SIDE REQUIRES THE DRIVER TO GO TO THE DRIVER'S SIDE, UNLOCK THE DOOR, CRAWL IN AND REACH ACROSS THE SEAT DURING WHICH TIME THE DRIVER'S DOOR SPRINGS FULLY OPEN INTO TRAFFIC,  UNLOCK THE DOOR, GET OUT OF THE VEHICLE, GO BACK AROUND TO THE PASSENGER SIDE, SECURE THE PASSENGER IN THE CHILD SEAT OR SEATBELT THE OLDER ADULT IN THE VEHICLE, SHUT THE DOOR AND GO BACK AROUND TO THE DRIVER'S SIDE TO ENTER.  THERE ARE MANY OPPORTUNITIES DURING THIS PROCESS FOR THE UNATTENDED PASSENGERS TO WANDER OFF AND BECOME INJURED BEFORE BEING SECURED IN THE VEHICLE AND DANGER TO THE DRIVER AND THE VEHICLE WHEN THE DOOR POPS OPEN INTO TRAFFIC.",
        "vin": "1GTCS198068"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/07/2006",
        "dateOfIncident": "07/01/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10167622,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN HAVING SEVERAL ELECTRICAL PROBLEMS WITH MY CANYON,I HAVE OWNED IT FOR ONLY 3 MONTHS BUT HAS BEEN IN THE SHOP TWICE AND I NEED TO TAKE IT IN FOR A THIRD TIME BECAUSE OF MORE ELECTRICAL PROBLEMS.  1) AUXILIARY OUTLETS HAD TO BE REPLACED 2) BATTERY HAD TO BE REPLACED.  3) NOW MY LEFT BLINKER STAYS ON INSIDE THE TRUCK AND MY LEFT SIGNAL STAYS LIT,THAT HAS STOPPED BUT NOW WHEN I TURN THE LEFT SIGNAL ON, MY ILLUMINATING LAMPS FOR THE EMERGENCY BUTTON,AIR SYSTEM CONTROLLER AND AIR BAG LIGHTS WILL BLINK.  *NM",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/02/2006",
        "dateOfIncident": "07/24/2006",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10164210,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE CAUGHT FIRE FOR NO APPARENT REASON WHILE PARKED IN THE DRIVEWAY AND WAS COMPLETELY DESTROYED.  WE BELIEVE THERE WAS AN ELECTRICAL PROBLEM IN THE STEERING COLUMN BECAUSE WE HAD SLIGHT DIFFICULTIES WITH THE IGNITION SWITCH. *JB",
        "vin": "1GTCS136168"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "06/08/2006",
        "dateOfIncident": "05/16/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10159345,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS PEDAL AND BRAKE PEDAL TO CLOSE .WHEN WEARING CONSTRUCTION BOOTS THE LIP OF THE BOOT WILL CATCH BEHIND THE BRAKE PEDAL AND IT IS VERY DANGEROUS THE FIRST DAY FOR WORK I WAS BACKING UP SO MY BODY WAS TWISTED SO I CAN REVERSE AND I HIT ANOTHER CAR BECAUSE MY FOOT WAS STUCK.  *NM",
        "vin": "1GTCS198768"
    }
]