[
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/13/2015",
        "dateOfIncident": "04/08/2015",
        "fire": false,
        "manufacturer": "HYOSUNG MOTORS AMERICA INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10725075,
        "products": [
            {
                "manufacturer": "HYOSUNG MOTORS AMERICA INC.",
                "productMake": "HYOSUNG",
                "productModel": "GV650",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR SOME TIME, I HAVE BEEN HAVING ISSUES WITH STARTING THE BIKE AND/OR KEEPING IT RUNNING. IT WOULD EITHER NOT    TURN OVER OR WHEN IT DID START, I WOULD BE RIDING AND WHEN I CAME TO A STOP, IT WOULD STALL.  I BROUGHT THE MOTORCYCLE INTO THE SHOP TO FIND OUT THAT THE GAS TANK IS LEAKING AND IT LEAKS INTO MY BATTERY CASEMENT.  HYOSUNG KNOWS THAT AFTER 15,000 MILES THE GAS TANKS START TO LEAK.  THIS IS A SAFETY HAZARD, THE BIKE COULD IGNITE INTO FLAMES WHILE ON IT.  NOW THAT I SPENT OVER $600 FOR THE TANK AND THE INSTALLATION, THERE IS NO GUARANTEE THAT AFTER ANOTHER 15,000 MILES I WONT HAVE TO REPLACE IT AGAIN OR THAT IT WONT IGNITE. HYOSUNG HAS NOT RECALLED ANY BIKES FOR THIS HAZARD EVEN THOUGH THEY KNOW IT.  IT REMINDS ME OF HOW TOYOTA DIDN'T RECALL THEIR FAULTY AIRBAGS UNTIL 4 DEATHS WERE RECORDED EVEN THOUGH THEY KNEW ABOUT THE AIRBAG DEFECTS.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/07/2009",
        "dateOfIncident": "06/20/2009",
        "fire": false,
        "manufacturer": "HYOSUNG MOTORS AMERICA INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10276005,
        "products": [
            {
                "manufacturer": "HYOSUNG MOTORS AMERICA INC.",
                "productMake": "HYOSUNG",
                "productModel": "GV650",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "1. I WAS RIDING MY 2006 HYOSUNG GV650, A BOLT WHICH ATTACHES THE HANDLE BARS TO THE UPPER TREE HAD SHEARED. THE HANDLE BARS HAD DETACHED FROM THE MOTORCYCLE, RENDERING LOSS OF CONTROL. *TR    2. THE FAILURE RESULTED OF A BROKEN BOLT. THIS FAILURE OCCURRED ONCE AND HAS RENDERED THE MOTORCYCLE INOPERABLE. THE CONSEQUENCES OF THE BOLT FAILURE, RENDERED LOSS OF CONTROL OF THE MOTORCYCLE AND DAMAGE TO THE MOTORCYCLE. DAMAGE WAS SUSTAINED TO THE THROTTLE ASSEMBLY, FURTHER RENDERING IT INOPERABLE, AND HAD COMPOUNDED LOSS OF CONTROL OF THE MOTORCYCLE. DAMAGE HAS ALSO OCCURRED TO THE HANDLE BAR ASSEMBLY AND THE UPPER TREE.    3. I HAVE CONTACTED THE DEALERSHIP FROM WHICH I PURCHASED THE MOTORCYCLE. I HAVE ALSO CONTACTED THE CORPORATE OFFICES OF HYOSUNG USA REGARDING THIS ISSUE. NEITHER PARTY HAS RECTIFIED THE ISSUE, NOR RETURNED MY CALLS/E-MAILS. THE MANUFACTURER HAS DONE TO CORRECT THE FAILURE. NO PARTS HAVE BEEN REPAIRED, OR REPLACED. THE EFFECTED PART (TO THE BEST OF MY KNOWLEDGE) WAS REPLACED UNDER NHTSA CAMPAIGN ID NUMBER: 07V015000. THE BOLT THAT HAD FAILED WAS THE APPROVED REPLACEMENT/REDESIGNED BOLT. THE BOLT WHICH HAD FAILED IS IN MY POSSESSION AND IS AVAILABLE. *TR",
        "vin": "KM4VP571X71"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/07/2009",
        "dateOfIncident": "11/13/2008",
        "fire": false,
        "manufacturer": "HYOSUNG MOTORS AMERICA INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10254161,
        "products": [
            {
                "manufacturer": "HYOSUNG MOTORS AMERICA INC.",
                "productMake": "HYOSUNG",
                "productModel": "GV650",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "PROFUSE FUEL LEAK ON THE LEFT HAND SIDE OF THE TANK.  THIS HAS OCCURRED CONTINUOUSLY SINCE 11/13/2008.  THE BIKE WAS TAKEN TO A REPAIR SHOP, AND HAS BEEN WAITING FOR PARTS FROM THE MANUFACTURER FOR NEARLY TWO MONTHS.  WHEN CONTACTED, MANUFACTURER LIED ABOUT WHEN PARTS WILL SHIP. *TR",
        "vin": "KM4VP571261"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/30/2008",
        "dateOfIncident": "09/26/2007",
        "fire": false,
        "manufacturer": "HYOSUNG MOTORS AMERICA INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10244066,
        "products": [
            {
                "manufacturer": "HYOSUNG MOTORS AMERICA INC.",
                "productMake": "HYOSUNG",
                "productModel": "GV650",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY GAS TANK FOR MY 2006 HYOSUNG AVITAR BIKE IS GUSHING OUT GASOLINE AND THE TANK HAS ALREADY BEEN  REPLACED TWICE AND MY FUEL GAUGE HASN'T WORKED SINCE THE GAS TANK WAS REPLACED. THERE WAS A RECALL THAT LEAD TO MY GAS TANK BEING REPLACED IN THE FIRST PLACE. AND THE DEALER INDICATES THAT THE MANUFACTURE HYOSUNG WONT RETURN THE PHONE CALLS TO VERIFY MY BIKE IS UNDER WARRANTY AND READY TO BE WORKED ON. *TR",
        "vin": "KM4VP571761"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,FUEL SYSTEM, GASOLINE,POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/08/2008",
        "dateOfIncident": "06/01/2008",
        "fire": false,
        "manufacturer": "HYOSUNG MOTORS AMERICA INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10237449,
        "products": [
            {
                "manufacturer": "HYOSUNG MOTORS AMERICA INC.",
                "productMake": "HYOSUNG",
                "productModel": "GV650",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 (NA) HYOSUNG GV650.  THREE DAYS AFTER PURCHASING THE VEHICLE, THE CALIPER WAS RUBBING ON THE ROTOR.  THE DEALER REPLACED THE CALIPER, ROTOR, AND THE ENTIRE FRONT BRAKE SYSTEM; HOWEVER, THE CONTACT STILL EXPERIENCED FAILURES WITH THE GAS TANK LEAKING, SPEEDOMETER, AND RECENTLY, THE FIFTH GEAR STICKING AND LOSING POWER.  THE VEHICLE IS CURRENTLY AT THE DEALER AND THEY CONTINUE TO REPAIR THE FAILURES.  THE MANUFACTURER WANTED TO REPLACE THE MOTORCYCLE; HOWEVER, THE CONTACT WANTS TO BE REIMBURSED FOR THE MOTORCYCLE.  THE FAILURE AND CURRENT MILEAGES WERE 4.",
        "vin": "KM4VP571X81"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/25/2008",
        "dateOfIncident": "06/25/2008",
        "fire": false,
        "manufacturer": "HYOSUNG MOTORS AMERICA INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10232236,
        "products": [
            {
                "manufacturer": "HYOSUNG MOTORS AMERICA INC.",
                "productMake": "HYOSUNG",
                "productModel": "GV650",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2006 HYOSUNG AVATAR 650CC MOTORCYCLE IT HAS ONLY 6,000 MILES AND I WAS RIDING DOWN THE HIGHWAY AND I WITNESS A CAR INFRONT OF ME MERGE TO THE LEFT LANE AND THE REALIZED THEY COULD NOT MERGE TO THE LEFT SO HE SWIFTLY MERGED BACK TO THE RIGHT LANE MEANWHILE I WAS BESIDE HIM ON MY MOTORCYCLE AND HE DID NOT NOTICE ME AND I PUSHED THE HORN BUTTON AND I WAS HORRIFIED TO REALIZE MY HORN WOULD NOT WORK. I PRESSED IT FRANTICALLY THINKING I WAS GOING TO DIE  AND BE RAN OVER NUMEROUS TIMES. AFTER PRESSING THE HORN SEVERAL TIMES I GAVE UP AND AS A LAST DITCH ATTEMPT TO WARD OFF THE DRIVER WHO WAS GOING TO KNOCK ME OFF THE STREET I BEGAN YELLING AT HIM ON TOP OF MY LUNGS. FORTUNATELY HE HAD IS CAR WINDOWS DOWN AND HEARD ME CURSING AT HIM AND HE STAYED TO THE MIDDLE OF THE ROAD. I AM AMAZED  THAT HYOSUNG WOULD BE SO NEGLIGENT IN THERE CHOICE OF QUALITY PARTS LIKE A HORN. THESE HORNS SHOULD BE REPLACED WITH HORNS THAT OF HIGHER QUALITY.   I ALSO HAVE ANOTHER GRIEVANCE FAR AS SAFETY GOES. MY CLUTCH  CABLE SNAPPED AFTER ONLY 6,000 MILES. I HAVE FRIEND WHO HAS A HYOSUNG AQUILA 250 WHO HAS ALSO HAD THERE CLUTCH CABLE SNAP DURING OPERATION AND ALMOST CAUSED HER TO LOSE TRACTION BECAUSE SHE WAS IN THE 1ST GEAR WITH THE CLUTCH ENGAGED AND WHEN THE CLUTCH CABLE SNAPPED IT SLOWED HER DOWN TO QUICK  IN THE 1ST GEAR AND SHE ALMOST SLID THROUGH THE SAND ON THE ROAD AND CRASHED INTO ANOTHER ONCOMING CAR. THESE FLAWS COMPEL ME SO MUCH THAT AT FIRST I THREATENED TO REPORT HYOSUNG TO THE DEPT OF TRANSPORTATION AT FIRST IF HYOSUNG CONTINUES TO FAIL TO REPLY TO MY EMAILS BUT NOW I THINK THAT I NEED TO REPORT  THESE INCIDENTS ANYWAY SINCE I HAVE NO DOUBT IN MY MIND THAT THE HORN ISSUE IS GOING TO CAUSE SOMEONE TO GET HURT IF IT HASN'T ALREADY. ALSO I FEEL THAT THE WIRING ON HYOSUNG MOTORCYCLE ARE UNSAFE BECAUSE THE WIRES ARE SECURED TO TIGHTLY TOGETHER OR TO THE FRAME WITH TYPICAL ZIPTIES THAT CAUSE THE WIRES TO BE CUT OR LACERATE THROUGH THE WIRE INSULATION.  *TR",
        "vin": "KM4VP571761"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/06/2007",
        "dateOfIncident": "07/06/2007",
        "fire": false,
        "manufacturer": "HYOSUNG MOTORS AMERICA INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10198662,
        "products": [
            {
                "manufacturer": "HYOSUNG MOTORS AMERICA INC.",
                "productMake": "HYOSUNG",
                "productModel": "GV650",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 HYOSUNG GV650.  HE NOTICED FUEL LEAKED FROM THE CARBURETOR.  THE CONTACT STATED HE RECEIVED A SERVICE BULLETIN, WHICH WOULD PROVIDE A FIX FOR THE FAILURE.  THE FIX WAS TO REMOVE THE FILLER CAP GASKET THEN PUNCH HOLES IN THE GASKET AND REINSTALL IN THE FUEL TANK.  HE STATED THAT AFTER THE REPAIR THE VEHICLE CONTINUED TO LEAK FUEL.  THE BUILT UP PRESSURE FROM THE FAULTY GASKET CAUSED THE SEAM OF THE FUEL TANK TO CRACK.  THE REPAIR ORDER IS AVAILABLE.  THE FAILURE AND CURRENT MILEAGES WERE 2,300.    UPDATED 12/12/07 *BF  THE COMPANY AGREED TO BUY THE MOTORCYCLE BACK FROM THE CONSUMER. UPDATED",
        "vin": "KM4VP571061"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/30/2007",
        "dateOfIncident": "05/25/2007",
        "fire": false,
        "manufacturer": "HYOSUNG MOTORS AMERICA INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10191996,
        "products": [
            {
                "manufacturer": "HYOSUNG MOTORS AMERICA INC.",
                "productMake": "HYOSUNG",
                "productModel": "GV650",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 HYOSUNG GV650 STALL AND REAR TIRE LOCKUP DURING LEFT HAND TURN. I BELIEVE THIS MAY BE THE KICKSTAND SAFETY SWITCH, I HAVE HEARD FROM OTHERS THAT THE BIKE CAN SHUTOFF DURING DRIVING AND BECOME A HAZARD, I WAS TAKING A TURN THAT MAY HAVE OPENED IT SLIGHTLY CAUSING THE BIKE TO STALL. I HAVE ALSO HEARD THE SWITCH CAN GET DUST IN IT CAUSING THIS PROBLEM, AND WON'T START AFTER WASHING THE BIKE DUE TO WATER IN THIS SWITCH. *TR",
        "vin": "KM4VP571361"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/14/2007",
        "dateOfIncident": "01/01/2007",
        "fire": false,
        "manufacturer": "HYOSUNG MOTORS AMERICA INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10185027,
        "products": [
            {
                "manufacturer": "HYOSUNG MOTORS AMERICA INC.",
                "productMake": "HYOSUNG",
                "productModel": "GV650",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "CAN NOT READ GAUGES (SPEEDOMETER, ODOMETER, GAS LEVEL, TEMP AND ETC) DURING SUNNY DAYS> *JB",
        "vin": "KM4VP571X61"
    }
]