[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/21/2021",
        "dateOfIncident": "09/11/2021",
        "fire": true,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433880,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "Without warning, my car lost power as I was driving on the interstate. I started changing lanes to get over to the shoulder, and before I got to the shoulder smoke began to come out of the hood then flames started.  I was able to pull over and get myself and my special needs son out of the car with the help of others who saw the flames and also pulled over. 911 was called and police and fire came. The firefighters put out my engine fire with their chemical suppressants.    My car does not have an active recall on it, but other makes and models with this same engine do, so I never receivedany warming about this problem happening with my same engine. I have always had it serviced at the dealership.   This was very traumatic.",
        "vin": "Kmhfc46f06a"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/07/2021",
        "dateOfIncident": "06/07/2021",
        "fire": true,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419868,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "The car caught fire in the inside and the police says it was electrical but we haven't received any notification are recall.",
        "vin": "Kmhfc46f26a"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/20/2021",
        "dateOfIncident": "04/07/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11417970,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "The abs and check engine are stuck on",
        "vin": "kmhfc46f66a"
    },
    {
        "components": "SUSPENSION,SEATS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/12/2021",
        "dateOfIncident": "11/28/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387635,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "SEAT: IN AUGUST 2019, WHILE MY SON WAS DRIVING MY CAR WITH BOTH HANDS ON THE STEERING WHEEL AND ME IN THE FRONT PASSENGER SEAT ON A CITY STREET THE DRIVER SEAT BACK STARTED TO FOLD FORWARD TO THE POINT MY SON WAS SCREAMING AND SCARED NOT KNOWING WHAT WAS HAPPENING HE HAD TO MAKE AN ABRUPT EXIT OFF THE ROAD INTO A PARKING LOT WE WERE PASSING. ONCE SAFELY PARKED HE PULLED THE LATCH ON THE SIDE THAT CONTROLS THE SEAT BACK AND MADE THE SEAT GO BACK INTO PLACE. NOW AS OF MAY 2020, THE SEAT WILL ONLY GO BACKWARDS AND IS STUCK IN THAT POSITION AND WILL NOT GO FORWARD AT ALL.     SUSPENSION: I HAVE HAD THIS CAR SINCE THE BEGINNING OF APRIL 2014, I HAVE HAD THE SUSPENSION DONE I KNOW AT A MINIMUM OF 5 TIMES TO DATE, THE LAST BEING 7/2/2020 AND CURRENTLY BEING TOLD IT NEEDS TO BE FIXED AGAIN!!!!!! THIS IS RIDICULOUS!!!    ENGINE: THE CHECK ENGINE ALERT COMES ON EVERY TIME I CUT THE CAR ON FOR THE LAST 2 YEARS OR SO. EACH TIME IT WAS TAKEN TO THE MECHANIC AND THE ERROR CODE CAME UP THE SAME SO I PAID TO GET THE ISSUE FIXED TO NO AVAIL. THE CHECK ENGINE ALERT CONTINUES TO COME ON AND I WAS TOLD IT IS A SENSOR MALFUNCTION.    AIR BAG ICON: THIS HAS BEEN ON FOR THE PAST YEAR AND I WAS TOLD YET AGAIN THAT IT IS A SENSOR MALFUNCTION.",
        "vin": "KMHFC46F86A"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/05/2020",
        "dateOfIncident": "06/06/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11373125,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY 2006 HYUNDAI AZERA LIMITED  ALMOST  4 YEARS AGO.I HAVE HAD SUSPENSION PROBLEMS .I HAVE HAD SHOCKS CHANGED 4 TIMES.STILL NO ONE CAN FIX THE RATTLE SOUND WHEN I GO OVER BUMPS.06",
        "vin": "KMHFC46F26A"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/17/2020",
        "dateOfIncident": "07/27/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11355676,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "HOW MANY PEOPLE HAVE TO BE INJURED BEFORE HYUNDAI FIGURES OUT THEIR NON-AIRBAG DEPLOYMENT ISSUES? 57 COMPLAINTS ON NHTSA FOR THE 2006 AZERA AIR BAGS, AND I WAS JUST IN A HARD SIDE T-BONE COLLISION JUST IN FRONT OF THE DRIVER'S DOOR THAT BROKE MY COLLAR BONE, AND NOT ONE AIR BAG DEPLOYED.  I WAS PROCEEDING THROUGH A 4 WAY INTERSECTION WHEN MY LIGHT TURNED GREEN, AND A CAR TO MY LEFT WAS ACCELERATING THROUGH THE RED LIGHT. I BOUGHT THE CAR BRAND NEW, AND COMPLETED ALL ISSUED RECALLS. WHEN MY AIR BAG LIGHT KEPT COMING ON THREE YEARS AGO, I WAS FINALLY TOLD IT WAS THE DRIVER SIDE SEAT BELT TENSION SENSOR, WHICH WAS NOT COVERED BY A RECALL, ONLY THE PASSENGER SIDE HAD THE RECALL, SO I SPENT OVER $600 TO HAVE IT FIXED, AND THE ERROR LIGHT WENT OUT.  I OPENED A CASE WITH HYUNDAI TO INFORM THEM I WAS IN A SIDE IMPACT ACCIDENT AND NO AIR BAGS DEPLOYED. WHEN THEY CALLED TO FOLLOW UP, THEY DID NOT SEEM INTERESTED IN FIGURING OUT THE PROBLEM, SAID I NEVER BROUGHT THE VEHICLE BACK FOR A FOLLOW UP, AND ASKED ME WHAT MY AGENDA WAS? I HAD NO AGENDA AT THE TIME, AND WAS EVEN LOOKING TO PURCHASE A G90, BUT I GUESS NOW IT IS TO LET SOME HYUNDAI OWNERS KNOW THEIR COULD BE AIR BAG PROBLEMS.",
        "vin": "KMHFC46F46A"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/16/2020",
        "dateOfIncident": "09/16/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11355353,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI AZERA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER :13V354000 (SUSPENSION). THE CONTACT TOOK THE VEHICLE TO JOHN AMATO HYUNDAI OF MILWAUKEE (8301 N 76TH ST, MILWAUKEE, WI 53223) WHERE THEY APPLIED A WAXING APPLICATION TO THE SUSPENSION TO PREVENT CORROSION AS STATED IN THE RECALL. A FEW YEARS AFTER THE RECALL WAS PERFORMED, THE CONTACT STATED THAT WHILE DRIVING AT 45 MPH, THE LEFT REAR SPRING DETACHED FROM THE VEHICLE WITHOUT WARNING. DUE TO THE FAILURE, THE CONTACT HAD THE VEHICLE TOWED TO AN INDEPENDENT MECHANIC WHERE HE WAS INFORMED THAT THE REAR CROSS MEMBER HAD FAILED. THE CONTACT THEN CALLED THE DEALER THAT PERFORMED THE RECALL AND THEY STATED THAT THEY WOULD INSPECT THE VEHICLE HOWEVER, THEY DECLINED TO COVER THE COST OF THE TOW TO THE DEALER. THE MANUFACTURER WAS THEN NOTIFIED OF THE FAILURE AND A CASE WAS FILED. THE VEHICLE REMAINED IN THE POSSESSION OF THE INDEPENDENT MECHANIC AND WAS NOT YET REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 170,000.",
        "vin": "KMHFC46FX6A"
    },
    {
        "components": "STEERING,SERVICE BRAKES, AIR",
        "crash": false,
        "dateComplaintFiled": "07/17/2020",
        "dateOfIncident": "07/02/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339984,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS 2006 HYUNDAI AZERA. THE CONTACT STATED THAT AFTER EXITING THE HIGHWAY, THE VEHICLE LOSS POWER STEERING ASSIST AND ENDED UP IN A DITCH ON THE SIDE OF THE ROADWAY. THE ABS WARNING LIGHT WAS ILLUMINATED. THE VEHICLE WAS TOWED TO GREEN HYUNDAI (2955 US-93 S, KALISPELL, MT 59901) WHERE THE VEHICLE WAS DIAGNOSED WITH ABS FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 170,000.*DT*JB",
        "vin": "KMHFC46F46A"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/30/2020",
        "dateOfIncident": "09/09/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319771,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "SOMETIMES I GO OUT TO CRANK MY CAR AND IT WILL NOT START. ONCE THE CAR IS STARTED AND IN MOTION IT'S ALRIGHT BUT ONCE I TURN IT OFF AND IMMEDIATELY TURN IT BACK ON IT WILL NOT START. I HAVE TO WAIT SOMETIMES FIVE TO TEN MINUTES THEN IT WILL CRANK AGAIN.",
        "vin": "KMHFC46F86A"
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/24/2020",
        "dateOfIncident": "03/21/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319115,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI AZERA. THE CONTACT STATED THAT WHILE DRIVING AT AN UNDISCLOSED SPEED, THE VEHICLE INDEPENDENTLY SWITCHED FROM ONE LANE TO THE OTHER. THE CONTACT PULLED OVER AND WAITED FOR A WHILE BEFORE DRIVING TO THE RESIDENCE. THE CONTACT INSPECTED THE VEHICLE AND BECAME AWARE THAT THE REAR DRIVER'S SIDE WHEEL WAS TILTED INWARD. UPON FURTHER INSPECTION, THE CONTACT NOTICED THAT THE SUBFRAME WAS SEVERELY CORRODED WITH RUST HOLES THROUGHOUT THE CENTER OF THE SUBFRAME. THE VEHICLE WAS PURCHASED FROM LIBERTY FORD SOUTHWEST, INC. LOCATED AT (6600 PEARL RD, PARMA HEIGHTS, OH 44130, (440) 888-2600) WHO WAS CONTACTED AND INFORMED OF THE FAILURE. THE CONTACT WAS REFERRED TO AN UNKNOWN HYUNDAI DEALER. THE CONTACT WAS INFORMED THAT THE VEHICLE WAS NOT SUBJECTED TO A RECALL. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 115,000.",
        "vin": "KMHFC46F06A"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/31/2019",
        "dateOfIncident": "10/01/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11277398,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI AZERA. WHILE DRIVING 60 MPH AT NIGHT, THE CONTACT EXPERIENCED POOR VISIBILITY DUE TO THE ANGLE OF THE HEADLIGHTS. THE CONTACT STATED THAT HE COULD ONLY VIEW THE ROAD ONCE THE HIGH BEAM HEADLIGHTS WERE ACTIVATED. THE CONTACT ASSOCIATED THE FAILURE WITH NHTSA CAMPAIGN NUMBER: 08E021000 (EXTERIOR LIGHTING). THE CONTACT TOOK THE VEHICLE TO BOB HOWARD HYUNDAI (613 SW 74TH ST, OKLAHOMA CITY, OK 73139, (405) 634-8900) AND WAS INFORMED THAT THE VEHICLE WAS DESIGNED IN THAT MANNER. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "KMHFC46F66A"
    },
    {
        "components": "UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/28/2019",
        "dateOfIncident": "06/17/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11223142,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "LIGHT FOR BRAKES, ABS, ECO ARE ON BRAKES WAS DONE",
        "vin": "KMHFC46F06A"
    },
    {
        "components": "SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/24/2019",
        "dateOfIncident": "06/22/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11222263,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI AZERA. THE CONTACT STATED THAT THE VEHICLE WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 13V354000 (SUSPENSION). WHILE DRIVING VARIOUS SPEEDS, THE VEHICLE WOBBLED WHEN MAKING TURNS. THE CONTACT NOTICED THAT THE REAR DRIVER'S SIDE WHEEL WAS PROTRUDING FROM THE WHEEL WELL. THE VEHICLE WAS TOWED TO HER HOME. THE DEALER AND MANUFACTURER WERE NOT NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE FAILURE MILEAGE WAS 121,000. *BF    THE CONSUMER STATED WAS REPAIRED OUT OF POCKET.  *TR",
        "vin": "KMHFC46F16A"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/26/2019",
        "dateOfIncident": "11/14/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11203996,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ANY TIME I LET MY FOOT OFF THE GAS THE CAR DASHBOARD LIGHTS DIM, THE RADIO LOSES VOLUME, AND THE HEADLIGHTS DIM. THIS IS ALL VERY NOTICABLE. RECENTLY THE CAR WOULD SOMETIMES FEEL AS THOUGH THE BRAKES HAD BEEN STOMPED ON. WHEN THIS HAPPENS I GET AND ABS SYSTEM FAILURE ALERT ON THE DASHBOARD AND MY CHECK ENGINE LIGHT TURNS ON. A COUPLE OF TIMES THIS HAPPENED IT HAS COMPLETELY SHUT OFF THE ENGINE. BECAUSE IT TURNED OFF I DIDN'T HAVE POWER STEERING, SO I HAD TO PULL OVER AND RESTART MY ENGINE.   THIS HAPPENS AS I'M DRIVING, I NOTICED IT HAPPENS WHEN IT SHIFTS DOWN GEARS. SOMETIMES WHEN I ACCELERATE AND THE CAR SHIFT GEARS UP IT CAN HAPPEN AS WELL.  I FOUND A NOTICE ABOUT A RECALL ON THESE CARS FOR THE ABS MODULE SYSTEM ISSUE. RECALL #172.",
        "vin": "KMHFC46F06A"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/03/2019",
        "dateOfIncident": "02/17/2019",
        "fire": true,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11193691,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 12:50 AM ON 2/17/2019 WHEN THE CAR WAS PULLED OVER ON THE W. BOUND 72ND ST EXIT RAMP OF I-80 IN OMAHA, NE THE ENGINE STARTED ON FIRE. THE CAR WAS PULLED OVER BECAUSE IT WAS CHUGGING ON THE INTERSTATE HIGHWAY AND RAMP. THE WEATHER WAS SNOWING AND THERE WERE POLICE ON DUTY DUE TO OTHER RESONS SO THE POLICE SAW THE FIRE, CALLED THE FIRE DEP'T AND HAD THE CAR TAKEN TO THE POLLICE IMPOUND LOT. MY INSURANCE CO. INSPECTED THE CAR AND DECLARED THE CAR A TOTAL LOSS. THE VIN WAS CHECKED AFTERWARDS AND THIS CAR HAS A HISTORY OF ELECTRICAL ENGINE SHORTS CAUSING FIRES AND I WAS NOT NOTIFIED.",
        "vin": "KMHFC46F16A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/17/2019",
        "dateOfIncident": "03/15/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11187364,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOOK MY 2006 AZERA TO THE DEALERSHIP WHEN I RECEIVED A RECALL NOTICE FOR A POSSIBLE SRS MALFUNCTION (10V007000). AFTER A YEAR OR SO THE SRS LIGHT CAME ON INTERMITTENTLY BUT WAS MOSTLY OFF. STARTING THIS WEEK (3/15/2019) THE SRS LIGHT HAS STAYED ON AND WON'T GO OFF. BASED ON WHAT I HAVE READ, THIS IS A COMMON PROBLEM FOR AZERA OWNERS. I BELIEVE A SECOND RECALL IS NECESSARY SINCE THE FIRST ONE DID NOT SOLVE THE PROBLEM FOR VERY LONG.",
        "vin": "KMHFC46F66A"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/01/2019",
        "dateOfIncident": "12/15/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11173630,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL SENSORS IN GAS TANK,DRIVING DOWN ROAD WHEN ALL OF A SUDDEN GAUGE GOES RIGHT TO EMPTY,PULLED OFF HIGHWAY THINKING I WAS OUT OF GAS ,FOUND GAS STATION,PULLED UP TO PUMP & GAUGE WENT BACK TO FULL ,HAD TO CUT ACROSS 3 LANES TO MAKE NEAREST EXIT.THIS PROBLEM CAN MAKE PEOPLE PANICK",
        "vin": "KMHFC46F46A"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/03/2019",
        "dateOfIncident": "06/01/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11165638,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI AZERA. THE CONTACT STATED THAT THE LOW BEAM HEADLIGHTS FAILED TO PROVIDE ADEQUATE ILLUMINATION WHILE DRIVING. THE CONTACT HAD TO ENGAGE THE HIGH BEAM HEADLIGHTS TO VIEW THE ROAD. ALSO, WHEN THE BRAKE PEDAL WAS DEPRESSED, THE ILLUMINATION FROM THE LOW BEAM HEADLIGHTS DIMMED. FURTHERMORE, THE INSTRUMENT PANEL LIGHTING FAILED TO OPERATE AND THE GAUGES COULD NOT BE VIEWED. THE VEHICLE WAS TAKEN TO AN UNKNOWN DEALER AND THE ALTERNATOR WAS REPLACED, BUT THE VEHICLE WAS NOT REPAIRED. THE BATTERY AND THE LOW AND HIGH BEAM HEADLIGHT BULBS WERE ALSO REPLACED, BUT THE FAILURE PERSISTED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS CONTACTED. THE FAILURE MILEAGE WAS 135,000.",
        "vin": "KMHFC46F56A"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/23/2018",
        "dateOfIncident": "10/18/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11142293,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CARS DRIVER SIDE BACK WHEEL INVERTED AFTER I MADE A TURN, ON TO DIXIE HWY.  I HAD MY CAR LOOKED AT BY AFFORD AUTO REPAIR.  THEY INFORMED ME THAT MY CONTROL ARMS HAD CORRODED, AND BROKE THROUGHT THE UNDER CARRIAGE..  THE HAD SEEN IT BEFORE WITH MY MODEL AND SONATA AND THAT IST HAD A RECALL.  I HAD MY CAR TOWED TO KERRY HYUNDAI IN FLORENCE, Y 41042.  HYUNDAI CALLED BACK TO DENY THE RECALL BASED ON THE MILEAGE ON MY VEHICLE.I HAVE SEARCHED FOR AN ANSWERE BECAUSE THE RECALL IM REFERRING TO DOESN'T SPEAK ABOUT MILEAGE.  MY CAR ALSO HAS RECALL 172 ACTIVE NOW, THAT HYUNDAI HAS ADDRESSED YET, AS OF THE TIME SINCE WE TOOK IT THERE FOR THIS RECALL.",
        "vin": "KMHFC46F66A"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/26/2018",
        "dateOfIncident": "04/11/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11090258,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI AZERA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 18V026000 (SERVICE BRAKES). THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR AS THE RECALL NOTICE WAS RECEIVED OVER TWO MONTHS AGO. THE DEALER (SOUTH LOOP HYUNDAI, 8811 LAKES AT 610 DR, HOUSTON, TX 77054) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS CONTACTED SEVERAL TIMES AND WAS UNABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "KMHFC46F96A"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/24/2018",
        "dateOfIncident": "02/01/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11089816,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI AZERA. THE CONTACT STATED THAT THE ADJUSTER FOR THE HEAD LAMP FIXTURE WAS NOT STRUCTURALLY SOUND. AN INDEPENDENT MECHANIC ADJUSTED THE LIGHTING FIXTURE, BUT THE HEAD LAMP FIXTURE STRUCTURE WAS INFERIOR AND IMPACTED THE CONTACT'S VISIBILITY WHILE USING THE LOW BEAM, HIGH BEAM, OR DAYTIME RUNNING LAMPS. THE VEHICLE WAS NOT DIAGNOSED BY A DEALER. THE VEHICLE WAS NOT INCLUDED IN TWO UNKNOWN EXTERIOR LIGHTING RECALLS. THE MANUFACTURER ALSO ISSUED SEVEN TSBS FOR THE ELECTRICAL SYSTEM. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS NOT AVAILABLE. *TT",
        "vin": "KMHFC46F16A"
    },
    {
        "components": "SUSPENSION,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/13/2018",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11084863,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE AN 06 HYUNDAI AZERA AND THERE WAS A RECALL MADE BACK IN 2013 FOR THE PASSENGER SEAT WIRING HIRENESS. THE DEFECT WOULD CAUSE THE AIRBAG NOT TO DEPLOY. WOULD I BE ABLE TO GET THIS DEFECT FIXED NOW? I DID NOT OWN THE VEHICLE BACK IN 2013, AS I DID NOT OWN IT UNTIL MAY OF 2015. IT IS SHOWING THE SIGNS OF THE DEFECT. THE AIR BAG LIGHT IS ON AND IT IS THROWING ERROR CODES B1489&B1495, WHICH IS FOR THE PASSENGER OCCUPUTANT SYSTEM. I ALSO HAVE THIS NOISE LIKE SOMETHING IS LOOSE IN THE SUSPENSION. EVERY LITTLE BUMP CAUSES A RATTLING NOISE. I CAN NOT TELL IF IT IS THE FRONT OR BACK, BUT I AM ASSUMING IT IS THE BACK SINCE THERE WAS A RECALL ON THIS AS WELL, PLUS I HAVE REPLACED ALL FRONT END PARTS. AND THE NOISE STILL EXISTS.",
        "vin": "KMHFC46F56A"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/08/2018",
        "dateOfIncident": "03/07/2018",
        "fire": true,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11076934,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2006 HYUNDAI AZERA. WHILE THE VEHICLE WAS PARKED, IT CAUGHT ON FIRE. THE FIRE DEPARTMENT WAS ABLE TO EXTINGUISH THE FIRE. THE CONTACT STATED THAT THE FIRE CAUSED DAMAGE TO THE MOBILE HOME SUB STRUCTURE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 18V026000 (SERVICE BRAKES, HYDRAULIC). FITZGERALD'S COUNTRYSIDE HYUNDAI WAS CALLED AT 727-797-6369 AND AN APPOINTMENT WAS MADE TO HAVE THE RECALL REMEDY PERFORMED; HOWEVER, THE VEHICLE CAUGHT ON FIRE PRIOR TO THE REPAIR DATE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND PROVIDED CASE NUMBER: 11074631. THE APPROXIMATE FAILURE MILEAGE WAS 80,300.  -  (RECALL RELATED INCIDENT)  TS",
        "vin": "KMHFC46F56A"
    },
    {
        "components": "SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/25/2018",
        "dateOfIncident": "02/01/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11074702,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "HEARD ON TV ABOUT THE RECALL ABOUT THE MOTOR AND BRAKES. NOONE HAS CONTACTED ME ABOUT THIS RECALL.",
        "vin": "KMHFC46D37A"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/18/2018",
        "dateOfIncident": "02/13/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11073498,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I GET A LOT OF WATER THROUGH THE FIREWALL AND TRUNK .WHEN I USE MY TURN SIGNAL MY RUNNING LIGHTS GO OUT AND MY HEADLIGHTS GO DIM AND I HAVE NO CONTROL OVER  MY LIGHTS ABS WARNING LIGHT COMES ON EVERY THING ELECTRICAL GOES HAYWIRE.PLEAS HELP ME THIS HAPPENS ALL DAY EVERY TIME I GET ON THE  ROAD",
        "vin": "KMHFC46F16A"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/11/2018",
        "dateOfIncident": "02/10/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11072156,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING 2006 HYUNDAI AZETRA  ON I-95 ON FEB 10, 2018 @10:30 PM  ALL DASH LIGHTS BEGINNING WITH ABS BRAKES WENT BALLISTIC AND CAR BEGAN TO BUCK LIKE A BRONCO, THEN BEGAN TO DRIVE CAR 2 TO 3 LANES ON RIGHT LANE TO EXIT IN DEERFIELD AT SW 10TH ST ON AN INCLINE RAMP IN WHICH BRAKES WERE FAILING AND STEERING WHEEL NOT WORKING TO MANEUVER A TURN.  HAD TO FORCEFULLY TURN STEERING WHEEL HARD TO RIGHT TO AVOID CAUSING CAR TO CRASH OR HARMING OTHERS ON ROAD (WHICH CAUSED EXTREME DISCOMFORT ON SHOULDER, ELBOW, WRIST AND HAND TODAY) AND ENGINE TURNED OFF WHICH CAR COASTED DOWNHILL AND MADE FIRST RIGHT TURN COASTED A FEW FEET AND CAR STOPPED.  WHEN CAR WAS ENABLED ONTO FLAT BED BY TOW CO, NOTICED RED FLUID ON GROUND WHICH COULD BE TRANSMISSION OR GASOLINE???  EVERYTHING HAPPENED SO QUICKLY; VERY SCARED FOR OUR LIVES. DIDN'T SLEEP WELL AND UNEASY TODAY  I ALSO NOTIFIED HYUNDAI TODAY @1-800-633-5151 AND GAVE A REPORT IN WHICH A CASE WORKER WILL NOTIFY US IN 3 TO 5 BUSINESS DAYS, CONFIRMATION # 11007142",
        "vin": "KMHFC46F76A"
    },
    {
        "components": "SUSPENSION,EXTERIOR LIGHTING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/05/2018",
        "dateOfIncident": "08/11/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11066942,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT NIGHT, FOR THE FIRST TIME SINCE BUYING OUR HYUNDAI AZERA, I WAS HORRIFIED TO FIND THE HEADLIGHTS WERE BARELY VISIBLE AND POINTING AT THE GROUND. I HAD TO DRIVE WITH THE BRIGHT LIGHTS ON. EVEN AFTER THE DEALER ADJUSTED THEM WE CONTINUE TO HAVE TO USE THE BRIGHT LIGHTS FOR SAFE DRIVING. IT APPEARS THE INSIDE OF THE LENS COVERS, IN FRONT OF THE REGULAR BULBS, ARE SEVERELY SCRATCHED OR CLOUDY SO THE LIGHTS CAN'T ILLUMINATE THE ROADS! THIS SEEMS LIKE A SERIOUS FLAW FOR NIGHT DRIVING. WE ARE OFTEN ON TWO LANE ROADS THAT ARE HILLY AND CURVY, WITH THE OCCASIONAL DEAR CROSSING IN FRONT OF US, AS WELL AS ONCOMING CARS. IF WE DIM OUR LIGHTS FOR THEM, WE LITERALLY CAN'T SEE THE ROAD IN FRONT OF US, AND PRACTICALLY HAVE TO STOP UNTIL THE ONCOMING CAR GOES BY.   WE INQUIRED, AND WERE TOLD THE ENTIRE HEADLIGHT UNIT WILL HAVE TO BE REPLACED AND IS VERY EXPENSIVE. BOTH SIDES ARE BAD. PLEASE HELP!   THERE IS ALSO A STRANGE NOISE FROM UNDER THE CAR, A SQUEAK AND LOW THUMPING SOUND WHEN ON THE INTERSTATE. WE HADN'T EVEN MADE OUR FIRST CAR PAYMENT WHEN WE BECAME AWARE OF THESE ISSUES.   THEN THE CHECK ENGINE LIGHT CAME ON AND WE HAD TO HAVE THE FIREWALL SIDE CONVERTER AND TOP 2 SENSORS REPLACED AT THE HEFTY PRICE OF $815.95.",
        "vin": "KMHFC46F56A"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/29/2018",
        "dateOfIncident": "01/01/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11065669,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHTS ARE DIMMING WHILE CITY DRIVING DUE TO A FAULTY WIRING HARNESS. SEVERAL COMPLAINTS HAVE BEEN MADE BUT NO RECALL HAS BEEN UPDATED. MOST OCCURS IN MOTION BUT ALSO HAPPENS WHEN PARKED WHEN THE ENGINE IS ON AND TURNING THE WHEELS.",
        "vin": "KMFHC46F26A"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/13/2018",
        "dateOfIncident": "12/23/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11062540,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS GETTING IN MY HYUNDAI AZERA I PULLED IN THE DOOR HANDLE AND IT LITERALLY BROKE OFF.  MY OTHER DOOR HANDLE IS FALLING APART LITTLE BY LITTLE   THIS ALL HAPPENED IN MY DRIVEWAY",
        "vin": "KMHFC46F66A"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/09/2017",
        "dateOfIncident": "08/09/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11014015,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI AZERA. WHILE DRIVING 35 MPH, THE HEADLIGHTS MALFUNCTIONED AND DIMMED WITHOUT WARNING. ALSO, THE VEHICLE SPEED REDUCED INDEPENDENTLY ON MORE THAN ONE OCCASION AND THE ABS FAILURE INDICATOR ILLUMINATED WITHOUT WARNING. AN INDEPENDENT MECHANIC REPLACED THE ALTERNATOR, BUT THE FAILURES RECURRED. KENNESAW HYUNDAI IN KENNESAW, GEORGIA WAS CONTACTED ABOUT THE SERIES OF FAILURES AND STATED THAT THE FAILURES CORRECTED THEMSELVES. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE FAILURE MILEAGE WAS 80,000.",
        "vin": "KMHFC46F56A"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/25/2017",
        "dateOfIncident": "03/01/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10991681,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING HOME AND WAS FLAGGED BY ANOTHER VEHICLE TO STOP.  WAS DRIVING AROUND 15 MPH ON CITY STREET.  THE REAR WHEELS LOOKED AS THOUGH THEY WERE COMING OFF DESCRIBED BY OTHER DRIVER.  HAD CAR TOWED TO SHOP AND WAS DETERMINED THE CROSS MEMBER HAD FAILED BY BREAKING.  WAS DIAGNOSED ALSO CALLED BY HYUNDAI IN COLUMBUS AND SPOKE TO MANAGER WHO WOULD NOT ASSIST.  STATED WAS OUR OWN ISSUE TO FIX EVEN THOUGH THERE WAS A PREVIOUS RECALL ON THE PART. IF MY SPOUSE WOULD HAVE DROVE THE VEHICLE TO WORK THAT DAY THIS COULD HAVE TURNED INTO A MAJOR ACCIDENT AS SHE DRIVES ON THE FREEWAY.  WE HAVE SEVERAL OTHER PICTURES IF NEEDED.  WE DID FILE A COMPLAINT DIRECTLY WITH HYUNDAI CORP. OFFICE AND WAS REIMBURSED FOR THE COST OF THE REPAIR AFTER PROVIDING ALL DOCUMENTATION. ...UPDATED 10/03/17 *BF",
        "vin": "KMHFC46F26A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/16/2017",
        "dateOfIncident": "03/10/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10966259,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 HYUNDAI AZERA GAS PEDAL LOST ALL POWER AT 30 MPH ON FREEWAY.  VEHICLE STILL RUNNING BUT WILL NOT ACCELERATE PAST 30 MPH. RESTARTED CAR, LOST POWER AT  30 MPH.  EXTREMELY DANGEROUS.  THIS HAPPENED ON FREEWAY HEADING AWAY FROM HOME.  HAD TO TURN AROUND IN EMERGENCY TURN AROUND AND HEAD BACK HOME WITH FLASHERS ON 30 MPH ALL THE WAY HOME.  ACCELERATOR CONTINUES TO LOSE POWER AT 30 MPH.    LOSING POWER ON FREEWAY AND IN INTERSECTIONS IS A HORRIBLE FEELING.",
        "vin": "KMHFC46F86A"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "02/02/2017",
        "dateOfIncident": "02/02/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10949153,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "OVER PAST APPROXIMATELY 4 1/2 YEARS, THE AIRBAG LIGHT HAS BEEN ON 7 OR 8 TIMES. MILEAGE ~136K, 151K 183K,191K & 203.6K. THE SEAT BELT PRE TENSIONERS AND COMPLETE SEAT BELTS REPLACED 4-6 TIMES AND THE AIRBAG CONTROL MODULE ONCE. THE DRIVER'S SEATBELT PRETENSIONER WAS SUCCESSFULLY REPAIRED ~AUGUST 8, 2016. A COMPANY AGENT INSPECTED THE FUNCTIONING OF THE PASSENGER AIR BAG [OCS] AUGUST 26, 2013.  TODAY 2-2-2017 THE SEATBELT LIGHT CAME ON. MY MECHANIC DETERMINED THE CODE WAS B1382 SIDE CURTAIN AIRBAG -HIGH RESISTANCE.  I HAVE COMPLETE RECORDS OF THE MAINTENANCE AND REPAIR OF THIS VEHICLE WHICH I CAN SUPPLY UPON REQUEST.",
        "vin": "KMHFC46F06A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/27/2017",
        "dateOfIncident": "01/27/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10948029,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG LIGHT ON...VEHICLE TAKEN TO DEALER AND I WAS TOLD THAT PRETENSIONER PASSENGER SIDE SEAT BELT FAILED. RECALL COMPLLIED WITH ON PASSENGER SIDE SEAT BELT 2010.  COST TO FIX $573. NOT REPAIRED YET. I HAVE COMPLAINED HYUNDAI OF AMERICA.",
        "vin": "KMHFC46F76A"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/29/2016",
        "dateOfIncident": "12/29/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10938644,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI AZERA. THE CONTACT STATED THAT THE HEADLIGHTS WERE NOT BRIGHT ENOUGH WHILE DRIVING AT NIGHT. THE DEALER DIAGNOSED THAT THE HEADLIGHTS NEEDED TO BE ADJUSTED. THE VEHICLE WAS REPAIRED, BUT THE FAILURE RECURRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 10,000.",
        "vin": "KMHFC46F96A"
    },
    {
        "components": "AIR BAGS,SEAT BELTS,SEATS",
        "crash": false,
        "dateComplaintFiled": "11/29/2016",
        "dateOfIncident": "06/19/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10928446,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG LIGHT STAYS ON AND WONT GO OUT",
        "vin": "KMHFC46F06A"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/17/2016",
        "dateOfIncident": "08/15/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10896538,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE ATTEMPTING TO FUEL UP AT A SERVICE STATION, THE PUMP KEEPS KICKING BACK, NO MATTER HOW SLOWLY YOU PUMP THE FUEL.  TRIED TURNING PUMP UPSIDE DOWN WITH NO BETTER RESULT.  THIS RESULTS IN FUEL FUMES COMING OUT OF THE FILLER.",
        "vin": "KMHFC46F86A"
    },
    {
        "components": "STEERING,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/28/2016",
        "dateOfIncident": "12/15/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10881239,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON US 95 AT NIGHT MY ENGINE STOPPED RUNING. I WAS TRAVING AT 65 MPH.AT THE TIME. THE CAR WAS TOWED AND LATER INSPECTED. THE INSPECTION REVEALED THAT ALTERNATOR HAD FAILED BECAUSE OIL HAD LEAKED FROM THE VALVE COVER GASKETS DIRECTLY ONTO THE ALTERNATOR WHICH CAUSED IT TO FAIL. THIS FAILURE ALSO AFFECTED THE POWER STEERING & MY LIGHTS AS WELL . I WAS FORTUNATE THAT MY CAR WAS NOT STRUCK AS THE TRAFFIC WAS HEAVY. .",
        "vin": "KMHFC46F66A"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "05/02/2016",
        "dateOfIncident": "02/12/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10862625,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2006 HYUNDAI AZERA. WHILE DRIVING 30 MPH, THE VEHICLE STRUCK A BLOCK OF ICE AND THE CONTACT LOST CONTROL OF THE VEHICLE. AS A RESULT, THE VEHICLE SKID ACROSS THE INTERSECTION, CRASHED INTO A TREE HEAD ON, AND LANDED IN A FROZEN RETENTION POND. THE SEAT BELT WAS TITHING ACROSS THE CONTACT'S CHEST CAUSING HER TO BLEED. THE CONTACT REQUIRED MEDICAL ATTENTION. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO AN INDEPENDENT TOW LOT. THE VEHICLE WAS DESTROYED. IN ADDITION, THE AIR BAGS FAILED TO DEPLOY. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 71,400.",
        "vin": "KMHFC46F86A"
    },
    {
        "components": "AIR BAGS,SEAT BELTS,ELECTRONIC STABILITY CONTROL",
        "crash": true,
        "dateComplaintFiled": "03/09/2016",
        "dateOfIncident": "02/12/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10845835,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG DID NOT DEPLORE UNTIL AFTER THE CAR FULLY STOPPED BUT THE SEAT BELT ON THE DRIVERS SIDE TIGHTEN CONTINUOUSLY UNTIL I GOT A BLEED INJURY INSIDE MY RIGHT BREAST THE RIGHTING STOPPED ONLY AFTER I WAS ABKE TO RELEASE IT THEN AFTERWARDS THE AIRBAG DEPLORED ONLY IN THE DRIVERS SIDE NO OTHER AIRBAGS CAME OUT DURING THIS ACCIDENT.",
        "vin": "KMHFC46F86A"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/24/2016",
        "dateOfIncident": "02/12/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10838000,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI AZERA. THE CONTACT STATED THAT ALL OF THE LIGHTS ON THE INSTRUMENT PANEL, THE AIR CONDITIONING UNIT, AND HEADLIGHTS TURNED ON AND OFF INDEPENDENTLY SEVERAL TIMES. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC. THE TECHNICIAN DIAGNOSED THAT THE ALTERNATOR MAY BE DEFECTIVE. THE VEHICLE WAS REPAIRED; HOWEVER, THE FAILURE RECURRED SEVERAL TIMES. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO WAS UNABLE TO DETERMINE THE CAUSE OF THE FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 72,000. ......UPDATED 04/01/16 *BF  CONSUMER STATED THE SERVICE TECHNICIAN THAT THE PART HAS BEEN CHANGED THIS WHY THE NUMBER HAS BEEN RECENTLY CHANGED, CLEARLY SHOWING THE HARASS WAS DEFECTIVE.  UPDATED 6/6/18*JB",
        "vin": "KMHFC46F86A"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "01/15/2016",
        "dateOfIncident": "10/15/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10820405,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG WARNING LIGHT(S) ALWAYS ON WHEN NO ONE IS SITTING IN FRONT PASSENGER SEAT.  NOTE: NO ACCIDENT HAS HAPPENED. THIS CAR WAS SUPPOSEDLY FIXED UNDER AN EARLIER RECALL (HYUNDAI 094).",
        "vin": "KMHFC46F06A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/29/2015",
        "dateOfIncident": "12/01/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10816851,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "BEEN ON ABOUT MONTH",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/10/2015",
        "dateOfIncident": "04/17/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 1,
        "numberOfInjuries": 1,
        "odiNumber": 10809473,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2006 HYUNDAI AZERA. WHILE DRIVING AT 45 MPH, AN SUV PULLING A TRAILER ATTEMPTED TO MAKE A U-TURN ON A ONE WAY ROAD. ANOTHER VEHICLE CRASHED INTO THE TRAILER AND CAUSED THE CONTACT'S VEHICLE TO BE STRUCK BY THE TRAILER. THE CONTACT STATED THAT THE AIR BAGS DEPLOYED FOR THE DRIVER, BUT THEY FAILED TO DEPLOY ON THE PASSENGER SIDE. A POLICE REPORT WAS FILED. THE CONTACT SUSTAINED INJURIES TO THE RIGHT HAND FROM THE THUMB TO THE INDEX FINGER AND EMERGENCY SURGERY WAS PERFORMED. ONE OF THE OCCUPANTS OF THE OTHER VEHICLE PERISHED AS A RESULT OF THE CRASH. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC WHERE IT WAS DEEMED DESTROYED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "KMHFC46FX6A"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/05/2015",
        "dateOfIncident": "10/20/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10788680,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI AZERA. WHILE DRIVING 10 MPH, THE VEHICLE LOST POWER. THE VEHICLE WAS TAKEN TO A DEALER TO BE REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE FAILURE MILEAGE WAS 60,120.  UPDATED 12/18/15*LJ  *TR",
        "vin": "KMHFC46F96A"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/27/2015",
        "dateOfIncident": "06/01/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10786228,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE BRAKE LIGHTS DIM WHEN HEADLIGHTS ARE OFF. ALSO, HIGH MOUNTED CENTER BRAKE LIGHT DOES NOT ILLUMINATE DURING BRAKING WHEN HEADLIGHTS ARE OFF. THE CENTER BRAKE LIGHT BRIEFLY LIGHTS FOR A 1/2 SECOND, THEN SHUTS OFF. THIS CAN BE DANGEROUS PARTICULARLY IN DAYTIME DRIVING, IF HEADLIGHTS ARE NOT ON FULL OR IN AUTOMATIC SETTING.",
        "vin": "KMHFC46F26A"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/17/2015",
        "dateOfIncident": "06/17/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10725750,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI AZERA. THE CONTACT STATED THAT WHEN THE KEY WAS TURNED TO THE ON POSITION, THE ENGINE FAILED TO START. THE CONTACT MENTIONED THAT THE VEHICLE MADE A CLINK NOISE AND THEN STALLED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC, WHO STATED THAT THE VEHICLE EXPERIENCED A SECURITY FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 80,000.",
        "vin": "KMHFC46F36A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/29/2015",
        "dateOfIncident": "03/25/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10713654,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG LIGHT (DASH) COMES ON AND STAYS ON. PASSENGER AIR BAG LIGHT DOES NOT INDICATE ANY FAULT. CODE 1495.  *TR",
        "vin": "KMHFC46F26A"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/14/2015",
        "dateOfIncident": "04/09/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10705544,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI AZERA. WHILE OPERATING THE VEHICLE, THE DRIVER SIDE HEADLIGHT WAS MISALIGNED AND CAUSED THE LIGHT TO PROJECT TO THE GROUND. THE FAILURE DIMINISHED THE DRIVER'S VISIBILITY. THE CAUSE OF THE FAILURE WAS NOT DIAGNOSED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 08E021000 (EXTERIOR LIGHTING). THE CONTACT STATED THAT THE VEHICLE EXPERIENCED THE SAME FAILURE LISTED IN THE RECALL. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 120,000.",
        "vin": ""
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "03/21/2015",
        "dateOfIncident": "10/31/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10700845,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "FAILURE OF PASSENGER SIDE FRONT SEAT BELT ASSEMBLE EFFECTING AIRBAGS.  *TR",
        "vin": "KMHFC46F26A"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "02/01/2015",
        "dateOfIncident": "10/25/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10680417,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIR BAG LIGHT IN THE INSTRUMENT CLUSTER LIGHTED AND FROM TIME TO TIME WAS OFF BUT HAS BEEN LIGHTED SINCE APPROXIMATELY 145,700 MILES, ABOUT TWO YEARS 3 MONTHS.  IN DEALER AND INDEPENDENT MECHANICS TESTS THE CODE INDICATED THAT THE SEAT BELT SENSOR IS MALFUNCTIONING AND THAT THE SIDE IMPACT AIR BAG LOCATED IN THE RIGHT FRONT SEAT BACK MAY BE INOPERATIVE. THIS INDICATOR LIGHT IS CURRENTLY LIGHTED.   HYUNDAI PROVIDED AN EXAMINATION OF THE FRONT RIGHT AIRBAG LOCATED IN THE RIGHT DASH. IT WAS INDICATED TO BE FUNCTIONAL.  IN QUERIES TO HYUNDAI I HAVE BEEN TOLD THAT THE FRONT AIRBAG WAS REPAIRED ACCORDING TO THE RECALL REQUIREMENT. IS THE RECALL CORRECTION ONLY VALID FOR ONE CORRECTION?    *TR",
        "vin": "KMHFC46F06A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/31/2014",
        "dateOfIncident": "12/30/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10669421,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIRBAGS ON THIS CAR DID NOT DEPLOY AFTER A NARROWLY AVOIDED HEAD ON COLLISION WHICH RESULTED IN DRIVER SIDE IMPACT ON THE FRONT ENGINE SIDE PANEL AND DRIVER DOOR.THE SIDE CURTAINS NOR THE AIRBAGS IN THE DASH AND STEERING COLUMN DID NOT DEPLOY RESULTING IN BELK DID PASSENGERS COMING IN CONTACT WITH STEERING COLUMN AND DASH OF THE KNEES AND CHEST UP BOTH OCCUPANTS.THE IMPACT AT THE FRONT LEFT TIRE WAS FORCEFUL ENOUGH TO CAUSE THE TIRE TO TUCK UP UNDER ITSELF INDICATING THE SIDE AIR CURTAINS COULD HAVE PREVENTED CONTACT WITH THE SIDE OF THE CAR IN ADDITION TO THE CONTACT DESCRIBED WITH THE CHEST AND KNEES. BOTH OCCUPANTS WERE TRANSPORTED BY AMBULANCE TO THE EMERGENCY ROOM WHERE THEY WERE EVALUATED.  *JS",
        "vin": "KMHFC46FX6A"
    },
    {
        "components": "VISIBILITY,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "10/28/2014",
        "dateOfIncident": "07/13/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10650627,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "IN 2010 THE REAR SUN SCREEN WOULD BIND WHEN YOU TRIED TO RETRACT IT, HYUNDAI REPLACED THE PART SINCE IT WAS STILL UNDER WARRANTY. IT WAS APPROX. 2 MONTHS LATER THE SAME THING HAPPENED, IN 2014 IT HAPPENED AGAIN. TALKED TO HYUNDAI ABOUT GIVING ME THE PART AND I WOULD PAY TO HAVE IT INSTALLED, DIDN'T HAPPEN. I TOLD HYUNDAI THAT I FELT IT MUST BE A DESIGN FLAW BECAUSE IT HAS BROKEN 3 TIMES IN FOUR YEARS AND ONCE AGAIN THE RESPONSE WAS THERE WAS NOTHING THEY COULD DO FOR ME. MAYBE HYUNDAI SHOULDN'T PRODUCE CARS WITH SUN SCREENS IN THEM SINCE IT SEEMS LIKE THEY CAN'T GET IT RIGHT, AND IS HAVING TROUBLE ADMITTING THE PROBLEM IS THEIR FAULT.   *TR",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/14/2014",
        "dateOfIncident": "10/05/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10644610,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI AZERA. THE CONTACT STATED THAT THE DASHBOARD ON THE PASSENGER SIDE FRACTURED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 71,000.",
        "vin": "KMHFC46F56A"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "10/13/2014",
        "dateOfIncident": "09/11/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10644242,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON I70. DRIVER POWER SEAT MOVED BACKWARD.  WAS ABLE TO STOP MOTION AND RETURN SEAT TO PREVIOUS POSITION USING SWITCH.  THE SEAT HAD BEEN MOVING BACK AND THE SEATBACK HAD BEEN TITLING FORWARD WHEN CAR WAS PARKED AND NO IGNITION ON.  SEAT HAS SINCE BEEN MOVING BACK WHILE DRIVING MORE OFTEN AND THE SEAT BACK NOW TILTS FORWARD WHILE DRIVING.  HAD TO STOP CAR SINCE SWITCH WOULD NOT OVERRIDE THE ACTIONS.  HAD THIS CHECKED AFTER FIRST INCIDENT AT DEALER.  STATED THEY COULDN'T DUPLICATE PROBLEM BUT WOULD PROBABLY REQUIRE COMPLETE REPLACEMENT OF DRIVERS SEAT AT ABOUT $2000. HAVE ALSO HAD PROBLEM WITH PASSENGER SIDE AIRBAGS AND SEATBELT.  BUCKLES HAVE BEEN REPLACED UNDER A RECALL ON BOTH FRONT SEATS BUT DIDN'T FIX THE AIRBAG PROBLEM. THIS IS A MAJOR SAFETY ISSUE AND A RECALL SHOULD BE ISSUED BEFORE SOMEONE GETS KILLED.  THINK ABOUT GM KEY PROBLEM.   *TR",
        "vin": "KMHFC46F56A"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/04/2014",
        "dateOfIncident": "08/18/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10641410,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS AT A STOP LIGHT AND IT TURNED GREEN SO I WENT AND IN THE MIDDLE OF ME TURNING IT DIED AND STARTED BACK UP. IT DOES THIS TO ME ALOT AND I HAVE HAD IT IN THE SHOP THEY CANT FIND ANYTHING WRONG. I ALSO HAVE A PROBLEM WITH THE LIGHTS DIMMING EVERYTIME I DECREASE SPEED AND MY RPMS DROP DRAMATICALLY LOW.  *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/31/2014",
        "dateOfIncident": "08/31/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10629701,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "A RED LIGHT WARNING ON AIR BAGS CAME ON WHILE TRAVELING.  WHEN THE PROBLEM WAS CHECKED BY A HYUNDAI DEALER, THEY REPORTED THAT THE SEAT PODS WERE SHORTED OUT AND THAT THE SEAT PODS NEEDED REPLACEMENT AT A COST OF OVER $1,600.  THE CAR MILEAGE WAS 53,000.  THE OCS SYSTEM IS NOT WORKING.  I CONTACTED HYUNDAI ABOUT THE PROBLEM AND THEY SENT A CONTRACT PERSON TO INSPECT THE PROBLEM.  HE INDICATED THAT HE THOUGHT THAT THE AIR BAG SYSTEM WAS WORKING, BUT COULD NOT EXPLAIN WHY THE WARNING LIGHT WAS ON, NOR WOULD HE COMMENT ABOUT THE DEALERS FINDING.  I RETURNED TO THE DEALER AND THEY CONFIRMED THAT THE OCS SYSTEM WAS NOT WORKING DUE TO THE SEAT POD MALFUNCTION.  I CONTACTED HYUNDAI AGAIN WITH THEIR DEALERS FINDING AND REQUESTED THAT HYUNDAI REPLACE THE PART AND I WOULD PAY THE LABOR COST.  THEY REPLIED THAT THEIR POSITION THAT THE OCS SYSTEM WAS \"OPERATING ACCORDING  TO DESIGN\" AND THAT THEY WOULD NOT REPLACE THE SEAT PODS.  IT IS APPARENT THAT THIS ANOTHER EXAMPLE OF HYUNDAI\"S AIR BAG PROBLEMS, BUT THEY REFUSE TO ACKNOWLEDGE THE PROBLEM  OR REPLACE THE FAULTY PART.  THIS IS A SERIOUS SAFETY PROBLEM FOR ME AND MY FAMILY.  I HAVE KEPT ALL CORRESPONDENCE WITH HYUNDAI ABOUT THE PROBLEM.",
        "vin": "KMHFC46F26A"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/19/2014",
        "dateOfIncident": "07/25/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10626230,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT NIGHT THE HEADLIGHTS DIM DRASTICALLY WHILE THE CAR IS DOWNSHIFTING WHILE SLOWING TO A STOP.  EACH TIME THE CAR DOWNSHIFTS THE LIGHTS DIM.  I HAVE TAKEN IT IN MULTIPLE TIMES TO THE DEALERSHIP AND EVEN SHOWN THEM THE TSB PERTAINING TO THIS ISSUE AND THEY HAVE YET TO FIX THIS ISSUE.  EVERY TIME I TAKE IT IN TO THE DEALERSHIP THERE IS SOME EXCUSE WHY IT IS HAPPENING AND IT GENERALLY CENTERS AROUND SUPPOSED CORROSION ON THE BATTERY TERMINALS OR I NEED MY BATTERY REPLACED.  AFTER CLEANING TERMINALS, REPLACING BATTERY, AND WHATEVER ELSE THEY SUGGESTED, THE HEADLIGHTS STILL DIM.  THEY REFUSE TO DO THE FIX AS DESCRIBED IN THE TSB AND SAY THAT EVERYTHING CHECKS OUT FINE AND THERE IS NO NEED TO REPLACE ANYTHING, EXCEPT THE BATTERY WHICH DIDN'T FIX THE PROBLEM.  THE FIRST TIME I BROUGHT THIS UP WAS IN 2008 AND MULTIPLE TIME PER YEAR SINCE WITH NO RESOLUTION.  IT KEEPS GETTING WORSE EVERY YEAR WITH THE AMOUNT OF STRAIN ON THE SYSTEM AND AGING OF THE VEHICLE.  I FEAR THAT SOMETHING OR SOMEONE IS GOING TO DART OUT IN FRONT OF ME WHEN THIS IS HAPPENING AND I WON'T BE ABLE TO REACT IN TIME SINCE MY HEADLIGHTS ARE NOT PROJECTING THEIR FULL DISTANCE WHEN THIS HAPPENS.  *TR",
        "vin": ""
    },
    {
        "components": "TIRES,WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/24/2014",
        "dateOfIncident": "07/10/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10615921,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "BROUGHT MY CAR IN FOR RECALL CAMPAIGN NUMBER 13V-354, REPAIR WAS MADE BUT THERE WAS SOME DAMAGE TO REAR PASSENGER SIDE RIM AND TIRE. I BOUGHT 4 NEW TIRES BUT THE CAR RODE WITH A VIBRATION. MADE AN APPOINTMENT TO HAVE IT INSPECTED AND WAS TOLD THE PROBLEM WAS WITH THE NEW TIRES. NEW TIRES WERE INSTALLED. STILL HAVE A VIBRATION DUE TO THE DAMAGE TO THE RIM WHICH WAS A RESULT OF THE RECALL AND THE LOCAL DEALER HAS NOT ADDRESSED THE SITUATION. I PAID A LOT OF MONEY TO GET SERVICE AT THE DEALER, OIL CHANGE, FUEL INJECTION MAINTENANCE NEW TIRES, MOUNTED, BALANCED AND FRONT END ALIGNMENT AND STILL HAVE ISSUES. ALIGNMENT OFF DUE TO SECOND SET OF TIRES BEING INSTALLED,  THE CAR STILL VIBRATES DUE TO DAMAGED RIM. I WILL NOT GET THE MILAGE OUT OF THE TIRES DUE TO THE VIBRATION. I WOULD THINK THAT THE RIM SHOULD BE REPLACED AT NO COST TO MYSELF. I DRIVE 3000 MILES A MONTH, SO FOR MY SAFETY, I STAY UP ON MY MAINTENANCE LIKE I SHOULD. I THINK THE DEALER, RTE 44 HYUNDAI IN RAYNHAM SHOULD TAKE CARE OF MY PROBLEM. I SEEM TO BE GETTING THE RUN-AROUND FROM THEM. HELP  *TR",
        "vin": "KMHFC46F26A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/08/2014",
        "dateOfIncident": "09/12/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10608847,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIRBAG LIGHT HAS BEEN ON INTERMITTENTLY FOR ~2 YEARS. TESTS INDICATE THAT THE RIGHT FRONT SIDE IMPACT AIRBAG LOCATED IN THE SEAT BACK MAY BE DEFECTIVE. HYUNDAI  IS  UNWILLING TO REPAIR THIS PROBLEM WITHOUT CHARGE.    *JS",
        "vin": "KMHFC46F06A"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "07/02/2014",
        "dateOfIncident": "04/02/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10607876,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI AZERA. THE CONTACT STATED THAT THE AIR BAG SENSOR ILLUMINATED, WHICH INDICATED THAT THE AIR BAG WAS FAULTY.  THE DEFECT OCCURRED THE SAME TIME THE PASSENGER SEAT MALFUNCTIONED. THE DEALER STATED THAT THE FRONT PASSENGER SIDE SEAT BELT WAS DEFECTIVE. THE MANUFACTURER STATED THAT THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 10V007000 (AIR BAGS, SEAT BELTS), ALTHOUGH THE FAILURES WERE IDENTICAL TO THE ONES MENTIONED IN THE RECALL. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 96,000.",
        "vin": "KMHFC46F96A"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/04/2014",
        "dateOfIncident": "05/17/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10596252,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MAY 17, 2014 AT APPROXIMATELY 1 PM IN THE AFTERNOON, I WAS DRIVING ON THE FREEWAY WHEN I HEARD A LOUD \"THUD\" AND MY STEERING WHEEL JERKED SLIGHTLY WHILE TRAVELING AT 65 MPH. THE SOUND CONCERNED ME SO I PULLED OVER AND LOOKED AT MY BRAKING ASSEMBLY ON THE DRIVER'S SIDE FRONT WHEEL. I DIDN'T SEE A LOOSE CALIPER OR ANYTHING OUT OF THE ORDINARY SO I \"LIMPED\" TO WHERE I WAS GOING. WHEN I ARRIVED AT A FAMILY MEMBERS HOUSE, I REMOVED THE FRONT DRIVER'S SIDE WHEEL AND WAS SHOCKED AT WHAT I SAW. THE UPPER CONTROL ARM HAD SNAPPED IN TWO AT THE BALL JOINT. HAD I REALIZED THAT AT THE TIME, I CERTAINLY WOULD HAVE HAD MY CAR TOWED SINCE THIS WAS A SAFETY ISSUE. I ORDERED A NEW CONTROL ARM AND INSTALLED IT OVER A PERIOD OF SEVERAL DAYS. I KEPT THE BROKEN CONTROL ARM AND BROUGHT IT TO MY LOCAL DEALERSHIP TO SHOW THEM WHAT HAD HAPPENED AND TO INQUIRE ABOUT ANY RECALLS HYUNDAI MAY HAVE ON THEIR CONTROL ARMS (MAY 27TH). I SPOKE TO ONE OF THE MANAGERS, KELLY [XXX] AT SOUTH BAY HYUNDAI, AND HE SAID NO RECALLS HAD BEEN ISSUED AND GAVE ME THE CUSTOMER SERVICE HOTLINE NUMBER. I CALLED THE CUSTOMER SERVICE CENTER AND SPOKE TO [XXX] ON MAY 27, 2014 AT APPROXIMATELY 11:45AM. HE ALSO CONFIRMED THERE WERE NO RECALLS AND OFFERED TO RECORD THE SITUATION UNDER CASE NUMBER 6626102 (I BELIEVE THE CONVERSATION WAS RECORDED AND STARTED AROUND 11:38AM IF USED FOR REFERENCE). I EXPLAINED TO HIM THE CONTROL ARM SHOULD NEVER HAVE FAILED. AFTER SEVERAL EMAILS TO HYUNDAI CONSUMER AFFAIRS, THEY WANTED NOTHING TO DO WITH THE SITUATION SINCE THE CAR WAS OUT OF WARRANTY. I ONLY RECEIVED CANNED STATEMENTS FROM THEM. AS AN ENGINEER MYSELF, I BELIEVE THIS IS A PART THAT SHOULD EASILY LAST THE LIFETIME OF THE VEHICLE. I BELIEVE THIS IS A SAFETY ISSUE AND COULD POSSIBLY AFFECT OTHERS DRIVING AN AZERA OR SONATA.  PLEASE CONTACT ME FOR PHOTOS, DOCUMENTATION, AND/OR THE FAILED CONTROL ARM ITSELF.      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "KMHFC46F16A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/20/2014",
        "dateOfIncident": "05/01/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10592740,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I WENT TO JIM ELLIS (HYUNDAI) WITH \"PASSENGER AIRBAG OFF\" SHOWING UP INTERMITTENTLY WHEN PASSENGER IS SEATED.WHEN I GOT THE CAR BACK AND LOOKED THE NEXT DAY THAT WARNING WAS THERE AND ALSO A RED INDICATOR WAS NOW SHOWING IN THE DASH.ON 5/7/14 I WENT BACK AND THEN WAS TOLD THERE IS NO PASSENGER AIRBAG PROBLEM IT IS A DRIVER AIRBAG PROBLEM. I CANNOT ACCEPT THAT UNLESS THE CAR'S INDICATOR IS WRONG. FURTHERMORE I POINTED OUT TO THEM ABOUT A RECALL FOR AN OCS PROBLEM. THEY SAID THERE IS NO RECALL OUTSTANDING FOR THIS MODEL THAT WAS FIXED SINCE 2010. I THEN CALLED HYUNDAI CORPORATE AND UPON CHECKING MY VIN THEY'RE SAYING YES THERE IS A RECALL.  LET THE RECORD SHOW THAT THE DEALER VIZ. JIM ELLIS DOESN'T KNOW OF THEIR OWN RECALL AND DO NOT WANT TO FIX A PROBLEM WITHOUT ME PAYING THEM. MEANWHILE WE HAVE A SAFETY HAZARD ON THE CAR.  I AM AWARE THAT YOU KNOW OF 1 RECALL WHEREBY THERE IS CLIP TO BE PUT ON BUT PLEASE BE AWARE THAT THERE IS YET ANOTHER SIMILAR PROBLEM TO BE FIXED.   *TR",
        "vin": "KMHFC46F46A"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "04/24/2014",
        "dateOfIncident": "04/22/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10584577,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A AIRBAG LIGHT ON MY DASH.  HYUNDAI DEALERSHIP SAYS IT IS THE SEAT BELT TENSIONER ON THE DRIVER SIDE.    HYUNDAI HAS RECALLED THE CAR FOR THE SEAT BELT TENSIONER ON THE PASSENGER SIDE BUT THEY TOLD ME THE DRIVER SIDE IS NOT A RECALL.  HOW CAN THAT BE?  *TR",
        "vin": "KMHFC46F06A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/14/2014",
        "dateOfIncident": "04/06/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10579738,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG LIGHT CAME ON WHILE DRIVING.  DEALER SAID THAT THE AIRBAG SEAT PODS UNDER  THE SEATS WERE SHORTED AND THAT THE ENTIRE PODS WOULD NEED REPLACING - COST $1,627.  I WAS DRIVING A LONG DISTANCE WITHOUT AIRBAG PROTECTION ON A LONG TRIP.    *JS",
        "vin": "KMHFC46F26A"
    },
    {
        "components": "SUSPENSION,STRUCTURE,WHEELS",
        "crash": false,
        "dateComplaintFiled": "02/27/2014",
        "dateOfIncident": "02/20/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10566322,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING VEHICLE APPROXIMATELY 30 MPH WHEN LEFT REAR WHEEL ASSEMBLY SEPARATED FROM REAR CROSS MEMBER SUSPENSION CAUSING THE VEHICLE TO SWAY OUT OF CONTROL. VEHICLE CAME TO A STOP WITH LEFT REAR WHEEL AT A 25 DEGREE ANGLE. SAFETY RECALL IDENTIFIED BY DEALER...  *TR",
        "vin": "KMHFC46FX6A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/05/2014",
        "dateOfIncident": "12/03/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10563033,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING IN LA, CA WITH SPEED CONTROL SET AT 65MPH I WAS MAKING A LANE CHANGE. TO ALLOW MORE ROOM BETWEEN MYSELF AND THE FOLLOWING CAR I ACCELERATED BY STEPPING ON THE GAS PEDAL. THE CAR SPEED INCREASED AND I REMOVED MY FOOT FROM THE ACCELERATOR TO RETURN TO THE SET SPEED. THE CAR DID NOT SLOW DOWN. I STEPPED ON THE BRAKE TO #1 TAKE THE CAR OFF CRUISE CONTROL AND #2. TO SLOW DOWN. THE CAR DID NOT SLOW DOWN AND I WAS NOW MOVING AT ABOUT 80MPH. I STEPPED WITH MY LEFT FOOT ON THE BRAKE PEDAL AND TAPPED THE GAS PEDAL. STILL THE CAR DID NOT SLOW DOWN AND I HAD DIFFICULTY KEEPING THE SPEED DOWN BY APPLYING THE BRAKE. I SHUT OFF THE IGNITION AND AS I WAS IN THE FAST LANE (LEFT) I MOVED OFF THE LANE TO BRING THE CAR TO A STOP. THIS HAPPENED THREE MORE TIMES WHILE DRIVING IN LA. ON 02/03/14 WHILE DRIVING ON I15 I WANTED TO SEE IF I COULD DUPLICATE THE CONDITION. AGAIN THE ACCELERATOR GOT STUCK AND I HAD TO SHUT OFF THE MOTOR. I BROUGHT THE CAR TO THE LOCAL HYUNDAI DEALER WHO REPORTED THAT THEY COULD NOT FIND ANYTHING WRONG. AS THE SAME THING HAPPENED WHILE DRIVING HOME, I WENT BACK TO THE DEALER AND ON A TEST DRIVE WITH A TECHNICIAN THE ACCELERATOR GOT STUCK AGAIN. I NEED YOUR HELP AND ASSISTANCE IN THIS MATTER WHICH IS A SERIOUS SAFETY ISSUE.  *TR",
        "vin": "KMHFC46F96A"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/03/2014",
        "dateOfIncident": "12/03/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10562793,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I CAN BE DRIVING AND THE D FOR DRIVE WILL GO OUT IF I PARK AND GET OUT AND GET BACK IN AND PUT MY CAR IN DRIVE MY CAR WON'T GO ANYWHERE I WILL HAVE TO FIND A SCREW DRIVER AND PRESS THE RELEASE BUTTON BESIDE THE GEARS I CAN TRY TO PARALLEL PARK IN TRAFFIC AND AS SOON AS I PUT MY CAR IN REVERSE THEN BACK ON DRIVER CAR WON'T MOVE I HAVE TO CONTINUE TO GO IN REVERSE OR GET OUT AND HAVE MY CAR PUSHED UNTIL THE CAR IS READY TO GO BACK INTO DRIVE.  *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION,EQUIPMENT ADAPTIVE/MOBILITY,BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "01/17/2014",
        "dateOfIncident": "01/10/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10560436,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "EXCESSIVE SQUEAKING NOISE EMITTING FROM FRONT PASSENGER AND DRIVER SIDE. VEHICLE ANALYZED BY PEP BOYS MECHANIC. RESOLUTION WAS TO REMOVE AND REPLACE FRONT BALL JOINT UPPER AND REMOVE AND REPLACE FRONT STRUT ASSEMBLY.    ALSO, THE REAR SCREEN IS ACTIVATED WHEN VEHICLE IS TAKEN OUT OF PARK AND PLACE IN REVERSE. SCREEN WILL NOT RETURN TO DOWN POSITION WHEN SWITCH IS TOUCHED.   *TR",
        "vin": "KMHFC46F16A"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "12/16/2013",
        "dateOfIncident": "11/25/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10556249,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI AZERA. THE CONTACT STATED THE FRONT DRIVER'S SIDE SEAT BELT BUCKLE WAS FRACTURED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 118,975.",
        "vin": "KMHFC46F46A"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/06/2013",
        "dateOfIncident": "10/22/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10551146,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI AZERA. THE CONTACT STATED  WHILE DRIVING 70 MPH, HE ATTEMPTED TO ENGAGE THE BRAKE PEDAL AND IT FAILED TO STOP THE VEHICLE. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THE TECHNICIAN DIAGNOSED THAT A VACUUM LINE WITH A VALVE IN IT FAILED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGE WAS 92,000.",
        "vin": "KMHFC46F56A"
    },
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "10/14/2013",
        "dateOfIncident": "07/11/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10547851,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS TRAVELING AT APPROX. 18 MPH. I APPLIED BRAKES TO MAKE A LEFT TURN.  WHEN I PRESSED ON THE BRAKES, THE CAR ACCELERATED, AND THE BRAKES BEGAN STIFF AND WOULD NOT STOP THE CAR.  THE CAR RAN INTO A CLOSED OVERHEAD DOUBLE GARAGE DOOR, CONTINUED THRU THE GARAGE AND HIT THE BRICK WALL ON THE BACK OF THE GARAGE.   THE AIRBAGS DID NOT DEPLOY. I SUSTAINED LACERATIONS AND BRUISES. THE CAR WAS DEEMED A TOTAL LOSS BY THE INSURANCE COMPANY.  HYUNDAI HAD THE CAR INSPECTED BY AN INDEPENDENT THIRD PARTY, AND NO PROBLEMS WERE NOTED.  HYUNDAI HAS NOT SHARED THE RESULTS OF THE INVESTIGATION WITH US.  WE HAVE SINCE USED OUR OWN THIRD PARTY TO TEST THE CAR AND THE ABS AND ESC WARNING LIGHTS REMAIN ON INDICATING THERE IS A PROBLEM WITH BOTH SYSTEMS.  *TR",
        "vin": "KMHFC46F66A"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "10/02/2013",
        "dateOfIncident": "08/06/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10546475,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIR BAG LIGHTS ON DRIVER'S SIDE AND PASSENGER SIDE STAY ON TO LET YOU KNOW THE AIR BAGS DO NOT WORK. WE HAVE ALREADY BEEN THROUGH THE PROCESS OF REPLACING THE TENSION SENSOR WIRING HARNESS CLIP.  THE PROBLEM HAS MANIFESTED ITSELF AGAIN. I HAVE TALKED TO THE MANUFACTURER AND THEY WILL NOT OFFER ANY HELP OR SOLUTIONS SINCE THE ITEMS WERE REPLACED UNDER THE EARLIER RECALL. I DO NOT BELIEVE IT IS MY RESPONSIBILITY TO REPLACE THE DEFECTIVE PARTS AT AN ESTIMATED COST OF $408.  HYUNDAI TOLD ME TO MAIL IN THE RECEIPT ONCE THE ITEM IS REPAIRED AND THEY MIGHT CONSIDER MAKING SOME SORT OF \"GOODWILL\" REIMBURSEMENT.   I AM FRUSTRATED WITH THEIR RESPONSE AND DISAPPOINTED AT HOW THEY HAVE RESPONDED TO A KNOWN DEFECT.   *TR",
        "vin": "KMHFC46F36A"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/30/2013",
        "dateOfIncident": "09/22/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10546191,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS 2006 HYUNDAI AZERA. THE CONTACT STATED THAT WHILE STOPPED ATA A TRAFFIC STOP, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS NOT REPAIRED OR INSPECTED. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE APPROXIMATE FAILURE MILEAGE IS 116,565.   UPDATED 12/4/13*CN",
        "vin": "KMHFC46F76A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/27/2013",
        "dateOfIncident": "09/19/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10545670,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI AZERA. THE CONTACT STATED THAT THE AIR BAG WARNING LIGHT ILLUMINATED. THE CONTACT HAD PREVIOUSLY RECEIVED NOTIFICATION OF NHTSA CAMPAIGN I.D. NUMBER: 09V497000 (AIR BAGS , SEAT BELTS) AND TOOK THE VEHICLE TO THE DEALER FOR RECALL SERVICE HOWEVER, THE DEALER ADVISED THAT THE RECALL REPAIR COULD NOT BE HONORED. THE CONTACT CALLED THE MANUFACTURER AND WAS ADVISED THAT THE RECALL HAD EXPIRED SEPTEMBER 20, 2013. THE CONTACT DID NOT HAVE THE VEHICLE REPAIRED. THE FAILURE MILEAGE WAS 84,204.",
        "vin": "KMHFC46F86A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/22/2013",
        "dateOfIncident": "09/02/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10544862,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG LIGHT STAYS ON IN THE DASH (DRIVER SIDE). IT WILL NOT GO OFF.  I WAS TOLD THAT IF THAT LIGHT STAYS ON, MY AIR BAGS ARE SHUT OFF AND WILL NOT DEPLOY IF THERE IS AN ACCIDENT.  I WAS TOLD THAT THERE WAS A CLASS ACTION SUIT CONCERNING THE AIRBAGS, BUT WAS TOLD THAT THE SUIT WAS ONLY FOR THE PASSENGER SIDE LIGHTS.  I AM TOLD ONE THING BY THE DEALER CONCERNING THE AIRBAGS (AUTOMAX HYUNDAI OF KILLEEN (254-699-2629), AND ANOTHER BY THE HYUNDAI MOTOR AMERICA (CASE # 6050686 TELEPHONE 1-877-277-0012).  I AM DRIVING AROUND NOW WITH NO FUNCTIONAL AIR BAGS, AND THIS TO ME IS A SERIOUS HIGHWAY SAFETY FACTORALL I WANT IS FOR MY AIR BAGS TO BECOME FUNCTIONAL AGAIN AND ME NOT HAVING TO PAY FOR SOMETHING THAT IS SUPPOSED TO BE GOOD FOR OVER 100,000 MILES ACCORDING TO THE AMERICAN SAFETY BOARD.  THANKING YOU IN ADVANCE FOR YOUR ASSISTANCE, BECAUSE I AM SURE NOT GETTING IT FROM HYUNDAI OR THE DEALER.  AGAIN THANK YOU. SAMUEL J PAYNE, RETIRED MILITARY (ARMY 31 YEARS), AND 100% UNEMPLOYABLE DISABLED VETERAN.",
        "vin": "KMHFC46F16A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/04/2013",
        "dateOfIncident": "12/01/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10541773,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG LIGHTS ON DRIVER'S SIDE AND PASSENGER SIDE STAY ON TO LET YOU KNOW THE AIR BAGS DO NOT WORK.  WE HAVE ALREADY BEEN THROUGH THE PROCESS OF REPLACING THE TENSION SENSOR WIRING HARNESS CLIP AND WE STILL HAVE THE PROBLEM.  WE HAVE TALKED TO THE MANUFACTURER AND HIGHWAY SAFETY AND THEY WILL NOT OFFER ANY HELP OR SOLUTIONS.  WE DO NOT FEEL IT IS OUR RESPONSIBILITY TO REPLACE THE AIR BAGS AT A HIGH COST WHEN THEY HAVE NEVER BEEN USED, YET THEY WILL NOT WORK IN THE EVENT OF AN ACCIDENT.  WE ARE FRUSTRATED WITH HOW WE HAVE BEEN TREATED AND ARE SHOCKED AT HOW IRRESPONSIBLE HYUNDAI IS.  WE WILL NEVER BUY ANOTHER VEHICLE FROM THEM AGAIN.  STILL WAITING FOR THEM TO ACKNOWLEDGE THIS PROBLEM AND DO THE RIGHT THING!.  *JB",
        "vin": "KMHFC46F26A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/17/2013",
        "dateOfIncident": "06/17/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10525354,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI AZERA. THE CONTACT STATED THAT WHILE STARTING THE VEHICLE, THE AIR BAG WARNING LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC FOR DIAGNOSIS WHERE IT WAS STATED THAT THE OCCUPANT RESTRAINING SYSTEM NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED AND THE MANUFACTURER WAS NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 53,000. *TR",
        "vin": "KMHFC46F76A"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "06/19/2013",
        "dateOfIncident": "10/01/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10520606,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI AZERA. THE CONTACT STATED THAT THE SEAT BELT SENSOR FAILED AND CAUSED THE DRIVER'S SIDE FRONT AIR BAG LIGHT TO ILLUMINATE. THE VEHICLE WAS TAKEN TO THE DEALER SEVERAL TIMES FOR THE AIR BAG FAILURE. THE DEALER REPLACED THE SEAT BELT SENSOR; HOWEVER THE FAILURE WAS NOT CORRECTED. THE AIR BAG WARNING LIGHT REMAINED ILLUMINATED.  THE VEHICLE WAS NOT REPAIRED THE APPROXIMATE FAILURE MILEAGE WAS 39,198 AND THE CURRENT MILEAGE WAS 73,000.",
        "vin": "KMHFC46F56A"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "06/13/2013",
        "dateOfIncident": "02/17/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10519703,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2006 HYUNDAI AZERA.  THE AIR BAG WARNING LIGHT WAS ILLUMINATED IN THE INSTRUMENT PANEL.  TOOK IT TO THE DEALER MAY 24, 2013, AND WAS TOLD THAT THE PASSENGER SEAT SENSOR NEEDED TO BE REPLACED AND WOULD COST $500.  IF I WANTED THIS REPAIRED, THEY WOULD HAVE TO ORDER THE PART AND I WAS TO CALL THEM AND LET THEM KNOW.  AFTERWARD, I LOOKED ON YOUR WEB SITE AND FOUND THAT THERE IS A RECALL.  CALL THE DEALER AND FOUND OUT THAT I HAD THE RECALL DONE APRIL 17, 2010, AND WOULD HAVE TO PAY FOR IT TO BE REPAIRED AGAIN.  IT SEEMS TO ME THAT HYUNDAI DID A TEMPORARY FIX FOR THIS PROBLEM.   SINCE CONSUMERS HAVE HAD THIS PROBLEM TO RECUR AFTER THE FIX, IT IS OBVIOUS THAT THIS IS JUST A BAND AID.  THE FIX DOESN'T EVEN LAST FIVE YEARS.  BECAUSE THIS WILL NOT ALLOW THE AIR BAG TO DEPLOY, THIS IS A SAFETY ISSUE AND HYUNDAI SHOULD REPAIR THE SENSOR FOR AS LONG AS THE ORIGINAL OWNER OWNS THE VEHICLE WITHOUT CHARGE.  *TR",
        "vin": ""
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "05/16/2013",
        "dateOfIncident": "09/03/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10512322,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI AZERA. THE CONTACT STATED THAT THE AIR BAG LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN TO THE DEALER FOR INSPECTION AND THEY STATED THAT THE SEAT BELT ASSEMBLY, THE POD SYSTEM, AND ECU NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED BUT THE FAILURE RECURRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 39,232.",
        "vin": "KMHFC46F76A"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "05/14/2013",
        "dateOfIncident": "04/16/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10511903,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI AZERA. THE CONTACT STATED THAT THE AIR BAG WARNING LIGHT ILLUMINATED ON THE INSTRUMENT PANEL. THE CONTACT TOOK THE VEHICLE TO THE DEALER AND THE DEALER RESET THE CODE FOR THE AIR BAG. THE LIGHT DID NOT ILLUMINATE TWO WEEKS. THE CONTACT INQUIRED ABOUT NHTSA RECALL CAMPAIGN ID NUMBER: 09V497000 (AIR BAGS SEATS BELTS) WITH THE MANUFACTURER AND WAS ADVISED THAT THE VEHICLE WAS NOT INCLUDED IN THE RECALL. THE CURRENT MILEAGE WAS 106,000. THE FAILURE MILEAGE WAS NOT AVAILABLE.  *TR",
        "vin": "KMHFC46F76A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/16/2013",
        "dateOfIncident": "07/01/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10508033,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 HYUNDAI AZERA. CONSUMER WRITES IN REGARDS TO VEHICLE AIR BAG LIGHT ILLUMINATING. *SMD  THE CONSUMER WAS INFORMED THE VEHICLE WAS NO LONGER UNDER WARRANTY AND THE REPAIR COST COULD BE UP TO $1,000.",
        "vin": ""
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "04/09/2013",
        "dateOfIncident": "04/01/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10505681,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI AZERA. THE CONTACT STATED THAT THE AIR BAG WARNING LIGHT WAS ILLUMINATED. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSIS. THE TECHNICIAN STATED THAT THE FRONT PASSENGER'S SIDE SEAT BELT WOULD HAVE TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 78,000.   *TR   UPDATED 06/17/13 *BF",
        "vin": "KMHFC46F06A"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/25/2013",
        "dateOfIncident": "02/25/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10499903,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TRIED UNLOCKING THE DOOR WITH THE REMOTE,DIDN'T WORK,USED THE KEY TO UNLOCK THE DOOR,INSIDE LIGHTS DIDN'T COME ON. WHEN I PUT THE KEY IN THE IGNITION,NOTHING HAPPENED,NO LIGHTS,NO CLICKING,NO NOTHING..LIKE THE WHOLE CAR JUST COMPLETELY SHUT DOWN,NO TYPE OF POWER.  *TR",
        "vin": "KMHFC46F46A"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/10/2013",
        "dateOfIncident": "05/15/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10497640,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRICAL GREMLINS ARE EVERYWHERE IN MY 2006 HYUNDAI AZERA LIMITED.    THERE ARE SO MANY ELECTRICAL ISSUES WITH MY CAR I KNOW IT IS JUST A MATTER OF TIME AND A SERIOUS SAFETY PROBLEM WILL ARISE WHILE DRIVING. THIS MODEL SHOULD BE RECALLED UNTIL THE COMPUTER/ELECTRICAL ISSUES ARE FIXED. THERE IS A REAL PATTERN HERE WITH ELECTRICAL AND COMPUTER PROBLEMS THAT COULD RESULT IN PEOPLE DYING IF THEY HAVEN'T ALREADY.    ALL OF THESE ISSUES CAME ON VERY SLOWLY OVER TIME AND SEAMED MINOR AT FIRST. NOW I AM TRULY AFRAID WHEN DRIVING THIS VEHICLE. I BOUGHT THIS VEHICLE NEW AND I HAD PLANNED ON THIS BEING MY LAST CAR. NOW I AM RETIRED AND CAN'T AFFORD TO BUY ANOTHER ONE.    1. STARTING PROBLEMS - CAR OCCASIONALLY WON'T START NO IGNITION NOISE OR CLICKING AT ALL. I WIGGLE THE SHIFTER AROUND AND EVENTUALLY IT WILL START.  2. RADIO - THE RADIO IS ALWAYS LEFT ON WHEN TURNING OFF THE IGNITION. SOMETIMES IT AUTOMATICALLY GOES ON WHEN STARTING. BUT MOST TIMES IT WILL NOT GO ON UNTIL I TURN IT OFF AND ON AGAIN. THEN THE RADIO WORKS FINE UNTIL THE NEXT TIME THE CAR IS STARTED.  3. REAR SHADE - THE REAR WINDOW SHADE STOPPED WORKING. ONLY MADE A GRINDING NOISE. I WAS ABLE TO GET IT INTO THE DOWN POSITION. I HAVE HIT THE CONTROL BY THE SHIFTER AND THE GRINDING STARTS UP. EVENTUALLY IT STOPS.  4. HEATER - THE HEATER CONTROLS JUST RECENTLY STOPPED WORKING PROPERLY. THE HEAT WORKED INTERMITTENTLY. NOW ONLY COOL AIR OR SLIGHT AMOUNT OF HEAT BLOWS NO MATTER HOW HIGH THE TEMPERATURE SETTING IS.  5. DOOR AND TRUNK LOCKS - WHEN LOCKING DOORS WITH THE KEY FOB THE PASSENGER DOOR AND THE TRUNK OCCASIONALLY DON'T WORK. WHEN I USE THE INTERIOR LOCK SWITCH OR MANUALLY LOCK THE DOOR THEY WILL LOCK PROPERLY.  6. DRIVER SIDE CHAIR HEAT - THE BACK OF THE SEAT NO LONGER HEATS UP. THE SEAT CUSHION STILL HEATS UP. THE PASSENGER SIDE WORKS FINE.  *TR",
        "vin": "KMHFC46F46A"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "01/26/2013",
        "dateOfIncident": "10/18/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10494808,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER'S SEAT MOVES ON IT'S OWN. BACKWARDS AT FIRST. NOW IT TILTS FORWARD TO TO THE STEERING WHEEL. VERY DANGEROUS. A REAL HAZARD.  *TR",
        "vin": "KMHFC46FX6A"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/08/2012",
        "dateOfIncident": "09/08/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10483758,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SEPTEMBER 6, 2012 I BOUGHT A USED 2006 HYUNDAI AZERA FROM SUTTON FORD, LINCOLN, KIA DEALER.  I HAD THE CAR FOR 3 DAYS AND NOTICED THAT THE LIGHTS WOULD DIM ON THE CAR AS WELL AS THE LIGHTS ON THE DASH BOARD TO INCLUDE THE RADIO GOING OFF THE AIR AND COMING BACK ON WHENEVER I HAD TO APPLY THE BRAKES. ON STREETS THAT ARE NOT WELL LIGHTED THE VISIBILITY WAS VERY VERY POOR. THE BACK WINDOW SHADE DOES NOT WORK   WHEN PLACING THE CAR IN REVERSE OR IN THE DRIVE MODE THE MOTOR OPERATING THE SHADE MAKES A NOISE UNTIL I HAVE DRIVEN THE CAR FOR A FEW MINUTES. THE SHADE DOES NOT OPERATE ACCORDING TO THE CAR MANUAL. THIS PROBLEM SHOULD WARRANT A RECALL ON THE VEHICLE. ADDITIONALLY, WHENEVER THE LIGHTS DIM AND I AM APPROACHING ANOTHER VEHICLE IN ONCOMING  TRAFFIC AND HAVING TO STOP AT A STOP SIGN OR A TRAFFIC LIGHT I AM NOT COMFORTABLE   BECAUSE I DO NOT WANT THE OTHER DRIVER THINKING I AM FLASHING MY LIGHTS AT THEM.  *TR",
        "vin": "KMHFC46F16A"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "10/22/2012",
        "dateOfIncident": "10/22/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10481438,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI AZERA. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, THE DRIVER'S SEAT BEGAN TO INDEPENDENTLY MOVE FORWARD UNTIL THE CONTACT WAS PINNED AGAINST THE STEERING WHEEL. THE FAILURE RECURRED NUMEROUS TIMES. THE DEALER WAS NOTIFIED OF THE ISSUE AND ADVISED THE CONTACT THAT THEY COULD REPLACE THE SEAT BUT THEY COULD NOT GUARANTEE THAT THE FAILURE WOULD NOT RECUR. THE MANUFACTURER WAS NOTIFIED BUT OFFERED NO ASSISTANCE. THE VEHICLE WAS NOT REPAIRED. THE VIN WAS UNAVAILABLE. THE FAILURE MILEAGE WAS 70,000 AND THE CURRENT MILEAGE WAS 87,000.",
        "vin": "KMHFC46F46A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/10/2012",
        "dateOfIncident": "02/01/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10474546,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2006 HYUNDAI AZERA HAS BEEN TO THE DEALERSHIP NO LESS THAN 12 TIMES, BEFORE AND AFTER A PERTINENT RECALL REPAIR, FOR AN ISSUE WHERE THE \"PASSENGER AIRBAG OFF\" WARNING LIGHT IS ILLUMINATED DESPITE PASSENGERS OF VARIOUS HEIGHTS AND WEIGHTS BEING SEATED IN THE PASSENGER SEAT.  MY NEAREST HYUNDAI DEALERSHIP HAS FAILED TO CORRECT THIS CRITICAL SAFETY ISSUE ON COUNTLESS OCCASIONS, INCLUDING REPLACING THE ENTIRE PASSENGER SEAT BOTTOM.  THE LAST FEW ATTEMPTED REPAIRS CONSISTED OF \"REPROGRAMMING\" THE SENSORS IN THE PASSENGER SEAT; RESETTING THE ERROR CODE AND SENDING ME AWAY IN A VEHICLE WITH DEFECTIVE 'ADVANCED AIRBAGS' WHICH DO NOT MEET THE NHTSAS REGULATORY DEFINITION.  THE ISSUE IS PRESENT IN A MAJORITY OF HYUNDAI MODELS THAT USE THEIR PROPRIETARY OCS SYSTEM, BUT NARROWLY-APPLIED SETTLEMENTS OF LITIGATION HAVE PREVENTED THIS FROM EVOLVING INTO A CLASS SETTLEMENT, AND GREATLY REDUCED THE ABILITY OF CONSUMERS TO HAVE THEIR PROBLEMS ADDRESSED.  VEHICLE OWNERS THAT DON'T QUALIFY UNDER THE RECENT (JULY 28, 2012) SANTA FE RECALL ARE AGAIN BEING DENIED THE FEDERALLY MANDATED REQUIREMENT OF A FUNCTIONAL ADVANCED AIRBAG SYSTEM. *TR",
        "vin": "KMHFC46FX6A"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/10/2012",
        "dateOfIncident": "06/12/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10470190,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE BLEW AT 81,000 MILES IN A WELL MAINTAINED VEHICLE  NO WARNING LIGHTS EVER CAME ON.  HYUNDAI CORP AND CUSTOMER SERVICE TOOK NO OWNERSHIP FOR THIS PROBLEM.  NO CHOICE BUT TO PURCHASE A REFURBISHED ENGINE.  THE VEHICLE HAD BEEN IN FOR ROUTINE SERVICE 2 WEEKS EARLIER AND NO PROBLEMS DETECTED.  VERY UNHAPPY WITH THIS PRODUCT AND THE LAST OF RESPONSIBILITY BY HYUNDAI CORP.  *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "07/31/2012",
        "dateOfIncident": "06/16/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10468386,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED 2006 HYUNDAI AZERA NEW FROM RELIABLE HYUNDAI, 438 S. INGRAM MILL ROAD, SPRINGFIELD, MO 65802. SINCE PURCHASE WE HAVE EXPERIENCED A HISTORY OF PROBLEMS WITH THE AIR BAG SYSTEM THAT CONTINUE TO THIS DAY. SUMMARY OF SERVICE (NOT AN ALL INCLUSIVE SERVICE HISTORY.  2009 JUNE 16 AIR BAG LIGHT IS ON. ALL CHECKS FINE. CLEARED AIR BAG SYSTEM.  2009 JULY 07 AIR BAG LIGHT IS ON. REPLACED THE ENTIRE SEAT BOTTOM TO GET A NEW PODS SYSTEM 0.7 CLEARED ALL CODES.  2009 JULY 24 AIR BAG LIGHT IS ON. B1495 SEAT BELT TENSIONER DEFECT. ONE WAS NOT MAKING GOOD CONNECTION CODE AND NO DTC'S PRESENT. COVERS COMING OFF OF SEAT WHERE THEY HAD WORKED PRIOR.  2009 AUGUST 05 AIR BAG LIGHT IS ON. FAULTY SEAT BOTTOM AND PASSENGER SIDE SEATBELT ASSEMBLE. REPLACED BOTH CHECKS.  2010 APRIL 27 PERFORM SEAT BELT RECALL 094.  2010 DECEMBER 02 PASSENGER SIDE SEAT BACK WRONG CLOTH ON BOTTOM. REMOVED AND INSTALLED SEAT BACK COVER THAT MATCHES DRIVER SIDE   2011 APRIL 27 AIR BAG CLOTH ON A PILLAR ON DRIVERS SIDE FRONT IS FRAYING.(DAMAGE WAS DONE AT A PRIOR SERVICE VISIT).  2012 JULY 19 AIR BAG LIGHT IS ON, HAS BEEN ON SEVERAL TIMES BEFORE. B1701 DRIVERS BUCKLE HIGH RESISTANCE; RELIABLE CLAIMS WE, THE OWNERS, ARE RESPONSIBLE FOR THIS REPAIR. WE FEEL THE REPAIR COSTS ARE NOT OUR RESPONSIBILITY. MULTIPLE CALLS TO THE 800 NUMBER PROVIDED WITH NO SATISFACTION.  *TR",
        "vin": "KMHFC46F66A"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/26/2012",
        "dateOfIncident": "01/29/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10467801,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI AZERA. THE CONTACT WAS DRIVING 35 MPH WHEN BOTH HEADLIGHTS BEGAN TO DIM ABNORMALLY. THE VEHICLE WAS TAKEN TO THE DEALER ON SEVERAL OCCASIONS WHO ADVISED THAT THERE WERE NO FAILURES FOUND WITHIN THE VEHICLE. THE DEALER HAD KEPT THE VEHICLE FOR FURTHER INSPECTION BUT WAS STILL UNABLE TO DIAGNOSE A FAILURE. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 41,000.     UPDATED 9/25/12 *CN  THE CONSUMER STATED THE HEADLIGHTS STILL DIM AT NIGHT, INTERMITTENTLY. UPDATED 10/04/14",
        "vin": "KMHFC46F56A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/23/2012",
        "dateOfIncident": "03/25/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10467057,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI AZERA. THE CONTACT STATED THAT THE AIR BAG LIGHT CONSTANTLY ILLUMINATED. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER AND THE VEHICLE WAS REPAIRED UNDER THE RECALL ASSOCIATED WITH NHTSA CAMPAIGN ID NUMBER 09V497000 (AIR BAGS:FRONTAL). APPROXIMATELY TWO YEARS LATER, THE FAILURE RECURRED. THE MANUFACTURER AND DEALER OFFERED NO ASSISTANCE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 51,653.   UPDATED 8/6/12 *CN  UPDATED 08/14/2012  *JS  UPDATED 08/16/12*LJ   UPDATED 10/10/12 *CN UPDATED 10/10/2012 *JS",
        "vin": "KMHFC46FX6A"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/12/2012",
        "dateOfIncident": "05/15/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10465356,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI AZERA. THE CONTACT STATED THAT WHILE PARKED, THE VEHICLE WOULD NOT START. THE DRIVER OF THE VEHICLE WAS ABLE TO RESTART THE VEHICLE, BUT THE VEHICLE STALLED SHORTLY AFTER. THE VEHICLE WAS NOT TAKEN TO THE DEALER FOR A DIAGNOSTIC TEST. THE CONTACT STATED THAT THE DOOR LOCKS WOULD NOT FUNCTION AND THE SUN-SHADE ACTIVATED ON ITS OWN. IN ADDITION, THE POWER SEAT WOULD NOT FUNCTION AND THE LIGHTS ON THE INSTRUMENT PANEL FLICKERED. ALSO, THE AIR CONDITIONER'S TEMPERATURE DECREASED ON ITS OWN. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 56,000.",
        "vin": "KMHFC46F26A"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/27/2012",
        "dateOfIncident": "04/27/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10463318,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE CAR AT VARIOUS SPEEDS THE ESC LIGHT WILL COME ON AND THE DASH WILL READ \"ESC OFF\" AND THE CAR WILL NOT FUNCTION;LOOSES ALL POWER. NO STEERING CONTROL, NO RADIO, NO LIGHTS, NO BRAKES, THE CAR LOOSES ALL FUNCTIONING ABILITY. I HAVE TO PULL OFF THE ROAD, TURN THE SWITCH OFF, WAIT 5 TO 10 MINUTES AND THEN THE CAR WILL START AND RUN UNTIL IT HAPPENS AGAIN. NO PATTERN TO THIS PROBLEM. THIS CAR HAS HAD MULTIPLE ELECTRICAL PROBLEMS SINCE WE PURCHASED IT IN 2008. HARMONIC BALANCER REPLACED, START SENSOR REPLACED, CAM SENSOR REPLACED, THE SHIFTER WILL NOT WORK WITHOUT PUSHING IN THE SAFETY RELEASE, AND THE LIGHTS CUT ON/OFF ALL THE TIME. VERY UNSAFE AND UNRELIABLE VEHICLE.  *TR",
        "vin": "KMHFC46F56A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/23/2012",
        "dateOfIncident": "05/01/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10459459,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI AZERA. THE VEHICLE WAS INCLUDED AND REPAIRED UNDER NHTSA CAMPAIGN ID NUMBER: 10V007000 (AIR BAGS:FRONTAL). AFTER THE REPAIR, THE AIR BAG WARNING LIGHT ILLUMINATED ON THE INSTRUMENT PANEL. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSTIC TESTING. THE TECHNICIAN ADVISED THE CONTACT THAT THE ELECTRONIC CONTROL UNIT AND THE FRONT PASSENGER SIDE SEAT BELT TENSION SENSOR ASSEMBLY WOULD HAVE TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 145,565.",
        "vin": "KMHFC46F16A"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/09/2012",
        "dateOfIncident": "02/20/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10457918,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I STARTED THE VEHICLE WHEN IT WAS COLD OR WHEN IT HAD LESS THAN A HALF A TANK IN GAS THE CHECK ENGINE LIGHT AND ESC LIGHT WOULD COME ON. I WOULDN'T BE ABLE TO DRIVE THE VEHICLE. IT WAS AS IF THE VEHICLE WAS IN NEUTRAL. I WOULD PUSH THE GAS PEDAL AND NOTHING, IT WOULD NOT REV. THIS HAS NOW HAPPENED ON SEVERAL OCCASIONS. I WOULD HAVE TO CONTINUE TO TURN OFF AND ON THE VEHICLE UNTIL THE ESC LIGHT WOULD TURN OFF AND THE CAR WOULD REV ON IT OWN.   *TR",
        "vin": "KMHFC46F86A"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/29/2012",
        "dateOfIncident": "02/15/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10456816,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TRIP COMPUTER RETURNS TO 00 WITHOUT TOUCHING RESET BUTTON, DOOR LOCK SOMETIMES DOES NOT OPEN WITH TRANSMITTER.  TRUNK SOMETIMES DOES NOT OPEN WITH TRANSMITTER OR INTERIOR TRUNK RELEASE.. RADIO CUTS OFF INTERMITTENTLY.  INSTRUMENT PANEL LIGHT FLICKERS, AND ENGINE WILL STALL FOR AN INSTANT. BACK WINDOW SCREEN GOES UP AND DOWN BY ITSELF.  AIR CONDITIONER CAME ON WITHOUT MY PUSHING BUTTON. WARNING MESSAGES WILL APPEAR FOR FEW SECONDS \"CHECK ENGINE\", \"ABS FAILURE\", ETC. TWICE TOOK CAR TO HYUNDAI SERVICE DEPARTMENT.  TOLD THEY CANNOT FIX ANYTHING UNLESS THESE EVENTS ARE HAPPENING WHEN I BRING IN CAR. ASIDE FROM THESE FAIRLY MINOR PROBLEMS, THE STEERING WHEEL LOCKED OR POWER STEERING FAILED WHILE DRIVING..  THE SERVICE DEPARTMENT DID FIND AN OIL LEAK AND REPLACED HOSE.  REPLACED FUEL LEVEL SENDER AND DRIVER DOOR MODULE. BUT THE ELECTRIC PROBLEMS CONTINUE..  I AM WORRIED THAT ELECTRIC AND STEERING PROBLEMS WILL CAUSE A SERIOUS ACCIDENT.  *TR",
        "vin": "KMHFC46FX6A"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "04/26/2012",
        "dateOfIncident": "04/17/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10456598,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI AZERA. THE CONTACT STATED THAT THAT THE FRONT PASSENGER SEAT BELT WARNING LIGHT WAS ILLUMINATED. AFTER CALLING THE DEALER, THE CONTACT WAS INFORMED THAT THE VEHICLE WAS NOT INCLUDED IN THE RECALL ASSOCIATED WITH NHTSA CAMPAIGN ID NUMBER: 09V497000 (SEAT BELTS:FRONT). THE VEHICLE WAS NOT SERVICED. THE CURRENT AND FAILURE MILEAGES WERE 74,000.",
        "vin": "KMHFC46F56A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/25/2012",
        "dateOfIncident": "04/12/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10456448,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "RECEIVED A LETTER FROM HYUNDAI IN 2010 ADVISING OF DAMAGE TO THE RIGHT FRONT SEAT BELT SENSOR WIRING WHICH IF BECOMES DAMAGED WILL CAUSE THE AIR BAG WARNING LIGHT TO ILLUMINATE. IF THIS PROBLEM PERSISTS THE PASSENGER AIR BAG WILL NOT DEPLOY IN A CRASH.  ON 07/21/2010 THIS WAS SUPPOSEDLY FIXED BY THE DEALERSHIP.  ON 01/26/12 THE AIR BAG WARNING ILLUMINATED I RETURNED TO THE DEALERSHIP AND WAS TOLD THAT THE REPAIR WOULD BE MY RESPONSIBILITY AS IT HAD ALREADY BEEN REPAIRED.  ON O4/12/12 I RETURNED TO THE DEALERSHIP TO HAVE THE REPAIR MADE AND WAS THEN TOLD THE THE PROBLEM WAS IN WAS AN INTERNAL SHORT IN THE PASSENGER  SEAT TRACK.  HYUNDAI IS CLAIMING NO RESPONSIBILITY FOR THE REPAIR AND STATED THAT IT IS MY PROBLEM. I FEEL THAT THIS IS A  DETERIOATION OF THE INITIAL RECALL AND SHOUD BE REPAIRED BY HYUNDAI SINCE THE PART WAS DEFECTIVE.  *TR",
        "vin": "KMHFC46F56A"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "04/17/2012",
        "dateOfIncident": "01/02/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10455566,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI AZERA. THE CONTACT STATED THAT THE SRS WARNING LIGHT WAS ILLUMINATED. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THE CONTACT WAS ADVISED THAT THE FRONT PASSENGER SEAT BELT NEEDED TO BE REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE WHO DID NOT OFFER ANY ASSISTANCE SINCE THE VEHICLE WAS SERVICED FOR THE SAME FAILURE ONE YEAR PRIOR TO THE RECENT FAILURE (NHTSA CAMPAIGN ID NUMBER: 09V497000-SEAT BELTS:FRONT). THE VEHICLE WAS NOT FURTHER REPAIRED. THE FAILURE MILEAGE WAS 50,000 AND THE CURRENT MILEAGE WAS 71,000.",
        "vin": "KMHFC46FX6A"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/16/2012",
        "dateOfIncident": "02/01/2006",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10452033,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I  HAVE BEEN DISAPPOINTED WITH MY AZERA'S HEADLIGHTS ON LOW BEAM SINCE IT WAS NEW!  I MENTIONED IT TO MY DEALER'S SERVICE WRITER SOME TIME AFTER I NOTICED MANY OTHER OWNERS WERE COMPLAINING ABOUT THE SUDDEN BLACK AREA VERY CLOSE TO THE FRONT OF THE CAR!  HE SEEMED IGNORANT OF THE COMPLAINT.  I HAVE SINCE TRIED TO GET HOME BEFORE DARK AS MY HOME IS ON A WINDING PART OF HWY 101 ON THE OLYMPIC PENINSULA IN WASHINGTON.  THE HEADLIGHT FIXTURE DEFINITELY SHOULD BE REPLACED!  *TR",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/14/2012",
        "dateOfIncident": "02/22/2006",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10447891,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "VISIBILITY IS GREATLY IMPAIRED WHEN USING LOW BEAM HEADLIGHTS. DISTINCT HORIZONTAL \"SHADOW LINE\" MAKES DRIVING DIFFICULT AND DANGEROUS DUE TO LACK OF VISIBILITY. I HAVE ADJUSTED THE HEADLIGHTS UPWARD AS FAR AS I CAN SAFELY GO BUT, THIS DID NOT ELIMINATE THE PROBLEM. HYUNDAI CLAIMS EVERYTHING IS \"NORMAL\". I HAVE HAD TO LIMIT MY NIGHT DRIVING FOR THE LAST 6 YEARS BECAUSE OF THIS ISSUE.  *TR",
        "vin": "KMHFC46F06A"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "12/12/2011",
        "dateOfIncident": "12/01/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10439361,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI AZERA.  THE CONTACT NOTICED THAT THE AIR BAG WARNING LIGHT WAS ILLUMINATED.  THE DEALER ADVISED THE CONTACT THAT THE SEAT BELT PRE-TENSIONER NEEDED TO BE REPLACED.  THE MANUFACTURER HAD NOT BEEN NOTIFIED OF THE FAILURE.  THE VEHICLE WAS TAKEN TO A PRIVATE MECHANIC WHO CONFIRMED THE FAILURE.  NO REPAIRS WERE PERFORMED.  THE CURRENT MILEAGE WAS 84,600.  THE APPROXIMATE FAILURE MILEAGE WAS 82,000.",
        "vin": "KMHFC46F36A"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/05/2011",
        "dateOfIncident": "09/10/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10438617,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI AZERA. WHILE DRIVING APPROXIMATELY 30 MPH THE CONTACT DEPRESSED THE BRAKE PEDAL AND NOTICED THE LIGHTS ON THE INSTRUMENT PANEL BECAME DIM AS WELL AS ALL OF THE EXTERIOR LIGHTS ON THE VEHICLE. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSTIC TESTING. THE TECHNICIANS WAS UNABLE TO DIAGNOSE THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 83,000.",
        "vin": "KMHFC46F86A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/25/2011",
        "dateOfIncident": "09/02/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10437262,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PROBLEM STARTED IN 2008. THE AIR BAG LIGHT WARNING LIGHT CAME ON AND WE TOOK IT TO THE DEALER. THEY REPLACED THE PASSENGER SEAT. LESS THAN 6 MONTHS LATER THE WARNING LIGHT CAME ON AND THIS TIME THEY REPLACED A WIRING HARNESS. A FEW MONTHS LATER WE RECEIVED A RECALL NOTICE ON THIS SAME PROBLEM. THIS LAST INCIDENT WAS IN 8/2010. NOW IT IS ON AGAIN AND THEY REFUSE TO REPAIR IT UNDER ANY KIND OF WARRANTY. I FEEL THIS A COMPONENT OF THE SAFETY SYSTEM AND CONTINUING FAILURES OF THE SAME PART SHOULD CALL FOR ADDITIONAL RECALLS.  *TR",
        "vin": "KMHFC46F46A"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEATS",
        "crash": false,
        "dateComplaintFiled": "09/14/2011",
        "dateOfIncident": "09/12/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10425412,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "SEVERAL WEEKS AGO I TOOK MY CAR TO THE HYUNDAI DEALER'S SERVICE DEPARTMENT FOR WARRANTY WORK.  OVER THE LAST FEW MONTHS, WHILE PARKED AND UNATTENDED, THE BACK OF THE DRIVER'S SEAT, ON ITS OWN, READJUSTED ITSELF ALL THE WAY FORWARD. THIS HAPPENED ALMOST DAILY. THE DEALER SAID EVERYTHING LOOKED OK AND THEY COULD NOT DETERMINE A CAUSE.  ON 9/12/11 I SAT IN THE DRIVER'S SEAT AS I WAS PREPARING TO LEAVE WORK, AND THE SEAT BACK READJUSTED ITSELF WITH ME IN IT (CAR HAD NOT YET BEEN STARTED).  IT PUSHED ME FORWARD AND UP AGAINST THE STEERING WHEEL.  I WAS UNABLE TO STOP THE MOVEMENT OR READJUST THE BACK UNTIL THE SEAT BACK COMPLETED ITS TREK ALL THE WAY FORWARD.  AFTER THE FIRST TIME, I READJUSTED THE SEAT AND STARTED  DRIVING ON THE BWI PARKWAY AT 55 MPH WHEN THE SEAT BACK DID IT AGAIN, AND AGAIN, AND AGAIN.  I HEADED STRAIGHT FOR THE DEALER AND DURING THE 15 +/- MILES TO THE DEALER, I WAS COMPRESSED AGAINST THE STEERING WHEEL ABOUT 20 MORE TIMES.  I AM 6 FEET TALL AND HAVE LONG LEGS, AND DURING THE TIMES I WAS DRIVING AND COMPRESSED AGAINST THE STEERING WHEEL, IT WAS EXTREMELY DIFFICULT TO MOVE MY FOOT FROM THE ACCELERATOR TO THE BRAKE.  AS A RESULT, AS SOON AS I WOULD FEEL THE SEAT START TO MOVE FORWARD, I HAD TO PULL OVER TO THE SHOULDER OF THE PARKWAY UNTIL THE SEAT STOPPED AND I COULD READJUST THE BACK.  THANKFULLY, THIS TIME WHEN I ARRIVED AT THE SERVICE DEPARTMENT, THE SEAT COMPRESSED THE SERVICE ATTENDANT WHILE HE WAS SITTING IN MY CAR, SO HE COULD SEE THAT THERE IS A PROBLEM! SEVERAL MONTHS AGO WHEN I FIRST NOTICED THE BACK READJUSTING ON ITS OWN, I GOOGLED THE PROBLEM AND DISCOVERED THAT THIS ISSUE WITH AZERAS HAS BEEN ONGOING FOR QUITE SOME TIME. I HOPE THAT IT WILL NOT TAKE SOMEONE GETTING SERIOUSLY HURT OR KILLED BEFORE SOMETHING IS DONE TO MAKE HUYNDAI ACKNOWLEDGE THE PROBLEM. THEY THINK IT IS A SWITCH. WE WILL SEE!  *KB",
        "vin": "KMHFC46F46A"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "09/09/2011",
        "dateOfIncident": "08/24/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10424533,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOOK MY VEHICLE IN TO BE REPAIRED FOR THE RECALL FOR THE AIR BAG SENSOR. THREE MONTHS LATER THE LIGHT CAME ON AGAIN AND I TOOK IT BACK TO HAVE IT EVALUATED AND NOW THEY ARE SAYING THAT IT THE SEAT BELT BUCKLE PRE TENSIONER SENSOR. I SAID TO THEM THAT IT WAS REPAIRED ALREADY AND THEY SAID THAT IT WAS NOT . THROUGH FURTHER INVESTIGATION I FOUND ON A WEB SITE FROM THE HYUNDAI DEALER FOR CAMPAIGN 094 THAT WHEN REPAIRING THE WIRING HARNESS THAT THEY ARE TO LOOK AT THE SENSOR AS WELL AND FIX AT THAT TIME AND SUBMIT A CLAIM FOR THIS. NOW THEY ARE WANTING TO CHARGE ME FOR SOMETHING THAT SHOULD HAVE BEEN REPAIRED IN THE BEGINNING.  *TR",
        "vin": "KMHFC46F06A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "08/29/2011",
        "dateOfIncident": "08/04/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10422372,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI AZERA LIMITED. THE CONTACT WAS DRIVING 10 MPH WHEN HIS FOOT WAS APPLIED TO THE BRAKES AND THE VEHICLE UNEXPECTEDLY ACCELERATED FORWARD. THE FAILURE CAUSED THE VEHICLE TO CRASH INTO FOUR PARKED VEHICLES. THE VEHICLE WAS NOT DESTROYED, AND WAS TOWED TO THE DEALER. THE MANUFACTURER WAS NOTIFIED, BUT THE VEHICLE WAS NOT REPAIRED. THE FAILURE OCCURRED ON THE THREE PREVIOUS OCCASIONS. THE FAILURE AND CURRENT MILEAGE WAS 50,000.    UPDATED 9/20/11 *CN  UPDATED 10/07/11",
        "vin": "KMHFC46F86A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/14/2011",
        "dateOfIncident": "06/10/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10412970,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "LETTER REGARDING A SAFETY ISSUE PERTAINING TO THE AIRBAG LIGHT THAT ILLUMINATED ON THE DASHBOARD OF HIS 2006 HYUNDAI AZERA *TGW  THE CONSUMER STATED THE SEAT BELT ON THE FRONT PASSENGER SIDE NEEDED TO BE REPLACED. HOWEVER, THE CONSUMER WOULD HAVE TO PAY FOR THE LABOR. THE CONSUMER STATED A RECALL WAS ISSUED REGARDING THE AIR BAG PROBLEM AND THEREFORE HE SHOULD NOT BE RESPONSIBLE FOR THE  LABOR.  THE CONSUMER STATED AFTER CHECKING HIS RECORDS, HE REALIZED THE ORIGINAL AIR PART WAS REPLACED IN 2010 BY A DIFFERENT DEALER. THE CONSUMER BELIEVED THE PART THAT WAS REPLACED IN 2010 WAS ALSO DEFECTIVE. *JB",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/22/2011",
        "dateOfIncident": "05/01/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10408556,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI AZERA. WHILE DRIVING  APPROXIMATELY 30 MPH THE HEADLIGHTS BEGAN TO DIM INTERMITTENTLY. THE VEHICLE WAS TAKEN TO THE DEALER AND AN INDEPENDENT MECHANIC FOR DIAGNOSTIC TESTING. THE FAILURE WAS NOT DIAGNOSED BY THE DEALER OR MECHANIC. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 81,000.",
        "vin": "KMHFC46F26A"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "04/08/2011",
        "dateOfIncident": "04/07/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10395292,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 HYUNDAI AZERA. WHILE DRIVING APPROXIMATELY 25 MPH THE CONTACT STATED THAT THE FRONT DRIVERS SEAT RECLINED FORWARD ON ITS OWN. THE DRIVER WAS ABLE TO RECLINE THE SEAT BACK. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS BEING DIAGNOSED. THE VEHICLE WAS NOT REPAIRED. THE VIN WAS UNAVAILABLE. THE APPROXIMATE FAILURE MILEAGE WAS 10,000. UPDATED 04/20/11*LJ",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/16/2011",
        "dateOfIncident": "02/16/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10390352,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI AZERA. THE CONTACT STATED THAT WHEN DRIVING AT ANY SPEED, THE HEADLIGHTS WOULD BEGIN TO DIM ABNORMALLY BEFORE SHUTTING OFF AND WOULD RE-ILLUMINATE INDEPENDENTLY WITHIN A FEW MOMENTS. THE FAILURE RECURRED INTERMITTENTLY AND THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHERE THE CONTACT WAS INFORMED THAT THE FAILURE WAS NORMAL. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 75,000 AND THE CURRENT MILEAGE WAS 77,000.      UPDATED 4/01/11*BF     UPDATED 1/13/2012 *LN  *TR",
        "vin": "KMHFC46F86A"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/16/2011",
        "dateOfIncident": "03/15/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10390453,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHTS DIMMING AND GOING OUT INTERMITTENTLY THAT CAN CAUSE A FATAL ACCIDENT.  WHILE DRIVING AT ANY SPEED, HEADLIGHTS DIM AND DO OUT FOR SECONDS.  I ALMOST HIT A GUARD RAIL ON A CURVE ON THE HIGHWAY.  ONE DEALERSHIP TOLD ME DIMMING WAS NORMAL, ANOTHER SAID I NEED A BATTERY CABLE HARNESS.  THIS APPEARS TO BE AN ELECTRICAL PROBLEM AND THE MANUFACTURER SAID THAT THE HEADLIGHTS ARE OUT OF WARRANTY.  CLEARLY THIS IS SOMETHING THAT SHOULD BE INVESTIGATED TO SEE IF THERE ARE MORE PROBLEMS THAT HAVE NOT BEEN REPORTED.  IT APPEARS THAT THERE WERE SOME RECALLS DUE TO HEADLIGHT PROBLEMS BUT NO MAILINGS WENT OUT.  CAN YOU PLEASE INVESTIGATE THIS PROBLEM?  *TR",
        "vin": "KMHFC46F86A"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/14/2011",
        "dateOfIncident": "01/15/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10383543,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THUMPING LOOSE NOISE COMING FROM FRONT SUSPENSION MAINLY AT SPEEDS LESS THAN 40 MILES PER HOUR. OFFICIALLY HYUNDAI SAYS THIS IS NOT A PROBLEM BUT MY SOURCES TELL ME THAT THE HYUNDAI ENGINEERS ARE WELL AWARE OF THE PROBLEM,KNOW HOW TO REMEDY PROBLEM BUT WANTS TO KEEP IT ALL HUSH HUSH BECAUSE THE FIX IS TO EXPENSIVE MEANWHILE OWNERS SIMPLY HAVE TO SUFFER THROUGH THIS ANNOYANCE EVERY DAY IN FEAR THAT EVENTUALLY SOMETHING IS GOING TO BREAK AND POSSIBLE CAUSE AN ACCIDENT, CAN YOU PLEASE HELP US WITH THIS DAILY NOISE AND SAFETY ISSUE. I DO NOT WISH TO BRING HARM TO MY SELF, MY FAMILY OR ANY ONE ELSE AS A RESULT OF THIS PROBLEM. THANKING YOU IN ADVANCE FOR YOUR SPEEDY ATTENTION TO THIS CRITICAL MATTER.",
        "vin": "KMHFC46F76A"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/31/2011",
        "dateOfIncident": "01/29/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10379692,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI AZERA. WHILE PARKED, THE CONTACT TRIED TO TURN THE IGNITION ON AND IT WOULD NOT RESPOND. THE CONTACT STATED THAT THE CHECK ENGINE LIGHT WAS ILLUMINATED ON THE INSTRUMENT PANEL. THE VEHICLE WAS TOWED TO THE DEALER WHERE THE TECHNICIANS RELOADED SOFTWARE ON THE COMPUTER. THE VEHICLE WAS REPAIRED UNDER WARRANTY. THE APPROXIMATE FAILURE MILEAGE WAS 46,000.",
        "vin": "KMHFC46F56A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/26/2010",
        "dateOfIncident": "05/15/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10362440,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "SPLIT DASHBOARD COVER ON 2006 HYUNDAI AZERA. STARTED TO SPLIT AT 58K MILES AND A SECOND SPLIT HAS DEVELOPED AT 74K MILES. SPLITS ARE JUST ABOVE THE AIRBAG. *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/19/2010",
        "dateOfIncident": "10/03/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10361135,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING EAST BOUND ON I-90 PASSING WHEN THE CAR ACCELERATED ON ITS OWN. I APPLIED BRAKES (TIL SMOKING) BROUGHT THE CAR TO THE RIGHT SHOULDER AND TURNED THE ENGINE OFF. I CALLED FOR A TOW AND HAD THE CAR TAKEN TO THE CLOSEST DEALERSHIP. *TR",
        "vin": "KMHFC46F56A"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,INTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/15/2010",
        "dateOfIncident": "10/01/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10360629,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 HYUNDAI AZERA LIMITED - I HAVE A PROBLEM WITH THE HEAD LIGHTS AND DASH BOARD LIGHTS DIMMING ON AND OFF RANDOMLY FOR ABOUT ONE YEAR NOW. THE PROBLEM DOES NOT HAPPEN IF YOU ARE ON THE HIGHWAY GOING ABOUT 60+ MPH. I'VE BROUGHT MY CAR INTO 3 DEALERSHIPS. THE 1ST DEALER SAID IT WAS THE BATTERY HARNESS WHICH THEY CHANGED AND DIDN'T SOLVE THE PROBLEM. THEY ALSO WANTED TO SELL ME A NEW BATTERY. THE 2ND ONE SAID THEY'LL NEVER FIND THE PROBLEM AND SAVE MY MONEY AND TAKE MY WIFE OUT TO LUNCH OR TRADE THE CAR IN, AND THE 3RD DEALER SAID THEY HEARD ABOUT THE PROBLEM AND FIXED IT ONCE BUT CAN'T REMEMBER HOW. THE PROBLEM IS A SAFETY HAZARD AND HYUNDAI SHOULD FIND A FIX. *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/13/2010",
        "dateOfIncident": "09/03/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10359850,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 HYUNDAI AZERA. CONSUMER STATES VEHICLE HAS AN ELECTRICAL PROBLEM AND LURCHES FORWARD DURING DOWNSHIFTS *TGW  THE CONSUMER STATED WHILE DRIVING AT NIGHT, THE HEADLIGHTS AND DASH BOARD LIGHTS WOULD FLICKER ON AND OFF, RANDOMLY.  ALSO, THE VEHICLE WOULD LURCH AT TIMES AS IT DOWNSHIFTED. IT WOULD HESITATE, THEN JERK FORWARD. *JB  THE CONSUMER STATED THE PROBLEM WAS CORRECT BY HYUNDAI, BUT IT HAS SINCE RETURNED. UPDATED 09/06/11",
        "vin": "KMHFC46F86A"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/04/2010",
        "dateOfIncident": "08/14/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10359087,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI AZERA. THE CONTACT STATED THAT THE LOW BEAM HEADLIGHTS WOULD ONLY ILLUMINATE UP TO 5 FEET AHEAD OF THE VEHICLE. THE DEALER ATTEMPTED TO REPAIR THE LIGHTS FOUR TIMES TO NO AVAIL. THE CONTACT REFERENCED NHTSA CAMPAIGN ID NUMBER: 08E021000 (EXTERIOR LIGHTING:HEADLIGHTS). THE MANUFACTURERS REGIONAL MANAGER WAS SENT TO FURTHER INSPECT THE FAILURE YET THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 10,000 AND THE CURRENT MILEAGE WAS 18,000.",
        "vin": "KMHFC46FX6A"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "09/28/2010",
        "dateOfIncident": "09/25/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10358003,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING OR PARKED THE DRIVER SIDE SEAT BACK MOVES FORWARD PUSHING THE DRIVE TOWARD THE STEERING WHEEL. FIRST STARTED DEC.2009 AND WAS RANDOM. TO IT TO THE DEALER AND THEY STATED THEY REPLACED DRIVERS POWER SEAT SWITCH. AT THIS DATE IT IS HAPPENING SO OFTEN IT'S UNSAFE TO DRIVE. I WILL SCHEDULE A VISIT TO THE DEALER. *TR",
        "vin": "KMHFC46F76A"
    },
    {
        "components": "EXTERIOR LIGHTING,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "08/17/2010",
        "dateOfIncident": "02/17/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10350047,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2006 HYUNDAI AZERA AND I HAVE BEEN SO CONCERNED ABOUT THE DRIVER'S SIDE HEADLIGHTS.  THEY DO NOT PROJECT OUT PROPERLY.  THERE IS A VERY, VERY NOTICEABLE SHADOW CAUSING A TOTALLY UNLIT PART OF THE ROAD.  I HAVE SEEN OVER 23 COMPLAINTS ON THIS YEAR MODEL AND MAKE OF CAR ON ONE SITE.  THERE HAS TO BE SOMETHING THAT CAN BE DONE TO ELIMINATE THIS VISION PROBLEM.  THERE HAVE BEEN REPORTED ACCIDENTS BECAUSE OF THIS PROBLEM AND I FEAR THERE WILL BE MANY MORE  ACCIDENTS BECAUSE OF THIS DEFECT.  IT IS MY UNDERSTANDING THE DEALERS AND HYUNDAI ARE VERY MUCH AWARE OF THIS PROBLEM, BUT REFUSE TO CORRECT IT. *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/29/2010",
        "dateOfIncident": "07/28/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10346078,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "HYUNDAI HAS AN ISSUE WITH FAULTY THROTTLE POSITION SENSORS WHICH CAUSES THE CAR'S ENGINE TO STUMBLE AND THEN SWITCH INTO \"LIMP HOME\" MODE. THIS MODE ONLY ALLOWS A TOP SPEED OF 20MPH WITH VERY LITTLE ACCELERATION POWER.     THIS PROBLEM OCCURS WHEN YOU ARE DEPRESSING THE GAS PEDAL, SUCH AS PULLING OUT INTO TRAFFIC OR MERGING INTO TRAFFIC.    THIS IS A SERIOUS SAFETY ISSUE THAT COULD LEAD TO CRASHES, AS THE CAR WILL NOT ACCELERATE AS IT IS SUPPOSED TO.    CURRENTLY, HYUNDAI HAS ISSUED TSB 09-FL-003-2, BUT WILL ONLY COVER THE REPAIR COSTS IF THE CAR IS UNDER WARRANTY.    BEING A SERIOUS SAFETY ISSUE, I FEEL THAT THEY SHOULD BE REQUIRED TO RECALL THESE VEHICLES AND REPLACE DEFECTIVE SENSORS. *TR",
        "vin": "KMHFC46F76A"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "06/23/2010",
        "dateOfIncident": "06/13/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10339799,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING OUR 2006 HYUNDAI AZERA ON ROUTE 81 SOUTH THE DRIVERS SEAT STARTED MOVING FORWARD ON IT'S OWN. I COULD NOT STOP IT. THE SEAT PINNED ME AGAINST THE STEERING WHEEL.ALSO THE BACK OF THE SEAT ALSO MOVE FORWARD AND ESSENTIALLY PINNED ME AGAINST THE STEERING WHEEL. I COULD NOT GET THE SEAT TO GO BACK FOR ABOUT A MINUTE AND A HALF. I GOT THE SEAT TO RESET AND IT DID THE SAME THING A COUPLE MINUTES LATER. THIS IS VERY DANGEROUS AND ONLY THE FACT THAT I AM A VERY EXPERIENCED DRIVER AVOIDED A CATASTROPHIC HIGH SPEED ACCIDENT. FUCCILLO HYUNDAI OF SYRACUSE REPLACED THE SWITCH AND CHARGED US $ 202.56 I CONTACTED HYUNDAI CORPORATE AND REPORTED WHAT HAD HAPPENED AND REQUESTED REIMBURSEMENT THEY REFUSED SAYING THE CAR HAD 109000 MILES ON IT; I BELIEVE THAT THIS IS A LATENT SAFETY DEFECT AND THIS SHOULD BE FIXED AT NO CHARGE.YOU NEED TO REMEMBER THAT I COULD NOT STOP THE SEAT FROM MOVING NO MATTER HOW MANY TIMES I TRIED TO ACTIVATE SWITCH. THE ONLY WAY I COULD STOP THE SEAT FROM PINNING ME AGAINST THE STEERING WHEEL WAS TO REMOVE THE FUSE. *TR",
        "vin": "KMHFC46F66A"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/29/2010",
        "dateOfIncident": "01/15/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10328124,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE OWNED MY2006 HYUNDAI AZERA FOR OVER 3 YEARS,AND HAVE COMPLAINED REGULARLY TO BOTH THE DEALER AND HYUNDAI THAT THE LOWBEAM HEADLIGHTS WERE A SAFETY PROBLEM. THEY FAIL TO THROW ENOUGH LIGHT TO ILLUMINATE ENOUGH OF THE ROADWAY AHEAD TO SEE SAFELY. 3 YEARS AGO THE DEALER CHECKED THE ALIGNMENT,AND SAID THEY WERE ADJUSTED TO THE MFG. SPEC'S, AND COULDN'T BE IMPROVED ON. TODAY HYUNDAI TOLD ME THEY WOULD NOT DEAL WITH IT. THE DEALER WILL NOT DEAL WITH IT EITHER. I ALSO HAVE ANOTHER NEWER MODEL AZERA, THAT HAS GREAT LOWBEAM HEADLIGHTS.   I FEEL THIS IS A MAJOR SAFETY FACTOR, AND THE MGR. NEEDS TO COME UP WITH A SOLUTION. I HAVE FOUND MANY OTHER OWNERS OF 2006 AZERA'S WHO HAVE BEEN COMPLAINING ABOUT THIS SAME PROBLEM.   I USE MY HI-BEAMS WHEN I CAN, BUT NORMALLY I CANNOT DRIVE WITH THEM ON WITH ANY TRAFFIC. THERE ARE SEVERAL HYUNDAI OWNER WEBSITES, ALL OF WHICH DEAL WITH THIS PROBLEM, AND THEY CANNOT GET ANY SATISFACTION FROM HYUNDAI TO SOLVE THE PROBLEM. *TR",
        "vin": "KMHFC46F76A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/26/2010",
        "dateOfIncident": "04/25/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10327592,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 HYUNDAI AZERA. THE CONTACT STATED THAT WHILE DRIVING AT APPROXIMATELY 30 MPH, THE SIDE CURTAIN AIR BAG SUDDENLY DEPLOYED. AFTER THE DEPLOYMENT, THE AIR BAG AND TRACTION CONTROL LIGHTS ILLUMINATED ON THE INSTRUMENT PANEL. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALERSHIP WHERE SHE WAS INFORMED THAT THE FAILURE WAS CAUSED BY A PROBLEM WITH THE AIR BAG AND INSTRUCTED TO CALL THE MANUFACTURER. THE CONTACT CALLED THE MANUFACTURER AND WAS INFORMED THAT THE FAILURE WAS DUE TO A COLLISION SENSOR AND THEY COULD OFFER NO ASSISTANCE BECAUSE THE SENSOR INDICATED THAT THE VEHICLE HAD BEEN IN A COLLISION. THE CURRENT AND FAILURE MILEAGES WERE APPROXIMATELY 48,000.",
        "vin": "KMHFC46FX6A"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/25/2010",
        "dateOfIncident": "03/02/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10322136,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 HYUNDAI AZERA. WHILE THE CONTACT WAS DRIVING APPROXIMATELY 35 MPH THERE WAS AN ELECTRICAL SYSTEM FAILURE. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER ON TWO SEPARATE OCCASIONS FOR THE IDENTICAL FAILURE. THE SERVICE REPAIRS PERFORMED ON THE VEHICLE WERE AT DIFFERENT TIMES WHICH CONSIST OF A FUSE AND WIRING REPLACEMENT. THE FAILURE CONTINUED AFTER THE FUSE REPLACEMENT. THE TECHNICIAN ADVISED THE CONTACT TO USING THE CELL PHONE ADAPTER IN THE VEHICLE WHICH COULD POSSIBLY CONTRIBUTE TO THE FAILURE. THE FAILURE MILEAGE WAS 20,000. THE CURRENT MILEAGE WAS 34,000.",
        "vin": "KMHFC46F96A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/15/2010",
        "dateOfIncident": "01/04/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10320029,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG LIGHT STAYS ON.  DO NOT KNOW IF AIR BAGS WILL DEPLOY    CAR HAS BEEN AT DEALERSHIP FOR OVER 3 WEEKS.  RECALL NOTICE RECEIVED ABOUT 2 WEEKS AGO, YET THEY ARE UNABLE TO GET PART. *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/12/2010",
        "dateOfIncident": "01/28/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10319256,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI AZERA. THE CONTACT STATED THAT WHENEVER THE CELLULAR PHONE CHARGER WAS PLUGGED INTO THE CIGARETTE LIGHTER, THE VEHICLE WOULD LOSE POWER AND STALL. THERE WERE NO RECALLS ON THE VEHICLE. THE VIN WAS NOT AVAILABLE AT THE TIME OF THE COMPLAINT. THE FAILURE MILEAGE WAS 28,000 AND THE CURRENT WAS 36,000.",
        "vin": ""
    },
    {
        "components": "AIR BAGS,SEAT BELTS,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "03/10/2010",
        "dateOfIncident": "09/26/2006",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10318736,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Kia Motors America",
                "productMake": "HYUNDAI",
                "productModel": "SEAT BELT",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "I HAVE OWNED MY 2006 HYUNDAI AZERA SINCE 9/06. FROM THE BEGINNING MY COMPLAINT TO THEM HAS BEEN THE PASSENGER AIR BAG WOULD NOT ENGAGE WHEN I WAS SITTING AS A PASSENGER. I AM PETITE BUT THE ANSWER OF \"YOU ARE JUST TOO THIN\" WAS REALLY NOT THE PROFESSIONAL ANSWER I WAS SEARCHING FOR. THIS ALSO HAS HAPPENED WHEN MY 16 YEAR OLD 180LBS SON WAS MY PASSENGER. IN 1997, I WAS INVOLVED IN A HEAD ON COLLISION WITH A DRUNK DRIVER. I WAS VERY ADAMANT WITH THE SERVICE DEPT ABOUT THIS ISSUE AS I KNOW MY AIR BAG DEPLOYMENT SAVED ME IN THAT CRASH. WHEN DID HYUNDAI KNOW THIS WAS A PROBLEM WITH THE AZERA DURING THE YEARS THEY WERE TELLING ME I DID NOT WEIGH ENOUGH. WHAT WILL I BE BEFORE THIS GETS FIXED, IF THEY ARE BETTER THAN TOYOTA AT THAT, OR, IF I AM INVOLVED IN ANOTHER INNOCENT ACCIDENT? I JUST DON'T THINK THIS RECENTLY DISCOVERED AS IT HAS BEEN HAPPENING TO ME SINCE 2006. I FEEL AS IF MY LIFE HAS BEEN ARBITRARILY IGNORED FOR THE PAST 4 YEARS AND THAT IS WRONG. *TR",
        "vin": "KMHFC46F76A"
    },
    {
        "components": "EXTERIOR LIGHTING,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/09/2010",
        "dateOfIncident": "02/08/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10308161,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2006 HYUNDAI AZERA 4 DOOR.  THE FRONT HEADLAMPS DO NOT REFLECT OUT SUFFICIENTLY.  THE DRIVER SIDE LAMPS REFLECT DOWN AND CREATE A SEVERE BLIND SPOT  AND EXTREMELY POOR VISIBILITY.   I  TOOK VEHICLE TO A LOCAL HYUNDAI  DEALER AND WAS TOLD NOTHING CAN BE DONE TO CORRECT THIS SAFETY HAZARDOUS.  I WENT ON LINE YESTERDAY AND DISCOVERD THERE IS A RECALL FOR THIS PROBLEM  WHAT CAN I DO TO HAVE THIS PROBLEM WITH MY VEHICLE REPAIRED?  ALSO, I SAW MY MODEL VEHICLE HAS BEEN RECALLED FOR A MALFUNCTIONING STOP LAMP SWITCH.  AND,  THE WIRING HARNESS FOR THE RIGHT FRONT SEAT BELT TENSION SENSOR HAS A DEFECT WHICH CAN PREVENT THE AIR BAG FROM DEPLOYING IN THE EVENT OF A CRASH.  HOW DO I GET THESE DEFECTS ON MY AUTO CORRECTED? *TR",
        "vin": "KMHFC46F76A"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/01/2010",
        "dateOfIncident": "10/14/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10303562,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 HYUNDAI AZERA. WHILE DRIVING AT NIGHT APPROXIMATELY 60 MPH ON NORMAL ROAD CONDITIONS. SUDDENLY, BOTH HEADLIGHTS BECAME DIM WITHOUT WARNING. THE DRIVER EXPERIENCED LIMITED VISIBILITY. THE VEHICLE WAS ABLE TO RESUME NORMAL OPERATION. WHENEVER THE VEHICLE WAS IN OPERATION THE FAILURE OCCURRED INTERMITTENT. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER FOR INSPECTION. THE TECHNICIAN WAS UNABLE TO DUPLICATE THE FAILURE. IN ADDITION, THE DASHBOARD ON THE PASSENGER SIDE SUSTAINED EXCESSIVE CRACKS. THE VEHICLE HAS NOT BEEN REPAIRED AT THIS TIME. THE FAILURE MILEAGE WAS 47,000.",
        "vin": "KMHFC46F26A"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/19/2010",
        "dateOfIncident": "12/30/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10300255,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD A PROBLEM WITH THE HEADLIGHTS DIMMING ON MY 2006 HYUNDAI AZERA. THIS HAPPENS AT NIGHT WHEN YOU LET YOUR FOOT OFF OF THE ACCELERATOR. THE RPMS DROP TO BELOW 1,000 FOR A SECOND, AND THEN THEY REBOUND TO NORMAL ON THE TACHOMETER. YOU THINK THAT THE MOTOR IS GOING TO STOP, BUT IT DOESN'T. THIS DECREASE IN MOTOR REVOLUTIONS PER MINUTE CAUSES A DROP IN THE ELECTRICITY BEING PRODUCED BY THE ALTERNATOR, WHICH CAUSES THE LIGHTS TO DIM. THE CAR IS ABOUT 4 YEARS OLD AND HAS BEEN DOING THIS FOR THE LAST 2 YEARS. THE DEALER HAS NOT BEEN ABLE TO DUPLICATE THIS PROBLEM. *TR",
        "vin": "KMHFC46F26A"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/18/2010",
        "dateOfIncident": "03/01/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10300122,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 HYUNDAI AZERA LOW BEAM HEADLIGHTS DEFECTS. DEFINITE DESIGN FLAW, PREVENTING HEADLIGHTS TO PROPERLY ILLUMINATE ROADWAY. HYUNDAI OWNER FORUMS ON-LINE ADDRESS THE PROBLEM BY MANY, MANY OTHER OWNERS, BUT MFG. REFUSES TO DEAL WITH THE PROBLEM, OR EVEN ADDRESS MY E-MAIL COMPLAINTS. I ALSO HAVE A 2008 HYUNDAI AZERA, WITH PERFECT HEADLIGHT ILLUMINATION. DEALER SAYS 2008 HEADLIGHT BULBS ARE NOT ADAPTABLE TO MY 2006 MODEL, WITHOUT REPLACING THE WHOLE ASSEMBLY.   MANY DRIVERS REPORT ON THE FORUM'S THAT DRIVING ON UNLIT RURAL ROADS, MAKE IT ALMOST IMPOSSIBLE TO SEE ANYTHING ON THE ROADWAY MORE THAN A FEW FEET AHEAD, SUCH AS A DEER OR ROAD DEBRIS. A SIMPLE REPLACEMENT ASSEMBLY WOULD CORRECT THE PROBLEM FOR ALL OF US. *TR",
        "vin": "KMHFC46F76A"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/14/2009",
        "dateOfIncident": "11/24/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10295608,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOO HAVE HAD A PROBLEM  WITH THE HEADLIGHTS DIMMING ON MY 2006 HYUNDAI AZERA.  THIS HAPPENS AT NIGHT WHEN YOU LET YOUR FOOT OFF OF THE ACCELERATOR.  THE PROBLEM IS THE RPMS DROP TO BELOW 1,000  FOR A SECOND, AND THEN THEY   REBOUND TO NORMAL ON THE TACHOMETER.  YOU THINK THAT THE MOTOR IS GOING TO STOP, BUT IT DOESN'T.  THIS DECREASE IN MOTOR REVOLUTIONS PER MINUTE CAUSES A DROP IN THE ELECTRICITY BEING PRODUCED BY THE ALTERNATOR, WHICH CAUSES THE LIGHTS TO DIM.  THE CAR IS ABOUT 3 1/2 YEARS OLD AND HAS BEEN DOING THIS FOR THE LAST 18 MONTHS.  THE DEALER HAS NOT BEEN ABLE TO DUPLICATE THIS DRIVING THE CAR DURING THE DAYTIME.  HOWEVER, IT MAYBE RELATED TO THE FUEL INJECTORS.    AFTER USING FUEL INJECTOR CLEANER, THE RPM DROP OFF ON DECELERATION SEEMS TO BE LESS SEVERE. *TR",
        "vin": "KMHFC46F46A"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/16/2009",
        "dateOfIncident": "09/01/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10292262,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2006 AZERA BOUGHT NEW IN FEBRUARY 2006 AND HAVE HAD MINOR PROBLEMS SUCH AS LEFT BEAM BLOCKAGE DUE TO THE WAY THE LEFT HEADLIGHT IS CREATED ACCORDING TO HYUNDAI. I NOW HAVE A PROBLEM THAT JUST STARTED  2 MONTHS AGO WHEN I HAD YET ANOTHER HEADLIGHT REPLACED. MY HEADLIGHTS (LOW BEAMS) DIM FOR A SECOND OR TWO AND THIS HAPPENS EVERY 20 - 30 SECONDS. IT IS MOST NOTICEABLE WHEN YOU  HAVE YOUR FOG LIGHTS ON BUT ALSO NOTICEABLE WITHOUT THEM. ALONG WITH THIS DIMMING THE HEATER FAN ALSO SOUNDS TO LOSE SOME POWER. I TRIED TO DUPLICATE THIS ISSUE BY SITTING IN MY DRIVEWAY WITH THE CAR RUNNING AND LIGHTS ON MANY TIMES FOR 30 MINUTES AND MORE BUT THIS DOES NOT HAPPEN UNLESS THE CAR IS IN GEAR AND MOVING. I HAVE HAD THE DEALER CHECK THIS ISSUE BUT THEY SAY THEY CANNOT LOCATE ANY VOLTAGE DROP OR SEE THE PROBLEM. I OF COURSE ASKED THEM TO VERIFY THIS AT NIGHT BUT THEY INSISTED TO TRY TO SEE THIS DURING THE DAY. THIS IS A DEFINITE HAZARD TO THE LIFE OF THE PASSENGERS IN THE VEHICLE AND PEDESTRIANS WHO MIGHT BE WALKING OR RIDING BIKES AT NIGHT. I HAVE COME CLOSE TO HITTING A PERSON IN BLACK CLOTHES AT NIGHT WHILE THEY WERE WALKING AS MY LIGHTS DIMMED AND FOR AN INSTANT I WAS UNABLE TO SEE THEM. THIS PROBLEM SHOULD BE ADDRESSED BEFORE SOMEONE GETS KILLED. *TR",
        "vin": "KMHFC46F86A"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/13/2009",
        "dateOfIncident": "11/11/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10292111,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERMITTENT STARTING PROBLEMS WITH 2006 HYUNDAI AZERA.  APPROXIMATELY EVERY 20 INSTANCES, THE CAR DOESN'T START.  DEALER SERVICE CENTER CHECKED THE AUTO AND INDICATED THAT THEY COULDN'T RECREATE THE PROBLEM.  EDMUNDS WEBSITE IDENTIFIES SEVERAL COMPLAINTS OF THE SAME PROBLEM IN 2006 HYUNDAI AZERA.  THIS COULD BE CLASSIFIED AS A SAFETY CONCERN WHEN EXPOSED TO LATE NIGHT CRIME WITH A DISABLED AUTO. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/20/2009",
        "dateOfIncident": "10/20/2006",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10289157,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THROTTLE BODY, TPS SENSOR.  CAR STOPS RUNNING. *TR",
        "vin": ""
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "10/14/2009",
        "dateOfIncident": "08/10/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10287361,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "SEVERAL WEEKS AGO THE DRIVERS SIDE POWER SEAT BACK IN MY 2006 HYUNDAI AZERA WOULD INCLINE FULLY FORWARD WITHOUT WARNING PINNING ME TO THE STEERING WHEEL.  THE SEAT BOTTOM COULD BE MOVED BACK BY MANUALLY OPERATING THE BOTTOM SWITCH TO MOVE THE ENTIRE SEAT ASSEMBLY BACK.  AFTER THE DEALER REPLACED THE INCLINE MOTOR AND 2 DIFFERENT SEAT SWITCHES, THE ENTIRE SEAT NOW MOVES WITHOUT WARNING TO A FULL EXTENDED POSITION.  THE ENTIRE SEAT MOVES TO THE FULLY EXTENDED POSITION OVERNIGHT WHILE PARKED IN THE GARAGE.  THE MOVEMENT IS UNPREDICTABLE AND IS CONSIDERED A SAFETY ISSUE. *TR",
        "vin": "KMHFC46F06A"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "07/24/2009",
        "dateOfIncident": "07/22/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10278224,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RAIN SENSING WIPERS DO NOT CONTINUE TO OPERATE AFTER THE INITIAL WIPE BEFORE THE WINDSHIELD BECOMES SO CLOUDED WITH WATER THAT CLEAR ROAD VISION IS SERIOUSLY IMPAIRED.   THIS HAS BEEN REPORTED TO TWO DIFFERENT HYUNDAI SERVICE FACILITIES.  THEY TEST THE EQUIPMENT BY TURNING A HOSE ON THE WINDSHIELD.  THIS DOES NOT SIMULATE ACTUAL RAIN CONDITIONS.  THE LATEST OCCURRENCE OF THIS MALFUNCTION WAS ON JULY 22,2009. *TR",
        "vin": "KMHFC46F86A"
    },
    {
        "components": "POWER TRAIN,EXTERIOR LIGHTING,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "06/26/2009",
        "dateOfIncident": "06/01/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10275044,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 HYUNDAI AZERA.  THE CONTACT STATED THAT THE PASSENGER SIDE HEADLIGHT WAS NOT ALIGNED PROPERLY.  THE VIN WAS EXCLUDED FROM NHTSA CAMPAIGN ID NUMBER 08E021000.  THE MANUFACTURER STATED THAT THEY WOULD NOT ASSIST WITH ANY REPAIRS.  WHILE PERFORMING REGULAR MAINTENANCE ON THE VEHICLE, THE DEALER FOUND LARGE AMOUNTS OF GREASE DEPOSITED INSIDE THE RIM OF THE VEHICLE.  THE DEALER STATED THAT THE CV JOINTS WERE LEAKING GREASE AND NEW ONES WERE NEEDED AT THE CONTACT'S EXPENSE.  THE FAILURE AND CURRENT MILEAGES WERE LESS THAN 45,000.   ALSO, THE LEFT FRONT DOOR LOCK DID NOT LOCK AND UNLOCK PROPERLY. THE DEALER REPLACED THE DOOR ACTUATOR. UPDATED EVOQ 12/16/10",
        "vin": "KMHFC46F86A"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/11/2009",
        "dateOfIncident": "04/09/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10268369,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVERS SIDE AIR BAG DEPLOYED BUT WAS SO SMALL DRIVERS HEAD STRUCK ROOF OF CAR CAUSING NECK AND BACK INJURIES AND NEVER MADE ANY CONTACT WITH AIRBAG. DRIVERS FORWARD MOTION IN ACCIDENT WAS STOPPED BY HITTING HEAD ON ROOF. *TR",
        "vin": "KMHFC46F86A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/28/2009",
        "dateOfIncident": "04/27/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10267156,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG LIGHT GOES ON WHEN TWO ADULTS ARE IN FRONT SEATS. RED AIRBAG LIGHT ON DRIVER'S SIDE AND \"AIRBAG OFF\" LIGHT ON PASSENGER SIDE. AFTER THREE ATTEMPTS DEALER CANNOT FIX PROBLEM. CONTACTED HYUNDAI FACTORY REP WITHOUT RESULTS. *TR",
        "vin": "KMHFC46F46A"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN,ELECTRICAL SYSTEM,AIR BAGS,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "01/04/2009",
        "dateOfIncident": "02/01/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10253740,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "REPEATED ( FOUR OCCASIONS ) WARNING ON DASHBOARD THAT THE AIRBAG SYSTEM WAS NOT FUNCTIONING PROPERLY.  DEALER HAS BEEN UNABLE TO SOLVE PROBLEM.      DRIVER'S DOOR REPEATEDLY WILL NOT LATCH.    OIL LEAKS REPEATEDLY - THREE OCCASIONS - HEAD GASKET REPLACED TWICE    COMPLETE ELECTRICAL FAILURE TWICE - ALTERNATOR REPLACED    TRANSMISSION ROUGH SHIFTING AND ROUGH, DELAYED ENGAGEMENT INTO REVERSE ON 12/30/08. *TR",
        "vin": "KMHFC46F86A"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": true,
        "dateComplaintFiled": "11/19/2008",
        "dateOfIncident": "11/18/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10249326,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 HYUNDAI AZERA.  WHILE DRIVING 35 MPH ON A DARK ROAD, THE DRIVER WAS UNABLE TO SEE A DEER IN THE ROAD BECAUSE THE HEADLIGHTS WERE SHINING ONLY 20 FEET AHEAD.  AS A RESULT, THE DEER WAS STRUCK BY THE VEHICLE.  THE DRIVER WAS UNINJURED AND THE VEHICLE WAS NOT DAMAGED.  THE VEHICLE WAS DRIVEN TO THE DRIVER'S RESIDENCE.  THE VEHICLE WAS TAKEN TO THE DEALER AND THEY STATED THAT THE HEADLIGHTS WERE NOT DEFECTIVE.  THE MANUFACTURER STATED THAT THERE WAS A RECALL RELATING TO THE HEADLIGHTS, BUT IT DID NOT APPLY TO THE VEHICLE.  THE CURRENT MILEAGE WAS 33,375 AND FAILURE MILEAGE WAS 33,300.",
        "vin": "KMHFC46F86A"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/12/2008",
        "dateOfIncident": "06/12/2006",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10248612,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 HYUNDAI AZERA.  THE CONTACT NOTICED THAT THE EXTERIOR LIGHTING WOULD ONLY ILLUMINATE WHEN DRIVING FOR APPROXIMATELY FIFTY TO SIXTY FEET.  AS A CONSEQUENCE, VISIBILITY WAS SIGNIFICANTLY REDUCED.  HE TOOK THE VEHICLE TO A DEALER AND THEY STATED THAT THE LIGHTING MET SPECIFICATIONS.  HE CALLED THE MANUFACTURER AND NEVER RECEIVED A RESPONSE.  THE FAILURE MILEAGE WAS 21,000 AND CURRENT MILEAGE WAS 34,000.",
        "vin": "KMHFC46F56A"
    },
    {
        "components": "SUSPENSION,TIRES",
        "crash": false,
        "dateComplaintFiled": "10/07/2008",
        "dateOfIncident": "10/04/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10244641,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 HYUNDAI AZERA VEHICLE CAN NOT BE ALIGNED PROPERLY CAUSING THE TIRES EXCESSIVE WEAR AND UNSAFE TRACTION. *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/09/2008",
        "dateOfIncident": "07/01/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10241457,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG:  THE AIR BAG LIGHT ON THE DRIVER SIDE INSTRUMENT PANEL STAYS ON AND THE PASSENGER SEAT 'ICON' FLASHES WHEN NO ONE IS SITTING IN THE PASSENGER SEAT.  AT THIS TIME THE \"PASSENGER AIR BAG OFF\" SIGN IS ALSO ON.      I FIRST NOTICED THIS CONDITION IN THE SUMMER OF 2007, HOWEVER IT ONLY OCCURRED ONE OR TWO TIMES SO I THOUGHT IT MIGHT BE HEAT RELATED AS  ON THE TWO DAYS IT HAPPENED IT WAS EXTREMELY HOT.  I DID NOT NOTICE IT ALL WINTER LONG, HOWEVER ONCE THE WEATHER STARTED GETTING WARM IT STARTED TO HAPPEN AGAIN.   NOW IT IS HAPPENING ON A WEEKLY BASIS AND LASTS SEVERAL DAYS IN A ROW.    MY MECHANIC HAS LOOKED AT IT BUT HAS NOT BEEN ABLE TO DETERMINE WHAT THE PROBLEM IS.    I AM CONCERNED AS TO WHAT THE STATUS OF MY AIR BAGS IS-- ARE THEY WORKING OR NOT.    THE DATE OF THE \"INCIDENT\" IS THE APPROXIMATE DATE OF THE FIRST TIME THIS OCCURRED LAST SUMMER BUT AS I STATED IT IS NOW HAPPENING ON A REGULAR BASIS. *TR",
        "vin": "KMHFC46FX6A"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/02/2008",
        "dateOfIncident": "08/25/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10240614,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 HYUNDAI AZERA LIMITED I JUST PURCHASED HAS A HEADLIGHT PROBLEM.  THE HEADLIGHTS GO OUT AT ANY TIME FOR TWO TO THREE  SECONDS, THEN COME BACK ON.  USUALLY THIS OCCURS WHEN COMING TO A STOP, BUT NOT ALWAYS.  MAYBE THIS IS THE REASON THE PREVIOUS OWNER SOLD THE CAR.  WE CALLED THE LOCAL DEALER AND WERE TOLD IT WAS A PROBLEM THEY HAVEN'T FOUND A SOLUTION TO YET, AND THE DEALER AT THREE OTHER AZERA OWNERS WITH THE SAME PROBLEM.  THE DEALER SAID THERE IS A VOLTAGE DROP IN THE CHARGING SYSTEM, AND IT IS MORE NOTICEABLE AT NIGHT WHEN THE HEADLIGHTS ARE ON. I HAVE NOTICED THE VOLTAGE DROP DURING THE DAY ALSO BY SEEING THE SPEEDOMETER LIGHTS DIM. THIS IS SO ANNOYING, AND IS A SAFETY ISSUE.  COULD EVEN BECOME A PROBLEM OF ROAD RAGE IF MY HEADLIGHTS FLASH ON AND OFF AT AN IRATE DRIVER IN FRONT OF ME.   I CAN'T BELIEVE THERE IS NO SOLUTION! *TR",
        "vin": "KMHFC46F06A"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/24/2008",
        "dateOfIncident": "08/06/2006",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10232154,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 HYUNDAI AZERA.  WHILE DRIVING APPROXIMATELY 30 MPH AT NIGHT, THE LOW BEAM HEADLIGHTS FAILED TO PROJECT PROPERLY.  THERE WERE NO WARNINGS PRIOR TO THE FAILURE.  THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER AND THEY ADJUSTED THE HEADLIGHTS, BUT THE FAILURE CONTINUED.  THE CONTACT WAS VERY DISAPPOINTED AND FRUSTRATED TO KNOW THAT THERE WAS NO RESOLUTION TO THE HEADLIGHT MALFUNCTION.  HE STATED THAT THERE WAS A DESIGN DEFECT IN THE HEADLIGHT ASSEMBLY.  THE VIN WAS UNKNOWN.  THE FAILURE MILEAGE WAS 5 AND CURRENT MILEAGE WAS 13,000. UPDATED 07/15/08.  *LJ  THE HEADLIGHT SYSTEM DIDN'T DEFUSE WHILE DRIVING IN THE DARK. UPDATED",
        "vin": "KMHFC46F16A"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/24/2008",
        "dateOfIncident": "06/15/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10232213,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "HYUNDAI AZERA 2006 WHEN IT REACH 9,000 MILES THE FRONT HEADLIGHTS BEGAN DIMMING WHILE DRIVING AT NIGHT.  I HAVE BROUGHT IT BACK TO THE DEALERSHIP 3 TIMES AND THEY STATE THAT \"THIS CONDITION DOES NOT ADVERSELY AFFECT VISIBILITY OR HEADLAMP ILLUMINATION IN ANY MANNER.  THIS CONDITION IS NORMAL AND DOES NOT REFLECT ANY MALFUNCTION OF THE ELECTRICAL SYSTEM.  DO NOT ATTEMPT TO REPAIR THIS CONDITION.\"  WELL, MY LIGHTS GOING OUT FOR 5 SECONDS COULD MEAN THE END OF SOMEONE'S LIFE!  THIS IS A MAJOR PROBLEM THAT HYUNDAI IS NOT ADDRESSING AND I AM MAD!  DOES IT NEED TO BEGIN TO END IN DEATHS BEFORE THERE IS A FIX?  *TR",
        "vin": "KMHFC46F76A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/17/2008",
        "dateOfIncident": "06/14/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10231269,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE A SAFETY ISSUE WITH OUR 2006 HYUNDAI AZERA LIMITED.  THE FRONT PASSENGER AIRBAG SYSTEM THAT FEATURES AN OCCUPANT CLASSIFICATION SYSTEM OR OCS IS NOT WORKING.  WE HAVE ADVISED OUR DEALERSHIP OF THE PROBLEM FOR ALMOST A YEAR AND HAVE BEEN TOLD THE SYSTEM WORKS AS DESIGNED.      WHEN MY WIFE SITS IN THE CAR'S FRONT SEAT (HER WEIGHT IS 137 POUNDS) WITH OR WITHOUT THE ENGINE ON AND BUCKLES IN, THE DASHBOARD AIRBAG LIGHT BELOW THE SPEEDOMETER STAYS LIT AND A MIDDLE CONSOLE INDICATOR SAYS, \"PASSENGER AIRBAG OFF.\"  TO MAKE THE SYSTEM FUNCTION PROPERLY WE HAVE HAD TO PLACE THE TRANSMISSION IN PARK AND TURN OFF THE ENGINE.  ONCE RESTARTED, THE TWO FRONT PASSENGER AIRBAG INDICATOR LIGHTS GO OFF AND THE FRONT AIRBAG SYSTEM WORKS NORMALLY.  THE SERVICE MANAGER AT OUR HYUNDAI DEALERSHIP IN HUNTSVILLE, AL SAID THAT THE SYSTEM IS OPERATING NORMALLY IF THE DASHBOARD INDICATOR LIGHTS RESET AFTER WE RESTART THE CAR.  ALL PREVIOUS DIAGNOSTIC TESTS BY THE DEALERSHIP HAVE FOUND ZERO ERRORS IN THE SYSTEM.      ON 14 JUNE 2008, WE STARTED OUR CAR IN OUR GARAGE AND BOTH THE DASHBOARD AND CENTER CONSOLE INDICATOR LIGHTS REMAINED ON.  WE TURNED OFF OUR CAR'S ENGINE AND RESTARTED IT 5 TIMES TO GET THE SYSTEM TO RESET WITHOUT SUCCESS.  MY WIFE SAT IN THE BACK SEAT FOR SAFETY.  THE FRONT AIRBAG SYSTEM WOULD NOT RESET AFTER MULTIPLE STOPS DURING THE DAY.  WE BROUGHT THE CAR TO OUR HYUNDAI DEALER ON 16 JUNE AND SERVICE PERSONNEL ARE STILL DIAGNOSING IT.      I CALLED HYUNDAI'S RECALL CENTER TO SEE IF OUR AZERA'S FRONT OCS AIRBAG IS SIMILAR TO THE 2006 TO 2008 HYUNDAI SONATA OCS RECALL (#08V161000) AND WAS TOLD TO CONTACT MY DEALER.  WHEN I RELAYED THIS INFORMATION TO OUR HYUNDAI DEALERSHIP'S SERVICE MANAGER HE SAID THAT HYUNDAI HAD NOT INFORMED HIM OF ANY PROBLEM.  THIS IS A SERIOUS SAFETY CONCERN AND IF THE 2 SYSTEMS ARE SIMILAR THEN THE SONATA OCS RECALL SHOULD BE EXTENDED TO THE AZERA MODEL TOO.    *TR",
        "vin": "KMHFC46F96A"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/12/2008",
        "dateOfIncident": "03/26/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10230808,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY HEADLIGHTS ON MY 2006 HYUNDAI AZERA DIM CONSTANTLY AT NIGHT. THE CAR HAS BEEN BACK TO THE DEALER AND HYUNDAI HAS NO FIX FOR THE PROBLEM.  MANY OTHER OWNERS OF THE AZERA HAVE THE SAME PROBLEM.  THE SUSPENSION ALSO HAS A MAJOR PROBLEM.  NOISE AND A LOOSE SUSPENSION PROBLEM ALSO NO FIX BY HYUNDAI.  *TR",
        "vin": "KMHFC46F06A"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "06/04/2008",
        "dateOfIncident": "07/10/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10229956,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 HYUNDAI AZERA.  WHEN SOMEONE IS SEATED IN THE PASSENGER SEAT, THE AIR BAG SENSOR INDICATES THAT THE SEAT IS UNOCCUPIED.  THE PASSENGER SIDE SEAT BELT LIGHT AND THE AIR BAG INDICATOR LIGHTS ILLUMINATE AS WELL, REGARDLESS IF THE SEAT IS OCCUPIED OR NOT.  THE VEHICLE HAS BEEN TO THE DEALER ON FOUR SEPARATE OCCASIONS:  JULY, SEPTEMBER, DECEMBER OF 2007 AND JUNE 4, 2008.  ON EACH OCCASION, THE SERVICE TECHNICIAN COULD NOT DUPLICATE THE FAILURE OR MAKE ANY REPAIRS.  THE CURRENT MILEAGE WAS 18,474 AND FAILURE MILEAGE WAS 1,500.",
        "vin": "KMHFC46F16A"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/27/2008",
        "dateOfIncident": "05/26/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10228997,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2006 HYUNDAI AZERA TWO YEARS AGO.  I CALLED TO TELL HYUNDAI USA THAT THE DRIVER SIDE HEADLIGHT LOW BEAM WAS NOT OPERATING WITH A FULL FIELD OF LIGHT, IT APPEARS TO HAVE A SHIELD OVER THE TOP HALF OF THE LIGHT. THIS CREATES A SHARP DISTINCTIVE SHADOW AND A VERY SHORT FIELD OF LIGHT WHEN DRIVING IN DARKNESS AND IS NOT ILLUMINATING A SAFE AMOUNT OF THE ROAD.  I HAVE TALKED TO HYUNDAI USA AND TWO DIFFERENT HYUNDAI DEALERS ABOUT IT AND THE PROBLEM GOES UNACKNOWLEDGED. THEY ALL SAY THEY HAVE NOT HEARD OF THIS PROBLEM ALTHOUGH THEY DO ATTEMPT TO ADJUST IT.  THEY HAVE ALL SAID THAT THE LIGHT IS POINTED DOWN TO AVOID BLINDING THE ONCOMING TRAFFIC, BUT IF THE DRIVER IS NOT PROVIDED WITH ENOUGH LIGHT TO SEE IN FRONT OF HIM, HE IS VIRTUALLY DRIVING BLIND. THIS IS A REAL DRIVING HAZARD.    I AM NOW AWARE OF THE RECALL 08E-021 CONCERNING THE REPLACEMENT LAMPS ON HYUNDAI, BUT THEY ARE NOT ADDRESSING THE HEADLIGHTS THAT ARE ORIGINAL TO THE CAR. *TR",
        "vin": "KMHFC46F16A"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "03/31/2008",
        "dateOfIncident": "03/31/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10222958,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "SENSOR FAILS FOR SEATBELT/AIRBAGS RESULTING IN ?????  *TR",
        "vin": "KMHFC46F46A"
    },
    {
        "components": "EXTERIOR LIGHTING,SEATS",
        "crash": false,
        "dateComplaintFiled": "02/28/2008",
        "dateOfIncident": "08/15/2006",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10219568,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 HYUNDAI AZERA.  THE CONTACT STATED THAT THE DRIVER SIDE HEADLIGHT WORKS IMPROPERLY.  THE LIGHT PROVIDES A HUGE DARK SPOT APPROXIMATELY 50 FEET IN FRONT OF THE VEHICLE.  THE DEALER ADJUSTED THE HEADLAMP, BUT THE FAILURE RECURRED IMMEDIATELY AFTERWARDS.  THE VEHICLE WAS TAKEN TO THE DEALER ON FIVE MORE OCCASIONS, IN WHICH THEY CHANGED THE BULB AND REPEATEDLY ADJUSTED THE HEADLAMP.  NONE OF THE REMEDIES CORRECTED THE FAILURE.  THE CONTACT FILED A COMPLAINT WITH THE MANUFACTURER, BUT THEY WOULD NOT ASSIST.  THE FAILURE MILEAGE WAS 2,000 AND CURRENT MILEAGE WAS 13,000. UPDATED 03/25/08.  *LJ  THE DRIVERS SIDE POWER SEAT SWITCH DID NOT MOVE THE SEAT BACK. UPDATED",
        "vin": "KMHFC46F86A"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/28/2008",
        "dateOfIncident": "01/28/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10216266,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 HYUNDAI AZERA.  THE CONTACT STATED THAT THE HEADLIGHTS DO NOT PROJECT LONG DISTANCES.  HE CHANGED THE BULBS, BUT THE FAILURE REMAINS.  HE HAS EVEN USED THE HIGH BEAMS, BUT THIS HAS NOT CORRECTED THE FAILURE EITHER.  THE MANUFACTURER HAS NOT YET BEEN NOTIFIED.  THE CURRENT AND FAILURE MILEAGES WERE 20,000.",
        "vin": "KMHFC46F86A"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/08/2008",
        "dateOfIncident": "12/20/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10214194,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "CASE NUMBER 3180238.    I'M DONE WITH THE CAR BUT I DON'T WANT TO TRADE A VEHICLE WHICH MIGHT CAUSE AND ACCIDENT AND GET SOMEONE HURT OR WORSE.  *TR",
        "vin": "KMHFC46F46A"
    },
    {
        "components": "SUSPENSION,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/25/2007",
        "dateOfIncident": "09/25/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10204120,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THUMPING NOISE UNDER REAR OF VEHICLE, POSSIBLY SUSPENSION COMPONENTS, WHEN GOING OVER SPEED BUMPS OR EVEN A SMOOTH ROAD, AND WHILE MAKING A TURN.  INTERMITTENT PROBLEMS: RED \"AIR BAG\" INDICATOR LIGHT STAYS ON WHILE VEHICLE IS IN OPERATION. \"PASSENGER AIRBAG OFF\" INDICATOR LIGHT STAYS ON WHEN PASSENGER SEAT IS OCCUPIED.   *JB",
        "vin": "KMHFC46F36A"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/17/2007",
        "dateOfIncident": "08/14/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10203238,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "LOW BEAM LIGHTING SEEMS CUT OFF AT TOP..THERE IS NO INTERLEAVING CIRCLE OF LIGHT WHEN LOW BEAMS ARE ON.  DEALER SAID IT WAS OK..BUT THERE IS A SAFETY PROBLEM WHEN TURNING INTO ANOTHER STREET.  THE TURN MOST TIMES RESULTS IN A HIGH BEAM SELECTION WHICH BLINDS ON COMING TRAFFIC.  *JB",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/23/2007",
        "dateOfIncident": "02/15/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10200560,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG LIGHT  IS ALWAYS ON. *TR",
        "vin": "KMHFC46F96A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/08/2007",
        "dateOfIncident": "07/28/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10199265,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 HYUNDAI AZERA LIMITED WITH GEAR PROBLEMS CUSTOMER STATES THAT WHILE DRIVING, THE CAR WOULD NOT SLOW DOWN AS HER FOOT WAS TAKEN OFF THE GAS AND PUT ON THE BRAKE**NAR**CC  THE CONSUMER STATED WHILE DRIVING AND SWITCHING INTO A DIFFERENT LANE AT ABOUT 60 OR 65 MILES AN HOUR SHE TOOK HER FOOT OFF THE ACCELERATOR AND APPLIED THE BRAKES BUT THE VEHICLE WOULD NOT SLOW DOWN. THE CONSUMER STATED ALMOST STANDING ON THE BRAKE A FEW TIMES IS WHAT FINALLY SLOWED THE VEHICLE DOWN AND THEN THE VEHICLE RAN NORMAL.*TR",
        "vin": "KMHFC46F26A"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/02/2007",
        "dateOfIncident": "06/20/2006",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10195123,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 HYUNDAI AZERA.  WHILE DRIVING ON AN INCLINE, THE CONTACT EXPERIENCED POOR VISIBILITY FROM THE HEADLIGHTS.  THE DEALER STATED THAT THEY MAY BE ABLE TO ADJUST THE HEADLIGHTS.  THE CURRENT MILEAGE IS 15,500 AND FAILURE MILEAGE WAS 15,000.",
        "vin": "KMHFC46F96A"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/13/2007",
        "dateOfIncident": "10/31/2006",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10187783,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*- THE CONTACT OWNS A 2006 HYUNDAI AZERA. WHILE DRIVING THE VEHICLE DOWN A HILL AT NIGHT WITH THE LOW BEAMS ON, THERE WAS NO VISIBILITY ABOVE LIGHTED AREA.  THE DEALER STATED THAT THE HEAD LIGHT'S LOW BEAM WAS DIRECTED TOO LOW.  THE DEALER ADJUSTED THE HEAD LIGHTS.  THE HEAD LIGHT ADJUSTMENT DID NOT SOLVE THE PROBLEM.  THE DEALER INSPECTED THE VEHICLE A SECOND TIME AND STATED THE LOW BEAMS WERE POINTED IN THE RIGHT DIRECTION, AND DID NOT MAKE ANY REPAIRS. THE VEHICLE CURRENTLY HAD 61,000 MILES.",
        "vin": "KMHFC46F86A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/25/2007",
        "dateOfIncident": "03/25/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10186124,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ACCELERATOR  CONTINUED TO OPERATE AFTER BRAKES WERE APPLIED.  THIS HAPPENED SIX TIMES.  VEHICLE ALMOST HIT  A PEDESTRIAN.  *AK",
        "vin": "KMHFC46F96A"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "03/07/2007",
        "dateOfIncident": "02/22/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10184484,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I PULLED MY 8 MONTH OLD HYUNDAI AZERA OUT OF A PARKING LOT, THE CAST IRON HOUSING HOLDING THE UPPER END OF THE PASSENGER SIDE TIE ROD FAILED, CAUSING THE TIE ROD TO FALL TO THE GROUND.  THE LOWER END WAS STILL IN PLACE BUT THE UPPER END WAS ON THE GROUND,  BOLT AND CARTER PIN INTACT .  THIS CAUSED THE RIGHT FRONT WHEEL TO BECOME DISENGAGED FROM THE STEERING MECHANISM, CAUSING THE CAR TO HIT A PARKED CAR.   HYUNDAI NORTH AMERICA AND THE LOCAL DEALERSHIP , AFTER INITIALLY ADMITTING THIS WAS PRODUCT FAILURE, NOW REFUSE TO REPAIR EITHER THE BODY DAMAGE OR THE TIE ROD WHICH SHOULD BE COVERED BY WARRANTY AT THE LEAST. THEY INSIST OUR INSURANCE COMPANY SHOULD PAY FOR THEIR PRODUCT FAILURE, WHICH WILL CAUSE OUR RATES TO INCREASE.    *JB",
        "vin": "KMHFC46F96A"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/23/2007",
        "dateOfIncident": "10/16/2006",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10183385,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* - THE CONTACT OWNS A HYUNDAI AZERA.  THE CONTACT EXPERIENCED 2 INCIDENTS WHERE THE VEHICLE LOST POWER AT 737  MILES, AND AGAIN AT 4418 MILES.  ALL OF THIS HAS BEEN REPORTED TO THE MANUFACTURER.  THESE FAILURES HAVE BEEN A CONCERN SINCE THE VEHICLE WAS PURCHASED ON OCTOBER 7, 2006.   THERE WERE NO WARNING INDICATOR LIGHTS UNTIL AFTER THE VEHICLE LOST POWER.  THE FIRST INCIDENT OCCURRED WHILE DRIVING AT 70 MPH, AND  THE SECOND  INCIDENT AT 50 MPH.   ALL OF THE LIGHTS  ILLUMINATED AFTER THE VEHICLE STALLED. THE CONTACT WASN'T ABLE TO RESTART THE VEHICLE ON BOTH INCIDENTS, AND THE VEHICLE WAS TOWED TO THE DEALER, WHO DETERMINED  THAT THE FAILURE WAS DUE TO A FAULTY RELAY AND 1 BURNED OUT FUSE. THEY STATED THIS WAS  THE ONLY PROBLEM. AFTER THE SECOND  INCIDENT THE VEHICLE WAS TOWED AGAIN, AND STAYED AT THE DEALER FOR 11 DAYS. THE DEALER REPLACED THE FUEL  PUMP, 2 ELECTRICAL WIRES, THE GAS TANK, AND THE COMPUTER. THE END RESULT WAS THAT THE DEALER IN CONSULTATION WITH HYUNDAI DIDN'T KNOW WHY THE FAILURES OCCURRED.  THE CONTACT FILED A COMPLAINT WITH HYUNDAI. THE  FIRST FAILURE WAS ON  0CTOBER 16, 2006, AND THE  SECOND FAILURE WAS ON DECEMBER 8,  2006 .  THE CURRENT MILEAGE WAS 9200. *AK  THE CONSUMER STATES THERE WAS A 3RD INCIDENT ON MARCH 9, 2007 THE CAR POWERED DOWN AND THE CONSUMER INSERTED HIS SPARE 205 POWER RELAY AND THE CAR TURNED OVER. DEALER STATES REPLACED RELAY AND FUSES A FEW TIMES. CUSTOMER STATES PROBLEM STILL GOING ON WANTS CAR FIXED. UPDATE 04/19/07 *TR    UPDATED 03-28-08 *BF",
        "vin": "KMHFC46F96A"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/18/2007",
        "dateOfIncident": "02/12/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10182912,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHTS DO NOT PROPERLY ILLUMINATE THE ROADWAY.  THIS IS A SAFETY HAZARD.  I ALMOST HIT A PEDESTRIAN WHILE DRIVING ON A DIMLY LIT ROAD. I COMPLAINED TO MY DEALER AND WAS ADVISED THAT THERE WAS NOTHING THEY COULD DO.  THE DEALER CLAIMS THAT THE LIGHTS ARE WORKING IN ACCORDANCE WITH THE MANUFACTURES SPECIFICATIONS. IF THIS IS TRUE...THE MANUFACTURER SHOULD BE FORCED TO ADJUST THESE STANDARDS BEFORE A TRAGEDY OCCURS.  THERE HAVE BEEN TWO OTHER INSTANCES WHERE THIS CONDITION NEARLY CAUSED ME TO HAVE AN ACCIDENT. *JB",
        "vin": "KMHFC46F66A"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/13/2007",
        "dateOfIncident": "09/30/2006",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10182454,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 1006 HYUNDAI AZERA HAS A DARK SHADOW COVERING PART OF THE LEFT HEADLAMP.  IN NIGHT DRIVING, THIS RESULTS IN LIMITED VISION ON THE LEFT SIDE OF THE ROAD.  DEALER TOLD ME THERE'S A BLACK DOT ON THE LEFT HEADLAMP WHICH IS SUPPOSED TO REDUCE GLARE OF MY HEADLIGHTS FOR ONCOMING VEHICLES.  HOWEVER, THIS LIMITED VISION MAY ACTUALLY RESULT IN A COLLISION WITH A PEDESTRIAN OR VEHICLE.  DEALER TOLD ME HEADLAMPS ARE SET TO SPEC AND CANNOT BE ADJUSTED.  IT SEEMS TO ME, THAT MY SAFETY SHOULD SUPERSEDE THE COMFORT OF ONCOMING VEHICLES. *JB",
        "vin": "KMHFC46F96A"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/07/2006",
        "dateOfIncident": "11/07/2006",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10172864,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED NO PROBLEM OCCURRED WITH THE VEHICLE, BUT AN ARTICLE INDICATED LATER MODEL VEHICLES WERE STRUCTURALLY IMPROVED.  THIS INFORMATION CAUSED THE CONTACT TO BE CONCERNED.  THE VEHICLE WAS TAKEN TO THE SERVICE DEALER WHO DETERMINED AN INSPECTION WAS UNWARRANTED, AS THE VEHICLE WAS OPERATING NORMALLY.   UPDATED 11/30/2006 - *NM",
        "vin": "KMHFC46F96A"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/25/2006",
        "dateOfIncident": "05/31/2006",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10171773,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHTS ON LOW BEAM PROVIDE LESS THAN ACCEPTABLE VISIBILITY ON UNEVEN SURFACE CONDITIONS-12-30 FEET. VERY DANGEROUS.  *NM",
        "vin": "KMHFC46F16A"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING,EXTERIOR LIGHTING,STRUCTURE,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "10/19/2006",
        "dateOfIncident": "10/19/2006",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10171319,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED WHILE TRAVELING OVER BUMPS THERE WAS A RATTLE UNDER THE VEHICLE.  ALTHOUGH THE VEHICLE WAS INSPECTED BY THE DEALERSHIP MULTIPLE TIMES, THE PROBLEM WAS NOT DETERMINED.  THE CONSUMER STATED HESITATION WHILE PULLING ONTO THE HIGHWAY AND HEADLIGHTS ON VEHICLE HAVE DARK SPOTS HARD TO SEE. THE DEALER STATED LOOSE BODY TRIM, LEFT FRONT BRAKE IS GRABBING, AND REAR SPEAKER MAKING NOISE.  UPDATED 10/25/07  *TR",
        "vin": "KMHFC46F16A"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/15/2006",
        "dateOfIncident": "08/13/2006",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10165524,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE DRIVING AT ANY SPEED DURING THE NIGHT, THE HEADLIGHTS ONLY PROVIDED 30 FEET OF ILLUMINATION.  AFTER THE 30 FOOT DISTANCE, THERE WAS A DISTINCT SHADOW.  THE VEHICLE WAS TAKEN TO A SERVICE DEALER, WHERE THE DEALER ADJUSTED THE ALIGNMENT OF THE HEADLIGHTS BUT THE PROBLEM PERSISTED.  UPDATED 09/13/06. *JB",
        "vin": "KMHFC46F26A"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/11/2006",
        "dateOfIncident": "07/01/2006",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10162106,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE CONTACT STATED 30 FEET AHEAD OF THE VEHICLE THE HIGHLIGHTS ARE BRIGHT HOWEVER THERE IS A DISTINCT SHADOW BEYOND THAT DISTANCE. THE VEHICLE WAS TAKEN TO THE DEALER WHO ADJUSTED THE HEADLIGHTS ACCORDING TO THE SPECIIFICATIONS AND DETERMINED THE VEHICLE WAS OPERATING NORMALLY. THE MANUFACTURER WAS ALERTED. THE CONTACT OBSERVED IN A CONSUMER'S GUIDE THAT THE PERFORMANCE OF THE HIGHLIGHTS OF THE VEHICLE'S YEAR, MAKE AND MODEL IS GOOD BUT THE LOW BEAMS HAVE A DISTINCT LIGHT CUT OFF AT THE TOP.",
        "vin": "KMHFC46F16A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/27/2006",
        "dateOfIncident": "06/26/2006",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10160883,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER AIR BAG INTERMITTENTLY DISENGAGES WHILE DRIVING.   WITH AN AVERAGE SIZE ADULT SITTING IN THE PASSENGER SEAT, THE AIRBAG LIGHT (INDICATING THAT THE AIR BAG IS DISENGAGED) OFTEN TURNS OFF WHILE TRAVELING.  *NM",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/12/2006",
        "dateOfIncident": "06/12/2006",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10159590,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE MAKING A LEFT TURN AT 5MPH THE VEHICLE SUDDENLY ACCELERATED WITHOUT WARNING.  AFTER RELEASING THE ACCELERATOR AND APPLYING THE BRAKE THE PROBLEM STOPPED.  THE VEHICLE WAS NOT INSPECTED.",
        "vin": "KMHFC46F76A"
    }
]