[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/22/2022",
        "dateOfIncident": "02/05/2022",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453396,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "When I drive my car and right after I put gas in my car I smell gas to the point that my husband and I are coming home with headaches and we're sick to her stomach I've taken it to a mechanic and they say there's nothing wrong the engine check engine light keep on coming on and then it will go off after it sit for a couple minutes turned off I'm about ready to have a baby in June and I'm so worried to have the baby in the car the brakes have stopped working to the point that I've gone in through lights and I can hardly put the brakes on I have to use emergency brake sometimes and nobody will help me get it taken care of I have had almost couple wrecks because I cannot get the brakes to stop take a lock on me and it's scary when you're having a baby and you know your seatbelt your brakes are locking but you for your seat belt to keep safe and my brakes locked to the point I cannot get them after the kick hit them with all my might just to unlock them and nobody will help me fix it",
        "vin": "Km8jn72d06u"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/02/2021",
        "dateOfIncident": "06/01/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442393,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "When it rains my steering wheel locks up when I drive thru a puddle I have brought my car to used car dealer where I bought it from and they say nothing is wrong but steering wheel locks when driving that to me is major problem they checked belt water is getting somewhere and causing a short hence power steering to lock it only happens when it rains",
        "vin": "Km8jn12d26u"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/02/2021",
        "dateOfIncident": "01/14/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11419362,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2006 Hyundai Tucson. The contact stated while driving at various speeds, he noticed that the air bag warning light was illuminated. The vehicle was taken to an independent mechanic and diagnosed with the air bag module needing to be replaced. The independent mechanic cleaned the contacts for the seat sensors however, the failure recurred. The manufacturer was not informed of the failure. The contact related the failure to an unknown recall. The failure mileage was approximately 100,000.",
        "vin": "KMHJM12B56U"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/05/2021",
        "dateOfIncident": "08/01/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415341,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI TUCSON.  THE CONTACT STATED THAT WHILE DRIVING 5 MPH AND ATTEMPTING TO STOP THE VEHICLE, THE BRAKE PEDAL WAS DEPRESSED AND THE VEHICLE STALLED. AFTER THE FAILURE, THE CHECK ENGINE WARNING LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN TO SHAKER'S FAMILY HYUNDAI (674 STRAITS TPKE, WATERTOWN, CT 06795, (860) 631-4200) TO BE DIAGNOSED. THE CONTACT WAS INFORMED BY THE DEALER THAT THE ADAPTIVE VALUES WERE RESET AND THE VEHICLE SHOULD PERFORM AS DESIGNED. THE CONTACT RETRIEVED THE VEHICLE AND WHILE DRIVING INTO HER DRIVEWAY, THE OIL WARNING LIGHT ILLUMINATED. THE CONTACT STATED THAT THE VEHICLE WAS PREVIOUSLY TAKEN TO AN INDEPENDENT MECHANIC WHO REPLACED THE THROTTLE BODY AND MAS AIR FLOW SENSORS HOWEVER, THE FAILURE PERSISTED. THE VEHICLE WAS NOT YET REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 190,000.",
        "vin": "KM8JN72D16U"
    },
    {
        "components": "SUSPENSION,ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/15/2021",
        "dateOfIncident": "02/15/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396347,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "HYUNDAI NEVER NOTIFIED US OF THE SUBFRAME RUST RECALL. OUR MECHANIC JUST POINTED OUT THAT OUR'S. HE SAID THE CAR IS UNSAFE TO DRIVE. GETTING IT REPLACED AT OUR EXPENSE. BRAKE LINES HAVE ALREADY FAILED AND HAD TO BE REPLACED AT OUR EXPENSE. ALTERNATOR AND POWER STEERING PUMP, FRONT SUSPENSION ALL AT OUR EXPENSE. HYUNDAI UNRESPONSIVE.",
        "vin": "KM8JN72D76U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/09/2021",
        "dateOfIncident": "01/04/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387267,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DAY 1:I PULLED INTO A LANE LEADING TO A PARKING LOT. ON A 90 DEGREE TURN, I LOST POWER STEERING AND THE ENGINE LIGHT CAME ON. THE HYUNDAI STILL WAS IDLING WHEN I LOST THE POWER STEERING.  I CAME TO A STOP AND THE POWER STEERING STARTED WORKING AGAIN. THERE WAS SOME WATER ON THE PAVEMENT.  DAY 2: SAME AS DAY ONE IN SAME LOCATION ON THE SAME TURN.  DAY 5: TOOK VEHICLE TO SERVICE CENTER AND EXPLAINED THE PROBLEM.  THEY CAME BACK AND SAID THEY CHECKED THE COMPUTER FOR ERROR CODES AND NONE WERE FOUND.  THE CHECKED THE UNDER CARRIAGE FOR LOOSE WIRES, NONE WERE FOUND.  THEY CHECKED THE SERPENTINE BELT AND IT WAS ALSO FOUND IN GOOD CONDITION.  PROBLEM COULD NOT BE FOUND.  NO INSURANCE SAFE DRIVING SENSOR WAS PLUGGED INTO THE COM PORT.  THERE IS A SENSOR ON THE WINDSHIELD THAT IS STUCK ON.  NO PHYSICAL CONNECTION TO THE VEHICLE.",
        "vin": "KM8JN12D56U"
    },
    {
        "components": "STRUCTURE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/24/2020",
        "dateOfIncident": "11/23/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376107,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI TUCSON. THE CONTACT STATED THAT THEY HEARD A LOUD THUMPING COMING FROM UNDERNEATH THE VEHICLE. THEY INSPECTED THE VEHICLE AND NOTICED A METAL CONTAINER WITH A PLASTIC CASING THAT WAS GETTING BURNED DUE TO A FUEL LINE LEADING TO IT. THE CONTACT STATED THEIR VEHICLE WAS INCLUDED IN A RECALL WHERE THE STRAPS WERE PLACED TO HOLD THE GAS TANK WAS NEAR A UNIT THAT HAD WIRES RELATING TO THE GAS TANK AND TOWARDS THE ENGINE, INDICATING IT WAS THE COMPUTER USED FOR THE FUEL LINE CONNECTION BETWEEN THE GAS TANK AND THE ENGINE. THE CONTACT SPOKE WITH THE DEALER (LIBERTYVILLE LINCOLN   941 S MILWAUKEE AVE, LIBERTYVILLE, IL 60048;   (847) 367-1700) WHO STATED THAT DUE TO THEIR VEHICLE NOT BEING INCLUDED IN A RECALL THEY WERE UNABLE TO DIAGNOSE THE VEHICLE FREE OF CHARGE. THE VEHICLE HAD NOT BEEN REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE APPROXIMATE FAILURE MILEAGE 165,000.",
        "vin": "KM8JN72D260"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/25/2020",
        "dateOfIncident": "10/20/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11366279,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST SPENT ABOUT $100. FIXING BALL JOINT AND CONTROL ARM AND WAS ROTATING WHEELS AND LOOKED UNDER CAR AND SEEN REAR SUBFRAME ALL RUSTED OUT.THE CAR HAS A GREAT BODY AND RUNS VERY GOOD. I BOUGHT THIS CAR BRAND NEW AND I DRIVE MY GRANDKIDS IN THIS CAR AND NOW LOOKS UN SAFE TO DRIVE.",
        "vin": "KM8JN12D46U"
    },
    {
        "components": "AIR BAGS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/16/2020",
        "dateOfIncident": "06/08/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364702,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL FOR MY AIRBAG WAS NOT DONE. BRAKE LIGHTS DON'T WORK, ELECTRICAL PROBLEMS.",
        "vin": "KM8JM12B16U"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/17/2020",
        "dateOfIncident": "09/01/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11355611,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I GOT IN THE VEHICLE AND PUT IT IN REVERSE AS I WAS EATING REVERSED I PUT ON THE BRAKE BUT THE BRAKE WOULD NOT GO ON THE CAR KEPT ROLLING BACKWARDS I DIDN'T TRY TO PUT THE CAR INTO PARK DO NOT GO INTO PARK I TRIED TO PUT IT INTO DRIVE IT WOULD NOT GO INTO DRIVE I HAD NO BREAK THE BREAK WITH ALL THE WAY TO THE FLOOR THERE'S NO BREAK I CHECK WITH BREAKFAST IF THERE IS FLUID IN THE CONTAINER BUT THERE IS STILL NO BRAKES THE CAR WAS LIKE HE WAS IN WHEN I PUT MY FOOT ON THE GAS IT WOULD NOT GO IT WAS LIKE IT HAD A WHOLE BUNCH OF WEIGHT ON IT AND IT WAS LIKE NOT BEING ABLE TO EVEN DRIVE IS THAT THE ENGINE WAS LOCKED UP OR SOMEBODY HAD A CHAIN AROUND AROUND THE WHEELS WHO'S GOT A LOT GOING THIS WAS ON A HIGHWAY AND THEN I PULLED OVER NEAR SCHOOL BECAUSE I COULD NOT DRIVE THE CAR",
        "vin": "KM8JN12D96U"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/28/2020",
        "dateOfIncident": "08/25/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11351770,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WHILE FOOT ON BRAKE OR WHILE IN PARK ACCELERATES ON ITS OWN! I ALMOST GOT INTO AN ACCIDENT BECAUSE MY FOOT WAS ALL THE WAY ON THE BRAKE FOR CAR TO STOP BUT ENGINE WAS STILL INCHING FORWARD WHILE IN STOPPED POSITION! WHEN IT IS IN PARK IT TRIES TO ACCELERATE BUT ENDS UP STALLING OUT AND THEN IM UNABLE TO START BACK UP FOR ABOUT 10 MINUTES ALSO WHEN GOING A STEADY CITY WIDE SPEED MY CAR CHOOSES TO ACCELERATE WITHOUT MAKING IT DO SO THIS IS SCARY I HAVE 2 SMALL CHILDREN AND THIS IS DANGEROUS I HAVE CARRIED IT TO 2 DIFFERENT MACHANIC SHOPS ONE BEING FIRESTONE BEST OF THE BEST AND HAVE HAD DIOGNOSTIC TESTS CONDUCTED AND THEY ARE UNABLE TO FIND THE CAUSE OF MY ISSUE! IT HAPPENS AT VARIOUS TIMES I HAVE READ MANY OF THE SAME ISSUES HAPPENING ONLINE WITH THE TUSCONS AND SANTA FE THIS ISSUE NEEDS TO BE INVESTIGATED! I ALMOST HIT SOMEONE IN THE REAR END WITH MY FOOT COMPLETELY ON THE BRAKE! AND IT WAS AS IF I WAS FIGHTING WITH MY VEHICLE TO STOP",
        "vin": "KM8JN12D86U"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/05/2019",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11278301,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR SUBFRAME CROSSMEMBER AND PARKING BRAKE ARE COMPLETELY CORRODED. THIS WAS NOTICED WHILE CHANGING THE BRAKES ON NOV. 1ST 2019",
        "vin": "KM8JN12D06U"
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/09/2019",
        "dateOfIncident": "06/05/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11218831,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE DRIVING THE CAR WHEN THE REAR END STARTED SWAYING WHILE MAKING A LEFT TURN ONTO A BUSY MAIN STREET. WE HAD A MECHANIC SHOP LOOK UNDERNEATH AND THEY FOUND THAT THE ENTIRE REAR SUBFRAME HAD COME APART DUE TO CORROSION.",
        "vin": "KM8JM12B36U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/26/2019",
        "dateOfIncident": "08/13/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11191643,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY LIGHT INSIDE OF VEHICLE COMES ON AND STAY FOR A WHILE, THEN GOES OFF, THEN  ABOUT A MONTH LATER DO THE SAME.I WENT TO A DEALER, HE SAID TO FIX IT WOULD BE A CERTAIN AMONT, BUT I TOLD HIM NOT TO FIX IT CAUSE I DIDN' HAVE THE MONEY, SO HE CHARGED ME ABOUT $130.00 FOR CHECKING IT.",
        "vin": "KM8JM12B16U"
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/31/2019",
        "dateOfIncident": "01/24/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11173379,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR SUBFRAME HAS COLLAPSED AND DISCONNECTED FROM THE UNIBODY SUDDENLY DUE TO EXCESSIVE CORROSION. CAR IS ONLY 12 YEARS OLD AND ONLY HAS 150,000 MILES ON IT. COLLAPSE IS SUDDEN AND MAKES THE CAR DIFFICULT TO STEER AND CAN RESULT IN ERRATIC MOVEMENTS IN HANDLING.",
        "vin": "KM8JM12B36U"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/23/2019",
        "dateOfIncident": "01/23/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11171609,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI TUCSON. WHILE THE VEHICLE WAS IDLING IN THE PARK POSITION, IT STALLED. THE VEHICLE WAS RESTARTED, BUT IT STALLED AGAIN. THE CONTACT STATED THAT THE FAILURE OCCURRED SPORADICALLY FOR TWO AND A HALF YEARS. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO DETERMINED THAT THE AIR IDLE CONTROL VALVE FAILED AND NEEDED REPLACEMENT. THE VEHICLE WAS REPAIRED BACK IN MAY OF 2016, BUT THE FAILURE RECURRED. THE MANUFACTURER AND DEALER WERE NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 110,300.",
        "vin": "KM8JN12D16U"
    },
    {
        "components": "STEERING,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/11/2018",
        "dateOfIncident": "10/11/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11139902,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ONE DAY, I FELT MY CAR SHIFT AS IF THE WHEEL HAD SLIPPED, THIS OCCURRED MANY TIMES AFTER MAKING A TURN. I RECENTLY HAD WORK DONE TO THE FRONT (STRUT, TIE ROD, KNUCKLE, BALL JOINT) AND AM ALSO IN NEED OF A WHEEL ALIGNMENT. I WONDERED IF THIS WAS WHY, SO I CALLED THE MECHANIC BACK, BUT HE TOLD ME THAT IT WAS MY TIRES. HOWEVER THERE IS STILL A FAIR AMOUNT OF TREAD ON MY TIRES, SO I AM NOT SURE IF THATS REALLY TRUE. NEXT THING I KNOW, MY CAR ACCELERATED OUT OF NOWHERE AND WAS ALMOST LIKE DRIVING ITSELF AT 20MPH (THE SPEED IT WAS STUCK ON EVEN AFTER SLOWING DOWN). ALSO WHILE ON THE HIGH WAY IT DID THE SAME THING-- ACCELERATED ON ITS OWN AND JERKED TO THE RIGHT. I HAD TO PRETTY MUCH HURRY AND CATCH THE WHEEL BEFORE SLAMMING INTO ANOTHER CAR WHILE ON A TURN AND GOING ABOUT 55MPH. AT RANDOM TIMES IT WILL ACCELERATE AND PRETTY MUCH DRIVE ITSELF WHILE I AM DRIVING. I TYPICALLY HAVE TO APPLY PLENTY OF PRESSURE TO THE BRAKES TO KEEP IT FROM ROLLING WHILE I AM STOPPED. ALSO I AM HAVING AN ISSUE WITH OVERHEATING. IF I IDLE TOO LONG THE CAR WILL OVERHEAT, EVEN THOUGH THE TANK IS FULL. EVEN WITH ADDING MORE IN, THE TANK STAYS WHERE IT IS, IT DOESN'T OVERFLOW. IT'S ALMOST AS IF THE CAR IS JUST DRINKING IT BUT IT'S NOT FILTERING THROUGH THE HOSE IF THAT MAKES SENSE. LASTLY, THE CAR DID NOT WANT TO TURN ON THIS EVENING, AFTER ABOUT THE 5TH TIME I HELD IT LONGER THAN USUAL AND IT FINALLY PUTTERED TO LIFE RELUCTANTLY. I DON'T FEEL VERY SAFE IN THIS TRUCK ANYMORE.",
        "vin": "KM8JN72D66U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/14/2018",
        "dateOfIncident": "06/13/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11101869,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI TUCSON. WHEN THE CONTACT LOOKED UNDERNEATH THE VEHICLE, HE NOTICED THAT THE REAR AXLE WAS COMPLETELY RUSTED. THE DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STATED THAT THERE WAS NO RECALL. THE FAILURE WAS NOT DIAGNOSED OR REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 178,000. *TT      THE CONSUMER STATED TRADED IN THE VEHICLE DUE TO THE DEFECT. *TR",
        "vin": "KM8JM12B76U"
    },
    {
        "components": "STEERING,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/23/2018",
        "dateOfIncident": "05/23/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11097631,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN SLOWING OR IDLING THE CAR WILL STALL AND COME TO A STOP, UNABLE TO ACCELERATE AGAIN. AS THE CAR STALLS IT BECOMES VERY DIFFICULT TO STEER AND ALL THE DASHBOARD LIGHTS COME ON (CHECK ENGINE LIGHT, OIL LIGHT, EMERGENCY BREAK LIGHT, ETC). THIS USUALLY HAPPENS WHEN I AM SLOWING DOWN TO MAKE A TURN AND HAS HAPPENED ONCE ON THE HIGHWAY. VERY SCARY AND DANGEROUS TO COME TO A SUDDEN STOP WHILE TRYING TO TAKE AN EXIT ON THE HIGHWAY.",
        "vin": "KM8JN12D06U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/11/2018",
        "dateOfIncident": "03/01/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11093299,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG LIGHT CAME ON AND WILL NOT GO OFF. PROBLEM HAS BEEN OCCURRING FOR SEVERAL MONTHS. STATIONARY AND MOVING",
        "vin": "KM8JN72D56U"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/09/2018",
        "dateOfIncident": "04/26/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11092615,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AT AROUND 80,000 MILES A BRAKE LINE RUPTURED WHILE MY WIFE WAS BRAKING TO AVOID A TRUCK THAT HAD CUT IN FRONT OF HER. THE BRAKE PEDAL WENT TO THE FLOOR AND THE ENTIRE BRAKE SYSTEM SUBSEQUENTLY FAILED. THE TUCSON EVENTUALLY CAME TO A STOP. THE DRIVER'S FRONT BRAKE LINE HAD RUPTURED. THE VEHICLE HAD TO BE TOWED TO A QUALIFIED MECHANIC. WE'VE NOW REPLACED ALL THE BRAKE LINES HOWEVER NOW THE BRAKE PEDAL IS SPONGY AND DOES NOT STOP AS WELL.",
        "vin": "KM8JN72D76U"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/21/2018",
        "dateOfIncident": "04/16/2018",
        "fire": true,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11089202,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DRIVER SIDE DOOR CAUGHT ON FIRE",
        "vin": "KM8JN12D96U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/26/2018",
        "dateOfIncident": "03/04/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11081205,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI TUCSON. THE CONTACT STATED WHILE AT A STOP SIGN, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE FAILED TO RESTART. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT A ROD NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. A LOCAL DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND ADVISED THE CONTACT TO TAKE THE VEHICLE TO A LOCAL DEALER FOR DIAGNOSIS. THE FAILURE MILEAGE WAS 105,000. THE VIN WAS NOT AVAILABLE. *TT",
        "vin": "KM8JN120160"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/04/2017",
        "dateOfIncident": "09/07/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11043276,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "RUST ON THE LEFT REAR FRAME THAT NEEDS TO BE REPAIRED BEFORE IS FAILS, I AM NOT SURE WHAT THE OUTCOME WILL BE WHEN THIS PART OF FRAME FAILS.  HYUNDAI HAS YEARS OF RUST PROBLEMS THAT THEY DON'T SEEM TO WANT TO FIX AT THE DEALER LEVEL OR THE MANUFACTURING LEVEL UNLESS YOU HAVE THOUSANDS OF DOLLARS FOR REPAIRS OR PAY FOR RUST PROOFING AT YOUR EXPENSE WHEN YOU BUY THE CAR, THEY NEED A GOOD FINE SLAPPED ON THEM  TO WAKE THEM UP, MAYBE  THEN  THEY WILL STOP MAKING CARS THAT THEY WHAT YOU TO SCRAP AFTER 11 YEARS AND 144,000 MILES. THIS CAR WAS SERVICED BY THE DEALER WHERE IT WAS BOUGHT, BY THE BOOK AND THE BOOK AND THE DEALER SHOULD WARN THAT RUST NOT LACK OF SERVICE WILL CAUSE IT TO FAIL. PLEASE DO SOMETHING TO STOP THE RUST PARADE COMING FROM KOREA. LOOK UP HYUNDAI RUST PROBLEMS, THIS HAS BEEN HAPPENING OVER 16 YEAR TIME PERIOD, MAKE THEM REPAIR THIS AT THEIR EXPENSE AND MAYBE FIGURE OUT HAVE TO PREVENT IT BEFORE IT DOES SOME REAL HARM TO THE PUBLIC.",
        "vin": "KM8JN72D86U"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/15/2017",
        "dateOfIncident": "06/30/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11015375,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI TUCSON. WHILE DRIVING 35 MPH, THE GEAR SHIFTED WITHOUT NOTICE AND THE VEHICLE STALLED. THE VEHICLE WAS TAKEN TO A LOCAL DEALER (CLASSIC HYUNDAI LOCATED AT 8460 TYLER BLVD MENTOR, OH 44060 440-210-4114), BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE, BUT DID NOT OFFER ANY ASSISTANCE. THE FAILURE MILEAGE WAS 103,000.",
        "vin": "KM8JM12B66U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/16/2017",
        "dateOfIncident": "06/16/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11005592,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "STOP LAMP SWITCH MALFUNCTIONING CAUSING THE ILLUMINATION OF THE \"ESC\" (ELECTRONIC STABILITY CONTROL) INDICATOR LAMP IN THE INSTRUMENT CLUSTER TO STAY ON. THIS CONDITION ALSO OCCURRED ON MY 2008 HYUNDAI TUCSON FOR WHICH THERE WAS A RECALL.  THE PROBLEM WAS REPAIRED ON 5/23/2013 AT ADVANTAGE HYUNDAI IN HICKSVILLE, NY.  ATTACHED TO THIS COMPLAINT IS THE RECALL NOTICE FOR THE 2008 TUCSON AND THE REPAIR RECEIPT OF 5/23/13. I INQUIRED ON 6/25/2017 AS TO WHETHER THERE WAS A RECALL FOR THE 2006 TUCSON I OWN AND WAS INFORMED THAT THERE IS CURRENTLY NOT AN OPEN RECALL FOR THIS CONDITION. IT IS APPARENT TO ME THAT THIS ISSUE ALSO AFFECTS 2006 HYUNDAI  MODELS ALSO. I AM REQUESTING YOUR ASSISTANCE IN OPENING AN INVESTIGATION REGARDING MY 2006 HYUNDAI TUCSON AND FOR THIS MODEL TO BE INCLUDED IN THE AFFECTED GROUP AND FOR HYUNDAI TO CORRECT THE ISSUE ON MY VEHICLE.",
        "vin": "KM8JN72D56U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/30/2017",
        "dateOfIncident": "05/26/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10992198,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING NORMAL AND LOST CONTROL OF VEHICLE. WAS ABLE TO GET TO A SAFE SPOT. LOOKED UNDER VEHICLE AND FOUND REAR SUB-FRAME RUSTED THROUGH CAUSING UNSAFE CONDITION BY BREAKING THE MOUNTING POINT OF THE REAR TOE LINK",
        "vin": "KM8JN72D66U"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/25/2017",
        "dateOfIncident": "04/20/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10980456,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2006 HYUNDAI TUCSON. WHILE DRIVING APPROXIMATELY 5 MPH, A SECOND VEHICLE CRASHED INTO THE FRONT OF THE CONTACT'S VEHICLE. THE FRONT END OF THE VEHICLE SUSTAINED SEVERE DAMAGE. THE AIR BAGS DID NOT DEPLOY. THE VEHICLE WAS DESTROYED AND TOWED. THE DRIVER SUSTAINED HEAD, NECK, BACK, AND SHOULDER INJURIES. THE FRONT PASSENGER SUSTAINED INJURIES TO THE HEAD INJURY, NECK, AND BACK. MEDICAL ATTENTION WAS RECEIVED. A POLICE REPORT WAS FILED. THE CAUSE OF THE FAILURE WAS NOT DIAGNOSED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 158,000.",
        "vin": "KM8JN12D06U"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/01/2017",
        "dateOfIncident": "02/13/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10957871,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY ESC LIGHT COMES ON PERIODICALLY, TURN VEHICLE OFF AND IT GOES OUT, DRIVE SOME MORE, COMES BACK ON",
        "vin": "KM8JN12D76U"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/13/2017",
        "dateOfIncident": "02/13/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10954327,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 HYUNDAI TUCSON GLS 2.7L  HAS LEAKING VALVE COVER GASKET CAUSING OIL TO DRIP INTO THE ALTERNATOR CAUSING FAILURE OF ALTERNATOR.",
        "vin": "KM8JN12D26U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/10/2017",
        "dateOfIncident": "04/21/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10944105,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY AIR BAG LIGHT KEEPS COMING ON I HAVE HAD THE SENSOR CHANGED AT LEAST 4 TIMES MY HUSBAND BOUGHT A HYUNDAI AND IT IS DOING THE SAME THING. THEY TOLD ME NOW THAT I HAVE NO WARRANTY THAT I HAVE NO AIR BAGS IF THE LIGHT IS ON. WITH THIS HAPPENING SO OFTEN IT SHOULD BE A RECALL. IT STARTED RIGHT AFTER I BOUGHT THE CAR IN 2007.",
        "vin": "KM8JN72DX6U"
    },
    {
        "components": "SUSPENSION,STRUCTURE,WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/01/2016",
        "dateOfIncident": "08/30/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10903023,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI TUCSON. WHILE DRIVING IN REVERSE, AN ABNORMAL NOISE EMITTED FROM THE REAR OF THE VEHICLE. THERE WAS A VIBRATION FROM THE VEHICLE AND THE CONTACT NOTICED THAT THE WHEELS WERE LEANING SIDEWAYS. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE WHEEL CRADLE WAS RUSTED AND FRACTURED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 130,000.  UPDATED 01/27/17*LJ  THE CONSUMER STATED THE VEHICLE WAS REPAIRED AT THEIR EXPENSE. *TR",
        "vin": "KM8JN72D26U"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/14/2016",
        "dateOfIncident": "05/11/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10884711,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR HAS LESS THAN 3000 MILES, RANDOMLY WHEN I STOP ON A RED LIGHT, AND THEN TRY TO ACCELERATE THE CAR'S RPM CAN GO UP TO 3000/35000 BUT THE CAR WILL NOT MOVE. I PUT IT IN PARKING, AND THEN BACK IN DRIVE AND MOVES SLOWLY. THIS HAPPENED QUITE A FEW TIMES. I TOOK IT TO THE DEALER, THEY DROVE THE CAR AND TSAID THEY COULDN'T FIND ANYTHING.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/25/2016",
        "dateOfIncident": "01/01/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10876555,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "BATTERY DISCHARGES OVERNIGHT. SEEMS TO HAVE SOMETHING TO DO WITH THE ALARM SYSTEM, AS WHEN THE VEHICLE IS LOCKED IS WHEN THE BATTERY IS DEAD THE NEXT DAY. THIS HAPPENS EVEN WHEN A NEW BATTERY HAS BEEN INSTALLED.   DEALERSHIP HAS BEEN OF NO HELP,  SAME PROBLEM I WAS HAVING WITH MY 2007 HYUNDAI ENTOURAGE.",
        "vin": "KM8JN12D566"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/09/2016",
        "dateOfIncident": "03/09/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10845865,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTED IN DEC 2015 HAD PROBLEM STARTING CAR. ALL THE LIGHTS CAME ON THEN DIED. FINALLY STARTED TOOK IT TO THE MECHANIC FOR A DIAGNOSTIC TEST NO PROBLEM WAS FOUND. AFTER A WEEK SAME PROBLEM OCCURRED, I WAS TOLD TO PRESS ON THE GAS FOR A WHILE. WORKED, HOWEVER THREE MONTHS LATER, TRY TO START CAR ALL LIGHTS CAME ON THEN DIED. IF THE MANUFACTURER IS AWARE OF A PROBLEM INFORM THE CUSTOMERS. OBVIOUSLY THERE IS A PROBLEM. HELP US IDENTIFY AND SOLVE THE PROBLEM. COULD YOU IMAGINE GETTING READY TO GO TO WORK BUT THE CAR YOU DROVE YESTERDAY WOULD NOT START?  WHAT IS HAPPENING? ITS FRUSTRATING NOT KNOWING WHAT IS WRONG. WILL MY CAR START TODAY? IN ADDITION THE LIGHT COMES ON ABOUT THE PASSENGER AIRBAG IS OFF.",
        "vin": "KM8JM12B66U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/02/2016",
        "dateOfIncident": "02/27/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10839519,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG LIGHT IS ON. TOOK TO THE DEALER, WEBB HYUNDAI IN HIGHLAND, INDIANA. THEY SAID $502 TO FIX IT. IT'S A SAFETY ISSUE. LATER, THEY SAID SINCE I'M A LOYAL CUSTOMER (BOUGHT 5 HYUNDAI'S) THEY'D FIX IT FOR $177. IT'S A SAFETY ISSUE! MY WIFE DROVE THE CAR HOME. INVOICE SAYS \"CUSTOMER DECLINED REPAIR AT THIS TIME. VEHICLE IS UNSAFE TO DRIVE.\" SHE'S CRYING. EXTENDED WARRANTY EXPIRES IN 2 DAYS. CAR HAS 97000 MILES ON IT. HYUNDAI HAS LOST MY BUSINESS AND I WILL LET OTHERS KNOW ABOUT THEIR TREATMENT OF CUSTOMERS. I DON'T HAVE A FAX MACHINE TO SEND COPIES OF THE RECEIPTS.",
        "vin": "KM8JN72D16U"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/26/2015",
        "dateOfIncident": "07/24/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10759427,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY VEHICLE IN JULY AND IT WAS IN ABSOLUTELY WONDERFUL CONDITION MECHANICALLY AND PHYSICALLY.IT HAD ROUTINE MAINTENANCE PER THE CARFAX REPORT AND METICULOUS CARE BY ITS PREVIOUS OWNER, WITH MOSTLY \"HIGHWAY\" MILEAGE AND NEW TIRES. AFTER A LITTLE OVER A MONTH OF OWNERSHIP, I LIFTED THE REAR WINDOW AND FIRST ONE LATCH SNAPPED DUE TO COROSION, FOLLOWED BY THE SECOND AND THE WINDOW I CAUGHT LUCKILY IN MY HANDS!THANK GOODNESS I WAS NOT DRIVING ON THE HIGHWAY AND THIS WOULD HAVE HAPPENED, POSSIBLY CAUSING A SHATTERED WINDOW AND DANGEROUS CONDITIONS ON THE ROADWAY!I WAS QUOTED $70 PER LATCH FOR A REPLACEMENT BY THE LOCAL HYUNDAI DEALER PLUS INSTALLATION COSTS.I HAVE HAD HATCHBACK VEHICLES BEFORE AND HAVE NEVER HAD THIS HAPPEN REGARDLESS OF THE CAR'S AGE, AND ESPECIALLY FROM ONE TAKEN CARE OF SO UNBELIEVABLY WELL BY ITS ONLY OWNER. SINCE THIS OCCURRED I HAVE HEARD OF OTHER INSTANCES OF THIS WITH HYUNDAI TUCSONS AND THAT THEY ARE READILY KEPT IN STOCK-WHICH CAUSES ME TO BELIEVE THIS A COMMON OCCURRENCE AND POOR DESIGN.",
        "vin": "KM8JM12B86U"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "07/02/2015",
        "dateOfIncident": "06/12/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10731846,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON AN INTERSTATE THE \"AIR BAG\" LIGHT CAME ON.  EVENTUALLY DIAGNOSED SRS CODE B1706 \"PASSENGER BUCKLE PRETENSIONER RESISTANCE TOO HIGH\"  ADVISED AIR BAG MAY NOT DEPLOY PROPERLY OR AT ALL UNTIL REPAIRED.  ON VACATION AT THE TIME, NOT CLOSE TO A DEALER. PASSENGER SEAT BELT SYSTEM WILL HAVE TO BE REPLACED.",
        "vin": "KM8JN12D96U"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/15/2015",
        "dateOfIncident": "05/12/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10716713,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "NHTSA CAMPAIGN NUMBER: 09V122000 (APRIL 15, 2009)    ESC MALFUNCTION LIGHT AGAIN RANDOMLY ILLUMINATES.    MY VEHICLE WAS FIXED BACK IN 2009 AFTER RECEIVING THE REFERENCED RECALL NOTICE.  HOWEVER THE SAME PROBLEM HAS REAPPEARED.  I CONTACTED HYUNDAI ABOUT THE PROBLEM AND THEY REFUSE TO DO ANYTHING ABOUT IT.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/26/2015",
        "dateOfIncident": "09/24/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10678895,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DEAD BATTERY AFTER SITTING FOR 3 DAYS. REPLACED BATTERY. DEAD BATTERY AGAIN A FEW WEEKS LATER, AGAIN AFTER SITTING FOR A FEW DAYS. USED THE CAR A LOT OVER NEXT TWO MONTHS, SO CAR DIDN'T SIT IDLE MORE THAN TWO DAYS AT A TIME. THEN THE PROBLEM RECURRED WHEN NOT DRIVING THE CAR FOR A FEW DAYS. TOOK IT TO A HYUNDAI DEALER, WHO COULDN'T FIND ANY PROBLEM. CAR OK WHEN USING IT ON A REGULAR BASIS. THEN PARKED IT FOR A FEW DAYS, AND BATTERY DIED. TOOK IT BACK TO THE DEALER WHO STILL CAN'T FIND ANYTHING WRONG WITH THE ELECTRICAL SYSTEM. ONLY SOLUTION TO THE PROBLEM SEEMS TO BE TO DRIVE THE CAR EVERY DAY OR KEEP A TRICKLE CHARGER ON THE BATTERY WHEN THE CAR SITS FOR MORE THAN 2 DAYS.  *TR",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/13/2014",
        "dateOfIncident": "07/07/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10654662,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI TUCSON. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, THE ESC AND THE ABS WARNING LIGHTS ILLUMINATED. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE SWITCH ASSEMBLY STOP LAMP NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED UNDER NHTSA CAMPAIGN NUMBER: 09V280000 (EXTERIOR LIGHTING) HOWEVER, THE FAILURE RECURRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND STATED THAT THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 13V113000 (EXTERIOR LIGHTING , SERVICE BRAKES, HYDRAULIC). THE FAILURE MILEAGE WAS 58,197.",
        "vin": "KM8JN72D76U"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "11/12/2014",
        "dateOfIncident": "11/01/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10654447,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I PD A  HYUNDAI TUCSON DEALER A  $100.00 TO PUT A COMPUTER ON MY 2006 CAR TO FIND OUT WHY MY AIR BAG LIGHT WAS ON TOOK THEM JUST A FEW MINUTES TO TELL ME IT WAS THE SEAT BELTS WAS THE REASON THE LIGHT WAS ON AND IT WOULD ONLY COST $600.00 TO CHANGE THEM. I AM IN MY 70 TS ON FIXED INCOME AFTER MY MEDICARE I ONLY HAVE $400.00 SS  TO LIVE ON. THAT MEANS I WON'T EAT FOR 3 MOUTHS OR HAVE HEAT OR PAY ANY OTHER BILLS IF I WONT TO DRIVE MY CAR AND I LIVE A LONG FROM TOWN AND AM HANDICAPPED. THE DEALER TOLD ME THAT THE SEATBELT PROBLEM IS THE MOST REASON THE AIR BAG LIGHT COMES IN THIS CAR THEY CHANGE A DOZEN OR MORE A MONTH, HYUNDAI AND NTSB SHOULD BE ASHAMED TO LET THIS HAPPEN PLEASE HELP [XXX].    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "KM8JN72D26U"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "10/05/2014",
        "dateOfIncident": "10/03/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10641547,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I WENT TO PUT ON THE BRAKE TO PARK THERE WAS A SUDDEN ACCELERATION AND THE VEHICLE HIT THE BUILDING IN FRONT OF THE PARKING SPACE.   *TR",
        "vin": "KM8JM12B05U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/19/2014",
        "dateOfIncident": "03/10/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10637639,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI TUCSON. THE CONTACT STATED THAT THE PASSENGER SIDE AIR BAG INDICATOR CONTINUOUSLY ILLUMINATED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC FOR DIAGNOSTIC TESTING, BUT THE CAUSE OF THE FAILURE COULD NOT BE DETERMINED. THE MANUFACTURER WAS NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 25,000.",
        "vin": "KM8JM12B26U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/06/2014",
        "dateOfIncident": "04/09/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10631219,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG LIGHT ILLUMINATED, CAUSE IS FRONT PASSENGER SEAT WEIGHT SENSOR, THIS MEANS THE ENTIRE SEAT MUST BE REPLACED, I DON'T FEEL THAT WITH THE MILEAGE AS LOW AS IT IS, I SHOULD PAY FOR THIS REPAIR, WHY HASN'T THE  GOVERNMENT AGENCY (NHTSA) ISSUED A RECALL ON THIS VERY COMMON OCCURRENCE? MY MECHANIC TOLD ME  HE HAS REPLACED MANY (OVER 100). AT GREAT EXPENSE TO THE OWNERS. DEFECTIVE SAFETY PARTS FOR A CAR LIKE THIS, OUT OF WARRANTY BECAUSE OF AGE, NOT MILEAGE, SHOULD BE ON THE MANUFACTURER.  *TR",
        "vin": "KM8JM12B26U"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "08/01/2014",
        "dateOfIncident": "06/01/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10618104,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER READING IN THE PAPERS ABOUT 2006-200 SONATAS HAVING AN ISSUE WITH THE AIR BAG SENSOR INSIDE THE SEAT BELT BUCKLE, I BELIEVE IT SHOULD ALSO INCLUDE THE TUSCAN. I'VE HAD THIS ISSUE FOR SOME TIME NOW AND WAS TOLD BY THE DEALERSHIP THAT IT WAS NOT COVERED UNDER WARRANTY. THE AIR BAG WILL NOT DEPLOY IN AN EVENT OF AN ACCIDENT ON THE PASSENGER SIDE. THIS SEEMS TO BE A SENSOR ISSUE I AM SURE HYUNDAI IS AWARE ABOUT.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/28/2014",
        "dateOfIncident": "07/01/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10616696,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WILL INTERMITTENTLY NOT START HAVE INSIDE LIGHTS AND TRYS TO TURN OVER OR SOME TIMES NO POWER AT ALL .FOLLOWING HAVE BEEN CHECKED BATTERY OK ALTERNATOR OK STARTER OK CABLES AND FUSES BUT HAVE HAD TO JUMP EVERY DAY FOR THREE  WEEKS THIS SUCKS AND VERY FRUSTRATING. DEALER KEEPS TELLING ME NOTHING IS WRONG WITH CAR.     *JS",
        "vin": "KM8JN12D36U"
    },
    {
        "components": "AIR BAGS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/28/2014",
        "dateOfIncident": "07/25/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10616778,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI TUCSON. THE CONTACT STATED THAT THE AIR BAG WARNING LIGHT ILLUMINATED. ADDITIONALLY, THE VEHICLE WOULD STALL SPORADICALLY.  THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE ENTIRE PASSENGER SIDE AIR BAG ASSEMBLY NEEDED TO BE REPLACED.  THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 68,757.     UPDATED 9/4/14*CN",
        "vin": "KM8JN12DX6U"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "07/26/2014",
        "dateOfIncident": "01/06/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10616538,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER READING ABOUT THE HYUNDAI SONATAS PROBE (2006 - 2008), I BELIEVE THE PROBE SHOULD EXPAND TO INCLUDE MY 2006 HYUNDAI TUSCON.  SINCE JANUARY OF 2014, MY PASSENGER SEAT INDICATOR LIGHT ( ON THE DASH BOARD) HAS BEEN ON SAYING \"PASSENGER AIR BAG OFF\".  EVEN WHEN SOMEONE IS PRESENT IN THE SEAT AND THE SEAT BELT IS FASTENED.  I TOOK THE CAR TO MY HYUNDAI DEALER AND THEY TOLD ME A SENSOR IN THE BUCKLE HAS GONE OUT AND THE AIR BAG WILL NOT DEPLOY IF NEEDED.  THEY TOLD ME THE REPLACEMENT COST IN $600, WHICH I CAN NOT AFFORD TO HAVE REPLACED.  THIS LEAVES MY FAMILY IN DANGER IF AN ACCIDENT SHOULD OCCUR.  *TR",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/07/2014",
        "dateOfIncident": "07/07/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10608548,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2006 TUCSON HAS FAILED TO START MULTIPLE TIMES.  IT CRANKS, BUT DOESN'T START.  DEALER HAS REPLACED THE FUEL PUMP 4 OR 5 TIMES, AND IT THEN WORKS, BUT THE PUMP KEEPS FAILING.  SOME TIMES THE PUMP LASTED OVER A YEAR, AND OTHER TIMES THE PUMP HAS FAILED WITHIN A COUPLE OF MONTHS.    *JS",
        "vin": "KM8JM12B26U"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/02/2014",
        "dateOfIncident": "04/14/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10595664,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ESC LIGHT WILL RANDOMLY LIGHT UP. IF I STOP MY CAR AND RESTART IT, IT WILL GO AWAY - BUT EVENTUALLY REAPPEARS. I KNOW I HAVE HAD THIS FIXED YEARS AGO AND IT IS DOING IT AGAIN? IS THIS COVERED IN A CURRENT RECALL?  *TR",
        "vin": "KM8JN12D96U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/07/2014",
        "dateOfIncident": "05/26/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10587058,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "BATTERY POWER LOST WHEN CAR PARKED FOR TWO DAYS OR MORE NUMEROUS TIMES.  ONCE WHILE BRIEFLY PARKED FOR 15 MINUTES AFTER AN HOUR DRIVE, I PARKED TO MAKE THE CALL IN A REMOTE AREA USING CAR PHONE PLUGGED INTO CIGARETTE LIGHTER.  NO CELL SERVICE THERE AND HAD TO WALK TO A LOCAL RANCH FOR HELP AND A JUMP.   BATTERY REQUIRED REPLACEMENT FREQUENTLY. DEALER TESTED ON TWO OCCASIONS AND THEY COULD NOT RESOLVE, REPLACED BATTERY TWICE. IVE REPLACED BATTERIES NUMEROUS OTHER TIMES AT LEAST EVERY TWO YEARS.  LAST VISIT BY AAA TESTED 1 AMP HIGH RESISTANCE SHORT IN ELECTRICAL SYSTEM BUT GOOD RELATIVELY NEW BATTERY.  I NOW CHARGE THE BATTERY ABOUT THREE TIMES A YEAR WITH A BATTERY CHARGER, TAKING APPROXIMATELY 8 HOURS OF CHARGE WHEN THE BATTERY IS DEAD AT HOME. I DO NOT DRIVE VERY FAR OUT OF FEAR THAT I'LL BE STRANDED. I'VE USED UP MY 3 ALOTED AAA VISITS ON THIS PROBLEM.   *TR",
        "vin": "KM8JN72D96U"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "03/20/2014",
        "dateOfIncident": "03/16/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10573800,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING IN A WINTER STORM AND HIT ICE AND THEN WENT THROUGH A WOODEN FENCE AND THE AIR BAGS DID NOT GO OFF. I HIT MY HEAD AND THE SEAT BELT LEFT A BRUISE.  *TR",
        "vin": "KM8JN12D26U"
    },
    {
        "components": "EXTERIOR LIGHTING,AIR BAGS,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/03/2014",
        "dateOfIncident": "01/01/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10566909,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT MY 2006 HYUNDAI TUCSON WHEN IT WAS 1 YR OLD AND HAD 25,000 MILES ON IT. IT IS NOW MARCH 2014 AND THE CAR IS 7-8 YRS OLD AND ONLY HAS A TOTAL OF 55,000 MILES ON IT. IT HAS ONLY BEEN DRIVEN GENTLY AND IN GOOD DRIVING CONDITIONS AND RARELY A POTHOLE HAS IT HIT. I DON'T REMEMBER THE EXACT TIME THINGS STARTED, MAYBE A YEAR AFTER I BOUGHT IT, BUT I HAD PROBLEMS WITH MY ESC LIGHT COMING ON AND THE TMS COMING ON - THEY WOULD GO ON AND OFF RANDOMLY AND I EVENTUALLY GOT THEM FIXED - I THINK THOSE WERE UNDER WARRANTY, NOT SURE. BACK IN EARLY 2013 MY AIR BAG LIGHT CAME ON. THIS REALLY STRESSED ME OUT - FOUND MONEY TO BORROW. I TOOK IT IN AND ASKED IF THERE WAS A RECALL AND THEY TOLD ME IT HAD EXPIRED. I PAID $1700 TO HAVE THAT FIXED. I SEE RECALLS DON'T EXPIRE - DO I HAVE A CASE AGAINST THEM TO GET MY MONEY BACK? ALSO, NOW MY ESC LIGHT IS STARTING TO COME ON AGAIN. SOME TIMES 5 MINS OR SO AFTER STARTING THE CAR AND SOMETIME UPON TURNING ON THE HEADLIGHTS. I AM SO SICK AND TIRED OF ALL THESE ELECTRICAL PROBLEMS ON A VEHICLE THAT ONLY HAS 55,000 MILES ON IT. IT IS NOT CHEAP TO FIX REGARDLESS OF THE CARS AGE, THERE IS LITTLE MILES ON IT. DO I HAVE ANY RECOURSE WITH THESE ISSUES? I AM ON FIXED INCOME AND CANNOT PAY ANOTHER DIME TOWARDS FIXING THESE REPETITIVE WARNING198088 LIGHT ISSUES. THESE CARS ARE STEALING FROM US, WHAT SHOULD BE WORKING TO BEGIN WITH... THANKS - HOPE YOU HAVE GOOD NEWS FOR ME. ESPECIALLY ABOUT REFUNDING THE $1700. IF I HAVE TO PAY FOR THE ESC IT WON'T GET FIXED, IT WILL ONLY BREAK AGAIN.  *TR",
        "vin": "KM8JN12D96U"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/10/2014",
        "dateOfIncident": "02/08/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10563702,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL-THE CONTACT OWNS A 2006 HYUNDAI TUCSON. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 65 MPH. THE VEHICLE SUNROOF DISENGAGED FROM THE VEHICLE AND FLEW OFF. THE VEHICLE HAD NOT BEEN TAKEN TO AN DEALER OR AN INDEPENDENT MECHANIC FOR DIAGNOSIS OR REPAIRS. THE MANUFACTURER WAS MADE AWARE OF THE PROBLEM. THE APPROXIMATE FAILURE MILEAGE WAS 150,000.LJ",
        "vin": "KM8JN12D16U"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/16/2014",
        "dateOfIncident": "01/01/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10560191,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR SEEMS TO HAVE A FRAME LEAK SOMEWHERE - MY VEHICLE CARPET STAYS WE (EVEN AFTER DRYING OUT).  *TR",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/21/2013",
        "dateOfIncident": "09/21/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10544765,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BRAKE LIGHTS FAIL TO ILLUMINATE WHEN THE BRAKE PEDAL IS DEPRESSED OR THE BRAKE LIGHTS REMAIN ILLUMINATED WHEN THE BRAKE PEDAL IS RELEASED. THE ELECTRONIC STABILITY CONTROL (ESC) MALFUNCTION LIGHT STAYS ILLUMINATED.THIS ISSUE IS RELATED TO RECALLS  NO. 09V280000, AND 09V122000.  MY VEHICLE WAS MANUFACTURED 03/2006, AND WHEN I REPORTED IT TO HYUNDAI CUSTOMER SERVICE, THEY SAID IT WAS IN FACT CAMPAIGN 092, BUT THAT THEY DID NOT \"RECEIVE ENOUGH COMPLAINTS ABOUT THIS YEAR OF VEHICLE FOR THIS ISSUE SO THERE ARE NO OPEN RECALLS FOR THIS VIN.\"  IN OTHER WORDS...THEY DECIDED NOT TO HONOR THE RECALL BECAUSE IT IS \"VOLUNTARY,\" AND ANY COSTS ASSOCIATED WITH FIXING IT WILL BE OUT OF MY POCKET.",
        "vin": "KM8JN72D76U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/09/2013",
        "dateOfIncident": "06/01/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10542682,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI TUCSON. THE CONTACT STATED THAT WHILE BRAKING FOR A TRAFFIC STOP AT 30 MPH, THE BRAKE LIGHT LAMP FAILED TO ILLUMINATE UPON ENGAGING THE BRAKES. THE CONTACT WAS ALERTED BY ANOTHER DRIVER REGARDING THE BRAKE LIGHT DEFECT. THE CONTACT REFERENCED NHTSA CAMPAIGN ID NUMBER: 09V280000 (EXTERIOR LIGHTING) AND CONTACTED THE MANUFACTURER, WHO STATED THAT THE VIN WAS NOT INCLUDED IN THE RECALL. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHERE THE BRAKE STOP LAMP SWITCH WAS REPLACED. THE THE FAILURE MILEAGE WAS UNAVAILABLE.",
        "vin": "KM8JN72D06U"
    },
    {
        "components": "SUSPENSION,POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/15/2013",
        "dateOfIncident": "08/05/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10535451,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER TAKING LEFT TURN THE REAR END STARTED TO SHAKE HAD CAR TOWED TO GARAGE WHERE IT WAS FOUND THE REAR SUB FRAME HAD COMPLETE BROKEN OFF.  *TR",
        "vin": "KM8JN72D86U"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/12/2013",
        "dateOfIncident": "07/30/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10534937,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI TUCSON. THE CONTACT STATED WAS DRIVING 35 MPH AND CRASHED INTO THE REAR BUMPER OF A PRECEDING VEHICLE. THE AIR BAGS FAILED TO DEPLOY. THE CONTACT SUSTAINED INJURIES TO THE MOUTH AND KNEE.  THE FRONT PASSENGER WAS THROWN FROM THE VEHICLE AND THROUGH THE FRONT WINDSHIELD, SUSTAINING INJURIES TO THE EYES. A POLICE REPORT WAS FILED. THE VEHICLE WAS DESTROYED AND TOWED TO A SALVAGE YARD. THE MANUFACTURER WAS NOT NOTIFIED OF THE AIR BAG FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 85,000.",
        "vin": "KM8JN72D26U"
    },
    {
        "components": "POWER TRAIN,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/09/2013",
        "dateOfIncident": "06/28/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10534435,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING HOME FROM WORK FRIDAY AFTERNOON JUNE 28TH AND SHORTLY AFTER I TURNED ONTO A SMALL ROAD TO GO HOME I HEARD A VERY LOUD NOISE COMING FROM THE REAR OF MY VEHICLE. I WAS EXTREMELY SCARED TO DRIVE IT THE REST OF THE WAY HOME, BUT MANAGED TO MAKE IT HOME VERY SLOWLY. THE NEXT DAY I TOOK IT TO MY LOCAL DEALERSHIP AND THEY HAD NO CLUE WHAT WOULD BE MAKING THIS LOUD RATTLING/BANGING NOISE IN THE REAR OF MY SUV. WHEN THEY LIFTED MY VEHICLE HERE THE EVAP CANISTER BRACKET RUSTED AND SNAPPED OFF, WHICH MADE THE EVAP CANISTER ITSELF BOUNCE OFF OF THE DRIVE SHAFT MAKING THE NOISE THAT CAME FROM THE REAR OF MY VEHICLE. THEY SHOWED ME THE UNDERSIDE OF MY VEHICLE AND WHERE ALL THIS WAS TAKING PLACE, BUT WHILE LOOKING AT THE UNDERSIDE IT MADE ME CONCERNED ABOUT ALL OF THE OTHER RUST AREAS UNDERNEATH MY CAR. THINKING ABOUT IT NOW, MY FOUR WHEEL DRIVE HAS DISENGAGED THIS PAST WINTER AND IT MAKES ME THINK IF IT POSSIBLY HAS RUSTED APART, I WILL GET THE MECHANICS TO INSPECT THAT FURTHER FOR ME, I DO NEED TO GET THAT FIXED BEFORE THIS COMING WINTER ARRIVES.  I KNOW MY CAR IS A 2006, BUT SHOULD PIECES OF MY VEHICLE BE RUSTING OFF ALREADY? SHOULD I BE CONCERNED ABOUT THE REST OF THE RUST DAMAGE UNDERNEATH MY CAR?  *TR",
        "vin": "KM8JN72D26U"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "06/25/2013",
        "dateOfIncident": "09/28/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10521729,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS PREPARING TO PULL INTO A PARKING SPACE IN A PARKING GARAGE WHEN THE CAR SUDDENLY WENT INTO RAPID ACCELERATION. IT SMASHED INTO THE CEMENT WALL OF THE PARKING SPACE AND SURGED FOR A FEW SECONDS BEFORE I COULD GET THE KEY TURNED OFF. THE SUDDEN RAPID ACCELERATION OCCURRED AGAIN WHILE IN IDLE AT A STOP LIGHT AND MY FOOT WAS NOT ON THE THROTTLE.THIS OCCURRED SEVERAL MONTHS LATER WHEN THE MILEAGE REGISTERED APPROXIMATELY 36750. THIS TIME THE SURGING LASTED SEVERAL SECONDS AFTER APPLYING THE BRAKES AND PUTTING IT INTO PARK TO STOP THE FORWARD MOTION BEFORE HITTING THE CAR IN FRONT OF ME.  *TR",
        "vin": "KM8JN72DX6U"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/17/2013",
        "dateOfIncident": "06/14/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10520205,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS ON A MOUNTAIN ROAD ON THE WAY TO SHAVER LAKE, WHEN SUDDENLY THE RIGHT FRONT WHEEL LOCKED UP PULLING THE CAR HARD TO THE RIGHT.  I WAS LUCKY I WAS ONLY DOING 25 MPH OTHER WISE IT COULD HAVE ROLLED THE CAR.  THIS HAPPEN 3 MORE TIMES IN A MATTER OF MINUTES.  I NOTICED THEY HAVE A RECALL ON THE ESC FOR 2005 MODELS BUT NOT FOR 2006.  I HAVE ONLY HAD THE CAR A WEEK!  PURCHASED USED.   INTERESTING FACT IS STEVENS CREEK HYUNDAI IN SANTA CLARA NEW ABOUT THIS ISSUE AND DID NOT LIST IT ON THE CAR FAX REPORT.   THAN TOOK THE CAR IN ON TRADE IN AND SOLD IT AT AUCTION KNOWING ABOUT THIS SAFETY ISSUE.  I HAVE THE PAPER WORK TO PROVE THIS AS WELL.  *TR",
        "vin": "KM8JN12D66U"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/13/2013",
        "dateOfIncident": "05/01/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10511674,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WENT TO OPEN TAILGATE WINDOW AND THE HINGES WERE COMPLETELY CORRODED OFF.  I HAVE PARKED CAR IN GARAGE SINCE IT WAS NEW.  APPEARS TO BE A DEFECT AND IS EXTREMELY DANGEROUS AS THE WINDOW COULD END UP FLYING OFF THE CAR WHILE DRIVING CAUSING A POTENTIAL ROAD HAZARD/ACCIDENT IF UNNOTICED.  *TR",
        "vin": "KM8JN72D06U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/11/2013",
        "dateOfIncident": "01/09/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10492310,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ESC OFF LIGHT COMES ON THE DASH. ALSO WHEN THE LIGHTS ARE OFF AND THE BRAKE IS PRESSED THE DASH LIGHTS COME ON. TOOK THE CAR TO THE SHOP TODAY. THEY REPLACED, THE SWITCH ASSY-STOP, THE CODE WAS C1513. PROBLEM IS NOT FIXED. THERE IS A RECALL BUT THEY ARE TELLING ME MY CAR IS NOT UNDER THE RECALL.  *TR",
        "vin": "KM8JN12D36U"
    },
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "12/10/2012",
        "dateOfIncident": "09/04/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10487848,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING IN TRAFFIC ON A TWO LANE ROAD. I HEARD A LOAD BANG AND MY CAR BEGAN TO SPEED UP. I TRIED BRAKING BUT I COULD NOT SLOW OR STOP THE CAR. WITH TRAFFIC IN FRONT OF ME I PULLED INTO THE LEFT LANE NOT SEEING ANY ONCOMING TRAFFIC. THEN A CAR WAS COMING IN THAT LANE SO I THREW THE CAR INTO PARK AND PULLED UP ON EMERGENCY BRAKE. SINCE IT WAS RAINING, THE REAR END OF THE CAR CAME AROUND AND I GOT HIT ON THE PASSENGER SIDE REAR DOOR. THE CAR FINALLY STOPPED AGAINST A FENCE WITH THE ENGINE STILL RACING.  *TR",
        "vin": "KM8JN72D36U"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,STRUCTURE,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/23/2012",
        "dateOfIncident": "05/31/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10472103,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN TURNING RIGHT ON A RAINING DAY, LOSS OF POWER - NO STEERING OR BRAKES. 2006 TUSCON WOULD RUN RADIO WOULD BE ON - BATTERY LIGHT AND BRAKE LIGHTS ON - 10 SECONDS AFTER MANAGING TO GET OUT OF TRAFFICS WAY - CAR WOULD MOVE. HYUNDAI FOXED THE CAR BY REPLACING SENSORS AND SOME OTHER WORK RESULTING IN OVER A $1000. PRIOR MAJOR SERVICE WAS SERPENTINE BELT AND CHAIN REPLACEMENT ON SERVICE RECOMMENDATIONS - HAD NO ISSUES BEFORE THE CHAIN WAS REPLACED. EVER SINCE - THE TRANSMISSION HAD TO RESET FOR HESITATION BETWEEN 20 AND 40 MPH AND THE ADDITIONAL SENSOR WORK. HYUNDAI WOULD NOT GIVE ME ANY WARRANTY WORK AS MY 6 YEARS HAD JUST EXPIRED. I AM TAKING THE CAR BACK IN TOMORROW FOR THE SAME ISSUE. WHILE DRIVING TODAY IN A SUDDEN DOWN POUR - THE FIRST ONE SINCE I HAD THE CAR FIXED THAT I HAVE HAD TO DRIVE IN AND THE INCIDENT OCCURRED AGAIN EXCEPT THIS TIME I WAS DRIVING AND NOT TURNING. WATER SEEMED TO GET UNDER THE ENGINE AND SOMETHING IS GETTING WET. I REQUESTED A RENTAL CAR AND I AM LEAVING FOR VACATION ON SATURDAY TO THE SHORE. IF ITS NOT FIXED THIS TIME - I MAY HAVE TO CONSIDER A NEW CAR AND I JUST PAID IT OFF.  *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/14/2012",
        "dateOfIncident": "12/14/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10461765,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI TUCSON. THE CONTACT STATED THAT AFTER HAVING THE VEHICLE SERVICED UNDER NHTSA CAMPAIGN I.D. NUMBER  06V445000 ( AIR BAGS:FRONTAL:DRIVER SIDE INFLATOR MODULE)  THE AIR BAG WARNING LIGHT CONTINUED TO ILLUMINATED. THE CONTACT TOOK THE VEHICLE BACK TO THE DEALER FOR A DIAGNOSTIC TEST AND THE DEALER ADVISED THAT THE SEAT BELT CAUSED THE AIR BAG LIGHT TO ILLUMINATE AND THE SEAT BELT NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 62,000.  UPDATED 07/02/12 *BF  THE CONSUMER STATED AFTER THE RECALL WAS SUPPOSEDLY FIXED, THE AIR BAG LIGHT ILLUMINATED AGAIN. UPDATED 07/05/12",
        "vin": "KM8JN12D86U"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/29/2012",
        "dateOfIncident": "10/20/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10459925,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2006 HYUNDAI TUCSON. THE CONTACT STATED THAT A LOUD BANG WAS HEARD FROM THE VEHICLE JUST AS IT STALLED. THE CONTACT TOOK THE VEHICLE TO A MECHANIC AND WAS TOLD THAT THE UPPER ENGINE SEIZED BECAUSE THE PISTONS HAD FAILED AND THE ENGINE WOULD NEED REPLACING. THE CONTACT WAS NOT SURE IF THE LOWER ENGINE WAS DAMAGED BY THE FAILURE OF THE UPPER PART OF THE ENGINE.  THE FAILURE AND CURRENT MILEAGE WAS 130,000.",
        "vin": "KM8JN12D36U"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/21/2012",
        "dateOfIncident": "05/02/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10459096,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI TUCSON. THE CONTACT STATED WHILE DRIVING 15 MPH THE PASSENGER FRONT TIE ROD AND CONTROL ARM FAILED. THE VEHICLE WAS TOWED TO A LOCAL MECHANIC. THE LOCAL MECHANIC STATED THAT THE FAILURE WAS A COMMON FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE CONTACT STATED  THE FAILURE WAS DUE TO A DEFECT IN THE MATERIAL. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGE WAS 72,000.    UPDATED 07/05/12*LJ",
        "vin": "KM8JN72D76U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/29/2012",
        "dateOfIncident": "04/03/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10456809,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THE TUSCON USED APPROX. 2.5 MONTHS PRIOR TO THE FIRST INCIDENT. AFTER WORK I WENT TO START MY VEHICLE AND IT WOULD NOT CRANK. I HAD TO HAVE A TOW TRUCK COME \"JUMP\" MY VEHICLE.  I WENT TO AN AUTO PARTS STORE AND WAS TOLD THE BATTERY WAS BAD. I REPLACED THE BATTERY. THE NEXT DAY, WHEN I WENT TO LEAVE WORK, THE VEHICLE AGAIN WOULD NOT START. I HAD TO HAVE A \"JUMP\" A SECOND TIME. I TOOK THE VEHICLE BACK TO AN AUTO PARTS STORE AND WAS TOLD THE BATTERY WAS FINE, AND THE ALTERNATOR WAS BAD. I REPLACED THE ALTERNATOR. TWO WEEKS AFTER REPLACING THE ALTERNATOR, I AGAIN HAD TO HAVE THE VEHICLE \"JUMPED.\" I WENT TO AN AUTO PARTS STORE AND WAS TOLD THAT THE ALTERNATOR, WHICH WAS BRAND NEW, WAS BAD.  I CONTACTED THE HYUNDAI DEALERSHIP AND WAS TOLD THEY HAVE NOT HEARD OF SOMETHING CAUSING THE ALTERNATORS TO GO BAD LIKE I WAS DESCRIBING.  *TR",
        "vin": "KM8JN12D16U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/17/2012",
        "dateOfIncident": "05/10/2006",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10452056,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER A MONTH, BETWEEN TIME SHUT DOWN WHILE YOU ARE DRIVING, IN 6 YEARS, I TOOK IT  TO THE DEALER, BECAUSE THIS ONLY HAPPENS ON A WHILE SOMETIME ONCE ON SIX MONTH, THEY NEVER FOUND ANYTHING, COUPLE YEARS AFTER THIS HAPPENS THEY CHANGE THE OXYGEN SENSOR, BUT THE NEXT DAY HAPPENS AGAIN.  I TOOK IT BACK BUT THEY SAID THEY CHANGE THE OXYGEN SENSOR ALREADY, I TOLD HAPPENS AGAIN, THEY VERIFY AND BECAUSE DID NOT HAPPENS THERE THEY SAID NOTHING THEY CAN DO, I TOOK TO ADVANCE AUTO PARTS, THEY CHECK IT OUT COMPLETELY TOO AND DID NOT FIND ANYTHING NEITHER.  FIRST IF I TURN IT BACK, THEY CROSS MY CREDIT AND I CAN NOT SELL NEITHER BECAUSE SOMEBODY CAN GET HURT ON IT AND I HAVE TO LET THEM KNOW AND NO BODY WANT THIS KIND OF CAR PROBLEM NEITHER.  AS HISTORY, MY WIFE WAS DRIVING ON HIGH WAY AT 65 MILES AND THE SUV SHUT DOWN RUNNING, SHE WAS SO SCARE DUE RISK SHE TOOK ON IT. NOW SHE SCARE DRIVE IT.  TO ME HAPPENS A LOT OF TIME, STILL NO DOING ALL THE TIME, JUST ONCE A DAY, WEEK, MONTH.  SOME TIME DOING FOR TWO OR THREE WEEKS COUPLE TIME A DAY AND STOP DOING FOR THE NEXT 6 OR 7 MONTH.  COULD YOU HELP ON THIS, LET THE PUBLIC KNOW ABOUT THIS ISSUE.  I SAW IN NET PEOPLE COMPLAINING ON THE SAME ISSUE.  AS EXAMPLE: HTTP://TOWNHALL-TALK.EDMUNDS.COM/DIRECT/VIEW/.F1F2C57.  *TR",
        "vin": "KMBJN12D16U"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ELECTRICAL SYSTEM,EXTERIOR LIGHTING,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/06/2012",
        "dateOfIncident": "03/17/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10446806,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "FIRST INCIDENT OCCURRED-WHEN I LIVED IN FREDERICKSBURG,VA -I WAS DRIVING ON RT 1 GOING DOWNHILL TOWARD A STOP LIGHT(NO VEHICLE IN FRONT OF ME).  AS I WAS COMING TO A STOP AT THE LIGHT THE VEHICLE BRAKES WERE PRESS DOWN AS FAR AS IT COULD GO AND I HEAR A CLICKING NOISE ON THE PANEL WHICH WAS THE ESC LIGHT.  I HAD TO TURN THE CAR OFF AND PUT IT IN PARK TO START IT, IN ORDER TO CONTINUE TO DRIVE.  THIS HAS HAPPENED A  COUPLE OTHER TIMES. TIRES HAVE BEEN REPLACED COUPLE OF TIMES AND BRAKE PADS BECAUSE OF GROVES AND GRINDING NOISE. NOW I'M HAVING PROBLEMS WITH MY CAR WON'T START - HAD BATTERY CHECKED AT ADVANCED AUTO AND ITS GOOD. ESC LIGHT ON WITH CLICKING NOISE WHEN ATTEMPT TO START CAR.  NOW THAT MY VEHICLE HAVE ALMOST 123,000 MILES, I FOUND A RECALL NHTSA: 09V122000.  CALLED HYUNDAI CUSTOMER ASSISTANCE CENTER 1-800-633-5151 THIS MORNING AT 08:18 AM EASTERN STANDARD TIME, I ADVISE THE REPRESENTATIVE THAT I HAD BEEN HAVING PROBLEM WITH MY VEHICLE AS DESCRIBED IN THIS RECALL.  SHE SAID MY VEHICLE IS NOT ELIGIBLE BECAUSE IT WAS NOT IN THE LIST OF VIN'??S THEY HAD COMPLAINTS. SHOULD THE RECALL HAVE A CUT OFF BECAUSE OF MILEAGE, IS THERE A DETERMINATION THAT THE PROBLEM WAS CORRECTED IN MY VEHICLE BY VIN, DOES IT PERTAIN TO VEHICLE MANUFACTURED IN A PARTICULAR REGION OF THE US, OVERSEAS OR DEFECTIVE PARTS ON THE VEHICLE.   SECOND OWNER OF VEHICLE, PURCHASED VEHICLE FROM HYUNDAI CERTIFIED DEALER WHEN RETURNED FROM DEPLOYMENT.  I'??M A VETERAN AND THE VEHICLE HAS A LOT OF HIGHWAY MILEAGE TO AND FROM THE NEAREST VA MEDICAL HOSPITAL, VA COMMUNITY OUT-PATIENT BASE CLINIC, AND OTHER MEDICAL SERVICES.  *TR",
        "vin": "KM8JN72D06U"
    },
    {
        "components": "STEERING,POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/01/2011",
        "dateOfIncident": "12/01/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10438036,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TURNING INTO MY CARPORT, MY ENGINE STALLED. RIGHT BEFORE I TURNED, I TOOK MY FOOT OFF THE ACCELERATOR AND THE CAR HESITATED AND LURCHED FORWARD. THIS COULD BE A POTENTIALLY DANGEROUS PROBLEM IF MY CAR STALLS ON THE ROAD AND SOME OTHER DRIVER REAR ENDS ME.  *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/10/2011",
        "dateOfIncident": "07/28/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10435150,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI TUCSON. THE VEHICLE WAS INCLUDED IN THE RECALL UNDER NHTSA CAMPAIGN ID NUMBER: 06V445000 (AIR BAGS:FRONTAL:DRIVER SIDE INFLATOR MODULE) AND WAS REPAIRED. AFTER THE REPAIR, THE AIR BAG WARNING LIGHT WAS ILLUMINATED ON THE INSTRUMENT PANEL. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSTIC TESTING AND THE TECHNICIAN STATED THAT THE TWO FRONT PASSENGER SIDE IMPACT SENSORS WOULD HAVE TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 32,875.",
        "vin": "KMHJN72D56U"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/22/2011",
        "dateOfIncident": "05/15/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10414652,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS A PASSENGER IN A HYUNDAI TUCSON INVOLVED IN AN ACCIDENT ON MAY 15, 2011.  MY CAR WAS HIT ON THE PASSENGER SIDE AT THE FRONT WHEEL WELL.  THE CAR WAS TOTALLED AS A RESULT OF THIS ACCIDENT, YET NONE OF THE AIR BAGS DEPLOYED.  *TT",
        "vin": "KM8JM12B26U"
    },
    {
        "components": "STEERING,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/26/2011",
        "dateOfIncident": "05/24/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10402889,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "CRANKSHAFT BALANCER/PULLEY SEPARATION CAUSES SERPENTINE BELT FAILURE AND LOSS OF POWER STEERING.  THE CRANKSHAFT PULLEY ON SEVERAL HYUNDAI MODELS WITH THE 2.7 LITER ENGINE APPEARS TO HAVE A HIGH FAILURE RATE. THE PULLEY IS MADE OF AN INNER AND OUTER METAL RINGS JOINED WITH AN ELASTOMERIC COMPOUND. WHEN THE ELASTOMERIC COMPOUND FAILS THE OUTER RING SLIPS AND WORKS OFF THE INNER PULLEY CAUSING THE SERPENTINE BELT TO BIND AGAINST THE ENGINE BLOCK A OR ACCESSORY MOUNTING BRACKETS RESULTING IN A CATASTROPHIC FAILURE. IN ALL CASES THE FAILURE RESULTS IN A LOSS OF DRIVE TO ALL ACCESSORIES INCLUDING THE POWER STEERING PUMP.  I HAVE FOUND NUMEROUS ARTICLES/BLOGS ABOUT THIS ISSUE INCLUDING THIS VIDEO ON YOUTUBE WWW.YOUTUBE.COM /WATCH?V=X5KZZ1TMJ8Y .  *TR",
        "vin": "KM8JN72D86U"
    },
    {
        "components": "EQUIPMENT,CHILD SEAT",
        "crash": false,
        "dateComplaintFiled": "04/26/2011",
        "dateOfIncident": "01/10/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10397942,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI TUCSON GLS/LTD. THE CONTACT STATED THAT THE OWNER'S MANUAL SPECIFIED THAT THE VEHICLE CAME EQUIPPED WITH A CHILD SAFETY SEAT LATCH SYSTEM. HOWEVER, THE SYSTEM WAS NOT AVAILABLE IN THE VEHICLE.  THE MANUFACTURER WAS NOTIFIED AND THEY ADVISED THAT THE PARTICULAR MODEL VEHICLE WAS NOT DESIGNED WITH THE LATCH SYSTEM. THE CONTACT HAD CONCERNS REGARDING THE MISPRINT INDICATED IN THE OWNER'S MANUAL. THERE WERE NO FAILURES.  UPDATED 05/24/11*LJ  UPDATED 09/16/11*JB",
        "vin": "KM8JN12D86U"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "03/21/2011",
        "dateOfIncident": "03/21/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10392397,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR HATCH WINDOW, BOTH HINGES BROKEN (CORRODED) WINDOW FALLS OUT, HELD IN ONLY BY GAS STRUTS. *TR",
        "vin": "KM8JN72D66U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/17/2011",
        "dateOfIncident": "03/15/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10390511,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I LEFT MY CAR PARKED IN MY DRIVEWAY FOR FIVE DAYS. GOOD WEATHER. UPON MY RETURN I STARTED IT UP AND THE AIRBAG SAFETY LIGHT WAS ON AND REMAINED ON. I IMMEDIATELY CONTACTED THE DEALER AND SET AN APPOINTMENT FOR THE NEXT MORNING AT 7:30 AM. AFTER SOME FRICTION ABOUT THEM WANTING $85. TO DIAGNOSE THE PROBLEM (CAR UNDER EXTENDED WARRANTY), A DEFECTIVE DRIVER SIDE IMPACT SENSOR WAS FOUND AND REPLACED AT NO CHARGE. UNFORTUNATELY I FAILED TO ASK FOR THE OLD PART. *TR",
        "vin": "KM8JN72D66U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/09/2011",
        "dateOfIncident": "03/08/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10386953,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2006 HYUNDAI TUCSON AND IT HAS BEGAN STALLING WHILE DECELERATING OR WHILE TURNING, THE POWER STEERING ALSO GOES OUT. ONE DAY IT WILL BE FINE, THE NEXT IT WILL STALL AT LEAST 3-7 TIMES. I HAVE SEEN MULTIPLE REPORTS OF THIS ISSUE ON DIFFERENT BLOGS, ALL FOR THE 2006 TUCSON.  *TR",
        "vin": "KM8JN12D96U"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/04/2011",
        "dateOfIncident": "01/04/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10374701,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2006 HYUNDAI TUCSON AND TWICE NOW I HAVE EXPERIENCED SUDDEN ACCELERATION. THE FIRST TIME I WAS BACKING OUT OF A PARKING SPACE AND THE CAR SURGED BACKWARDS AND I HAD TO APPLY THE BRAKES HARD. THE SECOND TIME  I HAD JUST PULLED OUT OF MY DRIVEWAY AND TOUCHED THE GAS PEDAL AND THE CAR SURGED FORWARD FOR A FEW FEET BEFORE SLOWING DOWN. *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/26/2010",
        "dateOfIncident": "10/10/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10372988,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS HAS HAPPENED SEVERAL TIMES, SO I'M NOT SURE OF THE FIRST DATE IT HAPPENED, BUT WHEN I HIT A POT HOLE OR BUMP WITH MY BRAKES ON, THE SUV SUDDENLY ACCELERATES (SEEMS TO LUNGE FORWARD) FOR SEVERAL SECONDS (AND BRAKING DOESN'T WORK).  THIS IS VERY SCARY AND I'VE COME CLOSE TO HITTING ANOTHER CAR BECAUSE I SPEED UP ON IT AT A STOP (SIGN OR LIGHT) AFTER I HIT THE POTHOLE.  I'VE TAKEN IT IN TO THE DEALER, WHO CANNOT REPRODUCE PROBLEM AND CLAIMS NOTHING IS WRONG.  I'VE ALSO HIT A PATCH ON THE ROAD THAT MY CAR CONSIDERS SLIPPERY (EVEN THOUGH THERE'S NO ICE) AND I CAN HEAR MY ABS KICK IN (EVEN THOUGH THE BRAKES AREN'T EVEN ON).",
        "vin": "KM8JN72D56U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/01/2010",
        "dateOfIncident": "10/01/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10358584,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2006 HYUNDAI TUCSON HAS STALLED OUT REPEATEDLY DURING DECELERATION.  IT HAS DIED REPEATEDLY WHILE TURNING INTO A PARKING LOT.  IT HAS ALSO DIED WHILE SLOWING DOWN FOR A STOP SIGN.  IT HAS JERKED AND FELT LIKE IT WAS DOWN-SHIFTING (HARD)WHILE DRIVING ON THE HIGHWAY.  TODAY, 10/1/10, IT DIED WHILE DRIVING THROUGH AN INTERSECTION.  I HAVE TAKEN THE CAR TO THE DEALER THREE TIMES AND THEY HAVE BEEN \"UNABLE TO RECREATE THE PROBLEM\" SO NOTHING HAS BEEN DONE TO FIX IT. *TR",
        "vin": "KM8JN12D46U"
    },
    {
        "components": "STEERING,SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/10/2010",
        "dateOfIncident": "07/24/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10354913,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 HYUNDAI TUCSON. THE CONTACT STATED THAT WHILE DRIVING ON WET PAVEMENT, HE ATTEMPTED TO MAKE A LEFT TURN AND THE VEHICLE FAILED TO TURN TO THE LEFT. SHE WAS FINALLY ABLE TO DRIVE THE VEHICLE HOME. THE ROTORS WERE INSPECTED BY THE OWNER AND THERE WERE GROOVES IN THEM AND THE BRAKE PADS WERE WORN OUT.  THE RIGHT REAR BRAKE HAD ALSO LOCKED UP. THE DEALERSHIP ADMITTED BEING AWARE OF A PROBLEM WITH THE CALIPERS. THE DEALER ADVISED THE FAILURE WAS NOT COVERED UNDER WARRANTY.  HOUND WAS CONTACTED AND  OFFERED TO REPAIR IT AS A GOOD WILL REPAIR, WHICH WAS DONE.  THE DEALER STATED THAT IF IT HAPPENED AGAIN THE REPAIRS WOULD BE AT THE OWNERS EXPENSE. THE PROBLEM HAS NOT RECURRED SINCE THE REPAIRS WERE DONE.  THE FAILURE AND CURRENT MILEAGE WAS 28,474.",
        "vin": "KM8JN72D56U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/30/2010",
        "dateOfIncident": "07/25/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10352834,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 HYUNDAI TUCSON. WHILE STARTING THE VEHICLE THE AIR BAG LIGHT CAME ON AND CONTINUED TO STAY ON. THE FAILURE STARTED ON AUGUST 25,2010.  THE CONTACT CALLED THE DEALER AND SCHEDULED AN APPOINTMENT FOR WEDNESDAY SEPTEMBER 1. 2010. THE APPROXIMATE FAILURE MILEAGE WAS 27,980 AND THE CURRENT MILEAGE WAS 28,000.",
        "vin": "KM8JM12B86U"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY,TIRES",
        "crash": false,
        "dateComplaintFiled": "08/17/2010",
        "dateOfIncident": "08/05/2010",
        "fire": true,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10350125,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE POWER WINDOWS ON THE VEHICLE WERE NOT WORKING. THE VEHICLE WAS TAKEN TO A MECHANIC, WHO FOUND A BLOWN FUSE. THE FUSE WAS REPLACED, AND ALMOST IMMEDIATELY, THE TIRE PRESSURE MONITOR COMPUTER LOCATED UNDER THE CENTER CONSOLE STARTED TO BURN.  THE MECHANIC DISCONNECTED THE FUSE AND CUT THE WIRES TO THE TPMS MODULE.  I THEN TOOK THE CAR TO THE DEALERSHIP TO EXPLAIN THE PROBLEM. AT FIRST THEY ACTED LIKE THEY DIDN'T HAVE ANY IDEA WHAT I WAS TALKING ABOUT. I LEFT THE CAR WITH THEM. SEVERAL HOURS LATER, THEY ADVISED THE TPMS MODULE HAD INDEED SHORT CIRCUITED AND THEREFORE THE MODULE AND ENTIRE HARNESS WOULD HAVE TO BE REPLACED AT A COST OF $3,000. THEY COULD NOT ADVISE ME WHY THIS HAPPENED.  IN FACT, THE SERVICE REP COULD NOT UNDERSTAND WHY REPLACING A WINDOW FUSE WOULD CAUSE THE TPMS MODULE TO BURN SINCE THEY ARE ON DIFFERENT CIRCUITS. ALSO, I BELIEVE THE TPMS MODULE HAS IT'S OWN FUSES WHICH SHOULD HAVE BLOWN PRIOR TO BURNING.  I REPORTED THIS TO HYUNDAI USA AND THEY INVESTIGATED. THEY EMAILED ME TO ADVISE THE PROBLEM WAS BETWEEN MYSELF AND THE DEALERSHIP. WHEN I TRIED TO REPLY TO THEM, THEY BLOCKED MY EMAIL ADDRESS COMPLETELY, SO I EMAILED THEM UNDER A DIFFERENT EMAIL ADDRESS. THEY HAVE NOT RESPONDED. I BELIEVE THIS COULD HAVE BEEN A SERIOUS PROBLEM RESULT IN A CAR FIRE HAD THE MECHANIC NOT DISCONNECTED THE SYSTEM WHEN HE DID.  I AM REPORTING THIS TO YOU IN CASE OTHERS HAVE HAD SIMILAR PROBLEMS. THIS MAY BE A DESIGN FLAW AS A FUSE SHOULD HAVE BLOWN ON THE TPMS MODULE (A DIAGRAM INDICATES A SLOW FUSE SHOULD BE PRESENT).  *TR",
        "vin": "KM8JN12D76U"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/11/2010",
        "dateOfIncident": "07/04/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10348629,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DEFECTIVE THROTTLE POSITION SENSOR.  VEHICLE WOULD REV WHILE CRUISING, CHANGE GEARS ERRATICALLY (DOWNSHIFT), WOULD HESITATE, AND WOULD CUT OFF AT SPEEDS BELOW 20 MPH. *TR",
        "vin": "KM8JN12D76U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/29/2010",
        "dateOfIncident": "06/16/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10346138,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI TUCSON. WHILE DRIVING AT 45 MPH, THE CONTACT REMOVED HIS FOOT FROM THE ACCELERATOR PEDAL WHEN THE VEHICLE ABNORMALLY BEGAN TO JERK. THE VEHICLE THEN STALLED WITHOUT WARNING. THE CONTACT WAS ABLE TO RESTART THE VEHICLE AND PROCEEDED TO HIS DESTINATION. THE FAILURE PERSISTED INTERMITTENTLY AND THE CONTACT STATED THE FAILURE WOULD OCCUR MOST OFTEN WHILE TRAVELING AT LOW SPEEDS. THE DEALER WAS UNABLE TO DUPLICATE THE FAILURE.  THE FAILURE MILEAGE WAS 78,000 AND THE CURRENT MILEAGE WAS 81,749.",
        "vin": "KM8JN12D16U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/06/2010",
        "dateOfIncident": "06/14/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10341701,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 HYUNDAI TUSCON CONSTANTLY REFUSES TO DROP INTO GEAR WHEN COASTING AND STALLS QUITE FREQUENTLY.  THIS ISSUE HAS BEEN HAPPENING FOR THE LAST FOUR MONTHS.  I HAVE STALLED WHILE SITTING AT LIGHTS AND THE CAR HAS ACCELERATED EVEN WHILE COASTING.    WE TOOK IT TO A DEALER IN 2009 FOR THE STALLING ISSUE AND WERE TOLD IT WAS BECAUSE IT WAS OVERHEATING DUE TO THE EXTREME HEAT AND WEATHER. *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/14/2010",
        "dateOfIncident": "06/01/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10336196,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 TUCSON 5-SPEED MANUAL TRANSMISSION SUV REMAINS STUCK IN 3RD GEAR.  CAR PARKED AND IGNITION TURNED OFF WHILE GEAR STILL ENGAGED RESULTS IN THIS LOCKED-UP GEAR BACKLASH PROBLEM.  WORK AROUND:  LEAVE PARKING BRAKE RELEASED.  LEAN ON CAR BUMPER AND PUSH SLIGHTLY TO FREE  THE POWER TRAIN. *TR",
        "vin": "KM8JM12B86U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/25/2010",
        "dateOfIncident": "12/01/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10332115,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI TUCSON. THE CONTACT STATED  THAT SHE HAS BEEN EXPERIENCING RECURRING FAILURES IN WHICH THE VEHICLE WILL INTERMITTENTLY STALL WHILE DECELERATING. WHEN THE FAILURE WOULD OCCUR, THERE WAS A LOSS OF POWER STEERING AS WELL. THE VEHICLE WAS TAKEN TO THE DEALER THREE TIMES AND THE DEALER WAS UNABLE TO DUPLICATE THE FAILURE. THE VEHICLE WAS NOT REPAIRED.  THE FAILURE MILEAGE WAS 36,000 AND THE CURRENT MILEAGE WAS 40,000.",
        "vin": "KM8JN12D06U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/18/2010",
        "dateOfIncident": "04/13/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10326261,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LOWER ENGINE SPLASH COVER CAME OFF MY 2006 HYUNDAI TUCSON. I WAS LUCKY IT CAME OFF WHILE BACKING OUT OF MY DRIVEWAY. IF THIS LARGE PIECE OF PLASTIC CAME OFF ON THE HIGHWAY IT WOULD BE EASY TO LOSE CONTROL OF THE VEHICLE. IT COULD ALSO BE HAZARDOUS TO ANY VEHICLES BEHIND A CAR LOSING THIS PART.  THE SPLASH PAN IS BOLTED ON WITH THE BOLTS GOING UP INTO A RECESS AND HAS A METAL WASHER GOING AGAINST THE PLASTIC. THE DEALER HAS TOLD ME THAT THIS PART IS TAKEN OFF EACH TIME THE OIL IS CHANGED. MY CAR HAS ABOUT 43,000 MILES ON IT THIS MEANS THE OIL HAS BEEN CHANGED ABOUT 15 TIMES.   DUE TO THE FACT I WAS BACKING UP THE SPLASH PAN WAS NOT DAMAGED VERY MUCH. THE PLASTIC WHERE THE WASHER HITS IT IS COMPLETELY WORN AWAY AND THE HOLES HAVE BECOME LARGE ENOUGH THAT THE WASHER NO LONGER WILL HOLD IT. YOU CAN?T PUT A LARGER WASHER ON IT BECAUSE OF THE WAY IT IS RECESSED.  THIS PROBABLY HAPPENS FREQUENTLY BECAUSE THE DEALER HAD ONE IN STOCK. *TR",
        "vin": "KM8JN72D86U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/30/2010",
        "dateOfIncident": "03/05/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10322931,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "OWN 2006 HYUNDAI TUSCON. BROUGHT IT INTO ENFIELD HYUDAI TO HAVE AIR BAG COVER SERVICED THEY DENIED ANY KNOWLEDGE OF A PROBLEM WITH THIS ITEM. ALSO DENIED ME SERVICE ON MY AIR BAG COVER. PLEASE FILE A COMPLAINT FOR ME.I WAS NEVER TOLD ABOUT RECALL NHTSA 10021298   WHAT OTHER ACTIONS SHOULD I TAKE?  THANK YOU,  REINHARDT KRESS  860-597-0799",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/22/2010",
        "dateOfIncident": "03/21/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10321421,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY HYUNDAI TUCSON WILL STALL EACH TIME THE VEHICLE IS DRIVEN STEADILY AT HIGHWAY SPEED FOR 20 MILES OR SO.  GETTING BACK ON SURFACE STREETS IT BEGINS TO SUDDENLY DOWNSHIFT INTO 2ND OR FIRST WHEN SLOWING OR BRAKING.  FOLLOWING THIS, THE VEHICLE WILL STALL IF IT GETS SLOW ENOUGH OR YOU COME TO A STOP.  I FEAR BEING REARENDED OR LEFT IN A LANE TO RESTART WITH TRAFFIC BEARING DOWN.  THE INTERNET HAS SEVERAL INSTANCES OF THE SAME PROBLEM WITH NO RESOLUTION FROM HYUNDAI.  I ADD MY INFORMATION, IN HOPE IT WILL SAVE SOMEONE AND SOLVE THE PROBLEM. I HAVE OWNED THE VEHICLE 4 MONTHS AND I'M THE 3RD OWNER, BOUGHT FROM HYUNDAI LOT.*DT",
        "vin": "KM8JN12D46U"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/24/2009",
        "dateOfIncident": "12/21/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10296907,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI TUCSON.  WHILE TURNING INTO AN INTERSECTION, ANOTHER VEHICLE CRASHED INTO HIS REAR DRIVER-SIDE DOOR.  NONE OF THE AIR BAGS DEPLOYED. ONE PASSENGER SUFFERED A BROKEN RIB, AND OTHERS SUFFERED BUMPS AND BRUISES.  THE VEHICLE WAS NOT COMPLETELY DESTROYED. THE MANUFACTURER HAS NOT BEEN CONTACTED. THE  FAILURE MILEAGE WAS 29,000.",
        "vin": "KM8JN72D16U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/22/2009",
        "dateOfIncident": "11/14/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10293145,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2006 HYUNDAI TUCSON STALLS WHEN SLOWING DOWN AND TURNING. *TR",
        "vin": "KM8JN72D06U"
    },
    {
        "components": "AIR BAGS,SEAT BELTS,EQUIPMENT,EQUIPMENT ADAPTIVE/MOBILITY",
        "crash": true,
        "dateComplaintFiled": "11/13/2009",
        "dateOfIncident": "11/04/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10292124,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "AIRBAG SYSTEMS, INC.",
                "productMake": "AIRBAG",
                "productModel": "SWITCH",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "I REAR ENDED A PICKUP TRUCK AND MY AIR BAGS DID NOT DEPLOY NOR DID MY SEATBELT RE TRACK CAUSING HEAD INJURY BY HITTING THE WINDSHIELD AND JAW INJURY BY HITTING THE STEERING WHEEL. *TR",
        "vin": "KM8JM12B46U"
    },
    {
        "components": "SEAT BELTS,EQUIPMENT",
        "crash": true,
        "dateComplaintFiled": "11/13/2009",
        "dateOfIncident": "11/04/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10292126,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "GRANDDAUGHTER REARENDED A PICKUP TRUCK AND HER SEAT BELT DID NOT RETRACK CAUSING HER HEAD TO HIT THE WINDSHIELD AND HER JAW TO HIT THE STEERING WHEEL AND CUT HER INNER LIP. *TR",
        "vin": "KM8JM12B46U"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/09/2009",
        "dateOfIncident": "10/24/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10291565,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THIRD HYUNDAI MY HUSBAND AND I HAVE OWNED AND ON ALL THREE THE REAR BRAKES HAVE BEEN STICKING, HEATING UP AND EATING UP THE BRAKES.  HAD THE DEALERSHIP DO A BRAKE INSPECTION PER HYUNDAI'S REQUEST, WHICH THE REPORT SHOWS THE WEAR SHOWS THAT IT IS NOT NORMAL WEAR.  SPOKE TO THE WOMEN HANDLING THE CASE THAT WAS OPENED.  THE REPLY FROM HYUNDAI WAS THAT THE BRAKES WERE NOT UNDER WARRANTY (WHICH I KNEW) AND THAT AT 7,000 MILE THE CAR SHOULD HAVE BEEN BROUGHT IN FOR THE CALIPER MAINTENANCE.  THIS TELL ME THAT HYUNDAI IS NOT GREASING THE CALIPERS DURING MANUFACTURING AND IS UP TO THE CONSUMER TO PAY.  I WILL NEVER SUGGEST TO ANYONE TO BUY A HYUNDAI.  AS FAR AS I AM CONCERNED IT IS A SAFETY HAZARD AND CONSUMERS SHOULD NOT HAVE TO PAY FOR A MANUFACTURING DEFECT.  ALSO PLEASE NOT THIS PROBLEM HAS HAPPENED TO ALL THREE OF THE HYUNDAI'S MY FAMILY HAS OWNED. *TR",
        "vin": "KM8JM72B26U"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/09/2009",
        "dateOfIncident": "07/17/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10286851,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "RUSTING OF BRAKES 2006 TUCSON.    BEGAN AS A SLIGHT SOUND AS IF PIECE OF GRAVEL IN ONE REAR BRAKE. SUDDENLY, WHILE ON A TRIP, BECAME MUCH WORSE. HAD TO REPEATEDLY BANG CALIPER WITH HAMMER TO RELEASE. IT.      WHEN TAKEN TO SHOP FOUND RUSTED OUT BRAKE ROTORS (4) AND FROZEN CALIPER (1) ON 2004 HYUNDAI TUCSON WITH 23,000 MILES. SAME WASHING ROUTINE AS ON ALL MY PREVIOUS CARS.    I AM NOW ALMOST 70 YEARS OLD AND HAVE OWNED, AND STILL OWN, MANY CARS. I HAVE NEVER SEEN SUCH RAPID DETERIORATION IN ANY OTHER VEHICLE. MANY OF THEM DATE FROM THE 1970'S AND 80'S.    UNFORTUNATELY I DID NOT KEEP THE FAILED ROTORS. THE CALIPERS WERE REBUILT.    ALL UNDERCARRIAGE STRUCTURES ARE INADEQUATELY PREPARED FOR RUST RESISTANCE.  *TR",
        "vin": "KM8JN72D66U"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "08/06/2009",
        "dateOfIncident": "04/14/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10279576,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY 2006 GLS V-6 HYUNDAI TUCSON OCTOBER 28, 2008.  RIGHT AFTER WE PURCHASED IT WE NOTICED THAT DRIVING UP OR DOWN SLOPES TURNED OFF THE VEHICLE.  WE TOOK IT BACK TO THE DEALERSHIP AND THEY HAD THE GAS CAP REPLACED AND WAS TOLD THAT IT SOLVED THE PROBLEM.  THEN ABOUT A WEEK LATER THE CHECK ENGINE LIGHT CAME ON.  WE TOOK IT BACK INTO THE SHOP AND IT WAS THE PRESSURE IN THE GAS PUMP THAT TIME.  THEN THE LIGHT CAME BACK ON AND WE TOOK IT TO HYUNDAI.  THEY TURNED OFF THE LIGHT BUT NEVER FOUND THE REASON AS TO WHY  IT WAS COMING ON.  ALTHOUGH THEY DID NOT HESITATE TO TRY TO SELL US SERVICES THAT HAD NOTHING TO DO WITH THE CHECK ENGINE LIGHT COMING ON OR THE CAR JUST SHUTTING OFF.  TO THIS DAY THE CHECK ENGINE LIGHT HAS BEEN ON.  HYUNDAI HAS OFFERED TO SHUT IT OFF BUT WHATS THE SENSE IN SHUTTING IT OFF WHEN THE PROBLEM IS STILL THERE?  NOW THE CAR JUST STOPS....I WAS DRIVING BACK FROM SAN JUAN CAPISTRANO TO RIVERSIDE, CA AND WE WERE IN TRAFFIC ABOUT 50-60 MILES AND THE CAR JUST SHUT OFF....SINCE THEN THE CAR DOES IT REGULARLY SOMETIME 4-5 TIMES.  WE CALLED HYUNDAI AND THEY SUGGEST REPLACING THE GAS CAP AGAIN.. IM NOT A MECHANIC BUT I THINK I UNDERSTAND THAT THIS IS NOT A GAS CAP REPLACEMENT ISSUE.  IM SCARED TO DRIVE THE CAR.  I'VE TRIED TURNING IN THE CAR BUT MY CREDIT IS NOT GOOD ENOUGH BECAUSE I HAVE 2 CAR LOANS.  HYUNDAI KEPT SENDING ME PAPERS AND CALLING ME SAYING THAT THEY WOULD LIKE TO BUY IT BACK BUT IT WAS JUST A SCAM TO GET ME IN TO TRY TO PURCHASE ANOTHER VEHICLE.  THEY DO NOT STAND BEHIND THEIR CARS OR TRY TO SOLVE THE PROBLEMS AT HAND.  ALSO WHEN I PURCHASED THE VEHICLE IT WAS UNDER 100, 000 AND I ASKED HYUNDAI WHAT WERE MY WARRANTIES AND WAS TOLD THAT SINCE I BOUGHT IT FROM A USED CAR LOT THAT THE WARRANTIES ARE VOID.  I AM PAYING AFTER FINANCE CHARGES...$16,144.34.  I EXPECT THIS CAR TO LAST ME MORE THAN A YEAR OR 2. *TR",
        "vin": "KM8JN12D16U"
    },
    {
        "components": "EXTERIOR LIGHTING,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/23/2009",
        "dateOfIncident": "06/01/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10274745,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 HYUNDAI TUCSON.  THE CONTACT STATED THAT THE ELECTRONIC STABILITY CONTROL (ESC) LIGHT CONTINUED TO ILLUMINATE ON THE INSTRUMENT PANEL.  IN ADDITION, THE BRAKE LIGHTS WERE INOPERABLE.  SHE WAS CONCERNED THAT A REAR END CRASH COULD OCCUR DUE TO THE BRAKE LIGHT FAILURE.  THE MANUFACTURER STATED THAT THEY DID NOT KNOW WHICH VIN'S WOULD BE INCLUDED IN NHTSA CAMPAIGN ID NUMBER 09V122000 AND HYUNDAI RECALL NUMBER 092.  THE RECALL NOTICES WOULD NOT BE ISSUED UNTIL JULY OF 2009.  THE RECALL WAS INITIATED ON APRIL 15, 2009 (SEE NHTSA ACTION NUMBER PE09003 FOR INVESTIGATION DETAILS).  THE FAILURE AND CURRENT MILEAGES WERE LESS THAN 80,000.",
        "vin": "KM8JN72DX6U"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "05/05/2009",
        "dateOfIncident": "05/03/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10267785,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FUEL PUMP HAS STOPPED WORKING THREE TIMES IN 3 YEARS.  ONE TIME I WAS ON A MAJOR ROAD IN HIGH TRAFFIC, THE VEHICLE JUST STOPPED RUNNING WHILE I WAS GOING 55 MILES AN HOUR. *TR",
        "vin": "KM8JN12D46U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/04/2009",
        "dateOfIncident": "02/01/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10257393,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 HYUNDAI TUCSON.  THE DRIVER WENT TO START THE VEHICLE, BUT IT WOULD NOT START.  HE OBSERVED THAT THE BATTERY FAILED AND HAD IT REPLACED.  THE VEHICLE OPERATED NORMALLY AFTER THE REPLACEMENT, BUT THE FAILURE RECURRED NINE MONTHS LATER.  HE CONNECTED THE BATTERY TO A GAUGE, WHICH INDICATED THAT IT FAILED AGAIN.  SINCE THE BATTERY WAS LESS THAN A YEAR OLD, HE TOOK THE VEHICLE TO A DEALER.  THE CONTACT WAS INFORMED THAT WHEN THE VEHICLE IS PARKED FOR 2-3 DAYS, IT CAUSES THE BATTERY TO DRAIN .  THE MECHANIC ALSO STATED THAT THE BATTERY FAILS BECAUSE THE RADIO IS CAUSING IT TO DRAIN, AS IF IT WERE STILL ACTIVATED WHEN THE VEHICLE WAS IDLING.  THIS IS WHY THE CONTACT WAS ADVISED TO NOT LET THE VEHICLE IDLE FOR MORE THAN TWO DAYS.  THERE WAS NO RECALL FOR THIS FAILURE; HOWEVER, IT COULD BE COVERED UNDER THE THREE YEARS/30,000 MILE WARRANTY.  THE FAILURE MILEAGE WAS 16,000 AND CURRENT MILEAGE WAS 22,000.     UPDATED 3/5/09 *CN  THE CONSUMER WAS INFORMED A TSB HAD BEEN ISSUED REGARDING THE PROBLEM.  THE REMEDY WAS TO PULL THE POWER CONNECTOR. UPDATED 03/10/09. *JB",
        "vin": "KM8JN12D66U"
    },
    {
        "components": "SUSPENSION,STRUCTURE,TIRES",
        "crash": false,
        "dateComplaintFiled": "02/04/2009",
        "dateOfIncident": "01/19/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10257453,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "B.F. GOODRICH TIRE CO.",
                "productMake": "B.F.GOODRICH",
                "productModel": "T/A",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "2006 TUCSON HYUNDAI-11,000 MI AND HAD TO REPLACE REAR TIRES DUE TO TIRE WEAR. COMPLETELY BALD.  COST-$300.00. DEALER STATES IT MAY BE DUE TO NEEDING ALIGNMENT OR DEFECT IN FRAME.  WILL NOT HONOR BUMPER TO BUMPER 5 YEAR 60,000 MI WARRANTY. REFUSES TO PAY FOR ALIGNMENT OR TO SEE IF IT IS A FRAME PROBLEM. WILL NOT REIMBURSE FOR TIRES, EVEN THOUGH THE TIRE DEALER STATED THE MEASUREMENTS AND HOW IT WAS NOT RIGHT TO HAVE THEM THAT BALD. BUYING THE CAR BRAND NEW-I NOW AM AFRAID TO DRIVE IT. IT WAS BOUGHT JUNE 2006, I HAVE BABIED IT AND DROVE ONLY FOR SPECIAL OCCASIONS AND VACATIONS. YET NOW I FEEL IT IS DANGEROUS TO DRIVE.  ESPECIALLY WHEN IT COULD BE A FRAME PROBLEM, AND THEY ARE REFUSING TO INVESTIGATE. I AM HAVING TO TAKE IT TO A ALIGNMENT SHOP MYSELF TO HAVE IT CHECKED.  YOUR SITE ONLY GIVES ME THE OPTION OF ONE TIRE REPORT. BUT BOTH TIRES WERE BALD! THANK YOU. *TR",
        "vin": "KM8JN12D16U"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/02/2009",
        "dateOfIncident": "01/27/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10257145,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 HYUNDAI TUCSON.  THE CONTACT NOTICED THAT THE TRACTION WARNING INDICATOR ILLUMINATED ON THE INSTRUMENT PANEL.  WHILE DRIVING APPROXIMATELY 55 MPH, THE CONTACT ATTEMPTED TO DEPRESS THE BRAKE PEDAL, BUT THE VEHICLE WOULD NOT DECELERATE OR STOP.  SEVERAL MINUTES LATER, THE VEHICLE STALLED.  NO WARNING LIGHTS WERE DISPLAYED ON THE INSTRUMENT PANEL DURING THE FAILURE.  HE TOOK THE VEHICLE TO THE DEALER, BUT THEY COULD NOT DUPLICATE THE FAILURE OR PROVIDE A REMEDY.  HE CALLED THE MANUFACTURER IN REFERENCE TO TSB NUMBER 10019123 AND WAS NOT PROVIDED ASSISTANCE.  THE FAILURE MILEAGE WAS 60,400 AND CURRENT MILEAGE WAS 60,500.",
        "vin": "KM8JM12B06U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/28/2008",
        "dateOfIncident": "01/02/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10236126,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 HYUNDAI TUCSON.  WHILE DRIVING APPROXIMATELY 60 MPH AND ABOVE, THE VEHICLE WOULD SHIMMY AND COME UP THROUGH THE STEERING WHEEL.  THE VEHICLE WAS TAKEN TO A DEALER APPROXIMATELY SIX DIFFERENT TIMES AND THEY CHANGED ALL FOUR TIRES ON THREE OCCASIONS; HOWEVER, THE VEHICLE STILL SHAKES.  THE CURRENT MILEAGE WAS 30,108 AND FAILURE MILEAGE WAS 23,000.",
        "vin": "KM8JN72D86U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/11/2008",
        "dateOfIncident": "07/11/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10234038,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I PUT ON MY BRAKE TO SHIFT THE CAR INTO GEAR, THE ESC OFF LIGHT ILLUMINATES.  THIS IS CAUSED BY A FAULTY BRAKE SWITCH.  WHEN THE BRAKE SWITCH IS FAULTY, I HAVE NO BRAKE LIGHTS AT ALL.  I HAVE HAD THREE BRAKE SWITCHES REPLACED IN THIS CAR.  TODAY WAS THE LATEST INCIDENT AND THE CAR IS NOW AT THE DEALERSHIP FOR SWITCH #4.  THIS OCCURS ABOUT EVERY 6 MONTHS.  *TR",
        "vin": "KM8JN72D56U"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/08/2008",
        "dateOfIncident": "02/01/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10223677,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS INVOLVED IN AN ACCIDENT WHICH I WAS HIT ON THE DRIVERS SIDE. THE SIDE AIR BAGS DID NOT DEPLOY. THE AIR BAGS IS WAY I BROUGHT THIS VEHICLE.  *TR",
        "vin": "KM8JM12B76U"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/23/2008",
        "dateOfIncident": "03/10/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10222072,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER OF VEHICLE RAN OFF THE ROAD, DOWN AN EMBANKMENT, AND INTO TREES; VEHICLE WAS A TOTAL LOSS; FRONT BUMPER OF VEHICLE BROKEN IN TWO AND SEPARATED FROM VEHICLE; NEITHER FRONT NOR SIDE AIRBAGS DEPLOYED; DRIVER SUFFERED FRACTURED VERTEBRA, FOOT AND HAND INJURIES, AND NUMEROUS BRUISES AND SCRAPES.  *TR",
        "vin": "KM8JN12DX6U"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "01/30/2008",
        "dateOfIncident": "01/19/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10216469,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "SREW JACK FAILURE.  IN A HEATED GARAGE ON A LEVEL CONCRETE FLOOR WITH THE CAR IN PARK AND THE BRAKE SET, THE JACK PROVIDED FAILED.  UNDER THE WEIGHT OF THE VEHICLE IT TWISTED AND COLLAPSED ALLOWING THE 2006 HYUNDAI TUCSON TO FALL BACK TO THE FLOOR.  *TR",
        "vin": "KM8JN72DX6U"
    },
    {
        "components": "POWER TRAIN,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/07/2007",
        "dateOfIncident": "01/01/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10211141,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 HYUNDAI TUCSON.  WITHIN A MONTH OF PURCHASING THE VEHICLE, THE TRANSMISSION FAILED WITH LESS THAN 1,000 MILES.  THE DEALER REPLACED THE TRANSMISSION.  THE HAZARD AND TURN SIGNAL LIGHTS FAILED ALSO AND WERE REPLACED BY THE DEALER.  TWO DAYS LATER, THE LIGHTS STOPPED WORKING AGAIN.  THEY WERE REPLACED A SECOND TIME, BUT THEN FAILED AGAIN.  THE LIGHTS HAVE FAILED APPROXIMATELY SIX TIMES AND HAVE NOT BEEN PROPERLY REPAIRED.  THE DEALER INFORMED THE CONTACT THAT HE USES HIS DIRECTIONALS TOO MUCH AND THE HAZARD LIGHTS TOO LONG.  THE VIN, ENGINE SIZE, AND NUMBER OF CYLINDERS WERE UNKNOWN.  THE FAILURE MILEAGE WAS UNDER 1,000 AND  CURRENT MILEAGE WAS 30,100.",
        "vin": ""
    },
    {
        "components": "STEERING,AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "10/30/2007",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10208248,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 HYUNDAI TUCSON WITH SEVERAL SAFETY ISSUES.  CUSTOMER STATES THAT THE VEHICLE HAS BEEN WORKED ON FOR THE PAST 6 MONTHS. SHE ALSO STATES THAT THE PROBLEMS ARE WITH AIR BAGS, SEAT BELTS, AND OTHER THINGS.  *KB  THERE WAS ALSO A PROBLEM WITH THE STEERING COLUMN.*JB",
        "vin": ""
    },
    {
        "components": "STEERING,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/15/2007",
        "dateOfIncident": "05/21/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10205734,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 HYUNDAI TUCSON.  THE CONTACT STATED THAT THE RED AIR BAG LIGHT ILLUMINATED.  THE VEHICLE WAS TAKEN TO THE DEALER ON TWELVE OCCASIONS REGARDING THIS FAILURE.  THE DEALER DEACTIVATED THE AIR BAG.  THE CONTACT STATED THAT PART OF THE STEERING COLUMN FELL OFF WHILE DRIVING.  THE FRONT SEAT AND ONE REAR SEAT TRAC COVER WERE REPLACED.  THE SPEED WAS UNKNOWN.  THE CURRENT MILEAGE WAS 22,617 AND FAILURE MILEAGE WAS 35.   UPDATED 10/25/07  *TR",
        "vin": "KM8JN12DX6U"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/01/2007",
        "dateOfIncident": "11/15/2006",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10204614,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED A NEW HYUNDAI, TUCSON, FROM MONROE HYUNDAI A YEAR AGO. AFTER A BREAK-IN PERIOD, I STARTED CHECKING THE MILEAGE. I QUICKLY FOUND OUT THAT NO MATTER HOW I DROVE MY CAR, THE MILEAGE DIDN'T VARY.         ONE HUNDRED MILES AN HOUR OR 35 MILES AN HOUR AND YOU GET 22 MPG IN EITHER CASE. I TOOK THE VEHICLE BACK TO THE DEALER ON SEVERAL OCCASIONS, AND DID EVERYTHING THEY TOLD ME. A MILEAGE STUDY DONE BY HYUNDAI RESULTED IN THE SAME CONCLUSION.         I'VE TALKED TO OTHER OWNERS OF THE SAME MODEL AND THEY ALL HAVE THE SAME PROBLEM. EXPERTS IN THE AUTO FIELD HAVE TOLD ME THAT THE PROBLEM HAS TO BE THE COMPUTER THAT CONTROLS IDLING, AND THE PUMPING OF FUEL HAS A PROBLEM.         HYUNDAI HAS RECENTLY STATED THERE IS NOTHING THEY CAN DO, AND BASICALLY STATED I'M STUCK.  I'M RETIRED AND I WANTED THIS VEHICLE TO LAST FOR SOME TIME. THE DEALERSHIP REFUSES TO ASSIST ME IN CONTACTING HYUNDAI ENGINEERING, TO DISCUSS THIS PROBLEM.          PLEASE HELP! I CAN'T AFFORD TO TRADE THIS SUV IN, AND I WOULD LIKE TO SEE IT REPAIRED SO MY MILEAGE IS PROPORTIONATE TO HOW I DRIVE. GENERALLY 10 - 15% MILEAGE DIFFERENCE SHOULD BE EXPECTED BETWEEN AROUND TOWN VS HIGHWAY DRIVING.  *JB",
        "vin": "KM8JN12D26U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/12/2007",
        "dateOfIncident": "05/01/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10196228,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 HYUNDAI TUCSON.  THE CONTACT RECEIVED RECALL NOTICE # 06V445000 (AIR BAGS:FRONTAL:DRIVER SIDE INFLATOR MODULE).  THE AIR BAG LIGHT HAS BEEN ILLUMINATED FOR A COUPLE OF MONTHS WHILE A PASSENGER IS IN THE FRONT SEAT.  THE HYUNDAI DEALER STATED THAT THEY HAD THE PART, BUT FIFTEEN MINUTES LATER THEY STATED THAT THE PART WAS ON BACK ORDER.  THE CONTACT INFORMED THE DEALER TO OBTAIN THE PARTS FROM A DIFFERENT DEALER IN ORDER TO PERFORM THE RECALL REPAIR.  THE CURRENT MILEAGE IS 7,500 AND FAILURE MILEAGE WAS 6,000.",
        "vin": "KM8JN12D96U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/21/2007",
        "dateOfIncident": "01/07/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10193912,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 HYUNDAI TUCSON.  THE CONTACT RECEIVED RECALL NOTICE # 06V445000 (AIR BAGS:FRONTAL:DRIVER SIDE INFLATOR MODULE).  THE CONTACT STATED THAT THE DEALER DOES NOT HAVE THE PART AND WILL NOT NOTIFY HIM WHEN IT BECOMES AVAILABLE.  THE CONTACT HAS BEEN TRYING TO HAVE THE RECALL REPAIR DONE SINCE JANUARY OF 2007.  NO FAILURES HAVE OCCURRED AT THIS TIME.  THE CURRENT MILEAGE IS 18,000 AND THE FAILURE MILEAGE IS INAPPLICABLE.",
        "vin": "KM8JM12B76U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/30/2007",
        "dateOfIncident": "03/12/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10192013,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 HYUNDAI TUCSON.  IN MARCH 2006, THE CONTACT RECEIVED RECALL NOTICE # 06V445000 (AIR BAGS:FRONTAL:DRIVER SIDE INFLATOR MODULE).  SHE STATED THAT THE MODULE IS STILL ON BACK ORDER.  THE CONTACT HAS NOT EXPERIENCED ANY FAILURES AT THIS TIME.  THE ENGINE SIZE WAS UNKNOWN.  THE CURRENT MILEAGE IS 14,000 AND THE FAILURE MILEAGE WAS UNKNOWN.    THE CONSUMER STATED THE RECALL HAS SINCE BEEN COMPLETED. UPDATED 07/06/07. *JB",
        "vin": "KM8JN12D96U"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/30/2007",
        "dateOfIncident": "01/09/2006",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10192053,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 HYUNDAI TUCSON.  THE CONTACT STATED THAT THE VEHICLE HAS FAILED TO CRANK START APPROXIMATELY TEN TIMES.  THE HYUNDAI DEALER HAS REPLACED THE BATTERY THREE TIMES BESIDES THE ORIGINAL BATTERY IN THE VEHICLE.  THERE WERE NO WARNING INDICATORS AT THE TIME OF FAILURE.  PRESENTLY, THE VEHICLE FAILS TO CRANK START AGAIN.  THE ENGINE SIZE WAS UNKNOWN.  THE CURRENT MILEAGE IS 3,600 AND FAILURE MILEAGE WAS UNKNOWN.  THE CONSUMER STATED THE VEHICLE FAILED TO START 4 TIMES BEFORE 1,489 AND 10 TIMES BEFORE 3,500 MILES. THE DEALER STATED DRIVER SIDE AIRBAG COVER REPLACED. THE CONSUMER PROVIDED VARIOUS REPAIR INVOICES FOR DEFECT. UPDATED 07/12/07  *TR",
        "vin": "KM8JN12D96U"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/09/2007",
        "dateOfIncident": "01/05/2006",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10187339,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "NEW 2006 HYUNDAI TUCSON V6 4WD. SHAKING / VIBRATION IN THE STEERING WHEEL AT AROUND 45 MPH.  BROUGHT VEHICLE TO THE HYUNDAI, DEALER 3 TIMES TO HAVE IT FIXED, BUT SHAKING STILL PERSISTED.  EACH VISIT TOOK LONGER, LAST ONE THEY HAD VEHICLE FOR A FEW DAYS.  MECHANICS WORKED WITH THE FACTORY REPAIR REPRESENTATIVE ,  AND USED DIAGNOSTIC COMPUTER, BUT THEY STILL COULDN'T FIGURE OUT  THE CAUSE.  WORK PERFORMED OVER 3 VISITS.  BALANCED TIRES, SWAPPED OUT TIRES, LOOKED AT AXLES, REPLACED FAULTY COUPLING ASSEMBLY, MACHINED THE BRAKE  WARPED DISCS, AND  SOLVED THE SHAKING WHEN BRAKING. BUT PROBLEM STILL EXISTED WHEN DRIVING.  THIS IS ON A BRAND NEW VEHICLE FROM THE FACTORY.  *AK",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/30/2007",
        "dateOfIncident": "03/30/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10186533,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2006 HYUNDAI TUSCON PURCHASED NEW. THE PASSENGER AIRBAG INDICATOR GOES OFF 70% OF THE TIME THAT AN ADULT WEIGHING 102 POUNDS IS SEATED. THE DEALER SAID THEY COULD NOT FIND ANY PROBLEM, DENIED KNOWING THAT THERE IS HISTORY OF PROBLEMS WITH THE HYUNDAI AIRBAGS, AND GAVE ME THE COMPANY LINE THAT THE PASSENGER  HAD TO BE SEATED A PARTICULAR WAY. I HAVE VIDEO TAPED THE SITUATION WITH THE LIGHT ON WHILE A PASSENGER IS SEATED WITH A NEWSPAPER IN THE VIDEO. I WILL AGAIN REQUEST THE DEALER TO REPLACE THE SENSOR.   *JB",
        "vin": "KM8JN72D16U"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/27/2007",
        "dateOfIncident": "10/16/2006",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10186262,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* - THE CONTACT OWNS A 2006 HYUNDAI TUSCON.  WHILE DRIVING 5-10 MPH THE VEHICLE WAS STRUCK ON THE FRONT AND BACK DRIVE'SR SIDE DOORS.  THE DRIVER'S SIDE DOOR WOULD NOT OPEN.  THERE WERE A TOTAL OF FOUR OCCUPANTS IN THE VEHICLE AND ALL WERE BELTED.  THE DRIVER SUSTAINED SERIOUS INJURIES.  THE CONTACT HAS A POLICE REPORT AND PICTURES OF THE VEHICLE.  THE VEHICLE WAS DRIVABLE, BUT WAS TOWED AWAY.  THE VEHICLE WAS IN THE PROCESS OF BEING REPAIRED.  THE MANUFACTURER STATED THAT THE CRASH WAS NOT STRONG ENOUGH TO DEPLOY THE AIRBAGS AND DENIED THE CLAIM.  THE CONTACT RECEIVED A RECALL NOTICE FOR THE AIRBAG MODULE APPROXIMATELY 1 MONTH AGO.  THE FAILURE MILEAGE WAS 8,000.  THE CURRENT MILEAGE WAS 25,000.AK",
        "vin": "KM8JM12B76U"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/05/2007",
        "dateOfIncident": "12/31/2006",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10177889,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "FAILURE OF 'NEW' 2006 TUCSON GLS V6 2.7L DOHC 24 VALVE ENGINE TO MEET 20-26 MPG. I GET ONLY 8-12 MPG, DRIVING CONSERVATIVELY. I CONTACTED LAMAR HYUNDAI WERE I PURCHASED IT UNDER STRESS & DURESS OF MY MOTHER'S DYING, ON 12-30-06. THEY SAID TO CONTACT THE MFG, AS THEY SELL THE CARS & HAVE NO SOLUTION. PLEASE HELP. I PAID MORE THAN ONLINE MSR PRICE. *NM",
        "vin": "KM8JN12D36U"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/15/2006",
        "dateOfIncident": "11/10/2006",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10173580,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2006 TUSCON (6 MONTHS OLD) WAS STRUCK IN THE DRIVER'S SIDE BETWEEN THE DRIVER AND REAR SEATS BY A 2002 CADILLAC. THE DRIVER OF THE OTHER VEHICLE WAS CITED FOR FAILURE TO YIELD AND TRAVELING AT AN ESTIMATED 35-40 MPH. I WAS TRAVELING APPROXIMATELY 30 MPH. MY TUSCON FLIPPED OVER 4 TIMES. OF 6 AIRBAGS, NOT 1 DEPLOYED. THE SIDE IMPACT DID NOT DEPLOY UPON IMPACT. THE ROOF-MOUNTED SIDE-CURTAIN DID NOT DEPLOY UPON IMPACT OR WHEN IT ROLLED. *JB",
        "vin": "KM8JN12D66U"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "05/10/2006",
        "dateOfIncident": "04/19/2006",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10157203,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "TUCSON",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RETRACTABLE SEAT BELTS FROM THE CEILING OF THE 2006 HYUNDAI TUCSON ARE DANGEROUS TO CHILDREN. MY 7 YEAR OLD SON RELEASED BOTH ATTACHMENTS AT THE BUCKLE AREA AND IT RETRACTED AND ON ITS WAY UP HIT MY 5 YR OLD NIECE IN  BELOW THE EYE SHE HAD A VERY BIG BLACK EYE FROM THIS INCIDENT I HAVE PICTURES TO SHOW THE INJURY THAT COULD HAVE BEEN WORSE IF IT HAD ACTUALLY HIT HER IN THE EYE.  *NM",
        "vin": ""
    }
]