[
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/01/2020",
        "dateOfIncident": "05/01/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352669,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "GOT THE CAR WHEN MY MOM DIED IN 2015. SHE RECEIVED A RECALL ON THE AIR BAGS BUT WHEN I TOOK IT DOWN TO GET IT FIXED THE GUY TOLD ME AND MY DAUGHTER IN LAW THAT I WAS A WEEK TOO LATE TO GET IT FIXED AND THAT I WOULD HAVE TO PAY FOR IT NOW IF I WANTED IT FIXED. I DON'T HAVE THE CARD THAT WAS MAILED ANYMORE BUT HOW IS THIS SAFE FOR ME, MY FAMILY AND FRIENDS?",
        "vin": "KMHCN46CX6U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/27/2017",
        "dateOfIncident": "11/27/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11048836,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG LIGHT IS ON.  HYUNDAI ISSUED AN EXTENDED WARRANTY FOR THE OCCUPANT CLASSIFICATION SYSTEM. THE DEALER WILL NOT DETERMINE THE CAUSE OF THE ISSUE WITHOUT A DIAGNOSTIC FEE.  THIS IS A SAFETY ISSUE AND SHOULD BE A RECALL SO THE DEALER WILL INSPECT AND ASSIST.",
        "vin": "KMHCN46C46U"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/21/2017",
        "dateOfIncident": "08/20/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10967658,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "SUN VISORS BREAK OFF AT THE CONNECTION POINT AND AND THEN FLOP DOWN BLOCKING YOUR VIEW OF THE ROAD. THIS IS FROM JUST NORMAL USE.  THE DRIVERS SIDE VISOR BROKE LAST YEAR.  I HAD IT UNINSTALLED BECAUSE A NEW ONE, ( WITH SAME DEFECTIVE PLASTIC CONNECTION ), COSTS $150.. PLUS INSTALLATION.  THE PASSENGER SIDE VISOR JUST BROKE OFF THIS MONTH.",
        "vin": "KMHCN46C86U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/04/2016",
        "dateOfIncident": "05/01/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10913800,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2006 ACCENT.  I RECENTLY FOUND OUT IT NEEDS A PASSENGER SEAT SENSOR PANEL REPLACED IN ORDER TO FIX THE AIRBAGS.  (THAT IS, MAKE ANY OF THE AIRBAGS WORK)    I JUST NOW LEARNED I HAVEN'T HAVEN'T HAD AIRBAGS FOR 2 YEARS.!!!!  (ACTUALLY OUR KIDS HAVEN'T   --OUR SONS HAD THE CAR AT COLLEGE, DRIVING HOME ON THE INTERSTATE FOR 2.5 HOURS - WITH NO AIRBAGS)     THE LIGHT WAS ON. FIRST 2 YEARS AGO. I ASKED MY MECHANIC. THAT MECHANIC NEVER ALERTED ME THAT I HAD TO GO TO A DEALER.  MY CURRENT MECHANIC DID - SO WE WENT TO THE HYUNDAI DEALER, PAYING THEIR $80 SERVICE FEE  JUST FOR THEM TO TELL ME IT WILL COST ME AROUND $960 TO FIX IT!!!    I KNOW FROM FORUMS THAT OTHER PEOPLE HAVE HAD THIS PROBLEM AND WE HAVE ALL BEEN TOLD ITS A $1000 TO FIX. JUST THE PART IS $700+!!!!      I ALSO READ THAT HYUNDAI HAD AIRBAG PROBLEMS WITH 2006 SONATAS AND FIXED THEM.    WHY NOT THE ACCENT????   WHY DON'T YOU HAVE TO STAND BEHIND A FAULTY PART ON MULTIPLE CARS?  I HAVE READ OF MANY PEOPLE HAVING THIS ISSUE.    THIS IS MY DILEMMA:    IF I SELL THE CAR I HATE TO SELL A CAR WITH OUT AIRBAGS AND I WILL NOT LIE TO THE BUYER.    IF I KEEP IT I HAVE TO FIX IT  ---FOR OUR SAFETY.    BUT PUT $1000 IN A CAR THAT IS ONLY WORTH $2500???",
        "vin": "KMHCN46C06U"
    },
    {
        "components": "AIR BAGS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/14/2016",
        "dateOfIncident": "02/04/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10906751,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I'M DRIVING MY CAR FOR ALMOST TWO YEARS NOW AND THE LIGHTS FOR THE AIR BAGS ARE STILL ON AND HAVE NEVER WENT OFF. SO I THOUGHT, SUPPOSEDLY MAY BE THE FUSE NEEDS TO BE REPLACED BUT SO FAR TO THIS DATE I CANNOT DETERMINE WHAT'S THE ISSUE OTHER THAN A FAULTY AIR BAG SYSTEM. NO I HAVEN'T TAKEN THE CAR TO A DEALER YET, BUT I NEED TO KNOW AM I THE ONLY PERSON HAVING THIS ISSUE.I LOVE THE VEHICLE BESIDES ITS UNINTENTIONAL POOR GAS USAGE I AM A SATISFIED CUSTOMER. BUT PERHAPS MAYBE ITS TIME TO START SEARCHING FOR A MORE EFFICIENT NEWER CAR. BE CAREFUL WHEN BUYING USED CARS EVERYBODY.",
        "vin": "KMHCN46C56U"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/08/2016",
        "dateOfIncident": "06/10/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10819091,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER AND PASSENGER SUN VISORS ON THE 2006 ACCENT WILL NO LONGER STAY IN THE UPRIGHT POSITION. THE VISORS NOW HANG LOOSELY AND LIMIT VISIBILITY WHEN DRIVING, THE SWINGING BACK AND FORTH WHILE ACCELERATING AND BRAKING CAN BE DISTRACTING AND IS UNSAFE. I HAVE LOOKED TO PURCHASE THE ORIGINAL OEM PARTS TO REPLACE, BUT HAVE DISCOVERED THAT HYUNDAI NO LONGER USES THE ORIGINAL PARTS AND THAT NEW VISORS WAS MANUFACTURED. I HAVE FOUND SIMILAR COMPLAINTS FOR MULTIPLE HYUNDAI MODELS ON THIS SITE AND ON ARFC.ORG. IT APPEARS THAT HYUNDAI RECOGNIZED A FAULTY PART THAT LEADS TO LIMITED VISIBILITY AND DISTRACTION WHILE DRIVING BUT DID NOT ISSUE A RECALL. A RECALL SHOULD BE ISSUED.",
        "vin": "KMHCN46C56U"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/03/2015",
        "dateOfIncident": "07/27/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10745875,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SON HAS A 2006 HYUNDAI ACCENT AND LAST WEEK THE AIR BAG INDICATOR LIGHT WENT ON AND HAS REMAINED ON EVER SINCE.  THE VEHICLE WAS PREVIOUSLY OWNED BY MY FATHER AND HAS APPROXIMATELY 20,000 MILES ON IT.    I HAVE READ OTHER COMPLAINTS ON THIS SITE AND IT APPEARS THAT THIS IS A COMMON PROBLEM.",
        "vin": "KMHCG55C56U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/30/2015",
        "dateOfIncident": "11/13/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10713827,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI ACCENT. THE CONTACT STATED THAT THE AIR BAG WARNING LAMP ILLUMINATED AND REMAINED LIT FOR AN EXTENDED PERIOD OF TIME. THE VEHICLE WAS NOT INSPECTED OR DIAGNOSED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 24,500.",
        "vin": "KMHCN46C96U"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/20/2015",
        "dateOfIncident": "10/15/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10689547,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING DURING NORMAL CONDITIONS AT 45 MPH, FOR NO REASON THE DRIVERS SIDE SUN VISOR DROPPED DOWN AND IMPAIRED MY VISION. I PULLED OVER TO THE SIDE OF THE ROAD AND TRY TO RETURN IT TO ITS NORMAL POSITION WITH NO SUCCESS. I HAVE TRIED VELCRO AND TAPE BUT IT WILL NOT STAY UP. IT IS SERIOUS DRIVING HAZARD, AND JUDGING BY FORUMS ON THE INTERNET, MANY, MANY PEOPLE ARE AFFECTED BY IT. HYUNDAI SHOULD DO A RECALL AND HAVE THE ISSUE FIXED.  *TR",
        "vin": "KMHCN46C36U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/25/2014",
        "dateOfIncident": "12/08/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10668231,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I NOTICED THAT MY AIR BAG WARNING LIGHT CAME ON AND STAYED ILLUMINATED.  I BROUGHT IT TO THE DEALER AND WAS TOLD THAT THE PASSENGER LOWER CUSHION SENSOR ASSEMBLY NEEDED TO BE REPLACED (FOR APPROX. $1,000).  WAS TOLD THAT NONE OF THE AIRBAGS WOULD  WORK IN A COLLISION UNTIL IT WAS REPLACED. SINCE I CAN'T AFFORD TO REPLACE IT NOW, I HAVE NO AIRBAGS.  (I ALSO OWN A 2002 HONDA CIVIC AND HONDA JUST RECENTLY REPLACED BOTH FRONT AIRBAGS IN A RECALL.)  MAKE SURE THAT IF YOU CHOOSE TO BUY A USED HYUNDAI YOU'RE IN A POSITION TO SPEND AN EXTRA $1000 IF YOU WANT YOUR AIRBAGS TO WORK.  YOU MIGHT WANT TO HAVE THE DEALER DO A CODE CHECK TO BE SURE THAT THE AIR BAGS ARE WORKING.  THEN AGAIN, IT COULD BE FINE TODAY AND A B1448 CODE TOMORROW.  IT'S SAD THAT THE GOVERNMENT REQUIRES AUTO MAKERS TO INSTALL AIRBAGS, BUT THEY DON'T REQUIRE THAT THEY WORK.  FACING A $1000 AIR BAG REPAIR, I DO NOT RECOMMEND BUYING A NEW OR USED HYUNDAI.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/04/2014",
        "dateOfIncident": "11/02/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10652412,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKE/STOP LAMP SWITCH HAS FAILED AGAIN. THE SWITCH WAS REPLACED IN 2009 UNDER THE FIRST RECALL ISSUED FOR THIS PROBLEM.  ANOTHER RECALL OCCURRED IN APRIL OF 2013, FOR SELECT 2006 HYUNDAI ACCENTS.  MINE WAS NOT COVERED IN THIS SECOND RECALL.  THE SWITCH HAS FAILED AGAIN AND I BELIEVE THIS SHOULD HAVE BEEN INCLUDED IN THE SECOND RECALL.  *TR",
        "vin": "KMHCN46C26U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/29/2014",
        "dateOfIncident": "10/16/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10651000,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY AIR BAG LIGHT HAS COME ON IN MY 2006 HYUNDAI ACCENT FOR NO REASON & STAYS ILLUMINATED NO MATTER WHAT I DO.  *TR",
        "vin": "KMHCN46CX6U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/20/2014",
        "dateOfIncident": "08/01/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10648755,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI ACCENT. THE CONTACT STATED THAT THE AIR BAG WARNING LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHO DIAGNOSED THAT THE FRONT PASSENGER SIDE SEAT NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 60,000.  UPDATED 11/24/14*LJ    THE CONSUMER STATED THE VEHICLE WAS REPAIRED ABOUT 15 MONTHS AFTER THE FAILURE WAS REPORTED ON NOVEMBER 4, 2014.  UPDATED 5/6/2015  *JS",
        "vin": "KMHCN46C06U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/30/2014",
        "dateOfIncident": "06/02/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10617496,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIR BAG WARNING LIGHT WENT ON. MECHANIC HAD TO REPLACE THE DRIVER'S SIDE SEAT BELT SENSOR TO CORRECT THE PROBLEM. AS THIS AIR BAG SENSOR  IS BEING INVESTIGATED IN THE HYUNDAI SONATA MODELS, I THINK THERE MAY BE A PROBLEM WITH OTHER MODELS THIS COMPANY OFFERS, ESPECIALLY IF THEY ARE USING THE SAME SEAT BELT ASSEMBLY IN ALL MODELS. VERY EXPENSIVE REPAIR FOR A PROBLEM I HAVE NEVER SEEN IN MANY YEARS OF DRIVING.  *TR",
        "vin": "KMHCN46C96U"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "07/29/2014",
        "dateOfIncident": "07/29/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10617417,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "SEAT BELT LIGHT CAME ON AGAIN.  THIS WAS THE THIRD TIME. ABOUT 2 YEARS EARLIER THIS HAPPENED FOR THE SECOND TIME.  THE FIRST TIME WAS ABOUT A YEAR EARLIER AND HYUNDAI COVERED THAT.  CODE B1706 APPEARS WHEN READ FOR $150 AND HYUNDAI WILL NOT FIX IT EVEN UNDER THEIR EXTENDED WARRANTY. THEY DID NOT WANT TO FIX THE FIRST TWO TIMES EITHER.  I DO NOT KNOW IF MY AIRBAGS WORK. HYUNDAI HAS SENSOR PROBLEMS AND KNOWS IT.  THIS IS THE DRIVER SEATBELT SENSOR. THEY WANT $702.00 TO FIX THIS DEFECT.  I WILL NOT PAY FOR THEIR BAD ENGINEERING.  THIS PROBLEM NEEDS A RECALL.  THEIR OXYGEN SENSORS ALSO SEEM TO FAIL ON THE ENGINE. THEY WILL NOT COVER THAT EITHER. ALL OF THESE FAILURES ARE FEDERAL MANDATED ITEMS.   *JS",
        "vin": "5NPEU46F76H"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "07/24/2014",
        "dateOfIncident": "07/24/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10616158,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DRIVER SIDE SUN VISOR ROTATION SUPPORT SNAPPED UPON ROTATING IT'S CLOSED POSITION TO IT'S FORWARD POSITION TOWARDS THE WINDSHIELD. IT APPEARS TO HAVE BEEN MADE OF PLASTIC. IT NOW HANGS FREELY DOWNWARD BLOCKING MY VIEW COMPLETELY. TURNING IT'S POSITION TO THE LEFT TOWARDS THE DRIVER SIDE WINDOW HELPS MY FORWARD VIEW, BUT BLOCKS MY LEFT SIDE VIEW COMPLETELY UNLESS I HUNCH DOWN. THERE IS NO NEUTRAL POSITION TO MOVE THIS VISOR TO UNTIL I CAN GET IT FIXED, WHICH IS CAUSING A SERIOUS DRIVING HAZARD. EVEN A SIMPLE METAL CLIP TO LOCK THE VISOR IN PLACE TEMPORARILY WOULD HAVE BEEN TREMENDOUSLY HELPFUL.  *TR",
        "vin": "KMHCN46CX6U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/22/2014",
        "dateOfIncident": "03/01/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10593427,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI ACCENT. THE CONTACT STATED WHILE THAT THE FRONT PASSENGER'S AIR BAG LIGHT WOULD INTERMITTENTLY ILLUMINATE WITHOUT AN OCCUPANT SEATED. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSTIC TESTING. THE DEALER STATED THE PASSENGER SEAT SENSOR NEEDED TO BE REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 153,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/17/2014",
        "dateOfIncident": "09/01/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10592122,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG LIGHT ON DASHBOARD  IS ON ALL THE TIME.   *JS",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/27/2014",
        "dateOfIncident": "06/01/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10567243,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ISSUE IS THAT THE AIRBAG LIGHT IS ON; I BROUGHT THIS VEHICLE TO THE HYUNDAI DEALERSHIP MULTIPLE TIMES OVER THE LAST FEW YEARS, AND EACH TIME THEY RAN SOME KIND OF DIAGNOSTIC TEST ON IT, THE AIRBAG LIGHT WOULD BE OFF A FEW MONTHS, AND THEN MYSTERIOUSLY WOULD BE BACK ON AGAIN; I KEPT FOLLOWING THIS PROCESS UNTIL THEY TOLD ME THE WARRANTY WAS EXPIRED AND TO REALLY FIX THE ISSUE I HAD TO COUGH UP ALMOST $1,000 .... AND, WHY AM I BEING ASKED TO PAY THIS KIND OF MONEY FOR A MANUFACTURER DEFECT?  PLEASE FINALLY INVESTIGATE THIS ISSUE AND BRING 2006 HYUNDAI ACCENT OWNERS THE KIND OF CLOSURE THAT THE 2006 HYUNDAI SONATA OWNERS HAD FOR THE SAME ISSUE.  CLEARLY WE HAVE A CLASS ACTION LAWSUIT THAT IS IMMINENT AFTER VIEWING THE MULTIPLE ISSUES WITH THIS SAME PROBLEM; AND IT'S TOO MUCH OF A COINCIDENCE THAT THERE WAS A RECALL ON THE 2006 HYUNDAI SONATA'S FOR THE SAME ISSUE WITH THE AIRBAG LIGHT.  IS AN ANALYST AT YOUR OFFICE FINALLY GOING TO \"FLAG\" THIS AS A REAL ISSUE AND ADDRESS THIS AND PURSUE IT.  DO THE RESEARCH AND YOU WILL FIND OUT WHAT I DID.  PLEASE CONTACT THE 2006 HYUNDAI ACCENT OWNERS THAT ALSO HAVE THIS PROBLEM.  THIS IS MORE THAN ABOUT MONEY, IT'S CLEAR AS THE NOSE ON ANYONE'S FACE THAT THIS IS A MANUFACTURER DEFECT THAT NOONE SHOULD HAVE TO PAY FOR.",
        "vin": "KMHCN46C46U"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "12/20/2013",
        "dateOfIncident": "10/17/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10556827,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SIDE VISOR WILL NOT STAY UP ON 2006 HYUNDAI ACCENT VISOR IS FALLING WHILE DRIVING AND BLOCKING VISIBILITY.  *TR",
        "vin": "KMHCN46C26U"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/27/2013",
        "dateOfIncident": "11/25/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10553956,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2006 HYUNDAI ACCENT. THE BRAKE LIGHT SWITCH HAS GONE OUT ON MY VEHICLE. THIS IS ACTUALLY THE 2ND TIME THIS HAS HAPPENED. IT WENT OUT THE FIRST TIME IN THE 2007 OR 2008 TIME FRAME.  I HAD IT REPLACE UNDER WARRANTY. ABOUT A WEEK AGO THE BRAKE LIGHT SWITCH WENT OUT AGAIN. WHEN I WENT ONTO PEPBOYS WEBSITE AND PUT MY CAR INFORMATION IN THE ALERT OF A BRAKE LIGHT SWITCH RECALL CAME UP. I CONTACT HYUNDAI TO SEE IF MY CAR WOULD QUALIFY FOR THE RECALL SINCE MY SWITCH HAS FAILED AND IS A 2006 MODEL.  THEY CLAIM MY CAR DOES NOT MEET THE RECALL LIST. I TOLD THEM THAT MY SWITCH HAS ALREADY FAIL AND THEY SAID THEY CAN'T DO ANYTHING ABOUT. I FEEL THAT THEY PUT A BAD SWITCH ON MY CAR AND THAT THE RECALL SHOULD HAVE COVERED MY CAR. I HAVE HAD 2 SWITCH FAIL ON THAT CAR AND THE SECOND WAS PUT IN DURING THE TIME OF THE RECALL COVERED BUT THEY STILL REFUSE TO COVER. MY CAR IS UNSAFE RIGHT NOW UNTIL I HAVE IT FIXED AND HYUNDAI CLAIMS THAT THE PROBLEM PART IS NOT THERE PROBLEM.  *TR",
        "vin": "KMHCN46C86U"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/22/2013",
        "dateOfIncident": "08/01/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10499633,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER'S SIDE VISOR WOULD NOT GO UP FOR A YEAR AND HUNG DOWN, AFFECTING MY VISIBILITY AND WAS A HUGE RISK WHEN DRIVING. DUE TO THE VISOR HANGING DOWN, IT EVENTUALLY BECAME WEAK ON THE LEFT CORNER AND WAS HANGING BY THE ELECTRICAL CORDS (FOR THE LIGHT) AND FELL OFF COMPLETELY. NOW I DO NOT HAVE A VISOR AT ALL AND IT AFFECTS MY DRIVING IMMENSELY AS I HAVE NOTHING TO KEEP THE SUN OUT OF MY EYES. I HAVE CONTACTED HYUNDAI SEVERAL TIMES ABOUT THIS ISSUE AND THEY CLAIM TO KNOW NOTHING ABOUT IT, BUT I KNOW FOUR OTHER HYUNDAI OWNERS WHO THIS HAS ALSO HAPPENED TO.  *TR",
        "vin": ""
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "11/10/2012",
        "dateOfIncident": "12/18/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10483930,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER'S SIDE VISOR BREAKS OFF ATTACHMENT- HANGS FROM CEILING UNLESS LOCKED INTO PLACE-USELESS AND POTENTIAL HAZARD. LAMP CONNECTED TO OPENING THE MIRROR COVER DOES NOT WORK. HAD IT REPLACED AT THE BEGINNING OF THE YEAR FOLLOWING BREAKING. LAST MONTH- RIGHT SIDE VISOR BREAKS IN THE SAME FASHION AND ONCE AGAIN, DOES NOT STAY UNLESS LOCKED INTO PLACE, A POTENTIAL HAZARD, USELESS AND THE LAMP THAT IS SUPPOSED TO TURN ON WHEN THE MIRROR COVER IS OPENED DOES NOT WORK AGAIN. MANY PEOPLE HAVE HAD THE SAME ISSUES. NEEDS TO BE RECALLED, THIS IS APPARENTLY A DEFECT OF THE PARTS.  *TR",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/28/2012",
        "dateOfIncident": "06/21/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10463439,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI ACCENT. THE CONTACT STATED THAT THE DRIVER SIDE SUN VISOR WOULD NOT STAY UP, IMPAIRING THE CONTACT'S VISION. THE CONTACT CALLED THE MANUFACTURER REGARDING THE SUN VISOR AND THE MANUFACTURER STATED THAT THERE WAS NOTHING THEY COULD DO TO ASSIST. THE CONTACT DID NOT TAKE THE VEHICLE TO THE DEALER OR A MECHANIC. THE FAILURE MILEAGE WAS 80,000.",
        "vin": "KMHCN46C96U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/19/2011",
        "dateOfIncident": "03/01/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10403089,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 HYUNDAI ACCENT GLS 4 DOOR... SRS MODULE FAILURE CAUSING AIR BAG LIGHT ILLUMINATED ON DASH... MODULE IS LOCATED BETWEEN THE DRIVER AND PASSENGER SEAT UNDERNEATH CUP HOLDERS AND IS EXPOSED TO MOISTURE... MODULE IS NOT PROTECTED FROM MOISTURE RESULTING IN SRS SYSTEM BEING DISABLED... AIR BAGS WILL NOT DEPLOY IF VEHICLE IS INVOLVED IN AN ACCIDENT... HYUNDAI DENIES A PROBLEM EXISTS...",
        "vin": "KMHCN46C26U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/27/2011",
        "dateOfIncident": "03/15/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10392995,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 3/15/11 MY RIGHT SIDE CURTAIN AIRBAG AND PASSENGER SEAT AIRBAG DEPLOYED WITH NO COLLISION OR IMPACT OR ANY KIND, STRIKING MY PASSENGER. I WAS DRIVING DOWN THE ROAD, OUT OF TOWN IN JACKSONVILLE FL. AND ALMOST GETTING TO OUR DESTINATION, AND THOUGHT WE WERE SHOT. I PULLED INTO THE CLOSEST GAS STATION AND TRIED TO CALL JSO TO MAKE A REPORT, THEY SAID THEY COULDN'T MAKE A REPORT ON MANUFACTURER DEFECT, SO I CALLED TO MAKE AN INSURANCE CLAIM. THE NEXT MORNING I CONTACTED A LOCAL HYUNDAI DEALERSHIP, AND THEY TOLD ME BRING IT IN IMMEDIATELY. UPON BRINGING IN MY CAR THEY INSISTED THEY NEEDED TO DO A DIAGNOSTICS TEST. AFTER 2 DAYS OF HAVING MY VEHICLE, AND A RENTAL AT MY EXPENSE, I HAD TO COME HOME TO CHARLESTON, SC. THE DEALERSHIP IN JACKSONVILLE, JANCK HANANIA'S HYUNDAI OF ORANGE PARK, TOLD MY INSURANCE COMPANY THE AIRBAG DEPLOYMENT WAS DUE TO USED TIRES ON THE VEHICLE. AFTER RETURNING TO CHARLESTON, I TOOK MY CAR TO ANOTHER HYUNDAI DEALERSHIP, HENDRICK HYUNDAI NORTH, AND FINALLY WAS GIVEN A NUMBER TO CONTACT HYUNDAI MOTORS AMERICA. THE DEALERSHIP STILL HAS MY CAR, HYUNDAI HAS TOLD ME NOTHING AND STILL WILL NOT EXCEPT RESPONSIBILITY FOR THE AIRBAG DEPLOYMENT.   *TR",
        "vin": "KMHCN46C76U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/06/2011",
        "dateOfIncident": "01/05/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10374882,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN TO THE DEALERSHIP THREE TIMES FOR THE SAME ISSUE WITH MY HYUNDAI 2006 ACCENT. THE AIRBAG LIGHT IS DEFECTIVE AND WILL NOT TURN OFF. I HAVE SINCE BEEN TOLD THAT IT IS UPWARDS OF A 1,000+ TO FIX. AND THE WARRANTY IS NOT LIABLE, NOR IS IT A RECALL OR THE DEALERSHIP RESPONSIBLE. THEY HAVE SAID THAT THEY DO NOT KNOW IF THE AIRBAGS WILL DEPLOY, AND THE COMPANY REP DID NOT SEEM TO CARE ABOUT THE ISSUE. THIS SEEMS TO BE A WELL DOCUMENTED ISSUE, I AM CONCERNED WHY THE PROBLEM HAS NOT BEEN RECTIFIED. THERE HAVE BEEN MULTIPLE CASES WHERE THERE AIRBAG HAS FAILED OTHERS, EITHER DEPLOYING MYSTERIOUSLY OR FAILING TO DEPLOY IN A CRASH. SINCE THIS IS A KNOWN DEFECT IN THE MANUFACTURE, IT SHOULD HAVE BEEN ADDRESSED. I HAVE NO MONEY TO FIX THIS PROBLEM THAT IS DUE TO NEGLIGENCE KNOWINGLY COMMITTED BY HYUNDAI MOTORS. *TR",
        "vin": "KMHCN46C36U"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "09/15/2010",
        "dateOfIncident": "08/15/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10355854,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER'S SIDE SUN VISOR WILL NOT STAY UP ON 2006 HYUNDAI ACCENT.  SUN VISOR WILL FALL WHILE DRIVING AND WILL BLOCK VISIBILITY. *TR",
        "vin": "KMHCN46C26U"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "06/14/2010",
        "dateOfIncident": "05/05/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10336144,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVERS SIDE VISOR DOES NOT STAY UP. IT SEEMS TO HAVE BROKEN, AND ALSO THE VISOR LIGHT DOES NOT WORK. $175 TO REPLACE - NOT REPAIRED, TOO EXPENSIVE. I NOW EXTEND THE PLASTIC FLAP AND PLACE THAT ON TOP OF THE MIRROR TO HOLD IT UP. VERY ANNOYING AND NEEDS TO BE A RECALL BY HYUNDAI. *TR",
        "vin": "KMHCN46C46U"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "05/17/2010",
        "dateOfIncident": "05/10/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10330877,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2006 HYUNDAI ACCENT AND THE SUN VISOR ON THE DRIVERS SIDE IS NOT STAYING UP.  IT FALLS WHILE I AM DRIVING AND THERE DOESN'T SEEM TO BE AN EFFECTIVE SOLUTION.  I RESEARCHED THIS TOPIC AND DISCOVERED THAT OTHER HYUNDAI VEHICLES FROM 2006 AND 2007 ARE HAVING SIMILAR ISSUES.  I CONTACTED HYUNDAI AND WAS TOLD I'D HAVE TO PAY $175 FOR A NEW VISOR AND THAT THIS IS NOT COVERED BY WARRANTY.  I BOUGHT THIS CAR BRAND NEW AND HAVE HAD IT LESS THAN FOUR YEARS.  THIS IS UNACCEPTABLE. *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/24/2009",
        "dateOfIncident": "11/15/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10293389,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2006 MANUAL TRANSMISSION HYUNDAI ACCENT (GLS 4 DR 5 SPEED) WITH 36,000 MILES.  ON A TRIP TO VERMONT, I WAS DRIVING UP RT 7 MOUNTAINS AND ACCELERATING UPHILL WHEN MY MANUAL TRANSMISSION JUMPED OUT OF GEAR, REVVED UP -  I WAS IN EITHER THIRD OR FOURTH GEAR AND PUT IT BACK INTO GEAR -  THIS HAPPEN AROUND 6-8 TIME WHILE GOING UP HILL AND ACCELERATING.  AFTER CLIMBING THE MOUNTAIN,  THINGS WERE OK BUT ON A LOW GRADE HILL IT HAPPENED A FEW MORE TIMES AND THEN ONCE ON A FLAT SURFACE.  THIS WAS ABOUT 10 DAYS AGO.  SINCE THEN,  I AM BACK HOME IN SYRACUSE, NY AND IT HAS NOT REPEATED ITSELF BUT I HAVE NOT HAD THE OPPORTUNITY TO DUPLICATE THE STEEP ACCENT WITH ACCELERATION.  I TOOK THIS IN TO MY HYUNDAI DEALER AND OF COURSE THEY COULD NOT DUPLICATE IT -  THEY INDICATED THAT THEY NEVER HEARD OF THIS BEFORE AND BRING IT BACK IF IT RECURS.  I ASKED ABOUT COMPUTER READOUTS AND THEY INDICATED IT WOULDN'T SHOW UP.  I DID A GOOGLE SEARCH AND ONLY FOUND AN ARTICLE ON PROBLEM WITH THE PULSE GENERATOR - I DID THIS SEARCH AFTER BRINGING IT HOME FROM THE DEALER (HTTP://WWW.CARSURVEY.ORG/REVIEWS/HYUNDAI/ACCENT/R49906/COMMENTS/PAGE-2/)      HAVE YOU HEARD OF THIS BEFORE? *TR",
        "vin": "KMHCN46C56U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/05/2009",
        "dateOfIncident": "11/03/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10291147,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL ON MY BRAKE LIGHT (DON'T HAVE ANY)STOP WORKING 2 DAYS A GO BEEN WAITING FOR CALL BACK. *TR",
        "vin": "KMHCN46C56U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/01/2009",
        "dateOfIncident": "06/01/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10290501,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2006 HYUNDAI ACCENT THAT I BOUGHT ABOUT 3 YEARS AGO BRAND NEW.  I HAVE NOTICED THAT MY AIR BAG LIGHT WILL NOT TURN OFF AND WHEN SOMEONE IS SITTING IN THE PASSENGER SEAT THE AIR BAG LIGHT THAT LETS YOU KNOW WHEN THE PASSENGER AIR BAG LIGHT IS ON OR OFF WILL CONTINUE TO SAY PASSENGER AIR BAG OFF. *TR",
        "vin": "KMHCN46C26U"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/22/2009",
        "dateOfIncident": "06/06/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10289358,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 HYUNDAI ACCENT RIGHT REAR CALIPER ON 6/6/2009 BRAKE LOCKED UP NEW BRAKES AND PAD PUT ON AT MIDAS WINTERHAVEN, FL WITH THE MANAGER ADVISING THAT BRAKE PADS DISINTEGRATED AND MANUFACTURING DEFECT SUGGESTED I CONTACT  HYUNDAI WHICH I DID.  ON 10/192009 RIGHT REAR BRAKE MAKES GRINDING NOISE I TOOK THE VEHICLE HOME ON 10/20/2009 I TAKE TO MIDAS TAMPA, FL THEY ADVISE BRAKES INTO THE ROTORS AND THE CALIPER IS FACING UPWARD NEEDS REPLACED AND IS MANUFACTURING FAILURE AND TO CONTACT HYUNDAI AND WHEN I DID CALL I WAS PLACED ON HOLD FOR 20 MINUTES SO I ENDED CALL.  I CONTACTED DEALERSHIP BUTLER HYUNDAI AND SERVICE MANAGER STATES IT HAPPENS.  MY CONCERN IS THIS CAR 66,000  SOME ODD MILES THE FIRST TIME THE BRAKE LOCKED UP.  THIS IS A SAFETY CONCERN BECAUSE THE CAR IS ONLY 2006 AND HAS SAT IDLE WHILE AT WORK A MINIMUM OF 40 HS A WEEK AND MOST OF THE MILES ARE HIGHWAY MILES NOT STOPPING AND STARTING.  THIS CALIPER IS ESSENTIAL FOR SAFETY OF THE ROAD. PLEASE REVIEW FOR RECALL ON THE ITEM OF HYUNDAI. *TR",
        "vin": "KMHCN46C26U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/25/2009",
        "dateOfIncident": "06/17/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10274997,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "06/17/2009 THE AIR BAG LIGHT CAME ON AND STAYED ON. I CALLED THE DEALERSHIP AND MADE AN APPOINTMENT TO HAVE IT CHECKED ON 06/24/2009. THE RESULT IS THE COMPUTER MODULE TO THE AIR BAGS SHORTED OUT DUE TO A SPILL. THE SERVICE MAN TOLD ME THAT THE PART IS LOCATED UNDER THE CUP HOLDERS WHERE THE LIKELIHOOD OF A SPILL IS HIGH AND EVIDENTLY THERE IS NO PROTECTIVE COVERING ON THE MODULE TO KEEP IT DRY IN THE CASE OF A SPILL. I HAVE CONTACTED THE CONSUMER AFFAIRS DEPT. AT HYUNDAI BECAUSE I WAS TOLD AT THE SERVICE DEPT. THAT THE REPAIRS ARE NOT COVERED UNDER THE WARRANTY BECAUSE THE PART FAILED DUE TO OUTSIDE INFLUENCE AND NOT A DEFECT IN THE PART. I TOLD THEM THAT THE DEFECT MAY NOT BE THE PART BUT THERE IS A DEFECT IN THE DESIGN BY PLACING AN UNPROTECTED ELECTRONIC COMPONENT BENEATH AN AREA WHERE THE LIKELIHOOD OF A SPILL IS HIGH DUE TO THE FACT THAT THEY DESIGNED A CUP HOLDER TO BE PLACED OVER THIS SENSITIVE COMPONENT. IF THE WARNING LIGHT WOULD HAVE FAILED THERE WOULD BE NO WARNING THAT THERE WAS NO OPERATIONAL AIR BAGS IN THE VEHICLE. AT THIS TIME REPAIRS HAVE NOT BEEN MADE AND ALL AIR BAGS ARE NON-FUNCTIONAL AT THIS TIME. I WAS INFORMED THAT A SIMILAR PROBLEM OCCURRED IN THE ELANTRA BUT WAS NOT TOLD WHAT YEAR MODEL. *TR",
        "vin": "KMHCN46C76U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/02/2009",
        "dateOfIncident": "02/26/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10264012,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 HYUNDAI ACCENT.  THE CONTACT STATED THAT THE TAIL LIGHTS ON THE VEHICLE STOPPED WORKING.  THE DEALER COULD NOT DETERMINE THE CAUSE OF THE FAILURE.  SHE IS CURRENTLY UNABLE TO DRIVE THE VEHICLE AT NIGHT DUE TO THE FAILURE.  IN ADDITION, A CRASH COULD OCCUR OR THE CONTACT COULD BE TICKETED BY THE POLICE.  THE VIN WAS UNKNOWN.  THE CURRENT MILEAGE WAS 45,170 AND FAILURE MILEAGE WAS 42,000.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/05/2009",
        "dateOfIncident": "01/14/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10257531,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SISTER AND I WERE ON OUR WAY TO THE STORE, FULL STOP, MY SISTER JUST GOT ON THE FRONT PASSENGER SIDE, MY SISTER NOTICED THAT THE PASSENGER AIRBAG DETECTION LIGHT ON THE DASH REMAINED IN THE \"PASSENGER AIR BAG DISENGAGE\" POSITION EVEN IF MY SISTER WAS SITTING ON THE PASSENGER SEAT.  MY CAR IS NOT EQUIPPED WITH A MANUAL PASSENGER AIRBAG DISENGAGE SWITCH OF SOME SORT.  SO I ASSUME THAT THE LIGHT GOES ON OR OFF ONLY BY DETECTING SIGNIFICANT WEIGHT ON THE FRONT PASSENGER SEAT. *TR",
        "vin": "KMHCN46C36U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/16/2008",
        "dateOfIncident": "06/02/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10245703,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 HYUNDAI ACCENT.  WHILE DRIVING AT AN UNKNOWN SPEED, THE CHECK ENGINE LIGHT ILLUMINATED INTERMITTENTLY AND OCCASIONALLY TURNS ON AND OFF.  THE VEHICLE HAS BEEN TO THE DEALER APPROXIMATELY NINE TIMES WITH NO RESOLUTION.  THE CURRENT MILEAGE WAS 34,900 AND FAILURE MILEAGE WAS 1,999.      UPDATED 11/10/08  *BF  UPDATED 11/13/08. *JB",
        "vin": "KMHCN46CX6U"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/13/2007",
        "dateOfIncident": "06/12/2006",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 1,
        "numberOfInjuries": 0,
        "odiNumber": 10202957,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 21 YR.OLD SON WAS DRIVING HOME AT APROX 2:53A.M. LOST CONTROL OF HIS 2006 HYUNDI BRIO AND CRASHES THE FRONT LEFT SIDE AND LATER FOLLOWED THOUGH TO ANOTHER WALL IMPACTING IT SIDEWAYS . THE FONTAL AIRBAGS DID NOT DEPLOY AND  HE LATER DIED AT HOSPITAL OF SEVERE  ABDOMIAL TRAUMA , RIBS PUNCTURIG BOTH LUNGS. AS A FATHER HOW CAN I KNOW IF THE FIRST IMPACT WAS STRONG ENOUGH TO MAKE THE AIRBAGS DEPLOY AND IF THERE HAVE BEEN RECALLS FOR PROBLEMS CONCERNING AIRBAG DEPLOYMENT FAILURE.  THE MODEL OF THE CAR WAS HYUNDAI BRIO.",
        "vin": "KMHCF35G25U"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "07/18/2007",
        "dateOfIncident": "06/26/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10196718,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "CD PLAYER MALFUNCTIONED, CDS  WOULD ENTER THE PLAYER BEGAN  AND THEN STOPPED  BETWEEN 20-60 SECONDS AND NEVER RESTARTED.  WENT TO THE DEALER, SEEMED LIKE IT WAS A KNOWN  PROBLEM,  AND THEY REPLACED THE ENTIRE RADIO WITH A REFURBISHED ONE AT NO COST AS THE RADIO WAS UNDER WARRANTY FOR 3 YEARS.  *AK",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/03/2006",
        "dateOfIncident": "11/02/2006",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10172526,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED WHILE TRAVELING 30 MPH, THE VEHICLE REAR ENDED ANOTHER VEHICLE THAT HAD SUDDENLY STOPPED.  BOTH FRONTAL AIR BAGS FAILED TO DEPLOY.  THE SERVICE DEALER WAS SENT TO TOW THE VEHICLE TO THE DEALERSHIP.  NO INJURIES WERE SUSTAINED AS SEATBELTS WERE WORN AND A POLICE REPORT WAS TAKEN.  PHOTOS WERE TAKEN OF THE VEHICLE AND THE MANUFACTURER WAS NOTIFIED.",
        "vin": "KMHCN46CX6U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/16/2006",
        "dateOfIncident": "08/16/2006",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10165683,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE THE PASSENGER WAS SEATED IN THE UPRIGHT POSITION, THE AIRBAG ACTIVATION LIGHT ILLUMINATED INTERMITTENTLY.  THE PASSENGER WEIGHED 114 POUNDS.  THE DEALERSHIP COULD NOT DUPLICATE THE PROBLEM, AND THE MANUFACTURER WAS CONTACTED.",
        "vin": "KMHCN46C46U"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/09/2006",
        "dateOfIncident": "02/09/2006",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10149850,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WE PURCHASED A 2006 HYUNDAI ELANTRA 12/30/2005. TWO DAYS LATER THE WINDSHIELD WIPER WENT OUT, THE NEXT DAY THE OTHER WENT. WE CALLED THE DEALERSHIP TO MAKE AN APPOINTMENT FOR SERVICE. THE SERVICE GUY TOLD US TO TIGHTEN THE WIPER DOWN WITH A WRENCH. THIS WORKED FOR AWHILE BUT WIPERS WENT OUT INTERMITTENTLY. TOOK CAR IN FOR SERVICE. WORKED FOR SEVERAL WEEKS, THEN WENT OUT AGAIN, WHEN MY SON WAS DRIVING ON THE PARKWAY, LUCKILY HE WAS ABLE TO GET OFF ON THE NEXT EXIT AND MAKE IT HOME.  I CALLED THE DEALERSHIP  AND SPOKE WITH THE  SERVICE GUY AND WAS TOLD TO TIGHTEN BOLT AGAIN.  I REQUESTED TO BRING THE CAR IN HE TOLD ME THE ONLY THING THEY WOULD DO TO FIX THE PROBLEM WAS TIGHTEN THE BOLT, AND THAT THIS WAS A COMMON PROBLEM WITH SOME HYUNDAI CARS, THE BOLT COMES LOOSE. I ASKED WHAT HAPPENS IF I AM DRIVING DOWN THE PARKWAY IN FAST LANE IN A RAIN OR SNOW STORM AND WIPER STOPS WORKING? THAT WOULD BE DISASTROUS. THIS IS DEFINITELY A PROBLEM THAT NEED TO BE FIXED WITH SOMETHING OTHER THAN A BOLT TIGHTENING. I FILED A COMPLAINT WITH HYUNDAI MOTOR COMPANY. NO ACTION HAS BEEN TAKEN AT THIS TIME. BUT IF THE COMPANY IS AWARE OF THIS PROBLEM THERE SHOULD BE A RECALL, BEFORE SOMEONE IS SERIOUSLY INJURED.  *NM",
        "vin": "KMHDN46D46U"
    }
]