[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/20/2014",
        "dateOfIncident": "11/15/2014",
        "fire": false,
        "manufacturer": "Winnebago Industries, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10659757,
        "products": [
            {
                "manufacturer": "Winnebago Industries, Inc.",
                "productMake": "ITASCA",
                "productModel": "SUNOVA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING NORTH ON I-15 BETWEEN HESPERIA AND BARSTOW, CALIFORNIA, THE FIBERGLASS SKIN ON THE ROOF OF OUR RV STARTED BLOWING OFF. BY THE TIME WE WERE ABLE TO SAFELY PULL TO THE SIDE OF THE FREEWAY, 80% OF THE ROOF SKIN HAD SEPARATED FROM THE FRAME AND LARGE PARTS WERE FLYING THROUGH THE AIR.  FORTUNATELY THE WIND WAS BLOWING TOWARDS THE SHOULDER AND MOST OF THE FLYING DEBRIS LANDED ON THE SIDE OF THE ROAD AS WE WERE IN THE LANE CLOSEST TO THE SHOULDER. THE DEBRIS INCLUDED THE LAVATORY EXHAUST FAN, FIBERGLASS STYREFOAM, WOOD PANELING AND POSSIBLY COULD HAVE BROUGHT THE AIR CONDITIONER AND SATELLITE DOWN.  AFTER TALKING TO SEVERAL REPAIR SHOPS AND READING ONLINE, THIS HAS BEEN AN ONGOING PROBLEM WITH THESE VEHICLES AND NO ONE FROM WINNEBEGO/ITASCA NOTIFIED US OF THIS POTENFIAL FAILURE. I BELIEVE THAT SERIOUS INJURIES OR DEATHS COULD RESULT FROM THIS.  *TR",
        "vin": "1F6MF53Y660"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "11/03/2009",
        "dateOfIncident": "12/03/2008",
        "fire": false,
        "manufacturer": "Winnebago Industries, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10290819,
        "products": [
            {
                "manufacturer": "Winnebago Industries, Inc.",
                "productMake": "ITASCA",
                "productModel": "SUNOVA",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "GOODYEAR",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 ITASCA SUNOVA RV  WITH GOODYEAR TIRES DOT# MJ93-MAHW, SIZE 245/70/ R19. WHILE DRIVING 50 MPH SHE HEARD A PECULIAR NOISE FROM THE REAR END OF THE VEHICLE.   UPON VEHICLE INSPECTION SHE NOTICED THAT THE INSIDE OF DRIVER-SIDE REAR TIRE HAD EXPLODED. THE TIRE WAS TAKEN TO A DEALERSHIP WHERE THE CONTACT WAS INFORMED THAT THE INNER MESH LINING OF THE TIRE HAD CORRODED. THERE WERE NO PRIOR WARNINGS. THE CURRENT AND FAILURE MILEAGES WERE 19500. UPDATED 12/07/09. *LJ  THE CONSUMER HAD EXPERIENCED 4 TIRE BLOWOUTS. GOODYEAR DID NOT OFFER ANY ASSISTANCE. UPDATED 12/08/09",
        "vin": "1F6NF53Y560"
    }
]