[
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/05/2021",
        "dateOfIncident": "10/04/2021",
        "fire": true,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435555,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2006 Hyundai Santa Fe. The contact stated while driving approximately 70 mph when the vehicle began to accelerate without the accelerator pedal being depressed. The contact was able to pull over and noticed smoke coming from the engine compartment. The contact stated no warning lights were illuminated. The vehicle was towed to a local mechanic where it was not diagnosed or repaired. The manufacturer was not informed of the failure. The failure mileage was approximately 143,000.",
        "vin": "KM8SC13E66U"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/30/2021",
        "dateOfIncident": "04/01/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427123,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2006 Hyundai Santa Fe. The contact stated while operating the vehicle, there was an abnormal fuel odor inside and outside the vehicle. The contact discovered that there was fuel leaking underneath the vehicle. The vehicle was taken to the local dealer who diagnosed that the fuel tank was faulty and needed to be replaced. The vehicle was not yet repaired. The manufacturer was not notified of the failure. The failure mileage was 118,000.",
        "vin": "KM8SC73EX6U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/18/2020",
        "dateOfIncident": "06/03/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329602,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DASHBOARD RED AIRBAG STAY ON ALL THE TIME.  *TR",
        "vin": "KM8SC73D86U"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/06/2020",
        "dateOfIncident": "03/04/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11320353,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MARCH 4, 2020, HEADING HOME AT NIGHT ON A CURVY MOUNTAIN ROAD MY CAR (2006 HYUNDAI SANTA FE) SUDDENLY JERKED, STARTED TO ACCELERATE TO OVER 80 MILES HOUR. AT THE SAME TIME HALF OF THE PANEL LIGHT BEHIND PART OF THE RPM'S AND HALF BEHIND THE MPH WENT OUT; THE REST OF THE PANEL WAS STILL LIT UP; I WAS HEADING DOWN THE CURVY ROAD ACCELERATING HEADING QUICKLY TOWARDS AN 18 WHEELER WHEN I TRIED TO BRAKE, MY BRAKE PEDAL WOULD NOT MOVE AND MY CAR KEPT ACCELERATING (I WAS NOT STEPPING ON THE GAS PEDAL). I QUICKLY DROPPED MY CAR INTO LOW GEAR AND MANEUVERED AROUND THE 18-WHEELER AND TRYING THE BRAKES, THE EMERGENCY BRAKES, AND AS QUICKLY AS IT STARTED UP, IT STOPPED, AND MY CAR STARTED TO DRIVE NORMAL (EXCEPT THE PANEL LIGHTS). ON MY WAY HOME (MARCH 5TH), IT HAPPENED AGAIN WHILE DRIVING DOWN THE CURVY MOUNTAIN ROAD AT NIGHT! AS I BEGIN DESCENDING THE CURVY ROAD (DRIVING 40MPH IN THE RIGHT LANE), MY CAR SUDDENLY BEGAN ACCELERATING AGAIN UP TO 90MPH! THERE WERE NOT AS MANY PEOPLE ON THE ROAD, SO I WAS ABLE TO MANEUVER IT BY DROPPING DOWN INTO LOW GEAR AND AS I BEGAN ASCENDING THE MOUNTAIN ROAD, THE UNINTENDED ACCELERATION STOPPED, AND THE CAR DROVE NORMAL. EACH INCIDENT LASTED ABOUT 5 MINUTES.  ON MARCH 6, 2020, I TOOK MY CAR TO THE MECHANIC AND RAN A DIAGNOSTIC AND DID NOT FIND A CAUSE. HE TOLD ME TO CALL THE HYUNDAI DEALERSHIP TO SEE IF THERE WERE ANY RECALLS. THE DEALERSHIP INFORMED ME TO CONTACT HYUNDAI HEADQUARTERS, WHICH I DID. I REPORTED MY ISSUE AND MADE A CLAIM ON MARCH 6, 2020. I WAS TOLD TO TAKE MY CAR TO CAPITAL HYUNDAI DEALERSHIP AND HYUNDAI HEADQUARTERS WOULD SEND A FORENSIC ENGINEER OUT TO INVESTIGATE THE ISSUE. THEY TOLD ME TO NOT DRIVE MY CAR AND HAVE IT TOWED.   I RECEIVED A CALL FROM HYUNDAI HEADQUARTERS INFORMING ME THE DEALERSHIP RAN A DIAGNOSTIC ON MY CAR AND DID NOT FIND ANYTHING WRONG AND COULD NOT DUPLICATE THE UNINTENDED ACCELERATION.",
        "vin": "KM8SC13E16U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/12/2019",
        "dateOfIncident": "10/21/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11279697,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIR BAG LIGHT IS CONSTANTLY ON. WHEN I TURN THE CAR ON THE PASSENGER RESTRAINT LIGHT GOES ON TO SHOW RESTRAINT SYSTEM OFF.. HOWEVER WHEN THERE IS NOBODY SITTING IN FRONT SEAT THE LIGHT GOES OUT AND IT SHOULD STAY ON",
        "vin": "KM8SC13D76U"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/09/2019",
        "dateOfIncident": "08/04/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11242917,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR BEGAN TO SUDDENLY AND  AUTOMATICALLY ACCELERATE WHILE DRIVING ON THE FREEWAY ON AUGUST 4, 2019. THE SPEED  ACCELERATED UP TO ABOUT 80MPH BEFORE BEING ABLE TO GET THE CAR TO SLOW DOWN.  THE  BRAKES WERE EXTREMELY DIFFICULT TO DEPRESS.   I HAD TO KEEP MY FOOT ON THE BRAKE PEDAL AND PRESS AS HARD AS I COULD IN ORDER TO KEEP THE CAR FROM ACCELERATING AGAIN.  THANK GOD, THERE WERE NO CARS DIRECTLY IN FRONT OF ME OR ON THE SIDE OF MY CAR BECAUSE THIS  WOULD HAVE CAUSED A VERY SERIOUS ACCIDENT.  I WAS EVENTUALLY ABLE TO PULL OVER ONTO THE SHOULDER, BUT I WAS UNABLE TO COMPLETELY STOP THE CAR FROM MOVING EVEN THOUGH SHIFTING TO PARK.  THE CAR WOULD NOT STOP MOVING FORWARD UNTIL I SHUT THE ENGINE OFF,  WHICH CAUSED A VERY LOUD NOISE.     MY CAR HAD TO BE TOWED TO THE CLOSEST HYUNDAI DEALER.  THE SERVICE MAN AT THE DEALERSHIP DIAGNOSED,  REPAIRED, INSPECTED AS WELL AS TEST DROVE THE CAR.  THE COST FOR REPAIRS WERE CLOSE TO $900.00.  NOW, ON THE WAY HOME AFTER PICKING UP MY CAR FROM BEING REPAIRED ON AUGUST 8, 2019, THE SAME THING HAPPENED AGAIN.  THIS TIME IT WAS ON A CITY STREET WHILE TRAILING MY HUSBAND AT ABOUT 40MPH WHEN MY CAR BEGAN TO ACCELERATE AGAIN.  AND AGAIN, THE ONLY WAY TO STOP THE CAR WAS TO PRESS THE BRAKE AS HARD AS I COULD, PUT IT IN PARK AND TURN OFF THE ENGINE.   FOR ANYONE TO DRIVE THIS CAR IS VERY UNSAFE AND DANGEROUS.  I AM AFRAID TO DRIVE THIS CAR AGAIN EVEN IF IT IS REPAIRED .  THIS COULD HAVE BEEN A VERY SERIOUS OR FATAL ACCIDENT.  THE CAR WAS  TOWED AGAIN TO A HYUNDAI DEALERSHIP NEARBY.   I CALLED HYUNDAI HEADQUARTERS CUSTOMER SERVICE TO REPORT THE INCIDENT AND TO FIND OUT IF THERE WERE ANY RECALLS ON MY CAR.  I WAS TOLD THAT THERE ARE CURRENTLY NO RECALLS.  A CASE MANAGER CALLED ME BACK BUT COULD NOT REALLY HELP. SHE SAID THEY COULD POSSIBLY HELP WITH THE REIMBURSEMENT FOR A CAR RENTAL IF I DECIDED TO RENT A CAR WHILE MY CAR IS BEING REPAIRED.",
        "vin": "KM8SC13E46U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/10/2019",
        "dateOfIncident": "08/01/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11230814,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG LIGHT IS ON CONTINUOUSLY AFTER STARTING (LIGHT GOES OUT FOR 6\" AT IGNITION TO ON). IT THROWS THE CODE B1448. I CAN RESET IT WITH MY SCANNER, BUT IT RETURNS AFTER A WEEK.",
        "vin": "KM8SC13EX6U"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "01/22/2019",
        "dateOfIncident": "01/15/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11171306,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI SANTA FE. WHEN THE CONTACT SHIFTED THE GEAR IN REVERSE, THE VEHICLE ACCELERATED BACKWARDS ON ITS OWN. AS A RESULT, THE VEHICLE CRASHED INTO A BRICK WALL. THE DRIVER THEN SHIFTED INTO THE DRIVE POSITION AND THE FAILURE RECURRED. AS A RESULT, THE VEHICLE DROVE FORWARD THROUGH THE NEIGHBOR'S FENCE BEFORE CRASHING INTO A PARKED VEHICLE. THERE WERE NO INJURIES AND A POLICE REPORT WAS FILED. THE DRIVER STATED THAT THE BRAKES WERE INOPERABLE DURING THE FAILURES. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE DEALER AND MANUFACTURER WERE NOT NOTIFIED OF THE FAILURES. THE FAILURE MILEAGE WAS 155,000. *JS",
        "vin": "KM8SC73E96U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/18/2018",
        "dateOfIncident": "12/20/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11112210,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "COIL SPRINGS ROTTED AND BROKE, ABOUT 5 YEARS AGO, JUST PULLING AWAY FROM THE PUMPS AT THE GAS STATION. ALREADY PAID FOR REPLACEMENT OUT OF OWN POCKET. HAPPENED WHILE DRIVING RESULTING IN SEVERE DAMAGE TO TIRE AND FRONT END ASSEMBLY. NHTSA RECALL NUMBER: 14V435000. NOT CAPABLE OF SCANNING TO COMPUTER DUE TO LACK OF KNOWLEDGE ON HOW TO.",
        "vin": "KM8SC73EX6U"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "05/25/2018",
        "dateOfIncident": "05/12/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11097946,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG WARNING LIGHT REMAINED ON AFTER INITIAL STARTUP DISPLAY.  CODE READER INDICATED B1511 CODE, SHORT BETWEEN DRIVER SIDE SEAT BELT BUCKLE AND BATTERY.  FURTHER EVALUATION DEMONSTRATED THAT SEAT BELT WARNING LIGHT DID NOT DISPLAY AT ALL, WHETHER BELT WAS BUCKLED OR UNBUCKLED.  INTERNET RESEARCH SUGGESTS THAT THIS FAULT MAY PREVENT AIR BAG FROM FUNCTIONING IN THE EVENT OF AN ACCIDENT.  TO EVALUATE FURTHER, AIRBAG WARNING LIGHT WAS RESET TO CHECK FOR RECURRENCE.  CODE RECURRED.  IT WAS NOTED THAT CODE COULD BE PREVENTED AND SEAT BELT WARNING LIGHT WOULD DISPLAY PROPERLY IF THE DRIVER SEAT BELT BUCKLE WAS PRESSED DOWNWARD AND SLIGHTLY TOWARD THE DRIVER.  THIS WAS CONSISTENT WITH OBSERVATION THAT FOLLOWING A RESET, AIR BAG LIGHT RECURRED WHEN VEHICLE TURNED LEFT, CAUSING DRIVER TO SHIFT AGAINST BUCKLE.  INTERMITTENT FAILURE OF SEAT BELT LIGHT WAS OBSERVED WHILE VEHICLE WAS PARKED AND ALSO MOVING SLOWLY.  DRIVER IS UNWILLING TO REMOVE SEAT BELT DURING HIGHWAY DRIVING TO EVALUATE FURTHER.  HYUNDAI MOTOR AMERICA HAS DENIED RESPONSIBILITY FOR REPAIR OF THIS SAFETY ISSUE.  INTERNET SEARCHES INDICATE THAT THIS IS NOT AN ISOLATED OCCURRENCE, AND FURTHER THAT THERE HAVE BEEN RECALLS ON VEHICLES BUILT ON THE SAME OR SIMILAR PLATFORM.",
        "vin": "KM8SC73E56U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/06/2018",
        "dateOfIncident": "02/20/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11076557,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR AIRBAG WARNING LIGHT HAS BEEN ON INTERMITTENTLY WHILE CAR WAS IN FACTORY WARRANTY (BUMPER TO BUMPER, 5 YEAR 60K MILES). REPORTED TO DEALER WHILE WITHIN WARRANTY, DEALER ONLY CLEARED IT WITHOUT INVESTIGATING CAUSE. WARNING LIGHT INTERMITTENTLY ON AND OFF OVER THE YEARS, BUT NEVER THOUGHT IT A PROBLEM UNTIL 2018 MA STATE INSPECTION WOULD FAIL IF AIRBAG LIGHT ON. HAD CODE READ AT HYUNDAI DEALERSHIP AND CAME OUT AS B1448, OCCUPANT CLASSIFICATION MAT DEFECT. RESEARCHED AND FOUND SAME CODE WAS RECALLED IN 2007, 2008 FOR SONATA, BUT NOT FOR MY SANTA FE. CONTACTED HYUNDAI USA AND REQUESTED THEY REPLACE IT FOR FREE. THEY DECLINED AND BLAMED ME FOR NOT FURTHER PURSUING IT WHILE VEHICLE WAS WITHIN WARRANTY.",
        "vin": "KM8SC73D96U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/17/2017",
        "dateOfIncident": "04/23/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11034050,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TO WHOM IT MAY HAVE MY AIRBAG LIGHT IS LIGHTING UP.",
        "vin": "KM8SC13D66U"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "09/07/2017",
        "dateOfIncident": "08/01/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11022056,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ABS WARNING LAMP LIT.  B1513 DIAGNOSTIC TROUBLE CODE PRESENT.  RESET OF CODE AND LIGHT RETURNS AFTER A COUPLE OF DRIVE CYCLES.  ERROR IS PAX SEAT BELT BUCKLE SWITCH SHORTED TO V+.  NO ACCIDENT AND MILEAGE IS 140K  PLAN TO R&R BUCKLE AND DETERMINE WHY COST FOR REPLACEMENT PART IS SO HIGH.  PRICE RANGES FROM $180 TO $400 FOR PART.",
        "vin": "KM8SC13D56U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/21/2017",
        "dateOfIncident": "04/01/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11006782,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIRBAG LIGHT HAS BEEN STUCK ON FOR SEVERAL MONTHS. THE AIRBAG CODE STATES THAT IT IS THE OCCUPANT MAT SENSOR.",
        "vin": "KM8SC13D36U"
    },
    {
        "components": "AIR BAGS,SEAT BELTS,SEATS",
        "crash": false,
        "dateComplaintFiled": "06/29/2017",
        "dateOfIncident": "08/20/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11002118,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG LIGHT WILL NOT GO OUT. I HAVE RESET THE ALARM CODE AND IN IT JUST COMES BACK WHEN SOMEONE SITS IN THE PASSENGERS SEAT. THIS IS AN ISSUE WITH A LOT OF HYUNDAI SANTE FE'S",
        "vin": "KM8SC13D06U"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/19/2017",
        "dateOfIncident": "06/01/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000116,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG LIGHT KEEPS COMING ON AND OFF(EVERY DAY , SEVERAL TIMES ON A 30-45 MINS DRIVE )  ON DASHBOARD AS I AM DRIVING ON REGULAR BASIS ..  SEEMS LIKE AIRBAG WON'T DEPLOY WHILE LIGHT IS ON , AND IF THERE IS AN ACCIDENT AND LIGHT IS ON I THINK THE DRIVER AIRBAG WILL NOT DEPLOY .  HYUNDAI DEALERS ALREADY KNOW THE ISSUE AND APPARENTLY IS A BAD ELECTRIC CONNECTION ON THE SEAT BELT CLICK THAT NEEDS TO BE REPLACE ... THEY ARE WILLING TO \"DIAGNOSE IT\" FOR $125  .. BUT MANY PEOPLE SAYS THE COST OF REPAIR IS $490 . THEY WONT ACKNOWLEDGE IS A DEFECT ON THE WIRING AND WANT PEOPLE TO PAY FOR IT .IS  VERY SCARY DRIVING KNOWING THAT MY AIRBAG MAY NOT DEPLOY",
        "vin": "KM8SC13D76U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/08/2017",
        "dateOfIncident": "04/07/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10984271,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "A COUPLE OF WEEKS AGO, MY AIRBAG LIGHT WAS INTERMITTENT. THIS LASTED FOR A COUPLE OF DAYS. CURRENTLY, MY THE LIGHT GOES OFF FOR A SECOND WHEN STARTING THE VEHICLE. THEN, IT IS ON ALL OF THE TIME.",
        "vin": "KM8SC13D36U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/30/2016",
        "dateOfIncident": "05/01/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10882220,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "LETTER FROM SENATOR SCHUMER ON BEHALF OF CONSTITUENT RE 2006 HYUNDAI SANTA FE TIMING BELT ISSUES.  *SMD  THE CONSUMER WAS INFORMED THE TIMING BELT AND WATER PUMP NEEDED TO BE REPLACED. *JB",
        "vin": "KM8SC73D96U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/21/2016",
        "dateOfIncident": "01/18/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10875655,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIRBAG LIGHT KEEPS GOING ON AND OFF, THEN IT STAYS ON, HAD IT CHECKED AND NOTHING WAS WRONG WITH THE AIRBAG,  VEHICLE WAS STATIONARY, IN MOTION IN TEMPLE TX, ON THE STREET AND ON THE HIGHWAY.",
        "vin": "KM8SC13D46U"
    },
    {
        "components": "SUSPENSION,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/02/2016",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10870976,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 HYUNDAI SANTA FE.  CONSUMER WRITES IN REGARDS TO FRONT COIL SPRING CORROSION RECALL NOTICE AND FUEL TANK REPLACEMENT PARTS STILL NOT AVAILABLE TO COMPLETE REPAIRS.  *SMD",
        "vin": "KM8SC73D06U"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/16/2016",
        "dateOfIncident": "04/16/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10859891,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "FOUR SEPARATE INCIDENTS WITHIN A 30 DAY PERIOD AT HIGHER SPEEDS (>65 MPH ON A FREEWAY) OF UNINTENDED ACCELERATION, REMEDIATED BY SHIFTING INTO NEUTRAL AND BRAKING HARD WITHOUT PUMPING. THESE ACTIONS DISENGAGED THE ACCELERATION WITHOUT HAVING TO COME TO A COMPLETE STOP AND TURNING THE IGNITION OFF. UNINTENDED ACCELERATION OCCURRED AGAIN, IN THE LATEST INCIDENT WHILE TRAVELING AT 40 MPH ON A CITY STREET, HOWEVER CAR WOULD NOT COME TO A COMPLETE STOP EVEN WITH FULL WEIGHT ON THE BRAKE, AND WHILE SHIFTING INTO NEUTRAL SOLVED THE IMMEDIATE ACCELERATION PROBLEM, THE IGNITION HAD TO BE TURNED OFF TO BRING THE VEHICLE TO A FULL STOP. DRIVER ALMOST WRECKED SEVERAL CARS WHILE TRYING TO DODGE TRAFFIC AS CAR ACCELERATED VERY RAPIDLY.  THIS COULD HAVE BEEN HAD A TRAGIC ENDING BUT FORTUNATELY ONLY RESULTED IN A MECHANICS' VISIT.",
        "vin": "KM8SC13E86U"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/18/2016",
        "dateOfIncident": "02/04/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10836992,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI SANTA FE. THE CONTACT STATED THAT WHILE THE BRAKE LIGHTS FAILED TO ILLUMINATE WHEN THE BRAKE PEDAL WAS DEPRESSED. IN ADDITION, THE CONTACT STATED THAT THE BRAKE LIGHTS WOULD REMAIN ILLUMINATED AFTER THE BRAKE PEDAL WAS RELEASED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE CONTACT WAS INFORMED THAT THE VIN WAS NOT INCLUDED IN NHTSA RECALL CAMPAIGN NUMBER: 09V122000 (SERVICE BRAKES, HYDRAULIC). THE FAILURE MILEAGE WAS 113,000.",
        "vin": "KM8SC73DX6U"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/02/2015",
        "dateOfIncident": "08/30/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10787733,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI SANTA FE. WHILE DRIVING APPROXIMATELY 5 MPH, THE VEHICLE SUDDENLY ACCELERATED INDEPENDENTLY WITHOUT WARNING. THE VEHICLE WAS TAKEN TO A DEALER, BUT THE FAILURE WAS UNABLE TO BE DIAGNOSED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 59,000.     UPDATED 1/15/16  *CN  THE CONSUMER STATED THE DEALER PERFORMED TWO ECM UPDATES. UPDATED 01/25/16.*JB",
        "vin": "KM8SC73E36U"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/21/2015",
        "dateOfIncident": "05/25/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10750416,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I BROUGHT CAR FOR A INSPECTION STICKER AND IT FAILED BECAUSE A SMALL VAPOR LEAK. THIS WAS DONE IN MAY OF 2015.  THE REPAIR MADE WAS TO REPLACE THE CELLULOID IN ENGINE COMPARTMENT. WAS TOLD TO DRIVE VEHICLE SO COMPUTER COULD RESET ITSELF. WEEKS PASSED AND CHECK ENGINE LIGHT WOULD COME ON AND OFF. IT DID NOT WORK. BROUGHT BACK TO SHOP ONLY THIS TIME I NOTICED THAT THERE WAS A VERY STRONG GAS SMELL INSIDE AND UNDER CAR. WHEN MY MECHANIC LOOKED AT IT HE NOTICED 3 SMALL PIN HOLES IN THE TANK AND THAT'S WHERE WE GETTING THE VAPOR. I RESEARCHED IT FOR RECALL NOTHING FOUND CALLED DEALER AND WAS TOLD THERE WAS NOTHING ABOUT MY PROBLEM. DURING MY RESEARCH I CAME ACROSS MANY ARTICLES OF OTHER PEOPLE HAVING SAME PROBLEM. BUT HYUNDAI REFUSES TO ACKNOWLEDGE ANY PROBLEM WITH GAS TANKS.",
        "vin": "5NMSH73E67H"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/28/2015",
        "dateOfIncident": "07/01/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10744200,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ON OR ABOUT JULY 1ST 2015 I WAS ABOUT TO CHANGE THE BRAKE PADS ON MY HYUNDAI SANTA FE. UPON REMOVAL OF THE TIRE I NOTICE THAT THE BRAKE BACKING PLATE WAS RUSTED THROUGH AND WAS HANGING BY A SLIVER OF RUSTY METAL.    THIS AUTO USES A MINIATURE DRUM BRAKE AFFAIR ON THE REAR WHEELS TO ACTUATE THE PARKING BRAKE. IN MY OPINION, IF THE CENTER OF THE BACKING PLATE RUSTS AWAY AND CAUSES THE BRAKE SHOE RETAINING PINS TO COME OUT THE BRAKE SHOE COULD CONTACT THE METAL DRUM AREA WHICH WOULD CAUSE THE AUTO TO HAVE IT'S PARKING BRAKE ENGAGE WITHOUT WARNING, LOCKING UP THE REAR DRIVE WHEELS, WHICH COULD RESULT IN AN SERIOUS ACCIDENT.    THIS AUTO WAS INTO THE DEALER FOR AN OIL CHANGE IN JUNE OF 2015 AND AT THAT TIME THE SERVICE WRITER INFORMED ME THAT THE BRAKE PADS NEEDED CHANGING BUT NO MENTION WAS MADE OF THE RUSTED OUT BACKING PLATE EVEN THOUGH IT WAS OBVIOUS THAT IT NEEDED REPLACEMENT. I ALSO BELIEVE THAT A BACKING PLATE SHOULD NOT RUST THROUGH IN LESS THAN 10 YEARS. I BASE THIS ON THE FACT THAT I WORKED FOR A SERVICE GARAGE FOR OVER 10 YEARS AND HAVE DONE THE WORK ON MY OWN VEHICLES FOR OVER 40 YEARS AND IN MY EXPERIENCE BACKING PLATES SHOULD NOT RUST TO THE POINT OF PERFORATION IN LESS THAN 10 YEARS.",
        "vin": "KM8SC73D76U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/09/2015",
        "dateOfIncident": "06/06/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10724338,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TRAVELING SLOWLY ON A SIDE ROAD, THE FRONT PASSANGER SIDE OF MY SANTA FE COLLAPSED WITH THE SOUND OF A TERRIFIC BOOM. THE COIL SPRING ON THE PASSANGER SIDE HAD BROKEN AND DUG LIKE A KNIFE INTO THE TIRE, SHREDDING THE TIRE ALMOST ALL THE WAY AROUND, LEAVING A DEEP, WIDE GASH. UPON INSPECTION, I SAW THAT PART OF THE COIL HAD BROKEN OFF. THIS PROBLEM IS RELATED TO HYUNDIA'S \"CAPAIGN 124,\" A RECALL FOR INSPECTION AND POSSIBLE REPLACEMENT OF FRONT END COIL SPRINGS.",
        "vin": "KM8SC73D46U"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/07/2015",
        "dateOfIncident": "03/01/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10715173,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AT FIRST I NOTICED THAT SOMETIMES (RANDOMLY) WHEN I STARTED MY CAR AFTER SITTING FOR A LONGER PERIOD LIKE 6 OR 8 HOURS THAT I'D TURN THE KEY AND WITHOUT PRESSING ANY PEDALS THE VEHICLE'S RPMS START TO CLIMB UP SLOWLY. IT MAX'S OUT AT 4000RPMS AND STAYS THERE FOR AWHILE THEN WILL DECREASE ON ITS OWN AFTER AWHILE (RANDOM TIMING ALWAYS). IF I STEP ON THE GAS AS ITS REVVING UP IT RELEASES AND GOES BACK DOWN. IF I BRAKE IT DOES NOTHING.     SO AFTER A FEW WEEKS OF NOTICING THIS PROBLEM, TAKING IT TO THE MECHANIC AND HAVING THE THROTTLE BODY CLEANED, AND A GASKET REPLACED THE VEHICLE HAS NOW STARTED TO REV UP ON ITS OWN AFTER I RELEASE THE GAS PEDAL WHEN DRIVING AT HIGH SPEEDS OF 80 OR OVER. I LET OFF THE GAS THEN IT REVS UP QUICKLY TO 4000 THEN AGAIN QUICKLY SHOOTS BACK DOWN BELOW NORMAL. IT DIDN'T DO THE HIGHWAY PROBLEM AS MUCH I NOTICED WHEN THE FUEL WAS LOW, BUT WHEN I FILLED MY TANK THE PROBLEM CAME BACK AGAIN. IT DID STILL REV ON IT'S OWN FROM COLD START THE WHOLE TIME STILL REGARDLESS OF FUEL LEVEL.    I NOTICED THIS WEEK IT NOW JUMPS WHEN I PUT IT IN DRIVE OR REVERSE AFTER A COLD START AND THE OTHER DAY IT SEEMED TO LOSE ITS GUSTO AS I WAS TURNING A CORNER, THEN IT REVVED HIGH AND WENT BACK TO NORMAL.     THIS IS ALL VERY SCARY AND I AM CONCERNED AS I READ MORE AND MORE THAT THIS IS A WIDE SPREAD  PROBLEM THAT COULD CAUSE INJURY OR FATALITY. NO ONE SEEMS TO BE ABLE TO SAY WHAT THE PROBLEM IS, JUST THAT IT COULD BE A BUNCH OF THINGS.  *TR",
        "vin": "KM8SB73D06U"
    },
    {
        "components": "SUSPENSION,POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/06/2015",
        "dateOfIncident": "02/24/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10703943,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ON FEBRUARY 24, 2012 I WENT OUT TO MY CAR TO GO TO DAYCARE AND WORK MY CAR WAS LOWERED TO THE GROUND ALL FOUR TIRES SEEM TO BE FLAT. I CALLED THE CLOSEST GARAGE. THEY TOWED MY CAR, REPAIRED IT FOR  $2028.91. IN SEPTEMBER 2014., I RECEIVED A RECALL FROM HYUNDAI FOR THE COIL SPRING. AFTER 6 MONTHS CORRESPONDENCE WITH THEM, THEY GAVE ME ONLY 949.03. I FEEL THEY SHOULD REIMBURSE ME THE ENTIRE EXPENSES.  *TR",
        "vin": "KM8SC13E96U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/06/2015",
        "dateOfIncident": "09/04/2006",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10692512,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 HYUNDAI SANTA FE. THE CONTACT STATED THAT THE AIR BAG WARNING LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN TO THE DEALER, WHO MADE UNKNOWN REPAIRS. HOWEVER, THE FAILURE RECURRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 1,000.",
        "vin": "KM8SC13E96U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/03/2015",
        "dateOfIncident": "03/02/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10691744,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG LIGHT IS ON.  REPAIR CENTER SAID ITS A SENSOR AND WILL COST SEVERAL HUNDRED DOLLARS TO FIX.  SHOP INDICATED THAT THIS IS A VERY COMMON PROBLEM WITH THIS MAKE AND MODEL.  I AM VERY UPSET THAT THIS ISSUE HAS NOT BEEN RECALLED DUE TO THE APPARENT ENORMITY OF THE ISSUE.   *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/19/2015",
        "dateOfIncident": "01/16/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10676534,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR RACES AT IDLE WHILE IN PARK OR NEUTRAL TO 3,500 RPM. WHILE IN DRIVE OR REVERSE THE CAR CONTINUES TO RACE BUT AT A LOWER LEVEL(1,200-1,500 RPM). THE CAR SURGES WHILE BRAKING REQUIRING HARDER PEDAL PRESSURE THAN NORMAL. RACING IS CONTINUOUS AT ALL SPEEDS REQUIRING LESS ACCELERATOR PRESSURE THAN NORMAL. A COMPLAINT WAS FILED TODAY 1/19/15 WITH HYUNDAI AND A CASE # 7614630 WAS PROVIDED. THIS OWNER EXPRESSED HIS CONCERNS TO HYUNDAI REPRESENTATIVE WITH SAFETY OF CAR DUE TO RACING AND SURGING ESPECIALLY UNDER WET OR ICE CONDITIONS.  THE REP. SCHEDULED A SERVICE APPOINTMENT WITH THE HYUNDAI SHREWSBURY, NJ DEALERSHIP FOR 1/22/15.   *TR",
        "vin": "KM8SC73E56U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/02/2015",
        "dateOfIncident": "12/30/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10669566,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR IS AT A HYUNDAI SERVICE CENTER FOR THE RECALL CAMPAIGN 124 ON THE FRONT COIL SPRING AND THE COIL IS FRACTURED.     MY VEHICLE HAS BEEN THERE THREE DAYS AND NOW I WAS INFORMED THAT THE PART IS ON BACKORDER AND MAY TAKE ONE WEEK TO ONE MONTH OR MORE FOR THE PART TO BE RELEASED ONLY THE GUARD IS AVAILABLE AT THIS TIME BUT NOT THE COIL SPRING THAT NEEDS TO BE REPLACED ON MY VEHICLE.     I FEEL THIS IS UNACCEPTABLE AMOUNT OF TIME TO WAIT FOR THE REPAIR AND HYUNDAI SHOULD HAVE HAD THIS PART IN STOCK AND AVAILABLE TO MAKE THE PROPER SERVICE NEEDED ON THIS RECALL.  PLEASE INVESTIGATE THIS MATTER AND ADVISE.      THANK YOU  *TR",
        "vin": "KM8SC73D66U"
    },
    {
        "components": "STEERING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/18/2014",
        "dateOfIncident": "11/03/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10658848,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI SANTA FE. WHILE DRIVING VARIOUS SPEEDS AND MAKING A RIGHT TURN, A SQUEALING NOISE EMITTED FROM UNDERNEATH THE VEHICLE. ALSO, THE VEHICLE LUNGED FORWARD WHEN MAKING A TURN. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC. THE TECHNICIAN DISCOVERED THAT THE STEERING SHAFT WAS BENT AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED, BUT THE SQUEALING SOUND CONTINUED TO OCCUR. IN ADDITION, THE FAILURE CAUSED THE FRONT PASSENGER SIDE TIRE TO DEFLATE. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 5,000.",
        "vin": "KM8SC73D56U"
    },
    {
        "components": "SUSPENSION,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/21/2014",
        "dateOfIncident": "07/01/2006",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10650168,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A 2006 HYUNDAI SANTA FE ON JUNE 22, 2006 . IN JULY 2006 I TOOK A TRIP TO SAN ANTONIO, TEXAS. WHILE I WAS OUT THERE, MY ENGINE LIGHT CAME ON AND WENT OFF A FEW DAYS LATER. AFTER A FEW MONTHS WHEN IT CAME BACK ON I TOOK IT TO RAY BRYANT SERVICE CENTER WHERE I BOUGHT THE VEHICLE. THEY CHECKED IT AND GOT THE LIGHT TO GO OFF. AS I WAS ON MY WAY HOME THE LIGHT CAME BACK.  EVERY TIME I BROUGHT IT BACK THE LIGHT WOULD COME BACK ON AND IS STILL ON. SOMETIMES AS I'M DRIVING IT FEELS LIKE IT LOSES POWER . I ALSO BROUGHT IT IN FOR THE FRONT END BECAUSE IT ALWAYS FEEL LIKE I HAVE AN EGG IN THE LEFT FRONT TIRE. INSTEAD OF THE SERVICE WORKER DIDN'T CHECK IT OUT HE SAID HE HAD A SANTA FE JUST LIKE MINE AND THAT HIS DIDN'T DO THAT AND NEVER DID A THING ABOUT IT. I'VE BROUGHT IT TO ANOTHER MECHANIC AND HE COULDN'T FIND THE PROBLEM.  I'VE BOUGHT NEW TIRES AND THE SAME PROBLEM, SO I BROUGHT IT BACK TELLING THEM THAT IT FEELS LIKE I HAVE AN EGG IN THE TIRE THEY CHECKED IT AND CAN' FIND ANYTHING WRONG WITH THE TIRES.  AS TIME GOES BY THE PROBLEM IS GETTING WORST. I FEEL REALLY EMBARRASSED WHEN I HAVE SOMEONE IN MY TRUCK AND IT RIDES LIKE THAT. I DO HOPE THAT THERE'S SOMETHING THAT CAN BE DONE ABOUT  THIS PROBLEM BECAUSE I AM ON DISABILITY AND CAN'T AFFORD TO BUY ANOTHER VEHICLE. I REALLY LOVE MY SANTA FE.",
        "vin": "KM8SC13E16U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/08/2014",
        "dateOfIncident": "08/12/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10643401,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG RED LIGHT ON FAILED TO TURN OFF AFTER FIRST STARTING THE ENGINE (NORMALLY IT WOULD TURN OFF AFTER ABOUT 5 SECS AFTER STARTING THE ENGINE) AND REMAINED ON AT REGULAR DRIVING SPEEDS.  IT NEVER WENT OFF REGARDLESS OF SPEEDS RANGING FROM 0 (STANDING STILL) TO 70 MPH  (THE LATTER SPEED ON INTERSTATE HIGHWAY).  IT NEVER WENT OFF REGARDLESS OF WHETHER OR NOT A PERSON WAS IN THE PASSENGER SEAT.  I TOOK THE CAR TO THE DEALERSHIP, WHERE IT WAS PURCHASED.  AFTER DIAGNOSTIC TESTS, I WAS TOLD BY THE SERVICE REPRESENTATIVE THE PROBLEM WAS A BAD SENSOR IN THE PASSENGER'S SEAT, AND IT WOULD COST ABOUT $2,600.00 TO FIX IT.  SINCE THE SEAT WOULD HAVE TO BE TAKEN APART TO FIX THE SENSOR, A REPLACEMENT SEAT WOULD PROBABLY HAVE TO BE ORDERED, THUS THE HIGH COST..  I WAS ALSO TOLD THAT SINCE THE AIRBAG LIGHT NOW REMAINS ON, THE AIR BAG SYSTEM IS NO LONGER FUNCTIONAL AND THE AIRBAGS WILL NOT DEPLOY AS DESIGNED.  I DID NOT ELECT TO FIX THE SENSOR BECAUSE OF THE EXPENSE AND ALSO NEEDING TO FIX THE AIR CONDITIONER, WHICH COST OVER $600.00.  I AM NOW DRIVING A VEHICLE WITHOUT A FUNCTIONAL AIRBAG SYSTEM.  *TR",
        "vin": "KM8SC13E76U"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/26/2014",
        "dateOfIncident": "09/05/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10639296,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI SANTA FE. WHILE DRIVING 7 MPH, THE BRAKES FAILED TO RESPOND WITHOUT WARNING. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 70,000.",
        "vin": "KM8SC73D96U"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/08/2014",
        "dateOfIncident": "09/01/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10596924,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS HAPPENS MORE OFTEN THAN NONE NOW. I CAN BE PULLING OUT INTO TRAFFIC OF JUST CRUISING ALONG WHEN I PRESS GAS TO GO WHENALL OF A SUDDEN THE CAR JERKS, LOOSES POWER! LIKE ITS GOING TO STOP AND STALL IN ONE QUICK SECOND AND THROWS ME FORWARD EVEN WITH MY SEATBELT ON IT JERKS ME I ONLY HAD IT STALL ONE TIME, SO FAR.  IF I LET OFF THE GAS AND PRESS IT AGAIN IT SEEMS TO HELP AND POWER COMES BACK, SOMETIMES.  I ALMOST GOT HIT PULLING OUT INTO TRAFFIC BECAUSE THE CAR LOST POWER AND WASN'T GOING ANYWHERE WHEN I HAD GAS PEDDLE PUSHED. WHEN ALL THIS HAPPENS THE ENGINE LIGHT WILL COME ON AND THAN GO OFF, SOMETIME NOW THE ENGINE LIGHT COMES ON AND STAYS ON FOR A FEW DAYS AND THE CAR HAS A LOT LESS POWER OR FEELS LIKE ITS GOING TO STALL, THAN THE LIGHT WILL GO OUT ON ITS OWN. I HAD IT CHECKED OUT AND THEY TOLD ME I NEEDED AN ALTERNATOR SO I BOUGHT ONE WHEN MY SON AND MY NEIGHBOR WAS GOING PUT IT IN THEY CHECKED THE ALTERNATOR AND BATTERY AND THEY WERE FINE AND HAVE BEEN CHECKED SEVERAL TIMES AND ARE FINE. ALSO AT NIGHT WHEN I PRESS THE BREAK TO STOP OR SLOW DOWN THE HEAD LIGHTS WILL DIM AND I CAN FEEL THE JERKING OF THE CARE JUST A LITTLE BIT. I AM SO AFRAID TO DRIVE THIS CARE SOMETIMES OR ON THE BELTWAY BECAUSE I AM AFRAID ITS GOING TO STALL/SHUTDOWN OR SHUT OFF THAT ITS GOING TO GET ME KILLED AND I AM ALSO AFRAID TO DRIVE MY GRAND CHILDREN BECAUSE OF THE SAME REASONS. PLEASE HELP ME! I CAN'T AFFORD TO KEEP GETTING IT LOOKED AT WHEN IT DOESN'T HAPPEN ALL THE TIME THEY CAN'T FIND ANYTHING WRONG WITH IT. WHAT CAN I DO TO FIX THIS PROBLEM. WHEN THIS HAPPENS I HAVE NO STEERING OR CONTROL OF THE CAR FOR THAT SPLIT SECOND AND I AM AN EMT/FIREFIGHTER I KNOW THAT SPLIT SECOND CAN KILL ME AND ANYONE ELSE IN MY CAR. I HAD BOUGHT THE CAR USED LAST YEAR AND IT WAS DOING IT JUST A VERY LITTLE BIT AT FIRST AND I CALLED THE USED DEALER AND HE SAID ITS BAD GAS.  *TR",
        "vin": "5NMSH13E77H"
    },
    {
        "components": "EXTERIOR LIGHTING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/04/2014",
        "dateOfIncident": "06/01/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10596177,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI SANTA FE. THE CONTACT STATED THAT THE BRAKE LIGHTS FAILED TO ENGAGE WHILE THE BRAKE PEDAL WAS DEPRESSED. THE MANUFACTURER ADVISED THAT THE VEHICLE WAS NOT INCLUDED IN THE MANUFACTURER'S STOP LAMP SWITCH REPLACEMENT RECALL. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGE WERE 78,485.",
        "vin": "KM8SC13D86U"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/28/2014",
        "dateOfIncident": "05/28/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10594534,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING @ 50 MPH, REMOVE FOOT FROM ACCELERATOR AND CAR FAILED TO SLOW.  DEPRESSED BRAKE AN CAR STILL FAILED TO SLOW.  TURNED KEY TO OFF AND PULLED TO SIDE OF ROAD TO FULL STOP.  RESTARTED ENGINE AN IT AGAIN OVER ACCELERATED SO TURNED IT OFF.  DEPRESSED ACCELERATOR SEVERAL TIMES AND RESTARTED, DROVE TO WORK AREA TO HAVE INSPECTION OF PROBLEM.  *TR",
        "vin": "UNKNOWN"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/18/2014",
        "dateOfIncident": "05/18/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10592317,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "HARD CLUNKING IN THE DRIVER SIDE FRONT WHEEL. SOUNDED LIKE A LOOSE BRAKE CALIPER. REMOVED THE TIRE TO CHECK IT OUT AND FOUND THE LOWER CONTROL ARM WAS BROKEN IN HALF ON THE ONE SIDE. IF IT BROKE ALL THE WAY WHEN THE CAR WAS IN MOTION. THE WHEEL WOULD HAVE COME OFF AND THE CAR WOULD HAVE FLIPPED OVER. THIS IS SERIOUS. I COULD HAVE BEEN KILLED DRIVING THIS CAR.    *JS",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": true,
        "dateComplaintFiled": "04/03/2014",
        "dateOfIncident": "03/28/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10577027,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "STOPPED AT AN INTERSECTION, FOOT ON BRAKE, ENGINE BEGAN REVVING, THEN DECELERATED, BUT REVVED AGAIN, THIS TIME FORCING MY CAR FORWARD. ANOTHER VEHICLE WAS APPROACHING FROM THE LEFT, SO I STEERED RIGHT. IMPACT ON LEFT FRONT WHEEL, CAR CAREENED INTO A LIGHTWEIGHT PLASTIC TYPE FENCE AND STOPPED. MY FOOT REMAINED ON THE BRAKE THE ENTIRE TIME. I WAS WEARING MY SEAT BELT AND WAS NOT INJURED. THE OTHER DRIVER WAS TRANSPORTED TO THE HOSPITAL BY AMBULANCE. BOTH VEHICLES WERE INSPECTED BY THE SAME INSURANCE ADJUSTER AND TOTALED. I HAVE FILED A COMPLAINT WITH HYUNDAI, BUT SO FAR, THEY HAVE NOT SENT AN INVESTIGATOR TO CHECK OUT THE VEHICLE. *TR",
        "vin": "KM8SC13E46U"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/24/2014",
        "dateOfIncident": "10/01/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10574500,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES FAIL TO ENGAGE, ABS SENSOR LIGHT COMES ON. HAPPENS WHEN TRAVELING AT VARIOUS SPEEDS, BUT INTENSIFIES WHEN ROADS ARE WET.  *TR",
        "vin": "KM8SC73D06U"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/23/2014",
        "dateOfIncident": "06/15/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10574278,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AND APPLYING THE BRAKES THE ABS ENGAGED ON THE RIGHT FRONT WHEEL, NOW THE SAME THING HAS HAPPENED ON THE LEFT FRONT WHEEL, BOTH TIMES IT INVOLVED A SENSOR RING THAT HAD CRACKED IN HALF AND THE BRAKES ON THAT PARTICULAR WHEEL FAILED TO HOLD.  *TR",
        "vin": "KMBSC12DX5U"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/17/2014",
        "dateOfIncident": "09/03/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10572916,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT THIS VEHICLE USED IN 2012 AND EXPERIENCED MY FIRST INCIDENT WITH THE BRAKES APPROX. 5 MOS LATER. WHENEVER I HAVE TO STOP IN A HURRY AT VARIOUS SPEEDS, THE BRAKES DO NOT ENGAGE.  VEHICLE SLIDES, DOES NOT STOP.  I CAME CLOSE TO HAVING SEVERAL ACCIDENTS AND WAS FORTUNATE ENOUGH TO DRIVE THE VEHICLE INTO NEXT LANE TO AVOID HITTING CAR IN FRONT OF ME OR GOING THROUGH A RED LIGHT.  THIS IS VERY SCARY AND I CAN'T BELIEVE HYUNDAI HAS NOT RECALLED VEHICLES WITH SIMILAR PROBLEMS.  BRAKES WORK FINE IF YOU HAVE PLENTY OF TIME TO STOP, BUT IF YOU HAVE TO MAKE A SUDDEN STOP AND STEP ON THE BRAKES, THEY WILL NOT ENGAGE EVEN IF YOU PUMP THEM.  VEHICLE JUST SLOWS DOWN ON ITS OWN.  I WOULD LIKE HYUNDAI TO EXPLAIN THE REASON FOR THIS MAL-FUNCTION OF THE BRAKING SYSTEM IN THE SANTA FE MODELS.  THIS IS VERY DANGEROUS, PEOPLE ARE GOING TO BE INJURED OR DIE BECAUSE THEY CANNOT STOP THEIR VEHICLE SUDDENLY AT AVERAGE TO HIGH SPEEDS WHEN TRAVELING.  *TR",
        "vin": "KM8SC13D36U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/12/2014",
        "dateOfIncident": "03/09/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10568906,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS PARKED WHEN THE PASSENGER SIDE STRUT SPRING BROKE AND PUNCTURED THE TIRE. FORTUNATELY THIS HAPPENED WHEN THE VEHICLE WAS NOT IN MOTION AS IT WOULD HAVE PUNCTURED THE TIRE AND LOCKED THE TIRE IF DRIVING, CREATING A SEVERE EMERGENCY.  *TR",
        "vin": "KM8SC73DX5U"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/05/2014",
        "dateOfIncident": "02/05/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10563000,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD PROBLEMS WITH THE BRAKES SINCE I BOUGHT THE CAR IN SEPTEMBER 2012. HAD TO BRING THE CAR BACK TO THE DEALERSHIP TWICE. THEY FINALLY GOT THE BRAKES TO FEEL OK IN NORMAL DRIVING CONDITIONS, BUT EVERY TIME IT SNOWS, SNOW AND ICE GET STUCK IN MY BRAKES AND I CAN NOT STOP. I ALMOST CRASHED 4 TIMES ON MY WAY TO WORK THIS MORNING, AND HAS HAPPENED EVERY TIME IT SNOWS. THEY WILL NOT FIX WITHOUT A CHARGE BECAUSE IT'S PAST THE WARRANTY.  *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/30/2014",
        "dateOfIncident": "10/01/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10562255,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAGS LIGHT IS ALWAYS LIT ON THE DASH. THE SENSOR IN MIDDLE OF DASH RECOGNIZES SOMEONE GETTING IN THE PASSENGERS SIDE BUT PER LOCAL SHOP THERE IS A SHORT IN THE SRS SYSTEM UNDER THE PASSENGERS SEAT. BECAUSE OF THIS, THE AIR BAGS ARE DISABLED ON PASSENGERS SIDE. *TR",
        "vin": "KM8SC73DX6U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/23/2014",
        "dateOfIncident": "11/22/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10561147,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 HYUNDAI SANTA FE. THE PASSENGER'S SIDE AIR BAG  IS ON-OFF WARNING LAMP ILLUMINATED. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THE TECHNICIAN DIAGNOSED THAT THE PASSENGER'S SIDE TRACKING POSITION SENSOR WAS DEFECTIVE AND NEEDED TO BE REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 42,000 AND THE CURRENT MILEAGE WAS 53,000. I TOOK THE CAR AGAIN TO THE DEALER AND GIVE THE INFORMATION ABOUT THE RECALLS OF THE AIRBAGS (OCS). AND THE DEALER SAID THAT I HAVE TO REPLACE THE SEAT COMPLETELY AND HAVE TO PAID BY MY OWN.  *TR",
        "vin": "KM8SB12B66U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/03/2013",
        "dateOfIncident": "05/03/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10554650,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI SANTA FE. THE CONTACT STATED THAT THE PASSENGER'S SIDE AIR BAG ON-OFF WARNING LAMP ILLUMINATED. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THE TECHNICIAN DIAGNOSED THAT THE PASSENGER'S SIDE TRACKING POSITION SENSOR WAS DEFECTIVE AND NEEDED TO BE REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 40,000 AND THE CURRENT MILEAGE WAS 85,000.",
        "vin": "KM8SC13D16U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/26/2013",
        "dateOfIncident": "09/24/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10545487,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI SANTA FE. THE CONTACT STATED THAT THE BRAKE LIGHTS FAILED TO ILLUMINATE WHILE DECELERATING. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS  CONTACTED. THE FAILURE MILEAGE WAS 96,315.  UPDATED 11/19/13*LJ  THE BRAKE LIGHT SWITCH WAS REPLACED. UPDATED 11/20/13",
        "vin": "KM8SC13D66U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/23/2013",
        "dateOfIncident": "07/02/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10537006,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "LIKE MANY OTHERS THE AIR BAG INDICATOR LIGHT COMES ON AND STAYS ON FOR NO REASON JUST AS MILLIONS OF OTHERS HAVE STATED. THIS IS A DEFECT ESPECIALLY WHEN IT COMES TO AIR BAGS.  *TR",
        "vin": "KM8SC13D86U"
    },
    {
        "components": "EXTERIOR LIGHTING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/22/2013",
        "dateOfIncident": "08/21/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10536622,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING BACK HOME FROM WORK AND DRIVER BEHIND NOTIFIED ME THAT BRAKE LIGHTS DON'T WORK. I CHECKED ALL FUSES, BULBS AND SEEMS OKAY. I FOUND THAT THE BRAKE LIGHT SWITCH IS DEFECTIVE. I SAW RECALL ON 2007 HYUNDAI SANTA FE BUT NOT 2006. WILL THE DEALER WILL REPLACE MY DEFECTIVE BRAKE LIGHT SWITCH?  *TR",
        "vin": "KM8SC13EX6U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/05/2013",
        "dateOfIncident": "05/01/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10515164,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR THE PAST YEAR MY AIR BAG LIGHT HAS BEEN TURNING ON AND OFF IN MY SANTA FE. I NOTICED THAT THERE HAS BEEN A MASSIVE RECALL ON THE AIR BAG LIGHT. I CONTACTED THE HYUNDAI DEALER WHERE I PURCHASED THE VEHICLE AND WAS TOLD MY CAR WAS NOT ON THE RECALL LIST AND IF I NEEDED TO HAVE THE AIR BAG LIGHT CHECKED OUT, THAT I WOULD HAVE TO PAY OUT OF POCKET.  *TR",
        "vin": ""
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "05/21/2013",
        "dateOfIncident": "05/18/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10512988,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "SEATBELT WOULD NOT LATCH.  THE BUCKLE WOULD NOT CLICK.  SOMETHING IS BROKEN INSIDE THE FEMALE END.  THE PART IS OVER $400!  WITH THE LABOR, THIS IS $565.00 FOR A SEAT BELT BUCKLE.  *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/11/2013",
        "dateOfIncident": "03/08/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10508017,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 HYUNDAI SANTA FE.  CONSUMER WRITES IN REGARDS TO BROKEN SPRINGS PUNCTURED TIRES ON VEHICLE.  *SMD  THE CONSUMER STATED AS HE WAS BACKING UP FROM A PARKING SPACE, HE HEARD A LOUD NOISE AND THE FRONT PASSENGER SIDE OF THE VEHICLE STARTED TO GO DOWN. WHEN THE CONSUMER EXITED THE VEHICLE, HE DISCOVERED THE TIRE WAS COMPLETELY FLAT. THE CONSUMER STATED IT WAS NOT THE FIRST TIME, THE SPRING BROKE AND PUNCTURED THE TIRE.",
        "vin": "KM8SC73D16U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/03/2013",
        "dateOfIncident": "05/12/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10505532,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS COMPLAINT IS IN REFERENCE TO MY 2006 HYUNDAI SANTA FE. APPROXIMATELY IN THE MONTH OF MAY 2010, I BEGAN NOTICING PROBLEMS WITH MY VEHICLE'S ELECTRICAL SYSTEM THAT WERE NUMEROUS IN DISTINCTION.     TO SUMMARIZE A LIST OF THE PROBLEMS, I WILL BEGIN WITH THE DOOR LOCKS ON THE VEHICLE. DURING THE INCIDENT IN MAY 2010, I ATTEMPTED TO UNLOCK MY VEHICLE WITH THE PORTABLE LOCK/UNLOCK/ALARM KEYPAD AND FOR SOME ODD REASON THE PAD WOULD ONLY UNLOCK THE DRIVER SIDE DOOR. I GOT IN MY VEHICLE AND STARTED THE CAR WHILE I RAN INSIDE TO GET SOME THINGS TO BRING HOME WITH ME. WHEN I CAME BACK OUT, ALL THE DOORS WERE LOCKED ON THE CAR SO I HAD TO HAVE MY BROTHER-IN-LAW TAKE ME  BACK TO MY HOUSE TO GET MY SPARE KEY TO RECTIFY THE PROBLEM.    AFTER THIS INCIDENT, I BEGAN NOTICING A MEDLEY OF ELECTRICAL PROBLEMS WITH THE CAR. THE COMPASS THAT USE TO READ OUT ON MY OVERHEAD DOME LIGHT STOPPED WORKING. THE BLOWER FAN FOR THE HEATING/COOLING SYSTEM BEGAN TO WORK ERRATICALLY. WITH THE FAN SET TO OFF, IT WOULD STILL COME ON DESPITE THAT FACT. FOR EXAMPLE, IF IT IS SET TO OFF AND I PUT MY VEHICLE IN REVERSE, THE FAN MORE OFTEN THAN NOT SWITCHES ON UNTIL I PUT THE CAR BACK INTO DRIVE. I ALSO BEGAN HAVING AND ISSUE WITH MY ABS BRAKES. NOW THIS COULD BE THAT I NEED TO HAVE THE SENSORS CLEANED, BUT I FIGURED I'D MENTION IT NONETHELESS. MY ABS SYSTEM FREQUENTLY KICKS IN EVEN ON A DRY, SUNNY DAY. IT'S SPORADIC WHEN IT DOES THIS, SO IT'S IMPOSSIBLE FOR ME TO GAUGE WHEN THE NEXT INCIDENT MAY HAPPEN. NONETHELESS, THIS IS THE MOST DANGEROUS OF THE PROBLEMS BECAUSE I HAVE ALMOST REAR-ENDED ANOTHER VEHICLE NUMEROUS TIMES DUE TO MY BRAKES NOT BEING ENGAGED PROPERLY.    I'VE CALLED HYUNDAI TO SEE IF THERE WERE ANY RECALLS REGARDING MY VEHICLE IN THIS MATTER AND THEY INFORMED ME THAT THERE HAD BEEN NOT.   *TR",
        "vin": "KM8SC13D86U"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/18/2012",
        "dateOfIncident": "09/18/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10480996,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI SANTA FE. THE CONTACT STATED THAT THERE WAS EXTREME DIFFICULTY OPENING THE DRIVER'S SIDE FRONT DOOR. THE VEHICLE WAS TAKEN TO A PRIVATE MECHANIC AS WELL AS THE DEALER WHERE THE FAILURE COULD NOT BE REPLICATED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS CONTACTED ABOUT THE ISSUE. THE FAILURE MILEAGE WAS 27,000 AND THE CURRENT MILEAGE WAS 28,000.",
        "vin": "KM8SC13D16U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/15/2012",
        "dateOfIncident": "06/24/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10480157,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI SANTA FE. THE CONTACT STATED THAT THE VEHICLE WAS EXHIBITING A WINDING SOUND WHEN TURNING IN ANY DIRECTION. THE VEHICLE WAS TAKEN TO THE DEALER WHERE BOTH THE POWER STEERING PUMP AND THE RACK AND PINION WERE REPLACED. THE CONTACT HAD TO TAKE THE VEHICLE BACK THREE TIMES AFTER THE REPAIR DUE TO THE RECURRENCE OF THE FAILURE. THE DEALER REPLACED THE POWER STEERING OIL PUMP AND THE POWER STEERING PUMP WAS REPLACED A SECOND TIME. IN ADDITION, THE RESERVOIR FOR THE POWER STEERING WAS REPLACED AND THE STEERING GEAR WAS REPLACED. THE CONTACT STATED THAT TWO YEARS LATER, THE FAILURE RECURRED.  THE FAILURE MILEAGE WAS 42,416 AND THE CURRENT MILEAGE WAS 92,697.",
        "vin": "KM8SC73EX6U"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "10/13/2012",
        "dateOfIncident": "10/01/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10480017,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN 2006 HYUNDAI SONATA, AND THE AIR BAGS LIGHTS WARNING LIGHTS ARE CONSTANTLY ILLUMINATED. I BROUGHT MY VEHICLE TO THE DEALER WHO PERFORMED A DIAGNOSTIC AND CAME BACK WITH EROR CODES B1706, ALTHOUGH THE MEANING WAS NOT EXPLAINED, DUE TO REASAERCH I PERFORMED I NOW KNOW THAT IT IS FOR PASSENGER BUCKLE PRETENSIONER RESISTANCE BEING TOO HIGH. I FOUND THIS PARTICULARLY ODD AS I USE THIS AS MY CAR TO COMMUTE TO WORK THUS THE PASSENGER SEAT IS RARELY USED. THE DEALER WENT ON TO SAY THAT THE BELT BUCKLES NEEDED TO BE REPLACED AND THAT IT WAS GOING TO COST OVER $600. I DID NOT HAVE ADEQUATE FUNDS TO ADRESS THE ISSUE FOR THAT AMOUNT AT THAT TIME, HOWEVER CAME HOME AND PERFORMED EXTENSIVE REASEARCH ON-LINE AND THROUGH THE NHTSA SITE REGARDING THE ISSUE NOTING THAT THIS IS A VERY COMMON SAFETY ISSUE WITH THIS VEHICLE IMPARTICULAR, ALTHOUGH MY DEALER HAD ASSURED ME IT WAS NOT. WHAT I DID NOT SEE WAS ANY RESPONSE FROM HYUNDAI REGARDING THIS ISSUE, AND IN MOST CIRCOMSTANCES THE EFFECTED PERSON WAS RESPONDED TO, OR WAS RESONDED TO IN A NEGATIVE MANNER. THIS IS A POTENTIONALY MAJOR LIFE THRETENING SAFETY ISSUE ESPECIALLY WHEN AIR BAGS DOES NOT DEPLOY DURING AN ACCEDENT. IT IS ALSO AN INCONVIENT PROBLEM NOTING THAT DUE TO THE AIR BAG WARNING LIGHT REMAINING ON, THE CAR WILL NOT PASS INSPECTION REGULATIONS, AND FROM WHAT I HAVE SEEN ONLINE SOME PEOPLE HAVE TO HAVE THIS PIECE REPLACED SEVERAL TIMES. THIS IS A SAFTEY ISSUE AND A FAILURE ON THE MANUFACTURES PART TO OFFER A SAFE PRODUCT. I URGE THE NHTSA TO INVESTIGATE THE ISSUE DUE TO THE FREQUENCY OF COMPLAINTS AND THE IMPACT TO THE PASSENGERS' SAFETY AND URGE HYUNDI TO ISSUE A RECALL TO ADDRESS THIS ISSUE IN THE NEAR FUTURE.",
        "vin": "KMHET46C56A"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/28/2012",
        "dateOfIncident": "07/29/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10477418,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI SANTA FE. WHILE DRIVING APPROXIMATELY 65 MPH, THE BRAKE PEDAL WAS DEPRESSED AND THE REAR END OF THE VEHICLE BEGAN TO FISH-TAIL UNCONTROLLABLY. THE CONTACT WAS ABLE TO REGAIN CONTROL AND RESUMED DRIVING. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER FOR DIAGNOSIS. THE TECHNICIAN STATED THE FAILURE WAS RELATED TO THE ABS RING, WHICH WAS A COMMON DEFECT ISSUE. THE VEHICLE WAS REPAIRED UNDER THE SERVICE WARRANTY. THE MANUFACTURER WAS NOT NOTIFIED OF THE PROBLEM. THE VIN WAS NOT AVAILABLE. THE APPROXIMATE FAILURE MILEAGE WAS 70,000.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/01/2012",
        "dateOfIncident": "08/01/2006",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10468803,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI SANTA FE. THE CONTACT STATED THAT THE FRONT PASSENGER AIR BAG WARNING LIGHT WOULD ILLUMINATE WHEN A HEAVY PERSON WAS SITTING IN THE SEAT. THE VEHICLE WAS TAKEN TO THE DEALER AT LEAST FOUR TO FIVE TIMES AND AFTER RUNNING A DIAGNOSTIC TEST, THE CONTACT WAS INFORMED THAT THERE WAS NOTHING THEY COULD DO TO REPAIR THE FAILURE. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE WHO ADVISED THAT THERE WERE NO RECALLS FOR THE FAILURE AND OFFERED NO FURTHER ASSISTANCE. THE VIN WAS UNAVAILABLE. THE FAILURE MILEAGE WAS 80,000.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/15/2012",
        "dateOfIncident": "08/10/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10465708,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER ENGINE IS WARM, ABOUT 20 MINUTES LATER, THERE IS A GURGLING IN THE FUEL TANK WHEN THE KEY IS TURNED ON (BEFORE AND AFTER THE ENGINE IS STARTED).  I THINK IT IS FUEL BEING RETURNED FROM THE ENGINE.  I HAVE HAD IT IN TWO DIFFERENT HYUNDAI SERVICE SHOPS, WITH THE FUEL PUMP REPLACED TWICE, AND A FUEL PRESSURE REGULATOR REPLACED.  HAVING GIVEN UP, BOTH SHOPS CONTACTED THE DISTRICT HYUNDAI OFFICE AND A FIELD SERVICE ADVISER TOLD THE LOCAL SHOPS TO SHOW THE EVENT AS \"NORMAL\".  IT IS NOT NORMAL AND I THINK THE HYUNDAI DISTRICT OFFICE IS HIDING THE PROBLEM.  COULD BE A FUEL SYSTEM PROBLEM AND COULD BE A SAFETY HAZARD IF FUEL STARTS LEAKING.  BOTH LOCAL SERVICE DEPARTMENTS NOW SHOW THE PROBLEM AS \"NORMAL\" AND NOTHING MORE WILL BE DONE ON THIS PROBLEM.  I BELIEVE A RECALL FOR THIS PROBLEM IS APPROPRIATE.  *TR",
        "vin": "KM8SC73D26U"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "07/10/2012",
        "dateOfIncident": "07/07/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10465068,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI SANTA FE. THE CONTACT STATED THAT THE COMPRESSOR FOR THE AIR CONDITIONING UNIT WHICH FAILED WITHOUT WARNING. THE CONTACT TOOK THE VEHICLE TO A MECHANIC WHO STATED THAT THE CLUTCH IN THE COMPRESSOR FAILED. THE VEHICLE WAS NOT REPAIRED.  THE FAILURE AND THE CURRENT MILEAGES WERE 64,000.",
        "vin": "KM8SC73D86U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/21/2012",
        "dateOfIncident": "04/30/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10459156,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THIS VEHICLE AT AN AUCTION. WHEN I RECEIVED IT THE DRIVER SIDE AIRBAG LIGHT WAS ON, BUT THE INSPECTOR PASSED IT. THE PASSENGER SIDE WAS ALSO ON, BUT THE AGREEMENT COVERED THIS AND THE AUCTION DEALER REPAIRED THIS. I CALLED HUNDYAI ABOUT THE DRIVERS SIDE AIR BAG LIGHT BEING ON AND THEY TOLD ME THAT THIS WOULD BE COVERED UNDER A RECALL, BUT WHEN I TOOK IT TO THE DEALER, THEY TOLD ME THERE WAS NO RECALL ON THIS VEHICLE AND TOLD ME THAT I WOULD BE CHARGED TO REPAIR THIS. I PAID TO HAVE IT REPAIRED BECAUSE WHAT ELSE COULD I DO.  *TT",
        "vin": "KM8SC13D76U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/03/2012",
        "dateOfIncident": "01/02/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10442265,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI SANTA FE. THE CONTACT STATED THAT THE FRONT DRIVER SIDE COIL SPRING FRACTURED WHILE REVERSING FROM A DRIVEWAY. THE CONTACT SPOKE WITH THE MANUFACTURER AND WAS TOLD THERE WAS NOTHING THAT COULD BE DONE TO ASSIST WITH THE FAILURE. THE VEHICLE WAS NOT REPAIRED.  THE FAILURE AND THE CURRENT MILEAGES WERE 38,000.",
        "vin": "KM8SC13DX6U"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "12/05/2011",
        "dateOfIncident": "11/26/2011",
        "fire": true,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10438598,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI SANTA FE.  THE CONTACT STATED THAT THE CIGARETTE LIGHTER WAS ACTIVATED AND ONCE IT BECAME HOT, IT EJECTED FROM THE HOLDER INDEPENDENTLY. THE CONTACT ATTEMPTED TO RETRIEVE THE LIGHTER FROM THE FLOOR TO PREVENT STARTING A FIRE AND WAS BURNED. NEITHER THE DEALER NOR THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NEITHER INSPECTED NOR REPAIRED. THE FAILURE MILEAGE WAS 40,000.",
        "vin": "KM8SC13D06U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/03/2011",
        "dateOfIncident": "09/30/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10428340,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI SANTA FE.  THE CONTACT NOTICED THAT THE BRAKE LIGHTS FAILED INTERMITTENTLY. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE BUT OFFERED NO ASSISTANCE.  THE VEHICLE WAS TAKEN TO A PRIVATE MECHANIC WHO ADVISED THE CONTACT TO HAVE THE BRAKE LIGHT SWITCH REPLACED.  NO REPAIRS WERE PERFORMED.  THE CURRENT MILEAGE WAS 102,725 AND THE APPROXIMATE FAILURE MILEAGE WAS 102,625.",
        "vin": "5NMSG13D77H"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/01/2011",
        "dateOfIncident": "08/24/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10422894,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI SANTA FE. THE CONTACT STATED THAT THE BRAKE LIGHTS WERE NOT ILLUMINATING WHEN THE DRIVER APPLIED THE BRAKES. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER, WHERE THE CONTACT WAS INFORMED THAT THERE WAS AN INTERNAL SHORT WITHIN THE BRAKE SWITCH. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE, BUT OFFERED NO ASSISTANCE. THE FAILURE MILEAGE WAS 47,153.",
        "vin": "KM8SC13E16U"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/03/2011",
        "dateOfIncident": "07/09/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10416838,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Cooper Tire & Rubber Co.",
                "productMake": "COOPER",
                "productModel": "COOPER DISCOVERER H/T",
                "productYear": "9999",
                "size": "P235/70R16",
                "type": "Tire"
            }
        ],
        "summary": "TOOK VEHICLE TO KAUFFMAN TIRES FOR WHEEL BALANCING. THEY RECOMMENDED NEW TIRES. THEY PUT ON COOPER DISCOVERER H/T 106T TIRES. DROVE THE CAR HOME, 2HOUR DRIVE AND IMMEDIATELY NOTICED BAD VIBRATION AND THE TIRES FELT LIKE THEY WERE MADE OF STONE! WENT TO DEALER, HAD ALIGNMENT AND WHEEL BALANCE DONE. THEY FOUND THE FRONTS TO BE ONE OUNCE OUT ON EACH SIDE, AND POSSIBLY VIBRATION REMAINING WAS FROM A DEFECTIVE TIRE. WENT BACK TO TIRE DEALER WITH FINDING. WAS TOLD THAT DEALER WAS PROBABLY WRONG. I QUESTIONED THE CHANGE FROM P225'S TO THEIR RECOMMENDED P235'S, WAS TOLD BY TIRE DEALER THAT IT WAS OK PEOPLE USE DIFFERENT SIZES ALL THE TIME. I INSISTED ON TIRES OF THE CAR MANUFACTURER RECOMMENDATION. HAD TO COME BACK A FEW DAYS LATER BECAUSE THEY DIDN'T HAVE P225'S IN STOCK. WHEN I RETURNED I NOTICED THE RIGHT FRONT TIRE HAD A BULGE AS BIG AS A BASKETBALL ON THE SIDE FROM THE RIM, ACROSS THE SIDEWALL AND ALMOST TO THE TREAD. TIRE PLACE PUT ON GOOD YEAR LONG TRAILS P225'S AND THEY SEEM TO BE OK. RECOMMEND CITIZENS NEVER TRUST A TIRE DEALER! ALWAYS USE THE TIRE PLACARD FOR GUIDANCE!  *KB",
        "vin": ""
    },
    {
        "components": "STEERING,ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/01/2011",
        "dateOfIncident": "07/25/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10417312,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TRAVELING ON I-295 AND APPROXIMATELY HALF MILE FROM THE EXIT I NEEDED, MY BATTERY LIGHT, BRAKE LIGHT CAME ON. WHEN I NEARED THE OFF RAMP AND SLOWED DOWN TO 60 MPH, I STARTED TO TURN THE STEERING WHEEL AND IT WAS UNRESPONSIVE AND I HAD LOST POWER STEERING. I WAS ABLE TO SLOW DOWN ADEQUATELY, AND WITH BOTH HANDS CONTINUALLY FIGHTING WITH THE STEERING, I MANAGED TO GET THE VEHICLE TO AN AREA SAFELY WHERE I COULD CONTACT MY MECHANIC AND HAVE IT TOWED TO THEIR PREMISES. UPON HIS INSPECTION THE FOLLOWING DAY, HE CALLED ME TO LET ME KNOW THAT THE FRONT ENGINE MOUNTING BOLTS HAD BROKEN OFF IN FRONT OF THE BLOCK, AND THE HOLES ARE DAMAGED. I DID CONTACT HYUNDAI, AND THEY SEEMED VERY UNCONCERNED BY THE INCIDENT. I WOULDN'T HAVE THOUGHT THAT BOLTS BREAKING AT ONLY 52,000 MILES WITHOUT REASON WOULD BE AN ISSUE THAT THEY WOULD LIKE TO PURSUE. EVEN THOUGH I HAD PURCHASED THE CAR USED, AT THE TIME OF THE PURCHASE THERE WAS NOTHING IN THE CARFAX REPORT TO INDICATE THAT THERE WERE ANY PROBLEMS, AND OF COURSE, THE CAR WARRANTY UNDER HYUNDAI EXPIRED IN APRIL. I AM NOT SURE IF THIS IS A ONE OFF INCIDENT, OR A POSSIBLE PATTERN. THANK YOU FOR LOOKING INTO THIS MATTER.  *TR",
        "vin": "KM8SC73D06U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/17/2011",
        "dateOfIncident": "12/29/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10391934,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 HYUNDAI SANTA FE. CONSUMER REQUESTS REIMBURSEMENT FOR VEHICLE REPAIRS FOR ENGINE DAMAGE *TGW  THE CONSUMER STATED THE ENGINE LIGHT ILLUMINATED AND THE ENGINE BEGAN KNOCKING. THE CONSUMER TOOK THE VEHICLE TO GOODYEAR AND THE MECHANIC INFORMED HER THE ENGINE WAS COVERED IN SLUDGE AND ADVISED HER TO TAKE THE VEHICLE TO THE DEALER.  THE DEALER INFORMED THE CONSUMER THE ENGINE WOULD NEED TO BE REPLACED DUE TO THE ENGINE BEING NEGLECTED DUE TO NOT HAVING PROPER OIL CHANGES.  THE CONSUMER STATED SHE HAD PROOF OF ALL THE OIL CHANGES.  HYUNDAI REFUSED TO HONOR THE CONSUMERS WARRANTY. *JB",
        "vin": "KM8SC13D56U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/10/2011",
        "dateOfIncident": "03/08/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10389701,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI SANTA FE. THE CONTACT WAS DRIVING LESS THAN 5 MPH IN REVERSE IN A RESIDENTIAL DRIVEWAY WHEN THE VEHICLE EXHIBITED AN LOUD BANG FROM THE EXTERIOR.  THE CONTACT INSPECTED THE VEHICLE AND NOTICED THAT THE FRONT DRIVER SIDE TIRE WAS PUNCTURED DUE A FRACTURED COIL SPRING. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 75,000.",
        "vin": "KM8SC13E36U"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "03/09/2011",
        "dateOfIncident": "03/07/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10389673,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS PEDAL GETS STUCK AND THEN ACCELERATES ON ITS OWN. TAKEN TO HYDRAIN MECHANIC TWO TIMES. THE SECOND TIME THE MECHANIC EXPERIENCE THE GAS PEDAL GETTING STUCK. JUST EXPERIENCE AGAIN ON MARCH 7-8, 2011 THIS HAS GONE ON FOR TWO YEARS.  *TR",
        "vin": "JTEHH20V336"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/02/2011",
        "dateOfIncident": "01/29/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10379981,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 HYUNDAI SANTA FE. THE CONTACT STATED THAT THE VEHICLE ACCELERATED WHILE THE CONTACT HAD HIS FOOT ON THE BRAKE PEDAL. HE MENTIONED THAT HE HAD TO APPLY AN INCREDIBLE AMOUNT OF PRESSURE IN ORDER TO KEEP THE VEHICLE FROM LEAPING FORWARD. THE VEHICLE WAS TAKEN TO A DEALER WHO WAS NOT ABLE TO DUPLICATE THE  FAILURE. THE MANUFACTURER WAS NOT CONTACTED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 53,900 AND CURRENT MILEAGE WAS 54,000.",
        "vin": "2B3HD46R62H"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/04/2011",
        "dateOfIncident": "12/30/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10374602,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 HYUNDAI SANTA FE. THE CONTACT STATED THAT UPON STARTING THE VEHICLE, IT WOULD NOT MOVE. THE VEHICLE WAS TOWED TO AN AUTHORIZED DEALER WHO STATED THAT THE FRONT DRIVER SIDE COIL SPRING BROKE. THE DEALER REPLACED THE SPRING. THE CONTACT NOTICED THAT THE BROKEN SPRING HAD CRACKS AND RUST. THE FAILURE MILEAGE WAS 62,282.",
        "vin": "KM8SC13D46U"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/29/2010",
        "dateOfIncident": "08/22/2006",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10358247,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 HYUNDAI SANTA FE. THE CONTACT STATED THAT WHENEVER THE ACCELERATOR PEDAL WAS DEPRESSED FROM A STOPPED POSITION, THE VEHICLE WOULD LUNGE FORWARD. ALSO, THE VEHICLE WOULD ACCELERATE UP TO 15 MPH ALTHOUGH THE ACCELERATOR PEDAL HAD NOT BEEN DEPRESSED. THE DEALER STATED THAT THE LINK SYSTEM COULD BE THE CAUSE OF THE FAILURE. THE MANUFACTURER SENT OUT A TECHNICIAN TO INSPECT THE VEHICLE BUT COULD NOT DUPLICATE THE FAILURE. THE VIN WAS UNAVAILABLE. THE FAILURE MILEAGE WAS 15 AND THE CURRENT MILEAGE WAS APPROXIMATELY 11,000.",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/20/2010",
        "dateOfIncident": "08/12/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10356627,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "EVERY SUMMER WHEN THE TEMPERATURE REACHES 100' RANDOMLY WITH OUT CAUSE MY 2006 HYUNDAI SANTA FE EXPERIENCES A PROBLEM WHILE DRIVING WITH THE A/C ON, WHERE THE PASSENGER COMPARTMENT SUDDENLY FILLS WITH THE TASTE AND SMELL OF RAW FUEL FUMES, CHOKING ME AND ANY PASSENGER IN THE VEHICLE,. THE VEHICLE HAS BEEN TO MY DEALER EVERY SUMMER FOR THIS SAME REASON,.  THIS 12 AUGUST, THE 'INCIDENT HAPPENED WHEN I WAS ONLY 4.2 MILES FROM THE DEALER, AND ROVE DIRECTLY THERE, WHILE ON THE BLUETOOTH WITH HYUNDAI AMERICA.  THE HYUNDAI SERVICE MANAGER AND SEVERAL SENIOR SERVICE WRITERS WITNESSED THE 'INCIDENT' GAS FUMES COULD BEE SEEN ROILING FROM UNDER THE HOOD,.  FOR FOUR YEARS, SINCE I PURCHASED THIS VEHICLE, THE DEALER HAS BEEN UNABLE TO RE-CREATE THE PROBLEM, NOT ONLY DID THEY WITNESS THIS FIRST HAND , BUT DUPLICATED IT AGAIN,.  AFTER MY CAR WAS RETURNED TO ME, AS HYUNDAI AMERICA REFUSED TO BUY THE VEHICLE BACK, I WAS TOLD BY A REGIONAL 'PARTS MANAGER', WHO CALLED ME FROM A CELL PHONE SO THE CONVERSATION COULD NOT BE RECORDED, AND TOLD ME THE PROBLEM HAD BEEN DOCUMENTED, HOWEVER, IT IS A PROBLEM UNIQUE TO MY CAR, AND FOR ME NOT TO DRIVE WITH THE A/C ON IN THE ARIZONA DESERT, DURING THE SUMMER,. *TR",
        "vin": "KM8SC13D46U"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "05/03/2010",
        "dateOfIncident": "01/01/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10328576,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI SANTA FE. THE CONTACT STATED  THAT WHENEVER THERE IS A HEAVY RAIN OR THE VEHICLE IS TAKEN THROUGH A CAR WASH, THE VEHICLE WOULD STALL. THE DEALER ADVISED THE PROBLEM COULD BE CAUSED BY THE ELECTRICAL SYSTEM GETTING TOO WET FROM EXPOSURE TO EXCESSIVE WATER AND REPLACED THE ELECTRICAL SYSTEM SENSOR. TWO WEEKS FOLLOWING REPAIRS, THE FAILURE RECURRED WHILE DRIVING AT SPEEDS OF 55 MPH. THE VEHICLE STALLED AND THERE WAS NO POWER STEERING. THE CONTACT WAS UNABLE TO MAINTAIN CONTROL OF THE VEHICLE WITHOUT STEERING CAPABILITIES AND THE VEHICLE PROCEEDED TO CRASH INTO THE WALL OF AN OVERPASS. THE VEHICLE WAS TOWED TO A LOCAL REPAIR SHOP WHERE THE CONTACT WAS AWAITING AN ASSESSMENT OF THE DAMAGES.  THE FAILURE MILEAGE WAS 62,000 AND THE CURRENT MILEAGE WAS 83,000.",
        "vin": "KM8SC13EX6U"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "04/11/2010",
        "dateOfIncident": "04/10/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10324949,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2006 SANTA FE 6 CYL. FRONT WHEEL DRIVE. I PURCHASED THE CAR IN 2007 FROM GO HYUNDAI. THE CAR HAS RUN VERY GOOD, EXCEPT THE SURGING OR ACCELERATION PROBLEM. I TOOK IT BACK TO THE DEALER TWO TIMES SPECIFICALLY FOR THIS PROBLEM. THEY SAID THEY COULD FIND NO PROBLEM. I TOOK IT TO A SECOND DEALER, PLANET HYUNDAI, AND THEY COULD FIND NOTHING. THE PROBLEM GOT SO BAD EVEN I WAS AFRAID TO DRIVE IT. MY WIFE WAS REALLY SCARED TO DRIVE IT. I FINALLY TOOK IT BACK GO  AND THEY CALLED, SAID IT WAS READY. WHEN I PICKED IT UP, THE SERVICE GUY SAID THEY REPLACED A PART AND THAT I SHOULDN'T HAVE ANY MORE SURGING PROBLEMS. LAST NIGHT, MY WIFE DROVE THE SANTA FE TO CHURCH. AS SHE WAS PARKING IT IN THE GARAGE, (SOMETHING SHE HAD DONE A THOUSAND TIMES), THE CAR SUDDENLY ACCELERATED, SLAMMING INTO OUR VOLVO CONVERTIBLE, PUSHING IT ABOUT FIVE FEET FORWARD, JAMMING IT UNDER OUR STAIRS INTO THE HOUSE. IN ALL, THERE IS A LOT OF DAMAGE TO BOTH VEHICLES. *TR",
        "vin": "KM8SC13E56U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": true,
        "dateComplaintFiled": "03/30/2010",
        "dateOfIncident": "02/21/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10322912,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 HYUNDAI SANTA FE. THE CONTACT STATED THAT UPON START-UP, THE VEHICLE WOULD CONTINUOUSLY STALL. THE DEALER MADE REPAIRS TO THE MASTER CYLINDER BUT THE REPAIR DID NOT CORRECT THE FAILURE. THE CONTACT HAD TO CONTINUOUSLY ATTEMPT TO START THE ENGINE BEFORE IT WOULD POWER ON AND ALL OF THE WARNING LIGHTS WOULD ILLUMINATE ON THE WARNING PANEL. ON A SEPARATE OCCASION WHILE DRIVING 20 MPH, THE CONTACT DEPRESSED THE BRAKE PEDAL BUT THE BRAKES WOULD NOT ENGAGE. THE VEHICLE PROCEEDED TO STALL AND CRASHED INTO A BARRIER. THE VEHICLE WAS TOWED TO A LOCAL REPAIR SHOP. THE INDEPENDENT MECHANIC ADVISED THE CONTACT TO REPAIR THE BODY DAMAGE BEFORE A DIAGNOSTIC TEST COULD BE PERFORMED OR ANY TECHNICAL REPAIRS COULD BE MADE TO THE VEHICLE. THE MECHANIC ALSO CONFIRMED THAT THE VEHICLE WAS DESTROYED. SHE ATTEMPTED TO DRIVE THE ALTHOUGH IT WAS MAKING AN UNUSUAL NOISE. THE VEHICLE WAS TOWED TO THE DEALER WHERE SHE WAS AWAITING AN ASSESSMENT OF THE DAMAGES. THE APPROXIMATE CURRENT AND FAILURE MILEAGES WERE 26,000.",
        "vin": "KM8SC73D96U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/28/2010",
        "dateOfIncident": "02/28/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10314989,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM HAVING THE SAME SYMPTOMS SHOWN BELOW IN MY 2006 HYUNDAI SANTA FE. SO FAR I DO NOT SEE A RECALL NOTICE FROM HYUNDAI.    NHTSA CAMPAIGN ID NUMBER: 09V122000   PE09003    NHTSA ACTION NUMBER: PE09003    COMPONENT: SERVICE BRAKES, HYDRAULIC:SWITCHES:BRAKE LIGHT  POTENTIAL NUMBER OF UNITS AFFECTED: 531894    SUMMARY:  HYUNDAI IS RECALLING 531,894 MY 2006-2007 ACCENT, ENTOURAGE, SONATA, MY 2007 AZERA, ELANTRA AND SANTA FE, MY 2005-2007 TUCSON AND MY 2007-2008 VERACRUZ VEHICLES. THE STOP LAMP SWITCH IN THE AFFECTED VEHICLES MAY MALFUNCTION. A MALFUNCTIONING STOP LAMP SWITCH MAY CAUSE THE BRAKE LIGHTS TO NOT ILLUMINATE WHEN THE BRAKE PEDAL IS DEPRESSED OR MAY CAUSE THE BRAKE LIGHTS TO REMAIN ILLUMINATED WHEN THE BRAKE PEDAL IS RELEASED. A STOP LAMP SWITCH MALFUNCTION MAY AFFECT THE OPERATION OF THE BRAKE-TRANSMISSION SHIFT INTERLOCK FEATURE SO THE TRANSMISSION SHIFTER WOULD NOT BE ABLE TO BE SHIFTED OUT OF PARK POSITION. IT MAY ALSO CAUSE THE ELECTRONIC STABILITY CONTROL (ESC) MALFUNCTION LIGHT TO ILLUMINATE, AND IT MAY NOT DEACTIVATE THE CRUISE CONTROL WHEN THE BRAKE PEDAL IS DEPRESSED. *TR",
        "vin": "KM8SC13D86U"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/01/2009",
        "dateOfIncident": "11/17/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10294891,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 HYUNDAI SANTA FE HAD BRAKE PAD ISSUES.   *NJ   THE DEALER DISCOVERED THAT ONE OF THE FOUR DISK BRAKE PADS WAS BEGINNING TO SEPARATE.  THE CONSUMER STATED FOR SUCH LOW MILEAGE AND MINIMAL WEAR, HE BELIEVED THE SINGLE PAD IN QUESTION WAS A DEFECTIVE BRAKE PART. *JB",
        "vin": "KM8SC73E76U"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/30/2009",
        "dateOfIncident": "11/22/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10293993,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 HYUNDAI SANTA FE. WHEN DRIVING OVER A SMALL PUDDLE OF WATER,THE BRAKES WOULD LOCK. USUALLY WHEN THE FAILURE OCCURS,THE BRAKE LIGHT AND BATTERY LIGHTS WOULD ILLUMINATE FOR ABOUT 35 SECONDS AND THEN THE STEERING WHEEL WOULD LOCK. AFTER A SHORT TIME, THE BRAKES AND STEERING COLUMN WOULD UNLOCK. THE VEHICLE WAS TAKEN TO THE DEALERSHIP ON MANY DIFFERENT OCCASIONS. THE TECHNICIAN FINALLY CONCLUDED THAT WATER WAS ENTERING INTO ONE OF THE PULLEYS. HOWEVER HE STATED THAT HE COULD NOT REMEDY THE FAILURE. SHE CALLED THE MANUFACTURER AND A REPRESENTATIVE WAS SENT OUT TO INSPECT THE VEHICLE. NO ASSISTANCE HAS BEEN PROVIDED. THE CURRENT MILEAGE WAS 41,763. THE FAILURE MILEAGE WAS APPROXIMATELY 10,000.   UPDATED 01/1410 *BF  UPDATED 01/20/10.*JB",
        "vin": "KM8SC73D36U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/03/2009",
        "dateOfIncident": "07/09/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10290855,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE SWITCH FAILURE WHICH CAUSED RECALL OF ALL 2006 HYUNDAI MODELS EXCEPT SANTE FE WHICH WAS RECALLED IN 2007 FOR THAT SAME ISSUE. *TR",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "03/10/2009",
        "dateOfIncident": "03/04/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10261406,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2006 HYUNDAI SANTA FE.  FIRST THE DRIVER'S SIDE FOG LIGHT WENT OUT, THEN THE DRIVER'S SIDE WIPER QUIT AND NOW THE DRIVER'S SIDE HEADLIGHT HAS GONE OUT.  THE WIPER ARM HAS TO BE REPLACED AND THE FOG LIGHT ASSEMBLY HAS TO BE REPLACED.  I DON'T KNOW IF THERE IS AN ELECTRICAL ISSUE WITH THIS VEHICLE OR NOT.  IT WAS BOUGHT BRAND NEW IN MARCH 2006.  IT HAS 62,000 MILES ON IT AND SO THE WARRANTY THAT COVERS THINGS LIKE SENSORS AND ALL IS NO LONGER VALID.  I AM CONCERNED ABOUT THIS HAPPENING ALL AT ONCE. *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/23/2009",
        "dateOfIncident": "01/23/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10256145,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "OCCASIONALLY, WHEN ACCELERATING FROM A STOP POSITION  THE CAR WILL UNEXPECTEDLY SURGE FORWARD.  WE HAVE HAD THIS CAR FOR 3 YEARS NOW AND IT HAS HAPPENED ABOUT 6 TIMES SO FAR.  CONSEQUENCES HAVE BEEN NONE SO FAR, BUT I AM CONCERNED SOMETHING MAY HAPPEN IN THE FUTURE.  *TR",
        "vin": "KM8SC13E26U"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/17/2009",
        "dateOfIncident": "02/28/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10255398,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2006 HYUNDAI SANTA FE HAS EXPERIENCED FROM THE TIME OF PURCHASE A LONG LAG TIME BETWEEN DEPRESSING THE ACCELERATOR AND THE VEHICLE STARTING TO MOVE.  THE TIME CAN BE UP TO A FEW SECONDS.  THIS HAS BEEN ANNOYING AND AT TIMES DANGEROUS.  IF THE VEHICLE ALWAYS DID THIS, YOU COULD GET USED TO IT, THOUGH IT IS STILL NOT SAFE.  UNFORTUNATELY, THERE ARE TIMES WHEN BARELY DEPRESSING THE ACCELERATOR RESULTS IN INSTANT TIRE SPINNING AND ASSOCIATED QUICK ACCELERATION.  THE INCONSISTENT NATURE OF THE ACCELERATOR RESPONSE MAKES THE VEHICLE DANGEROUS.  AS MY DAUGHTER IS LEARNING TO DRIVE, I CANNOT LET HER USE THE VEHICLE BECAUSE WITH ANY INEXPERIENCED DRIVER, THIS CAR WOULD BE DEADLY.  I HAVE BROUGHT THE CAR TO THE DEALER ONCE (IN PA) AND WAS BRUSHED OFF WITH THE EXCUSE THAT THE ENGINE COMPUTER DID NOT REPORT ANY PROBLEM.  *TR",
        "vin": "KM8SC73E26U"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "12/10/2008",
        "dateOfIncident": "12/05/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10251300,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 HYUNDAI SANTA FE.  THE CONTACT STATED THAT HIS WINDSHIELD WIPERS STOPPED WORKING.  THE DEALER STATED THAT THE WINDSHIELD WIPER ARMS WERE STRIPPED AT THE POINT WHERE THEY WERE CONNECTED TO THE MOTOR.  THE REPAIR WAS NOT COVERED UNDER WARRANTY BECAUSE TOO MANY CONSUMERS WERE EXPERIENCING THE SAME FAILURE.  THE FAILURE MILEAGE WAS 28,770.  UPDATED 3/9/09 *CN  UPDATED 03/10/09. *JB",
        "vin": "KM8SC73D06U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/25/2008",
        "dateOfIncident": "10/28/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10249782,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER AIR BAG ON MY 2006 HYUNDAI SANTA FE DOES NOT ACTIVATE (ARM ITSELF) WHEN MY DAUGHTER SITS IN THE SEAT. MY DAUGHTER IS AN ADULT, WEIGHS APPROXIMATELY 110 LBS AND IS PROPERLY SEATED AND WITH SEAT BELTS ON. THIS SITUATION WAS PRESENTED TO THE SALISBURY HYUNDAI DEALER WHEN I FIRST GOT THE CAR, AND RECENTLY TO THE OURSIDMAN HYUNDAI DEALER IN LAUREL, MD WHERE I PURCHASED THE CAR. BOTH DEALERS CLAIM THEY CAN NOT DUPLICATE THE EVENT, USING ANOTHER PURSON AS THE TEST SUBJECT. THEY HAVE NOT PERFORMED ANY TEST TO CONFIRM THAT THE INSTALLATION OF THE SAFETY FEATURE IS PROPER, MEETS YOUR STANDARDS, OR EVEN AT WHAT WEIGHT THE LIGHTLY FINALLY TURNS OFF. THIS SITUATION IS DANGEROUS TO MY DAUGHTER AND OTHER CHILDREN OR GRANDCHILDREN RIDING IN THE FRONT SEAT. MY DAUGHTER IS A PRACTICING LAWYER IN MARYLAND AND REFUSES TO WASTE HER TIME VISITING THE DEALERSHIP UNTIL THEY COMPLETE A VALID PERFORMANCE TEST. I AGREE, AND BELIEVE THE ONLY BENEFIT OF BRINGING HER TO THE DEALERSHIP WOULD BE TO PROVE I'M NOT LYING.     I CONTACTED HYUNDAI CUSTOMER SERVICE AT 1-800-633-5151 EXT 54327 ON OCTOBER 28TH AND HE ASSIGNED CASE NO. 3427197 TO IT AND REFERRED IT TO OTHERS. I NEXT HEARD FROM \"ANNIE\" AT EXT 54313, WHO GOT THE CASE AND SHE TRIED TO TELL ME THAT THE SEAT IS SET AT 140 LBS, AND OTHER NONSENSE INFORMATION. THIS KIND OF CORRECTION OF A SAFETY ISSUE IS NOT ACCEPTABLE. I EXPECT HYUNDAI TO WITHER FIX THE SEAT OF REPLACE IT. THE CAR HAS LESS THAN 30K MILES AND IS UNDER FULL WARRANTY.    YOUR ASSISTANCE IS REQUESTED IN MAKING HYUNDAI COMPLY WITH OUR SAFETY STANDARDS. *TR",
        "vin": "KM8SC73DX6U"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/14/2008",
        "dateOfIncident": "06/18/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10238141,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "SURGING. SOMETIMES WHEN APPLYING BRAKES, FEELS LIKE YOU ARE ALSO LAYING ON THE GAS PEDAL.  OTHER TIMES, WHEN JUST BARELY ACCELERATING, IT'S LIKE TAKING OFF AT THE STARTING LINE. REAL SURGING, IT'S SCARY. MY WIFE DOESN'T LIKE DRIVING IT BECAUSE OF THIS PROBLEM. THE SERVICE TECH'S AT THE DEALER SAYS NOTHING IS WRONG, THAT IT IS DESIGNED TO DO THIS. I FIND THAT TO BE STUPID, OR NOT TRUE.  *TR",
        "vin": "KM8SC13E56U"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/08/2008",
        "dateOfIncident": "09/01/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10223729,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "POOR GAS MILEAGE, HARSH SHIFTING OF TRANSMISSION.  *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/05/2008",
        "dateOfIncident": "12/20/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10217044,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE COMPLAINED TO MFG. OF THE PROBLEM I HAVE WITH ACCELERATION. WHEN GAS PEDAL IS PRESSED FROM A STOPPED POSITION THE SUV POWER SURGES, THERE IS NO SMOOTH ACCELERATION. NO MATTER HOW YOU TRY TO CONTROL THE PRESSURE ON THE PEDAL, THE VEHICLE JUST TAKES OFF. I HAD THIS CHECKED OUT 2X SINCE BUYING VEHICLE IN DEC. O7. AND HAVE BEEN TOLD THAT IS THE WAY THE COMPUTER WORKS WITH THE VEHICLE. I FIND THIS TO BE VERY UN-NERVING AND DANGEROUS. THIS IS A CONTINUOUS PROBLEM, AND I HAVE HAD A FRIEND DRIVE VEHICLE AND HE HAS THE SAME PROBLEM.  *TR",
        "vin": "KM8SC73E36U"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/12/2007",
        "dateOfIncident": "05/08/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10190566,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AT THE RECOMMENDATION OF THE DEALER MECHANIC I HAD A TRANSMISSION FLUSH DONE. NOW THE CAR IDLES ERRATICALLY, AND SURGES WHEN SLOWING TO A STOP. AT TIMES.WHEN STOPPED THE IDLE DROPS TO 300-400 RPMS, ALMOST A STALL, AND SOMETIMES IT JUMPS TO 1200-1500 RPMS AND WANTS TO LUNGE FORWARD. I HAVE TO MAKE SURE I AM REALLY STOMP ON THE BRAKE, OR ELSE I WOULD HIT SOMETHING. I TOOK THE CAR TO THE DEALER, AND THEY SAID THEY USED THE COMPUTER AND FOUND NO CODES, SO NOTHING  WAS WRONG. THEY RECOMMENDED  AN INJECTOR FLUSH, THOUGH THE CAR SEEMED  TO RUN FINE AT SPEED.  *AK",
        "vin": "KM8SC13D56U"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/25/2007",
        "dateOfIncident": "04/21/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10188853,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 HYUNDAI SANTA FE.  WHILE DRIVING 20 MPH THE  CONTACT'S VEHICLE CRASHED INTO A TELEPHONE POLE.  HE LOST CONTROL OF THE VEHICLE, DROVE INTO TRAFFIC, STRUCK ANOTHER POLE AND A TRAFFIC SIGN. THE SIGN WAS KNOCKED DOWN, AND THE POLE WAS THE SNAPPED AT THE BASE. THE VEHICLE SUSTAINED SEVERE FRONT END DAMAGE.  THE AIR BAG DID NOT DEPLOY. THERE WAS A POLICE REPORT.  THE CURRENT AND FAILURE MILEAGE WERE 11000. *AK",
        "vin": "KM8SC73D06U"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/22/2007",
        "dateOfIncident": "01/17/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10179423,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS RECENTLY INVOLVED IN AN ACCIDENT IN MY 2006 HYUNDAI SANTA FE. I HIT THE BACK OF A STOPPED FARM TRUCK CARRYING A HAY BALE AT ABOUT 65 MPH, WHILE I AM ALIVE AND IN DECENT SHAPE CONSIDERING, I SURELY WOULD HAVE APPRECIATED AT LEAST ONE OF THE AIR BAGS DEPLOYING, BUT NO, BRAND NEW CAR, TOTALED, I HAVE PICS, AND ALL THE AIR BAGS STILL TUCKED AWAY IN THEIR RESPECTIVE LOCATIONS. I WOULD APPRECIATE A GOOD EXPLANATION FOR THIS AS I CURRENTLY OWN 2 HYUNDAI VEHICLES AND PLAN TO NOT PURCHASE OR RECOMMEND ON EVER AGAIN.  *NM",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "12/03/2006",
        "dateOfIncident": "12/02/2006",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10175009,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES FAILED TO APPLY WHEN COMING TO A STOP AT A RED LIGHT CAUSING ME TO HIT THE BACK OF THE CAR IN FRONT OF ME; SPEED LESS THAN 10 MPH; BRAKES \"BUCKED\" AND WOULD NOT RE-ENGAGE AND DID NOT STOP THE CAR IN TIME TO PREVENT ACCIDENT; APPLIED EMERGENCY BRAKE AND TURNED OFF IGNITION TO STOP PROCESS; REPORTED TO LOCAL POLICE; CAR HAS BEEN IMPOUNDED FOR INVESTIGATION AND CONFIRMATION OF TECHNICAL DIFFICULTIES.  *NM",
        "vin": "KM8SC73E46U"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "12/01/2006",
        "dateOfIncident": "11/27/2006",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10174937,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "#1 CAR WOULD NOT STOP, ROLLED THROUGH A STOP SIGN AND PULLED OVER INTO EMPTY LOT AND TESTED BRAKES A FEW TIMES AND THEN IT WAS OKAY.  #2 WAS STOPPED BEHIND A VEHICLE ABOUT 2 FEET AWAY, WITH MY FOOT ON THE BRAKE WHEN CAR ACCELERATED AND FELT LIKE IT JUMPED AND I BUMPED THE CAR IN FRONT.    THIS WAS ON 11-28-06 ABOUT 1 1/2 HOURS AFTER BRINGING MY CAR TO THE DEALER TO TELL THEM THAT MY BRAKES SOUNDED LIKE METAL AGAINST METAL AND WAS TOLD THAT IT WAS NORMAL ON FOGGY MORNINGS. THE SAME THING HAPPENED THE MORNING BEFORE BUT I WAS TOLD TO BRING IT IN THE NEXT DAY BECAUSE THEY WERE BUSY.  I DON'T REMEMBER THE DATE OF THE FIRST INCIDENT WHEN I ROLLED THROUGH THE STOP SIGN BUT IT WAS ABOUT 4 WEEKS BEFORE THE SECOND TIME. DEALER HAD MY CAR FOR 2 DAYS BUT COULD NOT DUPLICATE THE INCIDENT. *JB",
        "vin": "KM8SC73E96U"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/27/2006",
        "dateOfIncident": "11/25/2006",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10174382,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED WHILE DRIVING AND DEPRESSING THE ACCELERATOR PEDAL, THE ENGINE ACCELERATED AND WHEN THE BRAKE PEDAL WAS DEPRESSED, THE VEHICLE FAILED TO STOP.  THE GEAR WAS SHIFTED INTO PARK AND THE VEHICLE STOPPED.  IT WAS DRIVEN TO THE DEALER WHO COULD NOT DUPLICATE THE PROBLEM.   UPDATED 12/18/06. *JB",
        "vin": "KM8SC73D56U"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/09/2006",
        "dateOfIncident": "11/09/2006",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10173071,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE DRIVING ANY SPEEDS AT NIGHT, THE HEADLIGHTS FAILED TO ILLUMINATE. THIS OCCURRED WITHOUT WARNING. THE VEHICLE WAS INSPECTED BY A DEALER WHO DETERMINED AN ELECTRICAL SENSOR FAILED AND NEEDED REPLACED.  AFTER THE REPAIR, THE PROBLEM PERSISTED.  THE MANUFACTURER WAS NOT ALERTED.",
        "vin": "KM8SC13D56U"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/29/2006",
        "dateOfIncident": "02/01/2006",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10161084,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ABS SYSTEM ACTIVATES ON INTERMITTENT OCCASIONS WHEN BRAKING FROM SLOW  <20 MPH, ALSO ABS PUMP CYCLES ON DURING SLOW TURNS.   *JB",
        "vin": "KM8SC13D43U"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/27/2006",
        "dateOfIncident": "02/27/2006",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10151342,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED THE VEHICLE WENT OVER AN EMBANKMENT WHILE GOING 25-30 MPH.  THERE WAS PRIOR BRAKING.  THE VEHICLE STRUCK A TREE ON THE FRONT PASSENGER SIDE, THE AIRBAGS DID NOT DEPLOY.  THE OCCUPANTS WERE WEARING SEATBELTS, BUT SUSTAINED MINOR INJURIES.  THERE WAS A POLICE REPORT TAKEN AT THE SCENE.  THE VEHICLE WAS TOWED TO AN INDEPENDENT REPAIR SHOP, BUT THERE HAS BEEN NO INSPECTION TO WHY THE AIRBAGS DID NOT DEPLOY.",
        "vin": "KM8SC73E46U"
    }
]