[
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/14/2021",
        "dateOfIncident": "03/31/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11408143,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE STALLING ALL TIME WHICH IS VERY DANGEROUS ESPECIALLY WHEN I M DRIVING ON HIGHWAY . MORE THAN 10 TIMES I ALMOST CRASH MY VEHICLE.",
        "vin": "5N3AA08C06N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/18/2020",
        "dateOfIncident": "11/17/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375189,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 INFINITI QX56, HAD BACK BRAKES AND ROTORS REPLACED IN OCTOBER 2020, 2 WEEKS LATER I'M DRIVING, FLAT SURFACE, NICE DAY, APPLIED BRAKES, MY PEDAL WENT TO FLOOR, NO RESISTANCE, I HEARD A GRINDING NOISE, FELT LIKE A 'SLIP' , I HAD KIDS IN CAR, I PULLED OVER, ASKED THE GIRLS WHAT THEY HEARD, TURNED OFF VEHICLE, CHECKED BRAKE FLUID, FULL, THE GIRLS THOUGHT I MAY HAVE HIT A SLICK PATCH OF OIL OR SOMETHING?? WE DID OUR SHOPPING, I MADE A FEW PHONE CALLS, GOT BACK IN VEHICLE, STARTED IT AND APPLIED BRAKES, WORKED FINE, DROVE HOME SLOW, NO ISSUES. ALSO NO LIGHTS CAME ON WHEN THIS HAPPENED. I CONVINCED MYSELF THIS WAS JUST A FLUKE. 2 1/2 WEEKS LATER AND AFTER LOTS OF DRIVING, I HAD TO GO TO MEMPHIS 5 HOURS AWAY WITH MY DAUGHTER. EVERYTHING FINE UNTIL WE GOT THERE. CHECKED INTO HOSPITAL, THEN DECIDED TO GO DOWNTOWN 4 BLOCKS AWAY. STARTED CAR, DROVE SLOW, AT 3RD BLOCK WENT TO BRAKE AS USUAL AND IT HAPPENED!!! BRAKE PEDAL WENT TO FLOOR, LOUD GRINDING, CLUNKING, BRAKES WOULDN'T WORK, THIS TIME LIGHT CAME ON. JUST THE RED BRAKE LIGHT. I GOT PULLED OVER, SHUT OFF VEHICLE, CHECKED FLUID LEVELS AGAIN, FULL! SCARED NOW. I'M IN MEMPHIS. WHEN I STARTED CAR BACK UP IT WAS FINE. I DON'T WANT TO DRIVE HOME. HAVE READ ALL THE BRAKE SENSOR PROBS, NO RECALLS, DEATHS, UNABLE TO STOP, I'M FRIGHTENED AND DON'T KNOW WHAT TO DO. NISSAN WILL BE HEARING FROM ME",
        "vin": "5N3AA08C76N"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/10/2020",
        "dateOfIncident": "09/06/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354126,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "SUV WILL HAVE TROUBLE BRAKING, EMITTING A LOUD, GRINDING NOISE WHEN BRAKES ARE APPLIED. DIFFIULTY STOPPING.  ALMOST CAUSED A WRECK TWICE NOW. ONCE VEHICLE IS TURNED OFF AND BACK ON, THE SITUATION SEEMS TO STOP.  HAPPENS PERIODICALLY.  FIRST TIME HAD BRAKES, ROTORS REDONE IN CASE THERE WAS AN ISSUE, THOUGH THERE DID NOT SEEM TO BE ACCORDING TO THE MECHANIC.  HAS CONTINUED TO DO IT A FEW ADDITIONAL TIME.  TOOK IT INTO INFINITI DEALER. WAS TOLD IT WAS THE BRAKE VACUUM BOOSTER. THIS ITEM HAS BEEN RECALLED ON OTHER 2004-2008 INFINITI QX-56 AND NISSAN ARMADAS.  WAS TOLD THAT MY CAR WAS NOT ON THE 'RECALL' LIST.",
        "vin": "5N3AA08C16N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/27/2020",
        "dateOfIncident": "07/22/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341712,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DIFFICULTY STOPPING. PINGING NOISE. REPLACED THE BRAKES BUT DIDN'T FIX THE ISSUE. VERY DANGEROUS AS IT'S VERY HARD TO BRAKE AND BRAKE LIGHT COMES ON. HAPPENED A COUPLE TIMES AND IT SEEMS TO RESET ONCE THE CAR IS SHUT OFF! VERY SCARY. HAPPENS OUT OF THE BLUE.",
        "vin": "5N3AA08C46N"
    },
    {
        "components": "SUSPENSION,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/07/2020",
        "dateOfIncident": "06/01/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11337830,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN MY CAR IS IN MOTION AND I GO OVER ANY BUMPS IT PULLS THE BACK END OF CAR MY TO THE SIDE AND BOUNCES AROUND SO MUCH THAT I ALMOST DON'T HAVE CONTROL OF MY CAR.THIS WILL PULL SO MUCH IT TAKE ME TO THE SIDE OF THE LAND IM CURRENTLY IN I HAVE TO MAKE SURE I LOOK OUT FOR BUMPS IN THE ROAD AND MAKE SURE I SLOW DOWN BELOW THE SPEED LIMIT SO I CAN KEEP CONTROL OF THE CAR. THIS CAUSES MY ABS TO TURN ON WHEN GOING OVER BUMPS BECAUSE THE CAR THINK IM NOT IN CONTROL WHICH ALSO CAUSE MORE ISSUES. THIS ALSO CAUSE A RISK AS I HAVE OTHER TRAFFIC DRIVING AROUND ME, I HAVE CHILDREN  AND I AM IN CONSTANT WORRY THAT IM NOT GOING TO BE ABLE TO SLOW DOWN TO KEEP CONTROL ESPECIALLY ON A HWY THERE IS NO SLOWING DOWN TO 20MPH ON A HWY.   2ND ISSUE MY DASHBOARD LIGHT CONTINUOUS FLICKER AND THEN GO OUT.  RPM/TACK NEEDLE HAS QUIT WORKING.  I HAVE HAD THIS REPAIRED SEVERAL TIME AND STILL HAVE THE SAME ISSUE.",
        "vin": "5N3AA08C26N"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/04/2020",
        "dateOfIncident": "02/27/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316095,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 INFINITI QX56. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 65 MPH, THE VEHICLE STARTED TO VIBRATE AND DECELERATED INDEPENDENTLY. THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THE RADIATOR FAILED WHICH CAUSED COOLANT TO MIX WITH TRANSMISSION FLUID AND CAUSED THE TRANSMISSION TO BECOME INOPERABLE. THE CONTACT WAS INFORMED THAT THE TRANSMISSION NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS 200,000.",
        "vin": "5N3AA08C06N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/01/2020",
        "dateOfIncident": "01/15/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306423,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING AT APPROXIMATELY 60 MPH ON A FREEWAY WHEN TRAFFIC AHEAD CAME TO A SUDDEN STOP. I PRESSED THE BRAKE PEDAL AND IT TRAVELED TO THE FLOOR AND I DID NOT FEEL THE CAR SLOW AT ALL. THE \"BRAKE\" DASH INDICATOR LIGHT CAME ON, AND I CONTINUED PUMPING THE BRAKE PEDAL TO TRY AND SLOW THE CAR. WHILE I CONTINUED PRESSING THE BRAKES, THE CAR STARTED SLOWING DOWN RAPIDLY ON ITS OWN AS IF IT WAS PRESSING THE BRAKES ON ITS OWN AND I COULD HEAR A LOUD GRINDING SOUND. I RELEASED THE BRAKE PEDAL AND CROSSED SEVERAL LANES OF TRAFFIC AS THE CAR WAS UNCONTROLLABLY SLOWING TO REACH THE SHOULDER. I CALLED MY HUSBAND TO TELL HIM WHAT HAD HAPPENED AND REMAINED ON THE SHOULDER WITH THE CAR RUNNING. MY HUSBAND MET ME ON THE SHOULDER AND DROVE THE CAR HOME. HE SAID THAT THE GRINDING SOUND WAS THE ABS ON IN A PERMANENT STATE, AND WOULD ACTIVATE DURING EVERY BRAKING UNLESS THE BRAKES WERE APPLIED EXTREMELY LIGHTLY. THE CAR WAS DRIVEN TO OUR DRIVEWAY AND TURNED OFF. SEVERAL HOURS LATER MY HUSBAND DROVE IT AGAIN. THE \"BRAKE\" LIGHT WAS OFF, BRAKING RETURNED TO NORMAL, AND ABS COULD BE ACTIVATED WITH HARD BRAKING AS USUAL.",
        "vin": "5N3AA08C16N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/09/2020",
        "dateOfIncident": "12/31/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11298266,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE IN MOTION THE BRAKE PEDAL FEELS LOOSE AND THERE IS A GRINDING NOISE. THE BRAKING POWER LOSES FUNCTION, THE RED BRAKE LIGHT TURNS ON AND YOU HAVE TO PULL OVER AS SAFELY AS POSSIBLE TO TURN OFF THE VEHICLE FOR IT TO RESET ITSELF.  I ONLY LEARNED THAT IT WILL RESET ITSELF WHEN YOU TURN OFF THE VEHICLE AFTER THE FIRST TIME IT HAPPENED TO ME ON A STREET. SINCE THEN IT HAS HAPPENED ON SEVERAL OCCASIONS WHILE ON THE HIGHWAY AND FREEWAY. THE FIRST TIME IT HAPPENED WAS ABOUT 2 YEARS AGO AND MOST RECENTLY 1 WEEK AGO.",
        "vin": "5N3AA08A46N"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/15/2019",
        "dateOfIncident": "10/03/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11280240,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN COMPLAINING ABOUT MY BRAKE LIGHT WARMING WHILE VEHICLE IS IN MOTION TO INFINITY FOR 13 YEARS TO INFINITY OF VANNUYS ( THE ONLY DEALER THAT SERVICES MY VEHICLE). WHY OLE THIS 6000 LB VEHICLE IS MOTION AND THIS SAFETY HAZARD OCCURS, DEPRESSING THE BRAKE PEDAL DOES. IT STOP THE VEHICLE PROMPTLY AS THE BRAKE SYSTEM SHOULD AND A LOUD METAL GRINDING NOISE IS PRODUCED. I HAVE HAD MY VEHICLE TOAD TO THE DEALER WITH THE SAME PROBLEM ON SEVERAL OCCASIONS  AND ALL I AM TOLD IS THAT THERE IS NOTHING WRONG WITH THE VEHICLE. THIS OCCURS INFREQUENTLY AND OVER THE YEARS IT HAS BEEN OCCURRING MORE FREQUENTLY. WHAT IS MORE TERRIFYING IS THAT THIS IS A PUBLIC SAFETY HAZARD THAT IS KNOWN TO NHTSA AND NISSAN/INFINITY OF AMERICA AND NO RECALL HAS BEEN ISSUED OR THE MANUFACTURER HAS NOT BEEN HELD ACCOUNTABLE FOR FIXING THIS SAFETY HAZARD. THIS HAZARD HAS OCCURRED ON SEVERAL OCCASIONS OVER THE LIFE OF OWNERSHIP ( I AM THE SOLE OWNER OF THE VEHICLE). I HAVE MADE INFINITI OF VANNUYS AWARE OF THIS ISSUE AND IT WASN'T UNTIL RECENTLY THAT MY SERVICE ADVISOR COMMUNICATED WITH ME IF HOW ALARMED  AND  CONCERNED  HE WAS WITH THE ISSUE AS HIS TECHNICIAN WAS TEST DRIVING THE VEHICLE AND THE BALEARIC LIGHT TURNED ON WHILE THE VEHICLE WAS MOVING AND MAKING THE METAL GRINDING NOISE AND NOT BEING ABLE TO BRAKE AS THE BRAKE SYSTEM IS INTENDED TO DO SO. I COMMUNICATED WITH CONSUMER AFFAIRS AT INFINITI AND WAS TOLD BY THEIR DEPARTMENT THAT THEY CANNOT DO ANYTHING FOR ME AS THERE IS NO RECALL ON MY VEHICLE AND THAT NISSAN:INFINITI IS NOT AWARE OF THIS MATTER. I MENTIONED TO THE REPRESENTATIVE THAT I HAVE BEEN ENTERTAINING THIS CONCERN WITH SERVICE ADVISORS OVER 13 YEARS AND THEY WERE FINALLY ABLE TO LISTEN TO MY CONCERNS: THIS IS UNACCEPTABLE, SPECIALLY AFTER READING ABOUT     CRUZ V. MATHENGE | NO. B286067. MY FAMILY'S LIFE AND MY OWN HAVE BEEN IN JEOPARDY OVER 13 YEARS AND I NEED HELP.",
        "vin": "5N3AA08A56N"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/15/2019",
        "dateOfIncident": "10/15/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11268775,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I AM DRIVING (PRESSING THE GAS) AN INCONSISTENT RANDOM CLICKING NOISE THAT'S AFFECTING THE BRAKE SYSTEM AND USAGE IS HEARD. IT'S DIFFICULT TO ACCELERATE. IN THE PAST, I WOULD SIMPLY TURN OFF THE VEHICLE AND TURN IT BACK ON AND THE NOISE WOULD STOP. IT WAS DIFFICULT TO EXPLAIN AND SHOW TO ANY MECHANIC BECAUSE IT DOES IT RANDOMLY AND UNEXPECTEDLY, THEREFORE IT WOULD NEVER DO IT WHEN NEEDED. I WENT ON BECAUSE IT WASN'T OFTEN AT FIRST. NOW IT'S AT AN EXTREME LEVEL AS IF THE VEHICLE DOESN'T WANT TO DRIVE AND I COULD BE ON THE HIGHWAY (YOU CAN IMAGINE HOW SCARY THAT IS AT HIGH SPEEDS).",
        "vin": "5N3AA08A36N"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/03/2019",
        "dateOfIncident": "07/03/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11229276,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 INFINITI QX56. THE CONTACT STATED THAT AS SOON AS THE VEHICLE WAS STARTED, IT SHOOK UNCONTROLLABLY AND THE TRANSMISSION WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO DETERMINED THAT THE TRANSMISSION FAILED AND NEEDED REPLACEMENT. THE CONTACT STATED THAT THE VEHICLE EXPERIENCED THE FAILURE EVER SINCE IT WAS PURCHASED ON DECEMBER 4, 2017. THE VEHICLE WAS TAKEN TO WENDLE NISSAN (8900 N DIVISION ST, SPOKANE, WA 90218) WHERE IT WAS DIAGNOSED THAT THE TRANSMISSION NEEDED REPLACEMENT. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 134,000.",
        "vin": "5N3AA08C76N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/25/2019",
        "dateOfIncident": "06/24/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11222479,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TRAVELING AT HIGHWAY SPEEDS THE EMERGENCY BRAKE LIGHT ILLUMINATED. I STARTED TO GET TO THE RIGHT HAND SIDE OF THE HIGHWAY AND SLOW DOWN. WHEN I WOULD DEPRESS THE BRAKES THERE WAS AN INCONSISTENT CLUNKING NOISE, IT WAS DIFFICULT TO BRAKE, ABS SYSTEM DIDN'T SEEM TO BE WORKING. WHEN THE BRAKES WERE NOT ENGAGED THE VEHICLE SEEMS TO BE DRIVING FINE. I WAS ABLE TO SLOW TO A STOP IN A PARKING LOT WHERE I PUT THE VEHICLE IN PARK AND PHYSICALLY ENGAGED THE EMERGENCY BRAKE. I THEN DISENGAGED THE EMERGENCY BRAKE AND THEN TURNED THE VEHICLE OFF. I GOT OUT AND CHECKED ALL OF THE BRAKES FOR VISIBLE DEBRIS AND DIDN'T SEE ANYTHING. I RETURNED TO THE VEHICLE AND STARTED IT. THE EMERGENCY BRAKE LIGHT WAS NO LONGER ILLUMINATED AND THE VEHICLE SEEMED TO BE BACK TO NORMAL.",
        "vin": "5N3AA08C46N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/04/2019",
        "dateOfIncident": "04/03/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11193800,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE OWNED THE CAR SINCE IT WAS NEW.  WHEN THE CAR IDLES FOR LONG TIME, HIGH TRAFFIC OR RUN IN A LONG DISTANCE, THE BRAKE LIGHT COMES ON, SLIP LIGHT AND THE BRAKES CHATTER AND STOPPING CAR BECOMES ALMOST IMPOSSIBLE. NUMEROUS TRIPS TO THE DEALER OVER THE YEAR  HAS PRODUCED NO FIXES....REPLACED SENSOR, BRAKE BOOSTERS, BRAKE PADS, FLUID CHANGES, IN ESSENCE PRACTICALLY AN ENTIRELY NEW BRAKING SYSTEM WITH NO POSITIVE RESULTS.  THIS IS MAJOR ISSUE!!!  I CAN NOT BELIEVE THAT NOTHING HAS BEEN DONE, LIKELY BECAUSE IT CAN NOT BE REPLICATED ON DEMAND.  SOMEONE WILL GET HURT AND THEN SOMEONE MIGHT LISTEN.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/18/2019",
        "dateOfIncident": "12/20/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11170744,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS IN MOTION ON A ROAD WHEN THE UNIVERSAL JOINT BROKE OFF, WITHOUT ANY WARNING, THEN CAUSED THE DRIVE SHAFT TO EXPLODE, UPON PULLING OVER, I DISCOVERED METAL FRAGMENTS IN THE ROAD, AND RED TRANSMISSION FLUID RUNNING OUT OF MY VEHICLE. AFTER A COMPLETE INSPECTION MY VEHICLE IS TOTALED!",
        "vin": "5N3AA08C96N"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/26/2018",
        "dateOfIncident": "12/01/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11163560,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 INFINITI QX56. THE CONTACT STATED THAT THE VEHICLE HESITATED, JERKED, LOST POWER, AND STALLED ON NUMEROUS OCCASIONS. PEARSON INFINITI (11701 MIDLOTHIAN TURNPIKE, MIDLOTHIAN, VA 23113, (804) 527-0300) INDICATED THAT THE VEHICLE WAS EXCLUDED FROM NHTSA CAMPAIGN NUMBER: 10V517000 (ENGINE AND ENGINE COOLING). THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 167,000.",
        "vin": "5N3AA08C86N"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/25/2018",
        "dateOfIncident": "11/22/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11153647,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2006 INFINITI QX56 DRIVER SIDE MANIFOLD HAS CRACKED 4 TIMES IN 6 MONTHS.  EACH TIME IT HAS CRACKED I WAS JUST DRIVING NORMAL ROAD CONDITIONS. I HAVE FIXED IT 4 TIMES AND AM CURIOUS IF THIS HAS ANYTHING TO DO WITH A PRIOR RECALL ON THE ARM SUSPENSION.",
        "vin": "5N3AA08C96N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/22/2018",
        "dateOfIncident": "09/21/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11130807,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE LIGHT KEEPS COMING OFF AND WEIRD NOISE WHEN PRESSING IT, CAR ONLY HAS 39K MILES",
        "vin": "5N3AA08C66N"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/13/2018",
        "dateOfIncident": "08/08/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11119618,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN AN INFINITI QX 56 2006. I STARTED THE VEHICLE FROM MY DRIVEWAY I NOTICED THE THE GAUGE CLUSTER SHOWING THE RMP SIDE WAS NOT MOVING AND THE COOLANT LEVEL WAS FADING. SO FAR MY SPEED IS STILL MOVING BUT I'M SCARED IT WILL STOP WORKING!!!",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/27/2018",
        "dateOfIncident": "06/26/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11104239,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE IN MOTION ATTEMPTED TO STOP AT INTERSECTION RED LIGHT. VEHICLE FAILED TO STOP. LIGHTS ON DASH BLINK, POWER LOCKS OPEN AND CLOSE ALONG WITH WINDOWS BY SELF WHILE IN MOTION AND STATIONARY. SEVERAL OCCASIONS VEHICLE WOULD NOT START. DEALER STATES \"NO ISSUES FOUND\".",
        "vin": "5N3AA08CX6N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/24/2018",
        "dateOfIncident": "04/23/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11089843,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BRAKES SOMETIMES JUST GOES CRAZY!!! THE PETAL GOES TO THE FLOOR AND IT GRINDS AND IT IS COMPLETELY OUT OF CONTROL. IT ONLY GIVES ME ONE DATE BELOW BUT IT HAS HAPPENED MULTIPLE TIMES.",
        "vin": "5N3AA08A36N"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/13/2018",
        "dateOfIncident": "02/24/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11078927,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CUSTER GAUGAE AND THE GAS HAND CONTINUES TO GO OUT HAS BEEN REPLACED 2 TIMES AND NEEDS RELPACING AGAIN.",
        "vin": "5N3AA08C66N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/27/2018",
        "dateOfIncident": "02/24/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11075179,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MULTIPLE TIMES THE BRAKES HAVE WENT OUT AND I HAVE BEEN UNABLE TO STOP THE VEHICLE. THIS HAS HAPPENED IN VARIOUS PLACES AND DURING VARIOUS CIRCUMSTANCES INCLUDING ON THE HIGHWAY AND CITY STREETS, IT HAS ALSO HAPPENED IN PARKING LOTS. THERE IS NO INDICATION, WARNING LIGHTS OR SIGNS WHEN THEY STOP WORKING,I FIND OUT WHEN I PRESS ON THE BACK AND IT MAKES A ODD SOUND ALMOST LIKE A SPRING AND A PULSATING/GRINDING FEELING WHEN I PRESS THE BREAK DOWN. NO INDICATOR LIGHTS COME ON WHEN THE BRAKES GO OUT. I AM UNABLE TO GET THE VEHICLE STOPPED DURING THIS TIME. THERE HAS BEEN NO SET REASON OR PATTERN FOR THE BREAKS GOING OUT, THEY JUST RANDOMLY STOP FUNCTIONING. NORMALLY WHEN THIS HAPPENS FOR THE PAST YEAR, AFTER I GET MY VEHICLE TO A COMPLETE STOP, I TURN THE VEHICLE OFF AND THEN BACK ON AND IT'S BACK TO NORMAL. HOWEVER THE MOST RECENT  INCIDENT WAS ON 2/24/2018 AND THE BRAKES WENT OUT 4 SEPARATE TIMES EVEN WITH TURNING THE VEHICLE OFF. I FEARED FOR THE SAFETY OF MY CHILDREN IN THE CAR AND MYSELF SO THE VEHICLE WAS RETURNED TO MY HOUSE AND NOT DROVE AGAIN UNTIL 2 DAYS LATER. INFINITI WAS NOTIFIED OF THE PROBLEM AS WELL. I AM GREATLY CONCERNED THIS WILL END UP CAUSING A VEHICLE ACCIDENT AND INJURY TO MY CHILDREN, MYSELF OR ANYONE ELSE. WHEN THIS FIRST STARTED HAPPENING I HAD BRAKES AND ROTORS CHANGED BUT PROBLEM CONTINUED. THERE IS NO RHYME OR REASON FOR WHEN THEY GO OUT AND I HAVE NO CONTROL OVER STOPPING MY QX56. THIS IS VERY CONCERNING TO KNOW IT CAN HAPPEN AT ANYTIME!",
        "vin": "5N3AA08C46N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/06/2017",
        "dateOfIncident": "10/05/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11031992,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES SUDDENLY MAKES GRINDING SOUND WHEN DEPRESSED THAT ALSO SOUNDS LIKE A LARGE SPRING IS ABOUT TO SNAP. THERE IS A LOSS OF BRAKING POWER AND THE BRAKE PEDAL GETS MUSHY. THIS HAS OCCURRED IN HEAVY STOP AND GO TRAFFIC NUMEROUS TIMES. IF THE VEHICLE IS TURNED OFF AND RESTARTED THE PROBLEM IMMEDIATELY DISAPPEARS. THE VEHICLE HAS NEW ROTORS/DISC AND NEW PADS INSTALLED BY THE DEALER. I AM IN FEAR FOR MY LIFE BECAUSE I NO LONGER TRUST THAT I WILL BE ABLE TO STOP WHEN DEPRESSING THE BRAKES. I HAVE CONTACTED THE DEALER AND THEY SAID I HAVE TO BRING IT IN WHEN THE PROBLEM IS OCCURRING.",
        "vin": "5N3AA08C06N"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/16/2017",
        "dateOfIncident": "03/16/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10966279,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I CURRENTLY OWN A 2006 INFINITI QX56 THAT I AM CURRENTLY EXPERIENCING SAFETY ISSUES WITH THAT I WILL ARTICULATE IN THE MESSAGE BELOW.  THE 2006 INFINITI QX56 CONTAINS SERIOUS DESIGN AND/OR MANUFACTURING DEFECTS WITH THEIR HEADLIGHTS THAT CAUSES THEM TO BE HIGHLY PRONE TO CONDENSATION OR MOISTURE. AS A RESULT OF THESE DEFECTIVE PARTS, INCLUDING DEFECTS IN THE HEADLAMP HOUSING, WATER AND MOISTURE ARE ABLE TO ENTER THE HEADLIGHT ASSEMBLY AND DAMAGE THE ELECTRICAL LIGHTING COMPONENTS.  THIS CAN LEAD TO SERIOUS SAFETY HAZARDS SUCH AS LOSS OF ILLUMINATION FROM ONE OR BOTH HEADLAMPS AT UNPREDICTABLE TIMES, EXPOSING DRIVERS AND THOSE WHO THEY SHARE THE ROAD WITH A SIGNIFICANT AND UNREASONABLE DANGER, INCLUDING TRAFFIC ACCIDENTS THAT CAN RESULT IN INJURY OR DEATH. VISION IS IMPAIRED DUE TO THE MOISTURE SUBSTANTIALLY CLOUDING THE ILLUMINATION WHICH IS A SAFETY ISSUE.  SAFETY ISSUES ARE EVEN MORE SUBSTANTIAL WHEN THERE IS COMPLETE LIGHTING FAILURE DUE TO THE ELECTRICAL COMPONENTS SHORTING OUT AS A RESULT OF THE WATER AND MOISTURE BUILDUP.  ***SEE ATTACHED FOR MORE DETAILS***",
        "vin": "5N3AA08C66N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/31/2017",
        "dateOfIncident": "01/30/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10948639,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR HAS THE NOTORIOUS ISSUE THAT SEEMS A LOT OF NISSAN TITAN, ARMADA, AND QX56 HAS. WHEN DRIVING, ALL IF A SUDDEN BRAKE LIGHT WILL COME ON THE DASH. ALL OF SUDDEN, WHEN I PRESS IN MY BRAKES, IT STARTS TO MAKE NOISE AND LOSES ALMOST ALL POWER IN THE BRAKING SYSTEM. LIKE THE ABS IS NOT WORKING. WHEN I TURN THE CAR OFF AND BACK ON, IT GOES AWAY TEMPORARILY BUT WILL SOON HAPPEN AGAIN. I TOOK IT TO NISSAN, AND THEY SAY THEY COULDN'T DO ANYTHING ABOUT UNLESS IT'S MALFUNCTIONING. SO THE NEXT TIME IT HAPPEN, I RISKED EVERYTHING TO DRIVE IT FROM THE HIGHWAY TO THE DEALERSHIP WITHOUT TURNING THE VEHICLE  AND OFF TO ENSURE THE ISSUE IS PRESENT WHEN AT THE DEALERSHIP. CAR HAD 75K MILES AT THE TIME. THEY THEN TOOK IT BACK AND DID SOME KING OF UPDATE OR FLASH AND EVERYTHING HAS BEEN WORKING FOR A COUPLE OF YEARS. WELL NOW IT IS BACK WHILE I WAS DRIVING MY NEWBORN TO THE CHILDREN HOSPITAL 3 HOURS AWAY. I HAD TO PUT THE CAR IN NEUTRAL ON THE HIGHWAY TO LET IT ROLL, TURN OFF THE CAR WHILE ROLLING, THEN START IT BACK UP FOR MY BRAKES TO WORK. THIS SHOULD DEFINITELY BY A SAFETY ISSUE AND RECALL TO BE FIXED. SO MANY REPORTED INCIDENTS HAVE BEEN REPORTED AND EVEN A LAWSUIT. NOW INFINITI WANTS ME TO PAY TO HAVE THE ISSUED FIX AGAIN EVEN THOUGH IT WAS TEMPORARILY FIXED FOR A COUPLE YEARS. I DON'T KNOW HOW MANY ACCIDENTS OR DEATHS ARE REQUIRED TO FOR NISSAN TO TAKE OWNERSHIP ON ALL THESE MODELS AND NOT JUST FOR WHOEVER WAS PART OF THE LAWSUIT.  *TR",
        "vin": "5N3AA08A16N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/25/2016",
        "dateOfIncident": "08/24/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10898550,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 INFINITI QX56. THE CONTACT STATED THAT THE BRAKE LIGHT RANDOMLY KEPT FLASHING. THERE WAS ALSO AN ABNORMAL NOISE PRESENT WHETHER THE BRAKE PEDAL WAS APPLIED OR NOT. THE DEALER WAS NOTIFIED OF THE FAILURE AND EXPRESSED NO CONCERN. THE VEHICLE WAS TAKEN TO A MECHANIC FOR FURTHER DIAGNOSTIC TESTING, BUT THE MECHANIC WAS UNABLE TO REPLICATE THE FAILURE. THE MANUFACTURER WAS NOT NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 117,000.",
        "vin": "5N3AA08C86N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/08/2016",
        "dateOfIncident": "08/07/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10894227,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 INFINITI QX56. WHILE DRIVING APPROXIMATELY 25 MPH DOWNHILL, THE BRAKES FAILED AND THE EMERGENCY BRAKE WARNING LIGHT ILLUMINATED. THE CONTACT HEARD AN ABNORMAL NOISE AND HAD TO DOWNSHIFT VIGOROUSLY INTO A CURB IN ORDER TO STOP THE VEHICLE. THE CONTACT SHUT OFF AND RESTARTED THE VEHICLE, AND THE BRAKING SYSTEM WAS RESET. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE MANUFACTURER PROVIDED THE CONTACT WITH INFORMATION REGARDING A CLASS ACTION LAWSUIT. THE FAILURE MILEAGE WAS APPROXIMATELY 175,000.",
        "vin": "5N3AA08C36N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/21/2016",
        "dateOfIncident": "06/20/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10875536,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN APPLYING THE BRAKES A GRINDING SOUND OCCURS. THE ABS WARNING COMES ON AND YOU REALLY DON'T HAVE CONTROL OF THE VEHICLE. IT IS REALLY SCARY. IT HAS HAPPENED  A FEW TIMES BUT YESTERDAY WAS A VERY CLOSE CALL.",
        "vin": "5N3AA08A36N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/06/2016",
        "dateOfIncident": "06/06/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10872843,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE LIGHT TURNS ON WHILE DRIVING THEN WHILE I STEP ON BRAKE SOUNDS LIKE A GRINDING NOISE. I'LL RESTART CAR AND IT WILL BE FINE. IT'S A SAFETY HAZARD BECAUSE BRAKE IS MALFUNCTIONING.. IT USUALLY HAPPENS WHEN U PUT ON REVERSE AND TURN THE WHEEL. U HAVE TO RESTART FOR IT TO GO BACK NORMAL.",
        "vin": "5N3AA08C26N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/19/2016",
        "dateOfIncident": "11/18/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10837082,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 INFINITI QX56. WHILE DRIVING 30 MPH, THE VEHICLE MADE AN ABNORMAL NOISE AFTER DEPRESSING THE BRAKE PEDAL. THE PEDAL TRAVELED TO THE FLOORBOARD AND THE VEHICLE WOULD NOT STOP. THE CONTACT WAS ABLE TO REGAIN CONTROL OF THE VEHICLE AFTER TAKING HER FOOT OFF THE BRAKE PEDAL AND STEERING INTO AN EMPTY PARKING LOT. THE BRAKE WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT COULD NOT BE DIAGNOSED. THE VEHICLE WAS NOT REPAIRED AND THE FAILURE RECURRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VIN WAS UNKNOWN. THE FAILURE MILEAGE WAS APPROXIMATELY 140,000.",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/16/2015",
        "dateOfIncident": "01/11/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10782889,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THIS VEHICLE DECEMBER OF 2014 AND WITHIN A MONTH I NOTICED CONDENSATION IN BOTH HEADLIGHTS. WHEN I WAS DRIVING MY VEHICLE HOME ONE NIGHT WITH MY 4 CHILDREN THE LIGHTS FLICKERED AND WENT OUT. I HAD TO PULL OVER AND I FLICKED THE LIGHTS ON AND OFF HOPING THEY WOULD TURN ON AND THEY CAME BACK ON AND WORKED. NOW EITHER HEADLIGHTS WORK AND TO REPLACE THE ASSEMBLY IS $1600 EACH SO RIGHT NOW I DO NOT DRIVE MY VEHICLE AT NIGHT. I TALKED TO INFINTI AND THEY STATED THERE WAS A DESIGN FLAW IN THE HEADLIGHTS AND SINCE THEN THEY HAVE BEEN REDESIGNED. I HAVE ALSO DONE RESEARCH ONLINE AND THERE HAVE BEEN SEVERAL COMPLAINTS ON THE HEADLIGHTS OF MY VEHICLE. NOW THE OTHER PROBLEM IS WHEN I'M DRIVING ON A BUMP OR POTHOLE MY VEHICLE SEEMS TO VEER OFF TO THE RIGHT AND STEERING WHEEL SEEMS TO LOOSEN UP AND IF YOU ARE GOING FAST YOU COULD LOSE CONTROL OF THE VEHICLE. LUCKILY I DON'T DRIVE FAST BUT NOTICE WITH ANY POTHOLE IT VEERS RIGHT AND I HAVE ALSO RESEARCHED THIS PROBLEM AND IT IS ALSO A COMMON COMPLAINT.",
        "vin": "5N3AA08C76N"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/23/2015",
        "dateOfIncident": "08/01/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10775322,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 INFINITI QX56. INTERMITTENTLY, WHEN DEPRESSING THE BRAKE PEDAL, THE TRACTION LIGHT AND THE BRAKE WARNING LIGHT ILLUMINATED. THE BRAKE PEDAL TRAVELED TO THE FLOORBOARD AND THERE WAS AN ABNORMAL NOISE. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THE FAILURE WAS UNABLE TO BE DETERMINED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 76,000.   UPDATED 11/18/15*LJ  THE CONSUMER STATED SHE HAD NO BRAKING ABILITY. THE VEHICLE DID NOT COME TO AN IMMEDIATE STOP. UPDATED 12/031/5.*JB",
        "vin": "5N3AA08A46N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/29/2014",
        "dateOfIncident": "07/07/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10650923,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKES GET HARD AND CANNOT STOP QUICKLY. IT GRINDS AND HAVE TO PARK AND CUT THE ENGINE OFF FOR A FEW MINUTES THEN IT WORKS AGAIN. ALMOST CAUSED A FATAL ACCIDENT. THIS IS DEFINITELY A FACTORY DEFECT DUE TO LOTS OF OWNERS ON THE NET HAVING THE EXACT SAME PROBLEM. THERE IS NO INDICATION WHEN IT ABOUT TO HAPPEN. IT HAPPENED AT LEAST THREE TIMES SINCE BUYING THIS VEHICLE USED FOR MY WIFE. THIS PROBLEM HAPPENS ALSO WITH THE NISSAN ARMADA. CONTACTED THE MANUFACTURER AND THEY DON'T SEEM CONCERNED AT ALL. THEY SAYS TO BRING IT TO YOUR LOCAL DEALER ON MY OWN EXPENSE. THIS IS AN DESIGN PROBLEM DUE TO THE AMOUNT OF COMPLAINTS FROM CUSTOMERS. I AM CONCERNED ABOUT NOT ONLY MY FAMILY SAFETY BUT OTHERS. THANKS  *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/18/2014",
        "dateOfIncident": "06/07/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10637351,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING ON THE FREEWAY AT ABOUT 60 MPH, TRAFFIC IN FRONT OF ME BEGAN TO SLOW. WHEN I APPLIED THE BRAKES, THE BREAK PEDAL ALMOST WENT TO THE FLOOR AND MADE A BANGING OR THUMPING NOISE. IT FELT LIKE THE ABS WENT OFF AND I ALMOST RAN INTO THE BACK OF THE CAR IN FRONT OF ME. THIS HAS OCCURRED MANY TIMES SINCE I HAVE OWNED THIS VEHICLE AND WHEN I TAKE IT TO THE DEALERSHIP THEY CANNOT FIND ANYTHING WRONG AND SUGGEST TO START REPLACING PARTS AT THE COST OF A FEW THOUSAND DOLLARS. THE MOST RECENT INCIDENT WAS YESTERDAY WHILE TRAVELING ON THE FREEWAY. AGAIN I HAD TO STOP SUDDENLY AS THERE WAS DEBRIS IN THE ROADWAY AND THE BRAKE PEDAL WENT TO THE FLOOR.  *TR",
        "vin": "5N3AA08C46N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/26/2014",
        "dateOfIncident": "08/06/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10628319,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "OH MY ... WHAT A BAD PROBLEM.    AFTER IDLING FOR ABOUT 10 MINUTES WHEN IT WAS ABOUT 90DEGF OUTSIDE THE \"BRAKE\" LIGHT CAME ON ... THEN WHEN TRYING TO MOVE THE BRAKES WOULD NOT WORK.  THEY HAD A VERY BAD VIBRATION IN THE PEDAL AND MADE GRINDING AND SPRING POPPING NOISES.  EVEN THOUGH GOING SLOW (<30 MPH) THE CAR WOULD BARELY STOP.  I CANNOT IMAGINE THIS HAPPENING AT HIGHWAY SPEEDS.  VERY DANGEROUS.  TURNING THE CAR OFF AND THEN BACK ON RESOLVED THE PROBLEM, BUT I AM VERY CONCERNED THAT THIS IS GOING TO HAPPEN AGAIN AT A VERY BAD TIME.  THE BRAKE PADS AND ROTORS WERE CHECKED AND THEY ARE FINE.  THERE NEEDS TO BE A DEFINITIVE FIX AND RECALL FOR THIS DANGEROUS ISSUE.  *TR",
        "vin": "5N3AA08C16N"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/13/2014",
        "dateOfIncident": "04/01/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10622082,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR EMERGENCY BRAKE LIGHT CAME ON, THE VDC, AND SLIP LIGHT FLASHES AND THE CAR LOSES BRAKE POWER, FELT LIKE PADS WERE GONE BUT THEY WERE NOT. ONCE THE CAR WAS TURNED OFF AND BACK ON LIGHTS WENT AWAY AND BRAKES CAME BACK.  WE HAVE HAD BRAKES REPLACED, AND PROBLEM CONTINUED.  ALSO THE SERVICE ENGINE SOON LIGHT CAME ON AND A MECHANIC TOLD US WE NEEDED NEW CATALYTIC CONVERTERS AND THE SERVICE ENGINE SOON LIGHT IS STILL ON AND OFF.  BRAKE ISSUE AND LIGHT COMING ON HAS HAPPENED NUMEROUS TIMES AND IT DOES NOT MAKE A DIFFERENCE WHERE OR WHAT SPEED.  I HAVE BEEN DRIVING DOWN THE INTERSTATE, IN THE NEIGHBORHOOD, PARKED, ETC.  IT IS HAPPENING MORE FREQUENTLY AND WE HAVE HAD IT CHECK OUT BY MULTIPLE MECHANICS AND THEIR DIAGNOSTICS ARE NOT PICKING UP ANYTHING THAT IS WRONG.  I HAVE 3 SMALL CHILDREN AND FEEL LIKE I AM GOING TO HAVE A PANIC ATTACK EVERY TIME WE GET INTO THE CAR.  WHY IS THERE NO RE-CALL YET?!  IF YOU ARE CONSIDERING BUYING THIS CAR RUN AND DO NOT BUY!  *TR",
        "vin": "5N3AA08A96N"
    },
    {
        "components": "EQUIPMENT ADAPTIVE/MOBILITY,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/06/2014",
        "dateOfIncident": "05/17/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10619269,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY INFINITY QX 56 TRUCK BRAKE PEDAL STARTS TO VIBRATE AND MAKE LOUD SPRING NOISES, NEXT THE VEHICLE WILL BEGIN TO PULSATE VIOLENTLY DURING BRAKING AND MAKE A LOUD GRINDING NOISE WITH AN EXTENDED BRAKING RESPONSE (NEARLY CAUSING ME TO CRASH INTO TRAFFIC AHEAD OR IN FRONT OF ME). THE VEHICLE DEFECTIVELY TURNS ON THE ABS AND BRAKE LIGHT WARNINGS IN THE DASHBOARD WHILE USING BRAKES TO STOP AT STOP SIGNS, RED LIGHTS, OR TO MAKE TURNS BEHIND OTHER TRAFFIC. THIS ACTIVATION IS RANDOM WITHOUT CAUSE OR OCCURRENCE.   I AM TERRIFIED TO DRIVE MY INFINITY 2006 QX56. I HAVE EXPERIENCED MULTIPLE NEAR DEATH CAR ACCIDENTS. I HAVE BEEN DEALING WITH THIS PROBLEM FOR ABOUT A YEAR. WAS TOLD IT WAS THE BRAKES (CHANGED THEM), WAS TOLD IT WAS THE ROTORS (CHANGED THEM), WAS TOLD IT WAS THE MASTER CYLINDER (CHANGED IT) WITH NO RESOLVE. PROBLEMS STILL EXISTS. FINALLY, INFINITY ADMITS ITS A MALFUNCTION IN MY DELTA SENOR. MALFUNCTION TO ME SOUNDS LIKE A DEFECTIVE PART AND THAT IS NOT MY $1500 BULLET TO BITE!   *TR",
        "vin": "5N3AA08C66N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/04/2014",
        "dateOfIncident": "10/17/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10596247,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE ATTEMPTING TO SLOW MY VEHICLE , WITH 8 PASSENGERS, THE BRAKES STARTED TO ACT ERRATICALLY. THERE WAS NO WAY TO SLOW THE VEHICLE IN A CONTROLLED MANNER. EITHER THE BRAKING WAS TOO HARD OR TOO SOFT ALMOST LEADING TO A COLLISION. I TOOK MY VEHICLE TO THE INFINITI DEALER THAT I PURCHASED IT FROM NEW. THEY REPLACED THE BRAKE BOOSTER AT A COST OF OVER $900 DOLLARS. THIS WAS IN OCTOBER OF 2012. 10, 000 MILES LATER IN MAY OF 2014, THE EXACT SAME BRAKING ISSUE AGAIN HAPPENED WITH MY VEHICLE FULLY LOADED WITH PASSENGERS. I TOOK IT TO THE LOCAL NISSAN DEALERSHIP AND THEY ARE SAYING THAT THE SAME PARTS NEED TO BE REPLACED NOW AT A COST OF OVER $1400 . THIS IS A MAJOR SAFETY ISSUE AND IS IN NO WAY RELATED TO NORMAL MAINTENANCE.   *TR",
        "vin": "5N3AA08A06N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/29/2014",
        "dateOfIncident": "01/10/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10585600,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE SLOWLY DOWN FOR A RED LIGHT MY VEHICLE BEGAN TO LOSE BRAKING AND THERE WAS POPPING AND GRINDING NOISES COMING FROM THE BRAKES. LUCKILY THERE WAS NOT A CAR IN FRONT  OF ME AND AS I WAS ABLE TO DRIVE ALONG THE CURB TO FINALLY SLOW THE VEHICLE AND LUCKILY STOPPED BEFORE BEING IN THE MIDDLE OF THE INTERSECTION . BACK IN 2010 INFINITI CHANGED OUT THE BRAKE BOOSTER AND DELTA SENSOR WHEN THIS SAME OCCURRENCE HAPPENED WITH THE BRAKING SYSTEM. NOW 4 YEARS LATER IT HAPPENED AGAIN WHICH MEANS THEY ARE STILL INSTALLING A FAULTY PART. IT IS AT THE DEALERSHIP NOW AND BECAUSE IT IS OUT OF WARRANTY THEY WILL NOT COVER THE $2100 JOB ALTHOUGH THEY ADMIT THIS IS A NORMAL OCCURRENCE IN THIS VEHICLE.    *JS",
        "vin": "5N3AA08A66N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/09/2014",
        "dateOfIncident": "05/17/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10578445,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING WHEN I APPLIED BRAKES . THE BRAKE LIGHT CAME ON AND BRAKE PEDAL FELT SOFT NOT FIRM,  VEHICLE DIDN'T COME TO A STOP. HAD TO DRIVE ON THE SIDE OF THE ROAD TOWARDS A HILL . I APPLIED BRAKES AGAIN BUT THE CARE WOULD BARELY BRAKE . I TURN THE KEY OFF AND TURN THE CAR BACK ON. BRAKES WORKED AGAIN. THIS HAS HAPPEN MULTIPLE TIMES AND DEALER TOLD ME . THAT THEY ARE AWARE OF THE PROBLEM BUT SINCE IT'S NOT A RECALL I WOULD HAVE TO PAY FOR REPAIRS. THEY QUOTED ME 1800 FOR THE REPAIR.  *TR",
        "vin": "5N3AA08C86N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/06/2014",
        "dateOfIncident": "02/05/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10563283,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING AND APPROACHING A STOP LIGHT.  WHEN I DEPRESSED THE BRAKE PEDAL I HEARD A GRINDING NOISE BUT THE CAR WOULD NOT STOP ALL THE WAY.   I PUMPED THE BRAKES AND ATTEMPTED TO STOP BUT IT WOULD NOT.  LUCKILY THE LIGHT THEN CHANGED AND I DID NOT HAVE TO STOP.  I THEN APPROACHED ANOTHER LIGHT AND THE SAME THING HAPPENED.  AT THE LAST MINUTE, THE CAR STOPPED.    I TOOK IT TO THE DEALER.  THEY ARE CHARGING ME $969 TO REPLACE THE BRAKE BOOSTER/DELTA SENSOR.  THIS IS A KNOWN PROBLEM AND I THINK THAT A RECALL SHOULD BE DONE.  THIS IS VERY DANGEROUS.  *TR",
        "vin": "5N3AA08A26N"
    },
    {
        "components": "EXTERIOR LIGHTING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/10/2014",
        "dateOfIncident": "01/01/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10559342,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I'M FIRST OWNER OF 2006 INFINITE QX56 AND 47,000 MILES ON JAN/2014.  LOTS OF QX56/ARMADA MODEL'S 3RD BACK BRAKE LIGHT (HIGH MOUNT STOP LIGHT) WAS PROBLEMS OR NOT WORKING BECAUSE MANUFACTURER DESIGNED BRAKE LIGHT WITH WINDOW WASHER NOZZLE IN ONE PART. CAN U UNDERSTAND ELECTRIC PART & WATER USING PART TOGETHER. ALSO, IT IS VERY HARD TO REPLACE BY OWNER AND DEALER REPLACEMENT COST IS VERY EXPENSIVE TOO BEC OF WHOLE LED PANEL INSTEAD OF REGULAR BULB. DEALER SERVICE GUY SAID LOT OF THE SAME PROBLEMS TOO (PART NO. 26590-7S000, QX56: 2004~2010, ARMADA: 2004~2012 MODELS). PLEASE REVIEW THESE PROBLEMS FOR RECALL.  *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/29/2013",
        "dateOfIncident": "12/16/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10557647,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON 12/15/13 AND EMERGENCY BRAKE ICON CAME ON I TRIED TO PRESS BRAKES AND GRINDING NOISE CAME FROM FRONT WHEN I PRESSED BRAKE WHEN  I RELEASED BRAKE AND PUMPED AGAIN AND HAD TO DO NUMEROUS TIMES AND CAR WOULD NOT STOP. I HAD TO GO OFF THE ROAD ONTO GRASS AND CAR FINALLY SLOWED DOWN. I TURNED OFF CAR AND EMERGENCY ICON WAS OFF AND BRAKES WORKED LIKE NOTHING HAPPENED. TODAY AT 12/29/13 SAME THING HAPPEN LUCKILY NOW I WAS ONLY GOING 15 BECAUSE IN A RESIDENTIAL NEIGHBORHOOD. I WAS WITH MY 2 CHILDREN THIS IS VERY SCARY BECAUSE CAR DOESN'T WANT TO STOP WHEN THIS HAPPENS. I'M SCARED TO DRIVE THE CAR IN HIGHWAY NOW!  *TR",
        "vin": "5N3AA08C36N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/12/2013",
        "dateOfIncident": "08/18/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10555844,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FIRST INSTANCE OCCURRED IN AUGUST OF 2012. WE WERE TRAVELING ON THE HWY AND WERE REDUCING SPEEDS FROM 65 TO EXIT THE RAMP. UPON APPLYING THE BRAKES THE EMERGENCY BRAKE LIGHT CAME ON AND STARTED FLASHING. WHEN THE BRAKES WERE APPLIED A METAL ON METAL SENSATION OCCURRED, AS IF THERE WERE NO BRAKE PADS LEFT ON THE VEHICLE AND METAL WAS GRINDING. WHEN THE BRAKE WAS RELEASE IT STOPPED, BUT THE VEHICLE COULD NOT BE STOPPED BY USING THE BRAKES. WE HAD TO COAST INTO A PARKING LOT AND COME TO A COMPLETE STOP. THE VEHICLE WAS THEN PUT INTO PARK, SHUT OFF. THE EMERGENCY BRAKE WAS APPLIED AND RELEASED (IT WAS NEVER ENGAGED BEFORE). ONCE THE CAR WAS RESTARTED THE LIGHTS WERE OFF AND THE BRAKES WERE IN STANDARD, NORMAL WORKING CONDITION.   THE SECOND INCIDENT HAPPENED IN MARCH OF 2013. THE INCIDENTS ARE NOW FOR FREQUENT AND HAPPEN MONTHLY. SEVERAL TIMES WE HAVE BEEN IN TRAFFIC ON THE HIGHWAY AND HAVE HAD TO BRAKE QUICKLY DUE TO ROAD WORK, TRAFFIC, ETC AND HAVE SLIMLY MISSED HAVING AN ACCIDENT.   BECAUSE WE CANNOT REPLICATE THE INCIDENT ON DEMAND THE INFINITI DEALERSHIPS CLAIMS THEY CANNOT DIAGNOSE OR EVEN FIX THE PROBLEM.   THE BRAKING SYSTEM IS UNRELIABLE AND HAZARDOUS. I HAVE DONE THE PROPER MAINTENANCE ON MY VEHICLE BY HAVING BRAKE PADS REPLACED WHEN NECESSARY BECAUSE I AM A RESPONSIBLE OWNER. AT ANY GIVEN TIME I HAVE 3 CHILDREN IN MY VEHICLE AND AM GROWING MORE AND MORE CONCERNED TO DRIVE MY CAR IF THE BRAKES ARE NOT RELIABLE.   *TR",
        "vin": "5N3AA08C66N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/31/2013",
        "dateOfIncident": "09/30/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10550367,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 INFINITI QX56. THE CONTACT STATED THAT WHILE DEPRESSING THE BRAKE PEDAL, HE NOTICED AN ABNORMAL GRINDING SOUND. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT INSPECTED OR REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 171,874.",
        "vin": "5N3AA08C66N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/11/2013",
        "dateOfIncident": "08/11/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10547676,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 INFINITI QX56.  THE CONTACT STATED THAT THE BRAKING SYSTEM WOULD EXHIBIT ABNORMALLY LOUD NOISES.  AFTER INSTALLING NEW BRAKE PADS, THE NOISES CONTINUED AND THE BRAKE WARNING LIGHT WOULD ILLUMINATE CONSTANTLY.  THERE WAS ALSO A GRINDING SOUND COMING FROM THE BRAKES.  THE VEHICLE WAS TAKEN TO A CERTIFIED MECHANIC, WHO INSTALLED NEW BRAKE PADS. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE.  THE VIN WAS UNKNOWN. THE FAILURE AND CURRENT MILEAGE WAS 95,000.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/27/2013",
        "dateOfIncident": "09/01/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10545678,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WE CONTINUE TO EXPERIENCE INTERMITTENT BRAKE FAILURE 2006 INFINITI QX 56.WE HAVE CONTACTED OUR LOCAL DEALERSHIP WHICH IS INFINITI OF MISSION VIEJO IN SOUTHERN CALIFORNIA. VISE DOES NOT SIMPLY REPROGRAMMING THE BREAK COMPUTER WILL NOT BE A PERMANENT FIX AND THAT WE MUST I REPLACE THE BRAKE BOOSTER WHICH CONTAINS THE DELTA SENSOR. THIS WILL RESULT IN AN APPROXIMATE COST OF $1000 FOR US. OUR INSISTENCE DECLARING THAT THIS IS CLEARLY A MANUFACTURER DEFECT SHOULD BE REPAIRED AND REPLACED FREE OF CHARGE TO THE IN CONSUMER BY THE MANUFACTURER. THE SERVICE REP BECAME ANNOYED AND SIMPLY TOLD US THAT YOU CAN TRANSFER US TO THE PARTS DEPARTMENT TO GET THE PRICE ON THE NEW BRAKES. AGAIN THIS REPAIR IS GOING TO COST US NEARLY $1,000. WE WILL BE JOINING A CLASS ACTION LAWSUIT THAT HASN'T FILED HERE IN CALIFORNIA.  *TR",
        "vin": "5N3AA08A26N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/10/2013",
        "dateOfIncident": "09/09/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10542809,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE I PURCHASED MY QX56 2006, IT HAS HAPPEN SEVERAL TIMES, I THINK APPROXIMATELY 10TIMES, I GOT SCARED AT THE BEGINNING AND FREAKED OUT, ALL MY FAMILY WAS WITH ME AND WE DIDN'T KNOW WHAT TO DO, ALL I DID WAS TURN THE CAR OFF AND WAIT FOR A MINUTE THEN I DID TURN THE CAR ON AND THE PROBLEM WAS GONE, I'M NOT THE ONLY PERSON THAT HAS THIS HAPPEN AND HOPE THAT YOU GUYS DO SOMETHING ABOUT IT THE ONLY BIG PROBLEM I THINK IS THAT I'M AFRAID THAT IF THIS HAPPEN AGAIN AND I WILL NOT BE ABLE TO STOP MY CAR AND WILL CAUSE DEATH BY HITTING SOMEBODY, I HAD A SMALL INCIDENT BUT THERE WAS NO BIG DAMAGE AND THE CAR IN FRONT OF ME HEARD THE NOISE BUT WE DIDN'T FILL A REPORT IF YOU HAVE ANY QUESTIONS, YOU HAVE MY VIN # AND YOU CAN FIND ME I HOPE THAT NISSAN DOES SOMETHING ABOUT THIS. *TR",
        "vin": "5N3AA08A76N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/15/2013",
        "dateOfIncident": "09/28/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10519959,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS EXITING THE STORE PARKING LOT, I HEARD A PING SOUND WHILE I PRESSED ON THE BRAKES.  MY CAR EVENTUALLY CAME TO A STOP AFTER SEVERAL PUMPS OF THE BRAKES.  I TURNED THE ENGINE OFF AND AFTER A FEW MINUTES, I STARTED THE CAR AND PROCEEDED TO DRIVE LESS THAN A MILE AND LOST THE ABILITY TO BRAKE AGAIN AS I APPROACHED A RED LIGHT.  THE CAR SOUNDED LIKE A LARGE SPRING WAS GOING TO BREAK AND I HEARD A RAPID POPPING SOUND WHILE TRYING TO PRESS ON THE BRAKES.  THE FRONT END SOUNDED LIKE IT WAS GRINDING AND THE RED BRAKE LIGHT CAME ON.  THE LIGHT TURNED GREEN AND THE CAR IN FRONT OF ME STARTED MOVING RIGHT BEFORE I GOT TO IT. I MADE A SHARP RIGHT TURN WITHOUT BRAKES AND COASTED MY CAR TO A STOP AT A GAS STATION.  I TURNED OFF THE ENGINE AND CALLED A TOW TRUCK.  I HAD IT TOWED TO THE BRAKE STORE SINCE THEY JUST REPLACE THE BRAKES A MONTH BEFORE.  THEY DID A FULL INSPECTION, SEVERAL TEST DRIVES AND WERE UNABLE TO DUPLICATE THE PROBLEM.  THEY SAID THE BRAKES WERE IN PERFECT ORDER.  IT WAS A CLEAR SUNNY DAY AND THE ROAD WAS REGULAR PAVEMENT FREE OF DEBRIS.  I THOUGHT I WAS NUTS AND THEN I THOUGHT THE BRAKE STORE WAS LYING TO ME.  I HAD JUST DROPPED MY KIDS OFF.  IF THAT LIGHT HAD NOT TURNED GREEN WHEN IT DID, I WOULD HAVE REAR ENDED THAT CAR GOING 30 MPH.  IT WOULDN'T BE UNTIL JUNE 2013 WHEN I REALIZED THAT THIS IS A COMMON ISSUE WITH THE QX AND ARMADAS AND IS NOT A PROBLEM WITH THE BRAKES RATHER WITH THE BRAKE BOOSTER AND DELTA S SENSOR.  I AM FILING ANOTHER COMPLAINT THAT WILL BE DATED JUNE 6 2013.  IF THIS PROBLEM IS NOT ADDRESSED BY NISSAN MOTOR CORP, SOMEONE IS GOING TO BE SERIOUSLY HURT OR COULD DIE.  THIS WAS AN EXTREMELY FRIGHTENING AND HELPLESS FEELING.  I KEEP MY CAR IN GREAT WORKING ORDER AND MAINTAIN IT AS IT SHOULD BE.  THIS IS NOT A ROUTINE MAINTENANCE THING; THIS IS A SERIOUS SAFETY ISSUE THAT NISSAN NEEDS TO ADDRESS!  *TR",
        "vin": "5N3AA08A06N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/15/2013",
        "dateOfIncident": "06/06/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10519963,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS ON MY WAY TO PICK UP MY KIDS ON A CLEAR SUNNY EVENING AND WAS DRIVING ON REGULAR DEBRIS FREE PAVEMENT.  AS I APPROACHED A SOLID YELLOW LIGHT, I PRESSED THE BRAKES AND HEARD/FELT A PINGING SOUND AND THE BRAKES WOULD NOT STOP THE CAR.  THE FRONT END OF THE CAR WAS GRINDING AND IT SOUNDED LIKE A LARGE SPRING WAS GOING TO BREAK.  I PUMPED THE BRAKES WHILE SCREAMING AND COULD NOT GET THE CAR TO STOP.  THE LIGHT TURNED RED AND I HAD TO BURN THROUGH IT, FORTUNATELY WITHOUT COLLISION.  I CONTINUED WITH NO BREAKS FOR THE NEXT 5 MILES AND DID NOT USE MY ACCELERATOR.  I BURNED THROUGH ANOTHER SOLID YELLOW LIGHT.  EVENTUALLY THE CAR WAS GOING SLOW ENOUGH THAT I USED MY EMERGENCY BRAKE TO COME TO A COMPLETE STOP.  I TURNED THE ENGINE OFF AND CALLED MY HUSBAND.  HE CAME FOR ME AND DROVE THE CAR HOME WITHOUT EXPERIENCING WHAT I JUST DID. THIS SAME THING HAPPENED ON 09/28/2012, WHICH I FILED A COMPLAINT FOR.  AFTER DOING INTERNET RESEARCH THAT NIGHT, I FOUND THIS IS A COMMON PROBLEM WITH THE QX AND ARMADAS AND WHEN THE ENGINE IS TURNED OFF, IT CAN RESET THE COMPUTER AND TEMPORARILY FIX THE PROBLEM.  THE NEXT DAY, THE INFINITI DEALERSHIP FOUND AND REPAIRED ERROR CODES C1179 DELTA SENSOR AND C1189 BREAK BOOSTER AND RESET THE COMPUTER.  IT WAS COVERED UNDER MY EXTENDED WARRANTY WITH A DEDUCTIBLE AND THEY ASSURED ME THIS WILL FIX THE ISSUE.  THIS IS THE SECOND TIME I HAVE EXPERIENCED THIS VERY HELPLESS AND FRIGHTENING EVENT.  THIS IS A SERIOUS PROBLEM THAT NISSAN MOTOR CORP NEEDS TO ADDRESS.  IT IS A SAFETY ISSUE AND NOT A ROUTINE MAINTENANCE ISSUE.  THERE NEEDS TO BE A RECALL BEFORE SOMEONE DIES.  I FOUND HUNDREDS OF COMPLAINTS ALL OVER THE INTERNET AND A CLASS ACTION LAWSUIT FILED IN 2011 FOR THIS VERY SAME ISSUE.  I AM VERY FORTUNATE THAT NO ONE WAS INJURED OR KILLED IN MY EXPERIENCES, BUT THE EXPERIENCE HAS LEFT ME NERVOUS EVERY TIME I PRESS MY BRAKES.  *TR",
        "vin": "5N3AA08A06N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/14/2013",
        "dateOfIncident": "06/10/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10519900,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE I PURCHASED MY QX56 2006, IT HAS HAPPEN SEVERAL TIMES, I THINK APPROXIMATELY 40 TIMES, I GOT SCARED AT THE BEGINNING AND FREAKED OUT, ALL MY FAMILY WAS WITH ME AND WE DIDN'T KNOW WHAT TO DO, ALL I DID WAS TURN THE CAR OFF AND WAIT FOR A MINUTE THEN I DID TURN THE CAR ON AND THE PROBLEM WAS GONE, I'M NOT THE ONLY PERSON THAT HAS THIS HAPPEN AND HOPE THAT YOU GUYS DO SOMETHING ABOUT IT  THE ONLY BIG PROBLEM I THINK IS THAT I'M AFRAID THAT IF THIS HAPPEN AGAIN AND I WILL NOT BE ABLE TO STOP MY CAR AND WILL CAUSE DEATH BY HITTING SOMEBODY, I HAD A SMALL INCIDENT BUT THERE WAS NO BIG DAMAGE AND THE CAR IN FRONT OF ME HEARD THE NOISE BUT WE DIDN'T FILL A REPORT    IF YOU HAVE ANY QUESTIONS, YOU HAVE MY VIN # AND YOU CAN FIND ME    I HOPE THAT NISSAN DOES SOMETHING ABOUT THIS.  *TR",
        "vin": "5N3AA08C86N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/08/2013",
        "dateOfIncident": "06/05/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10515808,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING WITH MY FAMILY IN THE CAR AND EXITING OFF THE HIGHWAY. WHEN TRIED TO STOP FOR APPROACHING TRAFFIC MY BRAKE WARNING LIKE CAME ON THE BRAKE PEDAL BECAME UNRESPONSIVE. AS I PRESSED THE BRAKES I COULD HEAR A BROKEN SPRING KIND OF SOUND AND IT FELT LIKE THE ABS SYSTEM WAS TRYING TO KICK ON. THE CAR DID SLOW BUT THE BRAKES WERE AT ABOUT 20%. TO AVOID HITTING THE APPROACHING CARS I HAD TO SWERVE OFF THE ROAD. WE WERE ABLE TO GET THE CAR TO A STOP BUT CLEARLY WOULD HIT THE CARS IN FRONT OF ME IF I WERE NOT ABLE TO GET OFF THE ROAD. WHILE WE DID NOT HAVE A CRASH I DID NOTICE TWO LARGE SCRAPES ON THE RIGHT SIDE OF THE CAR FROM RUBBING AGAINST THE RAIL WHICH I DID NOT NOTICE TILL LATE THE DAY AFTER.     AFTER TURNING OFF THE CAR THE BRAKES WORKED LIKE NOTHING EVER HAPPENED. WE TOOK THE TO A LOCAL DEALERSHIP THE NEXT MORNING AND WE TOLD THAT \"YEA THAT HAS BEEN HAPPENING\" WITH THAT MODEL. WHEN I SEARCHED THE INTERNET FOR THE ERROR CODE I WAS GIVEN (C1179) I FOUND ALMOST 200 HUNDRED PEOPLE WITH A SIMILAR STORY TO MINE. MY VEHICLE HAS BEEN DEALER SERVICED WITH EVERY RECOMMENCED SERVICE. WHILE I UNDERSTAND THAT CARS ARE MACHINES AND THEY DO FAIL,  BRAKES FAILING LIKE THIS DUE TO A BAD SENSOR IS A DEATH WAITING TO HAPPEN. AS A LOYAL NISSAN/INIFINITI CUSTOMER I AM VERY DISAPPOINTED THAT THIS WELL DOCUMENT ISSUE HAS NOT BEEN PROACTIVELY ADDRESSED.     FOR THOSE READING THIS AT THE NHTSA PLEASE UNDERSTAND THAT SOMEONE WILL DIE DUE TO ISSUE. REVIEW THE 16 CLAIMS ON YOUR SITE TODAY, IT IS JUST A MATTER OF TIME. LAWYERS WONT TOUCH THIS UNLESS YOU HAVE A SEVERE PERSONAL INJURY AND NISSAN WONT ACT TILL LAWYERS TAKE SUIT...YOU DO THE UNFORTUNATE MATH.     NISSAN/INIFINITI - I JUST EXPECT MORE.  *TR",
        "vin": "5N3AA08A06N"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/03/2013",
        "dateOfIncident": "10/01/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10514789,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 INFINITI QX56. THE CONTACT STATED THAT THERE WAS WATER AND MOISTURE ACCUMULATION IN BOTH HEADLAMPS AS RESULT OF A SHORTAGE IN THE CONTROL DEVICE WIRING. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHERE THE VEHICLE HAD BEEN REPAIRED ON TWO SEPARATE OCCASIONS FOR THE SAME DEFECT. THE MANUFACTURER WAS NOTIFIED OF THE PROBLEM. THE APPROXIMATE FAILURE MILEAGE WAS 66,000. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/30/2013",
        "dateOfIncident": "05/27/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10514341,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 INFINITY QX56. THE CONTACT STATED THAT THE BRAKE LIGHTS ILLUMINATED WHILE DRIVING AT APPROXIMATELY 30 MPH. IN ADDITION, THE BRAKES WOULD EXHIBIT AN ABNORMAL GRINDING.  THE VEHICLE WAS POWERED OFF AND WHEN RESTARTED, RESUMED NORMAL OPERATION.  THE VEHICLE WAS TAKEN TO THE DEALER FOR FURTHER INSPECTION. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE.  THE FAILURE AND CURRENT MILEAGE WAS 128,000.",
        "vin": "5N3AA08C36N"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/22/2013",
        "dateOfIncident": "04/01/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10504139,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MULTIPLE/NUMEROUS INCIDENTS:    WHILE AT BOTH HIGH SPEEDS (HIGHWAY) AND LOCAL DRIVING THE DASHBOARD FLICKER AND THE ABS LIGHT COMES ON FOLLOWED BY LOSS OF BRAKING, GROANING/GRINDING NOISE AND INABILITY TO CONTROL THE VEHICLE SPEED.    THIS HAS OCCURRED NUMEROUS (>20) TIMES AND THE ONLY RESOLUTION IS TO PULL OVER, STOP THE VEHICLE AND THEN RESTART THE IGNITION TO RESET THE BRAKING SYSTEM.    IN ADDITION, WE HAVE LOST BRAKES TWICE THAT RESULTED IN THE VEHICLE TRAVELLING THROUGH A RED LIGHT AT A 4 WAY INTERSECTION.    THERE IS AN INFINITI TECHNICAL SERVICE BULLETIN RELATED TO THE ISSUE (ITB-06-011 AND ITB-10-074) HOWEVER THE DEALER HAS BEEN UNABLE TO RESOLVE THE ISSUE FOLLOWING THESE PROCEDURES.   A COMPLAINT WAS FILED WITH INFINITI CONSUMER AFFAIRS (CASE[XXX]) HOWEVER AFTER REVIEWING THEY HAVE REFUSED TO PROVIDE ANY FURTHER ASSISTANCE IN THE MATTER.      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *TR",
        "vin": "5N3AA08C26N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/29/2012",
        "dateOfIncident": "10/20/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10477963,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS TRAVELING AT APPROX 40MPH IN DRY CONDITIONS ON A GOOD ROAD SURFACE AND APPROACHING TRAFFIC LIGHTS AT AN INTERSECTION.  APPLIED THE FOOT BRAKE LIGHTLY AND IMMEDIATELY NOTICED THE BRAKE PEDAL TRAVEL WAS SIGNIFICANTLY INCREASED.  GROANING & GRINDING NOISES EMANATED FROM FRONT END AND COULD BE FELT THROUGH THE BRAKE PEDAL.  IT WAS AS IF THE ABS HAD ENGAGED EVEN THOUGH THE CAR WAS BRAKING GENTLY ON A GOOD, DRY ROAD SURFACE.  GLANCING AT THE DASHBOARD I NOTICED THE BRAKE LIGHT WAS ILLUMINATED.  RUNNING OUT OF STOPPING DISTANCE, I TRIED PUMPING THE BRAKES AND NOTICED A \"RAPID POPPING\" NOISE AS THE BRAKE PEDAL WAS TRAVELING BACK UP.  BRAKE EFFICIENCY WAS SIGNIFICANTLY REDUCED BUT THE VEHICLE DID COME TO A STOP ALBEIT IN AN UNCONTROLLED AND DANGEROUS MANNER.   AFTER TRAFFIC LIGHTS CHANGED, I PULLED OVER THE INTERSECTION TO STOP ON THE SIDE OF ROAD AND THE SAME PROBLEM RE-OCCURRED.  THE PROBLEM VANISHED AFTER SWITCHING OFF THE ENGINE AND DESPITE TRYING FOR SEVERAL HOURS THE FOLLOWING DAY ON AN EMPTY ROAD; I COULD NOT REPRODUCE THE PROBLEM.  INFINITI DEALER INVESTIGATED BUT FOUND NO DTC CODE AND STATED A KNOWN SOFTWARE PROBLEM WAS NOT THE CAUSE (VERSION WAS ALREADY UP-TO-DATE).  DEALER WAS UNABLE TO REPRODUCE THE PROBLEM.  FOLLOWING THAT FIRST INCIDENT, THE PROBLEM RANDOMLY RE-OCCURRED APPROXIMATELY 1 TIME EVERY 3 MONTHS - EACH TIME A STOP / RESTART OF THE ENGINE WOULD RESOLVE THE PROBLEM.    TESTING BRAKE FUNCTION DURING SUBSEQUENT OCCURRENCES OF THE PROBLEM REVEALED THAT EMERGENCY BRAKE FUNCTION WAS SERIOUSLY DEGRADED AND OVERALL STOPPING DISTANCE INCREASED BY MORE THAN DOUBLE.    IN THE LAST SEVERAL MONTHS THE FREQUENCY OF THE PROBLEM HAS INCREASED TO THE POINT IT NOW OCCURS SEVERAL TIMES A WEEK.  THE PROBLEM APPEARS MORE FREQUENTLY DURING THE HOT / SUMMER MONTHS.  *TR",
        "vin": "5N3AA08A86N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/19/2012",
        "dateOfIncident": "07/18/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10466565,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "PULLING OUT OF NEIGHBORHOOD ON BUSY HIGHWAY 34 MPH.  BRAKE FAILURE, LOUD GRINDING AND BRAKE LIGHT CAME ON.  ABLE TO AVOID ONCOMING TRAFFIC BY PULLING ONTO SIDE OF ROAD.  TURN CAR OFF AND BACK ON AND HAS BREAKS BACK BUT VERY SCARED. *TR",
        "vin": "5N3AA08C66N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/14/2012",
        "dateOfIncident": "07/01/2007",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10461722,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 INFINITI QX56. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS OR STARTING THE VEHICLE, THE BRAKE WARNING LIGHT ILLUMINATED AND THERE WAS A GRINDING SOUND. THE CONTACT WAS UNABLE TO BRAKE AND HAD TO DEPRESS THE BREAK PEDAL ALL THE WAY TO THE FLOOR BOARD. THE VEHICLE WOULD PULL AND JERK BEFORE FINALLY STOPPING. THE CONTACT STATED IN ORDER TO RESOLVE THE FAILURE HE WOULD CHANGE THE GEAR TO PARK, TURN THE VEHICLE OFF AND RESTART THE VEHICLE.  THE VEHICLE WAS TAKEN TO THE DEALER HOWEVER DEALER WAS UNABLE TO PROVIDE DIAGNOSTIC BECAUSE FAILURE IS NOT PRESENT AT MOMENT. THE FAILURE OCCURS RANDOMLY AND CONSISTENTLY. THE CURRENT MILEAGE WAS 151,000. THE FAILURE MILEAGE WAS 26,000.",
        "vin": "5N3AA08C86N"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/04/2012",
        "dateOfIncident": "11/07/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10442434,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE LIGHT CAME ON AND SLIP LIGHT AS WELL CAR COULDN'T BREAK AT ALL . THAN ONE DAY TO ANOTHER THE PROBLEM WENT AWAY , THAN CAME BACK THEN BACK TO NORMAL. NOW I HAVE LIKE 2 MONTH WITH THE LIGHTS ON  AND I STILL HAVE THE PROBLEM WITH  ANOTHER PROBLEM  WITH THE DRIVE SHIFT SOME TIME GET STUCK I CAN NOT PUT THE CAR IN ( P ) PARK OR ( D ) DRIVE I SEE THERE HAVE BEEN ALOT OF COMPLAINTS ABOUT THIS SITUATION , DON'T KNOW IF IS A RECALL FOR IT . REMEMBER THIS CAR MAKE SOME NOISE BEFORE BRAKE BUT I CHECKED BRAKE PADS AND ROTOR EVERYTHING WAS GOOD. HOPE YOU UNDERSTAND MY SITUATION . THANKS.  *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/26/2011",
        "dateOfIncident": "12/01/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10441222,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, AND WITHOUT WARNING, ABS BRAKE LIGHT COMES ON AND BRAKES HAVE SEVERE VIBRATIONS AND DO NOT STOP VEHICLE NORMALLY.  PROBLEM GOES AWAY WITH RESTART BUT COMES BACK PERIODICALLY( 2-3 TIMES PER MONTH).  DEALERSHIP IS AWARE OF PROBLEM BUT REFUSES TO ADDRESS IT BECAUSE IT IS TOO EXPENSIVE TO FIX.  COST ESTIMATE IS $2000. THIS PROBLEM IS DOCUMENTED ON NUMEROUS WEBSITES AND IS LIKELY TO RESULT IN DEATH IF NOT ADDRESSED.  VERY DANGEROUS SITUATION, NOTIFIED INFINITI WHO REFUSED TO FIX PROBLEM BECAUSE I HAD NOT DONE ALL MY SCHEDULED SERVICES AT THE DEALERSHIP - IN OTHER WORDS, BECAUSE I WASN'T A GOOD ENOUGH CUSTOMER THEY WERE UNWILLING TO REPAIR DANGEROUS BRAKING ISSUE.  *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/12/2011",
        "dateOfIncident": "07/20/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10429927,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 INFINITI QX56. THE CONTACT WAS DRIVING 55 MPH WHEN THE BRAKES FAILED AND THE CONTACT WAS UNABLE TO STOP THE VEHICLE. THE CONTACT HAD TO TRAVEL DOWN A DIRT ROAD AND COAST TO A STOP. THE FAILURE WAS EXPERIENCED SEVERAL TIMES. THE VEHICLE WAS TAKEN TO THE DEALER WHO PERFORMED A DIAGNOSTIC THAT LOCATED THE FAILURE AT THE BRAKE BOOSTER SENSOR. THE DEALER REPLACED THE BRAKE BOOSTER SENSOR, BUT THE FAILURE WAS NOT CORRECTED. THE MANUFACTURER ADVISED THE CONTACT THAT THE BRAKE FAILURE WAS NOT RECALLED AND THEY COULD NOT GUARANTEE THAT THE FAILURE WOULD BE PERMANENTLY CORRECTED IF THE BRAKE BOOSTER SENSOR WAS REPLACED FOR A SECOND TIME. THE VEHICLE WAS NOT FURTHER REPAIRED.  THE FAILURE MILEAGE WAS 41,431 AND THE CURRENT MILEAGE WAS 53,459.",
        "vin": "5N3AA08C06N"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "07/31/2011",
        "dateOfIncident": "04/04/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10416372,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "BRAKESAFE",
                "productMake": "BRAKESAFE",
                "productModel": "BRAKESAFE",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "I HAVE A 2006 INFINITI QX56 WITH 46,000 MILE ON IT, AND MY BRAKES FAILED ON ME APPROXIMATELY 4 TIMES ALREADY, BUT JUST COMING OUT OF A DRIVE WAY OR BACKING UP FROM A PARKING LOT, I WOULD HAVE TO TURN OFF THE TRUCK AND TURN IT BACK ON FOR THE BRAKES TO FUNCTION NORMAL AGAIN. WHEN IT FAILED AND I PRESSED ON THE BRAKE I NOTICED THE BRAKE LIGHT ON THE DASH WOULD TURN ON AND I WOULD HEAR GRINDING NOISE FROM THE BRAKES AND IT SEEMS AS THE PADS ARE BARLEY GRABBING THE ROTORS. IT BEEN A SCARY EXPERIENCE FOR ME AND MY FAMILY. IT MY FAMILY TRUCK AND I HAVE A WIFE AND 4 KIDS. I WAS ALSO TOLD IT COULD BE THE BRAKE BOOSTER AND IT NEEDS TO BE REPLACED, THERE SHOULD BE A RECALL ON THESE FOR THE NISSAN ARMADAS AND INFINITI QX56.  *TR",
        "vin": "5N3AA08A06N"
    },
    {
        "components": "SERVICE BRAKES, ELECTRIC",
        "crash": false,
        "dateComplaintFiled": "07/29/2011",
        "dateOfIncident": "07/27/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10416221,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "SERIOUS BRAKE FAILURE ON A 2006 INFINITY QX56.  THE BRAKE LIGHT RANDOMLY COME ON AND THEN THE BRAKE SYSTEM ESSENTIALLY FAILS, WITH LOUD MECHANICAL SOUNDS, SHUTTERING OF THE TRUCK, AND ESSENTIALLY AN INABILITY TO STOP THE TRUCK.  THERE IS NO WAY TO PREDICT ITS OCCURRENCE AND THIS IS A POTENTIALLY DEADLY SITUATION.  *TR",
        "vin": "5N3AA08C56N"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/25/2011",
        "dateOfIncident": "05/11/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10403508,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "APPLIED PRESSURE ON THE BRAKES AND BRAKES START TO GRAB AND MAKES A GRINDING NOISE.  AFTER THIS OCCURS THE BRAKE LIGHT COMES ON AND  I HAVE A CONTINUOUS GRABBING AS IF THE BRAKES ARE ABOUT TO LOCK.  I HAVE TAKEN MY CAR TO THE DEALER TWICE ALREADY THE FIRST TIME THE SERVICE DEPARTMENT REPROGRAMMED  THE COMPUTER SYSTEM.  THE SECOND TIME THEY COULD NOT FIND ANYTHING WRONG  I AM STILL HAVING THIS PROBLEM AND  WILL BE RETURNING MY VEHICLE BACK FOR A THIRD TIME.",
        "vin": "5N3AA08CX6N"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/01/2011",
        "dateOfIncident": "01/23/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10380649,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "IN THE PAST SIX MONTHS I HAVE HAD TWO BRAKE FAILURES.  THE MOST RECENT WAS 01/23/2011.  WHILE IN MOTION AT A SPEED OF APPROXIMATELY 25 MPH I APPLIED THE BRAKES BUT RATHER THAN WORKING, THE PEDAL WENT TO THE FLOOR WITH NO RESISTANCE WHATSOEVER.  I LOST ALL BRAKING CONTROL AND COASTED RIGHT THROUGH A STOP SIGN NEARLY BEING BROADSIDED BY A SEMI TRUCK.      JUNE, 2010:  WHILE LEAVING MY NEIGHBORHOOD GOING DOWNHILL I APPLIED MY BRAKES AS USUAL AND TO MY SURPRISE THE BRAKES WENT TO THE FLOOR MAKING A LOUD RATCHETING OR SPRING NOISE WITH NO BRAKING EFFECT WHATSOEVER.  AFTER ROLLING TO A STOP I RETURNED HOME AND PARKED THE CAR.  BELIEVING I NEEDED NEW BRAKES OR BRAKE FLUID, I IMMEDIATELY MADE AN APPOINTMENT FOR THE NEXT MORNING. THE NEXT MORNING I HAD INTENDED TO CALL AAA FOR A TOW BUT DISCOVERED THE BRAKES WORKED PERFECTLY FINE.  I THEREFORE DROVE THE VEHICLE TO THE REPAIR SHOP.  THEY PERFORMED A THOROUGH EXAMINATION OF THE BRAKE SYSTEM BUT FOUND NOTHING WRONG AND THE BRAKE SYSTEM SEEMED TO WORK WELL SO NO FURTHER ACTION SEEMED TO BE NEEDED.    01/23/2011:  WHEN DRIVING AT A SLOW SPEED I APPROACHED A STOP SIGN BEFORE ENTERING A HIGHWAY AND AS I APPLIED THE BRAKES THEY MADE THE SAME SOUND SIMILAR TO A RECOILING SPRING AS I DEPRESSED THE PEDAL.  THERE WAS NO RESISTANCE AND DEPRESSING THE PEDAL HAD NO EFFECT WHATSOEVER.  I CRUISED THROUGH THE STOP NEARLY BEING HIT BY AN ONCOMING TRUCK.  TO STOP MY VEHICLE I DOWNSHIFTED TO THIRD, SECOND AND FIRST AND CRUISED TO A STOP.  AFTER A FEW SECONDS OF COMPOSURE, I TURNED THE VEHICLE OFF, WAITED APPROXIMATELY 30 SECONDS AND RESTARTED THE ENGINE.  AS SOON AS I DID THE BRAKES WORKED JUST FINE WITH NO CONTINUING PROBLEM.    THIS APPEARS TO BE A COMPUTER PROBLEM, IS VERY SERIOUS, AND DEEMS THE VEHICLE AS UNSAFE AND UNUSABLE UNTIL THE PROBLEM IS DEFINITIVELY FOUND AND RESOLVED.",
        "vin": "5N3AA08C96N"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/30/2010",
        "dateOfIncident": "12/20/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10373556,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 INFINITI QX56. WHILE DRIVING APPROXIMATELY 30 MPH, THE CONTACT APPLIED PRESSURE TO THE BRAKES WHEN SHE HEARD A LOUD GRINDING NOISE FOLLOWED BY EXCESSIVE SHAKING OF THE STEERING WHEEL. THE CONTACT ALSO NOTICED THAT THE EMERGENCY BRAKE WARNING LIGHT ILLUMINATED BUT THE BRAKE WAS NOT ACTUALLY ON.  THE CONTACT POWERED THE VEHICLE OFF, TURNED IT ON AGAIN AND THE EMERGENCY BRAKE LIGHT SHUT OFF. THE DEALER WAS NOTIFIED AND PERFORMED A DIAGNOSTIC TEST, WHICH CONFIRMED THAT THE DELTA SENSOR IN THE BOOSTER ASSEMBLY NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS INFORMED AND THE CONTACT WAS WAITING FOR A RESPONSE. THE CURRENT MILEAGE WAS APPROXIMATELY 108,000.  THE FAILURE MILEAGE WAS APPROXIMATELY 107,900.",
        "vin": "5N3AA08A06N"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/28/2010",
        "dateOfIncident": "12/01/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10373150,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES SHUTTER AND STOP WORKING ON 2006 INFINITI QX56.  DETERMINED THAT THE ABS NEEDED A FIRMWARE UPDATE.  WENT TO DEALERSHIP, PAID $100.00 FOR UPDATE AND PROBLEM IS STILL OCCURRING. THIS IS MY WIFE'S VEHICLE AND SHE TRAVELS WITH MY 2 YEAR OLD DAUGHTER.  THERE ARE HUNDREDS IF NOT THOUSANDS OF SIMILAR COMPLAINTS ON NISSAN USER FORUM BOARDS.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/08/2010",
        "dateOfIncident": "11/07/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10364402,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 QX56 INFINITI. THE CONTACT STATED WHILE DRIVING 50 MPH, THE VEHICLE BEGIN TO INDEPENDENTLY DECELERATE BEFORE COMPLETELY STALLING. THE VEHICLE WAS TOWED TO THE CONTACTS RESIDENCE. THE DEALER WAS CONTACTED BUT OFFERED NO ASSISTANCE IN REPAIRING THE VEHICLE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGE WAS 86,000.",
        "vin": "5N3AA08C36N"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/19/2010",
        "dateOfIncident": "08/10/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10350548,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER SIDE BOTTOM HEADER PLASTIC TANK FACING ENGINE SIDE OF RADIATOR CRACK AND LEAKS RADIATOR FLUID CAUSING EXTREME HIGH TEMPERATURE THAT CAN CAUSE LOSE OF ENGINE POWER OR ENGINE FAILURE. *TR",
        "vin": "5N3AA08A06N"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "07/06/2010",
        "dateOfIncident": "05/03/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10341578,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 INFINITI QX56. THE CONTACT STATED THAT THE FUEL LEVEL INDICATOR DISPLAYED THAT THE VEHICLE WAS FULL WITH GASOLINE; HOWEVER, THE VEHICLE STALLED BECAUSE THE FUEL TANK WAS EMPTY. THE FAILURE OCCURRED TWICE PRIOR TO THE CONTACT RECEIVING A RECALL NOTICE FOR NHTSA CAMPAIGN ID NUMBER 10V074000 (FUEL SYSTEM, OTHER:STORAGE:FUEL GAUGE SYSTEM) IN MAY 2010. THE DEALER STATED THAT THE PARTS NEEDED TO REPLACE THE FUEL SENDER UNIT INSIDE THE FUEL TANK WITH A NEW IMPROVED SENDER CARD WERE NOT AVAILABLE. THE CONTACT WAS NUMBER FORTY ON THE WAITING LIST. THE PART BECAME AVAILABLE IN LATE MAY 2010; HOWEVER, THE DEALER STATED THAT THEY ONLY RECEIVED 3 TO 4 PARTS PER SHIPMENT AND WERE UNABLE TO DETERMINE WHEN THEY WOULD BE ABLE TO REPAIR THE CONTACTS VEHICLE. THE FAILURE MILEAGE WAS UNKNOWN AND THE CURRENT MILEAGE WAS 82,000.",
        "vin": "5N3AA08C46N"
    },
    {
        "components": "FUEL SYSTEM, OTHER,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/23/2010",
        "dateOfIncident": "05/22/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10331806,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STALLING AND LOSING POWER AND ALL WARNING LIGHTS ON DASHBOARD BEGIN TO FLASH. ON SEVERAL OCCASIONS VEHICLE COMPLETELY STALLED WHILE I WAS DRIVING ON THE FREEWAY CAUSING ME TO LOSE POWER STEERING CONTROL AND ALMOST CAUSING AN ACCIDENT. PROBLEM COMES AND GOES WITHOUT ANY PRE-WARNING. *TR",
        "vin": "5N3AA08C96N"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "04/15/2010",
        "dateOfIncident": "04/13/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10325825,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WE RECEIVE A LETTER FROM INFINITI COMPANY BECAUSE I'M THE OWNER OF A INFINITY QX56, YEAR 2006 NOTIFYING ME THAT THE FUEL GAUGE IN SOME OF THE VEHICLE MAY BE INACCURATE DUE TO A MALFUNCTION IN THE FUEL LEVEL SENDING UNIT, THAT CAUSE THE INSTRUMENT PANEL FUEL GAUGE TO INACCURATELY DISPLAY THAT THE VEHICLE STILL HAS SOME FUEL, TYPICALLY ABOUT ONE QUARTER TANK, WHEN THE FUEL TANK IS EMPTY AND THAT IF THIS WERE TO OCCUR ON MY VEHICLE, THE VEHICLE COULD STALL, WHICH COULD CREATE AN UNSAFE CONDITION WHICH COULD RESULT IN A CRASH.  I NEVER AGO HAS THIS PROBLEM BUT I EVER MAINTAIN THE FUEL LEVEL IN MY VEHICLE SO THE FUEL GAUGE READS ABOVE THE ONE HALF POSITION, SO I WAS VERY INTERESTING TO HAVE MY VEHICLE REPAIRED, BUT I WAS BASED IN PANAM CITY SO I WANT TO KNOW HOW IS THE PROCESS FOR THE PERSONS THAT WAS OUTSIDE OF USA.    PLEASE CALL ME BACK TO MY OFFICE [XXX] OR TO MY MOBILE [XXX] OR PLEASE MAIL THE INFORMATION TO THE FOLLOWING ADDRESS:    [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *TR",
        "vin": "5N3AA08A86N"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "03/24/2010",
        "dateOfIncident": "10/09/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10321839,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 INFINITI QX56. THE CONTACT STATED THAT WHILE DRIVING AT SPEEDS OF 65 MPH, THE VEHICLE STALLED WITHOUT WARNING. THE DEALER PERFORMED A DIAGNOSTIC TEST AND REPLACED BOTH THE BATTERY AND FUEL PUMP. THE CONTACT CONFIRMED THAT THEY RECEIVED NOTIFICATION OF A RECALL CAMPAIGN (NHTSA CAMPAIGN ID NUMBER: 10V074000-FUEL SYSTEM, OTHER: STORAGE: FUEL GAUGE SYSTEM) FOR HIS SPECIFIC VEHICLE.  THE DEALER ADVISED MAINTAINING AT LEAST HALF A TANK OF GASOLINE AT ALL TIMES. THE DEALER ALSO CONFIRMED THE PARTS NEEDED TO PERFORM THE NECESSARY RECALL REPAIRS WERE NOT YET AVAILABLE. THE APPROXIMATE FAILURE MILEAGE WAS 50,000 AND THE CURRENT MILEAGE WAS 75,000.",
        "vin": "5N3AA08C86N"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/04/2010",
        "dateOfIncident": "01/11/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10316913,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE WAS DRIVING OUR SUV WHEN A CAR CUT IN FRONT OF HER AND SHE SLAMMED ON HER BRAKE TO AVOID HITTING THE CAR THAT HAD CUT HER OFF.  HER FOOT ON THE PEDAL WENT ALL THE WAY TO THE FLOOR AND HER BRAKE LIGHT FLASHED REPEATEDLY.  SHE HAD NO BRAKE AND PUT THE CAR IN NEUTRAL TO ALLOW THE CAR TO COME TO A STOP.  WE HAD THE CAR TOWED TO THE DEALERSHIP.  INITIALLY WE WERE TOLD THAT THE POWER BOOSTER/MASTER CYLINDER AND POSSIBLY A VDC PROBLEM THAT NEEDS TO BE REPLACED.  I WAS CALLED LATER ON THAT DAY AND WAS TOLD THAT INFINITI HAD ISSUED A BULLETIN WHICH ONLY CALLS FOR VDC UNIT TO BE RE-SET.  I FEARED SAFETY FOR MY WIFE AND TWO CHILDREN AND CONTACTED INFINITI CONSUMER HOTLINE AND THEY BASICALLY TOLD ME THAT THEY WILL NOT REPLACE THE UNIT AND \"IF THE UNIT FAILS AGAIN, THEN THEY WILL CONSIDER OTHER OPTIONS\". *TR",
        "vin": "5N3AA08AX6N"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/04/2010",
        "dateOfIncident": "01/31/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10305583,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE FAILURE ON 2006 INFINITI QX56. ONE TIME.  SITUATION DANGEROUS, DRIVER AVOIDING PEDESTRIANS AND VEHICLES ON  A BUSY THOROUGHFARE. *TR",
        "vin": "5N3AA08A66N"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/12/2006",
        "dateOfIncident": "03/16/2006",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10168090,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2006 INFINITI QX56 SINCE PURCHACE I HAVE HAD THE SPEEDOMETER CLUSTER GPS AND FUEL SENDING UNIT RELACED ALSO VEHICLE HAS BEEN AT DEALER SEVERAL TIMES FOR SUSPENSION PROBLEMS . WHEN DRIVING DURING ACCELARATION CAR HAS VIBRATION, IF YOU HIT A BUMP THIS VEHICLE WILL BOUNCE LIKE A BALL SOMETIMES BOTTOM OUT. WHEN TOWING IF YOU HIT A BUMP THIS VEHICLE WILL CHANGE LANES.  LAST FRIDAY I WAS TOWING MY BOAT AND HIT A BUMP I HAD A TRACTOR TRAILER ON BOTH SIDES OF ME IT WAS CLOSE THIS CAR HAS BEEN TO INFINITI OF VALENCIA SEVERAL TIMES BUT THEY HAVE TOLD ME THEY ARE AWARE BUT FACTORY HAS NO CURRENT REPAIR. *JB",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/09/2006",
        "dateOfIncident": "06/04/2006",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10159415,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "QX56",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED WHILE DRIVING 50 MPH THERE WAS A THUMPING NOISE AS IF THE VEHICLE HAD A FLAT TIRE.  THE DEALERSHIP DETERMINED THAT FOUR OF THE SIX BOLTS ON THE LEFT REAR AXLE HAD SHEERED OFF AND THE BOLTS NEEDED TO BE REPLACED.  THE MANUFACTURER HAS NOT BEEN ALERTED.*AK",
        "vin": "5N3AA08C76N"
    }
]