[
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "11/02/2005",
        "dateOfIncident": "10/07/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10139710,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "1976",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH NO WARNING I LOST ALL STEERING.  IT FELT LIKE THE STEERING WHEEL HAD COME OFF THE SHAFT AS THERE WAS NO RESPONSE. THERE WAS TRAFFIC IN FRONT, BEHIND AND ON MY RIGHT WITH A CONCRETE BARRIER TO THE RIGHT OF THE SLOW LANE, AND BRIDGE SUPPORTS  TO MY LEFT. LUCKILY I WAS ON A STRAIGHT SECTION OF ROAD AND THERE WAS A SLIGHT CROWN TO THE ROAD.  I LITERALLY LEANED LEFT WHEN I CLEARED THE BRIDGE AND THE CAR STARTED TO THE MEDIAN. WHEN MY FRONT TIRES REACHED THE GRAVEL SHOULDER I HIT THE BRAKES AND SKIDDED TO A STOP IN THE MEDIAN SHORT OF ONCOMING TRAFFIC.  AFTER REGAINING COMPOSURE, I OPENED THE HOOD AND SAW THAT WHILE THE STEERING WHEEL TURNED THE ROD GOING INTO THE STEERING GEAR BOX, THE GEAR BOX DID NOT TURN THE WHEELS AT ALL.  I COULD TURN THE WHEEL LOCK TO LOCK WITH NO WHEEL MOVEMENT. A HALF MILE LATER I WOULD HAVE BEEN ON A FREEWAY WITH 65-70 MPH SPEEDS.  IF I HAD BEEN ON A CURVE WHEN IT HAPPENED I WOULD HAVE BEEN INTO AND ACROSS THE MEDIAN BEFORE I COULD HAVE STOPPED THE VEHICLE. EARLIER I HAD BEEN CROSSING THE U OF M CAMPUS IN HEAVY PEDESTRIAN TRAFFIC. I E-MAILED CHEVY THE NEXT DAY. THEY ASSIGNED THE CASE BUT AFTER A WEEK OF LEAVING VOICEMAIL MESSAGES AND CONTACT NUMBERS I GAVE UP AND CALLED THE MAIN NUMBER. THEY TOLD ME: A. SINCE I DIDN'T HAVE IT TOWED TO A GM DEALER THEY  HAD NO RESPONSIBILITY FINANCIALLY.  B. THEY ONLY KEPT RECALL RECORDS BACK TEN YEARS SO THEY HAD NO INFO FOR ME. BUT I COULD CALL A DEALER AND THEY COULD GIVE ME THE INFO.  I DID, AND THE DEALER SYSTEM ALSO ONLY GOES BACK TEN YEARS.  I HAD PLANNED TO HANDLE THIS ONLY THROUGH GM, BUT THEY DIDN'T SEEM TOO CONCERNED TO ME. I HAVE NEVER HEARD OF THIS COMPLETE OF A FAILURE, AND HAVE NO IDEA HOW MANY OF THESE GEARS WERE PRODUCED OR ARE STILL ON THE ROAD.  CAN YOU CHECK RECALLS FOR ME?  GET MORE INFO OUT OF GM?  *NM  THE CONSUMER WAS ADVISED THAT THE STEERING GEAR DID NOT FAIL, BUT THE CASTLE NUT CAME TOTALLY OFF THE EXCITER ROD CONNECTING THE STEERING SECTOR SHAFT TO THE STEERING GEAR.  *SC",
        "vin": "1Z37X6S4215"
    }
]