[
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/01/2022",
        "dateOfIncident": "03/29/2022",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11459269,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "X-TYPE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2006 Jaguar X-Type. The contact stated that while in the vehicle and depressing the brake pedal, the engine started revving at high speed. The vehicle was inadvertently moving forward into traffic. There was no warning light illuminated. The contact stated that after turning off and restarting the vehicle, the failure recurred. Neither the dealer nor the manufacturer had been notified of the failure. The failure mileage was approximately 95,500.",
        "vin": "SAJWA51A46W"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/02/2019",
        "dateOfIncident": "07/01/2019",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11228995,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "X-TYPE",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Lippert",
                "productMake": "EQUIPMENT",
                "productModel": "EQUIPMENT",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 JAGUAR X TYPE EQUIPPED WITH EZ AUTO M1ZKA LUG NUTS, SIZE: 12MM/1.5, MODEL NUMBER: M1ZBY ML. THE CONTACT REMOVED THE ORIGINAL LUG NUTS FROM THE WHEELS AND REPLACED THEM WITH THE NEW LUG NUTS; HOWEVER, THE NEW LUG NUTS FRACTURED INTO PIECES. THE CONTACT STATED THAT THE MATERIAL ON THE LUG NUTS WAS SCRATCHED AND WORN. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 75,000.",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "04/02/2018",
        "dateOfIncident": "03/23/2018",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11082486,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "X-TYPE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 JAGUAR X-TYPE. WHILE DRIVING APPROXIMATELY 65 MPH, THE SUN ROOF ON THE VEHICLE EXPLODED. THERE WERE NO WARNING INDICATORS ILLUMINATED BEFORE OR AFTER THE FAILURE. THERE WERE NO INJURIES. THE CONTACT STATED THAT NOTHING STRUCK THE SUN ROOF TO CAUSE THE FAILURE. THE VEHICLE WAS NOT TAKEN TO A DEALER TO BE DIAGNOSED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE VIN WAS UNKNOWN. THE APPROXIMATE FAILURE MILEAGE WAS 180,000.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/28/2015",
        "dateOfIncident": "04/21/2015",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10713294,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "X-TYPE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS NOT THE FIRST TIME THAT IT HAPPENED.  IT HAPPENED ONCE BEFORE, BUT I DON'T KNOW WHAT THE DATE WAS OR THE MILEAGE.  HOWEVER, I DO REMEMBER THAT IT HAPPENED IN NOVEMBER, 2013.  ON APRIL 21, 2015, I WAS LEAVING A STORE.  AS I PULLED OUT OF THE PARKING LOT, I HAD TO STOP TO MAKE SURE THERE WAS NOT ANY TRAFFIC IN THE HIGHWAY BEFORE LEAVING, BUT THERE WAS A TRUCK APPROACHING.  I TAPPED THE BRAKES AND THE CAR TOOK OFF IN THE HIGHWAY RIGHT IN FRONT OF THE TRUCK.  LUCKILY THE DRIVER OF THE TRUCK SAW ME AND APPLIED HIS BRAKES.  THIS COULD HAVE BEEN A TRAGEDY.  NOW FOR THE FIRST OCCASION, I WAS IN THE INSIDE LANE OF A MAJOR HIGHWAY AND WAS TRYING TO STOP FOR A RED LIGHT.  I STARTED TO BRAKE AND THE CAR TOOK OFF.  I HAD TO SWITCH OVER IN THE OUTSIDE LANE SO THAT I WOULDN'T REAR END THE CAR IN FRONT OF ME.  I WAS LUCKY THIS TIME BECAUSE THERE WASN'T ANY TRAFFIC IN THE OUTSIDE LANE.  NOW I AM AFRAID TO DRIVE THE CAR BECAUSE I KNOW IT IS A DEATH TRAP.  I DO NOT WANT TO HURT MYSELF OR ANYONE ELSE ON THE HIGHWAY.  I NEED SOME HELP NOW!  I DON'T KNOW WHAT TO DO!  I JUST PURCHASED THE CAR IN APRIL, 2013.  THERE NEEDS TO BE A RECALL BEFORE SOMEONE GETS HURT OR KILLED.  IT IS A BEAUTIFUL CAR, BUT AS I SAID BEFORE, \"IT IS A DEATH TRAP\"!  *TR",
        "vin": "SAJWA51A36W"
    },
    {
        "components": "AIR BAGS,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "01/30/2015",
        "dateOfIncident": "08/16/2014",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10680055,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "X-TYPE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AS MY WIFE WAS EXITING THE FREEWAY SHE PRESSED ON THE BRAKE PEDAL AND THE VEHICLE ACCELERATED CAUSING A MAJOR CRASH (TOTALED) AND SERIOUS INJURIES. SHE TRIED PUMPING THE BRAKES AND COULD NOT SLOW THE VEHICLE. THE VEHICLE BEHIND HER REPORTED IN THE POLICE REPORT THAT THE CAR ON THE EXIT RAMP DECELERATED AND SUDDENLY ACCELERATED. THERE WAS A RED LIGHT AT THE BOTTOM OF THE EXIT RAMP, HER FOOT WAS NOT ON THE GAS PEDAL NOR DID THE CAR MATS INTERFERE WITH THE BRAKE PEDAL. NO ONE ELSE WAS IN THE VEHICLE.  THE BRAKES WERE VERY WELL MAINTAINED. A SEARCH OF THE INTERNET INDICATED 2003/2006 JAGUAR X-TYPE HAD ACCELERATION PROBLEMS WITH OTHER DRIVERS  PRESSING ON THE BRAKE PEDAL. I CAN EMAIL YOU MY SEARCH RESULTS IF YOU SO DESIRE.  THE AIR BAG WAS ONLY DEPLOYED ON THE PASSENGER SIDE.  *TR",
        "vin": "SAJWA51A56W"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/24/2014",
        "dateOfIncident": "09/05/2014",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10660432,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "X-TYPE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "IN TWO OCCASIONS THE VEHICLE HAS ACCELERATED WITH NO APPARENT REASON AFTER THE BRAKES WHERE APPLIED.  IN THE LATEST INCIDENT I WAS PARKING THE VEHICLE IN A FAST-FOOD RESTAURANT WHEN IT HAPPENED, THANKFULLY NO OTHER CARS WHERE AFFECTED BY THE INCIDENT.  I WOULD LIKE TO KNOW IF THERE HAS BEEN A RECALL RELATED WITH THIS TYPE OF OCCURRENCE.   *TR",
        "vin": "SAJWA51A66W"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "09/30/2014",
        "dateOfIncident": "08/16/2014",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10640301,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "X-TYPE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2006 JAGUAR X-TYPE. WHILE DRIVING APPROXIMATELY 55 MPH, THE VEHICLE ACCELERATED WHEN THE BRAKE PEDAL WAS APPLIED. AS A RESULT, THE CONTACT CRASHED THE VEHICLE INTO A WALL. THE PASSENGER SIDE DASHBOARD AIR BAG WAS THE ONLY AIR BAG THAT DEPLOYED. A POLICE REPORT WAS FILED. THE CONTACT SUSTAINED TWO BROKEN RIBS, LACERATIONS THAT REQUIRED STITCHES, AND BRUISES TO THE EYE AND BODY THAT REQUIRED MEDICAL ATTENTION. THE VEHICLE WAS DESTROYED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 68,000..UPDATED 11/03/14 *BF   UPDATED 7/9/2015*JS",
        "vin": "SAJWA51A56W"
    },
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "08/29/2014",
        "dateOfIncident": "08/16/2014",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10629346,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "X-TYPE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TRAVELING ON THE FREEWAY AT 55 MPH, AS I EXITED AND TOUCHED THE BRAKES THE CAR WOULD NOT SLOW DOWN, THE CAR GAINED SPEED, I PUMPED THE BRAKES AND THE CAR CONTINUED TO GO FASTER, THE CAR WAS OUT OF CONTROL AND  CRASHED INTO A WALL. I WAS SERIOUSLY INJURED AND FORTUNATELY NO ONE ELSE OR OTHER VEHICLE WAS INVOLVED. I AM LUCKY TO BE ALIVE. JUST PRIOR TO IMPACT I TURNED THE WHEEL TO THE LEFT CAUSING THE CAR TO HIT THE RIGHT FRONT FIRST THEN THE CAR FLIPPED OVER. ONLY THE PASSENGER SIDE AIR BAG DEPLOYED. THE BRAKES WERE FAIRLY NEW WITH 70% BRAKE LINING REMAINING AND THE BRAKES HAD BEEN INSPECTED ONE WEEK PRIOR TO THE ACCIDENT.    IT APPEARS TO BE A COMBINATION SPEED ACCELERATION AND BRAKE FAILURE.  *TR",
        "vin": "SAJWA51A56W"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/22/2014",
        "dateOfIncident": "06/26/2013",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10615443,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "X-TYPE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS DRIVING ON HIGHWAY THEN WENT INTO LIMP MODE AND STARTED SLOWING DOWN DANGEROUSLY WITH CARS BEHIND ME BLOWING HORNS AND GOING ROUND.   *TR",
        "vin": "SAJWA79B16S"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/04/2014",
        "dateOfIncident": "07/03/2014",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10608226,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "X-TYPE",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "CONTI PRO CONTACT",
                "productYear": "9999",
                "size": "225/45R17",
                "type": "Tire"
            }
        ],
        "summary": "MY WIFE AND I WERE DRIVING ALONG I94 AND AN SUDDENLY AND LIGHT VIBRATION FROM THE FRONT RIGHT TIRE, AND SOON AFTER, I SAY THE TIRE CROSSING THE HIGHWAY. THE WHOLE CONTACT ARE OF THE TIRE RIP OFF THE WALLS OF THE TIRE. COMPLETELY GONE.  ONLY THE TWO OUTER WALLS REMAIN ATTACHED TO THE RIM. TIRES INSTALLED BY OUR JAGUAR DEALER AND LESS THAN 10,000 MILES. CONTINENTAL CONTIPROCONTACT 225/45 R17 91H DOT P5TY PXH6 SERIAL 50751 077449. PICTURES OF THE FAILED TIRE AVAILABLE. MADE IN MEXICO.   *TR",
        "vin": "SAJWA51A96W"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/29/2014",
        "dateOfIncident": "03/20/2014",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10575565,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "X-TYPE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING APPROXIMATELY 30MPH ON MY WAY TO THE DEALER FOR SCHEDULED OIL CHANGE AND WITHOUT ANY WARNING THE CAR STARTED MAKING A GRINDING NOISE AND STOPPED. IT WOULD NOT MOVE FORWARD OR REVERSE. MANAGED TO GET THE CAR TO THE SIDE OF THE ROAD AND CALLED THE DEALER FOR ASSISTANCE. UPON INSPECTION THE DEALER TOLD ME THE CAR NEEDED A TRANSMISSION AND TRANSFER CASE BECAUSE THE INTERNAL GEARS WERE FRAGMENTED.  *TR",
        "vin": "SAJWA51A16W"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "02/19/2014",
        "dateOfIncident": "03/01/2012",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10564118,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XK",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 JAGUAR XKR.  CONSUMER WRITES IN REGARDS TO DEFECTIVE TIRES.  *SMD  THE CONSUMER PURCHASED A FULL SET OF TIRES. HE HAD THE RIMS REFINISHED, AND WHEN THE TIRES WERE RE-INSTALLED ON THE LIKE-NEW RIMS, THE VEHICLE VIBRATED SEVERELY.",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/15/2013",
        "dateOfIncident": "06/24/2013",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10524916,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XK",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 JAGUAR XK. THE CONTACT STATED THAT WHEN THE AUTOMATIC CONVERTIBLE TOP WAS ACTIVATED, THE HYDRAULIC LINER FRACTURED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE DEFECT. THE APPROXIMATE FAILURE MILEAGE WAS 39,780. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/01/2012",
        "dateOfIncident": "03/01/2012",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10450019,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "X-TYPE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH MY BRAKES APPLIED AND SLOWING TO A STOP AT THE BOTTOM OF AN INTERSTATE EXIT RAMP, MY CAR SEEMED TO JERK AND THEN SUDDENLY ACCELERATED AS IF IT WAS TRYING TO GO INTO PASSING GEAR. I IMMEDIATELY PRESSED THE BRAKES AS HARD AS POSSIBLE AND SHIFTED INTO NEUTRAL SO I COULD STOP AND AVOID HITTING THE CAR IN FRONT OF ME. WHILE IN NEUTRAL, THE ENGINE KEPT REVVING AND THE TACHOMETER WAS IN THE RED. I TURNED THE ENGINE OFF TO KEEP FROM DAMAGING IT AND PUT THE CAR IN PARK. AFTER THE CAR IN FRONT OF ME HAD GONE, I STARTED MY CAR TO SEE IF THE ENGINE WOULD RUN PROPERLY. IT SEEMED TO BE OKAY, SO I CAREFULLY DROVE TO MY HOME WHICH WAS ABOUT THREE MORE MILES. SEVERAL WEEKS PRIOR, I HAD A SIMILAR INCIDENT WHEN I WAS PARKING AT THE GROCERY STORE, BUT I WAS IN THE PROCESS OF TURNING OFF THE ENGINE. WHEN I STARTED THE CAR TO LEAVE THE GROCERY STORE, EVERYTHING SEEMED TO BE OKAY AND I DIDN'T THINK ANY MORE OF IT. I FOUND SEVERAL OTHER PEOPLE ON LINE THAT HAVE EXPERIENCED THE SAME PROBLEM BUT NONE OF THEM COULD PROVE IT TO THEIR DEALER AND NOTHING WAS DONE ABOUT IT. I GUESS IT WILL TAKE SOMEONE GETTING KILLED BEFORE ANYTHING GETS DONE ABOUT THIS SUDDEN ACCELERATION PROBLEM WITH THE 2006 JAGUAR X-TYPE. THIS INCIDENT HAS UPSET ME AND I AM AFRAID TO DRIVE THIS CAR, BUT I DON'T HAVE ANOTHER VEHICLE TO DRIVE.  *TR",
        "vin": "SAJWA51A16W"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "06/15/2011",
        "dateOfIncident": "05/05/2011",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10407794,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "X-TYPE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 JAGUAR X TYPE. CONSUMER WRITES IN REGARDS TO BRAKE/ ACCELERATION PROBLEMS *TGW  THE CONSUMER STATED WHEN SHE ATTEMPTED TO APPLY THE BRAKE TO STOP AT A RED LIGHT, THE VEHICLE CONTINUED TO ACCELERATE. THE CONSUMER STATED SHE APPLIED THE BRAKE HARDER, AND CONSEQUENTLY, SHE REAR ENDED ANOTHER VEHICLE TWICE.  THE CONSUMER STATED SHE EXPERIENCED SUDDEN ACCELERATION ON A PREVIOUS OCCASION. *JB",
        "vin": "SAJWA51AX6W"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "08/05/2010",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10347695,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "X-TYPE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 JAGUAR X-TYPE. CONSUMER STATES SEAT BELT DOES NOT CONNECT PROPERLY *TGW  THE CONSUMER STATED ONCE THE SEAT BELT WAS BUCKLED, IT RELEASED UPON GOING OVER BUMPS. *JB",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/20/2010",
        "dateOfIncident": "05/09/2010",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10344311,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XK SPORTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG LIGHTS COMING ON IN JAGUAR XK8 2006 BETWEEN JANUARY 2009 AND MAY 2009. WE TOOK THE CAR IN 4 TIMES FOR AIRBAG LIGHTS COMING ON (EACH TIME \"REPAIRED\").  EACH TIME THE CONNECTIONS WERE \"CORRECTED\". THE FIRST TIME REPLACED A BLOWN FUSE; THE SECOND TIME THE SYSTEM WAS NOT COMMUNICATING AND REPLACED A POWER FUSE; THE THIRD TIME PARTS WERE ORDERED AND THEN LATER REPLACED BLOWN FUSE AND THE SEAT HARNESS. (THE CAR ONLY HAD ONLY 18,814 MILES ON IT WHEN THE LIGHT PROBLEMS BEGAN.)  ON MAY 9, 2009, THE DRIVER SEAT AIRBAG HARNESS WAS REPLACED.  IN MARCH 2010, THE AIRBAG LIGHTS CAME ON AGAIN.  ANOTHER HARNESS WAS ORDERED.  ON MAY 9, 2009, THE DRIVER SEAT AIRBAG DEPLOYED WHILE THE ENGINE WAS ON, BUT THE CAR WAS IN PARK.  AFTER MUCH INVESTIGATION, THE HARNESS WAS AGAIN REPLACED (AND THE DRIVER SEAT WAS REPAIRED).  *TR",
        "vin": "SAJDA42C662"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/21/2010",
        "dateOfIncident": "05/21/2009",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10331538,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "X-TYPE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 JAGUAR X-TYPE. THE CONTACT STATED WHEN DRIVING AT SPEEDS OF AT LEAST 30 MPH, THERE WAS AN ABNORMAL NOISE COMING FROM THE ENGINE. THE VEHICLE WAS SEEN BY THE DEALER THREE TIMES AND EACH TIME; THE DEALER WAS UNABLE TO DUPLICATE THE FAILURE. THE MANUFACTURER WOULD NOT ASSIST.  THE FAILURE AND CURRENT MILEAGES WERE 49,000.",
        "vin": "SAJWA51A66W"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/11/2010",
        "dateOfIncident": "12/24/2009",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10329913,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "X-TYPE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AT APPROXIMATELY 53,000 MILES, WITHOUT WARNING, THE AUTOMATIC TRANSMISSION IN MY 2006 JAGUAR X-TYPE COMPLETELY AND CATASTROPHICALLY FAILED.  THE FAILURE INCLUDED THE TRANSFER CASE AND THE MAIN GEAR BOX, WHERE THE ACTUAL GEARS WERE BROKEN INTO FRAGMENTS. *TR",
        "vin": "SAJWA51A06W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/03/2010",
        "dateOfIncident": "11/02/2009",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10304614,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XK",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 JAGUAR XKR (N/A). THE CONTACT STATED THE SENSOR IN THE PASSENGER SEAT  FOR THE AIR BAGS HAS FAILED AND IF A CRASH OCCURS THE AIR BAGS WILL NOT DEPLOY. THE VEHICLE WAS TAKEN TO THE DEALER AND THE CONTACT WAS TOLD HE CAN REPLACE THE SENSOR BUT HE HAS TO PAY FOR THE EXPENSE BECAUSE THIS IS NOT COVERED UNDER THE WARRANTY AND THERE ARE NO RECALLS. THE CONTACT ALSO CALLED THE MANUFACTURE AND WAS TOLD HE HAS TO PAY FOR THE SENSOR REPLACEMENT. THE FAILURE MILEAGE WAS 9,100.      UPDATED 03/08/10 *BF  THE CONSUMER STATED THE AIR BAG LIGHT WOULD ILLUMINATED WHEN EVER SOMEONE SAT IN THE FRONT PASSENGER SEAT.  UPDATED 06/01/10",
        "vin": "SAJDA42B963"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "12/29/2008",
        "dateOfIncident": "12/10/2007",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10252999,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "X-TYPE",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "CONTINENTAL TOURINGCONTACT AS",
                "productYear": "9999",
                "size": "205/65R15",
                "type": "Tire"
            }
        ],
        "summary": "ON TWO SEPARATE OCCASIONS IN 2006 AND 2007, OEM CONTINENTAL TOURING TIRES 225/45R17 ON MY 2006 JAGUAR X-TYPE SPORT SEDAN SUFFERED  SPONTANEOUS, CATASTROPHIC BLOW OUT FAILURE UNDER WHAT SHOULD HAVE BEEN NOMINAL OPERATING CONDITIONS. {I-95, I-495, CLEAR DRY PAVEMENT, SPEED BELOW 80 MPH].  SINCE THOSE EVENTS, REMAINING TIRES HAVE EXHIBITED SIDEWALL BULGING AND OTHER EVIDENCE OF CORD SEPARATION.  TODAY (12/26/2008) WHILE VISITING SAFETY WEBSITE, LEARNED OF AT LEAST 50 SIMILAR SPONTANEOUS FAILURES OF SAME PRODUCT, WHICH IS ALSO OE TIRE ON MERCEDES C300 AND BMW 3 SERIES SEDANS.  THIS SEEMS TO BE MORE THAN COINCIDENCE. *TR",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "12/01/2008",
        "dateOfIncident": "11/27/2008",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10250378,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "X-TYPE",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL TIRE NORTH AM",
                "productModel": "CONTIPROCONTACT",
                "productYear": "9999",
                "size": "225/45R17",
                "type": "Tire"
            }
        ],
        "summary": "CONTINENTAL CONTI PROCONTACT TIRE - LEFT FRONT 2006 JAGUAR SPORTWAGON X TYPE-FAILED ON MASSPIKE. AAA REP OBSERVED THAT TREAD SEPARATED .NO ROAD HAZARD. REPLACEMENT PURCHASED AND TIRE DESCRIBED AS FAILURE IN \"WORKMANSHIP\" 20K . LEFT FRONT FAILURE WAS IDENTICAL TO RIGHT FRONT  TIRE FAILURE 5 WEEKS B/4.THUS 2  FAILURE S AT 20K MILES AND 19K MILES. FORTUNATELY GOING SLOW OR COULD HAVE BEEN REAL PROBLEM. REPLACED 2 TIRES AT ALMOST 200 A PIECE. ONE TIRE IN MY POSSESSION. *TR",
        "vin": "SAJWA54A66W"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "03/09/2007",
        "dateOfIncident": "12/01/2006",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10184676,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "X-TYPE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* - THE CONTACT OWNS A 2006 JAGUAR X-TYPE PURCHASED ON NOVEMBER 10, 2006 WITH 15 MILES.  THE CONTACT EXPLAINED THAT EARLY IN DECEMBER 2006 WHILE DRIVING THE VEHICLE BETWEEN 40 TO 45 MPH  AND BEFORE COMING TO A STOP SIGN THE VEHICLE FAILED TO RESPOND WHEN THE BRAKES WERE APPLIED. THE VEHICLE CONTINUED AT THE SAME SPEED.  THIS CAUSED THE CONTACT TO MOVE ON TO THE EMERGENCY LANE TO AVOID HITTING ANOTHER VEHICLE.  THE CONTACT CONTINUED TO APPLY THE BRAKE PEDAL WHILE ON THE EMERGENCY LANE UNTIL THE VEHICLE STOPPED.  THE CONTACT EXPLAINED THAT MID DECEMBER 2006, WHILE DRIVING AT 30 MPH ON A COUNTRY ROAD, THE  BRAKES DID NOT RESPOND WHEN APPLIED.  EVEN AFTER THE BRAKE WAS APPLIED THE VEHICLE  WENT AT THE SAME SPEED AND THE CRUISE CONTROL STAYED ON.  AFTER PRESSING THE BRAKE PEDAL A FEW TIMES THE VEHICLE WAS ABLE TO STOP.  AT NO TIME WAS THE CRUISE CONTROL EVER ACTIVATED.    THE THIRD TIME A SIMILAR PROBLEM  OCCURRED WAS ON 1/20/07.  THE CONTACT TOOK THE VEHICLE TO THOMAS CADILLAC AND JAGUAR OF HARDFORD ON 1/24/07,WHERE AN IDS WAS INSTALLED, AND THE PEDAL SWITCH WAS ADJUSTED AND CHECKED.  THE CONTACT STATED THAT THE CRUISE CONTROL BECAME ACTIVE ON ALL THREE OCCASIONS AND PUMPING THE BRAKE PEDAL DID NOT DISENGAGE THE CRUISE CONTROL TO ALLOW THE VEHICLE TO SLOW DOWN OR PROPERLY STOP.  THE FAILURE MILEAGE WAS 1743 AND THE CURRENT MILEAGE WAS 2100. ON FEBRUARY 16,2007 THE  CONTACT'S VEHICLE WAS INVOLVED IN A CRASH.  THE DRIVER WAS NOT ABLE TO STOP WHILE DRIVING AT 30 MPH  AND MAKING A RIGHT TURN, UNDER SUNNY AND DRY DRIVING CONDITIONS. *AK  UPDATE 4/9 *TR",
        "vin": "SAJWA51A46W"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/23/2007",
        "dateOfIncident": "11/20/2006",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10179444,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "X-TYPE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* - DURING A SCHEDULED MAINTENANCE ON 11/12/2004 THE CONTACT WAS TOLD SHE QUALIFIED FOR A TRANSMISSION REPLACEMENT.  THE VEHICLE HAD 30,000 MILES.  THE CONTACT HAD NOT EXPERIENCED PROBLEMS.  THE CONTACT STATED WHEN SHE WENT BACK FOR THE SCHEDULED APPOINTMENT SHE WAS TOLD THEY MADE A MISTAKE THAT  TRANSMISSION WAS FINE.   THE VEHICLE STARTED EXPERIENCING A JERKING MOVEMENT.  THE CONTACT TOOK THE VEHICLE TO THE DEALER ,AND WAS TOLD THEY COULD NOT DUPLICATE THE PROBLEM, THE JERKING EVENTUAL STOPPED.  RECENTLY, THE TRANSMISSION STARTED SLIPPING, THERE WERE NO WARNING INDICATORS  THE CONTACT STATED THE DEALER HAS HAD THE VEHICLE SINCE 11/20/06.  THE TRANSMISSION IS INOPERABLE AND HAS TO BE REPLACED.  THE CONTACT STATED THAT THE DEALER HAS TOLD HER THE TRANSMISSION IS FAULTY.  THE VEHICLE HAS APPROXIMATELY 45,000 MILES. THE FAILURE MILAGE WAS 2,9710.*AK",
        "vin": "SAJEA51CX2W"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "07/26/2006",
        "dateOfIncident": "02/11/2006",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10163486,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "X-TYPE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THAT THE PLACEMENT OF THE REARVIEW MIRROR CREATES A BLINDSPOT IN THE FORWARD VIEWING AREA OF THE WINDSHIELD.  THE CONFIGURATION OF THE VEHICLE WINDSHIELD, REARVIEW MIRROR, AND FRONT SEATS MAKE IT DIFFICULT TO VIEW OBSTACLES IN FRONT OF THE VEHICLE.  THE MANUFACTURER WAS CONTACTED ON 02/11/06 AND DETERMINED THAT THE VEHICLE WAS BUILT ACCORDING TO MANUFACTURER SPECIFICATIONS AND THAT THIS IS NOT A SAFETY ISSUE.    UPDATED 08/14/06.*JB",
        "vin": "SAJDA42B063"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/04/2006",
        "dateOfIncident": "04/24/2006",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10156793,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XK",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 12/05 I LEASED A 2006 JAGUAR XK8 CONVERTIBLE FROM MADISON NJ AND HAD IT FLAT BEDDED TO MIAMI. WHEN I 1ST DROVE IT I HEARD A TICK TICK NOISE UPON ACCELERATION . CALLED MADISON AND WAS TOLD TO TAKE IT TO A MIAMI JAG DEALER. TOOK IT TO WARREN HENRY JAG . SVCE MANAGER. SAID HE DIDN'T HEAR ANYTHING. HAD MAN DRIVE AROUND WITH ME. THEY STILL DENIED HEARING NOISE. THEY PUT IT UP ON A LIFT. COULDN'T FIND ANYTHING. I CALLED JAGUAR AMERICA AND THEY CALLED WARREN HENRY- I TOOK IT BACK AND THEY TOLD ME THAT MY CAR NEEDED A WHOLE NEW ENGINE. I CALLED MADISON AND JAG AND TOLD THEM I DIDN'T WANT A REBUILT CAR I WANTED A NEW CAR . THEY ALL DECIDED I SHOULD LET THEM REPLACE THE MOTOR. AFTER THEY DID APPROX 2 WKS AGO (WARREN HENRY) THEY RETURNED IT AND LEFT THE WORK ORDER IN IT. WORK ORDER STATES THAT JAGUAR SENT THE WRONG ENGINE SO MECHANIC ASKED WHAT TO DO. HE WAS TOLD TO STRIP MY OLD ENGINE AND TAKE PARTS OFF NEW AND REBUILD. IT STATES THAT HE DRAINED THE OIL AND \"IT WAS BLACK LIKE A 5000 MILE CHANGE HADN'T BEEN DONE\". MY CAR IS NEW ---IT ONLY HAD 1000 MILES . THERE WERE ENGINE PARTS LEFT IN THE TRUNK AND THE TRUNK IS ALL RIPPED APART AND THE ENGINE COVER IS MISSING THE BATTERY COVER ISN'T THERE- ITS A WRECK AND IS ALSO SCRATCHED ALL OVER. NOW MADISON SAYS THEY WILL PICK IT UP NEXT WEEK BUT THEY DON'T TELL ME WHAT THEY WILL DO. I'M STILL PAYING THE LEASE PAYMENTS AND I'M SCARED TO EVEN DRIVE THE CAR. PLEASE HELP ME.   *JB",
        "vin": "SAJDA42C162"
    }
]