[
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "12/26/2013",
        "dateOfIncident": "09/10/2013",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10557287,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "SPRINGDALE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED ONE OF THE POST-KATRINA FEMA TRAILERS IN JUN 2010 AT AUCTION. IT IS A 26 FOOT, RV CONFIGURED UNIT. ON MY LAST TRIP, SEP '13, TWO ADJACENT WHEEL STUDS SHEARED OFF ONE WHEEL SOMEWHERE ON THE ROAD. THE STUDS ARE SEVERELY RUSTED, ODD DISCOLORATION, YET THE NUTS HAVE NO RUST. I HAVE PHOTOS OF THE WHEEL, DRUM AND STUD PIECE W/NUT, IF DESIRED FOR INFORMATION.    A THIRD SHEARED OFF WHEN REMOVING THE WHEEL. I CONTACTED THE TRAILER MANUFACTURER TO ASK IF THERE WAS A PROBLEM WITH THESE TRAILER WHEELS OR ANY ALERTS/RECALLS. THEY HAVE NO REPORTED PROBLEMS LIKE THIS AND DIRECTED ME TO THE AXLE MANUFACTURER. THE DUAL AXLES ARE MANUFACTURED BY DEXTER. I HAVE AN EMAIL IN TO THEM NOW.     I'M CONCERNED ABOUT THE POTENTIAL ACCIDENT I AVOIDED WHILE PULLING THE TRAILER  AT 60-65 MPH WHERE THAT WHEEL COULD HAVE COME OFF. I'M ALSO CONCERNED ABOUT THE TWO REMAINING STUDS ON THAT WHEEL AND ALL STUDS ON THE OTHER THREE WHEELS.  *TR",
        "vin": "4YDT260236N"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/14/2012",
        "dateOfIncident": "06/06/2012",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10470628,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "SPRINGDALE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 KEYSTONE SPRINGDALE TRAVEL TRAILER. THE CONTACT STATED THAT THE TIRE AND THE FRAME INNER WHEEL WELLS EXHIBITED ABNORMAL BURNT MARKS. THE CONTACT NOTICED THERE WAS NOT ENOUGH CLEARANCE BETWEEN THE WHEEL WELLS AND THE FRAME. THE FAILURE WAS PRESENT ON BOTH REAR WHEELS. THE TRAILER WAS TAKEN TO A DEALER WHO RECOMMENDED ADDING LEAVE SPRINGS OR EXTENDING THE BRACKET OVER THE EQUALIZER. THE MANUFACTURER WAS MADE AWARE OF THE DEFECT HOWEVER, NO FURTHER ASSISTANCE WAS PROVIDED. THE CURRENT AND FAILURE MILEAGE WAS 2,000.",
        "vin": "4YDT267246C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "02/15/2008",
        "dateOfIncident": "08/19/2006",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10218119,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "SPRINGDALE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 KEYSTONE SPRINGDALE.  THE CONTACT STATED THAT THERE ARE FUMES INSIDE THE VEHICLE THAT BURN HER EYES.  THE DEALER STATED THAT THE CAUSE MAY BE FORMALDEHYDE AND RECOMMENDED THAT SHE AIR OUT THE VEHICLE.  THE WINDOWS HAVE BEEN CRACKED AND THE DOORS OPENED SINCE AUGUST OF 2006, BUT THE FUMES ARE STILL PRESENT.  THE CONTACT BELIEVES THE FUMES ARE COMING FROM THE CARPET AND WOOD.  UPDATED 03/04/08.  *LJ",
        "vin": "4YDT260256N"
    }
]