[
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "10/24/2008",
        "dateOfIncident": "06/20/2008",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10247049,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "OUTBACK",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "KEYSTONE RV COMPANY DOMETIC REFRIGERATOR RECALL.   CONSUMER STATES THAT THEY NEVER RECEIVED THE RECALL NOTICE AND THE COMPANY WILL NOT DO ANYTHING TO HELP.   *NJ  THE CONSUMER STATED WHEN SHE ENTERED THE RV, THERE WAS A STRONG SMELL OF AMMONIA. THE CONSUMER NOTICED THE RV WASN'T COOLING PROPERLY. THE REPAIRMAN INFORMED THE CONSUMER THERE WAS A CRACK IN THE BOILER TUBE IN THE REAR OF THE REFRIGERATOR. HE ALSO STATED IT LOOKED AS THOUGH IT WAS DEFECTIVE.  THE CONSUMER PAID TO HAVE THE COOLING UNIT REPLACED. ONE MONTH LATER, THE CONSUMER RECEIVED A RECALL LETTER IN THE MAIL. THE CONSUMER WAS TOLD BY THE MANUFACTURER THAT THE REPLACEMENT RECALLS WAS ONLY GOOD FROM APRIL 2007 TO APRIL 2008. *JB",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/30/2008",
        "dateOfIncident": "08/01/2008",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10243967,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "OUTBACK",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "NORMAL USE 4 TO 8 TIMES A YEAR. 6 OCCUPANTS AT TIME OF INCIDENT, 2 ADULTS, 4 CHILDREN. GREAT POTENTIAL FOR STARTING FOREST FIRE. SLIDEOUT WAS UNOCCUPIED AND HADN'T BEEN MOVED FOR 3 DAYS. WIRES ON SLIDEOUT SPONTANEOUSLY SHORT OUT AND BURN. TWO KNOWN INSTANCES IN LESS THAN TWO MONTHS, MINE AND ANOTHER OUTBACK OWNER, DIFFERENT MODELS AND YEARS (2006 28RSDS AND 2007 29BHS). EFFECTED WIRING NEEDS TO BE REWORKED WITH PROTECTIVE SLEEVING AND A FUSE INSTALLED AT SITE OF SHORT CIRCUIT OCCURRENCE. MORE INFORMATION INCLUDING INCIDENT DETAILS, PHOTOS AND EFFECTED MODELS AT HTTP://TINYURL.COM/3QKMUK OR BY CALLING ME. *TR",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/22/2008",
        "dateOfIncident": "07/24/2005",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10243121,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "OUTBACK",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "5TH WHEEL TRAVEL TRAILER, REFRIG. HAD TO BE REPLACED (FIRE HAZARD) HAD TO TAKE COMPANY TO SMALL CLAIMS CT. HOT WATER HAD TO BE REPLACED, WINDOWS LEAK, SHOWER LEAKS, TOILET LEAKS, GRAY WATER AND BLACK WATER TANKS LEAK AND ARE CRACKED, NO SUPPORT OF THESE TANKS, ONLY THING HOLDING THEM ARE THE PIPES GOING TO THEM. WIRES AND PLUMBING PIPES JUST LAYING ON TOP OF TANKS. CANNOT PUT ON THE ROAD AS TANKS WILL FALL OFF. THIS IS DANGEROUS. BORDER IN UNIT WAS BROWN NOW TURNING GREEN.  USED ON THE ROAD ONLY ONE TIME HAS BEEN SITTING SINCE. UNIT 3 YEARS OLD. NO AIR COND. OR HEAT IN BEDROOM. CALLED KEYSYONE BUT THEY SAY EVERYTHING IS OUT OF WARRANTY BUT THERE IS NOTHING I CAN FIND ABOUT THE HOLDING TANKS.  *TR",
        "vin": ""
    }
]