[
    {
        "components": "WHEELS,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/04/2021",
        "dateOfIncident": "10/01/2021",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435323,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I purchased this vehicle from a private seller in August 2021 and attempted to obtain records of the vehicle Kia America Case ID #14353653 which Kia America has yet to provide me any information. I had a full diagnostic done by a certified mechanic at Borst Automotive in the state of Arizona on 09/18/21 where several concerns were reported to me that Kia failed to report. There is a new and concerning grinding with the engine on my 2006 Kia Sportage LX that sounds like it might be an exhaust leak.  I hear loud grinding sounds now when turning on the car that immediately sound when it is fired up, and when accelerating is the worst, but the sound starts loud and is immediate when I turn on the vehicle and fire up the engine. Two days ago on 10-01-21 which was the last night I drove it as it feels unsafe to drive now, I did not get far before the front driver's tire closest to the engine completely blew out/ and exploded coming off of it's wheel and cap hinting at a potential engine problem or recalled defect. I had to immediately pull over and call AAA to come put the spare donut on my car to get it back home to park. The engine appears to have something wrong with the exhaust system and it sounds bad. I reported this today to Kia America case ID #14407655. I always make it a point to to check fluids and something is not right here. The car is overheated but Radiator is fine and coolant, and all other engine fluids are full but could be an engine issue that is dangerous.  This engine sounds like it will burst at any minute its grinding and stalling so bad. Made an appointment with Royal Kia in my hometown Tucson, AZ for October 12, 2021 to have the fuel tank straps replaced and towed as apparently they are faulty and this was the soonest this dealership could perform this. I know the 2010-2021 Sportage models were recalled under Safety Recall 20V-750 but since this recall is somewhat new and yet to discover other Kia Sportage’s that might also be affected. Consumer also noticed malfunctioning of brake and tail lights when pushing the brake pedal and without pushing on it. Taillight bulb had to be replace immediately when purchasing the vehicle.  Headlight/lamps were also faulty and replacement on the driver's side as well as replacement of the tire on the driver's side already occurred in the few short weeks consumer owned the vehicle.",
        "vin": "KNDJF723967"
    },
    {
        "components": "AIR BAGS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/28/2020",
        "dateOfIncident": "10/23/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385351,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS RIDING DOWN THE ROAD AND THE AIRBAG LIGHT CAME ON. TWO DAYS LATER THE CHECK ENGINE LIGHT CAME ON. MY MECHANIC THINKS IT IS A SENSOR FOR THE CHECK ENGINE LIGHT. HAVING TROUBLE WITH COVID-19 GETTING THE PART, BEEN WAITING FOR OVER A WEEK. MY MECHANIC HAS RECOMMENDED ME TAKING THE CAR TO A KIA DEALER SHIP WITH THE AIRBAG LIGHT COMING ON. HE THOUGH FOR SURE IT WOULD HAVE A RECALL BUT I DO NOT SEE ONE LISTED.",
        "vin": "KNDJF723267"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/25/2020",
        "dateOfIncident": "11/21/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376365,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS CAR CONTINUES TO HAVE PROBLEMS WITH SPEEDING UP AND SLOWING DOWN ON ITS OWN, AT THIS POINT IT SHUT OFF ANY TIME I WAS SLOWING DOWN FOR A LIGHT OR STOP. IT CUT OFF MULTIPLE TIMES ON A HIGHWAY GOING 75 MPH. VERY SCARY WITH KIDS IN CAR. WAS ABLE TO GET HOME AND IT WILL NOT TURN OVER OR START BACK UP GETTING DIAGNOSED TODAY, THERE NEEDS TO BE SOMETHING DONE ABOUT THIS ISSUE, I HAVE READ 100S OF SIMILAR PROBLEMS LIKE THIS! KIA YOUR PUTTING OUR LIVES IN DANGER, PREGNANT WITH 2 KIDS AND CAR SHUTTING OFF ON HIGHWAY, OR SPEEDING UP AND SLOWING DOWN BY IT SELF IS TRAUMATIZING. DO SOMETHING BEFORE SOMEONE IS BADLY HURT!! ALSO I AM BIG AND PREGNANT AND DRIVER DOOR DOES NOT OPEN I AM ASSUMING THAT TOO IS AN ELECTRIC ISSUE EITHER WAY I HAVE TO CLIMB OVER SEATS, THIS CAR LOOKED GREAT AFTER 1 DAY DOOR STOPPED WORKING AND WITHIN A FEW WEEKS OF OWNING IT NOW SPEED! KIA YOU REALLY NEED TO FIX ALL THESE ISSUES SEEMS TO ME THERE IS ELECTRIC PROBLEMS ALL THROUGHOUT THE CAR. PLEASE HELP",
        "vin": "KNDJE723367"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "11/19/2020",
        "dateOfIncident": "11/03/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11375451,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HIT THE SIDE OF A CAR I DIDN'T SEE WHILE PULLING OUT OF A CAR PARK ONTO THE ROAD, SO I WAS MOVING SLOWLY FORWARD. A CAR HAD APPEARED FROM BEHIND 2 TURNING CARS AND I HIT THE SIDE OF IT. NEITHER THE AIR BAG OR THE SEAT BELT IN MY CAR STOPPED MY HEAD FROM MAKING CONTACT WITH THE WINDSHIELD. I WAS VERY SHAKEN AT THE TIME AS ANYONE WOULD BE. THE FOLLOWING DAY I NEEDED TO REST, AND 2 DAYS LATER WENT TO ER WHERE I HAD A SCAN AND WAS DIAGNOSED WITH A CONCUSSION. OVER 2 WEEKS LATER, I AM MUCH BETTER BUT NOT YET FULLY RECOVERED. I RECEIVED A CITATION FROM THE ATTENDING POLICE OFFICER FOR CARELESS DRIVING. I HAVE CONTACTED CORPORATE KIA TO ASK WHY BOTH THE AIRBAG AND SEAT BELT FAILED TO HELP ME AVOID INJURY. I ATTACH A PHOTO OF THE FRONT OF MY CAR AND THE POLICE REPORT.",
        "vin": "KNDJF724267"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/19/2020",
        "dateOfIncident": "10/18/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365239,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY FRIEND AND I WERE DRIVING HOME AT 55 MPH WHEN MY SPORTAGE STARTING SPEEDING UP ON ITS OWN. THEN WHEN I TRIED TO STOPPED FOR A RED LIGHT IT WANTED TO CUT OFF. SO WHEN THE LIGHT CHANGED IT STARTED SPEEDING UP AND SLOWING ON IT'S OWN. THIS WENT ON FOR ABOUT  15 MILES. I HAVE NEVER HAD A CAR DO THIS. IT WAS REALLY SCARY. AT ONE POINT IT CUT OUT IN THE MIDDLE OF THE HIGHWAY. THANK GOD THERE WAS NOONE ELSE BEHIND ME. I DID MAKE IT HOME AND IT DIED PULLING IN THE DRIVE.",
        "vin": "KNDJE723867"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/06/2019",
        "dateOfIncident": "09/01/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11287543,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE LIGHTS STAY ON AFTER TURNING OFF THE IGNITION AND SHUTTING OFF THE LIGHTS.  HAVE TO TURN LIGHTS ON OFF DEPRESS THE BRAKE PEDAL, TURN ON AND OFF THE LIGHTS AND KEEP DOING IT UNTIL THEY GO OFF..  HAS BEEN HAPPENING FOR OVER A YEAR.  READ ONLINE THAT THERE'S A HISTORY OF THIS BUT NO RECALL.",
        "vin": "KNDJF723167"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/19/2019",
        "dateOfIncident": "11/08/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11280983,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 KIA SPORTAGE. THE CONTACT STATED THAT THE ELECTRIC CONTROL HARNESS FAILED. WHILE DRIVING 60 MPH, THE VEHICLE DECELERATED TO 30 MPH AND THEN ACCELERATED BACK TO NORMAL. IN ADDITION, THE CHECK ENGINE WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS TAKEN TO HERTRICH KIA (6546 OCEAN GATEWAY, EASTON, MD 21601, (410) 200-9784) WHERE IT WAS DIAGNOSED THAT THE ELECTRIC CONTROL HARNESS NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED DUE TO THE REPAIR FEES. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 137,723. *BF*JB",
        "vin": "KNDJE723167"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/05/2019",
        "dateOfIncident": "10/07/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11278272,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 KIA SPORTAGE. THE CONTACT STATED THAT THE BRAKE LIGHTS REMAINED ILLUMINATED INDEPENDENTLY WHEN THE VEHICLE WAS TURNED OFF AND STATIONARY. IN ADDITION, THE ESC WARNING INDICATOR REMAINED ILLUMINATED AND THE CRUISE CONTROL WAS NOT WORKING. THE CONTACT ALSO STATED THAT IN ORDER TO TURN OFF THE BRAKE LIGHTS, HE HAD TO DISCONNECT THE VEHICLE'S BATTERY. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE DEALER AND MANUFACTURER WERE NOT NOTIFIED. THE CONTACT ASSOCIATED THE FAILURE WITH NHTSA CAMPAIGN NUMBER: 09V130000 (EXTERIOR LIGHTING), BUT THE VIN WAS EXCLUDED. THE FAILURE MILEAGE WAS APPROXIMATELY 240,000.",
        "vin": "KNDJE723167"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/26/2019",
        "dateOfIncident": "04/19/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11258287,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG NOT ENGAGED LIGHT IS ON",
        "vin": "KNDJF723267"
    },
    {
        "components": "STRUCTURE,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/17/2019",
        "dateOfIncident": "09/15/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11256294,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I PREVIOUSLY COMPLAINED OF REPEATED STUCK ACCELERATOR PEDAL.  AT 179,510 MILES ACCELERATOR PEDAL BEGAN TWISTING OUT OF ITS STANDARD POSITION.  AN INSPECTION REVEALED THE BOLT SECURING THE ACCELERATOR PEDAL AND THE THREADED HOLE IN FLOOR CRACKED AND SEPARATED FROM THE FLOOR",
        "vin": "KNDJF724067"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/29/2019",
        "dateOfIncident": "05/01/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11252159,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "BACK IN MAY OF THIS YEAR, I HEARD OF A RECALL FOR GAS TANK STRAPS ON MY CAR - SO CALLED KIA AND THEY SAID TANK STRAPS HAD BEEN RECALLED AND CORROSION PROTECTION (UNDERCOATING) WAS ALSO A REMEDY THAT WAS COVERED BY THE RECALL. I ARRANGED RECALL SERVICE AT CLOSEST DEALER (1 1/2 HOURS AWAY) WHO ORDERED THE TANK STRAPS FOR ME.  UNFORTUNATELY, ONCE AT THE DEALERSHIP, THE SERVICE TECH SAID THAT HE COULD NOT REPLACE THE STRAPS BECAUSE HE WAS CONCERNED THAT THE GAS TANK \"WOULD FALL APART DUE TO CORROSION ALONG THE WELDED SEAM OF THE TANK\" A COMMON PROBLEM KNOWN TO KIA. BECAUSE THE TECH DID NOT HAVE A NEW TANK IN STOCK, I ASKED HIM IF HE COULD GET ONE FROM A JUNK YARD, HE SAID THAT SUCH A USED TANK \"WOULD LIKELY HAVE THE SAME PROBLEM.\"  I HAVE BEEN TRYING TO GET KIA TO REPLACE THE STRAPS AND TANK AT THEIR EXPENSE AND TO  FOLLOW-UP WITH UNDERCOATING AS THEY ARE OBLIGATED TO DO - FOR MONTHS!  I HAVE CALLED KIA CONSUMER AFFAIRS AND KIA AMERICA MANAGEMENT IN IRVINE CA MULTIPLE TIMES OVER THE PAST MONTHS. THE ONLY RESPONSE I HAVE HAD THUS FAR WAS FROM JESSICA WEAVER OF KIA'S CONSUMER AFFAIRS DEPT (520 772 4714) MS WEAVER HAS REPEATEDLY REQUESTED THAT I GIVE HER MORE TIME AND SHE REPEATEDLY FAILS TO FOLLOW-THROUGH ON HER COMMITMENTS TO CALL BACK. MY LATEST CONTACT FROM HER WAS TWO WEEKS AGO WHERE SHE AGAIN REQUESTED MORE TIME (FIVE DAYS) TO RESOLVE THE ISSUE - - I AGAIN NEVER HEARD BACK FROM MS WEAVER. WHAT MS WEAVER HAS CONVEYED TO ME IS THAT THE REGIONAL PARTS AND SERVICE MANAGER NEEDS TO APPROVE THE REPAIR AND REVIEW THE PHOTOS THAT WERE TAKEN OF THE GAS TANK ...AND SHE CANNOT GET TO HIM. I HAVE REPEATEDLY RESPONDED THAT THERE MUST BE SOMEONE AT KIA WHO CAN APPROVE THE REPAIR. MY SENSE IS THAT THIS POOR WOMAN HAS BEEN TOLD TO JERK ME AROUND UNTIL I GIVE UP ...THIS WILL NOT HAPPEN.  THANKS FOR YOUR HELP IN GETTING KIA TO MEET THEIR OBLIGATION.  [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *TT",
        "vin": "KNDJE723967"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/13/2019",
        "dateOfIncident": "08/12/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243525,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "PREVIOUSLY REPORTED ENGINE SURGES / ERRATIC IDLE AT 177800 MILES, AND THROTTLE BODY CLEANED AT 177900 MILES.  AT 178345 THE IDLE AIR CONTROL VALVE WAS CLEANED AS A PRECAUTION, DUE TO THE PREVIOUS SYMPTOMS.  AT 178377 WHILE DRIVING ON THE HIGHWAY I FOUND THE THROTTLE STUCK IN THE FULL OPEN POSITION.  AFTER SAFELY STOPPING THE VEHICLE, I HAD TO MANUALLY RETURN THE THROTTLE TO THE NORMAL POSITION.  UPON RESTARTING THE VEHICLE I BEGAN EXPERIENCING ERRATIC IDLING 3000 TO 4000 RPM.  ONCE PARKED AT 178382 THE IDLE AIR CONTROL VALVE WAS RECHECKED, AND ENGINE IDLE RPM RETURNED TO NORMAL.  I CHECKED THE OBDII AND FOUND NO PREVIOUS OR PENDING CODES. I WILL REPLACE THE IDLE AIR CONTROL VALVE.",
        "vin": "KNDJF724067"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/09/2019",
        "dateOfIncident": "08/08/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11242745,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE BRAKING THE VEHICLE APPEARED TO BE PICKING UP SPEED.  WHEN I DEPRESSED THE CLUTCH THE ENGINE SURGED PAST 2000 RPM.  WHILE DRIVING ON A DOWNGRADE THE VEHICLE WAS PICKING UP SPEED, AND I DEPRESSED THE CLUTCH AND THE ENGINE RPM WENT 2000 RPM FOR SEVERAL SECONDS.  FROM MY EXPERIENCES WITH OTHER VEHICLES I THOUGHT: MAYBE THE DRIVER'S MAT SHIFTED, OR SOME OTHER OBJECT MAY HAVE FALLEN AND WAS INTERFERING WITH THE ACCELERATOR PEDAL. I FELT AROUND THE PEDAL WITH MY FOOT, BUT FOUND NO FOREIGN OBJECTS. I USED THE TIP OF MY FOOT TO MAKE THE ACCELERATOR PEDAL WAS UP ALL THE WAY, AND THEN ENGINE RPM APPEARED TO GO TO NORMAL.  WHEN I REACHED MY DESTINATION I TAPPED ON THE ACCELERATOR PEDAL A FEW TIMES TO RE-CREATE  THE PROBLEM.  THE ENGINE WENT TO 2000 RPM FOR ABOUT 3 SECONDS, AND CAME BACK DOWN.  I CHECKED FOR ANY CODES USING AN OBD II SCANNER, HOWEVER NONE WERE FOUND.",
        "vin": "KNDJF724067"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/09/2019",
        "dateOfIncident": "08/09/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11242925,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I PREVIOUSLY REPORTED AT 177,800 MILES THAT I WAS EXPERIENCING ENGINE SURGES.  WHILE DRIVING IF I DEPRESSED THE CLUTCH ENGINE WOULD RISE TO 2000 RPMS.  IF I PULLED THE ACCELERATOR PEDAL UP WITH TIP OF MY FOOT, THE ENGINE RPMS WOULD RETURN NORMAL.  AT 177, 900 MILES THE THROTTLE BODY ASSEMBLY WAS CLEANED, AND I AM NO LONGER EXPERIENCING ENGINE SURGES.",
        "vin": "KNDJF724067"
    },
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/03/2019",
        "dateOfIncident": "03/29/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217471,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD THIS ISSUE MULTIPLE TIMES. AND THE DEALER COULDN'T FIND THE PROBLEM SO THEY ONLY DELETE THE ERROR. THE FIRS ISSUE IS THE PASSENGER AIR BAG (AIRBAG LIGHT ERROR) THE ERROR SEEMS TO BE THE SENSOR INSIDE THE SEAT.. AND THE SECOND ERROR THE SPEEDOMETER IS NOT SHOWING THE CORRECT SPEED. THE SPEEDOMETER IS READING ABOUT 5 MILE OFF.",
        "vin": "KNDJF723667"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/26/2019",
        "dateOfIncident": "03/24/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11191663,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ABS MODULE FAILURE. CAR WAS TRAVELING AT LOW SPEED WHEN ALL OF A SUDDEN IT APPEARED TO LOOSE POWER. IT TURNED OUT THAT THE REAR RIGHT WHEEL AND THE FRONT LEFT WHEEL HAD LOCKED UP DUE TO THE FAILURE. I WAS ABLE TO MOVE OFF THE MAIN ROAD WE WERE ON.",
        "vin": "KNDJF724767"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/31/2018",
        "dateOfIncident": "05/28/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11164234,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STALLED WHILE DRIVING ON HIGHWAY AT APPX. 40 MPH. VEHICLE DID NOT RESTART, AND WILL NOT RESTART. MECHANICS HAVE PROBLEM CONNECTING SCANNERS TO PMC AND EFFECTING REPAIRS. SEVERAL SCANNERS, INCLUDING PROFESSIONAL SCANNERS ARE UNABLE TO RETRIEVE VEHICLE'S DATA. SCANNERS, SAYS \"CHECK CONNECTION TO VEHICLE COMPUTER\"  AND \"WAITING FOR RESPONSE FROM VEHICLE\". VEHICLE IS COMPLETELY DISABLED. TOTAL OPERATING MILAGE OF VEHICLE IS 38,500 MILES.",
        "vin": "KNDJF724867"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "12/21/2018",
        "dateOfIncident": "06/01/2018",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11162934,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 KIA SPORTAGE. THE CONTACT STATED THAT THE COOLING FAN FAILED. THE CONTACT INSPECTED THE VEHICLE AND FOUND THAT THE BLOWER MOTOR FAN WIRING HAD MELTED. THE CONTACT STATED THAT THE VEHICLE EXHIBITED THE SAME SYMPTOM AS LISTED IN NHTSA CAMPAIGN NUMBER: 15V015000 (ELECTRICAL SYSTEM). THE VEHICLE WAS NOT TAKEN TO A DEALER TO BE DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 70,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/19/2018",
        "dateOfIncident": "06/11/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11102637,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 KIA SPORTAGE. THE CONTACT STATED THAT AN UNDERCOATING PROCEDURE WAS PERFORMED ON THE VEHICLE VOLUNTARILY, BUT THE FRAME BECAME CORRODED AND THE VEHICLE WOULD NOT PASS INSPECTION. THE VEHICLE WAS TAKEN TO FRED BEAN'S KIA OF MECHANICSBURG (6302 CARLISLE PIKE, MECHANICSBURG, PA 17050) WHO VERIFIED THE CORROSION AND THE FACT THAT IT WOULD NOT PASS INSPECTION. THE DEALER STATED THAT THE FAILURE WAS UNREPAIRABLE.  THE CONTACT CALLED THE MANUFACTURER AND WAS AWAITING A CALL BACK. THE FAILURE MILEAGE WAS 99,700.",
        "vin": "KNDJF723767"
    },
    {
        "components": "AIR BAGS,SEAT BELTS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/13/2018",
        "dateOfIncident": "05/30/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11101671,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DEALER DIAGNOSTICS CAME UP WITH CODES B1495 PODS, B1495 BTS & C1513 ABS   AIR BAG LIGHT CAME ON WHEN STARTING & STAYED ON. HAD BRAKE SWITCH REPLACED PER RECALL A FEW MONTHS AGO & KNOW HAVE A ABS CODE THAT COULD BE THE SWITCH AGAIN",
        "vin": "KNDJE723667"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/14/2018",
        "dateOfIncident": "04/09/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11093662,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECENTLY PURCHASED THIS CAR FROM CACTUS JACKS DURING EASTER WEEKEND 2018. WITH IN THE FIRST WEEK WHILE DRIVING THE ENGINE SHUT OFF WHILE IN MOTION BUT COMING TO A STOP. I THOUGHT IT WAS WEIRD AND THAT IT MAY HAVE BEEN USER ERROR. TO DATE IT HAS DONE THE SAME THING ABOUT A DOZEN TIMES. IT OCCURS WHILE IN MOTION WHILE SLOWING DOWN TO EITHER STOP OR TURN. IT HAS BEEN ON A CITY STREET. TRAFFIC CONDITIONS VARY. THE GAUGE PANEL LIGHTS UP AS IF THE KEY IS IN THE ON POSITION, AND IT ALMOST FEELS AS IF THE ENGINE IS STILL RUNNING BUT ITS NOT MOVING. AND IT ALSO DOESN'T SEEM LIKE A TRANSMISSION ISSUE BECAUSE THE TRANSMISSION DOESNT HAVE ANY PROBLEMS ANY OTHER TIME.",
        "vin": "KNDJF723767"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/26/2018",
        "dateOfIncident": "03/26/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11081225,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL I JUST PURCHASED MY KIA SPORTAGE ON 3/15/2018 AT A DEALERSHIP AND HAVE BEEN DRIVING WITH THE AIRBAG LIGHT ON. I HAVE BROUGHT THIS UP TO THE DEALER AND AM TOLD THAT THE AIRBAG LIGHT DOESN'T MATTER. AS I'M READING ALL THESE COMPLAINTS AND THOSE THAT HAVE BEEN IN ACCIDENTS THE AIRBAGS DO NOT DEPLOY, MY SAFETY IS AN ISSUE HERE. I AM CERTAIN THIS NEEDS TO BE LOOKED INTO. IT WILL BE SENT TO THE DEALER TO BE LOOKED AT. ALSO, I HAVE GOOGLED AS TO WHY MY BLOWER MOTOR WILL NOT SHUT OFF. THAT'S THE BLOWER RESISTOR THAT NEEDS TO BE REPLACED. THOSE COMPLAINTS ARE ON HERE ALSO, ALMOST CATCHING FIRE. I'VE NEVER FELT SO UNSAFE BEING IN A VEHICLE. THESE 2 MAIN FACTORS NEED TO BE INVESTIGATED IMMEDIATELY.",
        "vin": "KNDJE723567"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/16/2018",
        "dateOfIncident": "01/15/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11063037,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 KIA SPORTAGE. THE CONTACT STATED THAT THE AIR BAG WARNING INDICATOR ILLUMINATED RANDOMLY. THE FAILURE SOMETIMES OCCURRED WHILE DRIVING AND OTHER TIMES WHEN THE VEHICLE WAS JUST STARTED. THE VEHICLE WAS NOT TAKEN TO A DEALER OR AN INDEPENDENT MECHANIC FOR DIAGNOSTIC TESTING. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE CONTACT STATED THAT THE VEHICLE HAD BEEN EXHIBITING THE FAILURE FOR APPROXIMATELY TWO MONTHS. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 121,685.",
        "vin": "KNDJE723367"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/29/2017",
        "dateOfIncident": "11/13/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11051134,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, MY CAR JUST SHUTS DOWN.  THE ENGINE DIES.  ON SEVERAL OCCASIONS, DRIVERS BEHIND ME HAD TO SLAM ON BRAKES OR SWERVE OUTOF THE WAY.  THIS IS DANGEROUS WHILE TRAVELING ON THE HIGHWAY.  TOOK VEHICLE TO MECHANIC, THEY DON'T KNOW WHAT THE PROBLEM IS.  WENT ON INTERNET, AND MANY CUSTOMERS HAVING THE SAME PROBLEM.",
        "vin": "KNDJF723267"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/28/2017",
        "dateOfIncident": "08/22/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11020061,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWNHILL A CITY STREET AND BEGAN TO TURN RIGHT. AS I WAS SLOWLY TURNING GOING ABOUT 15-20MPH USING THE BRAKES, ANOTHER VEHICLE DRIVING APPROXIMATELY 25-40MPH, HIT MINE ON THE FRONT DRIVERS SIDE DAMAGING FROM THE HEADLIGHT TO THE DRIVERS DOOR. MY AIRBAG DID NOT DEPLOY.",
        "vin": "KNDJE723367"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/27/2017",
        "dateOfIncident": "07/25/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11011007,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MOTOR BLEW UP WHILE DRIVING ON A HWY, CAR STALLED, WHICH CAUSED THE STEERING WHEEL TO LOCK UP, AND THE BREAKS TO STOP RESPONDING.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/24/2017",
        "dateOfIncident": "07/22/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11010254,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT'S GRANDDAUGHTER OWNS A 2006 KIA SPORTAGE. WHILE DRIVING AT AN UNKNOWN SPEED, THE DRIVER HEARD A BANGING SOUND COMING FROM THE FRONT OF THE VEHICLE. THE CONTACT INSPECTED THE VEHICLE AND BELIEVED THAT THE HARMONIC BALANCER HAD FAILED. THE CONTACT SPOKE WITH GLASSMAN KIA (28000 TELEGRAPH RD, SOUTHFIELD, MI 48034) WHO ADVISED THE CONTACT TO BRING THE VEHICLE IN FOR DIAGNOSTIC TESTING. THE VEHICLE WAS NOT TAKEN TO A DEALER OR MECHANIC. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STATED THAT THERE WAS NO RECALL. THE APPROXIMATE FAILURE MILEAGE WAS 38,430.",
        "vin": "KNDJF723X67"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/16/2017",
        "dateOfIncident": "04/16/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10978703,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I WILL BE DRIVING AND THE ESC OFF LIGHTS GOES ON DASHBOARD. THE CAR FEELS LIKE IT WILL STALL OUT AND BECOMES SLUGGISH. I PULL OVER AND PARK THE CAR THEN IT WON'T GO INTO DRIVE OR OUT OF PARK.  I WAIT OVER 15 MINUTES AND AM ABLE TO DRIVE HOME.  I HAVE BROUGHT TO KIA DEALTERSHIP AND SAID IT WAS BRAKE SWITCH. THEY REPLACED THE BRAKE SWITCH AND THE PROBLEM PERSISTS. I WILL BRING IT IN TO DEALER SHIP AGAIN BECAUSE CAR SEEMS UNSAFE TO DRIVE. THE BRAKE SWITCH WAS REPLACED ON APRIL 3, 2017 AND STILL A RECURRING PROBLEM",
        "vin": "KNDJF724367"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/20/2016",
        "dateOfIncident": "05/12/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10936400,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 KIA SPORTAGE. WHILE DRIVING APPROXIMATELY 55 MPH, THE POWER SEIZED AND THE CHECK ENGINE WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE THROTTLE, RADIATOR, AND TIMING BELT NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED; HOWEVER, THE FAILURE RECURRED SEVERAL TIMES. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE AND VIN WERE UNKNOWN.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/12/2016",
        "dateOfIncident": "02/02/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10925586,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE 2010 I HAVE HAD AN ISSUE WITH MY AIRBAG LIGHT COMING ON. I WAS WELL WITHIN WARRANTY WHEN THIS BEGAN WITH MILEAGE AT 35,736. THE DEALERSHIP HAS REPAIRED IT MULTIPLE TIMES; REPLACED BUCKLE TENSORS, REPLACED SEAT, HARNESS, RERAN THE CODES, ETC. TO DATE, IT IS STILL NOT CORRECTED AFTER MULTIPLE ATTEMPT. I RECENTLY RECEIVED A LETTER FROM KIA CORPORATION OFFERING A FINAL SETTLEMENT TO CORRECT THIS ISSUE. HOWEVER, THEY WOULD NOT ANSWER MY QUESTION IN WRITING ON WHETHER OR NOT THIS FINAL FIX WOULD WOULD WORK AND IF THEY WOULD WARRANTY THIS FIX. I ASKED THE DEALERSHIP IF THE AIRBAGS WOULD DEPLOY UPON ACCIDENT. THEY SAID THEY DO NOT KNOW FOR SURE, BUT IT IS LIKELY THEY WILL NOT DEPLOY. MY AIRBAG LIGHT IS ON AGAIN AFTER THE MOST RECENT REPAIR WHICH REPLACED THE SEAT. I HAVE PAID FOR A MAJORITY OF THESE FIXED. MOST IMPORTANT TO ME IS OUR SAFETY. CANNOT AFFORD TO BUY ANOTHER CAR AND WITH THE AIRBAG LIGHT ON I AM AFRAID TRADE IN VALUE WOULD BE REDUCED. IN 2012 KIA RECALLED ALMOST 150,000 OPTIMAS AND RONDOS FOR AIRBAG ISSUES. I RESPECTFULLY ASK THAT YOU CONSIDER THE KIA SPORTAGE AIRBAG FOR RECALL.",
        "vin": "KNDJE723767"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/03/2016",
        "dateOfIncident": "12/30/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10824077,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "RIGHT AFTER CHRISTMAS AND BEFORE NEW YEAR'S EVE I RECEIVED A PHONE CALL FROM A LADY STATING SHE WAS A KIA REPRESENTATIVE.   MY VEHICLE WAS PART OF THE RECALL FOR THE BRAKE SWITCH.  ABOUT TEN DAYS AFTER THE CALL MY BRAKE LIGHTS WOULD NO LONGER GO OUT EVEN WHEN THE VEHICLE HAD BEEN SITTING STILL OVERNIGHT.  THAN ABOUT 3-5 DAYS LATER MY ESC OFF LIGHT CAME ON AND NOW ALWAYS STAY ON WHEN THE CAR IS BEING DRIVEN. THIS PAST WEEKEND I SENT A SERVICE REQUEST ONLINE FOR THE BRAKE SWITCH ISSUE TO BE FIXED. I DID  BUNCH OF RESEARCH AND FOUND OUT THAT THE BRAKE SWITCH WAS THE ONE CAUSING THE OTHER ISSUES AND STILL CAN CAUSE MORE. ON 2/1/16 A KIA SERVICE EMPLOYEE CALLED AND LEFT A MESSAGE STATING THAT THE RECALL DIDN'T APPLY TO MAY CAR. LATER ON THAT SAME DAY MY CRUISE CONTROL STOPPED WORKING. FROM ALL THE RESEARCH I DID THE BRAKE SWITCH IS THE CAUSE FOR ALL THREE PROBLEMS I'M HAVING NOW. WHAT I DON'T UNDERSTAND IS HOW CAN OTHER 2006 KIA SPORTAGES WHO HAVE HAD THE SAME ISSUE LIKE ME IS COVERED BUT MY CAR IS NOT.",
        "vin": "KNDJF723567"
    },
    {
        "components": "STEERING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/11/2015",
        "dateOfIncident": "06/29/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10747862,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 KIA SPORTAGE. WHILE DRIVING AT 30 MPH, THE POWER STEERING FAILED AND THE ALTERNATOR LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN TO A DEALER, WHERE IT WAS DIAGNOSED THAT THE ENGINE CRANK SHAFT PULLEY DETACHED AND NEEDED TO BE REPLACED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 119,000.",
        "vin": "KNDJE723267"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "04/27/2015",
        "dateOfIncident": "04/20/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10713222,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLES HEATING AND COOLING UNIT STARTED WORKING SPORADICALLY. THEN STOPPED AND YOU COULD SMELL A BURNING SMELL. TOOK TO MECHANIC AND WAS TOLD WE WERE LUCKY THE VEHICLE HAD NOT CAUGHT FIRE. THE WIRE AND CONNECTOR TO THE BLOWER MOTOR RESISTER WERE MELTED AND FALLING APART. THE CONNECTOR ITSELF WAS MELTED. HE DISCONNECTED THE UNIT TO PREVENT IT FROM CATCHING FIRE. THIS SEEMS TO BE AN EXTREME SAFETY HAZARD, BEING THAT MY DAUGHTERS FEET WERE DIRECTLY BELOW THE AREA THAT WAS SMOKING AND MELTING, ABOUT TO CATCH FIRE. IT IS JUST BELOW THE DASH ON THE PASSENGER FRONT SEAT SIDE. THIS APPEARS TO HAVE HAPPENED MANY TIMES WITH THIS VEHICLE MODEL BY READING ONLINE REPORTS. I HOPE SOMETHING IS DONE ABOUT IT BEFORE SOMEONE IS BURNT OR WORSE.   *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION,AIR BAGS,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "04/25/2015",
        "dateOfIncident": "03/26/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10712824,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS INVOLVED IN A HEAD ON COLLISION WITH ANOTHER VEHICLE WHICH WAS TRAVELING APPROXIMATELY 30 MPH. THE VEHICLE WAS DECLARED TOTALED DUE TO THE EXTENSIVE FRONT END DAMAGE. THE AIRBAG SENSOR WAS DAMAGED AND THE AIRBAGS NEVER DEPLOYED.  *TR",
        "vin": "KNDJF724167"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/17/2015",
        "dateOfIncident": "04/01/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10706241,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ESC OFF LIGHT GOES ON AND OFF ALL THE TIME .  I HAVE NEVER TOUCHED THE BUTTON - THE BRAKE LIGHTS DO NOT ALWAYS WORK EITHER.  I HAVE REPLACED THE BULBS MANY TIMES, HOWEVER NOW I CANNOT OPEN THE BACK HATCH IT SEEMS TO BE STUCK NEITHER THE PUSH BUTTON OR THE KEY WILL OPEN BACKHATCH OR WINDOW - MAKING IT NOW IMPOSSIBLE TO GET TO BRAKE LIGHT TO CHANGE BULB-VERY UNSAFE.  *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/10/2015",
        "dateOfIncident": "04/09/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10705029,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIR BAG LIGHT IS ON AT TIMES.  I AM CONCERNED THE AIR BAGS WILL NOT DEPLOY IN CASE OF AN ACCIDENT.    *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/12/2015",
        "dateOfIncident": "03/02/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10671065,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 KIA SPORTAGE.  CONSUMER WRITES IN REGARDS TO AIRBAG FAILURE.  *SMD  CONSUMER SENT ADDITIONAL CORRESPONDENCE.  *SMD  CONSUMER SENT ADDITIONAL CORRESPONDENCE ON 1/23/15.  *SMD  THE CONSUMER WANTED A WAIVER FOR THE AIR BAG FAILURE, DUE TO THE FACT, THE VEHICLE WOULD NOT PASS INSPECTION. *JB  THE DEALER INFORMED THE CONSUMER THE SEAT SENSOR WASN'T WORKING PROPERLY AND IT WOULD COST $1800. HOWEVER, THERE WAS NO GUARANTEE THE REPAIR WOULD RESOLVE THE PROBLEM. UPDATED 07/01/15. *JB  UPDATED 07/06/15. *JB",
        "vin": "KNDJE723667"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/30/2014",
        "dateOfIncident": "10/08/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10669170,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 KIA SPORTAGE. THE CONTACT STATED THAT THE BRAKE LIGHTS FAILED TO ILLUMINATE WHEN THE BRAKE PEDAL WAS DEPRESSED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC AND A DEALER ON NUMEROUS OCCASIONS WHERE THE BRAKE LIGHTS WERE REPLACED, BUT THE FAILURE RECURRED AFTER EACH REPAIR. THE CONTACT ALSO STATED THAT THE ESC WARNING LIGHT CONTINUOUSLY ILLUMINATED. THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 09V130000 (EXTERIOR LIGHTING). THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "KNDJF723367"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/16/2014",
        "dateOfIncident": "12/03/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10664484,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DEAR NHTSA,  I HAVE A 2006 KIA SPORTAGE WITH 69,245 MILES AND HAVE BEEN IN THE DEALER ON 12/4/14, 12/8/2014, 12/13/14, FOR ENGINE SHUTTING OFF WHILE BRAKING TO ENTER ANOTHER LANE OR TO TURN. ENGINE SHUT OFF AGAIN WHILE BRAKING TO TURN AT 9:00PM ON 12/16/14.ENGINE LIGHT HAVE COME ON AT LEAST 6-8 TIMES BEFORE AT WHICH EACH TIME I WENT INTO THE SERVICE DEALER  ON 12/3/14, 12/8/14 AND 12/10/14.  SOMETIMES IF IT WAS DURING THE DAY I TOOK THE KIA DIRECTLY TO THE DEALER. HOWEVER I NOTICED WHILE RESEARCHING THAT THIS IS AN ELECTRICAL ISSUE WITH A FAULTY THROTTLE SYSTEM.  IN ADDITION KIA WANTS TO CHARGE ME $248 TO REPLACE A THROTTLE.  FROM THE REVIEWS ISSUED ONLINE THIS IS A SAFETY RELATED DEFECT THAT KIA MANUFACTURER IS AWARE. ACCORDING TO SAFECAR.GOV THE CONSUMER SHOULD NOT HAVE TO PAY FOR A FAULTY THROTTLE (E.G. OR FAULTY PARTS) AND SHOULD BE REPLACED BY THE SERVICE DEALER.  FINALLY COBB COUNTY SERVICE (CUSTOMER # [XXX]) SUGGESTED REPAIR INVOICE STATED THAT AFTER REPLACING TPS NEED MORE DIAGNOSIS TIME WITH VEHICLE IN ORDER TO FIND OUT ISSUE?  I SHOULD HAVE TO PAY FOR A SAFETY RELATED DEFECTS (E.G. 267 OR MORE COMPLAINTS ONLINE NOT TO MENTION THE SAFETY DEFECTS OF THE 2006 SPORTAGE ENGINE SHUTTING OFF), ESPECIALLY TO PAY FOR A PART THAT WILL NOT GUARANTEE THAT THE ENGINE WILL NOT CUT OFF.  I ALSO FILED AN INQUIRY WITH KIA ON TODAY 12/16/2014, CUSTOMER IDENTIFICATION REFERENCE NUMBER (#[XXX]).I  AM AWAITING A CALL FROM KIA ABOUT THIS INQUIRY.  I ALSO BELIEVE THAT THIS IS A SAFETY RELATED DEFECT AND THE COST OF REPAIRS SHOULD BE REMEDIED AT NO COST TO ME.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "KNDJF723767"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/25/2014",
        "dateOfIncident": "06/02/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10660838,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY AIR BAG CAME ON AROUND JUNE OF 2014 AND NOW REMAINS ON. I AM TOLD BY MY MECHANIC IT IS THE AIR BAG IMPACT SENSOR SWITCH #95930 2E000. THE REPLACEMENT PART IS $268.15 WITH A $39.00 REMOVAL AND REPLACEMENT FEE. THE DIAGNOSTICS IS $32.50. IF THIS PART IS FAULTY AS INDICATED IN MY WEB SEARCH, WHY AM I PAYING OUT OF POCKET TO A FAULTY SAFETY SWITCH? WHERE IS/ARE THE RECALL LETTER(S)?  *TR",
        "vin": "KNDJF723467"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/24/2014",
        "dateOfIncident": "08/29/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10660531,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD KIA INSPECT THE AIR CONDITIONER BECAUSE IT STARTED WORKING SPORADICALLY.  I WAS INFORMED BY KIA THAT THEY DISCONNECTED THE UNIT TO PREVENT THE CAR FROM CATCHING ON FIRE.  VERBATIM:  FOUND BLOWER MOTOR BAD AND FRIED RESISTOR AND HARNESS. LEFT UNPLUGGED TO PREVENT FIRE FROM STARTING.  THIS VEHICLE IS WELL MAINTAINED AND CERTAINLY SHOULD NOT HAVE ANY AIR ISSUES UNLESS FREON IS NEEDED.  THIS VEHICLE IS STILL UNDER THE 10 YR WARRANTY, BUT IT IS JUST THE POWER TRAIN.  THIS ISSUE IS AN ISSUE THAT CAME STRAIGHT OFF THE MANUFACTURING LINE AND I AM NOT SURE HOW MANY VEHICLES HAVE CAUGHT ON FIRE, BUT I HAVE READ SIMILAR ISSUES ON THIS SITE.  KIA SHOULD BE HELD LIABLE FOR MANUFACTURING A 1 TON KILLING MACHINE.  IF THE CAR CAUGHT ON FIRE, I COULD HAVE BEEN KILLED OR SOME INNOCENT BYSTANDER IN MY PATH.  THEY UNHOOKED THE UNIT TO PRESERVE THE ENGINE, BECAUSE THAT IS STILL UNDER WARRANTY, NOT BECAUSE THEY ARE CONCERNED ABOUT THE SAFETY OF THE CONSUMER.  IT IS CRAZY THAT A RECALL HASN'T BEEN MADE YET.  ALSO, MY ESC LIGHT KEEPS POPPING ON AND OFF AND ACCORDING TO THE RECALL LIST 2006 KIA SPORTAGES HAD A RECALL FOR THE STABILITY CONTROL LAMP AND I WAS INFORMED MY 2006 WAS NOT INCLUDED IN THIS RECALL.  I HAD THIS FIXED WHEN I TOOK MY CAR IN BUT THE LIGHT STILL GOES ON AND OFF, WHICH IS ESSENTIALLY A HAZARD IF MY BRAKE LIGHTS ARE NOT ILLUMINATED OR I CANNOT TURN OFF MY CRUISE CONTROL.  THANK YOU FOR YOUR TIME.  NOT AN HONORABLE COMPANY AND DOES NOT STAND BEHIND THEIR PRODUCT.  *TR",
        "vin": "KNDJE723767"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/22/2014",
        "dateOfIncident": "11/08/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10660284,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM WRITING THIS LETTER, IN HOPES OF RECEIVING SOME TYPE OF DIRECT ASSISTANCE FROM YOUR AGENCY ON THESE SAFETY RELATED DECEPTIVE AUTOMOTIVE DEALERS, WHO CONTINUE TO PLAY WITH THE LIFE, DEATH AND SAFETY OF MANY CONSUMERS LIKE MYSELF, IT SEEM LIKE THE BETTER BUSINESS BUREAU (BBB), IS CONSTANTLY BEING HELD POWERLESS, WHEN IT COMES TO CONSUMERS COMPLAINT(S), THOSE DEALERSHIP ARE ALWAYS GIVEN THE GO AHEAD AND THEN PERMITTED TO CARRY ON THESE DECEPTIVE LIFE THREATENING SAFETY PRACTICES, WHENEVER COMPLAINTS ARE FILE AND FORWARDED TO THAT DEALERSHIP, THEY THEN INTENTIONALLY FAIL TO COMPLY BY BEING UNRESPONSIVE WITHIN THE ALLOWED TIME GIVEN, BY BBB CALCULATING THE CASES WILL THEN BE DROP, DISCARDED, AND STORE AWAY/CLOSED NEVER TO BE HEARD FROM AGAIN OTHER TO BE USED AS REFERENCE FOR THE GENERAL PUBLIC TO SEE THE BUSINESS RATING IN THE BBB WEB PAGE. WHAT IS ACTUALLY HAPPENING; THESE DEALERS ARE PURCHASING UNSAFE VEHICLES WITHIN THE WHOLESALE AUTOMOTIVE (DAMAGE AND DISABLED) MARKET, TURNING AROUND, AND COSMETICALLY TOUCHING THEM UP AND PLACING THEM ON THEIR LOT TO BE SOLD AND EVENTUALLY PLACE THEM BACK ON THE ROAD WITHOUT THE CONSUMER EVER AWARE THEY ARE SITTING IN A UNSAFE DANGEROUS DRIVABLE VEHICLE UNTIL IT'S TOO LATE. SOME OF THESE DISCREPANCIES ARE MUCH LARGER, ESPECIALLY WHEN THE CUSTOMER IS BEING DISCRIMINATED AGAINST DUE TO GENDER, AND CAN'T DO MUCH ABOUT IT,  BECAUSE THE DEALER, NOW HAS PITCH THE ISSUE THAT THE VEHICLE IS SAFE AND HAS BEEN SOLD AS IS CLEARLY FORGETTING THE FACT,  WHEN THIS WAS DONE WITH A CONCEALMENT CONCEPT OF DECEPTION BY SAYING SIGN HERE SIGN THERE, IMPLYING AND PASSING ALONG DURING THE SIGNING PROCESS, IF ANY OF THESE HIDDEN MALFUNCTIONING PROBLEM(S) ARE DISCOVERED WITHIN THIRTY DAYS, CONTACT ME PERSONALLY, THEN THOSE FOUND ISSUES WILL BE IMMEDIATELY REPAIR.  NOT ENOUGH MOVE TO FINISH THIS STATEMENT.   *TR",
        "vin": "KNDJF724167"
    },
    {
        "components": "AIR BAGS,SEATS",
        "crash": false,
        "dateComplaintFiled": "09/08/2014",
        "dateOfIncident": "08/30/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10631559,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIRBAG LIGHT HAS COME ON TWICE IN THE PAST YEAR. THE DEALER RESETS THE CODE/LIGHT AND CLAIMS I NEED TO HAVE THE PASSENGER SEAT REPLACED FOR APPROX. $2,000! THERE ARE OTHER 2006 KIA MODELS THAT HAVE BEEN RECALLED FOR FAULTY PASSENGER SEATS BUT NOT THE SPORTAGE. MY FAMILIES SAFETY IS BEING COMPROMISED AND THIS IS A KNOWN ISSUE THAT SHOULD HAVE A RECALL. I SHOULDN'T HAVE TO PAY OUT OF MY OWN POCKET TO REPAIR A FAULTY SAFETY ITEM.  IF IT'S A BIG ENOUGH ISSUE TO HAVE A REPAIR BULLETIN ISSUED IT SHOULD BE RECALLED IMMEDIATELY.  *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/29/2014",
        "dateOfIncident": "06/15/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10629415,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 KIA SPORTAGE. WHILE DRIVING 10 MPH, THE CONTACT ATTEMPTED TO DISENGAGE THE CRUISE CONTROL BY DEPRESSING THE BRAKE PEDAL, BUT THE VEHICLE FAILED TO STOP. THE CONTACT HAD TO PRESS THE CRUISE CONTROL BUTTON AND APPLY THE BRAKES MULTIPLE TIMES BEFORE THE CRUISE CONTROL DEACTIVATED. THE FAILURE OCCURRED TEN TIMES. THE VEHICLE WAS TAKEN TO THE DEALER, BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/25/2014",
        "dateOfIncident": "08/20/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10628244,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TRAVELING 60 MPH, ON HIGHWAY (PA TURNPIKE EXTENSION) NEAR ALLENTOWN, PA. FRONT END STARTED VIBRATING, ANOTHER DRIVER WARNED ME TO PULL OVER, WHEELS WOBBLING. FRONT LEFT CONTROL ARMS COMPLETELY RUSTED THROUGH AND CRACKED.   THERE'S BEEN KIA RECALLS FOR THIS, BUT KIA HAS REFUSED OWNERSHIP OF THIS DEFECT ON SPORTAGE. THEY DENIED COVERING ALL OR PART OF THIS $500 REPAIR + TOWING + LOSS OF USE. WE LIVE 2.5 HRS. AWAY FROM INCIDENT.  THIS IS A HIGHLY DANGEROUS ISSUE!    (I AM 54, HAVE OWNED MANY CARS. HAVE NEVER EXPERIENCE A RUSTED THOUGH SUSPENSION PART.)  KIA DID ISSUE A \"VOLUNTARY SERVICE CAMPAIGN\" WHICH WE RECEIVED 6/14, TO ADDRESS SPORTAGE NEEDING ADDITIONAL ANTI CORROSION UNDER VEHICLE IN STATES THAT USE SALT ON ROADS.  WE HAVE REQUESTED KIA TO RECONSIDER COVERING THIS DEFECT.  *TR",
        "vin": ""
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/23/2014",
        "dateOfIncident": "06/22/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10605181,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL ' THE CONTACT OWNS A 2006 KIA SPORTAGE.  WHEN THE CONTACT STARTED THE VEHICLE, THE REAR DRIVER'S SIDE TIRE LOCKED UP WITHOUT WARNING.  THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED.  THE MANUFACTURER WAS NOTIFIED.  THE FAILURE MILEAGE WAS 37,000.  JCC",
        "vin": "KNDJF723067"
    },
    {
        "components": "STEERING,WHEELS,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/17/2014",
        "dateOfIncident": "06/12/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10598989,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "RIDING DOWN  CHADDS FORD PA  ROUTE ONE  6/12/14 ( THURSDAY) WHEN MY CAR STARTED TO SHAKE OUT OF CONTROL HAD PULLED OVER IN THE MIDDLE OF AFTERNOON TRAFFIC .  ONLY TO FIND OUT THAT THE PASSENGER SIDE BACK TIE ROD CAME APART..  THE OUTER THREADS WERE STRIPPED.  I HAVE A PICTURE.  *TR",
        "vin": "KNDJF724167"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/28/2014",
        "dateOfIncident": "04/26/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10585190,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AS OF SATURDAY MY BRAKE LIGHTS WOULD NOT SHUT OFF, THEN I NOTICED WHILE DRIVING THE ELECTRONIC STABILITY CONTROL LIGHT KEPT FLASHING ON AND OFF BY ITSELF. AND THE CRUISE CONTROL WAS  NOT WORKING PROPERLY AS WELL. SO I GOT ONLINE TO INVESTIGATE THIS AND FOUND THERE WAS A RECALL FOR THIS EXACT PROBLEM WITH MY YEAR AND MODEL CAR. BUT WHEN I CALLED KIA THEY STATED THAT MY CAR WAS NOT PART OF THE RECALL AND THAT I WOULD HAVE TO PAY OUT OF POCKET FOR THE REPAIRS, EVEN THOUGH MY MAKE MODEL WAS RECALLED AND MY CAR WAS DOING THE SAME THING THAT WAS RECALLED.   *JS",
        "vin": "KNDJF723267"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "04/26/2014",
        "dateOfIncident": "03/04/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10585037,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER\"S SUN VISOR SUDDENLY DROPPED DOWN INTO FIELD OF VIEW. WILL NOT RETAIN POSITION OUT OF FIELD OF VIEW OF DRIVER.  *TR",
        "vin": "KNDJE723767"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/01/2014",
        "dateOfIncident": "04/01/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10576295,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I BELIEVE THIS TOPIC HAS NEVER BEEN ADDRESSED AND THIS ISSUE HAS CAUSED MANY ACCIDENTS IN THE PAST BECAUSE OF VISIBILITY.  THIS IS IN REFERENCE TO ALL VEHICLES WITH PLASTIC HEADLIGHT COVERS. THEY BECOME VERY CLOUDY AND DIMINISH THE BRIGHTNESS TO THE POINT WHERE VISIBILITY IS GREATLY IMPAIRED. IN THE PAST THEY WERE MADE OF GLASS AND WERE ALWAYS BRIGHT AND CLEAR. I BELIEVE THEY SHOULD BE BRIGHT AND CLEAR FOR THE LIFE OF THE CAR. THERE ARE AFTER MARKET CLEANERS AND POLISHES THAT DON'T REALLY WORK. THEY NEED TO BE MADE OF GLASS OR PLASTIC THAT DOESN'T GET CLOUDY.  *TR",
        "vin": "KNDJF724767"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/27/2013",
        "dateOfIncident": "04/11/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10557497,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIRBAG LIGHT TURNS ON WHEN SOMEONE IS SEATED IN THE FRONT PASSENGER SEAT AND DOES NOT TURN OFF. THIS DISENGAGES THE FRONT AIRBAGS. THE KIA DEALERSHIP HAS RE-SET THE COMPUTER SEVERAL TIMES, BUT CLAIMS IT IS A BAD SENSOR IN THE SEAT. THE ENTIRE SEAT MUST BE REPLACED.  *TR",
        "vin": "KNDJF723567"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/21/2013",
        "dateOfIncident": "11/01/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10553269,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "PRIOR COMPLAINT FILED FOR AIRBAG LIGHT/SENSOR.  MY AIRBAG LIGHT CAME ON, WENT TO THE DEALER, THEY TRIED TO RESET THE LIGHT, IT WOULD NOT GO OFF.  MANY COMPLAINTS ON THE 2006 SPORTAGE AIRBAG LIGHT & POSSIBLE FAILURE HAVE BEEN RECORDED WITH NO SAFETY RECALL, DESPITE THAT KIA RECALLED A NUMBER OF OTHER 2006 KIA MODELS FOR AIRBAG FAILURE.  I DO NOT KNOW IF MY AIRBAG WILL WORK.  TOLD BY DEALER THAT I NEEDED TO REPLACE MY FRONT SEATS BOTH DRIVER AND PASSENGER FOR A COUPLE THOUSAND DOLLARS, HOWEVER, DEALER STATED THEY WOULD GUARANTEE THAT AFTER REPLACEMENT OF THE CAR SEATS THAT THE AIRBAG PROBLEM WOULD BE FIXED.  NUMEROUS COMPLAINTS ABOUT THE 2006 SPORTAGE AIRBAG PROBLEM HAVE BEEN DOCUMENTED INCLUDING ACCIDENTS WHERE THE AIRBAG HAS NOT WORKED AND PEOPLE HAVE BEEN INJURED.  IF KIA CAN FIX THE AIRBAG PROBLEM IN OTHER 2006 MODELS WHY NOT THE 2006 SPORTAGE - MY SAFETY IS JUST AS IMPORTANT AS THE FOLKS WITH OTHER 2006 KIA MODELS. THE DEALER WILL NOT GUARANTEE REPAIR/SAFETY.  *TR",
        "vin": "KNDJF724867"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/21/2013",
        "dateOfIncident": "11/14/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10553268,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TOOK 2006 KIA SPORTAGE FOR YEARLY PA INSPECTION, MECHANIC FOUND BOTH FRONT CONTROL ARMS ARE RUSTED, IN DANGER OF BREAKING AND  MUST BE REPLACED FOR STATE INSPECTION/SAFETY.  TODAY, 11/21/13, KIA ANNOUNCED A RECALL FOR SUSPENSION CONTROL ARM RUSTED/SAFETY ONLY ON THE 2006, ETC., SEDONA VANS.  WHY NOT INCLUDE ALL 2006 KIA MODELS?  THERE ARE ALREADY COMPLAINTS FILED THAT SUSPENSION FAILURES OCCURRED ON 2006 SPORTAGES.    *TR",
        "vin": "KNDJF724867"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/05/2013",
        "dateOfIncident": "08/19/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10541998,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON INTERSTATE I-84 WEST   WHEN I HEARD A LOUD NOISE FROM THE REAR OF MY CAR. I PULLED OFF JUST BEFORE I WAS GOING TO TURN ONTO THE TACONIC PARKWAY GOING NORTH TO ALBANY (I LIVE IN ALBANY COUNTY, NY). I SLOWLY PULLED MY CAR ONTO THE TACONIC TO GET OUT OF THE MASSIVE TRAFFIC. I LOOKED UNDER THE REAR OF THE CAR AND SAW THAT THE CONTROL ARM OF THE STRUT ON THE DRIVER'S SIDE HAD RUSTED THROUGH COMPLETELY AND BROKEN. THE CONTROL ARM ON THE PASSENGER SIDE WAS ALSO RUSTED THROUGH AND WOULD HAVE BROKEN AS WELL.  *JB",
        "vin": "KNDJE724667"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/21/2013",
        "dateOfIncident": "08/20/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10536487,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING AT 55 MPH BEHIND SEVERAL OTHER CARS APPROACHING A REDLIGHT. THE CRUISE CONTROL WAS SET AND AS THE CARS AHEAD OF ME BEGAN TO BRAKE, I DID AS WELL. THE CRUISE CONTROL FAILED TO DISENGAGE AND I HAD TO STOMP ON THE BRAKE PEDAL AS I MANUALLY DISENGAGED THE CRUISE CONTROL TO GET THE CAR TO STOP. THE ESC LIGHT WAS ALSO ILLUMINATED. THE CAR HAD THE STOP LAMP RECALL DONE IN NOVEMBER 2009.  *TR",
        "vin": "KNDJF723067"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/14/2013",
        "dateOfIncident": "02/01/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10535302,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 KIA SPORTAGE. THE CONTACT STATED THAT THE AIR BAG FAILED AND THE AIR BAG WARNING LIGHT REMAINED ILLUMINATED.  THE VEHICLE WAS TAKEN TO THE DEALER FOR INSPECTION WHERE THE DEALER RESET THE AIR BAG LIGHT HOWEVER, THE FAILURE WAS NOT CORRECTED. THE APPROXIMATE FAILURE MILEAGE WAS 34,000 AND THE APPROXIMATE CURRENT MILEAGE 34,400. UPDATED 09/06/13*LJ",
        "vin": "KNDJE723067"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/20/2013",
        "dateOfIncident": "07/01/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10525950,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING THE VEHICLE WHEN THE AIR BAG LIGHT CAME ON AND STAYED ON. I MADE AN APPOINTMENT WITH THE DEALER TO HAVE IT CORRECTED. THEY PERFORMED A DIAGNOSTIC TESTAND TOLD ME THAT IT MIGHT BE A SENSOR THEY THEN RESET THE AIRBAG LIGHT.  FEW DAYS LATER THE SAME THING HAPPENED. THE AIR BAG LIGHT HAS COME ON AND HAS STAYED ON. FROM WHAT I HAVE GATHERED THIS SEEMS TO BE A COMMON PROBLEM WITH KIAS. THE BIGGEST PROBLEM IS THE COSTTO HAVING THIS REPAIRED.  *TR",
        "vin": "KNDJE723567"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/12/2013",
        "dateOfIncident": "07/01/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10524512,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIR BAG LIGHT STARTED BLINKING, THEN STAYED LIT. I TOOK MY CAR TO KIA DEALER AND HAD DIAGNOSTIC. THE COST WAS $60. THEY FOUND THAT FRONT SEAT PASSENGER SEAT HAD AN ERROR CODE. I WAS TOLD THAT THE SENSOR FOR FRONT SEAT WOULD HAVE TO BE REPLACED. WHEN I LEFT DEALER THE LIGHT FOR AIR BAG WAS OFF, BUT CAME BACK ON A WEEK LATER. AIR BAG LIGHT IS STILL ON.  *TR",
        "vin": "KNDJF723467"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/05/2013",
        "dateOfIncident": "06/05/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10515334,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIRBAG LIGHT IS SUDDENLY ON WHILE DRIVING. TURNING OFF THE ENGINE AND TURNING IT ON BACK, THE LIGHT IS STILL ON. IT HAPPENED BEFORE ABOUT 4 YEARS AGO, AND HAD THE WHOLE PASSENGER BELT REPLACED, BASED ON THE SHOP RECOMMENDATION.   NOW THE LIGHT IS ON AGAIN, FOR NO REASON. BASED ON THE NUMBER OF COMPLAINTS/CASES FOUND THROUGH SEARCHING THE INTERNET, KIA SHOULD MAKE A RECALL AND FIX IT. IT IS UNSAFE TO DRIVE WITH THE AIRBAG LIGHT ON AND IT IS EXPENSIVE TO HAVE IT FIX. THE DEALER CAN NOT GUARANTY THAT CHANGING THE BELT/SENSOR ETC WILL FIX IT, WHICH TRANSLATES THE COST WILL ONLY KEEP INCREASING UNTIL IT'S FIXED.  *TR",
        "vin": "KNDJF723967"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "04/22/2013",
        "dateOfIncident": "06/01/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10509171,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SEAT BELT SENSOR FOR THE AIR BAGS HAS GONE OUT 3 TIMES.  THE FIRST TIME HAPPENED ABOUT 2500K MILES AND WAS UNDER WARRANTY, THE SECOND TIME WAS AFTER 60K MILES AND WE HAD TO PAY FOR IT ABOUT $100, THE THIRD TIME IT WENT OUT WAS ABOUT 80K MILES.  I WAS QUOTED $300 TO HAVE IT REPLACED AGAIN BUT WHEN I COMPLAINED THEY OFFERED TO DO IT FOR $100.  I THINK THIS IS A SAFETY ISSUE AND IT APPEARS TO NEED A RECALL ON THE PART.  I DO NOT THINK THAT WE SHOULD HAVE TO PAY TO HAVE THIS PART REPLACED AND IN THE MEAN TIME WE ARE DRIVING AROUND WITHOUT THE SENSOR WORKING FOR THE AIR BAG.  GOOD JOB KIA!  *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/16/2013",
        "dateOfIncident": "08/01/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10503295,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DEALER REPAIRED AIRBAG THEY REPLACED FROM BELT TO SENSORS AND AIRBAG STILL LIGHT, NOW NO MORE WARRANTY THEY  DENY REPAIR.  *TR",
        "vin": "KNDJF723367"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/28/2013",
        "dateOfIncident": "02/27/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10500836,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTED THE VEHICLE ONE EVENING AND THE DRIVERS SIDE AIR BAG LIGHT CAME ON. THERE WERE NO ACCIDENTS OR ANYTHING OF THAT NATURE. I JUST PURCHASED THIS VEHICLE ABOUT 3 WEEKS AGO AND CARFAX GUARANTEED NO ACCIDENTS. NO ONE IS SURE HOW IT CAME ON OR WHAT TO DO TO TURN IT OFF.  *TR",
        "vin": "KNDJE723867"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/21/2013",
        "dateOfIncident": "01/09/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10493663,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVERS SIDE AIR BAG LIGHT STARTED BLINKING AND THEN CAME ON CONSTANT. TOOK TO DEALER AND THEY WERE NOT SURE WHAT WOULD FIX IT. THEY RESET LIGHT AND IT STAYED OFF UNTIL PASSENGER RAISED UP TO GET SOMETHING OFF DASH AND PASSENGER AIR BAG LIGHT CAME ON AND THEN THE DRIVERS LIGHT CAME ON AND STAYED ON AGAIN. I HAVE RESEARCHED AND FOUND THAT IN JAN THE OPTIMA AND RIO HAD TOTAL RECALLS FOR THE SAME PROBLEM BUT THEY DID NOT INCLUDE THE SPORTAGE. I BELIEVE FROM WEBSITE RESEARCH THAT THIS IS A LOOMING LARGE SCALE PROBLEM WITH KIA'S AIR BAG SYSTEM ESPECIALLY IN THE 2006 MODELS. I WOULD LIKE TO SEE A RECALL SINCE THIS IS AN ASTRONOMICAL COST TO HAVE REPAIRED AND THE DEALERS WON'T GUARANTEE THE REPAIRS SINCE SO FAR THE REPAIRS DON'T FIX OR KEEP FIXED THE FAULTY SYSTEM. IF ALL REPAIRS ARE DONE THAT WERE EXPLAINED TO ME THEN JUST GETTING THEM \"POSSIBLE\" REPAIRED COULD COST AS MUCH AS $5000.00 TOTAL.  PLEASE ISSUE A DEMAND FOR RECALL ON THE 2006 KIA SPORTAGE.  *TR",
        "vin": "KNDJE723367"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,AIR BAGS,VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/19/2012",
        "dateOfIncident": "11/02/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10485509,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 KIA SPORTAGE. CONSUMER WRITES IN REGARDS TO MALFUNCTION OF AIRBAG LIGHT.  *SMD  THE CONSUMER WAS INFORMED THE CONNECTIONS WERE BAD, WHICH CAUSED THE AIR BAG LIGHT TO ILLUMINATED. THE CRUISE CONTROL STOPPED WORKING, THE ESC LIGHT ILLUMINATED, AND THE RADIATOR COVER WAS BROKEN.  THE DEALER AGREED TO FIX THE CONSUMER'S VEHICLE AT NO CHARGE. UPDATED 01/07/13",
        "vin": "KNDJE723X67"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "11/03/2012",
        "dateOfIncident": "10/21/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10483255,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS PARKED IN A PARKING LOT AT A GROCERY STORE INSIDE SHOPPING AND CAME OUT TO FIND MY VEHICLE WAS HIT IN THE REAR BUMPER AND THE OTHER DRIVER DROVE OFF WITHOUT LEAVING THERE INFORMATION.  I GOT IN THE CAR AND STARTED IT NOTICED THAT MY AIR BAG LIGHT CAME ON AND DID NOT GO OFF.   *TR",
        "vin": "KNDJE723667"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/27/2012",
        "dateOfIncident": "11/01/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10472707,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG WARNING LIGHT COMES ON INTERMITTENTLY FOR SEVERAL MONTHS.  NOW IT IS ON ALL THE TIME.  APPEARS TO BE A COMMON PROBLEM, INTERNET SEARCHES CLAIM THE PROBLEM IS LIKELY IN THE SEATBELT SENSOR.  *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/13/2012",
        "dateOfIncident": "07/06/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10461623,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 KIA SPORTAGE. THE CONTACT STATED THAT THE AIR BAG WARNING LAMP ILLUMINATED. THE VEHICLE WAS TAKEN TO THE DEALER WHO DIAGNOSED THAT THE PASSENGER AIR BAG SENSOR MAT WAS DEFECTIVE AND NEEDED TO BE REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE PROBLEM BUT DID NOT OFFER ANY ASSISTANCE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 40,000 AND THE CURRENT MILEAGE WAS 46,000.    UPDATED 09/05/14*LJ   UPDATED 9/8/2014   *JS",
        "vin": "KNDJF723667"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/04/2012",
        "dateOfIncident": "03/15/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10454060,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 KIA SPORTAGE. THE CONTACT WAS DRIVING 45 MPH WHEN THE AIR BAG WARNING LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN TO A PRIVATE MECHANIC BUT WAS NOT REPAIRED. THE MANUFACTURER WAS CONTACTED. THE FAILURE MILEAGE WAS 60,000 AND THE CURRENT MILEAGE WAS 89,000.",
        "vin": "KNDJF724367"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/22/2012",
        "dateOfIncident": "01/22/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10444797,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION WAS SLIPPING IN FIRST AND SECOND GEAR. SO I WENT TO THE DEALER AND THEY TOLD ME I NEEDED A TRANS. OK, I BOUGHT A USED TRANS BECAUSE THEY SAID I COULD\"NT GET A NEW ONE. WELL AS SOON AS I PULLED OUT ON TO THE ROAD AFTER THEY INSTALLED THE TRANS IT STARTED TO DO THE SAME THING IT WAS DOING WHEN I TOOK IT IN THE FIRST TIME. WELL, THEY TOLD ME THEY HAD TO PUT IT ON THE COMPUTER TO RESET IT. WELL THAT WORKED. MY PROBLEM IS THAT I ASKED THEM IF THEY COULD RESET IT WHEN I FIRST TOOK IT TO THEM AND THEY SAID NO. WELL WHY DID THEY RESET IT THE SECOND TIME AND NOT THE FIRST TIME?  I THINK I BOUGHT A TRANS THAT I DID\"NT NEED IN THE FIRST PLACE. NOW I HAVE 174,441MILES ON MY CAR. AT THE TIME I GOT THE TRANS I HAD 146,740. NOW AT 27701 MILES LATER IT STARTING TO DO THE SAME THING IT WAS DOING THE VERY FIRST TIME.  I THINK I GOT TAKEN.  *TR",
        "vin": "KNDJF724767"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/05/2012",
        "dateOfIncident": "01/03/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10442465,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SIDE AIR BAG LAMP WILL COME ON WHILE DRIVING. ONCE STOPPED AND ENGINE TURNED OFF AND RESTARTED THE LIGHT WILL NOT BE ON. THEN OCCASIONALLY WHILE DRIVING THE LAMP WILL AGAIN COME BACK ON.  *TR",
        "vin": "KNDJF723467"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/21/2011",
        "dateOfIncident": "02/23/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10440892,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER SEVERAL TIMES THAT THE ENGINE STOPPED RUNNING AND KIA DEALERSHIP COULDN'T FIND THE PROBLEM, AS I TURNED INTO THE DEALERSHIP THE ENGINE STOPPED RUNNING AND I COASTED INTO THE PARKING LOT.  REPAIR ORDER STATED POSSIBLE SOLENOID FAILURE (CODE P0665) AND REPLACED BANK 2 INTAKE MANIFOLD TUNING VALVE SOLENOID.THIS WAS ON 10/2010. THE CAR WAS BOUGHT BY US AS NEW.  AGAIN, THE ENGINE HAS STOPPED WHILE DECELERATING AND/'OR TURNING (DEC. 21, 2011). THIS IS THE THIRD TIME IN 3-4 WEEKS. CALLED KIA CONSUMER TELEPHONE NUMBER IN OWNER'S MANUAL AND THEY HAVE NO OTHER INCIDENTS REPORTED FOR THIS PROBLEM.  CAR KNOW HAS 90,000 MILES ON IT AND THEY SAID WE'RE OUT OF WARRANTY AND WE SHOULD TAKE IT TO OUR KIA DEALER IN OUR TOWN. CALLED THEM AND EARLIEST APPOINTMENT IS NEXT WEEK AS THEIR TECHNICIAN IS IN SCHOOL.  THE WIFE AND I ARE WORRIED THAT WE MAY BE \"REAR-ENDED\" AS THIS HAPPENED ON A BUSY HIGHWAY, AS WE WERE BRAKING TO STOP AT A TRAFFIC LIGHT OR TURNING INTO A DRIVEWAY.  *TR",
        "vin": "KNDJF723767"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/14/2011",
        "dateOfIncident": "10/15/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10435595,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS NEVER BEEN IN A CRASH.  AIRBAG LIGHT CAME ON WHEN I GOT INTO MY CAR AND STAYED ON. I TOOK THE CAR TO MY MECHANIC A DAY OR TWO LATER. THEY CLEARED CODE AND RESET THE SYSTEM. AIRBAG LIGHT CAME ON AGAIN A FEW DAYS LATER. TOOK THE CAR BACK TO MY MECHANIC.  THEY  RESEARCHED PROBLEM AND DETERMINED THE ISSUE TO BE WITH THE PASSENGER SIDE BELT TENSION SENSOR AND THAT THIS HAD CAUSED THE AIRBAGS TO DEACTIVATE.  MECHANIC TOLD ME TO TAKE THE CAR TO KIA BECAUSE IT WAS A SAFETY ISSUE AND SHOULD BE UNDER LIFETIME WARRANTY.  KIA WOULD NOT COVER THE REPAIR BECAUSE I HAVE OVER 60,000 MILES ON MY CAR. I WENT BACK TO MY MECHANIC AND HAD THEM REPLACE THE BELT TENSION SENSOR - PART WAS ALMOST $400. MECHANIC SAID THAT ACCORDING TO KIA SPECIFICATIONS, IF THIS DOESN'T FIX THE PROBLEM, THE DRIVER'S AIRBAG MODULE WOULD HAVE TO BE REPLACED. IF THAT DOESN'T FIX IT, THE ENTIRE SRS UNIT WOULD HAVE TO BE REPLACED. MECHANIC INDICATED THAT THERE IS NO WAY TO TEST TO FIGURE OUT SPECIFICALLY WHICH PART IS FAULTY. IN THE MEANTIME, I'M NOT SURE IF MY AIRBAGS ARE WORKING OR NOT. THIS SEEMS TO BE A COMMON PROBLEM WITH THE 2006 KIA SPORTAGE. UNFORTUNATELY, MANY PEOPLE JUST CONTINUE TO DRIVE WITH THE AIRBAG LIGHT ON, MOST LIKELY UNAWARE THAT THEIR AIRBAGS ARE NO LONGER ACTIVATED AND WOULD NOT DEPLOY IN A CRASH.  *TR",
        "vin": "KNDJE723867"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "11/01/2011",
        "dateOfIncident": "11/01/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10433802,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WIRING HARNESS FAILURE - DEALER DIAGNOSIS - CRACKED, BRITTLE, CORROSION - LOSE OF INTERIOR FAN RESULTING IN NO HEAT, DEFROST, AIR CONDITIONING. DEALER STATES HARNESS AND FUSE BLOCK REPLACEMENT REQUIRED.  I HAVE NO HEATER OR DEFROST - IT WAS 22 DEGREES THIS MORNING - I DROVE 5 MILES BEFORE WINDSHIELD WAS CLEAR.  *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/27/2011",
        "dateOfIncident": "04/19/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10427640,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG WARNING LIGHT - MECHANIC AND KIA DEALERSHIP STATED IT WAS A SENSOR.  CAR IS OUT OF WARRANTY, DEALERSHIP WILL CHARGE ME OVER $400 TO \"FIX\" THE AIR BAG WARNING LIGHT BUT WOULD NOT GUARANTEE THE FIX.  AFTER RESEARCHING ON THIS WEBSITE AND OTHERS, IT APPEARS THAT THIS IS A DEFECT ON VARIOUS MODELS OF 2006 KIA'S.  I WAS TOLD THAT THE AIR BAGS WILL NOT DEPLOY IN AN ACCIDENT.  THE DEALERSHIP FIRST STATED TO ME THAT MY CAR MUST HAVE BEEN IN AN ACCIDENT, IT WAS NOT AND NEVER HAS BEEN.  I WAS TOLD THAT IF THE \"FIX\" DID NOT WORK THAT I WOULD HAVE TO REPLACE MY FRONT SEATS FOR A COST OF OVER $1,200.00.  KIA CANNOT GUARANTEE A FIX FOR THIS PROBLEM.  THIS IS EVIDENCED BY RESEARCHING THE INTERNET.  THIS IS A SAFETY ITEM AND NEEDS A RECALL.  *TT",
        "vin": "KNDJF724867"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/11/2011",
        "dateOfIncident": "10/02/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10424663,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TO CASE 10422342 AND OTHERS HOPING FOR RESOLUTION OF THIS PROBLEM FROM THIS USELESS GOVERNMENT DATABASE ... WE SUBMITTED A COUPLE OF CLAIMS ON THE SAME SITUATION (10358922 BEING THE LATEST). THE SYMPTOMS: CAR WOULD BE RUNNING AND SUDDENLY ALL SHUT OFF, INCLUDING ELECTRICAL. WHEN THE CAR STOPPED MOVING, WE COULD TURN OFF THE KEY AND TURN IT ON AGAIN AND IT CAME BACK WITH NO PROBLEM. AT FIRST IT WAS WHEN TAKING OFF FROM REST, BUT IT FINALLY STARTED TO OCCUR WHILE DRIVING (READ 10358922 FOR STORY). APPARENTLY BECAUSE POWER SHUT OFF THE OBDII COULDN'T STORE ANY CODES. KIA TRIED TO FIX IT (HQ SAID TO WIGGLE WIRES UNTIL IT REPRODUCED THE PROBLEM). I DROVE THE CAR FOR SEVERAL HUNDRED MILES WHILE DATA-LOGGING, HOPING TO CATCH THE PHENOMENON. FINALLY AFTER SHUTTING DOWN AGAIN WITH OUR DAUGHTER, I TOOK IT TO KIA AND DEMANDED THAT THEY DISCUSS WITH HQ, BUT THEY GAVE THE SAME STUPID ANSWERS. I FINALLY TOLD THEM TO KEEP THE CAR (MY DEALER DID GIVE US A LOANER) UNTIL THEY COULD MAKE IT HAPPEN AGAIN, BUT TO DATA-LOG EVERY TIME TO SEE IF THEY COULD CATCH THE PROBLEM. AFTER NEARLY A MONTH, THEY DID RECORD THE EVENT, AND IT WAS THE ECU! IT WAS SHUTTING DOWN ALL ELECTRICAL AFTER A THERMAL OVERLOAD ISSUE. AT LEAST THAT'S WHAT THEY SAID. SIGNALS BECAME ERRATIC AND JUST SHUT DOWN. ECU WAS REPLACED AND HAVEN'T HAD THE PROBLEM REOCCUR YET BUT IT DOESN'T HAPPEN EVERY WEEK SO WE'RE SKEPTICAL. BY THE WAY, REPORTING THESE DATA ON THIS DATABASE DID NOTHING TO RESOLVE THE PROBLEM, EVEN WITH SEVERAL SIMILAR SITUATIONS OCCURRING.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/28/2011",
        "dateOfIncident": "06/01/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10422342,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2006 KIA SPORTAGE WILL JUST STALL.  MY RADIO AND AC ARE USUALLY ON WHEN THIS HAPPENS, ALSO I HAVE NOTICED I HAVE HAD MY FOOD EASING ON THE BRAKE.  THE DEALER CAN'T FIND ANY REASON TO RECREATE OR MAKE THIS INCIDENT HAPPEN AGAIN.  MY AC AND RADIO ARE ALSO SHUTTING OFF AND THEN COMING RIGHT BACK ON FOR NO REASON.  *TT",
        "vin": "KNDJF723567"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "07/07/2011",
        "dateOfIncident": "06/30/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10410836,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 KIA SPORTAGE. THE CONTACT STATED THAT THE AIR BAG WARNING LIGHT WAS ILLUMINATED. THE VEHICLE WAS TAKEN TO A LOCAL MECHANIC WHO PERFORMED A DIAGNOSTIC THAT LOCATED THE FAILURE AT THE SEAT BELT MODULE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 68,289 AND THE CURRENT MILEAGE 68,308.",
        "vin": "KNDJF724767"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "06/27/2011",
        "dateOfIncident": "06/01/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10409058,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER AND PASSENGER SIDE SUN VISORS WILL NOT STAY UP. SAFETY EQUIPMENT ISSUE AS DRIVERS VISION IS IMPAIRED. DEALER REFUSED TO REPAIR UNDER WARRANTY.  *TR",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/28/2011",
        "dateOfIncident": "04/01/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10398154,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 KIA SPORTAGE. WHILE THE CONTACT WAS DRIVING APPROXIMATELY 35 MPH, THE ESC OFF WARNING INDICATOR ILLUMINATED ON THE INSTRUMENT PANEL. THE WARNING INDICATOR REMAINED ILLUMINATED UNTIL THE ENGINE WAS TURNED OFF. THE CRUISE CONTROL WOULD NOT ENGAGE AND BOTH REAR BRAKE LIGHTS FAILED TO FUNCTION. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE THEY REPLACED THE BRAKE LIGHT SWITCH. THE FAILURE CONTINUED TO OCCUR AFTER THE VEHICLE WAS REPAIRED. NHTSA RECALL CAMPAIGN  NUMBER 09V130000 (EXTERIOR LIGHTING:BRAKE LIGHTS:SWITCH) WAS RELATED TO THE FAILURE; HOWEVER, THE VIN WAS NOT INCLUDED IN THE RECALL. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER FOR DIAGNOSTIC TESTING AND TO BE REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 71,000.",
        "vin": "KNDJE723167"
    },
    {
        "components": "WHEELS,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "01/18/2011",
        "dateOfIncident": "06/19/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10377005,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "ULTRA, INC.",
                "productMake": "ULTRA",
                "productModel": "ULTRA",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 KIA SPORTAGE WITH AN ULTRA 578510 DOLLY. WHILE DRIVING APPROXIMATELY 55 MPH AND TOWING THE VEHICLE WITH THE DOLLY THE CONTACT NOTICED THAT THE VEHICLE WAS MOVING FROM ONE SIDE TO ANOTHER. THE CONTACT PULLED OVER TO THE SIDE OF THE ROAD AND NOTICED THAT THE PASSENGERS SIDE WHEEL CAME OFF OF THE DOLLY. THE VEHICLE WAS TOWED TO A REPAIR SHOP. THE TECHNICIAN STATED THAT THE BOLT THAT HOLDS THE TIRES AND THE NUTS CAME OFF OF THE DOLLY. THERE WAS ALSO INDENTATION IN THE LOWER PART OF THE WHEEL WELLS OF THE FRONT TIRES. THE HUB AND TIRES WERE REPLACED. THE MANUFACTURER WAS CONTACTED AND OFFERED TO REIMBURSE THE CONTACT FOR THE DAMAGE. THE CONTACT DID NOT AGREE WITH THE AMOUNT AND NO FURTHER OFFERS WERE MADE BY THE MANUFACTURER. THE APPROXIMATE FAILURE MILEAGE WAS 42,000.",
        "vin": "1FDEE14N0LH"
    },
    {
        "components": "STEERING,SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/03/2010",
        "dateOfIncident": "10/02/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10358922,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 KIA SPORTAGE EX WITH V-6 HAS A HABIT OF COMPLETELY SHUTTING DOWN ELECTRICALLY, KILLING THE ENGINE AND THUS ALL LIGHTS, POWER ASSIST TO STEERING/BRAKES, ETC. PREVIOUSLY THIS OCCURRED ONLY WHEN TAKING OFF FROM A STOP (PREVIOUSLY REPORTED). THIS TIME OUR DAUGHTER WAS DRIVING AT HIGHWAY SPEEDS AT NIGHT IN THE MIDDLE OF UTAH WHEN THIS OCCURRED AGAIN. SHE WAS ABLE TO GET IT OFF THE HIGHWAY SAFELY WITHOUT INCIDENT IN COMPLETE DARKNESS AND NO POWER ASSISTS. CAR WAS RUNNING ON CRUISE CONTROL SO NO DRIVER FUNCTION COULD HAVE CAUSED THE INCIDENT. NO WARNING SUCH AS ENGINE STUMBLE, FLICKERING LIGHTS, ETC,, IT JUST SHUT OFF!!! ONCE SAFELY STOPPED, OUR DAUGHTER WAS ABLE TO RESTART THE CAR AND GET TO THE DESTINATION WITHOUT INCIDENT. DEALER IS AWARE OF THIS PROBLEM BUT IS UNABLE TO FIX IT. ONLY HAS BEEN TAKEN TO DEALER FOR REPAIRS. *TR",
        "vin": "KNDJE723X67"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/09/2010",
        "dateOfIncident": "08/06/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10354629,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2006 KIA SPORTAGE. THE CONTACT STATED HE VEHICLE HAS EXPERIENCED MANY FAILURES.  WHILE DRIVING THE VEHICLE STALLED OUT AND WOULD NOT RESTART.  THE VEHICLE WAS TAKEN TO THE DEALER AND THE HEAD GASKET WAS  REPLACED BUT THAT DID NOT REMEDY THE FAILURE.  THE VEHICLE WAS TAKEN TO THE DEALERSHIP AGAIN AND THEY ADVISED THE SENSOR NEEDS TO BE REPLACED.  THE VEHICLE HAD NOT BEEN REPAIRED.  THE CURRENT AND FAILURE MILEAGES WERE 91,000.  THE VIN WAS UNKNOWN.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/15/2010",
        "dateOfIncident": "03/05/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10319668,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 KIA SPORTAGE EX HAS REPEATED PROBLEM WITH ENGINE SHUTDOWN/STALL UPON STARTING FROM A STOP AT AN INTERSECTION. BOTH LEFT AND RIGHT TURNS. BOTH WITH AND WITHOUT AIR CONDITIONING, AND IN ALL WEATHER CONDITIONS ALSO WITH AND WITHOUT LIGHTS. NO CODE HAS SHOWN UP ON THE COMPUTER.  NO WARNING. FIRST INDICATION THERE IS A PROBLEM IS WHEN WE TAKE OFF AND STEERING IS STIFF (E.G. NO PS) AND THE CAR DOESN'T MOVE. *TR",
        "vin": "KNDJE723X67"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/03/2010",
        "dateOfIncident": "03/01/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10316034,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER BEING FIXED BY THE DEALER, MY AIRBAG LIGHT CAME BACK ON AGAIN WITHIN DAYS. TOOK IT BACK AND THEY TOLD ME THE SENSORS BUILT INTO THE SEAT ARE FAILING. AN INTERNET SEARCH INDICATES THAT THEY ARE FAILING AT AN ALARMING RATE.  IF THE LIGHT IS ON THE AIRBAGS WILL NOT DEPLOY.  THE LIGHT WILL STAY ON AS LONG AS THE SENSORS ARE NOT WORKING RIGHT.  THE SENSORS CAN ONLY BE REPAIRED BY REPLACING THE ENTIRE SEAT APPARATUS: ALMOST 1200$ JUST FOR THE PART!  THIS SHOULD BE A RECALL, AND I DO NOT UNDERSTAND WHY IT ISN'T.  NOTE THAT THE DEALER HAS BEEN VERY SYMPATHETIC AND AGGRESSIVE IN TRYING TO IDENTIFY THE PROBLEM, THOUGH IT SOUNDS LIKE THE PEOPLE THEY ARE TALKING TO AT KIA AREN'T BEING VERY FORTHCOMING WITH HOW PREVALENT THE PROBLEM IS. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/11/2009",
        "dateOfIncident": "11/14/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10295344,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONTACT HAS 2006 KIA SPORTAGE THAT HAS BURNED OFF ANTI-FREEZE COMING THROUGH THE AIR VENT. THE COIL IS THINING AND CAUSING IT TO COME THROUGH THE WINDOW. THERE WAS AN IN CABIN AIR FILTER PLACED IN THE VEIHICLE THAT DID NOT HELP. THIS PROBLEM STARTED AROUND NOVEMBER OF 2008. 35000 MILES WHEN PROBLEM STARTED AND 45962 NOW",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/16/2009",
        "dateOfIncident": "08/12/2009",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10292332,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ELECTRICAL HARNESS IN MY 2006 KIA SPORTAGE HAD AN ELECTRIC MELT DOWN. AT PROX 72,000 MILES. DEALER COULD NOT FIND OR FIX THE PROBLEM- FACTORY REP CAME AND REWIRED THE HARNESS BY REPLACING THE MELTED WIRING. *TR",
        "vin": "KNDJF723667"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/19/2009",
        "dateOfIncident": "07/18/2009",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10289009,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 KIA SPORTAGE. THE VEHICLE WAS TAKEN TO THE DEALER ON JULY 18, 2009 AND REPAIRED ACCORDING TO RECALL# 09V130000 (EXTERIOR LIGHTING:BRAKE LIGHTS:SWITCH).  AFTER THE REPAIR SHE NOTICED THAT  THE VEHICLE WOULD ONLY SHIFT IN THE REVERSE GEAR.  AFTER REMOVING THE KEY FROM THE IGNITION, THE ENGINE WILL NOT TURN OFF. LASTLY THE VEHICLE SMELLED LIKE BURNT WIRES. THE DEALER CONCLUDED THAT THE TRANSMISSION NEEDED TO BE REPLACED.  THE MANUFACTURER WAS NOTIFIED, BUT NO ASSISTANCE WAS PROVIDED.   THE VEHICLE WAS TOWED BACK TO THE GARAGE. THE MECHANIC CONCLUDED THAT THE WIRING HARNESS HAD MELTED.  THE VEHICLE WAS IN THE PROCESS OF BEING REPAIRED..  THE FAILURE MILEAGE WAS 60,000. THE CURRENT MILEAGE WAS 68,000.",
        "vin": "KNDJF723467"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/13/2009",
        "dateOfIncident": "10/12/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10287190,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "MICHELIN TIRE CORP.",
                "productMake": "MICHELIN",
                "productModel": "RADIAL",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TIRE FAILURE. TOTAL TREAD SEPARATION. TRAVELING 65MPH ON A CLEAR, STRAIGHT STATE HIGHWAY I HEARD A LOUD BAND AND ALMOST LOST CONTROL. THE RIGHT REAR TIRE BLEW AND THE TREAD SEPARATED ENTIRELY, I WAS ABLE TO RECOVER THE ENTIRE PIECE OF TREAD FROM THE ROADWAY. THE TIRE HAD ONLY 12,000 ON IT AND 10 DAYS EARLIER THE TIRES WERE ROTATED AND PRESSURE CHECKED.  RIKEN RAPTOR DOT# Y94CYNRO. *TR",
        "vin": "KNDJF723567"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/17/2009",
        "dateOfIncident": "11/07/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10284452,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2006 KIA SPORTAGE AND THE AIRBAG LIGHT KEEPS COMING ON I HAVE BEEN TO THE DEALER GOING ON SIX TIMES NOW TO GET THIS FIXED.  IT HAS BEEN GOING ON SINCE OCT 07 TO CURRENT.  THE LAST TIME IT WAS FIXED WAS ON 08/07/2009.  NOW I AM GOING TO DEALER AGAIN BECAUSE IT WAS SUPPOSEDLY FIXED AND AIRBAG LIGHT HAS COME BACK ON AGAIN AND I AM CONCERNED FOR THE SAFETY FOR MY FAMILY IF WE ARE IN AN ACCIDENT BECAUSE THE AIRBAGS WILL NOT DEPLOY WHEN THEY NEED TO .  SO FAR I HAVE HAD THE BUCKLES ASSY REPLACED MORE THAN ONCE AND THE  SENSOR ASSY MORE THAN ONCE.  PROBLEM MAY BE FIXED FOR A LITTLE WHILE THEN LIGHT COMES ON AGAIN AND I HAVE TO GO BACK TO THE DEALER AGAIN.  THIS IS A SAFETY HAZARD. *TR",
        "vin": "KNDJE724867"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES, ELECTRIC",
        "crash": false,
        "dateComplaintFiled": "08/13/2009",
        "dateOfIncident": "06/19/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10280308,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AS OF YET THERE HAS BEEN NO INCIDENT OTHER THAN BEING NOTIFIED THAT THERE IS A SAFETY RECALL ON MY VEHICLE AND FOR OVER TWO MONTHS NOW THE DEALER AND THE MANUFACTURER WHO I HAVE ALSO CONTACTED CLAIM THAT THEY CAN NOT GET THE NECESSARY PARTS TO REPLACE THE DEFECTIVE ONE.  THIS SAFETY RECALL IS FOR A DEFECTIVE BRAKE SWITCH WHICH CAN CAUSE FAILURE OF THE BRAKES LIGHTS, THE CAR NOT TO MOVE OUT OF PARK AND THE CRUISE CONTROL TO NOT SHUT OFF WHEN THE BRAKES ARE APPLIED. *TR",
        "vin": "KNDJF723667"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/05/2009",
        "dateOfIncident": "08/03/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10279472,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Kumho Tire Co., Inc.",
                "productMake": "KUMHO",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "KUMHO TIRE E4 0225645-S  I BOUGHT A KIA SPORTAGE 06. I HAVE 15400 MI. ON MY ODOMETER. I PUT AIR IN THEM RECENTLY AND THE GUY AT THE AUTO SHOP SAID I SHOULD AVOID LONG DRIVES DUE TO THE TIRES CRACKING. WITH THE LACK OF MILEAGE ON THE CAR, WHY IS IT THAT THE TIRES ARE CRACKING. THEY AREN'T OLD. THE TREADS ARE IN GOOD CONDITION.     IS THERE A RECALL ON THEM? I DON'T EVEN KNOW IF I AM PUTTING IN THE RIGHT MODEL NUMBER. *TR",
        "vin": "KNDJF724267"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/21/2009",
        "dateOfIncident": "05/02/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10277621,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY ESC LIGHT KEPT COMING ON AFTER ABOUT A HALF HOUR AND MY CRUISE CONTROL WOULD SHUT OFF BY ITSELF OR NOT COME ON AT ALL.  AFTER A COUPLE WEEKS, THE CRUISE WOULD NO LONGER SET AT ALL.  THIS BEGAN INTERMITTENTLY AROUND 60,000 MILES OR SO AND BECAME A FULL BLOWN PROBLEM AT AROUND 92,000 MILES.  IT TURNED OUT TO BE A  DEFECTIVE STOP LAMP SWITCH.  THERE IS CURRENTLY A RECALL ON THIS PART, BUT JUST NOT FOR MY 2006 KIA SPORTAGE.  I CALLED THE KIA CONSUMER  LINE AND WAS BASICALLY TOLD \"TOO BAD\" BECAUSE EVEN THOUGH THIS IS A KNOWN SPORTAGE ISSUE, MY VEHICLE DIDN'T MAKE THE DATE CUT.  THIS SHOULD HAVE BEEN UNDER RECALL, BUT ENDED UP COSTING ME $100 FOR THE WARRANTY DEDUCTIBLE!  THE ACTUAL BILL WAS $161.00.  HOW CAN KIA GET AWAY WITH THIS? *TR",
        "vin": "KNDJF724667"
    },
    {
        "components": "PARKING BRAKE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/06/2009",
        "dateOfIncident": "06/10/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10275829,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BRAKE LIGHTS KEPT BLOWING.  THEN I LOST MY CRUISE CONTROL.  THEN MY ESC LIGHT KEPT COMING ON.  THEN ALL MY LIGHTS CAME ON!  IT WAS A DEFECTIVE BRAKE SWITCH.  WHICH SHOULD HAVE BEEN UNDER RECALL, BUT ENDED UP COSTING ME $157.14! *TR",
        "vin": "KNDJE723467"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/14/2009",
        "dateOfIncident": "04/12/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10265251,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH DRIVE AND PASSENGER AIRBAG LIGHTS WERE LIT.  THIS OCCURRED 5 TIMES, ALL OF WHICH I WAS TOLD BY THE DEALERSHIP WAS \"FIXED.\"  THE SIXTH TIME THE DEALERSHIP HAD MY CAR FOR 72 HOURS, CLAIMED TO \"BE FIXED\" YET AGAIN, ONCE BOTH SEATS WERE SUPPOSEDLY REPLACED.  WITHIN 2 WEEKS BOTH LIGHTS CAME BACK ON.  THE LIGHTS ARE ON, YET AGAIN, FOR THE SEVENTH TIME...I AM CONSULTING AN ATTORNEY! *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS,STRUCTURE,CHILD SEAT",
        "crash": false,
        "dateComplaintFiled": "06/12/2008",
        "dateOfIncident": "06/12/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10230827,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "NO FAILURE/CRASH/INJURY TO MYSELF OR ANYONE I KNOW, BUT DESIGN COMPLAINT THAT COULD RESULT IN INJURY.  MY 2006 KIA SPORTAGE RECEIVED GOOD CRASH TEST RATINGS, WHICH IS WHY I PURCHASED THE CAR.    I HAVE 1 CHILD, UNDER 3, WHO'S CAR SEAT IS IN THE MIDDLE OF THE BACK BECAUSE THE OWNER'S MANUAL STATES CAR SEATS ARE UNSAFE ON EITHER SIDE IN THE REAR OF THE VEHICLE BECAUSE OF SIDE CURTAIN AIRBAGS. THE ONLY LOCATION FOR LATCH IS IN EITHER SIDE OF THE VEHICLE.  I AM ABOUT TO HAVE A 2ND CHILD, AND NOW HAVE NO SAFE WAY TO PLACE 2 CHILDREN IN THE REAR OF THIS VEHICLE.  I KNOW IT IS A LEGAL REQUIREMENT THAT ALL VEHICLES HAVE LATCH IN THE CARS, BUT HOW LEGAL CAN IT ACTUALLY BE, IF THE LOCATIONS OF LATCH ARE NOT SAFE FOR THE CHILDREN?  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/08/2008",
        "dateOfIncident": "04/05/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10223658,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ELECTRONIC STABILIZATION CONTROL IS INTERMITTENT. IT GOES OFF AT VARIOUS TIMES . THE DEALER HAS LOOKED AT IT BUT SO FAR HAS NOT BEEN ABLE TO FIX IT. THERE IS A TECHNICAL SERVICE BULLETIN FOR THIS.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/28/2008",
        "dateOfIncident": "01/27/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10216231,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE LOSES POWER AND CUTS OFF AS IT IS COMING TO STOP.  HAVE TAKEN FOR DIAGNOSIS, BUT TECHNICIANS COULD NOT ISOLATE.  THIS IS A POTENTIALLY DANGEROUS OCCURENCE, AS IT COULD HAPPEN AT SOME POINT IN THE FUTURE WHEN HAVING TO SLOW DOWN ON INTERSTATE OR OTHER HEAVY TRAFFIC SITUATIONS.  *CN",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "12/17/2007",
        "dateOfIncident": "12/13/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10212095,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 KIA SPORTAGE.  WHILE DRIVING 25 MPH THROUGH A SNOW STORM AT NIGHT, THE WINDSHIELD WIPERS STOPPED OPERATING.  THE DEALER REPLACED THE WINDSHIELD WIPER MOTOR.  WHEN SLUSH STRUCK THE WINDSHIELD WHILE THE WIPERS WERE OPERATING, THEY FAILED AGAIN.  THE DEALER STATED THAT THE WIPERS WERE EQUIPPED WITH A CLIP THAT DISCONNECTS TO KEEP THE MOTOR FROM BURNING.  THE CURRENT AND FAILURE MILEAGES WERE 22,800.    UPDATED 03-05-08 *BF",
        "vin": "KNDJF724167"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": true,
        "dateComplaintFiled": "12/07/2007",
        "dateOfIncident": "12/01/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10211116,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 KIA SPORTAGE.  WHILE MAKING A TURN AT 5 MPH, THE VEHICLE SHUT OFF WITHOUT WARNING.  WHEN THE CONTACT ATTEMPTED TO RESTART THE VEHICLE, HE WAS REAR ENDED BY ANOTHER VEHICLE.  THERE WERE NO INJURIES AND A POLICE REPORT WAS FILED.  THE VEHICLE IS AT THE BODY SHOP AND WILL BE TAKEN TO THE DEALER FOR A DIAGNOSIS.  THE CURRENT AND FAILURE MILEAGES WERE 25,380.   UPDATED 03-05-08 *BF",
        "vin": "KNDJF723367"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/13/2007",
        "dateOfIncident": "11/05/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10208792,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DAUGHTER HIT THE REAR OF A LARGE VEHICLE WHILE DRIVING MY 2006 KIA SPORTAGE. THE INVESTIGATING OFFICER AND THE BODY SHOP REPAIRMAN BOTH TOLD ME THEY HAD NEVER SEEN A VEHICLE SO HEAVILY DAMAGED FAIL TO DEPLOY ITS AIR BAGS. NONE OF THE AIR BAGS DEPLOYED. THE VEHICLE WAS A TOTAL LOSS.  *TR",
        "vin": "KNDJF724867"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/13/2007",
        "dateOfIncident": "11/05/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10208795,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 KIA SPORTAGE.  WHILE DRIVING BETWEEN 10-35 MPH, THE CONTACT'S VEHICLE CRASHED INTO THE REAR OF ANOTHER VEHICLE.  THE AIR BAGS FAILED TO DEPLOY.  THE DRIVER WAS WEARING A SEAT BELT, BUT SUSTAINED BUMPS AND BRUISES OVER HER ENTIRE BODY CAUSED BY THE STEERING WHEEL AND COLUMN.  THERE WERE NO PRIOR WARNING INDICATORS.  THE VEHICLE WAS TOWED AND DETERMINED TO BE DESTROYED BY THE INSURANCE COMPANY.  THE VEHICLE HAS NOT BEEN INSPECTED BY THE DEALER.  A POLICE REPORT WAS FILED.  THE CONTACT HAS PICTURES.  THE CURRENT AND FAILURE MILEAGES WERE 6,000.",
        "vin": "KNDJF724867"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/05/2007",
        "dateOfIncident": "07/13/2007",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10201964,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 KIA SPORTAGE.  THE CONTACT STATED THAT THE VEHICLE WAS PARKED FOR APPROXIMATELY 45 MINUTES WHEN IT SUDDENLY CAUGHT FIRE.  THE VEHICLE WAS TOWED TO A SHOP AND INSPECTED.  THE REPAIR SHOP STATED THAT THE FAILURE WAS DUE TO FAULTY WIRING.  THE MANUFACTURER STATED THAT THEY WOULD SEND AN INSPECTOR TO EXAMINE THE VEHICLE.  THE VEHICLE CURRENTLY REMAINS AT THE SHOP.    THE CURRENT AND FAILURE MILEAGES WERE 13,000.  UPDATED 01/11/08.  *LJ  UPDATED *JB",
        "vin": "KNDJF724967"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "08/02/2007",
        "dateOfIncident": "07/26/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10198272,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 KIA SPORTAGE.  WHILE DRIVING IN REVERSE DOWNHILL, THE CONTACT'S DAUGHTER APPLIED THE BRAKES AND THE VEHICLE ACCELERATED.  SHE APPLIED THE EMERGENCY BRAKE, BUT THE VEHICLE CONTINUED TO ROLL BACKWARDS AT APPROXIMATELY 10 MPH.  THE FAILURE OCCURRED WHILE THE VEHICLE WAS STILL SHIFTED IN PARK.  THE DRIVER CRASHED INTO A TREE TO AVOID MERGING INTO AN INTERSECTION.  ALL OF THE WARNING INDICATOR LIGHTS ILLUMINATED.  THE ROAD CONDITIONS WERE DRY.  THE PASSENGER SEATED IN THE REAR DRIVER SIDE SEAT SUFFERED A BROKEN NOSE.  THE PASSENGER SEATED IN THE REAR PASSENGER SIDE SEAT SUFFERED FACIAL CUTS.  NEITHER WERE WEARING SEAT BELTS.  THE VEHICLE WAS DESTROYED AND TOWED.  A POLICE REPORT WAS FILED.  THE CURRENT AND FAILURE MILEAGES WERE 10,000.",
        "vin": "KNDJE723X67"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/04/2007",
        "dateOfIncident": "07/24/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10192421,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2006 KIA SPORTAGE. FROM THE DAY I BOUGHT  IT ,IT'S MADE A BOILING SOUND IN THE DASH BROAD WHEN I TURN MY CAR OFF.  I TOOK IT TO THE DEALERSHIP AND DROPPED IT OFF TO HAVE IT LOOKED AT. WHEN I PICKED IT UP I WAS TOLD THAT MY COOLING SYSTEM HAD NOT BEEN BURPED  RIGHT. SO THEY DRAINED THE SYSTEM AND RE-FILLED IT. AND THAT AT SHOULD TAKE CARE OF THE PROBLEM.  WELL IT DIDN'T !!!!!!! IT'S WORSE NOW THAN BEFORE. AND TO ADD TO IT, IT LOOKS LIKE I'M GROWING MAGIC ROCKS ON THE LEFT AND RIGHT SIDE OF THE RADIATOR. IT'S SO GREEN IN COLOR PLUS IT LOOKS FUZZY.  AT THE SAME TIME WHEN THE CAR IS HOT THE COOLING FAN WILL GO ON. BUT AS SOON AS I TURN THE CAR OFF THERE'S NO MORE FAN, EVER.  AND FOR THE LAST COUPLE DAYS THE TRACTION CONTROLS LIGHT ON THE DASH IS LIT UP AND WON'T TURN OFF UNLESS I TURN THE MOTOR OFF AND WAIT ABOUT 10 MINS. WHEN I TOOK IT IN FOR THIS I WAS TOLD THERE WAS A RECALL ON THIS, BUT THERE IS TWO DIFFERENT SYSTEMS   AND THE SYSTEM I HAVE ISN'T THE ONE WITH THE RECALL.  *TR",
        "vin": "KNDJF723067"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "03/31/2007",
        "dateOfIncident": "03/16/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10186631,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDSHIELD WIPER MOTOR INOPERATIVE  DURING A STORM WHILE I WAS DRIVING MY WINDSHIELD WIPER MOTOR BROKE LEAVING ME WITH NO WIPERS THE DEALERSHIP HAS FIXED THE PROBLEM BUT THEY TOLD ME THAT THIS SAME PROBLEM HAPPENED TO ABOUT 10 OF THE SAME CARS DURING THE SAME STORM.  *JB",
        "vin": "KNDJF723X67"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/17/2006",
        "dateOfIncident": "10/12/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10171078,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED WHILE DRIVING HOME, THERE WAS A STRONG SMELL AND FUMES WHICH EMANATED FROM THE INSIDE TO THE OUTSIDE OF THE VEHICLE.  IT WAS DRIVEN HOME AND PARKED IN THE GARAGE.  UPON INSPECTION, GAS WAS OBSERVED LEAKING UNDERNEATH THE VEHICLE ON THE PASSENGER SIDE.  THE DEALER WAS CONTACTED, AND ADVISED THAT THE VEHICLE SHOULD NOT BE DRIVEN DUE TO SAFETY HAZARDS.  THE VEHICLE WAS TOWED TO THE DEALER WHO REPLACED THE GAS TANK DUE TO CORROSION. THERE WAS NO WARNING PRIOR TO THE INCIDENT.",
        "vin": "KNDJB7230Y5"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "04/04/2006",
        "dateOfIncident": "03/06/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10154500,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR WIPER ARM OF THE KIA SPORTAGE IS MADE OF WEAK PLASTIC AND CANNOT WITHSTAND GOING THROUGH A CAR WASH. THE FIRST CAR WASH IT WENT THROUGH RIPPED OFF THE WIPER BLADE AND COVER OVER THE INSTALLATION NUT.  THE SECOND CAR WASH THEN BROKE THE ARM.   THIS RESULTS IN THE INABILITY TO CLEAR THE REAR WINDOW OF DIRTY/SNOW/RAIN RESULTING IN REDUCED VISIBILITY AND POTENTIAL ACCIDENTS.  THE MANUFACTURER/DEALER SAYS THAT IT IS NOT THERE PROBLEM AND REQUIRE THAT I PAY OVER $100 TO REPAIR AFTER WHICH I MUST HAND WASH THE CAR. *JB",
        "vin": "KNDJF723X67"
    }
]