[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/19/2007",
        "dateOfIncident": "08/19/2007",
        "fire": false,
        "manufacturer": "KWANG YANG MOTOR CO., LTD",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10200053,
        "products": [
            {
                "manufacturer": "KWANG YANG MOTOR CO., LTD",
                "productMake": "KYMCO",
                "productModel": "AGILITY",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MOTORSCOOTER SPEEDOMETER DOES NOT READ CORRECT SPEED. IT READS BETWEEN 8 AND 10 MILES PER HOUR ABOVE ACTUAL SPEED. FOR EXAMPLE, SPEEDOMERTER READS 50MPH BUT IN REALITY I'M DRIVING AT 40MPH. PROBLEM PERSISTS REGARDLESS OF SPEED.  CONSEQUENCES:  1) DRIVING UNDER THE MINIMUM SPEED LIMIT IN A FEDERAL HIGHWAY WHEN DRIVER THINKS HE/SHE IS ACTUALLY AT LEAST AT MINIMUM SPEED LIMIT. IT CAN CAUSE CRASH BY LARGER VEHICLES COMING FROM BEHIND AT LARGER SPEED. FOR EXAMPLE, RIDER ACTUALLY RIDING AT 35 MPH ON A FEDERAL HIGHWAY MINIMUM SPEED OF 45 MPH EVENTHOUGH RIDER THINKS HE/SHE IS AT LEGAL SPEED.    WHAT WAS DONE TO CORRECT THE PROBLEM:  1) TOOK THE VEHICLE TO A DEALER IN PROBO, UTAH AND REPORTED PROBLEM. SERVICE DESK SEEMS TO BE AWARE OF THE PROBLEM AS HE INDICATED ALL KYMCO PEOPLE 150CC SHOWS THE SAME PROBLEM. I ASKED IF A RECALL HAS BEEN ISSUED OR IF I COULD BUY A NEW SYSTEM TO REPLACE. THE RESPONSE WAS THAT THERE WAS NO RECALLS AND IF I BOUGHT A NEW SPEEDOMETER THE PROBLEM WOULD PERSIST.    I NOW HAVE TO GUESS AT WHICH SPEED I'M RIDING AT. AT THIS TIME (08/19/07) WHEN I'M RIDING IN A 25 MPH STREET, I RIDE MY SCOOTER READING AT 35 MPH. IT IS NOT SAFE, SPECIALLY TO THOSE OWNERS THAT ARE NOT AWARE OF THE PROBLEM.    IN ADDITION TO SAFETY ISSUES, MY MOTORSCOOTER NOW READS RIDDEN KILOMETERS IN EXCESS TO ACTUAL USAGE. DEPRECIATION OF VEHICLE IS GREATER THEN ACTUAL DUE TO MISLEADING SPEEDOMETER.  *TR",
        "vin": "RFBBAJBA86B"
    }
]