[
    {
        "components": "ENGINE AND ENGINE COOLING,TIRES",
        "crash": false,
        "dateComplaintFiled": "06/01/2011",
        "dateOfIncident": "05/29/2011",
        "fire": false,
        "manufacturer": "Mercedes-Benz USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10404111,
        "products": [
            {
                "manufacturer": "Mercedes-Benz USA, LLC",
                "productMake": "MERCEDES BENZ",
                "productModel": "GLK350",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "EAGLE F1 ALL SEASON",
                "productYear": "9999",
                "size": "245/45ZR17",
                "type": "Tire"
            }
        ],
        "summary": "GOODYEAR F1 ULTRA PERFORMANCE ALL SEASON - PURCHASED 06 MERCEDES WITH TIRES ALREADY INSTALLED - SALES PERSON STATED THEY MOUNTED THE NEW TIRES. RIGHT FRONT TIRE OUT OF ROUND DETERMINED BY MECHANIC AT DEALERSHIP CAR WAS PURCHASED. SERVICE MANAGER STATED THAT HE WAS WAITING TO FIND TIRES TO MATCH - HAVE NOT COMMUNICATED SINCE - NOTED ON WEB SITES THAT THE SPECIFIED TIRES HAVE BEEN REPLACE BY DEALERS THAT SOLD THEM AS A COURTESY BY GOODYEAR TO MAINTAIN CUSTOMER SATISFACTION - CALLED GOODYEAR DEALERSHIP IN TOWN - NOT AWARE OF GOODYEAR'S REPLACEMENT OF TIRES. *TR",
        "vin": "WDBTJ56J46F"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/04/2010",
        "dateOfIncident": "07/14/2010",
        "fire": false,
        "manufacturer": "Mercedes-Benz USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10347254,
        "products": [
            {
                "manufacturer": "Mercedes-Benz USA, LLC",
                "productMake": "MERCEDES BENZ",
                "productModel": "GLK350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER LEAKED OUT OF AN INSULATED COOLER SITTING ON THE FLOOR BEHIND THE RIGHT PASSENGER SEAT. THE WATER WENT THRU THE CARPET AND CAUSED DAMAGE TO THE MODULES WHICH THEN SHUT DOWN THE ENTIRE ELECTRICAL SYSTEM AND CAUSED THE CAR TO COME TO A COMPLETE STOP AND COULD NOT BE STARTED AS WE HAD JUST LEFT THE FREEWAY. THE CAR HAD TO BE TOWED TO A DEALER. IT HAD TO BE DRIED OUT, REINSTALL THE BATTERY, REPLACE THE CONTROL MODULES. WE WERE TOLD THIS HAS BEEN A PROBLEM EVEN IF A DRINK WERE SPILLED ON THE BACKFLOOR. THE DEALER TOLD US IT WAS A POOR DESIGN FOR PLACEMENT OF ALL THESE ELECTRICAL MODULES. THE OLD PARTS ARE AVAILABLE. *TR",
        "vin": "4JGBB86EX6A"
    }
]