[
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/23/2021",
        "dateOfIncident": "02/27/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404452,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I AM DRIVING DOWN THE ROAD, ON A CITY STREET. THE VEHICLE WILL JUST SHUT OFF, FOR NO APPARENT REASON. IT DOES THIS SEVERAL TIMES. EVERY TIME THE CAR IS BEEN DRIVEN IT WILL SHUT OFF SEVERAL TIMES AND ME AND MY FAMILY HAVE BEEN IN TRAFFIC WHEN THIS HAS OCCURRED. IT CONTINUES TO DO THIS AT ANY SPEED AND EVERY TIME THE CAR IS DRIVEN. CAN'T DRIVE THE CAR NOT EVEN A MILE BEFORE IT TOTALLY SHUTS OFF.",
        "vin": "4M2YU56146D"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/11/2020",
        "dateOfIncident": "09/09/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354429,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT CALLED ON BEHALF OF HIS DAUGHTER WHO OWNS A 2006 MERCURY MARINER. THE CONTACT STATED THAT AFTER HIS DAUGHTER TURNED INTO A PARKING LOT DRIVING APPROXIMATELY 15 -20 MPH, THE VEHICLE COLLAPSED WITHOUT WARNING ON THE FRONT PASSENGER'S SIDE. THE CONTACT MANAGED TO VEER TO THE SHOULDER OF THE ROAD OUT OF THE WAY OF OTHER VEHICLES. A TOWING COMPANY WAS CONTACTED AND THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC. THE TECHNICIAN INSPECTED THE VEHICLE AND NOTICED THAT THE SUBFRAME AND CV-JOINT WERE FRACTURE. THE VEHICLE WAS NOT REPAIRED. THE CONTACT MENTIONED NHTSA CAMPAIGN NUMBER: 14V165000 (STRUCTURE) AS A POSSIBLE SOLUTION TO THE FAILURE HOWEVER, THE VIN WAS NOT INCLUDED. THE CONTACT ALSO STATED THAT NHTSA CAMPAIGN NUMBER: 15E045000 (SUSPENSION) WAS REPLACED APPROXIMATELY 1 YEAR AGO, AFTER THE WHEEL COLLAPSED ON FRONT DRIVER'S SIDE. THE VEHICLE WAS ALSO REPAIRED BY AN INDEPENDENT MECHANIC. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 190,000.",
        "vin": "4M2CU56176D"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/02/2020",
        "dateOfIncident": "09/02/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352783,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE SUDDENLY CUTS OFF WHILE DRIVING. MESSAGE ON DASH SAYS TO SAFELY STOP THE VEHICLE.",
        "vin": "4M2CU98H06K"
    },
    {
        "components": "STEERING,POWER TRAIN,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "02/28/2020",
        "dateOfIncident": "02/20/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11312062,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL FOR COOLANT PUMP ON HYBRID SYSTEM COULD RESULT IN HYBRID ELECTRONIC OVERHEATING CAUSING A STALL LIKE CONDITION  RECALL WAS ADDRESSED BY DEALERSHIP BACK ON 7/20/2015  2ND OWNER HAS HAD VEHICLE FOR 9 MNTHS - HAVE HAD 3 INCIDENTS OF VEHICLE SHUTTING DOWN WITH DASH LIGHT ADVISING TO PULL OVER FOR SAFETY AND THE SYSTEM SHUTTING DOWN DIRECTLY AFTER  - BRAKES /STEERING ETC.  FOR THE FIRST INCIDENT - TOWED TO LOCAL DEALERSHIP - UNABLE TO DIAGNOSE  2ND INCIDENT - TO A REPUTABLE LOCAL MECHANICS SHOP - CHANGED OUT NORMAL VEHICLE BATTERY  3RD INCIDENT - CAUSED DRIVER TO ROLL THROUGH AN INTERSECTION ON A RED LIGHT - STRUCK BY OTHER VEHICLE",
        "vin": "4M2CU98H46K"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/03/2020",
        "dateOfIncident": "12/01/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11296840,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE GEAR SHIFT IS NOT PROPERLY SHIFTING. IT GOES FROM PARK TO REVERSE ON ITS OWN. SOMETIME IT WONT REVERSE AND MAKES A LOUD NOISE. IT CLICK BACK AND FORTH BETWEEN GEARS.  IVE REPLACE THE SWITCH TO SEE IF THAT WOULD WORK BUT IT DOESNT. PLEASE LET ME KNOW IF I CAN DO ANYTHING TO FIX THIS PROBLEM BUT IT IS THE SAME RECALL 15V606000 FOR OTHER VEHICALS OF THE SAME TYPE",
        "vin": "4M2YU56116D"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/07/2019",
        "dateOfIncident": "05/04/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205996,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DEIVING A MESSAGE ON THE DASH STATED TO STOP WHILE IT IS SAFE. THE CAR PROCEDED TO STALL. IT COULD NOT BE STARTED. I HAPPEN TO BE IN THE MIDDLE OF THE ROAD AND REQUIRED TO CALL FOR HELP TO PUSH THE VEHICLE TO THE SIDE. I WAS ABLE TO START THE CAR LATER THAT DAY TO DRIVE IT HOME. THIS IS THE FORTH TIME IT HAPPENED OVER AN 18 MONTH PERIOD. I WAS VERY LUCKY THAT  I WAS NOT IN HEAVY TRAFFIC OR ON A HIGH SPEED ROAD DURING ANY OF THESE EVENTS. I DID HAVE THE CAR TO A REPAIR SHOP AFTER THE LAST TIME IT HAPPENED AND DESCRIBED THE PROBLEM TO THE MCHANIC. REPAIRS WERE MADE BUT NOTHING TO DO WITH THIS PROBLEM. THIS IS DEFINITELY A SAFETY ISSUE AND IT APPEARS THAT IT HAS BEEN REPORTED MANY TIMES. I DO NOT UNDERSTAND WHY THERE HAS NOT BEEN A RECALL ON THIS ISSUE. I DON'T KNOW WHAT TO DO AT THIS TIME OR WHETHER I SHOULD CONTINUE USING THE VEHICLE.",
        "vin": "4M2CU98H46K"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/15/2019",
        "dateOfIncident": "03/14/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11187149,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR SHUTS DOWN ON THE FREEWAY WHILE DRIVING AT 60-70 MPH. A RED TRIANGLA IS DISPLAYED ALONG WITH A MESSAGE, PULL OVER STOP SAFELY NOW. THIS HAS OCCURRED SEVERAL TIMES AFTER DRIVING G APPROXAMATELY 30 MILES. LUCKILY I WAS ABLE TO PULL OVER SAFELY. THE CAR RESTARTS WITHIN 30 SECONDS AND WILL SHUT DOWN AGAIN EVERY 5 MINS UNTIL THE VEHICLE IS ALLOWED TO COOL DOWN.",
        "vin": "4M2YU98H66K"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/02/2018",
        "dateOfIncident": "03/21/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11082502,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE TURNPIKE AND MY CAR SUDDENLY DINT TURN WHEN I TURNED THE STEERING. ME AND MY PASSENGERS SOMEHOW ESCAPED THE LIFE THREATENING SITUATION IN THE MIDDLE OF THE TRAFFIC. IT WAS MY CARS SUB FRAME THAT WAS RUSTED SO BAD THAT IT BROKE IN THE MIDDLE OF THE ROAD. THIS IS AFTER I SERVICE MY CAR EVERY NOW AND THEN. ITS A SERIOUS ISSUE WITH THIS CAR AND THERE SHOULD BE A RECALL FOR THIS PROBLEM. I HAD TO SPEND SO MUCH DUE TO THIS CARELESSNESS FROM THE COMPANY.",
        "vin": "4M2YU57116K"
    },
    {
        "components": "STEERING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/13/2017",
        "dateOfIncident": "07/16/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11023371,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE:  2006 MERCURY MARINER HYBRID SUV.  PURCHASED NEW IN 2006.  IN HOT WEATHER...VEHICLE ENGINE QUITS WHILE IN MOTION ON FREEWAY AT APPROXIMATELY 70 MPH (3 TIMES), AND CITY STREETS (3 TIMES).  EXTREMELY DANGEROUS WHEN ENGINE QUITS WHILE DRIVING ON FREEWAY IN TRAFFIC.  ALL YOU CAN DO (WHILE PRAYING!) IS COAST TO A STOP AND DO YOUR BEST TO PULL OFF ON TO SHOULDER OF ROAD WITHOUT CRASHING INTO OTHER VEHICLES.  WE HAVE TRIED 3 TIMES TO GET FORD MOTOR TO REPAIR THIS PROBLEM...ALL TO NO AVAIL. THE LAST TIME WE HAD TO PAY APPROXIMATELY $1,500.  HOWEVER, FORD MOTOR DID REIMBURSE US!  BUT AT THE SAME TIME THEY CLAIMED THE PROBLEM WAS RESOLVED.  NOT TRUE!  ABOUT TWO YEARS LATER THE PROBLEM STARTED ALL OVER AGAIN.  FOR10 YEARS WE HAVE BEEN DRIVING A DEFECTIVE VEHICLE THAT WAS--AT ALL TIMES--A DANGER TO OUR LIVES.  FORD MOTOR SHOULD HAVE TAKEN THIS PROBLEM MUCH MORE SERIOUSLY AND EITHER REPLACED THE VEHICLE WITH A ANOTHER ONE, OR TRULY FIXED THE PROBLEM.  I FEEL FORD MOTOR HAS LIABILITY IN THIS MATTER.   THE LAST TIME THIS PROBLEM OCCURRED WAS JULY 16, 2017.",
        "vin": "4M2CU98H86K"
    },
    {
        "components": "SUSPENSION,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/24/2017",
        "dateOfIncident": "07/19/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11010378,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2 ISSUES THAT THE LOCAL FORD DEALER SAID THEY COULD NOT ASSIST.(JORDAN FORD)UPPER SHOCK  BUSING FROM P/S REAR SHOCK CAME OUT CAUSING SHOCK ROD TO MAKE EXCESSIVE NOISE AND CONTACT BODY, AS WELL AS RUST FROM P/S INNER WHEEL WHEEL. ONLY THAT LOCATION.APPEARS TO BE A RUSTPROOFING ISSUE.REST OF TRUCK IN GREAT CONDITION. SOON TO BE A SAFETY ISSUE IF I DO NOT HAVE REPAIRED.",
        "vin": "4M2YU571X6K"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/10/2017",
        "dateOfIncident": "02/10/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10953915,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER A SHORT 30 MINUTE VISIT TO OUR VET, MY WIFE STARTED THE VEHICLE AND HAD NO POWER STEERING AT ALL.  RESTART OF THE VEHICLE DID NOT RESOLVE THE ISSUE, SO SHE CAREFULLY DROVE THE VEHICLE HOME 10 MILES. LUCKILY IT FAILED WHILE THE VEHICLE WAS NOT IN MOTION. DEALER DIAGNOSIS INDICATED A B3377 FAULT CODE (EPS MOTOR MALFUNCTION), AND TOLD ME THE STEERING RACK NEEDED REPLACEMENT ($2200).",
        "vin": "4M2CU98H76K"
    },
    {
        "components": "STEERING,SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/06/2016",
        "dateOfIncident": "09/30/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10914176,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT SUB-FRAME HAS COMPLETELY RUSTED OUT.  WE LIVE IN A SALT ZONE (MICHIGAN).  THERE IS ALSO VISIBLE CORROSION THROUGHOUT THE EXTERIOR.  WE WERE DRIVING AND THE FRONT PASSENGER WHEEL STARTED BOWING OUT AND WE STARTED VIBRATING.  WE GOT TO SAFETY BEFORE ANYTHING HAPPENED.",
        "vin": "4M2CU57146K"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/20/2016",
        "dateOfIncident": "11/11/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10860639,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY MERCURY MARINER'S IDLER PULLEY HAS ALREADY BROKEN THREE TIMES IN THE PAST FIVE MONTHS. THERE MUST BE A RECALL ON THIS VEHICLE. THE CAR IS VERY GOOD AND TOO STRONG FOR THAT THIN BOLT IN THIS PART. LUCKILY, THE FOURTH TIME IT HAPPENED, THE FORD DEALER DIDN'T CHARGE ME FOR THE NEW PART, WHICH ALSO BROKE OFF TWO WEEKS LATER.   IT HAS ALSO BROKEN TWO BELTS ALREADY.    TRYING TO SOLVE THE ISSUE, I WENT TO METRIC BOLTS AND NUTS, IN WAKEFIELD, MA, AND BOUGHT A HIGHER GRADE HARDENED STEEL BOLT/SCREW, AND IT ALSO BROKE OFF A WEEK LATER. ONCE AGAIN, TWO DAYS AGO, MY MECHANIC PUT IN ANOTHER HARDENED STEEL SCREW. HE ADDED A NUT NEAR THE BEARING, WHICH MAKES A SQUEAKING NOISE, BUT IT HAS NOT BROKEN YET.    I AM NOW AFRAID TO DRIVE IT FAR FROM HOME, BECAUSE I HAVE BEEN TOWED SO MANY TIMES ALREADY. I HAVE RESEARCHED THE INTERNET AND REALIZED THAT IT IS A CONSTANT ISSUE. SOME PEOPLE HAVE REPORTED THE OCCURRENCE OF THIS ISSUE 17 TIMES IN LESS THAN A YEAR. IT IS ALSO THE SAME FREQUENT PROBLEM WITH MAZDA TRIBUTE, FORD ESCAPE, FORD FUSION, ETC. WHAT DOES IT TAKE FOR A RECALL?  HELP! HELP! HELP!",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/22/2016",
        "dateOfIncident": "03/04/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10851084,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 MERCURY MARINER. WHILE DRIVING APPROXIMATELY 5 MPH, THE VEHICLE STALLED AND THE PULL OVER WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS TOWED TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE HIGH VOLTAGE BATTERY NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VIN WAS UNKNOWN. THE APPROXIMATE FAILURE MILEAGE WAS 40,000.",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/21/2015",
        "dateOfIncident": "01/01/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10795202,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "RIGHT REAR FENDER WELL HAS RUSTED THROUGH AND SHOCK TOWER IS COMING APART. LOUD THUMP EVERY TIME VEHICLE IS DRIVEN AFRAID I COULD LOOSE CONTROL IF SHOCK TOWER RIPS AWAY ANYMORE. WHEN VEHICLE WAS PURCHASED NEW IT AS UNDER COATED.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/08/2015",
        "dateOfIncident": "10/08/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10780724,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "STICKY DASHBOARD, DIS NOT CAUSE ANY INCIDENT BUT CAN AFFECT VISABLITY, NOTICED TODAY",
        "vin": "4M2CU57106D"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/11/2015",
        "dateOfIncident": "04/13/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10715782,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER PLACING THE CAR IN DRIVE, WHEN PRESSING ON THE ACCELERATOR TO MOVE THE CAR THE PEDAL WOULD NOT ALLOW ME TO DEPRESS IT.  THE PEDAL BEGAN TO WORK AFTER STOMPING DOWN WHICH CAUSES THE CAR TO JERK FORWARD SUDDENLY.  AGAIN AFTER COMING TO A STOP AT THE LIGHT AND MAKING A RIGHT HAND TURN, AFTER RELEASING THE BRAKES AND STEPPING ON THE ACCELERATOR, THE PEDAL AGAIN WOULD NOT DEPRESS UNTIL STOMPED ON.  THIS TYPICALLY HAPPENS WHEN THE VEHICLE HAS BEEN OUT IN THE COLD AND AFTER IT HAS BEEN TURNED OFF FOR AN EXTENDED TIME PERIOD (OVERNIGHT).",
        "vin": "4M2YU57Z56D"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/31/2015",
        "dateOfIncident": "03/30/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10702951,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 MERCURY MARINER. THE CONTACT STATED THAT THE BRAKES FAILED WITHOUT WARNING. THE CONTACT WAS ABLE TO MERGE TO THE SIDE OF THE ROAD WITHOUT INCIDENT. AFTER INSPECTING THE VEHICLE, THE CONTACT NOTICED THAT THE TWO FRONT DRIVER SIDE BRAKES LINES CONNECTED TO THE CALIBER FRACTURED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS REPAIRED. THE FAILURE MILEAGE WAS 80,000.",
        "vin": "4M2YU571X6K"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/08/2015",
        "dateOfIncident": "10/01/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10670977,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 MERCURY MARINER. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 25 MPH, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THAT THE ALTERNATOR FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED; HOWEVER, THE FAILURE RECURRED. THE VEHICLE WAS TOWED TO THE DEALER WHO DIAGNOSED THAT THE TRANSMISSION AND TORQUE CONVERTER FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE CONTACT STATED THAT THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 14V526000 (HYBRID PROPULSION SYSTEM). THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 106,000.",
        "vin": "4M2YU56166K"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/10/2014",
        "dateOfIncident": "12/02/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10663339,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "BROUGHT THE CAR IN TO CORRECT A BENT STRUT, PUT IT ON THE LIFT AND PRONOUNCED IT UNDRIVEABLE! THE WHOLE BACK FRAME HAD RUSTED OUT. THEY PULLED THE INSPECTION STICKER. HOW CAN THIS BE?  *TR",
        "vin": "4M2CU57186D"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/17/2014",
        "dateOfIncident": "11/16/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10655384,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "PUSHED THE GAS PEDAL DOWN AND IT WOULDN'T MOVE.  AFTER SEVERAL MINUTES IT FREED UP AND WAS ABLE TO GO DOWN THE ROAD.  THEN IT LOCKED UP AGAIN.  EVENTUALLY MADE IT HOME, APPROXIMATELY 4 MILES AFTER IT LOCKED UP 5 TIMES.  *TR",
        "vin": "4M2CU56Z66K"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/05/2014",
        "dateOfIncident": "10/22/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10652709,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "HEAD ON COLLISION IN MERCURY MARINER, GOING APPROXIMATELY 40 MPH. AIRBAGS FAILED TO DEPLOY, CAUSING ME TO HIT MY HEAD ON THE STEERING WHEEL. RESULTED IN LOSS OF CONSCIOUSNESS, CONCUSSION, AND BROKEN TOOTH.   *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/14/2014",
        "dateOfIncident": "08/08/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10622413,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TONE RING SNAPPED OFF OF AXLE AND CAUSED THE CAR TO GO INTO 2WD AND APPLY THE ABS BRAKES WHEN NOT ACTUALLY BEING NEEDED WHICH ALMOST ENDED UP IN REAR ENDING A CAR WHEN THE FAILURE OCCURRED. TONE RING DESIGN NEEDS LOOKED IT. THIS SHOULD NOT HAPPEN. CORROSION BUILDING UP BETWEEN THE TONE RING AND AXLE SEEMS TO BE WHAT CAUSED THE FORCE OF SNAPPING THIS RING. JUST A POOR DESIGN.  *TR",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/22/2014",
        "dateOfIncident": "07/21/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10615247,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "WRGLR SILENT ARMOR",
                "productYear": "9999",
                "size": "LT245/70R17",
                "type": "Tire"
            }
        ],
        "summary": "I DROVE FROM ATLANTA, GEORGIA TO EL PASO, TEXAS OVER A TWO DAY PERIOD. I WAS NOT SPEEDING AND THERE WERE NO ADVERSE WEATHER CONDITIONS. PREPARING FOR MY RETURN TRIP, I TOOK MY CAR TO GET AN OIL CHANGE. THE MECHANIC DISCOVERED MY TIRE HAD SEVERE TREAD SEPARATION. THE TIRE HAS NOT YET BEEN REPAIRED OR REPLACED, THOUGH THE CAR IS NOW USING A DONUT TIRE IN ITS PLACE.  *TR",
        "vin": "4M2CU56116D"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/22/2014",
        "dateOfIncident": "10/11/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10615391,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR TIRE & RUBBER CO",
                "productModel": "WRGLR SILENT ARMOR",
                "productYear": "9999",
                "size": "LT265/70R17",
                "type": "Tire"
            }
        ],
        "summary": "I WAS DRIVING FROM ATLANTA, GA TO COLUMBIA, SC. ABOUT 2 HOURS INTO THE TRIP, THERE WAS A SUDDEN NOISE AND CLICKING SOUND (LATER DISCOVERED TO BE THE TIRE HITTING THE AXLE). WHEN THE CAR WAS EXAMINED AT A MECHANICS, IT WAS DISCOVERED THAT THE TREAD INTERIOR WALL BEGAN TO SEPARATE. THE PART WAS REPLACED. THE OLD PART IS NO LONGER AVAILABLE, THOUGH THERE ARE PHOTOS.  *TR",
        "vin": "4M2CU56116D"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/29/2014",
        "dateOfIncident": "07/01/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10594886,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MANY TIMES, EITHER AFTER A STOP OR LETTING MY FOOT OFF THE GAS PEDAL AND THEN TRYING TO PUSH THE GAS PEDAL AGAIN, THE PEDAL WOULD NOT MOVE, AND I COULD NO LONGER ACCELARATE AND HAVE BEEN FORCED A FEW TIMES TO PULL OFF TO THE SIDE OF THE ROAD UNTIL I COULD GET IT TO PRESS DOWN.  SOMETIMES WAITING FOR 5+ MINUTES FOR IT TO WORK.  I HAD SOMEONE LOOK AT IT, IT'S THE THROTTLE BODY.  IT GETS BUILD UP IN IT AND CAN'T COMPRESS, SEEMS TO BE WORSE IN THE COOLER WEATHER (VS SUMMER).  THIS IS A VERY DANGEROUS, ESPECIALLY WITH TRAFFICE AROUND, AND I HAVE HAD MY KIDS IN THE CAR WHEN ITS HAPPENED AND I GET NERVOUS IT'LL HAPPEN IN A SITUATION THAT I CAN'T PREVENT AN ACCIDENT.   I HAVE NEVER HAD A PROBLEM WITH A THROTTLE ON ANY OF MY OTHER CARS, NOR HAVE I KNOWN ANYONE WITH THIS ISSUE.   *TR",
        "vin": "4M2CU57Z86K"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/01/2014",
        "dateOfIncident": "03/29/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10585945,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRUCK SHUTS OFF WHEN I COME TO A COMPLETE STOP. IT USUALLY HAPPENS WHEN I'M ATTEMPTING TO STOP AT A YELLOW LIGHT TO AVOID RUNNING THE RED LIGHT. IF THE TRUCK COME FROM A HIGH RATE OF SPEED (45 MPH) TO (0 MPH) IT JUST TURN OFF. I'M AFRAID SOMEONE IS GOING TO RUN INTO THE BACK OF ME WHEN THE LIGHT TURN GREEN BECAUSE THE DRIVER EXPECTS ME TO MOVE WHEN THE LIGHT TURN GREEN. I THINK THIS IS VERY DANGEROUS FOR A VEHICLE TO JUST STOP.  IT HAS HAPPENED ABOUT 20 TIMES SINCE 03-29-2014. I WAS TOLD BY TWO MECHANICS THAT IT'S THE TORQUE CONVERTER AND THAT THERE IS A RECALL ON THE FORD ESCAPE FOR THIS SAME PROBLEM. I BELIEVE THE PARTS ARE THE SAME FOR FORD AND MERCURY AND I WANT IT TO BE KNOWN THAT MERCURY VEHICLES ARE HAVING THE SAME PROBLEM.   *TR",
        "vin": "4M2YU56196K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "02/09/2014",
        "dateOfIncident": "10/08/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10563592,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "EARLY ON ONLY HAPPENED A FEW TIMES DURING WINTER. BUT AS OF RECENTLY IT HAS BECOME VERY DANGEROUS TO THE POINT I'VE PULLED OUT AFTER BEING AT A LIGHT OR STOP SIGN INTO TRAFFIC AND UNABLE TO GO. GAS PEDAL WILL NOT BUDGE. I'VE HAD A FRIEND FOLLOWING BEHIND ME AT ONE POINT AND THEY ACTUALLY RAN INTO THE BACK OF MY VEHICLE, LUCKILY NO DAMAGE WAS DONE TO THERE CAR AND MINE SUFFERED MINOR DAMAGES TO THE BUMPER. I'VE BEEN HEARING THINGS ABOUT FORD EXTENDING WARRANTY TO TEN YEARS AND 150,000 MILES TO FIX THIS TYPE OF PROBLEM POSSIBLY WITH FAILURE OF DEFECTIVE THROTTLE BODY SYSTEM. BUT I DON'T KNOW IF THAT'S MY ISSUE. I DO KNOW I'VE ALMOST BEEN IN SEVEN ACCIDENTS WITHIN THE PAST TWO WEEKS.   *TR",
        "vin": "4M2YU56Z06D"
    },
    {
        "components": "STEERING,FUEL SYSTEM, GASOLINE,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/06/2013",
        "dateOfIncident": "12/04/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10555027,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "STOP AT A RED LIGHT THE FUEL PEDDLE GOT STUCK WOULD NOT ACCELERATE. FINALLY THE MARINER STARTED MOVING THEN HAD TO COME TO A STOP FOR STOP SIGN SAME THING HAPPENED. TOOK IT TO THE SHOP SAID THE \"THROTTLE\" WAS BROKEN ON THIS. THIS IS A VERY DANGEROUS CAN'T DRIVE IT WITH THE THROTTLE BEING BROKEN. NEVER HAD A PROBLEM WITH A  THROTTLE ON ANY OF MY PASS CARS. TRACER,LS MUSTANG I HAVE THESE CARS OVER THE YEARS. BOUGHT ALL OF MY CARS FROM THE SAME DEALERSHIP.[XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "4M2YU56Z66D"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/14/2013",
        "dateOfIncident": "11/11/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10552203,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE TEMPERATURE IS COLD, THE ACCELERATOR WILL NOT ALLOW ITSELF TO BE DEPRESSED AFTER 1-2 MINUTES OF DRIVING, AND THEN FOR THE NEXT 10-15 MINUTES. OCCASIONALLY, TAPPING ON THE PEDAL, OR PUSHING EXTREMELY HARD WILL MAKE IT MOVE AND THE VEHICLE WILL DANGEROUSLY AND RAPIDLY ACCELERATE  DUE TO THE EXCESSIVE FORCE REQUIRED UNTIL THE DRIVER IS ABLE TO ADJUST THE FORCE, WHICH SOMETIMES CAUSES THE PEDAL TO BECOME STUCK CLOSED AGAIN ON A HIGH SPEED ROAD. OVER THE YEARS, THIS PROBLEM HAS BECOME PROGRESSIVELY WORSE. IT IS VERY DANGEROUS AND SHOULD BE FIXED BY THE MANUFACTURER.  *TR",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/25/2013",
        "dateOfIncident": "12/31/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10549494,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD THE FUEL LINE REPLACE AND NOW I HAVE TO HAVE THE THROTTLE BODY REPLACED.  THE MECHANIC SAID FOR BOTH PARTS - THEY WERE DEFECTIVE PARTS.  I CAN NOT PRESS ON THE GAS TO ACCELERATE.  AT TIMES THIS HAPPENS WHILE I AM DRIVING WHICH CAN CAUSE AN ACCIDENT.  *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/17/2013",
        "dateOfIncident": "09/16/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10544087,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 MERCURY MARINER. THE CONTACT STATED THAT WHILE DRIVING 60 MPH, THE VEHICLE DECELERATED WITHOUT MANUAL FORCE. THE FAILURE RECURRED ON TWO SEPARATE OCCASIONS. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC FOR DIAGNOSIS WHERE IT WAS STATED THAT THE THERMOSTAT NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED AND THE MANUFACTURER WAS NOT NOTIFIED. THE VIN WAS NOT AVAILABLE. THE APPROXIMATE FAILURE MILEAGE WAS 87,000.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/08/2013",
        "dateOfIncident": "08/07/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10534362,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 MERCURY MARINER. THE CONTACT STATED THAT WHILE AT A STOP LIGHT, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC FOR DIAGNOSIS WHERE IT WAS STATED THAT THE TORQUE CONVERTER NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED AND THE MANUFACTURER WAS NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 108,000.  UPDATED 09/25/13*LJ  THE VEHICLE BEGAN TO STALL WHEN COMING TO A STOP. THE DEALER CONFIRMED, THE TRANSMISSION NEEDED TO BE SERVICED.",
        "vin": "4M2CU56156D"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/25/2013",
        "dateOfIncident": "07/21/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10531795,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE BUILDING SPEED VIA AN ON-RAMP ON CA FREEWAY 680, THE TRANSMISSION BEGAN TO FAIL.  WITHIN ROUGHLY 200 YARDS, THE CAR LOST POWER AND, THANKFULLY, I WAS ABLE TO GET MY CAR TO THE SIDE OF THE FREEWAY.  THE FIRST TIME I WAS ABLE TO GET THE CAR TO WORK AGAIN, I WAS ONLY ABLE TO DRIVE ABOUT 50 YARDS.  I THEN LET THE CAR 'REST' FOR ABOUT 20-30 MINUTES (WHILE I CONTACT MY ROADSIDE ASSISTANCE COMPANY).  AFTER THAT AMOUNT OF TIME, I TRIED THE CAR AGAIN AND WAS ABLE TO DRIVE TO THE NEXT OFF-RAMP (INDUSTRIAL WAY, BENICIA, CA).  AT THE STOP SIGN OF THAT OFF-RAMP, THE CAR FAILED AGAIN AND I CHOSE TO HAVE IT TOWED INSTEAD OF CONTINUE TRYING TO MAKE IT WORK PROPERLY.  MY MARINER IS A 2006 WITH ONLY 77,541 MILES!  MY CAR EVENTUALLY GOT TO A TRANSMISSION SHOP TO BE FIXED, BUT IT WAS IN MY RESEARCH OF THE PROBLEM THAT I FOUND FAILING/FAULTY TRANSMISSIONS TO BE A VERY COMMON AND KNOWN ISSUE FOR MARINERS WITH LOW MILEAGE (MODEL YEARS OF 2005-2011, AT LEAST).  MY COMPLAINT IS THAT THERE SHOULD BE A RECALL ISSUED BECAUSE THIS IS A WELL KNOWN PROBLEM.   *TR",
        "vin": "4M2CU57186K"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/15/2013",
        "dateOfIncident": "05/06/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10512234,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 MERCURY MARINER. THE CONTACT STATED THAT THE TRANSMISSION FAILED. THE CONTACT TOOK THE VEHICLE TO AN INDEPENDENT MECHANIC AND WAS TOLD THAT THE TRANSMISSION NEEDED TO BE REPLACED. THE MECHANIC CONTACTED AN AUTHORIZED DEALER AND WAS ADVISED NOT TO INSTALL A USED TRANSMISSION BECAUSE THE 2006 TRANSMISSIONS WAS DEFECTIVE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE AND CURRENT MILEAGE WAS 82,000.  *TR",
        "vin": "4M2YU57196K"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/15/2013",
        "dateOfIncident": "08/21/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10512290,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING IN THE LOS ANGELES, CA THE BRAKE SYSTEM MESSAGE CAME ON INDICATING THAT THE ABS FEATURE HAD SHUT DOWN AND I WAS LEFT WITH ONLY BASIC HYDRAULIC BRAKES.  I TOOK IT TO THE FORD DEALER AND THEY FOUND A TECHNICAL BULLETIN THAT INDICATED THEY NEED TO JUMP ONE WIRE IN THE SYSTEM.  I HAD THAT DONE AND PAID FOR THE REPAIR.  SEVERAL DAYS LATER THE CHECK BRAKE SYSTEM MESSAGE CAME ON AGAIN.  BOTH TIMES THE CODE READER INDICATED THERE WAS NOTHING WRONG WITH THE VEHICLE AT THE FORD DEALER.  THE CHECK BRAKE MESSAGE CLEARS AFTER YOU TURN THE VEHICLE OFF FOR A PERIOD OF TIME.  THE VEHICLE HAS DONE THIS A  NUMBER OF TIMES DURING THE FOLLOWING MONTHS INCLUDING ON APRIL 26 AND 29.  ON MAY 3, 2013 I REVISITED THE DEALER AND HAD THE SYSTEM RECHECKED AND THEY FOUND NOTHING WRONG. THEY CONNECTED THE CODE READER AND EXAMINED THE VEHICLE AND COULD NOT FIND A PROBLEM.  ON MAY 15, 2013, THE CHECK BRAKE MESSAGE CAME ON AND THIS TIME I DID NOT TURN THE VEHICLE OFF SO THE BRAKE SYSTEM MESSAGE (CHECK BRAKE SYSTEM AND THE BUZZER SOUNDING) WAS ON WHEN THE MECHANIC ARRIVED.  AGAIN THEY CHECKED THE VEHICLE AND THE CODE READER INDICATED ALL SYSTEMS WERE FINE, EVEN THOUGH THE MESSAGE CENTER SAID THERE WAS A PROBLEM.  THE PERSONNEL WE TALKED TO INDICATED THAT THIS PROBLEM HAS HAPPENED TO A NUMBER OF OTHER VEHICLES AND WAS MOST LIKELY CAUSE BY THE WIRING HARNESS BUT COULD NOT GUARANTEE THAT WOULD FIX THE INTERMITTENT PROBLEM.  THE COST TO FIX THIS PROBLEM WAS $4000.  THIS IN OUR OPINION IS A MANUFACTURER DEFECT.  THE WIRING HARNESS HASN'T BEEN TAMPERED WITH AND ALL REPAIRS HAVE BEEN DONE AT A FORD DEALER.  THIS IS A SAFETY ISSUE AS THE ABS FAILURE COULD CAUSE AN ACCIDENT ON SLIPPERY ROADS OR DURING FAST STOPS.  *TR",
        "vin": "4M2CU98H06K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/17/2012",
        "dateOfIncident": "10/09/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10488964,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 MERCURY MARINER. THE CONTACT STATED THAT THE ACCELERATOR PEDAL BECAME STUCK TO THE FLOORBOARD WHILE DRIVING. THE FAILURE WAS EXPERIENCED SEVERAL TIMES. THE ACCELERATOR PEDAL WAS DEPRESSED WITH FORCE IN ORDER FOR IT TO RELEASE.  THE VEHICLE WAS NOT TAKEN TO THE DEALER.  THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE AND CURRENT MILEAGE WAS 107,313.",
        "vin": "4M2YU56Z36D"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/11/2012",
        "dateOfIncident": "09/10/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10475066,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 MERCURY MARINER. THE CONTACT STATED THAT HE NOTICED A STAIN ON THE DRIVEWAY AND TOOK VEHICLE TO DEALER FOR INSPECTION. THE DEALER DIAGNOSED THAT THE HIGH PRESSURE POWER STEERING HOSE WAS LEAKING POWER STEERING FLUID. THE VEHICLE WAS NOT REPAIRED, PART WAS NOT AVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND REFERRED THE CONTACT TO DEALER. THE FAILURE AND CURRENT MILEAGE WAS 18,473.",
        "vin": "4M2YU57146D"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/26/2012",
        "dateOfIncident": "07/19/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10467885,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS ENTERING THE INTERSTATE 430 AT THE MAUMELLE, ARKANSAS ON RAMP AND BEGAN ACCELERATING TO MERGE WITH RUSH HOUR TRAFFIC.  I NOTICED THAT I HAD ACCELERATED FASTER THAN NORMAL...70 MPH.  I TOOK MY FOOT OFF THE ACCELERATOR TO SLOW DOWN, BUT I DIDN'T SLOW DOWN.  I THOUGHT I MUST HAVE HIT THE CRUISE CONTROL BUTTON, SO I HIT THE OFF BUTTON AND BRAKE AND SLOWED SLIGHTLY...60MPH THE CRUISE CONTROL WAS NOT ON.   I  LET OFF THE BRAKE AND CAR BEGAN ACCELERATING BACK UP TO 65 MPH VERY QUICKLY.  BY THIS TIME, I WAS ENTERING THE INTERSTATE 40 ON RAMP/CRYSTAL HILL EXIT IN NORTH LITTLE ROCK, ARKANSAS. I REALIZED THAT MY BRAKES WERE NOT SLOWING MY SUV AND I HAD TO GET THE CAR TO A STOP.   I STAYED ON THE CRYSTAL HILL EXIT...PUSHING ON BRAKES AS HARD AS I COULD.  I ONLY SLOWED TO ABOUT 40 OR 50 MPH.  I TURNED MY HAZARD LIGHTS AND BEGAN EDGING TO THE SHOULDER.  SO STILL PUSHING ON MY BRAKES,  I PUT THE SUV IN NEUTRAL.  I FINALLY STOPPED ABOUT 100 FEET FROM THE STOP SIGN AT THE CRYSTAL HILL ROAD.  WHEN I STOPPED, I NOTICED THE ENGINE WAS REVVING A LOT SO I PUT IT IN PARK AND TURNED THE SUV OFF.  I TRIED TO STAY CALM FOR ME AND MY BABY SINCE I WAS 35 WEEKS PREGNANT.  I WAS LUCKY THAT I DIDN'T HAVE TO CRASH THE CAR TO STOP IT OR I DIDN'T GO INTO LABOR, BUT PUTTING IT IN NEUTRAL WORKED.  MY HUSBAND HAD MY SUV TOWED TO CRAIN FORD DEALERSHIP.  THEY HAVE DIAGNOSED THE PROBLEM TO BE THE AIR INTAKE VALVE AND THE THROTTLE POSITION SENSOR.  THE TOW TRUCK DRIVER AND THE MECHANIC AT THE DEALERSHIP SAID THE SUV WAS MESSED AND BARELY GOT IT IN THE GARAGE TO REPAIR WHICH THE DEALERSHIP IS WORKING ON...ONE WEEK LATER.  THE DIAGNOSIS WAS VERBAL FROM THE DEALERSHIP...NOTHING IN WRITING AS OF YET.  *TR",
        "vin": "4MJ2YU56166"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/20/2012",
        "dateOfIncident": "05/01/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10466715,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 MERCURY MARINER. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 5 MPH, THE ACCELERATOR PEDAL BEGAN TO STICK IN A PARTIALLY DEPRESSED POSITION. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC AND THE ACCELERATOR CABLE WAS REPLACED. THE FAILURE RECURRED APPROXIMATELY TWO MONTHS LATER. THE VEHICLE WAS TAKEN BACK TO THE MECHANIC FOR THE SAME REPAIR. THE FAILURE CONTINUED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 35,000.",
        "vin": "4M2YU56Z56K"
    },
    {
        "components": "STRUCTURE,WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/11/2012",
        "dateOfIncident": "04/04/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10454835,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 MERCURY MARINER. THE CONTACT STATED THAT WHILE THE VEHICLE WAS AT A LOCAL MECHANIC FOR ROUTINE MAINTENANCE, SHE WAS INFORMED THAT THE REAR DRIVER'S WHEEL AND FRAME WERE SEVERELY CORRODED. THE CONTACT WAS ALSO INFORMED THAT THE WHEEL AND FRAME SEPARATED FROM THE BODY OF THE VEHICLE. THE MANUFACTURER DENIED ASSISTANCE WITH THE REPAIR. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND THE CURRENT MILEAGES WERE 110,000.",
        "vin": "4M2CU57126K"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/23/2012",
        "dateOfIncident": "03/20/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10452821,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRAFFIC LIGHT TURNED YELLOW, I APPLIED THE BRAKES WHICH WORKED MOMENTARILY THEN RELEASED AS THE BRAKE PEDAL WENT ALL THE WAY TO THE FLOORBOARD. NO WARNING LIGHTS ILLUMINATED IN THE INSTRUMENT PANEL. USING THE EMERGENCY BRAKE I STOPPED SHORT OF BLOCKING THE INTERSECTION. UPON STOPPING IT WAS DETERMINED THAT ON LEVEL GROUND WITH THE VEHICLE IDLING IN DRIVE AND THE BRAKE PEDAL FULLY DEPRESSED THERE WAS NOT ENOUGH BRAKE FORCE TO KEEP THE VEHICLE FROM MOVING FORWARD.    INSPECTION OF THE VEHICLE REVEALED THAT THE LEFT (DRIVER SIDE) FRONT FLEXIBLE BRAKE LINE HAD RUPTURED AND THAT THERE HAD BEEN A SMALL AMOUNT OF BRAKE FLUID LOST FROM THE MASTER CYLINDER. THIS LINE IS ABOUT 17 INCHES LONG WITH A METAL SLEEVE IN THE MIDDLE WHERE IT IS ATTACHED TO THE VERTICAL STRUT FOR SUPPORT. THE RUPTURE WAS AT THE TOP OF THIS SLEEVE.    WHILE BLEEDING THE BRAKES AFTER THE LINE WAS REPLACED, IT WAS FOUND THAT THE LOW BRAKE FLUID SENSOR WORKED.    IS THIS AN UNKNOWN \"SAFETY FEATURE\" OF ABS? IF IT IS, PROGRESS HAS BROUGHT US BACK TO WHERE AN INDIVIDUAL PART CAN CAUSE THE SAME CATASTROPHIC FAILURE AS BEFORE THE SPLIT SYSTEM WAS INTRODUCED IN THE 1960S.    I AM THE ORIGINAL OWNER OF THIS VEHICLE.  THIS HAS BEEN REPORTED TO FORD MOTOR COMPANY. *TR",
        "vin": "4M2CU57136D"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/13/2012",
        "dateOfIncident": "03/12/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10451388,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "L/H TONE RING ON AXEL CRACKED AND THREW AN ABS WARNING, BRAKE SERVICE WARNING AND 4WD LIGHT BLINKING.   AT APPROX 65,000 THE R/H TONE RING CRACKED AS WELL BUT WAS SMALL ENOUGH THAT IT DID NOT TRIP THE SENSOR.  I NOTICED A CLICKING SOUND WHEN TURNING INTO PARKING SPACES.  THIS WAS FIXED UNDER MY EXTENDED WARRANTY.    FROM SEARCHES ON THE INTERNET THIS SEEMS TO BE A DESIGN FLAW OF THIS WEAK PART.  DEALERS TRY TO GET YOU TO REPLACE THE ENTIRE AXEL WHICH IS NOT NEEDED AS DID THE FORD DEALER IN MARGATE.   FORD SHOULD BE REPLACING THESE TONE RINGS WITH A PART WITH STRONGER TENSILE STRENGTH SO IT DOES NOT CRACK.  THIS NEEDS TO BE A RECALL AS IT WILL STRAND MANY WHO SEE ALL THE LIGHTS AND WARNINGS GO OFF AND THINK THEY CANNOT CONTINUE DRIVING.   THIS IS A POOR DESIGN, A POORLY MADE PART AND THROUGH IT'S DEALER NETWORK A RIP-OFF FOR CUSTOMERS WHO ARE TOLD THE ENTIRE AXEL NEEDS REPLACEMENT.  *TR",
        "vin": "4M2YU57106K"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/17/2011",
        "dateOfIncident": "11/03/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10436194,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 MERCURY MARINER.  THE CONTACT WAS DRIVING 50 MPH WHEN THE VEHICLE STALLED.  THE VEHICLE WOULD NOT SHIFT INTO GEAR AND WAS TOWED TO THE DEALER. THE DEALER ADVISED THAT THE TRANSMISSION MALFUNCTIONED AND NEEDED TO BE REPLACED.  THE TRANSMISSION WAS NOT REPLACED.  THE FAILURE MILEAGE WAS 68,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/26/2011",
        "dateOfIncident": "06/13/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10427147,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 MERCURY MARINER. WHILE DRIVING APPROXIMATELY 45 MPH, THE VEHICLE STALLED WITHOUT WARNING. AFTER RESTARTING THE VEHICLE, THE INSTRUMENT PANEL AND GAUGE FAILED TO OPERATE. THE FAILURE OCCURRED THREE TIMES. ON ONE OCCASION THE VEHICLE WOULD NOT START UNTIL SEVERAL ATTEMPTS WERE MADE. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER TWICE FOR THE IDENTICAL FAILURE AND THEY WERE UNABLE TO DUPLICATE THE PROBLEM. THE FAILURE PROGRESSED OVER A PERIOD OF TIME. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 95,000.",
        "vin": "4M2CU56196D"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/25/2011",
        "dateOfIncident": "09/25/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10397373,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 MERCURY MOUNTAINEER. THE CONTACT WAS DRIVING 35 MPH WHEN THE ACCELERATOR PEDAL BECAME STUCK. THE FAILURE WOULD OCCUR INTERMITTENTLY AND THE CONTACT WOULD HAVE TO TAP THE PEDAL SEVERAL TIMES BEFORE IT WOULD RELEASE. THE VEHICLE WAS TAKEN TO THE DEALER WHO STATED THAT A TUBE WOULD NEED TO BE CLEANED IN ORDER TO KEEP THE PEDAL FROM STICKING. THERE WERE NO RECALLS RELATED TO THE FAILURE AND THE REPAIRS OF $400 WERE AT THE CONTACTS EXPENSE. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 103,000.",
        "vin": "4M2YU56Z46K"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/15/2010",
        "dateOfIncident": "10/04/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10360654,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 MERCURY MARINER. THE CONTACT STATED WHILE DRIVING 5 MPH, THE SMART JUNCTION BOX THAT CONTROLLED THE EXTERIOR LIGHTS FAILED. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHO ADVISED THAT CONTACT THAT THE PARTS NEEDED TO MAKE REPAIRS TO THE VEHICLE WERE ON BACKORDER FOR THE NEXT THREE MONTHS. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 50,000.",
        "vin": "4M2YU56Z36D"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/31/2010",
        "dateOfIncident": "05/30/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10333926,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD THE POWER STEERING PUMP AND RACK REPLACED AT SEPARATE TIMES DURING THE WARRANTY PERIOD ON MY 2006 MERCURY MARINER.  THIS WAS BETWEEN JANUARY 2008 AND DECEMBER 2008.  NOW THEY ARE FAILING ONCE AGAIN.  SHOULD THERE BE A RECALL ON THESE ITEMS? *TR",
        "vin": "4M2YU57146K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/03/2010",
        "dateOfIncident": "10/01/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10316317,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY MERCURY MARINER 2006 IN 2005.  WHILE UNDER WARRANTY, I BROUGHT IN THE VEHICLE SEVERAL TIMES TO THE DEALERSHIP FOR SERVICE DUE TO THE GAS PEDAL STICKING.  I WOULD TRY TO ACCELERATE AND IT WOULD STICK AND NOT ACCELERATE.  AFTER SEVERAL VISITS THEY DETERMINED IT WAS A FLUID PROBLEM OR IT NEEDED TO BE CLEANED.  THE PROBLEM STILL PERSISTED AFTER MAINTENANCE WAS PERFORMED.  AT MY LAST VISIT, THE PART WAS REPLACED.  THE PEDAL STILL STICKS, BUT I AM NOW OUT OF WARRANTY AND CANNOT AFFORD TO PLAY GUESSING GAMES WITH MY DEALERSHIP AT COSTS TO ME.  ON A COUPLE OF OCCASIONS THE VEHICLE DID ACCELERATE RAPIDLY WITHOUT CAUSE, HOWEVER MY MAIN PROBLEM HAS BEEN THE GAS PEDAL STICKING.   IT TYPICALLY HAPPENS DURING COLD HUMID CLIMATE. *TR",
        "vin": "4M2YU56Z06K"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/27/2008",
        "dateOfIncident": "12/15/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10252913,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TRAVELING WEST BOUND ON BULL VALLEY RD WHEN A CAR GOING EAST BOUND TURNED IN FRONT OF ME CAUSING A HEAD ON ACCIDENT TO MY 2006 MARINER 4X4 HYBRID. I WAS TRAVELING 35 MPH AT TIME OF IMPACT AND SEAT BELTS DID NOT GO OFF CAUSING CHEST PAINS. MY VEHICLE HAD 11,000 WORTH OF DAMAGE TO THE FRONT END WHEN DOES THE AIR BAGS DEPLOY?  *TR",
        "vin": "4M2YU98H06K"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "07/14/2008",
        "dateOfIncident": "07/01/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10234145,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 MERCURY MARINER.  THE PASSENGER SIDE SEAT WARMER AUTOMATICALLY ACTIVATES AS SOON AS THE SEAT BELT IS APPLIED.  THE VEHICLE HAS BEEN TAKEN TO THE DEALER TWICE, AND THEY SUPPOSEDLY REPAIRED THE FAILURE THE FIRST TIME.  TWO DAYS LATER, THE FAILURE RECURRED.  WHEN THE VEHICLE WAS TAKEN BACK THE SECOND TIME, THE DEALER REPLACED A SENSOR OR SOMETHING TO THAT NATURE.  THE REPAIR TEMPORARILY CORRECTED THE FAILURE FOR A FEW MONTHS BEFORE IT RECURRED.  THE VEHICLE IS CURRENTLY IN THE CONTACT'S POSSESSION AND HAS NOT BEEN REPAIRED.  THE FAILURE MILEAGE WAS 15,000 AND CURRENT MILEAGE WAS 35,000.   UPDATED 07/29/08  *BF  UPDATED 08/01/08. *JB",
        "vin": "4M2CU56186D"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/20/2008",
        "dateOfIncident": "03/03/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10222748,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 MERCURY MARINER WAS BOUGHT WITH THE INTENTION OF ONLY COSTING $15,000. CONSUMER STATES THAT WHEN HE GOT READY TO PAY OFF THE VEHICLE THE DEALER STATED THAT HE ALSO OWED FOR TAX. HE WOULD LIKE TO BE REIMBURSED $500.00 WHICH WAS HIS DOWN PAYMENT.  *KB",
        "vin": "4M2YU56106D"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "01/29/2008",
        "dateOfIncident": "01/02/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10217161,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 MERCURY MARINER SUFFERED A ROLLOVER AFTER ACCIDENT.  CONSUMER STATES THAT THERE IS NO EXCUSE WHY THE VEHICLE FLIPPED OVER ON ITS TOP AFTER BEING HIT AT A SLOW SPEED BY A MUCH SMALLER VEHICLE. CONSUMER WOULD ALSO LIKE TO KNOW WHY THE AIRBAGS DID NOT DEPLOY.  *KB",
        "vin": "4M2YU7756DJ"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/12/2007",
        "dateOfIncident": "11/06/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10208726,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "PREMATURE CONTROL ARM BUSHING FAILURE.  *TR",
        "vin": "4M2YU57176K"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/08/2007",
        "dateOfIncident": "11/02/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10208424,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 MERCURY MARINER.  WHILE DRIVING 30 MPH, THE CONTACT HEARD A METAL GRINDING NOISE.  THE BRAKES WERE APPLIED; HOWEVER, THE NOISE GREW LOUDER AND THE VEHICLE BEGAN TO VEER TO THE RIGHT.  WHEN THE BRAKES WERE RELEASED AND REAPPLIED. THERE WERE ALSO NO WARNING INDICATORS PRESENT.  THE VEHICLE WAS TAKEN TO THE REPAIR SHOP AND THEY STATED THAT THE FRONT PASSENGER SIDE BRAKES WERE WORN DOWN TO THE ROTORS.  THE ROTORS AND PADS WERE REPLACED.  THE CURRENT AND FAILURE MILEAGES WERE 27,500.  UPDATED 03-05-08 *BF   THE CONSUMER STATED THE BRAKE INDICATOR STATED THE BRAKES WERE FINE. THE BRAKES WERE DOWN TO THE METAL.",
        "vin": "4M2CU57106K"
    },
    {
        "components": "SERVICE BRAKES, ELECTRIC,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "07/22/2007",
        "dateOfIncident": "07/13/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10197159,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2006 MERCURY MARINER HYBRID, AND THE BRAKES ON THE CAR GO OUT ON IT.    THE BRAKES GO OUT FOR 5 TO 7 SEC. AND THE SERVICE BRAKES LIGHT COME ON AND IT STOPS. THE LAST TIME, IT DID NOT STOP RIGHT A WAY. I HAVE BEEN HAVING IN-DASH NAVIGATION SYSEM PROBLEM AND THE DEALER HAD WORK ON IT.  IT IS NOT FIXED RIGHT. AND THE BRAKES STOPPED WORK AGAIN. I HAD CALLED THE DEALER BACK AND SAID THE NAVIGATION IS NOT WORKING RIGHT.  I GOT IN MY CAR AND BRAKES STOPPED WORKING AT THE END OF MY DRIVEWAY. I A  DATE FOR THE BRAKES AND THE NAVIGTION.  THE CAR HAS 13473 MILES ON IT AND THERE IS A WARRANTY ON IT .THE DEALER PUT IN A MODULATOR IN IT THE FIRST TIME. *JB",
        "vin": "4M2CU98H76K"
    },
    {
        "components": "SUSPENSION,TIRES",
        "crash": false,
        "dateComplaintFiled": "12/22/2006",
        "dateOfIncident": "04/28/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10176792,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "CONTINENTAL",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "I PURCHASE A 2006 MERCURY MARINER ON FEBRUARY 18, 2006, AT PRICE LINCOLN MERCURY IN CENTENNIAL, CO.  WHEN I PURCHASE THIS VEHICLE IT HAD 15 MILES ON THE ODOMETER.  I WAS INSTRUCTED BY THE SALES REP THAT I SHOULD AVOID DRIVING THIS VEHICLE OVER 55 MPH TO ALLOW THE ENGINE TO BREAK IN PROPERLY.  I STARTING HAVING A SHIMMING AND VIBRATION WHEN THE VEHICLE GET TO 60 AND ABOVE.  THIS SHIMMING IS COMING FROM THE FRONT SUSPENSION.  I HAVE TAKING THIS VEHICLE TO TWO DIFFERENT MERCURY DEALERSHIP TRYING TO GET THIS PROBLEM RESOLVED.  THE LAST RESULT BY ONE OF THE DEALERSHIP WAS TO REPLACE ALL FOUR TIRES, THEY REPLACE ALL FOR TIRES AND I AM HAVING THE SAME PROBLEM.  I CONTACTED THE FORD MOTOR CO TO REPORT THE PROBLEM AND POSSIBLE GET THEM TO REPLACE OR REPURCHASE THE VEHICLE WHICH THEY REFUSE TO DO SO.  THERE RESPONSE TO ME IS THAT THIS IS SOMETHING I WILL HAVE TO DEAL WITH, BECAUSE THIS IS THE NORMAL BEHAVIOR OF THIS VEHICLE.  I AM WRITING TO YOU FOR HELP BECAUSE IT IS HARD FOR ME TO ACCEPT THAT THIS VEHICLE OPERATING THE WAY IS AS DESCRIBE BY FORD.  THIS VEHICLE DRIVE SMOOTH UNTIL IT GET TO 60, AND I HAVE TAKEN IS BACK TO THE DEALERS FIVE OR MORE TIME FOR REPAIRS FOR THE SAME ISSUES.  PLEASE HELP IN RESOLVING THIS PROBLEM.  *NM",
        "vin": "4M2CU57136K"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "09/05/2006",
        "dateOfIncident": "04/19/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10167339,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS COMPLAINT REGARDS THE 2006 MERCURY MARINER THAT I AM LEASING.  THE VEHICLE WAS LEASED BEGINNING IN APRIL, 2006 FROM HOLMAN LINCOLN-MERCURY IN MT. LAUREL, NEW JERSEY.  MY WIFE, THE PRINCIPAL DRIVER OF THIS VEHICLE COMPLAINED ABOUT THE HEAD RESTRAINTS PREVENTING HER FROM KEEPING HER HEAD STRAIGHT UP WHILE DRIVING.  THE MARINER'S HEAD RESTRAINTS PROJECT FORWARD PREVENTING THE DRIVER FROM KEEPING HIS/HER HEAD STRAIGHT UP WHILE DRIVING.  THIS IS VERY UNCOMFORTABLE AS ONE'S HEAD IS BENT FORWARD.  SOMETIME IN AUGUST, I RETURNED TO HOLMAN AND  MET WITH MR. DAVID BURNS, THE SERVICE MANAGER.  HE LOOKED AT THE HEAD RESTRAINTS AND AGREED THAT THEY PROJECTED FORWARD.  HE AND I THEN LOOKED AT ALL THE OTHER MERCURY MARINERS ON THE LOT (ABOUT 20) AND FOUND THAT ALL OF THEM HAD THE SAME RESTRAINTS.  WE ALSO CHECKED OTHER MODEL NEW VEHICLES ON THE LOT AND FOUND THAT ALL OF THE RESTRAINTS WERE STRAIGHT UP AS ONE WOULD EXPECT.  MR. BURNS THEN CHECKED TO SEE IF FORD HAD ANY ISSUES WITH THE RESTRAINTS ON THE MARINER BUT COULD NOT FIND ANY.  I CAN ONLY SAY THAT WHEN I DRIVE THE VEHICLE, I AGREE WITH MY WIFE THAT THE HEADREST PREVENTS ME FROM DRIVING IN A COMFORTABLE POSITION.  IS THIS A SAFETY HAZARD?  I WOULD APPRECIATE YOUR LOOKING INTO THIS MATTER AND GIVING ME YOUR OPINION. *JB",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/14/2006",
        "dateOfIncident": "07/09/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10162415,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I ONLY HAD MY CAR 4 DAYS WHEN DRIVING ON THE GARDEN STATE PARKWAY AT APPROXIMATELY 60 MPH ON A SUNDAY WITH MY GRANDCHILDREN IN THE CAR.  LUCKILY, I WAS IN THE SLOW LANE WHEN THE SUV JUST SHUT OFF.  I WAS ABLE TO PULL ONTO THE SHOULDER AND RESTART THE CAR.  I WAS NEAR AN EXIT AND PROCEEDED DOWN THE RAMP.  THE CAR AGAIN SHUT OFF AT THE BOTTOM ON THE RAMP.  THE CHECK ENGINE LIGHT STAYED ON. I CALLED THE DEALER THE NEXT DAY (MONDAY) AND BROUGHT THE CAR IN ON TUESDAY.  IT IS NOW FRIDAY AND I STILL DO NOT HAVE MY CAR.  *JB",
        "vin": "4M2EU47E96U"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/06/2006",
        "dateOfIncident": "06/04/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10159085,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "FORD MERCURY MARINER: AT 65 MPH I TAPPED THE BRAKE PEDAL TO DISCONNECT THE CRUISE CONTROL. PROCEEDED TO PRESS THE GAS PEDAL AND FOUND THE GAS PEDAL CABLE TO THE THROTTLE LINKAGE FELL OFF.  COASTING THROUGH 65 MPH TRAFFIC WITH NO GAS CONTROL WAS CHALLENGING.  WHY DID THE GAS PEDAL CABLE FALL OFF AND HAS OTHER VEHICLES OWNERS EXPERIENCE THE SAME PROBLEM? *JB",
        "vin": "4M2YU56ZX6K"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/10/2006",
        "dateOfIncident": "04/07/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10158379,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 MERCURY MARINER TRANSMISSION SLIPPED AT 4,000 MILES.  *TS  THE VEHICLE WAS TOWED TO THE DEALER FOR SERVICE.  THE MANUFACTURER APPROVED A BRAND NEW TRANSMISSION TO BE INSTALLED.  *NM",
        "vin": "4M2YU56146K"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/28/2006",
        "dateOfIncident": "01/15/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10151470,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE DRIVING 25 MPH THE STEERING PULLED HARD TO THE LEFT AND GOT WORSE AT HIGHER SPEEDS.  THE VEHICLE WAS TAKEN TO THE DEALERSHIP FOR INSPECTION.  THEY ALIGNED THE FRONT WHEELS AND ELONGATED THE BOTTOM BOLT OF THE STRUT TO THE KNUCKLE, HOWEVER THE PROBLEM STILL EXISTS.  THE MANUFACTURER WAS ALERTED.  AFTER FOUR ATTEMPTS TO CORRECT THE PROBLEM, THE DEALER FINALLY STATED THAT WAS THE WAY THE VEHICLE WAS DESIGNED. UPDATED 03/20/06. *JB",
        "vin": "4M2YU56196D"
    }
]