[
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "06/18/2012",
        "dateOfIncident": "01/04/2012",
        "fire": true,
        "manufacturer": "DAIMLERCHRYSLER MANUFACTURING INTL",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10462110,
        "products": [
            {
                "manufacturer": "DAIMLERCHRYSLER MANUFACTURING INTL",
                "productMake": "SPRINTER",
                "productModel": "3500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING SAW SMOKE FROM RIGHT SIDE OF ROOF AND PILLAR, THEN SAW FLAMES, EXTINGUISHED FLAMES, REPAIRER ADVISED THAT SHORT IN FUSE BLOCK STARTED THE FIRE, REPAIRS WERE $13000+ AND AFFECTED REAR LIGHTS AND SEAT BELTS.  *TR",
        "vin": "WD0PD444265"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/09/2010",
        "dateOfIncident": "01/27/2010",
        "fire": false,
        "manufacturer": "Daimler Buses North America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10317924,
        "products": [
            {
                "manufacturer": "Daimler Buses North America",
                "productMake": "SPRINTER",
                "productModel": "3500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WE PURCHASED A 2006 DODGE SPRINTER 3500 AS A 2006 WINNEBAGO VIEW  CLASS C MOTORHOME WITH 5010 MILES ON NOVEMBER 2006.  WE WERE TRAVELING APRIL 2007 WHILE CROSSING THE JACKSONVILLE BRIDGE ON A1A, FL.. THE MOTORHOME WOULD NOT ADVANCED.  IT LOST THE POWER. WE MADE IT TO THE  TOP OF THE BRIDGE AT 20MPH.  WE DO NOT KNOW HOW WE MADE IT.  WE HAD TO  INTERRUPT THE TRIP AND GO TO A DODGE DEALER AND THEY FOUND THE RESONATOR  WAS THE PROBLEM   A FEW DAYS AGO JAN. 2010  ON THE NORTH GEORGIA MOUNTAINS SCENIC HWY 348,  BLAIRSVILLE, GA; WHEN WE GOT TO THE HIGHEST PEAK THE MOTORHOME WOULD NOT GO  AT ALL.  WE HAD TO BACK UP SLOWLY AT LEAST HALF A MILE TO FIND A SPOT OR SHOULDER TO  TURN AROUND AND GO DOWNHILL.  CAN YOU IMAGINE DRIVING BACKWARDS ON A NARROW  TWO LANE ROAD ON A STEEP MOUNTAIN WITHOUT ANY KIND OF PROTECTION.  THIS VEHICLE IS A HAZARD TO US AND OTHER MOTORISTS.  THIS IS A VERY DANGEROUS SITUATION .  A RECALL IS NEEDED BEFORE SOMEONE GETS KILLED. *TR",
        "vin": "WDXPD944055"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/12/2009",
        "dateOfIncident": "09/12/2009",
        "fire": false,
        "manufacturer": "Daimler Buses North America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10287135,
        "products": [
            {
                "manufacturer": "Daimler Buses North America",
                "productMake": "SPRINTER",
                "productModel": "3500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "SUBJECT:  TURBO RESONATOR FAILURE    I TOOK DELIVERY OF A DODGE SPRINTER MODEL 3500 CHASSIS WHEN I PURCHASED A WINNEBAGO VIEW IN MARCH OF 2007.      CURRENT MILEAGE:  15,422    I HAVE MAINTAINED THE VEHICLE IN ACCORDANCE WITH THE OWNER'S MANUAL.    ON 8/17/09, I HAD THE RESONATOR, PART NUMBER 14070001, AND THE ASSOCIATED AIR HOSE, PART NUMBER 14089002, REPLACED FOR THE THIRD TIME.  THE REPAIR WAS DONE BY FARRISH DODGE IN FAIRFAX, VA.  THE FIRST FAILURE WAS IN 2007, THE REPAIR WAS DONE BY DOMINION DODGE IN ROANOKE, VA.  THE SECOND FAILURE WAS IN 2008, THE REPAIR WAS DONE BY FREIGHTLINER OF HAGERSTOWN IN HAGERSTOWN, MD.    IN EACH CASE, I WAS DRIVING THE VEHICLE AT HIGHWAY SPEED ON AN INTERSTATE HIGHWAY WHEN THE VEHICLE SUDDENLY SLOWED AND BEGAN TO HAVE NO POWER.  I WAS TOLD THAT WHEN THE FAILURE OF THE RESONATOR IS DETECTED, THE ENGINE IS PUT INTO THE 'SAFE' MODE AT WHICH TIME THE VEHICLE CAN ONLY BE DRIVEN AT LOW SPEED FOR A SHORT DISTANCE.      WHEN I SPOKE WITH THE SERVICE TECHNICIAN AT FARRISH DODGE, HE INFORMED ME THAT THERE IS NO SOLUTION TO THIS PROBLEM THAT HAS BEEN IDENTIFIED BY DODGE.  HE DID SAY THAT THIS IS A FAIRLY COMMON AND WELL-KNOWN PROBLEM.  HE ALSO MENTIONED THAT HE IS AWARE THAT THERE IS AN AFTERMARKET ALL METAL RESONATOR AVAILABLE BUT COULD NOT BE SURE WHETHER THE INSTALLATION OF THIS WOULD VOID THE WARRANTY ON THE VEHICLE.    I WOULD LIKE TO KNOW WHEN DODGE INTENDS TO OFFER A SOLUTION TO THIS RECURRING PROBLEM.  MY WARRANTY WILL CONTINUE TO COVER THIS REPAIR FOR TWO MORE YEARS, BUT AT THIS POINT, I HAVE NO CONFIDENCE THAT THE PROBLEM WILL NOT CONTINUE TO RE-OCCUR FOR THE LIFE OF THE VEHICLE.    THE SAFETY CONCERN IS THAT THIS FAILURE HAS OCCURRED THREE TIMES WHILE DRIVING ON BUSY INTERSTATE HIGHWAYS AT WHICH TIME THE VEHICLE ESSENTIALLY COMES TO A NEAR STOP WITHOUT WARNING.  IN ONE CASE I WAS ALMOST HIT IN THE REAR END BY A LARGE TRUCK.    I HAVE APPROACHED DODGE CUSTOMER SERVICE WITH NO USEFUL HELP. *TR",
        "vin": "WDXPD944765"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/01/2009",
        "dateOfIncident": "06/26/2009",
        "fire": false,
        "manufacturer": "Daimler Buses North America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10275421,
        "products": [
            {
                "manufacturer": "Daimler Buses North America",
                "productMake": "SPRINTER",
                "productModel": "3500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2006 SPRINTER MOTOR HOME (CAB BY GULFSTREAM) SUFFERED A RESONATOR FAILURE ON JUNE 26TH ON INTERSTATE 81N NEAR BRISTOL TN. IT HAS 18,500 MILES ON IT. I WAS ABLE TO GET TO THE RIGHT LANE AND, IN \"LIMP HOME\" MODE FOUND A SPRINTER REPAIR GARAGE AND A NEW RESONATOR WAS INSTALLED.   I INTEND TO REPLACE THIS PLASTIC RESONATOR WITH AN ALUMINUM PART. THANKS.  *TR",
        "vin": "WDYPD744465"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "11/13/2008",
        "dateOfIncident": "10/21/2008",
        "fire": false,
        "manufacturer": "Daimler Buses North America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10248752,
        "products": [
            {
                "manufacturer": "Daimler Buses North America",
                "productMake": "SPRINTER",
                "productModel": "3500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TURBO RESONATOR CRACKED AND PUT SPRINTER INTO LIMP MODE. 30 MPH. I HAVE READ HUNDREDS OF CASES ON THE INTERNET WITH THIS ITEM AND I HAD PURCHASED AN ALUMINUM ALTERNATIVE RESONATOR IN CASE IT HAPPENED TO ME. WHEN IT DID FAIL I WAS ABLE TO REPLACE THE RESONATOR IN 30 MINUTES. THE LIMP MODE IS VERY SCARY ON A FREEWAY WHEN IT FAILS. YOU CANNOT ACCELERATE PAST 30 MPH. I AM SURE THIS IS SO NOT TO HURT THE TURBO, BUT IN ANY CASE THE PART IS A WELL KNOW DEFECTIVE PART. *TR",
        "vin": "WDXPD944365"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/25/2007",
        "dateOfIncident": "02/07/2007",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10206863,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "SPRINTER",
                "productModel": "3500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 DODGE RAM 3500- VEHICLE HAS BEEN IN DEALERSHIP 3+ TIMES FOR SAME PROBLEM.  WHILE DRIVING, CHECK ENGINE LIGHT COMES ON AND LOSES POWER. DROPS TO LOWER GEAR AND CONTINUES TO LOSE SPEED. SOMETIMES AS LOW AS IDLE ONLY. ECM HAS BEEN REPLACED (2) TIMES AND ACCELERATOR MODULE (1) AND SHORT IN WIRING REPAIRED?-  LAST REPAIR DONE ON 10/23/07 - DROVE 69 MILES AND SAME PROBLEM AGAIN.  DEALER CLAIMS THEY CAN NOT FIND PROBLEM. HAVE CONTACTED CHRYSLER CORP. AND STARTED LEMON REPLACEMENT PROCEEDINGS? THIS TRUCK WAS ALSO REPAIRED PRIOR TO ME PURCHASING IT WITH ONLY 45 MILES ON SPEEDOMETER. CHRYSLER HAS ASK ME TO TAKE TRUCK BACK TO DEALER FOR FURTHER REPAIR??   *JB",
        "vin": "3D7LL39C76G"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/15/2007",
        "dateOfIncident": "09/04/2007",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10205739,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "SPRINTER",
                "productModel": "3500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DODGE DURANGO (2006) ON TWO SEPARATE OCCASIONS HAS LUNGED FORWARD WITH THE ENGINE REVVING UP AND WOULD NOT STOP UNTIL I SHIFTED INTO NEUTRAL AND PRESSED ON THE BRAKE ALL THE WAY TO THE FLOOR.  THE FIRST TIME WAS ON 9/4/07 I WAS APPROACHING A FOUR LANE DIVIDED ROAD, WITH TRAFFIC IN BOTH DIRECTION I STARTED TO APPLY MY BRAKES AND THE VEHICLE JUST HAD A MIND OF ITS OWN AND WOULDN'T STOP.    *JB",
        "vin": "1D4HD482X6F"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/22/2007",
        "dateOfIncident": "08/29/2007",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10203706,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "SPRINTER",
                "productModel": "3500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS COMPLAINT CONCERNS A 2006 DODGE SPRINTER 5 CYL DIESEL ENGINE FAILURE. I HAVE A 2007 WINNEBAGO VIEW RV ON A 2006 SPRINTER. ON AUG 29 2007  I WAS TRAVELING ON I90 IN WASHINGTON STATE JUST WEST OF THE SNOQUALMIE PASS SUMMIT WHEN THE VEHICLE LOST POWER. AT THAT TIME IT HAD 4539 MILE ON THE ODOMETER. WE COULD HAVE BEEN HIT FROM BEHIND OR STRANDED IN THE MOUNTAINS AS A RESULT OF THE FAILURE.  THE WARRANTY ON THE VEHICLE SUGGEST THAT ANY REPAIR MUST BE ACCOMPLISHED BY A SPRINTER DEALERSHIP. THE NEAREST ON WAS OVER 100 MILE AWAY.  THE PARTS THAT FAILED WERE THE 'TEMPERATURE SENSOR (PART # 486235AA TE 8037155 AND THE RESONATOR- TURBO  PART # 513715AB) . THE SPRINTER SERVICE PERSONNEL IN AND OTHER SPRINTER OWNERS TELL ME THAT THE RESONATOR AND TEMPERATURE SENSOR FAILURE RATES ARE QUITE HIGH AND SUGGESTED THAT I PURCHASE A SENSOR REPLACEMENT TO CARRY WHEN TRAVELING. I WAS ALSO TOLD THAT THERE WAS A SERVICE BULLETIN ON THIS APPARENT DEFECT IN THE SPRINTER ENGINE. I SUGGEST A RECALL.  *JB",
        "vin": "WDXPD944265"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/22/2007",
        "dateOfIncident": "06/10/2007",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10194023,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "SPRINTER",
                "productModel": "3500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 DODGE SPRINTER 3500.  WHILE DRIVING 20 MPH UPHILL, THE VEHICLE FAILED TO ACCELERATE.  THE DEALER STATED THAT THE TURBO RESONATOR HAD BURST.  THE VEHICLE HAS BEEN REPAIRED.  THE BODY STYLE WAS UNKNOWN.  THE CURRENT MILEAGE IS 6,887 AND FAILURE MILEAGE WAS 6,725.",
        "vin": "WDXPD944865"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "06/19/2007",
        "dateOfIncident": "01/17/2007",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10193716,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "SPRINTER",
                "productModel": "3500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "A 2006 JEEP GRAND CHEROKEE LIMITED REQUIRED REPAIR THE DAY AFTER PURCHASE. ONE DEALERSHIP COULD NOT REPAIR IT AFTER THREE ATTEMPTS.  THE SELLING DEALERSHIP WORKED ON IT FOR 2 WEEKS,  ATTEMPTED TO RELEASE IT, BUT COULD NOT DUE  TO ENGINE LIGHT AND SHAKING ALL OVER. TWO WEEKS LATER, RELEASED, SEEMINGLY OKAY. THE  FOLLOWING DAY CRASHED WHILE EMPLOYEE HAD BOTH FEET ON BRAKES. POLICE STATED DUE  TO UNINTENDED ACCELERATION.  *AK",
        "vin": "1J4HR58236C"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/30/2007",
        "dateOfIncident": "04/01/2007",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10189225,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "SPRINTER",
                "productModel": "3500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY NEW MOTOR HOME ,  SPRINTER CHASSIS, SUDDENLY LOST POWER WHEN DRIVING ON FREEWAY, WHICH ALMOST CAUSED A CRASH. IT WAS TOWED TO DODGE DEALER IN THOUSAND OAKS CITY, RESULT  WAS A FAILURE OF A TURBO RESONATOR. THIS IS A VERY COMMON PROBLEM AMONG THESE VEHICLES, AND DODGE FAILED TO ADMIT IT TO ISSUE A RECALL.*AK",
        "vin": "WDXPD944365"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "04/23/2007",
        "dateOfIncident": "03/11/2007",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10188563,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "SPRINTER",
                "productModel": "3500",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "C BODY",
                "productYear": "1969",
                "type": "Equipment"
            }
        ],
        "summary": "BEFORE I TOOK MY VEHICLE FOR ITS 6,000 CHECK UP OIL CHANGE. I BEGAN EXPERIENCING A LOT OF SHAKING IN THE WHEEL AND BRAKES. I NOTIFIED THE DEALERSHIP OF THIS ISSUE DURING THE 6K CHECK. THEY INFORMED ME IT WAS MY TIRE PRESSURE. A WEEK AND A HALF LATER I TOOK IT BACK TO DARCARS. THEN THEY INFORMED ME ONE TIRE HAD TOO MUCH AIR IN IT. THEN I TOOK IT BACK AGAIN THEY STATES THE ROTORS WHERE WORN BECAUSE I LET THE CAR SIT TOO LONG(???????????????) THAT WAS ONLY AFTER I WENT FOR A TEST DRIVE WITH THE SHOP MANAGER AND I TOLD HIM THRU CONVERSATION I DON'T DRIVE THE CAR THAT MUCH. SO, THEN THEY TURNED THE ROTORS WHICH I DEMANDED TO MEASUREMENT DOCUMENTED BEFORE AND AFTER THE WORK WAS DONE. THEN IT WAS THE SAME THING AFTERWARDS I CONTACTED DAIMLER CHRYSLER CUSTOMER SERVICE. THEN THEY CONTACTED DARCARS. THEN DARCARS MANAGER BOB TELLS ME THAT A TSB IS COMING OUT FOR BUSHINGS FOR THE BRAKES ON THE CHARGER AND THAT THE PARTS WILL BE IN AT THE END OF THE MONTH . MEANWHILE, THEY WILL CHANGE THE ROTORS (LET ME GUESS NOT THE PADS)AFTER THAT  I HAVEN'T HEARD A THING FROM DARCARS OR DAIMLER BUT A CALL FROM DARCARS CUSTOMER SERVICE NOT THE MANAGEMENT.  WELL YESTERDAY I WAS LEAVING WORK AND I BEGAN TO DRIVE THE CAR WITH THE WINDOW DOWN AND MUSIC DOWN. I HEAR SINGING NOISE FROM MY CAR.  I AM TRULY DISTURBED. I NOTICED THAT DARCARS DODGE IN LANHAM, MARYLAND AND DAIMLER CHRYSLER  WASTED NO TIME CASHING THE CHECK FOR MY CAR WHEN I PURCHASED IT. I WANT TO TAKE MY CAR TO ANOTHER DEALERSHIP THAT IS ALMOST A HOUR AWAY. I FEEL THAT I SHOULD BE COMPENSATED WITH A DEMO TO USE WHILE THEY FIX MY CAR. CAN I GET A NEW CAR ? *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/25/2007",
        "dateOfIncident": "03/05/2007",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10186105,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "SPRINTER",
                "productModel": "3500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "FAILURE OF GLUE HOLDING TOGETHER THE TURBO RESINATOR.  CAUSED 1996 DODGE SPRINTER VAN TO GO INTO ENGINE MALFUNCTION MODE.  VEHICLE SPEED DROPPED TO 40 MPH.  I HAD TO DRIVE 120 MILES ON THE INTERSTATE TO GET TO A SERVICE FACILITY AT 40 MPH.  FORTUNATELY, THERE WERE NO STEEP UPHILL GRADES, OR THE VEHICLE WOULD HAVE BEEN GOING SIGNIFICANTLY SLOWER AT A SPEED NOT ALLOWED ON THE INTERSTATE IN OKLAHOMA.*AK",
        "vin": "WDXPD944965"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/01/2007",
        "dateOfIncident": "02/25/2007",
        "fire": false,
        "manufacturer": "DAIMLERCHRYSLER MANUFACTURING INTL",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10183877,
        "products": [
            {
                "manufacturer": "DAIMLERCHRYSLER MANUFACTURING INTL",
                "productMake": "SPRINTER",
                "productModel": "3500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "(1) WITHOUT WARNING SUDDEN LOSS OF POWER. THIS HAS HAPPENED TWICE. HAD TO DRIVE A TOTAL OF OVER 200 MILES ON REDUCED POWER TO GET HOME.  (2) 2006 DODGE SPRINTER CHASSIS MOTORHOME WITH MERCEDES BENZ 2.7L 5-CYL TURBO DIESEL ENGINE, TURBO RESONATOR SPLIT AT SEAM, CAUSING TURBO SHUTDOWN, AND MAXIMUM SPEED OF 30-40 MPH AND NO POWER ON ANY HILLS. FAILURE ON A HILL OR FREEWAY COULD CAUSE A MAJOR ACCIDENT!  (3) DEALER HAS REPLACED RESONATOR TWICE AT NO CHARGE. WE'RE SEEKING A METAL REPLACEMENT PART THAT WON'T VOID THE WARRANTY.",
        "vin": "WDXPD944355"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/30/2006",
        "dateOfIncident": "12/15/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10177383,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "SPRINTER",
                "productModel": "3500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TURBO RESONATOR FAILURE WHICH IMMEDIATELY REDUCES POWER AND SPEED MAKING IT IMPOSSIBLE TO CLIMB AN EXIT RAMP TO LEAVE THE HIGHWAY.  *NM",
        "vin": "WD2PD744X55"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/24/2006",
        "dateOfIncident": "11/29/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10176892,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "SPRINTER",
                "productModel": "3500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING A 2006 ITASCA NAVION CLASS C RV WITH A DODGE-SPRINTER CHASSIS (BUILT ON JULY 2005) AND CRUISING AT 65 MPH, WHEN GOING UP A SLIGHT INCLINE, THE SPEED DROPPED DRASTICALLY TO 50 MPH, UNRESPONSIVE TO FURTHER ACCELERATOR PRESSURE. A REDUCED POWER MODE SUBSEQUENTLY ENSUED AND THE CHECK ENGINE LIGHT CAME ON. IT WAS A POTENTIALLY HAZARDOUS SITUATION BECAUSE OF THE VEHICLES FOLLOWING BEHIND AND THE REDUCTION IN POWER MADE IT MORE DIFFICULT TO EXECUTE MANEUVERS IN ACCORDANCE WITH THE FLOW OF TRAFFIC.  THE VEHICLE WAS TOWED TO A DEALERSHIP WHERE A LEAKING TURBO RESONATOR WAS FOUND CAUSING THE PROBLEM THE PART WAS REPLACED UNDER WARRANTY AND NORMAL FUNCTION WAS RESTORED.  *NM",
        "vin": "WDXPD944855"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/12/2006",
        "dateOfIncident": "12/08/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10175968,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "SPRINTER",
                "productModel": "3500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "RE:  2006 CHRYSLER PACIFICA   ON FRIDAY, DECEMBER 8, 2006, MY 2006 CHRYSLER PACIFICA STALLED ON RT. 78 E., BETWEEN EXISTS 17 AND 18 OF THAT ROAD (THE FLEMINGTON/ANNANDALE, NJ EXISTS).  AT THAT TIME, WHEN I  ACCELERATED THE GAS PEDDLE, THE VEHICLE MOVED SLOWER AND SLOWER, UNTIL IT CAME TO A COMPLETE STOP. THERE WERE NO SIGNS OR WARNING LIGHTS OF ANY ENGINE OR OTHER TYPE OF FAILURE.  I THEN NOTICED THAT THE VEHICLE HAD SHIFTED GEARS ON ITS OWN.  I IMMEDIATELY SHIFTED THE GEAR BACK TO DRIVE, BUT THE VEHICLE WAS STILL MOVING VERY SLOWLY.  BEING ON RT. 78, I WAS SURROUNDED BY TRAFFIC GOING 70-80 MILES PER HOUR, WITH MERGING TRAFFIC TO MY RIGHT. THERE WERE SEVERAL CARS AND TRUCKS DRIVING AROUND ME WHO MISSED HITTING ME BY ONLY INCHES.   WHEN I CONTACTED MY DEALER (BROWN-DAUB) TO ADVISE THEM OF THIS INCIDENT, I RECEIVED VERY RUDE TREATMENT.  I WOULD LIKE TO POINT OUT THAT AT NO TIME WAS I EVER ADVISED OF A CURRENT RECALL FOR THE EXACT PROBLEM THAT I DESCRIBED TO BROWN-DAUB. THIS IS NOT ACCEPTABLE, AND I BELIEVE THAT FAILURE TO PROVIDE NOTICE OF A MAJOR DEFECT IN A VEHICLE SHOULD RESULT IN PAYMENT OF BOTH ACTUAL AND PUNITIVE DAMAGES TO THE CONSUMER.   AFTER DOING SOME RESEARCH, I FOUND THAT THE NHTSA IS INVESTIGATING THIS EXACT FAILURE IN 2005-2006 CHRYSLER PACIFICAS. THE PROBLEM PERTAINS TO THE \"FUEL PUMP MODULE AND/OR THE POWERTRAIN CONTROL MODULE SOFTWARE,\" WHICH MAY CAUSE THE ENGINE TO STALL.    AT THIS TIME, I AM STILL IN THE PROCESS OF RESOLVING THIS MATTER WITH BROWN-DAUB.  I AM FILING THIS REPORT IN THE HOPES THAT IT MAY HELP OTHERS.    WHEN READING THIS REPORT, PLEASE REMEMBER TO NOTE THAT, ALTHOUGH I WAS SPARED ON DECEMBER 8, 2006, THAT DAY, THERE COULD HAVE BEEN SEVERAL DEATHS, INJURIES, AND UNNECESSARY PAIN AND SUFFERING TO ALL THE FAMILIES OF THOSE AFFECTED.  I BELIEVE THAT A MORE THOROUGH INSPECTION OF NEW/CERTIFIED VEHICLES SHOULD BE REQUIRED BY THE GOVERNMENT, PRIOR TO ANY SALE.  PLEASE, LET'S THINK IN TERMS OF BEING PROACTIVE.  *NM",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/14/2006",
        "dateOfIncident": "09/29/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10173493,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "SPRINTER",
                "productModel": "3500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2006 DODGE SPRINTER MOTOR HOME AND WITH ONLY 2,000 MILES THE ENGINE LOST POWER WHILE TRAVELING ON THE INTERSTATE.  LUCKILY TRAFFIC WAS LIGHT AND I WAS ABLE TO HAVE ENOUGH POWER TO GET OFF AT THE CLOSEST EXIT AND CALLED THE DAIMLER/CHRYSLER HOTLINE OBTAINED THE NAME OF THE NEAREST  REPAIR DEALER.  I EXPLAINED MY SITUATION TO THE REPAIR SHOP AND THEY NEW EXACTLY WHAT THE PROBLEM WAS AND HAD THE PART AVAILABLE.  THE PROBLEM WAS A CRACKED TURBO RESONATOR WHICH IS MADE OUT OF PLASTIC AND REPLACED WITH A NEW UPDATED VERSION. THE REPAIRMAN SAID THIS IS A COMMON PROBLEM WITH THIS VEHICLE AND DAIMLER/CHRYSLER IS AWARE OF IT AND THAT THEY ARE NOW REPLACING THE PART WITH A MORE RELIABLE ONE.  MY COMPLAINT IS IF I WERE IN HEAVY TRAFFIC THE LOSS OF POWER COULD HAVE CAUSED ME TO HIT SOMEONE OR I COULD HAVE BEEN HIT.  SPRINTERS ARE USED IN MANY APPLICATIONS INCLUDING AMBULANCES, AND AS OF THIS DATE DODGE HAS NOT ISSUED A WARNING OR RECALL ON THEIR WEB SITE. *JB",
        "vin": "WDXPD944865"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/16/2006",
        "dateOfIncident": "07/29/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10165601,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "SPRINTER",
                "productModel": "3500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED AN ITASCA NAVION WHICH IS BUILT ON A 2006 DODGE SPRINTER 3500 CHASSIS.  THE MERCEDES ENGINE, I FOUND OUT AFTER OURS FAILED, HAS A HISTORY OF PROBLEMS WITH THE TURBO RESONATOR OPENING UP, RESULTING IN THE ENGINE GOING INTO A \"LIMP HOME MODE\" WHERE THE VEHICLE OPERATES AT 200 RPM OR LESS.    I WAS TRAVELING SOUTHBOUNG ON THE 101 HIGHWAY SOUTH OF SANTA BARBARA WHICH IS A HILLY 2 LANE HIGHWAY.  DUE TO THE RPM RESTRICTION ON THE ENGINE, THE VEHICLE WOULD DRAMATICALLY LOSE POWER AND SPEED ON THE SLIGHTEST INCLINE.  IT WAS ON ONE SUCH INCLINE THAT I FOUND MYSELF WITH A LARGE 18 WHEELER BEARING DOWN ON ME IN THE #2 LANE.  DUE TO THE SMALL INCLINE WE HAD JUST ENCOUNTERED, MY SPEED DROPPED TO BELOW 20 MPH.  THERE WAS HEAVY TRAFFIC IN THE #1 LANE, SO NEITHER THE 18 WHEELER NOR I COULD JUMP INTO THE #1 LANE TO AVOID AN ACCIDENT.  RATHER THAN FORCING THE 18 WHEELER TO LOCK UP TO SLOW DOWN, I DOVE INTO A VERY NARROW SHOULDER WITH WHAT APPEARED TO BE A STEEP DROPOFF.      HAD THE SHOULD NOT BEEN WIDE ENOUGH, I DO NOT BELIEVE THAT IT WAS POSSIBLE TO AVOID INJURY OR DEATH ON THIS INCIDENT.    GREATLY SHAKEN, I WAS FORCED TO TAKE SIDE STREETS ALL THE WAY BACK TO MY HOME IN ALTADENA, CA.  I HAD MY VEHICLE TAKEN TO A DODGE DEALERSHIP FOR REPAIR, WHERE THE MECHANIC KNEW EXACTLY WHAT THE PROBLEM WAS WITHOUT LOOKING AT IT.  THE PART WAS REPLACED WITH THE SAME NON-UPGRADED PART.  FROM THE RESEARCH I HAVE DONE SINCE THIS INCIDENT, I HAVE FOUND THAT THIS PROBLEM HAS BEEN WELL KNOWN FOR SEVERAL MONTHS, AND I HAVE HEARD OF FAILURES ON THE REPLACEMENT UNITS AS WELL.",
        "vin": "WDXPD944565"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/26/2006",
        "dateOfIncident": "07/19/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10163549,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "SPRINTER",
                "productModel": "3500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "PART FAILED CAUSING INABILITY TO OPERATE AT SAFE SPEEDS ON HIGHWAY. PART IS CALLED \"TURBO RESONATOR\" AND HAS A REPUTATION AS A WEAK PART. SEVERAL OWNERS OF SAME TYPE OF VEHICLE HAVE HAD FAILURE. I SAVED THE DEFECTIVE PART.  *NM",
        "vin": "WDXPD944665"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/05/2006",
        "dateOfIncident": "06/17/2006",
        "fire": false,
        "manufacturer": "DAIMLERCHRYSLER MANUFACTURING INTL",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10161490,
        "products": [
            {
                "manufacturer": "DAIMLERCHRYSLER MANUFACTURING INTL",
                "productMake": "SPRINTER",
                "productModel": "3500",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "SECOND TURBO FAILURE LEADING TO LONG DRIVE IN LIMP HOME MODE.  GPS MOVING AVERAGE SPEED OF 47 MPH.  LOW SPEED OF 28 MPH.  DISTANCE TO GET HOME THIS TIME  600+ MILES   TOOK DEALER 15 DAYS TO REPAIR.  FIRST REPAIR TOOK 10 DAYS. *JB",
        "vin": "WDXPD944055"
    }
]