[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/02/2019",
        "dateOfIncident": "04/01/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11193386,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SECONDARY AIR INJECTION PUMP FAILED TO TURN OFF AND NEARLY CAUGHT FIRE. SUBARU HAS RECALLED THIS PART AND THE RELATED RELAY SWITCH FOR 2008-14 IMPREZAS, BUT THIS PROBLEM ALSO EXISTS WITH 2006 IMPREZAS. MY MECHANIC SAYS THIS IS VERY COMMON FAILURE POINT FOR MY MODEL.",
        "vin": "JF1GG79606G"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/12/2015",
        "dateOfIncident": "07/23/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10748107,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS BEING DRIVEN ON A PUBLIC ROAD AT 30 MPH. ENGINE OIL PRESSURE LIGHT CAME ON SO VEHICLE WAS PARKED IN A BUSINESS PARKING LOT TO CHECK OIL LEVEL. OIL LEVEL WAS FULL. OWNER CHECKED ON INTERNET FOR POSSIBLE CAUSES OF THIS SYMPTOM AND DISCOVERED NUMEROUS REFERENCES TO A BROKEN OIL PICK UP TUBE. VEHICLE WAS TOWED TO AN INDEPENDENT SHOP FOR EVALUATION. SHOP INFORMED OWNER UPON REMOVAL OF OIL PAN THAT ALUMINUM SHAVINGS WERE DISCOVERED IN THE OIL AND THAT INDEED THE OIL PICK UP TUBE WAS BROKEN. SHOP INFORMED OWNER THAT THIS IS A COMMON PROBLEM SEEN ON CERTAIN MODEL YEARS OF SUBARU VEHICLES. FAILURE OF THIS PART CAUSES OIL STARVATION AND CATASTROPHIC MOTOR DAMAGE REQUIRING REBUILD OR REPLACEMENT OF SHORT BLOCK AND OTHER RELATED INSPECTIONS AND CLEANINGS OF PARTS THROUGH WHICH OIL FLOWS. PART IN QUESTION IS NOT A NORMAL WEAR AND TEAR PART. AFTERMARKET MANUFACTURERS SUCH AS KILLERBEE HAVE ENGINEERED A BETTER PRODUCT AND CONDUCTED INDEPENDENT INVESTIGATION OF ISSUE WITH OEM PART AND EXPLAIN THAT THE BRAZING PROCESS USED TO JOIN THE BRACKET AND THE TUBE IN FACT WEAKEN THE TUBE. IN ADDITION, THE FLUX USED DURING BRAZING IS NOT PROPERLY CLEANED ON SOME PARTS WHICH LEADS THE MANUFACTURER TO BELIEVE THIS IS A QUALITY ISSUE THAT SUBARU HAS OVERLOOKED. OWNER CONTACT SUBARU REQUESTING ASSISTANCE WITH REPAIR COSTS AND WAS DENIED WITH THE EXPLANATION THAT VEHICLE IS OUT OF WARRANTY. COST TO REPLACE SHORT BLOCK WITH LABOR IS $6500. OWNER HAS EXPERIENCE AS AN AUTOMOTIVE TECHNICIAN AND UNDERSTANDS THE DIFFERENCE BETWEEN FAILURE DUE TO OWNER NEGLIGENCE AND FAILURE DUE TO A NON WEAR AND TEAR PART THAT IS NOT IN SUBARU REGULAR SERVICE PROCEDURES. FAILURE OF PART AT A HIGHER RATE OF SPEED CAN CAUSE SEVERE ENGINE DAMAGE AND A POSSIBLE UNSAFE CONDITION IN WHICH THE MOTOR CAN LOCK UP AND CAUSE VEHICLE TO COME TO A SUDDEN STOP. NUMEROUS OWNERS HAVE REPORTED SIMILAR ISSUES.",
        "vin": "JF1GD70606L"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/15/2015",
        "dateOfIncident": "01/06/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10725267,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "RAW FUEL SMELL OUTSIDE AND INSIDE THE  VEHICLE DURING AND AFTER COLD STARTS",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/07/2015",
        "dateOfIncident": "01/05/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10681908,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON START UP OF MY 2006 SUBARU WRX, THERE IS VISUAL EVIDENCE OF FUEL LEAKAGE UNDER THE INTAKE MANIFOLD ON THE PASSENGER SIDE OF ENGINE. THIS ONLY HAPPENS DURING TIMES OF COLD WEATHER. YOU CANNOT SEE THE LEAK AS IT IS UNDERNEATH COMPONENTS HOWEVER, YOU CAN SMELL RAW FUEL AND SEE WHERE IT PUDDLES UP AFTER A FEW MOMENTS OF ENGINE OPERATION. THIS PUDDLE ACCUMULATES ON TOP OF THE ENGINE BLOCK, DIRECTLY IN FRONT OF THE TURBOCHARGER AND EXHAUST SYSTEM. THIS IS CAUSE OF MAJOR CONCERN FOR THE SAFETY OF MYSELF, MY FAMILY, PASSENGERS IN MY VEHICLE AND OTHER MOTORIST ON THE ROAD. SOA, SUBARU OF AMERICA, HAS ISSUED RECALLS FOR PREVIOUS MODEL YEARS BUT SHOULD INVESTIGATE TO POSSIBILITY OF EXTENDING THE RECALL TO INCLUDE MORE CURRENT MODEL YEARS. I HAVE CONTACTED SOA WITH MY PROBLEM TO NO AVAIL. *JS",
        "vin": "JF1GG79636G"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/07/2014",
        "dateOfIncident": "01/07/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10558747,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTED MY 2006 SUBARU WRX THIS MORNING IN 5 DEGREE TEMP, AND THERE IS AN EXTREMELY STRONG SMELL OF GASOLINE IN THE CABIN.  I HAVE A SHORT DRIVE TO WORK, BUT THE SMELL STAYED STRONG FOR A GOOD 10MINS.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/07/2012",
        "dateOfIncident": "03/05/2012",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10460895,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 3500 RPM SHIFT FROM 2ND TO 3RD GEAR AT LOW LEVEL ACCELERATION THE 3RD GEAR TEETH SHATTERED AND CAUSED DAMAGE TO THE GEARSET. 3RD GEAR NEEDED TOTAL REPLACEMENT AND METAL DEBRIS FLOATING IN THE CASING UNTIL CAR COULD BE STOPPED. 2000 MILES LATER AFTER SUBARU DEALERSHIP REPAIR AND ALL NEW PARTS FROM THE FACTORY THE SAME SCENARIO OCCURS AGAIN 3RD GEAR CHIPPED ALL TEETH AND CAR NEEDED TO BE STOPPED IMMEDIATELY. BOTH INCIDENTS LEFT THE CAR WITH LARGE AMOUNTS OF METAL DEBRIS WHICH NOT ONLY CAUSE ADDITIONAL DAMAGE TO OTHER PARTS BUT ALSO HAVE THE ABILITY TO CAUSE THE CAR TO LOCK UP AND MALFUNCTION POSING A SERIOUS THREAT TO THE DRIVER AND ANY PASSENGERS. THIS METAL DEBRIS WAS OBSERVED IN BOTH TRANSMISSION REPAIRS. SUBARU SIGHTED \"OPERATOR ABUSE\" AS THE CAUSE OF THE FAILURE. HOWEVER A SERIOUS DESIGN DEFECT RELATED TO A SIGNIFICANT DEFLECTION OF THE INPUT SHAFT MOST LIKELY IS THE REAL CAUSE OF THE TRANSMISSION FAILURE.    *JS",
        "vin": "JF1GD79606G"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/01/2012",
        "dateOfIncident": "01/31/2012",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10446143,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "CODE P1410  SECONDARY AIR INJECTION SYSTEM SWITCHING VALVE STUCK OPEN.     THIS IS A COMMON ERROR MANY 2006 AND UP SUBARU IMPREZA WRX OWNERS ARE HAVING. THE EMISSIONS SYSTEM IS PRONE TO FAIL DUE TO CARBON BUILDUP OR MOISTURE AND RUST CONTAMINATING VALVES, LEADING TO REPAIRS COSTING $700 TO $1500. THIS FAILURE IS COMMON EVEN WITH LOW MILEAGE.    NOTE THESE CODES ARE ALSO ASSOCIATED WITH THIS FAILURE:    06/07 WRX:    P0410   P0411   P0413   P0414   P0416   P0417   P0418   P2431   P2432   P2433   P2440   P2441   P2442   P2443   P2444     07 STI:    P0410   P0411   P0413   P0414   P0418   P2431   P2432   P2433   P2441   P2444   *TR",
        "vin": "JF1GD79656G"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/12/2011",
        "dateOfIncident": "03/12/2011",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10389926,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "STUD BOLT CONNECTING STRUT ARM FROM REAR HATCH TO CAR FRAME FAILED.  THIS CAUSED THE STRUT ARM TO BECOME DISCONNECTED WITH THE REAR HATCH AND THE REAR HATCH DOOR NO LONG IS ABLE TO REMAIN AJAR WITHOUT MANUAL SUPPORT.  DOOR WILL CLOSE ON USER WITHOUT NOTICE. *TR",
        "vin": "JF1GG79666G"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/01/2009",
        "dateOfIncident": "11/01/2009",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10290490,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "1. OIL LIGHT FLICKERS ON AND THEN STAYS ON AT IDLE OR UNDER LOW REV'S  2. THE FAILURE IS THE OIL PICK UP LINE RESULTING IN A CRACKED LINE AND DAMAGED ENGINE.  3. USUALLY DAMAGE IS SUFFICIENT TO WARRANT A REPLACED LONG BLOCK AND TURBO FROM MANUFACTURER. HOWEVER NO SUFFICIENT REPLACEMENT IS MADE ABOUT PART PRONE TO FAILURE EVEN WITH A NEW ENGINE. *TR",
        "vin": "JF1GD70676L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/11/2008",
        "dateOfIncident": "09/01/2008",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10241810,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "OIL PICK UP TUBE CRACKED. *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/26/2008",
        "dateOfIncident": "06/01/2008",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10232359,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "BROKEN OIL PICKUP TUBE,  DRIVING HOME FROM WORK THE PICKUP TUBE BROKE CAUSING THE OIL IN THE OILPAN TO NOT CIRCULATE THROUGH THE SYSTEM.  THIS DESTROYED ALL INTERNAL BEARINGS AND LIKELY FATIGUED MANY OTHER ENGINE INTERNALS.  THE DEALERSHIP REPLACED ALL BEARINGS UNDER WARRANTY BUT DID NOT REPLACE ANY OTHER ENGINE BLOCK COMPONENTS.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/06/2008",
        "dateOfIncident": "05/18/2006",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10230156,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I STARTED MY CAR ON SATURDAY MAY 18TH AND COULD NOT DRIVE IT. CLUTCH WAS BAD. I'VE HAD THE CAR 13 MONTHS, IT HAS 13K MILES ON IT AND THE DEALER TOLD ME IT WAS MY FAULT-DRIVER ERROR. THIS IS MY 4TH CAR WITH A MANUAL TRANSMISSION (IRONICALLY THE FIRST NEW CAR) AND I HAVE NEVER, EVER HAD A CLUTCH PROBLEM WITH ANY OF THE OTHERS-RANGING FROM AN OLDER SATURN TO AN M SERIES BMW.  ACCORDING TO SUBARU, THEY CAN'T/WON'T DO ANYTHING IF THE TECHNICIAN SAYS THE PROBLEM WAS CAUSED BY DRIVER ERROR. THEY SAID ALL I CAN DO IS ASK THE SERVICE MANAGER TO GIVE ME A \"GOODWILL\" DISCOUNT. I AM NOT HOLDING MY BREATH.  *TR",
        "vin": "JF1GD79606G"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/06/2008",
        "dateOfIncident": "03/05/2008",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10220248,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING DOWN A MAJOR HIGHWAY IN FIFTH GEAR MY CAR ENGINE BEGAN TO REV AND THE INSTRUMENT PANEL WAS AT 6,000RPMS. I ATTEMPTED TO SLOW THE CAR AND MAKE IT TO AN EXIT RAMP, BUT THE CLUTCH WOULD NOT DISENGAGE. I PULLED THE CAR OFF THE SIDE OF THE HIGHWAY AND IT STALLED OUT. I HAD THE CAR TOWED TO FAIRWAY SUBARU WHERE I WAS TOLD MANY DIFFERENT EXCUSES THAT WERE ALL \"DRIVER RELATED.\" I WAS TOLD THAT \"THE CLUTCH DISINTEGRATED UNDER EXTREME HEAT FROM REVVING THE ENGINE.\" THE CLUTCH WAS TAKEN APART AND THERE WERE NO \"HEAT SPOTS.\" I WAS THEN TOLD THAT I MUST HAVE SHIFTED GEARS TOO SLOWLY, AND SINCE THAT WAS ALSO DRIVER RELATED THE WARRANTY STILL WOULD NOT COVER THE REPAIRS. THIS IS A TRUE SAFETY ISSUE, CONSIDERING I WAS ON A MAJOR HIGHWAY AND HAD NO PROBLEMS OR WARNINGS PRIOR TO THE CLUTCH \"DISINTEGRATING.\"  ONCE THE ENGINE BEGAN REVVING, MY CAR LOST SPEED AND WOULD NOT DRIVE PROPERLY. I AVOIDED AN ACCIDENT THAT COULD HAVE BEEN FATAL.  *TR",
        "vin": "JF1GG796X6G"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/09/2006",
        "dateOfIncident": "12/08/2006",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10175659,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL SYSTEM LINES AND HOSES BECOME UNSTABLE, LEAKING FUEL AND FUEL ODORS ARE PRESENT IN CABIN OF VEHICLE. THE NATURE OF THIS COMPLAINT FOLLOWS  NHTSA RECALL CAMPAIGN NUMBER:  PE04002.    THAT REPORT FOUND THAT THE CONDITION MANIFESTED IN \"VERY COLD\" TEMPERATURES. HOWEVER, IT HAS STARTED IN 45-50 DEGREE F.   THE UNDERSIGNED REQUEST THAT THE INVESTIGATION BE REOPENED. FURTHER, THE PROBLEM DOES NOT RESOLVE ITSELF UPON ENGINE WARM UP. SMELL OF FUEL LINGERS IN AND AROUND THE VEHICLE EVEN WHILE PARKED IN GARAGE. NOTICEABLE LOSS IN RANGE OF CAR UPON FULL TANK OF GAS.  *NM",
        "vin": "JF1GD29652G"
    }
]