[
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/04/2020",
        "dateOfIncident": "02/04/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301994,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 TOYOTA MATRIX. CONSUMER WRITES IN REGARDS TO RUSTED RIGHT SIDE REAR STRUT. *LD *JS",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/07/2018",
        "dateOfIncident": "03/07/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11076675,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "HOW CAN I GET TOYOTA TO QUIT SENDING ME NOTICES.  I'M GETTING ABOUT 1 A WEEK NOW FOR A CAR THAT WAS DEMOLISHED AT A JUNKYARD IN JANUARY 2017.  I'VE PROVIDED THEM PROOF THAT THEY ARE SENDING TO ME BUT THEY WON'T STOP....PLEASE HELP OR FORWARD ME ON TO SOMEONE WHO CAN HELP.  THANKS!",
        "vin": "2T1KR32E76C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/05/2017",
        "dateOfIncident": "11/05/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11043603,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "YOUR WEBSITE WHERE I ENTER MY VIN RETURNS A \"REQUEST WAS INVALID\" MESSAGE. \"ONE OR MORE PARAMETERS WERE INVALID.\"   NOTHING IS EXPLAINED.  WHY DID THIS MESSAGE SHOW?",
        "vin": "VIN: 2T1KR3"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/30/2017",
        "dateOfIncident": "03/16/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11020675,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CLOCK STARTED GOING OUT. SOMETIMES IT WOULD BE ON AND OTHER TIMES IT WOULD GO OFF AND NOW IT TURNS ON AND OFF IN ITS OWN TIME FACTOR WHEN I AM DRIVNG AND THE CAR IS IN MOTION AND WHEN I AM STOPPED AT TRAFFIC LIGHTS..  I ASKED THE TOYOTA DEALER IF THEY COULD FIX MY CLOCK.  I HAD THEM DO A DIAGNOSTIC TEST ON THE CLOCK WHICH COST AROUND $110 APPROX.. THEY SAID THEY COULD FIX MY CLOCK FOR $416.31 AND THAT IS WAS CONNECTED TO MY AIR BAGS. MY TOYOTA DEALER SAID THEY REPLACED MY TAKATA AIRBAG ON THE FRONT PASSENGER SIDE ON 2-18-2016, AND TOLD ME THE OTHER AIRBAGS WERE NOT TAKATA.  BUT I WONDERED IF MY CLOCK DOESN'T WORK AND IT'S TIED INTO MY AIRBAGS, IF I GET INTO A WRECK WILL MY AIRBAGS DEPLOY OR NOT DEPLOY BECASUSE I HAVEN'T FIXED MY CLOCK?",
        "vin": "2T1LR32E76C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/06/2016",
        "dateOfIncident": "10/03/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10914713,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "LETTER FROM CONGRESSWOMAN CAPPS ON BEHALF OF CONSTITUENT RE WHY EFFORTS ARE FOCUSED ON REPLACING THE PASSENGER SIDE AIRBAGS FIRST AND NOT THE DRIVER SIDE AIRBAGS WHICH SEEMS MORE RELEVANT.  *SMD",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/27/2016",
        "dateOfIncident": "07/27/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10888887,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2006 TOYOTA MATRIX. THE CONTACT RECEIVED A RECALL NOTIFICATION IN MAY OF 2016 FOR NHTSA CAMPAIGN NUMBER: 15V285000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "2T1LR30E46C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/07/2016",
        "dateOfIncident": "07/07/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10883217,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST ARRANGED A 3RD APPOINTMENT TO HAVE REPAIRS ON MY TOYOTA MATRIX FOR MY SAFETY RECALL.  I HAVE BEEN TOLD THAT THERE IS NO PART TO ACCOMPLISH THE REPAIRS TWICE NOW.  MY NEXT APPT IS SET FOR THE END OF AUGUST AND I AM HOPING THAT THE PART WILL BE AVAILABLE!  IT IS VERY DIFFICULT TO COMPLY WITH NOT HAVING A PASSENGER RIDE WITH ME.  PLEASE ORDER AND DELIVER A SUITABLE PART TO THE OWINGS MILLS TOYOTA SERVICE CENTER.",
        "vin": "2T1KR32E16C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/13/2016",
        "dateOfIncident": "06/13/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10873919,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "INITIAL RECALL WAS ISSUED FOR CAR NEARLY 1 YEAR AGO TODAY.  REMEDY WAS NOT AVAILABLE AT THE TIME.  RECEIVED A NOTICE THAT THE PART WAS AVAILABLE AND REPLACEMENT COULD BE SCHEDULED APPROXIMATELY 2 MONTHS AGO BUT WAS INFORMED THE PART HAD TO BE ORDERED BY THE DEALER.  FOLLOW UP CALL TODAY INDICATES THE PART IS STILL BACK ORDERED AND I AM UNABLE TO HAVE THE REPAIR DONE.  THIS IS UNACCEPTABLE WHEN THE RECALL NOTICE INDICATES THAT A PASSENGER IN THE CAR COULD BE SERIOUSLY INJURED OR KILLED IN THE EVENT OF AN ACCIDENT.  TOYOTA HAS NOT REMEDIED THE PROBLEM IN A YEAR, AND IS NOT MAKING SATISFACTORY PROGRESS IN OBTAINING THE PART OR SCHEDULING THE REPAIR.",
        "vin": "2T1KR32E16C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/03/2016",
        "dateOfIncident": "05/01/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10862812,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "\"TAKATA RECALL\"  RECEIVED INTERIM NOTICE APPROX MAY 2015  RECEIVED REMIDY NOTICE MAY 2016  PURCHASED CAR NEW AND HAVE CONTACTED TOYOTA OF INVERGROVE HEIGHTS MN. SEVERAL TIMES ABOUT RECALL REPAIR, ONLY TO BE TOLD NO PARTS AVAILABLE!  I AM AFRAID OF LIABILITY AND OR DEATH FROM DEPLOYED AIR BAGS TO BOTH DRIVER & PASSENGER.  ALSO PAID OPTION FOR ADDITIONAL SIDE AIR BAG PACKAGE.  WHEN CAN WE EXPECT RESOLVE AND WHY IS MY LIFE AND PASSENGERS OF LESS VALUE THAN THOSE IN PRIORITY STATES?    WHY ARE NO FINES TO TAKATA OR THE VEHICLE MANUFACTURERS BEING INITIATED?  WE OWNERS FEEL AS LIFE AND LIMB & VEHICLE VALUATION ARE AT RISK.    IT SEEMS VOLKSWAGON DIESEL OWNERS ARE RECEIVING PREFERENTIAL ATTENTION AND POSSIBLE BUY BACKS, WHILE NOT AS RISK OF THE SAME EXPOSURE.    TAKATA INDUSTRIES MAY GO BANKRUPT OR TOTALLY FAIL WITH NO RESOLVE FROM THEM OR AUTO MANUFACTURERS.  LEAVING THE VEHICLE OWNERS OPEN TO DEATH, INJURY,LAWSUITS AND FINANCIAL LOSS OF VEHICLE VALUE.    PLEASE HELP!        PLEASE HELP!",
        "vin": "2T1KR30E66C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/19/2016",
        "dateOfIncident": "04/19/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10860358,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  I FINALLY RECEIVED MY INSTRUCTIONS FOR REPLACING THE DANGEROUS PASSENGER AIRBAG ON MY TOYOTA MATRIX AFTER CLOSE TO A YEAR OF WAITING ON THEIR FOLLOW-UP. WHEN I REACHED OUT TO MY LOCAL TOYOTA DEALERSHIP, MCGEORGE TOYOTA IN RICHMOND VA, I WAS TOLD THAT THEY HAD TO ORDER THE PART AND IT WOULD BE 3 MONTHS BEFORE IT COULD BE FIXED. I SUPPOSED FREE REPAIRS ARE MUCH MORE DIFFICULT TO SCHEDULE.",
        "vin": "2T1KR32EX6C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/07/2016",
        "dateOfIncident": "06/16/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10853973,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST HEARD ANOTHER PASSENGER WAS KILLED BY AN AIR BAG IN A TOYOTA PRODUCT. I WAS TOLD OVER 6 MONTHS AGO BY TOYOTA I WOULD BE CONTACTED FOR A REPLACEMENT AIRBAG. I FINALLY GOT A REMEDY NOTICE FROM TOYOTA TO CONTACT MY DEALER AND SEE ABOUT GETTING IT FIXED. MY DEALER SAID THEY ONLY CAN DO 7 AIR BAG REPLACEMENTS A WEEK AND IT WOULD BE 8-9 MONTHS BEFORE THEY COULD GET TO MY CAR. I CONTACTED TOYOTA US HEADQUARTERS AND THEY SAID IT SHOULD ONLY BE 2-3 WEEKS. (REF # 1604011854) . I CONTACTED THE DEALER AGAIN WHO REITERATED IT WOULD BE 8-9 MONTHS. THIS DELAY SEEMS LIKE A STRATEGY ON TOYOTA'S PART AND NOT A SHORTAGE OF PARTS. WHO IS NEGLECTING THEIR DUTY ON THIS POTENTIALLY FATAL DEFECT. TOYOTA, THE DEALER, OR THE NHTSA. THIS IS UNACCEPTABLE. PEOPLE LOSING THEIR LIVES BECAUSE OF A LACK OF GOVERNMENT ACTION. IF THEY CAN'T FIX THE AIRBAG, THEY SHOULD PROVIDE OWNERS WITH CARS WITHOUT THE DEFECT. DO YOUR JOB.  I AM CONTACTING MY CONGRESSMAN AND SENATORS ABOUT THIS.",
        "vin": "2T1KR32E36C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/04/2016",
        "dateOfIncident": "04/04/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10853317,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER RECEIVING THE NOTICE FROM TOYOTA, I SCHEDULED AN APPOINTMENT AND TOOK MY CAR IN TO HAVE THE RECALL FIXED - TAKING A DAY OFF OF WORK TO DO SO.  I THEN TOOK A SHUTTLE RIDE HOME AND AFTER SEVEN HOURS OF WAITING I CALLED ASKING ABOUT THE STATUS OF MY CAR.  AFTER ANOTHER SHUTTLE RIDE TO THE DEALER I FOUND OUT THAT THEY ONLY DID THE INSPECTION AND DID NOT FIX THE AIR BAG.  THEY SAID THEY WOULD CALL ME WHEN THE PART WAS IN TO RESCHEDULE THE ACTUAL REPAIR.  ALL I GOT WAS \"SORRY FOR THE INCONVENIENCE.\"  QUESTIONS:  WHY DOES DOES TOYOTA SEND OUT A RECALL NOTICE WITHOUT ENSURING THAT THE DEALERSHIPS HAVE ALL OF THE NECESSARY PARTS TO HANDLE ALL OF THE RECALL REPAIRS?  WHY WOULDN'T THE DEALER INFORM THE CUSTOMER ABOUT THE PARTS SITUATION BEFORE THEY BRING THEIR CAR IN TO BE FIXED?  HOW WILL I BE COMPENSATED FOR THE SEVEN HOURS OF WAGES THAT I GAVE UP TO GET MY CAR FIXED?  HOW MANY HOURS WILL I LOSE FOR THE SECOND REPAIR?  HOW MANY OTHER CUSTOMERS ARE HAVING A SIMILAR EXPERIENCE????",
        "vin": "2T1LR32E16C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/22/2016",
        "dateOfIncident": "08/10/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10850954,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2006 TOYOTA MATRIX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V285000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT. ...UPDATED 04/12/16 *BF",
        "vin": "2T1KR30E56C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/21/2016",
        "dateOfIncident": "03/16/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10850802,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2006 TOYOTA MATRIX. THE CONTACT RECEIVED A NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V285000 (AIR BAGS); HOWEVER, THE PARTS FOR THE RECALL REPAIR WERE NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "2T1KR32E76C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/01/2016",
        "dateOfIncident": "01/17/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10823600,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 TOYOTA MATRIX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V285000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "2T1LR32E86C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/22/2016",
        "dateOfIncident": "08/15/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10821732,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. I RECEIVED A RECALL LETTER FROM THE MANUFACTURER IN AUGUST OF 2015. IT IS NOW 1/22/16 AND THE PROBLEM HAS STILL NOT BEEN ADDRESSED. I CALLED TOYOTA CUSTOMER SERVICE ON 10/22/15 AND THEY INFORMED ME THAT THE REPAIRS WERE CURRENTLY IN PHASE 2 AND THAT CALIFORNIA WAS PHASE 4. SINCE THEN, I HAVE HAD TO RENT A CAR ON ONE OCCASION WHEN I NEEDED TO ACCOMMODATE 4 PASSENGERS AND UNLESS THIS GETS FIXED BY MID-MARCH, I WILL LIKELY NEED TO RENT A CAR FOR 4 DAYS FOR A FAMILY TRIP. THIS IS NOW COSTING ME MONEY WHICH I SHOULD NOT HAVE TO PAY IF MY CAR WAS SERVICED IN A REASONABLE TIME-FRAME. IT'S NOW BEEN 5 MONTHS SINCE RECEIVING THE RECALL NOTICE AND I HAVE YET TO RECEIVE A LETTER AS TO WHEN I CAN GET MY CAR FIXED. FRANKLY, THIS IS VERY UNACCEPTABLE AND I FEEL THAT IF TOYOTA CAN'T MAKE THIS RIGHT, THEN THEY SHOULD PAY FOR THE RENTAL CAR I WILL NEED IN MARCH.",
        "vin": "2T1KR32E86C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/07/2016",
        "dateOfIncident": "07/22/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10818628,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2006 TOYOTA MATRIX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V286000 (AIR BAGS); HOWEVER, THE PART NEEDED TO PERFORM THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.   UPDATED 04/07/16*LJ  UPDATED 04/11/16.*JB",
        "vin": "2T1LR32E76C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/17/2015",
        "dateOfIncident": "06/16/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10810978,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2006 TOYOTA MATRIX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V285000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2T1LR32EX6C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/16/2015",
        "dateOfIncident": "06/19/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10810792,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2006 TOYOTA MATRIX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V285000 (AIR BAGS). THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.    UPDATED 04/04/16*LJ  UPDATED 12/13/2017*JS",
        "vin": "2T1KR32E16C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/10/2015",
        "dateOfIncident": "05/15/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10809430,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2006 TOYOTA MATRIX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V285000 (AIR BAGS); HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2T1LR32E16C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/09/2015",
        "dateOfIncident": "12/08/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10809207,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2006 TOYOTA MATRIX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V285000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2T1LR30E26C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/03/2015",
        "dateOfIncident": "09/04/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10808255,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2006 TOYOTA MATRIX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V285000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2T1KR32E46C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/30/2015",
        "dateOfIncident": "11/30/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10807409,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2006 TOYOTA MATRIX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V285000 (AIR BAGS); HOWEVER, THE PART NEEDED TO REPAIR THE VEHICLE WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2T1KR32E66C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/25/2015",
        "dateOfIncident": "11/25/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10806817,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 TOYOTA MATRIX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V285000 (AIR BAGS) HOWEVER THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "2T1KR32E96C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/20/2015",
        "dateOfIncident": "07/20/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10795062,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 TOYOTA MATRIX. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 15V285000 (AIR BAGS) AND STATED THAT THE PART NEEDED WAS UNAVAILABLE TO PERFORM THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2T1KR30E56C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/05/2015",
        "dateOfIncident": "08/03/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10788625,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 TOYOTA MATRIX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V285000 (AIR BAGS) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR.  THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.    UPDATED 1/20/16 LN *TR",
        "vin": "2T1LR32E36C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/05/2015",
        "dateOfIncident": "08/01/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10788693,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 TOYOTA MATRIX. THE CONTACT STATED THAT THE RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 15V285000 (AIR BAGS) WAS RECEIVED IN AUGUST OF 2015. AFTER CONTACTING THE MANUFACTURER ON MULTIPLE OCCASIONS, THE CONTACT WAS INFORMED THAT THE PARTS NEEDED TO REPAIR THE VEHICLE WERE STILL NOT AVAILABLE AND NO ESTIMATED TIME FOR RECEIVING THE PARTS COULD BE GIVEN. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2T1KR32E46C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/29/2015",
        "dateOfIncident": "08/31/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10787002,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 TOYOTA MATRIX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V285000 (AIR BAGS) HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/23/2015",
        "dateOfIncident": "05/15/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10785519,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 TOYOTA MATRIX. THE CONTACT RECEIVED NOTIFICATION OF NHSTA CAMPAIGN NUMBER: 15V285000 (AIR BAGS) HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.  UPDATE 01/15/16 MA  CONSUMER STATED AIR BAG STILL NOT FIXED AFTER 7 MONTHS. UPDATED 5/21/18*JB",
        "vin": "2T1LR30E96C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/23/2015",
        "dateOfIncident": "08/17/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10785666,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 TOYOTA MATRIX. THE CONTACT RECEIVED NOTIFICATION OF NHSTA CAMPAIGN NUMBER: 15V285000 (AIR BAGS) HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "2T1KR32E46C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/21/2015",
        "dateOfIncident": "06/16/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10785198,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 TOYOTA MATRIX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V285000 (AIR BAGS); HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "2T1KR32E86C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/20/2015",
        "dateOfIncident": "09/03/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10783794,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 TOYOTA MATRIX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V285000 (AIR BAGS) HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "2T1KR32E86C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/16/2015",
        "dateOfIncident": "10/16/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10782846,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 TOYOTA MATRIX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V285000 (AIR BAGS) HOWEVER, THE PART WAS UNAVAILABLE TO PERFORM THE REPAIR. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REMEDY. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.     UPDATED 1/15/16  *CN.. ...UPDATED 01/20/16 *BF  UPDATED 04/20/18*JB    *CN",
        "vin": "2T1KY32E16C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/01/2015",
        "dateOfIncident": "10/01/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10779083,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 TOYOTA MATRIX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 15V285000 (AIR BAGS); HOWEVER, THE PARTS NEEDED TO REPAIR THE VEHICLE WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "2T1KR32EX6C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/30/2015",
        "dateOfIncident": "09/01/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10778616,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 TOYOTA MATRIX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V285000 (AIR BAGS); HOWEVER, THE PART NEEDED TO REPAIR THE VEHICLE WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. UPDATED 11/12/15*LJ  UPDATED 1/4/2016*JS",
        "vin": "2T1KR32E06C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/29/2015",
        "dateOfIncident": "07/01/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10778388,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 TOYOTA MATRIX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V285000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "2T1KR32E36C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/28/2015",
        "dateOfIncident": "06/13/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10778086,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 TOYOTA MATRIX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V285000 (AIR BAGS) HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "2T1KR32E96C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/21/2015",
        "dateOfIncident": "06/16/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10766668,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 TOYOTA MATRIX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V285000 (AIR BAGS);  HOWEVER, THE PART TO DO THE REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME TO PROVIDE THE PART TO DO THE REPAIR. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "2T1KR32E06C"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/21/2015",
        "dateOfIncident": "07/23/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10766506,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 TOYOTA MATRIX. WHILE DRIVING AT 25 MPH, ANOTHER VEHICLE FAILED TO STOP FOR A STOP SIGN AND THE CONTACT CRASHED INTO THE VEHICLE. THE AIR BAGS DID NOT DEPLOY. THERE WAS A POLICE REPORT FILED. THE CONTACT SUSTAINED INJURIES TO THE HEAD AND A SPRAINED RIGHT ANKLE, WHICH REQUIRED MEDICAL ATTENTION. THE INJURIES FOR THE OTHER PERSON WERE UNKNOWN. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC WHERE THE FRONT SIDE OF THE VEHICLE AND TIRE ON THE FRONT DRIVER SIDE WERE REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 80,000.",
        "vin": "2T1KR32E76C"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/17/2015",
        "dateOfIncident": "05/13/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10764583,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 TOYOTA MATRIX. WHILE DRIVING AT APPROXIMATELY 30 MPH, THE THROTTLE HESITATED TO RESPOND. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS INFORMED THAT THERE WAS A RECALL RELATED TO THE FAILURE AND RECOMMENDED THE VEHICLE TO BE DIAGNOSED BY A DEALER. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 75,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/04/2015",
        "dateOfIncident": "08/14/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10761608,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 TOYOTA MATRIX. THE CONTACT RECEIVED A NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V285000 (AIR BAGS); HOWEVER, THE RECALL PART WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "2T1KR30E06C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/02/2015",
        "dateOfIncident": "08/25/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10761106,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 TOYOTA MATRIX. THE CONTACT STATED THAT THE AIR BAG WARNING LIGHT REMAINED ILLUMINATED AND WAS ASSOCIATED WITH THE DRIVER SIDE AIR BAG. THE PASSENGER SIDE AIR BAG WARNING LIGHT WOULD ALSO ILLUMINATE. THE DEALER STATED THAT THE PART WAS NOT AVAILABLE TO REPAIR THE VEHICLE ACCORDING TO NHTSA CAMPAIGN NUMBER: 15V285000 (AIR BAGS). THE DEALER DID NOT GIVE A SPECIFIC DATE FOR WHEN THE PART WOULD BECOME AVAILABLE. THE MANUFACTURER WAS NOTIFIED. THE FAILURE MILEAGE WAS UNKNOWN.    MA 10/25/15   UPDATED 12/09/15.*JB",
        "vin": "2T1KR30E66C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/27/2015",
        "dateOfIncident": "07/24/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10759755,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "RECEIVED RECALL NOTICE. PHONED LOCAL TOYOTA SERVICE DEALER AND WAS TOLD THE PART WAS ON NATIONAL BACKORDER. PUT ON A LIST FOR CALL BACK.  IN THE MEANTIME, I AM NOT SUPPOSED TO LET A PASSENGER RIDE IN THE FRONT SEAT!  ABSURD, I PURCHASED THE VEHICLE FOR DRIVING AND PASSENGERS.  I WANT TO REQUEST AN ANSWER ON WHAT RECOURSE I HAVE TO GET A VEHICLE THAT CAN TRANSPORT MY FAMILY SAFELY, WHILE WAITING.  WE HAVE BEEN IN AN ACCIDENT IN THE PAST -NOT THIS RECALL- BUT THE AIRBAG ON PASSENGER SIDE CAUSED MORE DAMAGE, AND COULD HAVE BEEN DEVISTATING DAMAGE TO OUR TEEN IN THE PASSENGER SEAT. CANNOT TAKE THIS CHANCE AGAIN, BUT HAVE TO USE MY CAR FOR TRANSPORTING MY FAMILY! THIS PARTICULAR SERVICE PHONE ANSWERER WAS VERY UNCONCERNED ABOUT THE DETAILS OF THIS RECALL.  I DO NOT WANT TO HAVE TO TAKE THIS FURTHER THAN HERE, BUT FEEL VERY CHEATED EACH TIME I HAVE TO FIND ALTERNATIVE VEHICLE FOR MY TEEN CHILDREN TO RIDE IN.  AND SPOUSE IS SUPPOSED TO LET ME CHAUFFEUR HIM, LET'S GET REAL!  THIS IS AN ISSUE!",
        "vin": "2T1KR32E66C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/20/2015",
        "dateOfIncident": "05/13/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10750087,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 TOYOTA MATRIX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V286000 (AIR BAGS) HOWEVER, THE PARTS NEEDED TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "2T1KR32E26C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/13/2015",
        "dateOfIncident": "05/18/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10748473,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 TOYOTA MATRIX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V286000 (AIR BAGS); HOWEVER, THE PART NEEDED TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "2T1KR32E36C"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/03/2015",
        "dateOfIncident": "07/13/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10745700,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 TOYOTA MATRIX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 15V286000 (AIR BAGS) AND 10V384000 (ELECTRICAL SYSTEM); HOWEVER, THE PARTS NEEDED TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIRS. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "2T1KR32E96C"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/01/2015",
        "dateOfIncident": "07/27/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10745547,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "BACKED OUT OF A PARKING SPACE AT A SHOPPING CENTER.  WENT ABOUT 50 YARDS AND THE ENGINE REVVED LIKE IT WAS GOING 100 MPH AND THEN JUMPED FORWARD.  SLAMMED ON THE BRAKES AND PUT THE CAR IN NEUTRAL AND IT WENT BACK TO NORMAL IDLING.",
        "vin": "2T1KR32E56C"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/26/2015",
        "dateOfIncident": "07/14/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10743562,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A USED 2006 TOYOTA MATRIX AS IS NO WARRANTY FROM A DEALER IN BOISE, IDAHO. THE DEALER TOLD ME, MY DAUGHTER AND HER FRIEND THAT ALTHOUGH THE CAR HAD 175,262 MILES ON IT, HE HAD REPLACED THE ENGINE WITH A 55,000 MILE ENGINE HE BOUGHT FROM FLORIDA. APPARENTLY THE OLD ENGINE HAD SEIZED UP WITH THE PREVIOUS OWNER. THE DEALER ASSURED ME THAT THE CAR WOULD LAST ME A LONG TIME. HOWEVER, AFTER ONLY SIX WEEKS OF DRIVING THE CAR THE ENGINE QUIT AND STRANDED ME IN TRAFFIC. I HAD THE CAR TOWED TO MY TRUSTWORTHY MECHANICS, WHO RAN THE DIAGNOSTIC TESTS ON THE CAR. I TOOK THEIR REPAIR ESTIMATE TO THE DEALER. HE TOWED THE CAR, WITH MY PERMISSION, TO HIS MECHANIC. I HAVE BEEN RESEARCHING RECALLS, AND FOUND THAT TOYOTA MATRIX CARS MANUFACTURED BETWEEN 2005-2008 HAVE BEEN RECALLED FOR ENGINE PROBLEMS. I DON'T KNOW IF MY CAR WAS EVER RECALLED, OR THE PROBLEMS FIXED. MY CAR HAS THE EXACT SAME ENGINE AS THE ONE IN THE RECALLS. NOW I'M CONCERNED THAT IF THE CAR DOES GET FIXED, IT MIGHT MALFUNCTION AGAIN WITH ME DRIVING IT, AND CAUSE AN ACCIDENT.THE DEALER WON'T PAY FOR THE REPAIRS AS IDAHO HAS NO USED CAR 'LEMON' LAW. I AM A SENIOR CITIZEN ON A FIXED INCOME. I CAN MAKE THE CAR PAYMENTS, BUT CERTAINLY CAN'T PAY TO HAVE THE CAR REPAIRED EVERY TIME IT BREAKS DOWN, PLUS I FEEL THERE IS A SAFETY ISSUE WHICH CONCERNS ME SINCE I LIVE ALONE AND HAVE NO ONE ELSE TO DEPEND ON FOR HELP.",
        "vin": "2T1L32E16C5"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/22/2015",
        "dateOfIncident": "07/17/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10735830,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 TOYOTA MATRIX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V286000 (AIR BAGS) HOWEVER, THE PART NEEDED TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "2T1KR32E06C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/22/2015",
        "dateOfIncident": "07/22/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10735880,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 TOYOTA MATRIX. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V286000 (AIR BAGS);  HOWEVER, THE PART NEEDED TO DO THE REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A VALID AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "2T1KR32E06C"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/13/2015",
        "dateOfIncident": "05/12/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10716280,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 TOYOTA MATRIX. WHILE DEPRESSING THE BRAKE PEDAL, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS ABLE TO RESTART AFTER SEVERAL ATTEMPTS. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE VEHICLE WAS NOT INCLUDED NHTSA CAMPAIGN NUMBER: 10V384000 (ENGINE AND ENGINE COOLING). THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 98,000.",
        "vin": "2T1LR32E26C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/09/2014",
        "dateOfIncident": "02/04/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10578474,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "PERIODICALLY THIS WINTER THE AIR BAG LIGHT WOULD REMAIN ILLUMINATED AFTER STARTING.  OFTEN IT WOULD GO AWAY IF YOU SIMPLY RESTARTED THE CAR.  I ATTRIBUTED IT TO COLD WEATHER, BUT IN LIGHT OF TOYOTA'S MOST RECENT RECALL (TORRANCE, CALIF., APRIL 9, 2014 ? TOYOTA MOTOR SALES, U.S.A., INC. TODAY ANNOUNCED THAT IT WILL CONDUCT A VOLUNTARY SAFETY RECALL INVOLVING APPROXIMATELY 1.3 MILLION VEHICLES, INCLUDING CERTAIN MODEL YEAR 2009-2010 COROLLA, 2009-2010 MATRIX, 2008-2010 HIGHLANDER, 2009-2010 TACOMA, 2006-2008 RAV4 AND 2006-2010 YARIS VEHICLES.    THE DRIVER?S AIRBAG MODULE IN THE INVOLVED VEHICLES IS ATTACHED TO A SPIRAL CABLE ASSEMBLY WITH ELECTRICAL CONNECTIONS THAT COULD BECOME DAMAGED WHEN THE STEERING WHEEL IS TURNED.  IF THIS OCCURS, THE AIR BAG WARNING LAMP WILL ILLUMINATE.  IN ADDITION, THE DRIVER?S AIR BAG COULD BECOME DEACTIVATED, CAUSING IT TO NOT DEPLOY IN THE EVENT OF A CRASH.) I AM LEFT TO WONDER IF THE SPIRAL CABLE ASSEMBLY MAY BE THE ISSUE WITH MY 2006 MATRIX.  *TR",
        "vin": "2T1KR32E86C"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "02/04/2014",
        "dateOfIncident": "01/18/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10562880,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 TOYOTA MATRIX. THE CONTACT STATED THE CAR INDEPENDENTLY ACCELERATED CAUSING THE CONTACT TO BE DRAGGED OVER A CLIFF. THE CONTACT STATED SHE THE VEHICLE WAS REPAIRED AT HER EXPENSE. THE VEHICLE WAS REPLACED AFTER IT WAS REPAIRED. A YEAR LATER THE CONTACT FOUND OUT THE CAR WAS INCLUDED IN A RECALL FOR WHICH SHE IS EXPECTING TO BE REIMBURSED FOR  REGARDING  THE FAILURE. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 50,000.   UPDATED 11/20/14*LJ   UPDATED 4/30/2015 *JS",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/11/2013",
        "dateOfIncident": "09/10/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10543155,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS ON A STEEP HILL AT A STOP SIGN. I HAD LET GO OF THE BRAKE TO STEP ON THE GAS BECAUSE IT WAS MY TURN TO GO AND MY CAR ROLLED BACKWARDS DRAMATICALLY TO THE POINT WHERE MY TIRES WHERE SCREECHING FOR A FEW SECONDS TILL I WAS ABLE TO GET OFF THE STEEP HILL. THIS IS NOT THE FIRST TIME IT HAS HAPPENED, I USUALLY AVOID STREETS THAT HAVE A STEEP HILL BECAUSE THIS HAPPENS EVERY TIME I'M ON A STEEP HILL. I'VE NOTICED THIS HAS HAPPENED FOR SEVERAL YEARS NOW.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/05/2012",
        "dateOfIncident": "12/05/2012",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10487496,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "BEARINGS IN THE DIFFERENTIAL/TRANSMISSION ARE MAKING NOISE. IT IS A 5-SPEED MANUAL TRANSMISSION.  THIS IS WAY TOO EARLY FOR TRANSMISSION FAILURE.  ESTIMATED COST OF REPAIRS IS $2,500.  *TR",
        "vin": "2T1KR32E76C"
    },
    {
        "components": "SUSPENSION,TIRES",
        "crash": true,
        "dateComplaintFiled": "07/23/2012",
        "dateOfIncident": "01/01/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10467114,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "JAN. 2007 ANCHORAGE, AK  DRIVING 50MPH ON A HIGHWAY, AS THE ROAD BENDED TO THE RIGHT, WE WENT INTO THE TURN AND BEGAN TO SLIDE SIDEWAYS.  IT WAS 30 DEGREES F, SO WE MUST HAVE HIT BLACK ICE.  I TRIED TO CORRECT AND SENT THE CAR FISH TAILING TO THE OTHER SIDE.  WE WHIPPED BACK AND FORTH A FEW TIMES, BEFORE THE CAR STARTED TO SPIN.  WE DID TWO FULL CIRCLES BEFORE WE GENTLY HIT A BURM OF SNOW AND CAME TO A STOP.  NO OTHER CARS WERE ONCOMING SO WE DID NOT HAVE ANY SIGNIFICANT DAMAGE AND THERE WERE NO INJURIES.  I WENT AND BOUGHT STUDDED TIRED THE NEXT DAY.    DEC. 2009 JUNEAU, AK  I WAS A PASSENGER.  SAME MAKE, MODEL, AND YEAR.  DRIVING 40 MPH ON STRAIGHT ROAD, SLUSHY SNOW CONDITIONS.  THE CAR STARTED TO FISH TAIL AND SPUN 1.5 TIMES BEFORE IT STOPPED.  NO SIGNIFICANT DAMAGE OR INJURIES. NO STUDDED TIRES. (ALL-WEATHER TIRES)    FEB. 2012 JUNEAU, AK  I WAS A PASSENGER IN THE SAME CAR AS ABOVE.  DRIVING 55MPH ON HIGHWAY, GOING STRAIGHT.  WE MUST HAVE HIT  BLACK ICE AND THE CAR STARTED TO FISH TAIL.  WE SPUN TWO TIMES AND THE CAR DID NOT SLOW DOWN LIKE IN PREVIOUS INCIDENTS AND WE HIT A GUARDRAIL GOING FULL SPEED (HIT IT BACKWARDS).  I GOT WHIPLASH, FACE LACERATIONS, BROKEN NOSE, AND A MILD TRAUMATIC BRAIN INJURY.  NO AIRBAGS DEPLOYED.  WE WERE ABLE TO DRIVE AWAY FROM THE CRASH AND TAKE ME TO THE HOSPITAL.  DRIVER WAS UNHARMED. (ALL-WEATHER TIRES). *TR",
        "vin": ""
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "04/24/2012",
        "dateOfIncident": "04/17/2012",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10456304,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 TOYOTA MATRIX.  THE CONTACT NOTICED THAT THE AIR CONDITIONING SYSTEM WOULD BLOW WARM AIR AS OPPOSED TO COOLER AIR. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THE CONTACT WAS INFORMED THAT THE CONDENSER NEEDED TO BE REPLACED. THE VEHICLE WAS NOT SERVICED. THE CURRENT AND FAILURE MILEAGES WERE 186,000.",
        "vin": "2T1KR32E46C"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "04/18/2012",
        "dateOfIncident": "04/04/2012",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10455630,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "HEAT SHIELD BOLT CAME OUT OF PLASTIC PIECE CONNECTED TO THE FUEL TANK STRAP.    *JS",
        "vin": "2T1KR32E06C"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/21/2012",
        "dateOfIncident": "03/03/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10448843,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER ONLY 2 YEARS OF OWNING THIS VEHICLE THE VARIABLE SPEED WIPER ARM QUIT WORKING, ONLY THE VARIABLE SPEED FEATURE DOES NOT WORK WHICH TELLS ME THERE IS A PROBLEM WITH THE QUALITY OF THIS PART.  THIS IS NOT SOMETHING I HAVE EVER HEARD OF FAILING ON A VEHICLE AND CERTAINLY NEVER AFTER ONLY 2 YEARS.  THE VEHICLE DID HAVE A LOT OF MILES ON IT AND WAS OUT OF WARRANTY BUT IN SOUTH TEXAS WE DON'T USE WIPERS THAT OFTEN SO THIS POINTS TO A QUALITY CONTROL ISSUE.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/10/2011",
        "dateOfIncident": "10/06/2011",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10429321,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR WOULD NOT SHIFT BEYOND SECOND GEAR (AUTOMATIC TRANSMISSION) AND NOT GO INTO REVERSE. GOT IT TOWED TO MY GARAGE AND THEY ARE IN THE PROCESS OF REPLACING THE ENTIRE TRANSMISSION.  *KB",
        "vin": "2T1LR32E86C"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/22/2011",
        "dateOfIncident": "07/07/2011",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10414653,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 TOYOTA MATRIX XR.  TIRES WHERE PREMATURALLY.  66,000 MILES ON CAR AND THIRD SET OF TIRES ARE CUPPING AND STARTING TO CAUSE HANDLING PROBLEM.  EACH SET OF TIRES (2 DIFFERENT BRANDS) HAS LASTED ABOUT 16,000-20,000 MILES.  HAD REGULAR ALIGNMENTS AND TIRE ROTATION.  WENT AS FAR AS REPLACING SHOCKS AND STRUTS ALL THE WAY AROUND (VERY EXPENSIVE).  NOTHING SEEMS TO HELP.  *TT",
        "vin": "2T1KR32E26C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/14/2011",
        "dateOfIncident": "06/18/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10396416,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 TOYOTA MATRIX. CONSUMER STATES PROBLEM WITH VEHICLE ENGINE *TGW  THE CONSUMER STATED THE VEHICLE STALLED AT IDLE AND WOULD NOT RESTART AT TIMES.  THE CHECK ENGINE LIGHT ILLUMINATED.  THE TECHNICIAN FOUND NO COMMUNICATION WITH THE MASTER TECH DIAGNOSTIC SCANNER. HE ALSO FOUND NO ENGINE SPARK OR FUEL INJECTOR PULSE DUE TO ENGINE CONTROL MODULE FAILURE. HE FOUND A MAJOR FUEL LEAK AT THE FUEL INJECTOR RAIL. THE TECHNICIAN RECOMMENDED REPLACING THE ENGINE CONTROL MODULE,  FUEL INJECTOR, O-RINGS AND SEALS. THE CONSUMER RECEIVED A RECALL NOTICE, A YEAR AFTER PAYING FOR THE REPLACEMENT OF THE ENGINE CONTROL MODULE.   *JB",
        "vin": "2T1KR32E56C"
    },
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "03/10/2011",
        "dateOfIncident": "03/04/2011",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10389738,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 TOYOTA MATRIX. WHILE DRIVING APPROXIMATELY 40 MPH, THE VEHICLE SUDDENLY ACCELERATED. THE CONTACT ATTEMPTED TO APPLY THE BRAKES BUT THE BRAKES WOULD NOT RESPOND. THE CONTACT THEN DEPRESSED THE ACCELERATOR PEDAL AND THE PEDAL FELL TO THE FLOORBOARD ABNORMALLY.  THE CONTACT THEN STRUCK THE CURB AND CRASHED INTO A CONCRETE BARRIER AS THE VEHICLE WENT AIRBORNE AND CRASHED INTO A SECOND BARRIER CAUSING THE WHEELS TO FRACTURE FROM THE VEHICLE BEFORE COMING TO A STOP. THE AIR BAGS DID NOT DEPLOY. THE CONTACT SUSTAINED SEVERE HEADACHES AS A RESULT.  THE VEHICLE WAS TOWED TO THE DEALER WHERE SHE WAS ADVISED THAT THE VEHICLE COULD BE REPAIRED.   THE CONTACT STATED AFTER THE CRASH SHE RECEIVED A RECALL NOTICE UNDER NHTSA CAMPAIGN ID NUMBER: 10V384000 (ENGINE AND ENGINE COOLING). THE MANUFACTURER WAS NOT CONTACTED. THE APPROXIMATE FAILURE MILEAGE WAS 68,000.",
        "vin": "1NXBR32E45Z"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/28/2011",
        "dateOfIncident": "09/24/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10384771,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL-THE CONTACT OWNS A 2006 TOYOTA MATRIX.  WHILE DRIVING APPROXIMATELY 30 MPH ALL THE SERVICE LIGHTS ON THE DASHBOARD BEGAN ILLUMINATING BEFORE THE VEHICLE STALLED.  THE VEHICLE WOULD NOT RESTART.  THE VEHICLE WAS THEN TOWED TO AN AUTHORIZED DEALER WHERE THE CONTACT WAS TOLD TO REPLACE THE BATTERY.  THE VEHICLE WAS TOWED HOME WHERE THE CONTACT REPLACED THE BATTERY.  THE FAILURE HAS SINCE RECURRED TWICE.  AFTER EACH FAILURE THE CONTACT WAS ABLE TO RESTART THE VEHICLE AND CONTINUE DRIVING.  THE FAILURE MILEAGE WAS 45,736 AND THE CURRENT MILEAGE WAS 110,000.  SM.",
        "vin": "2T1KR32E16C"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/28/2010",
        "dateOfIncident": "12/28/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10373181,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS DRIVING TO WORK ON DECEMBER 28, 6:50 AM I GRADUALLY FELT MY CAR SLOWING DOWN SO I TRIED ACCELERATING WITH NO SUCCESS! WHEN I LOOKED IF I HAD FORGOTTEN TO LOWER THE SAFETY BRAKE, I CHECKED MY BOARD AND SAW A CHECK ENGINE SIGN SO I PULLED OF TO THE GAS STATION (LUCKY THERE WAS ONE WHEN THIS HAPPENED AND NO TRAFFIC). I CALLED FOR A TOWING AND TURNED OF THE CAR. WHEN THE TOWING GUY CAME, HE TRIED MY VEHICLE AND NOTHING SEEMED TO BE WRONG EXCEPT FOR THE CHECK ENGINE SIGN THAT WAS STILL UP... WHEN I WENT TO THE GARAGE, MY CAR WAS SCANNED AND THE PO607 ERROR WAS FOUND IN THE COMPUTER'S HISTORY! THERE OBVIOUSLY IS A PROBLEM WITH THE ACCELERATOR ON MY TOYOTA MATRIX 2006  AND THERE IS NO RECALL FOR THAT PROBLEM WHICH IS NOT NORMAL EITHER! THIS IS A CAR I BOUGHT ON AUGUST 2010 FROM A POPULAR DEALER SO ITS SECOND HAND AND I'M PRETTY SURE THIS IS NOT THE FIRST TIME SUCH A PROBLEM OCCURS WITH IT.  *TR",
        "vin": "2T1KR32E26C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/19/2010",
        "dateOfIncident": "10/15/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10366813,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 TOYOTA MATRIX. THE CONTACT STATED THAT WHEN THE VEHICLE WAS TURNED ON AS WELL AS WHILE DRIVING VARIOUS SPEEDS THE IGNITION MADE A BANGING SOUND WITHIN THE ENGINE. THE FAILURE WAS NOT DIAGNOSED. THE WATER PUMP, TIMING BELT AND THE BATTERY WERE ALSO REPLACED AT DIFFERENT TIMES. THE APPROXIMATE FAILURE MILEAGE WAS 40,000.",
        "vin": "2T1KR32E66C"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/09/2010",
        "dateOfIncident": "10/21/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10365183,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 TOYOTA MATRIX. THE CONTACT STATED THAT WHILE DRIVING 5 MPH, THE BRAKES WERE APPLIED BUT THE BRAKE PEDAL AND ACCELERATOR PEDAL WERE TOO CLOSE AND THE CONTACT ACCIDENTALLY DEPRESSED THE ACCELERATOR PEDAL CAUSING THE VEHICLE TO ACCELERATE. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHERE THE BRAKE PEDAL WAS ADJUSTED TO BE EVEN WITH THE ACCELERATOR PEDAL. THE CONTACT BELIEVED THAT THE BRAKE PEDAL NEEDED TO BE ADJUSTED AGAIN. THE DEALER STATED THAT THERE WAS NO REMEDY FOR THE PROBLEM. THE FAILURE MILEAGE WAS APPROXIMATELY 37,000.",
        "vin": "2T1KR32E86C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/23/2010",
        "dateOfIncident": "04/15/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10357158,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 TOYOTA MATRIX. THE CONTACT STATED THAT HER VEHICLE CONTINUED TO STALL ON NUMEROUS OCCASIONS WHILE DRIVING  INTO A PARKING SPACE OR WHENEVER DRIVING THE VEHICLE STUTTERS AND THEN IT STALLED. THE VEHICLE WAS ALSO TAKEN TO THE DEALER ON NUMEROUS OCCASIONS FOR SERVICE AND THEY COULD NOT DUPLICATE THE PROBLEM. THE MANUFACTURER WAS CONTACTED AND INFORMED HER TO TAKE THE VEHICLE BACK TO THE DEALER FOR THE REPAIRS. NHTSA RECALL#:10V384000; COMPONENT: ENGINE AND ENGINE COOLING WAS RELATED TO THE FAILURE; HOWEVER, HER VIN WAS NOT INCLUDED IN THE RECALL. THE FAILURE MILEAGE WAS 47,000.",
        "vin": "2T1LR30E86C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/20/2010",
        "dateOfIncident": "10/26/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10356675,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE LIGHT ON   THE VEHICLE STALL OUT WHILE DRIVING. MILEAGE   114,522 3 YEAR OLD CAR.  ECM MODULE REPLACE. DEALER REPLACE THE UNIT. 871.46 DOLLARS   CALL TOYOTA MAIN HEADQUARTERS SPOKE TO CUSTOMER SERVICE.THEY CLAIM THE VEHICLE IS A  AWD ALL WHEEL DRIVE AND IT'S NOT ON THE RECALL.   I HAVE CHECK TOYOTA MAIN WEB SITE RECALL . ENGINE TYPE IZZ-FE  WITH ECM  FROM 2005-2008 IS ON THE RECALL . THEY ARE LYING TO ME .  A THREE YEAR OLD CAR STALLING OUT AND TRYING TO GET REIMBURSE .TOYOTA IS GIVING ME A RUN AROUND. *TR",
        "vin": "2T1LR32E26C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/09/2010",
        "dateOfIncident": "09/05/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10354639,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2006 TOYOTA MATRIX WITH 74K. MY A/C WENT IN AND OUT FIRST, THOUGHT IT WAS THE COMPRESSOR, THEN IT SEEMED LIKE I WAS NOT QUITE GETTING THE HORSEPOWER I HAD PREVIOUSLY. THEN ON THE LABOR DAY WEEKEND THE CAR DIES SUDDENLY ON THE HIGHWAY (TWICE), SCARED THE YOU KNOW WHAT OUT OF ME. BEEN DEALING WITH TOYOTA IN CALIFORNIA (NOT GREAT) BUT THEY OK'D IT TO A LOCAL DEALER IN UNION CITY GA,(VERY NICE). THEY TOLD ME TOYOTA HAD OK'D PUTTING IN A NEW ELECTRONIC CONTROL MODULE DUE TO RECALL THAT I WAS NEVER INFORMED ABOUT.  THEY PUT IN THE MODULE 09/08/2010 BUT TELL ME THAT THIS MAY NOT BE THE CORRECT FIX AS TOYOTA HAVE NOT INFORMED THE DEALERS OF WHICH IS THE CURRENT RECALL FIXING MODULE. THEN THEY TELL ME THEY ARE UNSURE IF THEY WILL HAVE TO CHANGE IT AGAIN BECAUSE TOYOTA MAY BE GETTING A NEW PART AND I WILL GET A LETTER. THIS DOES NOT INSTILL CONFIDENCE AFTER 4 SUDDEN STALLS WHILE MOVING (TWO DYING SUDDENLY ON THE HIGHWAY). I NOW HAVE TO WAIT UNTIL TOYOTA DEEMS IT IMPORTANT ENOUGH TO LET ME KNOW THERE IS A PROBLEM. WHAT GALLS ME IS THEY SENT OUT A PRESS INFO THING AUGUST 26TH ACKNOWLEDGING 3 ACCIDENTS, 12 DAYS LATER MY 2006 MATRIX DIES TWICE ON THE HIGHWAY. I COULD'VE BEEN KILLED. THEY STILL HAVE NOT INFORMED ME THE CAR OWNER DESPITE HAVING MY PHONE NUMBER, E-MAIL AND HOME ADDRESS. TAKE THIS RECALL SERIOUSLY IT IS A VERY DANGEROUS PROBLEM. *TR",
        "vin": "2T1KR32EX6C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/27/2010",
        "dateOfIncident": "08/25/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10352251,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 TOYOTA MATRIX, 50,000 MILES.  HEAT SHIELD REARMOST HANGER ASSEMBLY FAILED. LOUD RATTLE AS SHIELD RESTED ON EXHAUST PIPE.   TEMPORARY FIX: WIRE FROM TANK STRAP AROUND SHIELD TO KEEP SHIELD FROM RESTING ON PIPE.  PLASTIC HANGER ASSEMBLY SPLIT, CAPTIVE NUT SEPARATED, SHIELD DROPPED TO PIPE. I REGARD IT AS A DESIGN FLAW. PLASTIC WAS SUPPOSED TO PROVIDE PRESSURE TO HOLD NUT IN PLACE AS WELL AS TO SUPPORT LOAD. EVIDENCE OF LONG TERM CRACKING, DIRT IN CRACK SURFACES.  ESTIMATE TO REPAIR FROM DEALER, $100, POSSIBLY INCLUDES BOTH LABOR AND PARTS COST.  OTHERWISE, IS A GOOD PRODUCT, TAKE TO DEALER EVERY 5000 MILES FOR APPROPRIATE MAINTENANCE. *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/26/2010",
        "dateOfIncident": "06/13/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10352186,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING NORMAL DRIVING CONDITIONS DRY WEATHER FLAT ROAD, CAR BEGAN TO MISS, RUN ROUGH AND SHUT DOWN WHILE ON THE ROAD. I WAS ABLE TO STILL GET VEHICLE TO SIDE OF THE ROAD WITHOUT INCIDENT. I BELIEVE A LESS EXPERIENCED DRIVER MAY HAVE NOT HAD THE SAME RESULTS. THIS SOUNDS STRANGELY RELATED TO THE CURRENT ECM RECALL. THEY DID NOT CHANGE MY ECM, BUT REPLACED MY CAMSHAFT TIMING GEAR TO THE TUNE OF $440.00. DO I HAVE ANOTHER PENDING PROBLEM? OR MAYBE THEY DID ADDITIONAL TESTING AND REPLACING? I HAVE NO  RECORD OF THIS....IF SOMEONE WOULD LIKE TO INVESTIGATE THIS. I HAVE THE PART.. ALSO.. I WAS ABLE TO FINALLY GET IT RESTARTED WITH CHECK ENGINE LIGHT ON AND IT WAS RUNNING VERY POORLY. HAD TO KEEP RPMS UP TO KEEP FROM STALLING. *TR",
        "vin": "2T1KR32E96C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/26/2010",
        "dateOfIncident": "02/13/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10352199,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR STALLED WHILE PROCEEDING INTO AN INTERSECTION WITH A CHECK ENGINE LIGHT.  CAR WOULD THEN NOT RESTART FOR 10-15 MINUTES WHILE TRAPPED IN THE CENTER LANE OF A BUSY 4 LANE ROAD. *TR",
        "vin": "2T1KR32E46C"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/25/2010",
        "dateOfIncident": "12/01/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10351693,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THEY NEED TO ISSUE A RECALL IMMEDIATELY -- MY 2006 TOYOTA MATRIX HAS BEEN HARD SHIFTING WITH THE CHECK ENGINE LIGHT ON BUT I WAS UNABLE TO GET IT SERVICED BECAUSE I'M UNEMPLOYED.  IT HAS 90K AND THE DEALER SAYS I MUST PAY OUT OF POCKET FOR THE REPAIR, $1000-$1300 BECAUSE THERE IS NO RECALL ON IT YET.    HAD I KNOWN THERE WAS AN ISSUE WITH IT I WOULD HAVE BROUGHT IT IN -- AS IT IS I HAD TO LEARN ABOUT THIS PROBLEM IN THE NEWSPAPER YESTERDAY!  I AM AFRAID NOW TO DRIVE IT THAT IT MAY STALL AT A HIGH SPEED AS DESCRIBED IN THE NEWSPAPER!! *TR",
        "vin": "2T1KR32E06C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/24/2010",
        "dateOfIncident": "08/15/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10351509,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE STALLED IN MY 2006 TOYOTA MATRIX. FORTUNATELY I WAS DRIVING VERY SLOW AND WAS ABLE TO SAFELY PULL OUT. THE DEALER MADE A REPAIR AND TOLD ME THAT THIS WAS A COMPUTER PROBLEM. *TR",
        "vin": "2T1KR32E56C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/10/2010",
        "dateOfIncident": "08/08/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10348446,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING THOUGH TOWN, WHEN VEHICLE STALLED AT INTERSECTION. PULLED OVER AND VEHICLE STARTED AND DROVE, THEN STALLED AGAIN...HAD NO PRIOR PROBLEMS WITH 2004 TOYOTA MATRIX UNTIL NOW. VEHICLE STARTS AND RUNS NORMAL THEN STALLS INTERMITTENTLY..VEHICLE IS TOYOTA CERTIFIED... *TR",
        "vin": "2T1KR32E36C"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/30/2010",
        "dateOfIncident": "06/24/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10346348,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 TOYOTA MATRIX:  REAR WHEELS OUT OF ALIGNMENT, RESULTING IN EXCESSIVE, IRREGULAR WEAR ON TIRES. RUINED AFTER ONLY 24,000 MILES.  TOYOTA TECHNICAL REPRESENTATIVE INFORMED ME THAT THE NON-ADJUSTABLE REAR AXLE IS \"SELF ALIGNING\".  IF SO, MY TIRES WOULD NOT HAVE BEEN RUINED.  OTHER ALIGNMENT SPECIALISTS CONFIRMED PROBLEM WITH TOYOTA COROLLA FRAME.  THIS COULD LEAD TO TIRE BLOW-OUT AND ACCIDENTS.  SHOULD BE INVESTIGATED. *TR",
        "vin": "2T1KR32E56C"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/21/2010",
        "dateOfIncident": "07/16/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10344319,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 TOYOTA MATRIX: ENGINE STALLED AND CHECK ENGINE PLUS OIL LIGHT CAME ON WHILE APPROACHING HIGHWAY ONRAMP. PULLED OFF. CHECKED FOR LOOSE WIRES. TRIED TO START ENGINE, ENGINE STARTED AND WAS ABLE TO DRIVE 100 MILES HOME WITHOUT A PROBLEM EXCEPT THAT THE CHECK ENGINE LIGHT STAYED ON. NEXT MORNING, ENGINE STARTED BUT ACCELERATOR WOULD NOT RESPOND. ENGINE SIMPLY IDLED. TURNED IT OFF, CALLED TOW. TOW TRUCK DRIVER WAS ABLE TO START ENGINE AND REVERSE OUT DRIVEWAY. ENGINE STALLED AGAIN BUT LUCKILY IN THE STREET. TOWED TO MECHANIC. DTC CODE PO607. MECHANIC SAID FAILED ECM AND ONLY TOYOTA CAN FIX DUE TO REPROGRAMMING PARAMETERS. TOWED TO DEALER. DEALER CONFIRMED FAILED ECM. OVER $900 TO FIX. *TR",
        "vin": "2T1KR32E26C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/19/2010",
        "dateOfIncident": "07/18/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10343966,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "1/2 HEAT SHIELD DROPPED ONTO TOP OF EXHAUST PIPE MAKING A LOUD HORRIBLE NOISE. *TR",
        "vin": "2T1KR32EX6C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/07/2010",
        "dateOfIncident": "05/14/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10341755,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 TOYOTA MATRIX WITH SHIFT PROBLEM MY CAR HAS ONLY 16,000 MILES HAS A CHECK ENGINE LIGHT THAT'S SAY SHIFT SOLENOID A BUT IS THE ECM. *TR",
        "vin": "2T1KR32E86C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/06/2010",
        "dateOfIncident": "07/01/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10341667,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 TOYOTA MATRIX. THE CONTACT WAS DRIVING APPROXIMATELY 15 MPH ENTERING THE HIGHWAY WHEN THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE RESTARTED; HOWEVER, IMMEDIATELY AFTER SHIFTING INTO DRIVE GEAR, THE ENGINE STALLED AGAIN. THE FAILURE OCCURRED REPEATEDLY. THE VEHICLE WAS TOWED TO AN AUTHORIZED DEALER WHERE THE TECHNICIAN REPLACED THE ENGINE CONTROL MODULE. THE FAILURE MILEAGE WAS APPROXIMATELY 32,000.    UPDATED 8/25/10 *CN  UPATED 08/27/10  UPDATED 08/30/10*JB",
        "vin": "2T1KR32E66C"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "06/30/2010",
        "dateOfIncident": "04/12/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10341172,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 TOYOTA MATRIX. CONSUMER STATES BRAKE FAILURE *TGW  THE CONSUMER STATED WHEN HE ATTEMPTED TO APPLY THE BRAKE, THE VEHICLE FAILED TO SLOW DOWN.  THE CONSUMER VEERED TO THE RIGHT, BUT CONSEQUENTLY HE REAR ENDED ANOTHER VEHICLE. THE VEHICLE CONTINUED ITS COURSE, EVEN THOUGH THE CONSUMER WAS APPLYING THE BRAKE. FINALLY, THE VEHICLE CAME TO A STOP AFTER CONTINUING ON FOR A HALF BLOCK. *JB",
        "vin": "2T1KR32E46C"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "06/22/2010",
        "dateOfIncident": "06/18/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10339615,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER SIDE WINDOW EXPLODED ONTO MY SON WHILE CAR WAS PARKED IN DRIVEWAY. THE WINDOW WAS OPERATING FINE UNTIL THIS POINT, WHILE BEING CLOSED THE WINDOW MADE A POPPING NOISE AND PARTS DROPPED INTO DOOR, THE WINDOW BEING IN A BIND EXPLODED.  *TR",
        "vin": "2T1KR32E46C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/17/2010",
        "dateOfIncident": "06/11/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10336793,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 TOYOTA MATRIX STALLED WHEN I WAS DRIVING.  IT WOULD START, BUT THEN IT WOULD STALL IN APPROXIMATELY ONE MINUTE. I TRIED TO START IT MANY TIMES, BUT IT WOULD STALL AFTER A MINUTE. TOWED CAR TO TOYOTA DEALER AND THEY REPLACED THE ECU. *TR",
        "vin": "2T1KR32E36C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/15/2010",
        "dateOfIncident": "06/12/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10336552,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR WAS RUNNING FINE AND DIED IN THE MIDDLE OF THE ROAD AND THE ENGINE LIGHT CAME ON. LIGHT WHEN OFF LATER IN DAY. NEXT DAY - DIED ON BUSY HIGHWAY - RESTARTED AND WOULD GOING GO ABOUT 5 MILES PER HOUR.  NEXT DAY TRYING TO GET TO THE SHOP DIED AND TOOK SEVERAL TIMES TO GET STARTED AND THEN 5 MILES PER HOUR AGAIN.  THEY KNOW THERE IS SOMETHING WRONG WITH THIS  PART -- THEY SHOULD HAVE TO FIX NO MATTER THE MILEAGE....IT IS NOTED IN A BULLETIN. *TR",
        "vin": "2T1KR32E86C"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/17/2010",
        "dateOfIncident": "05/06/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10330925,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY REAR DIFFERENTIAL IN MY 2006 TOYOTA MATRIX XR 4WD WAS MAKING A WHINING NOISE THAT INCREASED IN VOLUME AS SPEED INCREASED. I TOOK IT TO THE DEALERSHIP AND WAS INFORMED THAT IT WAS THE REAR DIFF. AND WOULD COST $2300 TO REPLACE.  CAR HAS  68K. POWERTRAIN WARR. IS 5 YRS. OR 60K. DEALER QUOTED ME PRICE OF $2388 TO FIX?? I SAID IT SHOULD NOT HAVE GONE OUT AS I HAVE DONE EVERY MAINTENANCE ON THIS CAR. THEY THEN OFFERED ME A MEASLY 10% AS A WHINER/CONSOLATION FEE. I THEN CALLED THE \"CUSTOMER CENTER\" OF TOYOTA AND WAS EVENTUALLY TOLD THAT THEY WOULD UP THE \"OFFER\" TO $600, AND THAT WAS THEIR FINAL OFFER. THEY THEN CALLED ME THE NEXT DAY AND TOLD ME THAT IT WAS ACTUALLY THE TRANSMISSION COUPLING ASSY, AND THAT IT WOULD COST ANOTHER $400.  TOYOTA SAID THEY WOULD COVER THE DIFFERENCE OF $400 SINCE IT WAS MISDIAGNOSED. I SAID THEY SHOULD COVER ALL OF IT SINCE IT WAS CLEARLY DEFECTIVE. THEY REFUSED. THEN I FOUND A TOYOTA TECHNICAL SERVICE BULLETIN ON THE INTERNET DESCRIBING THE EXACT PROBLEM, DATED AUGUST 23, 2007.  SO THEY KNEW ABOUT THE PROBLEM, AND DID NOT NOTIFY  ME. I KNOW THIS MUST HAVE HAPPENED OVER A LONG TIME, AND I COULD HAVE BROUGHT THE CAR IN TO BE INSPECTED, WELL WITHIN ITS WARRANTY, BUT TOYOTA DID NOTHING.  I THINK TOYOTA IS NOT STANDING BEHIND THEIR PRODUCT. $2417 LATER, TOYOTA WOULD NOT ACKNOWLEDGE THAT THIS WAS A DEFECTIVE PART, AND FORCED ME TO PAY FOR IT. I SHUDDER TO THINK WHAT MIGHT HAVE HAPPENED HAD THIS PART SEIZED UP ON ME AT 65 MPH IN TRAFFIC, OR ON ONE OF OUR ICY MOUNTAIN ROADS IN THE WINTER. *TR",
        "vin": "2T1LR30E16C"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/12/2010",
        "dateOfIncident": "05/11/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10330043,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 10:30 AM ON A SUNNY DAY, I EXITED THE I-880 NORTHBOUND 23RD AVE EXIT.  COMING UP TO A LINE OF CARS STOPPED AT THE E11TH ST SIGNAL LIGHT, I BEGAN PRESSING DOWN ON THE SERVICE BRAKE TO SLOW DOWN.  AS I WAS COMING UP TO THE BMW AHEAD OF ME, I PRESSED MORE ON THE SERVICE BRAKE TO STOP MY CAR.  THINGS WENT WRONG WHEN I FELT AND HEARD THE ACCELERATOR REVVING UP, CAUSING ME TO INSTINCTIVELY PRESS EVEN HARDER ON THE SERVICE BRAKE.  AS THE ACCELERATION INCREASED, MY TOYOTA MATRIX'S BRAKES BEGAN SLIPPING CAUSING MY CAR TO INCH CLOSER TO THE BMW.  REALIZING THAT THE SERVICE BRAKE WAS NOT HOLDING, I PULLED UP ON THE EMERGENCY BRAKE AND SHIFTED THE CAR INTO NEUTRAL, ALL THE WHILE STILL PRESSING DOWN ON THE SERVICE BRAKE.  SINCE THE ENGINE WAS STILL ACCELERATING FASTER, I MANAGED TO TURN THE IGNITION KEY OFF, SUCCESSFULLY SHUTTING DOWN THE ENGINE AND STOPPING THE ACCELERATION.  AFTER A BRIEF 15 SECONDS, I RESTARTED THE CAR WITH THE ENGINE IN PARK, AND THE EMERGENCY AND SERVICE BRAKES ON.  THE ENGINE IMMEDIATELY REVVED UP AS BEFORE AND I ONCE AGAIN TURNED OFF THE IGNITION KEY TO SHUT DOWN THE ENGINE.  REALIZING I HAD A MAJOR PROBLEM, I KEPT THE ENGINE OFF AND PUT THE CAR IN NEUTRAL SO I COULD PUSH THE CAR TO A SAFER PART ON THE SIDE OF THE ROAD.  UPON INSPECTION, I FOUND THAT MY FLOOR MAT WAS SECURELY LOCKED INTO PLACE, AND THAT THE ACCELERATOR PEDAL WAS IN THE UP POSITION, A FEW INCHES OFF THE FLOOR.  I AM THE ORIGINAL OWNER WITH 75000 ACCIDENT AND INCIDENT FREE MILES ON THE CAR, AND THIS IS THE FIRST THING THAT HAS EVER GONE WRONG WITH THE VEHICLE. I HAD AAA TOW THE CAR TO ONE TOYOTA IN OAKLAND, AND THEY ARE DOING DIAGNOSTICS WITH THE VEHICLE.  THEY GAVE ME A RENTAL CAR FREE OF CHARGE UNTIL THEY DETERMINE WHAT WENT WRONG.  THE SERVICE DEALER TOLD ME THAT IT IS THE 2007 AND LATER MATRIX'S THAT HAVE THE ACCELERATION PROBLEM, AND THAT FOR MY 2006 MATRIX TO HAVE THIS PROBLEM IS UNCOMMON.  HOPEFULLY TOYOTA WILL FIND AND CORRECT THE PROBLEM TO PREVENT THIS FROM HAPPENING TO OTHERS. *TR",
        "vin": "2T1KR30EX6C"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/08/2010",
        "dateOfIncident": "12/22/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10329418,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ABOUT 10:00 PM WHEN I WAS JUST PULLING ON TO I-84 IN DOWNTOWN HARTFORD, CT THE MANUAL TRANSMISSION OF MY TOYOTA MATRIX MADE A VERY LOUD GRINDING SOUND AND I COULD NOT MOVE.  THANKFULLY, MY MOMENTUM ENABLED ME TO GET OVER TO THE SIDE OF THE HIGHWAY BUT I WAS STILL STICKING OUT INTO THE RIGHT LANE JUST AROUND A CURVE IN THE ROAD.  A STATE POLICE TROUPER PULLED BEHIND ME ALMOST IMMEDIATELY AND PUT ON HIS LIGHTS TO WARN CARS AWAY.  OTHERWISE, I AM CERTAIN MY CAR WOULD HAVE BEEN REAR-ENDED WHILE I WAITED FOR THE TOW TRUCK.  THE REPAIR SHOP I HAD THE CAR TOWED TO SAID THAT A BEARING HAD FAILED AND DESTROYED THE TRANSMISSION.  I HAD TO GET A COMPLETELY NEW TRANSMISSION AT A COST OF OVER $2000.  THIS CAR HAD OVER 105,000 MILES ON IT, BUT THEY WERE MOSTLY HIGHWAY MILES AND THE TRANSMISSION SHOULD NEVER HAVE FAILED THIS EARLY. *TR",
        "vin": "2T1KR32E76C"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/29/2010",
        "dateOfIncident": "04/27/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10328144,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A TOYOTA MATRIX, 2006, WITH 49K MILES.  THE CAR SUDDENLY DECELERATES AND DOES NOT RESPOND TO THE GAS PEDAL TO PICK UP SPEED AGAIN. SO FAR, I'VE BEEN ABLE TO PULL OFF THE ROAD.  I STOP AND THEN RESTART THE CAR, AND IT DRIVES FINE.      ALSO, THE CRUISE CONTROL SUDDENLY GOES INTO DECELERATION, WHICH IS VERY DANGEROUS WHILE CRUISING ON THE FREEWAY.    BOTH THESE PROBLEMS HAVE OCCURRED SEVERAL TIMES SO FAR.    THE DEALER SAYS MY VEHICLE IS NOT ON A RECALL LIST, AND ALSO CLAIMS TO KNOW NOTHING ABOUT THIS PROBLEM WITH THE MATRIX.    I KNOW THAT TOYOTA FINALLY SUCCUMBED TO PRESSURE RECALLED ABOUT 50,000 SEQUOIA SPORT UTILITY VEHICLES FOR A DECELERATION PROBLEM.  IS THE SAME PROBLEM WITH THE MATRIX ALSO BEING COVERED UP?    WHAT SHOULD I DO? *TR",
        "vin": "2T1KR32E26C"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "04/13/2010",
        "dateOfIncident": "03/13/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10325490,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SON BOUGHT THE 2006 TOYOTA MATRIX IN 2006 . IN 2007 MY SON WAS DRIVING  VERY SLOW AND HIT THE CAR INFRONT OF HIM.  HE NEVER HAS HAD AN ACCIDENT AND NO TICKETS. HIS CAR WAS DAMAGE, A TOTAL OF $6,429.41  WAS FIX AT RON'S AUTOBODY & PAINT INC. 1314 N. CLOSNER, EDINBURG,TX 78539 BECAUSE HE FOUND OUT HE DIDN'T HAVE FULL COVERAGE,HE ONLY HAD LIABILITY AND KNEW THE DEALERSHIP WOULD CHARGE MORE .  WE NEVER TOOK THE TIME TO FIND OUT IF THE CAR HAD ACCELERATION OR BRAKES PROBLEMS. THE CAR HAS ACCELERATION& BRAKE PROBLEMS BECAUSE MY SON SAID THE BRAKES DIDN'T RESPONSE & CAR KEPT ON GOING,AND HE SAYS THE BRAKES STILL DON'T RESPONSE QUICKLY AND I MYSELF DROVE THE CAR LAST YEAR AND I PRESS THE BRAKES AND CAR JUST KEPT ON GOING AND I WAS GOING SLOW TO STOP ON A YELLOW LIGHT AND RECEIVED A TICKET BY MAIL ,I HAD A CLEAN RECORD. I DID CALL FRANK SMITH TOYOTA AND I WAS TOLD WE WOULD BE CHARGE TO LOOK AT IT AND AFRAID THEY WILL CHARGE US TOO MUCH MONEY. OUR SON IS STILL DRIVING THE CAR.  HE DOES DRIVE VERY SLOW TO GO TO WORK.  HE HAS 3 CHILDRENS THAT HE HAS AS PASSENGERS. DON'T KNOW WHAT TO DO.  HOPE IT DOESN'T HAPPEN AGAIN. I THINK THE DEALERSHIP SHOULD LOOK AT IT WITHOUT CHARGING. *TR",
        "vin": "2T1KR32EX6C"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "04/01/2010",
        "dateOfIncident": "03/22/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10323360,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE STALLS, CHECK ENGINE LIGHT COMES ON, DIAGNOSIS VIA COMPUTER LEADS YOU TO DIFFERENT FIX'S. MY 2006 MATRIX HAS BEEN IN THE SHOP FOR ALMOST TWO WEEKS. I HAD THIS SAME PROBLEM, I TOOK IT TO MY LOCAL MECHANIC AND THEY DIAGNOSED IT (VIA THE COMPUTER), AND SAID IT WAS TWO BURNT COILS ($560.00). PROBLEM STILL EXISTS, SO THEY CHECKED IT AGAIN AND SAID IT WAS A VACUUM LEAK (FIXED FOR FREE) PROBLEM STILL EXISTS. THEN THEY SAID IT WAS A PINCHED WIRE, ETC. THEY FINALLY HAD TO CALL A TOYOTA DEALER AND SEEK HELP. THEY WERE THEN TOLD OF THE COMPUTER PROBLEM. ACCORDING TO MY MECHANIC, THE COMPUTER IS UNDER WARRANTY TO 80,000 MILES, I HAVE 88,000. MY MECHANIC IS PRESSING THEM TO FIX IT UNDER WARRANTY",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/29/2010",
        "dateOfIncident": "03/26/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10322581,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "COMPUTER FAILURE, QUITE SUDDENLY THE CAR STOPPED WORKING, JERKED AND SLOWED DOWN.  ALL THE SERVICE LIGHTS ON THE DASH BOARD CAME ON.  AFTER A COUPLE MINUTES THE CAR COULD BE TURNED ON BUT AFTER ABOUT 1.5 MILES THE SAME THING WOULD HAPPEN.  THE HIGHWAY WAS AVOIDED BUT IT OCCURRED ON A LOCAL ROAD WITH LOTS OF CARS.  THE HAZARDS WERE TURNED ON BUT IT WAS A FRIGHTENING AND CONCERNING INCIDENT.  AAA WAS CALLED TO TOW THE CAR TO THE DEALER. AT THE DEALER A COMPUTER PART WAS REPLACED.  THE CAR HAS BEEN WORKING FOR 48HRS.  THE CAR WAS ONLY FOUR YEARS OLD.",
        "vin": "2T1KR32E36C"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "03/29/2010",
        "dateOfIncident": "02/24/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10322650,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 TOYOTA MATRIX. WHILE DRIVING AT APPROXIMATELY 10 MPH AND ATTEMPTING TO SLOW DOWN, THE VEHICLE SUDDENLY ACCELERATED. THE VEHICLE CRASHED INTO ANOTHER VEHICLE ALTHOUGH THE BRAKE PEDAL WAS DEPRESSED. THE CONTACT STATED THAT THERE WAS NOT ENOUGH TIME TO SHIFT INTO NEUTRAL GEAR; ONCE THE VEHICLE CRASHED, IT SPUN AROUND IN A 180 DEGREE TURN AND THEN THE ENGINE STOPPED. THERE WERE TWO PEOPLE INJURED AND BOTH WENT TO THE HOSPITAL. THERE WAS A POLICE REPORT FILED. THE VEHICLE WAS TOTALED. THE CONTACT HAD NOT CALLED THE MANUFACTURER OR THE DEALER AT THE TIME OF THE COMPLAINT. THE FAILURE MILEAGE WAS APPROXIMATELY 10,000.",
        "vin": "2T1KR32E76C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/25/2010",
        "dateOfIncident": "03/12/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10322207,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 TOYOTA MATRIX STALLS, CHECK ENGINE LIGHT COMES ON.  THE CAR HAD TO BE TOWED INTO THE DEALERSHIP, WHERE, AFTER RESTING OVER NIGHT, RAN FINE AND THE CHECK ENGINE LIGHT TURNED OFF.  HOWEVER, I REQUESTED THAT THE DEALERSHIP RUN THE DIAGNOTICS, WHICH SHOWED AN ERROR CODE P0607 IN THE SYSTEM WHICH MEANS THE ECM IS DEFECTIVE.  I HAD THE ECM REPLACED AT A COST OF $867.57, PLUS $95.00 FOR THE TOW.  NOW I LEARN THAT A TSB WAS ISSUED ON THIS PROBLEM FOR THIS VEHICLE BACK IN 2007, AND ALTHOUGH MY MATRIX WAS IN THE DEALERSHIP FOR MAINTENANCE AND SERVICE DOZENS OF TIMES, AT NO TIME WAS THE DEFECTIVE ECM REPLACED, NOR WAS I TOLD OF THE PROBLEM.  THIS CAR IS PRIMARILY DRIVEN BY MY WIFE, A SOCIAL WORKER FOR A CHILD WELFARE AGENCY IN THE CHICAGO AREA.  SHE IS OFTEN IN VERY UNSAFE NEIGHBORHOODS, AND WAS IN SUCH A NEIGHBORHOOD THE MORNING BEFORE THE CAR STALLED -- LUCKILY FOR US -- ONLY A MILE FROM OUR HOUSE.  TOYOTA SAYS THAT THE PART WAS UNDER WARRANTY PURSUANT TO FEDERAL LAW UNTIL 80K MILES.  MY MATRIX HAS 85K.  TOYOTA REFUSES TO COVER THE COST OF THE REPAIR UNLESS IT ISSUES A RECALL ON THE VEHICLE.  BUT UNDER THE PRESENT TSB, OF WHICH I WAS ONLY MADE AWARE THROUGH AN INTERNET SEARCH AFTER HAVING THE STALLING PROBLEM, TOYOTA HAS NO INTENTION OF COVERING THE COST OF REPAIRING THIS KNOWN AND ADMITTED DEFECT.  IF THIS IS NOT RESOLVED BY A RECALL, OTHERS WILL HAVE STALLING VEHICLES ON A HIGHWAY AND GET SEVERELY INJURED OR KILLED, OR IN A BAD NEIGHBORHOOD AND GET MUGGED OR RAPED, OR ON THE WAY TO THE HOSPITAL AND SUFFER HEALTH COMPLICATIONS FROM DELAYED MEDICAL CARE, ETC., ETC.  PLEASE TAKE IMMEDIATE STEPS TO FORCE A PROPER RESOLUTION OF THIS PROBLEM.  BY THE WAY, WHEN I CALLED TOYOTA (800-331-4331), I WAS TOLD THAT THERE ARE SEVERAL OTHER TSBS ON MY MATRIX, BUT THAT THE REPRESENTATIVE CANNOT TELL ME WHAT THEY ARE UNTIL I AM HAVING THE PROBLEM COVERED BY THE TSB.  THAT IS UNCONSCIONABLE.  LOOK WHAT THAT DID FOR THE SIMILAR APPROACH WITH THE FLOOR MAT AND ACCELERATION PROBLEM.",
        "vin": "2T1KR32E66C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/18/2010",
        "dateOfIncident": "10/21/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10320652,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 TOYOTA MATRIX. THE DRIVER STATED THAT IN 2008 HE WAS DRIVING APPROXIMATELY 70 MPH WHEN THE VEHICLE STALLED AND IT BECAME DIFFICULT TO DRIVE ONTO THE EMERGENCY LANE. THE VEHICLE WAS TOWED TO A TOYOTA DEALER WHO STATED THAT THEY HAD RECEIVED SEVERAL RELATED COMPLAINTS. THE CONTACT HAD TO RENT A VEHICLE WHILE HIS VEHICLE WAS BEING REPAIRED. THE FAILURE MILEAGE WAS 24,126 AND THE CURRENT MILEAGE WAS 37,000.",
        "vin": "2T1KR32E86C"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "03/13/2010",
        "dateOfIncident": "03/25/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10319427,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY COMPLAINT WAS FIRST FILED ON 3/25/2006 (ODI # 10153679).  THIS IS THE 2ND COMPLAINT ABOUT THE DEFECTIVE TOYOTA MATRIX THAT I DROVE IN 2006.  I WAS DRIVING A 2006 TOYOTA MATRIX AND LOST TOTAL CONTROL OVER THE VEHICLE.  I WAS DRIVING ON RT 2 WEST BOUND OUT OF BOSTON DURING EVENING RUSH HOUR.  I WAS TRYING TO CHANGE LANE TO MY RIGHT AND FOUND THERE WAS A CAR APPROACHING AND HONKED AT ME.  I HAD NOT LEFT MY LANE YET AND TRIED TO PULL MY CAR STRAIGHT BACK.  THE CAR REACTED BY SHIFTING TOO MUCH TO THE LEFT AND I TRIED ONLY TO ADJUST IT, KEEPING IN MIND THAT  WAS A POWER-STEERED SYSTEM, TO KEEP IT STRAIGHT.  THERE WAS A 1-2 SECONDS AFTERWARDS THE CAR SEEMED TO BE ON TRACK AND I WAS DRIVING FINE.  AFTER THAT 2 SECONDS, THE CAR ACCELERATED ALL OF A SUDDEN, GAS PEDAL WAS DOWN TO THE FLOOR, THE CAR VEERED TOWARD THE LEFT ON IT'S OWN.  I TRIED TO MAINTAIN IT STRAIGHT BUT IN VAIN AND COMPLETELY LOST CONTROL OVER IT.  THE WHEEL WAS SO SOLID AND IT WAS IMPOSSIBLE TO STEER THE CAR EVEN JUST A LITTLE BIT.  IT SPUN COUNTERCLOCKWISE OVER 3 LANES TOWARD MY LEFT AND HIT THE CENTRAL GUARDRAIL AND STOPPED.  THE VEHICLE WAS TOTALED.  THE POLICE ISSUED ME A TICKET ON THE SPOT.  OTHER THAN COMPLAINT ODI # 10153679 FILED AT THIS WEBSITE AFTER THE INCIDENT, I ALSO FILED A COMPLAINT AT TOYOTA'S WEBSITE ON THE SAME DAY (3/25/2006).  THE MATRIX MODEL WAS STOPPED IN 2007 AND CONTINUED IN 2008 WITH AN ADVERTISEMENT THAT IT WAS A COMPLETE NEW DESIGN.  I LATER CHECKED THE INTERNET AND FOUND A VERY SIMILAR ACCIDENT HAPPENED IN NEW YORK STATE ON 10/9/2005.  A WOMAN NAMED [XXX] , 55 OF WEST HARVERSTRAW WAS DRIVING A MATRIX.  HER CAR SPUN OFF ROUTE 287 IN HARDING AND SHE WAS HOSPITALIZED AFTERWARDS.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *TR",
        "vin": "2T1LR30E66C"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/11/2010",
        "dateOfIncident": "10/03/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10319016,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ON OCTOBER 3, 2008, WHILE DRIVING MY 2006 TOYOTA MATRIX I HAD TO ACCELERATE RAPIDLY TO MERGE ONTO A BUSY STREET. I IMMEDIATELY SMELLED A ODOR COMING FROM MY VENTS OF BURNING WIRING. MY CHECK ENGINE LIGHT CAME ON. I PULLED OVER AND MADE SOME CALLS TO SERVICE STATIONS AND THE TOYOTA DEALERSHIP. WAS ADVISED TO TAKE IT TO THE DEALER. DID. AFTER INVESTIGATING THE ISSUE FOR SEVERAL DAYS THEY DECIDED MY ECM WAS BAD AND REPLACED IT.    WITH THE RECENT TOYOTA RECALLS, I FINALLY DECIDED YESTERDAY THAT I SHOULD CHECK INTO IF I AM INVOLVED. MY VEHICLE IS TOYOTA CERTIFIED AND THEY DO HAVE RECORD OF THE ECM FAILURE TO MY VEHICLE.    I ALSO WANTED TO REPORT IT TO YOU FOLKS, JUST IN CASE IT IS IN FACT THE COMPUTERS THAT ARE FAULTY. IT IS UNKNOWN TO ME WHETHER THE REPLACEMENT COMPUTER THEY PUT IN MY CAR IS A 2006, OR WHAT YEAR ECM IT IS.    MY ECM FAILED IMMEDIATELY AFTER RAPID ACCELERATION AND MY VEHICLE IS NOT ON THE RECALL LIST. *TR",
        "vin": "2T1KR32E36C"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "03/10/2010",
        "dateOfIncident": "01/15/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10318574,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 TOYOTA MATRIX. WHILE TRAVELING AT A SPEED OF 20 MPH THE VEHICLE HAD SUDDENLY ACCELERATED WITHOUT WARNING CAUSING THE CONTACT TO CRASH INTO ANOTHER VEHICLE. THE VEHICLE WAS TAKEN TO THE DEALERSHIP WHERE THE CONTACT WAS INFORMED THAT THE VIN WAS NOT RELATED TO ANY RECALLS. THE APPROXIMATE FAILURE MILEAGE WAS 40000 AND THE CURRENT MILEAGE WAS 41000.",
        "vin": "2T1KR32E96C"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/05/2010",
        "dateOfIncident": "03/04/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10316963,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE CODE P2610: ECM / PCM INTERNAL ENGINE OFF TIMER PERFORMANCE  EXPERIENCED ISSUES:  - ABRUPT JERKING TO LEFT DURING ACCELERATION  - HARSH SHIFT OF TRANSMISSION DURING CRUISING SPEED  - INTERMITTENT NON-START CONDITION    ACTION TAKEN: DEALER REPLACED ENGINE CONTROL COMPUTER (PART NO. 89661-02K41). *TR",
        "vin": "2T1KR32E46C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/05/2010",
        "dateOfIncident": "03/04/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10317195,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS STOPPED AT A BUSY INTERSECTION DURING MORNING RUSH HOUR WHEN MY CAR STALLED. I TRIED UNSUCCESSFULLY SEVERAL TIMES TO RESTART THE ENGINE. AFTER ALLOWING IT TO SIT FOR SEVERAL MINUTES, THE CAR FINALLY RESTARTED. I MOVED THE CAR INTO A PARKING LOT AND ALLOWED IT TO SIT, IDLING, FOR SEVERAL MINUTES. WHEN I PUT THE CAR BACK INTO DRIVE, IT LURCHED FORWARD. DESPITE PRESSING ON THE GAS, IT WOULD NOT ACCELERATE PAST 10 MPH. I HAD THE CAR TOWED TO THE DEALERSHIP, WHERE THEY SAID THE ENGINE CONTROL MODULE HAD FAILED. IT WAS UNDER WARRANTY BUT, HAD IT NOT BEEN, WOULD HAVE COST ME $900. I PURCHASED THIS CAR NEW IN 2006, AND IT HAS BEEN SERVICED REGULARLY. *TR",
        "vin": "2T1KR32E26C"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/25/2010",
        "dateOfIncident": "01/15/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10314121,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2006 TOYOTA MATRIX AND  THE VEHICLE STARTED JERKING WHEN IT SHIFTED OUT OF 1ST GEAR.  IT JERKED SO HARD THAT I HAD TO BE CAREFUL TO NOT LOSE CONTROL OF THE VEHICLE.  ALSO THE VEHICLE WOULD STALL WHEN I WOULD BE IN HEAVY TRAFFIC.  THE SHIFTING ISSUE OCCURRED EVERY TIME I DROVE IT AFTER THE PROBLEM STARTED.  THE STALLING ISSUE OCCURRED AROUND 5-6 TIMES WHEN I WAS DRIVING.  I RECENTLY TOOK IT INTO THE DEALERSHIP AND THEY REPLACED THE ECM FOR A COST OF OVER $700 SINCE I WAS OUT OF FACTORY WARRANTY.  SO FAR, THE PROBLEM HAS BEEN CORRECTED HOWEVER, I NOTICED A SERVICE BULLETIN IN 2007 WHICH I BELIEVE TOYOTA SHOULD HAVE INFORMED CUSTOMER'S.  THIS WAS VERY SCARY WHEN IT OCCURRED AND LUCKILY I DIDN'T END UP IN AN ACCIDENT. *TR",
        "vin": "2T1KR32E96C"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/24/2010",
        "dateOfIncident": "02/01/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10313700,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6)    HELLO  I AM THE PROUD OWNER OF A 2006 TOYOTA MATRIX. IN LATE 2007 WHILE DRIVING THE CAR WOULD SHUT OFF. I HAD IT TOWED TO SUN TOYOTA (NEW PORT RICHEY FL) IN WHICH THEY STATED THIS MODEL CAR HAS A FAULTY ENGINE SECURITY DEVICE WHICH CAUSES THE CAR TO SHUT OFF. THEY REPLACED THE COMPUTER AND ASSURED ME THERE WERE NO OTHER PROBLEMS. IN EARLY 2008 I STARTED NOTICING WHEN I WOULD TURN IT WOULD FEEL AS IF I LOST TOTAL CONTROL OF THE STEERING, THEN SUDDENLY I COULD STRAIGHTEN THE WHEEL AGAIN. FOR MONTHS THERE WAS NOTHING TOYOTA WOULD DO. JUST LAST WEEK I STARTED SEEING REPORTS OF OTHER MATRIX/CORROLA OWNERS EXPERIENCING THE SAME INCIDENT. YESTERDAY I CONTACTED SUN TOYOTA TO SEE IF THEY WILL FINALLY CHECK MY CAR OUT AND TO SEE IF IT HAD ANYTHING TO DO WITH THE PAST COMPUTER/ENGINE ISSUE. TOYOTA INFORMS ME THEY HAVE NO RECORD OF MY EVER BEING THERE OR THE PART BEING REPLACED. LUCKILY I SAVED MY RECIEPT WHICH PROVES I WAS. MY TWO COMPAINTS ARE THAT THEY REFUSE TO AKNOWLEDGE THE STEERING PROBLEM OR LOOK AT IT AND THEY HAVE MISPLACED MY PREVIOUS RECORDS? I FIND IT HARD TO BELEIVE AND QUITE CONVENIENT ON THEIR PART. WHAT CAN I DO? I'VE EVEN FILED A COMPLAINT AT TOYOTA CORP OFFICE ONLY TO BE BRUSHED OFF. I FEEL I'M STUCK WITH AN UNSAFE PIECE OF JUNK THAT I PAID 16K FOR AND TOYOTA WILL NOT HELP ME. PLEASE HELP!!!!    [XXX] *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/23/2010",
        "dateOfIncident": "02/21/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10312973,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR QUIT RUNNING IN TRAFFIC WITH NO WARNING. I HAD IT TOWED  TO THE DEALER AND THEY REPLACED THE ECM COMPUTER. *TR",
        "vin": "2T1KR32E76C"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "02/15/2010",
        "dateOfIncident": "01/16/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10310701,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR IS A TOYOTA 2006 MATRIX AWD;  I WAS PULLING INTO MY DRIVEWAY TO PARK IN FRONT OF MY GARAGE, AND TOOK MY FEET OF THE ACCELERATOR PEDAL, BUT BEFORE I HAD ANY CHANCE TO REACT THE CAR JUST CONTINUED TO ACCELERATE UP MY DRIVE WAY AND CRASHED THROUGH MY GARAGE DOOR, CAUSING DAMAGE TO MY CAR, THE GARAGE DOOR, AND SOME DENTS TO MY OTHER CAR PARKED INSIDE;     I HAVE ALWAYS PARKED MY CAR OUTSIDE ON THE DRIVE WAY, SINCE THERE ISN'T SPACE TO PARK 2 CARS IN MY GARAGE;  I AM FAIRLY SAFE AND CAUTIOUS DRIVER;   I TOOK MY CAR TO THE DEALER TO HAVE THEM TO TAKE A LOOK, MY 2006 TOYOTA MATRIX IS NOT IN THE RECALL LIST, AND THE SERVICING GUYS DIDN'T FIND ANYTHING WRONG WITH MY GAS PEDAL;  I AM STILL CONCERNED THAT THERE MAY STILL BE A LURKING ISSUE WITH THE PEDAL OR THE ELECTRONIC SYSTEM THAT CAUSED THE UNINTENDED ACCELERATION. *TR",
        "vin": "2T1LR30EX6C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/14/2010",
        "dateOfIncident": "12/15/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10310332,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 25 MPH THE ENGINE DIED. POWER BRAKES AND STEERING FAILED SO STOPPING WAS DIFFICULT.  THE ENGINE REFUSED TO START FOR ABOUT FIVE MINUTES.  TOYOTA REPLACED THE ELECTRONIC COMPUTER UNIT AT NO COST TO ME THE NEXT DAY. *TR",
        "vin": "2T1KR32E86C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/10/2010",
        "dateOfIncident": "08/27/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10308581,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ECU ON MY 2006 TOYOTA  MATRIX DIED SUDDENLY,  AFTER THE ECU FAILED THE CAR TO HALT IMMEDIATELY. LUCKILY FOR ME THIS DID NOT HAPPEN ON A FREEWAY , IN WHICH CASE I WOULD HAVE BEEN REAR ENDED AND POSSIBLY SERIOUSLY INJURED.   WHEN MY CAR WAS TOWED INTO THE DEALERSHIP , THE TECH AT THE SERVICE DESK GUESSED THAT IT WAS THE ECU AS HE HAD SEEN QUITE A FEW OF THESE FAIL. AFTER TESTS THEY DETERMINED IT WAS THE ECU. THE ECU WAS REPLACED BY THE DEALER AS IT WAS UNDER WARRANTY. *TR",
        "vin": "2T1KR32E66C"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES, ELECTRIC",
        "crash": false,
        "dateComplaintFiled": "02/09/2010",
        "dateOfIncident": "02/09/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10307916,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY 2006 TOYOTA MATRIX I PURCHASED ONE MONTH AGO.  I WAS DRIVING ON A VERY WET ROAD LESS THAN 20-25 MPH. APPROXIMATELY 9:00A.M. COMING HOME FROM LOCAL GYM.  I SLOWED TO STOP FOR CONSTRUCTION WORK ON SLICK TWO LANE ROAD.  BRAKES DID NOT GRAB AS I TRIED TO SLOW DOWN.  I PUSHED BRAKES DOWN HARDER, AND AS THEY STARTED TO WORK, THE ACCELERATOR BEGAN TO ACCELERATE ON ITS OWN, CAR BEGAN TO FEEL LIKE IT WAS REVVING UP.  I PUT CAR IMMEDIATELY IN PARK, AND TIRES BURNED RUBBER (ENOUGH TO SMELL) AND CAR STOPPED COMPLETELY.  IT ALL HAPPENED INCREDIBLY FAST, AND SCARED ME TO DEATH.  I HAVE NOT HAD THIS PROBLEM PREVIOUSLY (I HAVE OWNED VEHICLE FOR 1 MONTH) AND CAR IS NOT ON RECALL LIST (CLEARLY SHOULD BE).  I HAVE CALLED TOYOTA CUSTOMER SERVICE CENTER, AND WILL CALL DEALER WHERE I PURCHASED CAR NEXT. *TR",
        "vin": "2T1KR30E66C"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "02/06/2010",
        "dateOfIncident": "11/18/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10306896,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS PARKING OUR TOYOTA MATRIX, 2006 AND IT \"JUMPED\" AHEAD AND I HIT THE CAR IN FRONT OF ME.  MY ACCIDENT REPORT INDICATED A JUMP IN THE CAR.  WHEN I READ ABOUT THE TOYOTA ACCELERATOR PROBLEMS, I AM CONVINCED OUR CAR SUFFERS THE SAME FLAW AND I HOPE THAT 2006 WILL BE INCLUDED IN THE RECALL. I HAVE NEVER HAD ANY OTHER ACCIDENT AND I AM OVER 50 YEARS OLD.  *CN",
        "vin": "2T1LR32E36C"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/03/2010",
        "dateOfIncident": "11/18/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10304631,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "NOVEMBER 18 MY 2006 TOYOTA MATRIX BEGAN TO ACCELERATE UNCONTROLLABLY AFTER FILLING UP TANK WITH FUEL.  I PULLED THE VEHICLE TO THE SIDE OF THE ROAD TURNED OFF THE ENGINE.  THE ENGINE THEN WOULD NOT START SO IT WAS TOWED TO WINDSOR TOYOTA DEALERSHIP.  TEST DROVE & CHECK FOR WATER IN TANK ELIMATED CODE P0171 AND GAVE ME FREE INJECTOR CLEANER.  SHOULD THE DEALER CHECK GAS PEDAL RECALL ON HIS 2006. *TR",
        "vin": "2T1KR32E26C"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/01/2010",
        "dateOfIncident": "03/01/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10303735,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 TOYOTA MATRIX HATCH BACK. HE STATED THAT WHILE APPROACHING A STOP LIGHT AT SPEEDS OF LESS THAN 20 MPH, HE DEPRESSED THE BRAKE PEDAL BUT THE VEHICLE WOULD NOT STOP OR SLOW DOWN. THE CONTACT SHIFTED THE VEHICLE INTO A LOWER GEAR AND THEN TO NEUTRAL. HE THEN SHUT OFF THE IGNITION AND BRAKED TO A STOP. THE DEALER WAS CONTACTED AND PERFORMED A SAFETY TEST ON THE VEHICLE. THE FAILURE COULD NOT BE DUPLICATED. NO REPAIRS WERE MADE TO THE VEHICLE TO DATE. THE FAILURE AND CURRENT MILEAGES WERE UNDER 20,000.  UDDATED 03/09/10. *LJ  THE CONSUMER STATED WHEN HE APPLIED THE BRAKE PEDAL, THE VEHICLE CONTINUED TO ACCELERATE. HE SHIFTED TO A LOWER GEAR THEN TO NEUTRAL WHILE CONTINUING TO APPLY THE BRAKE. THE VEHICLE CONTINUED TO ACCELERATE UNTIL HE PUMPED THE BRAKES TO STOP. UPDATED 06/11/10 *JB",
        "vin": "2T1KR32E56C"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/06/2010",
        "dateOfIncident": "01/05/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10298443,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2006 TOYOTA MATRIX XRS 6 SPEED MANUAL TRANSMISSION.  I PURCHASED THE CAR NEW AND HAVE SERVICED THE CAR WITH THE DEALERSHIP FROM DAY ONE.  TODAY I BROUGHT IT IN FOR ITS 45000 MILE SERVICE AND TOLD THEM TO CHECK THE CLUTCH BECAUSE WE NOTICED IT STICKING/SLIPPING IN 5TH GEAR.  TURNS OUT I NEED TO REPLACE THE CLUTCH AT A COST OF $1200 EVEN THOUGH I HAVE THEIR PLATINUM SERVICE/EXTENDED WARRANTY PLAN.  I HAVEN'T EVEN WORN OUT THE BRAKES AND I HAVE TO REPLACE THE CLUTCH!!!!  I AM A 46 YEAR OLD MOTHER AND HAVE DRIVEN SEVERAL CARS WITH A MANUAL TRANSMISSION AND NEVER HAD TO REPLACE A CLUTCH WITH SUCH LOW MILEAGE.  I READ ON EDMUNDS CAR SPACE ABOUT THIS AND IT SAID TO COME TO YOUR WEBSITE TO DOCUMENT THIS. *TR",
        "vin": "2T1KY30E16C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/04/2010",
        "dateOfIncident": "01/01/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10297994,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING TO WORK AND THE CHECK ENGINE LIGHT WENT ON. I PRESSED THE GAS PEDAL BUT THERE WAS NO ACCELERATION. THE ENGINE STARTED TO STALL OUT. I SLOWLY PULLED OVER, PUT THE CAR IN PARK, PUT THE KEY ON THE OFF POSITION AND I TRIED TO START THE VEHICLE AGAIN AND NOTICED THAT THE BATTERY WAS WORKING BUT IT WOULD NOT START. I DID THIS PROCESS FIVE MORE TIMES TO NO SUCCESS. I FINALLY CALLED AAA AND WAS TOWED HOME. THE NEXT DAY, MUCH TO MY SURPRISE, THE VEHICLE STARTED RIGHT UP BUT THE CHECK ENGINE LIGHT WAS STILL ON. SO, I BROUGHT IT TO THE TOYOTA DEALERSHIP TO HAVE IT CHECKED. THEY ENDED UP REPLACING THE ENGINE CONTROL COMPUTER. *TR",
        "vin": "2T1KR32E26C"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/29/2009",
        "dateOfIncident": "12/28/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10297451,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 12/28/09, AS I STARTED TO BRAKE FOR A RED LIGHT, MY CAR UNINTENTIONALLY ACCELERATED WHILE I HAD MY FOOT ON THE BRAKE PEDAL. I WAS ABLE TO SLOW DOWN BY BRAKING HARD, BUT THE BRAKES STARTED TO SMOKE.  I TURNED THE IGNITION KEY TO OFF, AND WHEN I TURNED IT ON AGAIN THE PROBLEM WENT AWAY. NOTHING WAS HOLDING DOWN OR INTERFERING WITH THE GAS PEDAL AS THIS PROBLEM OCCURRED?NOT THE FLOOR MAT, NOT ANY CLOTHING OR PART OF MY SHOE. I AM AN EXPERIENCED DRIVER WHO HAS NEVER HAD AN ACCIDENT. MY CAR RECEIVED MAJOR SCHEDULED MAINTENANCE FROM A TOYOTA DEALERS SERVICE DEPARTMENT JUST ABOUT A WEEK BEFORE THIS INCIDENT. I BROUGHT IT BACK TO THE DEALER ON 12/29; THE MECHANIC SAID HE COULD FIND NOTHING WRONG WITH THE CAR AND COULD NOT DUPLICATE THE FAILURE. *TR",
        "vin": "2T1KR32E16C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/08/2009",
        "dateOfIncident": "12/01/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10294862,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "NORMALLY SITTING AT STOP LIGHT, WHEN ENGINE LIGHT CAME ON.  CAR IMMEDIATELY STARTED SHIFTING VERY HARD.  THE IDLE SPEED WAS ERRATIC.  ENGINE WANTED TOO AND DID CUT OFF AT VARIOUS TIMES.  TOOK CAR TO ROSNER TOYOTA/STAFFORD VA AND WAS TOPD THAT THE ECU WAS DEFECTIVE AND THAT ROSNER HAD BEEN NOTIFIED OF A DEFECT CODE THAT WAS PREVALENT IN THE COROLLA AND MATRIX MODELS.  ASKED ABOUT A TOYOTA RECALL AND WAS INFORMED THAT THERE WAS NOT ONE AT THIS TIME OR IN THE FORESEEABLE FUTURE.  THIS PART/ECU IS VERY EXPENSIVE AND INTEGRAL TO THE CAR'S PERFORMANCE. *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/03/2009",
        "dateOfIncident": "10/24/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10290794,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THREE SEPARATE OCCASIONS OUR 2006 TOYOTA MATRIX HAS ACCELERATED ON ITS OWN WITHOUT WARNING. ON ALL THREE OCCASIONS WE HAVE BEEN ABLE TO SLIP THE TRANSMISSION OUT OF DRIVE INTO NEUTRAL OR SLAM THE BRAKES ON TO STOP THE ACCELERATION. THE MOST RECENT TIME THIS OCCURRED WAS LAST WEEKEND. THE MOST PREVIOUS WAS THREE MONTHS AGO. *TR",
        "vin": "2T1LR30E56C"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/21/2009",
        "dateOfIncident": "10/01/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10289276,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "BEARING GOING IN 2006 TOYOTA MATRIX 5 SPEED MANUAL TRANSMISSION. *TR",
        "vin": "2T1KR32E26C"
    },
    {
        "components": "STRUCTURE,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "08/01/2009",
        "dateOfIncident": "05/22/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10279063,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "AUTOMATIC EQUIP. MFG. CO.",
                "productMake": "UNKNOWN",
                "productModel": "AUTOMATIC",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "MY 2006 TOYOTA MATRIX HAS DEVELOPED EXTREME CUPPING OF THE TIRES AT 21, 000 MILES DESPITE REGULAR ROTATIONS AT 5,000, 10,186, AND 14,722 MILES. I HAD BEGUN TO NOTICE A CHANGE IN THE SOUND OF THE TIRES AT 21,500 MILES. MY MECHANIC REFUSED TO ROTATE THE TIRES AT 21,981 MILES SAYING SOMETHING WAS WRONG WITH THE STRUTS THUS CAUSING EXTREME WEAR ON THE TIRES. I WENT TO THE LAS CRUCES TOYOTA  IN NEW MEXICO WHERE I PURCHASED THE CAR BUT THEY SAID NOTHING WAS WRONG AND REFUSED TO REPLACE STRUTS OR PROVIDE NEW TIRES. MANY COMPLAINTS ABOUT THIS PROBLEM RELATED TO THE TOYOTA MATRIX HAS BEEN POSTED ON THE CONSUMER REVIEW SITE FOR EDMUNDS.COM. TOYOTA REFUSES TO ADDRESS THE PROBLEM.  *TR",
        "vin": "2T1KR32E46C"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/23/2009",
        "dateOfIncident": "05/05/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10274713,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 TOYOTA MATRIX.  WHILE PULLING OUT OF A PARKING LOT AT AN UNKNOWN SPEED, THE BRAKES FAILED AND THE VEHICLE WOULD NOT STOP.  THE CONTACT APPLIED THE EMERGENCY BRAKE TO AVOID A NEAR CRASH.  THE VEHICLE WAS TOWED TO THE DEALER AND THEY STATED THAT THE CONTACT WAS AT FAULT.  THE REPAIR COST MORE THAN $600.   THE CURRENT MILEAGE WAS 21,000 AND THE FAILURE MILEAGE WAS UNKNOWN.  UPDATED 07/28/09.  *LJ  UPDATED 07/30/09.*JB",
        "vin": "2T1KR32E26C"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/23/2009",
        "dateOfIncident": "06/22/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10274742,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "1. DRIVING DOWN ROAD AT 35MPH ON A CLEAR SUNNY DAY.  2. 2006 TOYOTA MATRIX JERKED UNCONTROLLABLY TO THE SIDE AS IF THE STEERING WHEEL WAS TURNED EVEN THOUGH IT WAS HELD STRAIGHT FOR NORMAL DRIVING. THIS RESULTED IN LOSING CONTROL OF THE CAR AND NEARLY CAUSING AN ACCIDENT WITH OUR INFANT IN THE BACKSEAT.   3. TOWED TO MAINTENANCE CENTER AND THEY MENTIONED THEY HAD SEEN THIS PROBLEM SEVERAL TIMES BEFORE. THEY TOLD US OF A STEERING TECHNICAL SERVICE BULLETIN ST005-01 THAT MENTIONED THIS PROBLEM. WE HAVE NOW TOWED IT TO THE DEALER AND ARE WAITING FINAL RESOLUTION. *TR",
        "vin": "2T1KR32E26C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/23/2009",
        "dateOfIncident": "02/03/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10266454,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "46,686 MILES AND THE INTAKE MANIFOLD GASKET NEEDED TO BE REPLACES AS IT WAS A DEFECTIVE GASKET- HARD WITH BUBBLES- I HAVE THE GASKET.  WHEN I CALLED TOYOTA I WAS INFORMED THAT IT WAS AN ISSUE WITH THIS MAKE/MODEL, BUT TOYOTA WOULDN'T REIMBURSE COSTS OF REPLACING THE DEFECTIVE PART. *TR",
        "vin": "2T1KR32E96C"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "04/01/2009",
        "dateOfIncident": "04/01/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10263895,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ABNORMAL TIRE WEAR ON 2006 TOYOTA MATRIX.  LESS THAN 45,000 MILES ON THE CAR AND WE HAVE GONE THROUGH TWO SETS OF LONG LIFE TIRES.  WE HAVE MAINTAINED THE VEHICLE AND TIRES PROPERLY.  THIS SEEMS TO BE A VERY COMMON PROBLEM BUT TOYOTA SAYS THERE IS NOTHING WRONG.  SEE HERE FOR MORE:  HTTP://TOWNHALL-TALK.EDMUNDS.COM/DIRECT/VIEW/.F0EEECE/154. *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION,POWER TRAIN,TIRES",
        "crash": false,
        "dateComplaintFiled": "03/28/2009",
        "dateOfIncident": "03/25/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10263348,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED CERTIFIED PRE OWNED - (LEASED) 2006 MATRIX  27940 MILES 7/26/08 - ON 11/12/08   32955 MILES AFTER OIL CHANGE DEALER WROTE : \"TIRES ARE WEARING FUNNY - ALIGNED AT N/C DID NOT ROTATE RHT REAR CUPPING - 3/25/09 OIL CHANGE 38632 - DEALER WROTE - ROTATE TIRES IF NEEDED - LAST TIME IN HAD TIRE WEAR ISSUE NEEDS TIRES HAS 1 GOOD TIRE ON CAR ON LF.  APPARENTLY THIS IS A PROBLEM WITH TOYOTA - HAVEN'T CONTACTED DEALER YET BUT WILL AFTER READING COMPLAINTS. I DON'T KNOW IF THE AFTER MARKET SHIM FIX WILL VOID MY EXTENDED WARRANTY OR NOT...... *TR",
        "vin": "2T1KR32E76C"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/20/2009",
        "dateOfIncident": "10/15/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10262542,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "FAULTY CAMBERING OF WHEELS ON TOYOTA MATRIX 2006 (XRS FWD). IT CAUSES UNEVEN AND PREMATURE WEAR OF TIRES. AT 12000 MILES TIRES BECAME NOISY WITH ALMOST NO THREAD ON THE EDGES. *TR",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "01/24/2009",
        "dateOfIncident": "01/22/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10256168,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "CONTINENTAL",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "MY TIRES WORN UNEVENLY AND CUPPED AFTER 25000 MILES ON MY BRAND NEW 06 TOYOTA MATRIX. MY DEALERSHIP TOLD ME IT WAS BECAUSE OF ROTATION. BUT WHEN I CHECKED ONLINE, I SAW THAT MANY PEOPLE HAVE THE SAME PROBLEMS WITH THE SAME CAR.   I HAD TO CHANGE MY TIRES AND DO AN ALIGNMENT.     TOYOTA HAS TO RECALL, FIX AND REIMBURSE THOSE TIRES. *TR",
        "vin": "2T1KR32E26C"
    },
    {
        "components": "SUSPENSION,TIRES",
        "crash": false,
        "dateComplaintFiled": "12/30/2008",
        "dateOfIncident": "12/27/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10253163,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "YOKOHAMA RUBBER CO. LTD.",
                "productMake": "YOKOHAMA",
                "productModel": "ALL SEASON RADIAL",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "2006 TOYOTA MATRIX.  TIRES WEAR OUT EVERY 16,000 MILES.  THE PROBLEM IS IN THE REAR AXLE.  TOYOTA HAS CONSISTENTLY TOLD ME THERE IS NO PROBLEM.  TODAY I AM ON A DISCUSSION BOARD AND FIND IT IS A COMMON PROBLEM FOR THE MATRIX/VIBE. THE SOLUTION IS AN AFTERMARKET REAR WHEEL SHIM KIT COSTING $50 PLUS LABOR.  WHY IS TOYOTA ALLOWED TO CONTINUE DENYING THE PROBLEM EXISTS AND NOT RECALL AND CORRECT THE PROBLEM. *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/26/2008",
        "dateOfIncident": "12/26/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10252867,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE AND I OWN 2 TOYOTA MATRIX'S.  A 2005 AND A 2006.  BOTH ARE FRONT WHEEL DRIVE.  FOR SOME REASON THE CAR WEARS THROUGH TIRES VERY FAST.  WE CAN ONLY GET 25,000 MILES MAX OUT OF A 60,000 MILE TIRE.  WE MAKE IT A POINT TO ROTATE EVERY 5,000 MILES AND KEEP PRESSURE AT 35PSI AS RECOMMENDED, BUT THE CAR JUST WEARS TIRES SO QUICKLY FOR SOME REASON. *TR",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "12/06/2008",
        "dateOfIncident": "12/06/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10250923,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "HAD A FLAT TIRE, WHEN THEY TOOK MY TIRE OFF, THEY ASKED IF MY VEHICLE HAD BEEN IN AN ACCIDENT, WHICH IT HAS NOT, THE TIRE WAS CUPPING REALLY BAD. THEY ALSO SAID THEY WERE VERY WORN FOR THE AMOUNT OF MILES ON MY VEHICLE. *TR",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/07/2008",
        "dateOfIncident": "09/01/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10244680,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "FIRST AND ONLY OWNER.  EXCESSIVE TIRE WEAR ON ALL 4 TIRES AT ONLY 20,000 MILES.  ALL TIRES HAVE EXCESSIVE WEAR AT THE INSIDE RIM.  I DIDN'T HAVE ANY ACCIDENT AND MY DRIVING WAS NEVER AGGRESSIVE.  THE TIRES HAVE TO REPLACED AT 20,000 MILES.  THE CONCERNS ARE THE NEW TIRES WILL BE GONE IN ABOUT ANOTHER 20,000 MILES.  TOYOTA SHOULD CORRECT THIS PROBLEM WITH THE CAR.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/25/2008",
        "dateOfIncident": "08/25/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10243456,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A NEW 2006 TOYOTA MATRIX XR AWD ON FEB. 2006.  I'M GOING THROUGH A 'WHAT SEEMS TO BE' A COMMON PROBLEM WITH ALL MATRIX'S \"AN AB-NORMAL TIRE WEAR PROBLEM\".  THE WEAR/CHOPPING STARTED AT AROUND 10K... IT CURRENTLY HAS 17K... I'VE ROTATED THE TIRES 3 TIMES ALREADY!!!  THE DEALER IS TELLING ME IT'S A REAR DIFFERENTIAL PROBLEM... THEY'RE REPLACING IT UNDER WARRANTY... NOT SURE IF THIS WILL FIX THE PROBLEM??? THE TIRES ARE ALL CHOPPY AND WORN NOW (AT ONLY 17 MILES) ... THEY MUST BE REPLACED UNDER WARRANTY!! *TR",
        "vin": "2T1LR30E66C"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/20/2008",
        "dateOfIncident": "03/31/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10242991,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DEFECTIVE SHOCKS CAUSED PREMATURE AND UNEVEN TIRE WEAR.  *TR",
        "vin": "2T1KR30E16C"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/02/2008",
        "dateOfIncident": "08/15/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10240607,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE OWNED 2 TOYOTA MATRIX CARS, 2005 & 2006. BOTH VEHS GAVE ME TIRE TROUBLE. PRE-MATURE TIRE WEAR ON THE EDGES IN THE FORM OF SCALLOPING AND FLAT SPOTS. NEW TIRES AND WHEEL ALIGNMENT BY THE CAR & TIRE DEALER DID NOTHING TO IMPROVE THE SITUATION, EVEN AFTER REPEATED ATTENTION TO THE PROBLEM. ROAD NOISE IS ALMOST UNBEARABLE AT TIMES DEPENDING ON SPEED. TOYOTA REJECTS ANY RESPONSIBILITY TO THE SITUATION AND PREFER TO BLAME THE DRIVER, THE TYPE OF DRIVING, ROAD SURFACE, TIRE PRESSURES, TIRE ROTATION FREQUENCY AND TIRE MANUFACTURER. I WON'T BE BUYING ANOTHER MATRIX!! OR FOR THAT MATTER, TOYOTA! *TR",
        "vin": "2T1KR32EX6C"
    },
    {
        "components": "SUSPENSION,TIRES",
        "crash": true,
        "dateComplaintFiled": "08/31/2008",
        "dateOfIncident": "12/16/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10240487,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "EXCESSIVE TIRE WEAR/MISALIGNMENT ON 2006 TOYOTA MATRIX:  I HAVE HAD MY CAR FOR ABOUT 2 AND 1/2 YEARS, ABOUT 35,000 MILES.  I HAVE ALREADY REPLACED THE TIRES THREE TIMES DUE TO EXCESSIVE WEAR, AND HAD SEVERAL FOUR-WHEEL ALIGNMENTS DONE.  I'VE NOTICED ON THE CHAT BOARDS THAT SEVERAL OTHER OWNERS WITH THE SAME CAR TYPE ARE HAVING SIMILAR PROBLEMS.  I SUSPECT THAT THE MISALIGNMENT AND SUBSEQUENT DRIFT WAS ONE OF THE LEADING CAUSES IN AN ACCIDENT I HAD LAST YEAR. *TR",
        "vin": "2T1LR30E96C"
    },
    {
        "components": "SUSPENSION,TIRES",
        "crash": false,
        "dateComplaintFiled": "08/05/2008",
        "dateOfIncident": "05/20/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10237090,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "CONTITOURING",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "AFTER OWNING MY NEW CAR FOR ABOUT A YEAR (AROUND 25,000 MILES), I WAS INFORMED THAT MY TIRES WERE CUPPING AND ALL NEEDED REPLACED.  THIS ISSUE WAS BLAMED ON ALIGNMENT ISSUES.  I HAD THE ALIGNMENT FIXED AND TIRES REPLACED.  I HAD READ DISCUSSION BOARDS OF OTHER MATRIX OWNERS, MANY OF WHOM HAD SIMILAR TIRE/ALIGNMENT COMPLAINTS.  A WORKER AT THE CAR DEALERSHIP SUGGESTED THIS HAS BEEN A COMMON ISSUE WITH THE MATRIX.  I COMPLAINED TO TOYOTA, WHO BLAMED BOTH MY DRIVING AND DRIVING CONDITIONS (I DON'T DRIVE RECKLESSLY--TYPICALLY ALL MY DRIVING IS HIGHWAY), AS WELL AS THE TIRE MANUFACTURER (BUT MY WARRANTY HAD ALREADY RUN-OUT).    I'VE BEEN GETTING MY TIRES ROTATED ON A REGULAR BASIS, BUT ABOUT A YEAR AFTER THE AFOREMENTIONED REPAIRS (MAY 2008), THE TECH ROTATING MY TIRES NOTED ONE OF MY TIRES WAS CUPPING AND TO HAVE MY REAR ALIGNMENT CHECKED.  AGAIN, MY ALIGNMENT WAS OFF AND THE CAR HAD TO BE RE-ALIGNED.  NOW, TWO MONTHS LATER, I AM AGAIN HAVING POSSIBLE ALIGNMENT ISSUES (WILL BE CHECKED THIS WEEK).  I THINK THE TOYOTA MATRIX HAS A SERIOUS DESIGN FLAW CONSIDERING SO MANY PEOPLE HAVE BEEN HAVING ALIGNMENT/TIRE ISSUES WITH THEIR CARS.  *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/25/2008",
        "dateOfIncident": "07/17/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10235821,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE ABOUT 15500 MILES ON A 2006 TOYOTA MATRIX THAT HAS ABNORMAL TIRE WEAR. THE HEAD SERVICE MECHANIC EXPLAINED TO ME THAT MY CAR HAD TO LIGHT OF A REAR END AND THAT THE TIRES BOUNCE AROUND AND CREATE ABNORMAL WEAR. HE STATED THAT IT WOULD ONLY MAKE IT WORSE TO ROTATE THEM TO THE FRONT. I HAVE VIBRATION AND TWO RUINED TIRES. TOYOTA ANSWERS THAT IT IS A TIRE ISSUE AND TO TAKE IT UP WITH THE MANUFACTURER. THE MANUFACTURER STATES THEY ARE NOT RESPONSIBLE FOR TIRE WEAR. EVERY TIRE INSTALLER AND MECHANIC KNOW ABOUT THE FLAW IN THESE CARS BUT TOYOTA DOES NOT TAKE RESPONSIBILITY FOR THIS DESIGN ERROR.  *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/03/2008",
        "dateOfIncident": "07/14/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10233098,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "EXCESSIVE TIRE WEAR DUE TO DESIGN FLAW/WORKMANSHIP OF THE MANUFACTURER.  THE REAR END ALIGNMENT IS NOT ADJUSTABLE, AND WAS WAY OFF FROM THE FACTORY.  HAD TOP REPLACE THE TIRES AT 15K MILES DUE TO CUPPING CAUSED BY CAMBER/TOE IN WAY OUT OF SPEC.  TOYOTA SAID THAT TIRE ALIGNMENT WAS WELL WITHIN DESIGN SPECS.  DROVE FOR 15K MILES ON SECOND SET, WAS TOLD BY TIRE SPECIALIST THAT 2ND SET OF TIRES (NOT SAME AS ORIGINAL) WAS ALSO CUPPING, AND THAT THE PROBLEM WAS DEFINITELY IN THE ALIGNMENT OF THE REAR END.  HAD TO THREATEN TOYOTA WITH A LAWSUIT BEFORE THEY ADMITTED THERE WAS A PROBLEM. THEY ADDED SHIMS TO CAR (I HAD TO PAY FOR PARTS), BUT FLAT OUT REFUSED TO RE-IMBURSE FOR RUINED TIRES.  *TR",
        "vin": "2T1KR32E06C"
    },
    {
        "components": "SUSPENSION,TIRES",
        "crash": false,
        "dateComplaintFiled": "07/02/2008",
        "dateOfIncident": "11/13/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10232992,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2006 TOYOTA MATRIX MY TIRES ARE WEARING IMPROPER. THE TIRES ARE CUPPING, AT 3,000 TO 5,000 MILES. AFTER RESEARCHING I FOUND THAT EVERY MATRIX, PONTIAC VIB AND COROLLA OWNER IS HAVING THE SAME PROBLEM AND IT IS A MANUFACTURER DEFECT.  ALL OWNERS ARE HAVING THIS PROBLEM. A SOLUTION FOR THIS PROBLEM HAS BEEN FOUND BUT THE TOYOTA DOES NOT WANT TO CORRECT THE PROBLEM.  *TR",
        "vin": "2T1KR32E96C"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/02/2008",
        "dateOfIncident": "11/08/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10233004,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2006 TOYOTA MATRIX XR.  DURING ROUTINE MAINTENANCE AT THE DEALER THE CAR HAD ABOUT 7500 MILES.  I WAS TOLD THAT THERE WAS UNUSUAL TIRE WEAR, CUPPING, ON THE TIRES AND THEY SHOULD PROBABLY BE REPLACED AT MY NEXT MAINTENANCE.  THESE TIRES WERE RATED FOR APPROXIMATELY 30,000 MILES.  THE MANAGER AT THE TOYOTA REPAIR SHOP SAID THIS WAS SOMETHING HE HAD NOTICED WITH MATRIX TIRES.  BECAUSE I HAD DONE ALL OF THE CORRECT MAINTENANCE CHECKS INCLUDING TIRE ROTATION THE REPAIR SHOP SAID IT WAS NOTHING THAT I HAD DONE.  AT THE NEXT SCHEDULED MAINTENANCE I HAD THE TIRES REPLACED WITH A DIFFERENT BRAND OF TIRES (JUST IN CASE IT WAS A TIRE PROBLEM).  TOYOTA AGREED TO PAY FOR 1/2 OF THE TIRE COST BECAUSE MANY MATRIX OWNERS WERE HAVING THE SAME PROBLEM.  I WAS RESPONSIBLE FOR THE COST OF INSTALLATION AND BALANCING BUT WHEN I COMPLAINED ABOUT THESE FEES WAS GIVEN A DISCOUNT.   IT WAS SUGGESTED THAT I FILE A REPORT WITH TOYOTA ABOUT THE PROBLEM WITH THE TIRES.  WHEN I CALLED TO REPORT IT THEY SAID THEY HAD NOTHING ON FILE ABOUT PROBLEMS WITH THE MATRIX AND UNUSUAL TIRE WEAR.  THEY STATED IT WAS PROBABLY A PROBLEM WITH THE ACTUAL TIRES AND THAT I SHOULD CONTACT THE TIRE DEALER.  I FILED A COMPLAINT WITH TOYOTA STATING WHAT WAS TOLD TO ME BY THE MAINTENANCE SHOP BUT WAS TOLD THAT THE REPAIR SHOPS ARE INDEPENDENT AND HAVE NOTHING TO DO WITH TOYOTA.  AFTER APPROXIMATELY 6,000 MILES ON MY NEW TIRES, UNEVEN WEAR IS APPARENT AND THERE IS A LOUD NOISE CREATED BY THE TIRES WHEN I REACH SPEEDS OF ABOUT 35 MPH OR ABOVE.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/02/2008",
        "dateOfIncident": "06/25/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10233029,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "CLUTCH HAD TO BE REPLACED AT 35,557 MILES.  *TR",
        "vin": "2T1KY32E06C"
    },
    {
        "components": "SUSPENSION,TIRES",
        "crash": true,
        "dateComplaintFiled": "05/18/2008",
        "dateOfIncident": "12/13/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10228102,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "CONTINENTAL TOURING LX",
                "productYear": "9999",
                "size": "P205/65R15",
                "type": "Tire"
            }
        ],
        "summary": "OWN A 2006 MATRIX AND HAD ALL 4 TIRES WARE OUT ON INSIDE OF THREAD WITH 21000 MILES ON CAR. DID NOT NOTICE THE PROBLEM TILL CAR WENT OFF ROAD HITTING A TREE. REPAIR SHOP SAID TIRES WERE WORN EXCESSIVELY, AND CAR SHOULDN'T BE DRIVEN. UPON REPAIR, CAR WAS TAKEN TO HAVE FRONT END ALIGNED AND WAS TOLD IT WAS WITHIN TOYOTAS SPECKS, BUT COULD BE CORRECTED TO A TIGHTER STANDARD. CONTACTED TOYOTA AND THEY SAID IT WAS THE TIRES FAULT, WHEN CONTACTED THE TIRE MANUFACTURE(CONTINENTAL) , THEY STATED IT WAS CLEARLY OUT OF ALIGNMENT, AND THEREFORE CAR CAME FROM THE FACTORY LIKE THAT.   *TR",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "04/21/2008",
        "dateOfIncident": "09/15/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10225230,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "DUNLOP TIRE CORPORATION",
                "productMake": "CENTENNIAL TIRES",
                "productModel": "CENTENNIAL",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "ABNORMAL TIRE  WARE ON TOYOTA MATRIX 2007 XR AWD   AROUND 16,000 MI. BAD CUPPING AND NOISE  CONTINENTAL TIRES.  *TR",
        "vin": "2T1LR32E56C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": true,
        "dateComplaintFiled": "04/20/2008",
        "dateOfIncident": "04/10/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10225156,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING THE CAR NORMALLY TO WORK AS I HAVE FOR THE PAST 2 YEARS.  WAS STOPPED AT A STOP SIGN WITH A VEHICLE DIRECTLY IN FRONT.  TOOK MY FOOT OFF THE BRAKE TO ALLOW THE CAR TO ROLL FORWARD AND THE CAR TOOK OFF ABOUT 4-6 FEET INTO THE CAR IN FRONT. THE ONLY SIGN OF A PROBLEM WAS THE RPMS JUMPED SLIGHTLY AS THE CAR TOOK OFF.  TRIED USING THE BRAKE BUT IT COULDN'T HOLD THE CAR.  MINOR DAMAGE TO MY VEHICLE AND NO DAMAGE TO VEHICLE STRUCK.  CALLED THE DEALER, WAS TOLD TO BRING THE CAR IN.  WHEN THEY LOOKED AT THE CAR THEY SAID IT WAS FINE AND I NEEDED NEW ROTORS.  ASKED ABOUT WHY THE CAR JERKED FORWARD, WAS TOLD THERE WAS NOTHING THEY COULD DO ABOUT IT SINCE THEY WERE NOT THERE.  FRUSTRATED, TOOK THE CAR TO BE PRIVATELY INSPECTED ELSEWHERE, AGAIN, COULD NOT FIND ANYTHING WRONG WITH THE CAR.  MECHANIC COULD NOT EXPLAIN WHY THE CAR JERKED FORWARD.  WAS TOLD TO MONITOR CRACKLING NOISE I COMPLAINED ABOUT JUST IN CASE IT BECAME WORSE, AT CURRENT TIME WAS FINE BUT COULD BE EARLY SIGN OF A TIMING CHAIN TENSIONER PROBLEM.  CAR HAS CURRENTLY 39,855K AND HAS HAD 2 NEW BELT TENSIONERS INSTALLED, 1 NEW BELT, AND 1 NEW TIMING CHAIN TENSIONER REPLACED.  HAVE PREVIOUSLY COMPLAINED OF BRAKE PROBLEMS, INCLUDING THE FEELING OF BEING REAR-ENDED AT A LOW SPEED, AS WELL AS THE CAR JERKING FORWARD WHILE DRIVING AT LOW SPEEDS.  THE CAR ALSO ON OCCASION CONTINUES TO GAS ENGINE EVEN AFTER GAS PEDAL HAS BEEN RELEASED, WHEN BRAKE OR GAS IS TAPPED THE CAR RESUMES TO NORMAL OPERATION.  WAS TOLD BY DEALER THAT THEY COULD NOT DUPLICATE PROBLEM AND CAR WAS FINE.  *TR",
        "vin": "2T1LR30E16C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/15/2008",
        "dateOfIncident": "04/15/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10224650,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD CHECK ENGINE LIGHT ON AND COULDN'T GET INSPECTION. DEALER SAID I NEED NEW TRANSMISSION AND HAD REPLACE THE TRANSMISSION WITH THE SAME PROBLEM AND THEY REPLACE ENGINE CONTROL MODULE AGAIN.  *TR",
        "vin": "2T1KR32E66C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/12/2008",
        "dateOfIncident": "06/07/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10224275,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY TOYOTA MATRIX ENGINE STOP RUNNING AND HAD TO REPLACE ENGINE CONTROL MODULE AT 5,393 MILES.  *TR",
        "vin": "2T1KR32E66C"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/12/2008",
        "dateOfIncident": "03/27/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10224293,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD A CHECK ENGINE LIGHT ON SO I WENT TO THE DEALER TO GET IT FIX. THEY TOLD ME I NEED A NEW TRANSMISSION.  *TR",
        "vin": "2T1KR32E66C"
    },
    {
        "components": "TIRES,WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/07/2008",
        "dateOfIncident": "03/27/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10223645,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WEARS THE INSIDE TREAD OF THE TIRE PREMATURELY (10% LEFT AFTER ONLY 16,000 MILES), REVEALED DURING THE SAFETY INSPECTION. THE WHEEL ALIGNMENT IS WITHIN THE MANUFACTURER'S SPECIFICATION AND THE TIRES WERE ROTATED EVERY 3,000-5,000 MILES.  *TR",
        "vin": "2T1KR32E96C"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/07/2008",
        "dateOfIncident": "01/04/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10214142,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS THE SECOND TIME THE ENGINE CONTROL UNIT FAILED AND BEEN REPLACED ON THE 2006 TOYOTA MATRIX. THE CAR HAD JUST RECEIVED A VERY THOROUGH 30,000 MILE CHECKUP AND THERE WERE NO CAUSES FOR THE FAILURE. THIS FAILURE IS EXTREMELY DANGEROUS AND IT ALMOST COST ME MY LIFE. THE ECU SPONTANEOUSLY QUIT WHILE IN THE HIGH SPEED LANE, AT 6:30 PM PITCH DARK, IN HEAVY COMMUTER TRAFFIC IN THE BOSTON BELTLINE OF RT 128. THE BRAKES WERE AS HARD AS CONCRETE, AND THE CAR DECELERATED SO FAST THAT I COULD NOT CHANGE LANES AND I WAS LEFT WITH AN ELECTRONICALLY DEAD CAR IN THE HIGH SPEED LANE - AT NIGHT. I CALLED THE STATE POLICE.  *TR",
        "vin": "2T1KR32E26C"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "01/04/2008",
        "dateOfIncident": "10/15/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10213735,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 TOYOTA MATRIX, CURRENTLY HAS 21000 MILES ON IT.  ALL 4 TIRES ARE BALD ON THE INSIDE TREAD, OUTSIDE STILL HAS 75% LEFT.  I ROTATE THESE TIRES EVERY 4000 MILES AND THE ALIGNMENT IS WITHIN SPECS. THE NOISE STARTED AT ABOUT 17,000 MILES & KEEPS GETTING LOUDER.  NOW I AM FACED TO BUY NEW TIRES ON A CAR THAT IS NOT THAT OLD.  *CN",
        "vin": "2T1KR30E76C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/17/2007",
        "dateOfIncident": "12/10/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10212073,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STALLED  WHILE DRIVING. AFTER RESTARTING, VEHICLE WOULD ONLY RUN IN LOW SPEED, AND STALL AGAIN. VEHICLE TOWED TO DEALERSHIP.   SERVICE CENTER REPLACED ENGINE COMPUTER AND THROTT BODY ASSEMBLY.  *TR",
        "vin": "2T1KR32E86C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/03/2007",
        "dateOfIncident": "11/27/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10210674,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 TOYOTA MATRIX.  WHILE DRIVING 30 MPH, THE CHECK ENGINE LIGHT ILLUMINATED AND THE VEHICLE LOST POWER.  THE ENGINE WOULD NOT GO ABOVE 1,500 RPM.  THE CONTACT PULLED OFF THE ROAD AND, APPROXIMATELY THIRTY SECONDS LATER, THE VEHICLE SHUT OFF AND WOULD NOT RESTART.  THE VEHICLE WAS TOWED TO THE DEALER AND THEY STATED THAT THE ECU WAS DEFECTIVE AND WOULD HAVE TO BE REPLACED.  THE CURRENT MILEAGE WAS 37,687 AND FAILURE MILEAGE WAS 37,680.",
        "vin": "2T1KR32EX6C"
    },
    {
        "components": "SUSPENSION,TIRES",
        "crash": false,
        "dateComplaintFiled": "11/14/2007",
        "dateOfIncident": "11/13/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10208925,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS TAKEN TO DEALER FOR SERVICE TO INVESTIGATE A LOUD VIBRATION NOISE COMING  FROM THE TIRES AS LONG AS VEHICLE WAS ROLLING.  THE CAR HAS ABOUT 18,000 MILES ON IT. ALL FOUR TIRES WERE SEVERELY CUPPED. THE DEALER CONTACTED THE FACTORY REFERENCE THE TIRES AND THE FACTORY RECOMMENDED THE TIRES BE REPLACED.  ALL FOUR TIRES WERE REPLACED AND WERE ALIGNED TO SPEC.  UPON LEAVING THE DEALER SERVICE CENTER A NEW TIRE NOISE WAS NOTICED.  IT WAS NOT THE SAME VIBRATION NOISE BUT A LOUD ROAR AS LONG AS THE TIRES WERE ROLLING.  *TR",
        "vin": "2T1LR32E66C"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "11/02/2007",
        "dateOfIncident": "07/30/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10207714,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL TIRE NORTH AM",
                "productModel": "CONTIPROCONTACT",
                "productYear": "9999",
                "size": "P215/60R16",
                "type": "Tire"
            }
        ],
        "summary": "2006 TOYOTA MATRIX WITH ALLOY WHEELS AND CONTINENTAL TIRES :  AT 5,000 MI ROTATION THE STEERING WHEEL WOULD MOVE BACK AND FORTH A BIT, SHIMMY. AT 10,000 MI ROTATION SHIMMY WAS WORSE AND NOISE WAS NOTICED. AT 14,000 MI DEALER SERVICE SAID THAT NOISE WAS DUE TO SEVERE CUPPING AND ALL TIRES NEEDED REPLACED BUT THAT CONTINENTAL HAD NO WARRANTY (EVEN THOUGH CAR CAME WITH A CONTINENTAL WARRANTY PAPER). REPLACED TIRES WITH YOKOHAMA AT DEALER. *TR",
        "vin": "2T1KR32E56C"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/18/2007",
        "dateOfIncident": "07/19/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10206220,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED 2006 TOYOTA MATRIX ON 14 APRIL 2006 FROM YOUNGER TOYOTA, 1935 DUAL HIGHWAY. HAGERSTOWN, MD. 27140.  WITHIN 12,000 TO 13,000 MILES VEHICLE HAD SEVERE ROAD NOISE.  BY 15,000 MILES NOTICED SEVERE INSIDE CUPPING OF ALL FOUR TIRES.  TIRES WERE ROTATED EVERY 5,000 MILES AT OIL CHANGE.  I THOUGHT I HAD BAD TIRES AND PRIOR TO PURCHASING NEW TIRES WENT TO YOUNGER TOYOTA FOR AN ALIGNMENT ON 19 JULY 2007 (17,410 MILES ON VEHICLE).  THE YOUNGER SERVICE ADVISOR TOLD ME THAT THE MATRIX WAS A LITTLE OUT OF ALIGNMENT.  I PURCHASED NEW TIRES FROM DISCOUNT TIRE DIRECT ON 3 AUGUST 2007 AND HAD NEW TIRES INSTALLED (18,714 MILES ON VEHICLE).  IN OCTOBER 2007 I CAME ACROSS SEVERAL FORUMS WHERE SEVERAL OTHER PEOPLE HAVE HAD THE SAME PROBLEM.  I VISITED YOUNGER TOYOTA AND TALKED TO THE SERVICE MANAGER WHO ACKNOWLEDGED THAT HE HAD MET WITH OTHER MATRIX OWNERS WHO HAD HAD THE SAME PROBLEM THAT I HAD.  HIS ANSWER TO ME WAS THAT HE HAD NO SERVICE BULLETINS TO CORRECT THE PROBLEM AND THAT I SHOULD CONTACT A CUSTOMER REPRESENTATIVE AT TOYOTA TO RESOLVE THE PROBLEM.  I CONTACTED A CUSTOMER REP AT TOYOTA AND GOT THE SAME ANSWER THAT THE SERVICE MANAGER GAVE ME.  NO SERVICE BULLETINS AND NO FIX FOR THE PROBLEM.  I FILED FOR ARBITRATION ON 11 OCTOBER 2007 ( CASE #200710110721).  *TR",
        "vin": "2T1KR32E06C"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/04/2007",
        "dateOfIncident": "10/04/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10205054,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "SEVERE TIRE CUPPING AT 24,000 MILES ON TOYOTA MATRIX 2006 XR AWD.  ALL 4 TIRES NEEDED REPLACING - TIRE INFLATION LIGHT WAS ON AND WOULD NOT RESET.  NOTICED PROBLEM AT ABOUT 15,000 MILES.  *TR   *UPDATED 12/12/07 *BF  THE CONSUMER STATED BROUGHT IN INFORMATION ABOUT OTHER CUSTOMER'S WITH THE SAME DEFECT.  UPDATED 12/12/07  *TR",
        "vin": "2T1LR30E76C"
    },
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "09/21/2007",
        "dateOfIncident": "09/20/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10203648,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE COMPLETELY STOPPED IN A LINE OF TRAFFIC. WHILE WAITING TO MOVE ON, WITH MY FOOT ON THE BRAKE,THE ENGINE ALL OF A SUDDEN ROARED AND THE VEHICLE SHOT FORWARD AND HIT THE VEHICLE (APPROXIMATELY 5 TO 7 FEET) IN FRONT OF MY VEHICLE. THE AIR BAGS DID NOT OPEN AND THE HIT TO THE OTHER VEHICLE WAS MORE LIKE A  PUNCH. I TRIED TO STOP MY FORWARD THRUST BUT THE BRAKES WOULD NOT HOLD THE VEHICLE. UPON STRIKING THE OTHER VEHICLE THE ENGINE ROAR STOPPED AND EVERYTHING SEEMINGLY RETURNED TO NORMAL. MINOR DAMAGE WAS DONE TO BOTH VEHICLES AND NO ONE WAS REPORTEDLY INJURED. THE POLICE WERE CALLED TO THE SCENE AND AN ACCIDENT REPORT WAS FILED. MY TOYOTA DEALER WAS CALLED FOR ASSISTANCE AND ADVISED ME THAT THEY NEVER HAD SUCH AN EXPERIENCE REPORTED BUT SUGGESTED I BRING THE VEHICLE IN FOR SERVICE.  *TR",
        "vin": "2T1LR30E76C"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/01/2007",
        "dateOfIncident": "08/28/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10201638,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "CONTITOURING",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "I OWN A 2006 TOYOTA AWD MATRIX WITH 25,000 MILES. I BROUGHT THE CAR IN FOR SERVICE AND ASKED THEM TO CHECK A VIBRATION I FELT WHEN DRIVING THE CAR. THEY TOLD ME THE TIRES (ALL 4)  ARE CUPPING AND NEED TO BE REPLACED. THE TIRES HAD BEEN ROTATED TWICE ( AT 8,000 AND 21,000 MILES). I SEARCHED THE INTERNET TO SEE IF ANYONE ELSE HAD PROBLEMS AND FOUND THE PROBLEM WITH CUPPING AND PREMATURE TIRE WEAR WAS COMMON. THE POSTINGS REFER TO A MANUFACTURE PROBLEM. IRONICALLY TOYOTA DISCONTINUED AWD IN 2007 AND OWNERS OF THE NEWER MODELS REPORTED NO TIRE WEAR PROBLEMS. *JB",
        "vin": "2T1LR32E26C"
    },
    {
        "components": "SUSPENSION,TIRES",
        "crash": false,
        "dateComplaintFiled": "08/07/2007",
        "dateOfIncident": "08/07/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10198732,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TIRES ON MY 2006 TOYOTA MATRIX ARE CUPPING.  I HAD TO REPLACE THEM AT 13,000 MILES.  I HAVE SINCE FOUND OUT THAT THIS IS A COMMON PROBLEM ON MATRIXS NO MATTER WHAT TYPE OF TIRE ARE ON THE CAR. *JB",
        "vin": "2T1LR30E06L"
    },
    {
        "components": "SUSPENSION,TIRES",
        "crash": false,
        "dateComplaintFiled": "08/01/2007",
        "dateOfIncident": "07/28/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10198015,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH ONLY 24,707 MILES ON MY 2006 TOYOTA MATRIX, I WAS TOLD THAT ALL FOUR TIRES NEEDED TO BE REPLACED. I HAVE FOUND MANY SUCH COMPLAINTS ABOUT THESE VEHICLES AFTER DOING AN INTERNET SEARCH. THE PROBLEM WAS DESCRIBED AS EXCESSIVE CUPPING OR WEAR TO THE INSIDE OF THE TIRES. THE SIXTEEN INCH CONTINENTAL TIRES STANDARD ON THESE HAVE A TREAD LIFE OF 50,000 MILES, BUT THE CUSTOMER SERVICE REPRESENTATIVE TOLD ME THEY HAVE A TREAD LIFE OF ABOUT 25,000 MILES. I HAVE THE RECORDS TO PROVE THAT I BROUGHT THE AUTO IN EVERY 5,000 MILES FOR A SCHEDULED MAINTENANCE. EACH ONE CALLED FOR A TIRE ROTATION.  I AM SO ANGRY THAT THE DEALERSHIP DIDN'T MENTION THIS PROBLEM OR MAKE CORRECTIONS TO THE ALIGNMENT OR BALANCE OF THE TIRES, THAT I REFUSE TO GO BACK TO THEM. IN MY OPINION, THIS CONSTITUTES NEGLIGENT BEHAVIOR ON THE PART OF THE DEALERSHIP AND A SERIOUS DESIGN FLAW ON THE PART OF THE MANUFACTURER THAT SHOULD BE CORRECTED FOR ALL TOYOTA MATRIX. *TR",
        "vin": "2T1KR32E06C"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/24/2007",
        "dateOfIncident": "07/19/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10197409,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "2006 TOYOTA MATRIX XR TIRES CUPPING BADLY AFTER 17,000 MILES.  CONTINENTAL TIRES, DEALER WILL NOT ADDRESS PROBLEM.  NOTED MANY SIMILAR PROBLEMS WITH CAR AND TIRE COMBINATION.  *TR",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/13/2007",
        "dateOfIncident": "07/13/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10196284,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "CONTITOURING",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "THE TIRES ON TOYOTA MATRIX'S ARE WEARING OUT AFTER 15000 MILES.  THIS IS ON ALL TOYOTA MATRIX CARS AND TOYOTA IS DENYING ANY PROBLEMS.  THE FOLLOWING LINK IS ONE OF MANY THAT OUTLINES THE ISSUES (HTTP://TOWNHALL-TALK.EDMUNDS.COM/DIRECT/VIEW/.F0EEECE/0)",
        "vin": "2T1KR32E46C"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "04/06/2007",
        "dateOfIncident": "04/06/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10187195,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "CONTITOURING",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 TOYOTA MATRIX.  THE CONTACT STATED THAT UNDER COLD CONDITIONS OR IF THE VEHICLE IS PARKED FOR AN EXTENDED LENGTH OF TIME THE TIRES WOULD CREATE A FLAT SPOT AND PRODUCE A LOUD ROAD NOISE WHEN DRIVING.  AFTER THE VEHICLE HAS BEEN DRIVEN FOR A WHILE THE NOISE AND THE FLAT SPOT WOULD LEAVE. THE CONTACT CALLED THE MANUFACTURER , BUT NO REPAIRS WERE MADE.  THE CURRENT AND FAILURE MILEAGE WERE 6,008.*AK",
        "vin": "2T1KR32E16C"
    },
    {
        "components": "VISIBILITY,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/08/2007",
        "dateOfIncident": "12/26/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10181969,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* - THE CONTACT  OWNS  A 2006 TOYOTA MATRIX.  THE CONTACT STATED THAT THIS VEHICLE WAS LOW TO THE GROUND, WHICH MADE  IT EASIER FOR PEBBLES TO STRICK THE WINDSHIELD WHICH SUSTAINED DAMAGE FROM GRAVEL BEING KICKED UP BY OTHER VEHICLES ON THE HIGHWAY.  THE CONTACT STATED THAT HE NORMALLY DROVE 45 TO 55 MPH HIGHWAY LIMIT WHEN THE VEHICLE GOT PELTED BY THE GRAVEL.  THE GRAVEL  WAS A RESULT OF THE SAND AND CHEMICALS PLACED ON THE ROAD TO IMPROVE ICY CONDITIONS.  THERE WAS USUALLY SNOW AND ICE ON THE ROAD FROM NOVEMBER TO APRIL.  THE CURRENT AND FAILURE MILEAGE WERE  15500. *AK  UPDATED 03/19/07. *JB",
        "vin": "2T1LR32E76C"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,VEHICLE SPEED CONTROL,TIRES",
        "crash": false,
        "dateComplaintFiled": "02/02/2007",
        "dateOfIncident": "12/21/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10181414,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "CONTITOURING",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TL*-  THE CONTACT OWNS A 2006 TOYOTA MATRIX.   WHILE DRIVING ON 12/21/06 IN HEAVY TRAFFIC AT 5 MPH  HEARD A KNOCKING SOUND. THE CONTACT STOPPED THE VEHICLE AND OBSERVED THAT THE TIRE FAILED AND THAT THE SIDEWALL WAS  DAMAGED.  THE CONTACT WAS CERTAIN THAT HE DIDN'T HIT ANYTHING TO CAUSE THE TIRE TO FAIL.  THE CONTACT PLACED A SPARE TIRE  ON THE VEHICLE AND DROVE IT TO THE DEALER.  THE DEALER ADVISED HIM TO CALL THE TIRE MANUFACTURER AND FILE A COMPLAINT.  SEARS INFORMED THE CONTACT THAT THE TIRE FAILURE WAS DUE TO ROAD HAZARDS.  THE CONTACT STATED THAT THE ROAD CONDITIONS WERE GOOD.  *AK",
        "vin": "2T1LR32E66C"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/14/2006",
        "dateOfIncident": "12/12/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10176107,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THE FRONT TIRES KEEP WEARING OUT AT 7000 MILES.  THE FRONT TIRES WERE WORN ON THE INSIDE PORTION.  AN INDEPENDENT MECHANIC EXPRESSED THAT THERE WAS SOMETHING WRONG WITH THE ALIGNMENT.",
        "vin": ""
    },
    {
        "components": "SUSPENSION,TIRES",
        "crash": false,
        "dateComplaintFiled": "11/11/2006",
        "dateOfIncident": "11/10/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10173175,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "CONTINENTAL TOURINGCONTACT AS",
                "productYear": "9999",
                "size": "P215/60R16",
                "type": "Tire"
            }
        ],
        "summary": "I HAVE A 2006 TOYOTA MATRIX XR 2WD WITH 14000 MI. I HAVE HAD THE TIRES ROTATED 3 TIMES IN THIS PERIOD AND KEEP 32PSI IN EACH TIRE, UPON PRESENTATION TO THE TIRE SHOP (CONTINENTAL ECO PLUS TIRES). THE SHOP REFUSED TO ROTATE THE TIRES SINCE ONE HAD 2/32 TREAD WEAR AND ANOTHER TIRE WAS SHOWING BELTS  ON THE VERY INSIDE OF TIRE. THERE IS ALSO A HUMMING NOISE COMING FROM THE TIRES AS WELL. *JB",
        "vin": "2T1KR32E56C"
    },
    {
        "components": "SUSPENSION,TIRES",
        "crash": false,
        "dateComplaintFiled": "10/13/2006",
        "dateOfIncident": "10/13/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10170729,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "BOUGHT NEW TOYOTA MATRIX 2 WHEEL DRIVE IN 2006. ALL FOUR TIRES ARE WORN EXCESSIVELY ON THE INSIDE PART OF TIRE. DEALERSHIP SAYS I DROVE THE CAR THEREFORE NOT THEIR PROBLEM. TOYOTA SAYS TIRES NOT THEIR PROBLEM. NEITHER ORGANIZATION SEEMS TO THINK THE CAR MAY HAVE A MANUFACTURING DEFECT. AFTER SEARCHING THE INTERNET I HAVE FOUND OTHERS REPORTING SAME TROUBLES. I KNOW AM FACED WITH BUYING 4 NEW TIRES HAVING TO GET AN ALIGNMENT. AND STILL NOT CONVINCED THE PROBLEM WILL GO AWAY. THE PROBLEM MAY HAVE BEEN THEIR WHEN I BOUGHT THE CAR. BOTH DEALERSHIP AND TOYOTA WANT TO BLAME ME AND THE TIRE COMPANY.  *NM",
        "vin": "2T1KR32E06C"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/26/2006",
        "dateOfIncident": "06/21/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10160726,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR WAS OPERATED BY MOTHER WHO WAS IN A PARKING LOT ABOUT TO FINALIZE A FULL PARKING OF IT.   ALL OF A SUDDEN, HER WORDS WERE \"IT SHOT OFF LIKE A BULLET\" AND SHE DID NOT KNOW WHAT WAS HAPPENING.  IT FELT LIKE IT WAS GOING 100 MPH AND SHE DID EVERYTHING UNDER HER CONTROL NOT TO HIT ANOTHER VEHICLE OR 3 PEDESTRIANS.  THE PEDESTRIANS SAW WHAT WAS HAPPENING AND RAN, ONE WAS HIT, NOT SERIOUSLY.  POLICE AND RESCUE WERE CALLED.  THE JOHNSTON, RHODE ISLAND POLICE DEPARTMENT IMPOUNDED THE CAR.  THE CAR WILL BE INSPECTED PROBABLY ON JUNE 26 BY THE RI DEPARTMENT OF MOTOR VEHICLES ENFORCEMENT DIVISION.  THEY WILL DETERMINE WHETHER THE CAR IS \"FIT\" TO DRIVE OR \"UNFIT\" TO DRIVE.  IT WAS A SCARY SITUATION.  THE CAR IS BRAND NEW.  I AM THE OWNER OF IT, I BOUGHT IT IN DECEMBER 2005, IT HAD NOT YET BEEN DELIVERED TO THE DEALERS LOT.  I PICKED IT UP A WEEK AFTER INITIATING MY PURCHASE.  IT'S A 2006 TOYOTA MATRIX, ALL WHEEL DRIVE.   *JB",
        "vin": "2T1LR30EX6C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/10/2006",
        "dateOfIncident": "06/09/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10159506,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TWICE WHILE DRIVING AT 60 MPH ON THE HIGHWAY (IN TRAFFIC BUT NOT BUMPER TO BUMPER), MY TOYOTA MATRIX ENGINE TURNED OFF. I WAS ON THE RIGHT AND ABLE TO PULL OVER TO THE SIDE AND RESTART THE ENGINE, HOWEVER HAD I BEEN IN THE LEFT LANE THIS WOULD NOT HAVE BEEN POSSIBLE AND A SERIOUS ACCIDENT COULD HAVE HAPPENED. THE VEHICLE SUBSEQUENTLY WAS INSPECTED BY THE DEALERS' SERVICE DEPARTMENT (RUSSELL TOYOTA IN CATONSVILLE, MARYLAND). THEY COULD NOT DUPLICATE THE FAILURE AND FOUND NOTHING WRONG WITH THE CAR. THE CAR IS ONLY A FEW MONTHS OLD AND HAS 11,800 MILES ON IT, AND HAS RECEIVED ALL PROPER SERVICE CHECKS, OIL CHANGES, ETC.  *JB",
        "vin": "2T1KR32E16C"
    },
    {
        "components": "STEERING,EQUIPMENT",
        "crash": true,
        "dateComplaintFiled": "03/25/2006",
        "dateOfIncident": "03/25/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10153679,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "TOTAL SYSTEMS TECH., INC.",
                "productMake": "TOTAL SYSTEMS",
                "productModel": "TOTAL SYSTEMS",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "I DROVE A 2006 TOYOTA MATRIX AND LOST CONTROL OVER THE VEHICLE. I WAS TRYING TO CHANGE LANE TO MY RIGHT AND FOUND THERE WAS A CAR APPROACHING AND HORNED ME.  I HAD NOT LEFT MY LANE AND TRIED TO PULL MY CAR STRAIGHT.  THE CAR REACTED BY SHIFTING TOO MUCH TO THE LEFT AND I TRIED ONLY TO ADJUST IT, KEEPING IN MIND THAT  IT WAS A POWER-STEERED SYSTEM. TO KEEP IT STRAIGHT.   THERE WAS A 1-2 SECONDS AFTERWARDS THE CAR SEEMED TO BE ON TRACK AND I WAS DRIVING FINE.  AFTER THAT TIME PERIOD, THE CAR VEERED TOWARD THE LEFT ALL OF A SUDDEN.  I TRIED TO MAINTAIN IT STRAIGHT BUT IN VAIN AND COMPLETELY LOST CONTROL OVER IT.  IT SPUN COUNTERCLOCKWISE OVER 3 LANES TOWARD MY LEFT AND HIT THE CENTRAL GUARDRAIL AND STOPPED.  THE VEHICLE WAS TOTALED BUT I WAS NOT INJURED.  *JB",
        "vin": ""
    },
    {
        "components": "STEERING,EQUIPMENT",
        "crash": true,
        "dateComplaintFiled": "03/25/2006",
        "dateOfIncident": "03/25/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10153680,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "MATRIX",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "TRANSPORT SYSTEMS, INC.",
                "productMake": "TRANSPORT SYSTEMS",
                "productModel": "TRANSPORT SYSTEMS",
                "productYear": "1974",
                "type": "Equipment"
            }
        ],
        "summary": "I JUST FILED A COMPLAINT TO NHTSA (#10153679) AT THIS WEBSITE.  I FORGOT TO MENTION THAT I SEARCHED ON THE INTERNET AND FOUND A SIMILAR ACCIDENT HAPPENED IN NY STATE.  JEAN M. NAPLES WAS DRIVING A TOYOTA MATRIX ON ROUTE 287 NORTHBOUND IN HARDING AND THE CAR LOST CONTROL AND SPUN TOWARD THE LEFT.  SHE WAS TREATED AT MORRISTOWN MEMORIAL HOSPITAL.  (IF TOYOTA WANTS TO SEE THE COMPLAINT #10153679, I WOULD LIKE TO OPEN IT TO THEM.  I ORIGINALLY SPECIFIED \"NON-DISCLOSURE\" BECAUSE I DID NOT WANT THE HASSLE OF GETTING INVOLVED IN AN INVESTIGATION, QUESTIONNAIRE, FORMS, AND ALL THAT STUFF!)  *JB",
        "vin": ""
    }
]