[
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/10/2016",
        "dateOfIncident": "05/23/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10894752,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "YARIS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2006 TOYOTA YARIS. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER:  16V340000 (AIR BAGS). THE PART TO DO THE REPAIR WAS NOT AVAILABLE.  THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JTDJT4K37A5"
    },
    {
        "components": "AIR BAGS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/24/2013",
        "dateOfIncident": "05/21/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10513379,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "YARIS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THIS CAR IN DECEMBER 2006 IN PUERTO RICO.  I NEEDED A CAR TO VISIT MY FATHER WHO CURRENTLY LIVES THERE. DURING 2007 THROUGH 2012, I VISITED HIM APPROXIMATELY FIVE TIMES AND DROVE THE CAR.  IN 2013, I DECIDED TO BRING THE CAR TO VIRGINIA, US. I BOUGHT THE 2006 YARIS TOYOTA TO THE US WITH APPROXIMATELY 6K MILES IN MARCH 2013.      IN MAY 2013, THE SENSOR CONTROLLING THE AIR BAGS TURNED ON AND I IT WAS UNABLE TO PASS STATE INSPECTION. THE WEEK AFTER, WHILE I WAS DRIVING TO WORK, THE CAR LOST ALL OF THE BRAKES FUNCTIONALITY. I HAD TO PULL THE EMERGENCY BRAKES IN THIS CAR OR ELSE HAVE AN ACCIDENT. OVERALL BETWEEN THE SENSOR AND NEW BRAKES IT IS COSTING OVER $1300.    IN TWO MONTHS OF DRIVING THE CAR FROM FREDERICKSBURG VIRGINIA TO SPRINGFIELD VIRGINIA, THE MILEAGE USED WAS ABOUT 4K EXTRA. IN ESSENCE; THE CAR WITH ONLY 10K, AND IS AT HOME WHILE I THINK OF WHAT TO DO WITH THIS CAR. THE CAR IS PAID OFF AND A CAR ON ONLY 10K MILES SHOULD NOT HAVE SO MANY ISSUES.    TOYOTA SAID IT CANNOT REPAIR THE CAR BECAUSE IT IS A 2006 MODEL, HOWEVER THE MILEAGE ON THE CAR IS ONLY 10K.  *TR",
        "vin": "JTDJT923065"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/01/2010",
        "dateOfIncident": "05/28/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10334068,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "YARIS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HIT A DEER GOING BETWEEN 40 AND 50 MPH AND THE AIR BAG DID NOT DEPLOY. *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/18/2010",
        "dateOfIncident": "05/14/2006",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10320736,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "YARIS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 TOYOTA YARIS . WHILE DRIVING APPROXIMATELY 50 MPH APPROACHING A TRAFFIC LIGHT AND ATTEMPTING TO STOP, THE CONTACT CRASHED INTO THE REAR END OF ANOTHER VEHICLE. THE BRAKES WERE APPLIED; HOWEVER, THEY FAILED TO STOP THE VEHICLE. THE AIR BAGS DID NOT DEPLOY AND THE VEHICLE CAUGHT FIRE. THE CONTACT WAS INJURED.  A POLICE AND FIRE REPORT WAS TAKEN. THE VEHICLE WAS TOWED TO A STORAGE FACILITY.  THE MANUFACTURER WAS CONTACTED ABOUT THE FAILURE. THE VEHICLE WAS INSPECTED BY A TOYOTA INVESTIGATOR WHO ADVISED THE HIM BY MAIL THAT NOTHING WAS WRONG WITH THE VEHICLE AND ALSO STATED THAT THE AIR BAGS DONT DEPLOY UNLESS THE CONTACT WAS NOT APPLYING THE BRAKES.  THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS AT 12160.",
        "vin": ""
    },
    {
        "components": "STEERING,SERVICE BRAKES, HYDRAULIC,WHEELS",
        "crash": true,
        "dateComplaintFiled": "02/24/2009",
        "dateOfIncident": "02/07/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10259800,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "YARIS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 TOYOTA YARIS.  WHILE DRIVING APPROXIMATELY 70 MPH ON NORMAL ROAD CONDITIONS, THE BRAKES FAILED TO RESPOND WHEN THE BRAKE PEDAL WAS DEPRESSED.  THE VEHICLE FAILED TO SLOW DOWN AND SPUN THREE TO FOUR TIMES UNCONTROLLABLY INTO THE MEDIAN.  THE DRIVER STOPPED THE VEHICLE AND OBSERVED THAT THE FRONT AND REAR PASSENGER SIDE TIRES WERE FLATTENED.  THE TIRE WARNING INDICATOR ILLUMINATED ON THE INSTRUMENT PANEL.  THERE WERE NO WARNINGS OR INJURIES AND THE VEHICLE WAS NOT DAMAGED.  THE VEHICLE WAS TOWED TO THE AUTHORIZED DEALER FOR INSPECTION AND THEY STATED THAT THE FRONT AND REAR PASSENGER TIRES WERE PUNCTURED, WHICH CAUSED EXCESSIVE AIR PRESSURE LEAKAGE.  IN ADDITION, THE RIMS WERE DAMAGED.  THE TIRES AND RIMS WERE REPLACED; HOWEVER, THE TECHNICIAN WAS UNABLE TO DETERMINE THE CAUSE OF THE FAILURE.  THE CURRENT AND FAILURE MILEAGES WERE 5,000.",
        "vin": "JTDBT923584"
    }
]