[
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/09/2009",
        "dateOfIncident": "09/24/2009",
        "fire": false,
        "manufacturer": "Polaris Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10286886,
        "products": [
            {
                "manufacturer": "Polaris Inc.",
                "productMake": "VICTORY",
                "productModel": "HAMMER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "POLARIS HAWKEYE 2006   THE LOWER REAR A FRAME MOUNT TORE AWAY FROM THE FRAME ALLOWING THE REAR WHEEL TO TOE OUT AND THE MACHINE TO SWERVE SIDEWAYS.  I HAVE ORDERED THE NEW REINFORCED SUBFRAME BUT NEITHER THE DEALER OR POLARIS IS WILLING TO HELP WITH THE COST.  CONSIDERING THE NUMBER OF ARTICLES ABOUT THIS SAME PROBLEM ON LINE, I'M SURPRISED THAT POLARIS HASN'T DONE A RECALL. *TR",
        "vin": "4XALD27A06B"
    },
    {
        "components": "WHEELS",
        "crash": true,
        "dateComplaintFiled": "03/13/2006",
        "dateOfIncident": "03/13/2006",
        "fire": false,
        "manufacturer": "Polaris Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10152607,
        "products": [
            {
                "manufacturer": "Polaris Inc.",
                "productMake": "VICTORY",
                "productModel": "HAMMER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE TRAVELING 40 MPH, THE REAR WHEEL LOCKED UP IN THIRD GEAR.  THE VEHICLE SKIDDED TO A STOP.  THE DEALERSHIP SENT A TECHNICIAN TO RETRIEVE THE VEHICLE.  THE WHEEL RELEASED AFTER 5-10 MINUTES, THE VEHICLE WAS IN A TUNNEL AND THE CONTACT TRIED TO MOVE IT.  THE REAR WHEEL LOCKED UP AGAIN.  THE DEALERSHIP WAS UNABLE TO DUPLICATE THE PROBLEM. THE CONTACT PICKED UP THE VEHICLE AND THE REAR WHEEL LOCKED UP WHILE DRIVING HOME.  THE TECHNICIAN RETRIEVED THE VEHICLE AGAIN.  UPON DRIVING THE VEHICLE THE REAR WHEEL LOCKED UP.  THE TECHNICIAN LOST CONTROL AND THE VEHICLE SKID DOWN THE ROAD, CAUSING MINOR INJURIES TO THE TECHNICIAN.  THERE WAS A POLICE REPORT TAKEN AT THE SCENE.  THE VEHICLE WAS A TOTAL LOSS.",
        "vin": "5VPHB26D763"
    }
]