[
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/25/2008",
        "dateOfIncident": "10/30/2007",
        "fire": false,
        "manufacturer": "UD Trucks Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10216035,
        "products": [
            {
                "manufacturer": "UD Trucks Corporation",
                "productMake": "UD",
                "productModel": "UD2600",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASE A NISSAN ARMADA BACK IN AUGUST OF 2007 NOTICE LIGHT COMING ON IN THE TRUCK VDC AND SLIP LIGHT LOOKED IN MY BOOK TO SEE WHAT THE LIKE MEAN AND IT ADVISE ME THAT IT WAS BRAKE ISSUE TOOK TRUCK IN TO NISSAN AND THEY ADVISE ME THAT I NEEDED TO HAVE FRONT DISC PADS AND ROTORS. DELAWARE CADILLAC SAID THEY WILL REPLACE THE BRAKES BECAUSE THAT WERE THE SUV WAS PURCHASE, WELL AS OF TODAY I AM EXPERIENCING A BAD VIBRATION SHAKING IN THE STEERING WHEEL, I HAVE NOT HAVE NOT SEEN ANY WARNING LIGHT COME ON IN THE TRUCK BUT FROM ALL RESEARCH THAT I HAVE DONE IT SEEM THAT THERE IS A BRAKE PROBLEM AGAIN NISSAN HAVE NOT ONCE HAD ANY RECALLS ON THEIR BRAKE I FEEL THOUGHT THAT THEY SHOULD BE MADE TO RECALL ALL OF THESE TRUCKS BEFORE SOME ONE GET HURTS MY TRUCK WAS REPAIR WITH ONLY 26,091 MILE ON IT. I AM GOING TO SCHEDULE APPOINTMENT FOR NISSAN THIS WEEK. ASLO MY TRUCK WAS SERVICE BY DELAWARE FOR BRAKE INSPECTION AFTER I PURCHASE THE TRUCK AND I WAS TOLD THE BRAKES WAS FIND ALSO HAD PROBLEM WITH DVD IN THE CEILING KEEP FALLING DOWN AND DVD GETTING STUCK IN IT. WHEN I PURCHASE MY TRUCK THERE WAS A CRACK ON THE PASSENGER SIDE DOOR THAT WE ARE IN AGREEMENT TO HAVE FIX IF I PURCHASE THE TRUCK WAS TOLD BY DELAWARE CADILLAC TO GO GT ESTIMATE FOR THE REPAIR AND THEY WILL MAKE ARRANGEMENT TO HAVE IT FIX NEVER HEARD FROM ANYONE ABOUT THAT I FEEL THOUGHT THAT IF YOU PENDING THAT TYPE OF MONEY FOR A TRUCK EVERYONE SHOULD BE ABLE TO HONOR THERE PRODUCT BUT EVERYONE WANTS TO POINT FINGER SOMEWHERE US AND IT NOT FAIR TO US.   *TR",
        "vin": "5N1AA08B96N"
    }
]