[
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/11/2017",
        "dateOfIncident": "11/20/2017",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11053976,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70XC",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MAIN ENGINE WIRING HARNESS DESTROYED, ENGINE STILL RAN- TEMP, FLUIDS, CAM TIMING, MASS AIR FLOW, FUEL RAIL, THROTTLE POSITION -SENSORS, INSTRUMENT PANEL. HAD CHECKED OIL TWO DAYS EARLIER, WAS NO DAMAGE. WIND SCREEN WASHER LIGHT CAME ON WHEN I TRIED TO START ENGINE, CHECKED AND FOUND DAMAGE -WAS ONE OF THE SENSORS WHICH WAS DAMAGED - FLUID BOTTLE WAS OK. SOME MINOR WIRES WERE STILL ATTACHED. THIS COULD HAVE HAPPENED ON THE HIGHWAY AND CAUSED AN ENGINE MALFUNCTION.   THERE WAS ALWAYS A SLIGHT ODOR IN HOT WEATHER OR WHEN ON A LONG RUN- WAS THE SOY BASED POLYMERS VOLVO USED WITHOUT ANY \"ODOR INHIBITORS\", THE LOOMS COVERINGS DO BIODEGRADE QUICKER IN HOT WEATHER EXPOSURE WITHOUT AN INHIBITOR AND DISINTEGRATE LEAVING THE LOOM TO OPEN UP AND BE EXPOSED TO DAMAGE! THE HOOD INSULATION WAS ALSO DESTROYED AND HAD TO BE REPLACED  TOTAL REPLACEMENT AND LABOR  $2.,827.42",
        "vin": "YV4SZ592X61"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/28/2015",
        "dateOfIncident": "07/20/2015",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10744213,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TWO BOLTS THAT ATTACH THE BALL JOINT TO THE KNUCKLE SOMEHOW WORKED LOOSE AND FELL OUT, CAUSING THE FRONT RIGHT WHEEL TO FALL OFF THE CAR.  FORTUNATELY THE SEPARATION HAPPENED AT LOW SPEED, BUT IF THE CAR HAD BEEN TRAVELING AT NORMAL ROAD OR HIGHWAY SPEEDS THE FAILURE WOULD HAVE BEEN CATASTROPHIC.  NONE OF THE PARTS HAD ANY PRIOR DAMAGE, ALL WERE ORIGINAL TO THE CAR, AND THE MECHANICS COULD NOT UNDERSTAND WHY THE BOLTS WORKED LOOSE.  VOLVO USA HAD NO INTEREST IN INVESTIGATING OR UNDERSTANDING THIS FAILURE, WHICH IS REMARKABLE GIVEN ITS NATURE AND POTENTIAL FOR CAUSING A MAJOR ACCIDENT.  NOR WERE THEY WILLING TO PAY FOR THE REPAIR OR RELATED DAMAGE.  I RECOVERED AND HAVE POSSESSION OF THE BALL JOINT, KNUCKLE AND BOLTS, AS WELL AS PHOTOS DETAILING THE FAILURE AND DAMAGE (INCLUDING ROAD SKID MARKS FROM THE DRAGGING WHEEL), AND RECEIPTS FOR THE REPAIR WHICH TOTALED OVER $1,000 EXCLUDING BODY DAMAGE.",
        "vin": "YV1SW592562"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/29/2014",
        "dateOfIncident": "05/22/2014",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10594841,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 VOLVO V70 2.5T, 100K MILES.  IGNITION CYLINDER JAMS RENDING THE VEHICLE INOPERABLE.  THE INTERNET IS FULL OF SIMILAR INSTANCES.  A DISABLED VEHICLE IS DANGEROUS.  THE IGNITION CYLINDER IS DEFECTIVE AND SHOULD HAVE BEEN SUBJECT TO RECALL YEARS AGO.   *TR",
        "vin": "YV1SW592362"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/29/2013",
        "dateOfIncident": "01/11/2013",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10495156,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON COMMUNITY STREET 25MPH HEARD LOUD EXPLOSION . CAR BARELY RAN BUT GOT 1 BLOCK TO AN AUDI DEALER . THEY INSPECTED CAR AND TOLD ME PARKING BRAKE EXPLODED AND GAVE ME LOTS OF METAL PIECES TO SHOW THE VOLVO MECHANIC . CALLED VOLVO OF NORTH AMERICA BUT THEY DENIED EVER HEARING ABOUT THIS TYPE OF PROBLEM AND VOLVO DEALER WANTS TO CHARGE ME $1700 TO REPLACE PARKING BRAKES . TALKING TO OTHER VOLVO OWNERS THEY HAVE HAD SAME PROBLEM AND VOLVO REFUSES TO ISSUE A RECALL . IS THERE ANY WAY YOUR AGENCY CAN ENCOURAGE VOLVO TO DO A RECALL ?     THANKS  *TR",
        "vin": "YV1SJ527962"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/03/2013",
        "dateOfIncident": "12/14/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10490926,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70XC",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION FAILED ON CAR CAUSING ROUGH BUCKING AT LOWER SPEEDS.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/14/2012",
        "dateOfIncident": "11/12/2012",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10484620,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70XC",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR STALLED IN TRAFFIC THREE TIMES.  OUR MECHANIC SAID IT THAT THE WIRES TO THE FUEL PUMP AND ITS MODULE WERE ROTTING, CAUSING ELECTRIC PROBLEMS AND THE STALLS IN TRAFFIC.  IT NOW APPEARS VOLVO KNOWS ABOUT THIS PROBLEM AND HAS ISSUED A TECHNICAL BULLETIN TO ITS MECHANICS AS TO HOW TO FIX IT BUT HAS NOT NOTIFIED THE PUBLIC OR ISSUED A RECALL.  THIS IS A POTENTIALLY DANGEROUS SITUATION SINCE STALLS CAN CAUSE ACCIDENTS AND ROTTING WIRES CAN CAUSE FIRES.  *TR",
        "vin": "YV4SZ592061"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/25/2011",
        "dateOfIncident": "11/26/2009",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10437258,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 VOLVO V70. THE CONTACT STATED THAT THE VEHICLE WOULD LUNGE WHILE DRIVING. THE DEALER DIAGNOSED THAT THE VEHICLE WOULD NEED A NEW TRANSMISSION. THE MANUFACTURER WAS NOTIFIED AND NEGOTIATED TO PAY FOR A PERCENTAGE OF THE PARTS. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 35,000 AND THE CURRENT MILEAGE WAS 65,000.",
        "vin": "YV1SJ527162"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "11/21/2011",
        "dateOfIncident": "09/28/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10436648,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 VOLVO V70. THE CONTACT STATED THAT ONE OF THE TIRES WOULD FREQUENTLY LEAK AIR. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER AND THE CONTACT WAS INFORMED THAT THERE WAS A HOLE IN THE WHEEL. THE CONTACT REPLACED THE WHEEL AND WITHIN A COUPLE OF MONTHS, THE FAILURE RECURRED. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 44,000 AND THE CURRENT MILEAGE WAS 44,700.   THE CONSUMER SUBSEQUENTLY REPORTED THAT THE HOLE IN THE WHEEL WAS CAUSED BY SOMETHING THAT PENETRATED THE TIRE. *DSY",
        "vin": "YV1SW612462"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/26/2011",
        "dateOfIncident": "05/26/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10402888,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MESSAGE SAYS PASSENGER AIRBAG IS NOT ACTIVE.  HAVE HAD IT FIXED BY DEALER ABOUT 8 WKS AGO.. SAID NEEDED TO REPROGRAM COMPUTER.  HAPPENED AGAIN TODAY 26 MAY 11.  *TR",
        "vin": "YV1SW612862"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/26/2010",
        "dateOfIncident": "08/04/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10362415,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 VOLVO V70. THE CONTACT STATED THAT THE TRANSMISSION FAILED. THE GEARS WERE NOT SHIFTING PROPERLY WHENEVER THE VEHICLE WAS IN A LOWER GEAR. THE FAILURE CAUSED THE VEHICLE TO JERK WHEN THE CONTACT TRIED TO ACCELERATE. THE DEALER STATED THAT IT WAS A SOFTWARE ISSUE, BUT THAT DID NOT FIX THE FAILURE. THE DEALER ALSO STATED THAT THE VEHICLE NEEDED A NEW TRANSMISSION, BECAUSE THEY FEEL THAT THE SOLENOIDS ON THE TRANSMISSION WERE DEFECTIVE. THE FAILURE MILEAGE WAS 98000 AND THE CURRENT MILEAGE WAS 106000.",
        "vin": "YV1SW592262"
    },
    {
        "components": "STRUCTURE,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "03/11/2010",
        "dateOfIncident": "03/08/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10318893,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "JUST GOT OFF WORK AND I WAS ON MY WAY TO PICK UP MY CHILDREN FROM THEIR RESPECTIVE SCHOOLS/DAYCARE. THERE WAS A NINE WHEELER MOVING VERY SLOWLY IN FRONT OF ME SO THE CAR IN MY REAR DECIDED TO OVERTAKE ME TO HIS LEFT AND AS SOON AS HE DID THAT MY DRIVER SIDE DOOR JUST FLUNG OPEN BY ITSELF. THE KNOB ON THE DOOR WAS STILL DOWN(IN LOCK POSITION). I WAS SO TERRIFIED BECAUSE IT FELT LIKE SOMETHING DISENGAGED IN MY CAR AND THE WHOLE DRIVER SIDE DOOR JUST CAME LOOSE. I WAS VERY FORTUNATE TO CATCH IT RIGHT AWAY OR ELSE IT COULD HAVE BEEN FATAL CAUSE SPEED LIMIT WAS 45MPH AND FOLKS WERE GOING 50 OR MORE MPH. BEFORE DRIVING MY CAR THAT DAY, I LOCKED ALL MY DOORS FROM THE INSIDE SO I WAS VERY BAFFLED THAT A DOOR CAN OPEN ITSELF( WITH THE KNOB IN A LOCK POSITION) . I FEEL LIKE THE FORCE OF THE CAR THAT OVERTOOK ME DID SOMETHING TO DISENGAGE MY DRIVER SIDE DOOR. I TOOK THE CAR TO THE DEALERSHIP AND THEY SAID THERE WERE NO ERROR CODES COMING OUT FROM THE DRIVER SIDE DOOR. BUT I AM STILL NOT SATISFIED! WHAT IF MY KIDS WERE INSIDE THE CAR AND THERE DOOR FLUNG OPEN? I CALLED THE CUSTOMER CARE CONSULTANT FOR THE MAKER OF MY CAR BUT THE LADY I SPOKE WITH WAS SO RUDE BEYOND BELIEF. PLEASE HELP!!! I HAVE DEALT WITH A LOT OF CARS AND I HAVE NEVER EXPERIENCED SOMETHING LIKE THAT IN MY WHOLE LIKE. THERE IS ALWAYS SOMETHING ABOUT CARS; WHATEVER HAPPENS TO A CAR WHILE DRIVING IT EVERYDAY DOES NOT ALWAYS SHOW UP ONCE IT GETS TO THE DEALERSHIP. HOPEFULLY MY ORDEAL WILL NOT BE IN VAIN! WHEN THIS OCCURRED MY DRIVER SIDE GLASS WAS ROLLED DOWN A LITTLE BIT. *TR",
        "vin": "YV1SW592762"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/23/2009",
        "dateOfIncident": "10/01/2008",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10296775,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHT LENSES OF MY 2006 VOLVO V70 HAVE BECOME CLOUDY AND THEREFORE REDUCE MY NIGHT VISIBILITY. THIS IS A SAFETY ISSUE. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/06/2008",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10244828,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2006 VOLVO V70. LETTER FROM THE LAW OFFICE ENCLOSING A LETTER TO VOLVO REGARDING THEIR EXTENDED WARRANTY NOTICE RE THE ENGINE MANAGEMENT SYSTEM SOFTWARE.   *NJ",
        "vin": "YV1SJ527762"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "04/29/2008",
        "dateOfIncident": "10/26/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10226084,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT SEAT BELTS ON VEHICLE HAVE PROBLEMS. SINCE PURCHASE, BOTH FRONT (DRIVER & PASSENGER) SEATBELTS ARE OVERLY STICKY, AND OFTEN CANNOT BE PULLED OUT OF HARNESS WHEN VEHICLE IS PARKED, IN ORDER TO PUT SEATBELTS ON. THIS IS PARTICULARLY TRUE ON EVEN THE SLIGHTEST GRADE. IN OTHER WORDS UNLESS VEHICLE IS PARKED ON A TOTALLY FLAT SURFACE (RARE ON ACTUAL STREETS) SEATBELTS WILL OFTEN STAY RETRACTED OR ARE EXTREMELY DIFFICULT TO EXTRACT. I OFTEN HAVE TO DRIVE TO A FLATTER LOCATION IN ORDER TO PUT MY SEATBELT ON. (DRIVE WITHOUT SEATBELTS IN ORDER TO GET TO A PLACE WHERE BELTS CAN BE PUT ON.)    ONCE ON, THE SEATBELTS LOCK UP AND PIN DRIVER AND/OR PASSENGER TO THE SEAT WITH EVEN THE SLIGHTEST MOVEMENT, E.G. TO ADJUST RADIO. (I KNOW THIS IS SUPPOSED TO HAPPEN WITH HARD BRAKING, ETC, BUT IT IS HAPPENING WITH THE SLIGHTEST MOVEMENTS.)    I HAVE REPORTED THE PROBLEM TO THE DEALER ON 4 OCCASIONS, AND EACH TIME HAVE BEEN TOLD THE PROBLEM IS \"NORMAL\" FOR THE V70 AND THE S60. IN OTHER WORDS THIS IS A DESIGN FLAW. OTHER VOLVOS AREN'T LIKE THIS. MY WIFE HAS AN 2007 XC90 AND THE SEATBELTS DO NOT BEHAVE AS ABOVE.     AS IS, THE SEATBELT DESIGN ON MY CAR COULD LEAD TO ACCIDENTS OR FATALITIES, AS PEOPLE MAY CHOOSE TO NOT WEAR THEM, OR MAY SIMPLY NOT BE ABLE TO PUT THE BELTS ON WHEN VEHICLE IS PARKED, BEFORE DRIVING.  *TR",
        "vin": "YV1SW640762"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "03/30/2008",
        "dateOfIncident": "03/18/2008",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10222697,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "INFORMATION DISPLAY ON DASH SHOWED WAGON REAR DOOR NOT CLOSED.  SUBSEQUENT INSPECTION SHOWED THE DOOR (GATE) WOULD NOT LOCK AND/OR LATCH AT RANDOM INTERVALS, PARTICULARLY DURING COLD WEATHER (0 F).  TRIP TO DEALER RESULTED IN THE REAR LATCH BEING REPLACED AS DEFECTIVE.  EN ROUTE TO THE DEALERSHIP ANOTHER WARNING SHOWED ON THE DISPLAY THAT THE THIRD BRAKE LIGHT WAS OUT.  WHILE AT THE DEALERSHIP THE WIRING HARNESS TO THE THIRD TAIL LIGHT WAS DIAGNOSED AS DEFECTIVE AND IS SCHEDULED FOR REPLACEMENT.   *TR",
        "vin": "YV1SW612862"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/30/2008",
        "dateOfIncident": "03/18/2008",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10222698,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "DASH WARNING MESSAGE SHOWED THIRD BRAKE LIGHT NOT WORKING.  SUBSEQUENT TRIP TO DEALER DIAGNOSED AS DEFECTIVE WIRING HARNESS IN REAR TAILGATE.  SCHEDULED FOR REPLACEMENT.  *TR",
        "vin": "YV1SW612862"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "05/23/2007",
        "dateOfIncident": "05/07/2007",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10192142,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Pirelli Tire, LLC",
                "productMake": "PIRELLI",
                "productModel": "P6",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "PIRELLI TIRES P6 FOUR SEASON FAILED AFTER ONLY 28,000 MILES- WITH 2 SIDEWALL BULGES & TIRE WITH ROLLED BELT**CC  THE CONSUMER WAS TOLD THE PROBLEM WAS DUE TO RUNNING THE TIRES FLAT ON THE VEHICLE.  GM STATED, THE CONSUMER MUST HAVE HIT SOMETHING LARGE TO CAUSE THE PROBLEM, EVEN THOUGH THERE WERE NO DENTS, SCRAPES OR RIM DAMAGE TO SUPPORT THE THEIR CLAIM.*TR",
        "vin": "YV1SW592462"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/07/2007",
        "dateOfIncident": "01/13/2007",
        "fire": true,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10181895,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I WANTED TO BRING TO YOUR ATTENTION AN INCIDENT REGARDING A CAR FIRE, AND RESULTING TOTAL LOSS OF MY LEASED 2006 VOLVO V70.   I LEASED THE CAR ON JANUARY 20, 2006. ON SATURDAY AFTERNOON, JANUARY 13, 2007, I WAS DRIVING WITH MY TWO YOUNG GRANDSONS.  WE WERE JUST STARTING TO HEAD SOUTH ON THE CHARTER OAK BRIDGE WHEN I LOST POWER.   I WAS ABLE TO COAST THE CAR TO A STOP ON THE EAST HARTFORD, CT SIDE OF THE BRIDGE.  ONE OF MY GRANDSONS SHOUTED \"I SEE SMOKE\" AND SURE ENOUGH SMOKE WAS BILLOWING OUT FROM THE FRONT END OF THE CAR.  I TOLD THE BOYS, WHO WERE BOTH IN THE BACK SEAT, THAT WE HAD TO GET OUT NOW.  I NOTICED THAT THE CAR WAS ROLLING BACKWARDS AND I PULLED THE EMERGENCY BRAKE AND THE CAR STOPPED.  WE ALL GOT OUT AND STARTED WALKING AWAY FROM THE CAR, WHICH NOW HAD HEAVY BLACK SMOKE COMING OUT OF IT AND FLAMES SHOOTING UP FROM THE FRONT END.  A MAN STOPPED AND TOLD US TO GET FURTHER AWAY FROM THE CAR, WHICH WE DID.  911 WAS CALLED AND IN A VERY SHORT TIME THE CONNECTICUT STATE POLICE AND EAST HARTFORD FIRE DEPARTMENT WERE ON THE SCENE.   THE CAR WAS LEASED NEW AND IT HAD UNDER 14,000 MILES ON IT.  I HAD NO PRIOR PROBLEMS WITH IT.  THE ONLY SERVICE ON THE VEHICLE WAS THE REGULAR SCHEDULED MAINTENANCE AT 7,500 MILES PERFORMED AT THE DEALERSHIP. THE NEXT SCHEDULED MAINTENANCE WOULD HAVE BEEN AT 15,000 MILES.  MY INSURANCE COMPANY ADVISED IT WAS A TOTAL LOSS, AND ALSO ADVISED THAT THEIR \"CAUSE AND ORIGIN SPECIALIST\" ADVISED THEM THAT THE FIRE WAS CAUSED BY A SHORT-OUT IN THE POWER MODULATOR.   I WOULDN'T WANT THIS TO HAPPEN TO ANYONE ELSE, AND I JUST WANTED YOU TO BE AWARE OF THIS.  WE WERE LUCKY ENOUGH TO BE ABLE TO WALK AWAY FROM THAT FIRE BUT OTHERS MIGHT NOT.  *NM",
        "vin": "YV1SW612462"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/21/2006",
        "dateOfIncident": "11/03/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10163097,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE SUDDENLY LOST POWER, COOLANT TEMPERATURE GAUGE WENT TO ZERO, AND ENGINE COOLING FANS RAN CONTINUOUSLY, EVEN THOUGH ENGINE WAS NOT OVERHEATING. ENGINE APPEARED TO BE OPERING IN \"LIMP HOME MODE\".  DEALERSHIP REPLACED TEMPERATURE SENSOR AND PROBLEM APPEARED TO BE RESOLVED. ONE WEEK LATER CHECK ENGINE LIGHT CAME ON. DEALERSHIP PERFORMED CALIBRATION ON NEW TEMPERATURE SENSOR AND PROBLEM APPEARED TO BE RESOLVED.  ONE WEEK LATER CHECK ENGINE LIGHT CAME ON AGAIN. DEALERSHIP REPLACED TEMPERATURE SENSOR AND COOLING FAN ASSEMBLY AND CALIBRATED NEW TEMPERATURE SENSOR.",
        "vin": "YV1SJ527462"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "10/10/2005",
        "dateOfIncident": "10/03/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10139198,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "NEW VOLVO V70 WAGON.  TESTED LAYING REAR SEATS DOWN TO INCREASE CARGO SPACE.  RIGHT REAR BELT WOULD NOT EXTEND AND WAS LOCKED IN A RETRACTED POSITION AFTER THE SEAT WAS LAYED DOWN AND RESTORED TO IT'S ORIGINAL OPERATING POSITION.  THIS SEAT AND BELT WERE NOT SUITABLE FOR OCCUPANCY AS THE SEAT BELT WOULD NOT FUNCTION.  CAR WAS RETURNED TO VOLVO FOR REPAIRS.  UNKNOWN TYPE OF REPAIR AT THIS TIME.  *JB    PHONE INTERVIEW UPDATE (OCT 11, 2005):  THE FAILURE IS INTERNAL TO THE RETRACTOR AND NOT CAUSE BY INTERFERENCE WITH THE SEAT.  PURCHASED THE VEHICLE WHILE TRAVELING OVERSEA IN SWEDEN.  VEHICLE IS BEING REPAIRED AND IS SCHEDULED TO SHIP TO U.S. BY THIS WEEK.  THE CONSUMER AGREE TO FAX THE TECHNICAL REPORT OR REPAIR INVOICE WHEN IT BECOMES AVAILABLE.  HIS SON'S 2005 VW JETTA REAR SEAT BELT DOES THE SAME THING.",
        "vin": "YV1SW612862"
    }
]