[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/02/2021",
        "dateOfIncident": "12/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398763,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 ACURA MDX. THE CONTACT STATED THAT THE VEHICLE EXPERIENCED ELECTRICAL FAILURES WHERE THE POWER DOORS UNLOCK AND LOCK WITHOUT WARNING. ADDITIONALLY, THE WINDOWS WOULD RAISE AND LOWER WITHOUT WARNING. THE VEHICLE WOULD LOSE POWER WITHOUT WARNING. THE VEHICLE WAS NOT TAKEN TO A DEALER OR INDEPENDENT MECHANIC TO BE DIAGNOSED. THE MANUFACTURER WAS NOT INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 84,000.",
        "vin": "2HNYD28367H"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/17/2020",
        "dateOfIncident": "08/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349871,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2007 ACURA MDX IS EXPERIENCING A COMMON PROBLEM WITH THE POWER STEERING PUMP. ACURA ISSUED AN EXTENSION ON THE WARRANTY FOR THIS ISSUE, BUT THAT EXTENSION ONLY LASTED SEVEN YEARS. AS SOMEONE WHO ACQUIRED THE CAR AFTER 2014 I WAS AUTOMATICALLY NOT QUALIFIED IN THIS COMMON PROBLEM. ACURA HAS ISSUED A RECALL FOR OTHER MODEL CARS BUILT IN THIS SAME YEAR USING THE SAME POWER STEERING PUMP. YET THE RECALL NHTSA CAMPAIGN ID: 12V222000 DOES NOT INCLUDE MODEL MDX. I WOULD LIKE TO KNOW \"WHY\" MDX WAS NOT ALSO PART OF THE RECALL SEEING AS THOUGH IT IS THE EXACT SAME SYMPTOMS, AND PARTS USED FOR THE POWER STEERING PUMP, HOSES, AND SEALS.",
        "vin": "2HNYD28497H"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/12/2020",
        "dateOfIncident": "03/31/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11320917,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RADIO AND NAVIGATION INTERMITTENTLY GO ON AND OFF WHILE DRIVING.MY ABS,CHECK EMISSION SYSTEM,SHAW-D WILL GO OFF. CAR WILL SHUT DOWN WHILE IM DRIVING AND I LOSE ALL POWER. I LOSE POWER TO LOCKS, WINDOWS AND BACK HATCH. SOME DAYS WHEN STARTING THE CAR IT WONT TURN OVER AND START UP. SOMEDAYS AFTER DRIVING AND I TURN THE CAR OFF, I LOSE ALL POWER. WHILE DRIVING THE CAR WILL JUMP INTO GEAR AS I AM ACCELERATING.",
        "vin": "2HNYD28427H"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/18/2019",
        "dateOfIncident": "12/18/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289796,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "OVER THE PAST TWO YEARS HAVE HAD TO INEXPLICABLY JUMP MDX WHEN IT FAILS TO START, USUALLY AFTER SITTING OVER NIGHT.  (CONFIRMED NO AUXILIARY POWER LEFT ON.) WILL BE FINE FOR A PERIOD OF TIME, AND SYMPTOMS REAPPEAR.  HAVE NOW CHANGED BATTERY TWICE IN PAST YEAR.  FOUR MONTHS AFTER MOST RECENT BATTERY CHANGE, BATTERY WAS DEAD AGAIN.  THIS TIME AFTER JUMPED THE CAR THREW SOME ADDITIONAL WARNING LIGHTS AROUND CHARGING SYSTEM.  AFTER TRYING TO RETURN TO THE PARKING SPACE, THE CAR STARTED WAS NOT DRIVING PROPERLY, SEEMS TO BE ELECTRICAL.  AFTER READING FORUMS ONLINE MY SYMPTOMS MATCH VERY CLOSELY TO OTHERS THAT HAVE A HANDSFREELINK ISSUE ON THIS MODEL MDX. (PARASITIC POWER DRAW.)     CONTACTING ACURA TODAY, AS THIS TIME THE CAR IS NOT DRIVE-ABLE.",
        "vin": "2HNYD28877H"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/21/2019",
        "dateOfIncident": "11/21/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281663,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE SHUTS OFF IN THE MIDDLE OF DRIVE ON THE ROAD REGARDLESS OF THE SPEED. WHEN THIS HAPPENS CAR LOST TOTAL ELECTRICAL POWER RESULTING IN BLACKOUT, NOT ABLE TO TURN ON HAZARD LIGHT ALSO, STEERING WHEEL IS TIGHT UNABLE TO TURN THE VEHICLE.. NEED TO RESET NAVIGATION CODE,  AND AUDIO CODES TO RESTART GPS NAVIGATION RESPECTIVELY. I WAS",
        "vin": "2HNYD28367H"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/29/2019",
        "dateOfIncident": "09/15/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11271756,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "HANDS FREE LINK DRAINING BATTERY AFTER SITTING FOR A COUPLE DAYS IT'S ON VARIOUS ACURA MODELS. PEOPLE MAKING YOUTUBE VIDEOS ON HOW TO UNPLUG THEM TO KEEP THE BATTERY FROM DRAINING. I BOUGHT THE CAR WITH THIS PROBLEM.",
        "vin": "2HNYD28217H"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/28/2019",
        "dateOfIncident": "08/27/2019",
        "fire": true,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11252090,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 9 PM MY MDX CAUGHT FIRE AND I DID NOT USE IT AFTER 11 AM THAT DAY SO IT WAS SITTING FOR 12 HOURS AND IT CAUGHT FIRE",
        "vin": "2HNYD28597H"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/13/2019",
        "dateOfIncident": "08/12/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11243441,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, THE CAR WILL FREQUENTLY LOSE ELECTRICAL POWER. DASH INDICATOR LIGHTS COME ON, THE RADIO SHUTS OFF AND SOMETIME I'LL HAVE TO RESET THE RADIO AND NAVIGATION CODES. WHILE AT A STOP LIGHT, SOMETIMES DEPRESSING THE GAS PEDAL DOES NOTHING AND THEN SUDDENLY IT WILL BEGIN TO MOVE. I'M VERY CONCERN THE UNPREDICTABLE NATURE OF THE PROBLEM WILL CAUSE A WRECK IF I LOSE ENGINE POWER, ESPECIALLY IN A CURVE.",
        "vin": "2HNYD28317H"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/04/2019",
        "dateOfIncident": "08/28/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217759,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "IN THE 2007 AND SOME LATER MODELS OF THE ACURA MDX THERE IS A POWER DRAIN DUE TO THE BLUETOOTH MODULE ON THE VEHICLE. IF VEHICLE SITS FOR MORE THAN 24 HOURS, IT HAS TO BE JUMP STARTED. I HAVE HAD TO REPLACE A BATTERY PREMATURELY DUE TO THE CONSTANT DRAIN. ACURA'S SOLUTION IS TO REPLACE THE BLUETOOTH MODULE AT THE CUSTOMERS EXPENSE. THE OTHER SOLUTION IS TO DISCONNECT THE BLUETOOTH MODULE CURRENTLY IN THE VEHICLE WHICH I HAVE DONE. WITH MORE STATES PASSING LAWS DUE TO THE DANGER OF BEING ON A CELLPHONE WHILE DRIVING, THIS FURTHER SEEMS LIKE IT SHOULD FALL UNDER A SAFETY RECALL. I FAIL TO SEE WHY THE CONSUMER SHOULD HAVE TO PAY TO CORRECT A MANUFACTURER DEFECT. IT SHOULD BE NOTED THAT I PURCHASED THIS VEHICLE USED AND CHECKED WITH ONLINE FORUMS TO FIND THE PROBLEM I'M REFERRING TO HAS BEEN A COMMON PROBLEM ACROSS THE BOARD.",
        "vin": "2HNYD28427H"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/28/2019",
        "dateOfIncident": "05/27/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11210301,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I TURNED THE STEERING WHEEL FULLY CLOCKWISE WITH THE CAR OFF WHILE IT WAS IN MY GARAGE.  AS I WAS STRAIGHTENING THE WHEEL, IT BECAME COMPLETELY LOOSE AS IF SOMETHING IN THE STEERING SHAFT OR A CONNECTION HAD BROKEN. THE STEERING WHEEL SPUN FREELY IN BOTH DIRECTIONS WITHOUT TURNING THE WHEELS.  THE LOWER U-JOINT THAT COUPLES THE SHAFT TO THE GEAR BOX BROKE.  I UNDERSTAND THERE IS GREATER FORCE ON THAT PART WHILE THE CAR IS OFF (NO POWER STEERING), BUT THE STRENGTH OF THAT JOINT SHOULD HAVE SUFFICIENT SAFETY MARGIN TO WITHSTAND THIS.  WHAT IF IT WAS JUST DAMAGED ENOUGH AT THAT POINT THAT IT STILL WORKED, BUT WENT ON TO FAIL IN THE HIGHWAY?  70 MPH AND NO WAY TO STEER THE CAR. SCARY. THE CAR IS OVER 10 YEARS OLD AND HAS JUST UNDER 200000 MILES, BUT I WOULD EXPECT A COMPONENT THIS CRITICAL TO BE ONE OF THE LAST THINGS TO FAIL ON A CAR.",
        "vin": ""
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/24/2019",
        "dateOfIncident": "01/23/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11171901,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2007 ACURA MDX WHICH HAS HAD A NUMBER OF INTERMITTENT ELECTRICAL PROBLEMS OVER THE YEARS.   I HAD TO REPLACE THE HANDSFREE LINK MODULE A FEW YEARS AGO AT THE DEALER.   THE YELLOW CHECK OIL LEVEL LIGHT HAS COME ON FOR NO REASON FOR YEARS. IT GOES ON FOR A SECOND THEN OFF.     A FEW MONTHS AGO THE ENTIRE ELECTRICAL SYSTEM 'FRIED' AND I HAD TO BUY A NEW BATTERY AND NEW ALTERNATOR.    RECENTLY I HEAR A BUZZING SOUND WHEN I USE THE TURN SIGNALS AND THE HAZARDS DO NOT WORK AT ALL.     LAST NIGHT THE CAR DIED ON THE INTERSTATE- THE INSTRUMENT PANEL WENT DARK, THE ENGINE WOULD NOT ACCELERATE, AND I WAS LUCKY TO BE ABLE TO GET ONTO THE SHOULDER. I TURNED OFF THE CAR AND THEN STARTED IT AGAIN.  WHEN IT WORKS THERE IS NO PROBLEM WITH THE OPERATION BUT THIS CAR IS NOW UNRELIABLE AND DANGEROUS.  I SEE THERE HAVE BEEN OVER 40 COMPLAINTS FOR THE SAME THING NOTED ON CARCOMPLAINTS.COM REFERRING TO THE  NHTSA WEBSITE, ABOUT THE CAR DYING FOR NO REASON WHILE IN MOTION AND THAT NO ACURA DEALER SEEMS ABLE TO FIX IT  AND ACURA REFUSES TO ACKNOWLEDGE THE PROBLEM OR DO A RECALL    THE CAR IS NOW AT MY MECHANIC TO SEE IF HE CAN FIND OUT WHAT IS WRONG BUT ALL THE COMMENTS I SAW ON CARCOMPLAINTS.COM INDICATE THERE HAS NOT YET BEEN A DEFINITIVE DIAGNOSIS MADE BY ACURA OR ANYONE ELSE, AND THERE IS NO ACTIVE RECALL EITHER    THIS IS EXTREMELY DANGEROUS AS THE OTHER COMPLAINTS ALSO INDICATE THAT THE DOORS AND WINDOWS DO NOT OPERATE WHEN THE CAR STALLS OUT AND OCCUPANTS CAN BE TRAPPED INSIDE THE CAR",
        "vin": "2HNYD28217H"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/13/2018",
        "dateOfIncident": "12/09/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11161131,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I'VE EXPERIENCED SEVERAL ELECTRICAL ISSUES ELECTRICAL WITH MY VEHICLE THE MOST TROUBLING WAS THE VEHICLE COMPLETELY SHUT OFF ON THE HIGHWAY THEN IMMEDIATELY RESTARTED!!!!  IN ADDITION TO THIS, THE NEXT ISSUE IS BATTERY PERFORMANCE. THE BATTERY IS CONSTANTLY DRAINED.  IN THE 11 YEARS THAT I OWNED THE VEHICLE, THE BATTERY HAS BEEN REPLACED  4 TIMES. (I INITIALLY THOUGHT THIS WAS ASSOCIATED WITH MY BLUETOOTH BEING CONNECTED BUT I'VE DISCONNECTED THIS MANY YEARS AGO AND THE ISSUES STILL PERSIST. I WAS STRAINED ON WINTER BECAUSE THE BATTERY DRAINED AND WAS STUCK AT THE AIRPORT FOR 3 1/2 HOURS WAITING FOR AAA.      LASTLY, I TURNED MY CAR ON THIS PAST SUNDAY WHEN MY MIL DISPLAY \"CHECK TRANSMISSION.\" I BROUGHT THE CAR TO ACURA FOR SERVICE AND THEY HAVE INFORMED ME THAT THE GEAR POSITION SENSOR MUST BE REPLACED.  THIS IS ANOTHER ELECTRICAL CIRCUIT PROBLEM OF A MECHANICAL PROBLEM WITH THE TRANSMISSION. TOO MANY ELECTRICAL ISSUES!!!",
        "vin": "2HNYD282X7H"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/20/2018",
        "dateOfIncident": "06/02/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11130525,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT THIS CAR ON MOTHER'S DAY 2017.  DURING THE FOLLOWING MONTH I HAD THE CHECK ENGINE LIGHT ON NON-STOP, I STARTED RECEIVING ERROR CODES, THEN ON THE WAY TO THE AIRPORT (ONE THE INTERSTATE), THE CAR LITERALLY TURNED OFF.  WE ROLLED TO THE AIRPORT WITH NO ELECTRICAL SYSTEM AT ALL, THEN THE CAR FINALLY DIED, THANK GOODNESS WE GOT OUT BECAUSE FOR A FEW MINUTES WE WERE LOCKED IN THE CAR!  WE REPLACED THE ALTERNATOR, THE BATTERY, 3 OF THE 4 (O2) OXYGEN SENSORS, NOW THE TRANSMISSION LIGHT, THE CHECK ENGINE LIGHT AND THE CHECK STARTING SYSTEM LIGHT ARE ON.  TODAY, THE CAR DIDN'T START TWICE AND I HONESTLY FELT AT RISK JUST TRYING TO DRIVE HOME TODAY.  SO ALL THIS HAS BEEN FROM MOTHER'S DAY 2017 TO NOW!  SEPTEMBER 20, 2018.  THE LIGHTS AND CODES DON'T STOP ON THIS CAR!",
        "vin": "2HNYD28367H"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/20/2018",
        "dateOfIncident": "07/19/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11112598,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 07 ACURA MDX HAS BEEN EXPERIENCING INTERMITTENT RESETS WHILE DRIVING. NAVIGATION AND RADIO TURN OFF AND ON AND THE VEHICLE DOES NOT ACCELERATE WHEN GAS PEDAL IS PRESSED.",
        "vin": "2HNYD28437H"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/19/2018",
        "dateOfIncident": "05/01/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11102713,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING SOME LIGHTS IN PANEL START LIGHTING UP, GPS TURNS OFF, ENGINE RUNNING BUT WONT ACCELERATE AND AFTER FEW SECONDS WILL GO BACK TO  NORMAL. TOOK TO ACURA THEY RAN DIAGNOSTICTEST BUT CAN'T FIND NO ISSUE. THIS IS LIFE THREATENING. NEED ACURA TO ACT ON THIS.",
        "vin": "2HNYD288X7H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/11/2017",
        "dateOfIncident": "10/18/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11053842,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL:  I RECENTLY PURCHASED MY VEHICLE FROM A USED CAR DEALERSHIP. SHORTLY AFTERWARDS, I WAS MAILED A HARD COPY OF AN AIRBAG SETTLEMENT CLASS ACTION LAWSUIT INVOLVING HONDA MOTORS AND TAKATA.  I HAVE THE NOTICE IN MY POSSESSION, CITING MY VEHICLE AS ONE OF THE DECLARED RECIPIENTS WITHIN THE SETTLED CLASS ACTION LAWSUIT. I AM SIMPLY CONDUCTING MY DUE DILIGENCE IN REPORTING MY VEHICLE AS IT HAS BECOME MY PROPERTY AND HENCE, MY NEW PROBLEM.",
        "vin": "2HNYD28207H"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/29/2017",
        "dateOfIncident": "09/29/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11030576,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 ACURA MDX. ON SEVERAL OCCASIONS, WHILE THE CONTACT'S GIRLFRIEND WAS DRIVING, THE VEHICLE INADVERTENTLY STALLED. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO COLUMBIA ACURA INC. (10979 MONTGOMERY RD, CINCINNATI, OH 45249 (513) 530-0100), BUT NO DIAGNOSTIC FAILURE CODES WERE FOUND AND THE FAILURE COULD NOT BE REPLICATED. THE VEHICLE WAS THEN TAKEN TO SUPERIOR ACURA (5555 DIXIE HWY, FAIRFIELD, OH 45014 (513) 829-8500) WHERE IT WAS DIAGNOSED THAT THE BATTERY CABLES NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED, BUT THE FAILURE RECURRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND CONFIRMED THAT NO RECALLS WERE ASSOCIATED WITH THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 100,000.",
        "vin": "2HNYD28337H"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/07/2017",
        "dateOfIncident": "08/07/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11013565,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "JUST LIKE THE OTHER COMPLAINTS THE CAR SHUTS OFF WITHOUT WARNING WHILE IN DRIVE CAUSING LOSS OF STEERING AND BRAKING.  ACURA HAS OFFERED LITTLE HELP WITH THE ISSUE.  VERY UNSAFE AND DESERVED OF A RECALL.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/30/2017",
        "dateOfIncident": "04/01/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11011542,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WIRING HARNESS FOR AIRBAG ERROR CODE CHECK AIRBAG 71-1",
        "vin": "2HNYD28897H"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/08/2017",
        "dateOfIncident": "06/06/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10993879,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WILL RANDOMLY SHUT OFF AND RESTART WHILE IN MOTION AT VARIOUS SPEEDS WHETHER ON THE HIGHWAY OR SURFACE STREETS. THERE DOES NOT APPEAR TO BE ANY RHYME OR REASON AS TO WHY.",
        "vin": "2HNYD28477H"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/04/2017",
        "dateOfIncident": "04/27/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10983467,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 ACURA MDX. WHILE DRIVING APPROXIMATELY 45 MPH, THE GPS AND INSTRUMENT PANEL LIGHTING CEASED WITHOUT WARNING. WHEN THE CONTACT DEPRESSED THE BRAKE PEDAL, THE LIGHTS ILLUMINATED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THAT THE ALTERNATOR NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED; HOWEVER, THE FAILURE RECURRED TWO DAYS LATER. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 103,500. THE VIN WAS NOT PROVIDED.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/05/2017",
        "dateOfIncident": "08/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10970701,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "BATTERY KEPT DRAINING AND WAS DEAD ON A FEW OCCASIONS. I CAME OUT TO A DEAD BATTERY ON TWO OCCASSIONS AND THEN DECIDED TO TAKE CAR TO ELECTRICAL REPAIR SHOP.  PROBLEM WAS WITH THE BLUETOOTH.  THIS IS A WIDELY REPORTED PROBLEM WITH THIS VEHICLE. ELECTRICAL SHOP DISCONNECTED BLUETOOTH.  HONDA IS AWARE OF THIS PROBLEM YET DOES NOTHING ABOUT IT IN FORM OF RECALL.",
        "vin": "2HNYD28277H"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/05/2017",
        "dateOfIncident": "01/04/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10970704,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "CAME OUT TO A DEAD BATTERY AFTER REPLACING BATTERY JUST A FEW MONTHS EARLIER.  AFTER ALREADY GOING THROUGH THE ELECTRICAL PROBLEM OF THE DEFECTIVE BLUE TOOTH, KNEW IT WAS ANOTHER ELECTRICAL PROBLEM.  TOOK CAR TO MY LOCAL SHOP WHERE HE DIAGNOSED ANOTHER ELECTRICAL PROBLEM, THIS TIME WITH THE AIR CONDITIONER RELAY/COMPRESSOR SWITCH.  I DO NOT WANT TO BE WITHOUT AIR CONDITIONING, SO HAD THEM FIX THE PROBLEM.  THIS IS THE SECOND ELECTRICAL PROBLEM WITH THE 10 YEAR OLD MDX WITH ONLY 90,000 MILES.  THIS VEHICLE HAS SERIOUS ELECTRICAL PROBLEMS AND THEY ARE BEING IGNORED BY HONDA MOTORS.  I HAVE READ MANY INSTANCES ONLINE OF PEOPLE WHO HAD THIS SAME VEHICLE AND THE CARS HAVE CAUGHT ON FIRE FROM THESE VARIOUS ELECTRICAL PROBLEMS",
        "vin": "2HNYD28277H"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/05/2017",
        "dateOfIncident": "03/31/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10970707,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "HAD A BIG RAIN STORM THE OTHER DAY. GOT INTO MY CAR AFTER IT BEING PARKED AT WORK ALL DAY AND FOUND IT WAS LEAKING FROM \"C\" PILLAR.  TURNS OUT, SUNROOF DECIDED TO FLIP UP ON ITS OWN DURING THE DAY WITH THE CAR PARKED AND OFF.  TOOK CAR TO MY LOCAL SHOP WHO HAS BEEN FAMILIAR WITH ACURA ELECTRICAL PROBLEMS.  I TOLD HIM TO DISCONNECT THE WIRES TO THE SUNROOF FUNCTION COMPLETELY.  I DONT NEED TO USE THE SUNROOF OR HAVE IT DECIDE TO OPEN ON ITS OWN AGAIN.  THIS PROBLEM COULD HAVE CAUSED EVEN MORE SERIOUS ELECTRICAL PROBLEMS, BUT LUCKILY WATER DID NOT PENETRATE TO THE OTHER ELECTRICAL SYSTEMS.  THIS IS THE THIRD MAJOR ELECTRICAL PROBLEM I HAVE HAD WITH THIS VEHICLE.  THERE ARE SERIOUS ELECTRICAL PROBLEMS WITH THE MDX AND ACRUA/HONDA REFUSES TO ISSUE ANY RECALL OR EVEN ADDRESS THE PROBLEMS, WHICH ARE PROMINENT IN THIS VEHICLE",
        "vin": "2HNYD28277H"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/19/2017",
        "dateOfIncident": "03/12/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10967029,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A MULTIPLE CLUNKING SOUNDS THAT OCCUR ON EVERY BUMP OR WHEN DRIVING ON IROUGH SURFACES!!!! I HAVE TAKEN THE MDX IN SEVERAL TIMES AND THE BUSHINGS ARE GOOD ON THE TIE RODS ETC..I AM NOW REPLACING THE TIRES AGAIN DUE TO EXCESSIVE WEAR IN A SHORT PERIOD OF TIME!!  I JUST READ ABOUT A STRUT RECALL TO DAY ON THE INTERNET.. I NEVER  RECIEVED ANY NOTICE... THIS PROBLEM HAS BEEN ONGOING FOR A YEAR!! I THOUGHT IT WAS JUST THE FRONT UNDERCARRIAGE GUARD THAT HAS A CRACK IN IT FLEXING, MAKING THE NOISE&#128556.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/07/2017",
        "dateOfIncident": "12/31/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10950129,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL - SIDE AIRBAGS INFLATED WHILE VEHICLE WAS PARKED IN MY HOME DRIVEWAY DURING THE NIGHT OF DECEMBER 31 2016 & JANUARY 1,2017",
        "vin": "2HNYD28357H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/04/2017",
        "dateOfIncident": "12/31/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10949574,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERIOR LEFT & RIGHT AIRBAGS INFLATED WHILE PARKED IN MY DRIVEWAY AT NIGHT, KEYS REMOVED, SECURITY SYSTEM ENGAUGED BETWEEN AFTERNOON OF 12/31/2016 AND MORNING  1/1/2017.",
        "vin": "2HNYD28357H"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/24/2017",
        "dateOfIncident": "01/24/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10947487,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "ACURA MDX 2007, VEHICLE ENGINE AND ELECTRICAL SYSTEM STOPPED WHILE CAR IS MOTION ON FREEWAY ON MY WAY TO WORK ON JANUARY 24, 2017 ABOUT 6:35 AM ON 610 LOOP PASSED THE STELLA LINK EXIT. I HAD TO MERGE OVER TO THE EDGE OF FWY TO RESTART THE CAR. THE DASH BOARD LIGHTS AND CAR TURNED OFF COMPLETELY WHILE IN DRIVING MODE, GOING ABOUT 60 MPH. VERY SCARY AND UNUSUAL.  THIS IS A LIFE TREATING INCIDENT AND NEEDS AN IMMEDIATE RECALL. THERE ARE NUMEROUS ONLINE COMPLAINTS ABOUT THIS ISSUE, SO WHY ISN'T THERE A RECALL. ARE THEY WAITING FOR SOMEONE TO GET FATALLY INJURED OR WORST? THIS PROBLEM DEMANDS IMMEDIATE ATTENTION!  *TR",
        "vin": "2HNYD28227H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/09/2017",
        "dateOfIncident": "01/08/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10943870,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 ACURA MDX. WHILE THE VEHICLE WAS PARKED OVERNIGHT THE FRONT DRIVER AND PASSENGER SIDE AIR BAGS INDEPENDENTLY DEPLOYED WITHOUT WARNING. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS UNKNOWN. UPDATED 03/17/17*LJ  *AS",
        "vin": "2HNYD28357H"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/17/2016",
        "dateOfIncident": "11/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10926696,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2007 MDX WITH ABOUT 125,000 MILES ON IT.  I RECEIVED A NOTIFICATION DARED NOVEMBER 2016 FROM ACURA THAT THE FRONT AND REAR ACTIVE DAMPERS MIGHT BE BAD. THE VEHICLE MAKES CLUNKING AND BANGING SOUNDS WHEN I DRIVE ON ROUGH ROADS OR GO OVER SPEED BUMPS AND I BELIEVE THAT THE DAMPERS ARE BAD.      I REQUESTED A REVIEW, CASE 05228502 AND WAS IMMEDIATELY REJECTED BY AN ACURA EMPLOYEE IN TORRANCE CA.   THIS IS THE FIRST MODEL YEAR TO BE RECALLED AND I BELIEVE THAT MOST ARE OVER THE 100,000 MILE LIMIT.",
        "vin": "2HNYD28877H"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/25/2016",
        "dateOfIncident": "10/24/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10918843,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HANDS FREE LINK UNIT HAS AN ISSUE WHERE IT STOPS WORKING AND DRAINS THE BATTERY OF THE CAR.  I'VE GONE THROUGH 3 BATTERIES IN THE LAST 6 MONTHS AND WHEN I FINALLY DISCONNECTED THE HFL UNIT, THE CAR HAS BEEN WORKING PROPERLY.",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/25/2016",
        "dateOfIncident": "07/19/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10918846,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, THE FRONT WHEEL BEARING WOULD HAVE A NOISE OR VIBRATION. LIKE MOANING, DRONING, OR HUMMING, COMING FROM FRONT RIGHT SIDE.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/10/2016",
        "dateOfIncident": "10/04/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10915051,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVING ISSUES WITH THE DRAINAGE OF BATTERY. THREE IN ONE YEAR. THE CULPRIT WAS THE HANDS FREE LINK AND XM RADIO. THE BLUETOOTH FEATURES IN THIS CAR HAS CAUSED IT TO SHUTDOWN COMPLETELY SEVERAL TIMES OR NOT START UP. AFTER SEARCHING ONLINE, THIS HAS BEEN THE COMPLAINT BY THOUSANDS OF OTHER ACURA MDX 2007. THIS IS DANGEROUS AND MAY CAUSE CAR ACCIDENTS. THIS IS TOO COMMON AN ISSUE TO NOT RECALL THESE PARTS.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/30/2016",
        "dateOfIncident": "09/29/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10910702,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "BATTERY KEEPS DYING EVEN AFTER BUYING A NEW ONE.  IT HAPPENDS EVEN AFTER BEING PARKED JUST FOR A FEW HOURS  ONE DAY THE CAR STOPPED COMPLETETLY AND SUDDENTLY WHILE DRIVING",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/06/2016",
        "dateOfIncident": "02/09/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10903863,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ACTIVE DAMPER SYSTEM (ADS) ON MY ACURA MDX HAS BEEN MALFUNCTIONING AND HAS CAUSED THE STRUTS TO FAIL ON BOTH THE FRONT AND REAR. REQUIRING IT TO BE REPLACED. THERE ARE A NUMBER OF ISSUES RELATED TO THE ADS SYSTEM THAT HAVE BEEN IDENTIFIED IN RESPECTIVE FORUMS BY CUSTOMERS. ACURA CANADA HAS EXTENDED THE WARRANTY TILL THE END OF THE YEAR (2016), HOWEVER, ACURA AMERICA IS NOT WILLING TO ACKNOWLEDGE THE DEFECT. I AM FROM CANADA, HOWEVER, MY VEHICLE IS FROM THE US AND I HAVE HAD TO SPEND DOLLARS TO REPLACE THE STRUTS WHILE CUSTOMERS IN CANADA ARE GETTING THEIRS REPLACED OR REIMBURSED WHEN THERE IS AN ISSUE WITH THE STRUCTS OWING TO THE EXTENDED WARRANTY.",
        "vin": "2HNYD28577H"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/05/2016",
        "dateOfIncident": "08/31/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10903607,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS THE THIRD TIME THE ELECTRICAL SYSTEM HAS FAILED CAUSED BY \"BATTERY DRAINAGE\". LOCAL REPAIR SHOPS DO NOT KNOW HOW TO FIX PROBLEMS, BUT DEALER'S AND HONDA MECHANICS ARE VERY FAMILIAR WITH THIS HORRIBLE PROBLEM. EVERYONE FIXING THE PROBLEM KNOWS VERY WELL THIS SHOULD BE \"A RECALL\" MATTER, AND CREATES A GREAT ROAD HAZARD AS WELL ARE GARAGE FIRES AND LOSS OF LIFE. THE THINGS INVOLVED ARE \"BLUE TOOTH\" MODULAR, AIR CONDITIONER CLUTCH RELAY, FUSES. REGARDING THE BLUE TOOTH, THIS MODULAR GETS VERY VERY HOT, AND COULD CAUSE A FIRE!! WHEN THE BATTERY FAILS TO CHARGE WHILE DRIVING TO GET SAFELY OFF THE HIGHWAY IS VERY DANGEROUS, MUCH WORST AT DARKNESS!!  HONDA NEEDS TO GET THEIR ACT TOGETHER AND RECALL AND FIX THESE PROBLEMS NOW.  MY EXPERIENCE HAPPENED WITH THE CAR IN MOTION, AND ALL INDICATORS FLASHING, REAR AXLE NOISES, HEAT INSIDE CAR, LOSS OF POWER, AND VEHICLE IN \"KIND OF, A LIMPING MODE\".  VERY SCARY AND DANGEROUS OCCURRENCE. WE ARE THE ORIGINAL OWNER OF THE CAR, NOW WITH 140,000 MILES, AND ALWAYS SERVICED EVERY 3-5,000 MILES. WE HAVE TAKEN PRIDE IN THIS VEHICLE, UNTIL THIS \"BATTERY DRAINAGE\" PROBLEM, NOW IS EFFECTING OUR THOUGHTS ABOUT HONDA MOTORS.",
        "vin": "2HNYD28387H"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/21/2016",
        "dateOfIncident": "08/20/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10897406,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2007 ACURA MDX DIES ALMOST EVERYDAY BATTERY DRAINAGE. REPLACE THE HFL MODULE AS WELL AS THE AC RELAY. YET BATTERY STILL DRAINS ALMOST EVERYDAY AND HAVE TO JUMP START IT JUST TO LEAVE FOR WORK.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/20/2016",
        "dateOfIncident": "03/10/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10875366,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "BATTERY KEEPS DRAINING DUE TO HFL MODULE. REPLACED BATTERY AND STILL KEEPS ON DRAINING. HFL UNIT HOT ENOUGH TO MELT PLASTIC AND POSSIBLE FIRE HAZARD. THIS ISSUE HAS BEEN REPORTED BY HUNDREDS IF NOT THOUSANDS OF MDX DRIVERS AND ACURA SAYS THEY NEVER HEARD ABOUT IT. YEA RIGHT! FOR THE PRICE OF THE VEHICLE THAT WE ALL PAY FOR WE EXPECT GREAT RESULTS. ACURA YOU NEED TO RECALL AND REPLACE THE HFL MODULES BEFORE THIS CAUSES A CAR FIRE AND POSSIBLE HOUSE FIRE.",
        "vin": "2HNYD28817H"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/03/2016",
        "dateOfIncident": "06/05/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10872343,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 ACURA MDX. EACH MORNING WHEN THE CONTACT ATTEMPTED TO START THE VEHICLE, IT WOULD FAIL TO START. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE THE CAUSE OF THE FAILURE COULD NOT BE DIAGNOSED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 120,000.",
        "vin": "2HNYD28347H"
    },
    {
        "components": "SUSPENSION,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/19/2016",
        "dateOfIncident": "02/16/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10837170,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 07 ACURA MDX 1 MONTH AGO WITH 115,500 MILES AND GOT THE EXTENDED POWER TRAIN WARRANTY.  HALL NISSAN PULLED THE VEHICLE OFF HALL ACURA'S LOT.  THEY PRINTED OUT A RECEIPT FROM ALL THE WORK ACURA DID BEFORE I BOUGHT THE CAR, AND ENSURED ME NOTHING WAS WRONG WITH IT THAT IT WENT THROUGH A 150 POINT INSPECTION.  I TOOK IT TO ACURA 2.5 WEEKS AFTER I BOUGHT IT BECAUSE THE CHECK ENGINE LIGHT CAME ON AND A TRANNY CODE POPPED UP.  THEY DIAGNOSED THE CAR AND FOUND $7,000 WORTH OF MALFUNCTIONING EQUIPMENT.  TRANSMISSION RANGE SENSOR, BOTH FRONT STRUTS, AC COIL AND MAGNETIC CLUTCH, FRONT CV AXLE BOOT LEAKING, REAR SHOCKS, REAR SWAY BAR BUSHINGS, TRANSMISSION COOLER HOSE LEAKING.  I HAVE SPOKEN WITH NUMEROUS MANAGERS ABOUT THIS, THEY WONT REPLACE THE CV AXEL ASSEMBLY (SUGGESTED FIX), THE TRANSMISSION COOLER LINE (SUGGESTED FIX), OR FRONT STRUTS OR BACK SHOCKS WHICH FAILED UPON INSPECTION.  THEY ARE TELLING MY WARRANTY WONT COVER IT BECAUSE I HAVEN'T OWNED THE VEHICLE FOR 60 DAYS.  THEY NEED TO FIX THIS.  THEY SHOULD NOT HAVE SOLD ME A CAR TELLING ME EVERYTHING IS OK AND WHEN I TAKE IT BACK TO THE SAME ACURA SERVICE SHOP THAT DID THE ORIGINAL INSPECTION 2 WEEKS LATER THERE IS NOW $7,000 WORTH OF DAMAGE.  THERE IS A FEW THINGS WRONG WITH IT THAT WAS SAID WAS FIXED ON THE ORIGINAL WORK ORDER THAT THEY NEVER DID.  WHEN I GO OVER BUMPS THE SUSPENSION MAKES A CLUNK FROM THE FRONT.  AFTER RESEARCHING ONLINE MANY PEOPLE HAVE THE SAME ISSUE.",
        "vin": "2HNYD28817H"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/20/2015",
        "dateOfIncident": "06/25/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10811308,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "SEVERAL TIMES, THE ELECTRICAL SYSTEM SHUTS OFF WHILE DRIVING.  I WAS LUCKY TO BE IN THE NEIGHBORHOOD AND NOT ON A HIGHWAY.  THE DEALER STATED THERE IS A PROBLEM WITH THE BLUETOOTH AND WE HAVE HAD IT REPLACED.  THIS IS THE SECOND TIME THIS HAS OCCURED.  THE FIRST TIME IT HAPPENED, THE BLUETOOTH WAS UNDER ACURA WARRANTY.  IT WAS EXPLAINED TO ME THAT THE BLUETOOTH IS DRAWING ENERGY CONSTANTLY AND THE DEALER SUGGESTED WE DISCONNECT IT TO AVOID THE SAME ISSUE HAPPENING AGAIN.  BUT THAT IS THE REASON I HAD BOUGHT THE CAR IN 2007.  IT HAD INTEGRATED BLUETOOTH.  THE TIMES THE CAR OFF WHILE DRIVING LUCKILY WAS AT A TRAFFIC LIGHT AND IN OUR NEIGHBORHOOD.  I JUST HOPE IT DOES NOT HAPPEN WHILE WE ARE ON THE HIGHWAY.  ACURA ALSO STATED THAT MAYBE THE WIRING TO THE BATTERY WAS STRETCHED AND I HAD TO PAY TO REPLACE IT.  I HAVE NEVER HAD TO REPLACE THAT WIRE.  I BELIEVE THE BLUETOOTH AND ITS CONTROLS ARE A DEFECTIVE DESIGN BUT ACURA DOES NOT WANT TO ADMIT IT.",
        "vin": "2HNYD28217H"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/08/2015",
        "dateOfIncident": "12/06/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10809130,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "RELATED TO HANDS FREE LINK WHICH HASN'T WORK IN TWO YEARS. I HAVE REPLACED THE BATTERY SEVERAL TIMES (ONCE TWICE ONE WEEK, UNDER WARRANTY). I REPLACED THE BATTERY A WEEK AGO AND ASK THEM TO PLEASE RESET HANDS FREE LINK (A REQUEST I MAKE EVERY TIME THE CAR IS SERVICED) AND MY CAR NAV FLICKERS NOW. TWO DAY AGO THE CAR MOMENTARILY LOST POWER WHILE I WAS DRIVING IN TOWN!!!!!!! I WAS FORTUNATE TO BE ON  STREET WITH 35MPH SPEED LIMIT AND NO OTHER CARS. IT WAS TERRIFYING.",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/04/2015",
        "dateOfIncident": "12/01/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10808526,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL I HAVE A COMPLAINT ON ACURA MDX 2007 SPORT ENTERTAINMENT ON REPLACING STRUTS. THE VALUE ON REPLACING THEM IS RIDICULOUSLY EXPENSIVE AND I HAVE READ SOME MANY COMPLAINTS ABOUT THE SAME ISSUE THAT THEY NEED TO BE REPLACE EVERY 50,000 MILES COULD THIS BE A RECALL BECAUSE REPLACING THEM EVERY 50,000 MILES AT A HIGH VALUE IS TO EXPENSIVE.",
        "vin": "2HNYD28807H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/17/2015",
        "dateOfIncident": "11/17/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10794417,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TORQUE CONVERTER JUDDER IS FELT WHILE DRIVING WITH GROWLING AND VIBRATION FROM THE TRANSMISSION WHEN GOING 35-40 MPH.",
        "vin": "2HNYD28417H"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/16/2015",
        "dateOfIncident": "05/11/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10790575,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSTANTLY HAVING ELECTRICAL PROBLEMS.  WE WENT ON  A VACATION AND CAME BACK TO FIND THE BATTERY COMPLETELY DEAD.  TOOK IT IN AND THEY DIAGNOSED THE PROBLEM AS A BAD HANDS FREE UNIT WHICH WAS REPLACED.  NOW WE ARE HAVING ALL KINDS OF ELECTRICAL PROBLEMS.  EACH TIME WE TURN THE CAR ON THE AUTO SETTING TOGGLE BETWEEN DRIVER 1 AND DRIVER 2 SETTINGS.  OCCASIONALLY YOU HEAR A POP ON THE SPEAKERS WHEN YOU START THE ENGINE.    NOW WE HAVE THE CHECK AIRBAG SYSTEM LIGHT COME ON AND WON'T GO OFF.  THIS CAR HAS BEEN A MONEY PIT WITH ELECTRICAL PROBLEMS THAT NOBODY SEEMS TO BE ABLE TO DIAGNOSE.  WE HAVE SPENT OVER $1000 TRYING TO FIGURE IT OUT WITH NO LUCK.",
        "vin": "2HNYD28307H"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/30/2015",
        "dateOfIncident": "10/30/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10787287,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "1.TODAY WHEN I WENT OUTSIDE TO  START MY 2007 MDX, THE \"CHECK STARTER SYSTEM\" LIT UP.  I WAITED ABOUT 30 SECONDS AND TRIED AGAIN, MY VEHICLE STARTED UP.  GOT TO WORK 1 HOUR LATER, TURNED CAR OFF AND BACK ON WITHOUT ISSUE.  HOPING IT STARTS AFTER WORK.  THIS PROBLEM JUST SEEMED TO HAPPEN OUT OF NO WHERE.  MY BATTERY IS FINE BUT DID HAVE PROBLEMS ABOUT 8 MONTHS AGO WHERE I ENDED UP HAVE TO PAY APPROXIMATELY $300 TO HAVE BATTERY CABLES/CONNECTOR REPLACED BY THE ACURA DEALERSHIP.  THE FUSE IN THE CABLE OR CONNECTOR WENT BAD.",
        "vin": "2HNYD28357H"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/26/2015",
        "dateOfIncident": "10/25/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10785925,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 ACURA MDX. WHILE DRIVING AT 22 MPH IN INCLEMENT WEATHER, THE STEERING WHEEL SEIZED AS THE CONTACT VEERED TO THE LEFT LANE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 106,492.",
        "vin": "2HNYD284X7H"
    },
    {
        "components": "AIR BAGS,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/29/2015",
        "dateOfIncident": "09/01/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10778390,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS A TEST FROM VOLPE. PLEASE IGNORE",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/10/2015",
        "dateOfIncident": "07/10/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10733303,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTING IN FALL 2011 WITH APPX 60,000 MILES ON THE VEHICLE WHEN DRIVING AND STOPPED AT A LIGHT OR IN TRAFFIC STOPPED THE CAR WILL NOT DRIVE WHEN YOU PRESSED THE GAS PEDAL, THE ENGINE WILL REV LIKE IT IS NUETRAL AND IF YOU KEEP PRESSING IT WILL ROLL A LITTLE AND FINALLY BREAK FREE AND DRIVE AGAIN.  IF YOU PUT THE CAR IN NUETRAL OR PARK IT RESETS IT SELF AND WORKS FINE, OTHERWISE IT SOMETIMES WILL KEEP HAPPENING AND OTHER TIME THE CAR DRIVES LIKE IT IS NOT SHIFTING PROPERLY. IT DID THIS ONCE IN WHILE AT FIRST WITH CONDITIONS OF BEING HOT OUTSIDE AND AC ON IN CAR.  DEALER COULD NOT DUPLICATE.  IN 2014 THE CAR DID IT AND WHEN IT BROKE FREE IT WAS JERKING AT 20 MPH AND 40 MPH ALL THE WAY TO THE DEALER, I DID NOT TURN THE CAR OFF NOR TAKE OUT OF DRIVE, UPON GETTING TO THE DEALER.  THEY HOOKED UP A COMPUTER AND DECIDED IT WAS THE TRANSMISSION.  THEY REPLACED IT AND FOUND THOUGHT IT WAS FIXED. A COUPLE WEEKS LATER IT DID IT AGAIN, THIS TIME THEY REPLACE A COMPUTER.  THEY WEATHER GOT COLDER AND NO ISSUES UNTIL SPRING 2015 WHEN IT STARTED AGAIN.  ONCE AGAIN IT GOT HOT OUT AND THE AC WAS ON IN THE CAR.  THE NAVIGATION WAS RESETTING AS WELL AS THE CAR JERKING LIKE MENTIONED BEFORE.  DROVE IT DIRECTLY TO THE DEALER AGAIN WITHOUT TAKING OUT OF DRIVE THEY HOOKED UP THE COMPUTER AGAIN AND SAID IT WAS THE TRANSMISSION AND REPLACED IT AGAIN.  WE PUT IN A NEW CAR BATTERY AS WELL AT THAT TIME THINKING MAYBE T HAD SOMETHING TO DO WITH NAVIGATION RESETTING.  A FEW DAYS LATER IT STARTED AGAIN.  WENT TO THE DEALER AGAIN, THEY COULD NOT DUPLICATE.  THE ISSUE IS STILL OCCURRING AND WE FEEL THAT ACURA IS NOT TAKING THIS SERIOUSLY.  ACURA CUSTOMER SERVICE WILL ONLY DO WHAT THE COMPUTER SAYS IS WRONG AND CLEARLY IT IS NOT THE ISSUE SINCE ONCE YOU TURN THE CAR OFF OR TAKE OUT OF DRIVE IT WILL OT GIVE A CODE.",
        "vin": "2HNYD28337H"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/09/2015",
        "dateOfIncident": "03/18/2015",
        "fire": true,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10732942,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER NOTICED SMOKE COMING FROM ENGINE AREA WHILE DRIVING, ELECTRICAL SYSTEMS STARTED SHUTTING DOWN.  DRIVER WAS ABLE TO PULL TO SIDE OF ROAD, WITHIN 1 MINUTE ENGINE WAS IN FLAMES.",
        "vin": "2HNYD28327H"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/25/2015",
        "dateOfIncident": "06/18/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10730377,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR CONSTANTLY LOSES POWER OR GET WARNING LIGHT STATING I NEED TO CHECK MY STARTING SYSTEM.  HAVE REPLACED THE BATTERY 3 TIMES THIS YEAR, REPLACED THE ALTERNATOR TWICE AND HAVE REPLACED THE STARTER ONCE.  SOMETIMES CAR DOES NOT LOSE POWER ALL THE WAY, BUT WILL LOSE FUNCTIONALITY OF WINDOWS, TURN SIGNALS, WINDSHIELD WIPERS, RADIO, AC AND ANY OTHER FUNCTION ALTHOUGH CAR WILL STILL DRIVE.  INSIDE THE ARM REST IS USUALLY EXTREMELY HOT WHEN THIS HAPPENS.  SO HOT THAT IT BURNS YOUR HAND TO THE TOUCH.  AFTER READING OVER 20 COMPLAINTS ON THIS SAME TYPE OF ISSUE, IT SEEMS TO BE CAUSED BY THE HANDSFREE LINK IN THE CAR, WHICH I HAVE NOT BEEN ABLE TO USE BECAUSE IT STOPPED WORKING COMPLETELY BACK IN MARCH 2014.  THIS ISSUE NEEDS TO BE RECALLED BEFORE SOMEONE IS SERIOUSLY INJURED OR WORSE!",
        "vin": "2HNYD28447H"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/13/2015",
        "dateOfIncident": "06/01/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10725085,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MY HUSBAND AND I  PURCHASED A USED 2007 MDX ACURA 2 YRS AGO AND HAVE EXPERIENCED EVERYTHING FROM BAD TIRES TO SUSPENSION TO DVD TO BATTERY PROBLEMS.  WE HAD OUR VEHICLE SERVICED AT A HONDA DEALER AND WAS GIVEN AN ESTIMATE OF WHAT IT WOULD COST TO HAVE STRUTS DONE AND GIVEN A QUOTE OF APPROXIMATELY $1350.  WHEN I RETURNED TO HAVE THE SERVICE DONE, I WAS ENCOURAGED TO HAVE THE TIMING BELT DONE EVEN THOUGH IT WAS NOT AS VITAL AS GETTING THE STRUT WORK DONE.  SO I HAD THE TIMING BELT DONE.  NOW OUR WARRANTY HAS EXPIRED AND WE ARE STILL EXPERIENCING STRUT PROBLEMS. NO ONE SHOULD BE EXPERIENCING THESE KINDS OF ISSUES ON A VEHICLE THEY HAVE ONLY HAD FOR 2 YRS.  WE BOUGHT THE VEHICLE AT ABOUT 68,000 MILE. IT NOW HAS ROUGHLY 110,000.  ON SEVERAL OCCASIONS, THE TRUCK WOULD NOT START AND HAD TO BE BOOST.  THERE WAS NOTHING GOING ON THAT WOULD HAVE CAUSED THE BATTERY TO DIE, IN FACT THE BATTERY WAS CHECKED AT THE HONDA DEALERSHIP AND I WAS TOLD THE BATTERY WAS GOOD.  WE HAVE PUT TOO MUCH MONEY ALREADY INTO THIS VEHICLE FOR REPAIRS AND IT IS SIMPLY NOT WORTH IT.  I WOULD NOT RECOMMEND THIS VEHICLE TO ANYONE.  THE DVD ON OCCASIONS DOES NOT WORK AND WE GET SOME TYPE OF READ ERROR.  FOR THE AMOUNT WE SPEND EVERY MONTH ON THIS CAR, THIS IS UTTERLY RIDICULOUS.",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/21/2015",
        "dateOfIncident": "05/01/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10717868,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR IS EQUIPPED WITH SPORT SUSPENSION.  SHOCK MOUNT HAD BEEN RATTLING FOR MONTHS, TAKEN TO DEALER MULTIPLE TIMES.  AFTER SCOURING INTERNET FOR A CAUSE, FOUND MANY COMPLAINTS IN MDX FORUMS ABOUT SPORT SUSPENSION SHOCK MOUNTS BREAKING.  TOOK BACK TO DEALER, CAUSE WAS CONFIRMED.  THE CONCERN IS THAT THESE SHOCKS COST $1000 EACH, THEY ARE A DEALER ONLY ITEM, AND JUST 10 MINUTES OF RESEARCH ONLINE WILL DEMONSTRATE THAT THIS IS A KNOWN ISSUE AND MOST CUSTOMERS DON'T GET ANY OR MUCH DEALER PARTICIPATION IN THE REPAIR.  BEFORE THE REPAIR, THE CAR WAS MOST DEFINITELY UNSAFE, AND IT IS FRUSTRATING THAT THE DEALER DID NOT DIAGNOSE THE ISSUE, I DID.",
        "vin": "2HNYD28857H"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/02/2015",
        "dateOfIncident": "12/04/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10691449,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 ACURA MDX. THE CONTACT STATED THAT THE VEHICLE FAILED TO START. THE TERMINAL BATTERY WAS REPLACED ON SEVERAL OCCASIONS, BUT THE FAILURE RECURRED. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC WHO WAS UNABLE TO DIAGNOSE THE FAILURE. THE VEHICLE WAS TAKEN TO THE DEALER WHO DIAGNOSED THAT THE WIRING HARNESS NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 93,000.",
        "vin": "2HNYD28417H"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/22/2015",
        "dateOfIncident": "01/21/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10678205,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "BACK GLASS BROKE ALL OF A SUDDEN. NO EXPLANATION TO IT...  IT SEEMS LIKE IT HAS HAPPEN TO A LOT OF PEOPLE WHO OWNS HONDA/ACURA.  I  OPENED MY VEHICLE GOT  IN IT WHEN I CLOSE MY DOOR  HEARD LIKE A PIECE OF GLASS FALL IN THE CAR WITHOUT NOT KNOWING  WHAT IT WAS. GOT OFF AND TOOK A LOOK AROUND WHAT I SEE A THE BACK GLASS IT WAS SHATTERED.  I WENT AROUND TO LOOK AT IT AND THE CORNERS OF BOTH SIDES WERE BROKEN AND THE WHOLE GLASS SHATTERED NO EXPLANATION TO IT  KEPT LOOKING AROUND TO SEE WHAT HAPPENED WENT TO THE INTERNET DID SOME RESEARCH ON IT AND THIS HAS HAPPEN TO A LOT OF PEOPLE BROKEN GLASS WITHOUT A REASON AFTER A LOT OF RESEARCH I REALIZED THAT IS A DEFECT PROBLEM FROM ACURA/ HONDA SPECIALLY ON THE MDX'S SIDE WINDOW,  BACK GLASS AND A LOT OF GLASS PARTS . IT HAS TO DO WITH LIKE A PIECE OF RUBBER OR METAL . I'M NOT A GLASS  MAN SO THIS IS JUST WHAT HAPPEN TO ME. NOW  JUST WAITING FOR THE GLASS COMPANY TO CALL ME TO SEE WHAT ARE THEY GONNA DO ABOUT IT. BEING A DEFECTIVE PROBLEM AND PUTTING PEOPLE ON RISK ACURA / HONDA SHOULD TAKE CARE OF IT WITHOUT ME USING MY INSURANCE COMPANY...A  50000 DOLLAR SUV WITH THOSE ISSUES SHOULD BE TAKEN CARE BY ACURA.  *TR",
        "vin": "2HNYD284X7H"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/06/2015",
        "dateOfIncident": "07/04/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10670385,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HANDS FREE LINK (HFL) ON THIS 2007 ACURA MDX FAILED TO WORK. THE DEVICE PROVIDES FOR SAFE HANDS FREE OPERATION OF THE VEHICLE AND TALKING ON A BLUETOOTH PAIRED PHONE. IN ADDITION IT PROVIDES FOR SAFE OPERATIONS OF VARIOUS SETTINGS OF THE VEHICLE W/OUT HAVING TO TAKE YOUR HANDS OFF THE STEERING WHEEL.    AFTER RESEARCHING THE PROBLEM IT SEEMS TO BE A COMMON PROBLEM AMONG HONDA'S AND ACURA'S THAT THAT THE HANDS FREE LINK ELECTRONIC MODULE MALFUNCTIONS.     IN ADDITION THE MALFUNCTIONING OF THE HFL CAUSES A BATTERY DRAIN AND",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/26/2014",
        "dateOfIncident": "03/01/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10668267,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ELECTRONIC SUSPENSION ON OUR 07 MDX IS AN EXTRA PAID OPTION, WE DID NOT BUY NEW BUT WE STILL PAID FOR THAT OPTION AS IT INCREASES VALUE NEW OR USED...  THE REAR DAMPERS IN OURS ARE LEAKING AND FOR A SET TO REPLACE COSTS AT LEAST $1000 IN PARTS AND THEN YOU HAVE TO PAY LABOR.  THIS IS A PREMIUM BRAND, BUT IT IS NOT AN EXOTIC... NOT SURE WHY AN ACURA ADS SUSPENSION PART THAT PROBABLY COSTS THEM $50 TO MAKE, COSTS THE CONSUMER (AKA THE PPL WHO KEEP ACURA IN BUSINESS) $500+ EACH.  THIS IS OBVIOUSLY A MAJOR AND EXPENSIVE FLAW IN ACURAS SUSPENSION AND THEY SHOULD REPLACE FOR FREE OR AT THE LEAST PRICE THE PART SO IT'S AFFORDABLE.    I HAVE A 12 YR OLD LEXUS THAT HAS THE ORIGINAL SUSPENSION AND IS STILL WORKING LIKE IT SHOULD...  *TR",
        "vin": "2HNYD28807H"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/03/2014",
        "dateOfIncident": "10/15/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10661956,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "BATTERY IN OUR 2007 ACURA MDX HAS HAD TO BE REPLACED 3 TIMES IN THE PAST COUPLE OF MONTHS! TURNS OUT THAT THE HANDSFREE LINK MODULE WAS DRAINING THE BATTERY AND CAUSING IT HAVING TO BE REPLACED NUMEROUS TIMES. THIS COULD CAUSE A FIRE WHICH CAN POSE AS A DEADLY RESULT ESPECIALLY IF THE CAR IS PARKED INSIDE OF A GARAGE. THIS NEEDS TO BE REPLACED BY ACURA FREE OF CHARGE ASAP! I DISCONNECTED IT RATHER THAN REPLACING IT AFTER READING THE NUMEROUS COMPLAINTS ON THIS MATTER!   *JS",
        "vin": "2HNYD28527H"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/27/2014",
        "dateOfIncident": "10/24/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10650391,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "BATTERY IN OUR 2007 ACURA MDX HAS HAD TO BE REPLACED 3 TIMES IN THE PAST COUPLE OF MONTHS! TURNS OUT THAT THE HANDSFREE LINK MODULE WAS DRAINING THE BATTERY AND CAUSING IT HAVING TO BE REPLACED NUMEROUS TIMES. THIS COULD CAUSE A FIRE WHICH CAN POSE AS A DEADLY RESULT ESPECIALLY IF THE CAR IS PARKED INSIDE OF A GARAGE. THIS NEEDS TO BE REPLACED BY ACURA FREE OF CHARGE ASAP!  *TR",
        "vin": "2HNYD28327H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/04/2014",
        "dateOfIncident": "09/01/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10630639,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "2007 ACURA MDX VIBRATION (JUDDER) AT 20-45 MPH DURING ACCELERATION.  THIS ISSUE SHOULD PUT IN THE RECALL MENU.   *TR",
        "vin": "2HNYD28337H"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/01/2014",
        "dateOfIncident": "10/15/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10607595,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "CAME OUT TO OUR 2007 MDX IN THE MORNING AND FOUND THAT THE BATTERY WAS COMPLETELY DEAD FOR THIRD TIME IN A WEEK.   CHARGED BATTERY AGAIN AND DROVE THE CAR TO DEALERSHIP.  PROBLEM DIAGNOSED AS AN OPEN CIRCUIT IN THE HANDS FREE UNIT EVEN WHEN IGNITION IS OFF.  REPLACED THE HANDS FREE UNIT.  APPROXIMATELY 60 DAYS LATER, SAME PROBLEM AGAIN, AND NEW HANDS FREE UNIT AGAIN THE PROBLEM.  THE UNIT IS LOCATED IN THE CONSOLE BETWEEN FRONT SEATS WAS VERY HOT AND COULD HAVE CAUSED A FIRE.  DEALERSHIP INFORMED ME THAT THEY HAD SEEN THIS PROBLEM A LOT, BUT THAT THERE IS NO RECALL AND ACURA HAS NO ANSWERS FOR THEM.  HAD TO REPLACE BATTERY AFTER 2ND UNIT FAILED, NOW WORKING ON 3RD HANDS FREE UNIT IN LESS THAN ONE YEAR.  AFTER 2ND INCIDENT I CONTACTED ACURA AND REPORTED THE PROBLEM AND THEY STATED THAT THEY WERE UNAWARE OF ANY PROBLEMS WITH THESE HANDS FREE UNITS.  APPARENTLY, ACURA DOES NOT YET HAVE THE ABILITY TO ACCESS THE INTERNET AS A CONSIDERABLE NUMBER OF OTHER 2007 MDX OWNERS HAVE VOICED THE SAME CONCERN IN THE ACURA OWNERS FORUM AFTER EXPERIENCING FAILURES OF THEIR HANDS FREE UNITS.  OBVIOUSLY, THE HANDS FREE UNIT MANUFACTURED BY JOHNSON CONTROLS HAS A DESIGN DEFECT WHICH IS CAUSING THIS PROBLEM AND CREATING A FIRE RISK IN THE PASSENGER CABIN EVEN WHEN IGNITION IS OFF.  DEFECT COULD ALSO CAUSE HOUSE FIRE IF CAR IS PARKED IN AN ATTACHED GARAGE DUE TO THE FACT THAT THE CIRCUIT IS OPEN EVEN WHEN THE IGNITION IS OFF AND GETS VERY HOT TO THE TOUCH.  THIS PROBLEM NEEDS TO BE INVESTIGATED BY N.H.T.S.A., AS IT IS A SIGNIFICANT FIRE SAFETY RISK.  I ENCOURAGE ALL PARTIES WHO HAVE EXPERIENCED A SIMILAR PROBLEM TO FILE A COMPLAINT HERE SO THAT THE SCOPE OF THE PROBLEM CAN BE BETTER DETERMINED AND ACURA WILL BE FORCED TO TAKE THIS PROBLEM SERIOUSLY.  *TR",
        "vin": "2HNYD28387H"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/19/2014",
        "dateOfIncident": "06/02/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10604488,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM HAVING ISSUES WITH A LEAKING SHOCK ON THE REAR OF MY ACURA MDX SPORT.  THE SHOCK IS LEAKING, AFTER RESEARCH ONLINE THIS IS A COMMON ISSUE FOR THIS MODEL AND I FEEL IS A DESIGN FLAW.   *TR",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/29/2014",
        "dateOfIncident": "12/12/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10594761,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 ACURA MDX. THE CONTACT STATED THAT THE VEHICLE STALLED AND BECAME INOPERABLE. THE VEHICLE WAS TAKEN TO A DEALER WHERE THE FAILURE WAS UNABLE TO BE REPLICATED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 68,700, AND THE CURRENT MILEAGE WAS 71,500.",
        "vin": "2HNYD28227H"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/27/2014",
        "dateOfIncident": "02/01/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10575143,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SIDE STRUT BROKE, TOOK TO DEALER MULTIPLE TIMES TO DIAGNOSE.  INDEPENDENT FRAME SHOP DIAGNOSED WITHIN 10 MINUTES OF BEING THERE.  COME TO FIND OUT FROM NEW SERVICE ADVISOR THAT PREVIOUS ADVISOR DID DOCUMENT ISSUE I WAS COMPLAINING ABOUT IN THEIR SYSTEM.  SMELLS LIKE A COVER UP TO ME.  BEEN CHASING THIS PROBLEM FOR THE BETTER PART OF 2 YEARS NOW WITH THE DEALER.  MANY OTHER DOCUMENTED SITUATIONS SIMILAR TO MINE ONLINE AS WELL. PLEASE LOOK INTO THIS ISSUE. WITH THE DEALER'S PARTICIPATION THIS FIX WILL COST ME $1500 TO REPAIR AND MY CAR IS STILL UNDER WARRANTY.  THEY ARE CALLING IT WEAR AND TEAR.  FOR SUCH A WELL CARED FOR LOW MILEAGE CAR, AND SO MANY OTHER DOCUMENTED SITUATIONS, I DISAGREE.  *TR",
        "vin": "2HNYD28857H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/11/2013",
        "dateOfIncident": "10/10/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10547610,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY CAR SURGED FORWARD ON ITS ON THEN I LOST RPMS. MY CAR THEN CUT OFF ON A BUSY INTERSTATE DURING RUSH HOUR.  I TOOK TO THE DEALERSHIP THEY SAID I NEEDED A NEW TRANSMISSION. IRONICALLY I HAD WORK DONE ON MY CONVERTER THAT THE DEALERSHIP RECALLED AND NOW IT HAS FAILED AND ALMOST HAD ME KILLED.  *TR",
        "vin": "2HNYD28307H"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/24/2013",
        "dateOfIncident": "11/08/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10521360,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 ACURA MDX. THE CONTACT STATED THAT AFTER NUMEROUS ATTEMPTS THE VEHICLE FAILED TO START. THE VEHICLE WAS TOWED TO AN AUTHORIZED DEALER WHERE THE BATTERY WAS REPLACED. THE FAILURE RECURRED THREE TIMES AND THE BATTERY WAS REPLACED EACH TIME. THE MANUFACTURER WAS NOTIFIED OF THE DEFECT. THE APPROXIMATE FAILURE MILEAGE WAS 82,000.",
        "vin": "2HNYD28447H"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "03/24/2013",
        "dateOfIncident": "03/15/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10504339,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEADRESTS IN THIS CAR AND ALL NEWER-MODEL CARS CREATE AN UNCOMFORTABLE AND DANGEROUS POSITION OF THE HEAD AND NECK BY FORCING THE DRIVER'S HEAD FORWARD INTO AN UNNATURAL POSITION.  PEOPLE WHO ARE TALLER, OR WHO HAVE A TALLER TORSO ARE AFFECTED MORE THAN SHORTER DRIVERS/PASSENGERS. RECLINING THE SEAT TO AVOID HAVING YOUR HEAD PUSHED FORWARD CREATES AN ABSENCE OF SUPPORT FOR YOUR UPPER BACK AND TORSO.  THESE UNNATURAL AND UNCOMFORTABLE POSITIONS, WHILE THEY MAY ASSIST IN WHIPLASH-TYPE ACCIDENTS, CAN CREATE NECK AND BACK FATIGUE AND EVEN EXACERBATE AND/OR CAUSE DISK INJURIES IN THE DELICATE CERVICAL SPINE AREA.     I'M SURE THESE HEADRESTS ARE DESIGNED TO COMPLY WITH NHTSA REQUIREMENTS; HOWEVER WHILE THE DESIGN MAY SOLVE ONE PROBLEM (WHIPLASH) IT CREATE AN ENTIRELY DIFFERENT SET OF PROBLEMS.  A SIMPLE SOLUTION IS TO MAKE THE HEADRESTS ADJUSTABLE IN TERMS OF THE ANGLE SO THAT TALLER DRIVERS ARE NOT FORCED INTO A HUNCHED OVER, NECK-PAIN CAUSING POSITION.  THIS IS NOT A MINOR COMPLAINT AND IS NOT SPECIFIC TO OUR ACURA.  THESE UNCOMFORTABLE HEADRESTS EXIST IN EVERY NEWER-MODEL CAR I'VE DRIVEN OR BEEN A PASSENGER IN. THE NHTSA RULES FOR THESE HEADRESTS ARE ALSO CREATING A SITUATION WHERE OWNERS OF THESE CARS ARE MAKING MODIFICATIONS TO ALLEVIATE THE PAINFUL HEAD/NECK POSITION CAUSED BY THE HEADRESTS.  PEOPLE ARE REMOVING THE HEADRESTS, TURNING THEM AROUND BACKWARDS AND SOMETIMES BENDING THE SUPPORTS TO ANGLE THE HEADREST AWAY AT A MORE COMFORTABLE POSITION WHICH UNDERMINE THE SUPPOSED SAFETY BENEFITS AFFORDED BY THE HEAD-FORWARD DESIGN.      PLEASE, DO SOMETHING TO CORRECT THE DESIGN REQUIREMENTS.  THEY ARE HURTING US AND CREATING AN EVEN MORE UNSAFE CONDITION WHEN PEOPLE MODIFY THE HEADRESTS.  A RE-DESIGN AND RECALL OF THESE CURRENT HEAD-FORWARD HEADRESTS IS IMPERATIVE TO ELIMINATE REPETITIVE HEAD-FORWARD-TYPE CERVICAL DISK INJURIES THAT ARE NOT CAUSED BY AN ACCIDENT.  *TR",
        "vin": "2HNYD28207H"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/22/2013",
        "dateOfIncident": "11/01/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10504099,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "BATTERY WAS FOUND TO BE COMPLETELY DRAINED ON A  FEW OCCASIONS AFTER SITTING OFF OVERNIGHT. AFTER EXAMINING POSSIBLE CULPRITS WHEN THE BATTER WAS FOUND DRAINED IT WAS FOUND THAT THE HANDSFREE MODULE LOCATED IN THE REAR OF THE CENTER CONSOLE WAS HOT TO THE TOUCH. AFTER REMOVING THE MODULE COMPLETELY AND RECHARGING THE BATTERY THIS INCIDENT OF BATTERY DRAINAGE HAS NOT OCCURRED IN 3 MONTHS.   THE HANDSFREE MODULE THAT OPERATES THE BLUETOOTH AND HANDFEE FUNCTIONS OF THE CARE IS DEFECTIVE TO THE POINT THAT IT PULLS A CONSTANT LOAD FROM THE BATTERY EVEN WHEN THE CAR IS SHUT OFF AND KEYS ARE NOT IN THE IGNITION. SEARCHING THE INTERNET FINDS MANY OTHER OWNERS OF THE SAME MODEL TO HAVE THE SAME PROBLEM. THIS MODULE SHOULD BE REPLACED BY THE MANUFACTURER FREE OF CHARGE BECAUSE IT CAN LEAD TO A DEAD BATTERY WITH NO WAY TO START THE CAR, AS WELL AS POSSIBLE FIRE FROM THE AMOUNT OF HEAT BUILT UP IN THE FAULTY MODULE.  *TR",
        "vin": "2HNYD28807H"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/22/2013",
        "dateOfIncident": "11/11/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10499676,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 ACURA MDX. THE CONTACT STATED THAT THE VEHICLE FAILED TO START. THE CONTACT ATTEMPTED TO JUMP START THE BATTERY HOWEVER, THE FAILURE RECURRED. THE VEHICLE WAS TOWED TO THE DEALER FOR INSPECTION BUT THE DEALER WAS UNABLE TO DIAGNOSE THE CAUSE OF THE FAILURE. THE MANUFACTURER WAS NOTIFIED BUT PROVIDED NO ASSISTANCE. THE FAILURE MILEAGE WAS 92,000.  UPDATED 03-28-13 *BF",
        "vin": "2HNYD28387H"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/23/2013",
        "dateOfIncident": "01/19/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10494509,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD A HARROWING DRIVING EXPERIENCE ON 01/19/13; COULD HAVE GOT INTO AN ACCIDENT IF IT WAS NOT DUE TO ALERTNESS OF THE DRIVER BEHIND ME. I HAD SERVICED MY MDX PREVIOUS DAY, IT INCLUDED REPLACING THE BATTERY. THE TECHNICIAN DID A SLOPPY JOB IN CONNECTING THE CABLE RESULTING IN THE CABLE COMING OFF THE BATTERY WHILE DRIVING IN TRAFFIC. THE CAR CAME TO A COMPLETE STOP SUDDENLY AND I WAS LOCKED INSIDE. I WAS NOT ABLE TO OPEN ANY DOOR OR ROLL DOWN WINDOWS BY USING THE MANUAL KNOB. I WAS HOLED UP IN THE CAR UNTIL A TOW TRUCK CAME AND CONNECTED THE CABLE.    IT IS A DESIGN FLAW IF THE PASSENGER CANNOT OPEN THE DOORS USING MANUAL CONTROLS IRRESPECTIVE OF THE CAR HAVING NO POWER. I CONTACTED THE DEALERSHIP AS WELL AS MANUFACTURER; THEY SAID THEY COULDN'T REPLICATE THE PROBLEM. THIS SHOULD NOT HAPPEN TO ANYONE ELSE AND NEEDS TO BE INVESTIGATED. *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/11/2013",
        "dateOfIncident": "12/24/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10492304,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A RATTLE FROM RIGHT UNDER SIDE OF THE VEHICLE AND THE LOCAL DEALER DIAGNOSED IT AS DEFECTIVE FRONT STRUT (DAMPER) AND RECOMMENDED REPLACEMENT AT A COST OF $1300 PER STRUT SINCE THE WARRANTY EXPIRED.  THE DEFECTIVE STRUT SHOULD BE REPAIRED BY ACURA AT NO OR MINIMAL COST TO THE CONSUMER BEFORE AN INCIDENT OCCURS DUE TO DEFECTIVE FRONT STRUTS.  *TR",
        "vin": "2HNYD288X7H"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/14/2012",
        "dateOfIncident": "08/02/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10484724,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "RANDOM NAV RESET FOLLOWED BY NON-ACCELERATION UNTIL RPMS REACH OVER 3000. THIS HAS HAPPENED MULTIPLE TIMES SINCE PURCHASING THIS VEHICLE IN JULY 2012.  NAVIGATION/RADIO SYSTEM RESETS. SOON FOLLOWED BY PROBLEM OF NON-ACCELERATION. EX: FOLLOWING RESET, STOP AT TRAFFIC LIGHT, STOP SIGN, ETC. LIGHT TURNS GREEN. CAR FEELS AS THOUGH IT IS STUCK IN 1ST GEAR. WILL NOT ACCELERATE OVER 1000 RPMS. EXTREMELY SLOW MOVEMENT THRU INTERSECTION THEN CAR SLAMS INTO GEAR AND RPMS TOP 3000. AFTER ROUGH SHIFT CAR PERFORMANCE IS MOSTLY NORMAL, SOMETIMES HARD SHIFTING. NEXT RED LIGHT REPEAT PERFORMANCE.  IF PUT INTO PARK AND THEN BACK TO DRIVE TRANSMISSION SEEMS TO \"RESET\" AND MAY OR MAY NOT REPEAT ABOVE ACTION. IF CAR IS TURNED OFF AND LEFT TO SIT FOR A SHORT TIME IT USUALLY DOES NOT REPEAT BUT FOR HOW LONG IS ANYONE'S GUESS. LATELY NAV RESET HAPPENS SO OFTEN I LOSE COUNT, I JUST WAIT FOR THE CAR TO SHIFT INTO WHAT FEELS LIKE FIRST GEAR. DEALERSHIP HAS NOT BEEN ABLE TO RECREATE THIS ISSUE. NO COMPUTER CODES SHOW UP IN SYSTEM.  MULTIPLE COMPLAINTS TO DEALER BUT THEY CLAIM TO HAVE NO RECORD AND TO HAVE NEVER HEARD OF THIS PROBLEM.  *TR",
        "vin": "2HNYD28467H"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/19/2012",
        "dateOfIncident": "08/19/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10471450,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "ONLY AFTER 30K THE CAR STARTED ACTING UP AND STARTED SHOWING ENGINE LIGHTS, SOMETIMES STALLING FOR A SEC WHEN ACCELERATING. THE CAR HAS BEEN KEPT IN A GREAT SHAPE, ON TIME OIL CHANGE, ATF CHANGED BEFORE 30K AND ENGINE FLUSHED AT 30K. THE CAR IS ONLY 5 YEARS OLD. *TR",
        "vin": "2HNYD28537H"
    },
    {
        "components": "WHEELS,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "06/05/2012",
        "dateOfIncident": "05/04/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10460687,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "RECENTLY I HAD TO CHANGE MY WIFE'S CAR TIRE DUE TO A FLAT. I USED THE FACTORY ACURA SCISSOR JACK TO DO IT. WHILE I HAD STEPPED AWAY FROM THE JACK STAND TO GET THE SPARE TIRE, THE JACK COLLAPSED AND ESSENTIALLY THE METAL STRUCTURE OF THE JACK HAD FOLDED A BIT. THE CAR SLAMMED TO THE GROUND WITH MY WIFE AND 1 YEAR OLD INSIDE THE CAR (IT WAS RAINING OUT).  I CONTACTED ACURA SUPPORT ABOUT HAVING THEM SIMPLY REPLACE THE UNUSABLE JACK STAND WITH A NEW ONE.  THEY POLITELY TOLD ME TO POUND SAND. I HAVE SOME PICS OF THE BENT JACK THAT I CAN SHARE. I HAD CONTACTED THE US CONSUMER PRODUCT SAFETY COMMISSION AND THEY RECOMMENDED I FILE A COMPLAINT WITH THE NHTSA.  *TR  UPDATED 01/09/13*LJ",
        "vin": "2HNYD28527H"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/05/2012",
        "dateOfIncident": "06/04/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10460716,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Michelin North America, Inc.",
                "productMake": "MICHELIN",
                "productModel": "LATITUDE TOUR",
                "productYear": "9999",
                "size": "P220/75R16",
                "type": "Tire"
            }
        ],
        "summary": "THE SIDEWALLS ARE CRACKING AND PEELING OFF OF THESE TIRES.  MY CAR WAS PURCHASED IN JULY 2007 AND THESE ARE THE ORIGINAL TIRES.  I ONLY HAVE 23,000 MILES ON THE CAR.  *TR",
        "vin": "2HNYD28437H"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "03/08/2012",
        "dateOfIncident": "03/08/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10450815,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MY FATHER WAS JUST IN AN ACCIDENT TODAY. MDX WAS STREET PARKED AND WHEN HE TRIED TO REVERSE OUT THE CAR SUDDENLY ACCELERATED AND CRASHED IN TO THE CAR BEHIND HIM AND PUSHED IT BACK ABOUT 20 FEET.  *TR",
        "vin": "2HNYD28277H"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/02/2012",
        "dateOfIncident": "02/01/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10446274,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE WENT OUTSIDE OF OUR HOME TO GET INTO HER ACURA 2007 MDX TO GO TO WORK.  WHEN SHE STARTED THE VEHICLE UP, IT STARTED SHAKING AND BLOWING OUT WHITE SMOKE FROM THE EXHAUST PIPES WITH AN UNUSUAL NOISE.  SHE TURNED THE VEHICLE OFF AND CALLED OUR INSURANCE COMPANY WHICH SENT A TOW TRUCK OUT TO TAKE IT TO THE DEALER.  AFTER THE SERVICE REPRESENTATIVE ACCEPTED THE VEHICLE AND HAD HIS MECHANIC INSPECT IT TO SEE WHAT CAUSED THE SMOKING.  THE MECHANIC INFORMED THE SERVICE REPRESENTATIVE THAT THE AIR COMPRESSOR MALFUNCTIONED AND CAUSED AN ELECTRICAL SHORTAGES.  THIS WAS THE REASON FOR THE AIR COMPRESSOR WHY THE AIR COMPRESSOR WERE BLOWING FREON INTO THE ENGINE AND CAUSED IT TO SMOKE WHEN THE ENGINE STARTED.  WE HAVE NEVER MISS A SERVICE AND FOLLOWED THE RECOMMENDED REQUIRED MAINTENANCE.  I ASK THE SERVICE REPRESENTATIVE WHAT WOULD IT COST TO HAVE MY WIFE'S SUV REPAIRED? THE PRICE THE SERVICE REPRESENTATIVE GAVE WAS AN ESTIMATION OF $1,900.00 PLUS LABOR.  THE SERVICE REPRESENTATIVE TOLD ME THERE WAS NOTHING HE COULD BECAUSE THE WARRANTY HAD EXPIRED AND THERE WERE NO RECALLS ON THIS ISSUE.  JUST BECAUSE THERE ARE NO SAFETY RECORD ON FILE DOESN'T MEAN THAT THE DEALER SHOULD NOT LOOK INTO THE HAZARD.  WHAT IF THIS PROBLEM OCCURRED WHILE MY WIFE WAS ON HER WAY TO WORK, AND ALL THIS FREON AND SMOKE WERE RELEASED INSIDE HER VEHICLE AND CAUSED HER TO HAVE AN ACCIDENT?  MY WIFE AND I HAVE PURCHASED 4 VEHICLES FROM ACURA BRAND NEW OFF THE SHOWROOM FLOOR.  IT APPEARS TO ME THAT EVERY TIME THE WARRANTY RUN OUT OUR CARS, WE BEGIN TO HAVE MECHANICAL ISSUES WHICH LEAD ME TO BELIEVE ONE OR TWO THINGS; EITHER THE MECHANICS ARE TAKING SHORT CUTS IN PERFORMING THE MAINTENANCE OR THE CAR WORKMANSHIP IS NOT WHAT ACURA SAY IT IS.  THE WAY THAT I FEEL ABOUT MY TL AND MY WIFE'S MDX THAT WE WILL NEVER BUY ANOTHER ACURA VEHICLE.     *KB",
        "vin": "2HNYD28427H"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/26/2012",
        "dateOfIncident": "11/18/2011",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10445411,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "A WHINING SOUND IS BEING DISCOVERED FROM THE POWER STEERING PUMP/RACK AREA AFTER 30 MINUTES OF DRIVE ON HIGHWAY THEN SLOWDOWNS TO THE STREETS. THE WHINING NOISE GETS LOUDER WHEN TURNING THE STEERING WHEEL TO EITHER LEFT OR RIGHT (NOT NECESSARILY ALL THE WAY). THE NOISE GO AWAY AFTER STOPPING THE ENGINE FOR A COUPLE OF HOURS. DIAGNOSED AT THE DEALER, FOUND TO BE A DEFECTIVE PART - POWER STEERING RACK (53601-STX-A01). *TR",
        "vin": "2HNYD28397H"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/30/2011",
        "dateOfIncident": "12/29/2011",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10441795,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS DEVELOPED LEAK IN RACK AND PINION AND POWER STEERING PUMP IS FAILING AT 70,000 MILES WHICH CAUSED VEHICLE TO BE DIFFICULT TO STEER AND COULD LEAD TO POSSIBLE ACCIDENT.  *KB",
        "vin": "2HNYD28807H"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/07/2011",
        "dateOfIncident": "10/05/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10429044,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 ACURA MDX.  THE CONTACT STATED THAT WHEN ADJUSTING THE POWER SEAT ON THE DRIVER SIDE, THE AIR BAG WARNING LIGHT WOULD ILLUMINATE ON THE INSTRUMENT PANEL.  THE DEALER DIAGNOSED THAT THE VEHICLE WOULD NEED A WIRING HARNESS REPLACEMENT.  THE MANUFACTURER DENIED ANY ASSISTANCE WITH REPAIRS TO THE VEHICLE.  THE VEHICLE WAS NOT REPAIRED.  THE FAILURE MILEAGE WAS 60,000 AND THE CURRENT MILEAGE WAS 90,000.  UPDATED 11/04/11  *BF",
        "vin": "2HNYD28297H"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/19/2011",
        "dateOfIncident": "09/17/2011",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10426268,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "OPEN TAILGATE CREATES ELECTRICAL DRAIN THAT KILLS THE BATTERY IN A FEW HOURS WITH NO LIGHTS TURNED ON OR ANY OTHER OBVIOUS SIGNS OF BATTERY DRAINAGE INDICATION. THE ISSUE SEEMS TO APPLY ONLY TO VEHICLES EQUIPPED WITH POWER TAILGATE. MULTIPLE COMPLAINTS FOUND ON THE INTERNET REPORTED BY OTHER VEHICLE OWNERS. THIS IS A MAJOR SAFETY ISSUE SINCE PEOPLE MAY NOT BE ABLE TO START ENGINE ON THEIR VEHICLE JUST AFTER HAVING TAILGATE OPEN FOR A RELATIVELY SHORT TIME.   ACURA CUSTOMER RELATIONS DEPARTMENT WAS CONTACTED OVER THE PHONE BUT REFUSED TO ADMIT THE FACT OF ELECTRICAL DESIGN OR A COMPONENT ISSUE AND SUGGESTED ME TO HAVE THE VEHICLE DIAGNOSTIC DONE AT MY OWN EXPENSE IN THE NEAREST DEALERSHIP.    *KB",
        "vin": "2HNYD28827H"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/11/2011",
        "dateOfIncident": "05/09/2011",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10400534,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE WAS DRIVING THE CAR, IT SHUT DOWN COMPLETELY - .NO LIGHTS, NO MOTOR, ..COMPLETELY DEAD IN THE MIDDLE OF THE FREEWAY. I WAS SIMPLY DRIVING AND HAD NOT TOUCHED ANY BUTTONS OR DIALS. I WAS (LUCKILY) ABLE TO DRIFT TO THE BREAKDOWN LANE. APPROXIMATELY 45 MINUTES LATER, THE INSIDE LIGHTS TURNED ON AND I WAS ABLE TO CONTINUE DRIVING. THIS MORNING, WHEN I TOOK THE CAR INTO THE DEALER FOR SERVICE, I WAS TOLD THAT ANOTHER CUSTOMER HAD THE SAME PROBLEM, RECURRING EVERY THREE WEEKS OR SO.  AT OTHER TIMES, WHEN THE CAR WAS STATIONARY, THE CAR WOULD ALSO FREEZE ON ME, AND AGAIN, AFTER WAITING APPROX. 45 MINUTES, IT STARTED UP. THIS WAS, FOR ME, THE FIRST TIME IT HAPPENED WHILE I WAS DRIVING.  MILEAGE ENTERED ABOVE IS APPROXIMATE.",
        "vin": "2HNYD283X7H"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/08/2011",
        "dateOfIncident": "03/01/2011",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10386833,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 ACURA MDX. THE CONTACT STATED THAT THE BRAKE LIGHT WOULD FAIL INTERMITTENTLY. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHO REPLACED THE BRAKE LIGHT RELAY. THE MANUFACTURER WAS NOT CONTACTED IN REGARDS TO THE FAILURE. THE CURRENT MILEAGE WAS APPROXIMATELY 57,000 AND THE FAILURE MILEAGE WAS APPROXIMATELY 56,800.",
        "vin": "2HNYD28877H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/27/2010",
        "dateOfIncident": "11/16/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10372564,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TORQUE CONVERTER ON 2007 ACURA MDX FAILED AT 42K MILES. ACURA DEALER REPLACED UNDER WARRANTY. *TR",
        "vin": "2HNYD28877H"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/06/2010",
        "dateOfIncident": "11/03/2007",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10364294,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE SHUT OFF WHILE DRIVING APPROX. 35 MPH, RESULTING IN TOTAL LOSS OF POWER STEERING AND BRAKES AND ELECTRICAL SYSTEMS.. PULLED OVER AND BROUGHT CAR TO A STOP. WAS IN THE PROCESS OF GETTING OUT TO CHECK ENGINE WHEN INTERIOR LIGHTS CAME ON, RESTARTED ENGINE AND COMMENCED TO DRIVE APPROX. A MILE WHEN IT ALL REPEATED. GOT CAR HOME AND CALLED FOR TOW TRUCK TO TAKE CAR TO ACURA DEALERSHIP WHERE I HAD PURCHASED 1 MONTH PREVIOUSLY. *TR",
        "vin": "2HNYD28307H"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/27/2010",
        "dateOfIncident": "04/15/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10332500,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 ACURA MDX. THE CONTACT SMELLED OIL BURNING IN THE VEHICLE. UPON INSPECTING THE VEHICLE, HE NOTICED THAT THE VEHICLE WAS LEAKING OIL FROM THE PC VALVE ONTO THE EXHAUST PIPE. THE DEALER ADVISED THE CONTACT THAT THE VEHICLE COULD BE REPAIRED AT HIS EXPENSE. THE MANUFACTURER CONFIRMED THE DEALERS STATEMENT AND TOLD THE CONTACT THAT THE WARRANTY WAS VOID SINCE HE TAMPERED WITH THE VEHICLE AND REMOVED PARTS FROM IT. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 40,000 AND THE CURRENT MILEAGE WAS 47,000.",
        "vin": "2HNYD28337H"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/28/2010",
        "dateOfIncident": "04/26/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10327896,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MY ACURA MDX 2007 LOSES POWER STEERING EVERY TIME IT GOES THROUGH A PUDDLE, PUDDLES AS SHALLOW AS CAN BE. A BEEP SOUNDS, AN ALERT STATING CHECK YOUR CHARGING SYSTEM, AND THE POWER STEERING STOPS FUNCTIONING. I ALMOST RAN INTO AN OBJECT AT THE SIDE OF THE ROAD A FEW TIMES AS I WAS TURNING AND THIS HAPPENED. *TR",
        "vin": "2HNYD28477H"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/24/2010",
        "dateOfIncident": "02/19/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10313569,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6)    2007 ACURA MDX 34,000 PREDOMINANTLY HIGHWAY MILES     FRIDAY EVENING, AS I WAS PULLING OUT OF A CAR WASH, I HEARD A CLUNK, THE INSTRUMENT PANEL LIT UP WITH A \"CHECK CHARGING SYSTEM ALARM\" AND I HAD NO POWER STEERING.  I IMMEDIATELY STOPPED AND FOUND A BELT PULLEY (LATER IDENTIFIED BY ACURA AS A \"CRANK PULLEY) LAYING IN THE ROAD JUST BEHIND THE CAR.  I OPENED THE HOOD AND THE SERPENTINE BELT WAS NOT TURNING, EXPLAINING THE LOSS OF POWER STEERING.    UPON INVESTIGATION, THE DEALERSHIP EXPLAINED THAT THE OUTER RIM OF THE PULLEY IS COMPRESSION FIT ONTO THE HUB AND THAT THE PULLEY CAME APART AT THIS COMPRESSION FIT.  THE HUB REMAINED CONNECTED TO THE CRANK, BUT WITHOUT THE HUB THERE IS NO TENSION PROVIDED TO THE SERPENTINE BELT AND, HENCE NO POWER STEERING (OR ALTERNATOR OR A/C FOR THAT MATTER).     THE LOCAL ACURA DEALERSHIP PROVIDED A SIMPLE REPAIR REPLACING THE PULLEY, BUT COULD NOT EXPLAIN WHY IT FAILED.  I CONTACTED ACURA'S REGIONAL CASE MANAGER [XXX] AND ASKED FOR A CASE NUMBER [XXX] )TO RECEIVE FEEDBACK FROM AN ANALYSIS OF THE FAILED PART.  WHY DID IT FAIL (ROOT CAUSE) AND WHAT SHOULD BE DONE TO PREVENT FUTURE OCCURRENCES?  [XXX]  REPLIED \"THAT IS NOT GOING TO HAPPEN\", \"I'M CLOSING OUT THIS CASE\".     I AM VERY CONCERNED ABOUT THE ROOT CAUSE OF THIS FAILURE.  HAD MY WIFE OR DAUGHTER OR OTHER WEAKER PERSON BEEN DRIVING IN A MORE CRITICAL SITUATION, LOSING THE POWER STEERING WHILE MOVING COULD HAVE BEEN A TRAGIC EVENT.     THE CAR CARRIER DRIVER TOLD ME THAT HE PICKED UP AN MDX WITH A MISSING BELT PULLEY JUST LAST WEEK.  I UNDERSTAND THAT HE IS NOT THE AUTHORITATIVE SOURCE, BUT ITS IS ENOUGH TO INCREASE MY LEVEL OF CONCERN. *TR",
        "vin": "2HNYD28337H"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/13/2010",
        "dateOfIncident": "12/26/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10299585,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "NOXIOUS/STALE REFRIGERANT HEADACHE CAUSING ODOR EMITTING FROM MY VEHICLES AC VENTS. *TR",
        "vin": "2HNYD28237H"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/04/2009",
        "dateOfIncident": "10/28/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10290940,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 62,000 MILES THE LEFT HEADLIGHT FAILED.  DEALER INDICATED THAT THE XENON BULB, IGNITER AND CONTROL UNIT HAD ALL FAILED AND BLOWN A FUSE.  REPAIR COST WAS APPROXIMATELY $1,000, OF WHICH ACURA PAID 75% AS A GOODWILL GESTURE.  NOW, AT 72,000 MILES, THE RIGHT SIDE HEADLIGHT HAS FAILED REQUIRING REPLACEMENT OF THE IGNITER AND CONTROL UNIT AT A COST OF OVER $600.  HEADLIGHTS ARE SAFETY COMPONENTS AND IT APPEARS THERE IS A DESIGN DEFECT CAUSING PREMATURE FAILURE OF THESE ITEMS.  A BULB IS ONE THING.  BUT THE COMPONENTS CONTROLLING THE FUNCTION OF THE XENON BULBS SHOULD OUTLAST THEM IN MY OPINION.  WAITING TO SEE IF ACURA WILL ASSIST IN THE COST OF THIS REPAIR.  *TR",
        "vin": "2HNYD28477H"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "07/20/2009",
        "dateOfIncident": "07/19/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10277416,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE ON A ROAD TRIP DRIVING FROM BALTIMORE MARYLAND HOME TO EASTON PA.  MY SIX YEAR OLD SON SAYS, MOMMY I NEED YOUR HELP!  I TURN AROUND AND HE IS CAUGHT IN THE MIDDLE SEATBELT WHICH IS TETHERED BETWEEN THE CEILING AND THE SEAT AROUND HIS NECK! I AM NOT SURE HOW HE GOT IN THIS PREDICAMENT AND I QUICKLY TRIED TO HELP HIM AS MY HUSBAND WAS DRIVING ON A SECTION OF 95 WHERE WE COULD NOT PULL OVER.  I CLIMBED INTO THE BACKSEAT AND FOUND THE SEATBELT WAS TIGHT AROUND HIS NECK.  BY THIS TIME MY SON WAS CRYING AND PANICKING AS HE REALIZED THE SITUATION WAS WORSE THAN HE THOUGHT.  THE SEATBELT HAD GOTTEN PULLED TIGHT AROUND HIS NECK AND WAS LOCKED IN THAT POSITION SO I COULD NOT LOOSEN IT.  I HAD HIM GET OUT OF HIS SEATBELT ON THE REAR DRIVER SIDE SEAT AND TRY TO GET ON HIS KNEES AND FINALLY HE WAS ABLE TO SPIN HIS NECK OUT OF IT.  HOWEVER, I THINK THIS WAS A REAL STRANGULATION HAZARD.  IT WAS A TENSE FEW MINUTES IN MY CAR AS I CONTEMPLATED HAVING TO CUT THIS SEATBELT AND WHAT I WOULD USE TO ACCOMPLISH THIS AND HOW MUCH TIME I HAD TO DO IT. THIS IS MY FIRST TIME WRITING A COMPLAINT AS I AM NOT ONE OF THOSE OVER CAUTIOUS MOM'S BUT I DID FEEL THIS WAS A PROBLEM WORTH MENTIONING.   THE SEATBELT COMES FROM THE CEILING DOWN TO THE SEAT AND THEN GETS PULLED FROM THAT POINT ACROSS A PERSONS STOMACH AND FASTENED.  AT THE POINT WHERE IT WAS CONNECTED FROM THE CEILING TO THE SEAT THERE IS NO BUTTON OR SAFETY RELEASE (WHICH I WAS FRANTICALLY LOOKING FOR). I WANTED TO REPORT THIS BEFORE IT HAPPENS TO SOMEONE ELSE WHICH DOESN'T END SO WELL. THANK YOU. MARLA WITTER I WOULD BE HAPPY TO PROVIDE MY VIN NUMBER ONCE I AM CONTACTED.  I AM AT WORK AND DO NOT HAVE THAT INFORMATION AVAILABLE AT THE MOMENT. *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/29/2008",
        "dateOfIncident": "12/28/2008",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10253135,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 ACURA MDX.  THE CONTACT WENT ON A TRIP AND RETURNED TO FIND THAT THE GPS, EXTERIOR LIGHTING, RADIO, AND OTHER ELECTRICAL COMPONENTS FAILED.  ONLY THE INTERIOR LIGHTING WAS FUNCTIONING PROPERLY.  THE CONTACT CALLED ROADSIDE ASSISTANCE AND THEY DISCOVERED THAT THE BATTERY WAS DRAINED.  THE VIN WAS UNKNOWN.  THE FAILURE AND CURRENT MILEAGES WERE 13,000.",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/01/2008",
        "dateOfIncident": "09/26/2007",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10244107,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER REAR WINDOW SCROLLS DOWN WHEN IGNITION IS TURNED ON AND SOMETIMES WHEN YOU BRING DOWN THE WINDOW DURING CAR RUN TIME. IT DOES NOT COME BACK UP. ITS BEEN FIXED TWICE AND PROBLEM KEEPS REPEATING. *TR",
        "vin": "2HNYD28397H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/12/2008",
        "dateOfIncident": "09/07/2008",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10241965,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2007 ACURA MDX TRANSMISSION HAS FAILED ON 3 OCCASIONS.  FIRST AT 4000 MILES, SECOND AT 6000 MILES AND THIRD AT 8000 MILES (CURRENT MILEAGE).  AT HIGHWAY SPEEDS THE AUTOMATIC TRANSMISSION DOWNSHIFTS ON ITS OWN TO FIRST GEAR AND WILL NOT GO ABOVE 30 MPH.  THIS IS A SEVERE SAFETY PROBLEM. *TR",
        "vin": "2HNYD28867H"
    },
    {
        "components": "SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "01/04/2008",
        "dateOfIncident": "01/03/2008",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10213679,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING APPROXIMATELY 20 MPH WHEN A CAR SUDDENLY STOPPED IN FRONT OF ME.  I COULD NOT STOP IN TIME, AND HIT THE VEHICLE.  MY SEATBELT [DRIVER'S], WHICH I HAD PROPERLY FASTENED, DID NOT RETRACT AND LOCK INTO PLACE.  THE SHOULDER STRAP OF THE SEATBELT FULLY EXTENDED, AND I HIT THE STEERING WHEEL.  THE SHOULDER STRAP OF THE SEAT BELT REMAINED FULLY PULLED OUT AND NO LONGER WILL RETRACT AT ALL - IT WILL NEED TO BE REPLACED.  I THOUGHT SEATBELTS WERE SUPPOSED TO LOCK AND HOLD IN AN ACCIDENT??  *CN",
        "vin": "2HNYD283X7H"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "12/18/2007",
        "dateOfIncident": "12/18/2007",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10212234,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "NEWEST INFO FROM IIHS SHOWS THAT BOTH OF MY ACURA MDX'S ('04 AND EARLY '07) DID VERY POORLY ON THE REAR COLLISION/HEAD RESTRAINT TEST (WHIPLASH). ACURA APPARENTLY REALIZED THIS BLUNDER BECAUSE MDX'S MADE AFTER MAY '07 PASSED WITH FLYING COLORS. THIS HAS ME VERY CONCERNED TO SAY THE LEAST FOR ME AND MY FAMILIES SAFETY. ACURA CHANGED SOMETHING WITH REGARD TO THE SEATS AND I WISH THEY WOULD APPLY IT TO ALL OF THE MDX'S (AT LEAST MY '07).  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/03/2007",
        "dateOfIncident": "06/01/2007",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10195246,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "MDX",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 ACURA MDX.  THE CONTACT STATED THAT THE HORN DOES NOT WORK.  ACURA IS UNABLE TO DIAGNOSE THE CAUSE OF FAILURE.  THE CURRENT MILEAGE IS 13,680 AND FAILURE MILEAGE WAS 11,000.",
        "vin": "2HNYD28417H"
    }
]