[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/02/2016",
        "dateOfIncident": "02/17/2016",
        "fire": false,
        "manufacturer": "Yamaha Motor Corporation, USA",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10839359,
        "products": [
            {
                "manufacturer": "Yamaha Motor Corporation, USA",
                "productMake": "YAMAHA",
                "productModel": "FJR13",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I COMMUTE ON MY MOTORCYCLE NEARLY EVERY DAY THROUGHOUT THE YEAR.  THIS IS THE REASON I HAVE A MOTORCYCLE.  MY WORK START TIME IS AT 5:30AM SO I COMMUTE TO WORK IN THE DARK YEAR ROUND.  I ALSO TRAVEL A SECTION OF ROAD THAT TAKES ME THROUGH A 6 MILE CANYON THAT HAS NO STREET LIGHTING SO THE ROAD IS COMPLETELY DARK AND HAS MANY TURNS WHILE TRAVELING AT NEAR THE 65MPH SPEED LIMIT.  TWO WEEKS AGO WHILE TRAVELING THIS SECTION I FLIPPED THE HEADLIGHT BRIGHTS SWITCH WHICH CAUSED MY HEADLIGHTS TO GO COMPLETELY OUT.  FLIPPING THE SWITCH BACK TO NORMAL LIGHTS DID NOT TURN THEM BACK ON.  AFTER A FEW SECONDS THE LIGHTS CAME BACK ON.  THIS HAPPENED THREE TIMES DURING DOWN THE CANYON AND TWICE MORE UNTIL I GOT TO WORK.  I WAS VERY LUCKY I DIDN'T CRASH OR GET INJURED.  LUCKILY, A CAR WAS POSITIONED A LITTLE AHEAD OF ME WHICH ALLOWED ME TO KNOW WHERE THE ROAD WAS DUE TO THE CAR'S TAIL LIGHTS.  I WAS ABLE TO RIDE HOME IN THE DAYLIGHT.    I TESTED THE HEADLIGHTS AT HOME AND FOUND THAT A RELAY WAS BUZZING SO I THOUGHT THAT WAS THE CAUSE.  UNFORTUNATELY, SWAPPING FOR A DIFFERENT RELAY DID NOT FIX THE ISSUE.  I EVENTUALLY LOCATED A CONNECTOR WITH A SPIDER GROUNDING POLE THAT HAD A BURNT MARK.  TAKING IT APART SHOWED THE CAUSED.  ONE OF THE WIRES NO LONGER HAD GOOD CONTACT DUE TO AN OVERLOAD OF THE CONNECTOR.  I'M ATTACHING A PICTURE.    THERE'S A RECALL DUE TO ANOTHER ONE OF THESE CONNECTORS AND IT WAS COMPLETED A WHILE AGO.  MY RECENT ISSUE IS NOT ADDRESSED BY NHTSA CAMPAIGN NUMBER: 11V-338.  MY FAULTY CONNECTOR IS S6 NOT THE S4 FROM THE RECALL.  I'VE READ THAT MANY OTHERS HAVE HAD ISSUES WITH THE SAME CONNECTOR AND IF FUTURE RIDERS HAVE A SIMILAR PROBLEM AS MINE WE ARE CERTAINLY LOOKING AT A MAJOR SAFETY ISSUE.",
        "vin": "JYARP15Y26A"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/30/2012",
        "dateOfIncident": "05/26/2012",
        "fire": false,
        "manufacturer": "Yamaha Motor Corporation, USA",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10460091,
        "products": [
            {
                "manufacturer": "Yamaha Motor Corporation, USA",
                "productMake": "YAMAHA",
                "productModel": "FJR13",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "RIDING IN WESTERN VIRGINIA, ON A WARM SATURDAY AFTERNOON, I NOTICED MY TURN SIGNAL INDICATOR LIGHTS WERE BOTH ON, AND FLASHED WEIRDLY WHEN I USED THEM.  I ALSO LOST THE ELECTRIC ADJUSTABLE WINDSHIELD, AND DISCOVERED WHEN I STOPPED THAT I HAD NO HEADLIGHTS.   THIS WAS PAINFUL BECAUSE THE RIDE I WAS ON INVOLVED A LOT OF NIGHT TIME RIDING.   LUCKILY THIS HAPPENED DURING THE DAY AND I WAS ABLE TO USE MY AUXILIARY LIGHTS THAT NIGHT.    UPON DIS-ASSEMBLY, A GROUND SPIDER (S6) UNDER THE NOSE OF THE BIKE, NOT COVERED OR INSPECTED BY THE CURRENT RECALL WAS BURNED TO A CRISP.   THIS WOULD HAVE BEEN REALLY  BAD HAD I LOST MY LIGHTS AT SPEED, AT NIGHT ON A TWISTY MOUNTAIN ROAD.  *TR",
        "vin": "JYARP15EX6A"
    }
]