[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/17/2017",
        "dateOfIncident": "12/15/2016",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10945699,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 BOLDER (NA). THE CONTACT STATED THAT THE VEHICLE LOST BRAKING POWER. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 9,000.",
        "vin": "5B4MP67G163"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/18/2010",
        "dateOfIncident": "07/18/2010",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10361022,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 FLEETWOOD BOUNDER EQUIPPED WITH A WORKHORSE W22 CHASSIS. THE CONTACT STATED THAT THE FRONT PASSENGER SIDE CALIPERS LOCKED SUDDENLY WHILE HE WAS DRIVING 35 MPH. HE PULLED OVER USING THE EMERGENCY BRAKE AND UNLOCKED THE CALIPER. THE CONTACT CALLED THE DEALER WHO STATED THAT THEY WOULD REPLACE THE CALIPERS ACCORDING TO RECALL 09V110000 (SERVICE BRAKES, HYDRAULIC) BUT WOULD NOT REPLACE THE ROTORS AND BRAKE PADS WHICH WERE ALSO DAMAGED. THE CONTACT CALLED THE MANUFACTURER WHO STATED THAT HE COULD SUBMIT INVOICES FOR THE OTHER PARTS BUT THEY WOULD NOT GUARANTEE REIMBURSEMENT. THE CURRENT AND FAILURE MILEAGES WERE APPROXIMATELY 17,000.",
        "vin": "5B4MP67G363"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/28/2010",
        "dateOfIncident": "09/16/2010",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10358093,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 WINNEBAGO ADVENTURER EQUIPPED A WORKHORSE W22 CHASSIS. THE CONTACT RECEIVED A RECALL LETTER REGARDING THE CHASSIS (RECALL 09V110000, SERVICE BRAKES HYDRAULIC). THE CONTACT CALLED THE MANUFACTURER WHO STATED THAT THEY WOULD MAKE AN APPOINTMENT FOR HIM BUT NO PARTS WERE AVAILABLE FOR THE REPAIR. THE CONTACT WAS CONCERNED THAT THE PARTS FOR REPAIR WERE UNAVAILABLE AND THE SAFETY ISSUE HAD NOT BEEN ADDRESSED. THE FAILURE AND CURRENT MILEAGES WERE APPROXIMATELY 16,000. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/19/2010",
        "dateOfIncident": "12/16/2009",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10343984,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 WORKHORSE W22.  THE CONTACT RECEIVED NHTSA RECALL CAMPAIGN ID NUMBER: 09V110000, SERVICE BRAKES HYDRAULIC IN DECEMBER 2009 AND IN APRIL 2010.  SHE STATED THAT  WORKHORSE INFORMED HER THAT THEY DO NOT MAIL RECALL NOTICES. THE CONTACT WAS ADVISED TO CALL NHTSA SO THAT THEY COULD FORCE THE DEALER TO PERFORM THE RECALL REPAIRS. THE CONTACT STATED THAT THE BRAKES FAILED FOUR TIMES AND SHE DOES NOT FEEL SAFE DRIVING THE VEHICLE. THE VEHICLE WAS BEING REPAIRED BY THE DEALER WHEN THE COMPLAINT WAS FILED. THE FAILURE MILEAGE WAS APPROXIMATELY 15,000.  THE CURRENT MILEAGE WAS APPROXIMATELY 33,000 WHEN THE COMPLAINT WAS FILED. THE VIN WAS UNKNOWN.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/23/2010",
        "dateOfIncident": "10/06/2009",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10321564,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2006 WORKHORSE CHASSIS W22 RV. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 45 MPH, HE COULD SMELL A BURNING ODOR COMING FROM THE VEHICLE. THE DUAL CYLINDER THEN BEGAN LEAKING OIL AND THE BRAKE PEDAL FELL ONTO THE FLOORBOARD. THE DEALER REPLACED THE CALIBER AND MASTER CYLINDER UNDER AN UNKNOWN RECALL CAMPAIGN. THE CONTACT PREVIOUSLY RECEIVED AN INTERIM RECALL NOTICE STATING THAT THE MANUFACTURER WOULD REPLACE COMPONENTS ON THE VEHICLE WITH OLDER OEM PARTS. THE CONTACT WAS CONCERNED THAT THE OEM PARTS WERE DEFECTIVE AND WOULD CONTINUE TO EXHIBIT THE SAME FAILURES. THE APPROXIMATE FAILURE MILEAGE WAS 6,800 AND THE CURRENT MILEAGE WAS 7,700.      UPDATED 5/17/2010 * CN  UPDATED 08/18/10",
        "vin": "5B4MP67G163"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/06/2009",
        "dateOfIncident": "10/02/2009",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10286418,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 WORKHORSE CHASSIS W22. HE RECEIVED RECALL NOTICE# 09V110000 (SERVICE BRAKES, HYDRAULIC) IN MAY OF 2009, AND HE IMMEDIATELY NOTIFIED THE DEALER. HE WAS ADVISED THAT SINCE  THE PARTS WERE UNAVAILABLE, THEY COULD USE OLD REPLACEMENTS PARTS TO REMEDY THE FAILURE. THE FAILURE HAS NOT BEEN PROPERLY REMEDIED. THE FAILURE AND CURRENT MILEAGES WERE 21000.    UPDATED 10/27/09 *BF  THE CONSUMER STATED THE BRAKES OVERHEATED DUE TO DEFECTIVE CALIPERS. THE REPAIR OF THE LEFT FRONT BRAKE LASTED ONLY 6 BLOCKS DOWN THE ROAD BEFORE THE ABS LIGHT ILLUMINATED.  UPDATED 10/29/09.*JB",
        "vin": "5B4MP67G163"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/17/2009",
        "dateOfIncident": "07/10/2009",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10277207,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 WORKHORSE W22 CHASSIS.  THE CONTACT STATED THAT THE BRAKES FAILED AND THE VEHICLE WAS REPAIRED ACCORDING TO NHTSA CAMPAIGN ID NUMBER 09V110000.  THE MECHANIC STATED THAT THE ORIGINAL PARTS WERE USED FOR THE RECALL REPAIR.  THE CURRENT MILEAGE WAS APPROXIMATELY 23,600 AND FAILURE MILEAGE WAS 23,406.",
        "vin": "5B4MP67G863"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/21/2009",
        "dateOfIncident": "11/15/2005",
        "fire": true,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10269610,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2006 WORKHORSE W22.  WHEN THE CONTACT DEPRESSED THE BRAKE PEDAL, HE SMELLED A STRONG BURNING ODOR AND NOTICED SMOKE.  OCCASIONALLY, HE EXPERIENCES REDUCED BRAKING CAPABILITY.  HE RECEIVED A RECALL NOTICE FOR NHTSA CAMPAIGN ID NUMBER 09V110000 (SERVICE BRAKES, HYDRAULIC) AND CALLED THE MANUFACTURER.  A REPRESENTATIVE STATED THAT THE REMEDY WILL NOT BE AVAILABLE UNTIL DECEMBER OF 2009.  THE CONTACT WOULD HAVE TO PAY $3,000 TO HAVE THE COMPONENT REPLACED.  THE VEHICLE HAS NOT BEEN REPAIRED.  THE MILEAGES WERE NOT APPLICABLE.",
        "vin": "1FDXE45S64H"
    }
]