[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/05/2008",
        "dateOfIncident": "05/04/2008",
        "fire": true,
        "manufacturer": "American IronHorse Motorcycle Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10226707,
        "products": [
            {
                "manufacturer": "American IronHorse Motorcycle Company",
                "productMake": "AMERICAN IRONHORSE",
                "productModel": "BANDERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 GALATA X19 MOTORCYCLE SUPERBIKE. THE MOTORCYCLE CAUGHT FIRE WHILE IT WAS PARKED AND UNUSED FOR TWO WEEKS. THE KEYS WERE NOT IN THE IGNITION AND THE FUEL TANK WAS HALF FULL. THERE WAS NO INDICATION OF WHAT COULD HAVE CAUSED THE FIRE. THE FIRE DEPARTMENT STATED THAT IT COULD HAVE BEEN DUE TO FAULTY ELECTRICAL WIRING. THE DEALER HAS NOT DIAGNOSED THE FAILURE. THE CURRENT AND FAILURE MILEAGES WERE 70.",
        "vin": "L4PLUMD0171"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/10/2007",
        "dateOfIncident": "11/18/2007",
        "fire": false,
        "manufacturer": "American IronHorse Motorcycle Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10211412,
        "products": [
            {
                "manufacturer": "American IronHorse Motorcycle Company",
                "productMake": "AMERICAN IRONHORSE",
                "productModel": "BANDERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "ON NOVEMBER 17TH, 2007 WE PURCHASED 2 ( TWO) BAJA 250  CC BAJA MOTORSPORT DIRT BIKES AT THE PRICE OF $ 1292.00 EACH FROM TWO DIFFERENT PEP BOYS LOCATIONS IN SAN ANTONIO, TEXAS DUE TO EACH PEP-BOYS CARRYING ONLY ONE VEHICLE. IN TOTAL WE SPENT OVER $ 2500 LATE THE EVENING OF THE 17TH.  MY CHILDREN HAD USE OF THE VEHICLES FOR ONLY A FEW MINUTES OF RIDE TIME AFTER WHICH THE BACK END OF THE BIKES HAD A PART ( A HUB ? ) BUST APART RENDERING THE VEHICLES STOPPED MID-RIDE, CAUSING A FALL AS THE FAULTY PART SHREDDED ONE TIRE CAUSING MY 16 Y/O TO FALL.  IT HAS BEEN ALMOST ONE MONTH NOW, AND REPRESENTATIVES FROM BAJA HAVE REFUSED MULTIPLE REQUESTS FOR CONTACT BY A REPRESENTATIVE FROM MANAGEMENT.  AT THIS TIME WE HAVE CLOSE TO 16 HOURS OF DOCUMENTED TIME CONSTANTLY CALLING BAJA MOTOR SPORTS IN AN ATTEMPT TO REMEDY THE SITUATION.    WE WOULD LIKE TO ASK FOR OUR MONEY BACK ? THEY HAVE SENT US A VOUCHER NUMBER FOR ONE BIKE REDEEMABLE AT PEP BOYS BECAUSE THEY ARE UNABLE TO RESTORE THE BIKE PER WARRANTY TO SAFE CONDITION, YET HAVE FAILED TO TAKE ACTION ON THE OTHER BIKE ? BOTH REMAIN UN-REPAIRED AT  THEIR DESIGNATED REPAIR SHOP IN SAN ANTONIO.  OUR CONCERN IS # 1 ? LACK OF CONSISTENT TRACKING OF OUR COMPLAINT, # 2 ? CONSISTENT REFUSAL BY MANAGEMENT OR SUPERVISORY STAFF TO CALL US BACK OR TAKE AN INBOUND CALL FROM US # 3 ? FAILURE TO ORDER PARTS - # 4 ? TAKING OUR MONEY FOR A VEHICLE THAT DOES NOT WORK - # 4 ? NO ACCOUNTABILITY ON THE PART OF THE VENDOR, PEP BOYS  - # 5 ? ATTEMPTING TO TALK US INTO ACCEPTING PARTS THAT WERE NOT MADE FOR THESE BIKES - # 6 ? FAILURE TO REPAIR THE BIKES IN A TIMELY MANNER - # 7 ? DEPRIVING US OF THE USE OF OUR $ 2500 PURCHASE, KEEPING MY CHILDREN FROM THEIR CHRISTMAS AND THEIR BIRTHDAY GIFT.  WE  FEEL THE PART THAT BROKE IS NOT PROPERLY MANUFACTURED FOR THIS MODEL OF BIKE AND POSES A SERIOUS RISK BASED ON HOW BOTH OUR SON'S BIKES PARTS CAME APART MID-RIDE. PS THIS IS A BAJA MOTORSPORTS BIKE.  *TR",
        "vin": "LZXYCNL4570"
    }
]