[
    {
        "components": "AIR BAGS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/19/2016",
        "dateOfIncident": "07/01/2016",
        "fire": false,
        "manufacturer": "Frontier RV, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10907510,
        "products": [
            {
                "manufacturer": "Frontier RV, Inc.",
                "productMake": "ASPEN",
                "productModel": "30RLBS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL...WHEN I CALLED AND SPOKE WITH HELFMAN DODGE, THEY REFUSED TO GIVE ME A RENTAL FOR THIS PROBLEM AND INFORMED ME THAT THEY DO NOT HAVE THE PARTS FOR THE PASSENGER AIRBAG.  I THINK THAT IS UNACCEPTABLE AND UNSAFE THAT I CANNOT GET THE ENTIRE PROBLEM FIXED IN THIS VEHICLE.  MY MOST IMPORTANT ISSUE IS THE FACT THAT THIS CAR SPITS THE GAS BACK OUT WHILE FUELING.  I HAVE TRIED TO HAVE THIS PROBLEM FIXED TWICE.  THE PROBLEM IS STILL NOT FIXED.  I HAVE HAD MY FUEL TANK DROPPED TWICE TO RESOLVE THE ISSUE OF THE SPILLING OVER OF GAS AND THE FACT THAT MY ENGINE WAS NOT EVEN GETTING GAS TO IT, WHEN THE TANK HAD GAS IN IT AND WOULD JUST SHUT OFF WHILE I AM GOING 70 MPH ON THE HIGHWAY.  I CONTACTED CHRYSLER CORP AND THEY INFORMED ME OF IT HAVING NO SUCH PROBLEMS, AND THEN WHEN I DID SOME RESEARCH, I FOUND THERE HAD INFACT BEEN SEVERAL ISSUES WITH THE SAME PROBLEM I WAS EXPERIENCING. THEY THEN TRIED TO HELP ME FIND A REPAIR SHOP AND THEN REFUSED TO GIVE ME A RENTAL WHILE THEY HAD MY CAR....NEEDLESS TO SAY BECAUSE I CANNOT AFFORD A RENTAL WHILE THEY HAVE MY CAR SIT AND WAIT TO BE DIAGNOSED AND REPAIRED, I CANNOT TAKE MY CAR TO THE SHOP, BECAUSE THEY ARE REFUSING TO GIVE ME A RENTAL FOR AN ISSUE THEY ARE WELL AWARE OF.  I ALSO ASKED TO BE REIMBURSED FOR MY OUT OF POCKET COSTS AND THAT HAS NOT HAPPENED EITHER. I HAVE VIDEO OF THE CAR SPITTING OUT GAS AND REPAIR BILLS!!  THIS PROBLEM HAS BEEN GOING ON FOR MONTHS....JULY-AUGUST WAS THE EARLIEST THAT I STARTED SEEKING HELP BECAUSE AT THIS POINT THE CAR STARTED STOPPING INSTANTLY ON ME!!",
        "vin": "1A8HX58277F"
    }
]