[
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "08/08/2018",
        "dateOfIncident": "08/03/2015",
        "fire": false,
        "manufacturer": "REV Recreation Group",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11118518,
        "products": [
            {
                "manufacturer": "REV Recreation Group",
                "productMake": "AMERICAN COACH",
                "productModel": "AMERICAN TRADITION",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "SMART STEERING WHEEL ELECTRICAL FUNCTIONS FAIL UNEXPECTEDLY. THE HORN, WINDSHIELD WIPERS AND CRUISE CONTROL ARE AFFECTED. ANY ONE OF WHICH CAN CAUSE AN ACCIDENT IN THESE VERY LARGE VEHICLES. MYSELF AND MANY OTHER OWNERS OF THIS BRAND AND GENERATION HAVE COMPLAINED ON AN ON-LINE OWNERS FORUM. IT IS A COMMON PROBLEM THAT THE WIRING TERMINAL CONNECTIONS TO THE SMART WHEEL CONTROLLER JUST STOP MAKING CONTACT DUE TO NON-ROBUST TERMINALS. SPARTAN CHASSIS TELLS THE CUSTOMER THAT IT'S A FAULTY MODULE, BUT A NEW MODULE IS AN EXPENSIVE AND VERY TEMPORARY FIX. REMOVING THE WIRING TERMINALS FROM THE MODULE, CLEANING THEM, AND REINSERTING THE CONNECTORS IS ALSO A TEMPORARY FIX. WHILE DRIVING IN TRAFFIC, MY COACH HAS UNEXPECTEDLY LOST WINDSHIELD WIPERS SEVERAL TIMES, JUST WHEN YOU NEED THEM THE MOST. ONCE, THE HORN FAILED, AND TWICE, THE CRUISE CONTROL FAILED. AFTER PAYING SPARTAN TO INSTALL A NEW MODULE, THE PROBLEM RETURNED ONLY TWO MONTHS LATER. SINCE THEN, I HAVE HAD TO REMOVE AND REINSERT THE CONNECTORS TO THE MODULE SEVERAL TIMES TO GET ALL FUNCTIONS WORKING AGAIN. MANY OWNERS ARE HAVING THIS PROBLEM, AND IT NEEDS TO BE ADDRESSED TO PREVENT TERRIBLE ACCIDENTS. SPARTAN NEEDS TO RECALL THESE UNITS AND REPLACE THE SMART WHEEL WIRING HARNESSES WITH MUCH MORE ROBUST TERMINAL CONNECTORS.",
        "vin": "4VZBR1D9X7C"
    }
]