[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/31/2007",
        "dateOfIncident": "12/03/2007",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10213885,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "F650 GS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "2007 BMW F650 WITH SCRATCHED SIDE PANELS AND SAFETY DEFECT. CONSUMER STATES THAT THE DEALER NEVER RETURNED HIS PHONE CALL. HE THEN NOTICED THAT THE BATTERY WAS NOT MOUNTED IN THE RIGHT SPOT. SERIOUS THINGS COULD HAPPEN IF ACID WERE TO LEAK.  *KB  THE CONSUMER DISCOVERED THE BATTERY WAS MOUNTED HIGHER THAN THE HIS WAISTLINE. HE ALSO FOUND THAT THE BATTERY WAS MOUNTED FORWARD WHEN SITTING ON THE MOTORCYCLE. THE PLASTIC HOSE WHICH WAS MEANT TO VENT THE BATTERY WAS NOT CONNECTED. THE HOSE WAS LYING FORWARD OF THE BATTERY COMPARTMENT AND APPEARED NEW.  THE CONSUMER REMOVED THE BATTERY AND FOUND THAT TWO OF THE CELLS WERE FILLED WELL ABOVE THE MAXIMUM LINE. IT APPEARED THE BATTERY ACID HAD FLOWED OUT OF THE BATTERY AND HAD COURSED THROUGH THE ENGINE AREA, DOWN THE FRAME AND HAD DRIPPED ON THE ENGINE AND REAR SUSPENSION ADJUSTMENT CONTROL. *JB",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/11/2007",
        "dateOfIncident": "06/11/2007",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10196110,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "F650 GS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 BMW F650 GS.  WHILE DOWNSHIFTING, THE ENGINE SHUT OFF AND LOCKED UP THE ABS.  THE VEHICLE WENT INTO A SKID.  AFTERWARDS, THE ABS UNLOCKED AND THE VEHICLE RESTARTED.  THE VEHICLE HAS NOT BEEN DIAGNOSED AT THIS TIME.  THE PURCHASE DATE WAS UNKNOWN.  THE CURRENT AND FAILURE MILEAGES WERE 550.",
        "vin": "WB10226017Z"
    }
]