[
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/10/2021",
        "dateOfIncident": "10/08/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436242,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R 1200 GS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "When starting the bike, suddenly fuel started dripping down onto the front wheel and onto the exhaust. I noticed the fuel on the suction side (right side) of the gas tank pooling up and spraying out. Upon disassembly, the male 90 degree fuel quick disconnect (replacement part number BMW 13537674765) came apart when trying to release the hose from the female coupling. Replacing the connector and the clamp resolved the issue and fuel is no longer leaking. The last time this area was serviced was in 2014 when one of the other fuel tank recalls was completed and a reinforcement ring was installed on the flange at this location to prevent the flange itself from cracking, but in this instance it was the fitting itself. Called BMW motorcycles or Jacksonville (Florida ) and they indicated there is no warranty / recall/ service bulletin for this repair and I was able to purchase the part and perform the replacement.",
        "vin": "WB10397047Z"
    },
    {
        "components": "SUSPENSION,POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "10/07/2020",
        "dateOfIncident": "08/28/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11363262,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R 1200 GS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVE SHAFT FAILURE WHICH TOOK OUT THE SWING ARM WHILE DOING SPEED OF 35-45 MPH ON BACK COUNTRY ROAD. IF ON HIGHWAY OR INCREASES SPEED, INCIDENT MAY CAUSE LOSS OF LIFE",
        "vin": "WB10397097Z"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/25/2020",
        "dateOfIncident": "09/05/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361069,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R 1200 GS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FUEL PUMP ON THE MOTORCYCLE IS LEAKING AND SPRAYING GAS ALL OVER ME WHEN I DRIVE",
        "vin": "WB10397027X"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/13/2020",
        "dateOfIncident": "02/12/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11309054,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R 1200 GS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER STARTING THE BIKE AND ALLOWING IT TO WARM UP, I NOTICED A LARGE PUDDLE FORMING UNDER THE FRONT OF THE BIKE.  UPON CLOSER INSPECTION I FOUND THE FUEL LINE QUICK CONNECT TO THE FUEL PUMP HAD SPLIT AND SPRAYING FUEL WHEN UNDER PRESSURE.  THIS WAS DRIPPING DOWN ONTO THE HOT HEADER.",
        "vin": "WB10397087Z"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/03/2019",
        "dateOfIncident": "07/10/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11266390,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R 1200 GS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "DO NUMBENOT R,  INCLUDE VEHICLE ANY IDENTIFICATION PERSONAL NUMBER INFORMATION (VIN), ETC ... ).  L SECURITY/DRIVER LICENSE   THE RECALL FUEL FOR THIS PUMP ISSUE, RUPTURED BUT AND BMW BEGAN FEELS THAT SHOOTING IF THEY GASOLINE REPLACED ALL THE OVER FLANGE, MY LEG THERE AS I IS WAS NO NEED RIDING TO HOME. REPLACE THE APPARENTLY PUMP THERE AND IS THEY AN HAVE EXISTING HOME. SATISFIED THE RECALL. THE RECALL WAS ISSUED IN 2014 AS RECALL 13V-617. MY LEFT LEG WAS SOAKED IN GASOLINE BY THE TIME I GOT HOME. *BF      'PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).'*JB",
        "vin": "WB10317A07Z"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/22/2016",
        "dateOfIncident": "08/19/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10897569,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R 1200 GS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 BMW R 1200 GS ADVENTURE. WHILE DRIVING APPROXIMATELY 20 MPH, THERE WAS AN ODOR OF FUEL AND FUEL FUEL LEAKED ON THE VEHICLE. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE VEHICLE WAS SERVICED PER NHTSA CAMPAIGN NUMBER: 13V617000 (FUEL SYSTEM, GASOLINE), BUT THE REMEDY FAILED TO REPAIR THE FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 26,000. THE VIN WAS NOT AVAILABLE.   UPDATED 10/21/16*LJ  *TR",
        "vin": "WB10397027Z"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/28/2014",
        "dateOfIncident": "04/27/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10585192,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R 1200 GS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON TRYING TO START MY 2007 R1200GS I GOT AN ERROR MESSAGE ON THE CLUSTER \"EWS\".    A QUICK GOOGLE SEARCH REPORTED THAT THE ERROR CODE MEANT \"IGNITION KEY ANTENNA ERROR\". SOME FORUMS READING REVEALED THAT THIS IS A COMMON PROBLEM, ESPECIALLY WITH THE 2007 R1200GS, BUT CAN HAPPEN TO OTHER MODEL YEARS AND OTHER BMW BIKES TOO.     THERE WAS NOTHING I COULD DO TO START THE BIKE. I HAD TO BE TOWED.   *JS",
        "vin": "WB10317A87Z"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/09/2013",
        "dateOfIncident": "09/03/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10542601,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R 1200 GS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER RIDING THE VEHICLE AND PUTTING IT BACK IN MY GARAGE, I COULD SMELL A STRONG GASOLINE ODOR.  ON DETAILED INSPECTION I FOUND GAS POOLING IN THE \"FUEL PUMP FLANGE\".  THIS PART IS LOCATED ON THE UPPER LEFT HAND SIDE OF THE FUEL TANK.  AFTER CLEANING THE AREA, I COULD SEE DISTINCT CRACKS ALL AROUND THE FUEL LINE INLET AND GAS WOULD CONTINUOUSLY SEEP OUT OF THE CRACKS WHILE THE ENGINE WAS RUNNING.  *TR",
        "vin": "WB10397097Z"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/21/2013",
        "dateOfIncident": "08/20/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10536530,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R 1200 GS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 BMW R 1200 GS MOTORCYCLE. THE CONTACT STATED THAT THE FUEL PUMP WAS LEAKING. THE MANUFACTURER WAS CONTACTED ABOUT THE FAILURE. THE VEHICLE WAS NOT REPAIRED OR DIAGNOSED. THE FAILURE MILEAGE WAS APPROXIMATELY 47,000.  UPDATED 10/29/13*LJ  THE FLANG AT THE JOINT BETWEEN THE FUEL PUMP OUTPUT AND THE FUEL LINE, HAD A SPLIT, THUS ALLOWING FUEL TO LEAK AND RUN DOWN THE FRONT SIDE OF THE MOTORCYCLE THE EXHAUST HEADER. UPDATED 10/29/13",
        "vin": "WB10317A87Z"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/19/2013",
        "dateOfIncident": "07/26/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10536113,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R 1200 GS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING ROUTINE SERVICE, IT WAS NOTED THAT THE REAR WHEEL FLANGE HAD DEVELOPED STRESS FRACTURES IN 3 OF 5 BRAKE ROTOR MOUNTING POINTS.  INTERNET INVESTIGATION HAS REVEALED THAT THIS IS A COMMON OCCURRENCE FOR R1200 SERIES BMW MOTORCYCLES.  THE REPLACEMENT OEM PART HAS BEEN REDESIGNED MULTIPLE TIMES IN AN APPARENT ATTEMPT TO PREVENT RECURRENCE.  COMPLETE FAILURE OF THIS PART HAS BEEN DOCUMENTED BY OWNERS, LEADING TO VEHICLE DAMAGE AND RISK OF LOSS OF CONTROL.  THERE HAVE BEEN INCIDENTS WHERE WHEEL MOUNTS HAVE EXPERIENCE SIMILAR STRESS CRACKS.   *TR",
        "vin": "WB10317A07Z"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/10/2012",
        "dateOfIncident": "09/10/2008",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10474476,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R 1200 GS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 BMW R1200 GS MOTORCYCLE. THE CONTACT STATED THAT THE LOW BEAM RUNNING LIGHTS BURNED OUT EXTREMELY QUICK. THE CONTACT WAS UNABLE TO SEE THE ROADWAY BECAUSE THE FAILURE WOULD OCCUR SPORADICALLY. THE VEHICLE WAS TAKEN TO THE DEALER WHO ADVISED THAT THE FAILURE WAS CAUSED BY THE BULBS, WHICH THEY RECOMMENDED THE CONTACT REPLACE. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 7,000 AND THE CURRENT MILEAGE WAS 43,000.",
        "vin": "WB10317A67Z"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/27/2012",
        "dateOfIncident": "06/12/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10467998,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R 1200 GS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKE FAILURE LIGHT CAME ON AT THE BEGINNING OF AN EXTENDED TRIP. I PULLED OVER, SHUT THE MOTORCYCLE OFF, RESTARTED THE MOTORCYCLE, AND THE BRAKE FAILURE LIGHT CONTINUED. BMW SERVICE SAID THE ABS CONTROL MODULE HAD FAILED, AND AS A RESULT NO ABS BRAKES WERE AVAILABLE ON THE MOTORCYCLE, WHICH COULD HAVE RESULTED IN A CRASH. BMW CHARGED $1000 FOR THE PART, PLUS LABOR, AND HAS ON TWO OCCASIONS SINCE THE REPLACEMENT, REFUSED TO PARTIALLY REIMBURSE FOR THIS PART OR ACKNOWLEDGE THAT THEY MAY HAVE A SERIOUS SAFETY ISSUE.  *TR",
        "vin": "WB10317AX7Z"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/06/2012",
        "dateOfIncident": "10/16/2009",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10454396,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R 1200 GS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL PRESSURE CONTROL MODULE FAILED WITHOUT WARNING LEAVING ME STRANDED IN THE MIDDLE OF THE FREEWAY. PART WAS REPLACED UNDER WARRANTY BUT FAILED AGAIN, LEAVING ME STRANDED AGAIN, ON JUNE 7, 2011. WAS TOLD BY THE DEALER THAT THIS WAS 'RARE'. SEEMS LIKE AN UNSAFE CONDITION TO ME.  *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "04/02/2012",
        "dateOfIncident": "03/30/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10453832,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R 1200 GS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 BMW GSR1200 MOTORCYCLE. THE CONTACT STATED THAT THE REAR WHEEL SEIZED ABNORMALLY. THE CONTACT OPENED THE RESERVOIR FOR THE BRAKE CHAMBER AND FOUND THAT THE RUBBER WAS SEVERELY WORN. THE CONTACT ALLOWED THE VEHICLE TO COOL DOWN AND THE FAILURE WAS CORRECTED TEMPORARILY. THE FAILURE RECURRED LATER WHILE THE CONTACT WAS DRIVING AT HIGHWAY SPEEDS. THE STEERING WHEEL SEIZED ABNORMALLY AND THE VEHICLE WAS FLIPPED OVER. THE CONTACT SUSTAINED INJURIES TO THE KNEES. THE CONTACT LATER DISCONNECTED THE ABS BRAKE SYSTEM AND THE FAILURE WAS CORRECTED. THE CONTACT SPOKE WITH THE DEALER AND WAS TOLD THAT THEY WERE NOT FAMILIAR WITH THE TYPE OF FAILURE THAT THE CONTACT HAD ENCOUNTERED AND OFFERED NO FURTHER ASSISTANCE.  THE VEHICLE WAS NOT INSPECTED OR REPAIRED FOR THE FAILURE. THE FAILURE AND CURRENT MILEAGES WERE 46,000.",
        "vin": "WB10317A27Z"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "03/09/2012",
        "dateOfIncident": "10/20/2011",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10450888,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R 1200 GS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE RIDING DURING NORMAL OPERATIONS MY FRONT BRAKES ENGAGE AND LOCK UP THE FRONT TIRE, STOPPING THE MOTORCYCLE IN PLACE.  THIS HAS HAPPENED ON MULTIPLE OCCASIONS.  WHEN THIS HAPPENS WHILE MAKING A TURN I DROPPED THE MOTORCYCLE, LEFT THE TIRE LOCKED UP, UNABLE TO MOVE THE MOTORCYCLE IN TRAFFIC.  *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/16/2011",
        "dateOfIncident": "08/11/2011",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10420291,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R 1200 GS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "CRACKS IN THE PLASTIC TOP FLANGE OF THE FUEL PUMP ASSEMBLY RESULTED IS A SPRAY OF FUEL WHEN SYSTEM UNDER OPERATING PRESSURE (IE. ENGINE RUNNING).  THIS 4 YEAR OLD MOTORCYCLE IS CURRENTLY NOT TO SAFE TO OPERATE AND IS OUT OF COMMISSION UNTIL TRAILERED TO A REPAIR FACILITY. THE FUEL SPRAY SOURCE APPEARS AROUND THE FEMALE THREADED 'HUB' OF THE FLANGE THAT ACCEPTS THE MALE THREADED 'QUICK DISCONNECT' OF THE FUEL LINE.  THE FAILURE (OR CRACKING) APPEARS TO BE SPONTANEOUS, AS NO PRIOR EVIDENCE (GASOLINE ODOR) WAS NOTICED. THIS MOTORCYCLE HAS BEEN DEALER SERVICED REGULARLY, AND IS GARAGED AT ALL TIMES (DESERT S.W.).  THE BIKE IS PAMPERED AND HAS NEVER BEEN ABUSED.  I JUST CAN'T IMAGINE HOW A RELATIVELY LOW TIME, CRITICALLY IMPORTANT COMPONENT HAS FAILED.  AN INTERNET SEARCH INDICATES THIS IS NOT AN ISOLATED EVENT FOR BMW MOTORCYCLES.",
        "vin": "WB10317A17Z"
    }
]