[
    {
        "components": "SERVICE BRAKES, AIR",
        "crash": false,
        "dateComplaintFiled": "10/04/2021",
        "dateOfIncident": "10/03/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435428,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2007 Cadillac CTS. The contact works for an independent mechanic and place the vehicle on a lift and noticed that both the driver’s and passenger’s side rear brake cable had cracks and leakage of brake fluid from the brake line due to severe corrosion. The vehicle was not diagnosed or repaired. The manufacturer was made aware of the failure. The failure mileage was approximately 79,000.",
        "vin": "1g6dm57t970"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": true,
        "dateComplaintFiled": "07/07/2021",
        "dateOfIncident": "12/28/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11423819,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2007 Cadillac CTS. The contact stated while driving 30 mph, the ignition switch failed, and the steering wheel locked causing the contact to lose control of the vehicle. The vehicle crashed on the driver's side on-ramp. There was no warning light illuminated. The contact and his daughter sustained injuries to the back but did not seek medical assistance. A police report was filed. The vehicle was towed to the contact's residence, then to the dealer. The contact stated that the failure was related to NHTSA Campaign Number: 14V394000 (Electrical System). The contact received the recall notification after the crash. The contact stated that the dealer refused to provide a diagnostic test on the vehicle. The vehicle was not repaired. The manufacturer was made aware of the failure. The contact was informed that the vehicle owner was responsible for the cost of the repair. The approximate failure mileage was 130,000.",
        "vin": "1g6dm57t170"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/18/2021",
        "dateOfIncident": "04/16/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421360,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "When driving my car will shut off by its self and it has done this the whole time I have had the car... When it shuts off the car gets reads stuck in park because the key gets stuck in ignition... When nights are on and I turn right my height lights come on... And my passenger air bag light came on and won't go off",
        "vin": "1G6DM57T970"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/18/2021",
        "dateOfIncident": "06/17/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11421361,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "Rear differential seal leaking Midas told me when I had the oil changed right after I got the car exactly one year and one day ago today and there is like a weird noise when I drive but if I turn the heat or air in it stops",
        "vin": "1G6DM57T970"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/05/2021",
        "dateOfIncident": "05/02/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415343,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MY OIL KEEPS RUNNING LOW EVERY 2 MONTHS AND MAKES A LOUD CLICKING SOUND. WAS TOLD THAT MY OIL IS BURNING AND THAT THEY DON'T KNOW WHY. VEHICLE IS IN MOTION WHEN IT STARTS TO JERK AND STARTS KICKING BACK AND MAKE KNOCKING NOISE IN THE ENGINE",
        "vin": "1G6DP577270"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/04/2021",
        "dateOfIncident": "05/04/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415206,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TIMING CHAIN HAS BEEN LOOSENED AND POSSIBLY READY TO BREAK. SERVICE BULLETIN #11340C WAS ISSUED AND GM/CADILLAC NEVER CONTACTED ME FOR THE SPECIAL COVERAGE REPAIR. THEY ARE NOW REFUSING TO ASSIST ME.  WHILE DRIVING VEHICLE THERE WAS BURNING RUBBER SMELL AND CAR HESITATED, FAILED TO ACCELERATE WHILE DRIVING ON A BUSY COUNTY ROAD IN DANVILLE INDIANA",
        "vin": "1G6DP577X70"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/24/2021",
        "dateOfIncident": "01/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397719,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. THE CONTACT STATED THAT THE BRAKE LINES FAILED.  THE CONTACT STATED THAT THE BRAKE LINES WERE MADE OF STAINLESS STEEL. THE BRAKE LINES CORRODED AND THE VEHICLE WAS UNDRIVABLE. THE CONTACT STATED THAT THE VEHICLE WAS TAKEN TO TWO UNKNOWN INDEPENDENT MECHANICS AND TWO UNKNOWN DEALERS TO HAVE A DIAGNOSTIC TEST PERFORMED. THE MECHANICS PERFORMED THE DIAGNOSTIC TEST AND INFORMED THE CONTACT THAT THE BRAKE LINES COULD NOT BE REPAIRED. THE DEALERS PERFORMED A DIAGNOSTIC AND INFORMED THE CONTACT THAT THE BRAKE LINES COULD NOT BE REPAIRED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS CONTACTED AND INFORMED OF THE FAILURE. THE CONTACT WAS INFORMED THAT THE VIN WAS NOT UNDER RECALL FOR THE FAILURE. THE FAILURE MILEAGE WAS 117,000.",
        "vin": "1G6DM57T170"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/03/2021",
        "dateOfIncident": "01/26/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11394417,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "\"SERVICE AIR BAG\" LIGHT CAME ON IN 2021 AFTER PSS MAT BEING REPLACED IN 2011 RECALL #10355 RENDERING THE ENTIRE AIR BAG SYSTEM ( BOTH DRIVER AND PASSENGER) INACTIVE. VEHICLE CURRENTLY IN DEALERSHIP FOR REPAIR FOR THE SECOND TIME FOR THE SAME ISSUE. DEALERSHIP REPORTED BOTH AIRBAGS INOPERABLE WHILE \"SERVICE AIR BAG\" LIGHT IS ON CREATING A SAFETY ISSUE IF VEHICLE IS DRIVEN UNTIL REPAIRED.",
        "vin": "1G6DM57T870"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "02/02/2021",
        "dateOfIncident": "12/28/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 11394312,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. THE CONTACT STATED THAT WHILE DRIVING ENTERING THE FREEWAY AT 40 MPH, THE STEERING WHEEL SEIZED, THE CONTACT WAS UNABLE TO TURNED THE WHEEL,  AS A RESULT, THE CONTACT CRASHED INTO THE FREEWAY ENTRANCE WALL RAMP. THE CONTACT, HIS WIFE AND DAUGHTER SUSTAINED NECK AND BACK INJURIES THAT REQUIRED MEDICAL ATTENTION. THE CONTACT MENTIONED, HIS DAUGHTER WAS A MEDICAL SURGEON AND TOOK CARE OF THEM. THE CONTACT MENTIONED THAT HE WAS NOT AWARE OF ANY WARNING LIGHTS ILLUMINATED BECAUSE THE FAILURE. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO  SYMES CADILLAC, 3475 E COLORADO BLVD, PASADENA, CA 91107, AND WAS DIAGNOSED. THE CONTACT STATED THAT THE DEALER DID NOT DISCLOSE THE DIAGNOSTIC RESULT BUT HAD SEND THE DIAGNOSTIC RESULT TO THE MANUFACTURER. THE  MANUFACTURER WAS MADE AWARE OF THE FAILURE AND PROVIDED A CASE NUMBER. THE  FAILURE MILEAGE WAS 130,000.",
        "vin": "1G6DM57T170"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/07/2020",
        "dateOfIncident": "11/06/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11373569,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SELLER LIED ABOUT EVERYTHING! THE FIRST QUESTION I ASKED WAS IF THE CAR WAS IN AN ACCIDENT. HE BRAGGED ABOUT BEING A MECHANIC, AND DOING ALL THE WORK ON THE CAR, SO EVERYTHING IN THE CAR IS IN, \"TIP TOP SHAPE.\" HE REPLIED, \"NO, NEVER!\" HE DID NOT ALLOW US TO RIDE THE CAR ON THE INTERSTATE BEFORE THE PURCHASE, CLAIMING IT WAS ILLEGAL. 10 MINS AFTER LEAVING THE CAR LOT, THE CAR CUTS OFF AND IS UNABLE TO CRANK BACK UP. THE SELLER MEETS US AND CLAIMS IT THE BATTERY. A \"NEW\" BATTERY WAS PLACED IN THE VEHICLE, BUT THE PROBLEM PERSISTS. MY FIANC, WHO IS NOT A MECHANIC, TOLD HIM   MORE THAN ONCE, THAT THE PROBLEM WAS NOT THE BATTERY, BUT THE ALTERNATOR. HE GOT THE CAR TO CRANK. AS WE ARE RIDING DOWN THE INTERSTATE, THE CAR CUTS OFF, AND WE ARE LEFT AIMLESSLY ROLLING AND ARE UNABLE TO CONTROL THE WHEEL. PLUS, THE ELECTRICITY IN THE CAR IS OFF SO WE CAN'T EVEN TURN ON OUR HAZARD LIGHTS TO CAUTION THE OTHER CARS ON THE ROAD. AFTER SPEAKING TO THE SELLER, ONCE AGAIN, HE TELLS US THERE IS NOTHING HE CAN DO ABOUT IT AND WILL NOT CANCEL THE DEAL. WE'VE ONLY HAD THE CAR FOR 4-5 HOURS. AFTER SPEAKING TO SEVERAL MECHANICS, THEY QUICKLY CONFIRM THAT THE ALTERNATOR IS THE PROBLEM AND ANYBODY THAT CLAIMS TO BE A MECHANIC CAN SEE THE PROBLEM IMMEDIATELY. THEY ALSO INFORM US THE CAR HAS BEEN WRECKED AND SHOULD HAVE NOT BEEN RESOLD FOR SAFETY MEASURES. DRIVING THIS VEHICLE ALMOST COST US OUR LIVES.",
        "vin": "1G6DP577X70"
    },
    {
        "components": "AIR BAGS,SEAT BELTS,SEATS",
        "crash": false,
        "dateComplaintFiled": "10/21/2020",
        "dateOfIncident": "10/10/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365609,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2007 MODEL YEAR CADILLAC CTS VEHICLE HAD A CONDITION WHERE REPEATED FLEXING OF THE PASSENGER SENSING SYSTEM MAT IN THE FRONT PASSENGER SEAT HAS CAUSED THE MAT TO KINK, BEND, OR FOLD. THE FLEXING BROKE THE CONNECTIONS IN THE MAT. THE FRONT PASSENGER AIRBAG HAS BECOME DISABLED. THE PASSENGER AIRBAG STATUS INDICATOR ON THE REARVIEW MIRROR SHOWS THAT THE AIRBAG IS OFF, THE AIR BAG INDICTOR DOES ILLUMINATE, AND A SERVICE AIR BAG MESSAGE DOES APPEAR IN THE DRIVER INFORMATION CENTER AND HAS FOR YEARS! I HAVE REPEATEDLY  ASK VILLAGE CADILLAC, SERVICE ADVISOR: DEBBIE HENRY TO HAVE THE SEAT FIXED. THE PROBLEM WITH SERVICE ADVISOR IS THAT SHE LOOKS AT YOUR RECALL RECORDS. YOUR RECORDS INDICATE THAT MY VIN DOES NOT HAVE ANY OUTSTANDING RECALLS, WHICH IS CORRECT. WHAT I HAVE IS A LETTER FROM CADILLAC P.O. BOX 909989 MILWAUKEE, WI 53209-9989, STATING THAT THIS MAT CAN BREAK AND IT HAS BROKEN. ALSO, THE PLASTIC HOUSING OF THE SEAT BELT BUCKLE IS BROKEN, WHICH HAS STARTED TO FRAY THE SEATBELT STRAP. THE VEHICLE WAS PARKED IN THE GARAGE.",
        "vin": "1G6DP577170"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/12/2020",
        "dateOfIncident": "08/28/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363912,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN GETTING INTO THE PASSENGER SEAT AND SOMEONE WEIGHED ENOUGH TO ACTIVATE THE AIR BAG TO BE ON THE AIR BAG LIGHT WOULD FLICKER. THEN AFTER A WHILE THE AIR BAG LIGHT JUST STAYED ON AND HASN'T TURNED OFF EVEN WHEN KNOWONES SITTING THEIR. THIS STARTED HAPPENING ONLY WHEN SOMEONE WOULD ENTER THE CAR WHILE STATIONARY WITH THE VEHICLE ON. IT'S BEEN ABOUT 2 MONTHS SINCE THIS HAS STARTED.",
        "vin": "1G6DP577X70"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/19/2020",
        "dateOfIncident": "08/18/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350298,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS STATIONARY IN OUR HOME GARAGE. IT WOULD NOT START, IT WOULD START WHEN JUMPED BUT DIED SHORTLY AFTER. WE HAD THE BATTERY TESTED, IT WAS BAD, WE REPLACED W A NEW BATTERY. CAR STARTED RIGHT UP, BUT WOULD NOT CUT POWER ONCE THE KEY WAS REMOVED FROM THE IGNITION. CAR DINGS AND DASH AND RADIO ARE ON AS IF KEYS ARE STILL IN THE IGNITION.",
        "vin": "1G6DP577070"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/22/2020",
        "dateOfIncident": "04/02/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321872,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MINE IS THE TIMING CHAIN SLIPS CAUSED FROM WRONG VALVE COVER GASKET AND THE LIFE ON THE OIL",
        "vin": "1G6DP577770"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/27/2020",
        "dateOfIncident": "03/25/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319452,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS GIVING A RECALL PAPER IN THE MAIL , SO I TOOK MY CAR TO THE ADDRESS LISTED ON THE REFORM. THE DEALERSHIP DIDN'T DO THE RECALL. THE REASON THEY DECIDED NOT TO DO IT WAS BECAUSE I DIDN'T HAVE THE CORRECT KEYS AND WAS TOLD ' YOU CAR DOESN'T NEED IT, IT DOESN'T  HAVE THAT PROBLEM UNLESS YOU HAVE THE ORIGINAL KEY'. I TRIED CONTACTING THE MANUFACTURER TO CONFIRM THIS CLAM BUT THEY LEFT ME ON HOLD. I HAVE THE IMPRESSION THEY DIDN'T WANT TO DO THE SERVICE FOR FREE.I JUST WANT TO KNOW WEATHER MY CAR IS SAFE TO DRIVE.",
        "vin": "1G6DM57T870"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/20/2020",
        "dateOfIncident": "10/18/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11300547,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS INVOLVED IN A CRASH THAT WHEN HIT THE VEHICLE TURNED OFF AND AIRBAGS DID NOT WORK. I WAS HIT TWICE ON DRIVER REAR AND PASSENGER REAR, SPUN OUT AND NO AIRBAGS DEPLOYED. I WAS CROSSING OVER A CITY ROAD FROM A STOP SIGN,  WAS HIT AT 60 MPH. I WAS DOING 20 MPH GOING STRAIGHT ACROSS FROM THE STOP SIGN.",
        "vin": "1G6DP577770"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/20/2019",
        "dateOfIncident": "10/20/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11269777,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TURNING LEFT AT LOW SPEED THE BRAKES FAILED SO I CENTERED THE STEERING WHEEL AND THE CAR STOPPED.",
        "vin": "1G6DM57T570"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/27/2019",
        "dateOfIncident": "09/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11258574,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I SEEN THERE IS A RECALL BUT ON WEBSITE IT'S NOT SHOWING UP",
        "vin": "1G6DP577270"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/09/2019",
        "dateOfIncident": "09/05/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11254184,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. WHILE DRIVING APPROXIMATELY 70 MPH, THE CHECK ENGINE INDICATOR ILLUMINATED. THE DEALER AND MANUFACTURER WERE NOT CONTACTED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 69,690.",
        "vin": "1G6DP577070"
    },
    {
        "components": "EXTERIOR LIGHTING,AIR BAGS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/26/2019",
        "dateOfIncident": "04/11/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11235195,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR HAS MOMENTS WHERE I HAVE TO SLAM HARD ON THE. RAKES FOR IT TO STOP. I THOUGHT IT WAS MY BRAKES BUT I HAD THEM CHANGED AND IT STILL DOES IT AND FLASHES A SIGN THAT SAYS 'NO TRACTION CONTROL'. ALSO MY LEFT TURN SIGNAL DOES NOT WORK ON THE INSIDE AS IF THERE'S A MECHANICAL GLITCH. AND I HAVE A 'SERVICE AITBAG CODE' CONSTANTLY.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/20/2019",
        "dateOfIncident": "02/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208713,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. THE CONTACT STATED THAT THE AIR BAG WARNING INDICATOR ILLUMINATED AND INDICATED TO SERVICE THE AIR BAGS. AN INDEPENDENT MECHANIC INSPECTED THE VEHICLE AND STATED THAT THE VEHICLE WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 10V644000 (AIR BAGS). SIMPSON BUICK GMC OF BUENA PARK (714-690-6200, LOCATED AT 6600 AUTO CENTER DR, BUENA PARK, CA 90621) WAS NOTIFIED OF THE FAILURE AND STATED THAT THE VEHICLE WAS NOT INCLUDED IN THE RECALL. IN ADDITION, THE VEHICLE WAS NOT INCLUDED IN NHTSA ACTION NUMBER: EQ11001 (AIR BAGS). THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND STATED THAT THE VEHICLE WAS NOT INCLUDED IN THE RECALL. THE FAILURE MILEAGE WAS NOT AVAILABLE.  *BF",
        "vin": "1G6DP577870"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/16/2019",
        "dateOfIncident": "04/09/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11207971,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. THE CONTACT STATED THAT THE FUEL AND TEMPERATURE GAUGES MALFUNCTIONED AND THE KEY WAS STUCK IN THE IGNITION. THE VEHICLE WAS TAKEN TO CRESTMONT CADILLAC (26000 CHAGRIN BLVD, BEACHWOOD, OH 44122, (216) 831-5300) WHERE IT WAS DIAGNOSED THAT THE COMPUTER SYSTEM FOR THE VEHICLE WAS FAULTY AND NEEDED TO BE REPLACED. THE DEALER ALSO STATED THAT AN UNKNOWN RECALL REPAIR NEEDED TO BE PERFORMED FOR THE IGNITION AND KEY FAILURE. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 95,223.",
        "vin": "1G6DM57T270"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/26/2019",
        "dateOfIncident": "11/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11204036,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT BRAKE LINES RUSTED CAUSING LOSS OF BRAKE FLUID.",
        "vin": "1G6DM57TX70"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/06/2019",
        "dateOfIncident": "02/11/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11184621,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "IN AUGUST 2011, VEHICLE WAS TAKEN TO DEALER IN RESPONSE TO RECALL 10355 WITH APPROXIMATELY 31,600 MILES.  PART 19124390 PASSENGER SIDE SEAT CUSHION/AIRBAG MODULE WAS REPLACED.    IN FEBRUARY 2019, SERVICE AIRBAG LIGHT BECAME ILLUMINATED AND TAKEN TO DEALERSHIP FOR DIAGNOSIS.  MILEAGE WAS APPROXIMATELY 66,000.  THE DIAGNOSIS WAS TO REPLACE THE PASSENGER SIDE SEAT CUSHION/ AIR BAG MODULE, WHICH IS THE SAME ITEM REPLACED IN AUGUST 2011.  EVEN THOUGH IT HAS BEEN 7/8 YEARS SINCE REPAIR, THE VEHICLE HAS BEEN DRIVEN LESS THAN 35,000.  OF THOSE 35,0000, A FRONT PASSENGER WAS PROBABLY IN THE PASSENGER SEAT FOR ONLY 15,000 MILES.  I BELIEVE THIS SECOND SENSOR PART IS DEFECTIVE AND SHOULD BE REPLACED AT CADILLAC'S EXPENSE. DOCUMENTATION INCLUDING INVOICES AND ESTIMATES AVAILABLE UPON REQUEST.",
        "vin": "1G6DM57T870"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/05/2018",
        "dateOfIncident": "10/11/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11145340,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL.  WE HEARD FROM GM RECALL CENTER THAT OUR LOCAL GM DEALER, RALLY AUTO, DID THIS RECALL NOV 15, 2013.  THE AIRBAG LIGHT IS ON AGAIN NOT EVEN 5 YEARS LATER.  WE ARE SENIORS AND DO NOT DRIVE THIS CAR THAT FAR.  WE TOOK IT IN TO RALLY AND THEY PUT IT ON A MACHINE AND CHARGED US $143 TO TELL US IT WOULD BE ALMOST $1000 TO FIX THE AIRBAG MODULE IN THE PASSENGER SEAT.  IN RESEARCHING, IT SAYS THAT THE RECALLS NEVER EXPIRE IF THE MANUFACTURER AND PARTS AVAILABILITY ARE STILL THERE.  WE ARE SENIORS ON LIMITED INCOME AND THIS IS EXHORBITANT FEES.  THEY DID NOT CHECK UNDER THE SEAT TO SEE IF IT MIGHT BE A SIMPLE BREAKAGE OR BENDING OF WIRES I DON'T BELIEVE.  CAN YOU HELP US GET THIS FIXED?  IT SEEMS IT SHOULD NOT BE MESSED UP SO SOON.  THANK YOU.",
        "vin": "1G6DM57T570"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/26/2018",
        "dateOfIncident": "09/20/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11142784,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR IS RUNNING LIKE IT IS STUCK IN SOME KIND OF SAFETY MODE. IT DOES NOT WANT TO ACCELERATE UNLESS IT STARTS ACCELERATING IN THIRD GEAR. IT DOES NOT COME OUT OF 3RD GEAR AT ALL. THE ENGINE LIGHT AND AIRBAG LIGHTS ARE LIT UP ON THE DASH. THERE IS A COUPLE OF RECALLS LISTED FOR THE SAME EXACT YEAR MAKE AND MODEL BUT IT SAYS THAT THIS VIN NUMBER IS NOT UNDER RECALL. I THINK THAT THIS VEHICLE NEEDS TO BE INSPECTED TO SEE IF IT ACTUALLY DOES NEED TO BE LISTED UNDER THOSE RECALLS. IT IS NOT JUST THIS ONE SPECIFIC VIN NUMBER HAVING THESE ISSUES EITHER. I HAVE TALKED TO QUITE A FEW CADILLAC OWNERS THAT ARE HAVING THE SAME PROBLEMS AND THEIR VEHICLES ARE NOT LISTED UNDER THOSE RECALLS EITHER. IF YOU TURN ON THE CAR YOU PUT IT INTO DRIVE THE CAR REMAINS STUCK IN 3RD GEAR AND WILL NOT SHIFT THROUGH THE GEARS PROPERLY.",
        "vin": "1G6DP577070"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/23/2018",
        "dateOfIncident": "10/11/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11142153,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL.  WE HAVE AN AIR BAG LIGHT ON THE PASSENGER SIDE.  TOOK IN TO DEALER.  SAYS THE CODE B092 NEEDS PASS. PRESENCE.  QUOTED US ALMOST $1000 FOR REPAIR.  NOTE THAT THIS RECALL WAS TAKEN IN AND DONE NOV 2013.  WHY IS IT MESSING UP AGAIN?   HOW LONG IS THE REPAIR SUPPOSED TO LAST?  SHOULDN'T IT BE FIXED AT NO COST TO US?",
        "vin": "1G6DM57T570"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/09/2018",
        "dateOfIncident": "09/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11139278,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. AFTER STARTING THE ENGINE, THE \"SERVICE AIR BAG\" MESSAGE DISPLAYED AND REMAINED ILLUMINATED. THE FAILURE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER AND LOCAL DEALER (AUTONATION CADILLAC, 2101 45TH ST, WEST PALM BEACH, FL) WERE NOTIFIED, BUT NO ASSISTANCE WAS OFFERED. THE FAILURE MILEAGE WAS 26,000.",
        "vin": "1G6DP577370"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/01/2018",
        "dateOfIncident": "06/05/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11132730,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. WHILE APPROACHING A STOP SIGN, THE CONTACT DEPRESSED THE BRAKE PEDAL AND THE PEDAL TRAVELED ALL THE WAY TO THE FLOOR WITHOUT STOPPING THE VEHICLE. THE CONTACT HAD TO APPLY THE EMERGENCY BRAKE TO STOP THE VEHICLE. THE CONTACT STATED THAT THE SAME FAILURE OCCURRED IN SEPTEMBER OF 2018 AND JUNE OF 2015. THE VEHICLE WAS TAKEN TO BAKER CADILLAC (495 MAIN ST, LEOMINSTER, MA 01453), BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS CONTACTED AND DID NOT ASSIST. THE FAILURE MILEAGE WAS 127,034. *TT  CONSUMER STATED INCIDENT HAPPENED 3 TIMES BETWEEN 2015-2018. UPDATED 11/29/18*JB",
        "vin": "1G6DM57T370"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/11/2018",
        "dateOfIncident": "07/31/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11119304,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR WAS RUNNING FINE. THEN MY ENGINE SOUNDED LIKE A LOUD TRUCK. NO WARNING CAME. THE CHECK ENGINE LITE NEVER WENT ON SO I STOP DRIVING IT TILL IT WENT TO THE DEALERSHIP BECAUSE I WAS GOING TO HAVE IT TOWED AND WHEN I STARTED UP THE CAR THE ENGINE BLEW. I BOUGHT THIS CAR WITH A LIFETIME LIMITED POWERTRAIN WARRANTY AND IT COVERS THE ENGINE. THE WARRANTY IS GOOD FOR LIFE AS LONG AS I OWN THE CAR AND KEEP UP ON ALL MAINTANCE AT A GM DEALERSHIP WHICH I DID FOR 8 YRS. THE WARRANTY COMPANY WILL NOT COVER THE COST OF THE REPAIR BECAUSE THE DEALERSHIP THAT I BOUGHT IT FROM CLOSED. I CALLED GM AND THEY WILL NOT DO ANYTHING BECAUSE THEY STATED I NEED TO GO TO THE WARRANTY COMPANY. NOTHING STATES IN MY WARRANTY IF THE DEALERSHIP CLOSES THAT MY WARRANTY IS INVALUED. THAT IS NOT RIGHT I FEEL THAT GM SHOULD PAY THE COST OF THIS ENGINE BECAUSE I BELIEVE MY CHECK ENGINE LITE WAS FAULTY.",
        "vin": "1G6DP577970"
    },
    {
        "components": "STRUCTURE,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/19/2018",
        "dateOfIncident": "06/16/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11102590,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. WHILE DRIVING LOW SPEEDS, THE BRAKE PEDAL WAS DEPRESSED, BUT FAILED TO ENGAGE. THE CONTACT MENTIONED THAT SHE USED THE EMERGENCY BRAKE TO STOP THE VEHICLE. THE CONTACT KEPT DRIVING WITH THE EMERGENCY BRAKE ENGAGED. THE VEHICLE WAS TAKEN TO DAVID'S AUTO SALES INC (1804 S PETERSON AVE, DOUGLAS, GA 31535, (912) 384-8570) AND WAS INFORMED THAT THE VEHICLE WAS INVOLVED IN A FLOOD AND HAD HOLES UNDERNEATH THE VEHICLE, WHICH CAUSED DETERIORATION. THE DEALER ALSO INFORMED THE CONTACT THAT THEY COULD NOT ASSIST BECAUSE THE VEHICLE WAS PURCHASED \"AS IS'. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 56,000.",
        "vin": "1G6DM57T070"
    },
    {
        "components": "POWER TRAIN,EXTERIOR LIGHTING,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "04/21/2018",
        "dateOfIncident": "02/01/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11089256,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "YES I BEEN HAVING PROBLEM WITH TRANSMISSION AT FIRST BROUGHT CAR COUPLE MONTHS LATER THE CAR WOULD NOT BACK UP SO GOT THAT GRANNY REBUILT AND THEN FOUR AND HALF YEARS LATER HAVE PROBLEM WITH TYRANNY AGAIN BUT NOW AS YOU PUT FOOT ON PEDAL THE CAR GO FOR ONLY BOUT 5 OR 10 MINUTE THEN IT WOULD SLOW DOWN THEN WOULD JUST STOP WHEN PUT FOOT ON PEDAL. WIPER WOULD NOT TURN OFF ON IT OWN ONLY WHEN YOU TAKE FUSE OUT THE RADIO STOP WORKING N THE BRIGHT LIGHT WOULD TURN ON BY ITS SELF EVERY TIME YOU PUT ON TURN SIGN ON AT NIGHT.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/21/2018",
        "dateOfIncident": "01/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11089257,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS YEAR GOT MY ALL CHANGE SAID I HAD OIL N WATER PUMP LEAK CAR HAVE BOUT 220000 MILES ON IT",
        "vin": ""
    },
    {
        "components": "AIR BAGS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/31/2018",
        "dateOfIncident": "03/30/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11082256,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING AND SERVICE BRAKE ASSIST MESSAGE CAME ON TWO DAYS AGO ALONG WITH THE ABS T/C LIGHT ON THE DASH. I HAD NO IDEA WHAT IT MEANT SO I'VE KEPT DRIVING. ABOUT AN HOUR AGO I WAS GETTING READY TO PARK INTO MY GARAGE AND THE BRAKES WOULD NOT WORK AND I ALMOST CRASHED INTO A PARKED CAR. AGAIN THE SERVICE BRAKE ASSIST LIGHT CAME ON. I'M 7 MONTHS PREGNANT AND THIS IS MY ONLY TRANSPORTATION. I'M NOT LOOKING TO GET INTO AN ACCIDENT DUE TO MY BRAKES FAILING. MY SERVICE AIR BAGS MESSAGE ALSO COMES UP AND EVEN WITH A PASSENGER IN THE CAR IT DOESN'T STATE THAT THE PASSENGER AIR BAG IS ON. I AM PRETTY SURE BOTH OF THESE ISSUES WERE PART OF A RECALL BUT I HADN'T OWNED THE CAR DURING THAT TIME. AS OF NOW THIS CAR IS A FATAL ACCIDENT WAITING TO HAPPEN AND I'M UNSURE AS TO WHY THERE ISN'T STILL AN OPEN RECALL TO ADDRESS THIS BRAKE FAILURE ISSUE.",
        "vin": "1G6DM57T470"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "03/18/2018",
        "dateOfIncident": "03/16/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080027,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING AND WENT TO STOP AT PARKING SPACE AND THE BRAKES FAILED AND I HIT THE WALL IN THE PARKING SPACE.",
        "vin": "1G6DM57T570"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/17/2017",
        "dateOfIncident": "02/17/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10995710,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLES TIMING CHAIN IS STARTING TO GO I WAS INFORMED THAT THERE WAS A BULLETIN PUT OUT BASICALLY A EXTENDED WARRANTY FOR 10 YEARS I WAS STATIONED IN GERMANY FOR 2 YEARS AND THE PROBLEM STARTED THREE MONTHS BEFORE I WAS SUPPOSED TO LEAVE I CALLED GM IN THEY TELL ME THE WARRANTY HAS ENDED IM WITHIN THE TIME PERIOD UNDER TEN YEARS AND WELL UNDER THE MILEAGE BUT THEY SAY IT ENDED APRIL OF 2017 AND IT IS NOW JUNE OF 2017 WHY HASN'T THIS BEEN MADE A RECALL INSTEAD OF A EXTENDED WARRANTY I WAS PROUD TO OWN IN HAVE A CADILLAC THE GERMAN PEOPLE LOVED IT BUT IM GOING TO SWITCH OUT OF THIS TO A GERMAN BRAND ITS SAD THAT GM IS NOT EVEN STANDING BEHIND THERE PRODUCT WITH ALL OF THESE PROBLEMS I GOGGLED CADILLAC AND ALL I SEE IS THIS TIMING CHAIN PROBLEM",
        "vin": "1G6DP577870"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/15/2017",
        "dateOfIncident": "06/04/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10995342,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. THE CONTACT STATED THAT THE VEHICLE WAS NOT INCLUDED IN A RECALL FOR THE BRAKES, WHICH SOLELY ADDRESSED THE CADILLAC CTS-V MODELS. THE CONTACT WAS UNCERTAIN IF THE FAILURE WAS RELATED TO THE RECALL. THE CONTACT STATED THAT THERE WAS THE PRESENCE OF A LEAK IN THE REAR OF THE VEHICLE. WITHOUT WARNING, THE BRAKE LINES FRACTURED. THE VEHICLE WAS INSPECTED AND THE INDEPENDENT MECHANIC FOUND PREMATURE RUST, CORROSION, AND A FRACTURE. THE MANUFACTURER WAS NOTIFIED. THE VEHICLE WAS CURRENTLY UNABLE TO BE DRIVEN DUE TO THE FAILURE. THE NHTSA CAMPAIGN NUMBER WAS UNKNOWN. THE APPROXIMATE FAILURE MILEAGE WAS 95,000.",
        "vin": "1G6DM57T470"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/15/2017",
        "dateOfIncident": "06/14/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10995361,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "DISPLAY \"SERVICE BRAKE ASSIST\" TRACTION CONTROL & BRAKE LIGHT WARNING ON DASH....LOW SPEED BRAKE PEDAL VIBRATES AND LESSENS STOPPING ABILITY (ANTI LOCK ACTIVATES) CAUSES VEHICLE INABILITY TO STOP AT LOW SPEEDS......MANY BLOGS STATING SAME CONDITION WITH REPLACEMENT OF ALL BRAKE FUNCTION PARTS WITH NO CURE....HAS OCCURED ON AND OFF FOR LAST YEAR",
        "vin": "1G6DP577270"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/05/2017",
        "dateOfIncident": "04/19/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10983630,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. THE CONTACT HEARD A TICKING NOISE COMING FROM THE ENGINE. UPON INSPECTION, THE CONTACT NOTICED FUEL LEAKING FROM THE OIL PAN GASKET. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THAT THE OIL PAN GASKET NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 140,000.",
        "vin": "1G6KD57Y07U"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/24/2017",
        "dateOfIncident": "03/12/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10980091,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TIMING CHAIN STRETCHED OR PREMATURE WEAR.",
        "vin": "1G6DP577470"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/17/2017",
        "dateOfIncident": "02/17/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10955364,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. WHILE THE VEHICLE WAS PARKED AND THE KEY WAS INSERTED IN THE IGNITION, THE VEHICLE FAILED TO START. AS A RESULT, THE KEY WAS UNABLE TO BE REMOVED FROM THE IGNITION AND THE ANTI-THEFT WARNING INDICATOR ILLUMINATED. THE VEHICLE  WAS NOT DIAGNOSED OR REPAIRED. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 14V394000 (ELECTRICAL SYSTEM); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "1G6DP577170"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/05/2017",
        "dateOfIncident": "02/06/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10949661,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA INFLATORS.  I HAVE A LOUD CRACKING NOISE IN SEVERAL PLACES BEHIND THE DASH.  SOMETIMES IT HAPPENS WHEN THE CAR IS STILL BUT MOSTLY WHILE DRIVING ON INTERSTATES. THE LOUDEST CRACKING NOISE IS IN THE CENTER OF THE DASH.  WITH THE TAKATA AIRBAG RECALL I AM AFRAID THAT THIS COULD BE PART OF THAT.  THE CAR ONLY HAS 11,000MILES ON IT BUT THE CRACKING HAS OCCURRED SINCE THE CAR WAS NEW.",
        "vin": "1G6DM57T370"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/02/2017",
        "dateOfIncident": "02/01/2017",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10949014,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING CAR ON CITY STREET ABOUT 2 MILES FROM HOME, NOTICED SMELL COMING OUT OF VENTS. PULLED OVER TO CHECK FOR PROBLEM AND FOUND THAT THE ENGINE COMPARTMENT WAS ON FIRE. CALLED FIRE DEPT WHO CAME AND PUT OUT THE FIRE BUT THE FRONT OF CAR WAS COMPLETELY DESTROYED. CALLED GM CUSTOMER SERVICE TO REPORT AND THEY BASICALLY TOLD ME THEY WERE NOT GOING TO GET INVOLVED. NO INVESTIGATION OR HELP WHAT SO EVER. IT APPEARS TO HAVE BEEN CAUSED BY SOME KIND OF ELECTRICAL SHORT, NOT FUEL RELATED. FIRE APPEARED TO HAVE STARTED ON PASSENGER SIDE OF ENGINE NEAR THE BATTERY.THE CAR CONTINUED TO RUN NORMALLY WHILE ON FIRE.  *TR",
        "vin": "1G6DP577870"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/13/2017",
        "dateOfIncident": "01/05/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10945028,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. WHILE DRIVING AT ANY SPEED, THE AIR BAG INDICATOR REMAINED ILLUMINATED. THE FAILURE WAS NOT DIAGNOSED. THE VEHICLE WAS NOT REPAIRED. THE CONTACT STATED THAT THE AIR BAGS WERE RECALLED AND REPAIRED IN 2011. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 77,000.",
        "vin": "1G6DP577370"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/10/2017",
        "dateOfIncident": "12/22/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10944127,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. WHILE DRIVING VARIOUS SPEEDS, THE SERVICE ENGINE WARNING INDICATOR REMAINED ILLUMINATED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT CYLINDER TWO MISFIRED. THE TECHNICIAN CLEARED THE CODE, BUT THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 77,000.",
        "vin": "1G6DP577570"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/24/2016",
        "dateOfIncident": "10/03/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10918500,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. THE CONTACT NOTICED THAT THE PASSENGER SIDE FLOOR MAT WAS WET.  WHENEVER IT RAINED, WATER ENTERED THE VEHICLE FROM THE SUN ROOF. THE DEALER DIAGNOSED THAT THE GENERAL TRIM AND INTERIOR OF THE SUN ROOF NEEDED TO BE REPAIRED. THE VEHICLE WAS REPAIRED; HOWEVER, THE FAILURE RECURRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 53,621.",
        "vin": "1G6DP577670"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/13/2016",
        "dateOfIncident": "10/12/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10915998,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE JERKS WHEN PUTTING IN GEAR.",
        "vin": "1G6DM57T270"
    },
    {
        "components": "POWER TRAIN,EXTERIOR LIGHTING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/19/2016",
        "dateOfIncident": "01/09/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10908037,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM THE OWNER OF THIS 2007 GM PRODUCT. I  TOOK MY CAR TO FRANKEL CADILLAC 1/09/15 , INVOICE NUMBER 60596 AND I WAS NEVER NOTIFIED THAT THERE WERE RECOMMENDED RECALLS ON MY VEHICLE. ON THAT DATE THERE WERE SOME PROBLEMS RELATED TO THE WIRING ON THE ABS  AND EBTM AND I DENIED THE SERVICE TO BE DONE THERE BECAUSE I WAS QUOTED A COST OF OVER 2,500 DOLLARS AND I WAS INFORMED THAT IT MIGHT ESCALATE TO 3500 IF AN ABS PUMP NEEDED TO BE REPLACED ALSO. I LATER HAD THE WORK DONE AT YOUNG'S LOCATED IN WOODLAWN FOR A LOT LESS. I  NOW PROBLEMS WITH THE POWER TRAIN AND THE ANTI THEFT SYSTEM AND HAVE THE AUTO IN GREGG'S REPAIR , 5050 WABASH AVE. I ALSO SAW ON LINE THAT THE ON STAR OPERATION IS ABLE TO RELEASE THE ANTI THEFT MODE. I HAVE BEEN QUOTED A PRICE OF 886 DOLLARS PLUS CHANGE BY GREGG'S CADILLAC . I AM ABLE TO DRIVE THE VEHICLE, BUT IN ORDER TO GET THE KEY OUT, THE BATTERY HAS TO BE DISCONNECTED. I AM PERPLEXED THAT I WAS NEVER NOTIFIED ABOUT THE RECALLS ON THIS VEHICLE. WITH ALL OF THE NOTED PROBLEMS I WAS IN MOTION. I WAS STOPPED BY THE POLICE FOR THE BRAKE LIGHT IN THE CITY AND I WAS DRIVING ON THE HIGHWAY WHEN THE ANTI THEFT MODE WENT INTO OPERATION.",
        "vin": "1G6DM57T670"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/26/2016",
        "dateOfIncident": "07/25/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10898720,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE VEHICLE IS RUNNING THE RADIO TURNS OFF AND ON INTERMITTENTLY STATIONARY OR MOVING. THE VEHICLES WHILE DRIVING SHUT DOWN WHILE DRIVING. THE CAR SOMETIMES WON'T START WHEN TURNING ON THE IGNITION SWITCH.  AIRBAG LIGHTS IS ON AND CHECK VOLTAGE LIGHT ARE REGISTERING WHILE STATIONARY OR DRIVING. THE PLUGS, ALTERNATOR AND CORE PACK WAS REPLACED HOPING TO RESOLVE THE ISSUE. TOOK VEHICLE TO THE CADILLAC DEALERSHIP BUT THEY DENIED ME ANY SERVICE UNDER THE RECALL PROBLEMS I WAS EXPERIENCING. THERE POSITION IS THE RECALL IS VIN. SPECIFIC.",
        "vin": "1G6DM57T570"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/22/2016",
        "dateOfIncident": "08/15/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10897582,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. AFTER THE VEHICLE WAS STARTED, THE AIR BAG WARNING LIGHT REMAINED ILLUMINATED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE THE CONTACT WAS INFORMED THAT THE FRONTAL PASSENGER SIDE AIR BAG SENSOR CONTROL MODULE NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 10V644000 (AIR BAGS). THE FAILURE MILEAGE WAS 200,000.",
        "vin": "1G6DP577970"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/04/2016",
        "dateOfIncident": "02/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10893115,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. THE BRAKE PEDAL TRAVELED TO THE FLOORBOARD WHEN IT WAS DEPRESSED. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 159,000.",
        "vin": "1G6DP577370"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "08/01/2016",
        "dateOfIncident": "07/27/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10892013,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER SEAT NO LONGER RECOGNIZES A PERSON IS SITTING IN THE SEAT.  THEREFORE, THE SEAT BELT \"ALARM\" DOES NOT ACTIVATE WHEN THE SEAT BELT IS UNFASTENED.  I DO NOT KNOW IF THE AIR BAG WOULD ACTIVATE IF NEEDED IN A CRASH.  FIRST NOTICED 7/27/2016.",
        "vin": "1GDP5776701"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "07/18/2016",
        "dateOfIncident": "01/22/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10885484,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2007 CADILLAC CTS. WHILE DRIVING APPROXIMATELY 15 MPH, THE VEHICLE INDEPENDENTLY SURGED AT A HIGH RATE OF SPEED WHILE MAKING A LEFT TURN TO GO INTO THE OPPPOSITE DIRECTION. THE CONTACT APPLIED EXTREME FORCE TO THE BRAKE PEDAL, BUT THE VEHICLE CONTINUED AT A HIGH RATE OF SPEED AND CRASHED INTO A TREE. THE FRONT DRIVER AND PASSENGER SIDE AIR BAGS DEPLOYED. THE DRIVER SUSTAINED HEAD AND NECK INJURIES AS WELL AS PAINS TO THE RIGHT HAND AND ARM. THE CRASH CAUSED AN ELEVATION IN BLOOD PRESSURE THAT REQUIRED MEDICAL TREATMENT. A POLICE REPORT WAS FILED. THE VEHICLE WAS DESTROYED, TOWED, AND INSPECTED BY THE INSURANCE COMPANY'S REPAIR SHOP AND THE MANUFACTURER WHO STATED THAT THERE WAS NO FAILURE. THE CONTACT WAS UNABLE TO DETERMINE WHAT CAUSED THE VEHICLE TO SURGE AT A HIGH RATE OF SPEED. THE BRAKES DID NOT PREVENT THE CRASH. THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBERS: 14V394000 (ELECTRICAL SYSTEM) AND 10V105000 (SERVICE BRAKES, HYDRAULIC). THE VIN WAS NOT AVAILABLE. THE APPROXIMATE FAILURE MILEAGE WAS 80,000.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/13/2016",
        "dateOfIncident": "06/11/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10873885,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  PASSENGER SERVICE AIR BAG LIGHT STAYS LIGHT UP.",
        "vin": "1G6DM57T870"
    },
    {
        "components": "STEERING,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "06/13/2016",
        "dateOfIncident": "01/22/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10873961,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2007 CADILLAC CTS. WHILE ATTEMPTING TO MAKE A TURN AT APPROXIMATELY 15 MPH, THE VEHICLE INDEPENDENTLY VEERED TO THE RIGHT AND UNINTENTIONALLY ACCELERATED WITHOUT WARNING. IN ADDITION, THE VEHICLE EXPERIENCED A LOSS OF STEERING AND THE BRAKE PEDAL WAS DEPRESSED, BUT FAILED TO RESPOND. AS A RESULT, THE CONTACT CRASHED INTO A TREE. A POLICE REPORT WAS FILED. THE CONTACT SUSTAINED A NECK INJURY AND PAIN TO THE RIGHT KNEE AND FOOT THAT REQUIRED MEDICAL ATTENTION. THE VEHICLE WAS TOWED TO A SALVAGE YARD WHERE IT WAS DEEMED DESTROYED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS NOT PROVIDED.",
        "vin": "1G6DP577370"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/30/2016",
        "dateOfIncident": "05/13/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10871456,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "SERVICE AIR BAG LIGHT COMES ON INTERMITTED  ; MOVEMENT OF PASS. SEAT AFFECTS THE LIGHT. WORRISOME CONDITION.",
        "vin": "1G6DP577870"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/12/2016",
        "dateOfIncident": "01/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10864521,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. THE CONTACT STATED THE AIR BAG WARNING LIGHT ILLUMINATED. THE CONTACT TOOK THE VEHICLE TO A CERTIFIED MECHANIC WHO DIAGNOSED THE AIR BAG NEEDED TO BE REPLACED HOWEVER, THE CONTACT STATED THE VIN WAS NOT INCLUDED IN THE RECALL. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 73,837.",
        "vin": "1G6DP577470"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/25/2016",
        "dateOfIncident": "09/15/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10861239,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. THE CONTACT STATED THAT THE AIR BAG WARNING LIGHT ILLUMINATED AND AN ERROR MESSAGE TO SERVICE THE AIR BAG SYSTEM APPEARED. THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 10V644000 (AIR BAGS). THE VEHICLE WAS NOT ABLE TO PASS AN INSPECTION DUE TO THE AIR BAG MALFUNCTION. THE CONTACT WAS UNCERTAIN OF THE REPAIR REQUIRED TO PREVENT THE LIGHT FROM ILLUMINATING. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS LATER NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": "1G6DM57T970"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/12/2016",
        "dateOfIncident": "04/10/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10855114,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "2007 CADILLAC CTS BEGAN MAKING A LOUD HUMMING NOISE. HAD THE REAR DRIVER SIDE WHEEL BEARING CHANGED BUT THE NOISE CONTINUED. ON WAY HOME FROM WORK THE FOLLOWING DAY ON I75 DRIVING 70MPH WHICH IS THE SPEED LIMIT, THE CAR STARTED MAKING A LOUD CLUNKING SOUND AND WAS NEARLY IMPOSSIBLE TO STEER.  NEARLY HAD ACCIDENT WHILE TRYING TO GET TO SHOULDER OF ROAD.  WAS INFORMED BY MECHANIC THAT \"THE REAR END WENT OUT OF YOUR CAR BECAUSE YOU DIDN'T HAVE ANY DIFFERENTIAL FLUID LEFT IN IT\" WHEN I ASKED HOW THAT COULD HAPPEN THE MECHANIC SAID THERE MUST HAVE BEEN A LEAK OF SOME KIND. STARTED RESEARCHING AND FOUND THERE WAS A RECALL ON THE CAR 4 YEARS BEFORE I PURCHASED IT.  WHEN I CALLED GM AT 800-458-8006 I WAS TOLD BY AUTOMATED PHONE SYSTEM THERE IS AN OPEN RECALL ON MY VEHICLE #07204E AND 10355C SO ASKED TO SPEAK WITH A REPRESENTATIVE AND THE LADY FROM MANILLA IN THE PHILIPPINES (BECAUSE THAT'S WHERE THEIR CUSTOMER CARE CENTER IS???) INFORMED ME THAT THERE IS \"NO OPEN RECALL ON YOUR CAR\" EVEN AFTER I TRIED TO EXPLAIN THE AUTOMATED SERVICE HAD JUST GIVEN ME 2 OPEN RECALL NUMBERS FOR MY VIN # ...SHE SAID SHE COULDN'T HELP ME FIND SERVICE FOR MY CAR.",
        "vin": "1G6DP577670"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/01/2016",
        "dateOfIncident": "08/13/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10823629,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "PURRCHASED CAR USED IN 2010. WHILE ON A TRIP EAST THE ENINE WOULD STAR REVVING UP DURING ANY TYYPE OF ACCELARATION.I CALLED ON-STAR FOR AN ANALISIS OF WHAT MIGHT BE THE PROBLEM.THEY RAN A REPORT WHILE I WAS STILL DRIVING AND CAME BACK WITA DIAGNOSIS OF LOW LVEL OF MOTOR OIL.I TOLD THEM I SHHOWED A LEVEL OF OVER 20% .THEY SAID IT WAS OK TO DRIVE HOME BUT TO GET AN OIL CHANGE AS SOON AS I GOT HOME. THIS PRROBLEM HAS PERSISTED EVER SINCE,REGSRDLESS OF THE OIL LEVEL. I INQUIED ABOUT THIS PROBLEM ON THE INTERNET AND SEVERAL CAME BACK WITH \"THIS IS COMMON FOR CADILLACS AND FOR ME TOSTART CARRYING SOME OIL IN THE TRUNK BBECAUSE  THESE CARS OF THIS DATE HAD NO OIL GAUGE AND THEREFORE THE REVVING NOISE WAS THE ONLY CLUE ITHIS CAR WOULD GIVE ME THAR IT NEEDS OIL.. SO I AM CONFUSED! WHY IS THERE NO OIL GAUGE IN THIS CAR? EXPECIALLY WHEN IT IS EQUIPPED WITH A 3.6 HIGH PERFORMANCE ENGINE? .I DON'T KNOW IF THIS IS TRUE OR NOT BUT I HAVE BEEN TOLD THAT THERE WAS A LAWSUIT FILED AND RIGHT AFTER THE COMPANY STARTED TO INSTALL OIL GAUGES IN THE NEWER MODELS AGAIN. I CANNOT GET ANY ANSWERS FROM DEALERS AND I WOULD LIKE TO KNOW IF THERE HAS BEEN MORE OF THESE CONCERNS BESIDES MINE AND WHAT WAS THE END RESULTS IF ANY.",
        "vin": "1G6DP577070"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/28/2016",
        "dateOfIncident": "12/01/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10822923,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. THE CONTACT STATED THAT THE TIMING CHAIN WARNING MESSAGE ILLUMINATED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE TIMING CHAIN FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 111,000.",
        "vin": "1G6DP577870"
    },
    {
        "components": "UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/27/2016",
        "dateOfIncident": "01/25/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10822604,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "ECM UNIT FAILED TO FUNCTION LEAVING THE CAR IN A ENGINE POWER REDUCED MODE. CAR WILL NOT RESPOND TO ACELLERATION AND WILL NOT GO MORE THAN 40 MPH",
        "vin": "1G6DM57T070"
    },
    {
        "components": "AIR BAGS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/05/2015",
        "dateOfIncident": "06/07/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10808592,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2007 CADILLAC CTS HAS HAD PROBLEM AFTER PROBLEM SINCE I PURCHASED IT USED AT 60,000 MILES!! I AM NOW EXPERIENCING SERIOUSLY DANGEROUS & HAZARDOUS BRAKE ISSUES WHEN PARKING &/OR TURNING THE WHEEL ALL THE WAY!! THE BRAKES PULSATE & GO TO THE FLOOR BUT FAIL TO STOP!! THE SERVICE BRAKE LIGHT COMES ON & THE ABS/TC LIGHT AS WELL, BUT THEN WILL GO OFF BEFORE I CAN MAKE IT TO THE DEALER!! WHEN I PARKED ON A HILL MY CAR FAILED TO STAY PARKED & STARTED TO DRIFT BACKWARDS DOWN THE HILL SO I HAD TO JUMP IN & HIT THE BRAKES MANUALLY!! ALSO THE PASSENGER AIRBAG LIGHT DOESN'T RECOGNIZE WHEN SOMEONE IS IN THE PASSENGER SEAT. THE SERVICE AIRBAG LIGHT WOULD COME ON THE DASH & INFORMATION CENTER THEN NOW IT IS STAYING ON AT 90,000 MILES. I CONTACTED GMC ABOUT THE BRAKE ISSUES & THEY TOLD ME THERE WAS NO RECALLS FOR ANY BRAKE ISSUES!! I ALSO ASKED ABOUT THE RECALL FOR THE AIRBAG FOR MY 2007 VEHICLE BUT THEY INFORMED ME IT WASN'T FOR MY VIN # BUT IT IS HAVING THE SAME EXACT ISSUES AS THE RECALL!! SOMEONE IS GOING TO GET SERIOUSLY INJURED DUE TO THESE HAZARDS!! GMC/CADILLAC NEEDS TO STEP UP & CORRECT THESE ISSUES BEFORE IT IS TO LATE!! HOW MANY MORE PEOPLE HAVE TO GET INJURED, DIE, OR COMPLAIN BEFORE THESE ISSUES ARE ADDRESSED!!! THIS IS SUPPOSED TO BE A LUXURY CAR BUT IT IS MORE LIKE A JUNK CAR DEATH TRAP!!!!",
        "vin": "1G6DM57T870"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/04/2015",
        "dateOfIncident": "04/05/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10808501,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. THE CONTACT STATED THAT THE PASSENGER SIDE SEAT FAILED TO DETECT WHEN THE SEAT WAS OCCUPIED. THE AIR BAG WARNING LIGHT CONSTANTLY ILLUMINATED. THE FAILURE WAS RECURRING. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE CONTACT STATED THAT THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 10V644000 (AIR BAGS). THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 90,000.",
        "vin": "1G6DM57T870"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/04/2015",
        "dateOfIncident": "11/18/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10808510,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. THE CONTACT STATED THAT THE WHILE DRIVING AT VARIOUS SPEEDS AND ATTEMPTING TO MAKE A RIGHT TURN, THE CONTACT REAR ENDED ANOTHER VEHICLE. THE CONTACT STATED THAT THE AIR BAGS FAILED TO DEPLOY. A POLICE REPORT WAS FILED AND NO INJURIES WERE REPORTED. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC AND THE VEHICLE WAS SERVICED UNDER NHTSA CAMPAIGN NUMBER: 10V644000 (AIR BAGS) BUT THE REMEDY FAILED TO REPAIR THE VEHICLE. THE CONTACT STATED THAT THE FRONT PASSENGER SEAT WOULD NOT DETECT AN OCCUPANT ON THE SEAT IN ORDER TO ACTIVATE THE AIR BAGS. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 89,513.",
        "vin": "1G6DM57T170"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/03/2015",
        "dateOfIncident": "06/17/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10808284,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "GOOD EVENING,                I AM A OWNER OF CTS 2008 ,  REGISTRATED IN ITALY . IN THIS MOMENT I AM IN ROMANIA. THE CAR HAVE 65.000 MILES, AND IN CADILLAC SERVICE HERE ( ROMANIA ), I HAVE AN ERROR WICH IS P0008 ( CHAIN CHAMBER ). THE SERVICE TOLD ME IS NOT POSSIBLE FOR THEM TO COVER WITH THE GUARANTEE THIS CHANGE OF CHAIN CHAMBER .  EVERYBODY , ON CADILLAC FORUM , HAVE TOLD ME THE MUST CHANGE FREE OF CHARGE , BECAUSE THIS PROBLEM COVER 10 YEARS OF WARRANTY FOR NEXT : SPECIAL COVERAGE 11340 AND SPECIAL COVERAGE 14582 , I DON T KNOW EXACTLY WICH IS !    I ATTACH YOU WHAT THE FORUM FRIENDS, HAVE TOLD ME : IS A RECALL SERVICE, AND YOUR SERVICE FROM ROMANIA HAVE TOLD ME, I MUST PAY FOR THIS . WHAT I DOING PLEASE.?     MARIUS,    HERE IS THE RECALL LETTER FROM GM, IT STATES GLOBAL WARRANTY MANAGEMENT SYSTEM    11340C: SPECIAL COVERAGE ADJUSTMENT - TIMING CHAIN WEAR - (NOV 5, 2012)   SUBJECT: 11340C ' SPECIAL COVERAGE ADJUSTMENT ' TIMING CHAIN WEAR   ALSO IF YOU OWN A CADILLAC HERE ALL THE CADILLAC DELALERS, THEY TELL YOU ARE NOT INFORMED WITH THIS BULETIN 11340. IT S NOT NORMAL TO NOT COVER ALL THE CAR ALL OVER THE WORLD. WHY THEY SELL ABROAD USA, IS ARE NOT ISSUE GUARANTEE FOR WHAT THEY SAYING ? WHERE I NEED TO REPORT THAT PROBLEM ?. ALL THE TIME THE CADILLAC SERVICE FROM ROMANIA, TELL ME GM , NOT PAY FOR THAT. IS AVAILABLE ONLY FOR USA CITTIZEN?  WAITING FOR YOUR KINDLY REPLY   PS  I HAVE WRIGHT A CADILLAC NUMBER AND HAWAI STATE. BUT IS IMPORTANT TO KNOW WHAT S   HAPPEND IN EUROPE WITH THE GM DEALEARS . THEY SELL AND TAKE MONEY FOR TEHNICAL REWIEV. THAT S ALL . IN REST NOT COVER THE GUARANTE FOR THEM PROBLEMS . IS NOT NORMAL. I WILL WRITTE EMAILS ALSO FOR NEWSPAPERS IN USA.",
        "vin": "1G6DS57V780"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/17/2015",
        "dateOfIncident": "10/27/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10794356,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. THE CONTACT STATED THAT THE VEHICLE WOULD START, BUT FAILED TO SHIFT INTO THE ACCURATE GEAR AND THE BRAKE WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE RADIATOR AND HOSES NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED, BUT THE FAILURE RECURRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 65,000.",
        "vin": "1G6DP577770"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/30/2015",
        "dateOfIncident": "09/26/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10778723,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS.  THE CONTACT STATED THAT THE FRONT PASSENGER SIDE AIR BAG LIGHT ILLUMINATED WHEN THE SEAT WAS OCCUPIED.  THE MESSAGE BOARD DISPLAYED \"PASSENGER AIR BAG OFF'.  THE FAILURE OCCURRED CONTINUOUSLY.  THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE BLADDER AND/OR SENSOR NEEDED TO BE REPLACED.  THE CONTACT STATED THAT VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 14V394000 (ELECTRICAL SYSTEM). THE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": "1G6DM57T670"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/30/2015",
        "dateOfIncident": "09/29/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10778904,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR THE LAST YEAR MY CAR HAS RAN BADLY. VERY ROUGH IDLE, ENGINE LIGHT THROWING MULTIPLE CODES, BAD GAS MILEAGE, HEAVY OIL CONSUMPTION, AND PULSATING THROTTLE WHILE PARKED AND DRIVING. I'VE TAKEN IT TO THE DEALERSHIP  AND FOR AN ENTIRE YEAR THEY'VE GIVEN ME THE RUNAROUND. ON MONDAY I TOOK IT BACK IN TO RANCHO MOTOR COMPANY IN VICTORVILLE, CALIFORNIA AND THEY FINALLY SAY IT'S THE TIMING CHAIN. THE RECALL WARRANTY VOIDED AT 120000 MILES. NOW THEY REFUSE TO HONOR THE RECALL. MY CAR IS DANGEROUS TO DRIVE.",
        "vin": "1G6DP577270"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/16/2015",
        "dateOfIncident": "07/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10764047,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG DEFECT LIGHT REMAINS ON FOR THE PASSENGER SEAT DETECTOR.",
        "vin": "1G6DP577770"
    },
    {
        "components": "STEERING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/10/2015",
        "dateOfIncident": "07/21/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10762827,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. WHILE DRIVING APPROXIMATELY 5 MPH, THE BRAKE PEDAL WAS DEPRESSED AND PULSATED WHILE TRAVELING TO THE FLOORBOARD. THE STEERING SENSOR ILLUMINATED UPON REVERSING. IN ADDITION, THE STABILITRAK SENSOR ILLUMINATED WHEN MAKING A LEFT TURN. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE BRAKES NEEDED TO BE REPLACED ALONG WITH ABS SENSORS AND THE STABILITRAK. IN ADDITION, THE CONTACT MENTIONED THAT THE TIRES WOULD WEAR OUT PREMATURELY. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 50,000.",
        "vin": "1G6DP577970"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/24/2015",
        "dateOfIncident": "02/08/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10758793,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. THE CONTACT STATED THAT UPON STARTING THE VEHICLE, THE AIR BAG WARNING INDICATOR ILLUMINATED ON THE INSTRUMENT PANEL. THE CONTACT STATED THAT THE LIGHT REMAINED ILLUMINATED. THE VEHICLE WAS TAKEN TO THE DEALER, WHERE IT WAS DIAGNOSED THAT THE PASSENGER SIDE MODULE AND CUSHION NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "1G6DP577870"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/10/2015",
        "dateOfIncident": "08/07/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10747538,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "IN DECEMBER OF 2010 THERE WAS A RECALL FOR THE PASSENGER SIDE AIR BAG SENSOR.  THAT RECALL WAS COMPLETED ON JULY 7, 2011.  I BOUGHT THIS USED CAR WITH VERY LOW MILEAGE ON JUNE 15, 2013.  ON AUGUST 7, 2015 THE AIR BAG SENSOR WENT OUT.  THE DEALERSHIP SAID THAT SINCE THE RECALL HAD ALREADY BEEN DONE THEY WOULD NOT DO IT FOR FREE A SECOND TIME.  IT SOUNDS TO ME LIKE THE RECALL WAS REPLACED WITH A FAULTY PART AS WELL.  I AM VERY DISAPPOINTED WITH THIS CADILLAC AND WILL NEVER BUY ANOTHER ONE.  I HAVE HAD NOTHING BUT PROBLEMS SINCE I DROVE IT OFF THE LOT.",
        "vin": "1G6DM57T970"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/07/2015",
        "dateOfIncident": "07/29/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10746907,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. THE CONTACT STATED THAT WHEN THE IGNITION WAS TURNED TO THE ON POSITION, THE SERVICE AIR BAG WARNING INDICATOR ILLUMINATED CONTINUOUSLY. THE FAILURE RECURRED SEVERAL TIMES. THE VEHICLE WAS TAKEN TO A DEALER, WHERE IT WAS DIAGNOSED THAT THE FRONT PASSENGER SIDE AIR BAG SENSOR FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STATED THAT THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 10V644000 (AIR BAGS). THE FAILURE MILEAGE WAS APPROXIMATELY 82,300.  MA 10/19/15      THE CONSUMER STATED THE VEHICLE WAS REPAIRED AT THE NEAREST CADILLAC DEALER. THE REPAIR WAS PAID FOR IN FULL BY THE OWNER. THE MANUFACTURER DID NOT OFFER ANY ASSISTANCE. THE CONSUMER WAS ADVISED THAT IT WAS A POSSIBILITY FOR THE PROBLEM TO RECUR. THE CONSUMER STATED THE MANUFACTURER SHOULD BE RESPONSIBLE FOR THE REPAIR COST.   UPDATED 3/21/16*JS    *CN",
        "vin": "1G6DM57T870"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/27/2015",
        "dateOfIncident": "07/21/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10743870,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS-V",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TO ALL MY FACEBOOK FRIENDS I AM GOING TO ASK YOU TO PLEASE READ THIS AND MAKE IT GO VIRAL. I OWN A 2007 CADILLAC CTS-V WHICH I PAID $41,000.00 WHEN IT WAS NEW, WITH LOANS THE CAR ENDED UP COSTING ME $55,000.00 WHICH I WAS WILLING TO PAY. IT IS A BEAUTIFUL CAR. NOW HERE IS WHAT HAS HAPPENED. I NOW HAVE ABOUT 19,190 MILES ON IT AND AT 15,000 MILES I REPLACED THE TIRES. BEING A V THEY PUT ON BRIDGESTONE POTENZA'S. THAT COST ME ABOUT $1000.00. AT 17,000 MILES I HAD A SENSOR GO OUT ON MY RIGHT FRONT TIRE, THAT CONTROLS MY BRAKES. THAT COST ME $600.00. AT THE SAME TIME THE DEALER TOLD ME THAT I NEEDED FRONT BRAKES. THAT ONLY COST ME $300.00 BECAUSE I HAD A COUPON AND TOLD THEM TO JUST REPLACE THE PADS AND DO NOT TURN THE ROTOR. AT 19,160 MILES THE LEFT WHEEL SENSOR WENT ALONG WITH ONE IN THE STEERING WHEEL. THIS IS GOING TO COST ME ANOTHER $1200.00. THE REASON I AM WRITING THIS IS BECAUSE A FRIEND TOLD ME ABOUT A WEBSITE CALLED \"EDMUNDS CAR REVIEW\" AND I WENT ON THIS SITE TO FIND OUT THAT CADILLAC HAS HAD THIS ISSUE SINCE 2004, 2005, 2006, 2007, 2008 ETC. MOST OF THESE PEOPLE HAVE GOTTEN SOME SATISFACTION FROM CADILLAC AND SOLD THEIR CAR BEFORE THE NEXT REPAIRS. SO I BEG OF YOU, IF YOU OR SOMEONE YOU KNOW IS CONSIDERING BUYING A CADILLAC CTS, CTS-V THAT THEY READ THE EDMUND REPORT FIRST. I AM NOW CONTACTING THE NATIONAL HIGHWAY SAFETY ADMINISTRATION BECAUSE APPARENTLY THE BBB HAS GUIDE LINES THAT RESTRICT THEM FROM DOING ANYTHING ABOUT ISSUES 6 MONTHS OUT OF WARRANTY. SO PLEASE TELL ALL YOUR FRIENDS TO DO THE RESEARCH AND LOOK INTO OTHER LUXURY CARS BEFORE BUYING A CADILLAC. ONE MORE THING, I WENT TO DINNER AND WENT TO PULL INTO A PARKING SPOT AND THE BRAKE PEDAL WENT TO THE FLOOR AND STARTED CHATTERING AND THE CAR ROLLED INTO THE SPOT.",
        "vin": "1G6DP577970"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/24/2015",
        "dateOfIncident": "01/12/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10743400,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. WHILE DRIVING AT 60 MPH, THE KEY CAME OUT THE IGNITION. THE DEALER PERFORMED A REPAIR, BUT IT DID NOT RESOLVE THE ISSUE WITH THE IGNITION AND THE AIR BAG WARNING LIGHT BEGAN ILLUMINATING SINCE THE REPAIR. THE ENGINE WARNING LIGHT ILLUMINATED. THE VEHICLE WAS DIAGNOSED BY AN INDEPENDENT MECHANIC WHO STATED THAT THE TIMING CHAIN NEEDED TO BE REPLACED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 99,000.",
        "vin": "1G6DP577170"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/14/2015",
        "dateOfIncident": "07/10/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10733994,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 14V394000 (ELECTRICAL SYSTEM); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "1G6DM57T270"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/09/2015",
        "dateOfIncident": "07/08/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10732853,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. WHILE STARTING THE VEHICLE, THE FRONT PASSENGER SIDE AIR BAG OFF INDICATOR ILLUMINATED CONTINUOUSLY. THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 10V644000 (AIR BAGS). THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 38,000.",
        "vin": "1G6DP577X70"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/08/2015",
        "dateOfIncident": "05/23/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10724055,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MOST OFTEN WHEN DRIVING AT SPEEDS 15 MPH OR LESS AND DOING A TURN (SUCH AS PARKING OR GOING THROUGH A DRIVE THROUGH), YOU CANNOT PUSH IN THE BRAKE PEDAL AND STOP THE VEHICLE.  YOU HAVE TO TO RAPIDLY PRESS AND DEPRESS THE BRAKE PAD UNTIL THE BRAKES ENGAGE AND STOPS THE VEHICLE BEFORE HITTING THE VEHICLE IN FRONT OF YOU OR SOME OTHER OBJECT.  I HAVE ALSO EXPERIENCED THIS DURING AN EMERGENCY STOP AT HIGHWAY SPEEDS. THE VEHICLE HAS BEEN TO THE DEALER FOR REPAIR.  THEY WERE SUPPOSED TO HAVE FIXED THE PROBLEM.  $1000 LATER THE SAME PROBLEM IS PRESENT.  SECOND ISSUE WITH THIS VEHICLE, THE ANTI-THEFT SYSTEM PERIODICALLY TRIPS ITSELF AND THE CAR CANNOT START FOR APPROXIMATELY 10 MINUTES.",
        "vin": "1G6DP577370"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/25/2015",
        "dateOfIncident": "05/24/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10721304,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE CAR WITH TWO CHILDREN INSIDE IT WE APPROACHED A BUSY INTERSECTION AND THE BRAKE PEDAL WENT ALL THE WAY TO THE FLOOR AND THE CAR DID NOT EVEN SLOW DOWN. PUMPING THE BRAKES DID NOT WORK EITHER. WE WENT RIGHT THROUGH THE STOP SIGN BY SWERVING AROUND OTHER CARS. LUCKILY THERE WERE NO PEDESTRIANS CROSSING AND THANKS TO OTHER DRIVERS BEING VERY ALERT THERE WAS NO ACCIDENT, BUT IT WAS VERY CLOSE AND TERRIFYING. WE ALLOWED THE CAR TO COAST TO A STOP AND THEN HAD TO PUSH IT TO A SIDE STREET TO GET OUT OF THE MAIN ROADWAY. THE CAR STILL HAD A FULL RESERVOIR OF BRAKE FLUID (NO FLUID LEAKS) AND HAD NO BRAKE SYSTEM WARNING LIGHTS AT ALL ILLUMINATING ON THE DASH. BRAKE PAD AND ROTORS WERE ONLY A MONTH OLD. WE ARE HAVING THE CAR TOWED TO A CADILLAC DEALERSHIP TODAY.   *TR",
        "vin": "1G6DM57T770"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/01/2015",
        "dateOfIncident": "04/24/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10714137,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS BACKING OUT OF A PARKING SPACE AND PROCEEDED TO DRIVE FORWARD AND TO COME TO A STOP THE BRAKE PEDAL WENT STRAIGHT TO THE FLOOR I ALMOST REAR ENDED ANOTHER VEHICLE AS I HIT THE EMERGENCY BRAKE IN TIME TO STOP    MY QUESTION IS THERE A RECALL FOR THIS AS IT NEVER GAVE WARNING ANYTHING WAS WRONG ON THE DASH OR OTHERWISE.  *TR",
        "vin": "1G6DP577570"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/17/2015",
        "dateOfIncident": "04/01/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10706347,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. WHILE DRIVING AT 55 MPH, THE VEHICLE STALLED AND THE SERVICE THEFT SYSTEM WARNING LIGHT ILLUMINATED. THE VEHICLE RESTARTED. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE ENGINE CONTROL MODULE NEEDED TO BE REPLACED. THE MODULE WAS REPLACED BUT THE FAILURE RECURRED. THE VEHICLE WAS TAKEN BACK TO THE DEALER AND IT WAS DETERMINED THAT THE IGNITION FAILED. THE CONTACT WAS INFORMED BY THE DEALER THAT THEIR VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 14V394000 (ELECTRICAL SYSTEM). THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 90,000.",
        "vin": "1G6DN57U870"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/15/2015",
        "dateOfIncident": "04/02/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10705851,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 4/02/2015 I WAS DRIVING MY VEHICLE WHEN SUDDENLY I HEARD A EXPLOSION TYPE SOUND AND IT WOULD NOT MOVE.    I WAS DOING APPROXIMATELY 30 TO 35 MPH. I PULLED TO THE SIDE OF THE ROAD TO INSPECT THE VEHICLE WHEN I SAW OIL COMING OUT FROM THE BACK OF THE CAR I CALLED AAA AND THEY TOWED ME TO MY HOME WERE I DID RESEARCH AND FOUND THAT CADILLAC CTS FROM 2005-2007 WERE HAVING PROBLEMS WITH THE REAR DIFFERENTIAL. SO I CONTACTED CADILLAC DIV. DIRECTLY AND WAS GIVEN A CASE # 71-1463000661 THEY CONTACTED CORAL CADILLAC DEALER AND THEY CAME PICKED UP MY CAR AND HAD IT INSPECTED THEY CONFIRMED THAT THE CAR HAS POWERTRAIN PROBLEMS BUT THE MECHANIC SAYS THAT THERE IS A POSSIBILITY THEY WILL NOT COVER THE FEES TO REPAIR IT DUE TO THE VIN # OF MY VEHICLE DOES NOT HAVE A RECALL FOR THAT ISSUE> AT THIS POINT I DO NOT UNDERSTAND MY CAR HAS EXPERIENCED EVERYTHING IN THE ORIGINAL RECALL FOR THAT MAKE, MODEL AND YEAR. PLEASE HELP.....   *TR",
        "vin": "1G6DP577770"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/19/2015",
        "dateOfIncident": "02/04/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10695403,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. THE CONTACT STATED THAT THE VEHICLE WAS SERVICED UNDER NHTSA CAMPAIGN NUMBER: 14V394000 (ELECTRICAL SYSTEM); HOWEVER, ON THE WAY HOME, THE INSTRUMENT PANEL MOMENTARILY FLICKERED. THE CONTACT DROVE OVER A BUMP ON THE ROAD AND THE VEHICLE STALLED. THE KEY WOULD GET STUCK INSIDE THE IGNITION INTERMITTENTLY. THE VEHICLE WAS TAKEN BACK TO THE DEALER. THE TECHNICIAN REPLACED AN UNKNOWN COMPONENT ON THE IGNITION SWITCH AT THE OWNER'S EXPENSE. THE VEHICLE WAS REPAIRED, BUT THE FAILURE RECURRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 83,000.",
        "vin": "1G6DP577370"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/19/2015",
        "dateOfIncident": "02/02/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10684306,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. WHILE DRIVING APPROXIMATELY 40 MPH, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE RESUMED NORMAL OPERATION AFTER RESTARTING. THE FAILURE RECURRED ON A SEPARATE OCCASION AND WAS TOWED TO THE DEALER FOR DIAGNOSIS. THE CONTACT WAS UNCERTAIN OF THE REPAIR THAT WAS PERFORMED ON THE VEHICLE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 86,000.",
        "vin": "1G6DP577370"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/16/2015",
        "dateOfIncident": "04/18/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10683698,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN A MAJOR HIGHWAY WITH MY 2 SMALL CHILDREN WITH THE AC ON WHEN ALL OF A SUDDEN ALL THE GAUGES IN THE CAR DROPPED TO ZERO AND THE CAR INSIDE BECAME VERY HOT AND THE STEERING WHEEL TIGHTENED UP. I IMMEDIATELY GRIPPED THE WHEEL AS TIGHT AS I COULD AND MOVED TO THE SIDE OF THE HIGHWAY. I THOUGHT WE WERE GOING TO CRASH. I HAD NO CONTROL OVER THE VEHICLE, IT WAS SHUTTING ITSELF DOWN WHILE I WAS DRIVING. WHEN I PULLED OVER I HAD TO FORCE IT INTO PARK. THIS IS AN EXTREME SAFETY ISSUE, WE COULD HAVE BEEN HIT AND KILLED BY ANOTHER CAR. IT HAPPENED SO FAST. ANOTHER INCIDENT THAT OCCURRED TODAY WAS THAT I PARKED IN MY DRIVEWAY AND TRIED TO TURN MY CAR OFF AND THE KEY WOULD NOT MOVE OR COME OUT OF THE IGNITION SWITCH. THE CAR RAN FOR A WHILE AND THAN SHUT OFF, BUT THE HEADLIGHTS LIGHTS WERE BLINKING VERY FAST AND DID THAT UNTIL THE BATTERY DIED AND THE KEY IS STILL STUCK IN THE IGNITION AND WILL NOT COME OUT. THIS IS NOT THE FIRST TIME THIS HAS HAPPENED. USUALLY THE KEY WILL COME OUT AFTER MULTIPLE ATTEMPTS, BUT I HAVE HAD TO REPLACE 4 BATTERIES FROM THE TIME I PURCHASED THIS VEHICLE IN MARCH OF LAST YEAR UNTIL NOW. I WILL NEVER BUY A CADILLAC VEHICLE AGAIN.  *TR",
        "vin": "1G6DP577770"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/22/2015",
        "dateOfIncident": "01/01/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10661673,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "2007 CADILLAC DTS. CONSUMER WROTE IN ON BEHALF OF HER MOTHER. COMPLAINS ABOUT THE IGNITION SWITCH AND THE RECALL *CN  THE CONSUMER STATED THE IGNITION SWITCH WAS NOT REPLACED. ONLY A MODIFICATION TO THE KEY AND RING WAS DONE. *JB",
        "vin": "1G6KD57Y27U"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/15/2015",
        "dateOfIncident": "01/13/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10672719,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN THE ROAD AND HEARD A TERRIBLE CLUNK FOLLOWED BY GRINDING. I STOPPED TO LOOK UNDER THE CAR BECAUSE I THOUGHT SOMETHING FELL OUT OR OF THE CAR. I GOT IT TO A REPAIR SHOP AND THE REAR DIFFERENTIAL WENT OUT BECAUSE IT HAD BEEN LEAKING. I HAD CONTACTED CADILLAC EARLIER IN THE 2014 TO CHECK ON RECALLS AND WAS TOLD THAT MY CAR WAS NOT UNDER RECALL. I THINK IT SHOULD'VE BEEN UNDER RECALL. I READ THAT THIS IS A BIG PROBLEM WITH THE CTS, BUT CADILLAC REFUSES TO MAKE IT RIGHT ON OLDER MODELS. I AM JUST GLAD I WASN'T DRIVING AT 70 MPH OR SOMEBODY COULD'VE BEEN KILLED. I AM $2,200 IN THE HOLE NOW...   *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/06/2015",
        "dateOfIncident": "05/19/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10670372,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT BRAKE LINE BROKE AT JUNCTION BETWEEN RUBBER PORTION OF THE LINE AND THE METAL PORTION OF THE LINE, AT A FITTING THAT WAS COVERED BY A RUBBER BOOT THAT ALLOWED WATER TO REMAIN TRAPPED, CORRODING THE FITTING.  THIS OCCURRED SHORTLY AFTER STARTING UP, WHILE TRAVELLING AT 25MPH TOWARDS A RED LIGHT WITH A STOPPED CAR. THE BRAKE PEDAL FELL TO THE FLOOR RAPIDLY, AND A FURTHER PUMP OF THE BRAKE DID NOTHING TO APPRECIABLY STOP THE CAR.  THERE IS A RECALL FOR THIS VERY ISSUE THAT COVERS THIS MAKE/MODEL (2007 CTS-V), BUT GM STATES THAT MY CAR WAS NOT AFFECTED. FURTHERMORE, CAR WAS AT THE DEALERSHIP THREE MONTHS PRIOR FOR BRAKE WORK.",
        "vin": "1G6DN57U970"
    },
    {
        "components": "STEERING,AIR BAGS,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "12/19/2014",
        "dateOfIncident": "12/18/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10667223,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. THE CONTACT STATED THAT WHILE MAKING A RIGHT TURN AT APPROXIMATELY 25 MPH, THE STEERING WHEEL BECAME DIFFICULT TO MANEUVER WITHOUT WARNING. IN ADDITION, THE CONTACT STATED THAT THE BRAKE PEDAL WAS DEPRESSED AND FAILED TO RESPOND. AS A RESULT, THE CONTACT CRASHED THE VEHICLE INTO A LIGHT POLE. THE AIR BAGS FAILED TO DEPLOY. A POLICE REPORT WAS FILED. THE CONTACT SUSTAINED A SHOULDER AND NECK INJURY THAT DID NOT REQUIRE MEDICAL ATTENTION. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE CONTACT MENTIONED THAT THE FAILURE OCCURRED AFTER THE VEHICLE WAS SERVICED UNDER NHTSA CAMPAIGN NUMBER: 14V394000 (ELECTRICAL SYSTEM). THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 42,000.",
        "vin": "1G6DM57T470"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/07/2014",
        "dateOfIncident": "09/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10662620,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR CONSUMED SO MUCH OIL THAT TIMING CHAIN TENSIONERS CAUSED TIMING CHAINS ISSUES THAT CAUSED CAR TO STOP RUNNING.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/01/2014",
        "dateOfIncident": "06/26/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10654376,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "2007 CADILLAC CTS. CONSUMER HAD A REBUILT TRANSMISSION WITH REBUILT TORQUE INSTALLED AND WOULD LIKE TO BE REIMBURSED. *SS  THE CONSUMER STATED THE VEHICLE HAD BEEN JERKING AND HESITATING, WHILE DRIVING. *JB",
        "vin": "1G6DP577270"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/26/2014",
        "dateOfIncident": "11/26/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10661051,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. THE CONTACT RECEIVED A NOTIFICATION FOR NHTSA CAMPAIGN ID NUMBER: 14V355000 (ELECTRICAL SYSTEM) AND STATED THAT THE PART NEEDED WAS UNAVAILABLE TO REPAIR THE VEHICLE. THE DEALER WAS UNABLE TO INFORM WHEN THE PART WOULD BECOME AVAILABLE. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "1G6KD57Y77U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/26/2014",
        "dateOfIncident": "11/26/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10661089,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. THE CONTACT RECEIVED A NOTIFICATION FOR RECALL NHTSA CAMPAIGN ID NUMBER: 14V355000 (ELECTRICAL SYSTEM) AND STATED THAT THE PART NEEDED WAS UNAVAILABLE TO REPAIR THE VEHICLE. THE DEALER WAS UNABLE TO INFORM WHEN THE PART WOULD BECOME AVAILABLE. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE VIN WAS UNAVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/18/2014",
        "dateOfIncident": "11/18/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10658962,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "A RECALL HAS BEEN ISSUED BY GM FOR 2004-2007 CADILLAC CTS-V CARS CONCERNING THE FUEL PUMP MODULE AND THE ELECTRICAL CONNECTOR MELTING A HOLE AND ALLOWING FOR A FUEL LEAK.  SEE GM RECALL:  N140405    I HAVE VERIFIED THAT MY CAR USES THE EXACT SAME FUEL PUMP THAT IS IN ALL THE RECALLED CARS.  THE SAME PUMP WOULD THEN REQUIRE THE USE OF THE SAME STYLE CONNECTOR THAT IS PRONE TO MELTING AND SPILLING FUEL.    I WOULD LIKE MY FUEL PUMP TO BE REPAIRED JUST AS ALL THE OTHER 2004-2007 CTS-V'S.  THIS IS A SIGNIFICANT CONCERN FOR SAFETY.  *TR",
        "vin": "1G6DN57U570"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/29/2014",
        "dateOfIncident": "04/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10650961,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. THE CONTACT STATED THAT THE ABS, THE TRACTION AND THE CHECK ENGINE WARNING LIGHTS ILLUMINATED. THE VEHICLE WAS TAKEN TO A DEALER, WHO DIAGNOSED THAT THE CYLINDER MISFIRED AND THE IGNITION COIL WAS SHORTENED WHICH NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED ON NUMEROUS OCCASIONS HOWEVER, THE FAILURE PERSISTED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 92,000.",
        "vin": "1G6DP577270"
    },
    {
        "components": "STEERING,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/29/2014",
        "dateOfIncident": "10/15/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10651060,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. WHILE REVERSING, THE STEERING WHEEL SEIZED AND EXTREME FORCE WAS REQUIRED IN ORDER TO STEER THE VEHICLE. THE CONTACT ALSO MENTIONED THAT THE POWER WINDOWS FAILED TO OPERATE. THE VEHICLE WAS TOWED TO A DEALER WHO DIAGNOSED THAT THE STEERING POWER RACK AND PINION NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VIN WAS UNAVAILABLE. THE APPROXIMATE FAILURE MILEAGE WAS 29,000.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/28/2014",
        "dateOfIncident": "10/28/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10650655,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 14V394000 (ELECTRICAL SYSTEM); HOWEVER, THE PART NEEDED WAS UNAVAILABLE TO REPAIR THE VEHICLE. THE DEALER WAS UNABLE TO ADVISE WHEN THE PART WOULD BECOME AVAILABLE. THE MANUFACTURER WAS NOT NOTIFIED. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "1G6DM57T670"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/07/2014",
        "dateOfIncident": "10/03/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10641936,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2007 CADILLAC CTS. THE CONTACT STATED WHEN TURNING THE IGNITION SWITCH TO THE ON POSITION, THE AIR BAG WARNING INDICATOR ILLUMINATED. THE PROBLEM HAS OCCURRED NUMEROUS TIMES. THE VEHICLE WAS TAKEN TO DEALER. THE TECHNICIAN DIAGNOSED THAT THE SRI PPS MODULE FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE WAS 86,000.",
        "vin": "1G6DM57T070"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/06/2014",
        "dateOfIncident": "08/08/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10641845,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MAIN ELECTRICAL BOARD OR MAIN COMPUTER BOARD FOR VEHICLE WORKING IMPROPER.  *TR",
        "vin": "1G6DM57T760"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/03/2014",
        "dateOfIncident": "02/01/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10641067,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. THE CONTACT STATED THAT AFTER STARTING THE VEHICLE, IT SUDDENLY ACCELERATED WITHOUT WARNING. THE VEHICLE WAS TAKEN TO THE DEALER, BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 83,000.",
        "vin": "1G6DM57T270"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/02/2014",
        "dateOfIncident": "09/25/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10640807,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. WHILE REPLACING THE TIRES, THE PRIVATE MECHANIC STATED THAT THE STRUT TOWER ASSEMBLY WAS NOT WELDED DOWN AND CAUSED PRESSURE. THE CONTACT WAS CONCERNED THAT THE SPRING COULD DETACH, CAUSING THE TIRE SUSPENSION TO COLLAPSE. THE PRIVATE MECHANIC STATED THAT THE STRUT TOWER ASSEMBLY NEEDED TO BE REPLACED OR WELDED BACK PROPERLY. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 113,000.   UPDATED 12/11/14*CN  *JS",
        "vin": "1G6DP577070"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/01/2014",
        "dateOfIncident": "10/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10640435,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 14V394000 (ELECTRICAL SYSTEM); HOWEVER, THE PART NEEDED TO REPAIR THE VEHICLE WAS UNAVAILABLE. THE MANUFACTURER WAS NOTIFIED. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "1G6DP577970"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/01/2014",
        "dateOfIncident": "09/23/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10640480,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. THE CONTACT RECEIVED A SECOND RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 14V394000 (ELECTRICAL SYSTEM); HOWEVER, THE PARTS NEEDED TO REPAIR THE VEHICLE WERE NOT AVAILABLE. THE CONTACT CALLED THE DEALER TO SCHEDULE A REPAIR APPOINTMENT, BUT THE DEALER DID NOT KNOW WHEN THE PARTS WOULD BECOME AVAILABLE. THE MANUFACTURER WAS NOTIFIED, BUT NO SOLUTION WAS OFFERED. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "1G6DM57T670"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/01/2014",
        "dateOfIncident": "10/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10640531,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 14V394000 (ELECTRICAL SYSTEM); HOWEVER, THE PART NEEDED TO REPAIR THE VEHICLE WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "1G6DP577670"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/30/2014",
        "dateOfIncident": "09/15/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10640087,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A LETTER FROM GM C/W RECALL 14172. HAVE CALLED TO SET UP REPAIRS AND AM TOLD THERE ARE NO PARTS AVAILABLE FROM GM BY THE DEALER, THE LETTER FROM GM CLEARLY STATES \"PARTS ARE NOW AVAILABLE TO REPAIR YOUR VEHICLE\" HAD ONE APPOINTMENT CANCELED, CALLED TO RESCHEDULE AND THEY ASKED ME TO CALL IN A WEEK, NOW THEY ARE ASKING ME TO CALL AT THE END OF OCTOBER.  I HAVE A LIFE BEYOND ME SCHEDULING RECALL REPAIRS WITH GM THAT CAN POTENTIALLY AFFECT MY SAFETY AND HAS CAUSED SIGNIFICANT INJURY TO OTHERS ALREADY.  GET THIS RESOLVED THEY SHOULD BE CALLING ME TO SCHEDULE MAINTENANCE NOT THE OTHER WAY AROUND.  *TR",
        "vin": "1G6DM57T670"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/25/2014",
        "dateOfIncident": "08/01/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10638871,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. THE CONTACT STATED THAT THE BRAKE PEDAL TRAVELED TO THE FLOORBOARD WHENEVER THE BRAKE PEDAL WAS DEPRESSED. THE CONTACT HAD TO CONTINUOUSLY PUMP THE BRAKE PEDAL BEFORE IT RESUMED NORMAL OPERATION. THE VEHICLE WAS TAKEN TO THE DEALER MULTIPLE TIMES, BUT THE CAUSE OF THE FAILURE COULD NOT BE DIAGNOSED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 87,000.",
        "vin": "1G6DP577770"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/23/2014",
        "dateOfIncident": "09/19/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10638296,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "ON FRIDAY SEPTEMBER 19, 2014 I RECEIVED A RECALL (14172) LETTER FROM GM.  THE NOTICE STATES \"PARTS  ARE NOW AVAILABLE TO REPAIR YOUR VEHICLE\" RELATING TO SAFETY AND THE IGNITION KEY.  IN ADDITION I AM INSTRUCTED TO CALL MY \"CADILLAC DEALERSHIP AS SOON AS POSSIBLE\" TO SCHEDULE A SERVICE TO FIX THE PROBLEM.    I CALLED TWO DEALERSHIPS ON SEPTEMBER 22, 2014, CLOSE TO WHERE I LIVE AND BOTH REPORTED THAT THEY HAD NO PARTS AND DID NOT KNOW WHEN THEY WOULD HAVE THEM!!!!      I AM EXTREMELY UPSET AND FRUSTRATED AS MY LIVELIHOOD DEPENDS UPON USING THIS CAR AND I HAD NO IDEA THAT CADILLAC WAS INVOLVED IN THIS \"KEY\" RECALL.  I MEAN ISN'T CADILLAC SUPPOSED TO BE GM'S HIGHER QUALITY CAR???  *TR",
        "vin": "1G6DM57T170"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/22/2014",
        "dateOfIncident": "09/22/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10637956,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "CADILLAC SENT OUT A RECALL ...THE DEALER UNABLE TO REPAIR ..\" NO PARTS AVAILABLE\".  *TR",
        "vin": "1G6DP577970"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/22/2014",
        "dateOfIncident": "09/20/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10638129,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. THE CONTACT RECEIVED A NOTIFICATION FOR RECALL NHTSA CAMPAIGN NUMBER: 14V394000 (ELECTRICAL SYSTEM). HOWEVER, THE PART NEEDED WAS UNAVAILABLE TO PERFORM THE REPAIR. THE DEALER WAS UNABLE TO PROVIDE AN EXPECTED DATE FOR THE PART TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "1G6DP577370"
    },
    {
        "components": "SERVICE BRAKES,ENGINE",
        "crash": true,
        "dateComplaintFiled": "09/22/2014",
        "dateOfIncident": "09/04/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10638234,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2007 CADILLAC CTS. THE CONTACT STATED THAT THE VEHICLE ACCELERATED INDEPENDENTLY AND THE BRAKES FAILED TO STOP THE VEHICLE. AS A RESULT, THE VEHICLE CRASHED INTO TWO DIFFERENT VEHICLES AND LANDED INTO A DITCH. A POLICE REPORT WAS FILED AND TWO OF THE OCCUPANTS SUSTAINED INJURIES. THE VEHICLE WAS TOWED TO THE CONTACT'S RESIDENCE AND DEEMED TOTALED. THE VEHICLE WAS NOT INSPECTED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "1G6DP577670"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/19/2014",
        "dateOfIncident": "08/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10637593,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 14V394000 (ELECTRICAL SYSTEM); HOWEVER, THE PART NEEDED TO REPAIR THE VEHICLE WAS UNAVAILABLE. THE DEALER WAS UNABLE TO PROVIDE AN EXPECTED DATE FOR WHEN THE PART WOULD BECOME AVAILABLE. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "1G6DP577870"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/18/2014",
        "dateOfIncident": "09/18/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10637209,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 14V394000 (ELECTRICAL SYSTEM); HOWEVER, THE PART NEEDED TO REPAIR THE VEHICLE WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "1G6DP577870"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,AIR BAGS,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "09/18/2014",
        "dateOfIncident": "09/17/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10637290,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. WHILE DRIVING 30 MPH, THE VEHICLE DECELERATED AND STALLED. THE STEERING WHEEL SEIZED AND BECAME DIFFICULT TO TURN. THE BRAKES ALSO BECAME DIFFICULT TO ENGAGE. DUE TO THE FAILURES, THE CONTACT CRASHED THE VEHICLE INTO A TREE. THE AIR BAGS FAILED TO DEPLOY. A POLICE REPORT WAS FILED AND NO INJURIES WERE REPORTED. AFTER THE CRASH, THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 14V394000 (IGNITION SWITCH). THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 132,000.",
        "vin": "1G6DM57T970"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/05/2014",
        "dateOfIncident": "08/20/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10631144,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2007 CADILLAC CTS. THE CONTACT STATED THAT WHILE DRIVING T APPROXIMATELY 30 MPH, THE VEHICLE CRASHED INTO THE REAR OF ANOTHER VEHICLE AND THE AIR BAGS FAILED TO DEPLOY.IN ADDITION, THE CONTACT MENTIONED THAT THE AIR BAG WARNING LIGHT ILLUMINATED.  A POLICE REPORT WAS FILED AND NO INJURIES WERE SUSTAINED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC, WHO DIAGNOSED THAT THE AIR BAG SENSOR NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE CONTACT STATED THAT THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 10V644000 (AIR BAGS). THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 136,000.",
        "vin": "1G6DP577770"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/03/2014",
        "dateOfIncident": "07/14/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10618517,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I NOTICED THAT OCCASIONALLY MY CAR BRAKES WOULD STOP WORKING A PUSH BACK AT ME WITH A PULSING FEELING WHEN I WAS TRYING TO STOP.  THIS HAPPENED TO ME 6-7 TIMES INTERMITTENTLY WHEN DRIVING VERY SLOWLY AND TURNING,  IT WASN'T SOMETHING THAT I COULD RE-CREATE EACH TIME.  NEXT I RECEIVED AN INTERMITTENT IN-DASH MESSAGE THAT STATED \"SERVICE BRAKE ASSIST\" THAT WOULD COME ON FOR A FEW SECONDS THEN DISAPPEAR.  IT DIDN'T ALWAYS APPEAR WHEN THE BRAKES WERE NOT WORKING. THIS WOULD TYPICALLY HAPPEN WHEN PARKING IN A PARKING SPACE, SLOWLY MAKING A SHARP TURN. I ACTUALLY HIT CONCRETE PARKING BUFFER ONE DAY BECAUSE I COULDN'T STOP.  IN TAKING MY CAR TO THE DEALER I WAS TOLD THE ELECTRONIC BRAKE CONTROL MODULE NEEDED TO BE REPLACED. AND THAT THE RIGHT FRONT WHEEL AND HUB BEARING NEEDED TO BE REPLACED DUE TO THE EBCM.  THE COST WAS ABOUT $2000.00.  I'VE RESEARCHED THIS ISSUES AND AM SEEING MANY CTS OWNERS WITH THE SAME ISSUE.  I FEEL THIS NEEDS TO BE ADDRESSED.  THE PUBLIC NEEDS TO BE NOTIFIED THAT THIS IS AN ISSUE WITH THE VEHICLE.  IT IS EXTREMELY SCARY TO FIND OUT THAT YOUR BRAKES ARE NOT WORKING.  I HAVE TWO SMALL CHILDREN THAT TRAVEL WITH ME OFTEN. VEHICLE OWNERS NEED TO BE AWARE OF THE BRAKE ISSUE WITH THIS VEHICLE AND CADILLAC NEEDS TO BE RESPONSIBLE IN FIXING THE PROBLEM AND NOT WAITING FOR PEOPLE TO BRING IN THEIR CARS UNTIL THEIR BRAKES ARE NOT WORKING.  BRAKES ARE A MUST HAVE ON A CAR AND THIS IS A PUBLIC SAFETY ISSUE.       *TR",
        "vin": "1G6DP577870"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/30/2014",
        "dateOfIncident": "06/01/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10607226,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE BEGAN BURNING OIL.  GM REPLACED DAMAGE TO TIMING CHAIN BUT DID NOT FIX THE PROBLEM IN THE ENGINE THAT CAUSES IT TO BURN OIL.  SO NOW, I HAVE TO ADD .5 QUART EVERY 300 MILES.  MY TECHNICIAN TELLS ME HE HAS MANY IN THE SAME BOAT.  *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/05/2014",
        "dateOfIncident": "06/15/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10596326,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR CAR IS EXPERIENCING AN ISSUE WITH THE PASSENGER SIDE AIRBAG, WHICH MATCHES EXACTLY THE DESCRIPTION AND SYMPTOMS IN NHTSA CAMPAIGN ID 10V644000 AND GM SAFETY RECALL 100355.  THE GM DEALERS KEEP SAYING OUR VIN DOESN'T MATCH THE PLANT WHERE THE CARS WITH THE PROBLEM AIRBAGS WERE MANUFACTURED AND WILL NOT REPLACE AS STATED IN THE RECALL, BUT OUR CAR HAS THE EXACT ISSUE AS SHOWN IN THE RECALL.------------------------------------------------------------------------------------------------------------------------------------    GM SUBJECT 10287 CONCERNING TIMING CHAIN ISSUE.  GM PUT A BAND AID FIX ON THIS AND GAVE A SPECIAL WARRANTY TO 120,000 TO REPAIR ANY ISSUES WITH TIMING CHAIN UNTIL 120,000 MILES.  OUR TIMING CHAIN WENT OUT AT 121,000 AND I FEEL GM SHOULD HONOR THE SPECIAL WARRANTY.  TIMING CHAIN ISSUE WAS NOT EXPLAINED TO US WHEN THE BAND AID FIX WAS APPLIED AND TIMING CHAIN ISSUE STARTED BEFORE 120,000 MILES.  *TR",
        "vin": "1G6DM57T370"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/29/2014",
        "dateOfIncident": "05/22/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10594923,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "SERVICE AIR BAG LIGHT COMES ON.  *TR",
        "vin": "1G6DM57T970"
    },
    {
        "components": "STRUCTURE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/02/2014",
        "dateOfIncident": "03/17/2014",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10576599,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2007 CADILLAC CTS. ON MONDAY, MARCH 17TH, AT 5:45AM, I WAS DRIVING SOUTH BOUND ON I-75. WHILE DRIVING WITH THE CRUISE CONTROL ON, TRAVELING AROUND 77 MPH, AT ABOUT MILE MARKER 88, I HEARD A LARGE THUD NOISE LIKE SOMETHING HIT THE UNDERBODY OF THE VEHICLE. I THEN HEARD A LOUD METALLIC RINGING NOISE AND FELT A VIBRATION THROUGH THE VEHICLE FLOOR AND STEERING WHEEL. I PUT MY TURN SIGNAL ON TO GET OVER TO THE SHOULDER OF THE ROAD. AS I TURNED MY HEAD TO THE RIGHT TO SEE IF IT WAS CLEAR TO GET OVER, I NOTICED A LARGE CLOUD OF BLACK SMOKE EMITTING FROM THE BACK OF THE VEHICLE AND COULD SEE AN ORANGE REFLECTION OF FLAMES IN THE DRIVER'S DOOR OF THE VEHICLE TO THE RIGHT OF ME.     I GOT OVER TO THE SHOULDER AT MILE MARKER 87.     I INSPECTED THE VEHICLE TO SEE WHAT WAS GOING ON, I LOOKED AT THE LEFT SIDE AND DIDN'T NOTICE ANYTHING, THEN WALKED OVER TO THE RIGHT SIDE OF THE VEHICLE (I WAS STANDING ABOUT 10 FT BEHIND THE VEHICLE ON THE RIGHT SIDE) AND NOTICED FLAMES SHOOTING OUT FROM UNDER THE ENGINE COMPARTMENT.  I WALKED BACK ABOUT 50 FEET AND CALLED 911 AND REPORTED THE VEHICLE FIRE. THE INDEPENDENCE TOWNSHIP SHERIFF'S OFFICE RESPONDED ABOUT 5 MINUTES LATER AND WAS GOING TO ATTEMPT TO PUT THE FIRE OUT, BUT BY THAT TIME THE FLAMES WERE SHOOTING OUT OF HOOD OF THE VEHICLE. THE FLAMES WERE ABOUT 4 TO 5 FT AT THAT TIME AND THE OFFICER DECIDED NOT TO ATTEMPT TO PUT THE FIRE OUT. FIRE DEPARTMENT SHOWED UP ABOUT 10 MINUTES AFTER THE SHERIFF WAS THERE AND PUT THE FIRE OUT. I HAD THE VEHICLE TOWED TO RANDY WEISS GM DEALER IN FENTON, MICHIGAN.    VEHICLE MILEAGE  74,665 MILES. VEHICLE MAINTAINED EITHER BY LASCO FORD IN FENTON MICHIGAN OR AL SIERRA IN GRAND BLANC MICHIGAN.  *TR",
        "vin": "1G6DP577870"
    },
    {
        "components": "AIR BAGS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/02/2014",
        "dateOfIncident": "04/12/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10576718,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER PURCHASE OF MY CTS, I NOTICED THE BRAKES SCREECHING AND PULSING. I'VE HAD MY BRAKES REDONE 3 TIMES AND I STILL HAVE SQUEAKING AND PULSING ISSUES. I TOOK MY CAR TO A CADILLACS DEALER AFTER THEY HAD CHARGED ME $600 FOR A BRAKE PAD ONLY JOB TO CHECK MY BRAKES AS THEY WERE STILL PULSING WHEN STOPPING ON UNEVEN PAVEMENT, AND THEY KEPT IF FOR A DAY AND TOLD ME MY BRAKES WERE FINE EVEN THOUGH THEY WERE STILL PULSING. THEY CHARGED ME $85 FOR LOOKING AT MY BRAKES WHICH WAS A RIP OFF SINCE I STILL HAVE THE PROBLEM.  AIR BAGS, I TOOK MY CAR IN FOR THE AIR BAG RECALL REPAIR. WITHIN A YEAR I HAVE THE SAME PROBLEM. THEY CLEARLY ARE NOT FIXING THE PROBLEM. MY CADILLACS IS BEAUTIFUL BUT I FEAR IT MAY COST ME MY LIFE ONE DAY IF CADILLACS DOESN'T STEP UP AND EXPOSE THESE PROBLEMS AND MAKE THE REPAIRS.  *TR",
        "vin": "1G6DP577970"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "04/01/2014",
        "dateOfIncident": "12/08/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10576322,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON I-75 IN MONROE, MICHIGAN. WHEN ANOTHER VEHICLE VENTURED OR STEERED INTO MY LANE, WHERE MY    2007 CADILLAC CTS WAS CUT OFF/BUMPED CAUSING A FRONTAL AND BACK IMPACT TO THE VEHICLE. THE CAR BAGS DID NOT DEPLOY, THE BRAKES DID NOT STOP THE CAR AND THE IGNITION SWITCH LOCKED. ACCORDING TO THE INSURANCE COMPANY, THE CAR WAS A TOTAL LOSS.  *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/14/2014",
        "dateOfIncident": "09/01/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10569299,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RED AIR BAG LIGHT CAME ON  THE DASH BOARD OF OUR 2007 CADILLAC CTS ALONG WITH THE PASSENGER AIR BAG-OFF LIGHT ON THE REARVIEW MIRROR. (BOTH WARNING LIGHTS STAY ON WHETHER SOMEONE IS SITTING IN THE SEAT OR NOT) WE DID RESEARCH AND COME TO FIND OUT THERE WAS A RECALL ON THE PASSENGER SIDE AIR BAGS FOR THIS YEAR/MAKE CADILLAC. WHEN WE CALLED OUR LOCAL GMC CADILLAC DEALERSHIP TO INFORM THEM AND THEY STATED THAT IT WOULD COST US $95 FOR THEM TO TAKE A LOOK AT IT BUT THAT THE ISSUE HAD ALREADY BEEN FIXED BEFORE WE BOUGHT THE CAR SO THAT IT WAS NOT COVERED UNDER THE RECALL ANY LONGER. IT OBVIOUSLY HAS NOT BEEN FIXED AND COME TO FIND OUT THIS IS A SERIOUS ISSUE WITH QUITE A FEW GM CARS. THIS ISSUE WITH THESE CARS NEEDS TO BE ADDED TO LIST OF AIR BAG ISSUES WITH GM AND FOR THE SAFETY OF ALL WHO DRIVE THESE CARS, THIS NEEDS TO BE FIXED ASAP!  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/17/2014",
        "dateOfIncident": "02/14/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10564656,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM CONCERNED ABOUT A KNOW DIFFERENTIAL ISSUE WITH THE CADILLAC CTS. IN FORUMS EVERY WHERE I AM READING THAT THE DIFFERENTIAL FIRST LEAKS AND THEN GRENADES. I KNOW YOU ARE ONLY REQUESTING INFORMATION WHEN IT GRENADES, BUT I THINK ISSUES SHOULD BE STATED IMMEDIATELY! I DON'T WANT TO BE DRIVING DOWN THE ROAD WITH CHILDREN IN THE CAR AND HAVE PROBLEMS THEN. I CONTACTED CADILLAC FIRST AND RECEIVED THE HEISMAN STIFF ARM. I THINK THIS IS A SIGNIFICANT FLAW IN THE CTS DATING BACK TO 2004 AND SHOULD HAVE A RECALL!  *TR",
        "vin": "1G6DP577770"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/08/2014",
        "dateOfIncident": "01/11/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10559058,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "NO BRAKES DURING SLOW RIGHT TURN INTO A PARKING SPACE. BRAKE PEDAL BEGAN TO PULSATE, CAR WAS NOT STOPPING AS IT SHOULD BUT STOPPED AT A CONCRETE BARRIER, THE BRAKING RECOVERED. PROBLEM FIRST STARTED ON JAN. 2012. TOOK CAR TO CADILLAC OF LAS VEGAS FOR DIAGNOSTICS. INVOICE NO. 419185. DEALER WAS UNABLE TO RECREATE PROBLEM. THE SAME PROBLEM RECURRED APPROXIMATELY ONE YEAR LATER, 2013 BUT CAR HAS NOT BEEN TAKEN TO DEALERSHIP SINCE DUE TO OTHER PERSONAL ISSUES.  *TR",
        "vin": "1G6DP577270"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/27/2013",
        "dateOfIncident": "04/01/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10553954,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I REPLACED MY BRAKE LINES BEING MANY OTHERS WITH THE CTS-V HAVE HAD FAILURE WHILE DRIVING.  ONCE REMOVED, MY LINES WERE STARTING TO CRUMBLE APART UNDER THE RUBBER WHERE THE HOSE CONNECTS TO THE FITTING, JUST AS EXPECTED.  THERE IS A RECALL FOR THE BASE CTS, BUT NOT FOR THE CTS-V, EVENTHOUGH THEY BOTH USE THE EXACT SAME PART NUMBER FOR THE BRAKE LINES.    HERE IS A PHOTO OF THE PART:  [IMG]HTTP://I1093.PHOTOBUCKET.COM/ALBUMS/I424/SEVILLIANSTS/100_8187.JPG[/IMG].  *TR",
        "vin": "1G6DN57U570"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/30/2013",
        "dateOfIncident": "09/23/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10546276,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. THE CONTACT STATED THAT THE AIR BAG WARNING LIGHT REMAINED ILLUMINATED.  THE VEHICLE WAS TAKEN TO A INDEPENDENT MECHANIC, WHO STATED THAT THE SENSOR IN THE PASSENGER'S SEAT NEEDED TO BE REPLACED. THE CONTACT REFERENCED NHTSA CAMPAIGN NUMBER: 10V644000 (AIR BAGS) AND STATED THAT HIS VEHICLE WAS NOT INCLUDED IN THE RECALL ALTHOUGH HE WAS HAVING A SIMILAR ISSUE. THE MANUFACTURER WAS NOTIFIED. THE FAILURE AND CURRENT MILEAGE WAS 88,107.",
        "vin": "1G6DM57T570"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/26/2013",
        "dateOfIncident": "09/19/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10545479,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 45 MPH, THE CONTACT ATTEMPTED TO MAKE A LEFT TURN AND HAD TO FORCE THE STEERING WHEEL TO MOVE. THE CONTACT ALSO MENTIONED THAT THE STABILIZATION ACTIVATED WARNING LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC, WHO STATED THAT THE STEERING SHAFT AND THE CLOCK MECHANISM WERE FRACTURED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 74,094. THE CURRENT MILEAGE WAS 75,212.",
        "vin": "1G6DP577270"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/23/2013",
        "dateOfIncident": "09/16/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10544916,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. THE CONTACT STATED THAT WHILE DRIVING 45 MPH AND ATTEMPTING A LEFT TURN,  THE STEERING BEGAN TO FAIL. IN ADDITION, THE ACCELERATOR PEDAL PULSATED AS THE BRAKE WARNING LAMP ILLUMINATED. THE VEHICLE WAS DRIVEN WITH THE WHEEL AT A THIRTY DEGREE ANGLE UNTIL THE VEHICLE WAS RESTARTED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC. THE VEHICLE WAS DIAGNOSED WITH HAVING A FRACTURED STEERING SHAFT. THE VEHICLE WAS REPAIRED AND THE MANUFACTURER WAS NOT NOTIFIED OF THE INCIDENT. THE VIN WAS UNAVAILABLE. THE APPROXIMATE FAILURE MILEAGE WAS 75000.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/18/2013",
        "dateOfIncident": "11/10/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10544330,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "IDN7-34821 I COULD NOT ATTACH THE PDF. NOVEMBER 2012 I WAS PARALLEL PARKING AND FELT LIKE MY CAR SLIDE BEFORE STOPPING. I HAD APPROXIMATELY 32,000 MILES ON IT. ABOUT A WEEK LATER I TURNED THE WHEEL TO PARK AND AGAIN IT FELT LIKE THE CAR SLID ON SOMETHING, THE BRAKES MADE A NOISE, PULSATED AND DIDN'T FEEL LIKE THEY WERE GOING TO STOP.  A DAY OR SO AFTER THAT I WENT TO PARK THE CAR AND THIS TIME THE BRAKES PULSATED, MADE A NOISE AND WOULD NOT STOP. I WAS HEADING FOR A BRICK WALL SO I SHIFTED THE CAR INTO PARK. EACH OF THESE OCCURRENCES HAPPENED AT SPEEDS OF APPROXIMATELY 5-10 MPH WHEN I WENT TO PARK THE CAR TURNING THE WHEEL TO THE RIGHT. I TOOK THE CAR TO THE CADILLAC DEALER AND THEY TOLD ME THEY DIDN'T KNOW OF ANY RECALL, AFTER CHECKING THE CAR THEY DIAGNOSED IT AS A FRONT WHEEL SPEED SENSOR ELECTRICAL FAILURE. THEY REPLACED THE HUB & CHARGED ME $725.70. 3 WEEKS AGO (AUGUST 2013) I WENT TO PARK MY CAR AND STARTED TO FEEL THE SAME PULSING OF THE BRAKES AND SLIDING OF THE VEHICLE.A DAY LATER I WAS PULLING INTO A PARKING SPACE WITH MY DAUGHTER & THE CAR SLID AND THE BRAKES PULSATED MY DAUGHTER IMMEDIATELY ASKED WHAT HAPPENED SHE FELT IT TOO.  ON 9/6/13 I TOOK MY CAR WITH 35,630 MILES ON IT TO A DIFFERENT CADILLAC DEALER THEY DIAGNOSED IT WITH SEVERAL CODES & REPLACED THE ELECTRONIC BRAKE CONTROL MODULE CHARGING ME $1,434.87. I PICKED THE CAR UP ON 9/9/13 ON 9/10/13 THE SAME EXACT PROBLEM HAPPENED AGAIN. I EMAILED CADILLAC CUSTOMER ASSISTANCE 9/10/13 [XXX] CALLED ME ON 9/11/13 & SAID THEY WOULD CONTACT ME WHEN TO TAKE IT BACK TO THE DEALER. I DROVE THE CAR 1 MORE TIME AND THE SAME THING HAPPENED PULLING INTO MY GARAGE. 9/16/13 [XXX] CALLED TO SEE IF THE PROBLEM WAS FIXED I TOLD HIM I WAS STILL WAITING TO HEAR FROM SOMEONE TO BRING IT IN TO BE REPAIRED AGAIN, HE SAID THE CUSTOMER CARE SPECIALIST WOULD CALL ME WITHIN 24 HOURS & I HAVE HEARD NOTHING.      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "1G6DP577770"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/28/2013",
        "dateOfIncident": "12/17/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10537776,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN COMING TO A STOP FROM A SLOW SPEED THE VEHICLE WOULD NOT STOP. I EXPERIENCED THIS ON SEVERAL OCCASIONS, USUALLY WHEN DRIVING IN A NEIGHBORHOOD OR PULLING INTO A PARKING STALL. I NOTICED THAT IT ONLY OCCURRED WHEN DRIVING UNDER 10-15MPH. IT WOULD FEEL AS IF MY BRAKES WERE SLIPPING. MY CAR WOULD CONTINUE TO EASE FORWARD, THE BRAKE PEDAL WOULD PULSATE AND MY ENTIRE FRONT DECK OF THE CAR WOULD SHAKE. TO REMEDY THE PROBLEM I WOULD BE FORCED TO EITHER PUMP MY BRAKES, IMMEDIATELY SHIFT THE VEHICLE INTO PARK POSITION, OR REMOVE THE CAR KEYS. THANKFULLY, THERE HAS NOT BEEN ANY IMPACT AND NO ONE HAS BEEN INJURED. MY VEHICLE WAS COVERED UNDER A CERTIFIED-PREOWNED LUXURY WARRANTY OFFERED THROUGH GENERAL MOTORS. THE LOCAL DEALERSHIP SERVICED THIS CAR FOR THIS ISSUE IN 2009, 2010, 2011, AND 2012. ALL REPAIRS WOULD SEEM TO TEMPORARILY MASK THE PROBLEM, BUT THEN IT WOULD REOCCUR. MY WARRANTY EXPIRED ON MAY OF 2013. IN JULY 2013 I NOTIFIED THEM THAT THE BRAKE ISSUE WAS BEGINNING AGAIN AND AT A HIGHER FREQUENCY THAN BEFORE. THE LOCAL DEALERSHIP UNDERSTOOD THE HISTORY OF THE PROBLEM AND WAS GOING TO OFFER THE REPAIR OUT OF GOOD WILL EVEN WITH THE EXPIRED WARRANTY BECAUSE IT'S BEEN A DOCUMENTED ISSUE WITH MY VEHICLE. THE WARRANTY SHOULD FIX THE PROBLEM, SINCE IT HASN'T, IN MY OPINION, IT SHOULD BE COVERED. HOWEVER, THEIR CLAIM WAS DENIED BY GENERAL MOTORS. GENERAL MOTORS IS REFUSING TO FIX MY VEHICLE UNLESS I PAY FOR APPROXIMATELY $600 OF THE COST. I CANNOT AFFORD $600 AND FEEL THAT THIS SHOULD BE THE EXPENSE OF GENERAL MOTORS. I HAVE 3 CHILDREN AND I WORK FULL TIME. THIS IS A SAFETY ISSUE. I COULD DRIVE INTO ANOTHER CAR, ONCOMING TRAFFIC, A BUSINESS ESTABLISHMENT, A CHILD. MY VEHICLE SHOULD STOP WHEN THE BRAKE PEDAL IS PRESSED IMMEDIATELY. I AM HIGHLY DISSATISFIED WITH GENERAL MOTORS ATTENTION TO THIS AND AM MAKING ALL THE NECESSARY DOCUMENTATION TO ENSURE THAT THIS IS NOT IGNORED.  *TT",
        "vin": "1G6DM57T770"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/22/2013",
        "dateOfIncident": "04/01/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10536680,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS.  THE CONTACT STATED THAT WHEN THE BRAKE PEDAL WAS DEPRESSED, THE FRONT BRAKE PULSATED ABNORMALLY. THE VEHICLE WAS TAKEN TO A MECHANIC FOR INSPECTION. THE FRONT ROTORS WERE FOUND TO BE WORN AND THE REAR AXLE SEAL WAS CORRODED. THE FRONT ROTORS WERE REPLACED BUT THE REAR AXLE SEAL WAS NOT REPLACED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 40,000 AND THE APPROXIMATE CURRENT MILEAGE WAS 50,400.",
        "vin": "1G6DM57T670"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/23/2013",
        "dateOfIncident": "10/26/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10526327,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. THE CONTACT STATED THAT THE AIR BAG WARNING LIGHT REMAINED ILLUMINATED. THE VEHICLE WAS TAKEN TO THE DEALER SEVERAL TIMES FOR THE AIR BAG WARNING LIGHT ILLUMINATION. THE DEALER REPLACED THE AIR BAG SENSOR SEVERAL TIMES HOWEVER, THE FAILURE WAS NOT CORRECTED. THE CONTACT LATER BECAME INVOLVED IN A CRASH WHERE ANOTHER VEHICLE CRASHED INTO THE PASSENGER'S SIDE OF THE CONTACT'S VEHICLE. THE AIR BAGS FAILED TO DEPLOY. THE CONTACT SUSTAINED BACK AND NECK INJURIES. A POLICE REPORT WAS NOT FILED. THE VEHICLE WAS NOT TAKEN TO THE DEALER FOR INSPECTION OF THE AIR BAG FAILURE.  THE APPROXIMATE FAILURE MILEAGE WAS 85,000 AND THE CURRENT MILEAGE WAS 88,500.    UPDATED 8/26/13 *CN",
        "vin": "1G6DM57T370"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "06/17/2013",
        "dateOfIncident": "01/03/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10520194,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "CADILLAC REFUSES TO REPAIR FRONT PASSENGER SEATBELT RECALL BECAUSE \"YOUR VEHICLE WAS NOT ONE UNDER THE RECALL.\" *TR",
        "vin": "1G6DM57T470"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/11/2013",
        "dateOfIncident": "06/02/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10511488,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "HELLO, I HAVE HAD MY BRAKES PULSATE (WITH A GRINDING NOISE) THEN FAIL WHILE MAKING A HARD RIGHT TURN ON SEVERAL OCCASIONS SINCE LAST SUMMER. THIS ONLY HAPPENS AT SLOW SPEEDS SUCH AS PULLING INTO A PARKING SPOT.FORTUNATELY, I HAVE NOT HIT ANYTHING OR ANYONE. I HAVE HAD EVERY RECALL FIXED ON MY CAR UP TO DATE. I WORK NEXT-DOOR TO A CADILLAC DEALERSHIP AND JOHN, MY SERVICE WRITER TOLD ME THERE ARE NO RECALLS OR BULLETINS. I AM VERY CONSCIOUS ABOUT HOW AND WHERE I PARK. PLEASE HELP GET THE WORD OUT TO THIS PROBLEM. THROWING MONEY AT PARTS NOT NEEDED TO FIX THE PROBLEM IS VERY EXPENSIVE, AS YOU CAN READ ON THE FORUM FROM OTHERS LIKE ME. ITS JUST A MATTER OF TIME BEFORE SOMEONE GETS HURT. [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "166DP577970"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/21/2013",
        "dateOfIncident": "04/01/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10508998,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER SERVICE AIR BAG LIGHT COMES ON. AFTER 1 WEEK I SAT ON THE SEAT, THERE WAS A RECALL, AND THE SERVICE LIGHT WENT OUT.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/05/2012",
        "dateOfIncident": "07/18/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10483426,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. THE CONTACT STATED THAT WHILE DRIVING 55  MPH, THE VEHICLE STARTED TO VIBRATE. THE VEHICLE WAS NOT TAKEN TO THE DEALER. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 48,000 AND THE CURRENT MILEAGE WAS 55,000.  ....UPDATED 12/20/12 *BF     THE CONSUMER HAS STATED THAT THE DEALER HAS SEEN THE CAR AND THE MANUFACTURER HAS BEEN NOTIFIED. THERE IS A POSSIBLE DRIVE LINE FAILURE. COUPLERS ARE NOT A SERVICEABLE PART. UPDATED 12/31/2012 *JS",
        "vin": "1G6DP577370"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/05/2012",
        "dateOfIncident": "09/05/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10473892,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THIS CAR AS A USED VEHICLE FROM ATLANTIC CADILLAC IN BAY SHORE NEW YORK IN APRIL 2011. SEVERAL TIMES SINCE THIS PURCHASE I HAVE HAD TROUBLE STOPPING.THE BRAKES FAIL AND SERVICE BRAKE ASSIST LIGHTS UP ON MY DASH. ALSO THE ABS AND THE TRACTION CONTROL SYMBOLS LIGHT UP ON THE DASH. I HAVE HAD THE CAR TO THE DEALER SEVERAL TIMES FOR THIS PROBLEM. I AM TOLD THEY CANNOT DUPLICATE THE PROBLEM. THIS IS NO WAY TO HANDLE A BRAKE SITUATION. THIS IS VERY DANGEROUS. I HAD MY DAUGHTER IN THE CAR THIS MORNING IN THE SCHOOL PARKING LOT. WHICH I MIGHT ADD WAS FULL OF STUDENTS AND CARS, BUSSES. THIS PROBLEM MUST BE ADDRESSED BEFORE SOMEONE IS KILLED. AS SOON AS THIS HAPPENED THIS MORNNING I CALLED THE DEALER AGAIN ONLY TO BE GIVEN THE SAME RESPONSE THE PROBLEM CANNOT BE DUPLICATED. I WAS NOT HAPPY WITH HOW I WAS BEING TREATED AT ATLANTIC CADILLAC SO THE LAST FEW TIMES I HAD PROBLEMS I WENT TO A DEALER CLOSER TO MY-HOME. KING OROUORKE 756 SMITHTOWN BYPASS SMITHTOWN 631-724-4700.  *TR   UPDATED 11/1/12 *CN UPDATED 11/1/2012 *JS",
        "vin": "1G6DM57T570"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/16/2012",
        "dateOfIncident": "07/09/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10465798,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MY HUSBAND AND I HAVE BEEN WORKING WITH HILL CADILLAC, FC KERBECK AND GM PROTECTION PLAN TO RESOLVE OUR REPAIR ISSUES.  THE INFORMATION WE HAVE RECEIVED IS THAT THE TIMING CHAIN NEEDS TO BE REPLACED.  WE PAID FOR ADDITIONAL WARRANTIES WHEN WE PURCHASED OUR CADILLAC IN 2010.  OUR TIMING CHAIN WAS REPLACED IN AUGUST 2011 AND NOW ARE BEING TOLD THAT THERE IS NO OIL IN OUR CAR AND WE NEED REPAIRS THAT COST OVER $2000.00.  MY HUSBAND AND I DO NOT HAVE THAT KIND OF MONEY INSTANTLY.  WE HAVE PROVIDED DOCUMENTATION OF TIMELY OIL CHANGES AND UP TO DATE REPAIRS ON THE VEHICLE.  WE LOVE OUR CAR AND NOW NEED THE DEALERSHIP AND OTHERS TO STAND BEHIND THEIR \"CERTIFIED\" CAR AND REPAIR OUR CAR.  ANY HELP YOU CAN GIVE WOULD BE APPRECIATED.  CONTACTS SPOKEN TO ARE:  RUBIN/CADILLAC CORPORATION: 866-790-5600 X 11197 - CASE NUMBER:[XXX]HILL CADILLAC - 610-356-4900  FC KERBECK - [XXX]- 856-786-8200 (PLACE OF PURCHASE)    THANK YOU FOR ANY HELP YOU CAN PROVIDE.      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *TR",
        "vin": "1G6DP577770"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/15/2012",
        "dateOfIncident": "05/01/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10461879,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. THE CONTACT STATED THAT THE DRIVER WAS TRAVELING 20 MPH AND WAS INVOLVED IN A CRASH.  THE AIR BAGS DID NOT DEPLOY.  THE CONTACT WAS TOLD BY THE REPAIR SHOP THAT THERE WAS A RECALL FOR THE FAILURE UNDER NHTSA CAMPAIGN ID NUMBER: 10V644000 (AIR BAG: FRONTAL: SENSOR/CONTROL MODULE).  THE CONTACT SPOKE WITH THE MANUFACTURER AND WAS TOLD THAT THE VEHICLE WAS NOT INCLUDED IN THE RECALL CAMPAIGN. THE FAILURE AND THE CURRENT MILEAGE WAS 51,443.",
        "vin": "1G6DP577370"
    },
    {
        "components": "AIR BAGS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/11/2012",
        "dateOfIncident": "03/01/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10461266,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR HAS BEEN CONFIRMED THAT THE FRONTAL SENSOR/CONTROL MODULE DOES NOT WORK AGAIN. I HAD IT ONCE REPAIRED DUE TO A RECALL, I BELIEVE IN 2009. NOW IN 2012, I AM HAVING ANOTHER ISSUE WITH THE PASSENGER AIRBAG MODULE, IN WHICH NEEDS TO BE REPLACED (BEEN CONFIRMED BY DEALER). THIS PART SENSES IF THE PASSENGER IS SITTING IN THE CAR. THE LIGHT IS ON TELLING ME THE PASSENGER AIRBAG NEEDS SERVICE.     MY BRAKES ARE NEW AND HAVE BEEN RECENTLY REPLACED, 2 MONTHS AGO, BUT THERE IS AN ISSUE WITH STEPPING ON THE BRAKES. WHEN I DO I SLIDE AND THERE IS AN INCREASE IN STOPPING DISTANCE. I ALMOST CRASHED INTO AN RV, SLID 8 FEET INTO AN INTERSECTION BECAUSE OF THIS ON-GOING ISSUE. I WAS TOLD BY CADILLAC DEALER IN BELLINGHAM, WA. THE DEALER DIDN'T KNOW WHY I WAS SLIDING BUT TO BE SURE, IT WAS BEST TO CHANGE THE BRAKES. WELL, IT IS HAPPENING AGAIN. I AM WONDERING IF IT IS A RECALL. I CAN PHYSICALLY HEAR THE BRAKES LOCK UP, MAKES A GRINDING LIKE NOISE, THEN SLIDES FORWARD. I AM SCARED TO DRIVE THE CAR.    I AM IN WASHINGTON STATE & THE CAR WAS PURCHASED IN WASHINGTON STATE, AS WELL. IS IT POSSIBLE THAT MORE STATE CAN HAVE THE SAME ISSUES RELATED TO THE OTHER STATES AFFECTED?  *TR",
        "vin": "1G6DM57T170"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/17/2012",
        "dateOfIncident": "04/18/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10458768,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS . THE CONTACT STATED THE AIR BAG WARNING LIGHT REMAINED ILLUMINATED WHILE DRIVING OR ALSO WHEN THE VEHICLE WAS TURNED OFF. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHO STATED THE SENSOR ON THE PASSENGER SIDE  NEEDED TO BE REPLACED AND THE AIR BAGS HAD BEEN DISABLED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 85,000 AND THE CURRENT MILEAGE WAS 111,000.",
        "vin": "1G6DM57T670"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/10/2012",
        "dateOfIncident": "12/15/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10458020,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC STS. THE CONTACT STATED THAT THE AIR BAG WARNING LIGHT REMAINED ILLUMINATED. THE VEHICLE WAS NOT TAKEN TO THE DEALER FOR DIAGNOSTIC TESTING OR REPAIRS. THE APPROXIMATE FAILURE MILEAGE WAS 95,000.",
        "vin": "1G6DW677X70"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/09/2012",
        "dateOfIncident": "03/05/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10454629,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MONDAY MARCH 5, 2012 @ 8AM MY DAUGHTER WAS @ A STOP SIGN.  SHE WAITED FOR 3 CARS TO PASS SHE PULLED OUT ONTO 16TH STREET WHERE THE CARS TRAVEL @ 35MPH... SHE WAITED FOR THE TRUCK TO GO PAST & @ 8AM THE SUN IS BRIGHT SHE COULD NOT SEE THE TRAILER THAT THE TRUCK WAS TOWING & SHE TRIED TO GO STRAIGHT ACROSS THE STREET!  SHE HIT THE TRAILER HEAD ON & IT SMASHED THE FRONT END OF MY CAR & SPUN HER AROUND & SMASHED THE PASSENGER SIDE & DRAGGED HER DOWN THE ROAD... THE BATTERY ACID FROM CAR WAS MELTING THE ROAD.  THE POLICE & INSURANCE COMPANY WERE VERY SURPRISED THAT MY AIRBAG DID NOT GO OFF!!!!!  I HAD ONLY HAD MY CAR BACK FOR 8 DAYS FROM THE DEALERSHIP BEFORE IT WAS TOTALED.  I HAD JUST PUT NEW TIRES ON, NEW FILTERS, NEW SPARK PLUGS, A CATALYTIC CONVERTER ETC, THEY CHECKED MY CAR IN FULL AS THEY DID EVERY TIME & NEVER DID ANYTHING SAY I HAD AN AIRBAG PROBLEM.  I BROUGHT MY CAR IN FOR EVERY RECALL I EVER RECEIVED!  MY INSURANCE COMPANY & I BOTH HAVE TAKEN PICTURES.  MY PROBLEM NOW IS THAT I OWED MORE THAN MY CAR WAS WORTH.  MY COMPLAINT IS THE SIMPLE FACT THAT THE AIRBAGS DID NOT DEPLOY FOR SUCH A HORRIBLE COLLISION, YET A FRIEND HAD A SOFTBALL HIT THE HOOD OF HER CAR & HER AIRBAG DEPLOYED.  HOW CAN I TRUST MY CHILDREN WILL BE SAFE WHEN DRIVING, IF I DON'T HAVE THE ASSURANCE OF AN AIRBAG! *TR",
        "vin": "1G6DP577770"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/14/2012",
        "dateOfIncident": "02/29/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10451668,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. WHILE PARKED, THE CONTACT NOTICED THAT THE AIR BAG WARNING LIGHT ILLUMINATED ON THE INSTRUMENT PANEL. THE VEHICLE WAS TAKEN TO THE DEALER FOR A DIAGNOSTIC TEST. THE TECHNICIANS STATED THAT THE AIR BAG SENSOR WOULD HAVE TO BE REPLACED. THERE WAS A RECALL UNDER NHTSA CAMPAIGN ID NUMBER 10V644000 (AIR BAGS:FRONTAL:SENSOR/CONTROL MODULE) THAT MAY BE RELATED TO THE FAILURE. THE DEALER INFORMED THE CONTACT THAT THE VIN WAS NOT INCLUDED IN THE RECALL. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 64,000.",
        "vin": "1G6DM57T570"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/16/2012",
        "dateOfIncident": "02/15/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10448271,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "NEVER HAD A PROBLEM WITH THE CAR.  TOOK IT IN TO THE DEALER FOR A TIMING CHAIN TENSIONER RECALL AND NOW MY TIMING CHAIN OR THE TENSIONERS HAVE FAILED AND THE CAR WILL NOT START. *TR",
        "vin": "1G6DM57T170"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/13/2012",
        "dateOfIncident": "02/10/2012",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10447763,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. THE CONTACT STATED THAT THE ENGINE EXPLODED. THE CONTACT WAS DRIVING 78 MPH WHEN THE CRUISE CONTROL INADVERTENTLY DISENGAGED. A LOUD BOOMING NOISE EMITTED FROM THE ENGINE WHILE A FLASH OF FIRE AND SMOKE EMITTED FROM THE REAR EXHAUST. SMOKE THEN BEGAN TO RISE FROM THE ENGINE. THE CONTACT ALSO STATED THAT A RATTLING CHAIN SOUND ALSO BEGAN TO COME FROM THE ENGINE. THERE WERE NO WARNINGS PRIOR TO THE FAILURE. THE VEHICLE WAS TAKEN TO THE DEALER, BUT THE DEALER WAS UNABLE TO INSPECT THE VEHICLE. THE DEALER INFORMED THE CONTACT THAT THIS WAS A KNOWN FAILURE. THE FAILURE AND CURRENT MILEAGES WERE 38,991.",
        "vin": "1G6DP577670"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/30/2012",
        "dateOfIncident": "06/06/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10445817,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CADILLAC CTS HAS A MANUAL SHIFT TRANSMISSION.   UNFORTUNATELY CADILLAC INSTALLED A FOOT EMERGENCY BRAKE ON MY CAR.   WHEN STOPPED ON A HILL THE VEHICLE ROLLS BACKWARDS WHEN YOU ENGAGE THE GEAR BECAUSE THEY INSTALLED A FOOT EMERGENCY BRAKE INSTEAD OF A HAND EMERGENCY BRAKE.   WITH A HAND BRAKE YOU CAN EASE OFF THE BRAKE WHILE YOU ENGAGE THE DRIVE TRAIN.       WITH THE FOOT BRAKE YOU CANNOT EASE OFF THE EMERGANCY BRAKE ITS EITHER ON OR OFF.  THIS CREATES A PROBLEM WHEN SETTING ON AN HILL.  ITS IMPOSSIBLE TO KEEP THE CAR FROM MOVING BACKWARDS WHEN ENGAGING THE DRIVE TRAIN ON A HILL.  *TT",
        "vin": "1G6DP577270"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/23/2011",
        "dateOfIncident": "09/30/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10436851,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE LIGHT ON DASHBOARD WARNED THAT THERE WAS A PROBLEM.  AFTER INVESTIGATION IT WAS CLEAR THAT THE TIMING CHAIN HAD TO BE REPLACED.  THIS WAS CARRIED OUT WITHOUT ANY COURTESY FROM IMPORT-ORGANIZATION OR DEALER.  AFTER 28,000 MILES? UNBELIEVABLE. IT COST ME A LOT OF MONEY.  *TR",
        "vin": ""
    },
    {
        "components": "TIRES,WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/24/2011",
        "dateOfIncident": "10/22/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10432657,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "SPARE TIRE DOESN'T FIT ON CTS SPORT.  *TR",
        "vin": "1G6DP577370"
    },
    {
        "components": "STRUCTURE,TIRES",
        "crash": false,
        "dateComplaintFiled": "09/07/2011",
        "dateOfIncident": "09/01/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10409491,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "2007 CADILLAC CTS. CONSUMER STATES PROBLEM WITH OBTAINING A REFUND DUE TO ISSUES WITH VEHICLE UPON TRYING TO TRADE IT IN *TGW CONSUMER WRITES ADDITIONAL CORRESPONDENCE *TGW  THE  CONSUMER LEARNED THE FRAME WAS DAMAGED AND IT APPEARED THE VEHICLE HAD BEEN SITTING ON BLOCKS AND THERE WAS DAMAGE UNDER THE VEHICLE. THE LOW FLUID LIGHT ILLUMINATED AND THE VEHICLE DID NOT COME EQUIPPED WITH A SPARE TIRE. *JB",
        "vin": "1G6DM5T5701"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/11/2011",
        "dateOfIncident": "08/11/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10418617,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TIE ROD FAILURE.  *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "07/22/2011",
        "dateOfIncident": "07/11/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10414697,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MONTGOMERY, AL. JULY 22, 2011  2007 CADILLAC CTS: BRAKES FAIL WHEN MAKING TURN AT SLOW SPEEDS, SUCH AS INTO DRIVEWAY, PARKING SPOT ETC, AND CAR CONTINUES TO MOVE FORWARD IN A SLIDE.. DEALER CLAIMS THERE ARE NO BRAKE PROBLEMS AND THAT THEY CAN'T REPLICATE PROBLEM. AFTER SPEAKING WITH SEVERAL OTHER OWNERS WHO HAVE THE SAME PROBLEM, I \"GOOGLED\" THE ISSUE AND FOUND NUMEROUS COMPLAINTS REGARDING THE SAME SITUATION AND ALL INDICATINGT HE DEALERSHIPS WERE EITHER UNAWARE, UNWILLING OR UNABLE TO RESOLVE THE PROBLEM.   FINALLY I ACCIDENTALY BUMPED A CAR ON THE CHURCH PARKING LOT ON 7/10/2011 AND I TOOK THE CAR IN ON 7/11/2011 FOR THE 5TH TIME SINCE I PURCHASED IT ON 8/24/2010. I TOLD THEM NOW I DON'T WANT IT BACK AGAIN UNTIL IT IS FIXED, BECAUSE I ALMOST HIT THE OWNER OF THE VEHICLE, HE HAD JUST STEP AWAY FROM THE TRUNK OF HIS CAR, AND I WAS TRYING TO STAND UP ON THESE BRAKES, BUT THE CAR WOULD NOT STOP , IT JUST ROLLED INTO THE BACK OF THEIR CAR, THANK GOD I WAS GOING VERY SLOW.  MY CAR WAS RETURNED TO ME ON 7/17/2011 AND THEY CLAIM TO HAVE FIXED IT THIS TIME, SO FAR IT HAS BEEN A WEEK AND I HAVEN'T HAD A PROBLEM YET . IF THIS HAS FIXED THE PROBLEM, I WILL PUT ANOTHER MESSAGE IN HERE TO LET OTHERS KNOW WHAT THE DEALERSHIP SAYS THEY DID TO REPAIR MY CAR.  *TT",
        "vin": "1G6DP577970"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/19/2011",
        "dateOfIncident": "06/19/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10407436,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "ON A 2007 CADILLAC CTS THE REAR RIGHT BRAKE HOSE IS DESIGNED AND ASSEMBLED IN SUCH A WAY THAT IT COMES IN CONTACT ALL THE TIME WITH A SHARP EDGE OF A METAL BRACKET. THIS INTERFERENCE LEAD TO AN EROSION ON THE HOSE THAT IS CLOSE OF PERFORATING THE HOSE AT ONLY 58,000KM. I GUESS THAT FOR OLDER CARS AND/OR MUCH MILEAGE, THIS HOSE WAS ALREADY PERFORATED. THIS CAR ALREADY HAD A RECALL FOR THE FRONT BRAKE HOSES, THAT WERE REPLACED. BUT FOR THE REAR HOSE THERE IS NO RECALL, ALTHOUGH THE DANGER IS MUCH GREATER. WILL CONTACT GM AND THEN ASK FOR A REPLACEMENT OF THE HOSE UNDER WARRANTY.  *TR",
        "vin": "1G6DP577770"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/10/2011",
        "dateOfIncident": "08/01/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10405855,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "2007 CADILLAC CTS:  BRAKES FAIL WHEN MAKING TURN AT SLOW SPEEDS, SUCH AS INTO DRIVEWAY, PARKING SPOT ETC, AND CAR CONTINUES TO MOVE FORWARD IN A SLIDE..  DEALER CLAIMS THERE ARE NO BRAKE PROBLEMS AND THAT THEY CAN'T REPLICATE PROBLEM.  AFTER SPEAKING WITH SEVERAL OTHER OWNERS WHO HAVE THE SAME PROBLEM, I \"GOOGLED\" THE ISSUE AND FOUND NUMEROUS COMPLAINTS REGARDING THE SAME SITUATION AND ALL INDICATING HE DEALERSHIPS WERE EITHER UNAWARE, UNWILLING OR UNABLE TO RESOLVE THE PROBLEM.  *TR",
        "vin": "1G6DM57TX70"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/30/2011",
        "dateOfIncident": "11/25/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10404711,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "EVERY TIME I TURN A HARD LEFT INTO A PARKING SPACE OR ANY HARD LEFT MY CAR LOOSES ITS BREAKS & MY SERVICE BRAKES ASSIST LIGHT GOES ON. I HAVE HAD MY CAR IN THE SHOP TWICE & THEY CANT SEEM TO FIGURE OUT WHAT IS CAUSING THE PROBLEM. IT IS A VERY DANGEROUS PROBLEM. IF ANYONE ELSE HAS HAD THIS SAME PROBLEM AND HAVE THE CAUSE FIGURED OUT PLEASE LET CADILLAC KNOW.",
        "vin": "1G6DM57T270"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/05/2011",
        "dateOfIncident": "01/20/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10394909,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "2007 CADILLAC CTS. CONSUMER WRITES IN REGARDS TO A DEFECTIVE AIRBAG SENSOR *TGW  THE PASSENGER SIDE AIR BAG OFF LIGHT ILLUMINATED WHEN THE SEAT WAS OCCUPIED. *JB",
        "vin": "1G6DP577470"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "03/19/2011",
        "dateOfIncident": "03/17/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10392233,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "CADILLAC CTS 2007 FAILS TO STOP WHEN TURNING TO THE RIGHT AT LOW SPEEDS AS WHEN PARKING, PROBLEM IS INTERMITTENT BUT OFTEN ENOUGH TO HAPPEN TWICE PER/WEEK. HIT ANOTHER VEHICLE WHILE PARKING. A PERSON HAD JUST CROSSED IN BETWEEN THE TWO CARS AND COULD HAD BEING CRUSHED. *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/11/2011",
        "dateOfIncident": "10/11/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10389841,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 CADILLAC CTS. WHILE THE VEHICLE WAS PARKED, THE AIR BAG LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN THE DEALER WHERE THE TECHNICIANS STATED THE VEHICLE WOULD NEED TO UNDERGO A DIAGNOSTIC TEST. THE MANUFACTURER STATED THAT THERE WAS A NHTSA RECALL CAMPAIGN NUMBER: 10V644000 (AIR BAGS:FRONTAL: SENSOR/CONTROL MODULE) BUT THE VIN WAS NOT INCLUDED. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 128,000.",
        "vin": "1G6DP577270"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/08/2011",
        "dateOfIncident": "09/08/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10386836,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. WHILE DRIVING APPROXIMATELY 50 MPH, THE FRONT SEAT PASSENGER AIRBAG WARNING INDICATOR ILLUMINATED WITH THE SEAT BEING OCCUPIED. THE WARNING INDICATOR REMAINED ILLUMINATED UNTIL THE ENGINE WAS TURNED OFF. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER FOR DIAGNOSIS AND THEY INFORMED THE CONTACT THAT THE FRONT PASSENGER SEAT SENSOR MAT WOULD NEED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE CONTACT DISCOVERED A RECALL ASSOCIATED WITH NHTSA CAMPAIGN ID NUMBER AIR 10V644000 (BAGS:FRONTAL:SENSOR/CONTROL MODULE) HOWEVER, THE VEHICLE WAS  NOT INCLUDED IN THE RECALL. THE FAILURE MILEAGE WAS A 59,000.      UPDATED 4/11/2011 *CN",
        "vin": "1G6DP577470"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/09/2011",
        "dateOfIncident": "12/20/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10381321,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONTAL PASSENGER SIDE AIRBAG WORKS THROUGH A SENSOR IN THE FRONT SEAT. IT SENSES WEIGHT APPLIED TO THE SEAT AND TURNS THE AIRBAG CAPABILITY ON FOR THE FRONTAL PASSENGER AIRBAG. MY AIRBAG LIGHT STAYS LIT ON THE DASH AND THE PASSENGER SIDE AIR BAG LIGHT ON THE REAR VIEW MIRROR DISPLAYS THAT THE AIRBAG IS OFF WHETHER OR NOT THE SEAT IS OCCUPIED. THE NHTSA HAS A CAMPAIGN ID # 10V644000 COVERING THIS SAME SCENARIO. WHEN CALLING THE CADILLAC DEALER FOR MY 2007 CADILLAC CTS, THEY HAVE NO INFORMATION FOR THE NHTSA CAMPAIGN NUMBER. I CALLED THE NHTSA HOTLINE WHERE I ACQUIRED THE GM RECALL NUMBER OF 100355. AFTER RETURNING MY CALL TO THE DEALER AND HAVE GIVEN THEM THE GM RECALL NUMBER , I AM TOLD THAT THIS RECALL DOES NOT APPLY TO MY CAR AND A $99.00 DIAGNOSTIC FEE WOULD APPLY. THE NHTSA SUMMARY CLEARLY OUTLINES MY PROBLEM, CONSEQUENCES AND THE SOPPOSED ACTIONS MY DEALER SHOULD TAKE TO REMEDY THE RECALL. HOW CAN I BE CERTAIN THE INFORMATION MY DEALER HAS GIVEN IS INDEED CORRECT? AT FIRST, THE SERVICE WRITER SEEMED CONFIDENT THAT THERE MAY BE A \"RECALL FIX\". AFTER MORE CONVERSATION IT SEEMED TO STRAY MORE TOWARDS A POSSIBLE CTS-V RECALL WHICH REPLACES A GLOVEBOX IN CASE THE AIRBAG FAILS, TO CAUSE LESS DAMAGE TO THE PASSENGER, IN CASE OF A FRONTAL COLLISON. I AM CONCERNED, NOT ONLY THAT THE PASSENGER AIRBAG MAY BE DISENGAGED, BUT THIS MAY AFFECT THE AIRBAG SYSTEM AS A WHOLE. ANY INFORMATION THAT CAN BE GIVEN ON THIS TOPIC WOULD BE APPRECIATED. *TR",
        "vin": "1G6DP577570"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/08/2011",
        "dateOfIncident": "11/20/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10381093,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. THE CONTACT STARTED THE VEHICLE AND THE FRONT PASSENGER SIDE AIR BAG LIGHT WAS ILLUMINATED AND REMAINED CONSTANTLY ILLUMINATED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND INFORMED THE CONTACT THAT THE VEHICLE WAS NOT INCLUDED IN THE RECALL ASSOCIATED WITH NHTSA CAMPAIGN ID NUMBER: 10V644000 (AIR BAGS:FRONTAL:SENSOR/CONTROL MODULE). THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 42,000 AND THE CURRENT MILEAGE WAS 42,400.    UPDATED 3/11/11 *CN  UPDATED 05/19/11",
        "vin": "1G6DP577170"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/08/2011",
        "dateOfIncident": "12/01/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10381164,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CADILLAC CTS. THE CONTACT STATED THAT SHE RECEIVED A RECALL NOTICE IN REGARDS TO NHTSA CAMPAIGN ID NUMBER: 10V105000 (SERVICE BRAKES, HYDRAULIC: FOUNDATION COMPONENTS: HOSES, LINES/PIPING, AND FITTINGS) AND THE VEHICLE WAS TAKEN TO THE DEALER FOR REPAIRS. THE DEALER ALSO INFORMED THE CONTACT THAT THE PRESENCE MODULE ON THE PASSENGER SEAT WAS DEFECTIVE. THE VEHICLE WAS NOT REPAIRED BECAUSE THE PART NEEDED WAS UNAVAILABLE. THE MANUFACTURER WAS ALSO CONTACTED BUT OFFERED NO FURTHER ASSISTANCE. THE FAILURE MILEAGE WAS APPROXIMATELY 29,800. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/31/2011",
        "dateOfIncident": "01/18/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10379637,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 CADILLAC CTS. THE CONTACT STATED THAT THE AIR BAG LIGHT REMAINED ILLUMINATED. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHO STATED THAT THE PASSENGER AIR BAG SENSOR WAS DEFECTIVE. THE CONTACT CALLED THE MANUFACTURER WHO OFFERED NO ASSISTANCE. THE VEHICLE HAD NOT BEEN REPAIRED. THE FAILURE MILEAGE WAS 40,000 AND THE CURRENT MILEAGE WAS 41,000.    UPDATED 03/16/11  *BF",
        "vin": "1G6DP577470"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/26/2011",
        "dateOfIncident": "07/01/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10378757,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 CADILLAC CTS. THE CONTACT STATED THAT WHILE DRIVING HE HEARD AN UNUSUAL NOISE. THE MANUFACTURER WAS CONTACTED AND REFERRED HIM TO THE DEALER. THE VEHICLE WAS TAKEN TO THE DEALER WHO STATED THAT THE BRAKE PADS WERE COMPLETELY WORN OUT, THE REAR ROTORS WERE DAMAGED BEYOND REPAIR AND THE VEHICLE HAD A FAULTY MASTER BRAKE CYLINDER. THE VEHICLE WAS REPAIRED. THE FAILURE MILEAGE WAS 28,350 AND THE CURRENT MILEAGE WAS 32,500.",
        "vin": "1G6DP577970"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/24/2010",
        "dateOfIncident": "10/23/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10362127,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "2007 CADILLAC CTS-43,000 MILES-DRIVING AT 50 MPH WHEN CAR DOWNSHIFTED TO SECOND GEAR AND WOULD NOT CHANGE BACK TO DRIVE UNTIL I SHIFTED TO NEUTRAL AND BACK TO DRIVE. HAD THIS HAPPENED AT 70 MPH OR HAD IT SHIFTED TO LOW GEAR IT COULD HAVE CAUSED A MAJOR ACCIDENT.(DID NOT PRESS .ON ACCELERATOR TO CAUSE THE CAR TO SHIFT INTO ANOTHER GEAR). *TR",
        "vin": "1G6DP577X70"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/03/2010",
        "dateOfIncident": "07/15/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10353660,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING NORMAL DRIVING EXPERIENCED HARD BRAKE PEDAL AND HEARD AIR LEAKING WITH APPROXIMATELY 90% BRAKE LOSS.   REMOVED BRAKE PRESSURE IMMEDIATELY AND REAPPLIED BRAKE PRESSURE RESULTING IN FULL NORMAL BRAKING.     HAPPENED APPROXIMATELY 5 - 6 TIMES WITHIN 6 WEEK PERIOD.      RETURNED TO AUTHORIZED CADILLAC REPAIR FACILITY FOR INSPECTION.  SERVICE MANAGER REPORTS FOUND NOTHING WRONG WITH BRAKE SYSTEM AND FAILED TO REPORT MY EXACT SYMPTOMS IN HIS SERVICE REPORT, JUST STATING BRAKE PADS ARE LOW.  *TR",
        "vin": "1G6DM57T970"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/21/2010",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10337009,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "2007 CADILLAC CTS. CONSUMER STATES PROBLEMS WITH BRAKES *TGW  THE CONSUMER STATED THE VEHICLE WAS ONLY 4 MONTHS OLD WHEN THE BRAKES FAILED TO RESPOND AND THE CONSUMERS SON CRASHED INTO A CONCRETE WALL. THREE YEARS LATER, THE CONSUMER RECEIVED A RECALL IN THE MAIL REGARDING THE BRAKES. ALSO, THE AIR BAGS FAILED TO DEPLOY. RECALL 10V105000.*JB",
        "vin": "1G6DP577570"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/21/2010",
        "dateOfIncident": "03/20/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10331665,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A USED 2007 CADILLAC CTS IN NOVEMBER 2009.  FROM THAT TIME, IT ALWAYS HESITATES WITH THE FIRST FORWARD ACCELERATION OF THE MORNING, AND THEN HAS A FORCEFUL ACCELERATION AS IT OVERCOMES THE HESITATION/ALMOST STALLING, AND THEN DRIVES NORMALLY.  AS THIS WAS A NEW CAR FOR ME, I THOUGHT THAT MAYBE THE CAR NEEDED TO WARM UP DUE TO THE COLD WEATHER OVER WINTER.  ONCE THE TEMPERATURES INCREASED, THE CAR CONTINUED TO EXPERIENCE THE PROBLEM - DAILY.  THE CAR IS AT THE DEALER AGAIN - 5TH VISIT SINCE MARCH 2010.  THE FIRST VISIT THEY FOUND NOTHING, THE SECOND VISIT FOUND A WORN TIMING BELT, THIRD VISIT FOUND NOTHING, FOURTH VISIT TOOK 5 DAYS AND FOUND CONNECTIVITY ERRORS WITH THE DRIVE-WIRE SYSTEM.  THERE WAS AN ERRATIC SIGNAL FROM TAC MODULE; REPLACED TERMINALS CIRCUIT # 581 & #582 (THROTTLE ACTUATOR). THE REPAIRS DID NOT FIX THE ISSUE AND I TOOK THE CAR BACK AFTER 3 DAYS FOR THE 5TH VISIT.  THE DEALER HAS INDICATED THAT THEY HAVE REPLICATED THE PROBLEM, BUT DO NOT KNOW HOW TO SOLVE IT.  THIS COMPLAINT HAS BEEN ESCALATED UP TO THE DISTRICT-LEVEL SUPPORT AND I AM NOW WAITING FOR GM TO SEND AN ENGINEER TO THE DEALERSHIP TO TRY TO FIGURE OUT HOW TO SOLVE THE PROBLEM.  IT IS FRIGHTENING TO DRIVE A CAR THAT REPEATEDLY WANTS TO STALL AND THEN OVER-ACCELERATES TO OVERCOME THE PROBLEM CAUSING THE HESITATION.  IT IS ALSO FRIGHTENING THAT IT IS TAKING 5 VISITS FOR THE DEALER TO RECOGNIZE THE SERIOUS NATURE OF THIS PROBLEM, WITH NO SOLUTION IN SIGHT.  IT IS UNSAFE TO DRIVE A CAR THAT RANDOMLY TRIES TO STALL, AND THEN OVERCOMPENSATES BY A STRONG/FORCEFUL ACCELERATION. *TR",
        "vin": "1G6DM57T570"
    },
    {
        "components": "SERVICE BRAKES, ELECTRIC",
        "crash": true,
        "dateComplaintFiled": "03/31/2010",
        "dateOfIncident": "03/30/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10323020,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "CARS BRAKES FAILED TO STOP THE VEHICLE AT SLOW SPEED WHILE PARKING.  THE ANTILOCK BRAKES SUDDENLTY PULSATED AT ABOUT 3-4 MILES PER HOUR ON DRY PAVEMENT.  TTHE CAR ROLLED FREELY INTO THE CAR IN FRONT OF IT WITH BRAKE PEDAL COMPLETELY DEPRESSED.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "02/18/2010",
        "dateOfIncident": "01/16/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10311683,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 CADILLAC CTS. THE CONTACT STATED THAT HE HAS A DEFECTIVE TIE ROD WHICH BROKE WHILE DRIVING 10 TO 15 MPH. AS THE TIE ROD BROKE, HIS RIGHT FRONT TIRE HIT A PARKED VEHICLE. NO ONE WAS INJURED. A POLICE REPORT IF NEEDED. THE VEHICLE WAS TOWED TO THE DEALER AND REPAIRED. THE GM MANUFACTURE WAS CALL AND STATED THE INSURANCE COMPANY SHOULD PAID FOR THE FAILURE AND DAMAGES ON THE VEHICLE. THE CONTACT WANTS THE MANUFACTURE TO PAY FOR HIS INSURANCE PREMIUM. THE NORMAL MAINTENANCE WAS PERFORMED ON THE VEHICLE PRIOR TO THE FAILURE. THE FAILURE MILEAGE WAS 15,000. UPDATED 04/16/10. *LJ  UPDATED 09/16/10*JB",
        "vin": "1G6DM57T770"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/06/2010",
        "dateOfIncident": "02/15/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10307063,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "2007 CADILLAC CTS, WHEN BRAKES IS DEPRESSED BRAKES BECOMES HARD AND CAR DOES NOT STOP, THIS OCCURS QUITE OFTEN ONCE EVERY 2 WEEKS, I HAVE TAKEN THE CAR TO THE DEALER TWICE, AND BOTH TIME THEY TOLD ME THAT THEY COULD NOT FIND ANY PROBLEMS  *CN",
        "vin": "1G6DP577270"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/10/2009",
        "dateOfIncident": "07/11/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10291765,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES AND ROTORS AT 30655 NOW AT 52345 BRAKES AND ROTORS HAVE TO BE REPLACED AGAIN. *TR      REPLACED",
        "vin": "1G6DP577570"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/14/2009",
        "dateOfIncident": "05/14/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10268733,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 CADILLAC CTS.  WHILE DRIVING 1 MPH, THE BALL JOINT FRACTURED AND CAUSED THE FRONT DRIVER'S SIDE OF THE VEHICLE TO COLLAPSE.  THE VEHICLE WAS TOWED TO THE DEALER AND IS CURRENTLY BEING REPAIRED.  THE FAILURE AND CURRENT MILEAGES WERE 30,160.",
        "vin": "1G6DN57U470"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/12/2009",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10262310,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "2007 CADILLAC CTS HAS ISSUES WITH THE CLUTCH AND FLYWHEEL.  CONSUMER STATES THAT GM INDICATED THAT THE CLUTCH, FLYWHEEL AND ACTUATOR BURNT OUT DUE TO DRIVER WEAR AND TEAR.   *NJ  (LAWYER WROTE IN ON BEHALF OF HIS CLIENT)*JB",
        "vin": "1G6DP577370"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/11/2009",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10262288,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "2007 CADILLAC CTS HAVE A BAD BRAKE SYSTEM.  CONSUMER STATES THAT THE PADS AND ROTORS ARE RUSTED WITH ONLY 27K MILES.  *NJ  THE PADS AND ROTORS HAD COMPLETELY RUSTED. *JB",
        "vin": "1G6DP577370"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/10/2009",
        "dateOfIncident": "12/09/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10261462,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 CADILLAC CTS.  THE CONTACT STATED THAT THE BRAKES ON HIS VEHICLE WORKED INTERMITTENTLY.  THE BRAKE PEDAL EXTENDS TO THE FLOOR AND THE VEHICLE HAS DIFFICULTY STOPPING.  THE FAILURE OCCURS MOST FREQUENTLY WHEN MAKING LEFT TURNS.  THE VEHICLE WAS TAKEN TO THE DEALER AT LEAST FIVE TIMES AND THEY INSTALLED NEW BRAKES AND MADE OTHER REPAIRS, BUT THE FAILURE PERSISTS.  THE CONTACT HAS PAID FOR SOME OF THE REPAIRS.  THE VEHICLE HAS BEEN AT THE DEALER FOR THE PAST FIVE DAYS TO DIAGNOSE THE FAILURE.  THE FAILURE MILEAGE WAS 34,000.    UPDATED 3/25/09 *CN  UPADTED 03/25/09.*JB",
        "vin": "1G6DP577870"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/03/2009",
        "dateOfIncident": "08/17/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10253668,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER (RAIN AND WASHING) GET INSIDE ON THE DOOR WELLS (I THINK THAT'S WHAT YOU CALL THEM) AND THE PART OF THE DOOR WHERE THE LATCH IS.  I NOTICED THE FIRST TIME I WASHED THE CAR IN 8/07.  THE AUTOBODY SHOP COULDN'T SAY WHY AND THE DEALERSHIP REALLY DIDN'T INVESTIGATE IT.  ALSO THE REAR DRIVER'S SIDE DOOR LATCH/LOCK WILL FREEZE AND DOOR WILL SWING OPEN!!  I HAVE SINCE LEARNED NOT TO USE THIS DOOR WHEN ITS BELOW 32 DEGREES.  AFTER RAINING AND THE CAR HAS BEEN SITTING, THE BRAKES SQUEAK. ALSO HAVE A NOISE IN FRONT WHEN TURNING. *TR",
        "vin": "1G6DP577170"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,VISIBILITY,STRUCTURE,SEATS,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "11/06/2008",
        "dateOfIncident": "03/18/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10247866,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY 07 CTS NEW OCT. 2007 (MY SEX IS FEMALE). MY CAR HAS BEEN IN & OUT OF THE DEALERS SHOP NUMEROUS TIMES.  SOME OF MY PROBLEMS REAR END SLIP GROWL, TRUNK OPENS, 3 WATER LEAKS, MESSAGE LIGHTS ENGAGING, DRIVER SEATS MALFUNCTIONS, BRAKES, SERVICE LIGHTS, RUST, FRONT NOISE, WINDOW, DOOR HANDLES, A/C & 2 RECALLS.  SOME OF MY CONCERNS GET ADDRESSES ALOT THEY SAY THEY CAN'T DUPLICATE.  MY CAR LOST FULL POWER FOR A SHORT TIME IN OCT. OF 2008.  I  LOST MY LEMON LAW CASE THROUGH THE BBB IN SEP. 2008.  I DID GET A INVOICE FROM MY DEALERSHIP ON ERROR WHILE PREPARING FOR MY LEMON LAW CASE.  MY CAR WAS IN THE DEALERS SHOP FOR SIX DAYS PAINTING THE DECK LID BEFORE I EVEN BOUGHT MY CAR (I WAS NEVER TOLD ABOUT THIS).  DEALER CLAIMS NOTHING MAJOR JUST MINOR. NOW IN OCT. OF 2008 I'VE LEARNED SOMETHING MORE HAS HAPPENED TO MY CAR BEFORE I BOUGHT IT.  I'VE DISCOVERED MY CAR HAS WELD MARKS ON THE INSIDE TRUNK AREA?  THE DEALERSHIP OWNER SAYS NO WAY THAT HAPPENED ON HIS LOT THAT MY CAR CAME FROM THE MANUFACTURER LIKE THAT.  THE DEALERSHIP OWNER CAN'T EXPLAIN THE WELD MARKS ON MY CAR. AGAIN I BOUGHT THIS CAR BRAND NEW. I'VE BEEN THROUGH LOTS OF TEARS WITH THE PERFORMANCE OF MY CAR & NOW IT'S BEEN DAMAGED TOO.  MY CAR STILL HAS PERFORMANCE PROBLEMS TO THIS DAY. I'VE EVEN LEARNED THAT A COUPLE OF MY ACCESSORIES THAT I PAID LOTS OF $$$$ FOR THE DEALERSHIP TO INSTALL WHERE DONE POORLY.   *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/03/2008",
        "dateOfIncident": "07/07/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10247578,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 CADILLAC CTS.  IN FEB OF 2008, THE VEHICLE WAS TAKEN TO THE DEALER FOR NHTSA CAMPAIGN ID NUMBER 07V58900 (POWER TRAIN:AXLE ASSEMBLY:AXLE SHAFT:SEAL); HOWEVER, THE VEHICLE WAS NOT REPAIRED CORRECTLY.  THE TRANSMISSION MODULE WAS RECENTLY REPLACED AND THE MANUAL GEAR FAILED.  RECENTLY, THE REAR ROTORS FAILED.  A COMPLAINT WAS FILED WITH THE MANUFACTURER AND THEY STATED THAT THEY WOULD NOT ASSIST WITH THE REPAIRS BECAUSE THE VEHICLE WAS OVER 30,000 MILES.  IN ADDITION, THE WARRANTY WAS EXPIRED.  THE FAILURE MILEAGE WAS 15,000 AND CURRENT MILEAGE WAS 38,000.  UPDATED 12/02/08.  *LJ  UPDATED 12/03/08. *JB",
        "vin": "1G6DP577970"
    },
    {
        "components": "POWER TRAIN,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/27/2008",
        "dateOfIncident": "08/12/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10239917,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 CADILLAC CTS.  WHILE DRIVING LESS THAN 60 MPH IN RAINY WEATHER, THE TRACTION LIGHT SUDDENLY ILLUMINATED.  WHEN THE BRAKES WERE APPLIED, THE VEHICLE SLID EVERYWHERE.  THE REAR OR FRONT OF THE VEHICLE STRUCK A NORTH AND SOUTH DIVIDER.  NONE OF THE AIR BAGS DEPLOYED.  A WEEK AND A HALF LATER, THE CONTACT RECEIVED A SAFETY RECALL NOTICE FOR NHTSA CAMPAIGN ID NUMBER 07V589000 (POWER TRAIN:AXLE ASSEMBLY:AXLE SHAFT:SEAL), WHICH SHE BELIEVES TO BE THE CAUSE OF THE FAILURE.  THE CURRENT AND FAILURE MILEAGES WERE UNAVAILABLE.",
        "vin": "1G6DM57T970"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "08/25/2008",
        "dateOfIncident": "08/12/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10239643,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 CADILLAC CTS.  WHILE DRIVING 50 MPH IN THE RAIN, THE CONTACT DEPRESSED THE BRAKE PEDAL AND THE VEHICLE SPUN OUT.  THE VEHICLE CRASHED INTO THE BARRIER IN THE MIDDLE OF THE ROAD.  THERE WERE NO INJURIES.  THE VEHICLE WAS DESTROYED AND HAD TO BE TOWED FROM THE SCENE.  A POLICE REPORT WAS FILED.  THE VEHICLE WAS PURCHASED FROM THE DEALER IN JUNE OF 2008 AND THEY WERE AWARE OF NHTSA CAMPAIGN ID NUMBER 07V589000 (POWER TRAIN:AXLE ASSEMBLY:AXLE SHAFT:SEAL), BUT NEVER INFORMED THE CONTACT.  SHE RECEIVED A RECALL NOTICE AFTER THE CRASH OCCURRED.  THE FAILURE MILEAGE WAS 33,200.",
        "vin": "1G6DM57T970"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "08/01/2008",
        "dateOfIncident": "07/26/2008",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10236616,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 CADILLAC CTS.  WHEN THE VEHICLE WAS FIRST PURCHASED, THE CONTACT NOTICED THAT IT WOULD SHAKE WHEN STARTING.  IN ADDITION, THE RADIO AND CRUISE CONTROL FAILED.  THE DEALER STATED THAT THERE WERE NO FAILURES WITH THE VEHICLE.  WHILE DRIVING 10-15 MPH INTO A PARKING LOT, THE CONTACT NOTICED BLACK SMOKE UNDER THE HOOD OF THE VEHICLE.  SHE PULLED OVER, RAISED THE HOOD, AND FLAMES ENGULFED THE VEHICLE.  THE POLICE CONTAINED THE FIRE AND FILED A REPORT.  THE FAILURE AND CURRENT MILEAGES WERE 27,800.",
        "vin": "1G6DM57T370"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/14/2008",
        "dateOfIncident": "06/17/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10234185,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 CADILLAC CTS.  WHILE DRIVING APPROXIMATELY 25 MPH, THE CONTACT DEPRESSED THE ANTILOCK BRAKE PEDAL, BUT THE VEHICLE FAILED TO SLOW DOWN AFTER A COUPLE OF ATTEMPTS.  THERE WAS NO WARNING LIGHT ILLUMINATED ON THE INSTRUMENT PANEL.  THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER; HOWEVER, THEY COULD NOT DETERMINE THE CAUSE OF THE FAILURE.  THE FAILURE HAS RECENTLY RECURRED.  THE VEHICLE WILL BE TAKEN TO THE AUTHORIZED DEALER FOR REPAIR.  THE FAILURE MILEAGE WAS 5630 AND CURRENT MILEAGE WAS 5727.      UPDATED 09/10/08  *BF  UPDATED 09/11/08.*JB",
        "vin": "1G6DP577670"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,POWER TRAIN,ELECTRICAL SYSTEM,STRUCTURE,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/16/2008",
        "dateOfIncident": "06/11/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10231118,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MILEAGE: 4,833  I HAD BEEN WAITING IN LINE AT A CARWASH, AND WHEN IT WAS MY TURN TO ENTER, I BEGAN TO SLOWLY MOVE FORWARD.  AS I WAS INCHING FORWARD, MY CAR BEGAN TO MOVE FASTER THAN IT SHOULD.  I APPLIED THE BRAKE, BUT I DID NOT HAVE ANY AND MY STEERING WAS LOCKED.  IT FELT LIKE MY CAR STALLED, BUT AT THE SAME TIME, IT KEPT MOVING FORWARD.  FORTUNATELY, I WAS ABLE TO ENGAGE MY EMERGENCY BRAKE TO PREVENT ME FROM CRASHING.  THIS IS THE 2ND TIME THIS HAS HAPPENED.  THE FIRST TIME WAS IN AUGUST OF '07.  THAT TIME, I WAS PARKED AT THE TOP OF MY SLOPED DRIVEWAY.  THE CAR LURCHED FORWARD AND I HAD NO BRAKES OR STEERING AND MY CAR ROLLED DOWN THE HILL AND INTO A BRICK WALL.  I ENDED UP IN THE ER WITH A NECK INJURY. THE DEALERSHIP FOUND NOTHING.  MY CAR HAS BEEN IN AND OUT OF THE DEALERSHIP FOR VARIOUS PROBLEMS TIED TO THE ELECTRICAL SYSTEM OF THE CAR. (EX.  THE TRACTION CONTROL WOULD ENGAGE INAPPROPRIATELY OR WOULD STOP ME DEAD IN THE MIDDLE OF THE ROAD, THE TRUNK CAME OPEN WHILE I WAS DRIVING, IT WOULD HAVE PICKUP HESITATION, IT WOULD ALSO FEEL AS IF IT WERE ACCELERATING ITSELF WHILE I WAS DRIVING, MY OIL LIFE READING WAS OFF BY 38%, CAR HAD TO BE REPROGRAMMED BECAUSE THE POWER TRAIN SYSTEM DETECTED A MALFUNCTION IN THE ENGINE CONTROL SYSTEM, THE GAS GAUGE AND LOW FUEL WARNING LIGHTS ARE NOT PERFORMING ACCURATELY.)   AS OF TODAY, MY CAR HAS BEEN IN THE SHOP FOR 17 DAYS AS THEY CONTINUE TO ATTEMPT TO FIX MY PROBLEMS.  IF YOU FACTOR IN THE TIME IT WAS IN THEIR AFTER MY ACCIDENT DUE TO THE MALFUNCTION OF THE CAR, IT HAS BEEN OVER 77 DAYS IN THE PAST 10 MONTHS.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/15/2008",
        "dateOfIncident": "05/27/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10231070,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS LETTER IS PLEADING TO BE RELEASED FROM LEASE AGREEMENT AND REFUNDED THE MONEY INVESTED IN MY CAR. I?M NO LONGER HAPPY WITH THE QUALITY OF THE CADILLAC CTS AND THE NUMBER OF RECALLS ASSOCIATED WITH THESE VEHICLES. IN ESSENCE, I HAVE BEEN LEASED TWO NEW VEHICLES THAT WERE LEMONS ACCORDING TO LEMON LAWS IN THE STATE OF VIRGINIA. I HAVE HAD  THE SAME SAFETY PROBLEM REPAIRED MORE THAN THREE TIMES WITH BOTH CARS.  AT THIS POINT, I AM TRULY NERVOUS TO DRIVE MY CAR, MORE SO AFTER READING THE MANY REPORTS OF PEOPLE EXPERIENCING CAR FIRES, SUDDENLY LOSING CONTROL OF THEIR CAR ON THE HIGHWAY, AND GEARS LOCKING UP.  MOST IMPORTANTLY, THE CAR IS NOT SAFE AND I?M SCARED TO CONTINUE TO SUBJECT MYSELF AND YOUNG CHILDREN TO POSSIBLE INJURIES BECAUSE OF THE POWER DRAIN SAFETY PROBLEMS I?VE EXPERIENCED BEFORE AND AFTER THE RECALL.    TO DATE, MY 2007 CTS HAS BEEN REPAIRED 4 TIMES FOR THE AXLE/DIFFERENTIAL. I?M NOT AN EXPERT BUT IN MY FINDINGS, THE POWER TRAIN DEALS WITH DIFFERENTIAL UNIT, AXLE ASSEMBLY, SHAFT SEAL LEAK, AND THE AUTOMATIC TRANSMISSION. LUCKILY, THESE REPAIRS WERE COVERED UNDER THE WARRANTY. HOWEVER, THE SERVICE DEPARTMENT IS JUST APPLYING A BAND AID TO THE SITUATION. I?M CONCERNED ABOUT WHAT MIGHT HAPPEN NEXT TIME AND WHO WILL BE RESPONSIBLE FOR FUTURE EXPENSES WHEN THE WARRANTY EXPIRES.    AS A RESULT OF ALL THIS, I WOULD LIKE TO BE RELEASED FROM THE REMAINDER OF MY LEASE AGREEMENT AND REFUNDED THE PAYMENTS MADE TO GMAC DUE TO THE LEMON LAW.      I HAVE NEVER BEEN LATE ON MAKING PAYMENTS ON MY CARS. AS OF JUNE 2008, I HAVE PAID $14,187.80 TOWARDS MY 2007 CTS AND LOOK FORWARD TO BEING COMPENSATED FOR A CAR NOT MECHANICALLY SUITABLE TO DRIVE.    YOUR RESPONSE WILL BE GREATLY APPRECIATED. SHOULD YOU NEED ADDITIONAL INFORMATION, I CAN BE REACHED AT 301-332-4329. THANKS IN ADVANCE FOR TIME AND ATTENTION ON THIS MATTER.    RESPECTFULLY,  LAJUAN HOWARD  *TR",
        "vin": "1G6DP577970"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/30/2008",
        "dateOfIncident": "02/19/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10229303,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "FEBRUARY 2008,. RECEIVED RECALL LETTER FOR NEW CADILLAC 2007. APPOINTMENT WAS MADE AND PROBLEM HAS NOT BEEN CORRECTED - END OF FEBRUARY 2008. CAR STILL LEAKS FROM ENGINE AND LEAVES RESIDUE IN DRIVEWAY WHERE PARKED.  CONTACTED DEALERSHIP AND THEY ARE NOT INTERESTED IN REPAIRING. CADILLAC CUSTOMER SERVICE MADE ANOTHER APPOINTMENT FOR DIAGNOSTIC FOR MAY 2008. CAR STILL NOT CORRECTED. FEEL THE CAR SHOULD BE REPLACED. BOUGHT BRAND NEW - AM 80 YEARS OLD AND NEED VEHICLE THAT IS SAFE AND SECURE. MAIN REASON FOR PURCHASE. I CANNOT CONTINUE TO TAKE CAR BACK AND FORTH TO DEALERSHIP AND PROBLEM NOT CORRECTED. FEEL IT IS A TACTIC AND CAR SHOULD BE REPLACED. THE RECALL  DRIVE AXLE DIFFERENTIAL SEAL - BEARINGS AND OTHER COMPONENTS INCLUDING DRIVE WHEELS, BRAKES, ENGINE, ETC.....  *TR",
        "vin": "1G6DM57T370"
    },
    {
        "components": "STEERING,SUSPENSION,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "05/18/2008",
        "dateOfIncident": "05/17/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10228123,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            },
            {
                "manufacturer": "AXLE & EQUIP. SALES CO.",
                "productMake": "AXLE EQUIPMENT",
                "productModel": "AXLE EQUIPMENT",
                "productYear": "1975",
                "type": "Equipment"
            }
        ],
        "summary": "CONTROL OF VEHICLE AND HANDLING DIFFICULT.  *TR",
        "vin": "1G6DP577370"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/02/2008",
        "dateOfIncident": "03/06/2008",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10226505,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "07 CADILLAC CTS WAS DRIVEN AND PARKED. I MINUTE LATER IT WAS ON FIRE, STARTED ON TOP OF TRANSMISSION IN INTERIOR. EXTINGUISHED IN ANOTHER 2 MINUTES BUT DAMAGE EXCEEDED $20,000. GM PRODUCT LIABILITY AND ESIS DRAGGING FEET ON WARRANTY CLAIM OR RELIEF FOR > 2 MONTHS, INSURANCE SAYS CIGARETTE (DON'T SMOKE) DEALER WONT DO ANYTHING FOR FIRE EVENT.  CAUSE IS DEFECTIVE CATALYTIC CNVTR/TRANSMISSION BUT NO HELP FROM GM, DEALER, WARRANTY, I'VE OFFERED PHOTOS FIRE REPORT, ETC. INSURANCE WANTS TO SETTLE QUICK AND SALVAGE. I NEED TO KEEP FOR GM EVALUATION FOR SAFETY DEFECT-THEY AREN'T VERY INTERESTED OR HELPFUL. NO CAR, NO WARRANTY RELIEF BUT LUCKILY NO INJURY. CAN GM BE PRESSED TO RESOLVE LIABILITY TO THE OWNER IN A TIMELY MANNER?, DO THEY EVEN CARE IF I IGNORE INSURANCE PRESSURE TO KEEP CAR AVAILABLE TO GM INSPECT FOR ROOT CAUSE?  THANK YOU  *TR",
        "vin": "1G6DP577870"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "04/18/2008",
        "dateOfIncident": "08/14/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10224908,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "ABSOLUTE HORRIBLE NOISE FROM WINDSHIELD.  GM HAS \"DENIED THE PROBLEM ON OTHER VEHICLE EVEN EXISTS\" AND INSISTS THAT THERE IS NO DEFECT.  BS.  I AM RESEARCHING A CLASS ACTION LAWSUIT AGAINST GM FOR ALL THESE CTS COMPLAINTS, RECALLS, AND DEFECTS ON THE 07 CTSS THAT ARE BEING NEGLECTED BY THE COMPANY!  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "04/10/2008",
        "dateOfIncident": "02/01/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10224068,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            },
            {
                "manufacturer": "DRIVE-MASTER",
                "productMake": "DRIVE-MASTER",
                "productModel": "ULTRA-LITE XL",
                "productYear": "1996",
                "type": "Equipment"
            }
        ],
        "summary": "I RECEIVED A RECALL ON MY 2007 CADILLAC CTS RECALL # 07204 IN FEBRUARY 2008.  I CALLED THE DEALER AND THEY DON'T HAVE PARTS TO FIX THE RECALL.  IT HAS NOW BEEN 2 MONTHS.  HELP.  *TR",
        "vin": "1G6DP577270"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/02/2008",
        "dateOfIncident": "04/02/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10223147,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 CADILLAC CTS.  THE CONTACT RECEIVED A SAFETY RECALL NOTICE FOR NHTSA CAMPAIGN ID NUMBER 07V589000 (POWER TRAIN:AXLE ASSEMBLY:AXLE SHAFT:SEAL) IN FEBRUARY OF 2008.  HE HAS CALLED THE DEALER MORE THAN TWICE CONCERNING THE AVAILABILITY OF THE PARTS FOR THE RECALL REPAIR.  HE MOST RECENTLY CALLED THE DEALER ON APRIL 2, 2008 AND WAS INFORMED THAT THE PART WOULD NOT BE AVAILABLE FOR AT LEAST TWO MORE MONTHS.  THERE HAD BEEN NO FAILURE TO DATE.  THE PURCHASE DATE WAS UNKNOWN.  THE CURRENT MILEAGE WAS 10,000.",
        "vin": "1G6DP577070"
    },
    {
        "components": "SUSPENSION,TIRES",
        "crash": false,
        "dateComplaintFiled": "03/31/2008",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10222856,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "2007 CADILLAC CTS WITH TIRE PROBLEMS. CONSUMER STATES THAT THE TIRES WORE OUT AT 9,000 MILES. DEALER DID AN ALIGNMENT THEN THE VEHICLE EXPERIENCED A LOT OF NOISE. MICHELIN DEALER FOUND THAT THE TIRES WERE OUT OF ALIGNMENT.  *KB  THE CONSUMER STATED THE VEHICLE HAD A DIFFERENT SIZE TIRE, OTHER THAN WHAT WAS SPECIFIED FOR THE VEHICLE. ACCORDING TO THE DOOR STICKER THE VEHICLE SHOULD HAVE HAD 16 INCH TIRES, HOWEVER THE VEHICLE HAD 18 INCH TIRES. THE MECHANIC STATED THE TIRES WERE CHOPPED.*JB",
        "vin": "1G6DP577370"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/28/2008",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10222848,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "2007 CADILLAC CTS WITH SEVERAL BRAKE PROBLEMS. CONSUMER STATES HE HAS EXPERIENCED PARTIAL BRAKE FAILURE THREE TIMES. HE STATES THAT MECHANIC STATED THEY COULDN'T FIND A PROBLEM. BRAKE PROBLEMS CONTINUE.  *KB  ONE OF THE THREE TIMES, THE DRIVER INFORMATION CENTER FLASHED AND STATED THERE WAS A BRAKE PROBLEM.  WHEN THE CONSUMER APPLIED THE BRAKE, THE STOPPING DISTANCE WAS MUCH GREATER THAN NORMAL. *JB",
        "vin": "1G6DM57T570"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/25/2008",
        "dateOfIncident": "03/25/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10222272,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "CAN NOT GET LOCAL DEALERSHIP TO PERFORM RECALL WORK ON VEHICLE. I HAVE ALSO CONTACTED GM AND THEY MERELY REITERATED WHAT THE DEALER SAYS. \"NO SEALS\". THEY ARE SAYING REAR SEALS FOR 2007 CADILLAC CTS ARE ON BACK ORDER AND THEY DO NOT KNOW WHEN THEY WILL GET MORE. MEANWHILE VEHICLE SOUNDS LIKE YOU ARE RUNNING OVER SOMEONE WHEN YOU PUT IT IN REVERSE AND PROCEED TO BACK UP. MEANWHILE I AM DRIVING AN UNSAFE VEHICLE. I AM AFRAID TO DRIVE MY VEHICLE.  *TR",
        "vin": "1G6DP577870"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/24/2008",
        "dateOfIncident": "03/24/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10222157,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS COMPLAINT IS TO ENSURE THAT ALL OF THE FOLLOWING CADILLAC MODES HAVE BEEN REMOVED, RECALLED, REPAIRED FROM THE NEW/USED AUTOMOTIVE DEALERSHIPS, AUTO AUCTIONS, ETC.  2007 CADILLAC CTS, STS, SRX.  *TR",
        "vin": ""
    },
    {
        "components": "STRUCTURE,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "03/13/2008",
        "dateOfIncident": "12/28/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10221058,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DISPLAY ON THE RADIO WILL ONLY SHOW ONE WORD OF THE ARTIST OR SONG.  THE DEALERSHIP SAID THAT THIS WAS A FLAW OF THE 2007 CTS RADIO AND THERE WAS NOTHING THAT COULD BE DONE.  I CONTACTED CADILLAC AND THE RESTATED WHAT THE DEALERSHIP SAID AND BASED HER CONCLUSION ON THE DEALERSHIPS TESTING ON ONE OTHER 07 CTS.  THIS IS DISAPPOINTING SINCE I PAID AN EXTRA $1,500.00 FOR THE BOSE SYSTEM.  *TR",
        "vin": "1G6DP577970"
    },
    {
        "components": "SUSPENSION,AIR BAGS,WHEELS",
        "crash": true,
        "dateComplaintFiled": "02/22/2008",
        "dateOfIncident": "02/10/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10218868,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 CADILLAC CTS.  WHILE DRIVING APPROXIMATELY 15 MPH, THE WHEELS LOCKED CAUSING THE VEHICLE TO SPIN COMPLETELY AROUND AND STRIKE A CURB ON THE REAR DRIVER SIDE.  NONE OF THE AIR BAGS DEPLOYED.  THE VEHICLE WAS TOWED TO THE DEALER AND THEY STATED THAT THE REAR DRIVER SIDE WHEEL WAS BENT INWARDS.  THEY FURTHER STATED THAT THE SUSPENSION SYSTEM AND WHEELS NEEDED TO BE REPLACED AT THE COST OF $3,000.  TWO DAYS LATER, THE CONTACT RECEIVED A RECALL NOTICE FOR NHTSA CAMPAIGN ID NUMBER 07V589000 (SUSPENSION:REAR:AXLE:SPINDLE).  THE DEALER STATED THAT THEY WOULD REPAIR THE VEHICLE ACCORDING TO THE REMEDY IN THE NOTICE, BUT WOULD NOT ASSUME LIABILITY FOR ANY OTHER RELATED DAMAGES.  THE MANUFACTURER HAS NOT PROVIDED ANY ASSISTANCE.  SINCE THE FAILURE, THE DEALER HAS TAKEN POSSESSION OF THE VEHICLE.  THE CONTACT HAS PICTURES.  THE FAILURE AND CURRENT MILEAGES WERE 17,000.",
        "vin": "1G6DM57T170"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/18/2008",
        "dateOfIncident": "12/22/2007",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10215403,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE VEHICLE WAS UNDER POWER SMOKE THEN FIRE WAS OBSERVED COMING FROM THE ENGINE COMPARTMENT.  VEHICLE WAS PULLED TO THE ROADSIDE.  FIRE INTENSIFIED BURNING A HOLE THROUGH THE HOOD ABOVE THE MASTER CYLINDER.  *TR",
        "vin": "1G6DM57T070"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "01/08/2008",
        "dateOfIncident": "08/14/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10214172,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WIND NOISE AROUND WINDSHIELD.  COMPLAINT TO DEALERSHIP 3 DAYS AFTER PURCHASE 8/14/07. NOW 1/8/08 DEALERSHIP SAYS CANNOT BE FIXED.  UNBEARABLE WIND NOISE THAT IS VERY DISTRACTING TO DRIVER AND PASSENGERS.  MUSIC MUST BE TURNED UP SO LOUD TO COVER UP THE SOUND OF WINDOWS CRACKED.  THE HIGHER MPH, THE LOUDER THE SOUND.  THIS IS VERY DANGEROUS AND FRUSTRATING FOR THE DRIVER!  *TR",
        "vin": "1G6DM57TX70"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/08/2008",
        "dateOfIncident": "01/04/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10214174,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "CADILLAC CTS 2007  REAR DIFFERENTIAL BROKE  WAS DRIVING ON THE HIGH WAY AND SUDDENLY LOST CONTROL OF THE CAR.  THE BACK WHEELS LOCKED COMPLETELY.  NO APPARENT TRIGGER.  PUT ON BRAKES (I WAS SCARED I WAS CLOSE TO THE EDGE OF THE OVERPASS), SHUT OFF THE CAR AND THE SMOKE DISSIPATED.  NO WARNING AT ALL; NO OTHER DAMAGE BUT QUITE TERRIFYING.  CADILLAC WAS EXTREMELY RESPONSIVE AND HAS REPLACED THE REAR DIFFERENTIAL.  *TR",
        "vin": ""
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "12/28/2007",
        "dateOfIncident": "06/01/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10213065,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT PASSENGER SEAT BELT.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/30/2007",
        "dateOfIncident": "11/25/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10210373,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING APPROXIMATELY 65 MPH ON I64 IN VIRGINIA WHEN GEARS LOCKED UP AND LOST ALL ACCELERATION. PULLED OFF TO THE SIDE AND COULD SMELL A BURNING SENSATION, CAR THEN WOULD NOT MOVE. BACK WHEELS LOCKED UP AND WHEN CAR ATTEMPTED TO BE MOVED FOR A TOW, ENTIRE BACK END RATTLED AND GRINDED. TOOK VEHICLE TO THE DEALER AS IT IS STILL UNDER WARRANTY AND HAS ONLY 15K MILES, DEALER REPORTED THAT IT WAS AN \"EXPLODED REAR DIFFERENTIAL.\" ALL PARTS WERE REPLACED BY DEALER, WHO REMARKED THEY HAD REPLACED MANY REAR DIFFERENTIALS IN THE PAST YET HAS NEVER SEEN ONE EXPLODE LIKE THAT BEFORE. LUCKILY, DRIVER REMAINED IN CONTROL OF CAR AND PULLED OVER AT THE VERY INSTANT THERE WAS A PROBLEM OTHERWISE THIS COULD HAVE RESULTED IN A CATASTROPHIC LOSS WHILE TRAVELING AT A HIGH SPEED ON THE INTERSTATE.  *TR",
        "vin": "1G6DM57TX70"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/25/2007",
        "dateOfIncident": "11/23/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10209847,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "CADILLAC 2007 CTS -  PURCHASED JULY 14 2007, 14 MILES ON CAR - MIDDLE AUG 07  1,500 MILES BAD EVAPORATOR COIL REPLACED- END OF OCT 07 LEAK IN BACK RIGHT SEAL BOOT - REPAIRED BY DEALER -  NOVEMBER 23RD COMPLETE DIFFERENTIAL FAILURE AT 15 MILES PER HOUR -  WE WERE ON VACATION IN BRANSON MISSOURI, 4 HOURS FROM HOME - CAR TOWED TO SPRINGFIELD, MISSOURI TO THOMPSON'S CADILLAC - THOMPSON CADILLAC GAVE US A RENTAL CAR TO DRIVE HOME.  CAR IS CURRENTLY IN SPRINGFIELD, WE WILL NEED TO DRIVE BACK AT THE END OF THIS WEEK TO GET OUR CAR.  *TR",
        "vin": "1G6DM57T570"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/04/2007",
        "dateOfIncident": "11/03/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10207867,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "NOT ON MY VEHICLE, BUT NOTICE ON OTHER VEHICLES, PARTICULARLY NEWER MODEL CADILLAC'S, THAT THE LED TAILLIGHTS RESULT IN A STROBING AFTER-EFFECT IMAGE WHEN I AM DRIVING OR RIDING IN A CAR AND ONE OF THESE TYPES OF TAILLIGHTS COMES INTO MY FIELD OF VISION.  IT IS VERY UNCOMFORTABLE AS WELL AS DISTRACTING AS IT BRIEFLY (2-3 SECONDS) INTERFERES WITH MY VISION.  I AM AWARE OF THIS HAPPENING TO OTHER PEOPLE AS WELL (BOTH FAMILY MEMBERS AS WELL AS OTHER COMPLAINTS FOUND ONLINE).  THIS DOES NOT OCCUR FOR ME WITH \"REGULAR\" INCANDESCENT OR HALOGEN TYPE BULBS.  I DO NOT HAVE ANY EYE CONDITIONS OR VISUAL PROBLEMS OTHER THAN WEARING REGULAR EYEGLASSES.  *JB",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/20/2007",
        "dateOfIncident": "01/01/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10203516,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 CADILLAC CTS.  WHILE DRIVING 40 MPH, THE VEHICLE SHUT OFF WITHOUT WARNING.  THE FAILURE OCCURRED ON FIVE SEPARATE OCCASIONS.  THE DEALER WAS UNABLE TO DUPLICATE THE FAILURE.  AS OF SEPTEMBER 20, 2007, THE DEALER HAD NOT REPAIRED THE VEHICLE.  THE POWERTRAIN WAS UNKNOWN.  THE FAILURE MILEAGE WAS 2,000 AND CURRENT MILEAGE WAS 11,998.",
        "vin": "1G6DP577170"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/09/2007",
        "dateOfIncident": "08/03/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10198934,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER STARTING UP MY CAR (A 2007 CADILLAC CTS) AND ATTEMPTING TO GO IN REVERSE, IT STALLED IN MY DRIVEWAY AND BEGAN TO ROLL DOWN THE HILL. I TRIED TO BRAKE AND TO STEER THE CAR, BUT IT WOULD NOT RESPOND.  I ALSO NOTICED THAT MY TRACTION ENGAGED LIGHT WAS ON.  I ENDED UP SLIDING INTO THE RETAINING WALL AND CONTINUED DOWN THE HILL UNTIL I CRASHED INTO THE BRICK PILLAR OF MY GARAGE.  MY AIRBAGS DID NOT DEPLOY AND ONSTAR DID NOT RESPOND TO THE CRASH.  I SUSTAINED INJURIES ENDED UP IN THE ER.  THE LOCAL GM DEALER COULD NOT FIND ANYTHING WRONG WITH MY CAR AND SAID THAT MY AIRBAGS DID NOT DEPLOY DUE TO THE \"ANGLE\" OF THE HIT. MY CAR HAD NEARLY $8000 WORTH OF DAMAGE SO THIS WAS NOT A LITTLE \"FENDER BENDER\".  WHEN I WAS AT THE DEALERSHIP TALKING TO THE SERVICE DEPARTMENT MANAGER, HE TOLD ME THAT THERE WAS ANOTHER CUSTOMER WHO WAS FILING A COMPLAINT AGAINST GM BECAUSE THEY HAD A SIMILAR PROBLEM.  THEY HAD AN ACCIDENT IN THEIR CADILLAC AND SUSTAINED MUCH MORE DAMAGE THAN I DID, BUT THEIR AIRBAGS FAILED TO DEPLOY ALSO.  I TOOK DELIVERY OF THE CAR AT 463 MILES AND MY INCIDENT TOOK PLACE AROUND 503 MILES OR SO.  I HAD THIS CAR LESS THAN 30 HOURS WHEN THIS HAPPENED.  I STILL CONTEND THAT THE CAR STALLED AND CAUSED THIS ACCIDENT, BUT GM SAID THAT THERE WERE NO CODES FOUND WHEN THEY RAN THE DIAGNOSTIC.  I BOUGHT THIS CAR DUE TO THE ONSTAR, AND EVEN THOUGH THEIR WEBSITE SAYS THAT IT CAN DETECT A COLLISION WITHOUT THE AIRBAGS DEPLOYING, IT DID NOT WORK IN MY CASE.  *JB",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/12/2007",
        "dateOfIncident": "06/12/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10193065,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2007 CADILLAC CTS-V.SINCE PURCHASED THE VEHICLE HAS BEEN LEAKING DIFFERENTIAL FLUID FROM NUMEROUS POINTS OF REAR END ASSEMBLY.I HAVE TAKEN THE VEHICLE TO SERVICE 5 TIMES AND FIVE TIMES THE PROBLEM WAS NOT CORRECTED.THE DIFFERENTIAL ASSEMBLY ON THESES TYPES OF CADILLACS ARE VERY WEAK AND NOT ABLE TO WITHSTAND THE POWER OF THE VEHICLE. I THINK THIS IS DEFFINETLY A SAFETY CONCERN AND HAVE DONE MUCH RESEARCH AND FOUND NUMEROUS COMPLAINTS FROM OTHER CTS-V OWNERS WHO HAVE HAD COMPLETE DIFFERNTIAL FAILURE WHERE THE UNIT HAS BLOWN UP INTO SEVERAL PEICES WHICH MAY CAUSE LOSS OF CONTROL OF VEHICLE.I THINK SOMETHING SHOULD BE DONE TO CORRECT THIS PROBLEM FROM THE MANUFACTURER.IN MY CASE THEY CHANGED NUMEROUS SEALS AND GASKETS BUT AFTER DRIVING VEHICLE HOME THE LEAKS ALWAYS REOCCUR FROM THE UNIT FLEXING BECAUSE ITS WEAK",
        "vin": "1G6DN57U770"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/04/2007",
        "dateOfIncident": "06/01/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10192436,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 CADILLAC CTS.  WHILE DRIVING 10 MPH AND MAKING A TURN, ANOTHER VEHICLE CRASHED INTO THE CONTACT'S VEHICLE.  THE AIR BAGS FAILED TO DEPLOY.  THE MANUFACTURER STATED THAT THEY WOULD SEND OUT AN INVESTIGATOR AND ADVISED HER TO SUBMIT A COMPLAINT.  AN INJURY RESULTED FROM THE CRASH.  POLICE AND AMBULANCE REPORTS ARE AVAILABLE.  THE CURRENT MILEAGE IS 159 AND FAILURE MILEAGE WAS 159.  UPDATED 02-01-08.  *KB  THE CONSUMER STATED GM INFORMED HIM THE AIR BAGS DID NOT DEPLOY DUE TO LOW SPEED. THE CONSUMER STATED THE VEHICLE WAS REPAIRED AT THE TUNE OF $16,000. UPDATED 02/01/08  *TR",
        "vin": "1G6DP577170"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/08/2006",
        "dateOfIncident": "11/08/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10172923,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CTS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED WHEN STARTING THE VEHICLE, A CLICKING NOISE WAS HEARD IN THE STEERING COLUMN.  THE VEHICLE WAS DRIVEN TO THE DEALER ON SEVERAL OCCASIONS WHERE THE SOLENOID WAS REPLACED THREE TIMES AND THE THIRD BRAKE LIGHT SYSTEM WAS REPLACED, HOWEVER THE PROBLEM PERSISTED.     UPDATED 12/26/2006 - THE CONSUMER SUDDENLY BEGAN TO HEAR STATIC IN THE RADIO.  THE VEHICLE WAS TAKEN TO THE DEALER AND THE RADIO RECEIVER WAS REPLACED.  THE RADIO CONTINUED TO HAVE STATIC.  THE NEXT TIME THE ANTENNA MODULE WAS REPLACED.  NOW WHEN THE CONSUMER APPLIED THE BRAKE SHE HEARD A CLICKING NOISE IN THE RADIO.  THE DEALER REPLACED THE SHIFTER AND A SOLENOID INSIDE THE SHIFTER.  THE STATIC CONTINUED AND SO DID THE CLICKING NOISE.  THE VEHICLE WAS TAKEN BACK TOTHE DEALER SEVERAL TIMES BUUT THEY WERE UNABLE TO DETERMINE THE CAUSE OF THE PROBLEMS. *NM",
        "vin": "1G6DP577970"
    }
]