[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/18/2021",
        "dateOfIncident": "05/15/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11417683,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "Z4",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONTACT OWNS A 2007 BMW Z4. THE CONTACT STATED WHILE DRIVING 70 MPH, THERE WAS AN ABNORMAL KNOCKING SOUND COMING FROM THE ENGINE. THE CONTACT PULLED THE VEHICLE OVER TO THE SIDE OF THE ROAD AND INSPECTED UNDER THE HOOD AND UNDERNEATH THE VEHICLE. THE CONTACT FOUND NO ISSUES. THERE WAS NO WARNING LIGHT ILLUMINATED. THE VEHICLE WAS TOWED BACK TO THE RESIDENCE. THE VEHICLE WAS NEXT TOWED TO THE LOCAL DEALER BMW DEALER TO BE DIAGNOSED. THE MECHANIC WAS UNABLE TO DETERMINE THE CAUSE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 81,000.",
        "vin": "5UMBT93547L"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/16/2019",
        "dateOfIncident": "01/15/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11170410,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "Z4",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "'AIRBAGS HAVE NEVER BEEN DEPLOYED ACCORDING TO CARFAX HISTORY. I WAS COMMUTING HOME, WAITING AT A STOP LIGHT, WHEN I HEARD A VERY LOUD POP. AT FIRST, I THOUGHT SOMETHING HAD FALLEN ON TO MY CAR BECAUSE THE DASH DID NOT EXPLODE. REVERALING THE AIRBAG. I STARTED TO SMELL SMOKE COMING FROM THE PASSENGER SIDE AND NOTICED THAT THE AIRBAG LIGHT WAS ON. I WASN'T ABLE TO START THE CAR GIVEN THE BATTERY SAFETY TERMINAL DISENGAGED. I AM LUCKY THAT THE DRIVER SIDE AIRBAG DIDN'T DEPLOY, OR EVEN DEPLOY WHILE I WAS DRIVING.",
        "vin": "5UMBT93597L"
    },
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/26/2018",
        "dateOfIncident": "10/23/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11153666,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "Z4",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE IN MOTION THE VEHICLE ACCELERATES FOR 2 TO 3 SECONDS PERIODICALLY ON HIGHWAY AND IN CITY. WHILE IN MOTION AT LOW SPEED AND WHEN STATIONARY AFTER DRIVING ONLY A FEW MILES THE VEHICLE ENGINE SHUTS DOWN.  WHILE IN MOTION AT HIGH SPEED THE VEHICLE ENGINE STUTTERS BADLY BUT DOES NOT TURN OFF.  THE IGNITION SWITCH HAS TO BE TUNED OFF AND THEN ON AGAIN, AND THEN THE ENGINE TURNS OVER AND I'M ABLE TO CONTINUE TO DRIVE IT.  BOTH VALVE COVER GASKETS LEAK OIL ONTO THE ENGINE.  THE WORST WAS FRONT OF THE ENGINE WHICH HAS BEEN REPLACED. THERE IS AN ELECTRICAL ISSUE: SEATBELTS DON'T RETRACT AUTOMATICALLY AND ARE NOT WORKING PROPERLY, GET CAUGHT IN THE DOOR.  BOTH E-KEYS HAVE STOPPED WORKING AND NOT ABLE TO BE REPROGRAMMED FOR EN. THE HORN DOES NOT WORK AT ALL. THE AIRBAG WARNING LIGHT REMAINS ON AT ALL TIMES. THE CIG LIGHTER AND SEAT WARMERS ARE WORKING FINE. THE THERMOSTAT WARNING COMES ON BUT IN GAUGE IS NOT SHOWING ANY SIGN OF TROUBLE.  BOTH THE HEAT AND THE AC WORK FINE WHILE IN MOTION AND STATIONARY.",
        "vin": "4USBU33577L"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "08/21/2018",
        "dateOfIncident": "02/24/2012",
        "fire": true,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 1,
        "numberOfInjuries": 0,
        "odiNumber": 11121221,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "Z4",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "CASE NUMBER [XXX] FROM FARS 2012 DATABASE. CAR RAN OFF RIGHT SIDE OF ROADWAY WHILE NEGOTIATING CURVE IN ROAD AND HIT A TREE. SOLE-OCCUPANT DRIVER PERISHED IN SUBSEQUENT FIRE. SIX MONTHS BEFORE ACCIDENT, VICTIM REPORTED THAT CAR \"OCCASIONALLY POPS AND/OR SQUEAKS WHEN CORNERING\" IN REQUEST FOR SERVICE APPOINTMENT WITH STEVENS CREEK BMW. PLS NOTE THAT LAT/LONG IN FARS CONTRADICTS REPORT THAT ACCIDENT OCCURRED ON CENTRAL EXPWY EASTBOUND IMMEDIATELY EAST OF BERNARDO AVE. *TT    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *TT",
        "vin": "4USBU53537L"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/14/2018",
        "dateOfIncident": "03/31/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11119934,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "Z4",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING IS RIGID AT ROAD SPEEDS.  DEALER SAYS IT NEEDS A $4400 STEERING ESP UNIT.  CAR DAD 3700 MILES NOT IT.  THIS IS DEFINITELY A SAFETY ISSUE SINCE CAR IS DIFFICULT TO CONTROL.",
        "vin": "44USBU33537"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/30/2018",
        "dateOfIncident": "12/11/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11091001,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "Z4",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 BMW Z4. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V683000 (ENGINE AND ENGINE COOLING); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT CALLED A LOCAL DEALER (PRESTON BMW, 7830 MARKET ST, BOARDMAN, OH 44512) AND WAS ADVISED THAT THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STATED THAT THE PART MAY BE AVAILABLE BY THE END OF JUNE 2018. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/05/2018",
        "dateOfIncident": "07/07/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10838321,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "Z4",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "2007 BMW Z4.  CONSUMER WRITES IN REGARDS WIFE'S IMPREZA VEHICLE ACCIDENT.  CLAIMS OF \"INADVERTENT AIRBAG DEPLOYMENT\" CAUSED BY APPLYING BRAKES IN ANOTHER CONSUMERS BMW X3 THAT WAS INVOLVED IN ACCIDENT.  *SMD     THE CONSUMER WAS CONCERNED ABOUT THE BMWS' AIRBAGS BEING ABLE TO DEPLOY INADVERTENTLY. *JS",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/26/2018",
        "dateOfIncident": "12/18/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11074972,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "Z4",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 BMW Z4. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V683000 (ENGINE AND ENGINE COOLING); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. BMW OF LOUISVILLE (4 AUTOCENTER DR, LOUISVILLE, KY) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE. *TT  *TR",
        "vin": "4USBU33577L"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/16/2018",
        "dateOfIncident": "10/30/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11073322,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "Z4",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 BMW Z4. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V683000 (ENGINE AND ENGINE COOLING); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE LOCAL DEALER WAS NOT CONTACTED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "4USDU53407L"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/29/2017",
        "dateOfIncident": "12/15/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11057401,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "Z4",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "ABS, BRAKE, DSC ANNUNCIATOR LIGHTS ILLUMINATED IMMEDIATELY FOLLOWING ABS ACTIVATION DURING COLD WEATHER (10-12 DEG. F). FAULT CODE IS 5DF0, 5DF1 DSC HYDRAULIC UNIT PUMP MOTOR. VERIFIED ABS NOT FUNCTIONAL. THE FOLLOWING SAFETY SYSTEMS ARE NOT FUNCTIONAL: ABS, DSC, DTC, CBC, EBD, BRAKE ASSIST, BRAKE DRYING. DSC UNIT PART COST IS OVER $2700.",
        "vin": "4USBU33577L"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/03/2017",
        "dateOfIncident": "04/02/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10970051,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "Z4",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG LIGHT ILLUMINATED AFTER STARTING VEHICLE WITH ONLY DRIVER INSIDE, STATIONARY. LIGHT DUE TO FAULT WITH PASSENGER OCCUPANCY MAT. AIRBAG WARNING LIGHT AND PASSENGER AIRBAG OFF LIGHT BOTH ILLUMINATED WITH OCCUPANT IN PASSENGER SEAT. NO APPARENT DAMAGE TO SEAT OR CONNECTORS.",
        "vin": "4USBU33577L"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/29/2016",
        "dateOfIncident": "09/01/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10928472,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "Z4",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING IS DANGEROUSLY DEFECTIVE WITH CAR MOVING LEFT AND RIGHT RAPIDLY CREATING SCARY AND UNCOMFORTABLY DRIVING EXPERIENCING. FEELS LIKE INTERMITTENT GRABBING RESISTANCE ON THE STEERING WHEEL WHEN TURNING AT NORMAL HIGHWAY SPEEDS, ALMOST LIKE THE BRAKES ARE BEING APPLIED INTERMITTENTLY IN THE TURN. I HAVE HAD THE TIRES REBALANCED AND INSPECTED TWICE FOR DEFECTIVE OR SEPARATION OF TREADS AND NOTHING CHANGED. ALSO HAD A BMW SPECIALIST CHECK THE SUSPENSION AND FRONT END AND HE SAID ALL WAS GOOD THERE.  THIS IS A VERY DANGEROUS SITUATION AND I HAVE TAKEN THE CAR OFF THE ROAD DO TO SEVERITY OF THE PROBLEM.  *TR",
        "vin": "4USBU33537L"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/06/2016",
        "dateOfIncident": "09/15/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10914369,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "Z4",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "HYDRAULIC CLUTCH RESTRICTER VALVE CAUSES CLUTCH TO SLIP ALL THE TIME.  BOUGHT THE CAR WITH 43,000 MILES ON IT AND AT 54,000 MILES THE CLUTCH IS GONE AND THERE IS NO WARRANTY OR RECALL AVAILABLE. THE CAR WAS IN MOTION WHEN THE CLUTCH WENT OUT AND THE CAR WOULD NOT MOVE EVEN WHEN A DIFFERENT GEAR WAS USED.  YOU COULD CHANGE GEARS, BUT THERE WAS NO POWER WHEN THE CLUTCH WAS LET OUT.",
        "vin": "4USBU33517L"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/20/2015",
        "dateOfIncident": "11/17/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10795033,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "Z4",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. MY CAR IS EXPERIENCING THE PASSENGER OCCUPANCY SENSOR MAT FAILURE. BMW IS NOT HONORING EXTENDED WARRANTIES AND DENIED MY CLAIM BECAUSE MY CAR IS A 2007. IT WAS BUILT IN DECEMBER OF 2006. BOTH THE AIRBAG WARNING LIGHT AND THE PASSENGER AIRBAG NOT WORKING LIGHT ARE ILLUMINATED.",
        "vin": "5UMBT93527L"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/08/2015",
        "dateOfIncident": "08/19/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10762248,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "Z4",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 8/19/2015 WHILE LEAVING MY NEIGHBOR HOOD GOING AROUND 25 MPH MY PASSENGER SIDE AIR BAG RANDOMLY DEPLOYED.  THE CAR IS A 2007 BMW Z4 WITH ONLY 32000 MILES.  I DIDN'T HIT A POT HOLE OR ANYTHING THAT MIGHT HAVE SET IT OFF.",
        "vin": "4USBT33575L"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/21/2015",
        "dateOfIncident": "07/11/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10735607,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "Z4",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SIDE LOW BEAM HEADLIGHT QUIT WORKING WHEN IGNITION WAS TURNED ON. HEADLIGHT WAS WORKING FINE WHEN THE VEHICLE WAS PARKED. BLOWN LIGHT INDICATOR ON INSTRUMENT CLUSTER APPEARED. WHEN CHANGING OUT THE LIGHT I DISCOVERED ALL THE WIRES INSIDE THE HEADLIGHT ENCLOSURE WERE DAMAGED DUE TO HEAT. ALL OF THE WIRES INSULATION WAS DRY ROTTED , SECTIONS OF THE INSULATION BROKEN OFF OF THE WIRES AND SHORTED OUT TOGETHER. I HAVE MANY YEARS OF VEHICLE WIRING TROUBLESHOOTING AND DESIGN. THE WIRES IN THE HEADLIGHTS DO NOT HAVE THE APPROPRIATE JACKET RATING FOR THE HEADLIGHT LOCATION WHERE THEY WERE INSTALLED BY BMW. I BELIEVE THE HEAT FROM THE HEADLIGHTS DRIED OUT AND MADE THE WIRE JACKET BRITTLE. AFTER INVESTIGATION OF THE LEFT HEADLIGHT HOUSING BOTH HEADLIGHTS REQUIRE THE INTERNAL HARNESS OF EACH HEADLIGHT TO BE REPLACED DUE TO HEAT AND DRY ROT. THE SHORTING OF THE WIRES ONLY BLEW MY HEADLIGHT BULB AND NOT THE FUSE IN THE SYSTEM. THIS COULD BE THE REASON FOR THE OTHER PERSONS COMPLAINED ABOUT THEIR HEADLIGHTS TURNING ON AND OFF WHILE DRIVING. IF LEFT UNCHECKED THIS COULD CAUSE OTHER PROBLEMS IN THE CARS ELECTRICAL SYSTEM AND BE DANGEROUS IF THE LIGHTS SHORTED OUT DURING A NIGHT DRIVE.",
        "vin": "4USBU33557L"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/18/2015",
        "dateOfIncident": "09/08/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10726076,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "Z4",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "BMW Z4 2007 - STEERING WHEEL PULLS HARD TO THE RIGHT.  WHEN CORRECTED PULLS HARD TO THE LEFT AND VICE-VERSA.  I'VE TAKEN THE VEHICLE IN 5 TIMES IN THE LAST YEAR TO 3 DIFFERENT CERTIFIED MECHANICS THINKING IT HAS TO DO WITH THE ALIGNMENT BUT THE ISSUE IS NOT RESOLVED.  I HAVE BEEN ADVISED BY A PRIVATE CERTIFIED MECHANIC THAT THIS IS LIKELY DUE TO A STEERING COLUMN DEFECT, FOR WHICH THE 2003-2005 BMW Z4'S WERE RECALLED.  THE VEHICLE IS DIFFICULT TO CONTROL AND DANGEROUS TO DRIVE AT ANY SPEED OVER 40 MPH.  THE LOCAL DEALERSHIP COMPLETED ANOTHER ALIGNMENT LAST WEEK, IS NOT ACKNOWLEDGING THE STEERING PROBLEM AND CLAIMS THAT THE VEHICLE IS OK.  I AM NOW DEALING WITH CUSTOMER RELATIONS AT BMW-USA BUT NO ACTION FOR ASSISTANCE WITH THIS FACTORY DEFECT WILL BE CONSIDERED UNTIL THE LOCAL DEALERSHIP'S SERVICE DEPARTMENT ACKNOWLEDGES THE PROBLEM AND QUOTES THE REPAIR. I HAVE LOST CONFIDENCE IN THE VEHICLE AND AT HIS POINT THE IT SITS IN MY DRIVEWAY BECAUSE IT IS UNSAFE AND DANGEROUS ON THE ROAD.",
        "vin": "4USBU53577L"
    },
    {
        "components": "STEERING,STRUCTURE,WHEELS",
        "crash": true,
        "dateComplaintFiled": "09/04/2014",
        "dateOfIncident": "08/01/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10630842,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "Z4",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "A TRACTOR TRAILER HIT MY CAR, A BMW Z4 CONVERTIBLE, CT LICENSE PLATE, IN THE REAR LEFT, AS I WAS MOVING SLOWLY WITH TRAFFIC JUST BEFORE THE OVERPASS, RIGHT BEFORE I HIT THE TAPPANZEE BRIDGE AS I WAS HEADING TO NJ ON FRIDAY, AUGUST 1ST, 2014, SOMETIME BETWEEN 11:50-1230PM. I BELIEVE IT WAS CLOSE OR ABOUT 12:20PM.MY HEAD SLAMMED VIOLENTLY AGAINST THE TOP OF THE WHEEL FROM THE IMPACT.I LOOKED BACK AFTER BEING HIT AND THE DRIVER AGREED TO PULL OVER WHEN THERE WAS ROOM FOR HIM AFTER GOING OVER THE BRIDGE TO EXCHANGE INSURANCE INFORMATION. I WROTE DOWN HIS LICENSE PLATE , IT WAS TENNESSEE U514217.I BELIEVE THE # OF THE TRUCK WAS 5318. THE DRIVER WAS A WHITE MALE, ABOUT 40-45YEAR OF AGE.AFTER I SPED IN FRONT, I PULLED OVER JUST OVER THE BRIDGE TO THE RIGHT WHERE CONSTRUCTION WAS TAKING PLACE AND I WAITED FOR THE TRUCK TO PULL IN BEHIND ME. THE TRUCKER PULLED UP TO THE LEFT OF MY CAR WHILE HE WAS STILL IN THE FIRST LANE, AND HE WAS MOVING AT A SNAIL'S PACE; HIS WINDOW WAS ROLLED DOWN AND HE STARED ME IN THE FACE, CURLED HIS RIGHT HAND INTO A FIST, PUT IT UP TO HIS NECK, RAISED HIS RIGHT THUMB, AND DRAGGED HIS RIGHT HAND ACROSS HIS NECK AS IF TO SAY HE'D CUT MY THROAT. HE THEN YELLED, \"I GOT SOMEWHERE TO BE! DO YOU WANT ME TO DRIVE BACK UP HERE AFTER WE EXCHANGE PERSONAL INFORMATION, COME TO WHERE YOU LIVE, AND CUT YOUR THROAT!\"  HE HAD DRIVEN PAST ME.I HESITATED. I DIDN'T KNOW WHAT TO DO. , I GOT A CAT SCAN AND HAD MY HEAD WOUND LOOKED AT, AND WAS DIAGNOSED WITH A SEVERE BRUISE TO THE HEAD AND RECEIVED TREATMENT FOR ANXIETY I WAS FEELING FROM THE ACCIDENT AND THE HIT AND RUN THREAT. A MONTH HAS PASSED AND I AM STILL FEELING ANXIETY OVER THIS; NOT TO MENTION MY CAR HAS BEEN DAMAGED.I AM LOOKING TO FIND THE DRIVER WHO HIT MY CAR AND CAUSED ME THE WOUND AND CONSTANT ANXIETY I NOW SUFFER.  *TR",
        "vin": "4USBU33567L"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/16/2014",
        "dateOfIncident": "01/15/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10611040,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "Z4",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "LOW BATTERY SITUATION OVER THE WINTER CAUSED THE VEHICLE TO SLIP INTO \"TRANSPORT MODE\" WHERE THE AC, DEFROSTER, AND FAN SPEED WILL NOT WORK.  THIS CREATES A HAZARDOUS VISIBILITY SITUATION DUE TO THE DEFROSTER NOT WORKING.  AS I UNDERSTAND IT, THE TRANSPORT MODE IS SUPPOSED TO BE DISABLED WHEN THE CAR IS DELIVERED TO THE US BUT SOME DEALERS MISTAKENLY TURN IT OFF RATHER THAN DISABLE IT.  TO DISABLE IT YOU MUST RETURN IT TO THE DEALER AND PAY FOR A HIGH SERVICE VISIT FOR A FEW MOMENTS OF PROGRAMMING.  *TR",
        "vin": "4USBU53537L"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/29/2014",
        "dateOfIncident": "01/15/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10585432,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "Z4",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 BMW Z4. THE CONTACT STATED THAT THE DRIVER SIDE DOOR LOCK AND WINDOW FAILED TO FUNCTION. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC. THE TECHNICIAN DIAGNOSED THAT THE DOOR ACTUATOR WAS DEFECTIVE AND NEEDED TO BE REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 7,800 AND THE CURRENT MILEAGE WAS 8,800.",
        "vin": "4USDU53467L"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/21/2013",
        "dateOfIncident": "02/15/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10521087,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "Z4",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 BMW Z4. THE CONTACT STATED THAT WHEN DRIVING AT VARIOUS SPEEDS, THE HEADLIGHTS WOULD FLICKER. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 49,000.  *TR",
        "vin": "4USBU53517L"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/06/2013",
        "dateOfIncident": "10/13/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10510785,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "Z4",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I'VE LOST CONTROL OF MY STEERING IN GRAVE CIRCUMSTANCES AND THE WHEEL STICKS, WHERE IT REACHES A POINT WHERE I CANNOT CONTROL THE VEHICLE WHATSOEVER. THE VEHICLE BARELY HAS 47,000 MILES ON IT. WHILE DRIVING 30MPH LAST FALL, THE STEERING WHEEL BEGAN TO STICK AND I COULD NOT STEER THE VEHICLE. I HAD TO APPLY A GREAT DEAL OF FORCE TO GET THE STEERING TO RESPOND. THERE IS A CONTINOUS CLICKING, ALMOST LIKE A \"CLUNK\" SOUND, FROM THE STEERING COLUMN AND THE STEERING SIMPLY DOES NOT RESPOND WELL AND I FEEL EXTREMELY UNSAFE. THE LOCAL BMW DEALER SAYS THAT THE ENTIRE STEERING COLUMN WILL NEED TO BE REPLACED, WHICH WILL COST ME OVER $3,000. I PARKED THE CAR FOR WINTER AND RECENTLY PULLED IT BACK OUT AND THE PROBLEM CONTINUES TO PERSIST.  *TR",
        "vin": "4USBU535X7L"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/17/2012",
        "dateOfIncident": "09/04/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10480876,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "Z4",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING STRAIGHT, THE STEERING WHEEL TENDS TO STICK, FORCE IS NEEDED TO STEER TO THE LEFT OR RIGHT OR TO EVEN KEEP IT GOING STRAIGHT. ONCE YOU START TURNING IT SEEMS TO FEEL NORMAL UNTIL YOU START TO MOVE THE WHEEL BACK TO THE NEUTRAL POSITION, THEN YOU REALIZE THE WHEEL IS NOW STUCK IN THIS POSITION. IT USUALLY TAKES QUITE A TUG TO GET IT MOVING AGAIN!  IT APPEARS TO BE GETTING MORE EXTREME AND REQUIRING MORE FORCE TO MOVE THE WHEEL. I HAVE OWNED THE CAR FOR ABOUT 2 1/2 YEARS AND HAVE ALWAYS THOUGHT IT STEERED A LITTLE DIFFERENT, I JUST FIGURED IT WAS A BMW THING  AND IT BEING A SMALLER CAR THAT WAS CAUSING IT TO HANDLE THIS WAY!! I DON'T THINK THAT ANY MORE!  *TR",
        "vin": "4USBU33567L"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/31/2012",
        "dateOfIncident": "09/12/2011",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10446026,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "Z4",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 BMW Z4. THE CONTACT STATED THAT THE VEHICLE WOULD VEER TO THE RIGHT AND THE STEERING WHEEL WOULD HAVE TO BE HELD TO THE LEFT IN ORDER TO KEEP THE VEHICLE STRAIGHT. THE CONTACT PUT AN ANALYZER ON THE VEHICLE WHICH READ THAT THE STEERING SENSOR WAS DEFECTIVE AND THE STEERING STABILIZER HAD FAILED. THE VEHICLE WAS NOT REPAIRED. THE VIN WAS NOT AVAILABLE. THE FAILURE AND THE CURRENT MILEAGE WAS 51,000.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/04/2011",
        "dateOfIncident": "09/24/2011",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10428659,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "Z4",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 BMW Z4. WHILE ATTEMPTING TO REVERSE FROM A PARKING SPACE AT APPROXIMATELY 5 MPH, THE STEERING WHEEL SEIZED AND BECAME DIFFICULT TO MANEUVER. THE CONTACT STATED THAT THERE WAS A LOSS OF POWER STEERING WITHOUT WARNING. THE VEHICLE WAS TOWED TO THE DEALER WHERE THE TECHNICIAN STATED THAT THE ELECTRIC POWER STEERING UNIT AND COLUMN HAD TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 5,345.  UPDATED 10/19/11  *BF",
        "vin": "4USBU33507L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/18/2011",
        "dateOfIncident": "08/16/2011",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10419995,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "Z4",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 BMW Z4M.  WHILE DRIVING 10 MPH, THE CONTACT STATED THAT HE HIT A BUMP IN THE ROAD WHEN HE HEARD A LOUD SNAP COMING FROM THE FRONT PASSENGER SIDE OF THE VEHICLE.  THE DEALER ADVISED HIM THAT THE PASSENGER SIDE ENGINE BOLTS HAD FRACTURED AND THAT THE ENGINE WAS NOT ATTACHED TO THE VEHICLE.  THE MANUFACTURER WAS WAS AWARE OF THE FAILURE.  THE VEHICLE WAS AWAITING REPAIRS.  THE CURRENT AND FAILURE MILEAGES WERE 34,000.",
        "vin": "5UMDU93447L"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/04/2011",
        "dateOfIncident": "11/01/2010",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10374101,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "Z4",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "1.  REAR SWAY BAR MOUNT LOOSENS OVER TIME.  2.  REAR SWAY BAR MOUNT MAY FALL OFF IF NOT TIGHTENED EVERY ~5K MILES.  ADVERSELY AFFECTS VEHICLE HANDLING, ESPECIALLY IN EMERGENCY MANEUVERS.  NOTICEABLE INCREASE IN VEHICLE UNDERSTEER,  3.  REPLACED REAR SWAY BAR MOUNT (IT HAD FALLEN OFF) AND USED LOCTITE ON BOLTS. *TR",
        "vin": "5UMDU93517L"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/13/2010",
        "dateOfIncident": "09/05/2010",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10355229,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "Z4",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "2007 BMW Z4, POWER STEERING WENT OUT WHILE DRIVING, MAKING CAR HARD TO STEER.  CAR IS STILL UNDER WARRANTY, DEALER IS GOING TO FIX IT.  ACCORDING TO INTERNET, LOTS OF OTHER PEOPLE HAVE HAD SIMILAR PROBLEMS WITH THIS MODEL... *TR",
        "vin": "4USBU33507L"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/07/2008",
        "dateOfIncident": "07/03/2008",
        "fire": true,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10233468,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "Z4",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WIRING HARNESS UNDER THE DASH SPONTANEOUSLY IGNITED WHILE I WAS DRIVING.  THE FIRE WAS PUT OUT WITH A FIRE EXTINGUISHER, BUT RE-IGNITED TWO MORE TIMES.  IT DIDN'T STOP RE-IGNITING UNTIL THE BATTERY WIRES WERE DISCONNECTED FROM THE BATTERY TERMINALS.  POLICE AND THE FIRE DEPT WERE CALLED.  *TR",
        "vin": "5UMBT935X7L"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/12/2008",
        "dateOfIncident": "10/20/2007",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10220940,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "Z4",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 BMW Z4.  WHILE DRIVING VARIOUS SPEEDS, THE VEHICLE VEERS LEFT AND RIGHT SPORADICALLY.  WHEN HE APPLIES PRESSURE TO THE BRAKES, THE VEHICLE WILL ABRUPTLY PULL TO THE LEFT OR RIGHT.  THE DEALER STATED THAT THE ROAD CONDITIONS WERE POSSIBLY CAUSING THE FAILURE.  THE CONTACT CALLED THE MANUFACTURER AND THEY REFERRED HIM BACK TO THE DEALER.  THE FAILURE MILEAGE WAS 1,000 AND CURRENT MILEAGE WAS 3,500.     UPDATED 05/27/08 *BF  UPDATED 05/27/08",
        "vin": "4USBU53547L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/13/2007",
        "dateOfIncident": "07/24/2007",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10199450,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "Z4",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MINI COOPER MADE BY BMW. TROUBLE LIGHT APPEARS. ENGINE SWITCHES TO LOW POWER. CAN HAPPEN AT FREEWAY SPEEDS WITHOUT NOTICE. LESS THAN 100 MILES ON CAR AT FIRST INCIDENT. AT FIRST DEALER SERVICE, DEALER SUGGESTED IN MIGHT BE BRAND OF GASOLINE. MULTIPLE INCIDENTS SINCE PURCHASE WITHOUT NOTICE AND WITH DIFFERENT BRAND NAME GASOLINE.  *JB",
        "vin": "WMWMF73537T"
    }
]