[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/13/2015",
        "dateOfIncident": "07/07/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10781523,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS 2500",
                "productYear": "2007",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Michelin North America, Inc.",
                "productMake": "BF GOODRICH",
                "productModel": "COMMERCIAL T/A A/S",
                "productYear": "9999",
                "size": "LT 245/75R16 120 Q LRE",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A ROAD TREK POPLAR TRAILER (NA) EQUIPPED WITH REPLACEMENT BF GOODRICH COMMERCIAL T/A A/S TIRES, SIZE LT 245/75R16. THE TRAILER WAS HITCHED TO A 2007 CHEVROLET EXPRESS 2500. WHILE DRIVING APPROXIMATELY 55 MPH, THE VEHICLE BEGAN TO SHAKE. UPON INSPECTION IT WAS DISCOVERED THAT THE REAR PASSENGER SIDE TIRE EXPERIENCED A SLIGHT BULGE IN THE MIDDLE OF THE TREAD. THE TIRE WAS REPLACED BY THE RETAILER. THE CONTACT EVENTUALLY EXPERIENCED THE SAME FAILURE ON ALL FOUR TIRES. EACH FAILURE WAS ON THE REAR PASSENGER AND DRIVER SIDE TIRES. ON JULY 19, 2015, WHILE DRIVING APPROXIMATELY 55 MPH, THE VEHICLE BEGAN TO SHAKE BEFORE THE PASSENGER SIDE REAR TIRE EXPERIENCED A BLOW OUT. THE MANUFACTURER WAS NOTIFIED OF THE FAILURES. THE TIRE AND VEHICLE FAILURE MILEAGE WAS 77,226.",
        "vin": "1GCGG25U861"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": true,
        "dateComplaintFiled": "03/20/2014",
        "dateOfIncident": "10/27/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10573664,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS 2500",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS THE SOLE OCCUPANT. CONCERNING THE INFORMATION ABOVE THE DATE IS ACCURATE WITHIN ABOUT A WEEK AND MAY BE DETERMINED EXACTLY. MILEAGE IS CORRECT WITHIN A THOUSAND MILES. MY INJURIES WERE NOT MAJOR AND I DECLINED TREATMENT SPECIFICALLY BECAUSE I NEEDED TO DEAL WITH THE WRECKER AND SUCH.    END OF PREAMBLE    I WAS LEAVING THE GARAGE AT THE CONDO WHERE I LIVE. THERE IS A STEEP INITIAL GRADE ENDING IN A 90 DEG. LEFT FOLLOWED BY A MORE MODEST DECLINE ENDING AT A STREET WITH TRAFFIC. BECAUSE THE RAMP IS NARROW AND EVERYTHING DISAPPEARS FROM THE DRIVER'S VIEW, I WAS TAPPING THE BRAKES AND CHECKING THE POSITION OF THE BACK WHEELS, WHEN THE BRAKE PEDAL CEASED TO FUNCTION. I TRIED IT AT LEAST TWICE AND THEN GOT BACK TO STEERING. AT THE TIME MY ASSUMPTION WAS THAT THE ENGINE HAD STALLED, EVEN THOUGH THAT HAS NEVER OCCURRED PREVIOUSLY. I MADE THE LEFT TURN, BUT I WAS BECOMING ANXIOUS ABOUT MY SPEED. I CHOSE TO SWERVE AGAINST THE ONE EARTH BANK AVAILABLE, AND THAT RESULTED IN AN OVER TURNING OF THE VEHICLE. ONCE BACK ON ITS WHEELS THE VEHICLE STARTED, RAN, AND DROVE WITH NO EVIDENT ABNORMALITIES.  GIVEN TIME TO CONSIDER WHAT HAD HAPPENED, I REALIZED THAT THE IGNITION HAD GONE OFF, I SUPPOSE THAT IT MUST SHARE A COMMON SWITCH WITH THE CARS PRESENTLY IN RECALL, AND I WOULD LIKE THE SAME CONSIDERATION.  *TR",
        "vin": "1GCGG25V571"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/29/2013",
        "dateOfIncident": "05/29/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10514069,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS 2500",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HINGE ON THE SIDE CARGO DOOR BROKE WHILE CLOSING THE DOOR  I HAD TO TIE IT SHUT FROM INSIDE. VERY SAFE.   ACCORDING TO NUMEROUS FORUMS, THE HINGES ON THESE VANS ARE NOTHING   BUT A PROBLEM. NO IT'S GOING TO COST $1000 TO FIX  A PROBLEM THAT CHEVY SHOULD HAVE ADDRESSED MANY YEARS AGO.  *TR  ## VIN FAILED ##",
        "vin": "1GCGG27V271"
    },
    {
        "components": "STEERING,SERVICE BRAKES, HYDRAULIC,POWER TRAIN,STRUCTURE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/19/2012",
        "dateOfIncident": "09/08/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10476485,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS 2500",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CHEVROLET EXPRESS 2500. THE CONTACT STATED THAT HE NOTICED OIL LEAKING FROM THE VEHICLE. THE CONTACT FURTHER INSPECTED THE VEHICLE AND DISCOVERED THAT THE LEAK WAS COMING FROM THE COOLING COMPARTMENT. THE VEHICLE WAS TAKEN TO THE DEALER FOR INSPECTION WHERE THEY ADVISED THAT THERE WAS A PIPE THAT NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED AND PROVIDED NO ASSISTANCE. THE FAILURE MILEAGE WAS 77,000.   UPDATED 10/26/12 *CN    THE CONSUMER STATED ALL 4 BRAKE ROTORS FAILED STATE INSPECTION. THE ROTORS WERE RUSTED. AT 97,000 MILES THE TRANSMISSION FAILED  AFTER REPLACEMENT. ALL FOUR STEEL RIMS WERE HEAVILY RUSTED INSIDE AND OUT. COOLING LINE WAS REPLACED AS WELL AS ROTORS AND BRAKE PADS. UPDATED 11/08/2012 *JS  *TR",
        "vin": "1GCGG25VX71"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "05/16/2012",
        "dateOfIncident": "05/09/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10458737,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS 2500",
                "productYear": "2007",
                "type": "Vehicle"
            },
            {
                "manufacturer": "MICHELIN TIRE CORP.",
                "productMake": "MICHELIN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TIRE VALVE STEM BROKE WHILE THE TIRE PRESSURE WAS BEING CHECKED. THIS OCCURRED DURING AN OIL CHANGE SERVICE. THE BROKEN VALVE STEM/TPMS SENSOR REQUIRED $82 TO REPAIR IT. I AM FILING THIS CLAIM ON BEHALF OF OUR CUSTOMER.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/25/2011",
        "dateOfIncident": "04/22/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10397338,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS 2500",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 CHEVROLET EXPRESS G2500. WHILE DRIVING APPROXIMATELY 35 MPH, THE CONTACT STATED THAT HE APPLIED PRESSURE TO THE BRAKES AS THEY ABNORMALLY WENT TO THE FLOOR AND DID NOT STOP THE VEHICLE. THE CONTACT INSPECTED THE VEHICLE AND NOTICED THAT THERE WAS A BRAKE FLUID LEAK AND A HOLE IN THE BRAKE LINE. THE DEALER OFFERED NO ASSISTANCE. THE CONTACT DID NOT INFORM THE MANUFACTURER OF THE FAILURE NOR WAS THE VEHICLE REPAIRED. THE CURRENT AND FAILURE MILEAGE WAS 80,000.",
        "vin": "1GCGG29U171"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "12/08/2010",
        "dateOfIncident": "12/07/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10369714,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS 2500",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2007 CHEVY EXPRESS 2500 FRONT LEFT WHEEL HOUSING BURNED ITSELF OUT AND ALMOST FROZE UP THE WHEEL WITH NO WARNING. *TR",
        "vin": "1GCGG25V871"
    }
]