[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "02/14/2010",
        "dateOfIncident": "10/11/2009",
        "fire": false,
        "manufacturer": "Crossroads RV",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10310295,
        "products": [
            {
                "manufacturer": "Crossroads RV",
                "productMake": "CROSSROADS",
                "productModel": "CRUISER",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAMPER WAS PURCHASED NEW IN APRIL 2008 AND OUR FIRST MAJOR TRIP WAS IN OCTOBER 2008.   ON THAT TRIP, THE PASSENGER SIDE FRONT TIRE BLOWOUT ON THE FREEWAY AFTER ABOUT 10 HOURS OF TRAVEL.  PRIOR TO TAKING ANY TRIPS, MY ROUTINE IS TO CHECK THE TRAILER TIRE CONDITION AND PRESSURE.  SINCE THIS WAS THE FIRST BLOWOUT, I JUST ATTRIBUTED TO AN UNKNOWN ROAD HAZARD CONDITION.  UPON RETURNING HOME, I BOXED UP EVERYTHING WE CARRIED ON THE TRIP AND WEIGHTED IT TO ENSURE WE WERE WITHIN THE CARRYING CAPACITY.  WE DID LOAD THE UNIT TO 70LBS BELOW THE CARRYING CAPACITY.    IN OCTOBER 2009, WE WERE TAKING A LONG TRIP TRAVELING FROM OHIO TO FLORIDA.  AGAIN AT ABOUT 10 HOURS INTO THE TRIP, THE SAME TRAILER TIRE FAILED ON THE HIGHWAY.  I TOOK MY NORMAL PRECAUTIONS OF CHECKING TIRE CONDITION AND PRESSURES PRIOR TO LEAVING.  ON THIS TRIP, WE LIMITED THE SUPPLIES WE TOOK WITH US AND WERE ALMOST 300 LBS BELOW THE CARRYING CAPACITY.   BECAUSE OF THE PROBLEMS WE ENCOUNTERED, I LOOKED DEEPER INTO THE TRAILER CARRYING CAPACITY, TIRE CARRYING CAPACITY, AND TRAILER GVWR.  ACCORDING TO THE INFORMATION PROVIDE FOR OUR TRAILER,    CARRYING CAPACITY OF IS 1270 LBS. BASED ON THE OPTIONS INSTALLED NOT INCLUDING 252 LBS FOR PROPANE BOTTLES   GVWR IS 7873 LBS  HITCH WEIGHT 873 LBS  TIRE CAPACITY 1820 LBS EACH, 7280 LBS  SO THE 4 TIRES COMBINED CANNOT CARRY THE GVWR.  IF YOU SUBTRACT OFF THE HITCH WEIGHT, THERE IS A 'SAFETY FACTOR' OF 3.5% EQUATING TO 70 LBS PER TIRE.  THIS IS A VERY SMALL TOLERANCE, MEANING THE UNIT WOULD HAVE TO BE PERFECTLY DESIGNED TO EVENLY DISTRIBUTE THE WEIGHT BETWEEN THE 4 TIRES, HAVE THE STORAGE COMPARTMENTS DESIGNED TO BALANCE THE UNIT, AND IT WOULD REQUIRE THE OWNER TO BE VERY CAREFUL TO LOAD THE UNIT EQUALLY SO AS TO NOT OVERLOAD ONE SPECIFIC TIRE. PREVIOUSLY I REPLACED THE TIRES WITH IDENTICAL TIRES.  BECAUSE OF THE UNSTABLE TRAVELING CONDITIONS CREATED BY A BLOWOUT, A RECALL SHOULD BE ISSUED TO REQUIRE REPLACING THE LOAD RANGE C TIRES WITH LOAD RANGE D TIRES. *TR",
        "vin": "4V0TC28207A"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "02/14/2009",
        "dateOfIncident": "02/14/2009",
        "fire": false,
        "manufacturer": "Crossroads RV",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10258646,
        "products": [
            {
                "manufacturer": "Crossroads RV",
                "productMake": "CROSSROADS",
                "productModel": "CRUISER",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "NO INCIDENT. *TR",
        "vin": ""
    }
]