[
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/09/2008",
        "dateOfIncident": "01/19/2008",
        "fire": false,
        "manufacturer": "M H Eby, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10227170,
        "products": [
            {
                "manufacturer": "M H Eby, Inc.",
                "productMake": "EBY",
                "productModel": "TRAILER",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MANUFACTURER OF THE BOAT TRAILER FAILED TO PROPERLY BOLT THE LEFT BRAKE CALIPER TO AXLE, THE FORWARD BOLT WAS NOT INSTALLED. FACTORY PAINT CLEARLY INDICATES THAT THE BOLT WAS NEVER INSTALLED. I PURCHASED THE BOAT AND TRAILER (6000 LBS) IN ST. LOUIS AND TOWED THEM TO FLORIDA. I BELIEVE THE CALIPER CAME OFF OF THE BRAKE ROTOR AFTER THE FIRST DAY OF DRIVING WHEN I BACKED THE VEHICLE. I DID NOT KNOW THAT THE CALIPER WAS OFF UNTIL I REACHED MY HOME AND THE VEHICLE WOULD NOT BACK UP. THE DANGLING CALIPER DAMAGED THE RIM AND BROKE THE BRAKE LINE. THE TRAILER AND PARTS REMAIN IN THE DRIVEWAY UNREPAIRED AS THE MANUFACTURER REFUSED TO ACKNOWLEDGE FAULT. I PURCHASED A NEW TRAILER. THE MANUFACTURER IS PRESTIGE (NOT ON LISTING).  *TR",
        "vin": "4JHBT24287D"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/09/2007",
        "dateOfIncident": "10/06/2007",
        "fire": false,
        "manufacturer": "M H Eby, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10206049,
        "products": [
            {
                "manufacturer": "M H Eby, Inc.",
                "productMake": "EBY",
                "productModel": "TRAILER",
                "productYear": "2007",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Foreign Tire Sales, Inc.",
                "productMake": "FTS",
                "productModel": "YKS",
                "productYear": "9999",
                "size": "LT235/85R16",
                "type": "Tire"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 EBY HORSE TRAILER.  ONE MONTH AGO THE FIRST TIRE BLEW OUT ON THE RIGHT REAR AXLE. THE TIRE ON THE LEFT REAR AND THE LEFT FRONT SIDE OF THE AXLES BLEW OUT ON OCTOBER 6, 2007. THE TRAILER HAS FIVE TIRES AND THEY WERE REPLACED IMMEDIATELY AFTER THE RECENT FAILURE OCCURRED. THE TIRES WERE MANUFACTURED BY QUINGDAO RUBBER FACTORY. THE TIRE SIZE WAS 235/85/16. THERE WAS NO NAME ON THE TIRE; HOWEVER, A TIRE DEALER CONFIRMED THAT THEY WERE FTS TIRES AND WHERE THEY WERE MANUFACTURED BASED ON THE DOT NUMBER. HE HAS PROOF THAT EACH TIRE HAD THE CORRECT TIRE PRESSURE OF 80 PRIOR TO THE FAILURE. THE TIRE SIZE WAS 235/85/16. THE HORSE TRAILER DOESN'T HAVE AN ENGINE. THE THREE TIRES BLEW OUT AND THERE WERE FIVE TIRES ON THE TRAILER. THE CONTACT STATED THAT THE BLOW OUT WAS SO SEVERE THAT THERE WAS NOTHING LEFT TO PHOTOGRAPH. THE HORSE TRAILERS VIN WAS UNAVAILABLE. THE TIRES FAILURE MILEAGE WAS 10,000.   UPDATED 01/09/08. *LJ  THE CONSUMER STATED MANUFACTURER SENT CHECK TO COVER THE COST FOR REPLACEMENT TIRES. UPDATED 12/12/07  *TR",
        "vin": "4A2LG292871"
    }
]