[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/08/2011",
        "dateOfIncident": "11/09/2009",
        "fire": false,
        "manufacturer": "EXECUTIVE COACH BUILDERS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10395289,
        "products": [
            {
                "manufacturer": "EXECUTIVE COACH BUILDERS",
                "productMake": "EXECUTIVE COACH",
                "productModel": "LIMOUSINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MANUFACTURING DEFECT OF NEW LIMOUSINE DUE TO USING A SUBSTANDARD 3M PRODUCT.  THE COMPANY HAS ACKNOWLEDGED THE PROBLEM BUT WILL NOT ISSUE A RECALL.  THE LIMOUSINE IS CRACKING. OUR COMPANY PURCHASED A \"NEW\" LEFTOVER 2007 ACCOLADE (14 PASSENGER CHEVY SUBURBAN LIMOUSINE W/ ESCALADE KIT) ON MARCH 4TH, 2009 FROM EXECUTIVE COACH BUILDERS IN SPRINGFIELD, MO.  THE VEHICLE HAD ONLY 966 MILES AT ITS FIRST STATE PA INSPECTION MARCH 6TH 2009.  SINCE THE TIME OF PURCHASE THE VEHICLE HAS CRACKED TWICE AND BEEN REPAIRED TWICE IN THE LONG CENTER PORTION OF THE VEHICLE ON BOTH SIDES DUE TO A MANUFACTURING DEFECT USING A SUBSTANDARD 3M PRODUCT AS STATED FROM ABBY BAKARE OF EXECUTIVE COACH BUILDERS.  THE VEHICLE IS AGAIN STARTING TO CRACK AND DETERIORATE AGAIN FOR THE 3RD TIME WITH ONLY 13,638 MILES ON IT AS OF APRIL 6TH 2011.  THE AUTO BODY SHOP THAT HAS REPAIRED THE VEHICLE TWICE HAS INFORMED US THE VEHICLE WILL CONTINUE TO CRACK DUE TO POOR CRAFTSMANSHIP AND WINDOWS COULD BLOW OUT WITH PASSENGERS IN THE VEHICLE CAUSING DEATH AND INJURIES.  I HAVE SPOKEN TO THE LIMOUSINE BUILDER ON SEVERAL DIFFERENT OCCASIONS AND THEY HAVE ACKNOWLEDGED THAT THERE IS A PROBLEM AND WILL REPAIR IT IN THE SPRING OF 2011.  WE HAVE NEVER RECEIVED ANY TYPE OF WRITTEN RECALL STATING THE VEHICLE HAS A DESIGN FLAW AND THE VEHICLE WILL BE REPAIRED PROPERLY OR REPLACED.  THE VEHICLE WAS REPAIRED IN NOVEMBER OF 2009 AND AGAIN IN NOVEMBER OF 2010 BY A LOCAL AUTO BODY SHOP BODY.  THE LIMOUSINE CAME WITH A 3 YEAR WARRANTY / 36,000 MILE WARRANTY OR WHICH EVER CAME FIRST.  I HAVE TRIED TO CONTACT THE OWNER DAVID BAKARE TWICE VIA TELEPHONE AND HAVE HAD NO RETURN CALL.  I WOULD LIKE THE VEHICLE RECALLED IMMEDIATELY AND FIXED / REPLACED UNDER WARRANTY WITH THE GUARANTEE THAT THE VEHICLE WILL NOT CRACK OR WINDOWS BLOW OUT WITH PASSENGERS IN THE LIMO. THE VEHICLE HAS BEEN PUT OUT OF SERVICE ON 2 SEPARATE OCCASIONS CAUSING US TO LOOSE INCOME AND BUSINESS. THE VEHICLE IS UNSAFE AND COULD CAUSE SERIOUS INJURY OR DEATH.  *TR",
        "vin": "3GNGC26K07G"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/08/2010",
        "dateOfIncident": "10/08/2010",
        "fire": false,
        "manufacturer": "EXECUTIVE COACH BUILDERS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10359713,
        "products": [
            {
                "manufacturer": "EXECUTIVE COACH BUILDERS",
                "productMake": "EXECUTIVE COACH",
                "productModel": "LIMOUSINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "2007 LINCOLN LIMOUSINE. CONSUMER STATES MILEAGE WAS INCORRECT UPON PURCHASE AND RUST COMING FROM THE INSIDE TO THE OUTSIDE OF THE VEHICLE *TGW CONSUMER SENT DUPLICATE LETTER *TGW",
        "vin": ""
    }
]