[
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/01/2013",
        "dateOfIncident": "07/07/2008",
        "fire": false,
        "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10522657,
        "products": [
            {
                "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
                "productMake": "FLEETWOOD",
                "productModel": "TERRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 >101F STOPPED, LET ENGINE RUNNING FOR ABOUT 10MIN ENGINE TURNED OFF BY ITSELF.  TRIED TO RESTART BUT, NO STARTER ENGAGEMENT, HAD TO TURN OF THE IGN. SWITCHED AND THEN THE ENGINE RESTARTED, CONTINUE TO DRIVE FOR A FEW MILES AND ENGINE TURNED OFF AGAIN THIS TIME IN THE MIDDLE OF THE ROAD.  TRIED TO START IN NEUTRAL BUT, HAD TO PUT THE TRANSITION INTO PARK AND TURN OFF THE IGN. SWITCH AND THE ENGINE WOULD RESTARTED.  CONTINUING 2 OR 3 MORE TIMES TILL THE VEHICLE WAS OPERATING AT SPEEDS >25MPH (~300MILES).  TOOK THE VEHICLE IN FOR REPAIR A COUPLE OF ADJUSTMENTS MADE.  NEXT USAGES THE EXTERNAL TEMP WAS MUCH LOWER 80 TO 85F AND WE HAD NO PROBLEMS.  2013 >105F STOPPED LEFT ENGINE RUNNING AND THE ENGINE TURNED OFF AGAIN ALL BY ITSELF.  TRIED TO RESTART BUT, NO STARTER ENGAGEMENT SO, HAD TO TURN OF THE IGN. SWITCH AND THEN THE ENGINE RESTARTED, CONTINUED TO DRIVE TO CAMP SITE AND ENGINE CONTINUED TO DIE BY ITSELF (NOTE: ALARM POSTED NO J1850 ACTIVITY) UNTIL WE HAD TO WAIT >30MINS TILL THE ENGINE WOULD RESTART.  THIS WAS ALL WHILE BLOCKING THE PATH WAY IN THE CAMP GROUNDS.  BIGGEST FEAR IS THIS OCCURRING ON HIGHWAYS AS STEERING/BREAKS ARE QUESTIONABLE THIS CONDITION.  SEARCHED THE WEB FOR RECALLS, NO J1850 NO CLEAR ACTIONS.  I DID LOOK INTO THE J1850 PROTOCOL BY D. JOHN OLIVER INTEL CORPORATION AND FOUND THAT IC CHIPS USED HAVE A MAX TEMPERATURE OF 125C OR 257F.  OPERATING TEMP OF THE ENGINE IS ~200F, EXHAUST MANIFOLD TEMPS >400F, VEHICLE IN AN IDLE CONDITION I.E. NO AIR FLOW ACROSS THE VEHICLE ECM (THE ECM IS MOUNTED ABOVE ENGINE/RADIATOR WHERE ALL THE HEAT FROM THE ENGINE COMPARTMENT EXITS IN AN IDLE CONDITION) IT IS VERY POSSIBLE THAT THE CHIPS ARE OVERHEATING AND UPON THE OVERHEATING CONDITION THE ECM NEEDS TO BE RESET I.E. HAVING TO TURN OFF THE IGNITION TO GENERATE A WAKE UP CONDITION...  CHIPS (AU5780, AU5780A & 7510) NOT TESTED FOR TEMP.  CONTINUING TO TEST NOW!  *TR",
        "vin": "5B4MP67G173"
    },
    {
        "components": "STRUCTURE,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "08/27/2008",
        "dateOfIncident": "07/29/2008",
        "fire": false,
        "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10239921,
        "products": [
            {
                "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
                "productMake": "FLEETWOOD",
                "productModel": "TERRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 FLEETWOOD TERRY LX31M.  WHEN THE CONTACT ATTEMPTED TO CLOSE THE STORAGE DOOR ON THE DRIVER'S SIDE, THE LATCH WOULD NOT CONNECT.  SHE COULD NOT CLOSE THE DOOR.  THE CONTACT ALSO NOTICED THAT THE DOORS DID NOT FIT PROPERLY ON THE VEHICLE.  THE VEHICLE WAS TAKEN TO THE DEALER AND THEY STATED THAT THE DOORS NEEDED TO BE ADJUSTED.  SHE DID NOT NOTICE ANY DIFFERENCES BEFOREHAND.  THE CURRENT AND FAILURE MILEAGES WERE 6,027. UPDATED 09/24/08. *LJ  THE STEPS EXTENDED WHEN THEY SHOULDN'T HAVE. UPDATED 09/26/08. 8JB",
        "vin": "5B4MP67G863"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "08/17/2007",
        "dateOfIncident": "07/03/2007",
        "fire": false,
        "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10199884,
        "products": [
            {
                "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
                "productMake": "FLEETWOOD",
                "productModel": "TERRA",
                "productYear": "2007",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
                "productMake": "FLEETWOOD",
                "productModel": "ALL MODELS",
                "productYear": "1990",
                "type": "Equipment"
            }
        ],
        "summary": "THANK YOU FOR YOUR TIMELY INVESTIGATION INTO THE UNSAFE CONDITIONS OF THE 2007 FLEETWOOD TERRA LX MOTORHOME I CURRENTLY OWN.       FIRST IS THE DIRECT POSITIONING OF THE EXHAUST PIPE UNDER THE FUEL FILL.   FLEETWOOD OWNER RELATIONS IN NO WAY SEES THIS AS A POTENTIAL SAFETY HAZARD AND REFUSES TO ADDRESS THIS DANGEROUS ENGINEERING DEFECT.  HOWEVER, THIS SAME EXACT MODEL, 6 MONTH LATER IS NOW BEING PRODUCED WITH THE EXHAUST EXITING CORRECTLY FROM THE OPPOSITE SIDE. SECONDLY, DUE TO A DIFFERENT MANUFACTURING DEFECT, FLEETWOOD HAD TO 'MODIFY' THE FUEL FILLER NECK AND VENT LINE BECAUSE IT WOULD NOT TAKE FUEL.  IMAGINE MY SURPRISE WHEN I SAW THEIR REPAIR WAS HELD TOGETHER BY ZIP TIES AND THIN METAL STRAPS.  THIS IS SECURED IN NO WAY LIKE THE ORIGINAL CONFIGURATION.  GIVEN THE FATIGUE PRONE MATERIALS USED IN THE MANUFACTURER'S REPAIR, I NOW QUESTION THE SAFETY OF THE FUEL DELIVERY SYSTEM.  WHEN THIS REPAIR FAILS, POSSIBLY WHILE BEING DRIVEN, FUEL WILL BE THROWN EVERYWHERE UNDER THE COACH FOR MILES.  DID I MENTION THIS PATCH WORK REPAIR IS DIRECTLY OVER THE EXHAUST PIPE?  PLEASE ENSURE THESE UNSAFE CONDITIONS ARE ADDRESSED BY FLEETWOOD BEFORE SOMEONE IS INJURED OR KILLED. *TR",
        "vin": "5B4MP67GX63"
    }
]