[
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "12/13/2010",
        "dateOfIncident": "12/01/2010",
        "fire": false,
        "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10370436,
        "products": [
            {
                "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
                "productMake": "FLEETWOOD",
                "productModel": "BOUNDER",
                "productYear": "2007",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Norcold Inc.",
                "productMake": "NORCOLD",
                "productModel": "1200LRIM",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 FLEETWOOD BOUNDER EQUIPPED WITH A NORCOLD REFRIGERATOR, MODEL NUMBER 1200LR1M. THERE WAS A RECALL ASSOCIATED WITH NHTSA CAMPAIGN ID NUMBER 09E027000 (EQUIPMENT). THE MANUFACTURER WAS NOTIFIED ON NUMEROUS OCCASIONS REGARDING THE RECALL DEFECT; HOWEVER THERE WAS NO ASSISTANCE PROVIDED. IN ADDITION, THE DEALER INFORMED THAT THE RECALL PART WAS UNAVAILABLE AND THEY WERE UNCERTAIN OF THE ARRIVAL DATE FOR THE PART. THE SERIAL NUMBER WAS 9338242. THE VIN WAS UNAVAILABLE. THERE WAS NO FAILURE MILEAGE.   UPDATED 02/08/11*LJ",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "08/21/2010",
        "dateOfIncident": "07/01/2009",
        "fire": false,
        "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10350883,
        "products": [
            {
                "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
                "productMake": "FLEETWOOD",
                "productModel": "BOUNDER",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "FOGGY DOUBLE WINDOWS IN THE DRIVERS CAB OF A 2007 FLEETWOOD BOUNDER.  SE-GI WINDOWS.  COULD NOT SEE REAR VIEW MIRRORS.  WE HAD THE INSIDE PANE OF THE STATIONARY WINDOW TAKEN OUT BY A GLASS INSTALLER.  WE GOT NO HELP FROM FLEETWOOD OR SE-GI.  7 OF 10 WINDOWS ARE FOGGING.  WE FIRST NOTICE IT A YEAR AND A HALF AFTER WE BOUGHT THE NEW MOTORHOME. *TR",
        "vin": "5B4MP67G873"
    },
    {
        "components": "SERVICE BRAKES, AIR",
        "crash": false,
        "dateComplaintFiled": "07/16/2010",
        "dateOfIncident": "10/19/2009",
        "fire": false,
        "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10343641,
        "products": [
            {
                "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
                "productMake": "FLEETWOOD",
                "productModel": "BOUNDER",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 FLEETWOOD BOUNDER WITH A WORKHORSE CHASSIS. THE CONTACT STATED WHILE DRIVING AT 40 MPH WITH THE RV ATTACHED TO HIS VEHICLE, THERE WAS A BURNING ODOR IN THE VEHICLE. THE CONTACT FOUND THAT THE ODOR WAS COMING FROM THE REAR OF THE VEHICLE AND DISCONNECTED THE VEHICLE FROM THE RV. HE THEN STARTED THE RV AND NOTICED THAT THE BRAKE PEDAL HAD FELL INTO THE FLOORBOARD. THE ABS WARNING LIGHT WAS ALSO ILLUMINATED. CAME ON AND HE CALLED WORKHORSE. THE MANUFACTURER ADVISED TAKING THE VEHICLE TO AN AUTHORIZED DEALER FOR DIAGNOSTIC TESTING. THE DEALER REPLACED THE REAR BRAKES AND ALSO OTHER UNKNOWN REPAIRS. IN ADDITION, THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN ID NUMBER: 09V198000 (SERVICE BRAKES, AIR) BUT WAS ADVISED BY THE MANUFACTURER THAT THE RECALL REPAIRS WOULD NOT BE PERFORMED UNTIL HALF OF THE PARTS NEEDED TO MAKE REPAIRS WERE AVAILABLE. THE CONTACT STATED HE RECEIVED TWO ADDITIONAL RECALL LETTERS FROM THE MANUFACTURER BUT THE PARTS WERE NOT READILY AVAILABLE AND THE MANUFACTURER COULD NOT PROVIDE AN ESTIMATED TIME OF AVAILABILITY. THE VIN WAS NOT AVAILABLE. THE APPROXIMATE FAILURE MILEAGE WAS 15,831 AND THE CURRENT MILEAGE WAS 15,931.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/21/2007",
        "dateOfIncident": "01/22/2007",
        "fire": false,
        "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10193933,
        "products": [
            {
                "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
                "productMake": "FLEETWOOD",
                "productModel": "BOUNDER",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "2007 FLEETWOOD BOUNDER MOTORHOME.  DRIVERS'S SIDE SLIDE-OUT MOVES OUT ANYWHERE BETWEEN 2 TO 18 INCHES WHILE DRIVING VEHICLE. VEHICLE HAS BEEN TAKEN TO DEALERS TWICE FOR DIAGNOSIS/REPAIR.  FIRST TIME WAS DIAGNOSED WITH ALIGNMENT PROBLEM AND THE SLIDE-OUT WAS ALIGNED.  SECOND TIME WAS DIAGNOSED AS BRAKE RELEASE PROBLEM.  BOTH TIMES REPAIRS WERE UNSUCCESSFUL.  MANUFACTURER WANTS TO TRY TO AGAIN REPAIR SLIDE-OUT, HOWEVER, AFTER BOTH REPAIR ATTEMPTS, THE SLIDE-OUT DID NOT MALFUNCTION UNTIL IT HAD BEEN DRIVIN BETWEEN 200 AND 500 MILES.  THEREFORE, WE ARE AFRAID TO HAVE A 3RD REPAIR DONE AND NOT BE ABLE TO KNOW IF IT HAS BEEN CORRECTED UNTIL IT HAS BEEN DRIVING HUNDREDS OF MILES.  THE LAST 2 TIMES SLIDE-OUT CAME OUT WHILE DRIVING ON CALIFORNIA FREEWAY.  ONCE WAS ABOUT 12 INCHES, LAST TIME WAS ABOUT 18 INCHES.  WE COULD EASILY BE HIT BY ONE OF THE MANY LARGE TRUCKS ON THE FREEWAY IF IT SHOULD HAPPEN AGAIN.",
        "vin": "1F6NF53Y860"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/07/2007",
        "dateOfIncident": "12/30/2006",
        "fire": false,
        "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10178000,
        "products": [
            {
                "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
                "productMake": "FLEETWOOD",
                "productModel": "BOUNDER",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "CRUISE CONTROL GETS STOCK. WHEN ENGAGING ACCELERATION MODE AND SPEED ACCELERATE TO MORE THAN 10 INCREMENTS MILES WHEN DRIVING AT HIGHWAY SPEEDS. DEPRESSING DECELERATE WILL NOT LOWER THE SPEED AT ALL. CRUISE CONTROL MUST BE DISENGAGED TO STOP DECELERATION.  *NM",
        "vin": ""
    }
]