[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/05/2021",
        "dateOfIncident": "08/05/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427915,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2007 Ford F-550. The contact stated while driving 50 mph, the vehicle inadvertently stalled and lost power. There were no warning lights illuminated. The contact veered to the side of the roadway and was able to restart the vehicle. The contact stated that the failure recurred the same day while pulling to a parking lot. The contact contacted the manufacturer of the battery control circuit who instructed the contact to do a jumper wire to bypass the vehicle issue. The contact stated that the issue was resolved. The vehicle was not diagnosed nor repaired by an independent mechanic or dealer. The contact contacted the manufacturer to advise that the recall repair for NHTSA Campaign Number: 13V265000 (Electrical System) was not completed effectively however, the manufacturer informed the contact that the dealer needed to verify the information. The dealer was made aware of the failure and informed the contact they could not assist. The approximate failure mileage was 45,720.",
        "vin": "1F6NF53Y770"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/07/2021",
        "dateOfIncident": "04/18/2021",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415570,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2007 FORD F-550. THE CONTACT STATED THAT WHILE THE TRANSMISSION WAS IN THE PARK POSITION AND WITH THE ENGINE IDLING SUDDENLY FLAMES WERE PRESENT COMING FROM UNDER THE HOOD OF THE VEHICLE. THE FIRE DEPARTMENT WAS CALLED TO THE SCENE AND EXTINGUISHED THE FLAMES. DURING THE INCIDENT THE VEHICLE WAS DESTROYED. A REPORT WAS TAKEN BY THE SHERIFF'S DEPUTY. THE OWNER, A FIRE DEPARTMENT DIRECTOR, DETERMINED THAT THE FIRE WAS CAUSED BY A FAULTY ENGINE TURBO CHARGER. THE LOCAL DEALER AND MANUFACTURER WERE NOT CONTACTED. THE FAILURE MILEAGE WAS 6,000.   THE CONSUMER STATED 2007 BRUSH TRUCK IS GOING BACK TO WEIS FIRE SAFTEY IN KANSAS FOR A REBUILD. THE CONSUMER STATED THE INSURANCE COMPANY DEEMED THE TURBO CHARGER AS THE CAUSE OF THE FIRE.",
        "vin": "1FDAF57P77E"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/26/2019",
        "dateOfIncident": "01/01/2019",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11191689,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 FORD F-550 SD. THE CONTACT STATED THAT THE TRANSFER CASE FAILED AND CAUSED THE CARPET TO CATCH FIRE. THE CONTACT WAS ABLE TO EXTINGUISH THE FIRE. THERE WERE NO WARNING INDICATORS ILLUMINATED. MIKE THOMPSON'S RV SUPER STORE   (902 RV CENTER DR, COLTON, CA 92324, (909) 318-2175) DIAGNOSED THAT THE TRANSFER CASE NEEDED TO BE REPLACED. THE VEHICLE HAD NOT BEEN REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 140,000.",
        "vin": "1F6NF53Y470"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/26/2018",
        "dateOfIncident": "02/26/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11074813,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "2007 FORD F-550. CONSUMER WRITES IN REGARDS TO BATTERY CONTROL CENTER SAFETY RECALL. *LD  *JS",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/12/2016",
        "dateOfIncident": "10/05/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10915481,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 FORD F-550 SD. THE CONTACT STATED THE VEHICLE WAS LEAKING COMPRESSION FROM THE CYLINDERS INTO THE COOLANT SYSTEM. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED WITH A MALFUNCTIONED HEAD GASKET. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 38,000.",
        "vin": "1FDAX57P37E"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/05/2013",
        "dateOfIncident": "11/30/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10554934,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 FORD F-550 SD. THE CONTACT STATED THAT WHILE DRIVING 30 MPH, THE BRAKE LIGHTS AND TURN SIGNAL LIGHTS FAILED. THE CONTACT NOTIFIED THE DEALER AND THEY STATED THAT THE MULTI- FUNCTION SWITCH NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 74,000.",
        "vin": "1FDAX57P97E"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/23/2013",
        "dateOfIncident": "09/13/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10544963,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2007 FORD F-550 WITH ONLY 31000 MILES AND THE VEHICLE LOST POWER AND STALLED OUT ON SIDE OF ROAD. WHEN FORD DEALERSHIP CHECKED THE VEHICLE IT WAS FOUND THAT THE FUEL TANK LINER HAD DETERIORATED AND RUSTED CAUSING DEBRIS TO ENTER INTO THE FUEL SYSTEM WHICH DAMAGED THE FUEL PUMP, INJECTORS AND OTHER PARTS OF THE FUEL SYSTEM. AFTER TALKING WITH OTHER FORD DEALERSHIPS WE FOUND OUT THAT THIS HAS BEEN A PROBLEM WITH OTHER VEHICLES THAT HAVE THIS SAME TANK. IF FORD WOULD HAVE RECALLED THE TANK OR AT LEAST MADE IT KNOWN TO THE OWNERS THAT THERE WAS A PROBLEM ALL THE DAMAGE WOULD NOT HAVE HAPPENED. THIS HAS COST US ALREADY $2658 TO THE FORD DEALERSHIP AND WE HAVE ABOUT $1500 MORE TO SPEND TO CORRECT THE PROBLEM----ALL BECAUSE FORD WOULD NOT EVEN LET US KNOW THERE WAS A PROBLEM THAT COULD HAVE BEEN FIXED FOR A LOT LESS.",
        "vin": "1FDAF57P67E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/25/2013",
        "dateOfIncident": "08/12/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10521712,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 FORD F-550 SD . THE CONTACT STATED THAT HE WAS SITTING AT A STOP LIGHT WHEN THE ENGINE BEGAN TO SHAKE VIOLENTLY. THE CONTACT STATED THAT HE DEPRESSED THE ACCELERATOR PEDAL AND THERE WAS A LOUD BANG. THE VEHICLE STALLED AND OIL SPILLED ONTO THE GROUND. THE VEHICLE WAS TOWED TO THE DEALER FOR INSPECTION AND THEY STATED THAT THE ENGINE NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED BUT THE FAILURE RECURRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 75,187.",
        "vin": "1FDAF56P27E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/04/2013",
        "dateOfIncident": "06/01/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10515055,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 FORD F550 SD. THE CONTACT STATED THAT WHILE DRIVING 70 MPH, THE VEHICLE STALLED WITHOUT WARNING AS STEAM EMERGED FROM THE EXHAUST PIPE. THE VEHICLE WAS TAKEN TO THE DEALER FOR INSPECTION WHERE THEY STATED THAT THE OIL COOLER NEEDED TO BE REPAIRED. THE VEHICLE WAS REPAIRED BUT THE FAILURE RECURRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 240,000.",
        "vin": "1FDAF57P27E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/26/2013",
        "dateOfIncident": "01/02/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10500525,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "FORD GAS TANK DELAMINATION.  LOSS OF POWER.  ENGINE MISSING.  THIS HAS BROUGHT ME EXTREME HEARTACHE AT THE WORST TIME.  I AM A SEASONAL WORKER WHO RELIES SOLELY ON HIS TRUCK.  WITHOUT IT I AM OUT OF BUSINESS.  IT WILL COST ME ANYWHERE FROM $2,000 TO $6,000 TO FIX IT.  AND I SIMPLY DON'T HAVE IT.  *TR",
        "vin": "1FDAF57PX7E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/07/2012",
        "dateOfIncident": "11/10/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10483624,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 FORD F550 SD. THE CONTACT STATED THAT HE HEARD A HISSING NOISE COMING FROM UNDER THE HOOD. THE CONTACT LIFTED THE HOOD AND NOTICED THAT THE HEAD GASKET WAS BLOWN. THE VEHICLE WAS TAKEN TO THE DEALER FOR INSPECTION WHERE THEY ADVISED THAT THE HEAD GASKET NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED AND STATED THAT THE VEHICLE WAS NO LONGER UNDER WARRANTY. THE FAILURE MILEAGE WAS 65,000.",
        "vin": "1FDAW56P97E"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/10/2012",
        "dateOfIncident": "07/18/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10479674,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR BRAKE PADS ONLY LAST 7,000 - 10,000 MILES, AND REAR BRAKE CALIPERS ARE OVERHEATING BLOWS OUT CALIPER SEAL. THE TRUCK HAS BEEN TO FORD AND WAS TOLD THIS WAS NORMAL. ALSO TOOK VEHICLE TO 2 OTHER REPAIR SHOPS AND THEY HAVE REPLACED EVERY BRAKE PART ON THE  TRUCK EXCEPT THE MASTER CYLINDER, ABS MODULE, STEEL LINES. THE BRAKE PRESSURE TO THE FRONT AND REAR WHEELS WAS CHECKED AT THE LAST FAILURE AND THEY ARE THE SAME PRESSURE. THE REAR BRAKES HAVE BEEN REPLACE ABOUT 15 TIMES IN 123,000 MILE ON VEHICLE. WE HAVE AN IDENTICAL TRUCK TO THIS IN OUR FLEET AND THE REAR BRAKES LAST ABOUT 80,000 MILES.  *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "02/21/2012",
        "dateOfIncident": "02/17/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10448820,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "IT STARTED RUNNING REALLY SLUGGISH. WOULDN'T GO UP HILLS, BOGGING DOWN, ETC.  SECOND TIME THAT THE DEALER TOLD ME THAT THEIR IS FLAKING IN THE FUEL TANK.  NEED TO REPLACE THE TANK BECAUSE FORD TELLS ME THAT THE DIESEL GAS IS CAUSING THE FLAKING IN THE  TANK.  THIS HAPPEN BEFORE JUST AFTER 3 YEARS AND AT A COST OF $3.000.  NOW THE SAME THING, ONLY FORDS SEEM TO HAVE THIS PROBLEM WITH THE FLAKING AND THEY WILL DO NOTHING ABOUT IT.      ALL OVER THE INTERNET OTHERS WITH 2005-2007 FORD DIESELS ARE HAVING THE SAME PROBLEM.  I LIVE IN NEW YORK AND PROBLEMS ARE HAVING ALL OVER THE US.  IN 2 1/2 YEARS SHOULD NOT HAVE A PROBLEM WITH THE GAS TANK AGAIN.  FORD NEEDS TO STEP UP AND SAY THAT THEIR IS A PROBLEM WITH THIS AND COVER IT!  *TR",
        "vin": "1FDAF56P97E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "01/23/2012",
        "dateOfIncident": "01/20/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10444930,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 FORD F-350. THE CONTACT STATED THAT THE VEHICLE WOULD LOOSE POWER AND WOULD NOT ACCELERATE OVER 30 MPH. THE CONTACT TOOK THE VEHICLE TO THE DEALER AND WAS TOLD THAT THE FAILURE OCCURRED BY A DELIMITATION OF THE FUEL TANK. THE MANUFACTURER WAS CONTACTED AND ADVISED THAT THE FAILURE WAS CAUSED BY THE TYPE OF DIESEL BEING USED IN THE VEHICLE. THE CONTACT STATED THAT THE SAME EXACT FAILURE OCCURRED IN AN F-550 MODEL THAT HE ALSO OWNED. THE VEHICLE WAS REPAIRED. THE FAILURE MILEAGE WAS UNKNOWN.   UPDATED 02/15/12*LJ",
        "vin": "1FDWX37PX5E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "01/23/2012",
        "dateOfIncident": "01/04/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10444931,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 FORD F-550. THE CONTACT STATED THAT THE VEHICLE WOULD LOOSE POWER AND WOULD NOT ACCELERATE OVER 30 MPH. THE CONTACT TOOK THE VEHICLE TO THE DEALER AND WAS TOLD THAT THE FAILURE OCCURRED BY A DELIMITATION OF THE FUEL TANK. THE MANUFACTURER WAS CONTACTED AND ADVISED THAT THE FAILURE WAS CAUSED BY THE TYPE OF DIESEL BEING USED IN THE VEHICLE. THE VEHICLE WAS REPAIRED. THE FAILURE AND THE CURRENT MILEAGE WAS 35,000.   UPDATED 02/15/12*LJ  UPDATED 02/17/12",
        "vin": "1FDAX57P27E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/21/2011",
        "dateOfIncident": "11/24/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10378111,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 FORD F-550. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 30 MPH THE VEHICLE SUDDENLY STALLED. IN ORDER TO RESTART THE VEHICLE THE DRIVER HAD TO COAST THE VEHICLE TO THE SIDE OF THE ROAD AND WAIT A COUPLE OF MINUTES BEFORE RESTARTING IT. THE VEHICLE WAS INSPECTED BY A DEALER WHO STATED THAT THE GROUND WIRE HANGING FROM THE ENGINE UNDERNEATH THE VEHICLE NEEDED TO REPLACED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS UNKNOWN. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "10/27/2010",
        "dateOfIncident": "10/19/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10362691,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2007 FORD F550 DIESEL TRUCK.  THE TRUCK SUDDENLY LOST POWER AND WAS ON THE VERGE OF STALLING.  THE TRUCK WAS DRIVEN BACK AT LESS THAN 40 MPH ON THE INTERSTATE.  AFTER TAKING IT TO THE DEALERSHIP THEY DISCOVERED THAT THE FUEL TANK WAS DELAMINATING.  FORD IS NOT COVING THE TANK UNDER WARRANTY STATING THAT IT IS WAS CAUSED BY THE CHANGES IN THE EPA FUEL REQUIREMENTS IN 2009.  THIS PROBLEM HAS ALSO CAUSED THE FUEL PUMP AND 2 INJECTORS TO FAIL ALSO.  THE REPAIRS ARE OVER $2,600.  AFTER LOOKING ONLINE, IT APPEARS THAT THIS IS A MAJOR PROBLEM WITH FORD TRUCKS.  IT MAKES FOR A VERY UNSAFE SITUATION CONSIDERING MOST OF THESE TRUCKS ARE USED FOR TOWING, HAULING, AMBULANCES, FIRETRUCKS, ETC. *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "04/27/2010",
        "dateOfIncident": "03/25/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10327758,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 FORD F550. WHILE DRIVING AT SPEEDS OF 30 MPH, THE VEHICLE BEGAN TO DECREASE IN SPEED WITHOUT WARRANT AND THEN STALLED. THE CONTACT WAS UNABLE TO RESTART THE VEHICLE AND HAD IT TOWED TO THE DEALER. THE DEALER ADVISED THE FAILURE WAS DUE TO THE USAGE OF BAD DIESEL FUEL. THE VEHICLE WAS REPAIRED BY THE DEALER. THE CONTACT STATED THE FAILURE RECURS INTERMITTENTLY. THE FAILURE MILEAGE WAS 15,000 AND THE CURRENT MILEAGE WAS 22,000.   THE CONSUMER STATED THE TRUCK STALLED ON THE HIGHWAY. THE TRUCK WAS TOWED TO THE DEALER WHERE THEY STATED WATER WAS IN THE FUEL TANK. THEY DRAINED IT AN PUT IN A NEW PUMP ASSEMBLY. UPDATED 09/30/10",
        "vin": "1FDAF57P47E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "11/20/2009",
        "dateOfIncident": "10/27/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10293034,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STOPPED WORKING.  THE CULPRIT WAS THE FORD FUEL TANK THAT HAD DELAMINATED.  THE TANK HAD TO BE REPLACED. THE COST: $1600.00.  ADDITIONALLY, THERE WAS A LOSS OF REVENUE AS THIS VEHICLE IS USED FOR PRODUCTION PURPOSES.  FORD DENIED RESPONSIBILITY FOR ANY DEFECTS OF THEIR FUEL TANKS.  WITH NO OTHER CHOICE, WE HAD TO PAY FOR THE REPAIRS OUT OF POCKET.  THIS IS A SAFETY ISSUE, AS THESE VEHICLES ARE USED FOR COMMERCIAL USAGE DAILY.  THIS IS ALSO A FINANCIAL BURDEN THAT HAS BEEN FORCED ONTO US UNFAIRLY.  THEY NEED TO TAKE RESPONSIBILITY AND RECALL THESE FUEL TANKS. *TR",
        "vin": "1FDAF56P27E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "09/22/2009",
        "dateOfIncident": "09/18/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10284916,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DIESEL FUEL TANK HAD CORRODING AND SHOWING RUST ON THE INSIDE OF THE TANK.  SEEMS LIKE A DELAMINATION PROBLEM.  THE TRUCK IS STILL WITHIN THE WARRANTY PERIOD BUT FORD REFUSES TO COVER THE PROBLEM BECAUSE THEY DO NOT CONSIDER IT A MANUFACTURER'S DEFECT.  THEY BLAME THE DIESEL FUEL COMPANIES.      FORD SAID THE TANKS WERE MANUFACTURED FOR THE DIESEL FUEL SPECIFICATIONS AT THAT TIME, NOT NOW.  THE DELAMINATED MATERIAL IS THE LINING OF THE FUEL TANK.  THIS ALSO COST TWO FUEL INJECTORS TO FAIL.      THE TRUCK STALLED AND WOULD NOT RUN OR START.  HAD TO CALL THE FORD DEALER TO TOW MY TRUCK TO THEIR SITE.    HAD TO REPLACE THE FUEL TANK AND TWO INJECTORS AT A COST OF $3,000.    THIS PROBLEM IS NOT HAPPENING TO A GMC, CHEVY. OR DODGE DIESEL TRUCK. *TR",
        "vin": "1FDAF56P97E"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/12/2009",
        "dateOfIncident": "11/28/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10268531,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED BRAND NEW FORD F-550 ON 11/27/06. ON A ROAD TRIP ON 11/28/06 THE WIFE AND I NOTICED A VERTICAL SHIMMY AT 50MPH. WE CONTINUED TO ACCELERATE AND THE SHIMMY STOPPED UNTIL WE HIT 60MPH AND A HORIZONTAL SHAKING BEGAN. THE SHAKING IS INTERMITTENT BUT QUITE PRONOUNCED. SEVERAL TRIPS TO THE DEALERSHIP FAILED TO CORRECT THE PROBLEM. AT TIMES, AFTER HITTING A BUMP IN THE ROAD, AN UNCONTROLLABLE VIBRATION WITH SHAKE THE ENTIRE VEHICLE FOR SEVERAL SECONDS. THE VIBRATIONS CONTINUE TO THIS DAY VIRTUALLY EVERY TIME THE VEHICLE IS DRIVEN. *TR",
        "vin": "1FDAX56Y67E"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/18/2009",
        "dateOfIncident": "11/20/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10259223,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 FORD F550.  THE CONTACT STATED THAT THE BRAKES FAIL WHEN DRIVING DOWNHILL OR ON ANY SURFACE.  THE BRAKES CAUSE THE VEHICLE TO BUCK VIOLENTLY WHENEVER THE BRAKE PEDAL IS DEPRESSED.  THE DEALER COULD NOT DETERMINE THE CAUSE OF THE FAILURE; HOWEVER, THEY SWITCHED SOME PARTS IN THE VEHICLE.  THE FAILURE PERSISTS AND IS BECOMING WORSE.  THE FAILURE MILEAGE WAS 29,000.",
        "vin": "1FDAF56P47E"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/02/2008",
        "dateOfIncident": "05/30/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10233077,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "STRONG ODOR OF GAS NOTED AFTER DRIVING 50 MILES (ROUND TRIP). UPON FURTHER INSPECTION IT WAS DISCOVERED THAT A MAJOR GAS LEAK WAS OCCURRING AT THE REAR OF THE TRUCK. THE DEALER INDICATED A FAULTY FACTORY INSTALLATION AND ROUTING OF THE GAS LINE AROUND THE AIR SUSPENSION. THE GAS LINE WAS REPLACED.  *TR",
        "vin": "1FDAX56Y67E"
    }
]