[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/28/2021",
        "dateOfIncident": "07/21/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426850,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2007",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Toyo Tire Holdings of Americas, Inc.",
                "productMake": "NITTO",
                "productModel": "DURA GRAPPLER HIGHWAY TERRAIN DURA-BELT",
                "productYear": "9999",
                "size": "LT275/65 R18 123Q",
                "type": "Tire"
            }
        ],
        "summary": "The contact owns a 2007 Ford F-350 equipped with Nitto tires, Tire Line: Dura Grappler, Tire Size: 275/65/18, DOT number: EAW2215. The contact stated that while driving the vehicle there was an abnormal sound coming from the rear of the vehicle. Upon inspection it was discovered that the driver’s side rear tire had experienced tread separation. The cause of the failure was not determined. The local dealer was notified of the failure and informed the contact that the tires were not included in NHTSA campaign number: 14T014000 (Tires) due to the manufacturing date of the tire. The contact indicated that the tire had experienced the same failure listed in the recall. The manufacture was not yet notified. The failure mileage was 30,000. Consumer stated thread separation happened with the second tire 2 weeks later. Manufacture was notified and all 4 tires have now been replaced prematurely.",
        "vin": "1FDWX34547E"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/20/2020",
        "dateOfIncident": "10/15/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365421,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE I BOUGHT THIS 2007 FORD F 350 I'VE HAD NOTHING BUT PROBLEMS FUEL PUMP INJECTORS EGR COOLER FUEL FILTERS BRAKES THE TRUCK HAS BEEN IN TH E SHOP THREE TIMES SINCE I'VE HAD  IT NOW I'M PRAYING DONT ANYTHING ELSE GO WRONG WHAT A WASTE.;",
        "vin": "1FTWW33P27E"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/29/2018",
        "dateOfIncident": "10/09/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11143726,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STARTED RUNNING VERY ROUGH WHEN GOING DOWN THE ROAD, AND HARD TO START. FOUND THE FICM WIRING HARNESS SMOKING AND CHAFED THROUGH WHERE IT HAD RUBBED ON ENGINE.",
        "vin": "1FTWW31P17E"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/07/2018",
        "dateOfIncident": "05/01/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11092264,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 FORD F-350. THE CONTACT RECEIVED FIELD ACTION NOTICE NUMBER: 09L02 FROM THE MANUFACTURER. WHILE DRIVING 40 MPH ON BUMPY TERRAIN, THE VEHICLE SHOOK. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE CONTACT CALLED A LOCAL DEALER (BOB THOMAS FORD INC, 2215 DIXWELL AVE, HAMDEN, CT 06514, (203) 281-7500) AND WAS INFORMED THAT THERE WOULD BE A DIAGNOSTIC FEE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED DUE TO THE DIAGNOSTIC FEE. THE MANUFACTURER WAS NOTIFIED AND ADVISED THE CONTACT TO TAKE THE VEHICLE TO THE LOCAL DEALER, AND THAT THERE WOULD BE A CHARGE FOR VEHICLE INSPECTIONS. THE FAILURE MILEAGE WAS APPROXIMATELY 7,000.",
        "vin": "1FTWF31567E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/20/2017",
        "dateOfIncident": "03/01/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11035129,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "6.0 LITER DIESEL ENGINE NEEDS OIL COOLER & EGR COOLER REPLACED EVERY 100,000 MILES ACCORDING TO FORD MECHANICS.  MY ENGINE HAD THIS PROBLEM AT 98,000 MILES.  THE COOLER IS UNDERNEATH THE INTAKE MANIFOLD MAKING REPAIRS VERY EXPENSIVE.  THE MECHANICS TELL ME TO WATCH FOR SMOKE, LESS POWER, ETC. AND TO PULL OFF THE SIDE OF THE ROAD AND CALL A TOW TRUCK WHEN I EXPERIENCE THOSE PROBLEMS OR I COULD DESTROY THE ENGINE.  THEY SAID MY ENGINE OIL IS RUNNING MUCH HOTTER THAN MY ENGINE COOLANT WHICH COULD CAUSE OIL SEALS TO BEGIN LEAKING.  THERE IS NO WAY TO VERIFY THIS PROBLEM.  I DON'T HAVE A OIL TEMPERATURE GAUGE IN MY TRUCK JUST A OIL PRESSURE GAUGE.  FORD NEEDS TO STOP SELLING THIS ENGINE OR REPAIR THE PROBLEM.",
        "vin": "1FTWW31P57E"
    },
    {
        "components": "STEERING,SUSPENSION,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/18/2017",
        "dateOfIncident": "08/15/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11016131,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN  GAINING  SPEED ON HIGHWAY VEHICLE SHAKES TO THE POINT OF INSTABILITY - AFRAID TO DRIVE STOCK TIRES NOT THE PROBLEM  HAVE CHECKED THE ALIGNMENT -TWICE  CANNOT LOCATE ISSUE NO RECALL ISSUED",
        "vin": "1FTWW33P57E"
    },
    {
        "components": "STEERING,SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/07/2016",
        "dateOfIncident": "06/13/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10873035,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS AN ISSUE THAT IS KNOWN TO THE FORD MOTOR COMPANY INVOLVING THIS TYPE OF VEHICLE WHICH IS SEVERE STEERING WHEEL AND FRONT WHEEL VIBRATIONS.  I HAVE RECEIVED AT LEAST TWO LETTERS FROM FORD CONCERNING THIS ISSUE. THE ONE I HAVE BEFORE ME IS LISTED AS LITERATURE PROGRAM 09L02.   IT STATES THAT FORD AND NHTSA ARE STUDYING THE ISSUE. UNFORTUNATELY THAT DOES LITTLE GOOD FOR ME AS MY VEHICLE IS BASICALLY AN ACCIDENT WAITING TO HAPPEN. THE  SEVERE STEERING WHEEL AND FRONT WHEEL VIBRATIONS RENDER THE VEHICLE UNSAFE TO DRIVE AS THEY (THE  SEVERE STEERING WHEEL AND FRONT WHEEL VIBRATIONS) HAPPEN WITH NO PROVOCATION AT TIMES AND THE VIBRATIONS BECOME SO VIOLENT THAT KEEPING CONTROL OF THE STEERING WHEEL IS EXTREMELY DIFFICULT, ADDITIONALLY CONTROLLING THE VEHICLE IS IMPOSSIBLE. I HAVE HAD THE  SEVERE STEERING WHEEL AND FRONT WHEEL VIBRATIONS OCCUR AT SPEEDS FROM @20MPH TO 55MPH.",
        "vin": "1FTWW33P47E"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/11/2016",
        "dateOfIncident": "01/02/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10819569,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING 60MPH ON INTERSTATE WHEN I HAD A DIP IN THE ROAD AND THE TRUCK WOBBLED AND SHIMMIED SO I HAD TO REDUCE SPEED TO GET IT BACK UNDER CONTROL. TIRE PRESSER WAS CORRECT.",
        "vin": "1FTWW31P17E"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/14/2014",
        "dateOfIncident": "02/28/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10569328,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 FORD F-350 TDI. THE CONTACT STATED THAT WHILE DRIVING 35 MPH, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE THE TECHNICIAN DIAGNOSED THAT THE INJECTION PRESSURE REGULATOR WAS DEFECTIVE AND NEEDED TO BE REPLACED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS REPAIRED. THE FAILURE AND CURRENT MILEAGE WAS 86,000.",
        "vin": "1FTSW31PX7E"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/22/2014",
        "dateOfIncident": "02/22/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10565456,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON AND OVERPASS/ EXIT RAMP AND PASSED OVER A STEEL DIVIDER ON THE HIGHWAY. UPON DOING SO I TEMPORARILY LOST CONTROL OF THE STEERING ON THE TRUCK AND HAD TO DECELERATE AND MOVE TOWARDS THE SHOULDER. I RECEIVED AN INFORMATION BULLETIN FROM FORD ABOUT THIS POTENTIAL \"STEERING WOBBLE\" AND MADE SURE TO CHECK OUT ALL OF THEIR RECOMMENDATIONS. AFTER DOING SOME RESEARCH ONLINE I FEEL AS THOUGH THIS IS A MAJOR ISSUE AND FORD SHOULD BE DOING SOMETHING BEFORE MORE PEOPLE ARE INJURED OR KILLED. THERE ARE SEVERAL ONLINE FORUMS ADDRESSING THIS ISSUE AND IT SEEMS AS THOUGH FORD IS NOT BEING HELD RESPONSIBLE.  *TR",
        "vin": "1FTWW31P27E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "02/28/2013",
        "dateOfIncident": "01/16/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10500743,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 FORD F-350. THE CONTACT STATED WHILE THE VEHICLE WAS BEING SERVICED, THE TECHNICIAN STATED THE LINING OF THE FUEL TANK WAS COVERED WITH RUST WAS DELAMINATED.  THE TECHNICIAN DIAGNOSED THAT A NEW FUEL SYSTEM AND THE FUEL FILTERS NEEDED TO BE REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND DID NOT PROVIDE ANY ASSISTANCE. THE VEHICLE WAS REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 84,200 AND THE CURRENT MILEAGE WAS 85,300.  UPDATED 04/30/13*LJ",
        "vin": "1FDWF37P77E"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/05/2013",
        "dateOfIncident": "02/03/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10496500,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 FORD F-350. THE CONTACT STATED WHILE DRIVING 5 MPH, THE BRAKES COMPLETELY FAILED AND CAUSED THE VEHICLE TO RUN A STOP SIGN. THE CONTACT HAD TO USE THE EMERGENCY BRAKE TO STOP THE VEHICLE. THE CONTACT ALSO STATED THAT THE FRONT PASSENGER SIDE BRAKES HAD PREMATURELY WORN AND CAUSED AN INCREASE IN STOPPING DISTANCE.  THE VEHICLE WAS TAKEN TO A DEALER FOR DIAGNOSTICS. THE TEST RESULTS SHOWED WORN BRAKE LINES. THE DEALER REPLACED THE BRAKE LINES BUT THE REPAIR DID NOT REMEDY THE PROBLEM. THE VEHICLE WAS AGAIN TAKEN TO THE DEALER. THE FAILURE MILEAGE WAS 70,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/25/2012",
        "dateOfIncident": "11/15/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10445231,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VERY EXPENSIVE RIMS HAVE A LARGE CRACK IN AT LEAST ONE.  I TOOK IT TO THE DEALERSHIP, BUT OF COURSE THEY ARE NO LONGER UNDER WARRANTY.  I CALLED THE FORD CUSTOMER CARE UNIT AND THEY ARE UNABLE TO DO ANYTHING.  WHEN I ASKED TO SPEAK TO SOMEONE ABOUT INVESTIGATING THIS AS A SAFETY ISSUE, I WAS TOLD THERE WAS NO ONE I COULD TALK TO.  MANY OTHER FORD OWNERS ARE REPORTING THE SAME ISSUE AND GETTING THE RESPONSE THAT THERE ARE NO RECALLS AND NOTHING PENDING.  I REALLY FEEL THIS IS A MANUFACTURING DEFECT WITH SO MANY OCCURRING AND FEEL IT NEEDS TO BE INVESTIGATED BEFORE SOMEONE IS KILLED.  I DISCOVERED MY RIM FAILURE RIGHT AFTER I RETURNED FROM A TRIP TO COLORADO, HAULING MY CAMPER.  IF IT HAD FAILED DURING THIS TRIP I FEEL CERTAIN MY SON AND I WOULD NOW BE DEAD.  PLEASE HELP US IN GETTING FORD TO LOOK INTO THIS FURTHER.  EVERYONE WHO HAS GONE TO A DEALER OR CALLED FORD IS BEING TOLD THEY HAVEN'T HEARD OF AN ISSUE AND THIS IS JUST NOT TRUE.  CHECK THE WEBSITE WWW.NCFMA.ORG/NEWS/2010/03/02/SAFETY-ALERT-10-FORD-VEHICLES-STEEL-RIMSWHEELS/COMMENT-PAGE-1 FOR YOURSELF.  THERE ARE SEVERAL WHO HAVE THIS ISSUE.  *TR",
        "vin": "1FTWW31P97E"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/05/2011",
        "dateOfIncident": "08/01/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10438672,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST RECIEVED A LETTER FROM FORD (LITERATURE PROGRAM 09L02) TALKING ABOUT THE SHIMMY CONDITION ON FORD TRUCKS. THEY SAY TO CORRECT YOUR TIRE PRESSURE. I HAVE MY TIRE PRESSURE SET BY THE LOCAL DEALER ON A REGULAR BASIS AND BELIEVE ME THAT DOES ABSOLUTELY NOTHING TO PREVENT THIS SHIMMY PROBLEM. AT 40 TO 60 MPH IT CAN ACTUALLY THROW THE TRUCK SIDEWAYS. THIS LETTER (09L02) TO ME IS JUST A COVER UP OF A REAL PROBLEM. THIS PROBLEM HAS BEEN THERE SINCE NEW.  *TR",
        "vin": "1FTWW31P27E"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "10/13/2011",
        "dateOfIncident": "10/09/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10430086,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 FORD F350.  WHILE DRIVING 45 MPH, THE STEERING WHEEL SEIZED, CAUSING HER TO LOSE CONTROL OF THE VEHICLE AND CRASH INTO A WALL.  THE CONTACT SUSTAINED A CONCUSSION TO THE HEAD.  A PASSENGER SUSTAINED WHIPLASH.  NEITHER THE DEALER NOR THE MANUFACTURER WAS NOTIFIED OF THE FAILURE NOR WAS THE VEHICLE INSPECTED OR REPAIRED.  THE CURRENT AND FAILURE MILEAGES WERE 58,000.  UPDATED 11/04/11*LJ  THE CONSUMER STATED THE STEERING WHEEL WAS FREE SPINNING. THE GEAR BOX WAS DEFECTIVE. UPDATED 11/14/11",
        "vin": "1FTSW31P67E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/09/2011",
        "dateOfIncident": "08/08/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10418125,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS THE 4TH REPLACEMENT OF THE RADIATOR IN LESS THAN 4 YEARS WITH LESS THAN 80,000 MILES ON THE TRUCK....   *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "04/13/2011",
        "dateOfIncident": "03/14/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10395707,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 FORD F350 DUMP TRUCK DIESEL. THE CONTACT STATED THAT THE LINING OF THE FUEL TANK WAS COVERED WITH RUST AND DE-LAMINATED. THERE WERE ALSO PIECES OF RUST IN THE BOTTOM OF THE FUEL TANK. THE VEHICLE WAS TAKEN TO THE DEALER WHO DRAINED THE WATER SEPARATOR AND INSTALLED TWO FUEL FILTERS. THE CONTACT WAS RESPONSIBLE FOR THE REPAIR COST SINCE THERE WERE NO RECALLS OR RELATED WARRANTIES. THE FORD MANUFACTURER WAS CONTACTED AND A COMPLAINT WAS FILED. THE FAILURE MILEAGE WAS 25,430.  UPDATED 05/05/11*LJ",
        "vin": "1FDWF37P87E"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/24/2011",
        "dateOfIncident": "08/19/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10392832,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "ANYTIME I PULL A TRAILER MY TRUCK SHAKES REALLY BAD. IT SHAKES MODERATELY WITHOUT A TRAILER. IT HAPPENS CONSTANTLY. I HAVE HAD FORD DEALER REPLACE BALL JOINTS THREE TIMES IN LESS THAN THIRTY THOUSAND MILES. I THINK IF I DIDN'T GET THEM REPLACED I WOULD END UP WITH DEATH WOBBLE I READ ABOUT. BBB AUTOLINE(LEMON LAW) INDEPENDENT INSPECTOR WROTE THE TRUCK IS \"VERY DANGEROUS\".  *TR",
        "vin": "1FTWW31P37E"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/08/2010",
        "dateOfIncident": "11/12/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10369701,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2007 F-350 HARLEY DAVIDSON CC AT HIGHWAY SPEEDS MOSTLY IN CORNERS BUT ALSO ON STRAIGHTAWAY, THE TRUCK STARTS SHAKE VIOLENTLY, ALMOST UNCONTROLLABLE.  TO GET THIS TO STOP, I HAVE TO SLOW WAY DOWN AND ALMOST STOP.  THIS PROBLEM HAS BEEN REPORTED TO THE DEALER, WHERE THEY REPLACED SOME OF THE FRONT STEERING COMPONENTS.  I WAS TOLD THAT THE PROBLEM WAS FIXED, BUT ABOUT 100 MILES DOWN THE ROAD, THE SHAKING STARTED AGAIN.  I SUBSEQUENTLY CALLED THE DEALER, WHO INFORMED ME THAT THERE WAS NOTHING ELSE THAT THEY COULD DO, AS THE TRUCK IS NOW OUT OF WARRANTY.  THIS PROBLEM WAS REPORTED, AND SUPPOSEDLY FIXED PRIOR TO THE WARRANTY RUNNING OUT.  I HAVE SPOKEN TO OTHER PEOPLE WITH SIMILAR ISSUES WITH THEIR TRUCKS.  THE SEVERITY OF THE SHAKING IN THE STEERING WHEEL MAKES IT ALMOST IMPOSSIBLE TO CONTROL SAFELY.  I FEEL VERY UNSAFE DRIVING THIS VEHICLE, AND WOULD LIKE FOR SOMEONE AT FORD TO LET ME KNOW WHAT I CAN DO TO FIX THIS PROBLEM.  I DON'T AGREE THAT FORD WILL DO NOTHING ABOUT THIS PROBLEM, EVEN THOUGH THERE HAVE BEEN MANY COMPLAINTS OF THE SAME NATURE, HOWEVER I JUST WANT MY TRUCK FIXED.  WHETHER OR NOT I HAVE TO PAY FOR IT, I JUST WANT SOMEONE TO TELL ME HOW TO FIX THIS PROBLEM.  THERE HAVE BEEN NO MODIFICATIONS, AND THE TIRES ON MY TRUCK HAVE BEEN SUPPLIED BY THE DEALER. *TR",
        "vin": "1FTWW31P77E"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/24/2009",
        "dateOfIncident": "08/20/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10285160,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A SEVERE SHAKING IN MY FORD F30 SUPER DUTY TRUCK THAT IIS GETTING WORSE. STARTED OUT AS GOING OVER BUMPS OR AROUND CORNERS . TOOK IT TO DEALER RIGHT AFTER I BOUGHT IT. THEY SAID NEEDED ALIGNING. THEN AFTER CHARGING ME FOR IT SAID EVERYTHING WAS OK(FAILING TO NOTE MY TIRE DEPTH ON PAPER,WHICH TIRE TREAD WAS EXCELLENT). TOOK IT BACK SEVERAL MONTHS LATER WHEN IT CONTINUED TO GET WORSE AND TREAD WEAR STARTED.PUT ON MACHINE SAID IT WAS ALL GOOD. FAILED TO NOTE DEPTH AGAIN. THEN RECEIVED LETTER \"LITERATURE PROGRAM 09L02, STATING IN LESS WORDS THAT THEY KNOW OF THE PROBLEM BUT DON'T DEEM IT THEIR FAULT , JUST SLOW DOWN WHEN IT HAPPENS. CALLED FORD TOLD ME TO TAKE IT IN DEALER. TOOK IT IN, NOW THEY ARE SAYING IT BECAUSE OF THE POOR TIRE TREAD ON TIRES, WHICH WAS PERFECT WHEN I FIRST STARTED TO COMPLAIN ABOUT THE SHIMMY. NOW THEY WANT ME TO BUY NEW TIRES AND START ALL OVER AGAIN .AFTER GETTING NEW TIRES THEY WANT ME TO BRING IT IN SO THEY CAN CHARGE ME TO PUT IT BACK ON THE ALIGNMENT  MACHINE.THIS IS A NEVER ENDING CYCLE. WHEN ASKED ABOUT THE LETTER THEY SENT, AFTER I STATED THAT ITS A KNOWN ISSUE, THEY KEPT SAYING ITS THE CUSTOMERS FAULT FOR NOT MAINTAINING PROPER TIRE PRESSURE. I FIND THAT HARD TO BELIEVE SINCE IM IN THERE REGULARLY TO GET MY TIRE PRESSURE CHECKED SINCE I TRAVEL ALOT.AT THE CAMPGROUND I GO TO THERE ARE 3 OTHER FORD F 350 SIMILAR TO MINE HAVING THE SAME SEVERE SHAKE AND BOUNCE AS MINE AND ARE HAVING THE SAME WEAR(WHICH IS DIFFERENT ON EACH OF THE FRONT TIRES). EVEN AFTER THE LAST TIME I TOOK IT IN TO GET THE AIR FILLED, ONE OF THE TECHS NOTICED THE TIRE WEAR AND INFORMED ME THAT \" FORD KNOWS THESE FRONT ENDS ARE JUNK AND CAUSE PROBLEMS BUT THEY TRY TO BLAME THE CUSTOMER AND MOST BUY IT\" PLEASE HELP... I FEEL VERY UNSAFE IN THIS TRUCK AS I HAVE ALMOST LOST CONTROL ON THE HIGHWAY, STRAIGHT AWAYS AND CURVES, JUST FROM THE BOUNCE AND SHIMMY. *TR",
        "vin": "1FTWW33P47E"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/18/2009",
        "dateOfIncident": "02/07/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10269071,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 FORD F-350.  WHILE DRIVING APPROXIMATELY 35 MPH ON NORMAL ROAD CONDITIONS, THE VEHICLE VIBRATED EXCESSIVELY AND THE FRONT END BEGAN TO SHIMMY.  THE FAILURES OCCURRED WITHOUT WARNING WHENEVER THE VEHICLE WAS IN OPERATION.  THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER FOR INSPECTION AND THEY RECOMMENDED THAT THE CONTACT CONTINUE TO DRIVE THE VEHICLE AND THE FAILURE WOULD CEASE.  ON SIX SEPARATE OCCASIONS, THE VEHICLE WAS TAKEN BACK TO THE AUTHORIZED DEALER FOR IDENTICAL FAILURES, BUT THERE WERE NO RESOLUTIONS.  THE TECHNICIAN STATED THAT THE MALFUNCTION WAS A NORMAL OCCURRENCE FOR THIS VEHICLE AND COULD NOT BE REPAIRED.  THE DUMPER WAS REPLACED ON THE VEHICLE.  IN ADDITION, TRANSMISSION FLUID BEGAN LEAKING FROM THE VEHICLE AT 4,000 MILES.  THE DEALER REPAIRED THE LEAK.  THE DRIVER STATED THAT THE TRANSMISSION LEAK WAS CONTRIBUTED TO EXCESSIVE VIBRATION.  THE MANUFACTURER WAS NOTIFIED OF THE MALFUNCTIONS ON SEVERAL OCCASIONS.  THE FAILURE MILEAGE WAS 16 AND CURRENT MILEAGE WAS 12,000.",
        "vin": "1FTWW33P17E"
    },
    {
        "components": "STEERING,SUSPENSION,SERVICE BRAKES, HYDRAULIC,TIRES",
        "crash": false,
        "dateComplaintFiled": "04/14/2009",
        "dateOfIncident": "06/01/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10265321,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2007",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Toyo Tire Holdings of Americas, Inc.",
                "productMake": "TOYO",
                "productModel": "OPEN COUNTRY AT",
                "productYear": "9999",
                "size": "235/70/R16",
                "type": "Tire"
            }
        ],
        "summary": "THE VEHICLE HAS BEEN BROUGHT BACK TO THE DEALERSHIP MANY MANY TIMES SINCE IT WAS FIRST PURCHASED (5 TIMES I BELIEVE FOR STEERING RELATED PROBLEMS AND OTHER TIMES FOR A BRAKE BOOT PROBLEM AND A VARIETY OF OTHER ISSUES).  THE OTHER PROBLEM THE VEHICLE HAS HAD IS WHAT FORD IS CALLING A \"SHIMMY\". THEY ORIGINALLY TOLD US WE NEEDED NEW SHOCKS BECAUSE OF THIS PROBLEM WHICH WE DISPUTED AND TOOK IT TO A SPECIALIST IN SHOCK REPLACEMENT WHO TOLD US THIS WAS NOT THE PROBLEM.  THEN THEY TOLD US IT WAS THE TIRES (WHICH THEY ARE CONTENDING IN THE FORM LETTER THEY SENT US-THAT STATES WE MUST MAINTAIN PROPER PRESSURE TO CONTROL THIS PROBLEM). UNFORTUNATELY, PROPER TIRE PRESSURE SEEMINGLY HAS NOTHING TO DO WITH THIS PROBLEM AND WE CONTINUE TO HAVE THE PROBLEM TO WHICH FORD'S ANSWER TO US IS \"GET NEW TIRES\" (THE TIRES HAVE ONLY 22,000 MILES ON THEM, THEY ARE THE TIRES FORD PUT ON THE VEHICLE WHEN WE BOUGHT IT AND THEY, OF COURSE, ARE NOT A WARRANTY ITEM).  ALL IN ALL, THE TRUCK HAS HAD MANY ISSUES, SOME OF WHICH HAVE BEEN FIXED REPEATEDLY ONLY TO APPEAR AGAIN IN THE SAME OR SIMILAR WAY. *TR",
        "vin": "1FTWX31P77E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/02/2009",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10257869,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "LTR FROM SENATOR HUTCHISON ON BEHALF OF CONSTITUENT RE FORD MOTOR CO. VIOLATING THE MAGNUSON-MOSS WARRANTY FEDERAL TRADE ACT RE HIS 2007 F350 TRUCK.   *NJ  THE CONSUMER STATED HE HAS AFTERMARKET PARTS ON HIS VEHICLE AND FORD MOTOR VOIDED THE WARRANTY. *JB",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "12/18/2008",
        "dateOfIncident": "09/18/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10252208,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE 2007 FORD F350 HAS BEEN IN THE SHOP NUMEROUS TIMES FOR REPAIRS ON THE HIGH PRESSURE FUEL SYSTEM. IT IS IN FOR REPAIRS TODAY FOR THE 5TH TIME IN AS MANY MONTHS. *TR",
        "vin": "1FDWW37P47E"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "10/29/2008",
        "dateOfIncident": "03/29/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10247181,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRUCK STARTS RUNNING ROUGH, HAS A LACK OF POWER AND BLOWS BLACK SMOKE.  IN THE LAST YEAR, IT HAS OCCURRED ON APPROXIMATELY A MONTHLY BASIS.  IN THE LAST 7 MONTHS, THE SAME DEALERSHIP HAS REPLACED 12 FUEL INJECTORS, 1 EGR COOLER, 2 EGR VALVES AND 1 FUEL PUMP.  THE DEALERSHIP IS NOW TELLING US THAT A CYLINDER, VALVE AND PISTON HAVE FAILED AND THE TRUCK WHICH IS NOW OUT OF WARRANTY NEEDS A NEW ENGINE AT THE COST OF $12,748.27.  THE TRUCK HAS BEEN AT THE SAME DEALERSHIP ALMOST EVERY MONTH THIS YEAR INCLUDING TWICE IN APRIL AND NOW TWICE IN OCTOBER SINCE MARCH 29, 2008 FOR THE SAME COMPLAINT AND THEY EXPECT US TO PAY FOR THE ENGINE. *TR",
        "vin": "1FTWX31P77E"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/25/2008",
        "dateOfIncident": "09/22/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10243398,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "2007 F350 SHAKES VIOLENTLY ON HWY. OVER 60 MPH ALMOST CAUSES MAJOR ACCIDENT.  TRUCK STILL DOES IT WHEN I AM HAULING HEAVY LOADS AND WHEN EMPTY.  *TR",
        "vin": "1FTWW31YX7E"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/21/2008",
        "dateOfIncident": "11/13/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10235162,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 FORD F350.  WHILE DRIVING 55 MPH AND HIGHER, THE FRONT END OF THE VEHICLE SHAKES VIOLENTLY AND BECOMES UNCONTROLLABLE.  THE DEALER COULD NOT DUPLICATE THE FAILURE.  THE CURRENT MILEAGE WAS 9,670 AND FAILURE MILEAGE WAS 700.",
        "vin": "1FTWW31Y47E"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "06/25/2008",
        "dateOfIncident": "06/25/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10232258,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2007 FORD F350 TRUCK W/ THE SUPERCAB CONFIGURATION. WE TOOK DELIVERY IN OCTOBER 2007. WE HAVE A GRANDCHILD THAT SITS IN A CAR SEAT AND HAS TO BE LOCATED IN THE REAR SEAT. THE TRUCK DOES NOT HAVE THE LATCH SYSTEM FOR SECURING THE CAR SEAT SO WE NEED TO USE THE LAP/SHOULDER BELT. MY PARTICULAR TRUCK HAS THE AUTOMATIC LOCKING MODE ON THE TWO OUTBOARD BELTS BUT NOT THE MIDDLE BELT. I FELL THIS IS AN UNSAFE CONDITION BECAUSE THE MIDDLE POSITION GIVES THE CHILD PROTECTION FROM SIDE IMPACTS AND ALSO ALLOWS THE PASSENGER EASIER ACCESS TO THE CHILD.  *TR",
        "vin": "1FTWX31Y08E"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/25/2008",
        "dateOfIncident": "11/10/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10215956,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUCK WAS PURCHASED NEW FROM LAKEWOOD FORD IN 2007/OCT. TOOK IN FOR WARRANTY WORK WAS TOLD TURBO WAS OUT THEY DID NOT WANT TO FIX SO THEY SENT ME TO ANOTHER FORD DEALER THAT STATED NOTHING WRONG WITH TURBO- BUT HEAD GASKETS WERE BLOWN(ALL)THAT WAS IN NOV. 2007 NOW TRUCK IS BACK AT DEALER FOR WINDOW MARKINGSFROM WINDOW MOTOR(THEY WILL FIX BUT WON'T TINT WINDOW EVEN THOUGH WAS PURCHASED FROM DEALER THAT WAY) AND THEY TOLD US GASKETS WERE BLOWN AGAIN? WELL NOW I AM AT 34,689 MILES AND HOPPING THEY WILL NOT BLOW AGAIN ?????  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/12/2007",
        "dateOfIncident": "12/11/2007",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10211556,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 FORD F350.  THE CONTACT STATED THAT THE VEHICLE CAUGHT FIRE IN THE EVENING.  THE COUNTY INVESTIGATOR STATED THAT THE CAUSE OF THE FAILURE WAS ELECTRICAL.  A POLICE REPORT WAS FILED.  FORD WAS NOTIFIED, BUT DID NOT PROVIDE ANY ASSISTANCE.  THE CURRENT AND FAILURE MILEAGES WERE 15,000.",
        "vin": "1FTSW31P67E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,VEHICLE SPEED CONTROL,TIRES,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/05/2007",
        "dateOfIncident": "11/14/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10187102,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2007",
                "type": "Vehicle"
            },
            {
                "manufacturer": "B.F. GOODRICH TIRE CO.",
                "productMake": "B.F.GOODRICH",
                "productModel": "STEEL RADIAL TIRE",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 FORD F-350.  ON NOVEMBER 14, 2007 WHILE DRIVING 35 MPH THE  INSTRUMENT PANEL DIMMED.  THE CONTACT WAS UNAWARE OF THE VEHICLE'S SPEED OR OIL PRESSURE.  THE DEALER STATED THAT THE INSTRUMENT CLUSTER NEEDED  TO BE REPLACED,  AND THE SERPENTINE BELT AND PULLEY FAILED.  THE DEALER PERFORMED THE REPAIRS.  TWO WEEKS LATER THE RADIO AND CD PLAYER FAILED.  THE VEHICLE WAS TAKEN TO THE DEALER AGAIN, AND THE FAILURES WERE REMEDIED WITHOUT AN EXPLANATION OF THE CAUSE.  THE VEHICLE THEN BEGAN EXPERIENCING TIRE FAILURE.  THE TIRES WERE B.F. GOODRICH , SIZE LT245/75R17, DOT# M343DR211216.  WHILE DRIVING 42-48 MPH THE VEHICLE BEGAN VIBRATING AND PRODUCED A HUMMING NOISE FROM THE TIRES.  THE DEALER REFERRED TO A TECHNICAL SERVICE BULLETIN , WHICH STATED THAT THE VEHICLE NEEDED A VIBRATION DAMPLER.  WHILE DRIVING 70 MPH THE VEHICLE WOULD DISENGAGE FROM THE CRUISE CONTROL INTERMITTENTLY.  ON MARCH 27, 2007 THE CONTACT BROUGHT THE VEHICLE TO THE DEALER,  WHERE IT  REMAINED FOR  TWO DAYS.  THE DEALER STATED THAT THE FAILURE WAS CAUSED BY A CYLINDER THAT ENGAGED THE FOUR WHEEL DRIVE AND THE CYLINDER RELAY WAS REPLACED.  THE CURRENT MILEAGE WAS  3,400 ,AND FAILURE MILEAGE WAS 36. *AK",
        "vin": "1FTWW33P07E"
    }
]