[
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/05/2021",
        "dateOfIncident": "04/22/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427815,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "Basically I was driving and stopped and my house and while in ideal the wiring under the hood and under the fender into the dash all started to melt together shorting the systems so I tried to repair and replace the parts due to being a used vehicle and didn't know how to report this until now. So I cut the melted chunk of wiring harnesses out and trashed it. But I stopped due to the inability to find any replacement harnesses from Ford or mercury so now my car has been sitting for several months. I have only been able to find melted harnesses on junk yard cars. Ford used poor quality 16 gauge wiring that the outer coating became brittle and easily frayed. Every wiring harness I've seen has bad spots from wires melting or breaking and corroding. I'm my case the wiring melted causing the cooling system to stop working properly and almost damaged or may have damaged my engine. I don't have full coverage so I am forced to park it and do what I can myself which has made me lose my job and ruined my life. Please do look into this I'm sure more people have the same issue just check a junk yard and you'll see what I mean. Thank you for your time I will try to provide any further information or help if needed anyway I can to make sure someone doesn't get hurt.",
        "vin": "1fafp56u77a"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "07/17/2020",
        "dateOfIncident": "07/09/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11339963,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I'M DRIVING DOWN THE ROAD MY 2007 FORD TAURUS HAS STARTED TO ACCELERATE ON IT'S OWN. ON JULY 9 THIS INCIDENT OCCURRED AND I WAS INVOLVED IN A CAR ACCIDENT HITTING A TREE.  WHEN I START MY CAR IT WILL REV UP TO 2 RPM AND I HAVE TO PUSH THE GAS TO BRING IT BACK DOWN.  MY MECHANIC HAS CHANGED THE O2 SENSOR AND SEVERAL OTHER THINGS.  I BELIEVE THIS ISSUE IS FAIRLY COMMON BUT NEEDS TO BE ADDRESSED.  I HAVE TO RIDE MY BREAKS TO EVEN STAY STATIONARY AT A STOP LIGHT BECAUSE MY CAR WILL ACCELERATE UP TO 20 MPH IN A MATTER OF THIRTY SECONDS.  I GOT LUCKY THAT MY CHILDREN WEREN'T WITH ME AT THE TIME I CRASHED I WAS ALSO LUCKY THAT I HAVEN'T READ ENDED ANYONE.  NOW I AM SITTING WITH A VERY UNSAFE CARE AND STUCK PLEASE HELP ME FIX THE ISSUE.",
        "vin": "1FAFP53U87A"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/06/2020",
        "dateOfIncident": "02/06/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11307411,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "IT'S VERY COLD OUTSIDE I'M LOOKING AT FORMS AND IT SEEM TO BE A ISSUE WITH THE TAURUS FAMILY IN THE COLD THE DOOR DOESN'T LACK NONE OF MY DOOR WILL LOCK UNTIL IT'S WARM OUTSIDE ??? HELLO   IT'S AT HOME IN A PARKING SPOT LATE FOR WORK :(",
        "vin": "1FAFP56U67A"
    },
    {
        "components": "STEERING,SUSPENSION,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/16/2020",
        "dateOfIncident": "03/20/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299985,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I AM DRIVING WHEN I PRESS ON MY BRAKES THE CAR TRUMBLES, SHAKES AND IT DOESN'T BRAKE ALL THE WAY, IT FEELS LIKE SOMETHING IS MISSING",
        "vin": "1FAFP56U77A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/16/2020",
        "dateOfIncident": "07/09/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299988,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I AM DRIVING ON THE STREET 35MPH ALL OF A SUDDEN MY CAR STARTS TO EXCEL (PICKS UP SPEED) AND IN ORDER FOR ME TO STOP IT FROM PICKING UP SPEED I HAVE TO PULL OVER AND PUT IT ON PARK THEN PRESS THE GAS PEDAL ONE QUICK TIME AND THEN I CAN START TO DRIVE AGAIN. I CAN'T DO NOTHING ELSE BUT PULLOVER",
        "vin": "1FAFP56U77A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/23/2019",
        "dateOfIncident": "10/21/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11270556,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2007 FORD TAURUS WAS UP TO 3000 RPM'S AND MY CAR WASN'T LETTING ME DRIVE FASTER THAN 19 MPH. WHEN PRESSING THE GAS PEDAL ALL THE FAR WOULD DO IT REV HIGHER AND JOLT FORWARD REALLY FAST. I TURNED MY CAR OFF AND BEGAN DRIVING NORMAL AGAIN EXCEPT THE FACT MY TRANSMISSION WAS STILL WORKING WAY TOO HARD FOR THE SPEED I WAS GOING (3000 RPM'S AT 45 MPH). THIS HAS HAPPENED TO ME 4 TIMES IN THE PAST 2 DAYS NOW. I'M GUESSING IT'S MY TRANSMISSION AND MY CAR DOESN'T EVEN HAVE 146,XXX MILES ON IT AND NEVER HAVE I BEAT ON IT! THIS PROBLEM FOLLOWS MY DEAD BATTERY CELL AND STARTER RELAY PROBLEM. I HAVE READ SOMEWHERE ELSE THAT THESE TRANSMISSIONS GO OUT VERY SOON. I REALLY THINK THEY SHOULD BE RECALLED. I DON'T HAVE MONEY TO BUY A NEW TRANSMISSION OR VEHICLE! NO REASON THIS TRANSMISSION SHOULD BE BAD AFTER 145,XXX MILES!!",
        "vin": "1FAFP53U57A"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/08/2019",
        "dateOfIncident": "01/08/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11165121,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR SUDDENLY STOPS RUNNING WHILE DRIVING WHILE TURNING INTO INTERSECTION",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/02/2018",
        "dateOfIncident": "12/28/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11105029,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HIGH AC LINE DRIPS ON THE SERPENTINE BELT AS A RESULT OF CONDENSATION DURING AC USE.  THIS CAUSES A LIGHT SQUEAL THAT LEADS TO A LOUD SQUEAL.  DURING THE SUMMER, THE ONLY WORK AROUND IS HAVING THE BELT CLEANED REGULARLY DURING THE SUMMER MONTHS.  EVENTUALLY, WHILE OPERATING THE VEHICLE ON THE EXPRESSWAY, THE MOISTURE CAUSED THE COMPRESSOR TO SEIZE.  WHEN THE COMPRESSOR SEIZED, IT CAUSED THE BELT TO SNAP WHICH CAUSED THE VEHICLE TO HAVE A LOSS OF POWER DURING OPERATION WHICH MADE ME ALMOST LOSE CONTROL OF MY VEHICLE POTENTIALLY LEADING TO AN ACCIDENT.  THE MANUFACTURER HAS ACKNOWLEDGED A MANUFACTURER DEFECT BUT WILL NOT GET BACK TO ME TO RESOLVE THE MATTER.  THE MANUFACTURER SUGGESTED THAT I GO TO THE DEALERSHIP AND PAY FOR THE REPAIR WITH HOPES THAT IT WILL BE RECALLED IN THE FUTURE AND I BE REIMBURSED.  HOWEVER, THE DEALERSHIPS AREN'T ABLE TO PERFORM A REPAIR BECAUSE THERE IS NO WAY TO REPAIR IT WITHOUT A RECALL.",
        "vin": "1FAFP53U17A"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/18/2018",
        "dateOfIncident": "01/31/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11088765,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRONIC MESSAGE CENTER (ODOMETER, TRIPOMETER ETC.) BECAME DIMLY LIT AND IMPOSSIBLE TO READ DURING DAYLIGHT",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/17/2018",
        "dateOfIncident": "04/16/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11088639,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE STOPPED AT A STOP LIGHT (DEPRESSING THE BRAKE), THE VEHICLE LUNGED FORWARD AND RPM KEPT HIGH. RPM WENT TO NORMAL IN FEW SECONDS. IT OFTEN HAPPENS (1 OF 10 TIMES DEPRESSING BRAKE), YESTERDAY MORNIG THE CAR LOST POWER ON FREE WAY (VECHICLE SPEED WAS NOT ABLE TO PASS 40 MPH), IT BACKED NORMAL IN THE AFTERNOON. SENT THE CAR TO GARAGE, IT CAN BE REPEATED BY SHIFT TO D, DEPRESSING BOTH GAS AND BRAKE PEDALS, QUICKLY RELEASE GAS PEDAL.",
        "vin": "1FAFP56U67A"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/02/2018",
        "dateOfIncident": "04/02/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11082595,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "(SENT TO FORD) THIS LETTER SERVES TO INFORM YOU OF A SERIOUS MECHANICAL DEFECT. I DRIVE A 2007 FORD TAURUS SEL [XXX] WITH APPROXIMATELY 162,500 MILES. THE CAR IS IN GOOD SHAPE AND HAS REGULAR MAINTENANCE. WE ALSO OWN A FORD MUSTANG, FORD FOCUS, AND FORD F-150. WE HAVE BEEN REGULAR FORD CUSTOMERS FOR YEARS.    TODAY I DROVE MY CAR ON THE INTERSTATE FOR A FEW MINUTES BEFORE SOMETHING WAS APPARENTLY VERY WRONG. I SPED UP TO MERGE WITH TRAFFIC AND SUDDENLY THE CAR CONTINUED ACCELERATING, EVEN WITH MY FOOT OFF THE GAS. I USED THE BRAKE TO SLOW DOWN A BIT, BUT IT WOULD NOT SLOW DOWN ENOUGH. FROM THERE I BEGAN HAVING A PANIC ATTACK. I WASN'T SURE IF I COULD GET OUT OF TRAFFIC WITHOUT HITTING SOMEONE AND OFF THE EXIT RAMP. WITHOUT GOING INTO ALL THE DETAILS, I MANAGED TO USE THE EXIT LANE AND SOMEWHAT SAFELY STOP THE CAR AT AN ABANDONED GAS STATION. UPON TRYING TO BRING THE CAR TO A FULL STOP, I USED THE PARKING BRAKE AND PUT THE CAR IN PARK. THE ENGINE ROARED AND THE RPMS SKYROCKETED TO 4,000 BEFORE I WAS ABLE TO TURN THE CAR OFF. HAD THIS NOT BEEN A MONDAY EARLY AFTERNOON WITHOUT MUCH TRAFFIC ON A SUNNY DAY, I DON?T KNOW IF THIS STORY WOULD HAVE ENDED AS WELL. I TRULY FEARED FOR MY LIFE AND THOSE ON THE ROAD WITH ME.    IT IS CLEAR AFTER THE FACT THAT THE CRUISE CONTROL LINKAGE CAME OFF. (I HAVE NEVER USED THE CRUISE CONTROL IN THIS CAR, INCLUDING TODAY.) LOOKING AT THIS I CANNOT IMAGINE HOW FORD COULD DESIGN SOMETHING SO CLEARLY DESIGNED TO FAIL. WHEN THE GAS IS PUSHED, POSSIBLY IN EXCESS TO ENTER A BUSY INTERSTATE, THE PLASTIC ASSEMBLY IS PUSHED TO THE POINT THAT IT WILL EVENTUALLY FAIL.    I DEMAND A FULL INVESTIGATION OF THIS SO THAT NO ONE ELSE'S LIFE WILL BE ENDANGERED AS MINE WAS TODAY. I HAVE YET TO FULLY RECOVER THIS HIGHLY EMOTIONAL EVENT. I WOULD APPRECIATE A COPY OF YOUR INVESTIGATIVE FINDINGS.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "1FAFP56U47A"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/18/2018",
        "dateOfIncident": "03/04/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080026,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  , MOONROOF STOPPED CLOSING ONE DAY. IT HAS TO MANUALLY BE SHUT IF OPENED SO WE DON'T USE IT. IT MAKES LOUD CLICKING NOISE.   THE FUSE FOR GEM 5A STARTED HAVING ISSUE. FUSE IS NEVER BLOWN. BUT TO OPEN OR CLOSE WINDOWS, THE FUSE WOULD NEED TO BE PULLED OUT AND PUT BACK IN WITH DOOR OPEN. THE WINDSHIELD WASHER FLUID SPRAYER WORKS RANDOMLY. MECHANIC CHECKED MOTOR, TUBES, ETC AND CAN'T FIND ANYTHING THAT NEEDS TO BE FIXED OR THAT WOULD MAKE IT WORK WHEN IT WANTS TOO. THIS HAS ALL BEEN AN ONGOING ISSUE AND SOMETIMES BOOT AN ISSUE FOR ABOUT 2 YEARS NOW. FIRST OCCURRENCE, TWO YEARS AGO IN 2016 AND LAST OCCURRENCE WAS 2 WEEKS AGO IN 2018",
        "vin": "1FAFP56U67A"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/18/2018",
        "dateOfIncident": "12/02/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080024,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL I WAS DRIVING 60MPH AND TRIED TO SET CRUISE CONTROL AND TOOK FOR OFF GAS ABS THE CAR KEPT ACCELERATING FAST. ABOUT 80MPH I TAPPED THE BRAKE, CRUISE CONTROL LIGHT TURNED OFF AND CAR KEPT ACCELERATING AND RPMS WERE IN THE RED. I PUSHED AS HARD AS I COULD ON THE BRAKES AND CAR KEPT ACCELERATING PAST 85MPH AND I WAS NOW COMING INTO 30MPH ZONE AND RPMS WERE HIGH AND I TRIED TO PUT IT IN NEUTRAL CAUSE I DIDN'T KNOW WHAT TO DO. THE ENGINE REVVED COMPLETELY UP WITH RPMS AND I FINALLY JUST THREW IT IN PARK IN ROAD AND TURNED CAR OFF AND CALLED INSURANCE FOR TOW TRUCK. MY SON SAID I HAD BURNT MY BRAKES.. UNSURE OTHER THAN THERE WAS SMOKE FROM SOMEPLACE UNDER CAR. I GOT DOWN AND VISUALLY AND LOOKED FOR GAS PEDAL TO BE STUCK OR ANYTHING AND IT WAS NORMAL. TRIED STARTING CAR AND IMMEDIATELY TURNED IT BACK OFF DUE TO RPMS IN RED. HAPPENED 3 SEPERATE TIMES BUT MECHANIC NEVER FOUND ANYTHING WRONG OR WHAT IT WAS SO MY DAD DISCONNECTED THE CRUISE CONTROL WIRES OR SOMETHING WITH CRUISE CONTROL. CAR IDLES NOW HIGH AND RPMS RUN HIGHER THAN NORMAL. NOBODY KNOWS WHAT TO FIX SO I DON'T KNOW WHAT TO FIX.",
        "vin": "1FAFP56U67A"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/07/2018",
        "dateOfIncident": "03/01/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11076598,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "DOOR LATCHES GET STUCK OPEN AND DOORS WILL NOT CLOSE, OR WILL UNLATCH AND SWING OPEN WHILE DRIVING.  I CURRENTLY OWN TWO 2007 FORD TAURUS VEHICLES AND THIS HAS HAPPENED CONSISTENTLY WITH THOSE TWO, PLUS MY PREVIOUS TAURUS'- A 2003, 2005 AND TWO 2006 TAURUS'.",
        "vin": "1FAFP56U77A"
    },
    {
        "components": "STRUCTURE,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/28/2018",
        "dateOfIncident": "06/11/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11065475,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM VERY SCARED OF MY CAR RIGHT NOW AND I FEEL LIKE IT IS GOING TO FALL APART ON ME WHILE I AM DRIVING IT. THE ACCELERATOR STICKS AN DOES NOT WANT TO LET GO TO SLOW DOWN.",
        "vin": "1FAFP53U57A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/02/2018",
        "dateOfIncident": "08/10/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11057984,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 FORD TAURUS. WHILE DRIVING APPROXIMATELY 35 MPH, THE VEHICLE INADVERTENTLY ACCELERATED AT RAPID SPEED. WHILE THE BRAKE PEDAL WAS DEPRESSED, THE VEHICLE CONTINUED TO ACCELERATE RAPIDLY. THE CONTACT HAD TO PLACE THE GEAR SHIFTER IN NEUTRAL TO STOP THE VEHICLE FROM ACCELERATING. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC, BUT IT COULD NOT BE DIAGNOSED. THE VEHICLE WAS THEN TAKEN TO ENCINITAS FORD AT (888) 700-8208 LOCATED AT 1424 ENCINITAS BLVD, ENCINITAS, CA 92024, BUT NO DIAGNOSTIC FAILURE CODES WERE FOUND AND THE FAILURE COULD NOT BE DUPLICATED. THE VEHICLE WAS THEN TAKEN TO ANOTHER INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE CRUISE CONTROL WAS DISCONNECTED AND THE CABLE CLIP NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND THE CONTACT WAS ADVISED TO TAKE THE VEHICLE TO A DEALER. THE APPROXIMATE FAILURE MILEAGE WAS 140,000.",
        "vin": "1FAFP53UX7A"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "10/23/2017",
        "dateOfIncident": "10/23/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11035997,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TODAY WENT FOR A RIDE, SAFETY BELTS FOR FRONT PASSENGER SEATS WORKED. LEFT THE CAR FOR A FEW HOURS, WHEN WE CAME BACK THE SAFETY BELT FAILED. I WENT TO FASTEN THE BELT AND IT WAS AS IF THE LOCKING MECHANISM WAS IN THE LOCKED POSITION.",
        "vin": "1FAFP53U47A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/15/2017",
        "dateOfIncident": "10/12/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11033412,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN THE ROAD AND MY AIR BAG DEPLOYED ON ITS OWN ALLMOST CAUSING ME TO WRECH.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/16/2017",
        "dateOfIncident": "08/15/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11015675,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS CAR DIED TWICE AS MY WIFE WAS DRIVING HOME YESTERDAY. NO WARNING. IT WAS RUNNING WELL SINCE BUYING IT A MONTH AGO, AND IS WELL MAINTAINED WITH 105K MILES ON IT. IT FIRST DIED 500 YARDS FROM HOME, AND DIED AGAIN AS SHE PARKED IN THE DRIVEWAY. THIS SHUTS DOWN POWER STEERING AND BECOMES VERY DIFFICULT TO STEER. IT RESTARTED WHEN SHIFTED TO NEUTRAL OR PARK. WE HAVE RESEARCHED AND FOUND OTHER PEOPLE WITH THE SAME PROBLEM. SOME DYING AT 70 MPH ON HIGHWAYS WITH NO WARNING. SPORADIC DYING UP TO 5 TIMES DAILY OR MONTHS BETWEEN INCIDENTS. CARS HAVE BEEN TAKEN TO MECHANICS AND DEALERS, NONE OF WHOM HAVE CORRECTLY DIAGNOSED/FIXED THE PROBLEM. THIS IS EXTREMELY DANGEROUS AND SHOULD BE INVESTIGATED WITH ALL DUE HASTE! THANK YOU.",
        "vin": "1FAFP56U57A"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "07/16/2017",
        "dateOfIncident": "07/10/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11005600,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JULY 10, 2017 I WAS PROCEEDING WITHIN THE SPEED LIMIT ON A CITY STREET.  I NOTICED A LINE OF STOPPED CARS SOME DISTANCE AHEAD OF ME.  I ATTEMPTED TO APPLY MY BRAKES, BUT IT SOON BECAME EVIDENT THAT THAT THEY WERE NOT FUNCTIONING PROPERLY.  THUS, MY RATE OF SPEED WAS NOT BEING SUFFICIENTLY REDUCED.  I PUMPED THE BRAKES, BUT TO NO AVAIL.   I THEN APPLIED A GREAT DEAL OF PRESSURE TO THE BRAKE PEDAL, BUT IT MEEKLY SUNK TO THE FLOOR.  BY THE TIME I WENT FOR THE EMERGENCY BRAKE, AND I COLLIDED WITH THE CAR IN FRONT OF ME AT A LOW RATE OF SPEED.  FORTUNATELY, THE OTHER DRIVER AND MYSELF WERE UNHARMED, AND THE DAMAGE TO OUR VEHICLES WAS MINIMAL.    I HAD MY CAR TOWED TO A MECHANIC, AND THEY INSPECTED MY BRAKING SYSTEM.  THEY NOTICED SEVERE CORROSION ON THE REAR BRAKE LINES, TO THE POINT THAT THERE WAS SERIOUS LEAKING.     I HAD MY FRONT BRAKE LINES PATCHED IN JANUARY OF THIS YEAR DUE TO CORROSION.  IN THAT INSTANCE, I WAS FORTUNATE THAT MY INSTRUMENT PANEL ALERTED ME TO LOW BRAKE FLUID LEVELS.  I WAS NOT SO LUCKY THIS TIME AROUND.  I HAVE SPOKEN WITH SEVERAL MECHANICS AND READ VARIOUS OTHER PROFESSIONAL OPINIONS ONLINE ABOUT THIS ERA (2007) OF FORD'S BRAKE LINES.  FROM THIS INFORMATION,  I HAVE GLEANED THAT THERE ARE SERIOUS PROBLEMS WITH THE CORROSION OF BRAKE LINES.  I LIVE IN A MILD CLIMATE WHERE THE ROADS ARE RARELY SALTED, AND YET I HAVE HAD THE AFOREMENTIONED EXPERIENCES.  PLEASE DO WHATEVER IS NECESSARY TO REMEDY THIS ISSUE:  IT MAY VERY WELL SAVE SOMEONE'S LIFE.",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/11/2017",
        "dateOfIncident": "01/20/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11004300,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "IN COLD WEATHER MY DRIVER DOOR WAS WILL NOT CLOSE AND LOCK. THE LOCKING MECHANISM BECOMES USELESS. IF I SLAM THE DOOR IT JUST BOUNCES FROM THE IMPACT. (I READ ANOTHER COMPLAINT AND REALIZED I HAVE THE SAME ANNOYING PROBLEM). I TRIED WD40 TO LUBRICATE LOCK, BUT IT SEEMS WHEN THE CAR WARMS UP THE LOCK STARTS WORKING AGAIN.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/09/2017",
        "dateOfIncident": "05/17/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10994165,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 FORD TAURUS. WHILE DRIVING UNKNOWN SPEEDS, THE BRAKE PEDAL WAS DEPRESSED AND TRAVELED TO THE FLOORBOARD. THE CONTACT STATED THAT THE VEHICLE WAS ABLE TO STOP AFTER A FEW SECONDS. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THAT THE BRAKE LINE WAS SEVERED DUE TO RUST. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 135,000. THE VIN WAS UNAVAILABLE. *TT",
        "vin": "1FAFP53UX7A"
    },
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "05/30/2017",
        "dateOfIncident": "11/25/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10992169,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2007 FORD TAURUS. WHILE ATTEMPTING TO MAKE A RIGHT TURN AND ATTEMPTING TO STOP, THE VEHICLE ACCELERATED WITHOUT WARNING AND CRASHED INTO A BUILDING. THE DRIVER AND PASSENGER SIDE AIR BAGS FAILED TO DEPLOY. THE VEHICLE WAS TOWED AND DESTROYED. THE PASSENGER RECEIVED CHEST INJURIES AND THE DRIVER RECEIVED HEAD, CHEST, LEG, AND FACIAL INJURIES. MEDICAL ATTENTION WAS NEEDED  A POLICE REPORT WAS FILED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 131,000.   UPDATED 07/18/17*LJ  *JS",
        "vin": "1FAFP56U47A"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/21/2017",
        "dateOfIncident": "01/18/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10946876,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING AND STARTED TO BREAK COMING UP TO A RED LIGHT. THE CAR DID SLOW DOWN BUT I COULD FEEL FROM MY FOOT ON THE BREAK PEDAL, A VIBRATION AND THE CAR ENGINE STARTED MAKING A RUMBLING SOUND, LIKE IT WAS \"REVVING\" IN HIGH GEAR. I TOOK MY FOOT SLIGHTLY OFF THE BREAK AND  THE CAR ACCELERATED FORWARD ON ITS OWN. I PULLED INTO A PARKING LOT AND WAS ABLE TO PARK AND TAKE OUT THE KEYS. IT WAS TOWED TO A FORD DEALERSHIP. THEY SAID THE SPEED CONTROL CABLE IS BROKEN.",
        "vin": "1FAFP56U37A"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/19/2016",
        "dateOfIncident": "11/18/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10927054,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A WATER LEAK ON MY PASSANGER SIDE FLOOR WHICH SHORTED OUT MY HEATER BLOWER I HAD NOTICED THE LEAK IT HAPPENED TONIGHT WHILE I WAS DRIVING THEN WHEN I TURNED ON MY HEAT THE BLOWER STOPPED WORKING.",
        "vin": "1FAFP56U17A"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/03/2016",
        "dateOfIncident": "11/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10923981,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "ANTI THEFT SYSTEM WILL NOT ALLOW MY CAR TO START.  DROVE IT FOR A SHORT TIME, SHUT IT OFF CAME BACK OUT AND NOT MY VEHICLE WILL NOT START.",
        "vin": "1FAFP53UX7A"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/19/2016",
        "dateOfIncident": "07/16/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10885978,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 FORD TAURUS. WHILE DRIVING APPROXIMATELY 65 MPH, THE ABS AND BRAKE LIGHTS REMAINED ILLUMINATED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO WAS UNABLE TO DIAGNOSE THE FAILURE. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 142,652.",
        "vin": "1FAFP53U17A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/17/2016",
        "dateOfIncident": "06/16/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10874832,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "SUDDEN ACCELERATION ON CITY STREETS WITHOUT TOUCHING THE GAS PEDAL. ENGINE RUNNING AT 4RPM AT A COMPLETE STANDSTILL AND WHILE MOVING. EVEN WHEN THE BRAKE WAS ENGAGED THE CAR KEPT LURCHING FORWARD WANTING TO PROCEED THROUGH THE RED LIGHT.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/06/2016",
        "dateOfIncident": "02/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10853913,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING EXPERIENCED SUDDEN UNEXPLAINED ACCELERATION ON SEVERAL DIFFERENT OCCASIONS.",
        "vin": "1FAFP53U37A"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/05/2016",
        "dateOfIncident": "10/11/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10853449,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "SPUTTERS AS IF STARVING FOR GAS, WON'T GO ABOVE 3000RPMS, SHUTS OFF",
        "vin": "1FAFP53U47A"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/18/2016",
        "dateOfIncident": "11/01/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10850466,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR IN WINTER MONTHS DRIVERS DOOR WILL NOT CLOTHS I HAVE TO DRIVE HOLDING MY DOOR SHUT WHILE DRIVING THIS CAN LAST FOR HRS BEFORE IT MIGHT CLOTHS. SORRY BUT THIS IS NOT SAFE TO DO BUT HAVE NO CHOICE TO GET TO MY JOB.",
        "vin": "1FAFP53U17A"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "03/10/2016",
        "dateOfIncident": "03/11/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10846017,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 FORD TAURUS. WHENEVER IT RAINED, THE CONTACT NOTICED A PUDDLE OF WATER ON THE PASSENGER SEAT. IN ADDITION, THE HEATER BLOWER MOTOR WAS LEAKING. THERE WERE NO PRIOR WARNINGS. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE FAILURE MILEAGE WAS 55,000. THE VIN WAS NOT PROVIDED.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/11/2015",
        "dateOfIncident": "11/05/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10789802,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "SUDDEN ACCELERATION.",
        "vin": "1FAFP53U87A"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/20/2015",
        "dateOfIncident": "03/11/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10783606,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 FORD TAURUS. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V040000 (STRUCTURE)HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.   UPDATED 1/12/16  *CN",
        "vin": "1FAHP2JW4BG"
    },
    {
        "components": "VEHICLE SPEED CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/28/2015",
        "dateOfIncident": "06/25/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10730846,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR ACCELERATOR GOT STUCK AT ABOUT 4,000 RPMS. IT WOULD NOT DISLODGE UNTIL CAR WAS FORCED TO STOP BY MAXING PRESSURE ON BRAKES AND PUTTING CAR INTO 'PARK'.    RESEARCH SHOWS THAT THE CRUISE CONTROL CABLE GETS WORN AND DISCONNECTS FROM THE THROTTLE BODY AND CAN GET STUCK ON THE THROTTLE CABLE DISALLOWING THE THROTTLE TO RETURN TO IDLE POSITION.    THIS VIN IS NOT SUBJECT TO ANY OPEN RECALLS BUT THE CONDITION IS VERY DANGEROUS.",
        "vin": "1FAFP53U47A"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/13/2015",
        "dateOfIncident": "06/13/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10725114,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "PAINT IS PEELING ALL OVER",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/29/2015",
        "dateOfIncident": "09/15/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10722227,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MY HORN WILL NOT WORK DUE TO SPRING CLOCK PROBLEM IN AIR BAG.",
        "vin": "1FAFP53U47A"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/22/2015",
        "dateOfIncident": "09/07/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10720977,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON A MAIN HIGHWAY WHEN A CAR PULLED OUT DIRECTLY IN FRONT OF ME. WHEN WE IMPACTED THE AIR BAG DEPLOYED AND BROKE MY ARM IN HALF. MY BONE CUT A MAIN NERVE ON THE OUTSIDE OF MY DOMINANT RIGHT ARM. AFTER 2 SURGERIES MY NERVE NEVER REPAIRED. THERE IS NO FEELING IN MY LAST TWO FINGERS AND THEY ARE DROWN IN DUE TO LACK OF NERVE. MY WRIST WILL NOT BEND BACK EITHER DUE TO ALL THE METAL HOLDING MY ARM TOGETHER.",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/20/2015",
        "dateOfIncident": "05/03/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10717479,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WILL NOT START RIGHT AWAY, MUST PUMP GAS AND KEEP TRYING AFTER A MINUTE OR 2 THEN IT STARTS. WE KNOW THERE IS A PLASTIC PART ON THE FUEL LINE AND WERE TOLD TO WATCH FOR ISSUES AND A RECALL AS THERE WERE MANY ISSUES WITH IT.",
        "vin": "1AFAFP53UX7"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/24/2015",
        "dateOfIncident": "04/24/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10712718,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRONIC MESSAGE CENTER (ODOMETER, TRIPOMETER ETC.) BECAME DIMLY LIT AND IMPOSSIBLE TO READ DURING DAYLIGHT.   *TR",
        "vin": "1FAFP53U67A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/16/2015",
        "dateOfIncident": "02/04/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10694622,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 FORD TAURUS. THE CONTACT STATED THAT THE VEHICLE SUDDENLY ACCELERATED WITHOUT ANY WARNING. THE CONTACT WAS ABLE TO SLOW THE VEHICLE DOWN BY USING THE BRAKES. HOWEVER, THE ENGINE RPM'S CONTINUED TO SURGE. THE CONTACT STATED THAT THE FAILURE RECURRED ON SEVERAL OCCASIONS. THE VEHICLE WAS NOT TAKEN TO THE DEALER. THE FAILURE MILEAGE WAS 149,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/16/2015",
        "dateOfIncident": "11/14/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10683668,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVERS FRONT AND PASSENGER REAR DOOR DO NOT STAY SHUT IN COLD WEATHER, I SEE THERE WAS A RECALL ON LATER MODELS OF FORD TAURUS BUT NOT MY 2007. THIS IS VERY FRUSTRATING WHEN IT'S VERY COLD AND THE DOOR WON,T SHUT AND I HAVE TO DRIVE WITH ONE HAND HOLDING THE DOOR SHUT, AND I BELIEVE IT IS A SAFETY CONCERN THAT FORD NEEDS TO BE AWARE OF. THIS HAS HAPPENED AT LEAST 20+ TIMES ! I HAVE TRIED EVERY KIND OF SOLUTIONS THAT I FOUND ON THE INTERNET BUT NOTHING WORKS.   *TR",
        "vin": "1FAHP53U77A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/16/2015",
        "dateOfIncident": "02/04/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10683701,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "ROUNDED A CURVE AND WHEN I WENT TO ACCELERATE THE TRANSMISSION HAD BROKE AND THERE WAS NO DRIVE POWER. FORD MECHANIC DESCRIBED AS 'CATASTROPHIC' TRANSMISSION FAILURE. DID NOT SLIP OR SHOW ANY SIGNS OF DETERIORATION PRIOR TO FAILURE.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/15/2014",
        "dateOfIncident": "12/15/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10664430,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS HAVING PROBLEMS STEERING MY CAR I OPENED UP THE HOOD THE POWER STEERING WAS BUBBLING OVER AND WAS A LITTLE SMOKY NEVER HAD A PROBLEM LIKE THIS BEFORE.  *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/25/2014",
        "dateOfIncident": "11/22/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10660829,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "FACTORY STEEL BRAKE LINES RUSTED THROUGH. THE BRAKE LINES WERE PARTIALLY PLASTIC COATED. THE PART OF THE LINE THAT RUSTED THROUGH WASN'T COATED AND RAN DOWN THE DRIVERS SIDE OF THE CAR NEAR ONE OF THE HANGERS. BRAKE LINES SHOULD NOT BE MADE OUT OF STEEL FOR VEHICLES. THE SALT THAT IS USED ON THE ROADS IN THE NORTH EAST US EATS THE BRAKE LINES UP WAY TOO QUICKLY. THIS IS A SERIOUS SAFETY ISSUE!  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/19/2014",
        "dateOfIncident": "11/18/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10659433,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 FORD TAURUS. WHILE DRIVING APPROXIMATELY 65 MPH, THE VEHICLE WOULD NOT ACCELERATE. THE INDEPENDENT MECHANIC STATED THAT THE TRANSMISSION NEEDED TO BE REPLACED. THE VEHICLE HAS NOT BEEN REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 102,471.",
        "vin": "1FAFP56U47A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/28/2014",
        "dateOfIncident": "08/13/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10650887,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIRBAG LIGHT ON THE DASH BOARD WOULD INTERMITTENTLY FLASH OR COME ON AND STAY ON FOR A WHILE.  WE TOOK IT TO A MECHANIC WHO TOLD US THE ENTIRE DRIVERS SIDE AIRBAG ASSEMBLY WOULD NEED TO BE REPLACED. IT WOULD COST AROUND $1,500. MY DAUGHTER DRIVES THIS VEHICLE SO THIS IS AN IMPORTANT SAFETY FEATURE FOR US BUT FOR THAT AMOUNT OF MONEY IT MAY BE TIME FOR ANOTHER VEHICLE.   *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/07/2014",
        "dateOfIncident": "08/06/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10641979,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2007 FORD TAURUS. THE CONTACT STATED THAT AFTER STARTING THE VEHICLE, THERE WAS A SUDDEN INCREASE IN ENGINE RPMS AS THE VEHICLE BEGAN TO ROLL BACKWARDS. THE CONTACT MENTIONED THAT THE ENGINE STALLED NUMEROUS TIMES WHILE DRIVING AT VARIOUS SPEEDS. THE VEHICLE WAS TAKEN TO A CERTIFIED MECHANIC, WHO INSPECTED THE VEHICLE AND DETERMINE THAT THE TRANSMISSION NEEDED TO BE REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 124,000.",
        "vin": "1FAFP53U27A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/16/2014",
        "dateOfIncident": "10/09/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10633599,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING MY 2007 FORD TAURUS ON THE FREEWAY AT 60 MPH AND SUDDEN ACCELERATION MAKING CAR GO 75 MPH WITHOUT PRESSING THE ACCELERATOR MORE THEN I WAS. I TRIED TO PULL THE ACCELERATOR BACK WITH MY RIGHT FOOT WITH MY LEFT FOOT ON THE BRAKE TO BE SAFE AND THAT DID NOTHING TO SOLVE THE PROBLEM THE CAR STILL WANTED TO ACCELERATE . SO I PULLED OVER ON THE FREEWAY AND PUT THE CAR IN PARK AND THE RPM WENT HIGH AS IF I WAS PRESSING ON THE ACCELERATOR. IT WAS VERY HARD TO STOP THE CAR BECAUSE AS I WAS PRESSING ON THE BRAKE TO PULL OVER THE ACCELERATOR FELT AS IF THE GAS PEDAL WAS PRESSED ALL THE WAY DOWN WHILE BRAKING.  *TR",
        "vin": "1FAFP56U07A"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/26/2014",
        "dateOfIncident": "08/22/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10628459,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "PAID FOR A 100,000 MILE TUNE UP, NEW FRONT BRAKES, ETC.  ONE DAY LATER IT SUDDENLY SURGED FORWARD RIGHT AS I WAS PULLING INTO MY DRIVEWAY. I CAME CLOSE TO DRIVING THROUGH THE CLOSED GARAGE DOOR.  HIT THE BRAKE HARD AND THE RPM'S SHOT UP.  I TURNED OFF THE ENGINE WHILE IN PARK.  MY HUSBAND STARTED THE CAR WHILE IN PARK AND THE RPM'S SHOT UP AGAIN.  EVENTUALLY, HE PRESSED THE GAS PEDAL AND THE RPM'S DROPPED.      EARLIER THAT SAME WEEK, I HAD TO SWERVE TO AVOID HITTING A CAR IN FRONT OF ME WHILE DRIVING DOWN HILL.  I ASSUMED THAT MY BRAKES WERE BEGINNING TO FAIL, BUT NOW I AM WONDER  *TRING IF THIS SAME PROBLEM CAUSED MY CAR TO SURGE FORWARD EVEN THOUGH I WAS TRYING TO SLOW DOWN.   *TR",
        "vin": "1FAFP56UX7A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/25/2014",
        "dateOfIncident": "08/23/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10628098,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TRAVELING AT 60 MPH, HAD TO SLOW DOWN FOR A SLOWER VEHICLE BUT THE CAR DID NOT SLOW DOWN WHEN I REMOVED MY FOOT FROM GAS PEDAL.  I BRAKE AND SLOWED THE CAR, BUT HAD TO RIDE THE BRAKE AS THE CAR TRIED TO ACCELERATE.  WHEN WE ENCOUNTERED A STOP LIGHT, THE BRAKES ALMOST COULD NOT HOLD THE CAR BACK.  I PUT THE CAR IN PARK AND REVVED THE ENGINE TWICE AND THE CAR IDLE SPEED DROPPED FROM 4000+ RPM BACK TO NORMAL.  THIS HAPPENED SEVERAL TIMES ON THE TRIP HOME.  I DID A QUICK GOOGLE SEARCH FOR THIS PROBLEM AND FOUND EARLIER TAURUS MODELS WITH SIMILAR PROBLEMS HAD RECALLED FOR DEFECTIVE CRUISE CONTROL CABLE.  I LOOKED AT MY CAR'S CRUISE CONTROL ACTUATOR CABLE AND FOUND IT'S CONNECTOR  HAD SLIPPED OFF THE THROTTLE CONNECTION POINT.  I NOW HAVE A TEMPORARY FIX TO KEEP IT FROM INTERFERING WITH THE THROTTLE.  THIS COULD HAVE CAUSED AN ACCIDENT AND HURT SOMEBODY.   *TR",
        "vin": "1FAFP53U07A"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/21/2014",
        "dateOfIncident": "06/23/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10627315,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "FLOOR BEHIND GLOVE BOX IS GETTING WET WHEN THE CAR IS PARKED AND SITS IN THE RAIN.  MUST BE COMING IN THE HOOD OR WINDSHIELD. MULTIPLE REPORTS ON LINE ABOUT THE COWL OVER CABIN AIR FILER. OR A RAIN HAT EXTENSION. CAUSING A/C MOTOR TO GO OUT NOW BECAUSE OF THE WATER COMING IN CONTINUALLY. CANT SEEM TO GET THE PROBLEM SOLVED ON OUR 2007. HOPING WATER LEAK DOES NOT CAUSE A FIRE IF IT KEEPS COMING ON THE WAY IT HAD BEEN.  *TR",
        "vin": "1FAFP53U97A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/21/2014",
        "dateOfIncident": "07/31/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10627318,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING THE CAR IT STARTING REVVING AND RPMS INCREASING. PARKED TURNED CAR OFF WAITED A FEW MINUTES STARTED CAR UP AND ENGINE WAS RACING HARD. PULLED OUT OF PARKING SPACE WENT TO THE STOP LIGHT COULD BARELY KEEP THE CAR STOPPED WITH MY FOOT PRESSED VARY HARD TO KEEP THE CAR FROM JOLTING INTO INCOMING TRAFFIC. LIGHT TURNED, TOOK MY FOOT OFF THE BRAKE THE CAR RACED FROM A STOPPED POSITION TO 56 MILES AND HOUR WITH A 2 1/2 BLOCK DISTANCE AND I NEVER PUT MY FOOT ON THE GAS. . HAD TO RIDE 15 MILES INTO TOWN TO THE CAR REPAIR SHOP RIDING THE BRAKE THE WHOLE TIME TO KEEP THE CAR UNDER A 30 MPH SPEED. AGAIN NUMEROUS REPORT OF THE CLIP COMING OFF ON THE CRUISE CONTROL CAUSING CAR TO RACE. REPLACE THE CLIP BACK ON BECAUSE IT IS NOT BROKE AND IN 2-3 DAYS THE CLIP COMES OFF AGAIN. I CAN NOT AFFORD TO HAVE THIS CAR JOLT ME OR MY FAMILY INTO AN INCOMING TRAIN OR TRAFFIC AND KILL US BECAUSE FORD DOES NOT WANT TO FIX THE PROBLEM CAUSE T MAY BE TO COSTLY.  *TR",
        "vin": "1FAFP53U97A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/09/2014",
        "dateOfIncident": "08/09/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10621102,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR BEGAN TO ACCELERATE AND HAD TO RIDE BRAKES TO KEEP FROM SPEEDING AND TO STAY UNDER SPEED LIMIT. GOT HOME AND TURNED OFF AND WAITED 15 MINUTES AND STILL ENGINE RACING. WAITED ANOTHER 30 MINUTES STILL SAME. LOOKED ON LINE AND SAW SAME PROBLEM POSTED BY SOMEONE AND THEY TAPPED GAS PEDAL TO GET TO STOP. TRIED IT AND IT WORKED BUT HAVE A CALL INTO FORD DEALERSHIP TO MAKE AN APPOINTMENT TO BRING IN.  *TR",
        "vin": "1FAFP53U27A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/25/2014",
        "dateOfIncident": "07/21/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10616387,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 FORD TAURUS. THE CONTACT STATED THAT WHILE AT A STOP LIGHT, THE VEHICLE SURGED FORWARD AND THE ENGINE RPMS REVVED UP. THE VEHICLE COULD BE RESTARTED BUT THE FAILURE PERSISTED. THE FAILURE OCCURRED ON TWO OCCASIONS. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC, WHO DIAGNOSED THAT THE CRUISE CONTROL CABLE CLIP NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VIN WAS NOT AVAILABLE. THE APPROXIMATE FAILURE MILEAGE WAS 95,787.   UPDATED 9/3/14*CN",
        "vin": "1FAFP53U97A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/06/2014",
        "dateOfIncident": "05/30/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10608426,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD AT LEAST 9 OF THE FOLLOWING INCIDENTS; I FIRST NOTICED CRUISE CONTROL STOPPED WORKING APPROXIMATELY IN MARCH, AFTER THAT INTERMITTENTLY WHILE DRIVING AT DIFFERENT SPEEDS MY GAS PEDAL WOULD FEEL LIKE IT WAS STUCK DOWN, RPM'S WENT UP TO 4000-6000, CAR SPED UP AND ONE TIME THE BREAKS DID FAIL UNTIL I THREW CAR INTO PARK AT 60 MPH. USUALLY I HAVE TO STEP ON GAS A FEW TIMES TO FIX IT, TOOK IT TO MECHANIC AND HE COULD NOT FIND THE PROBLEM. IT IS HAPPENING IN A GREATER FREQUENCY NOW. IT IS GETTING EXTREMELY DANGEROUS FOR ME TO KEEP DRIVING THE CAR. I NOTICED WHEN THAT HAPPENS MY DASHBOARD GOES FROM 23.7 MILES PER GALLON TO AT ONE POINT IT SAID 7, THEN INCREASED TO 34 MPG. WHEN IT DROPPED DOWN TO 7 MPG MY CAR KEPT STALLING AND WOULD START AND STALL UNTIL I LET IT SIT OVER NIGHT.   *JS",
        "vin": "1FAFP53U57A"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/04/2014",
        "dateOfIncident": "02/19/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10608222,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT NIGHT ON MY WAY HOME I SEEN A FLASH ON THE MILEAGE SCREEN AND THEN IT BECAME BLANK NOW NOTHING APPEARS ON THE MILEAGE. FORD CLAIMS IT WILL BE ABOUT 900.00 TO FIX IT.  *TR",
        "vin": "1FAFP53U77A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/07/2014",
        "dateOfIncident": "06/06/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10596858,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2007 TAURUS SE  WITH ABOUT 90,000 MILES. THE CRUISE CONTROL STOPPED WORKING LAST WEEK AND I TURNED IT OFF.  ON AT LEAST FOUR OCCASIONS IN THE LAST WEEK, SINCE THEN  I HAVE HAD UNEXPECTED, UNCONTROLLED ACCELERATION  WHILE DRIVING  THAT COULD EASILY RESULTED IN AN ACCIDENT. WHEN THE ACCELERATION HAPPENED , I GOT  THE CAR OFF THE ROAD STEPPED ON THE BRAKE AS HARD AS I COULD, THE CAR RAN UP TO 3TO 4000 RPM BEFORE I COULD SHIFT TO NEUTRAL AND TURN OFF THE IGNITION  AFTER THE  INCIDENT YESTERDAY AFTERNOON ; I TOOK THE CAR IN TO ECKENROD FORD IN CULLMAN, ALABAMA. THEY GAVE ME A LOANER CAR WHILE THEY ARE FIXING MINE. I SEE  THAT YOU HAVE HAD SEVERAL COMPLAINTS OF THE SAME THING HAPPENING  IN THIS YEAR AND MODEL AND RECOMMEND A RECALL OR AT LEAST A SERVICE BULLETIN, TO DEAL WITH THIS PROBLEM. IN RESEARCHING THIS PROBLEM A LOSE CRUISE CONTROL CABLE MAY BE CAUSING THIS PROBLEM. THE PROBLEM IS DANGEROUS AND DISCONCERTING AND SHOULD BE ADDRESSED. *TR",
        "vin": "1FAFP53UX7A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/30/2014",
        "dateOfIncident": "12/10/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10595047,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE SUDDENLY LOST POWER TO THE WHEELS IN THE MIDDLE OF HEAVY RUSH HOUR TRAFFIC, THOUGH THE VEHICLE WAS STILL ON. AFTER COASTING INTO A PARKING LOT, I TRIED TO MOVE THE CAR BOTH FORWARD AND BACKWARD AND IT JUST WOULDN'T GO. THERE WAS NO NOISE TO INDICATE SOMETHING HAD BROKEN. AFTER TAKING IT TO THE TRANSMISSION SHOP, I FOUND OUT FROM THE OWNER THAT THE TORQUE CONVERTER WAS AT FAULT AND THAT THEY SAW THIS ALL THE TIME ON THIS GENERATION OF FORD TAURUS AROUND 60,000 TO 90,000 MILES DRIVEN. IT COST ABOUT $3,000 TO REPAIR BUT LUCKILY WON'T HAPPEN AGAIN BECAUSE A FEW AFTER MARKET AUTO PARTS MANUFACTURERS HAVE REALIZED THIS ISSUE EXISTS AND HAVE MADE STRENGTHENED TORQUE CONVERTERS. IF TRANSMISSION SHOPS HAVE NOTICED THIS IS AN ISSUE AND PARTS MANUFACTURERS HAVE NOTICED THIS IS ENOUGH OF AN ISSUE TO MAKE A PROFIT FROM, THEN THIS IS SOMETHING FORD NEEDS TO RECTIFY. THE TORQUE CONVERTER FAILING AT 75,000 MILES IS ALONE UNACCEPTABLE AND POTENTIALLY QUITE DANGEROUS, THOUGH I WAS LUCKY. PLEASE INVESTIGATE.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING,SUSPENSION,ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/05/2014",
        "dateOfIncident": "05/05/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10586647,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE MY 2007 FORD TAURUS HIT THE 100K MILE MARK, EVERYTHING STARTED FAILING. FIRST IT WAS A SIMPLE CAM SENSOR, THEN RADIATOR (X2) THROTTLE BODY, (X4 EACH WINTER FOR 4 YEARS IN A ROW WOULD JUST FAIL. ENDED UP REPLACING WITH AN AFTER MARKET BRAND. HAVEN'T HAD A PROBLEM SINCE)   NOW RECENTLY, WITH IN THE LAST 6 MONTHS, ALL SUSPENSION (STRUTS, SWAY LINKS, BALL JOINTS) ALL FAILED. REPLACED REARS ONCE, FRONTS ARE STILL A PROBLEM ON SECOND NEW PAIR. GOING ON THIRD PAIR JUST WITH IN 2 MONTHS OF EACH REPLACEMENT, THE STRUTS JUST FAIL. TRIED SEVERAL BRAND. KYB, AND GABRIEL. ALL FAILED AFTER ONLY 2 TO 3 MONTHS OF REPLACING. PLUS TIE RODS, AND ENDS ARE BAD. ALREADY STUCK IN A GOOD $3000 JUST TO KEEP THIS CAR DRIVABLE. WONDERING IF IT`S EVEN WORTH FIXING ANYMORE AT THIS POINT. MECHANICS CAN`T EXPLAIN WHY ALL OF THE SUDDEN, THE CAR`S EATING STRUTS IN SUCH SHORT TIME. NOTHING APPEARS TO BE DAMAGED UNDER BODY. AND I PURPOSELY AVOID POT HOLE RIDDEN SIDE ROADS, AND RAIL ROAD CROSSINGS WHEN I CAN. SO IT`S NOT LIKE I`M BEING ROUGH ON THE CAR. NEVER HAD SO MANY PROBLEMS WITH MY 2001 FORD TAURUS. SHOULD HAVE JUST KEPT IT. :(  *TR",
        "vin": "1FAFP56U27A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/28/2014",
        "dateOfIncident": "04/27/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10585330,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "ON TWO OCCASIONS I WAS TRAVELING APPROX. 60 MPH ON THE FREEWAY WHEN MY CAR SUDDENLY ACCELERATED TO 80 MPH. THE FIRST TIME I TOOK MY FOOT OFF THE GAS AND THE CAR SLOWED TO AT 50 MPH AND CONTINUED THAT WAY FOR A COUPLE MINUTES, THEN RETURNED TO NORMAL. THE SECOND TIME I HAD TO PUSH THE BRAKE PEDAL VERY HARD WITH BOTH FEET TO MAKE IT SLOW DOWN. I WAS ABLE TO GET OFF THE FREEWAY, BUT THERE WAS I RED LIGHT AND I SLID THROUGH THE LIGHT TRYING TO STOP MY CAR. I WAS FORTUNATE NO OTHER CAR WAS COMING.  I PUT THE CAR IN NEUTRAL, AND  THERE WAS A VERY HARD KICK AND THE RPM'S WHERE STILL VERY HIGH. THEN IT JUST STOPPED RACING AND WENT BACK TO NORMAL.   *JS",
        "vin": "1FAFP56U37A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "04/14/2014",
        "dateOfIncident": "04/30/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10579648,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS  A 2007 FORD TAURUS. THE CONTACT STATED THAT AFTER STOPPING THE VEHICLE AND SHIFTING INTO PARK, THE VEHICLE SUDDENLY ACCELERATED AND TRAVELED OVER THE SIDEWALK UNTIL CRASHING INTO A SIGN. THE CONTACT WAS NOT INJURED. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS UNKNOWN AND THE CURRENT MILEAGE WAS 69,000.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/14/2014",
        "dateOfIncident": "04/14/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10579694,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "IT IS SHAMEFUL THAT FORD MOTOR COMPANY AND YOU ARE ALREADY AWARE OF THIS PROBLEM WITH THE TRANSMISSIONS AND TORQUE CONVERTER ON THE 2006 AND THE 2007 FORD TAURUSES.  I REPORTED MY HUSBAND'S 2006 FORD TAURUS TRANSMISSION PROBLEM TO YOU IN 2011.  WE DELIVERED OUR SON'S 2007 FORD TAURUS TO THE TRANSMISSION REPAIR SHOP TODAY.  AGAIN THE TRANSMISSION REPAIRMAN TOLD US THE SAME EXACT THING - THAT THE TORQUE CONVERTER AND TRANSMISSIONS ARE DEFECTIVE IN THOSE YEAR MODELS AND MORE YEAR MODELS IN THE FORD TAURUS. HE KNOWS THERE SHOULD BE A RECALL FROM 1996 TIL NOW ON THE FORD TAURUS DEFECTIVE TRANSMISSION. THE CAR COMES TO A COMPLETE STOP ANYWHERE AND IT WILL NOT GO FORWARD OR BACKWARD(MY HUSBAND'S CAR DID THIS).  WE DELIVERED OUR SON'S WHEN WE NOTICED AT ABOUT 45 MILES PER HOUR THE CAR JUMPS JUST LIKE MY HUSBANDS 2006 FORD TAURUS DID JUST BEFORE IT STOPPED SUDDENLY IN THE ROAD.  YOUR FAILURE TO FIX THIS PROBLEM IS NEGLIGENCE AND FORD MOTOR COMPANY IS RESPONSIBLE FOR THIS.  HOW MANY PEOPLE HAVE TO DIE TO FIX THIS PROBLEM?  IT IS VERY DANGEROUS AND FIXABLE.   *JS",
        "vin": "1FAFP53U27A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/13/2014",
        "dateOfIncident": "04/12/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10579460,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WE TOOK A TRIP ON 04/01/2014 AND ON THE RETURN HOME. THE CRUISE CONTROL FAILED TO WORK. AT THAT POINT, IT WAS NOT A BIG CONCERN UNTIL YESTERDAY WHEN WE WERE AT A LIGHT BEHIND A FORD F-150 PICKUP TRUCK. CAR ACCELERATED TO ABOUT 4000 RPM. MY FOOT WAS ALREADY ON THE BRAKE. I HAD TO PUSH THE BRAKE TO THE FLOOR TO KEEP FROM HITTING THE TRUCK IN FRONT OF ME. W HEN  WE GOT THRU THE INTERSECTION, I WAS ABLE GET THE RPMS DOWN BY HIT THE GAS PETAL A COUPLE TIME. I STARTED TO CHECK ONLINE TO SEE IF THIS WAS A PROBLEM, I LEARN THAT MY FORD TAURUS WAS UNDER INVESTIGATION FOR CRUISE CONTROL/ ACCELERATOR ISSUES.  HAS FORD ADDRESS THIS ISSUE BEFORE SOMEONE GETS INJURIED OR KILLED. I WILL NOT LET MY FAMILY IN THE CAR UNTIL THE PROBLEM IS FIXED.  *JS",
        "vin": "1FAFP53U87A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/11/2014",
        "dateOfIncident": "04/01/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10568352,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 FORD TAURUS. THE CONTACT STATED THAT WHILE HE APPROACHED AN INTERSECTION AND STARTED TO DECELERATE WITH THE BRAKES APPLIED, THE VEHICLE ACCELERATED TO 60 MPH. AS THE VEHICLE CONTINUED TO ACCELERATE, THE CONTACT WAS ABLE TO TURN INTO AN OPENED AREA, SHIFT INTO PARK AND TURN THE ENGINE OFF. THE VEHICLE WAS TAKEN TO A MECHANIC, WHO PERFORMED AN INSPECTION AND ADVISED THAT THE CRUISE CONTROL LINKAGE HAD BECOME STUCK.  THE CRUISE CONTROL WAS DISCONNECTED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 60,000 AND THE CURRENT MILEAGE WAS 70,000.",
        "vin": "1FAFP53U57A"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/27/2013",
        "dateOfIncident": "12/15/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10557415,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 FORD TAURUS. THE CONTACT STATED THAT A  BURNING OIL SMELL WAS PRESENT INSIDE THE VEHICLE, CAUSING HER TO HAVE HEADACHES WHILE DRIVING. THE CONTACT INDICATED THE DEFECT WAS CAUSED BY A LEAKING OIL BAND GASKET THAT WAS REPLACED THREE TIMES IN THE PAST THREE YEARS. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED AND NO SOLUTION WAS OFFERED. THE FAILURE MILEAGE WAS 100,000.",
        "vin": "1FAFP56U47A"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/03/2013",
        "dateOfIncident": "12/03/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10554639,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I HIT A DEER AT 55 MILES PER HOUR THE AIRBAG AREA MADE A LOUD BANG AND SMELLED LIKE GUN POWDER AND DID NOT DEPLOY THE AIRBAG WARNING LIGHT IS LIT ON THE DASH . I PURCHASED THIS CAR FROM A DEALER WHEN THE CAR CAME OFF A LEASE PROGRAM.  *TR",
        "vin": "1FAFP53U97A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/02/2013",
        "dateOfIncident": "11/20/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10554369,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE TRANSMISSION HAS HESITATION, SHAKING PROBLEM AND RUBBING NOISES AT 35-40 MPH.  POSSIBLE FAILURE ON THE ROAD WAS ADMITTED BY FORD SERVICE DEPARTMENT.  VEHICLE WAS DIAGNOSED WITH THE PROBLEM AT LAST SERVICE BUT COULDN'T BE FIXED BECAUSE PARTS ARE NOT AVAILABLE.  THIS IS MY SOLE MEANS OF TRANSPORTATION BUT I WAS TOLD IT MAY BE MANY MONTHS BEFORE IT CAN BE FIXED.  MEANWHILE IT IS A SAFETY ISSUE AS BREAKDOWN ON THE ROAD MAY CAUSE ACCIDENT.  UPDATED 12/17/13*LJ  *TR",
        "vin": "1FAHP3K26CL"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/25/2013",
        "dateOfIncident": "11/16/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10553786,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE ROUGH STARTED AND WAS SURGING AND DIED IN THE LANE OF A TWO LANE BUSY ROAD, HAD TO MANUALLY STEER THE VEHICLE OFF THE BUSY ROAD INTO A DRIVEWAY UNTIL HELP ARRIVED. VEHICLE WOULD NOT RESTART FOR ABOUT 30 MINUTES. THE KEY WAS THEN CYCLED 3 TIMES AND THE CAR STARTED. INCIDENT #2 11/25/2013, SAME SCENARIO, WOULD NOT START FOR ABOUT 15 MINUTES WHEN KEY WAS RECYCLED 3 TIMES THE THIRD OR FOURTH TIME.  *TR",
        "vin": "1FAFP56U67A"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/09/2013",
        "dateOfIncident": "12/11/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10551631,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "IN EXTREMELY COLD WEATHER LAST WINTER, THE CAR DOORS WOULDN'T CLOSE.  THE LATCHES WOULDN'T CATCH.  DRIVING WAS DANGEROUS WITH KIDS IN THE CAR.  IN LOOKING ON THE INTERNET TO SEE IF OTHERS HAVE HAD THIS PROBLEM, I FOUND THAT MANY HAVE.  I HAVE BEEN TOLD BY THE DEALER THERE IS NO RECALL ON THIS PROBLEM OR DEFECT.  I HAVE TO PAY OVER $1,400 TO HAVE IT FIXED.  I EVEN CALLED FORD HEADQUARTERS.  NO LUCK.  *TR",
        "vin": "1FAFP53U17A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/18/2013",
        "dateOfIncident": "06/29/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10548477,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 FORD TAURUS. THE CONTACT STATED THAT WHILE DRIVING 25 MPH, THE CRUISE CONTROL COMMAND WAS TURNED ON AND THE VEHICLE ACCELERATED AND WOULD NOT STOP OR COME OUT OF CRUISE CONTROL UNTIL THE CONTACT SHIFTED INTO PARK AND TURNED THE VEHICLE OFF. THE VEHICLE WAS TAKEN TO A DEALER WHERE THE MECHANIC STATED THAT THE CRUISE CONTROL CABLE, THROTTLE CABLE AND THE THROTTLE BODY HAD TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED. THE FAILURE MILEAGE WAS 101,684...UPDATED 11-14-13 *BF  THE CONSUMER STATED THE VEHICLE CONTINUED TO ACCELERATE EVEN IN PARK. THE CRUISE CONTROL WOULD NOT TURN OFF. WHEN THE CONSUMER STARTED THE VEHICLE, IT ACCELERATED AT A HIGH RATE OF SPEED. SHE PUSHED THE ACCELERATOR PEDAL ALL THE WAY DOWN, FAST AND IT WENT TO NORMAL IDLE. THE VEHICLE ACCELERATED ON ITS OWN ON TWO PRIOR OCCASIONS.",
        "vin": "1FAFP53U67A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/02/2013",
        "dateOfIncident": "06/05/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10522787,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "IMPORTANT TO NOTE IS THAT A WEEK BEFORE THE FIRST INCIDENT THE CRUISE CONTROL STOPPED WORKING IN THAT IT WOULD TURN ON BUT I COULD NOT SET A SPEED ANYMORE. I DECIDED I WOULD HAVE THAT FIXED AT MY NEXT SCHEDULED SERVICING. AFTER A WEEK WHEN DRIVING AT ABOUT 40MPH THE CAR CONTINUED TO ACCELERATE AFTER I RELEASED THE THROTTLE, THE CRUISE CONTROL WAS NOT TURNED ON IT WAS STILL BROKEN. BRAKING A LITTLE TO STOP THE FORWARD MOMENTUM AND TAPPING THE THROTTLE RESOLVED THE ISSUE AT LEAST TEMPORARILY. AT THE TIME I THOUGHT IT MUST BE THE MAT SNAGGING IT. HOWEVER, ONLY A FEW DAYS LATER THE THROTTLE GOT STUCK AGAIN. AGAIN AT ABOUT 40MPH THE CAR CONTINUED TO ACCELERATE EVEN AFTER RELEASING THE THROTTLE. SINCE TAPPING THE THROTTLE DIDN'T WORK IMMEDIATELY I SHIFTED THE CAR INTO NEUTRAL AND THE ENGINE WAS RAGING AT 4000 RPM IN NEUTRAL. THIS WAS A VERY DANGEROUS SITUATION SINCE I WAS APPROACHING A BUSY INTERSECTION WHEN THIS HAPPENED. WITH THE CAR IN NEUTRAL I COULD STOP, THEN I SLAMMED THE THROTTLE A COUPLE OF TIMES AND IT RELEASED. I TOOK THE CAR TO THE DEALERSHIP THE NEXT DAY AND THEY REPLACED THE CRUISE CONTROL ASSEMBLY, WHICH FIXED THE PROBLEM. DOING SOME RESEARCH ONLINE SHOWED THAT FOR CERTAIN MAKES, WHEN THE CRUISE CONTROL CABLE GET LOOSE AND MOVES AROUND A LITTLE IT CAN INTERFERE WITH THE THROTTLE, WHICH I BELIEVE IS A SERIOUS PROBLEM THAT FORD SHOULD ADDRESS.  *TR",
        "vin": "1FAFP53U17A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/01/2013",
        "dateOfIncident": "01/06/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10522690,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN WET OR REALLY COLD OUTSIDE, GAS PEDAL STICKS AND YOU PUSH HARD ON IT AND IT EVENTUALLY GOES BUT SHOOTS YOU OUT INTO TRAFFIC OR FASTER THEN YOU WANT IT TO GO.  RIGHT AFTER YOU PUT INTO DRIVE OR IF YOU STOP AT A STOP LIGHT OR SIGN.  YOU CAN STOP, BUT THEN CAN'T GET IT TO GO.  SCARY CAUSE IF YOU ARE IN STOP AND GO TRAFFIC AND IT STICKS MAKES YOU SHOOT FAST SO YOU HAVE TO REALLY STAY BACK AND THEN CARS CUT IN FRONT AND IT HAPPENS.  ALMOST REAR ENDED A CAR SEVERAL DIFFERENT OCCASIONS.  *TR",
        "vin": "1FAFP56UX7A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/07/2013",
        "dateOfIncident": "04/23/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10510969,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 FORD TAURUS. THE CONTACT STATED THAT WHILE INSPECTING THE VEHICLE, THE TRANSMISSION DIP STICK WAS NOT SEALED PROPERLY, ALLOWING TRANSMISSION FLUID TO SPILL THROUGH THE FILLER TUBE. THE VEHICLE WAS NOT TAKEN TO THE DEALER. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE AND CURRENT MILEAGE WAS 34,782.  *TR",
        "vin": "1FAFP53U17A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/23/2013",
        "dateOfIncident": "04/06/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10509223,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 25 MPH TOOK FOOT OFF GAS TO SLOW DOWN AND CAR ACCELERATED ON ITS OWN. TAPPING ON GAS WOULD SLOW IT DOWN BUT DIDN'T STOP IT. PULLED IN PARKING LOT AND PUT VEHICLE IN PARK. RPM'S RACED TO OVER 3000 WITHOUT ME HAVING FOOT ON GAS. TURNED OFF AND STARTED UP AND RPMS STILL RACING. WHILE IN PARKING LOT ATTEMPTED TO DRIVE AND VEHICLE WOULD GO WITHOUT MY FOOT ON GAS. TOOK TO DEALER ON MONDAY AND HAPPENED ON WAY BUT OF COURSE NOTHING WHEN GOT TO DEALER.  ON 4/22/13 HAPPENED AGAIN WHILE DRIVING 35 MPH COULD FEEL THE GAS PEDAL ENGAGE AND CAR ACCELERATED ON OWN. AGAIN PULLED IN PARKING LOT AND PUT IN PARK. RPMS ACCELERATED. TURNED ON AND OFF THIS LASTED FOR 15 MINUTES. THEN COULD FEEL THE GAS PEDAL DISENGAGE. ABOUT 1 HOUR LATER HAPPENED AGAIN WHILE DRIVING. WAS IN DRIVE THROUGH LANE AND EVEN THOUGH FOOT ON BRAKE YOU COULD FEEL CAR TRY TO PUSH AGAINST IT. HAD PASSENGER IN CAR WITH ME WHO COULD EXPERIENCE IT AS WELL. I FEEL VERY UNSAFE IN THIS CAR AND DISAPPOINTED THAT FORD DEALER SAYS THEY KNOW OF NO FIX FOR THIS PROBLEM EVEN THOUGH ITS BEEN REPORTED FOR YEARS. *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/19/2013",
        "dateOfIncident": "04/19/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10508779,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "CRUISE CONTROL STOPPED WORKING - CHECKED CABLE AT THROTTLE AND IT HAD COME UNATTACHED-REATTACHED CABLE AND ALL WAS FINE FOR A DAY.  THEN CAR STARTED TO HOLD SPEED WHEN CRUISE CONTROL WAS NOT ON.  WHEN BRAKING, FELT LIKE GAS PEDAL WAS STILL ENGAGED.  PUT CAR INTO NEUTRAL AND RPMS WENT UP.  TAPPED GAS PEDAL AND ALL RETURNED TO NORMAL.  PUT CAR BACK INTO DRIVE AND IT WAS FINE AGAIN FOR A FEW MINUTES, THEN SAME PROBLEM HAPPENED AGAIN.  CAR WILL HOLD RPMS AS IF GAS PEDAL IS STILL ENGAGED EVEN WHEN MY FOOT IS NO LONGER ON THE GAS.  HAVE TO DEPRESS GAS PEDAL HARD AND FAST TO GET IT TO DISENGAGE AGAIN.  BEGINNING TO HAPPEN MORE REGULARLY.  HAVE TO PUT THE VEHICLE IN NEUTRAL OFTEN TO COME TO A SAFE STOP.  CRUISE CONTROL CABLE KEEPS DETACHING FROM ITS HOUSING AND MAKES THE THROTTLE STICK PARTIALLY OPEN.  *TR",
        "vin": "1FAFP53U37A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/29/2013",
        "dateOfIncident": "11/15/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10504924,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 FORD TAURUS. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 40 MPH, THE VEHICLE ACCELERATED INDEPENDENTLY. THE CONTACT REMOVED THE FLOOR MATS BUT THE FAILURE CONTINUED TO RECUR INTERMITTENTLY. THE CONTACT STATED THAT SHE WOULD TAP ON THE ACCELERATOR PEDAL SEVERAL TIMES IN ORDER TO STOP THE INADVERTENT ACCELERATION. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 98,000.  *TR",
        "vin": "1FAFP53U67A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/09/2013",
        "dateOfIncident": "03/09/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10502214,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE IS ACCELERATING ON ITS OWN. I WAS DRIVING AT ABOUT 25 TO 30 MILES PER HOURS WHEN I NOTICE THE NEEDLE ON THE INSTRUMENT PANEL WASN'T GOING DOWN WHEN I TOOK MY FOOT OFF THE PEDAL,AND LATER IT STARTED TO GET MORE AGGRESSIVE AND STARTED ACCELERATING ON ITS OWN. I MADE IT HOME SAFELY, BUT I'M AFRAID TO DRIVE MY CAR NOW.  *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/02/2013",
        "dateOfIncident": "02/20/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10501053,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS INCREASING SPEED WITHOUT GIVING IT GAS. HAD TO PUSH ON THE BRAKE HARD TO SLOW DOWN. CRUISE CONTROL WAS NOT ON. AFTER STOPPING IT APPEARED TO BE OK, BUT THE CRUISE WOULD NO LONGER WORK. THE CRUISE LIGHT COMES ON, BUT NOTHING HAPPENS. I CHECKED UNDER THE HOOD AND THE CABLE GOING TO THE CRUISE CONTROL HAD POPPED OFF.     REATTACHING THE CABLE DID NOT FIX THE PROBLEM AS THE CRUISE STILL DOES NOT WORK. I CHECKED AND THE CABLE WAS OFF AGAIN.  *TR",
        "vin": "1FAFP53U07A"
    },
    {
        "components": "VEHICLE SPEED CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/18/2013",
        "dateOfIncident": "02/08/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10498509,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN GOING DOWN THE STREET AT ANY SPEED, THE CAR CAN JUST START GOING FASTER ON ITS OWN, GOING AROUND CORNERS OR ANYTIME GOING DOWN THE ROAD. ITS GETTING VERY DANGEROUS. MOST OF THE TIME WHEN YOU TAP ON THE GAS PEDAL, IT WILL BREAK FREE AND GO BACK TO NORMAL BUT SOMETIMES IT JUST GOES FASTER AND FASTER. HAVE TO POP IT IN NEUTRAL AND KEEP TAPPING THE PEDAL AND HOPE IT GOES BACK TO NORMAL. VERY DANGEROUS FOR ME OR MY KIDS AND OTHER DRIVERS ON THE ROAD.    ANOTHER THING IS THAT I CAN TURN ON THE CRUISE CONTROL AND THE LIGHT SHOWS IT IS ON BUT WHEN I PUSH THE SET BUTTON NOTHING HAPPENS.  *TR",
        "vin": "1FAFP56U47A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/10/2013",
        "dateOfIncident": "01/06/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10492078,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN GOING DOWN THE STREET AT ANY SPEED, THE CAR CAN JUST START GOING FASTER ON ITS OWN, GOING AROUND CORNERS OR ANYTIME GOING DOWN THE ROAD. ITS GETTING VERY DANGEROUS.   MOST OF THE TIME WHEN YOU TAP ON THE GAS PEDAL, IT WILL BREAK FREE AND GO BACK TO NORMAL BUT SOMETIMES IT JUST GOES FASTER AND FASTER. HAVE TO POP IT IN NEUTRAL AND KEEP TAPPING THE PEDAL AND HOPE IT GOES BACK TO NORMAL. VERY DANGEROUS FOR ME OR MY KIDS AND OTHER DRIVERS ON THE ROAD.   I AM TRYING TO GET IT FIXED VERY SOON. RIGHT NOW THE MECHANIC DOES NOT KNOW WHAT IS WRONG AND I AM STILL DRIVING IT BECAUSE I HAVE TO GET TO WORK. ITS MY ONLY CAR.  *TR",
        "vin": "1FAFP53U97A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/28/2012",
        "dateOfIncident": "11/25/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10486323,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY 2007 FORD TAURUS SE WITH MY FAMILY IN THE VEHICLE WITH ME, OUT OF NOWHERE MY CAR RPM SHOT UP. I HAD TO PUT MY CAR IN PARK WHILE MY ENGINE IS SCREAMING AND HIT THE GAS PEDDLE COUPLE OF TIMES, TO BRING MY RPM BACK DOWN.(NOTE: RPM BE AROUND 4000). SOMETIMES WHILE I'M DRIVING MY CAR, IT WILL KEEP THE SAME SPEED OR IT WILL ACCELERATE WITHOUT HITTING THE GAS PEDDLE.  *TR",
        "vin": "1FAFP53U97A"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/01/2012",
        "dateOfIncident": "10/27/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10482820,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING SLOWLY THE VEHICLE BECAME LOUD. THE EXHAUST PIPE HAD BROKE AWAY FROM ITS EXHAUST PIPE TO EXHAUST MANIFOLD CLAMP AND WAS LAYING ON THE GROUND. THE ACTUAL CLAMP WAS STILL IN PLACE.  *TR",
        "vin": "1FAFP53U47A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/26/2012",
        "dateOfIncident": "10/16/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10482404,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING UPHILL AT 25 MPH. WHEN I REACHED THE CREST OF THE HILL, IT FELT LIKE THE GAS PEDAL PUSHED ITSELF DOWN AND WOULD NOT RELEASE. THE RPM WENT UP TO 4,000 AND MY CAR WAS ACCELERATING. I PUT BOTH OF MY FEET ON THE BRAKES, WHICH HAD LITTLE EFFECT. I THEN PULLED OVER AND SHUT OFF MY CAR. AFTER, I PUT MY CAR IN PARK AND PUT THE EMERGENCY BRAKE ON FOR PRECAUTIONS. I STARTED MY CAR UP AFTER LETTING IT REST FOR AWHILE AND IT IMMEDIATELY WENT UP TO 4,000 RPM(S). I SHUT IT OFF AGAIN AND LET IT REST FOR AWHILE. I STARTED IT UP AGAIN AND IT WAS NORMAL.   *TR",
        "vin": "1FAFP53U26A"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/19/2012",
        "dateOfIncident": "06/02/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10475993,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE PEDAL GOES ALL THE WAY TO FLOOR WITH NO STOPPING THE CAR,THEN THEY WORK FINE, BRAKE FLUID IS FULL NO BRAKE LIGHT ON, ANOTHER INCIDENT 9/18/12. NOT A GOOD FEELING WHEN THIS HAPPENS.  *TR",
        "vin": "1FAFP53U67A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/22/2012",
        "dateOfIncident": "08/15/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10471963,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "\"CHECK TRANSMISSION\" HAS COME UP THREE TIMES ON DISPLAY OVER THE PAST 2 MONTHS.  I AM NOT SURE OF THE DATES OF THE FIRST 2 INCIDENTS BUT EACH TIME I FOUND TRANSMISSION FLUID UNDERNEATH THE CAR AS I DROVE AWAY.  I ALSO FOUND FLUID ON THE ENGINE BLOCK AFTER THE SECOND INCIDENT.  I TOOK IT TO A LOCAL MECHANIC AFTER THE SECOND INCIDENT, AND THEY SAID MY TRANSMISSION WAS STARTING TO GO BUT THEY COULD NOT BE SPECIFIC ON WHEN THIS WOULD HAPPEN.  THE LAST INCIDENT HAPPENED LAST WEEK, AND I DECIDED TO TAKE IT TO THE LOCAL FORD DEALERSHIP.  THEY SPENT TIME LOOKING AT MY CAR AND FOUND THE PROBLEM TO BE THE TORQUE CONVERTER!  AGAIN, I WAS ALSO TOLD THAT THERE WAS NO TELLING WHEN THE TRANSMISSION WILL FAIL.  *TR",
        "vin": "1FAFP53U77A"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/30/2012",
        "dateOfIncident": "07/15/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10468294,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE RETURNING TO LUBBOCK, TX FROM CARROLLTON, TX WITH THE CRUISE CONTROL ON THE ENGINE BEGAN RACING BUT THE CAR SLOWED DOWN.  APPLIED BRAKE TO TURN OFF CRUISE CONTROL AND COASTED OFF THE HIGHWAY.  THE TEMPERATURE WAS ABOUT 105 DEGREES OUTSIDE AND WAS 20 MILES AWAY FROM NEAREST TOWN.  WAS STRANDED UNTIL TOW TRUCK COULD MAKE IT OUT THERE.  CAR WOULD NOT ENGAGE IN ANY GEAR.  SHOP DETERMINED THAT TORQUE CONVERTER FAILED.  CAR HAS NEVER TOWED ANYTHING.  *TR",
        "vin": "1FAFP53U17A"
    },
    {
        "components": "ENGINE",
        "crash": true,
        "dateComplaintFiled": "07/19/2012",
        "dateOfIncident": "07/19/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10466658,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 FORD TAURUS. THE CONTACT STATED WHILE DRIVING 20 MPH THE VEHICLE STALLED, CAUSING HIM TO HAVE  TO AVOID AN CRASH. THE CONTACT WAS ABLE TO COAST INTO A PARKING LOT AND THEN CRASHED INTO A CEMENT PARKING CHOCK. THE VEHICLE WAS TOWED TO A PERSONAL MECHANIC FOR DIAGNOSIS AND THE CONTACT WAS STILL WAITING FOR THE RESULTS. THE VEHICLE HAD NOT BEEN REPAIRED. THE VIN WAS NOT AVAILABLE. THE FAILURE AND CURRENT MILEAGES WERE 120,000.",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/04/2012",
        "dateOfIncident": "07/11/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10464195,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR CONTINUED TO ACCELERATE AND HAD DIFFICULTY IN STOPPING. PUT INTO NEUTRAL AND ENGINE RACED FOR A FEW MINUTES, TAPPED GAS PEDAL AND IT SLOWED DOWN. THERE HAVE BEEN FOUR INCIDENTS OF THIS NATURE SINCE THE LATEST BEING SUNDAY, JULY 1, 2012. AFTER THE FIRST THREE INCIDENTS IT WAS TAKEN TO THE LOCAL FORD DEALER AND THEY COULD FIND NOTHING WRONG. THE LAST INCIDENT WHEN PUT INTO NEUTRAL THE ENGINE AND TRANSMISSION SHOOK FOR A WHILE AND IT SLOWED DOWN.   *JS",
        "vin": "1FAFP56UX7A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/25/2012",
        "dateOfIncident": "06/23/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10462932,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR EXPERIENCE UNCONTROLLED, UNINTENDED ACCELERATION.  WHEN THE BRAKE PEDAL WAS PRESSED, THE ENGINE CONTINUED TO ACCELERATE.  WHEN THE TRANSMISSION WAS SHIFTED TO NEUTRAL, THE ENGINE REVVED VERY HIGH.  HARD BRAKING WAS REQUIRED TO BRING THE CAR TO A STOP DUE THE  REVVING ENGINE.  WHEN THE BRAKE PEDAL WAS RELEASED AFTER STOPPING THE CAR EXPERIENCED A SUDDEN START DUE TO THE REVVING ENGINE.  *TR",
        "vin": "1FAFP53U87A"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/30/2012",
        "dateOfIncident": "09/13/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10460090,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN A ROAD AT 45 MPH AND THE ELECTRICAL SYSTEM WENT OFF.  THE AUTOMATIC LOCKS STARTED LOCKING AND UNLOCKING, THE DASH LIGHTS, ALARM SYSTEM, AIR BAG, CHECK ENGINE, CAME ON AND THE SPEEDOMETER AND THE TACHOMETER WENT TO ZERO EVEN THOUGH I WAS MOVING. I BROUGHT IT TO A MECHANIC AND THEY COULD FIND NOTHING.  IT HAS HAPPENED REPEATEDLY SINCE THEN, THE LATEST GOING 65 MPH ON A FOUR LANE HIGHWAY IN HEAVY TRAFFIC.  THE ENGINE CUTS OUT AS WELL, BUT THE BLINKING LIGHTS MAKE ME THINK IT'S ELECTRICAL.  IT'S RIDICULOUSLY DANGEROUS.  *TR",
        "vin": "1FAFP53U97A"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/19/2012",
        "dateOfIncident": "04/19/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10455741,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE ALREADY HAD THE THROTTLE BODY REPLACED 3 TIMES ON MY VEHICLE.  IT LOPE, HEADLIGHTS DIM/BRIGHT, AND JUTTS. ALSO SLIGHT UNEXPLAINED ACCELERATION OCCURS, AND OCCASIONAL HESITATION ON ACCELERATION.  FUEL FILTER REPLACED, FUEL PUMP CHECKED OUT WORKING PROPERLY, AND INJECTORS ARE RUNNING FINE. ALSO ALTERNATOR CHECKED OUT GOOD, NEW SPARK PLUGS, WIRES WORKING FINE, NEW BATTERY. MECHANIC CANNOT FIND ANYTHING WRONG WITH THE CAR, BUT IT RUNS TERRIBLY. IT`S LOPED SINCE AROUND 60K MILES, AND SEEMS TO BE STEADILY GETTING WORSE.   ALSO ON THIRD RADIATOR.   A FRIEND TOLD ME IT COULD BE THE AC GETTING LOW OR CHARGING, OR POSSIBLE IAC MOTOR GOING OUT, BUT THERE`S NO REAL GOOD WAY OF TESTING IT. DEALERS KEEP TELLING ME THEY WON`T FIX UNLESS IT`S FOR SURE BROKEN. WILL TAKE TILL I`M STRANDED TILL A MECHANIC WILL FIX THE PROBLEM.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/04/2012",
        "dateOfIncident": "02/15/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10454188,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR ACCELERATED WHEN BRAKING APPROACHING INTERSECTION. THROTTLE APPEARED STUCK. HAD TO \"GUN THROUGH INTERSECTION\", RACE INTO PLAZA PARKING LOT ON OTHER SIDE AND PARK IRREGULARLY SHUTTING ENGINE OFF. TRIED RESTARTING FIVE MINUTES LATER, SAME PROBLEM SO LEFT PARKED AND CALLED FOR RIDE. NEXT MORNING CALLED OUR MECHANIC THREE MILES AWAY AND HE SAID TO \"BRING IN SLOWLY WITH CAUTION SO AS TO NOT ACCELERATE INTO SOMETHING, OTHERWISE CALL FOR TOW\". DID AS TOLD AND AN ELECTRONIC SENSOR WAS REPLACED. HEARD RECENTLY ABOUT THE PROBLEMS BEING INVESTIGATED WITH SIMILAR SYMPTOMS ON '06 TAURUS' DUE TO POSSIBLE CRUISE CABLE FAILURE? OUR CRUISE STOPPED WORKING LAST YEAR-USE ONLY ON LONG TRIPS AND SO NOTICED AT CHRISTMAS GOING 300 MILES HWY TO RELATIVES. COINCIDENCE? ANYWAY, WAS ON WAY HOME TODAY AND ACCELERATOR AGAIN RACED AND HAD TO PULL OVER SEVERAL TIMES IN ORDER NOT TO HURT TRANSMISSION JAMMING GEAR SHIFT INTO PARK SINCE HOLDING DOWN BRAKE HARD WASN'T STOPPING CAR. AGAIN DROVE IT TO MECHANIC AND WAS PICKED UP. WILL SPEAK WITH HIM IN THE MORNING ABOUT CHECKING PART ALREADY REPLACED ETC. BEFORE AN ACCIDENT OR TRANSMISSION BLOWUP OCCUR(WAS ALREADY CLOSED WHEN I ARRIVED). PART REPLACED HAS ONLY BEEN USED A MONTH OR SO BY ME!?  *TR",
        "vin": "1FAFP56UX7A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/22/2012",
        "dateOfIncident": "03/20/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10452652,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS 2007 FORD TAURUS. THE CONTACT STATED THAT THERE WERE THREE OCCURRENCES OF SUDDEN ACCELERATION EXPERIENCED IN THE VEHICLE. THE CONTACT STATED THAT WHEN THE FAILURE WOULD OCCUR, THE ENGINE WOULD EXHIBIT EXCESSIVELY HIGH RPMS EVEN WITH THE BRAKES APPLIED.  THE VEHICLE WAS TAKEN TO THE DEALER WHO STATED TO THE CONTACT THAT THERE WERE NO FAILURES WITHIN THE VEHICLE. IN ADDITION, THE CRUISE CONTROL WAS INOPERABLE. THE VEHICLE WAS NOT REPAIRED. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS UNKNOWN, BUT THE CURRENT MILEAGE WAS 100,000.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/21/2012",
        "dateOfIncident": "10/01/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10452504,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 FORD TAURUS. THE CONTACT STATED THAT THE VEHICLE WOULD ACCELERATE RAPIDLY WHEN APPLYING VERY MINIMAL PRESSURE TO THE ACCELERATOR PEDAL. THE VEHICLE WAS NEITHER INSPECTED NOR REPAIRED. THE MANUFACTURER WAS CONTACTED AND OFFERED NO ASSISTANCE. THE FAILURE AND THE CURRENT MILEAGES WERE UNKNOWN. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/13/2012",
        "dateOfIncident": "03/01/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10451372,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 FORD TAURUS. THE CONTACT STATED THAT WHILE STOPPED AT A STOP LIGHT, THE VEHICLE LUNGED FORWARD. THE FAILURE OCCURRED APPROXIMATELY FIVE DIFFERENT TIMES INTERMITTENTLY. THE VEHICLE WAS NOT TAKEN TO THE DEALER FOR A DIAGNOSTIC TEST. THERE WAS AN INVESTIGATION UNDER NHTSA ACTION NUMBER PE12005 (VEHICLE SPEED CONTROL:CABLES) THAT MAY BE RELATED TO THE FAILURE, BUT DID NOT INCLUDED THE 2007 FORD TAURUS. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 30,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/13/2012",
        "dateOfIncident": "02/01/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10451376,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 FORD TAURUS. THE CONTACT STATED THAT WHILE DRIVING 50 MPH, THERE WAS AN INCREASE IN THE ENGINE RPMS. THE CONTACT HAD TO TAP ON THE ACCELERATOR PEDAL TO STOP THE FAILURE. THE FAILURE HAD SINCE RECURRED INTERMITTENTLY. THE CONTACT ALSO STATED THAT THE CRUISE CONTROL FEATURE NO LONGER FUNCTIONED. THE VEHICLE WAS TAKEN TO AND INDEPENDENT REPAIR SHOP AND THEY COULD NOT DIAGNOSE THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 111,000.  UPDATED 04/06/12*LJ  THE CONSUMER STATED THE CRUISE CONTROL FEATURE NO LONGER WORKED. UPDATED 04/16/12",
        "vin": "1FAFP53U47A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/13/2012",
        "dateOfIncident": "08/09/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10451395,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE I OWN HAS HAD A STUCK THROTTLE ISSUE IN THE PAST. THIS OCCURRED WHILE I WAS DRIVING THROUGH A MAIN STREET IN MY HOMETOWN. I HAD ACCELERATED INTO TRAFFIC WITHOUT ISSUE EXCEPT THAT WHEN I REMOVED MY FOOT FROM THE ACCELERATOR, THE VEHICLE CONTINUED TO ACCELERATE. I WAS ABLE TO SAFELY PUT THE VEHICLE INTO NEUTRAL AND PULL TO THE SIDE OF THE ROAD TO INVESTIGATE THE ISSUE. IT APPEARS THE CRUISE CONTROL CABLE SIMPLY SNAPS ONTO THE THROTTLE BODY ASSEMBLY WITH A QUICK CONNECT CLIP AND HAS SIMPLY WORN OUT. IN DOING SO, WITH THE CABLE BEING FAIRLY RIGID, STICKS STRAIGHT OUT AND MAY BECOME LODGED ON THE PROTRUDING BUTTON THAT THE CABLE ATTACHES TO AND PROP THE THROTTLE PARTIALLY OPEN. I WAS ABLE TO PREVENT FURTHER ISSUES WITH A SMALL ZIPTIE ON THE CABLE AND HAD NO FURTHER ISSUES. I AM FILING A COMPLAINT AS IT DOES NOT SEEM TO COVER THE 2007 MODEL YEAR TAURUS WHICH LIKELY HAS THE SAME ASSEMBLY AS EARLIER MODEL YEARS. I HAVE A COUPLE OF IMAGE LINKS FROM MY TEMPORARY FIX IF THEY WOULD PROVE TO BE HELPFUL. HTTP://IMG14.IMAGESHACK.US/IMG14/8969/CRUISECABLE1.JPG  HTTP://IMG339.IMAGESHACK.US/IMG339/5510/CRUISECABLE2.JPG.  *TR",
        "vin": "1FAFP53U37A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/13/2012",
        "dateOfIncident": "03/13/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10451443,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "ACCELERATOR STICKING UPON INITIAL STARTING OFF AFTER VEHICLE SITS FOR A SHORT PERIOD.  *TR",
        "vin": "1FAFP56U47A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/12/2012",
        "dateOfIncident": "01/13/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10451218,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 FORD TAURUS. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, THE VEHICLE EXPERIENCED SUDDEN ABNORMAL ACCELERATION. THE CONTACT STATED THAT THE VEHICLE WAS STILL ACCELERATING WHILE THE BRAKES WERE BEING APPLIED. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THE DEALER REPLACED THE CRUISE CONTROL CABLE. THE CONTACT STATED THAT THE FAILURE PERSISTED AFTER THE REPAIRS. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 30,000 AND THE CURRENT MILEAGE WAS 80,000.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/12/2012",
        "dateOfIncident": "01/16/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10451235,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE THROTTLE ON MY CAR HAS GOTTEN  STUCK ON ME ON FIVE DIFFERENT TIMES. THE FIRST TIME I WAS COMING TO A RED LIGHT AND THE CAD AR SPEEDED UP TO FIFTY MILES AN HOUR. I HAD TO PULL TO THE SIDE OF THE ROAD AND SHUT THE CAR OFF. I STARTED THE CAR AND THE THROTTLE WAS STILL STUCK IN PARK. I HAD TO WAIT FIFTEEN MINUTES BEFORE IT STOPPED. IT HAS GOTTEN STUCK ON THE OPEN HIGHWAY ALSO. *TR",
        "vin": "1FAFP53U07A"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/12/2012",
        "dateOfIncident": "02/07/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10451277,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE IDLE SPEED WOULD SURGE AFTER A COLD START.  A MECHANIC CLEANED THE THOTTLE BODY.  THIS SEEMED TO HELP THE SURGING PROBLEM, BUT THEN THE CAR WOULD START TO ACCELERATE FOR NO APPARENT REASON.  TO STOP THE VEHICLE FROM ACCELERATING, IT WAS NECESSARY TO SHIFT INTO NEUTRAL & PUMP THE GAS PEDAL SEVERAL TIMES.  AFTER THIS HAPPENED A COUPLE OF TIMES I HAD THE IDLE CONTROL MODULE REPLACED.  FOR A WHILE THE VEHICLE RAN OK, THEN IT STARTED TO ACCELERATE AGAIN FOR NO REASON.  WHILE IT WAS ACCELERATING, I SHIFTED TO NEUTRAL AND PULLED TO THE SIDE OF THE ROAD.  TURNED THE ENGINE OFF AND THEN ON AGAIN AND IT REVVED UP TO 4000 RPM.  LOOKING AROUND THE THROTTLE BODY, I FOUND A CABLE DISCONNECTED FROM THE LOWER PART OF THE THROTTLE BODY.  THIS CABLE WENT TO A BOX NEAR THE FIREWALL WHICH I ASSUME TO BE THE CRUISE CONTROLLER.  I RECONNECTED THE CABLE AT THE THROTTLE BODY AND HAVE NOT ANY PROBLEMS SINCE THEN.  HOWEVER, I AM AMAZED AT HOW EASY IT IS TO DISCONNECT THE CABLE FROM THE THROTTLE BODY.  IT PROBABLY BECAME DISCONNECTED WHEN THE MECHANIC CLEANED THE THROTTLE BODY.  *TR",
        "vin": "1FAFP56U47A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/12/2012",
        "dateOfIncident": "06/13/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10451323,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN YOU START YOUR CAR IN THE MORNING. THEN YOU PUT IT IN DRIVE AND PUSH THE PEDDLE THE CAR WILL NOT KICK IN. YOU HAVE TO PUSH THE GAS PEDDLE HARD BEFORE IT WILL ACCELERATOR.  *TR",
        "vin": "1FAFP53U47A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "01/20/2012",
        "dateOfIncident": "12/27/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10444624,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 FORD TAURUS. THE CONTACT WAS REVERSING INTO A PARKING SPACE AND AS HE SHIFTED INTO DRIVE, THE VEHICLE EXHIBITED AN ABNORMALLY LOUD NOISE BEFORE RAPIDLY ACCELERATING. THE CONTACT CRASHED INTO A CEMENT BARRIER AND SUSTAINED INJURIES TO HIS FOOT. THE CONTACT'S INJURIES WERE FROM HIM ATTEMPTING TO DEPRESS THE BRAKE PEDAL AS THE FAILURE OCCURRED. THE VEHICLE WAS UNRESPONSIVE TO BRAKING ATTEMPTS. A POLICE REPORT WAS FILED (PARSIPPANY-TROY POLICE DEPARTMENT REPORT NUMBER: IR#29461). THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND THE CURRENT MILEAGE WAS 62,000.",
        "vin": "1FAFP53U97A"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/13/2012",
        "dateOfIncident": "08/10/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10443755,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 FORD TAURUS.  THE CONTACT STATED THE VEHICLE STALLED WHILE DRIVING 30 MPH. THE CONTACT TOOK THE VEHICLE TO THE DEALER WHO STATED THE INSTRUMENT CLUSTER CAUSED THE VEHICLE TO STALL. THE DEALER REPLACED THE INSTRUMENT CLUSTER.  A MONTH AFTER THE REPAIR THE VEHICLE CONTINUED TO STALL.  THE CONTACT TOOK THE VEHICLE BACK TO THE DEALER WHO CONFIRMED THAT THE INSTRUMENT CLUSTER WAS FAULTY AND NEEDED TO BE REPLACED AGAIN. THE SECOND  REPAIR ALSO DID NOT REMEDY THE STALLING.  THE FAILURE MILEAGE WAS 58,000.",
        "vin": "1FAFP56U27A"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/06/2012",
        "dateOfIncident": "01/06/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10442613,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WE PULLED OUT OF OUR DRIVEWAY AND DROVE AROUND THE CORNER WHEN WE HEARD A LOAD NOISE. THE CAR HAD LITTLE POWER; THEREFORE, WE TURNED AROUND AND, SLOWLY, DROVE BACK TO OUR HOME. UPON INSPECTING THE VEHICLE, IT WAS FOUND THAT THE EXHAUST PIPE HAD DROPPED AND WAS DRAGGING ON THE GROUND. I DID A SEARCH FOR 2007 FORD TAURUS EXHAUST SYSTEM PROBLEMS AND FOUND THAT THIS IS A VERY COMMON OCCURRANCE FOR THIS VEHICLE YEAR. I AM CONCERNED THAT THE VEHICLE WAS NOT RECALLED AND THE PROBLEM REPAIRED AT NO COST TO THE CONSUMER. AS A RECALL COORDINATOR AT A MEDICAL DEVICE MANUFACTURER, I UNDERSTAND THE IMPORTANCE OF QUALITY IN YOUR PRODUCT AS WELL AS THE COST OF POOR QUALITY. I DO NOT BELIEVE THAT THE COST OF POOR QUALITY SHOULD BE PASSED ON TO THE CONSUMER. FORD SHOULD HAVE TO TAKE CARE OF ALL EXPENSES.     I PURCHASED THIS AUTOMOBILE WITH 14000 MILES AND WAS NOT AWARE OF THIS PROBLEM. THOUGH THE CAR HAS A SUBSTANTIAL NUMBER OF MILES, THIS STILL SHOULD NOT HAVE OCCURRED AND I WAS NEVER AWARE OF THIS REOCCURRING PROBLEM; OTHERWISE,I WOULD NEVER HAVE PURCHASED THE VEHICLE KNOWING THAT THE MANUFACTURER WAS NOT COVERING THE COST TO REPAIR THE PROBLEM. HAD WE BEEN ON THE HIGHWAY TRAVELING AT RATES OF 65 TO 70 MILES PER HOUR, WE WOULD HAVE BEEN SERIOUSLY INJURED, MAIMED, OR EVEN KILLED!  *TR",
        "vin": "1FAFP53UX7A"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/30/2011",
        "dateOfIncident": "12/24/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10441708,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD DRIVEN MY CAR IN THE AM AND IT WOULD NOT START IN THE AFTERNOON.  I CALLED FOR A TOW ON MONDAY, AFTER THE HOLIDAY.  THE SYMPTOMS PRESENTED AT THE TIME OF FAILURE WERE: THE CAR DID NOT START, AND THE ANTI-THEFT LIGHT WAS BLINKING.  THE CAR WAS JUMPED AND THE VEHICLE WAS BROUGHT IN FOR SERVICE.  THE DEALERSHIP COULD NOT FIND ANY PROBLEMS.  TODAY, THE CAR STOPPED WORKING AGAIN, SAME ISSUES.  THIS TIME I DID NOT ALLOW THE CAR TO BE JUMPED.  INSTEAD, IT WAS TOWED TO THE DEALER WHO WAS ABLE TO RUN A BETTER DIAGNOSTIC WHICH APPEARED TO BE THE ALTERNATOR, BUT IT COULD ALSO BE THE COMPUTER.      IN RESEARCHING THE ISSUE ON MY OWN, THIS SEEMS TO BE A MAJOR PROBLEM WITH FORD CARS AND HAS BEEN FOR YEARS.  SOME WERE DRIVING WHEN THE CAR JUST 'SHUT DOWN.  THE FOLLOWING ARE JUST A FEW OF THE COMPLAINTS THAT I'VE FOUND.     HTTP://WWW.ARFC.ORG/COMPLAINTS/2002/FORD/TAURUS/10405871.ASPX  HTTP://WWW.FORDTAURUS.NET/FORUMS/VIEWTOPIC.PHP?F=37&T=13438&P=101835#P101835  TOWNHALL-TALK.EDMUNDS.COM/DIRECT/VIEW/.F110E23TOWNHALL-TALK.EDMUNDS.COM/DIRECT/VIEW/.F110E23  HTTP://WWW.FORD-FORUMS.COM/ENGINE-DRIVETRAIN/2000-FORD-TAURUS-CAR-WONT-START-ANTI-THEFT-DEVICE-BLINKS-T31244.HTML  HTTP://TOWNHALL-TALK.EDMUNDS.COM/DIRECT/VIEW/.F110E23  HTTP://TOWNHALL-TALK.EDMUNDS.COM/DIRECT/VIEW/.F0CE673/204#MSG204  HTTP://TOWNHALL-TALK.EDMUNDS.COM/WEBX?229@@.F0CE673/204   HTTP://ANSWERS.YAHOO.COM/QUESTION/INDEX?QID=20070823101809AAEOYAE  HTTP://WWW.CARCOMPLAINTS.COM/FORD/TAURUS/2002/ENGINE/ENGINE_FAILS_TO_START_WHEN_WARM.SHTM.    PLEASE NOTE, ONE REPORT ON ONE WEBSITE HAS HAD OVER 600 VIEWS.  THIS IS A SERIOUS ISSUE THAT HAS GONE ON FOR QUITE SOME TIME AND FORD NEEDS TO FIX IT.      THANK YOU FOR YOUR TIME!    SINCERELY,    [XXX]  INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).     *KB",
        "vin": "1FAFP56U27A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/16/2011",
        "dateOfIncident": "12/09/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10440166,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 FORD TAURUS.  THE CONTACT STATED WHEN HE PLACED THE VEHICLE INTO DRIVE IT WOULD NOT MOVE.  THE DEALER HAD NOT BEEN NOTIFIED.  THE MANUFACTURER DID NOT OFFER ANY ASSISTANCE SINCE THE VEHICLE WAS NO LONGER UNDER WARRANTY.  NO REPAIRS WERE PERFORMED.  THE CURRENT MILEAGE WAS 65,000 AND THE FAILURE MILEAGE WAS 64,900.  THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/20/2011",
        "dateOfIncident": "09/13/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10426464,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 FORD TAURUS. THE CONTACT STATED THAT WHEN DEPRESSING THE BRAKES THE ENGINE WOULD EXHIBIT AN ABNORMAL INCREASE IN RPMS. THE CONTACT WOULD SHIFT INTO NEUTRAL IN ORDER FOR THE RPMS TO RETURN TO NORMAL. THE VEHICLE WAS TAKEN TO A DEALER AND THEY WERE UNABLE TO DIAGNOSE THE FAILURE. THE VEHICLE WAS NOT REPAIRED AND THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS APPROXIMATELY 70,900.",
        "vin": "1FAFP53U37A"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/12/2011",
        "dateOfIncident": "07/11/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10412039,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 FORD TAURUS.  THE CONTACT STATED THAT A WARNING CHIME SOUNDED AND THE CHECK CHARGING SYSTEM WARNING INDICATOR WAS ILLUMINATED. THE DEALER WAS UNABLE TO PROVIDE A CAUSE FOR THE FAILURE AND THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE BUT DID NOT ASSIST THE CONTACT WITH THE FAILURE.  THE FAILURE MILEAGE WAS 50,000 AND THE CURRENT MILEAGE WAS 78,000.   UPDATED 8/29/11 *CN  THE CONSUMER WAS INFORMED THE ALTERNATOR WAS REPLACED AND THE LIGHT HAS REMAINED OFF. THE TORQUE CONVERTER WAS REPLACED TWICE.  UPDATED 09/26/11",
        "vin": "1FAFP56U47A"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/22/2011",
        "dateOfIncident": "05/22/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10403250,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PULLING OUT OF A PARKING LOT THE EXHAUST PIPE FAILED AT THE MANIFOLD CONNECTION DROPPING THE ENTIRE FRONT OF THE EXHAUST, INCLUDING THE CATALYTIC CONVERTER TO THE GROUND. AT A HIGHER SPEED OR WITH UNEVEN GROUND THIS COULD HAVE CAUSED SERIOUS DAMAGE OR INJURY. THIS APPEARS TO BE A COMMON OCCURRENCE WITH THIS YEAR VEHICLE.  EXHAUST/EMISSIONS PROBLEM.  THE CONSUMER STATED FORD IS COVERING THE PARTS AND LABOR AT 100%. UPDATED 05/24/11",
        "vin": "1FAFP53U37A"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/18/2011",
        "dateOfIncident": "05/16/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10401431,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONNECTION FROM THE EXHAUST SYSTEM TO THE ENGINE MANIFOLD HAS FAILED TWICE, ONCE AT 32K MILES AND NOW AT 81K MILES. BOTH TIMES THIS CAUSED THE ENTIRE EXHAUST SYSTEM TO COLLAPSE TOWARDS THE FRONT OF THE VEHICLE CAUSING THE VEHICLE TO STOP MOVING FORWARD. LUCKILY BOTH TIMES I WAS IN A PARKING LOT GOING UNDER 15MPH OTHERWISE THIS COULD HAVE CAUSED AN ACCIDENT ON A ROADWAY. I DID NOT HIT ANYTHING EITHER TIME. THE SAFETY CONCERN IS NOT THE FACT THAT THIS PART FAILS FOR NO APPARENT REASON, BUT THE FACT THAT THERE IS NO SUPPORT FOR THE EXHAUST SYSTEM BETWEEN THE REAR AND FRONT OF THE VEHICLE.  *TR",
        "vin": "1FAFP53U97A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/14/2011",
        "dateOfIncident": "01/05/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10382608,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE OWNED MY 2007 FORD TAURUS FOR APPROX. 4 YEARS, AND EACH WINTER I'VE HAD TO HAVE THE THROTTLE BODY REPLACED. EVERY WINTER THE ACCELERATOR TENDS TO BECOME STICKY. LUCKILY I PURCHASED AN EXTENDED WARRANTY ON THIS CAR. I HAVE HAD TO USE IT ON SEVERAL OCCASIONS. *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/07/2010",
        "dateOfIncident": "08/15/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10369567,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE CRANKS EASILY BUT ACTS AS THOUGH THERE IS NO FUEL OR SPARK. GAUGES IN THE DASH START TO JUMP AND TICK. GENERALLY CAR STARTS AND RUNS FINE AFTER A FEW ATTEMPTS AT STARTING. DEALERSHIP SAID THAT ALTERNATOR WAS BAD AND  REPLACED ALTERNATOR AT FORD DEALERSHIP AND IT DID NOT FIX THE PROBLEM. PROBLEM HAS BEEN OCCURRING WEEKLY, ONCE OR TWICE A WEEK.  *TR",
        "vin": "1FAFP53U67A"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/02/2010",
        "dateOfIncident": "07/16/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10346934,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE AN 07 FORD TAURUS THAT WE PURCHASED IN 09.  LAST MONTH THE ENGINE STARTED CUTTING OFF WHILE SLOWING DOWN TO A STOP. THE RADIO AND A/C WOULD CUT OUT AND AFTER A FEW SECONDS WOULD COME BACK ON.  AFTER PUTTING THE CAR IN PARK OR NEUTRAL, IT RESTARTS.  THIS PROBLEM ALSO OCCURRED WHILE I WAS MAKING A LEFT HAND TURN INTO THE AUTO SHOP TO HAVE IT LOOKED AT.  IMAGINE THE FEAR I HAD WHEN MY CAR SHUTS OFF, POWER STEERING IS OUT WHILE A DUMP TRUCK IS HEADED TOWARD ME.  LUCKILY I MADE IT OFF THE ROAD IN TIME.  THE AUTO SHOP KEPT THE CAR ALL DAY AND FOUND A MISFIRE CODE BUT NOTHING ELSE.  THEY COULD NOT TELL WHERE THE MISFIRE WAS HAPPENING AND CLEARED THE CODE.  THE PROBLEM NEVER HAPPENED FOR THEM.  MY HUSBAND PERFORMED A TUNE UP ON THE CAR.  IT SEEMED FINE UNTIL 3 DAYS AGO WHEN MY HUSBAND GOT OFF A FREEWAY EXIT AND WAS TAKING THE RAMP THAT VEERED OFF TO THE LEFT.  THE CAR SHUT DOWN ON HIM AND HE HAD A VERY NARROW PLACE TO STOP TO RESTART IT.  IT DIED ON US TWO TIMES TODAY AS WE WERE SLOWING DOWN ON THE FREEWAY.  THE A/C WAS ON DURING THIS TIME. NO INSTRUMENT LIGHTS COME ON WHEN THIS HAPPENS. WE WILL TAKE IT BACK TO THE SHOP TO SEE IF THEY CAN FIGURE IT OUT. FROM WHAT I'VE READ ONLINE, THIS SEEMS TO HAPPEN WITH THIS CAR.  PLEASE HELP FIGURE THIS OUT.  THIS CAN BE A VERY DANGEROUS SITUATION TO BE IN.  THANK YOU. *TR",
        "vin": "1FAFP56U47A"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "06/08/2010",
        "dateOfIncident": "06/03/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10335213,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "FAILURE OF THE HEATER / AC / DEFROSTER BLOWER MOTOR DUE TO WATER LEAKAGE THROUGH THE FIREWALL COWLING. THIS PROBLEM HAS BEEN KNOWN TO FORD SINCE AT LEAST 2003, YET THEY HAVE NOT IMPLEMENTED THEIR OWN TSB 04-15-3 ON THE PRODUCTION LINE AS RECENTLY AS 2007. FORD REFUSES TO ISSUE A RECALL CLAIMING THAT THERE IS NO SAFETY ISSUE INVOLVED EVEN THOUGH FAILURE OF THE BLOWER COULD CAUSE REDUCED VISIBILITY IN INCLEMENT WEATHER DUE TO FAILURE OF THE DEFROSTER OR DEFOGGER. THERE IS ALSO A STRONG POSSIBILITY OF FIRE SHOULD THE BLOWER SHORT OR SEIZE DUE TO WATER AND RUST BUILD-UP IN THE BLOWER MOTOR. *TR",
        "vin": "1FAFP53U77A"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/09/2010",
        "dateOfIncident": "05/07/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10329435,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENTIRE FRONT END OF THE MUFFLER SYSTEM FELL TO THE GROUND ON MY 2007 FORD TAURUS, SHORTLY AFTER PULLING OUT THE DRIVEWAY.  IF THIS WOULD HAVE HAPPENED ON THE HIGHWAY IT MIGHT HAVE BEEN REAL BAD AND INVOLVED OTHER PEOPLE ON THE ROAD.  THANK GOD IT WAS ON A SIDE STREET.  IF IT WOULD HAVE ENT IN A POT HOLE AT A DECENT SPEED, I AM SURE IT WOULD HAVE BEEN UGLY. *TR",
        "vin": "1FAFP56UX7A"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "04/29/2010",
        "dateOfIncident": "05/15/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10328041,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 FORD TAURUS. THE CONTACT STATED WHENEVER IT WOULD RAIN, SHE WOULD NOTICE A PUDDLE OF WATER ON THE PASSENGERS SEAT. THE VEHICLE WAS TAKEN TO A LOCAL MECHANIC WHERE THE CONTACT WAS INFORMED THAT THE HEATER BLOWER MOTOR WAS LEAKING. THERE WERE NO PRIOR WARNINGS. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 75,000 AND THE CURRENT MILEAGE WAS 117,000.",
        "vin": "1FAHP53U67A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/14/2010",
        "dateOfIncident": "04/13/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10325671,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 FORD TAURUS. WHILE DRIVING AT SPEEDS OF 40 MPH, THERE WAS AN UNUSUALLY LARGE INCREASE IN ENGINE RPMS. THE VEHICLE THEN ABNORMALLY ACCELERATED WITHOUT DRIVER INTENT. THE CONTACT WAS ABLE TO SHUT OFF THE ENGINE MID-ACCELERATION AND COASTED TO A STOP. THE DEALER ADVISED THERE WERE NO RECALLS ON THE VEHICLE. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC WHERE THEY ADVISED REPLACING THE VEHICLE SPEED CONTROL SENSOR AND CABLES. THE FAILURE AND CURRENT MILEAGES WERE 107,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/23/2010",
        "dateOfIncident": "03/10/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10321578,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 FORD TAURUS. WHILE DRIVING AT SPEEDS OF 35 MPH, THE FLEX EXHAUST PIPE FELL ONTO THE GROUND. UPON FURTHER INSPECTION, THE CONTACT NOTICED THAT THE PIPE WAS  RUSTED. THE CONTACT STATED THAT THE FLEX PIPE WAS LOCATED IN THE FRONT OF THE VEHICLE NEAR THE ENGINE. THE CONTACT MADE REPAIRS TO THE VEHICLE BY ADDING WIRE TO THE PIPE AND PROCEEDED TO A NEARBY REPAIR SHOP FOR A REPLACEMENT. THE MANUFACTURER HAS BEEN CONTACTED.  THE FAILURE MILEAGE WAS 28,000 AND THE CURRENT MILEAGE WAS UNKNOWN.    UPDATED 05/10/10 *BF  THE CONSUMER STATED THE FLEX PIPE WAS POORLY DESIGNED. UPDATED 06/15/10.*JB",
        "vin": "1FAFP53U67A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/15/2010",
        "dateOfIncident": "12/29/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10299867,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 FORD TAURUS. WHILE THE CONTACT WAS ATTEMPTING TO DRIVE APPROXIMATELY 20 MPH, SHE NOTICED THAT THE GEAR SHIFT BECAME DIFFICULT TO MOVE IN DRIVE OR REVERSE; HOWEVER, SHE WAS ABLE TO SHIFT GEARS FROM FIRST TO SECOND GEAR. THE VEHICLE WAS TAKEN TO THE DEALER WHO STATED THAT THE GEAR SHIFT CABLE NEEDED TO BE REPLACED. THE CURRENT AND FAILURE MILEAGES WERE 31000.",
        "vin": "1FAFP53U87A"
    },
    {
        "components": "SUSPENSION,ENGINE AND ENGINE COOLING,TIRES,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "12/26/2009",
        "dateOfIncident": "01/26/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10296968,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            },
            {
                "manufacturer": "B.F. GOODRICH TIRE CO.",
                "productMake": "B.F.GOODRICH",
                "productModel": "ALL-TERRAIN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            },
            {
                "manufacturer": "AXLE & EQUIP. SALES CO.",
                "productMake": "AXLE EQUIPMENT",
                "productModel": "AXLE EQUIPMENT",
                "productYear": "1975",
                "type": "Equipment"
            }
        ],
        "summary": "BOUGHT A 2007 FORD TAURUS, HAVE HAD NOTHING BUT PROBLEMS.  AL HENDRICKSON TOYOTA WAS THE DEALERSHIP.  TIRES WERE WEARING OUT EVERY 500 MILES, EACH TIME THEY SAID IT WAS THE ALIGNMENT. HAVE HAD MANY CARS IN MY 40 YEARS OF DRIVING.  TOLD THEM THE CAR MUST HAVE BEEN IN AN ACCIDENT AND I WANTED ANOTHER CAR WAS REFUSED..  THEN THE ENGINE BLEW UP HAD WARRANTY, THE ENGINE THAT WAS JUST PUT N IS ALSO NO GOOD  I THINK THEIR FRAUDULENT SELLING PRACTICES SHOULD BE STOPPED.  I AM AN ELDERLY FEMALE,DISABLED AND CANNOT GET TO DRS ECT WITHOUT A CAR. *TR",
        "vin": "1FAFP53U37A"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/27/2009",
        "dateOfIncident": "10/03/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10293682,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 FORD TAURUS.  WHILE DRIVING 25 MPH THE FLANGE FOR THE CATALYTIC CONVERTER FRACTURED OFF.  HE MADE AN INTERIM REPAIR TO RESUME NORMAL VEHICLE OPERATION.  THE VEHICLE WAS TAKEN TO THE DEALER AND A REPAIR KIT INSTALLED AT AN EXPENSE OF $200.00. THE MANUFACTURER DESIGNED A REPAIR KIT BECAUSE THE FLANGE FOR THE CATALYTIC CONVERTER WAS WELDED IMPROPERLY. WHEN THE EXHAUST MANIFOLD FAILS AS IN THIS CONDITION, THE RISK FOR FIRE HAZARD WAS  INCREASED. THE FAILURE AND CURRENT MILEAGES WERE 51,000.  UPDATED 03/04/10 *BF    THE CONSUMER STATED THE FLANGE SEPARATED FROM THE CATALYTIC CONVERTER PIPE WHICH ALLOWED IT TO DROP TO THE GROUND.  UPDATED 06/18/10.*JB",
        "vin": "1FAFP53U07A"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/07/2009",
        "dateOfIncident": "03/10/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10279659,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "2007 FORD TAURUS       10/25/2006: WITH 23,774 MILES I  TOOK THE CAR TO WEBSTER FORD FOR A KNOCKING NOISE I HEARD  COMING FROM THE ALTERNATOR. THEY FOUND PARTS WERE MISSING IN THE MOTOR DURING PRODUCTION WHICH RESULTED IN REPLACEMENT OF THE MOTOR.(INVOICE #32124)      04/18/2007: AT 30,308 MILES I RETURNED TO DEALER FOR NOISE COMING FROM AROUND THE ALTERNATOR. THEY REPLACED THE TENSION CONTROL ARM (WHICH THEY DAMAGED DURING THE MOTOR REPLACEMENT IN APRIL 2006) AND ALSO A NEW SERPENTINE V-BELT (INVOICE #38704)   THERE SERVICE BILLS STATE ALL PARTS AND LABOR WARRANTY ARE 12 MONTHS OR 12,000 MILES WHICH EVER COMES FIRST; GOOD FROM THE ORIGINAL DATE OF SERVICE.       2/24/09: AT 39,448 MILES I EXPERIENCED AN ELECTRICAL FAILURE WHILE DRIVING, THE BATTERY LIGHT INDICATOR CAME ON.        2/25/09: MIDAS CHECKED ENGINE FOUND BATTERY FAILURE NO OTHER SYMPTOMS.  REPLACED BATTERY $118.79.        3/9/09: AT 39,455 MILES THE INDICATOR LIGHT \"CHECK CHARGING SYSTEM\" COMES ON.  MIDAS REPLACED THE ORIGINAL 2006 ALTERNATOR.  A 2007 ALTERNATOR WAS ORDERED BUT WOULD NOT FIT/WORK BECAUSE IT WAS TOO LARGE.         AFTER REPLACEMENT OF ALTERNATOR THE  INDICATOR LIGHT\" CHECK CHARGING SYSTEM\" CAME BACK ON, $382.32.       3/10/09: AT MILEAGE 39,348 TOOK CAR BACK TO WEBSTER FORD FOUND TO FIND THE ALTERNATOR GROUND WIRE, IN AN ENCLOSED WIRING HARNESS ASSEMBLY,  THAT HAD 3 SEPARATE SHORTS. ALL 3 WERE SPLIT OPEN (I HAVE TWO OF THE PIECES).  THE WIRE WAS TWISTED TOO TIGHT WHICH CAUSED THE SPLITS, INVOICE #50848 $242.46      THE SHORTS HAPPENED EITHER DURING PRODUCTION IN 2006 OR DURING THE SERVICE AT WEBSTER FORD IN APRIL, 2008. TOTAL COST $743.57. *TR",
        "vin": "1FAHP56U07A"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/17/2009",
        "dateOfIncident": "06/13/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10277077,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WELDMENT HOLDING THE EXHAUST MANIFOLD GAVE OUT, CAUSING THE CATALYTIC CONVERTER, AND BACK TO DRAG ON THE GROUND.  TOOK IT VIA FLATBED AND DEALERSHIP RE-WELDED IT BACK ON. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/05/2009",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10273391,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "2007 FORD TAURUS SEL EXHAUST SYSTEM CAME LOOSE FROM WHERE ITS FASTENED TO THE MANIFOLD OF THE ENGINE.  *NJ  THE CONSUMER STATED THE PIPE IN THE FLANGE THAT FASTENED TO THE MANIFOLD WAS NOT FLARED PROPERLY AT THE FACTORY. THERE WAS NO HANGER AT THE FRONT AS THE CATALYTIC CONVERTER WAS ACTUALLY MADE ON THE PIPE THAT FASTENED TO THE FLANGE. APPARENTLY, THE SUPPORT HANGER WAS QUITE A DISTANCE BACK AS THE PIPE  COULD POSSIBLY DROP DOWN IF IT WERE TO COME LOOSE AT THE FRONT. THE CONSUMER DISCOVERED HE COULD EASILY SLIP THE PIPE BACK INTO THE FLANGE. IT WAS AS IF THE PIPE HAD NEVER BEEN FLARED. THE CONSUMER TOOK THE VEHICLE TO A MUFFLER SHOP TO HAVE THE PIPE WELDED, BUT THE PART WAS NOT DESIGNED FOR A WELD NOR WAS THERE ROOM TO DO SO. THE REPAIRMAN WAS ONLY ABLE TO TACK WELD IT. THE CONSUMER WENT TO ANOTHER SHOP AND WAS INFORMED FORD WAS AWARE OF THE PROBLEM AND THERE WAS A REPAIR KIT AVAILABLE.*JB",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/03/2009",
        "dateOfIncident": "06/15/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10272739,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MT VEHICLE WITH 20,000 MILES, THE EXHAUST FELL OFF AT THE FLANGE BEHIND THE MANIFOLD WHILE DRIVING. I'VE READ OF MANY INSTANCES OF THIS HAPPENING. THE DEALERSHIP REPLACED THE FLANGE AND CATALYTIC CONVERTER BECAUSE IT WAS UNDER WARRANTY. THIS MODEL SHOULD DEFINITELY BE RECALLED FOR THIS DEFECT. *TR",
        "vin": ""
    },
    {
        "components": "STEERING,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "05/20/2009",
        "dateOfIncident": "04/26/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10269488,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            },
            {
                "manufacturer": "WINTER INTERNATIONAL",
                "productMake": "WINTER INTERNATIONAL",
                "productModel": "ANTI-THEFT DEVISE",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "LISA WRIGHT                                                                                           MAY 18, 2009       DEAR ATTORNEY GENERAL TOM CORBETT       ON DECEMBER 26, 2007 I LISA WRIGHT PURCHASED A 2007 FORD TAURUS FROM DAY FORD 3696 WILLIAM PENN HWY, MONROEVILLE, PA 15146 .       I CALLED DAY FORD ON APRIL 27, 2009 PHONE NUMBER 412.858.0600 I SPOKE TO JOHN. I INFORMED JOHN THAT I WAS NO LONGER ABLE TO STEER MY CAR AND I ASKED HIM IF I CAN BRING IT IN. I WAS INFORMED THAT I CAN HAVE IT TOWED TO DAY FORD. ON APRIL 28, 2009 JOHN CALLED ME BACK AND INFORMED ME THAT THE PROBLEM WAS THE POWER STEERING PUMP AND THE HIGH PRESSURE LINE THAT  NEEDED TO BE REPLACED. JOHN STATED THAT THEY DID HAVE THE POWER STEER PUMP BUT NOT THE HIGH PRESSURE LINE AND THAT IT WILL HAVE TO BE ORDER AND HE WAS NOT SURE WHEN IT WOULD BE IN. JOHN ALSO INFORMED ME THAT BECAUSE THIS IS A COVERED WARRANTY ITEM AND SERVICES A RENTAL CAR WOULD BE COVERED. A FEW DAYS LATER I WAS CONTACT AGAIN BY JOHN AT DAY FORD INFORMING ME THAT THE PART MAY TAKE A WHILE AND THAT THEY WILL NOT COVER MY RENTAL CAR ANY LONGER.       APRIL 29, 2009 TO CURRENT I HAVE BEEN IN CONTACT WITH FORD MOTOR COMPANY CUSTOMER RELATIONSHIP CENTER PHONE NUMBER 1.800.392.3673. ON APRIL 29, 2009 I SPOKE TO CRAIG A CUSTOMER CARE REPRESENTATIVE, I EXPLAINED TO HIM OF THE INFORMATION THAT WAS GIVEN TO ME BY JOHN OF DAY FORD. HE INFORMED ME THAT SOMEONE FROM THE CUSTOMER CARE SOLUTIONS TEAM WOULD BE IN CONTACT WITH ME IN TWO BUSINESS DAYS.       ON APRIL 30, 2009 I SPOKE TO MONICA HOWARD EXT. 7308 OF THE CUSTOMER CARE SOLUTIONS TEAM AND I INFORMED HER OF THE INFORMATION THAT I RECEIVED FROM JOHN AT DAY FORD. I EXPLAINED TO MONICA THAT THE DELAY IS ON THE END OF FORD AND I SHOULD NOT NOR CAN I PAY FOR MY RENTAL CAR. SHE INFORMED ME THAT SHE WOULD LOOK INTO THIS AND WILL GIVE ME A CALL BACK ON MAY 1, 2009 BEFORE 4PM MONICA ALSO INFORMED ME. *TR",
        "vin": "1FAFP56U97A"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/19/2009",
        "dateOfIncident": "05/17/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10269416,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "FORTUNATELY THE 2007 FORD TAURUS WAS IN THE PARKING LOT WHEN THE WHOLE EXHAUST FELL OFF THE VEHICLE DUE TO A MELTED FLANG. WAS NOT AWARE THAT WE HAD TO CHECK A TSB FOR THE SAFETY OF OUR VEHICLE. IT IS STILL UNDER WARRANTY SO DO NOT HAVE TO PAY. VERY WORRIED ABOUT OTHER DRIVERS SAFETY. COULD NOT IMAGINE DRIVING 65 MILES PER HOUR AND HAVE YOUR EXHAUST FALL OFF. *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/26/2009",
        "dateOfIncident": "02/20/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10266758,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DIGITAL READOUT ON MY INSTRUMENT PANEL (PROVIDES CAR MILEAGE, AVG MILEAGE, TRIP METER, MILES TO EMPTY AND TIME) WOULD DIME AT FIRST UNTIL IT FINALLY WENT COMPLETELY OUT.  WHEN IT WOULD DIME IF I HIT THE DASHBOARD, IT WOULD RETURN TO FULL BRIGHT FOR A WHILE. IT WOULD FINALLY GO OUT COMPLETELY AND I COULD HIT THE DASHBOARD TO GET IT TO COME BACK ON. FINALLY, IT WENT OUT AND WOULD NOT COME BACK ON. I WENT TO THE DEALER AND THEY JUST KEPT TELLING ME THAT THE WHOLE INSTRUMENT PANEL WOULD HAVE TO BE REPLACED. AND, ALL I HEARD WAS THEM TELLING ME THAT THEY WANTED MONEY, MONEY AND MORE MONEY. I TOOK THE INSTRUMENT PANEL APART MYSELF AND DISCOVERED THAT A PIECE HAD COME LOOSE. I RESOLDERED THE PIECE TO THE CIRCUIT BOARD AND CUT AWAY A PIECE OF THE CASING THAT WAS RUBBING AGAINST THE PART THAT CAME LOOSE. I HAVEN'T HAD ANY OTHER PROBLEMS SINCE THIS INCIDENT. *TR",
        "vin": "1FAFP53U77A"
    },
    {
        "components": "TIRES,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "04/01/2009",
        "dateOfIncident": "03/27/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10263884,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            },
            {
                "manufacturer": "TECH INTERNATIONAL",
                "productMake": "TECH INTERNATIONAL",
                "productModel": "TR414",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 FORD TAURUS.  THE VEHICLE HAS TECH INTERNATIONAL VALVE STEMS, MODEL TR414.  THE CONTACT NOTICED THAT THE TIRES ON HIS VEHICLE WOULD FLATTEN QUITE OFTEN.  HE TOOK THE VEHICLE TO THE TIRE SHOP AND WAS INFORMED THAT THE FLAT TIRES WERE DUE TO DEFECTIVE VALVE STEMS.  THE VALVE STEMS HAVE NOT BEEN REPLACED.  THE SERIAL NUMBER WAS UNKNOWN.  THE CURRENT AND FAILURE MILEAGES WERE 28,000.",
        "vin": "1FAHP34NX7W"
    },
    {
        "components": "FUEL SYSTEM, OTHER,POWER TRAIN,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/16/2009",
        "dateOfIncident": "02/16/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10258817,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "UPDATED NOTICE FROM PREVIOUS COMPLAINT. SINCE 12/26/08 TO 12/16/08 2007 FORD TAURUS HAS BEEN RETURNED TO THE FORD DEALERSHIP FOR ENGINE FAILURES 5 TIMES. EACH TIME DEALERSHIP IS UNABLE TO LOCATE THE PROBLEM AND FIX THE ENGINE. *TR",
        "vin": "1FAFP53U17A"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/23/2009",
        "dateOfIncident": "01/21/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10256130,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "IN MAY 2008, MY HUSBAND AND I PURCHASED A 2007 FORD TAURUS SES USED WITH 33K MILES FROM THE FORD DEALER. BY DEC 2008, THE CAR WITH 40K MILES WOULD MYSTERIOUSLY CUT OFF IN THE MIDDLE OF DRIVING. WE TOOK THE CAR TO THE DEALER AND WAS TOLD NOTHING WAS WRONG WITH THE CAR. THE DEALER STATED THEY RE-TOOLED THE KEYS AND RETURNED THE CAR TO US. LAST WEEK, THE CAR AGAIN CUT OFF IN TRAFFIC. I CHECKED THE INTERNET AND SEE THAT THIS OCCURRENCE IS NOT UNCOMMON WITH FORD CARS. I BRING THIS TO YOUR ATTENTION AS THIS IS EXTREMELY DANGEROUS TO HAVE A VEHICLE ON THE ROAD THAT NO ONE KNOWS WHAT'S GOING ON. THE CAR IS NOW BACK AT THE DEALER TO FIX THE \"RELAY\" SYSTEM. I NEITHER DESIRE SPENDING GOOD MONEY AFTER BAD, NOR DO I WANT TO BE IN A \"DEATH TRAP\" CAUSING A HORRIFIC ACCIDENT. IF FORD DOESN'T KNOW WHAT IS GOING ON WITH THESE CARS, THEY NEED TO RECALL THEM ALL AND GET THEM OFF THE ROADS. *TR",
        "vin": "1FAFP53U17A"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/19/2008",
        "dateOfIncident": "09/18/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10242977,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I PARKED MY CAR AT WORK IN THE MORNING. GOT IN IT AT LUNCH AND REALIZED THAT THE EXHAUST HAD FALLEN OFF AT THE MANIFOLD. THE MECHANIC SAID THAT IT WAS A BAD WELD JOB FROM THE MANUFACTURER. THIS IS THE FIRST OCCURRENCE AND HOPEFULLY THE LAST.  *TR",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "07/17/2008",
        "dateOfIncident": "05/25/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10234724,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 FORD TAURUS.  WHILE DRIVING 45 MPH, THE CONTACT RAN A STOP SIGN.  HE STATED THAT HE DID NOT SEE THE SIGN AND RECEIVED A TICKET FROM THE POLICE.  THE CONTACT STATED THAT THE STOP SIGN IS APPROXIMATELY SEVEN FEET HIGH AND HIS HEADLIGHTS DO NOT ILLUMINATE THAT HIGH.  WHEN THE POLICE STOPPED HIM HE REALIZED THAT THERE WAS A STOP SIGN.  HE BELIEVES THIS IS A SAFETY HAZARD BECAUSE A CRASH COULD OCCUR FROM NOT BEING ABLE TO SEE THE SIGN.  THE VIN WAS UNKNOWN.  THERE HAD BEEN NO FAILURE TO DATE.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/17/2008",
        "dateOfIncident": "06/12/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10231315,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "AC COMPRESSOR FAILS, BLOWS ECM FUSE, CAR SHUTS OFF WHILE DRIVING.  THIS IS CHRONIC TO THE 2007 FORD TAURUS - WE OWN RENTAL FLEET - HAS HAPPENED ON AT LEAST 3 OTHER VEHICLES - SAME YEAR, MAKE AND MODEL.  *TR",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "05/14/2008",
        "dateOfIncident": "04/01/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10227703,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 FORD TAURUS.  AFTER 4,000 MILES, THE FRONT TIRES WERE WORN.  THE DEALER REPLACED THE TIRES FOR FREE.  AT APPROXIMATELY 12,000 MILES, THE REAR TIRES BEGAN TO WEAR OUT.  THE DEALER NO LONGER COVERED THE TIRES AND THE CONTACT HAD THEM REPLACED AT WAL MART.  AT 60,000 MILES, ALL FOUR TIRES NEEDED TO BE REPLACED AGAIN.  HE BELIEVES THAT THE TIRES ARE NOT THE ISSUE, BUT RATHER THE FAILURE LIES WITHIN THE VEHICLE ITSELF.  HE TOOK THE VEHICLE TO THE DEALER AND WAS INFORMED THAT NOTHING WAS WRONG.  HE BELIEVES THAT HIS VEHICLE IS A LEMON.  THE FAILURE MILEAGE WAS 4,000 AND CURRENT MILEAGE WAS 64,000.",
        "vin": "1FAFP34N47W"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/07/2008",
        "dateOfIncident": "04/21/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10226940,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 FORD TAURUS.  THE CONTACT STATED THAT HER VEHICLE STALLS, JERKS, AND SHIFTS HARD INTERMITTENTLY WHILE DRIVING BETWEEN 30-40 MPH.  SHE TOOK THE VEHICLE TO THE DEALER THREE TIMES (APRIL 21, 2008, MAY 3, 2008, AND MAY 7,2008) FOR THE SAME FAILURE, BUT THEY COULD NOT DETERMINE THE CAUSE.  THE FAILURE ALSO OCCURRED ONCE WHEN THE DEALER HAD IT IN THE SERVICE CENTER FOR INSPECTION.  THE FAILURE MILEAGE WAS 30,300 AND CURRENT MILEAGE WAS 30,500.  UPDATED 06/03/08.  *LJ  THE VEHICLE WOULD ALSO STALL WHEN TRYING TO TAKE OFF FROM A STOP. UPDATED. 05/30/08",
        "vin": "1FAFP53U87A"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/01/2008",
        "dateOfIncident": "12/10/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10223052,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 FORD TAURUS.  THE VEHICLE FAILED TO START OCCASIONALLY.  THE FAILURE HAS OCCURRED ELEVEN TIMES.  THE VEHICLE WAS TAKEN TO THE DEALER ON DECEMBER 10, 2007, BUT THEY COULD NOT DUPLICATE THE FAILURE.  ON JANUARY 21, 2008, THE DEALER REPLACED THE STARTER, BUT THE FAILURE RECURRED.  THE VEHICLE WAS RETURNED TO THE DEALER ON MARCH 5, 2008, BUT THEY COULD NOT DUPLICATE THE FAILURE.  THE FAILURE OCCURRED SEVEN ADDITIONAL TIMES SINCE THE LAST VISIT TO THE DEALER.  THE CONTACT HAS EMAIL CORRESPONDENCE AVAILABLE BETWEEN HIM AND THE DEALER.  THE CURRENT MILEAGE WAS 37,000 AND FAILURE MILEAGE WAS 34,000.   UPDATED 4/21/08 *CN",
        "vin": "1FAFP53U47A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/12/2008",
        "dateOfIncident": "10/25/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10220923,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG LIGHT PROBLEMS.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/10/2008",
        "dateOfIncident": "03/09/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10220695,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "PULLING OUT FROM PARKING LOT WHEN EXHAUST WENT LOUD. FOUND OUT EXHAUST BY MANIFOLD PIPE DETACHED  ALLOWING EXHAUST PIPE TO HANG DOWN IN FRONT CAUSING THE PIPE SCRAPE ALONG ROAD. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/06/2008",
        "dateOfIncident": "12/04/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10213971,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY CAR ON THE EXPRESSWAY THE LOW OIL PRESSURE LIGHT CAME ON. I PULLED OFF THE EXPRESSWAY TO GO TO THE GAS STATION AND BEFORE I COULD MAKE IT THE CAR CUT OFF. AS I ATTEMPTED TO TURN IT BACK ON THE ENGINE BEGAN TO MAKE NOISES. I HAD THE AR TOWED TO THE DEALERSHIP  AND WAS FIRST TOLD THAT II HIT SOMETHING AND THAT MADE THE OIL FILTER COME OUT AND THIS IS NOT COVERED BY THE WARRANTY, BECAUSE THIS IS CONSIDERED A ACCIDENT. AFTER FURTHER CONVERSATION I INFORMED FORD THAT MY LAST OIL CHANGE WAS MORE THAN TWO MONTHS AGO BY A PRIVATE COMPANY.  *TR",
        "vin": "1FAFP53U37A"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/16/2007",
        "dateOfIncident": "12/16/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10212022,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "PULLING OUT FROM PARKING LOT WHEN EXHAUST WENT LOUD. FOUND OUT BOLTS ON EXHAUST BY MANIFOLD PIPE SNAPPED ALLOWING EXHAUST PIPE TO HANG DOWN IN FRONT CAUSING THE PIPE SCRAPE ALONG ROAD IF HIT POT HOLE OR RAISED AREA OF ROADPIPE COULD HAVE BEEN PUSHED BACK CAUSING UNKNOWN DAMAGE. COULD HAVE BEEN WORSE IF WAS ON FREEWAY OR OPERATING AT HIGHER RATE OF SPEED.  *TR",
        "vin": "1FAFP53U47A"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/24/2007",
        "dateOfIncident": "10/15/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10206775,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 FORD TAURUS.  WHILE DRIVING IN REVERSE AT APPROXIMATELY 2 MPH, THE CONTACT HEARD A LOUD NOISE COMING FROM THE REAR OF THE VEHICLE.  HE STOPPED THE VEHICLE AND NOTICED THAT THE EXHAUST PIPE WAS ON THE GROUND.  HE HAD THE VEHICLE TOWED TO A   LOCAL DEALER AND THEY STATED THAT THE LOWER PART OF THE FLEDGE WELD CAUSED THE CATALYTIC CONVERTER TO DETACH.  THE DEALER REPLACED THE CATALYTIC CONVERTER.  THE CURRENT AND FAILURE MILEAGES WERE 24,872.   UPDATED 12/12/07 *BF  UPDATED",
        "vin": "1FAFP53U47A"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/16/2007",
        "dateOfIncident": "06/26/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10205803,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "PROBLEM STARTED ABOUT 4 MONTHS AFTER PURCHASE. LONG CRANK TIME, IF NOT CRANKED LONGER THAN 2 SECONDS, WILL NOT START RIGHT AWAY. ONLY WHEN VEHICLE`S BEEN SITTING FOR 6 OR MORE HOURS. I'VE TAKEN TO THE GARAGE OVERNIGHT 4 TIMES, BUT THEY KEEP SAYING NOTHINGS WRONG. I DIDN'T HAVE THIS PROBLEM WHEN I FIRST BOUGHT THIS CAR. STARTER, ALTERNATOR, SPARK PLUGS, AND WIRES, AND ALL FUSES STILL GOOD. WILL MY CAR BE OK? WITH WINTER COMING, I DON`T WANT TO BE STRANDED.   *JB",
        "vin": "1FAFP56U27A"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/12/2006",
        "dateOfIncident": "10/01/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10176000,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE IN MY POSSESSION A 2007 FORD TAURUS ISSUED TO ME AS A FLEET VEHICLE FROM MY EMPLOYER. I PICKED UP THE VEHICLE AT THE DEALERSHIP WITH LESS THAN 6 MILES ON IT. OVER THE PAST 4 MONTHS THE VEHICLE HAS STALLED WHILE I WAS DRIVING THE VEHICLE ABOUT 8 TIMES. THE MAJORITY OF TIMES IT WAS IN TAKING A LEFT HAND TURN AND THE VEHICLE WOULD STALL AS I WOULD INITIATE THE TURN. SEVERAL TIMES THE VEHICLE STALLED WHILE DRIVING ABOUT 20 MPH THROUGH A PARKING LOT GOING STRAIGHT. AFTER SEVERAL STALLS, I TURNED THE VEHICLE INTO A FORD DEALERSHIP IN WEST PALM BEACH TO HAVE IT LOOKED AT. THEY DROVE THE VEHICLE OVER 200 MILES AND SAID THEY COULD FIND NOTHING WRONG WITH THE VEHICLE.  THEY CONTACTED MY FLEET COMPANY AND FORD HEAD QUARTERS. NOTHING WAS REGISTERING ON THE COMPUTER AS TO WHY IT WOULD STALL.THE VEHICLE WOULD LITERALLY TURN OFF WHILE MOVING OR TURNING AND YOU WOULD LOOSE ALL POWER STEERING AND HAVE TO GLIDE TO A STOP AND THEN RESTART THE VEHICLE. THE VEHICLE NEVER HAD A PROBLEM RESTARTING. IT HAS HAPPENED AT ALL TIMES OF THE DAY, BUT MOSTLY AFTER A LONG DAY OF DRIVING. I WAS CALLED BY THE DEALERSHIP WHILE THE VEHICLE WAS STILL THERE AND AS TOLD THEY HAD A 2007 TAURUS IN THEIR FLEET THAT WAS DOING THE SAME THING AND THEY WANTED TO KEEP THE CAR LONGER TO SEE IF THEY COULD FIGURE ANYTHING OUT.I WAS THEN INFORMED THAT CAR WAS STALLING FOR OTHER REASONS. MY FLEET COMPANY INFORMED ME TO PICK UP THE CAR. I HAD THE VEHICLE I MY POSSESSION FOR 24 HOURS AND WHILE TAKING A LEFT HAND TURN THE VEHICLE STALLED IN THE MIDDLE OF AN INTERSECTION. I ROLLED TO THE CURB AND HAD TO RESTART THE VEHICLE. THIS WAS VERY DANGEROUS AS MY 2 SMALL CHILDREN WHERE IN THE CAR AND I HAD VEHICLES IN FRONT OF ME AND BEHIND ME.  I PHONED THE DEALERSHIP RIGHT AWAY AND TOLD THEM IT HAPPENED AGAIN. I WAS TOLD I COULD BRING IT IN. I WAS INFORMED BY MY COMPANY TO KEEP THE CAR. I HAVE BEEN DRIVING THE VEHICLE SINCE THAT DAY AND IT HAS NOT HAPPENED AGAIN. IT HAS BEEN OVER A MONTH SINCE THE LAS TIME IT OCCURRED.*NM",
        "vin": "1FAHP53U87A"
    }
]