[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/03/2019",
        "dateOfIncident": "03/18/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217521,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 3500",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 GMC SIERRA 3500. WHILE DRIVING APPROXIMATELY 20-30 MPH, THE BRAKE PEDAL WAS DEPRESSED, BUT FAILED TO SLOW DOWN OR STOP THE VEHICLE. THE CONTACT WAS ABLE TO PULL INTO A FUEL STATION AND ENGAGED THE PARKING BRAKE TO STOP THE VEHICLE. THE CONTACT INSPECTED THE VEHICLE AND NOTICED BRAKE FLUID POURING FROM THE BRAKE LINES UNDERNEATH THE VEHICLE. THE CONTACT STATED THAT THE BRAKE LINES WERE COMPLETELY RUSTED THROUGH. THE VEHICLE WAS TAKEN TO CASEY'S FRONTIER CHEVROLET (LOCATED AT 2350 COOKEVILLE HWY, LIVINGSTON, TN 38570, (931) 563-9076) AND REPAIRED. HOWEVER, WHEN THE BRAKE PEDAL WAS DEPRESSED, THE VEHICLE WOULD STOP AS INTENDED, BUT THE BRAKE PEDAL WOULD TRAVEL TO THE FLOORBOARD. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 106,000.",
        "vin": "1GTJK33D17F"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/08/2018",
        "dateOfIncident": "02/07/2018",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11071752,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 3500",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 GMC SIERRA 3500. THE CONTACT NOTICED BLACK SMOKE IN HIS HOME. HE THEN NOTICED THAT THE VEHICLE WAS ENGULFED IN FLAMES. THE FIRE DEPARTMENT WAS NOT CONTACTED BECAUSE THE CONTACT WAS ABLE TO CONTAIN THE FIRE. A POLICE REPORT WAS NOT FILED. THE VEHICLE WAS NOT TOWED AND REMAINED AT THE CONTACT'S RESIDENCE. THE DEALER AND MANUFACTURER WERE NOT CONTACTED. THE CONTACT SUFFERED MINOR BURNS, WHICH DID NOT REQUIRE MEDICAL ATTENTION. THE FAILURE MILEAGE WAS APPROXIMATELY 260,000.",
        "vin": "1GTJK33647F"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/12/2017",
        "dateOfIncident": "02/12/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10972056,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 3500",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "DASH CRACKS AROUND PASSENGER AIR BAG AND OVER DRIVER DISPLAY.  SHOULD AIR BAGS DEPLOY, BROKEN DASH PIECES CUT, THUS COMPROMISE AIR BAG EFFECTIVENESS.  ALSO BROKEN DASH SHARDS MAY BE PROJECTED IN THE EVENT OF DEPLOYMENT CREATING HIGH VELOCITY, DANGEROUS SHRAPNEL.  VEHICLE WAS PARKED IN GARAGE.  2011.  STILL OWN THE VEHICLE.",
        "vin": "1GTHK33667F"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/01/2017",
        "dateOfIncident": "06/30/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10948815,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 3500",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2007 GMC SIERRA 3500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V324000 (AIR BAGS) HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "1GTJK33607F"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/21/2016",
        "dateOfIncident": "10/21/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10917900,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 3500",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "IT IS TOTALLY UNACCEPTABLE FOR IT TO TAKE OVER A YEAR FOR A DEALER TO RECEIVE THE PARTS TO COMPLETE A SAFETY RECALL. WHEN I CONTACTED GM THEY TOLD ME THEY RECOMMENDED I HAVE NO ONE SITTING IN THE PASSENGER SEAT, WHICH WAS THEIR ONLY SOLUTION AT THIS TIME. MEANWHILE I SUFFERED FROM THE LOSS OF USE OF MY VEHICLE.",
        "vin": "1GTHK34K87E"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/15/2016",
        "dateOfIncident": "07/01/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10885139,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 3500",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2007 GMC SIERRA 3500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V324000 (AIR BAGS) AND STATED THAT THE PART NEEDED FOR THE REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "1GTHK23637F"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/06/2016",
        "dateOfIncident": "07/06/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10883064,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 3500",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2007 GMC SEIRRA 3500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V324000 (AIR BAGS). THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS AWARE OF THE ISSUE. THE VIN WAS INVALID. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "1GTJK33697F"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/13/2016",
        "dateOfIncident": "07/01/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10855237,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 3500",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2007 GMC SIERRA 3500. THE CONTACT RECEIVED A RECALL NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V324000 (AIR BAGS). THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/17/2015",
        "dateOfIncident": "07/07/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10794314,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 3500",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 GMC SIERRA 3500. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V438000 (ENGINE AND ENGINE COOLING); HOWEVER, THE PART TO DO THE REPAIRS WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "1GDJK34K37E"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/09/2014",
        "dateOfIncident": "01/20/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10663110,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 3500",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE IS EQUIPPED WITH FACTORY INTEGRATED TRAILER BRAKE CONTROL (ITBC). BACK IN JAN., 2011 I GOT A MESSAGE IN THE DRIVER INFORMATION CENTER (DIC): IT SAID \"SERVICE  TRAILER BRAKE SYSTEM\". MESSAGE INTERMITTENT AT FIRST, AND THEN MORE FREQUENTLY , AND THEN MESSAGE APPEARED AT START-UP EVERY TIME. DEALER FIXED PROBLEM. IN APRIL OF 2013 THE SAME PROBLEM HAS RETURNED IN EXACTLY THE SAME PATTERN AS THE PREVIOUS FAULT. THIS A FAULTY SYSTEM AT BEST, AND HAS SERIOUS DESIGN FLAWS. THE SERIOUS SAFETY ISSUE HERE IS: WHEN THE \"SERVICE TRAILER BRAKE SYSTEM\" MESSAGE APPEARS ON THE DIC; ALL TRAILER BRAKING IS LOST. THERE IS NO DEFAULT OR BACK-UP SYSTEM IN WHICH TO APPLY TRAILER BRAKES. EVEN THE MANUAL TRAILER BRAKE CONTROL BUILT INTO THE ITBC IS ALSO RENDERED INOPERABLE. THIS ITBC FAILURE COULD HAPPEN AT ANY TIME, AND AT ANY SPEED. THIS VEHICLE IS RATED TO TOW A TRAILER OF 10,000LBS. PLUS. MANY PEOPLES LIVES COULD BE PUT IN JEOPARDY IF SUDDENLY ALL TRAILER BRAKING WERE LOST ON A STEEP DOWNGRADE. THIS ITBC SYSTEM NEEDS TO BE RE-DESIGNED SO THAT A VEHICLE OPERATOR CAN OPERATE THE TRAILER BRAKES MANUALLY IF AUTOMATIC TRAILER BRAKE CONTROL IS LOST WHEN THE OPERATOR GETS A \"SERVICE TRAILER  BRAKE SYSTEM\" ON THE DIC.  *TR",
        "vin": "1GTJK396X7E"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/16/2011",
        "dateOfIncident": "12/07/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10440229,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 3500",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION COOLER LINE LEAK COULD LEAK OUT ALL FLUID AND CAUSE TRANSMISSION FAILURE.   THE CONSUMER WAS INFORMED THE VEHICLE NEEDED TRANSMISSION COOLER LINES, TRANSMISSION FLUID AND CONDITIONER AT A COST OF $ 822.32.  THE SERVICE MANAGER AGREED TO CUT THE  BILL TO $411.16. THE CONSUMER CONTACTED GM CUSTOMER SERVICE TO MAKE A COMPLAINT. AFTER AN INVESTIGATION, THE CONSUMER WAS INFORMED BY GM THAT THE DEALER STATED THE FAILURE WAS CAUSED BY THE AGE OF THE VEHICLE AND GM WOULD NOT COVER THE COST OF THE PART. THE CONSUMER STATED THE PART WAS MADE OF DEFECTIVE MATERIALS AND SHOULD HAVE BEEN RECALLED. WHEN THE CONSUMER CONTACTED THE DEALER, THEY STATED THEY HAD NOT MADE A DIAGNOSIS OF THE FAILURE AND THE PARTS WERE SENT TO GM TO BE EXAMINED. UPDATED IVOQ 01/04/12 *JB  *TR",
        "vin": "1GTHK33617F"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/17/2010",
        "dateOfIncident": "08/17/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10349934,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 3500",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 GMC SIERRA 3500.  THE CONTACT STATED THAT THE VEHICLE WAS BURNING OIL MORE RAPIDLY THAN NORMAL.  THE MANUFACTURER WAS NOTIFIED AND INFORMED HIM THAT THE VEHICLE COULD BURN ONE FULL QUART OF OIL EVERY 1,000 MILES TRAVELED. THE DEALER RESEALED THE TURBO BUT TO NO AVAIL. IN ADDITION, WHEN DRIVING OVER ROAD BUMPS HE COULD HEAR THE DOORS SHIFTING INSIDE OF THE DOOR FRAME.  THE MANUFACTURER ADVISED THAT THE FAILURE WAS NORMAL. THE DEALER MADE REPAIRS TO THE BODY BOLTS BUT THE FAILURE PERSISTED. THE DEALER ADVISED THAT HE SHOULD OIL THE DOORS TO REDUCE THE AMOUNT OF NOISE.  THE FAILURE MILEAGE WAS 36,000 AND THE CURRENT MILEAGE WAS 58,000.",
        "vin": "1GTHK336X7F"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/29/2010",
        "dateOfIncident": "05/23/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10328035,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 3500",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL * THE CONTACT OWNS 2007 GMC SIERRA 3500. WHILE DRIVING AT SPEEDS  OF 45 MPH THE CONTACT DEPRESSED THE BRAKES AND THE BRAKE PEDAL FELL FURTHER ONTO THE FLOOR BOARD THAN USUAL BEFORE THE VEHICLE WOULD STOP. THE FAILURE INCREASED THE BRAKE STOPPING DISTANCE. THE CONTACT STATED THAT THE FAILURE WOULD OCCUR WHENEVER THE VEHICLE WAS DRIVEN. THE DEALER WAS UNABLE TO DUPLICATE OR DIAGNOSE THE FAILURE EIGHT TIMES. THE DEALER ADVISED THE CONTACT THAT THE VEHICLE WAS SAFE TO DRIVE AND THERE WERE NO FAILURES. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE CURRENT MILEAGE WAS 49,000 AND THE FAILURE MILEAGE WAS 2,000.",
        "vin": "1GTJK33D57F"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/08/2009",
        "dateOfIncident": "10/06/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10286729,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 3500",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 GMC SIERRA 3500. WHILE DRIVING 45 MPH THE BRAKE LIGHT WARNING AND THE ABS LIGHTS ILLUMINATED ON THE INSTRUMENTAL PANEL. THE HEADLIGHTS  BEGAN TO FLICKER; HOWEVER, AFTER SHUTTING THE ENGINE OFF AND CHECKING UNDER THE HOOD THE CONTACT WAS UNABLE TO DIAGNOSE THE FAILURE. WHEN HE RESTARTED THE VEHICLE THE BRAKE LIGHT SHUT OFF AND WITHOUT WARNING, THE TRANSMISSION BEGAN TO SHIFT UP AND DOWN AT WILL. THE DEALER STATED THAT THE COMPUTER DID NOT REGISTER ANY FAILURE CODES. THE DEALER ALSO STATED THAT IF THE FAILURE RECURRED TO ALLOW THEM TO DIAGNOSE THE FAILURE BEFORE SHUTTING THE ENGINE OFF. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 12990 AND THE CURRENT MILEAGE WAS 13050.",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/07/2008",
        "dateOfIncident": "10/03/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10244628,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA 3500",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 GMC SIERRA 3500.  AFTER THE CONTACT'S SPOUSE HAD DRIVEN THE VEHICLE FOR SEVERAL HOURS, IT WOULD NO LONGER MOVE.  THE VEHICLE WAS TOWED TO A DEALER AND THEY STATED THAT THE DRIVER'S SIDE REAR AXLE SEPARATED FROM THE DIFFERENTIAL AND THE SHOCK AND LEAF SPRING WERE THE ONLY PARTS HOLDING IT TOGETHER.  THE CURRENT AND FAILURE MILEAGES WERE 114,000.",
        "vin": "1GTJC33D57F"
    }
]