[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/11/2016",
        "dateOfIncident": "11/10/2010",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10883916,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHRC",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HARLEY-DAVIDSON FLHRC. THE CONTACT STATED THAT WHEN THE REAR BRAKES HAD BEEN APPLIED SEVERAL TIMES THEY FAILED TO ENGAGE AND FUNCTIONED RANDOMLY. THE DEALER WAS NOTIFIED OF THE FAILURE, PROVIDED A COVER FOR THE BRAKE FLUID RESERVOIR BUT DID NOT PROVIDE A DIAGNOSIS TO PREVENT THE FAILURE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND THE CONTACT WAS WAITING FOR A REPAIR SOLUTION TO BE PROVIDED TO A DEALER. THE CONTACT WAS NOT INCLUDED IN NHTSA ACTION NUMBER: PE16009 (SERVICE BRAKES, HYDRAULIC). THE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": "1HD1FR4179Y"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/10/2014",
        "dateOfIncident": "08/07/2014",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10621181,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHRC",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE CHANGING LANES ON THE HIGHWAY I ENCOUNTERED A WOBBLE IN THE STEERING. I CHECKED THE STEERING HEAD BEARING FOR PROPER ADJUSTMENT PER FACTORY SPECS AND FOUND IT TO BE PROPERLY ADJUSTED. I HAVE ALWAYS HAD THE SAME WOBBLE AND NOTED WHEN SPEED IS INCREASED THE WOBBLE APPEARS WITHOUT BEING PROVOKED WITH A LEAN ANGLE. I HAVE BEEN RIDING FOR 46 YEARS AND HAVE BEEN TEACHING MOTORCYCLE SAFETY FOR 13 YEARS. I HAVE NEVER HAD ANYTHING LIKE THIS HAPPEN ON ANY OTHER MOTORCYCLE (INCLUDING PREVIOUS HD SPORTSTER).  THE BEST WAY I FOUND TO RECOVERING FROM THIS WOBBLE IS A EASY ROLL BACK OFF OF THE THROTTLE.   HARLEY SHOULD BE FORCED TO RECALL AND FIX THE PROBLEM.  I BELIEVE IT WOULD NEED A REVISED ENGINE MOUNT OR A ADDED STEERING DAMPENING STABLING SYSTEM.   I PURCHASED MOTORCYCLE NEW AND HAVE NEVER RECEIVED ANY WARNING OF SUCH WOBBLE PROBLEM BEING REPORTED. I HAVE NOT MOVED, AND HAVE HAD MY MOTORCYCLE SERVICED AT THE DEALER WHEN IT WAS 2 WEEKS OLD DUE TO A SHAKE CAUSED BY LOOSE SPOKES OF THE REAR WHEEL, AS WELL AS A NEW REAR TIRE 2 YEARS AGO.  *TR",
        "vin": "1HD1FR4107Y"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/26/2013",
        "dateOfIncident": "05/22/2013",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10513570,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHRC",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "IT START ABOUT A YEAR AGO, MY BIKE THEN HAD 25,000 MILE ON IT. IT WAS GETTING HARD TO START AFTER THE MOTOR WAS WARM. I CHANGE THE SPARK PLUGS, SPARK PLUG CABLES, IGNITION COIL AND BATTERY AND ITS WAS STILL HARD TO START. I TOOK THE BIKE TO THE DEALER WITH ABOUT 30,000 MILES ON IT AND THEY DIAGNOSE THE PROBLEM TO BE THE COMPENSATOR. HOW CAN A BIKE WITH 30,000 MILE ON IT HAVE A MAJOR POWERTRAIN PROBLEM AND COST ME $800.00 TO REPAIR?",
        "vin": "1HD1FR4157Y"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/18/2012",
        "dateOfIncident": "07/05/2012",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10466374,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHRC",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS RIDING MY 2007 HARLEY DAVIDSON ROAD KING CLASSIC AT APPROXIMATELY 60 MPH WITH A PASSENGER WHEN THE BOLTS HOLDING THE REAR SPROCKET TO THE REAR WHEEL STARTED BACKING OUT. THE HEADS OF THE BOLTS STARTED HITTING THE SWING ARM AND SHEARING OFF. AS THIS HAPPENED THE BIKE LURCHED VIOLENTLY AND WAS DIFFICULT TO CONTROL. I WAS ABLE TO SLOW AND PULL TO THE SIDE OF THE ROAD WITHOUT CRASHING. UPON INSPECTION THE BOLTS TORE UP THE REAR WHEEL HUB, THE SPROCKET, AND THE SWING ARM. I WAS LUCKY THAT THE BACK TIRE DIDN'T LOCK UP AND CAUSE ME TO LOSE CONTROL. MY BIKE HAS 24,000 MILES ON IT, I BOUGHT IT NEW, AND HAVE HAD ALL THE SERVICE AND TIRE CHANGES DONE AT THE DEALERSHIP THAT I BOUGHT IT FROM. I HAVE HAD EVERY SERVICE REQUIRED AND IN FACT IT WAS SERVICED ABOUT 100 MILES BEFORE THIS HAPPENED. AS FAR AS I KNOW THE SPROCKET HAS NEVER BEEN REMOVED FROM THE REAR WHEEL, IT DOES NOT NEED TO BE REMOVED TO CHANGE THE TIRE. IF YOU DO AN INTERNET SEARCH USING THE SEARCH CRITERIA \"HD REAR SPROCKET BOLTS BACKING OUT\" YOU WILL FIND THAT THIS IS A SERIOUS AND PERVASIVE PROBLEM THAT HARLEY DAVIDSON ISN'T ACKNOWLEDGING. I CAN SEND YOU PICTURES AND ACTUAL DESTROYED PARTS IF IT WILL HELP. *TR",
        "vin": "1HD1FR43X7Y"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/13/2012",
        "dateOfIncident": "06/06/2012",
        "fire": true,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10461619,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHRC",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2007 HARLEY DAVIDSON ROAD KING. THE CONTACT STATED THE BURNING FUMES  EMITTED FROM THE ENGINE COMPARTMENT. AFTER INSPECTING THE MOTORCYCLE HE NOTICED THAT THREE DIFFERENT WIRE HARNESS MELTED. THE VEHICLE WAS TAKEN TO THE DEALER WHO WAS UNABLE TO DIAGNOSE THE FAILURE. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE VIN WAS NOT AVAILABLE. THE FAILURE AND CURRENT MILEAGE WAS 14,500.",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/25/2010",
        "dateOfIncident": "08/12/2010",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10351821,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHRC",
                "productYear": "2007",
                "type": "Vehicle"
            },
            {
                "manufacturer": "AVON TIRE COMPANY",
                "productMake": "AVON",
                "productModel": "ROADRUNNER M/C TIRE",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "I PURCHASED FRONT AND REAR TIRES FROM AN AVON VENDOR AT STURGIS, ND IN AUG 2010. 200 MILES LATER, ON MY WAY HOME, THE FRONT TIRE BLEW AT 70MPH. AFTER NEARLY CRASHING I MANAGED TO GET THE BIKE TO COME TO A STOP. AFTER RECEIVING A TOW I CALLED DAVID ALARI, THE DEALER WHO SOLD AND INSTALLED THE TIRES. ALL I WANTED WAS MY MONEY BACK FOR THE FRONT TIRE AND REINSTALLATION ($256). HE WOULD ONLY GIVE ME EXCUSES. I WILL VOICE MY DISGUST TO ALL WHO WILL HEAR, ESPECIALLY NEXT YEAR AT DAVID'S STURGIS LOCATION, HOW BADLY I WAS TREATED AND HOW DANGEROUS YOUR PRODUCT IS. *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES, ELECTRIC",
        "crash": true,
        "dateComplaintFiled": "05/19/2010",
        "dateOfIncident": "07/25/2009",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10331155,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHRC",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ELECTRONIC CRUISE CONTROL ON THE 2007 HARLEY DAVIDSON ROAD KING FLHR FAILED TO DISENGAGE AFTER FRONT AND REAR BRAKES WERE APPLIED CAUSING LOSS OF CONTROL OF MOTORCYCLE IN A TURN CAUSING A CRASH AND SEVERE INJURIES TO RIDER. *TR",
        "vin": "1HD1FR4137Y"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/19/2007",
        "dateOfIncident": "04/17/2007",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10212364,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHRC",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A NEW HARLEY-DAVIDSON, AND FROM THE FIRST MILE IT HAS HAD A SEVERE PULL TO THE LEFT.  I HAVE AN INDEPENDENT EVALUATION THAT CONFIRMS MY COMPLAINT.  HARLEY-DAVIDSON REFUSES TO CORRECT THIS WARRANTY ISSUE.  *TR",
        "vin": "1HD1FR41X7Y"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/24/2007",
        "dateOfIncident": "10/20/2007",
        "fire": true,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10206792,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHRC",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "FIRST PROBLEM WAS WITH THE THROTTLE. SOMETHING BROKE CAUSING THE BIKE TO RUN WITH WIDE OPEN THROTTLE AND NO WAY TO SLOW THE ENGINE DOWN WITHOUT TURNING THE SWITCH OFF.  I WAS RIDING THE BIKE ON I-95 RUNNING 70 MPH WHEN THIS HAPPENED. THE NEXT ISSUE WAS WITH AN OXYGEN SENSOR CAUSING THE BIKE TO RUN ROUGH. THE MOST RECENT PROBLEM; SOMETHING IN THE REAR BRAKE SYSTEM BROKE, THROWING BRAKE FLUID OUT ALONG WITH SPARKS AND FLAMES. I HAD NO REAR BRAKE TO STOP WITH, ONLY FRONT BRAKE. THE HEAT CAUSED DAMAGE TO THE RIGHT SADDLEBAG AND CAUSED MY MESH JACKET INSIDE THE SADDLEBAG TO MELT TO THE SADDLEBAG, RUINING THE JACKET. THIS BIKE IS LIFE THREATENING, I FEEL SURE WITH THE HEAT FROM THE FIRE THERE WILL BE UNSEEN DAMAGE TO THE BIKE. I CANNOT SELL THIS BIKE IN GOOD CONSCIENCE WITHOUT REVEALING THIS INFORMATION TO ANY PROSPECTIVE BUYER ESSENTIALLY RUINING MY CHANCE TO SELL THIS BIKE ANYWHERE CLOSE TO MARKET VALUE! HARLEY DAVIDSON HAS CLAIMED IT WAS OPERATOR ERROR NOT MECHANICAL MALFUNCTION. THEY CLAIM I WAS RIDING THE BRAKE. THEY ALSO SAY WITNESSES SAW MY BRAKE LIGHT PROVING MY ERROR. FIRST OF ALL I WAS NOT IN ANY WAY RIDING THE REAR BRAKE PEDAL. THE WAY I RIDE ALONG WITH THE POSITION OF MY HIGHWAY PEGS MAKE IT PRACTICALLY IMPOSSIBLE FOR ME TO TOUCH THE REAR BRAKE ACCIDENTALLY! ALSO THE SO-CALLED WITNESSES HAVEN'T COME FORTH AND THEY ALSO HAVE NOT MENTIONED THE TIME FRAME THEY NOTICED MY BRAKE LIGHT BEING ON; WAS 5 MINUTE,S OR 45 MINUTES? WE WERE ON A GROUP RIDE FOR APPROXIMATELY 45 MINUTES BEFORE THIS HAPPENED SO HOW LONG DID THEY SEE MY LIGHT ON AND WHY DIDN'T SOMEONE LET ME KNOW? THE TWO RIDERS CLOSEST TO ME  IN THE FORMATION TOLD ME THEY SAW SMOKE, SPARKS, AND FLAMES AND MY FOOT WAS NOWHERE NEAR THE REAR BRAKE PEDAL. REGARDLESS OF THE STORY HARLEY IS TRYING TO TELL, THE TRUTH OF THE MATTER IS THAT REAR BRAKE MALFUNCTION WAS IN NO WAY DUE TO OPERATOR ERROR OR NEGLIGENCE ON THE PART OF THE OPERATOR. HARLEY OFFERED A GOODWILL REPAIR EVEN THOUGH THEY CLAIM IT WAS MY FAULT.  *TR",
        "vin": "1HD1FR4117Y"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/12/2007",
        "dateOfIncident": "03/12/2007",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10193087,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHRC",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE 2 - 2007 HARLEY DAVIDSON ROAD KING CUSTOM MOTORCYCLES AND THEY RUN SO HOT YOU CAN HARDLY SIT ON THE BIKE.  THE HEAT ON YOUR LEGS IS EXTREME.  I WOULD LIKE HARLEY TO MAKE MY BIKE RUN COOLER BEFORE I HAVE SERIOUS ENGINE PROBLEMS OR I GET BURNT AND SO I CAN ENJOY RIDING MY BIKE!",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/23/2007",
        "dateOfIncident": "04/16/2007",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10191585,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHRC",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "RANDOM STALLING OF MOTORCYCLE WHILE BEING OPERATED.  THE STALLING HAPPENED NUMEROUS TIMES, APPROXIMATELY 20 TIMES,  AND HAS BEEN ONGOING FOR A 5 WEEK PERIOD WITH NO SUCCESS IN DIAGNOSING OR CORRECTING THE PROBLEM.  THE STALLING OCCURRED AT  LOW SPEED AND AT MODERATE SPEED 55 MPH).  IT OCCURRED A FEW TIMES WHILE IDLING AT A RED LIGHT.  THERE  WAS NO INDICATION WHEN IT WILL HAPPEN, IT WAS  LIKE SOMEONE PULLED THE PLUG.  THE DEALERSHIP  COULD NOT DETERMINE THE CAUSE NOR GET AN ERROR CODE ON THE COMPUTER.  THEY HAVE REPLACED THE 02 SENSOR TWICE, THE ECM MODULE, THE CRANK POSITIONING SENSOR AND THE TEMPERATURE MONITORING SENSOR AT DIFFERENT TIMES WITH THE SAME RESULT. I RETURNED THE MOTORCYCLE STATING THAT THE SAME PROBLEM  WAS OCCURRING.  *AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/16/2007",
        "dateOfIncident": "12/05/2006",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10185266,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHRC",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS COMPLAINT IS ABOUT A SAFTEY ISSUE WITH THE 2007 HARLEY DAVIDSON ROAD KING I PURCHASED IN DEC 2006. THE BIKE HAS A VERY LOUD CLATTER EMITTING FROM THE ENGINE, SOUNDS LIKE THE VALVE TRAIN OR TRANSMISSION. IT APPEARS THAT THIS PROBLEM HAS THE ATTENTION OF MANY 2007  OWNERS WITH LATE 2006  PRODUCTION RELEASE MOTORCYCLES. THE BIKES ALSO RUN VERY HOT AND ARE NOT RIDABLE IN WEATHER OVER 70 DEGREES. IM CONCERNED THAT THERE IS POSSIBLE MECHANICAL FAILURE EMINENT WICH COULD RESULT IN FATAL CONSEQUENCES. HALREY DAVIDSON CUSTOMER SERVICE PROCLAIMS THAT THERE IS NOTHING WRONG AND WILL NOT TAKE RESPONCIBLITY FOR THESE PROBLEMS.  THEY DID ISSUE A TOURQE SMOOTHING RECALIBRATION THAT DID NOTHING FR THE LOUD CLATTER EMITTING FROM THE ENGINE, AND ULTRA HOT TEMPS.  WE NEED YOUR HELP.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/07/2006",
        "dateOfIncident": "11/01/2006",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10175518,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHRC",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THE HARLEY DAVIDSON FLHRC MOTORCYCLES TRANSMISSION MADE A RATTLING SOUND.  THE SERVICE DEALER EXPRESSED THERE WAS NO DEFECT OR FIX AVAILABLE.  THE CONTACT EXPRESSED CONCERN OF A DEFECT.",
        "vin": "1HD1FR4167Y"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/09/2006",
        "dateOfIncident": "11/08/2006",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10173056,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHRC",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED THE HEAT FROM THE ENGINE AND EXHAUST CAUSED BURNS TO THE CONTACT'S INNER THIGHS TWICE.  THE VEHICLE COULD BE DRIVEN IF THE TEMPERATURE OUTSIDE WAS OVER 75 DEGREES.  THE DEALERSHIP AND FACTORY REPRESENTATIVE DETERMINED THE VEHICLE WAS OPERATING UNDER NORMAL CONDITIONS.    UPDATED 12/26/2006 - THE 2007 HD TOURING MODELS HAVE A NEW AND BIGGER ENGINE.  THE EXHAUST PIPES ON THESE MODELS ARE 450-600 DEGREE F AND ARE ONLY 3-4 INCHES FROM THE DRIVER'S LEGS.  THEY CAUSED BURNS, ARE DISTRACTING, AND UNCOMFORTABLE.  *NM",
        "vin": "1HD1FR4127Y"
    }
]