[
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "06/16/2010",
        "dateOfIncident": "04/03/2010",
        "fire": false,
        "manufacturer": "Heartland Recreational Vehicles, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10336615,
        "products": [
            {
                "manufacturer": "Heartland Recreational Vehicles, LLC",
                "productMake": "HEARTLAND",
                "productModel": "CYCLONE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HEARTLAND CYCLONE RV. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN ID NUMBER: 10V077000 (EQUIPMENT: OTHER: LABELS) AND LATER RECEIVED A VEHICLE LABEL STATING THE VEHICLE AXLES COULD ONLY SUSTAIN 5,080 POUNDS EACH AND NOT THE INITIAL NOTED WEIGHT OF 5200 POUNDS EACH. THE CONTACT WAS NOT SATISFIED WITH THE MANUFACTURER PROVIDING ONLY A STICKER FOR THE NEW WEIGH CAPACITY. HE BELIEVED THE TIRES AND RIMS SHOULD HAVE BEEN REPLACED AS WELL. THE CONTACT STATED THE TIRES WERE NOT ABLE TO MAINTAIN THE WEIGHT LOAD. THE FAILURE MILEAGE WAS 3,500.    UPDATED 10/28/10 *BF  THE CONSUMER STATED HEARTLAND PUT THE WRONG TIRES/RIMS ON HIS MAKE AND ,MODEL RV. THE CONSUMER STATED 16 INCH TIRE AND RIMS SHOULD HAVE BEEN INSTALLED ON THE RV. UPDATED 11/01/10*JB",
        "vin": "5SFGF403X8E"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "06/15/2010",
        "dateOfIncident": "03/09/2009",
        "fire": false,
        "manufacturer": "Heartland Recreational Vehicles, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10336394,
        "products": [
            {
                "manufacturer": "Heartland Recreational Vehicles, LLC",
                "productMake": "HEARTLAND",
                "productModel": "CYCLONE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 HEARTLAND CYCLONE. THE CONTACT RECEIVED A RECALL NOTICE FOR RECALL 10V077000 (EQUIPMENT: OTHER: LABELS). THE CONTACT CALLED THE MANUFACTURER WHO STATED THAT THEY WOULD SEND A STICKER TO REPLACE THE INCORRECT ONE. THE CONTACT PURCHASED A 5,200 POUND AXLE FOR THE VEHICLE SO THE CONTACT FELT THAT THE MANUFACTURER SHOULD HAVE REPLACED THE AXLE AS WELL AS THE LABEL.",
        "vin": "5SFGF40357E"
    }
]