[
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/25/2011",
        "dateOfIncident": "05/01/2011",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10415049,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLSTF",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HARLEY DAVIDSON FLSTF. THE CONTACT STATED THAT FRONT AND REAR TIRES WOULD SCRAPE AGAINST THE FRAME OF THE VEHICLE SINCE THE TIRE LOST TREAD. THE TIRE FAILURE ALSO CAUSED THE VEHICLE TO SHAKE VIOLENTLY WHILE DRIVING. THE TIRES WERE  REPLACED NUMEROUS TIMES, BUT THE FAILURE RECURRED. THE DEALER AND MANUFACTURER DENIED ANY ASSISTANCE WITH FAILURE. THE FAILURE MILEAGE WAS 6,300 AND THE CURRENT MILEAGE WAS 17,032.",
        "vin": "1HD1BX5177Y"
    },
    {
        "components": "STEERING,WHEELS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/06/2011",
        "dateOfIncident": "06/12/2010",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10381929,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLSTF",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN LOOSING MY GRIP ON THE HANDLE BAR, AT APPROXIMATELY 35 MPH, THE FRONT END WOBBLES. IF I TAKE ONE HAND OFF THE GRIP AT A STEADY SPEED THE FRONT END WOBBLES MORE. I ALSO NOTICE THE WOBBLE IS WORSE ON DECELERATION. I CAN FEEL THE FRONT END AT 30 - 55 MPH AND THE LONGER I LET LOOSE MY GRIP THE QUICKER AND MORE DRASTIC THE WOBBLE BECOMES. I HAVE CHECKED THE FRONT WHEEL BEARINGS AND THE STEERING HEAD BEARINGS ARE TIGHT. I HAVE ALSO REPLACED THE FRONT TIRE WITH ANOTHER DUNLOP TIRE. THE WOBBLE ISN'T VERY NOTICEABLE WITH BOTH HANDS TIGHTLY ON THE HANDLE BAR GRIPS.",
        "vin": "1HD1BX51X7Y"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/15/2009",
        "dateOfIncident": "12/14/2009",
        "fire": true,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10295758,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLSTF",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HARLEY-DAVIDSON FLSTF. WHILE DRIVING APPROXIMATELY 40 MPH, THE IGNITION SWITCH BEGAN  TO SMOKE ALONG WITH SPARKS. THE SWITCH WAS LOCATED ON TOP OF THE FUEL TANK. THE ENGINE STALLED AND THEN ALL OF THE LIGHTS TURNED OFF. HE WAS ABLE TO SAFELY PULL TO THE SIDE OF THE ROAD. HE THEN TURNED THE CONSOLE OFF. HOWEVER, THE MOTORCYCLE AND THE ON-SWITCH HAD COMPLETELY BURNED. HE CHANGED THE WIRING AND WAS ABLE TO DRIVE TO HIS HOME. HE HAD NOT CONTACTED THE DEALER OR THE MANUFACTURER TO-DATE. THE CURRENT AND FAILURE MILEAGES WERE 46,009",
        "vin": "1HD1BX51X7Y"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/08/2009",
        "dateOfIncident": "08/07/2009",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10279790,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLSTF",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "2007 HARLEY-DAVIDSON MOTOR COMPANY HARLEY DAVIDSON FLSTF ON MY 2007 HARLEY-DAVIDSON FATBOY, THE FRONT AXLE TILTS/LEANS TO THE RIGHT SIDE OF THE BIKE. THIS HAS DONE TWO THINGS. FIRST, IT HAS REDUCED THE AMOUNT OF TREAD THAT IS AVAILABLE FOR MAKING RIGHT HAND TURNS. SECONDLY, AND MOST IMPORTANTLY IT IS WEARING ONLY ON THE RIGHT SIDE OF THE TIRE. THE TIRE WEAR TO ONE SIDE COMBINED WITH LESS TREAD AVAILABLE DUE TO THIS FLAWED DESIGN HAS PRESENTED A SERIOUS SAFETY ISSUE WITH REGARD TO GRIP GOING AROUND CORNERS.  THE PROBLEM WAS FIXED IN 2008 AND 2009 BUT HARLEY HAS YET TO FIX THE 2007 BIKES.  IT'S ONLY A MATTER OF TIME BEFORE SOMETHING FATAL HAPPENS BECAUSE OF THIS DESIGN FLAW. *TR",
        "vin": "1HD1BX5197Y"
    },
    {
        "components": "SUSPENSION",
        "crash": true,
        "dateComplaintFiled": "02/13/2009",
        "dateOfIncident": "06/13/2008",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10258586,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLSTF",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "2007 HARLEY DAVIDSON FATBOY FLSTF MOTORCYCLE WAS MANUFACTURED WITH MISALIGNED FRONT WHEEL. *TR",
        "vin": "1HD1BX5197Y"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/10/2009",
        "dateOfIncident": "02/26/2008",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10258289,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLSTF",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT WHEEL BEARING FAILURE 2,500 MILES & 3,900 MILES   NOISE & BEARING LOCK-UP WHEEL DRAGGING. *TR",
        "vin": "1HD1BX5397Y"
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "12/29/2008",
        "dateOfIncident": "04/04/2008",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10253131,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLSTF",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MY 2007 HARLEY-DAVIDSON FATBOY, THE FRONT AXLE TILTS/LEANS TO THE RIGHT SIDE OF THE BIKE. THIS HAS DONE TWO THINGS. FIRST, IT HAS REDUCED THE AMOUNT OF TREAD THAT IS AVAILABLE FOR MAKING RIGHT HAND TURNS. SECONDLY, AND MOST IMPORTANTLY IT IS WEARING ONLY ON THE RIGHT SIDE OF THE TIRE. THE TIRE WEAR TO ONE SIDE COMBINED WITH LESS TREAD AVAILABLE DUE TO THIS FLAWED DESIGN HAS PRESENTED A SERIOUS SAFETY ISSUE WITH REGARD TO GRIP GOING AROUND CORNERS.    IT FIRST BEGAN WITH A MINOR CRASH THAT INVOLVED MYSELF, THIS BIKE, AND THE PAVEMENT. A CAR PULLED INTO MY INTENDED PATH OF TRAVEL. I HIT BOTH BRAKES AND SUDDENLY MY FRONT TIRE LOCKED UP AND KICKED MY BARS TO THE RIGHT. NEXT THING I KNOW IS THAT IM ON THE GROUND WITH MY BIKE. I THOUGHT IT WAS UNFORTUNATE LUCK AT THE TIME BUT SEEING THE WEAR OF MY TIRE IN THE FRONT, IT CANT BE A COINCIDENCE.    ADDITIONALLY IT SHOULD BE NOTED THAT MY BIKE WAS PRODUCED IN JULY OF 2006 AT THE BEGINNING OF THE 2007 MODEL PRODUCTION RUN. TO MY KNOWLEDGE, WHAT EVER ISSUE THAT CAUSED HARLEY-DAVIDSON TO ENGINEER MY MOTORCYCLE YEAR MODEL WITH EXTREME AMOUNTS OF CAMBER IN THE FRONT STEERING AXLE WAS RESOLVED WITH EITHER THE 2008 OR 2009 MODEL YEAR. THE FACT THAT THE CURRENT MODEL YEAR OF THIS MOTORCYCLE HAS HAD THIS FRONT AXLE ISSUE CORRECTED IS ABOUT AS LOUD A STATEMENT AS ANY THAT THERE WAS AN ISSUE WITH THIS FIRST YEAR ISSUE OF THE SECOND GENERATION OF THE FATBOY MODEL.    SO FAR, THE PARTS THAT WERE REPLACED TO TRY AND CORRECT THIS ISSUE WERE THE FRONT AXLE BEARINGS AS WELL AS READJUSTING THE STEERING NECK BEARINGS.    HOWEVER THIS WILL NOT FIX AN ISSUE THAT HAS BEEN PHYSICALLY MACHINED INTO THE FRONT FORK ASSEMBLY. THE MOUNTING BOSSES FOR THE FRONT FENDER ARE THICKER ON THE LEFT SIDE THAN THE RIGHT. NO AMOUNT OF ADJUSTING OR PARTS WILL CHANGE THIS INTENTIONALLY ENGINEERED BANDAID!    THIS IS A HUGE SAFETY ISSUE THAT SO FAR HAS GENERATED NO RESPONSE FROM HARLEY DAVIDSON OTHER THAN A REFERENCE NUMBER REQUEST TO TAKE IT TO A DEALER. *TR",
        "vin": "1HD1BX5167Y"
    },
    {
        "components": "SUSPENSION,STRUCTURE,WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/22/2008",
        "dateOfIncident": "03/13/2008",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10243057,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLSTF",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2007 HARLEYDAVIDSON FLSTF (FAT BOY) WAS ENGINEERED WITH A DEFECT (FRONT WHEEL IS DESIGNED 3/4\" OFF CENTER BETWEEN THE FORK TUBES) WHICH LEAVES THE MOTORCYCLE PRONE TO \"HIGH SPEED WOBBLE\" AND TO DRIFT OFF CENTER AT MODERATE SPEEDS.     A HIGH SPEED WOBBLE CAN BE DEADLY ON A MOTORCYCLE. I ALMOST CRASHED. *TR",
        "vin": "1HD1JG5147Y"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/04/2007",
        "dateOfIncident": "07/31/2007",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10210741,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLSTF",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT TIRE IS OFFSET FROM CENTER. THIS CAN CAUSE A POSSIBLE ACCIDENT RESULTING IN INJURY OR DEATH. THE TIRE BEING OFFSET DOES NOT EFFECT THE TRUE FORWARD DRIVING DIRECTION. IT DOES HOWEVER CAUSE TURNING OF THE VEHICLE TO BE DANGEROUS. WHEN TURNING ON A MOTORCYCLE YOU HAVE TO LEAN INTO THE TURN AND WHILE TURNING. BECAUSE THE TIRE IS NOT CENTERED IT CAUSING YOUR ANGLE OF TURN TO BE DIFFERENT FROM LEFT TURN TO RIGHT TURN AND MAY RESULT IN LOSS OF TRACTION RESULTING IN INJURY OR DEATH. THE MANUFACTURER CORRECT THIS DEFECT IN THE 2008 MODELS. THIS MODEL THAT HAS THE DEFECT IS FLSTF KNOWN AS THE FATBOY. THE NUMBER OF FAILURES IS ALL THE 2007 FLSTF.  *TR",
        "vin": "1HD1BX51X7Y"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/14/2007",
        "dateOfIncident": "05/25/2007",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10208903,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLSTF",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "VIBRATION IN THE FRONT  BETWEEN 38 MPH AND 42 MPH WHILE HAVING A LOOSE GRIP ON THE HANDLE BARS. ALSO HAS A SLIGHT DRIFT TO THE LEFT WHICH I BELIEVE IS DUE TO THE OFFSET OF THE FRONT WHEEL.  *TR",
        "vin": "1HD1BX5157Y"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/20/2007",
        "dateOfIncident": "08/10/2007",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10200083,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLSTF",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MY MOTORCYCLE RUNS SO HOT, IT PINGS, KNOCKS AND BURNS MY LEGS.  *TR",
        "vin": "1HD1BX5107Y"
    }
]