[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/30/2015",
        "dateOfIncident": "01/28/2008",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10787200,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLSTC",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE NOTICED THAT BRAKE FLUID WEEPS OUT OF THE MASTER CYLINDER DUE TO A FAULTY RUBBER CAP GASKET... WHEN I CONTACTED THE LOCAL HARLEY DEALER IN METAIRIE LOUISIANA, I WAS IN FORMED THAT HARLEY DAVIDSON HAS KNOWN ABOUT THIS PROBLEM FOR A LONG TIME...  THEY HAVE KNOWN SO LONG THAT THEY HAVE FORMULATED DIFFERENT GASKET MATERIALS 3 (THREE) TIMES SINCE I PURCHASED MY MOTORCYCLE IN 2007.. THEY ALSO HAVE REPLACED BOTH THE FRONT AND REAR MASTER CYLINDERS DURING THE MOTORCYCLES 1000 MILE CHECKUP.... HOWEVER THE FLUID CONTINUES TO LEAK OUT...  IT IS TO THE POINT THAT I NO LONGER CAN RIDE THE MOTORCYCLE DUE TO THE FACT I NO LONGER HAVE ANY REAR BRAKES AT ALL... I AGAIN INQUIRED FROM THE DEALER FOR A REMEDY AND WAS INFORMED THAT I WOULD HAVE TO REPLACE BOTH MASTER THE FRONT AND THE REAR MASTER CYLINDERS...   I FEEL THAT SINCE HARLEY DAVIDSON HAS KNOWN ABOUT THIS ISSUE THAT THEY SHOULD HAVE ORDERED A RECALL TO ADDRESS THE PROBLEM BEFORE SOMEONE GETS KILLED.... SINCE THIS PROBLEM HAS BEEN ON GOING SINCE 2007... APPARENTLY THE FLUID WEEPS OUT ANYTIME YOU ACTIVATE THE BRAKES...",
        "vin": "1HD1BW5167Y"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/06/2010",
        "dateOfIncident": "11/06/2010",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10364274,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLSTC",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "IN LINE BRAKE LIGHT SWITCH FAILED. FAST LOSS OF BRAKE FLUID AND ABILITY TO STOP. WHEN IT WAS TAKEN TO THE SHOP, I WAS TOLD THAT THIS WAS A WIDE SPREAD FAILURE. IN SEVERAL INSTANCES THIS COULD RESULT IN A VERY HAZARDOUS SITUATION. *TR",
        "vin": "1HD1BW51X7Y"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/20/2008",
        "dateOfIncident": "12/19/2008",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10252324,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLSTC",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING HOME ON MY HARLEY DAVIDSON HERITAGE I WAS ON A VERY DARK ROAD SO I DECIDED TO TURN ON MY BRIGHT LIGHTS. I FLIP THE SWITCH THEN ALL THE HEAD LIGHTS WENT OUT ALMOST CAUSING ME TO CRASH. THIS IS A SERIOUS PROBLEM. I MADE IT TO THE SIDE OF THE ROAD AND FOUND OUT THAT THE 15 AMP FUSE WAS BLOWN. THE HEADLIGHTS ARE STOCK. *TR",
        "vin": "1HD1BW5167Y"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/22/2008",
        "dateOfIncident": "05/15/2007",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10235276,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLSTC",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A HARLEY DAVIDSON 2007 HERITAGE SOFTTAIL CLASSIC.  IT HAS A DANGEROUS HEAT PROBLEM. HARLEY DAVIDSON DESIGNED THE BIKE WITH THE OIL PAIN RIGHT UNDER THE DRIVER SEAT.  I HAVE A TEMPERATURE OIL GAUGE AND THE TEMPERATURE REACHES 250DEGREES RIGHT UNDER YOUR THIGH. IT IS EXTREMELY PAINFUL, FEELS LIKE YOU HAVE A BLOW TORCH RIGHT UNDER YOUR THIGH.  IT IS QUITE DISTRACTING AND WHEN YOU ARE DRIVING A MOTORCYCLE YOU MUST HAVE YOUR WITS ABOUT YOU AT ALL TIME. I CONTACT HD CUSTOMER SERVICES, THEY DO NOT HAVE ANY FIXITS IN MIND.  THEY NEED TO,  IT IS DEFINITELY A DESIGN FLAW, HOWEVER EVEN IF THEY REDESIGN THE MOTORCYCLE IT DOES LITTLE GOOD FOR ME. I LOVE THE BIKE, BUT HATE THE HEAT.  HARLEY NEEDS TO DO A RECALL AND DESIGN SOME SORT OF DEFLECTOR PART TO PUT ON THESE BIKES.  THE BIKE IS HOT ALL OF THE TIME, A LITTLE COOLER WHEN YOU ARE GOING FAST, BUT NOT MUCH.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/21/2008",
        "dateOfIncident": "06/14/2007",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10235181,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLSTC",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "EXCESSIVE ENGINE HEAT MAKES MOTORCYCLE UNDRIVABLE AT SLOW SPEEDS.  HEAT LITERALLY CAUSES RED SKIN ON BACK SIDE OF UPPER THIGH (FIRST DEGREE BURNS).  HARLEY DAVIDSON IS AWARE OF THIS PROBLEM, YET DOES NOT EVEN OFFER AN AFTERMARKET FIX.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/09/2007",
        "dateOfIncident": "08/29/2006",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10205239,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLSTC",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 HARLEY DAVIDSON FLSTC.  THE CONTACT STATED THAT HE HEARD A LOUD NOISE WHEN HE SHIFTED INTO FIFTH GEAR.  THE DEALER STATED THAT IT WAS A COMMON COMPLAINT FOR THAT YEAR AND THEY HAD NO PLANS TO DO ANYTHING ABOUT IT.  THE MOTORCYCLE STILL MAKES THE LOUD NOISE IN FIFTH GEAR.  THE CURRENT MILEAGE IS 4,926 AND THE FAILURE MILEAGE WAS ONE.",
        "vin": "1HD1BW5197Y"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/20/2007",
        "dateOfIncident": "07/04/2007",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10200223,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLSTC",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "'07 HARLEY DAVIDSON HERITAGE SOFTAIL -I WAS RIDING WITH A GROUP AND WE ACCIDENTALLY RAN INTO A PARADE DURING THE 4TH OF JULY. WE SAT IN TRAFFIC FOR ABOUT 10 MINUTES DURING WHICH TIME I HAD TURNED MY BIKE OFF AND GOT OFF OF IT DUE TO THE HEAT.  AFTER 10 MINUTES OF NOT RUNNING I RESTARTED MY BIKE TO MAKE A U-TURN.  HOWEVER THE MOTORCYCLE DIED DURING THE U-TURN ACROSS TWO LANES OF TRAFFIC.  I WAS UNABLE TO RESTART THE MOTORCYCLE UNTIL IT HAS COOLED DOWN.    THIS COULD HAVE CAUSED ME TO BE HIT BY A VEHICLE IF THE LANE WAS NOT BEING BLOCKED BY THE LEAD RIDER.  I LATER DROPPED THE BIKE IN A PARKING LOT DUE TO HEAT AS WELL. IF THIS BIKE EVER FALLS ON THE RIGHT AND LANDS WITH MY LEG UNDER THE PIPE I WILL SUFFER MASSIVE BURNS DUE TO THE EXTREME HEAT THIS MOTOR PUTS OFF. NOTHING IS BEING DONE TO CORRECT THE HEAT ISSUE.  HARLEY DAVIDSON EXPECTS THE CUSTOMER TO PURCHASE EXPENSIVE PARTS TO REPAIR AN ENGINEERING FAILURE THEY CREATED. THE BIKE IS STILL RUNNING HOT BUT I NOT LONGER FEEL SAFE ON IT. *TR",
        "vin": "1HD1BMY172Y"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/13/2007",
        "dateOfIncident": "06/15/2007",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10199368,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLSTC",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "EXCESSIVE HEAT GENERATED BY MOTOR MAKES '07 HARLEY-DAVIDSON UNRIDEABLE AT LOW SPEED /IN HEAVY TRAFFIC SITUATIONS.  SOMETIMES GETS SO BAD AS TO NECESSITATE PULLING OUT OF TRAFFIC TO LET IT COOL OFF. *TR",
        "vin": ""
    }
]