[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/06/2022",
        "dateOfIncident": "10/14/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455411,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "The frame of the vehicle has rusted out at the bolt where the rear trailing arm connects to the frame. The rust has caused the vehicle to fail Maine State Inspection. This vehicle defect has led to a recall in Canada: “On certain vehicles, the rear frame could rust. In extreme cases, this could result in a rear trailing arm separating from the vehicle. This recall applies to vehicles originally sold or currently registered in areas of heavy road salt usage (Ontario, Quebec, New Brunswick, Nova Scotia, Prince Edward Island, and Newfoundland & Labrador).”  https://recallmonitor.ca/recall/2021024  Maine and New Hampshire, where this vehicle has been registered for its entire life, are areas of heavy road salt usage.  According to Honda Canada, “ A rear trailing arm that separates could cause a loss of control and increase the risk of a crash.”  The vehicle is available for inspection upon request. It was inspected by a garage certified to provide Maine State Inspections. The manufacturer has acknowledged the defect in Canada. There were no warning lamps related to this issue.",
        "vin": "5J6YH28717L"
    },
    {
        "components": "SUSPENSION",
        "crash": true,
        "dateComplaintFiled": "09/30/2021",
        "dateOfIncident": "09/11/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434972,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving, without notice at all, the drivers side rear suspension ,wheel, and all the holds it together became dislocated/disassembled from the car while going about 40mph. Upon further investigation, I found the whole frame mount for the rear suspension had completely rotted away and caused this whole issue. NO PRIOR WARNING AT ALL!! This is a potentiality deadly issue.. I had just come off the highway doin 70 mph... if this would of happened there...it would of been a completely different outcome. The year/make/model of my vehicle has already been recalled for this issue.. BUT my vin # wasn't included?.?.?. THIS IS WRONG!! THIS IS A SERIOUS ISSUE THAT NO AMOUNT OF MAINTENANCE WILL STOP!!",
        "vin": "5j6yh28377l"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/30/2021",
        "dateOfIncident": "08/28/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11431078,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2007 Honda Element. The contact stated while driving 25 MPH, the contact drove over a pothole and noticed that the driver’s side control arm on the rear axle fractured and detached from the vehicle, causing the rear driver’s side tire to stick out from underneath the vehicle. The contact pulled over to the side of the roadway and had the vehicle towed to an independent mechanic where the vehicle was inspected and diagnosed. The contact was informed that rust and corrosion on the rear axle had caused the failure and that the axle needed to be replaced. The vehicle was not repaired. The manufacturer was not made aware of the failure. The failure mileage was approximately 102,000.",
        "vin": "5j6yh28737l"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/26/2021",
        "dateOfIncident": "10/27/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390087,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "ODOMETER ROLLED BACK IN RE-SALE; RESULT OF RETURN DUE TO NATURAL DISASTER. (2000MILES)",
        "vin": "5J6YH18927L"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/26/2021",
        "dateOfIncident": "01/13/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390089,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "HO 11851603  LAST KNOWN MILES FROM HO (AIRBAG RECALL SERVICE)",
        "vin": "5J6YH18927L"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "01/17/2021",
        "dateOfIncident": "01/16/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388604,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING NORMAL DRIVING, NO HARD BRAKING INVOLVED, THE PASSENGER SEATBELT CONSISTENTLY LOCKS UP - CAUSING MY PASSENGERS TO BE LOCKED IN PLACE.  IT LOCKS IF A PASSENGER LEANS FORWARD TO REMOVE SOMETHING FROM THE DASH CUBBIES (WHICH ARE JUST OUTSIDE OF ARMS REACH BUT WELL WITHIN NORMAL RANGE REACH).  IT LOCKS IF THE PASSENGER LEANS TO REACH BEHIND THE DRIVER'S SEAT.  IT SEEMS AS IF THE BELT HAS BEEN DESIGNED TOO SHORT OR THE LOCKING MECHANISM OVERLY SENSITIVE.  SHOULD A COLLISION HAPPEN WHILE LOCKED, THERE WOULD BE ABSOLUTELY NO GIVE AND COULD CAUSE THEM SIGNIFICANT HARM.",
        "vin": "5J6YH17717L"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/16/2020",
        "dateOfIncident": "01/15/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364722,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "VSA LIGHT COMES ON AND TURNS OFF INTERMITTENTLY..AND AT TIMES IT HAPPENS ON THE HIGHWAY WHICH CAUSES THE CAR TO JERK AND NOT RUN RIGHT WHEN GOING ABOVE 2500RPM..THEN THE LIGHT WILL GO AWAY BUT THE CEL INDICATOR WILL STAY ON ...AT MY WITS END AND DONT KNOW WHAT TO DO",
        "vin": "5J6YH28787L"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/10/2020",
        "dateOfIncident": "02/03/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11308137,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SRS SENSOR IS BAD DUE TO AIR BAG STEERING WHEEL BEING RECALLED AND REPLACED IS PART OF THE SYSTEM THAT AIR BAG FUNCTIONS BY. I BELIEVE THE OR ALL PARTS SHOULD RECALLED",
        "vin": "5J6YH18797L"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/10/2020",
        "dateOfIncident": "12/21/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11298332,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE INDICATORS ON MY ODOMETER AND SPEEDOMETER FELL OFF INTO MY DASH, EMITTING THE BACKGROUND LIGHT. I WAS DRIVING THE CAR HOME  AND PARKED IT .WHEN I STOPPED BOTH INDICATORS FELL. I DID NOT HIT ANY POT HOLES OR BUMPS. I HAVE READ IN YOUR COMPLAINTS THAT THIS HAS HAPPENED BEFORE,  THE LIGHT IS VERY BRIGHT AND I HAD TO  PLACE TAPE OVER IT TO AVOID THE GLARE VERY DANGEROUS OTHERWISE.. I CAN NO LONGER TELL MY SPEED. MY GAS INDICATOR DOES NOT SEEM TO BE ACCURATE EITHER AS IT FALLS BELOW THE EMPTY LINE.",
        "vin": "5J6YH18967L"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/30/2019",
        "dateOfIncident": "09/21/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11258997,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2007 HONDA ELEMENT. WHILE DRIVING APPROXIMATELY 35-40 MPH, THE CONTACT CRASHED INTO THE REAR OF ANOTHER VEHICLE, WHICH CAUSED A CHAIN REACTION. THE CONTACT STATED THAT THE AIR BAGS FAILED TO DEPLOY. THE CONTACT LATER EXPERIENCED PAIN IN THE LEFT ARM. MEDICAL ATTENTION WAS NOT RECEIVED. A POLICE REPORT WAS FILED. THE CONTACT WAS ABLE TO DRIVE THE VEHICLE HOME. THE VEHICLE WAS TOWED TO THE INSURANCE COMPANY'S LOT TO BE INSPECTED. THE VEHICLE WAS NOT DIAGNOSED AND WAS DEEMED DESTROYED. A DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS CONTACTED AND PROVIDED CASE NUMBER: 09915922. THE APPROXIMATE FAILURE MILEAGE WAS 310,000.",
        "vin": "5J6YH18737L"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/03/2019",
        "dateOfIncident": "08/03/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11241460,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL:    THIS IS REGARDING A 2007 HONDA ELEMENT.    WE HAVE NOT OWNED THIS VEHICLE SINCE 2007, AND PROBABLY TRADED IT ON ANOTHER CAR.   IT'S BERN SUCH A LONG TIME, WE DO NOT REMEMBER WHICH DEALER WE DEALT WITH.   WE HAVE RECEIVED NUMEROUS RECALL NOTICES FROM HONDA, AND EACH TIME, BY PHONE OR RESPONSE CARD, HAVE INFORMED THEM THAT WE NO LONGER OWN THE CAR.   PLEASE UPDATE YOUR RECORDS, AND TAKE US OFF OF THE NOTIFICATION LIST.   WE WILL NO LONGER RESPOND TO NOTICES REGARDING THIS CAR.  IT'S ANNOYING THAT HONDA IS UNABLE TO UPDATE THEIR RECORDS WITH OUR NUMEROUS CONTACTS WITH THEM.  THANK YOU.",
        "vin": "5J6YH18927L"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/12/2019",
        "dateOfIncident": "12/12/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11195821,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL ON THE VEHICLE IS FOR A FAULTY WIRING HARNESS FOR THE TRAILER HITCH. MY VEHICLE HAS A TRAILER HITCH AND WIRES INSIDE THE VEHICLE, BUT APPARENTLY THE HITCH ISN'T OEM, SO \"IT DOESN'T MATTER\" ACCORDING TO NELSON HONDA AT 2500 GREENSBORO ROAD, MARTINSVILLE, VA 24112. HONDA WOULDN'T HAVE INCLUDED THE VIN UNLESS IT HAD THE PART THAT NEEDS FIXING, BUT THE DEALER REFUSED BECAUSE IT DIDN'T MATTER FOR MY CAR. IF IT DOESN'T MATTER, THE RECALL SHOULD BE CLEARED FROM MY VIN, BUT I SUSPECT THEY JUST DON'T WANT TO DO THE WORK SINCE THE HITCH ISN'T OEM BUT THE WIRING STILL IS. THEY TOLD ME THAT THE HITCH WASN'T THERE'S SO IT WOULDN'T MATTER, BUT IT'S THE LIGHTS/POWER CONNECTOR.    THE ONLY REASON I DIDN'T PURSUE THIS ORIGINALLY IS BECAUSE I'M NOT TOWING ANYTHING, HOWEVER I EXPECT THIS TO CHANGE IN THE FUTURE AND I'M HAVING OTHER PROBLEMS WITH THE DEALERSHIP IN NOT VERIFYING PARTS I PURCHASE SEPARATELY BEFORE ATTEMPTING TO USE (VOIDING RETURN POLICY) SO THAT I HAVE TO BUY THEIR PARTS INSTEAD.",
        "vin": "5J6YH28777L"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/12/2018",
        "dateOfIncident": "11/08/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11151002,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS JUST DRIVING MY 2007 HONDA ELEMENT TO WORK IN THE NORTH END OF SEATTLE, AND ALL OF THE SUDDEN MY VEHICLE STARTED JERKING AND THE CHECK ENGINE LIGHT, VSA AND STEERING LIGHT CAME ON THE \"TRIANGLE WITH A LIGHTNING BOLT IN IT\" IT STARTED RUNNING ROUGH. WHEN I WOULD STEP ON THE GAS IT WOULD CAUSE THE CAR TO JERK AND THE SPEEDOMETER WOULD IDLE UP AND DOWN. IT WAS VERY INTENSE. I WOULD LIFT OFF THE GAS PATEL AND TRY TO LET IT SMOOTHIN OUT. IT DEFINITELY IS A SAFETY ISSUE. I LOOKED ONLINE AND SAW A RECALL ON THE 2007 AND 2008 HONDA ELEMENT, OVER 68,000 OF THEM. I WENT TO HONDA OF SEATTLE AND THEY TOLD ME THERE WASN'T A RECALL, I THEN TOLD HIM TO LOOK ONLINE AND HE TRIED TO TELL ME THAT MY CAR WASN'T COVERED. HE STARTED TO QUOTE SOME NUMBERS OF WHAT THE DIAGNOSTIC WOULD COST AND THEN THEY WOULD GO FROM THERE. I THEN TOLD THEM TO RETURN MY VEHICLE AND BROUGHT IT TO MY MECHANIC. THE TOTAL COST TO FIX WHAT HONDA WOULDN'T EVEN THOUGH IT IS A RECALL IS $450.00. THIS IS UNFAIR AND HONDA NEEDS TO MAKE THIS RIGHT!",
        "vin": "5J6YH28707L"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/01/2018",
        "dateOfIncident": "05/30/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11099132,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Kumho Tire Co., Inc.",
                "productMake": "KUMHO",
                "productModel": "SOLUS",
                "productYear": "9999",
                "size": "P225/60R17",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HONDA ELEMENT EQUIPPED WITH KUMHO SOLUS KR 21 TIRES, SIZE: P215/70R16 99T (NA). THE CONTACT STATED THAT THE REAR PASSENGER SIDE TIRE SHOOK WHILE DRIVING 45 MPH. THE VEHICLE WAS TAKEN TO AN INDEPENDENT TIRE STORE WHERE IT WAS CONFIRMED THAT THE BELT ON THE TIRE WAS WORN. THE MECHANIC ALSO STATED THAT ALL THE TIRES NEEDED REPLACEMENT. THE TIRES WERE REPLACED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VEHICLE FAILURE MILEAGE WAS 94,042. THE VIN, DOT NUMBER, AND TIRE FAILURE MILEAGE WERE NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/11/2018",
        "dateOfIncident": "05/11/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11093347,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A LETTER FROM HONDA STATING THAT MY INSTRUMENT PANEL MAY NEED TO BE REPLACED.  I CONTACTED RENNER HONDA, COLUMBUS, INDIANA WHERE I PURCHASED MY ELEMENT SC NEW AND TOLD THEM THAT MY GAUGES WERE FALLING OUT.  THEY SAID THEY WOULD ORDER THE PANEL AND REPLACE IT.  I NEVER HEARD FROM THEM AGAIN AND THE TIME FOR REPLACEMENT CLOSED.  NEXT, I RECEIVED THE BRAKE RECALL NOTICE AND DECIDED TO TRY CLARKSVILLE, IN NEIL HUFFMAN HONDA.  THEY SAID THEY ONLY DID RECALLS DURING THE WEEK AND IF I NEEDED A LOANER VEHICLE TO GET BACK TO WORK...THAT IT WOULD BE $100/DAY AND THEY WOULD NEED MY VEHICLE 2-3 DAYS.  I SAID SO YOU ARE CHARGING ME FOR MY INCONVENIENCE AND THEY SAID THAT'S OUR POLICY.  SO, I LET THAT RECALL GO. HERE IT IS 2018, MY GAUGES DO NOT WORK AT ALL AND IT LOOKS LIKE I'M DOING 55 SITTING STILL.  MY GAS GAUGE IS BROKE AS WELL, MY HEADLIGHTS ARE DIM AND MY FANS BOTH QUIT WORKING, PART OF THE TOP PANEL HAS FLOWN OFF--AND MY VISOR IS BROKE.  BUT,  I DID FINALLY GET HONDA WORLD, LOUISVILLE, KY TO REPLACE THE AIRBAGS AND THE BRAKE RECALL.  BUT, NO DICE ON THE INSTRUMENT PANEL.  I THINK THAT IS WRONG CONSIDERING ALL THE RECALLS ON THIS BY HONDA.  THEY WILL NOT BUDGE ON PRICE YET THERE HAVE BEEN OVER 11 RECALLS ON THIS VEHICLE AND NOW I AM STUCK PAYING FOR THE GAUGES, NOT TO MENTION IF THE BRAKES HAD WENT OUT YEARS AGO...I COULD HAVE BEEN INJURED OVER CLARKSVILLE NEIL HUFFMAN TRYING TO CHARGE ME FOR A RENTAL CAR! THANKS TO HONDA WORLD, BUT I WILL NOT RECOMMEND A HONDA TO ANYONE ELSE CONSIDERING ALL THE COMPLAINTS OVER THE INSTRUMENT PANEL, VISORS, LIGHTS,  ETC THAT I AM READING ON HERE. SHAME ON YOU HONDA!",
        "vin": "5J6YH18927L"
    },
    {
        "components": "EXTERIOR LIGHTING,WHEELS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/01/2018",
        "dateOfIncident": "03/07/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11091258,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN IM GOING MORE THAN 35 MILES THE CAR IS TRYING TO STOP. THE VSA & ENGINE LIGHT IS ON AND TOOK IT TO MECHANIC BUT STILL HAVE THE SAME PROBLEM. I HAVE SEEN A LOT OF PERSONS WITH THE SAME PROBLEM. THE ODYSSEY HAS A RECALL WITH THE SAME PROBLEM. COULD YOU CHECK IF THIS A MANUFACTURER PROBLEM. I CAN'T DRIVE MY CAR AM AFRAID SOMETHING WORST COULD HAPPEN. I HAD TO BUY ANOTHER CAR AND DON'T KNOW WHAT TO DO WITH THE ELEMENT.",
        "vin": "5J6YH18727L"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/29/2017",
        "dateOfIncident": "01/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11057549,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "LETTER FROM SENATOR SCHUMER ON BEHALF OF CONSTITUENT RE TAKATA AIRBAGS BEING REPLACED AND BATTERY DRAINAGE PROBLEM IN HONDA ELEMENT. *LD *JS",
        "vin": ""
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/11/2017",
        "dateOfIncident": "07/22/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11054018,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE THE VEHICLE MOVING SLOWLY, SUDDENLY THE ABS, VSA (VEHICLE STABILITY ASSIST) AND TRACTION CONTROL LIGHTS ALL CAME ON AT THE SAME TIME AND STAYED ON. A HONDA DEALERSHIP LATER DIAGNOSED THE ISSUE AS A FAULTY VSA MODULATOR, AN EXPENSIVE PART WHICH CONTROLS THE ABS AND TRACTION CONTROL SYSTEMS. THE FAULT OUR VEHICLE EXPERIENCED PREVENTS ALL THESE SYSTEMS FROM FUNCTIONING.     I CONTACTED OTHER HONDA ELEMENT OWNERS AND FOUND SEVERAL WHO HAD THE EXACT SAME ISSUE WITH 2007 AND 2008 ELEMENTS - ALL THREE LIGHTS ILLUMINATED WITH NO APPARENT CAUSE AND THEN DEALER DIAGNOSIS TURNED UP A FAULTY VSA MODULATOR. IN SEVERAL CASES, THESE PEOPLE CONTACTED HONDA OF AMERICA AND HONDA OFFERED TO PAY FOR THE VSA MODULATOR REPLACEMENT (EVEN OUTSIDE OF WARRANTY), PRESUMABLY DUE TO THE SAFETY ISSUE OF HAVING THIS CRITICAL PART FAIL THAT DISABLES THE ABS AND VEHICLE STABILITY SYSTEMS. I CONTACTED HONDA OF AMERICA AND THEY WOULD NOT REPLACE PROVIDE ASSISTANCE IN THE REPLACEMENT OF THE PART ON MY VEHICLE.    BEFORE THIS INCIDENT, I HAD NOT EXPERIENCED ANY ISSUES WITH THE VSA MODULATOR AND HAD VERY RARELY BEEN IN A LOW-TRACTION ENVIRONMENT WHERE EITHER THE VSA OR ABS SYSTEMS WOULD ENGAGE. INTERESTINGLY, A FEW MONTHS BEFORE THIS INCIDENT A HONDA DEALERSHIP PERFORMED A VSA MODULATOR-RELATED RECALL TO REMOVE AIR THAT COULD ACCUMULATE IN THE MODULATOR (RECALL #10V098000); THE DEALERSHIP INSISTED THAT WORK AND THIS FAILURE WERE UNRELATED.     THIS IS A MAJOR SAFETY ISSUE FOR BRAKING AND VEHICLE STABILITY ON A SEALED PART WITH OTHER OPEN RECALLS AGAINST IT. THIS PART SHOULD LAST THE LIFE OF THE VEHICLE, AND YET IT IS FAILING SPONTANEOUSLY WITHOUT ANY EXTERNAL MECHANISM OF FAILURE. HONDA SHOULD REPLACE FAULTY VSA MODULATORS AT NO CHARGE.",
        "vin": "5J6YH27337L"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/05/2017",
        "dateOfIncident": "11/02/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11052501,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "VSA COME ON WHEN TRAVELING ON THE HIGHWAY, CHECK ENGINE LIGHT ALSO COMES ON AT THE SAME TIME.  DOES NOT HAPPEN AT SLOW SPEEDS AND WHEN DRIVING SLOW AFTER IT HAS COME ON, IT WILL GO OFF BY ITSELF AS WELL AS THE CHECK ENGINE LIGHT.  THE CODE IS NOT STORED.",
        "vin": "5J6YH28767L"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/18/2017",
        "dateOfIncident": "01/01/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11006148,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "VSA LIGHT HAS BEEN ON INDICATING VSA SAFETY SYSTEM IS INOPERATIVE.  HONDA SERVICE UNABLE TO FIX IT RECOMENDING REPLACEMENT OF THE ENTIRE SYSTEM COSTING OVER $1,000.  TOOK THE CAR TO HONDA SERVICE OVER THE LIFE BUT GOT NO WHERE.  I PAID THE CAR AND ALL SAFETY SYSTEMS INSTALLED.  AFTER RESEARCHING THIS PROBLEM IN INTERNET OBSERVED THAT THERE ARE HUNDREDS OF SAME VSA PROBLEMS FROM HONDA OWNERS AND HONDA SEEMS TO IGNORE THIS SAFETY PROBLEM.",
        "vin": "5J6YH18387L"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/14/2017",
        "dateOfIncident": "07/12/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11005374,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "SPEEDOMETER NEEDLE HAS DROPPED OVER THE LAST 2 WEEKS . NO LONGER CAN TELL HOW FAST I AM GOING.  2007 ELEMENT 4WD ' FROM VIN 5J6YH2...7L000033 THRU 5J6YH2...7L014108    SAMPLE LETTER:    DECEMBER 2007  PRODUCT UPDATE: INSTRUMENT PANEL GAUGE  NEEDLES READ INACCURATELY OR FALL OFF    DEAR ELEMENT OWNER:  THIS LETTER IS TO NOTIFY YOU OF A POTENTIAL PROBLEM WITH YOUR  VEHICLE AND WHAT YOU SHOULD DO TO RESOLVE IT.    WHAT IS THE PROBLEM?  THE NEEDLES IN THE INSTRUMENT PANEL GAUGES MAY READ  INACCURATELY OF FALL OFF. THE GAUGES THAT CAN BE AFFECTED  INCLUDE THE SPEEDOMETER, THE TACHOMETER, THE FUEL, AND  THE COOLANT TEMPERATURE.    WHAT SHOULD YOU DO?  CONTACT ANY AUTHORIZED HONDA DEALER FOR AN APPOINTMENT  TO HAVE YOUR VEHICLE UPDATED. THE DEALER WILL REPLACE THE  INSTRUMENT PANEL, TRANSFERRING THE ODOMETER AND  MAINTENANCE MINDER DATA FROM THE ORIGINAL INSTRUMENT  PANEL TO THE NEW ONE. THIS WORK WILL BE DONE FREE OF  CHARGE. PLEASE PLAN TO LEAVE YOUR VEHICLE AT THE DEALER FOR  HALF A DAY TO ALLOW SOME FLEXIBILITY IN SCHEDULING.    WHAT TO DO IF YOU FEEL THIS NOTICE IS IN ERROR  OUR RECORDS SHOW THAT YOU ARE THE CURRENT OWNER OR LESSEE  OF A 2007 ELEMENT INVOLVED IN THIS PRODUCT UPDATE. IF THIS IS  NOT THE CASE, OR THE NAME/ADDRESS INFORMATION IS NOT  CORRECT, PLEASE FILL OUT AND RETURN THE ENCLOSED, POSTAGE-PAID  INFORMATION CHANGE CARD. WE WILL THEN UPDATE OUR  RECORDS.      SEEMS HONDA  NOW REFUSES TO HONOR THIS LETTER. I AM THE ORIGINAL OWNER.",
        "vin": "5J6YH27737L"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/31/2017",
        "dateOfIncident": "08/03/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10985208,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "2007 HONDA ELEMENT. CONSUMER WRITES IN REGARDS TO SAFETY RECALL. *LD    THE CONSUMER STATED THE RECALL REPAIR HAS EXCEEDED A REASONABLE AMOUNT. *JS",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/03/2017",
        "dateOfIncident": "07/22/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10970086,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2007 HONDA ELEMENT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V344000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "5J6YH18747L"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/13/2017",
        "dateOfIncident": "03/02/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10960350,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN STOPPING OR SLOWING TO UNDER 30 MPH, THE CAR WANTS TO STALL OR STOP.  THE ENGINE LITE COMES ON AND WHEN YOU START DRIVING IT WILL NOT GO OVER 55 MPH.  THIS 55 MPH IS VERY DANGEROUS ON THE INTERSTATE !  THERE IS A SERVICE BULLETIN BUT NO RECALL, WHY ?   THIS HAS HAPPENED SEVERAL TIMES WHEN MY CAR. THE LATEST ISSUE STARTED 03.02.2017",
        "vin": "5J6YH189X7L"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/14/2016",
        "dateOfIncident": "02/15/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10935374,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A CAR FROM RAUSCH MOTORS IN PARKER WITH THE WIRES TO THE AIR BAG SENSORS BEING CUT AND TAPED TOGETHER, HE PATCHED IT UP AND NOT DEC 2016 MY AIR BAG LIGHT CAME ON. I WAS TOLD BY A HONDA DEALER THAT THE SENSORS ARE BAD, SAME CODES AS BEFORE. I AM WORRIED THAT IN CASE OF A CRASH THE AIRBAGS WONT DEPLOY. RAUSCH MOTORS DENIES RESPONSIBILITY AND TELLS ME THAT SENSORS FAIL.",
        "vin": "5J6YH18987L"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/20/2016",
        "dateOfIncident": "07/28/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10917547,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2007 HONDA ELEMENT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V344000 (AIR BAGS); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "5J6YH28717L"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/12/2016",
        "dateOfIncident": "10/12/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10915502,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2007 HONDA ELEMENT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V344000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "5J6YH189X7L"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/29/2016",
        "dateOfIncident": "07/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10910552,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2007 HONDA ELEMENT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V344000 (AIR BAGS) HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PART DISTRIBUTION DISCONNECT.   UPDATED 01/10/17*LJ   THE CONSUMER STATED RECALL WAS PERFORMED ON 10/18/2016. *TR",
        "vin": "5J6YH18947L"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/19/2016",
        "dateOfIncident": "09/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10907853,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "2007 HONDA ELEMENT.  CONSUMER WRITES IN REGARDS TO REPLACEMENT PARTS NOT AVAILABLE TO REPAIR AIRBAGS.  *SMD",
        "vin": "5J6YH18307L"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/02/2016",
        "dateOfIncident": "07/22/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10892326,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA INFLATORS  THIS IS OUR ONLY MEANS OF TRANSPORTATION TO OUR JOBS WITH OUT CHILDREN ONE OF WHICH HAS A LOT OF MEDICAL APTS. THERE ARE ONLY 2 SEATS IN THE REAR FOR MY CHILDREN'S CAR SEATS, WHICH DOES NOT ALLOW ANYONE TO SIT BACK THERE INSTEAD OF THE PASSENGER SEAT. I CONTACTED HONDA RIGHT AWAY AND PROCESSED AN URGENT CLAIM FOR LOANER TRANSPORTATION FOR THE SAFETY OF MY FAMILY WHILE PARTS ARE ON BACK ORDER ATLEAST 3 WEEKS. A YEAR AND A HALF BEFORE I HAD AN ISSUE WITH THE AIR BAG RECALL AND THIS ACCOMMODATION WAS MADE SO I KNOW THEY ARE ABLE TO HELP OUT. IT'S BEEN A WEEK AND HALF AND 2 CALLS TO THEIR CUSTOMER SERVICE TO FOLLOW UP WITH THE CASE MANAGER THAT THEY SAID WAS TO OVERWHELMED TO GET BACK TO ME. IF MY FAMILY IS INJURED DURING THIS WAIT I WILL FILE A LAWSUIT IN REGARDS TO THIS MATTER. WHEN I ASKED TO FILE A COMPLAINT AND REQUESTED A DIFFERENT CASE MANAGER THE MAN TOLD ME EVERYONE IS URGENT AND I'LL JUST DOCUMENT YOUR COMPLAINT IN THE CALL. I WILL NEVER PURCHASE A HONDA AGAIN ESPECIALLY IF THEY HAVE THIS MANY ISSUES WITH A SAFETY DEVICE AND CANNOT ENSURE MY FAMILIES SAFETY DURING THIS SITUATION. THIS IS VERY DISAPPOINTING.",
        "vin": "5J6YH183X7L"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/25/2016",
        "dateOfIncident": "07/20/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10888109,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2007 HONDA ELEMENT. THE CONTACT RECEIVED A NOTICE FOR NHTSA CAMPAIGN NUMBER: 16V344000 (AIR BAGS) HOWEVER, THE PARTS NEEDED WERE NOT AVAILABLE. THE CONTACT BELIEVED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE AMOUNT OF TIME TO PROVIDE THE RECALL REPAIRS. THE DEALER AND THE MANUFACTURER WERE MADE AWARE OF THE DELAY. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "5J6YH27777L"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/19/2016",
        "dateOfIncident": "07/05/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10885982,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HONDA ELEMENT. WHILE DRIVING APPROXIMATELY 30 MPH, THE INSTRUMENT PANEL GAUGE CLUSTER DISENGAGED FROM THE DASHBOARD. THE VEHICLE WAS TAKEN TO THE DEALER, BUT WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 142,000.",
        "vin": "5J6YH18797L"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/01/2016",
        "dateOfIncident": "02/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10871802,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HONDA ELEMENT. WHILE OPERATING THE VEHICLE, THE RPM AND SPEEDOMETER NEEDLES WOULD NOT OPERATE. THE CAUSE OF THE FAILURE WAS NOT DIAGNOSED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED. THE FAILURE MILEAGE WAS 85,000.",
        "vin": "5J6YH287X7L"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/03/2016",
        "dateOfIncident": "08/03/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10862831,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HONDA ELEMENT. WHILE DRIVING 20 MPH AND CHANGING GEARS, THE CLUTCH DISENGAGED. THE FAILURE WAS PERSISTENT. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE CLUTCH FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED, BUT THE FAILURE RECURRED NUMEROUS TIMES. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 112,000.",
        "vin": "5J6YH17787L"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/12/2016",
        "dateOfIncident": "02/01/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10825792,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TACHOMETER AND SPEEDOMETER NEEDLES RANDOMLY FELL OFF. I WAS JUST DRIVING DOWN THE ROAD, AND THE TACHOMETER NEEDLE FELL OFF, AND ABOUT A WEEK LATER, THE SPEEDOMETER NEEDLE DID THE SAME. I TOOK OFF THE BEZEL AND IT SEEMS THAT THE PLASTIC SHAFT THAT HOLDS THE NEEDLE IN PLACE WAS CRACKED IN SEVERAL PLACES, THAT NEGATIVELY AFFECTED ITS ABILITY TO HOLD ON TO THE METAL SHAFT IN THE CLUSTER. THIS IS NOTHING THAT WAS DONE TO THE CAR, THIS IS A MANUFACTURER'S DEFECT. THIS SHOULD BE COVERED UNDER RECALL, SINCE I CAN'T DRIVE THE CAR AND KNOW EXACTLY HOW FAST I'M GOING.",
        "vin": "5J6YH28747L"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/04/2015",
        "dateOfIncident": "11/27/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10808520,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "2007 HONDA ELEMENT ELECTRICAL DASHBOARD EQUIPMENT FAILURE. TACHOMETER GAUGE FELL OFF TACHOMETER, TEMPERATURE GAUGE IS NOT WORKING PROPERLY.  SOME OF THE DASHBOARD LIGHTS DO NOT WORK AND THE ELECTRICAL PLUG FOR THE CHARGERS DOES NOT WORK.  THIS IS A MANUFACTURERS DEFECT.",
        "vin": "5J6YH18317L"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/09/2015",
        "dateOfIncident": "09/30/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10780995,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE WILL STALL IN THE MIDDLE OF DRIVING.  HONDA HAS A RECALL FOR THE 2007 ELEMENTS WITH THIS EXACT PROBLEM,  HOWEVER THEY CLAIM THAT THIS VEHICLE IS NOT PART OF THIS RECALL.  THIS HAS HAPPENED A FEW TIMES BUT MOST RECENTLY I WAS PROVIDED MORE INFORMATION ON OCCURRENCE.",
        "vin": "5J6YH283X7L"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/17/2015",
        "dateOfIncident": "09/11/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10764686,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE INTERSTATE THE SPEEDOMETER NEEDLE, AND THE TACHOMETER NEEDLE FELL OFF OF THEIR GAUGES. IN ADDITION THE GAS GAUGE NOW NO LONGER PROPERLY REGISTERS THE AMOUNT OF FUEL IN THE TANK SO I AM LEFT TO ESTIMATE. ALL THREE POSE A SAFETY RISK TO ME AS A DRIVER INCREASING THE POSSIBILITY OF MY SPEEDING INADVERTENTLY, RUNNING OUT OF GAS IN ISOLATED LOCATIONS, OR DRIVING THE CAR AT HIGH RPM. ALL 3 ITEMS OCCURRED WITH NO OTHER UNUSUAL INCIDENT IN THE CAR, NO BUMP, NO ACCIDENT OR ANY OTHER EVENT THAT ONE WOULD EXPECT IS REQUIRED TO DISLODGE A NEEDLE FROM ITS GAUGE.",
        "vin": "5J6YH28367L"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/13/2015",
        "dateOfIncident": "11/03/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10748455,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HONDA ELEMENT. THE CONTACT STATED THAT THE TACHOMETER AND THE SPEEDOMETER FAILED. AS A RESULT, THE GAUGES PROVIDED INCORRECT READINGS. THE MANUFACTURER PROVIDED A PRODUCT UPDATE INDICATING THAT THE INSTRUMENT PANEL GAUGE NEEDLES READ INACCURATELY OR FALSE. THE VEHICLE WAS TAKEN TO THE DEALER FOR INSPECTION AND DIAGNOSIS BUT THE MANUFACTURER REFUSED TO REMEDY THE VEHICLE INDICATING THAT THE TIMEFRAME FOR THE REPAIR HAD EXPIRED. THE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": "5J6YH28787L"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/12/2015",
        "dateOfIncident": "06/11/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10748108,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HONDA ELEMENT. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, THE PASSENGER SIDE AIR BAG WARNING INDICATOR INTERMITTENTLY ILLUMINATED. THE FAILURE RECURRED ON SEVERAL OCCASIONS. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 15V320000 (AIR BAGS) AND 12V436000 (ELECTRICAL SYSTEM, TRAILER HITCHES); HOWEVER, THE PART NEEDED TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 100,000.",
        "vin": "5J6YH28707L"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/31/2015",
        "dateOfIncident": "04/22/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10745188,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "IN 2009, I WAS DRIVING MY 2007 HONDA ELEMENT WHILE MERGING ONTO A HIGHWAY. I WAS TRAVELING EAST IN THE MORNING, WHERE I NEEDED TO PUT DOWN THE DRIVER'S SIDE VISOR. IT WAS EXTREMELY STIFF AND DIFFICULT TO MOVE. I HAD NEVER NEEDED TO PUT IT DOWN BEFORE. I MOVED IT AS GENTLY AS I COULD, BUT THE MANUFACTURER MADE IT SO STIFF IT SNAPPED IN HALF. AFTER THIS INCIDENT, IT JUST HUNG DOWN. I TRIED SOME VELCRO, BUT THAT DIDN'T FIX IT. THE VISOR STILL IS IN THE DOWN POSITION. IF IT'S DOWN AGAINST THE WINDSHIELD, I OFTEN CAN'T SEE. WHEN IT'S DOWN AGAINST THE DRIVER'S WINDOW, I CAN'T SEE. THIS IS A NIGHTMARE WHEN TRYING TO SEE ANYTHING. THE ELEMENT HAS SEVERAL BLIND SPOTS AND THIS ADDS TO IT! HONDA WANTS TOO MUCH MONEY FOR A REPAIR THAT THEY SHOULD COVER UNDER A RECALL. ON A WEBSITE CALLED ELEMENTOWNERSCLUB.COM, SEVERAL PEOPLE HAVE COMPLAINED ABOUT THIS PROBLEM. WHAT IS IT GOING TO TAKE FOR HONDA TO ISSUE A RECALL, AN ACCIDENT OR WORSE?",
        "vin": "5J6YH18937L"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/29/2015",
        "dateOfIncident": "04/01/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10744800,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN WAITING TO HAVE MY AIRBAG INFLATOR REPLACED AND IT STILL HAS NOT BEEN REPLACED 4 MONTHS LATER.",
        "vin": "5J6YH183X7L"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/08/2015",
        "dateOfIncident": "07/01/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10732112,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "2007 HONDA ELEMENT.  CONSUMER WRITES IN REGARDS TO REPLACEMENT PARTS NOT AVAILABLE TO COMPLETE AIRBAG RECALL NOTICE #14V-351.  *SMD   UPDATED 09/10/15*LJ    UPDATED 11/07/2017*CN",
        "vin": "5J6YH18957L"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/25/2015",
        "dateOfIncident": "03/02/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10730414,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HONDA ELEMENT. THE CONTACT RECEIVED A NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V320000 (AIR BAGS); HOWEVER, THE PART FOR THE RECALL WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "5J6YH18747L"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/03/2015",
        "dateOfIncident": "11/15/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10723290,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HONDA ELEMENT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 14V351000 (AIR BAGS) AND 13V436000 (AIR BAGS); HOWEVER, THE PARTS WERE NOT AVAILABLE WITHIN A REASONABLE TIMEFRAME TO SCHEDULE THE RECALL REPAIRS. THE DEALER DID NOT GIVE A SPECIFIC DATE FOR WHEN THE PART WOULD BECOME AVAILABLE FOR AN EXTENDED PERIOD OF TIME. THE MANUFACTURER WAS CONTACTED AND COULD NOT PROVIDE AN ESTIMATED DATE FOR WHEN THE CONTACT'S VEHICLE WOULD RECEIVE THE RECALL REPAIR. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "5J6YH27347L"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/02/2015",
        "dateOfIncident": "05/18/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10722978,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HONDA ELEMENT. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 14V351000 (AIR BAGS) AND 13V436000 (AIR BAGS); HOWEVER, THE PART WAS NOT AVAILABLE WITHIN A REASONABLE TIMEFRAME. THE DEALER DID NOT GIVE A SPECIFIC DATE FOR WHEN THE PART WOULD BECOME AVAILABLE. THE MANUFACTURER WAS CONTACTED AND COULD NOT PROVIDE AN ESTIMATED DATE FOR WHEN THE CONTACTS VEHICLE WOULD RECEIVE THE RECALL REPAIR. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "5J6YH27347L"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/21/2015",
        "dateOfIncident": "05/10/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10717624,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE HAD TO REPLACE OUR BRAKES & ROTORS EVERY YEAR,STARTING IN YEAR 3. (I DROVE ONLY 3,000 MILES A YEAR) THEN GAVE IT TO MY HUSBAND WHO DRIVES TO WORK. WHEN THE MILES GOT UP TO 14,000 - THAT WAS THE FIRST BRAKE & ROTOR REPLACEMENT.  ASKED HONDA ABOUT THIS WHILE UNDER WARRANTY AND NO WORD ABOUT PROBLEMS, JUST THEIR ANSWER THAT IT WAS FROM A 'STREET SWEEPER' OR 'THE WAY WE DROVE.'  SEVERAL TIMES THE ROTORS WERE SO BAD, THAT THE CAR SCREECHED. 2 YEARS AGO, HAD TO HAVE THEM REPLACED TWICE IN THE SAME YEAR-IN MARCH AND AGAIN IN OCTOBER  TWICE NOW OUR CALIPERS HAD TO BE CHANGED AS WELL AS THE BRAKES & ROTORS. HAVE PUT A LOT OF $ OUT FOR ALL THESE REPAIRS. NOT HAPPY WITH HONDA OR THEIR CUSTOMER SERVICE ANYMORE.",
        "vin": "5J6YH287X7L"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/14/2015",
        "dateOfIncident": "04/14/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10705684,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "RECEIVED A NOTICE FOR AN IMPORTANT SAFETY RECALL.  WRITTEN DESCRIPTION ON RECALL NOTICE IS \"THE DEFECT IN THESE VEHICLES COULD KILL OR INJURE YOU OR OTHER PEOPLE IN YOUR VEHICLE\"  THE LAST SENTENCE OF THIS PARAGRAPH READS, \"PAST RUPTURES LIKE THIS HAVE KILLED AND INJURED VEHICLE DRIVERS.\"    ATTEMPTED TO MAKE AN APPOINTMENT ON MULTIPLE OCCASIONS AND WAS TOLD NO ONE WAS AVAILABLE IN SERVICE TO SPEAK TO ME, EVEN AFTER EXPLAINING I WAS CALLING DUE TO THE RECALL NOTICE. LEFT MY NAME AND PHONE NUMBER AS REQUESTED BUT NO RETURN CALL.    I CALLED AGAIN TODAY (4/14/2015) AND WAS TOLD I MUST WAIT UNTIL THE END OF JUNE TO HAVE THIS \"DEFECT THAT HAS KILLED AND INJURED OTHERS\" REPAIRED.  *TR",
        "vin": "5J6YH187X7L"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/04/2015",
        "dateOfIncident": "02/02/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10681274,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "SPEEDOMETER IS NOT WORKING PROPERLY, READS LOW BY AT LEAST 20 MPH.  *TR",
        "vin": "5J6YH189X7L"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/27/2015",
        "dateOfIncident": "01/23/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10679252,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I FIRST HEARD A METALLIC RUMBLING SOUND, THE STEERING FELT UNEVEN. AFTER ONE LOUDER \"CLUNK\" THE POWER STEERING WENT OUT AND I HAD TO USE ALL MY STRENGTH TO CONTROL THE CAR IN A LOW-SPEED TURN.  IF MY WIFE HAD BEEN DRIVING, SHE WOULD HAVE GONE INTO THE DITCH. WHEN I OPENED THE HOOD I SAW THAT THE PULLEY FOR THE POWER STEERING (WHICH I LATER LEARNED ALSO CONTROLLED THE WATER PUMP AND THE ALTERNATOR) HAD COME COMPLETELY OFF AND WAS LYING IN THE ENGINE COMPARTMENT. THE BELT THAT SHOULD HAVE BEEN ATTACHED TO IT WAS ALSO SITTING THERE, UNATTACHED.  *TR",
        "vin": "5J6YH183X7L"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/22/2015",
        "dateOfIncident": "01/07/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10678362,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN A GRAVEL ROAD AND THE GAUGE NEEDLES ON BOTH THE SPEEDOMETER AND TACHOMETER FELL OFF.  WE WERE USING THE VEHICLE IN ACCORDANCE WITH HOW IT WAS DESIGNED TO BE USED.  WE WERE FORCED TO FINISH OUR TRIP WITHOUT KNOWING OUR SPEED OR RPMS (A MAJOR SAFETY HAZARD).  THE HONDA DEALER SAYS THE ENTIRE INSTRUMENT CLUSTER MUST BE REPLACED IN ORDER FOR THE GAUGES TO DISPLAY ACCURATE INFORMATION AGAIN.  THIS IS OBVIOUSLY A MAJOR DESIGN FLAW BY HONDA WHICH HAS SERIOUS SAFETY CONCERNS.  *TR",
        "vin": "5J6YH28717L"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/14/2015",
        "dateOfIncident": "12/04/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10672392,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WE PURCHASED OUR ELEMENT IN 2011. IN 09/13, WHILE DRIVING THIS VEHICLE, WE HIT A SLIGHT BUMP IN THE ROAD AND ALL OF THE GAUGES POPPED OFF OF THE INSTRUMENT CLUSTER. WE TOOK THE VEHICLE INTO THE LOCAL HONDA DEALER WHO GAVE US A BID OF $1,000.00 TO REPLACE THE INSTRUMENT CLUSTER. WE CHOOSE INSTEAD TO REPAIR THE CLUSTER. SINCE THE REPAIR, NONE OF THE GAUGES ON THE INSTRUMENT CLUSTER HAVE READ APPROPRIATELY. AT THAT TIME, NO MENTION WAS MADE THAT THIS WAS AN ISSUE WITH THIS PARTICULAR VEHICLE AND YEAR.  APPROX. ONE YEAR LATER IN 11/14, THE GAUGES ON THE INSTRUMENT CLUSTER AGAIN POPPED OFF WHILE PULLING INTO A PARKING LOT.  MY HUSBAND DID SOME RESEARCH AND WE LEARNED THAT IN 2008, HONDA DID A SAFETY RECALL REGARDING THE 2007 ELEMENT AND THE INSTRUMENT CLUSTER. APPARENTLY, HONDA IS WAS VERY MUCH AWARE THAT THIS WAS AN ISSUE AND THAT THERE WERE PROBLEMS WITH THE DESIGN. HONDA PURPOSELY CHOOSE TO DO A SAFETY RECALL SO THAT THEY WOULD NOT HAVE TO BE LIABLE AFTER 2010.  WE CONTACTED AMERICAN HONDA IN DECEMBER AND A REPRESENTATIVE ADMITTED THAT THERE WAS A PRODUCT UPDATE ON THIS PARTICULAR VEHICLE AND A SAFETY RECALL BACK IN 2008; HOWEVER, THIS RECALL HAD EXPIRED. I FILED A COMPLAINT AND WAS SENT TO CONSUMER PRODUCTS. A REPRESENTATIVE TOOK OUR INFORMATION AND AGREED TO RESEARCH OUR ISSUE. WE ALSO CONTACTED THE LOCAL HONDA DEALER, REGARDING THIS ISSUE AND ALTHOUGH THEY WERE UNDERSTANDING, THERE WAS NOTHING THAT THEY COULD DO TO HELP US. ONE WEEK LATER, AMERICAN HONDA CONTACTED US AND TOLD US THAT THEY BEST THEY COULD DO WAS TO HONOR THE BID OF $1,000.00 AND THAT THIS WAS A DEAL SINCE THE COST NOW TO FIX THE PROBLEM WAS $1,300.00. WE FEEL THAT THIS IS A SAFETY ISSUE AND THAT HONDA SHOULD BE FORCED TO TAKE RESPONSIBILITY AND REPAIR THIS DEFECTIVE PART. WE HAVE LEARNED THAT THERE ARE NUMEROUS COMPLAINTS, COMMENTS AND CONCERNS ON THE INTERNET REGARDING THIS SAME ISSUE.   *TR",
        "vin": "5J6YH27717L"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/04/2014",
        "dateOfIncident": "04/01/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10662213,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HONDA ELEMENT. THE CONTACT STATED THAT THE FUEL GAUGE FAILED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE.  THE FAILURE MILEAGE WAS 146,000.",
        "vin": "5J6YH18797L"
    },
    {
        "components": "AIR BAGS,ENGINE",
        "crash": true,
        "dateComplaintFiled": "11/21/2014",
        "dateOfIncident": "11/10/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10659949,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER AIRBAG DEPLOYED IN ELEMENT WHEN IT HIT REAR END OF VEHICLE THAT WAS STOPPED IN LANE OF TRAFFIC DUE TO HAVING REAR ENDED VEHICLE IN FROM OF IT. ELEMENT DRIVER SUFFERED NEAR 3RD DEGREE CHEMICAL BURNS & CUT ON RIGHT WRIST, BURN ON LEFT THUMB JOINT, BRUISE & CUT UNDER LEFT RIBCAGE. 2 WEEKS LATER STILL TREATING DOLLAR SIZE CHEMICAL BURN & SKIN PEELING ON RIGHT WRIST. DARK GREEN SUBSTANCE WAS ON RIGHT WRIST ORIGINAL BLISTERING & SKIN PEELED AREA, TOOK SEVERAL DAYS TO REMOVE IT COMPLETELY. MEDICAL CARE WAS REQUIRED.  *TR",
        "vin": "5J6YH28717L"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/21/2014",
        "dateOfIncident": "01/11/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10649042,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE SHUTTERS BETWEEN THE SPEEDS OF 20MPH TO 40MPH.  FEELS LIKE ITS THE TRANSMISSION.  WHEN ACCELERATING, THE VEHICLE STARTS TO SHUTTER AT SPEEDS INDICATED.  I HAVE TAKEN THIS TO DEALER AND THEY CAN'T DUPLICATE.  *TR",
        "vin": "5J6YH187X7L"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/06/2014",
        "dateOfIncident": "09/05/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10640984,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "2007 HONDA ELEMENT. CONSUMER WRITES IN REGARDS TO THE INSTRUMENT CLUSTER. *TGW  THE CONSUMER STATED AS SHE WAS BACKING OUT OF THE DRIVEWAY THE RPM IN THE INSTRUMENT CLUSTER FELL OUT.  THE NEXT DAY, AS SHE PULLED OUT OF THE DRIVEWAY, THE TEMPERATURE AND SPEED NEEDLES FELL OUT. THE CONSUMER WENT TO GET GAS, AND AFTER FILLING THE TANK, THE GAUGE ONLY SHOWED 1/2 TANK. THE CONSUMER BELIEVED THE GAS NEEDED WOULD EVENTUALLY FALL OUT, TOO.  *JB",
        "vin": "5J6YH18757L"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "08/31/2014",
        "dateOfIncident": "08/30/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10629656,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR NO REASON AT ALL THE DRIVER SIDE WINDOW JUST FELL TO THE BOTTOM OF THE DRIVER SIDE DOOR HOUSING.   *TR",
        "vin": "5J6YH28797L"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/07/2014",
        "dateOfIncident": "07/01/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10608737,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY ELEMENT DOWN A BACK ROAD IN INDIANAPOLIS WHEN AFTER HITTING A POTHOLE I NOTICED 4 BRIGHT LIGHTS SHINING DIRECTLY AT ME. ALL THE NEEDLES IN MY DASH FELL RIGHT OUT AND ARE CURRENTLY NESTLED IN PLAIN VIEW BEHIND THE CLEAR PLASTIC FACE.    *JS",
        "vin": "5J6YH18357L"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/16/2014",
        "dateOfIncident": "05/11/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10598575,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE WAS PURCHASED NEW IN 2007, SINCE THEN WE HAVE HAD TO REPLACE THE BRAKES EVERY YEAR.   WE HAD THE VSA MODULATOR RECALL REPAIRS DONE IN APRIL 2010 AND THE SOFT BRAKE, EXCESSIVE BRAKE WEAR CONTINUES.   THE BRAKES MAKE NOISE, ARE SOFT, AND HAVE TO BE APPLIED HEAVILY TO STOP THE VEHICLE.   I HAVE HAD REPAIRS DONE BY THE DEALER THE FIRST FIVE YEARS WITH NO EXPLANATIONS TO MY COMPLAINTS OF EXCESSIVE FAILURE.   WE CONTINUE TO HAVE TO HAVE THE BRAKES RE-DONE EVERY YEAR. EACH TIME SHORTLY AFTER HAVING THEM RE-DONE THEY BEGIN TO QUICKLY DEGRADE AND DO NOT STOP THE VEHICLE PROPERLY.  *TR",
        "vin": "5J6YH27397L"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/13/2014",
        "dateOfIncident": "05/01/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10588062,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "ALL NEEDLES ON THE DASH FELL OFF, EXCEPT THE FUEL INDICATOR (FOR NOW).  DRIVING CAR WITHOUT KNOWING MY SPEED, ENGINE TEMP, OR RPM, LET ALONE THERE ARE BRIGHT LIGHTS SHINING IN MY EYES DRIVING AT NIGHT INHIBITING MY VISION.  I AM JUST FINDING OUT HONDA WAS FIXING THIS ISSUE FOR FREE, AS THEY SHOULD, BUT STOPPED AS OF DECEMEBER 2010.    NOW I AM RESPONSIBLE TO REPLACE THIS KNOWN DEFECT, AND CAN BE CHARGED AROUND $900FROM WHAT I'VE BEEN READING.  IS THIS EVEN LEGAL?????    HOW CAN HONDA HAVE A KNOWN DEFECT, A SAFETY ISSUE AT THAT, AND NOT BE REQUIRED TO FIX THEIR PROBLEM??    IF THERE IS A LAWSUIT I WOULD LIKE TO BE INCLUDED, OR NEED TO KNOW HOW TO MAKE THEM PAY FOR THIS REPLACEMENT.   *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/13/2014",
        "dateOfIncident": "05/13/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10588117,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TOOK VEHICLE INTO HONDA SERVICE DEPT. AS NEEDLES HAD FALLEN OFF OF TACHOMETER AND HEAT INDICATOR AND SPEEDOMETER WAS NOT READING CORRECTLY. SERVICE TECH TOOK CAR FOR DRIVE TO TEST BRAKES FOR A RECALL ISSUE AND HIT THE DASHBOARD WHEN TOLD OF NEEDLE ISSUE.  REST OF NEEDLES FELL OFF SO NOW I HAVE NO IDEA OF SPEED OR GAS AND THE LIGHTS SHINE DIRECTLY IN DRIVERS FACE WHEN DRIVING AT NIGHT WHICH MAKES IT VERY DIFFICULT TO SEE. HONDA SAYS THERE WAS AN UPDATE (WHICH HAS EXPIRED) AND IT WILL COST ME $1,000. TO FIX THE GAUGE ISSUE. I FIND IT HARD TO BELIEVE THAT THIS IS NOT A SAFETY RECALL AND MERELY AN 'UPDATE'!  THIS ISSUE NEEDS TO BE ADDRESSED BY HONDA AS THIS IS NOT A MAINTENANCE ISSUE BUT A MANUFACTURING DEFECT.   CHECKING ONLINE HAS REVEALED THIS IS A COMMON OCCURRENCE FOR THIS PARTICULAR MODEL.  *TR",
        "vin": "5J6YH27397L"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/07/2014",
        "dateOfIncident": "02/05/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10563414,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING AND HIT A MEDIUM SIZED POTHOLE. ALL INSTRUMENT PANEL INDICATOR NEEDLES FELL OFF OF GAUGES.  A BLINDING LIGHT COMES FROM THE VOIDS BEHIND WHERE THE NEEDLES SHOULD BE. I AM UNABLE TO SAFELY DRIVE THE VEHICLE, ESPECIALLY AT NIGHT. IT IS IMPOSSIBLE TO READ SPEED, TEMPERATURE, FUEL LEVEL AND RPMS. HONDA WILL NOT HONOR REPAIRS UNDER WARRANTY AND THOUGH IT IS A COMMON KNOWN ISSUE, IT HAS NOT BEEN CLASSIFIED AS A SAFETY RECALL.    I FEEL THAT VEHICLES WITH THIS ISSUE ARE EXTREMELY UNSAFE AND THAT THEY SHOULD BE RECALLED.    THANK YOU.  *TR",
        "vin": "5J6YH273X7L"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "12/07/2012",
        "dateOfIncident": "06/01/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10487675,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SIDE SUN VISOR FALLS DOWN WHILE DRIVING, BLOCKING VIEW OF ROAD.  *TR",
        "vin": "5J6YH287X7L"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/31/2012",
        "dateOfIncident": "01/01/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10482726,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HONDA ELEMENT. THE CONTACT STATED THAT THE VEHICLE JERKED AND LUNGED FORWARD AFTER THE BRAKE PEDAL WAS APPLIED. THE VEHICLE WAS NOT TAKEN TO THE DEALER TO HAVE A DIAGNOSTIC PERFORMED. THE MANUFACTURER WAS NOT MADE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 70,000 AND THE CURRENT MILEAGE WAS 88,708.",
        "vin": "5J6YH18967L"
    },
    {
        "components": "AIR BAGS,STRUCTURE,ENGINE",
        "crash": true,
        "dateComplaintFiled": "08/23/2012",
        "dateOfIncident": "08/22/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10472093,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS INVOLVED IN A CAR ACCIDENT ON 8/22/12. I WAS DRIVING A 2007 HONDA ELEMENT AWD AT 55MPH. AN ACCIDENT HAPPENED IN FRONT OF ME WHICH RESULTED IN ME HITTING A TRUCK AND A VAN HITTING ME. THE AIRBAGS NEVER DEPLOYED... NOT ONE! I AM UPSET THAT I BOUGHT THIS CAR BECAUSE OF THE SAFETY MEASURES AND WHEN I NEEDED THEM, NOTHING HAPPENED. BOTH THE DRIVER AND PASSENGER SUFFERED VERY SORE NECKS, SHOULDERS AND BACKS! I WANT A INVESTIGATION DONE ON MY VEHICLE TO SEE WHY THE AIRBAGS NEVER DEPLOYED!!! THANKFULLY NOBODY WAS KILLED DUE TO SOME MALFUNCTIONING AIRBAGS.  *TR",
        "vin": "5J6YH28777L"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/14/2012",
        "dateOfIncident": "05/31/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10470537,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HONDA ELEMENT HAS A RECALL FOR A SOFT, SPONGY BRAKE PEDAL THAT HAS TO BE PUSHED TO THE FLOOR TO GET THE BRAKES TO ENGAGE.  THERE IS A RECALL FOR THIS SYMPTOM, RELATED TO THE VEHICLE STABILITY ASSIST MODULE.  THE RECALL WORK WAS DONE, AND THE PEDAL FEEL IMPROVED, BUT AFTER TIME, THE ISSUE RETURNS.  MY BRAKES ARE SOFT AND SPONGY AND I GET NO BRAKES UNLESS THE PEDAL GOES MOST OF THE WAY TO THE FLOOR. IT FEELS AS IF THE CAR IS NOT GOING TO STOP EACH TIME I BRAKE.  *TR",
        "vin": "5J6YH18947L"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/10/2012",
        "dateOfIncident": "08/09/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10470085,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HONDA ELEMENT. THE CONTACT STATED THAT THE IGNITION FAILED. THE CONTACT STATED THAT SHE TRIED TO START THE ENGINE BUT NOTHING WOULD HAPPEN. THE VEHICLE WAS NOT TAKEN TO A DEALER FOR INSPECTION. THE DEALER AND MANUFACTURER WAS NOT NOTIFIED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 80,000.",
        "vin": "5J6YH18347L"
    },
    {
        "components": "SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/03/2012",
        "dateOfIncident": "07/31/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10464090,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY 2007 HONDA ELEMENT \"CS\",  JUST AFTER ENTERING A FREEWAY SOUTHBOUND, WHILE GETTING UP TO FREEWAY SPEED, A LOUD NOISE BEGAN TO COME FROM REAR OF VEHICLE AS IF A TIRE OR TIRES WERE COMING LOOSE.  ONCE HITTING 55MPH THE VEHICLE BEGAN TO SHAKE SOMEWHAT, YET STILL CONTROLLABLE.  I PULLED OVER & INSPECTED THE TIRES & WHEELS AND COULD NOT FIND ANYTHING WRONG. CONTINUED INTO NEXT CITY TO DEALERSHIP WHERE A FOUR WHEEL ALIGNMENT WAS DONE & ALL TIRES ROTATED.    NOW WHILE ON CROSS COUNTRY TRIP ON 20 MAY 2012, THIS SAME ISSUE HAS OCCURRED ONCE AGAIN ON A SET OF NEW TIRES.  THE CAMBERS CANNOT BE ADJUSTED ON THIS MODEL & YEAR VEHICLE. HONDA HAS MADE NO EFFORT TO REMEDY THIS PROBLEM.  IT WAS CORRECTED IN THE 2008 MODELS & SUBSEQUENT MODELS.     THE TIRES WEAR UNEVENLY & \"CUP\" & COULD CAUSE THE TIRES TO BLOW, EITHER AT THE SAME TIME, ONE AT A TIME OR EVEN JUST ONE LEAVING DRIVER IN A POSITION OF BEING UNABLE TO CONTROL CAR FROM RAPID DEFLATION OF EXPLODING TIRE.    I HAVE SPOKEN WITH THE SERVICE WRITER AT THE DEALERSHIP WHERE I PURCHASED MY ELEMENT CS & HE TOLD ME HONDA IS FULLY AWARE OF THIS.  I SPOKE WITH HONDA AMERICA & WAS TOLD THEY ARE FULLY AWARE OF THIS & THEY DID NOT THINK \"... THIS IS A LIFE THREATENING ISSUE.\"  THIS ISSUE IS WITH THE HONDA ELEMENT CS ONLY THAT I AM AWARE OF.    *JS",
        "vin": "5J6YH1897L0"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/28/2012",
        "dateOfIncident": "08/11/2011",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10456754,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TACHOMETER INDICATOR NEEDLE FELL OFF.  *TR",
        "vin": "5J6YH28707L"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/04/2012",
        "dateOfIncident": "04/04/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10454046,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES \"REPAIRED\" IN '11 AT DEALER AFTER '07 ELEMENT BRAKE RECALL.  NO NOTICEABLE DIFFERENCE IN BRAKE SOFTNESS, BRAKES ARE STILL SOFT AND REQUIRE A LOT OF MUSCLE TO STOP THE CAR.  SCARED, AND REFUSE TO DRIVE '07 ELEMENT WITH MY CHILDREN IN THE CAR FOR FEAR OF NOT BEING ABLE TO STOP ON TIME.  OWN A 2011 ACCORD, AFTER DRIVING THE '07 ELEMENT FOR A DAY OR TWO, I AM \"SLAMMING\" ON THE BRAKES OF THE ACCORD DUE TO HABIT OF HAVING TO \"FLOOR/MASH\" THE BRAKES TO STOP AT A STOP SIGN.  THANK GOODNESS FOR GOOD ACCORD SEAT BELTS.  :)  PLEASE FIX THIS ISSUE.  MANY TEENAGERS WILL BE RECEIVING THIS CAR AS FIRST TIME DRIVING CAR.  VERY DANGEROUS.  NOT SAFE WITH CURRENT CORPORATE APPROVED FIX.  *TR",
        "vin": "5J6YH28797L"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/03/2011",
        "dateOfIncident": "12/03/2011",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10438458,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE INCIDENT INVOLVES THE INSTRUMENT PANEL OF THE 2007 HONDA ELEMENT. THE PROBLEM IS COMPLETE FAILURE OF THE INSTRUMENT PANEL WHILE DRIVING, LOSING ALL FUNCTIONING OF THE INSTRUMENT PANEL GAUGES, INCLUDING SPEEDOMETER, FUEL, ENGINE TEMPERATURE, AND RPM, WITH ONE OF THE GAUGES COMPLETELY POPPING OUT AND THE OTHER PINS ON THE GAUGES DROPPING DOWN BELOW 0 AND NOT FUNCTIONING.  *TR",
        "vin": "5J6YH18317L"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,AIR BAGS,SEATS",
        "crash": false,
        "dateComplaintFiled": "11/17/2011",
        "dateOfIncident": "03/25/2008",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10435934,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "2007 HONDA ELEMENT. CONSUMER STATES SEVERAL PROBLEMS WITH VEHICLE TO INCLUDE TRANSMISSION FAILURE *TGW  THE CONSUMER STATED THE TRANSMISSION FIRST FAILED AT 15,000.  THE DEFECT THE DEALER APPARENTLY REPAIRED BETWEEN MARCH 22-26 AND APRIL 2008 HAS RETURNED. RECENTLY, THE VEHICLE STARTED TO SHUDDER ONCE MORE UNDER LIGHT ACCELERATION BETWEEN 30-35 MPH.   THE CONSUMER ALSO STATED THERE WAS A PERSISTENT CLICKING SOUND COMING FROM THE FRONT PASSENGER SEAT. IN ADDITION, A MALFUNCTIONING RADIO CONSOLE WAS REPLACED.  THE PROBLEM RETURNED WITH THE FRONT PASSENGER SEAT.  THE SRS LIGHT ILLUMINATED ON AN INTERMITTENT BASIS AND WHEN IT DID ILLUMINATE, IT STAYED ON FOR EXTENDED PERIODS OF TIME. *JB",
        "vin": "5J6YH28747L"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/15/2011",
        "dateOfIncident": "10/15/2011",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10430325,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TRAVELING APPROXIMATELY 20 MPH, BRAKES WERE NOT APPLIED BEFORE INCIDENT, AND THE DRIVER AND PASSENGER SIDE CURTAIN AIRBAGS AND THE DRIVER SEAT AIR BAG DEPLOYED.  WHEN THE AIRBAGS DEPLOYED I ATTEMPTED TO APPLY THE BRAKES AND THEY WERE NOT FUNCTIONING FOR APPROXIMATELY 1/2 MILES OF TRAVEL.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/22/2011",
        "dateOfIncident": "09/20/2011",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10426786,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HONDA ELEMENT. THE CONTACT STATED THAT THE SPEEDOMETER WAS MALFUNCTIONING AND DISPLAYED AN INACCURATE READING . THE VEHICLE WAS TAKEN TO THE DEALER WHO STATED THAT THE INSTRUMENT CLUSTER NEEDED TO BE REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE BUT DID NOT OFFER ANY ASSISTANCE SINCE IT WAS BEYOND THE STATUTE OF LIMITATIONS FOR A MANUFACTURERS RECALL. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGE WAS 105,000.",
        "vin": "5J6YH17747L"
    },
    {
        "components": "SERVICE BRAKES, AIR",
        "crash": false,
        "dateComplaintFiled": "08/16/2011",
        "dateOfIncident": "08/03/2011",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10419648,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HONDA ELEMENT. THE CONTACT STATED THAT THE VEHICLE WAS REPAIRED UNDER THE RECALL ASSOCIATED WITH NHTSA CAMPAIGN ID NUMBER 10V098000 (SERVICES BRAKES, AIR). AFTER THE REPAIRS, THE MALFUNCTION INDICATOR LIGHT AND THE CHECK ENGINE LIGHT BEGAN TO ILLUMINATE ON THE INSTRUMENT PANEL. THE VEHICLE WAS TAKEN BACK TO THE DEALER AND THE ERROR CODES WERE REMOVED FROM THE SYSTEM. THE DEALER STATED THAT THE VEHICLE WAS NOT EXPERIENCING ANY OTHER FAILURES. THE WARNING LIGHTS CONTINUED TO ILLUMINATE. THE CONTACT FELT THAT THE RECALL REPAIRS WERE RESPONSIBLE FOR THE SUBSEQUENT FAILURES. THE FAILURE MILEAGE WAS 58,000 AND THE CURRENT MILEAGE WAS 58,380.",
        "vin": "5J6YH18907L"
    },
    {
        "components": "SERVICE BRAKES, AIR",
        "crash": false,
        "dateComplaintFiled": "06/07/2011",
        "dateOfIncident": "01/10/2007",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10405495,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HONDA ELEMENT. WHILE DRIVING APPROXIMATELY 5 MPH AND DEPRESSING THE BRAKES, THE VEHICLE WOULD NOT STOP. THE CONTACT STATED THAT EXTREME PRESSURE HAD TO BE APPLIED TO THE BRAKE PEDAL IN ORDER FOR THE VEHICLE TO STOP. THERE WAS A RECALL UNDER NHTSA CAMPAIGN ID NUMBER: 10V098000 (SERVICE BRAKES, AIR) IN WHICH THE VEHICLE WAS PREVIOUSLY REPAIRED. APPROXIMATELY TWO WEEKS AFTER THE REPAIRS WERE PERFORMED, THE FAILURE RECURRED. THE VEHICLE WAS TAKEN TO THE DEALER BUT THE TECHNICIAN WAS UNABLE TO DIAGNOSE THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 500.",
        "vin": "5J6YH28757L"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/15/2011",
        "dateOfIncident": "01/02/2011",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10400914,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MY HONDA ELEMENT HAS A VIOLET SHUDDERING WHICH OCCURS ONLY DURING LIGHT ACCELERATION AT 30 TO 40 MPH. THE SHUDDERING STOPS ONCE I LET OFF THE GAS PEDAL. IF I ACCELERATE NORMALLY OR MORE AGGRESSIVELY, THERE IS NO SHUDDER. *TR",
        "vin": "5J6YH189X7L"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/15/2011",
        "dateOfIncident": "04/14/2011",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10395977,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HONDA ELEMENT. WHILE DRIVING APPROXIMATELY 20 MPH, THE CONTACT APPLIED THE BRAKES AND BOTH THE FRONT AND REAR DRIVER SIDE AIR BAGS DEPLOYED INDEPENDENTLY. THE VEHICLE WAS NOT TAKEN TO HAVE THE FAILURE DIAGNOSED AND WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGE WAS 50,000.",
        "vin": "5J6YH18757L"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/17/2011",
        "dateOfIncident": "03/16/2011",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10390482,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "HIT A SPEED BUMP AND THE GAGE NEEDLES FELL OFF THE TECH AND SPEEDOMETER. NOW THERE IS A GLARING LIGHT WHERE THE NEEDLES USE TO BE MAKING IT VERY HARD TO SEE. ESPECIALLY AT NIGHT. HONDA ADMITS THERE IS A DEFECT BUT WILL NOT FIX UNLESS I PAY FOR EVERYTHING.  *TR",
        "vin": "5J6YH28727L"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/04/2011",
        "dateOfIncident": "09/01/2008",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10374689,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS COMPLAINT IS ABOUT MY 2007 HONDA ELEMENT EX.  IN 2008 I STARTED EXPERIENCING VERY SOFT BRAKES, AND COMPLAINED TO THE DEALER.  THE DEALER PROCEEDED TO REPLACE THE VSA MODULATOR TWICE, AND BLEED THE BRAKES OVER 12 TIMES AND IT CAME BACK WORSE THAN WHEN I TOOK IT IN.  TOOK IT TO ANOTHER DEALER WHO REPLACED THE MODULATOR AGAIN, BLED BRAKES, FELT BETTER TEMPORARILY BUT THE ISSUE RETURNED.  HONDA FINALLY ISSUED A RECALL FOR THE SOFT BRAKE PEDAL ISSUE THAT INVOLVED SIMPLY GLUING CAPS OVER VENTS ON THE VSA MODULATOR (NOT REDESIGNING A CRITICAL PART OF THE VEHICLE'S SAFETY SYSTEM MIND YOU).  I HAD THE RECALL PERFORMED AND MY BRAKES HAVE AGAIN BECOME SOFT (SOMETIME DANGEROUSLY SOFT).  THIS WAS ALL WHILE MY CAR WAS UNDER WARRANTY.  MY CAR IS NOW NO LONGER UNDER WARRANTY AND HONDA OF NORTH AMERICA DOESN'T SEEM TO HAVE AN ISSUE WITH THE FACT THEIR \"FIX\" DIDN'T FIX ANYTHING.  I'VE GOT A BABY ON THE WAY AND DON'T FEEL SAFE HAVING MY WIFE DRIVE MY CAR.  THIS IS A SERIOUS ISSUE THAT HONDA ISN'T TAKING SERIOUSLY, ESPECIALLY IN LIGHT OF OTHER COMPANIES RECENT QUALITY CONTROL ISSUES AND RECALLS.  *TR",
        "vin": "5J6YH28717L"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/28/2010",
        "dateOfIncident": "05/07/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10332630,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "HONDA'S RECALL SERVICE FOR SOFT BRAKES WAS NOT PERFORMED PROPERLY BY THE HONDA DEALER. STEPS 13 AND 14 ON SERVICE BULLETIN, PERTAINING TO INSTALLATION OF THE CAPS WHERE THE AIR INTRUSION IS BELIEVED TO COME FROM CALLS FOR A CONTINUOUS BEAD OF WHITE SILICONE TO BE SPREAD AROUND THE OUTSIDE OF REPLACEMENT CAPS USING A SPECIAL TOOL. THE WHITE SILICONE SHOULD BE VISIBLE AROUND BOTH CAPS ON THE MODULATOR. ACCORDING TO THE SERVICE MANAGER AND TECH THEY PUT JUST ENOUGH SILICONE TO AFFIX THE CAP AND DIDN'T SEE A NEED FOR ANY MORE. I CAN ONLY ASSUME THE OTHER STEPS IN THE SERVICE BULLETIN WERE PERFORMED BUT AM NOT CONFIDENT TO WHAT EXTENT. THE BRAKE FLUID WAS LEFT LOW SO IT WAS EVIDENT AT LEAST SOME BLEEDING OF THE BRAKES WAS PERFORMED. THE POWER STEERING RESERVOIR WAS REMOVED TO ACCESS THE MODULATOR AND HAD ONLY A SMALL AMOUNT OF FLUID LEFT IN THE RESERVOIR WHEN THE VEHICLE WAS RETURNED TO ME. I HAVE MADE A REQUEST TO HONDA AMERICA TO ADDRESS MY CONCERNS. *TR",
        "vin": "5J6YH18967L"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/29/2010",
        "dateOfIncident": "09/17/2006",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10328128,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HONDA ELEMENT. WHILE DRIVING AT VARIOUS  SPEEDS, THE CONTACT NOTICED THE BRAKE PEDAL WOULD FALL INTO THE FLOORBOARD INTERMITTENTLY. THE DEALER MADE UNKNOWN REPAIRS TO THE VEHICLE YET THE FAILURE PERSISTED. THE CONTACT STATED THE VEHICLE HAD BEEN TO THE DEALER SEVERAL TIMES IN AN ATTEMPT TO CORRECT THE FAILURE TO NO AVAIL. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 900 AND THE CURRENT MILEAGE WAS 16,900.",
        "vin": ""
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "04/03/2010",
        "dateOfIncident": "04/03/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10323589,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "2007 HONDA ELEMENT MUSHY BRAKES.   DURING TEST DRIVING OF THE VEHICLE TO CURRENT DAILY DRIVING, BRAKES HAVE BEEN AND STILL ARE MUSHY WITH ONE INCIDENT OF FULLY DEPRESSING TO THE FLOOR FOR VEHICLE TO STOP.  AS OF CURRENT THERE HAVE BEEN 4 MISHAPS WHERE SUDDEN STOPS WERE REQUIRED AND VEHICLE BRAKES FAILED TO OPERATE PROPERLY RESULTING IN NEAR MISS OCCURRENCES. HAD THERE NOT BEEN PROPER TIME AND DISTANCE BETWEEN VEHICLES A CRASH OR FATALITY COULD HAVE BEEN IMMINENT.  VEHICLE WAS PURCHASED PRE-OWNED HONDA CERTIFIED UNDER WARRANTY AND SEVERAL COMPLAINTS FILED AT LOCAL DEALERSHIPS WITH NO REPAIRS OR CORRECTIONS MADE.  VEHICLE IN MY OPINION IS DEEMED UNSAFE AND SITS IN OUR DRIVEWAY ONLY TO BE DRIVEN SHORT DISTANCES.  EXAMPLE 2007 ELEMENT, CURRENT ODOMETER READING 15K.",
        "vin": "5J6YH28717L"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,SERVICE BRAKES, AIR,SERVICE BRAKES, ELECTRIC",
        "crash": false,
        "dateComplaintFiled": "04/01/2010",
        "dateOfIncident": "03/31/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10323326,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "PREMATURE FAILURE OF REAR PASSENGER DISC BRAKE AT 22000 MILES. LOUD GRINDING NOISE NOTICED COMING FROM REAR PASSENGER WHEEL. BROUGHT TO DEALER IMMEDIATELY. REAR PASSENGER ROTOR AND BOTH REAR PADS NEEDED TO BE REPLACED, FRONT BRAKES FINE UPON INSPECTION. AFTER ARGUING WITH THE SERVICE DEPARTMENT GOT THE REPAIR BILL DOWN FROM $505 TO $65. UPON FURTHER RESEARCH, I FEEL THAT THE DEALER JUST TREATED THE SYMPTOM AND NOT THE CAUSE OF THE PROBLEM AND THIS IS LIKELY TO OCCUR AGAIN. NOT SURE IF THIS IS RELATED TO THE RECENT BRAKING RECALL FOR HONDA ELEMENTS AND ODDYSSEYS OR NOT, BUT JUST WANTED TO MAKE A RECORD OF MY EXPERIENCE FOR THOSE WHO MAY HAVE HAD TO COVER THE FULL COST OF THEIR REPAIR.",
        "vin": "5J6YH173X7L"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/24/2010",
        "dateOfIncident": "03/24/2007",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10321769,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TRAVEL WEST ON VA ROUTE 50 @ SPEED OF 55 MPH, ATTEMPTING TO SLOW DOWN FOR TRAFFIC LIGHT.  APPLIED BRAKES, THEY DID NOT SLOW DOWN CAR.  SLAMMED BRAKE PEDAL TO FLOOR, CAR SKIDDED TO STOP JUST SHY OF HITTING CAR IN FRONT OF ME.",
        "vin": "5J6YH28787L"
    },
    {
        "components": "SEAT BELTS,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/19/2010",
        "dateOfIncident": "12/15/2006",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10321061,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 HONDA ELEMENT. THE CONTACT OBSERVED WHEN THE VEHICLE WAS PARKED, THE REAR PASSENGER DOOR FAILED TO REMAIN CLOSED IN A SECURE POSITION. ADDITIONALLY, WHENEVER THE FRONT SEAT BELT SYSTEM WAS IN USE THE SEAT BELT MECHANISM UNLATCHED WITHOUT ASSISTANCE. THE VIN WAS NOT AVAILABLE. THE FAILURE AND CURRENT MILEAGES WERE UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/24/2010",
        "dateOfIncident": "11/15/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10313882,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SIDE REAR BRAKE PREMATURE FAILURE / WEAR.  WAS DRIVING AND HEARD TERRIBLE NOISE FROM REAR OF VEHICLE.  SMOKE COMING FROM REAR BRAKE ON DRIVER SIDE. PAD HAD WORN COMPLETELY THROUGH ONLY AFTER 27,000MI.  PASS. SIDE REAR BRAKE WAS OK WHEN INSPECTED.  APPEARS REAR DRIVER SIDE CALIPER FROZE CAUSING UNEVEN WEAR. *TR",
        "vin": "5J6YH277X7L"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/11/2009",
        "dateOfIncident": "06/03/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10276402,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES ARE SPONGY ON 2007 HONDA ELEMENT.  BRAKE PEDAL TRAVEL HAS INCREASED, ESPECIALLY ON HARD BRAKING.  THIS HAS DEVELOPED MOSTLY IN THE LAST COUPLE OF MONTHS.  NO ACCIDENTS, BUT A COUPLE OF CLOSE CALLS BECAUSE THE CAR DOES NOT STOP AS QUICKLY AS IT SHOULD. *TR",
        "vin": "5J6YH27777L"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "07/06/2009",
        "dateOfIncident": "07/04/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10275842,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 HONDA ELEMENT.  WHEN THE CONTACT STARTED THE IGNITION, THE AUTOMATIC AIR CIRCULATION FAN ACTIVATED.  SUDDENLY, THE REAR TAILGATE WINDOW GLASS SHATTERED INTO PIECES.  THERE WERE NO PRIOR WARNINGS OR INJURIES.  THE INSURANCE COMPANY WAS NOTIFIED.  THE VEHICLE IS IN THE PROCESS OF BEING REPAIRED.  THE VIN WAS UNABLE TO BE ENTERED INTO THE SYSTEM.  THE FAILURE AND CURRENT MILEAGES WERE 18,000.",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "04/21/2009",
        "dateOfIncident": "04/19/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10266194,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "10 INCH LONG CRACK APPEARED IN WINDSHIELD FROM RIGHT SIDE.  NOTHING HIT THE GLASS AND THERE ARE NO CHIPS.  HONDA REFUSES TO REPLACE IT EVEN THOUGH MY WARRANTY BOOK SAYS WINDSHIELD WORKMANSHIP IS COVERED.  THEY WANT ME TO REPORT THEIR DEFECT IN MATERIAL TO MY INSURANCE COMPANY AND HAVE MY INSURANCE COMPANY PAY FOR THEIR DEFECTIVE GLASS.  I'LL BE CALLING MY LAWYER. *TR",
        "vin": "5J6YH18957L"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/14/2009",
        "dateOfIncident": "03/27/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10265228,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKING SYSTEM PREMATURE WEAR AND SOFT, \"MUSHY\" BRAKE PEDAL.  THIS ISSUE WAS ADDRESSED BY ME WITH 5 HONDA DEALERSHIPS, ALL CLAIMING NO MANUFACTURER RESPONSIBILITY.  THEIR STATEMENT: \"USER VARIANCES; DRIVER SENSITIVE\" DATES, NAMES AND PARTS, AS WELL AS PHOTOGRAPHS, ARE AVAILABLE.    SPECIFICS:  2007 HONDA ELEMENT SC.   AT 30K MILES, REAR BRAKES NEEDED COMPLETE RE-DO, INCLUDING ROTOR TURN.  AT 23K MILES, SAME, TO FRONTS. ON REAR, MARCH, 2009, ON REAR SYSTEM, 1 PAD OF 4 PADS FOUND TO BE SEIZED TO CALIPER HOUSING BY CORROSION; LACK OF LUBRICANT. INTENSIVE COMMUNICATIONS WITH HONDA, TORRANCE CA. INDICATED THEY FEEL NO RESPONSIBILITY.  LATER, INVESTIGATIONS INTO SOFT, INEFFECTIVE BRAKE PEDAL FOUND FP# NOT ADMITTED BY HONDA AT ANY TIME;  INTER NET INVESTIGATION THROUGH ELEMENT OWNERS FORUM FOUND FP#57110-SCV-A72, AND TSB 07-045. MODULATOR, BRAKES, PART # 9125782.  MY CONTENTION:  MY FEELING IS THAT THIS MODULATOR, RESPONSIBLE FOR SENDING THE PROPER FLUIDS TO EACH WHEEL CALIPER FOR PROPER BRAKING AND MECHANICAL PERFORMANCE, HAS CAUSED THOUSANDS IF NOT MILLIONS OF BRAKE SYSTEMS TO WEAR UNEVENLY AND PREMATURELY, AND SAME NUMBER OF CUSTOMERS TO PAY FOR THESE REPAIRS THEMSELVES DUE TO A HONDA PART FAILURE IN THE SYSTEM.  SAFETY:  FURTHER, VEHICLE STABILITY AND ANTI LOCK BRAKE MECHANISMS ARE AFFECTED NEGATIVELY, WHILE HONDA DENIES RESPONSIBILITIES FOR THEIR PART AND MANUFACTURING.  NOTE:  MY VEHICLE IS TO BE REPAIRED TODAY, APRIL 14, 2009, AT HONDA EXPENSE.  I HAVE ALREADY PAID IN EXCESS OF $ 200 FOR REPAIRS ON THE VEHICLES BRAKE SYSTEM;  NEGOTIATIONS CONTINUE FOR REIMBURSEMENT TO ME, WITH TOTAL HONDA DENIAL. *TR",
        "vin": "5J6YH18987L"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "03/06/2008",
        "dateOfIncident": "02/20/2007",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10220222,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "SPONTANEOUS WINDSHIELD CRACK ON 2007 HONDA ELEMENT.  LOWER PASSENGER SIDE CRACK OCCURRED WHILE I WAS SITTING IN CAR; NO IMPACT EVENT, ONLY DEFROSTER IN COLD WEATHER.  DEALER EXAMINED AND CLAIMS 'STONE PIT' AND REFUSED TO COVER ON WARRANTY, BUT THERE IS NO VISIBLE PIT NOR ANYTHING THAT CAN BE FELT WITH FINGER.  19,100K MILES.  CLASSIC CRACK STORY TYPICAL OF MANY OTHER HONDA ELEMENTS, AND CLASSIC 'STONEWALL TREATMENT' BY HONDA DEALER AS REPORTED BY OTHER HONDA ELEMENT OWNERS.   *TR",
        "vin": "5J6YH28757L"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/17/2008",
        "dateOfIncident": "02/15/2008",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10218270,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "2007 HONDA ELEMENT, PURCHASED MARCH OF 2007.  FEBRUARY 15, 2008 CRACK SHOWED UP ON WINDSHIELD STARTING FROM RIGHT SIDE FRAME OF WINDSHIELD, GROWING DAILY.  *TR",
        "vin": ""
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "12/18/2007",
        "dateOfIncident": "06/26/2007",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10212207,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A HONDA ELEMENT 2007 IN JULY 2007.  SINCE THE PURCHASE I HAVE LEARNED THAT THE FRONT SEATS DO NOT ADJUST AS IN PREVIOUS MODELS.  HOWEVER, BOTH THE QUICK START MANUAL AND THE REGULAR MANUAL BOTH INDICATE VISUALLY AND IN WRITING THAT THE FRONT SEATS SHOULD ADJUST FORWARD AT ABOUT A 10 DEGREE ANGLE FOR ACCESS TO THE BACK SEAT. \"OPEN THE DOOR, AND PULL UP ON THE SEAT-BACK ADJUSTMENT LEVER.  THE SEAT-BACK TILTS FORWARD TO ALLOW EASIER ACCESS TO THE REAR SEAT.\"  THE PICTURE ALSO SHOWS THIS TILT ANGLE.  I TOOK THE CAR TO A DEALERSHIP.  THEY DID NOT KNOW ABOUT THIS DESIGN CHANGE; THEY ALSO DID NOT KNOW THAT THE SAME CHANGE IS ON THE 2008 MODEL.  I TALKED WITH HONDA ABOUT THIS DESIGN FLAW AS A SAFETY ISSUE.  WITHOUT THE ABILITY TO TILT THE SEAT FORWARD BOTH ENTRY AND EXIT FROM THE BACK SEATS ARE RESTRICTED EVEN WHEN A FRONT SEAT IS MOVED FORWARD AS FAR AS IT WILL GO.  HONDA'S RESPONSE WAS THAT THEY KNEW PEOPLE WHO HAVE THE CAR AND THEY AREN'T HAVING ANY PROBLEMS GETTING IN OR OUT OF THE BACK SEAT AND THAT I SHOULD JUST MOVE THE FRONT SEATS BACK AND FORTH TO USE THE BACK SEATS.  IN CASE OF AN EMERGENCY, EXITING THE BACK SEAT WOULD BE DIFFICULT AT BEST AND A DANGER TO THEIR SAFETY AND WELL-BEING.  HONDA'S RESPONSE IS THAT THE DESIGN IS WRITTEN IN STONE AND THAT UNLESS ENOUGH COMPLAINTS AND PROBLEMS WITH EMERGENCY EXITS ARE MADE THAT NOTHING WILL BE DONE.  THEIR OPINION IS THAT THE CAR IS SAFE AND HAS BEEN FULLY APPROVED BY THE NTSB AND NHTSA.  I WOULD DEFY ANYONE TO ENTER AND EXIT THE BACK SEAT WITH ANY SPEED BECAUSE OF THIS CHANGE IN DESIGN.  I HOPE THIS WILL BE INVESTIGATED AND THAT HONDA WILL BE FORCED TO REDESIGN AND RECALL THE MODELS THAT NO LONGER ALLOW THE FRONT SEAT TO TILT FOR AS THEY SAY \"EASIER ACCESS TO THE REAR SEAT\" AND I WOULD ADD EASY, QUICK EXIT FROM THE BACK SEAT IN AN EMERGENCY.  *TR",
        "vin": "5J6YH28727L"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/05/2007",
        "dateOfIncident": "07/02/2007",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10195433,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "2007 HONDA ELEMENT EX GOT FLAT TIRE, PUT ON TEMPORARY SPARE.  TIGHTENED   LUGS: NUTS PROPERLY, AND   DROVE TO TIRE STORE ABOUT 30 MILES. 2 OF THE LUG S:NUTS HAD COME OFF COMPLETELY AND THE REMAINING 3 WERE LOOSE,  ALMOST LOST THE ENTIRE WHEEL.  TIRE STORE WAS NOT SUPRISED.  THEY INDICATED THAT THEY HAD SEEN THIS BEFORE.   *AK",
        "vin": "5J6YH28797L"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/27/2007",
        "dateOfIncident": "06/27/2007",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10194778,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 HONDA ELEMENT.  THE CONTACT STATED THAT THE BRAKING SYSTEM IS POOR ON HIS VEHICLE.  THE BRAKES ONLY WORK FOR THE FRONT WHEELS.  THE CONTACT HAS TAKEN THE VEHICLE TO SEVERAL DEALERS AND THEY HAVE CHANGED THE REAR BRAKE PADS, FRONT BRAKE PADS, AND THE MASTER BRAKE PUMP.  HOWEVER, THE FAILURE PERSISTS.  THE VEHICLE WAS TAKEN TO A BRAKE SHOP AND WAS TOLD THAT THE CAUSE OF FAILURE WAS THE ELECTRONIC POWER BRAKE SYSTEM.  THE CURRENT AND FAILURE MILEAGES WERE 4,700.  UPDATED 02-01-08 *BF     UPDATED 02/01/08  *TR",
        "vin": "5J6YH18907L"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "04/28/2007",
        "dateOfIncident": "04/20/2007",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10189164,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "HONDA ELEMENT PURCHASED 4/16/07: A CHIP A WEEK ON WINDSHIELD! TODAY IS 4/28/07. INTERNET SEARCH SHOWS HISTORY WITH ELEMENT WINDSHIELDS. CALLED SALESMAN, \"ITS OUR ROADS...REPAIR DEPT.\" JUST WANT TO GET A COMPLAINT ON RECORD SINCE THERE IS A CLASS ACTION LAWSUIT FOR OTHER RECENT YEARS. *TR",
        "vin": "5J6YH28737L"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/01/2007",
        "dateOfIncident": "01/05/2007",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10181315,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR CRASH, THE PERSON I HIT RAN A STOP SIGN GOING ABOUT 40 MILES AN HOUR. 2007 HONDA ELEMENT AIR BAGS WENT OFF, AND LOST PERMANENT HEARING LOSS IN BOTH EARS, L EAR 50% AND R EAR 70%. *JB",
        "vin": ""
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/11/2007",
        "dateOfIncident": "12/20/2006",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10178399,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ELEMENT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* -  THE CONTACT HAS A 2007 HONDA ELEMENT WITH AN ODOMETER READING OF 1,473 MILES.  THE CONTACT REALIZED THAT WHEN A PASSENGER IS SEATED  IN THE REAR SEAT, THE REAR DOORS CAN NOT BE OPENED. THE CONTACT WAS IN THE REAR SEAT OF THE VEHICLE WHEN THE WIND BLEW THE DOORS SHUT. THE CONTACT STATED THAT THERE WAS NOT A WAY FOR HIM TO UNLATCH THE DOORS. ON PAST MODELS THERE WAS A LATCH ON THE FRONT SEATS WHICH WOULD RELEASE THE SEAT SO THE DOORS COULD BE UNLOCKED. NOW ON THE CURRENT VEHICLE THE LATCH IS NOT AVAILABLE, AND THE ONLY WAY TO GET OUT OF THE REAR SEATS IT TO CLIMB OVER THE SEATS OR OPENED FROM THE OUTSIDE ON THE VEHICLE. THE CONTACT DID NOT HAVE THE VIN  AVAILABLE AT THIS TIME.         UPDATED. *JB  UPDATED 05/10/07. *JB",
        "vin": "5J6YH28797L"
    }
]