[
    {
        "components": "SUSPENSION,ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/04/2011",
        "dateOfIncident": "02/25/2007",
        "fire": false,
        "manufacturer": "Hino Motors Sales U.S.A., Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10374065,
        "products": [
            {
                "manufacturer": "Hino Motors Sales U.S.A., Inc.",
                "productMake": "HINO",
                "productModel": "258",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A NEW 2007 TOYOTA HINO 338 EXPEDITER GVW 33000LBS TRUCK. THE TRUCK HAS BEEN IN THE SHOP OVER 35 TIMES, MORE THEN 10 WARRANTY REPAIRS. THE TRUCK HAS HAD A TURBO HOSE BLOW, LEAVING THE DRIVER STRANDED ON THE SIDE OF BUSY ROADS ON MORE THEN 3 OCCASION. THE TRUCK HAS MULTIPLE AIRCONDITION, BATTERY, ALTERNATOR PROBLEMS. AFTER A COURT ORDERED INSPECTION IT WAS FOUND THE ONE OF THE AC PIPES IS CORRODING AND COULD CAUSE A LEAK INTO THE DRIVER CABIN. *TR",
        "vin": "5PVNV8JV972"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/14/2008",
        "dateOfIncident": "07/16/2007",
        "fire": false,
        "manufacturer": "Hino Motors Sales U.S.A., Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10245405,
        "products": [
            {
                "manufacturer": "Hino Motors Sales U.S.A., Inc.",
                "productMake": "HINO",
                "productModel": "258",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 HINO 258.  THE CONTACT HEARD A LOUD SQUEAKING NOISE AND THE VEHICLE BECAME DIFFICULT TO STOP WHEN THE BRAKE PEDAL WAS DEPRESSED.  HE HAS TAKEN THE VEHICLE TO THE DEALER ON NUMEROUS OCCASIONS AND THEY REPLACED THE ENTIRE BRAKING SYSTEM FIVE TIMES.  TYPICALLY, THE FAILURE RECURS TWO HUNDRED MILES AFTER THE REPAIRS ARE MADE.  NONE OF THE REPAIRS HAVE SUFFICIENTLY REMEDIED THE FAILURE.  IN ADDITION, THE LEFT SPRING IN THE SUSPENSION SYSTEM FAILED.  THE CONTACT IS CURRENTLY IN THE PROCESS OF HAVING THE VEHICLE REPAIRED.  THE VIN WAS UNKNOWN.  THE FAILURE MILEAGE WAS 151 AND CURRENT MILEAGE WAS 12,000.",
        "vin": ""
    }
]