[
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/22/2021",
        "dateOfIncident": "03/01/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413393,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT'S WIFE OWNS A 2007 HYUNDAI AZERA. THE CONTACT STATED THAT HE EXPERIENCED INTERMITTENT SOFTNESS WHILE DEPRESSING THE BRAKE PEDAL. THE ABS WARNING LIGHT WAS ILLUMINATED. UPON INVESTIGATION, THE CONTACT LINKED THE FAILURE TO NHTSA CAMPAIGN NUMBER: 18V026000 (SERVICE BRAKES, HYDRAULIC) HOWEVER, THE VIN WAS NOT INCLUDED. NEITHER THE DEALER NOR THE MANUFACTURER WERE NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 200,000.",
        "vin": "KMHFC46F47A"
    },
    {
        "components": "STRUCTURE,SEATS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/14/2021",
        "dateOfIncident": "12/01/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388154,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CARS LEAKING OIL INTO THE ALTERNATOR.THE OWNER BEFORE ME SAID THEY FIXED THE GASKET AND REPLACED THE ALTERNATOR TWICE.I BOUGHT IT 12/01/20 AND HAVENT DRIVEN IT DUE TO ITS COST TO FIX THE LEAK AND REPLACE THE ALTERNATOR. IF HE GAVE UP ON HIGHWAY GUARANTEE OF AN ACCIDENT. BACK DRIVER SIDE DOOR HANDLE FELL OFF. PASSENGER SIDE FRONT SEAT WON'T WORK",
        "vin": "KMHFC46F87A"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/24/2020",
        "dateOfIncident": "11/18/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11376156,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE LIGHT CAME ON ALONG WITH ESC OFF LIGHT SHOWING UP ON DASHBOARD. AT TIMES WHEN STARTING VEHICLE UP IN MORNING VEHICLE WOULD NOT ACCELERATE, I'VE PRESSED THE GAS PEDAL TO THE FLOOR AND NO ACCELERATION. SUNROOF WINDOW, BACK DRIVER WINDOW AND HEATED FRONT SEATS HAVE STOPPED WORKING AND MY AIRBAG LIGHTS STAY ON ?",
        "vin": "KMHFC46F77A"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/14/2020",
        "dateOfIncident": "07/25/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364295,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD  THE RECALL 172 PERFORMED AT THE HYUNDAI DEALERSHIP ON 07/03/2020, AND 2 WEEKS LATER MY ABS MODULE FAILED ANYWAY DUE TO BRAKE FLUID LEAK INSIDE THE ABS MODULE AND HAD TO BE REPLACED. I CONTACTED HYUNDAI FOR REIMBURSEMENT AND WAS DENIED. OUT OF POCKET $500. WAS ALSO TOLD REPAIR WOULD BE $4000, BUT WAS THEN CHANGED TO $300.",
        "vin": "KMHFC46FX7A"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/18/2020",
        "dateOfIncident": "08/01/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11359779,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI AZERA. THE CONTACT STATED THAT THE VEHICLE WAS TAKEN TO TWO SEPARATE INDEPENDENT MECHANICS WHO INFORMED HIM THAT THE REAR SUSPENSION WAS COMPLETELY CORRODED. UPON INVESTIGATION, THE CONTACT DISCOVERED NHTSA CAMPAIGN NUMBER: 13V354000 (SUSPENSION) WHICH HE LINKED TO THE FAILURE. THE CONTACT CALLED THE MANUFACTURER WHO REFERRED HIM TO A HYUNDAI DEALER TO HAVE THE VEHICLE INSPECTED. THE CONTACT TOOK THE VEHICLE TO LYNNES NISSAN CITY (318 BLOOMFIELD AVE, BLOOMFIELD, NJ 07003) WHERE HE WAS INFORMED THAT THE RECALL REPAIR WAS PERFORMED BACK IN 2013. THE CONTACT WAS INFORMED THAT HE WOULD HAVE TO PAY A DIAGNOSTIC FEE TO HAVE THE VEHICLE INSPECTED. AFTER DISCOVERING THAT THE RECALL HAD ALREADY BEEN PERFORMED ON THE VEHICLE PRIOR TO HIM OWNING IT, THE CONTACT STATED THAT THE RECALL REMEDY WAS INEFFECTIVE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 87,000.",
        "vin": "KMHFC46F37A"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/03/2020",
        "dateOfIncident": "05/06/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353023,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI AZERA. THE CONTACT STATED THAT WHILE DRIVING 15-20 MPH, THE BRAKE PEDAL WAS DEPRESSED AND TRAVELED TO THE FLOORBOARD CAUSING THE BRAKING DISTANCE TO BE EXTENDED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THE VEHICLE AND DETERMINED THAT THE ABS MODULE FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE RECURRED. THE VEHICLE THEN WAS TAKEN TO NOLLER HYUNDAI (2920 S. KANSAS AVENUE, TOPEKA, KS 66611) WHERE IT WAS DIAGNOSED FOR THE 2ND TIME AND DETERMINED THAT THE ABS MODULE FAILED AND NEEDED TO BE REPLACED. THE REPAIR WAS STILL PENDING. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE CONTACT REFERENCED NHTSA CAMPAIGN NUMBER: 18V026000 (SERVICE BRAKES, HYDRAULIC) AS A POSSIBLE SOLUTION TO THE FAILURE HOWEVER, THE VIN WAS NOT INCLUDED. THE FAILURE MILEAGE WAS APPROXIMATELY 140,000.",
        "vin": "KMHFC46FX7A"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/22/2020",
        "dateOfIncident": "02/01/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11301184,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI AZERA. WHILE DRIVING AT VARIOUS SPEEDS THE REAR PASSENGER DOOR BECAME AJAR AND FLEW OPEN. THE CONTACT WAS ABLE TO SECURE THE DOOR BY BUNGEE CORD. THE REAR DRIVER'S SIDE DOOR FAILED TO LOCK OR UNLOCK. ADDITIONALLY, WHILE DRIVING THE DRIVER'S SIDE DOOR THE DOOR AJAR WARNING LIGHT WAS ILLUMINATED. THE VEHICLE WAS TAKEN TO ROBERT LARSON'S HYUNDAI 7601 S TACOMA WAY, TACOMA, WA 9840 (253) 474-0621, WHERE IT WAS DIAGNOSED THAT THE LOCK ACTUATOR NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED HOWEVER THE FAILURE RECURRED. THE CONTACT SUSTAINED INJURIES TO THE UPPER BODY WHILE HOLDING THE DOOR CLOSE BUT MEDICAL ATTENTION WAS NOT PROVIDED. THE MANUFACTURER WAS CONTACTED BUT NO FURTHER ASSISTANCE WAS PROVIDED. THE FAILURE MILEAGE WAS APPROXIMATELY 167,000.",
        "vin": "KMHFC46F17A"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "10/21/2019",
        "dateOfIncident": "12/15/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11269922,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI AZERA. WHILE DRIVING APPROXIMATELY 25 MPH, SMOKE ENTERED THE VEHICLE. THE VEHICLE WAS TAKEN TO MURDOCK HYUNDAI MURRAY (4646 STATE ST, MURRAY, UT 84107, (801) 262-6401) TO BE DIAGNOSED, BUT THE CAUSE OF THE SMOKE FAILURE WAS UNDETERMINED. THE DEALER REPAIRED THE VEHICLE PER AN UNKNOWN RECALL. THE CONTACT MENTIONED THAT THERE WAS A BURN HOLE IN THE FLOOR UNDER THE PASSENGER SEAT. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE THEY INFORMED THE CONTACT THAT THE FRONT SEAT COVER NEEDED TO BE REPLACED AND THE VEHICLE NEEDED TO BE TAKEN TO A HYUNDAI DEALER. THE VEHICLE WAS TAKEN BACK TO THE DEALER WHERE THEY INFORMED THE CONTACT THAT THE SEAT COVER WAS ORDERED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 258,983.",
        "vin": "KMHFC46F67A"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "06/27/2019",
        "dateOfIncident": "06/01/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11223019,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI AZERA. WHILE DRIVING 40 MPH, ALL FOUR WINDOWS BEGAN TO ROLL DOWN ON THEIR OWN. THE CONTACT PRESSED THE POWER WINDOW CONTROLS, BUT THEY FAILED TO CLOSE ANY OF THE WINDOWS. THE CONTACT HAD SOMEONE UNLATCH THE DOORS TO SCROLL AND TAPE THE WINDOWS CLOSED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE DEALER AND MANUFACTURER WERE NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 160,000.",
        "vin": "KMHFC46F47A"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "01/24/2019",
        "dateOfIncident": "01/18/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11171833,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT DRIVER SEAT MOVES FORWARD ON ITS OWN WHILE I'M DRIVING AND PRESSES ME UP AGAINST THE STEERING WHEEL.  IT'S A RANDOM OCCURRENCE AND I CAN'T DETECT ANY PATTERN.  SOMETIMES IT CAN BE MOVE BACK INTO POSITION, BUT NOT ALWAYS IMMEDIATELY.  APPARENTLY THERE WAS A RECALL ON THIS FOR OTHER 2007 AZERAS, BUT IT DOESN'T APPLY TO MY VIN.  YET, IT IS HAPPENING ON MY CAR.",
        "vin": "KMHFC46F07A"
    },
    {
        "components": "POWER TRAIN,SEATS",
        "crash": false,
        "dateComplaintFiled": "10/16/2018",
        "dateOfIncident": "09/01/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11140738,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI AZERA. WHILE THE VEHICLE WAS STATIONARY AND WHILE DRIVING VARIOUS SPEEDS, THE DRIVER'S SEAT MOVED INVOLUNTARILY. IN ADDITION, THE GEAR SHIFTER FAILED TO MOVE TO THE REVERSE POSITION WHEN PROMPTED. THE CONTACT TURNED OFF AND RESTARTED THE VEHICLE IN AN ATTEMPT TO CORRECT THE FAILURES. A DEALER AND THE MANUFACTURER WERE NOT MADE AWARE OF THE FAILURES. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE CONTACT REFERENCED NHTSA CAMPAIGN NUMBER: 16V630000 (SEATS) AS A POSSIBLE CAUSE OF THE SEAT FAILURE. THE FAILURE MILEAGE WAS 136,840.",
        "vin": "KMHFC46FX7A"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "09/27/2018",
        "dateOfIncident": "08/24/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11131906,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY 2007 AZERA IN JULY OF 2018 THEN OVER A MONTH LATER IN AUGUST OF 2018 MY PASSENGER WENT TO PUT HIS SEAT BELT ON IN THE PASSENGER FRONT SEAT THE RED AIRBAG LIGHT AND THE PASSENGER AIRBAG OFF YELLOW LIGHT STAYED ON WHICH IS NOT SUPPOSE TO HAPPEN  NOW THE RED AIRBAG LIGHT STAYS ON ALL THE TIME AND THE YELLOW PASSENGER LIGHT STAYS ON WHILE THE SEAT BELT IS ON.",
        "vin": "KMHFC46F97A"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "09/25/2018",
        "dateOfIncident": "08/25/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11131497,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "RED AIR BAG LIGHT CAME ON WITH THE YELLOW PASSENGER AIRBAG OFF  LIGHT  WHEN MY PASSENGER  WENT TO PUT HIS SEAT BELT ON AND THE RED AIR BAG LIGHT STAYS ON AND THE PASSENGER AIR BAG LIGHT CONTINUES TO GO ON WHEN THE SEAT BELT IS MOVED TO CONNECT DOESNT NEED TO BE CONNECTED FOR THIS TO HAPPEN THERE IS A RECALL BUT MY VEHICLE DOES NOT FALL INTO THE MANUFACTURING DATE MY MANUFACTURING DATE IS 05/11/2007 .I CONTACTED HYUNDAI  AND THEY SAID ITS NOT ON RECALL .I BELIEVE IM NOT THE ONLY PERSON WHO IS EXPERIENCING THIS SAFETY HAZARD PROBLEM .PLEASE HELP ME CANT AFFORD THE 1000 DOLLAR FIX BY THE DEALER.",
        "vin": "KMHFC46F97A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/20/2018",
        "dateOfIncident": "08/19/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11121022,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BRAKE WARNING LIGHT CAME ON AND THE PASSENGER AIRBAG OFF WARNING LIGHT CAME ON WHEN A PASSENGER IS SITTING IN THE PASSENGER FRONT SEAT OR NOT. BOTH STAY ON EVEN AFTER READING THE MANUAL TO RESET IT.COSEQUENTLY THE PASSENGER AIR BAG IS IMOBILIZZED AND WILL NOT PROTECT THE PASSENGER.",
        "vin": "KMHFC46F97A"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/24/2018",
        "dateOfIncident": "02/28/2018",
        "fire": true,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11113304,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL   THIS HYUNDAI AZERA 2007 WAS JUST BURNING FROM THE ENGINE AFTER WHICH THE ARLINGTON POLICE WAKE ME AT MIT NIGHT AFTER THEY   HAD PUT OFF THE FIRE.THIS HAPPENED OUTSIDE MY APARTMENT 509  N COOPER ST APT ARLINGTON TX 76011.POLICE REPORT WAS FIRE JUST   STARTED ITSELF FROM THE ENGINE. I TOOK THIS CAR TO HYUNDAI COMPANY 6 MONTHS AGO AND THEY NEVER REPAIRED THIS CAR FOR ME",
        "vin": "KMHFC46F97A"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/18/2018",
        "dateOfIncident": "07/16/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11112093,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI AZERA. THE CONTACT TOOK THE VEHICLE TO WRIGHT HYUNDAI (10677 PERRY HIGHWAY, WEXFORD, PA 15090) TO BE REPAIRED PER NHTSA CAMPAIGN NUMBER: 13V354000 (SUSPENSION). THE DEALER INFORMED THE CONTACT THAT THE SPRINGS WERE SEVERELY CORRODED AND NEEDED REPLACEMENT. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE SPRINGS WERE NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 110,000.",
        "vin": "KMHFC46F27A"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/27/2018",
        "dateOfIncident": "03/26/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11081608,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI AZERA. THE CONTACT STATED THAT THE VEHICLE FAILED TO START WITHOUT WARNING. THE VEHICLE WAS TAKEN TO A LOCAL DEALER LEGACY HYUNDAI (443 INDUSTRIAL BLVD, MCDONOUGH, GA 30253) WHERE IT WAS DIAGNOSED THAT THE JUNCTION BOX, CLUSTER, AND HARNESS NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE BUT NO FURTHER ASSISTANCE WAS PROVIDED. THE FAILURE MILEAGE WAS 97,002. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/05/2018",
        "dateOfIncident": "01/01/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11076250,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI AZERA. THE CONTACT RECEIVED A RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 18V026000 (SERVICE BRAKES) IN MARCH OF 2018. THE DEALER (TEAM HYUNDAI MALL OF GEORGIA, 3445 BUFORD DR, GA 30519) STATED THAT THE PARTS WERE NOT AVAILABLE FOR THE REPAIR. RICK CASE HYUNDAI (11446 ALPHARETTA HWY, ROSWELL, GA 30076) ALSO STATED THAT THE PARTS WERE NOT AVAILABLE FOR THE REPAIR. THE MANUFACTURER WAS CONTACTED AND COULD NOT ASSIST. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "KMHFC46F17A"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "02/08/2018",
        "dateOfIncident": "03/02/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11071726,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH DRIVER AND PASSENGER SEATS DO NOT FUNCTION PROPERLY.  DRIVER SEAT TWICE HAS OPERATED WHILE DRIVING WITHOUT TOUCHING CONTROLS.  SEAT MOVES ALL THE WAY FORWARD PINNING DRIVER TO THE STEERING WHEEL.  PASSENGER SIDE RECLINE DOES NOT WORK.  WE DO NOT TOUCH THE CONTROLS ON THE PASSENGER SIDE AS THE RECLINE FUNCTION WILL NOT RETRACT WHEN ATTEMPTED.",
        "vin": "KMHFC46F57A"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/02/2018",
        "dateOfIncident": "10/10/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11058095,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN BRAKE PEDAL IS PRESSED AND RELEASED THE BRAKE LIGHT STAYS ON. THIS BRAKE LIGHT STAYING ON EFFECTS CRUISE CONTROL.",
        "vin": "KMHFC46D67A"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/21/2017",
        "dateOfIncident": "09/26/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10956102,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "HEAD GASKET CORRODES AND STARTS LEAKING OIL ONTO ALTERNATOR CAUSING THE ALTERNATOR TO SHORT OUT AND FLASH ENGINE LIGHTS. OTHER MAKES WITH SAME ENGINE FOR HYUNDAI HAD A RECALL FOR THE SAME PROBLEM. THE 2007 HYUNDAI AZERA WAS NOT. I HAD REPAIRS TO THIS PROBLEM IN THE AMOUNT OF $1500+",
        "vin": "KMHFC46D17A"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/18/2017",
        "dateOfIncident": "02/01/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10955422,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LEFT REAR DOOR OPENED WHILE DRIVING AS THE DOOR IS UNABLE TO BE CLOSED AND REMAIN CLOSED. THIS IS NOT A LOCKING PROBLEM AS THE DOOR WILL NOT STAY IN A CLOSED POSITION",
        "vin": "KMHFC46F37A"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "01/17/2017",
        "dateOfIncident": "01/17/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10945730,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A HYUNDAI RECALL NOTICE IN DECEMBER REGARDING THE POWER-ADJUSTABLE DRIVER SEAT. NO LOS ANGELES AREA HYUNDAI DEALER HAS THE REQUIRED PART AND I'M TOLD THEY ARE ALL ON BACK ORDER WITH NO KNOWN DELIVERY DATE. SO I'M DRIVING AN UNSAFE CAR WITH NO WAY TO REPAIR IT.  *TR",
        "vin": "KMHFC46F07A"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "12/07/2016",
        "dateOfIncident": "10/07/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10933685,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI AZERA. THE CONTACT STATED THAT THE DRIVER'S SEAT SHIFTED FORWARD AND BACKWARDS INDEPENDENTLY WHILE THE VEHICLE WAS IN OPERATION. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE POWER ADJUSTABLE SEAT SWITCH FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED PER NHTSA CAMPAIGN NUMBER: 16V630000 (SEATS), BUT THE FAILURE RECURRED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 125,000.",
        "vin": "KMHFC46F77A"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "11/03/2016",
        "dateOfIncident": "04/04/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10924032,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI AZERA. THE CONTACT STATED THAT THE SEAT RANDOMLY MOVED WHILE THE VEHICLE WAS IN MOTION. THE VEHICLE WAS TAKEN TO THE DEALER MORE THAN TWICE. AS AN INTERIM REPAIR, THE TECHNICIAN DISCONNECTED THE WIRES ON THE DRIVER'S SEAT. THE CONTACT WAS UNABLE TO DETERMINE WHEN THE VEHICLE WOULD BE REPAIRED PER NHTSA CAMPAIGN NUMBERS: 16V630000 (SEATS), 09V497000 (AIR BAGS, SEAT BELTS). THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS NOT AVAILABLE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "KMHFC46F77A"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "11/02/2016",
        "dateOfIncident": "09/15/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10923757,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI AZERA. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 65 MPH, THE FRONT DRIVER SEAT STARTED TO MOVE FORWARD AND THE BACK  REST OF SEAT TILTED FORWARD INDEPENDENTLY. THE CONTACT REACHED DOWN TO MANUALLY OVERRIDE THE SEAT FORWARD MOTION BUT FAILED. THE CONTACT THEN REMOVED THE FUSE THAT CONTROLLED THE SEAT ELECTRONIC COMMENDS DISABLING THEM AND DROVE THE VEHICLE HOME. THE CONTACT ALSO STATED THAT THE FAILURE HAD OCCURRED APPROXIMATELY TWELVE TIMES. THE VEHICLE WAS TAKEN TO THE DEALER BUT THE CAUSE OF THE FAILURE COULD NOT BE DETERMINED.  THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 135,000. . ..UPDATED 12/12/16 *BF  UPDATED 7/2/18*JB  *TR",
        "vin": "KMHFC46F37A"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,SEATS",
        "crash": false,
        "dateComplaintFiled": "10/30/2016",
        "dateOfIncident": "10/01/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10920092,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "DASHBOARD HAS OUTLINE AIRBAG CRACK ON PASSENGER SIDE.  DRIVER SEAT MOVES FORWARD, TILTS FORWARD, MOVES BACK WHILE DRIVING.  *TR",
        "vin": "KMHFC46FX7A"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "09/18/2016",
        "dateOfIncident": "10/10/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10907449,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR AIRBAG LIGHT IS ON ALL THE TIME.  BACK IN OCT 2014, CAR HAD 119K MILES, WE TOOK IT TO THE DEALER BECAUSE THERE WAS A RECALL ON THE SEAT BELT TENSIONER.  THEY SAID THAT THE CAR WAS SALVAGE TITLE SO NOTHING COULD BE DONE (SALVAGE TITLE DUE TO HAIL DAMAGE).  THEY SAID THE RECALL HAD ALREADY BEEN PERFORMED. THEY CHARGED US FOR THE DIAGNOSTIC AND RECOMMENDED WE REPLACE THE RIGHT (PASSENGER) SEAT BELT RETRACTOR ASSEMBLY BUT WE DID NOT DO THIS.  ALSO, THERE ARE 2 CRACKS IN THE PASSENGER SIDE DASHBOARD THAT WERE THERE WHEN WE BOUGHT THE CAR.  MY HUSBAND THOUGHT IT WAS PROBABLY SUN DAMAGE, BUT I HAVE SINCE SEEN IN THE NHTSA COMMENTS THAT THIS IS AN ISSUE DUE TO AIRBAG BELOW.",
        "vin": "KMHFC46D47A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/07/2016",
        "dateOfIncident": "09/06/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10904559,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MALFUNCTION IN THE SHIFT INTERLOCK CABLE CAUSED MY VEHICLE TO SHIFT INTO NEUTRAL ON ITS OWN WHILE IN OPERATION WHICH COULD HAVE RESULTED IN AN ACCIDENT ACCIDENT. DEALER MECHANICAL SERVICES STATED THERE WAS AN ISSUE WITH THE SHIFT INTERLOCK CABLE BUSHING BREAKING CAUSING THE VEHICLE TO AUTOMATICALLY SHIFT INTO NEUTRAL. THE VEHICLE WAS IN MOTION AT TIME OF THE OCCURRENCE.",
        "vin": "KMHFC46F27A"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "08/19/2016",
        "dateOfIncident": "02/12/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10897166,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI AZERA. WHILE DRIVING VARIOUS SPEEDS, THE SEAT BELT AND AIR BAG WARNING INDICATORS ILLUMINATED ON THE INSTRUMENT PANEL. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE NEW WIRING HARNESS CLIP WAS LOOSE AND NEEDED TO BE TIGHTENED. THE VEHICLE WAS REPAIRED; HOWEVER, THE FAILURE RECURRED. THE VEHICLE WAS PREVIOUSLY SERVICED PER NHTSA CAMPAIGN NUMBER: 10V007000 (AIR BAGS, SEAT BELTS) BUT THE REMEDY FAILED TO REPAIR THE VEHICLE. THE VEHICLE WAS BROUGHT BACK TO THE DEALER SEVERAL TIMES FOR THE FAILURE. THE CONTACT WAS ADVISED THAT NO ONE OVER 150 LBS SHOULD UTILIZE THE PASSENGER SEAT. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND CONFIRMED THAT THE SEAT LIMIT WAS 150 LBS. THE APPROXIMATE FAILURE MILEAGE WAS 95,000.",
        "vin": "KMHFC46F77A"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "08/03/2016",
        "dateOfIncident": "01/01/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10893005,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER THE VEHICLE IS STARTED, THE AIR BAG WARNING INDICATOR ILLUMINATES. ISSUE SEEMS TO BE RELATED TO A RECALL FOR CAMPAIGN 094 WHICH WAS FIXED IN DEC 2014. MY REGULAR CAR SERVICE PROVIDER HAS DIAGNOSED AND CONFIRMED IT TO THE SAME ISSUE AND SAYS THE RECALL IS NOT PROPERLY FIXED BUT THE HYUNDAI DEALER DOES NOT AGREE. HOW CAN ONE CONFIRM IF RECALL WAS PROPERLY FIXED OR NOT. AIR BAG AND SEAT BELT INDICATOR CAME ON AFTER FEW MONTHS OF FIXING THE RECALL. I INITIALLY THOUGHT IT TO BE SOME COMPUTER CODES ISSUE AND GOT THE CODES CLEARED BUT IT CAME BACK AFTER A MONTH AGAIN.    CAMPAIGN 094 STATES \"THE WIRING HARNESS FOR THE RIGHT FRONT SEAT BELT TENSION SENSOR MAY BECOME DAMAGED AFTER REPEATED USE OF THE RIGHT FRONT SEAT BELT. IF THE WIRING IS DAMAGED, THE PASSENGER FRONT AIRBAG WILL NOT DEPLOY IN THE EVENT OF A CRASH. DEALERS WILL REPAIR THE VEHICLES FREE OF CHARGE. THE RECALL BEGAN FEBRUARY 22, 2010. THE HYUNDAI RECALL NUMBER IS 094.\"    I DON'T REMEBER THE EXACT DATE OF WHEN THIS HAPPENED SO I AM PUTTING A DUMMY DATE OF 01/01/2016",
        "vin": "KMHFC46F57A"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/22/2016",
        "dateOfIncident": "08/01/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10860882,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI AZERA. THE CONTACT STATED THAT THE RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 13V354000 (SUSPENSION) WAS RECEIVED IN AUGUST OF 2013. AFTER CONTACTING THE DEALER AND THE MANUFACTURER ON MULTIPLE OCCASIONS, THE CONTACT WAS INFORMED THAT THE EQUIPMENT NEEDED TO PERFORM THE REMEDY WAS NOT AVAILABLE TO THE LOCAL DEALERS. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "KMHFC46F57A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/08/2016",
        "dateOfIncident": "06/15/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10824800,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI AZERA. THE CONTACT STATED THAT AFTER THE VEHICLE WAS STARTED, THE AIR BAG WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE CONTACT MENTIONED THAT THE VEHICLE WAS SERVICED IN 2010 UNDER NHTSA CAMPAIGN NUMBER: 10V007000 (AIR BAGS, SEAT BELTS) HOWEVER, THE FAILURE RECURRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS UNAVAILABLE.",
        "vin": "KMHFC46F57A"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/22/2015",
        "dateOfIncident": "12/16/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10735888,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES WERE LOOSE TOOK TO SHOP TOLD IT WAS MASTER CYLINDER, WENT THROUGH THREE MASTER CYLINDERS THEN THE ABS, BRAKE WARNING LIGHTS CAME ON THE DASH PANEL, LOST CRUISE CONTROL.  TOOK TO DEALER AND THEY SAID NOT COVERED BY ANY RECALL. IT IS A QUESTION WHETHER THE BRAKES WILL STOP THE CAR IN TIME SINCE WE NEED TO GO ALMOST TO THE FLOOR TO STOP.  DEALER SAID $4,000+ TO GET IT FIXED, AND IT IS OKAY TO DRIVE AS IT IS.  WHO IS RESPONSIBLE IF A LIFE IS LOST OR PROPERTY DAMAGE OCCURS?    SHOULDN'T A PART AS SIGNIFICANT AS THE ABS MODULE BE WARRANTED OR RELACED?",
        "vin": "KMHFC46F87A"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "05/27/2015",
        "dateOfIncident": "02/03/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10721749,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE POWER SEAT-BACK STARTS TO LEAN FORWARD PUSHING THE DRIVER INTO THE STEERING WHEEL. THE DRIVER MUST REACH DOWN AND TILT THE SEAT-BACK CONTROL THE OPPOSITE WAY TO OVERIDE MOTION. THERE IS A SHORT DELAY BEFORE THE SEAT-BACK REACTS. IT IS BECOMING MORE FREQUENT AND ALSO HAPPENS WHEN CAR IS PARKED AND UNOCCUPIED. OCCASIONALLY THE SEAT-BOTTOM WILL ALSO MOVE FORWARD ASPECIALLY WHEN PARKED. WE ARE SCHEDULING SERVICE WITH  OUR DEALERSHIP AND WILL PROVIDE UPDATE AFTER SERVICE.",
        "vin": "KMHFC46F07A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/22/2015",
        "dateOfIncident": "11/03/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10721055,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER'S DASH AIRBAG WARNING LAMP ILLUMINATES SPORADICALLY. FRONT PASSENGER SEAT \"AIRBAG DISABLED\" WARNING LAMP ILLUMINATES SPORADICALLY WHETHER SEAT IS OCCUPIED OR NOT. FRONT PASSENGER SEAT \"SEAT BELT UNLATCHED\" WARNING LAMP ILLUMINATES SPORADICALLY WHETHER SEAT IS OCCUPIED OR NOT AND/OR WHETHER SEAT BELT IS LATCHED OR NOT.",
        "vin": "KMHFC46D67A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/22/2015",
        "dateOfIncident": "10/20/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10712289,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI AZERA. THE CONTACT STATED THAT THE AIR BAG WARNING LIGHT ILLUMINATED ON THE INSTRUMENT PANEL. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSTIC TESTING. THE TECHNICIAN DIAGNOSED THAT THE AIR BAG WAS DEFECTIVE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 55,000.    UPDATED 6/8/15*CN     UPDATED 10/11/2017*CN",
        "vin": "KMHFC46FX7A"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/16/2015",
        "dateOfIncident": "04/15/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10706111,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE ARE TWO CRACKS LEADING FROM THT PASSENGER SIDE AIR BAG.I  HAVE REPORTED THIS TO HYUNDAI BUT WAS DENIED .I WAS GIVEN NO REASON WHY. I CONSIDER THIS A SERIOUS SAFETY PROBLEM BECAUSE YOU WILL NEVER KNOW WHEN THE AIR BAG WILL DEPLOY.  *TR",
        "vin": "KMHFC46F67A"
    },
    {
        "components": "SUSPENSION",
        "crash": true,
        "dateComplaintFiled": "01/22/2015",
        "dateOfIncident": "12/18/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10678333,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 HYUNDAI AZERA. THE CONTACT STATED THAT WHILE DRIVING AT APPROXIMATELY 40 MPH, THE VEHICLE SWERVED TO THE RIGHT AND CRASHED INTO A TRAFFIC SIGN. A POLICE REPORT WAS NOT FILED. THE CONTACT SUSTAINED UNKNOWN INJURIES THAT DID NOT REQUIRE MEDICAL ATTENTION. THE VEHICLE WAS TOWED TO THE DEALER WHERE THE FRONT PASSENGER'S SIDE TIRE WAS REPLACED AS WELL AS OTHER UNKNOWN REPAIRS. THE CAUSE OF THE FAILURE WAS NOT DISCLOSED TO THE CONTACT. THE VEHICLE WAS REPAIRED. THE CONTACT WAS MADE AWARE OF NHTSA CAMPAIGN NUMBER: 13V354000 (SUSPENSION) BUT WAS UNCERTAIN IF IT WAS RELATED TO THE CAUSE OF THE FAILURE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 43,000.",
        "vin": "KMHFC46FX7A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/21/2015",
        "dateOfIncident": "04/01/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10677030,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI AZERA. THE CONTACT STATED THE AIR BAG WARNING INDICATOR ILLUMINATED INTERMITTENTLY. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VIN WAS NOT AVAILABLE. THE APPROXIMATE FAILURE MILEAGE WAS 84,000.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/06/2015",
        "dateOfIncident": "01/02/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10670541,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST BOUGHT THIS CAR USED WITH 49K ON THE ODO AND THE OTHER DAY THE PASSENGER AIRBAG OFF LIGHT REMAINED ON AND LIKE OTHER INSTANCES WILL NOT RESET TO THE ON POSITION. I HAVE NOT YET TAKEN THE CAR TO THE DEALER, BUT THAT IS MY NEXT STEP. THIS IS A KNOWN PROBLEM, BUT YET I SEE NO RECALL FROM HYUNDAI FOR SUCH A SERIOUS SAFETY CONDITION. THAT IS THE REASON FOR MY COMPLAINT.",
        "vin": "KMHFC46F17A"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/03/2015",
        "dateOfIncident": "09/15/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10669831,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER AIRBAG LIGHT THAT COMES ON WHEN SOMEONE IS NOT SEATING IN THE FRONT PASSENGER SEAT STAYS ON ALL THE TIME. IN AN ACCIDENT THE PASSENGER AIR BAG WILL NOT DEPLOY.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/18/2014",
        "dateOfIncident": "12/01/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10659583,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "2007 HYUNDAI AZERA LIMITED CONSUMER STATES TRANSMISSION IS JERKING WHEN SHIFTING FROM PARK TO REVERSE *CN  THE CONSUMER STATED THE TRANSMISSION WAS FLUSHED AND REPLACED AT 70,000 MILES. THE TRANSMISSION PROBLEM STARTED AT 72,886.  THE DEALER REMOVED SOME OF THE TRANSMISSION FLUID. HOWEVER, THE SAME THING HAPPENED. THE CONSUMER BELIEVED THE SHIFT SOLENOID OR TRANSMISSION CONTROL MODULE WAS FAULTY. HYUNDAI, STATED THE TRANSMISSION SHOULD BE REPLACED. *JB",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,SEATS",
        "crash": false,
        "dateComplaintFiled": "12/17/2014",
        "dateOfIncident": "12/03/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10664831,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "ABOUT TWO WEEKS AGO, THE BACK PORTION OF THE FRONT DRIVER'S SIDE SEAT BEGAN MOVING FORWARD AUTOMATICALLY WHILE I WAS DRIVING THE CAR.  I ALSO NOTICED THAT WHEN THE CAR IS PARKED THE SEAT WOULD MOVE FORWARD AS WELL.  WHEN THE SEAT MOVES FORWARD, I AM PUT VERY CLOSE TO THE STEERING WHEEL, WHICH MAKES IT DIFFICULT TO STEER AND INTERFERES WITH MY ABILITY TO BRAKE QUICKLY.  ALSO, BECAUSE I AM SO CLOSE TO THE STEERING WHEEL, I BELIEVE THAT IF THE AIR BAGS WERE TO DEPLOY I WOULD BE UNNECESSARILY HARMED.  I BROUGHT THE CAR TO A DEALERSHIP ON DECEMBER 17, 2014 BECAUSE OF A SEPARATE RECALL NOTICE I WAS SENT.  THE DEALERSHIP REPLACED THE STOP LAMP SWITCH AND ADDED CORROSIVE PROTECTION TO THE UNDER CARRIAGE OF MY CAR.  WHEN I ASKED THE SERVICE MANAGER IF HE COULD RUN A DIAGNOSTIC ON MY CAR WHILE IT WAS BEING REPAIRED, HE INFORMED ME THAT BECAUSE THE CAR WAS NOT UNDER WARRANTY, I WOULD HAVE TO PAY $130 DOLLARS.  THE BTS WIRE IN THE FRONT PASSENGER SEAT HAS ALREADY BEEN REPAIRED, AT 24,144 MILES, SO I BELIEVE THAT THERE COULD BE A CONNECTION BETWEEN THE FACT THAT THERE WAS A FAULTY WIRE IN THE FRONT PASSENGER SEAT AND THE ISSUES I AM NOW HAVING WITH THE FRONT DRIVER'S SEAT.    *TR",
        "vin": "KMHFC46F87A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/12/2014",
        "dateOfIncident": "05/05/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10663996,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI AZERA. WHILE DRIVING AT AN UNKNOWN SPEED, THE AIR BAG WARNING LIGHT ILLUMINATED AND FAILED TO TURN OFF. THE VEHICLE WAS TAKEN TO A DEALER. THE TECHNICIAN DIAGNOSED THAT THE AIR BAG SENSOR NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 90,000.",
        "vin": "KMHFC46F57A"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "11/10/2014",
        "dateOfIncident": "10/13/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10653999,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI AZERA. THE CONTACT STATED THAT WHILE DRIVING 55-60 MPH, THE DRIVERS SEAT INDEPENDENTLY THRUST FORWARD AD PUSHED THE CONTACT INTO THE STEERING WHEEL. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THE TECHNICIAN DIAGNOSED THAT THE IMS CONTROL MODULE, SEAT TRACT, AND THE MOTOR NEEDED TO BE REPLACED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 76,485.",
        "vin": "KMHFC46F27A"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "11/05/2014",
        "dateOfIncident": "03/11/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10652743,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI AZERA. THE CONTACT STATED WHILE DRIVING APPROXIMATELY 60 MPH, THE FRONT DRIVER AND PASSENGER SIDE AIR BAG WARNING LIGHTS ILLUMINATED. THE VEHICLE WAS TAKEN TO THE DEALER. THE TECHNICIAN DIAGNOSED THAT THE SEAT BELT TENSIONER NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 67,000.",
        "vin": "KMHFC46F37A"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "10/14/2014",
        "dateOfIncident": "10/10/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10644441,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SEAT BACK IS MOVING FORWARD ON ITS OWN WHILE I AM DRIVING.  IT IS HAPPENING VERY FREQUENTLY AND IS VERY DANGEROUS.  *TR",
        "vin": "KMHFC46F17A"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "10/10/2014",
        "dateOfIncident": "07/23/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10643883,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVERS SIDE AIRBAG LIGHT HAS BEEN ON SINCE I TOOK IT FOR SERVICE ON 7/23/2014. IT WENT OUT FOR A DAY AND CAME BACK ON,STAYING ON EVER SINCE.  *TR",
        "vin": "KMHFC46F17A"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "10/09/2014",
        "dateOfIncident": "10/02/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10643655,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI AZERA. THE CONTACT STATED AFTER THE VEHICLE WAS STARTED, THE AIR BAG WARNING LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE PASSENGER SIDE SEAT BELT AND TENSIONER NEEDED TO BE REPLACED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 55,500.",
        "vin": "KMHFC46F97A"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "09/30/2014",
        "dateOfIncident": "06/02/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10640168,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI AZERA. THE CONTACT STATED THAT THAT THE AIR BAG WARNING LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN TO A DEALER, WHO DIAGNOSED THAT THE PASSENGER'S SIDE SEAT BELT TENSION NEEDED TO BE REPAIRED. THE VEHICLE WAS NOT REPAIRED. THE CONTACT MENTIONED THAT THE FAILURE WAS PREVIOUSLY REPAIRED UNDER A MANUFACTURERS RECALL. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 103,000.",
        "vin": "KMHFC46F67A"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "09/26/2014",
        "dateOfIncident": "09/22/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10639265,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT POWER DRIVER'S SEAT MOVES BY ITSELF RANDOMLY WHILE DRIVING. THE SEAT LEANED FORWARD ABOUT 45 DEGREES ITSELF WHILE DRIVING WITHOUT TOUCHING THE SEAT SWITCH OR ANY BUMPS ON THE ROAD. THE SUDDEN MOVEMENT OF THE SEAT, WITHOUT ANY KIND OF WARNING, CAUSED COLLAPSING DRIVER'S UPPER BODY TO THE STEERING WHEEL AND PUSHING DRIVER'S HEAD DOWNWARD. IT IS VERY DANGEROUS TO DRIVE THE CAR IN THAT POSITION. DRIVING SPEED WAS NOT RELATED TO THE PROBLEM.    I TOOK THE VEHICLE TO THE DEALER SERVICE CENTER IN EL PASO, TEXAS. AT FIRST, THE SERVICE ADVISOR DID NOT BELIEVE MY COMPLAINT, BUT THE SEAT MOVED ITSELF IN FRONT OF HIM, EVEN WHILE THE CAR WAS STOPPED AND NO ONE WAS SEATING ON IT. THE SERVICE ADVISOR RULLED OUT IF THAT WAS SEAT SWITCH PROBLEM AND RECOMMENDED TO REPLACE THE SEAT TRACK WHICH WOULD COST MORE THAN $2,000.  *TR",
        "vin": "KMHFC46F57A"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,SEATS",
        "crash": false,
        "dateComplaintFiled": "08/25/2014",
        "dateOfIncident": "12/12/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10628156,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "ALL KINDS OF ELECTRICAL PROBLEMS LEAST OF WHICH IS THE CIGARETTE LIGHTER QUIT WORKING. THE POWERED PASSENGER SEAT CAN NOT BE MOVED ANY DIRECTION. AIR BAG LIGHT CAME ON AFTER HITTING A FAIRLY SMALL POTHOLE. AIR BAG LIGHT GOES ON FOR A FEW DAYS/WEEKS THEN GOES OFF.PASSENGER SEATBELT INDICATOR LIGHT COMES ON SOMETIMES WHILE PASSENGER IS WEARING SEATBELT SOMETIMES THE SAME LIGHT RANDOMLY COMES ON THEN GOES OFF WITH NO PASSENGER AND NO WEIGHT IN THE SEAT. I HAVE PERSONALLY PAID FOR A NEW BATTERY AND TWO STARTERS WHICH MORE THAN LIKELY DIDN'T NEED REPLACED BECAUSE MY CAR STILL WON'T START AT RANDOM TIMES. I FIRST EXPERIENCED IT NOT STARTING AROUND 79,000 MILES I COULD TELL IT WASN'T THE BATTERY CAUSE I TRIED JUMP STARTING IT AND ALL THE WHILE THE DOOR CHIME LIGHTS AND RADIO ALL WORKED FINE. SO I REPLACED THE STARTER ONLY TO HAVE IT NOT START THE VERY NEXT DAY. ANYWAY A WIRE WAS REPLACED TO THE STARTER AND ALL WAS FINE FOR ABOUT 10,000 MILES AND THE SAME NON STARTING ISSUES OCCURRED AGAIN AND AGAIN. SEEMS LIKE I JUST KEEP TRYING TO START IT AND MAYBE THE 8TH OR 25TH TIME IT STARTS.. RUNNING OUT OF WORDS AND THEY WOULD ONLY LET ME PICK 3 PARTS TO WRITE ABOUT ALSO HAVE ISSUES WITH BRAKES CRACKS AROUND PASSENGER AIR BAG ON DASH ETC.  *TR",
        "vin": ""
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "08/22/2014",
        "dateOfIncident": "08/14/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10627519,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER SEAT ON DRIVERS MOVES UP BACK AND TILTS THE BACK OF SEAT TOWARD STEERING WHEEL PINNING DRIVER .TOO DANGEROUS TO DRIVE.  *TR",
        "vin": ""
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "08/18/2014",
        "dateOfIncident": "01/01/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10626189,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON FREEWAY, DRIVER SEAT LEANED FORWARD AS FAR AS POSSIBLE.  IF THE SEAT HAD BEEN POSITIONED FORWARD FURTHER, DRIVER WOULD HAVE BEEN PUSHED AGAINST THE STEERING WHEEL!  HAPPENED RARELY AT FIRST, THEN BEGAN TO DO IT CONSTANTLY.  WHEN SEATBACK IS PUSHING FORWARD THE BUTTONS ARE USELESS.  BY CONSTANTLY HOLDING THE BUTTON TO TILT THE SEAT BACKWARDS, EVENTUALLY IT WOULD GO BACK.  EVENTUALLY I DISCONNECTED THE FUSE FOR THE ELECTRIC SEAT SO THE CAR WAS USABLE (BUT YOU COULD NOT ADJUST THE SEAT).    THIS PROBLEM APPEARS TO HAVE HAPPENED ON A DECENT NUMBER OF THESE CARS.  SEARCHING ON THE INTERNET FOUND MULTIPLE PEOPLE WITH THE SAME PROBLEM.  COST TO FIX IS OUTRAGEOUS (BASICALLY NEW SEAT/SYSTEM).  *TR",
        "vin": "KMHFC46F27A"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "07/10/2014",
        "dateOfIncident": "07/09/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10609542,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING CAR ON A FLAT SURFACE AT 40 MPH THE AUTOMATIC SEATS MOVED ALL THE WAY BACK.  I QUICKLY MOVED THEM FORWARD AND CONTINUED TO DRIVE WHEN THEY MOVED AGAIN.  I HAD TO PULL OVER.  I WAS NOT ABLE TO DRIVE WITH THE SEAT BACK SO FAR.  THE SEATS CONTINUED TO MOVE IN BACK POSITION WHILE IN PARK OR DRIVE.  AN APPOINTMENT WITH THE DEALERSHIP WAS MADE THE FOLLOWING DAY.  *TR",
        "vin": "KMHFC46F27A"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "07/10/2014",
        "dateOfIncident": "07/09/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10609541,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING CAR ON A FLAT SURFACE AT 40 MPH THE AUTOMATIC SEATS MOVED ALL THE WAY BACK.  I QUICKLY MOVED THEM FORWARD AND CONTINUED TO DRIVE WHEN THEY MOVED AGAIN.  I HAD TO PULL OVER.  I WAS NOT ABLE TO DRIVE WITH THE SEAT BACK SO FAR.  THE SEATS CONTINUED TO MOVE IN BACK POSITION WHILE IN PARK OR DRIVE.  AN APPOINTMENT WITH THE DEALERSHIP WAS MADE THE FOLLOWING DAY.  *TR",
        "vin": "KMHFC46F27A"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "06/25/2014",
        "dateOfIncident": "06/21/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10605812,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI AZERA. THE CONTACT STATED THAT WHILE DRIVING 40 MPH, THE DRIVER'S SEAT BEGAN TO SLIDE BACKWARD INDEPENDENTLY. THE CONTACT STATED SHE ADJUSTED THE SEAT BUT THE FAILURE RECURRED. THE VEHICLE WAS TAKEN TO THE DEALER FOR INSPECTION BUT THEY WERE UNABLE TO DUPLICATE THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 28,000.",
        "vin": "KMHFC46FX7A"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/17/2014",
        "dateOfIncident": "03/04/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10598773,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI AZERA. THE CONTACT STATED THAT THE CHECK ENGINE, ANTI-LOCK BRAKES AND THE ESC WARNING LAMP ILLUMINATED. THE VEHICLE WAS TAKEN TO THE DEALER. THE TECHNICIAN STATED THAT THE ANTI LOCK SYSTEM NEEDED TO BE REPLACED BUT WAS UNABLE TO DIAGNOSE WHY THE CHECK ENGINE WARNING LAMP WAS ILLUMINATED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE WHO DID NOT OFFERED ANY ASSISTANCE SINCE THE VEHICLE WAS NOT INCLUDED IN RECALL NHTSA CAMPAIGN NUMBER: 09V122000 (SERVICE BRAKES, HYDRAULIC). THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 32,000 AND THE CURRENT MILEAGE WAS 38,000.",
        "vin": "KMHFC46FX7A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/22/2014",
        "dateOfIncident": "01/01/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10584267,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVERS SIDE AIR BAG LIGHT IN THE INSTRUMENT PANEL IS STAYING ON.  THIS MEANS THE AIRBAG WILL NOT WILL NOT WORK IF THE LIGHT IS ON.  I KNOW THERE IS A RECALL ON THE PASSENGER SIDE, BUT THEY WILL NOT RECOGNIZE THE DRIVERS SIDE AIR BAG.  TO ME IF A LIGHT IS ON I BELIEVE THAT WOULD ALSO BE AN ISSUE FOR A RECALL, BUT THE COMPANY JUST POO POO'S THE CLAIM.  FOR ANYONE THAT HAS THE SAME PROBLEM PLEASE CALL AND MAKE A REPORT.  THE NUMBER FOR A COMPLAINT IS:   1-888-327-4236.  PLEASE CALL AND COMPLAIN SO THIS ISSUE CAN BE RESOLVED.  *TR",
        "vin": "KMHFC46F37A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/22/2014",
        "dateOfIncident": "01/15/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10584260,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI AZERA. THE CONTACT STATED THAT THE DRIVER SIDE AIR BAG SENSOR LIGHT ILLUMINATED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 66,000.  UPDATED 06/10/14*LJ         THE CONSUMER STATED THE MANUFACTURER REFUSED ANY ASSISTANCE. UPDATED 06/16/2014 *JS",
        "vin": "KMHFC46F37A"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "02/28/2014",
        "dateOfIncident": "02/28/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10566554,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE SITTING IN A DRIVE THRU WINDOW AT A COMPLETE STOP, MY CAR EXPERIENCED SUDDEN UNINTENDED ACCELERATION AND CRASHED INTO THE STOP CAR IN FRONT OF ME. THE RATE AT WHICH MY CAR ACCELERATED WAS SO GREAT THAT I HAD WHIP LASH FROM THIS EVENT. I AM SCARED TO DRIVE MY CAR AGAIN. I CALLED HYUNDAI WHO ASSURED ME THAT THIS DID NOT HAPPEN AS I STATED AND THERE IS NOTHING WRONG WITH THEIR CARS. INTERESTINGLY, MY CAR HAD JUST BEEN AT THE DEALER(2 WEEKS)  FOR A TSB ON \"EMISSION CONTROL\" ISSUE. MY CAR WAS SLUGGISH AND STALING WHEN I CAME TO A STOP. NOW 2 WEEKS LATER I AM SLAMMING INTO A STOPPED CAR AT WHAT SEEMED LIKE 60MPH!! PLEASE HELP ME.  *TR",
        "vin": "KMHFC46F87A"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "02/10/2014",
        "dateOfIncident": "10/01/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10563710,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR WHEELS ARE RUSTING ON MY 2007 HYUNDAI AZERA LIMITED. I HAVE BEEN READING THAT THERE IS A RECALL REGARDING THAT SAME YEAR, BUT HAVE BEEN TOLD THAT MY VEHICLE DOESN'T QUALIFY. APPARENTLY, THEY ARE RECALLING THOSE IN THE RUST BELT.  MY VEHICLE HAS NEVER BEEN DRIVEN IN THE SNOW.  I LIVE IN SCOTTSDALE ARIZONA. THIS CAR HAS NEVER HAD ROAD SALT ON IT. WHAT CAN I DO ABOUT THIS PROBLEM.?  THE DEALER SAYS I WOULD HAVE TO PAY TO CORRECT IT. I HAVE READ THAT IT CAN BE HAZARDOUS.   *TR",
        "vin": "KMHFC46F77A"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "01/08/2014",
        "dateOfIncident": "12/15/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10559064,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIR BAG DASH LIGHT REMAINS ON.  *TR",
        "vin": "KMHFC46F47A"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/13/2013",
        "dateOfIncident": "04/04/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10555987,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "DASHBOARD: THE MOLDED BREAKAWAY SEAM COVERING THE FRONT SEAT PASSENGER AIR BAG MOUNTED IN THE DASHBOARD HAS SPLIT ALONG THE BREAKAWAY SEAM. LIQUIDS AND DIRT CAN ENTER. BAG MAY NOT FUNCTION IN AN ACCIDENT. PURCHASED NEW, GARAGED. DEALER WILL NOT REPLACE.  *TR",
        "vin": "KMHFC46F87A"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "11/05/2013",
        "dateOfIncident": "10/25/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10551023,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVERS SIDE SEAT BEGAN ADJUSTING ITSELF WHILE I WAS DRIVING  AND MOVED ALL THE WAY BACK SO THAT I COULD NOT REACH THE BRAKE OR GAS PEDALS. IT ALSO MOVED FORWARD, PINNING ME TO THE STEERING WHEEL. IT HAPPENED AGAIN TO MY TEENAGER WHILE SHE WAS LEARNING TO DRIVE. VERY SCARY FOR A NEW DRIVER AND VERY UNSAFE TO SAY THE LEAST. I HAVE YET TO MAKE AN APPT. AT THE DEALERSHIP SINCE IT IS OUT OF WARRANTY AND I CAN ONLY IMAGINE WHAT IT WILL COST. I HAVE SEEN OTHER OWNERS WITH THE SAME ISSUE AND I HOPE YOU TAKE INTO CONSIDERATION THAT THIS IS A HUGE SAFETY CONCERN AND SHOULD BE PART OF A SAFETY RECALL.  *TR",
        "vin": "KMHFC46F47A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/28/2013",
        "dateOfIncident": "06/01/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10549847,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIR BAG INDICATOR ON THE DASHBOARD ILLUMINATED AND REMAINED ILLUMINATED SOMETIME DURING THE SUMMER OF 2013. I DIDN'T KNOW WHAT IT MEANT - IT WASN'T FLASHING, IT DIDN'T SAY WARNING, IT JUST SAID \"AIR BAG\" - SO I DIDN'T DO ANYTHING ABOUT IT. I FINALLY CALLED THE DEALER, LITHIA HYUNDAI OF RENO, TO FIND OUT WHAT IT MEANT, AND THEY TOLD ME TO BRING IT IN. THEY CHARGED ME $120 TO DIAGNOSE THE PROBLEM.     AFTER A COUPLE OF HOURS, THEY SAID THE PASSENGER SIDE SEAT BOTTOM CUSHION WAS NOT COMMUNICATING WITH THE AIR BAG. THEY OFFERED TO REPAIR THE PROBLEM FOR $5051.87. APPARENTLY, THEY HAD SEEN THE PROBLEM BEFORE, BECAUSE THE SERVICE TECH SAID \"THIS IS WHERE I USUALLY LOSE PEOPLE\" WHEN HE SHOWED ME THE ESTIMATE. THIS IS FOR A CAR THAT, ACCORDING TO EDMONDS, IS WORTH $6500. FROM OTHER COMPLAINTS ON THIS WEBSITE I HAVE FOUND REPAIR ESTIMATES RANGING FROM FREE UP TO $3000. APPARENTLY, HYUNDAI SEES THIS PROBLEM AS A POTENTIAL PROFIT CENTER.    WHEN I GOT ON THIS WEB SITE TO FILE THIS COMPLAINT, I FOUND OUT THERE  HAVE BEEN NUMEROUS OTHER COMPLAINTS REGARDING THE AIR BAGS FOR THE 2007 AZERA. ALSO, THERE WAS A RECALL NOTED FOR REPAIRING THE AIR BAG/SEAT BELT PROBLEM ON MY MODEL AZERA; I WAS NEVER NOTIFIED OF THE RECALL.     *TR",
        "vin": "KMHFC46F47A"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "10/25/2013",
        "dateOfIncident": "08/29/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10549472,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SEAT ADJUSTS ITSELF FORWARD 45 DEGREE INCLINE ON MY BACK.  UNABLE TO STOP OR PREVENT MOVEMENT WITH KNOBS MADE FOR THIS PURPOSE OF ADJUSTING BACK OF SEAT. THE SEAT INCLINES OR RECLINES 90 DEGREE ANGLE EVEN WHEN CAR IS TURNED COMPLETELY OFF. SEAT EXTENDED BACKWARD ON MY 4 YEAR OLD GRANDSON LEGS WHEN HE WAS PROPERLY SEATED IN A CHILD'S CAR SEAT BEHIND THE DRIVERS SEAT. I HAD TO QUICKLY REACH BACK AND MOVE HIS LEGS TO THE SIDE BECAUSE I COULD NOT CONTROL THE MECHANISM IN THE SEAT. AS A RESULT THE CHILD'S CAR SEAT IS NOT PROPERLY SEATED IN THE SEAT BEHIND THE DRIVERS SEAT BUT I HAD TO PUT IT IN THE MIDDLE OF THE BACK SEAT. THE SEAT INCLINES INTERMITTENTLY WITHOUT MY CONTROL AND REMAINS AT A 45 DEGREE ANGLE. THIS PUTS STRAIN ON MY BACK AND PUTS MY BODY TOO CLOSE TO THE STEERING WHEEL AND THE AIR BAG. I AM UNABLE TO UTILIZE CORRECT VISUAL TOOLS SUCH AS SIDE, REAR MIRRORS, OR OBSERVE SAFELY THE SURROUNDING OF MY CAR.  ANOTHER MAJOR CONCERN IS WHEN TRYING TO ADJUST THE SEAT IT MOVES FORWARD (NOT ABLE TO USE KNOBS TO CONTROL THE TENSION) THE SEAT BELT TIGHTENS AND I HAVE TO UNLOCK MY SEAT BELT FOR FEAR OF IT BECOMING TOO TIGHT PUTTING ALL PASSENGERS IN THE IN DANGER OF INJURY.  PLEASE HELP AS I AM RETIRED AND HAVE HAD TO LIMIT THE USE OF A VEHICLE THAT I AM STILL PAYING A NOTE ON.",
        "vin": "KMHFC46F17A"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEATS",
        "crash": false,
        "dateComplaintFiled": "10/23/2013",
        "dateOfIncident": "08/27/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10549237,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI AZERA. THE CONTACT STATED THAT WHILE DRIVING 45 MPH, THE DRIVER'S SEAT MOVED INDEPENDENTLY. THE CONTACT MENTIONED THAT THE SEAT WOULD RECLINE, MOVE FORWARD AND BACKWARD WITHOUT ANY ONE TOUCHING THE CONTROLS OR THE VEHICLE BEING POWERED ON. THE VEHICLE WAS TAKEN TO THE DEALER HOWEVER, THE TECHNICIAN WAS UNABLE TO DUPLICATE THE FAILURE. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 52,000 AND THE CURRENT MILEAGE WAS 52,294.   THE CONSUMER STATED THE SEAT WOULD EVEN MOVE, WHEN THE VEHICLE WAS TURNED OFF.  SHE PURPOSELY LEFT THE SEAT IN THE FORWARD POSITION AND UPON RETURNING TO THE VEHICLE, THE SEAT WAS IN THE REVERSE POSITION. THE DEALER FOUND A SHORT IN THE SEAT SWITCH. UPDATED 12/23/13",
        "vin": "KMHFC46F17A"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEATS",
        "crash": false,
        "dateComplaintFiled": "10/11/2013",
        "dateOfIncident": "10/06/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10547645,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVERS POWERSEAT BACK TILTS FORWARD PINNING DRIVER TO STEERING WHEEL,THIS HAPPENS ON IT\"S OWN, YOU HAVE TO PULL TO SIDE OF ROAD TO REPOSITION SEATBACK! VERY DANGEROUS,DRIVER IS PINNED TO STEERING WHEEL.  *TR",
        "vin": "KMHFC46F27A"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/27/2013",
        "dateOfIncident": "09/21/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10545613,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "HORN FAILED TO OPERATE AN AUDIBLE SOUND WHEN HONKING AT A NEIGHBOR. MAYBE THIS WAS FIRST TIME I WANTED OR NEEDED TO USE THE HORN. CAR NOT DRIVEN MUCH. HAD TO REPLACE BOTH HORNS.  *TR",
        "vin": "KMHFC46F06A"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/21/2013",
        "dateOfIncident": "07/20/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10525953,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR SUNSHADE STUCK MID-WAY THROUGH CYCLE. POSITION OF THICK RETAINING PLASTIC SEVERELY OBSTRUCTS DRIVER'S VIEW. BUTTON UNRESPONSIVE, BUT CAN HEAR MOTOR GRINDING WHENEVER PUTTING CAR IN REVERSE (REAR SUNSHADE DOES NOT MOVE AND STUCK IN THIS POSITION).    FURTHERMORE, ONCE PARKED AND OFF THE ROAD, NO AMOUNT OF MANUAL FORCE RETRACTS THE SUNSHADE INTO ITS RETRACTED POSITION. DRIVER MUST CONTINUE DRIVING IN THIS PRECARIOUS AND LIMITED-VIEW SCENARIO.  *TR",
        "vin": ""
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "06/13/2013",
        "dateOfIncident": "06/13/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10519683,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER'S SEAT MOVES ITSELF FORWARD AND UP AND PINS THE DRIVER INTO STEERING WHEEL, WHILE DRIVING AT 30MPH.  YOU MUST PULL OVER TURN OFF THE CAR TO RE-SET THE SEAT.  THIS HAPPENED 3 TIMES WITHIN 4 MILES.  THE CAR IS 5 1/2 YEARS OLD AND HAS 34,400 MILES ON IT.    I HAVE NOW FOUND NUMEROUS COMPLAINTS OF THIS PROBLEM ON-LINE, ONCE I GOT HOME.  I CALLED HYUNDAI CUSTOMER ASSISTANCE AT 800-633-5151, AND WAS TOLD THERE WAS NO RECALL AND IT IS NOT COVERED UNDER MY WARRANTY.  *TR",
        "vin": "KMHFC46F87A"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/17/2013",
        "dateOfIncident": "08/25/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10512519,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE A CRACK ON OUR DASH BOARD THAT HAS INCREASED AROUND THE AIR BAG ENCLOSURE.  VERY CONCERN THIS WILL POP OUT WITH NO WARNING.  *TR",
        "vin": "KMHFC46F87A"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/13/2013",
        "dateOfIncident": "05/10/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10511778,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE PEDAL WAS HARDER TO PUSH DOWN ON. THE SERVICE ENGINE LIGHT INDICATOR LIT. TOOK IT TO THE NEAREST HYUNDAI REPAIR CENTER BUT THEY REFUSED TO LOOK INTO IT AS I DID NOT HAVE \"AN APPOINTMENT\" AND WAS ASKED TO MAKE AN APPOINTMENT AND COME BACK. TOOK IT TO A NEARBY REPAIR STATION (PEPBOYS) WHO READ THE ERROR AS A FAULTY BRAKE A/B SWITCH BUT COULD NOT RECTIFY IT AS THEY DID NOT HAVE PARTS. TOOK IT TO ANOTHER REPAIR CENTER. THEY REPLACED THE SWITCH AND ADVISED ON THE RECALL. CALLED HYUNDAI CUSTOMER SERVICE BUT THEY REFUSED TO REIMBURSE ON THE CLAIM AS THE EXACT VIN NUMBER WAS NOT PART OF THE RECALL EVEN THOUGH THEY ACKNOWLEDGED THAT THE 2007 AZERA HAD THIS PROBLEM.  *TR",
        "vin": "KMHFC46FX7A"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/01/2013",
        "dateOfIncident": "04/30/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10510303,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI AZERA. THE CONTACT STATED THAT THE ESC AND ABS WARNING LIGHTS ILLUMINATED. THERE THE CONTACT REFERENCED NHTSA CAMPAIGN NUMBER: 09V122000 (SERVICE BRAKES, HYDRAULIC) BUT WAS ADVISED BY THE MANUFACTURER THAT THE VEHICLE WAS NOT INCLUDED IN THE RECALL. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 51,000. *TR",
        "vin": "KMHFC46F17A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/28/2013",
        "dateOfIncident": "01/27/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10494897,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI AZERA. THE CONTACT STATED THAT THE VEHICLE SUDDENLY ACCELERATED AFTER A STOP AND CONTINUED TO ACCELERATE WHILE THE BRAKES WERE DEPRESSED. THE CONTACT WAS ABLE TO PLACE THE VEHICLE IN NEUTRAL TO BRING IT TO A STOP. NO POLICE REPORT WAS TAKEN. THE VEHICLE WAS TOWED TO THE DEALERSHIP. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE AND CURRENT MILEAGE WAS 42,007.  UPDATED 03/20/13*LJ    UPDATED 04/03/2013 *JS",
        "vin": "KMHFC46F17A"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/18/2013",
        "dateOfIncident": "12/07/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10493430,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "CRACKS STARTED DEVELOP CRACKS ON THE DASHBOARD ON THE PASSENGER SIDE OVER THE AIRBAG. CALLED MY LOCAL DEALER, WHERE I PURCHASED MY CAR, UNIVERSAL NISSAN AND HYUNDAI  THEY DID NOT HAVE AN KNOWLEDGE REGARDING CRACKS ON THE PASSENGER SIDE DASHBOARD OVER THE AIRBAG. THEY SUGGESTED THAT I CALL HYUNDAI, I DID. I GOT THE SAME ROUND A ROUND, THEY GAVE ME CASE # 5235732. I'VE SEEN ON THE INTERNET MANY MORE PEOPLE WITH THE SAME PROBLEM. THEIR EMAILS FROM MECHANICS AND HYUNDAI PERSONNEL ACKNOWLEDGE THE ISSUE WITH THE CRACK OVER THE AIRBAG AND THAT DID HAVE THEIR DASHBOARDS EXCHANGED. IF EVER I HAVE AN ACCIDENT AND THE  PASSENGER AIRBAG DOES NOT DEPLOY PROPERLY AND SOMEONE IS INJURED OR DIES SOME ONE WILL ANSWER FOR IT.  *TR",
        "vin": "KMHFC46F67A"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "12/17/2012",
        "dateOfIncident": "12/07/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10488960,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI AZERA. THE CONTACT STATED THAT WHILE DRIVING 20 MPH, THE REAR OF THE DRIVER'S SEAT WOULD MOVE FORWARD INDEPENDENTLY, PUSHING THE CONTACT INTO THE STEERING WHEEL. THE CONTACT HAD TO PLAY AROUND WITH THE SEAT ADJUSTMENT SWITCHES IN ORDER TO GET THE SEAT TO RECLINE. THE VEHICLE WAS TAKEN TO A REPAIR SHOP FOR INSPECTION BUT THEY WERE UNABLE TO DIAGNOSE THE CAUSE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED BUT PROVIDED NO ASSISTANCE. THE FAILURE MILEAGE WAS 65,000.",
        "vin": "KMHFC46F17A"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "10/24/2012",
        "dateOfIncident": "07/01/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10482100,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI AZERA. THE CONTACT STATED THAT THE VEHICLE WAS TAKEN TO THE DEALER FOR SERVICE UNDER NHTSA CAMPAIGN ID NUMBER 10V007000 (SEAT BELTS:FRONT). THE VEHICLE WAS REPAIRED HOWEVER TWO MONTHS LATER, THE AIR BAG WARNING LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN BACK TO THE DEALER FOR DIAGNOSIS WHERE THE CONTACT WAS ADVISED THAT THE FRONT PASSENGER SEAT TENSION SENSOR FAILED AND WAS NOT RELATED TO RECALL. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS CONTACTED AND OFFERED NO ASSISTANCE. THE CONTACT FELT AS THOUGH THE PART WAS THE SAME AS THE RECALL COMPONENT AND SHOULD HAVE BEEN INCLUDED IN THE RECALL CAMPAIGN. THE FAILURE MILEAGE WAS APPROXIMATELY 26,100. THE CURRENT MILEAGE WAS APPROXIMATELY 32,651.",
        "vin": "KMHFC46F07A"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/17/2012",
        "dateOfIncident": "06/06/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10480839,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A CRACK, OUT LINING THE FRONT AIRBAG ON THE PASSENGER SIDE DASH . IT IS GETTING BIGGER.  MY DEALER SAYS THAT IT WON'T EMPLOY ON USE, BUT I DON'T FEEL SAFE. THEY SAID THAT TO FIX IT RIGHT IT WILL NEED TO HAVE A NEW AIRBAG PUT IN BECAUSE THEY WOULD HAVE TO DISENGAGE THE ONE THAT IS IN THERE.  THAT WILL COST US BETWEEN $600.00 AND $700.00. I FEEL THAT, THIS IS A SAFETY ISSUED AND SHOULD BE THE MANUFACTURER RESPONSIBILITY . I HAVE GOTTEN ON LINE AND HAVE SEE SEVERAL OTHER PEOPLE WHO HAVE HAD THIS PROBLEM. MAYBE THERE SHOULD BE A RECALL ON THIS MATTER. I DO NOT HAVE THIS KIND OF MONEY TO GET THIS REPAIRED. COULD YOU GRANTEE ME THAT IT IS SAFE TO DRIVE THIS WAS.  *TR",
        "vin": "KMHFC46F67A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/06/2012",
        "dateOfIncident": "10/01/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10478867,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ALONE AIR BAG LIGHT ON DASH PANEL CAME ON STAYS ON ALL THE TIME. DEALER CLAIMS NOT A WARRANTY OR RECALL RELATED PROBLEM QUOTE AROUND 1200.00 REPAIR.  *TR",
        "vin": "KMHFC46F97A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/03/2012",
        "dateOfIncident": "09/26/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10478527,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I PUSHED DOWN THE GAS TO TRY TO PASS SOMEONE AND THE TRANSMISSION WENT INTO NEUTRAL. I COULD NOT GET IT TO RE ENGAGE AND HAD TO COAST TO THE SIDE OF THE FREEWAY, ALMOST GETTING HIT BY THE DRIVER BEHIND ME. DEALER HAD THE CAR TWO DAYS AND SAID THEY COULD NOT DUPLICATE AND REFUSED TO REPAIR EVEN THOUGH 100K WARRANTY IS IN EFFECT.THIS HAPPENED TWICE BEFORE IN 2010 AND 2011. BOTH TIMES THE CAR WAS BROUGHT TO THE DEALER AND NOTHING DONE. I WAS TOLD BY THE MECHANIC THAT HYUNDAI COULD AUTHORIZE A \"FLIGHT RECORDER\" TO BE INSTALLED IN MY CAR SO WHEN IT HAPPENS NEXT THEY WOULD HAVE A RECORDING OF THE ISSUE. THE DEALER PROMISED TO CALL ME MONDAY BUT SO FAR NO CALL BACK AND NO AUTHORIZATION. MY WIFE WON'T DRIVE THE CAR AND I AM UNEASY WITH IT. SHE WAS GOING TO BUY A HYUNDAI SONATA, BUT NOW REFUSES TO DO SO AND IS TELLING HER COUSINS THE STORY SO THEY ARE ALSO SWITCHING TO TOYOTA. WHAT A SHAME.  *TR",
        "vin": "KMHFC46F87A"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "09/24/2012",
        "dateOfIncident": "09/19/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10476821,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI AZERA. THE CONTACT STATED THAT THE AIR BAG WARNING LAMP ILLUMINATED. THE VEHICLE WAS NOT TAKEN TO THE DEALER. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGE WAS 35,000.  UPDATED 10/31/12*LJ  THE CONSUMER ALSO STATED THE VEHICLE WAS RECALLED FOR A DEFECTIVE SEAT BELT. THE SEAT BELT WAS FIXED, NOT REPLACED.  THE SEAT BELT WARNING LIGHT ILLUMINATED FOR THE SECOND TIME. THE DEALER THEN REPLACED THE SEAT BELT, BUT WITH THE SAME TYPE OF BELT.  UPDATED 10/31/12",
        "vin": "KMHFC46F67A"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "09/17/2012",
        "dateOfIncident": "06/06/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10475589,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER AIR BAG LIGHT COMES ON, PASSENGER SEAT BELT LIGHT COMES ON WHEN NO ONE IS SITTING IN SEAT.  THE MODULE WAS REPLACED ABOUT 75,000 MILES.  *TR",
        "vin": "KMHFC46F77A"
    },
    {
        "components": "STEERING,ELECTRONIC STABILITY CONTROL",
        "crash": true,
        "dateComplaintFiled": "08/20/2012",
        "dateOfIncident": "12/13/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10471621,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "A STEERING FAILURE OCCURRED AT ABOUT 50 MPH WHILE ENTERING A GENTLE CURVE TO THE LEFT. IT CAUSED THE CAR TO VEER TO THE LEFT. CAR LEFT THE TRAVEL LANE AND BRIEFLY ENTERED THE SMOOTHLY PAVED AND LEVEL SHOULDER OF THE DIVIDED ROADWAY. CORRECTION TO THE RIGHT TRIGGERED ESC SYSTEM. AT THAT POINT THE DRIVER INPUT TO STEERING AND BRAKES WERE OVERRIDDEN BY THE ESC SYSTEM. ESC SENT CAR STRAIGHT AHEAD BUT WE WERE ON A CURVE. THIS SENT THE CAR INTO THE GUARD RAIL ON THE RIGHT SIDE OF THE ROAD AFTER CROSSING BOTH LANES BECAUSE THE CAR WOULD NOT RESPOND TO STEERING WHEEL FORCES OR TO BRAKES. THE CAR LIGHTLY GRAZED THE GUARD RAIL CAUSING A SHALLOW DENT IN THE REAR FENDER. BODY DAMAGE WAS LIMITED TO THE REAR FENDER IN THIS CASE AND THE AIRBAGS DID NOT DEPLOY. WHY NOT?  THIS IS, HOWEVER, A DEADLY TYPE OF FAILURE BECAUSE THE CAR SENDS YOU WHEREVER IT WANTS TO GO AND YOU CANNOT DO ANYTHING ABOUT IT. WE COULD HAVE BEEN SENT INTO ONCOMING TRAFFIC OR OVER THE SIDE OF A CLIFF.  AS THE CAR FINALLY SLOWED, THE ESC SYSTEM EVENTUALLY SHUT ITSELF OFF AND WE COULD, ONCE AGAIN, STEER THE CAR.  BUT, THIS WAS WAY TOO LATE TO PREVENT THE DAMAGE. THE CAR DID NOT FAIL IN A FAIL-SAFE MANNER.  THIS EVENT WAS TRIGGERED BY A SUDDEN MECHANICAL FAILURE IN THE STEERING SYSTEM AS EVIDENCED BY VERY BADLY MISALIGNED FRONT WHEELS AND STEERING ANGLE ERRORS IN THE COMPUTER SYSTEM. TIRES DO NOT SHOW UNUSUAL WEAR FROM THE MISALIGNMENT BECAUSE IT HAPPENED SUDDENLY AT THE TIME OF THE INCIDENT.  A HYUNDAI FIELD SERVICE ENGINEER INSPECTED THE CAR. HYUNDAI WILL NOT TELL US WHAT FAILED SO WE DO NOT KNOW ROOT CAUSE. IN FACT, HYUNDAI DENIES THERE WAS A STEERING FAILURE. CAR IS NOT SAFE TO DRIVE.  *TR",
        "vin": "KMHFC46F47A"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "08/10/2012",
        "dateOfIncident": "08/10/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10470151,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI AZERA. THE CONTACT WAS TRAVELING 20 MPH WHEN THE AIR BAG WARNING LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN TO THE DEALER. THE DEALER  CONFIRMED THAT THE SEAT BELT TENSION SENSOR NEEDED TO BE REPLACED. THE MANUFACTURER WAS CONTACTED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 65,000 AND THE CURRENT MILEAGE WAS 75,000.",
        "vin": "KMHFC46D67A"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "08/05/2012",
        "dateOfIncident": "06/29/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10469209,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER SEAT WILL TILT FORWARD FOR NO REASON, PINNING THE DRIVER AGAINST THE STEERING WHEEL. AT ANY SPEED. THIS HAPPENS FREQUENTLY. *TR",
        "vin": "KMHFC46F97A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/02/2012",
        "dateOfIncident": "08/28/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10468914,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG COVERING HAS CRACKED ON EITHER SIDE OF THE PASSENGER SIDE FRONT AIRBAG MODULE.  THIS FIRST OCCURRED BACK IN 2009 AND WAS TOLD BY 2 HYUNDAI DEALERS THAT THIS IS A COMMON PROBLEM WITH THE 2006-2009 AZERAS.  IN READING SEVERAL HYUNDAI AZERA FORUMS (EDMUNDS, HYUNDAI-FORUMS, ETC), IT IS VERY CLEAR TO ME THAT THIS IS INDEED A VERY COMMON PROBLEM.  AS THE VEHICLE WAS OUT OF WARRANTY AT THAT TIME, MY NEAREST DEALER OFFERED TO REPAIR IT FOR $2000.00+.  HOWEVER, AS I FEEL IF THE PROBLEM IS SO COMMON, THAN PERHAPS A NHTSA INVESTIGATION IS WARRANTED WITH THE HOPEFUL EXPECTATION THAT HYUNDAI WILL ISSUE A RECALL AND/OR COVER THE COSTS TO REPAIR.  I AM DEEPLY CONCERNED THAT THE PASSENGER SIDE AIRBAG WILL NOT DEPLOY CORRECTLY IF AND WHEN NEEDED.  PLEASE LOOK INTO THIS SERIOUS SAFETY PROBLEM.  *TR",
        "vin": "KMHFC46F17A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/29/2012",
        "dateOfIncident": "06/05/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10468168,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER AIRBAG MAT IS DEFECTIVE ACCORDING TO THE DEALERSHIP AND SHOULD BE REPLACED AT A COST OF $3000.00+ AS IT IS NOT COVERED UNDER WARRANTY.   *JS",
        "vin": "KMHFC46F97A"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/22/2012",
        "dateOfIncident": "07/16/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10467441,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HARD PLASTIC UNDERCARRIAGE PANEL FELL DOWN TO THE PAVEMENT IN THE FRONT WHERE IT WAS ATTACHED CLOSE TO THE ENGINE BUT REMAINED ATTACHED AT THE REAR OF THE CAR. SO IT WAS SCRAPPING THE PAVEMENT AS THE CAR WAS MOVING ON AN EXPRESSWAY GOING 60 MPH AT THE TIME. IT WAS LUCKY FOR ME THAT IT DID NOT BREAK OFF AND HIT SOME OTHER MOTORIST. THE BOLTS THAT ATTACH IT TO THE CAR FAILED. I READ HYUNDAI FORUMS WHERE THIS HAS HAPPENED TO OTHER AZERA OWNERS. TOOK IT TO THE DEALER AND HAD A NEW UNDERCARRIAGE PANEL INSTALLED.",
        "vin": "KMHFC46F77A"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/13/2012",
        "dateOfIncident": "12/06/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10443694,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE WAS STRUCK WHILE STANDING STILL WAITING FOR A TRAFFIC SIGNAL TO TURN GREEN. THE OTHER VEHICLE WHICH STRUCK MY VEHICLE WAS TRAVELING POSSIBLY 20 - 25 MILES PER HOUR. DAMAGE ALMOST TOTALED MY CAR. MY WIFE WAS DRIVING, ALONE IN THE VEHICLE AND WAS INJURED BUT DID NOT REPORT IT AT THE TIME. SHE WAS INJURED BECAUSE THE AIR BAG DID NOT DEPLOY. SHE WAS WEARING A SEAT BELT WHICH OPERATED CORRECTLY. AT THE TIME, BECAUSE OTHER CARS AND EXCITEMENT, NO ONE PAID ATTENTION OR REPORTED THE FACT THAT THE FRONT SEAT AIR BAG DID NOT DEPLOY. NOW, FOUR YEARS LATE, A RED AIR BAG WARNING LIGHT HAS LIGHTED ALONG WITH ANOTHER FAULTY SEAT BELT WARNING LIGHT FOR PASSENGER SIDE. THE HYUNDAI PEOPLE DENY ANY PROBLEM WITH THE AIR BAG. I BELIEVE THE AIR BAG SYSTEM TO BE DEFECTIVE. I HAVE NEVER BEEN NOTIFIED OF A RECALL.  *TR",
        "vin": "KMHFC46F27A"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/06/2012",
        "dateOfIncident": "07/04/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10442715,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I NOTICED TWO CRACKS ON THE PASSENGER SIDE OF DASHBOARD. THEY FOLLOW THE OUTLINE OF THE AIRBAG. I AM CONCERNED THAT THEY MAY INTERFERE WITH THE OPERATION OF THE AIRBAG IN THE EVENT OF AN ACCIDENT. I HAVE NOTICED THAT THIS CONDITION IS COMMON TO AZERA OWNERS.  *TR",
        "vin": "KMHFC46F47A"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/01/2012",
        "dateOfIncident": "12/22/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10442040,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOOK MY CAR FOR AN ALIGNMENT AT THE HARRISONBURG, VA DEALERSHIP. AFTER THE ALIGNMENT WAS DONE, I WAS TOLD ALIGNMENT WAS UNSUCCESSFUL BECAUSE THE LEFT CASTER AND RIGHT FRONT CAMBER WERE OUT OF SPECS. OUR -LESS THAN A YEAR OLD- TIRES WERE WORN OUT BADLY FROM THE INSIDE AND NEEDED TO BE REPLACED TIGHT AWAY (AN ACCIDENT WAITING TO HAPPEN!) MOREOVER, WE WERE TOLD BY THE DEALERSHIP THAT THE PROBLEM CANNOT BE ADJUSTED OR FIXED AND THAT WE NEED TO SEEK HELP AT A BODY SHOP. OUR CAR HAS ALWAYS BEEN DRIVEN ON REGULAR ROADS, HAS NOT HAD ANY ACCIDENTS OR MAJOR SHOCK THAT WOULD NECESSITATE A BODY SHOP. IT WAS PURCHASED BRAND NEW ON 2007. THIS SEEMS LIKE AN ISSUE WITH THE CAR ITSELF SINCE THE BEGINNING. WE ARE NOW TOLD THAT WE NEED TO PURCHASE NEW TIRES AND COME IN FOR A ROTATION EVERY 4,000 MILES. BELOW IS THE MESSAGE FROM HYUNDAI USA:  THANK YOU FOR CONTACTING HYUNDAI MOTOR AMERICA. WE ARE SORRY TO LEARN OF THE ISSUE THAT YOU ARE HAVING WITH THE ALIGNMENT IN YOUR 2007 HYUNDAI AZERA. THE ALIGNMENT IN YOUR AZERA IS COVERED UNDER THE NEW VEHICLE LIMITED WARRANTY FOR A PERIOD OF ONE YEAR FROM THE DATE OF FIRST USE (IN-SERVICE DATE) OR 12,000 MILES, WHICHEVER OCCURS FIRST. YOUR AZERA HAS EXCEEDED THE WARRANTY BY BOTH TIME AND MILEAGE. FOR THIS REASON, WE ARE UNABLE TO ASSIST YOU WITH THE NEEDED REPAIR COSTS AND APOLOGIZE FOR ANY DISAPPOINTMENT THIS MAY CAUSE YOU.   WE HAVE CONFIRMED WITH HARRISONBURG HYUNDAI THAT THE LEFT FRONT CASTER ON YOUR AZERA IS OUT OF FACTORY SPECIFICATIONS. ADDITIONALLY, THERE IS NOT AN AVAILABLE ADJUSTMENT AVAILABLE THROUGH YOUR DEALERSHIP, WHICH IS WHY A BODY SHOP WAS RECOMMENDED. WE SUGGEST FOLLOWING YOUR DEALERSHIP'S ADVICE TO REPAIR YOUR AZERA. OUR FACTORY-TRAINED TECHNICIANS ARE THE MOST QUALIFIED TO PROVIDE YOU WITH THEIR EXPERT ADVICE. THEY WILL WORK WITH YOU TO ENSURE YOUR AZERA CONTINUES TO OPERATE TO OUR SPECIFICATIONS FOR MANY MILES TO COME.  *TR",
        "vin": "KMHFC46D47A"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,SEATS",
        "crash": false,
        "dateComplaintFiled": "11/28/2011",
        "dateOfIncident": "07/21/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10437459,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIR BAG LIGHT STAYS ON CONTACTED THE DEALER SINCE A RECALL WAS ISSUED BEFORE BUT WAS TOLD RECALL HAS BEEN CLOSED THIS SEEMS LIKE A SAFETY ISSUE AND THE RECALL SHOULD NOT CLOSE, ALSO THE POWER SEAT SWITCH ON DRIVERS SIDE WILL NOT RECLINE BACK SEAT ADJUSTS FORWARD AND NOW IS TOO FAR FORWARD   INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).     *KB  *TR",
        "vin": "KMHFC46F07A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/26/2011",
        "dateOfIncident": "04/01/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10421539,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DASH BOARD HAS A CUT OUT FOR THE PASSENGER SIDE AIR BAG ON TOP AND IS SOMEWHAT PERFORATED AND THINNER IN THAT AREA.  DUE TO A DESIGN DEFECT, THE DASH CRACKS OVER THAT AREA.  THESE HAVE BEEN REPLACED FOR SOME AND NOT OTHERS.  IT APPEARS THAT IT IS UP TO THE LOCAL PEOPLE.  I BROUGHT MY QUESTIONS ABOUT THIS DESIGN TO THE DEALER BEFORE THE WARRANTY EXPIRED, IT THEN CRACKED AND NOW THEY WILL NOT DO ANYTHING TO REPLACE IT.  I HEAR THE REPLACED ONES CRACK TOO.  I HAVE HEARD THAT THEY CAN INTERFER WITH THE AIR BAG.  *TT",
        "vin": "KMHFC46F27A"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/25/2011",
        "dateOfIncident": "07/20/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10415861,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "IMMEDIATELY AFTER HAVING THE DASHBOARD COVER REPLACED DUE TO DEFECT IN COVER, THE ESC/ABS SYSTEM BEGAN ENGAGING AT APPROX 28 MPH ON RIGHT HAND CURVES.  SYSTEM WAS TRYING TO APPLY BRAKE TO ONE OF THE REAR WHEELS. PAVEMENT WAS WARM AND DRY AND THE CAR WAS NOT IN A SKID SITUATION. DEALER AND HYUNDAI CORPORATE ENGINEERS HAVE TRIED TO FIND CAUSE AND CORRECT BUT HAVE NOT BEEN ABLE TO SUCCESFULLY FIX THE PROBLEM. THIS HAS BEEN ONGOING FOR ABOUT A YEAR NOW.  I HAVE CONCERNS THAT THE ESC/ABS SYSTEM(S) MAY NOT FUNCTION PROPERLY WHEN NEEDED IN SLIPPERY-ROAD CONDITIONS.",
        "vin": "KMHFC46F47A"
    },
    {
        "components": "STRUCTURE,INTERIOR LIGHTING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/17/2011",
        "dateOfIncident": "07/12/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10413219,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MY 2007 HYUNDAI AZERA, YOU CAN'T SEE THE DASH LIGHTS IN THE MIDDLE OF THE DASH WHEN THE SUN IS OUT.   ONLY WHEN THE SUN IS OUT, I LIVE IN SOUTH FLORIDA SO ITS ALL THE TIME.  *TR",
        "vin": "KMHFC46F87A"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/16/2011",
        "dateOfIncident": "07/01/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10414239,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "2007 HYUNDAI AZERA DASHBOARD IS CRACKING IN TWO PLACES  RIGHT ABOVE THE PASSENGER AIR BAG. HYUNDAI AND DEALER WILL NOT FIX THE PROBLEM BECAUSE I HAVE 77,000 MILES AND ITS OUT OF WARRANTY. NOT SURE HOW THIS WILL EFFECT THE AIR BAG IN MY 2007 AZERA. IF YOU GO TO NEW HYUNDAI AZERA OWNERS EXPERIENCES CAR FORUM EDMUNDS.COM YOU WILL FIND MANY MORE LIKE MYSELF.",
        "vin": "KMHFC46F67A"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "05/25/2011",
        "dateOfIncident": "05/01/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10402646,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "SEAT BACK ON MY 2007 AZERA WITH 23000 MILES MOVES BY ITSELF FORWARD, PUSHING THE DRIVER INTO THE STEERING WHEEL, WHILE THE CAR IS MOVING.  *TR",
        "vin": "2HKYF18554H"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/20/2011",
        "dateOfIncident": "07/20/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10402231,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT 2007 HYUNDAI AZERA. WHILE DRIVING APPROXIMATELY 35 MPH THE VEHICLE SUDDENLY ACCELERATED ON ITS OWN. THE CONTACT WAS ABLE TO DEPRESS THE BRAKE PEDAL, PLACE THE GEAR SHIFT IN NEUTRAL AND PULL ONTO THE SIDE OF THE ROAD. THE VEHICLE WAS TOWED TO THE DEALER. THE TECHNICIANS STATED THE FLOOR MAT WAS JAMMED UNDER THE ACCELERATOR PEDAL CAUSING THE FAILURE AND THAT THE ENGINE NEEDED TO BE REPLACED. THE FAILURE OCCURRED TWICE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 22,750. UPDATED 06/16/11*LJ",
        "vin": "KMHFC46F47A"
    },
    {
        "components": "VISIBILITY,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/11/2011",
        "dateOfIncident": "03/10/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10389809,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING ON A HIGHWAY,THE GLASS OF MY SUNROOF 'EXPLODED SPONTANEOUSLY\". THE TIME OF INCIDENT WAS 6:15 AM, THE TEMPERATURE WAS AROUND 45 DEGREES AND NO ADVERSE WEATHER CONDITIONS. I WAS TRAVELING UNDER NO OVERPASSES, AND NO VEHICLES IN FRONT OF ME. I NOTICE NO OBJECT STRIKING MY CAR, MY PASSENGER AND I HEARD A NOISE LIKE A GUN SHOT. I HAD THE SUN SHADE CLOSED,SO NO GLASS ENTERED INTERIOR OF CAR, ABOUT 80% OF THE SUNROOF BLEW OUT LEAVING GLASS AROUND RIM INTACT AND THE BLOWN GLASS CAUSING DAMAGE TO TOP AND TRUNK. OTHER DRIVER BEHIND ME WERE BLOWING THEIR HORN TO TELL ME IT HAPPEN PLUS I COULD HEAR WIND, I STOP AND LOOKED AT THE DAMAGE THE REMAINING GLASS HAD A UPWARD BLOWN OUT APPEARANCE WITH NO GLASS LEFT ON SUN SHADE. I KNOW THIS IS TEMPERED GLASS WHICH BREAKS INTO TINY PIECES. IT WAS GOOD I HAD THE SUN ROOFS CLOSED OR I MIGHT HAVE HAD FLYING GLASS IN EYES CAUSING A ACCIDENT. I BELIEVE THIS WAS A MANUFACTURER DEFECT. IF A ROCK HAD HIT IT THE GLASS WOULD HAD FELL INWARD NOT OUT.  *TR",
        "vin": "KMHFC46F57A"
    },
    {
        "components": "AIR BAGS,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "02/12/2011",
        "dateOfIncident": "01/15/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10381663,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER AIR BAG / SEAT BELT ASSEMBLY FAILURE. AIR BAG WARNING LIGHT WAS ILLUMINATED CONTINUOUSLY. DEALER SERVICE DEPT. STATED PASSENGER SEAT BELT ASSEMBLY AND AIR BAG WERE NOT OPERATIONAL, REQUIRING REPLACEMENT OF PASSENGER SEAT BELT TENSIONER.  *TR",
        "vin": "KMHFC46F77A"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/02/2011",
        "dateOfIncident": "01/02/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10373802,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "2007 AZERA DASHBOARD STARTED CRACKING. *TR",
        "vin": ""
    },
    {
        "components": "VISIBILITY,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/02/2010",
        "dateOfIncident": "04/02/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10346791,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2007 HYUNDAI AZERA HAS A CRACK ON THE DASHBOARD. THIS CONCERN WAS NOTICED AROUND THE 65,000 MILE RANGE. THE CRACK APPEARS TO FOLLOW THE LINE OF THE PASSENGER SIDE AIRBAG AND THE CAR IS TYPICALLY PARKED IN A GARAGE, NOT SUBJECTED TO ELEMENTS, AND HAS NOT ENDURED ANY UNUSUAL STRESS TO CAUSE THE CRACK.    ADDITIONALLY, THE REAR SUNSHADE THAT COMES STANDARD WITH MY CAR'S MODEL SEEMS TO HAVE A FAULTY MOTOR AND NO LONGER AUTOMATICALLY GOES DOWN WHEN IN REVERSE, AS IT WAS DESIGNED TO DO, I TRUST FOR SAFE VISIBILITY. THE SUNSHADE FEATURE BEGAN TO FAIL AROUND THE 70,000 MILE RANGE AND WOULD AT TIMES STOP AT THE PARTWAY UP/DOWN RANGE, CREATING POOR VISIBILITY DUE TO THE FRAME SHOWING WHERE IT SHOULD NOT SHOW IN THE REAR WINDOW.    I HAVE A NUMBER OF EMAILS FROM HYUNDAI WHERE THEY STATE THAT THESE ITEMS ARE NOT COVERED UNDER WARRANTY. THEY HAVE FAILED TO ADDRESS MY SAFETY CONCERNS. IN PARTICULAR, THE AIRBAG COULD DEPLOY WITHOUT CAUSE OR MIGHT DEPLOY MORE FORCEFULLY THAN INTENDED DUE TO THE CRACK.    HYUNDAI REFUSES TO CORRECT THESE PROBLEMS AT NO EXPENSE TO ME, HAS NOT ADDRESSED MY SAFETY CONCERNS, AND IN TAKING THIS POSITION, IS FAILING TO STAND BY THE WORKMANSHIP/QUALITY OF THEIR PRODUCT. *TR",
        "vin": "KMHFC46F57A"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "07/21/2010",
        "dateOfIncident": "07/10/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10344437,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "2007 HYUNDAI AZERA REAR SUN SHADE MALFUNCTION. SUNSHADE GETS STUCK WHILE EXPANDING / RETRACTING, POSING AN UNSAFE SITUATION BY RESTRICTING DRIVER'S VISIBILITY THROUGH THE REAR WINDOW WHILE BACKING THE CAR UP. *TR",
        "vin": "KMHFC46F87A"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "06/08/2010",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10335911,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "2007 HYUNDAI AZERA. CONSUMER STATES REPEATED USE OF THE FRONT PASSENGER SEAT BELT CAUSED DAMAGE TO THE SEAT BELT TENSION SENSOR, THEREFORE ILLUMINATING THE AIR BAG WARNING INDICATOR, RENDERING IT INEFFECTIVE IN THE EVENT OF A CRASH *TGW  THE DEALER INFORMED THE CONSUMER THE PART WAS ON BACKORDER. THE CONSUMER STATED IT HAS BEEN OVER A MONTH.",
        "vin": ""
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/10/2010",
        "dateOfIncident": "03/08/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10329804,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I NOTICED TWO CRACKS ON TOP OF THE DASHBOARD ON THE PASSENGER SIDE. I WAS TOLD IT WAS A DEFECT IN INSTALLATION OF THE AIRBAG.  IT WAS REPAIRED BY THE DEALER WITH NO EXPENSE TO ME. *TR",
        "vin": "KMHFC46F47A"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/10/2010",
        "dateOfIncident": "11/01/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10329824,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE 2 CRACKS ON MY DASH WHICH APPEAR TO OUTLINE THE PASSENGER AIR BAG.  I NOTICED A ~ 1 INCH CRACK SEVERAL MONTHS AGO BUT AFTER READING A RECENT REPORT ON THIS WEBSITE, I TOOK ANOTHER LOOK.  I NOW HAVE 2 VERY STRAIGHT CRACK LINES MEASURING ABOUT 6 INCHES ON EITHER SIDE OF WHAT APPEARS TO BE THE PASSENGER AIR BAG. *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/30/2010",
        "dateOfIncident": "03/08/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10328267,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2007 HYUNDAI AZERA ON 06/20/2007.    RECEIVED A FORM LETTER NOTICE OF RECALL FROM HYUNDAI MOTOR AMERICA ON 3/11/2010.    ESSENTIALLY, THE NOTICE SAID THAT IF THE \"AIR BAG\" WARNING LIGHT IN THE INSTRUMENT CLUSTER WILL ILLUMINATE TO INDICATE A PROBLEM EXISTS IN THE RIGHT FRONT SEAT AIR BAG SYSTEM...THAT THE AIR BAG WILL NOT DEPLOY IN THE EVENT OF A CRASH.    I IMMEDIATELY CALLED THE DEALER AND TOOK CAR IN TO FIX THE AIR BAG SITUATION. AFTER SIX HOURS OF WAITING, I WAS INFORMED THAT THE DEALER DID NOT HAVE THE PART(S) NEEDED FOR THE REPAIR. I WAS TOLD TO CALL BACK IN TWO WEEKS TO SCHEDULE ANOTHER FIX ATTEMPT.    I CALLED ON APRIL 8. THE SERVICE DEPT. TOLD ME THAT THE PART WAS NOT IN YET AND TO \"CALL IN TEN DAYS OR SO.\" ON APRIL 20TH AND WAS TOLD THE PART(S) WERE ON \"NATIONAL BACK ORDER.\"    AT THIS POINT I ASKED FOR ANOTHER AZERA TO DRIVE WHOSE AIR BAG SYSTEM WORKS UNTIL THEY WERE ABLE TO FIX THE RECALL PROBLEM. (I DIDN'T WANT TO DRIVE WITH MY WIFE IN THE FRONT PASSENGER SEAT AND RUN THE RISK OF HER BEING INJURED OR KILLED IF MY CAR WAS INVOLVED IN AN ACCIDENT.)    THE DEALER'S RESPONSE TO MY REQUEST FOR A LOANER WAS DENIED.    QUESTIONS:  --IS THE DEALER (OR HYUNDAI MOTOR AMERICA) REQUIRED BY LAW TO PROVIDE FOR MY SAFETY WITH A LOANER CAR?    --THE DESCRIPTION OF A \"NATIONAL BACKORDER\" SEEMS LIKE IT MAY TAKE SEVERAL MONTHS BEFORE MY 2007 AZERA CAN BE REPAIRED? IS THERE ANYTHING YOU CAN DO TO HOLD HYUNDAI'S FEET TO THE FIRE TO SPEED THIS UP?    --ANY SUGGESTIONS FOR ME GOING FORWARD?    THANK YOU FOR YOUR TIME AND INTEREST. *TR",
        "vin": "KMHFC46F67A"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "04/28/2010",
        "dateOfIncident": "03/15/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10327904,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "HYUNDAI ISSUED A RECALL NOTICE FOR THE OCCUPANT RESTRAINT SYSTEM BUT DID NOT HAVE THE REPLACEMENT PARTS AT THE DEALERS.  SO MY 2007 AZERA WAS GIVEN A PARTIAL FIX ABOUT 6 WEEKS AGO AND FOR THE REST OF THE FIX I AM STILL WAITING FOR THE DEALER TO GET THE SEAT BELT RETRACTOR IN STOCK.  MEANWHILE THE AIR BAGS ARE DISABLED!    I DON'T UNDERSTAND HOW HYUNDAI WOULD ISSUE A RECALL NOTICE FOR A SAFETY ITEM BUT NOT EQUIP ITSELF WITH THE REQUIRED COMPONENTS FOR THE FIX! *TR",
        "vin": "1MEFM58UX3A"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/14/2010",
        "dateOfIncident": "04/03/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10325585,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD 2 CRACKS APPEAR ON MY PASSENGER SIDE DASH BOARD IN THE AREA OF THE AIR BAG.   *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/02/2010",
        "dateOfIncident": "08/19/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10323447,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 HYUNDAI AZERA. WHILE DRIVING APPROXIMATELY 35 MPH, THE CONTACT ATTEMPTED TO APPLY THE BRAKES BUT THE VEHICLE DID NOT SLOW DOWN. THE ACCELERATOR PEDAL WAS STUCK AND THE VEHICLE BEGAN TO ACCELERATE. THE CONTACT APPLIED REPEATED PRESSURE TO THE BRAKE PEDAL UNTIL THE VEHICLE STOPPED. THE SAME FAILURE OCCURRED AGAIN WHILE THE CONTACT WAS DRIVING APPROXIMATELY 35 MPH. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALERSHIP WHERE THE CONTACT WAS INFORMED THAT THE FAILURE WAS DUE TO THE FLOOR MATS.  THE FAILURE MILEAGE WAS 4,414 THE CURRENT MILEAGE IS 31,071. UPDATED 06/08/10.*LJ",
        "vin": "KMHFC46D07A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/23/2010",
        "dateOfIncident": "05/12/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10321622,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI AZERA. WHILE DRIVING AT SPEEDS OF 30 MPH, THE ACCELERATOR PEDAL BECAME STUCK IN THE OPEN THROTTLE POSITION CAUSING THE VEHICLE TO ACCELERATE. THE CONTACT WAS ABLE TO STOP THE VEHICLE BY DEPRESSING THE BRAKE PEDAL. THE DEALER ADVISED THE FAILURE WAS DUE TO DEFECTIVE FLOOR MATS IN THE VEHICLE. THE CONTACT CONFIRMED HE HAD EXPERIENCED THE FAILURE ON TWO ADDITIONAL OCCASIONS. THE APPROXIMATE CURRENT MILEAGE WAS 33,071 AND THE FAILURE MILEAGE WAS 2,025 UPDATED 06/08/10. *LJ  UPDATED 08/18/10",
        "vin": "KMHFC46D07A"
    },
    {
        "components": "SERVICE BRAKES, ELECTRIC",
        "crash": false,
        "dateComplaintFiled": "12/29/2009",
        "dateOfIncident": "12/20/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10297299,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "2007 HYUNDAI AZERA (6 CYLD).  ENGINE INTERMITTENTLY REVS TO HIGH SPEED WHEN BRAKING.  SEVERAL TRIPS TO THE DEALER HAVE FAILED TO RESOLVE THE ISSUE.  THIS OCCURS AS THE CAR IS DOWNSHIFTING (USUALLY AS PRESSURE IS APPLIED TO THE BRAKE). *TR",
        "vin": "KMHFC46F37A"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/13/2009",
        "dateOfIncident": "12/13/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10295525,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN FIRST DRIVEN THE VEHICLE VIBRATES. THIS SEEMS TO LESSEN AFTER BEING DRIVEN FOR A WHILE. I HAVE INSTALLED NEW MICHELIN TIRES AND HAVE HAD THEM ROTATED BUT THE VIBRATION PERSISTS. I SUSPECT A SUSPENSION ISSUE BUT HAVE NOT TAKEN IT TO THE DEALER YET. THIS HAPPENS REGARDLESS OF THE TEMPERATURE OUTSIDE. *TR",
        "vin": "KMHFC46F77A"
    },
    {
        "components": "SUSPENSION,TIRES",
        "crash": false,
        "dateComplaintFiled": "11/13/2009",
        "dateOfIncident": "08/07/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10292099,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE FELT A VIBRATION AT VARIOUS SPEEDS IN THE UPPER, LOWER ARM AND BALL BEARING... BUT IT'S EXACTLY SAME.  THEY FINALLY SAID, IT MIGHT BE A TIRE PROBLEM.... WELL, I BOUGHT ALL NEW TIRES BECAUSE OF THIS NOIS... THEY ARE STATING THE CAUSE IS BECAUSE OF THE TIRE PATTERN, WHEN I KNOW THAT IS NOT CAUSE OF THE CURRENT PROBLEM.... *TR",
        "vin": "KMHFC46F57A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/04/2009",
        "dateOfIncident": "10/03/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10290981,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI AZERA. THE PASSENGER FRONT AIR BAG WARNING LIGHT WAS ILLUMINATED ON THE INSTRUMENT CONTROL PANEL. THE VEHICLE WAS TAKEN TO THE HYUNDAI DEALER THREE TIMES.  THE AIR BAG  MODULE AND HARNESS UNDER THE FRONT SEAT WAS REPAIRED. THE REPAIRS DID NOT REMEDY THE FAILURE. THE FAILURE MILEAGE WAS 17,000.",
        "vin": "KMHFT46FX7A"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "09/30/2009",
        "dateOfIncident": "05/18/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10285812,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 HYUNDAI AZERA. THE CONTACT STATED THAT THE DISTANCE BETWEEN THE ACCELERATOR AND BRAKE PEDAL WAS TOO SMALL. AS A CONSEQUENCE, HE APPLIED PRESSURE TO BOTH PEDALS, WHICH CAUSED UNINTENDED VEHICLE ACCELERATION. HE NOTIFIED  THE DEALER AND IS WAITING FOR A RESPONSE. THE FAILURE MILEAGE WAS 2,000 AND THE CURRENT MILEAGE WAS 11,000.    UPDATED 12/07/09  *BF   THE CONSUMER CRASHED INTO ANOTHER VEHICLE DUE TO THE HITTING BOTH PEDALS AT THE SAME TIME. UPDATED 12/09/09.*JB",
        "vin": "KMHFC46F57A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/01/2009",
        "dateOfIncident": "08/15/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10282560,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 HYUNDAI AZERA. WHEN ATTEMPTING TO ACCELERATE, THE PEDAL STUCK TO THE FLOOR WHICH DISABLED THE VEHICLE. AS A CONSEQUENCE, HIS RISK FOR A VEHICLE CRASH INCREASED. THE VEHICLE IS CURRENTLY AT THE DEALER IN WHICH A TECHNICIAN IS IN PROCESS OF DETERMINING THE CAUSE OF THE FAILURE AND ADMINISTERING A REMEDY. THE FAILURE AND CURRENT MILEAGES WERE 14,999.",
        "vin": "KMHFC46F67A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/15/2009",
        "dateOfIncident": "08/15/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10273892,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2007 HYUNDAI AZERA DEVELOPED A 4 INCH CRACK IN THE PASSENGER SIDE DASH OVER THE AIRBAG.  PASSENGER AIRBAG LIGHT INDICATED AIRBAG IS OFF AND DOES NOT COME ON WHEN SEAT IS OCCUPIED. *TR",
        "vin": "KMHFC46F77A"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/23/2009",
        "dateOfIncident": "02/23/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10259695,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "2007 HYUNDAI AZERA BRAKE ISSUES. AT 11K MILES ROTORS WERE MACHINED. AT 12500 MILES, ROTORS WERE REPLACED. PADS NEVER REPLACED. AT 22K MILES CAR SHAKES A GREAT DEAL DUE TO HOT SPOTS ON ROTORS. DEALERSHIP MACHINED AGAIN BUT DOES NOT REPLACE PADS. SO THE CAR HAS 23K MILES ON IT WITH TWO SETS OF ROTORS AND 3X MACHINED ROTORS. BUT IT IS MY DRIVING HABITS EVEN THOUGHT I HAVE TWO OTHER VEHICLES, ONLY DRIVE HIGHWAY, AND HAVE NO OTHER ISSUES WITH BRAKES ON THE OTHER CAR. ROTORS/BRAKES VERY POOR ON 07 AZERA. *TR",
        "vin": "KMHFC46F57A"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/17/2008",
        "dateOfIncident": "08/26/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10245785,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 HYUNDAI AZERA LIMITED.  THE CONTACT STATED THAT THE DASHBOARD REFLECTS ONTO THE WINDSHIELD AT CERTAIN TIMES OF THE DAY, WHICH CAUSES VISION FAILURE.  SHE DROVE THE VEHICLE TO THE DEALER AND THEY STATED THAT THE FAILURE WAS DUE TO THE DESIGN.  THE MANUFACTURER REFERRED HER TO THE DEALER.  THE CURRENT MILEAGE WAS 6,400 AND FAILURE MILEAGE WAS 600.",
        "vin": "KMHFC46F27A"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/27/2008",
        "dateOfIncident": "03/27/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10225850,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER SIDE DASH HAS AN APPROXIMATE 2 INCH CRACK OVER THE AIR BAG.  *TR",
        "vin": "KMHFC46F07A"
    },
    {
        "components": "VEHICLE SPEED CONTROL,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "03/16/2008",
        "dateOfIncident": "03/14/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10221333,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            },
            {
                "manufacturer": "MACNEIL AUTOMOTIVE PRODUCTS LIMITED",
                "productMake": "WEATHERTECH",
                "productModel": "W36 (FLOOR MATS)",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "I OWN A 2007 AZERA LIMITED WITH 14,000. PURCHASED AUG 2007  FIRST LET ME SAY I LOVE THIS CAR ... HOWEVER !!!       THIS IS SCARY: 2 MTHS AGO I WAS ON AN INTERSTATE IN NH AND FLOORED THE ACCELERATOR \"KICKED-DOWN) TO PASS... THE CAR ACCELERATED AND WOULD NOT STOP ACCELERATING UNTIL I SHIFTED TO NEUTRAL...THEN IT WENT BACK TO NORMAL RPM... I THOUGHT MY WINTER FLOOR MAT GOT STUCK...MOVED IT AND ALL APPEARED FINE..   THEN YESTERDAY IT HAPPENED AGAIN... HOWEVER THIS TIME IT WAS ON A CURVEY ROAD IN VT WITH A 45MPH SPEED LIMIT... AT 70MPH.. SHIFTED TO NEUTRAL AND APPLIED BREAKS AS A BIG CURVE WAS APPROACHING.. THIS TIME I KNOW IT WAS NOT THE FLOOR MAT ...   DURING BOTH INCIDENTS, CRUISE CONTROL WAS NOT ACTIVATED.  WILL BE TAKING CAR TO DEALER TOMORROW 3-17-08.  *TR",
        "vin": "KMHFC46F27A"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/18/2008",
        "dateOfIncident": "07/27/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10215364,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 HYUNDAI AZERA.  THE VEHICLE HAS FAILED TO START AND HAS BEEN TAKEN TO THE DEALER APPROXIMATELY SIX TIMES.  THE FAILURE HAS NOT BEEN CORRECTED.  THE CURRENT MILEAGE WAS 3,400 AND FAILURE MILEAGE WAS 2,000.   UPDATED 02-14-08 *BF     UPDATED 05/19/08  THE CONSUMER STATED DEALER FOUND THE DEFECT ON 01/24/08 WHICH WAS AN ELECTRICAL PROBLEM AND A NEW BATTERY WAS INSTALLED. UPDATED 02/14/08  *TR UPDATED 05/19/08",
        "vin": "KMHFC46F07A"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "08/20/2007",
        "dateOfIncident": "05/21/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10200157,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 HYUNDAI AZERA.  THE CONTACT STATED THAT WHEN THE DRIVER SIDE WINDOW IS ROLLED UP, THE EXTERIOR SIDE MIRROR REFLECTS THE AIR CONDITIONING VENT.  THIS MAKES IT IMPOSSIBLE FOR HIM TO SEE THE TRAFFIC IN THE REAR OF THE VEHICLE.  HE TOOK THE VEHICLE TO THE DEALER AND WAS INFORMED THAT NOTHING COULD BE DONE BECAUSE THAT WAS HOW THE VEHICLE WAS MANUFACTURED.  THE CURRENT MILEAGE WAS 2,000 AND FAILURE MILEAGE WAS 50.",
        "vin": "KMHFC46F77A"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/10/2007",
        "dateOfIncident": "07/16/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10199058,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 HYUNDAI AZERA.  EVER SINCE THE VEHICLE WAS PURCHASED, THE STEERING COLUMN HAS BEEN SHAKING.  THE FAILURE OCCURS WHILE DRIVING 40 MPH.  AFTER THE CONTACT TOOK THE VEHICLE TO THE DEALER FOUR TIMES, THEY STATED THAT IT WAS STEERING FAILURE AND COULD NOT BE REPAIRED.  THE CURRENT AND FAILURE MILEAGES WERE 550.",
        "vin": "KMHFC46F87A"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/02/2007",
        "dateOfIncident": "06/25/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10195143,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "AZERA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 HYUNDAI AZERA.  THE CONTACT STATED THAT THE HEADLAMP'S LOW BEAMS ARE DEFECTIVE.  THE TOP PORTION OF THE BEAMS FAIL TO PROVIDE CLEAR VISIBILITY.  THE CONTACT ALSO STATED THAT THEY DO NOT PRODUCE ENOUGH LIGHT WHEN TRAVELING IN CERTAIN AREAS, INCLUDING UPHILL AND DOWNHILL.  THE FAILURE WAS NOTICED WHILE DRIVING 35 MPH.  THE CURRENT MILEAGE IS 470 AND FAILURE MILEAGE WAS 175.",
        "vin": "KMHFC46F57A"
    }
]