[
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/23/2022",
        "dateOfIncident": "02/16/2022",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11453563,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "Power assist  light appeared in dash causing car to go in manual steering and extremely difficult to turn car, pulled over restarted vehicle light went off and power assist steering started working than happened two more times took car to dealer. Was told maybee steering column may need to be replaced 2 to 3000$, Called Hyundai customer service they said Hyundai would repair and gave me info to call warranty dept who  informed me that my vehicle was over 10 years old and not covered and informed me that customer care dept.did not know what they are doing. ( they admitted that there was a problem with this vehicle and steering recalls were done, I am the original owner of this vehicle they confirmed this from there records and I never received any notice of any recall. This vehicle has only 70000 miles. Hyundai should help me with repairs) the car is still at the dealer who is still trying to get me some help.",
        "vin": "Kmhdu46d97u"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/27/2022",
        "dateOfIncident": "01/27/2022",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449112,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I have the current vehicle for a few months and its been working quite finr, there suddenly been a transmission problem, i have seen a few reviews of users of the same listed vehicle to have same problem. Kindly investigate and look into this, as a concerned customer. i like hyundai but its important to have this issues resolved for safety reasons.",
        "vin": "KMHDU46D17U"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/27/2021",
        "dateOfIncident": "10/26/2021",
        "fire": true,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438336,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2007 Hyundai Elantra. The contact stated that after parking and attempting to restart the engine smoke was present coming from under the vehicle. The contact opened the hood and discovered flames were present coming from within the engine compartment. The fire department was called to the scene and extinguished the flames. A fire report and police report was taken at the scene.  The vehicle was towed to the home. The cause of the failure was not yet determined. The manufacturer was notified of the failure. The local dealer was not notified. The failure mileage was 176,000.",
        "vin": "KMHDU46D87U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/30/2021",
        "dateOfIncident": "09/29/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434990,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I felt as if I couldn’t control the car on the road, making a noise especially when hit the slightest bump. I had someone follow me to repair station to drop off the car.  The mechanic said there was a lot of rust on frame crossbars, one place totally broke off. He said to check with Hyundai about the rust of the frame and not to drive the car.  It is frightening to know that the frame parts rusted and broke like that. I have never had that happen to a car before. It is not safe to drive and when I called Hyundai they said there were no recalls with rust and frame breakage in my car. Other Hyundai’s  were recalled for this very thing, I’m confused why mine has not been recalled for this safety issue.",
        "vin": "KMHDU46D77U"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/14/2021",
        "dateOfIncident": "09/14/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432920,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2007 Hyundai Elantra. The contact received notification of NHTSA Campaign Number: 20V061000 (Service Brakes, Hydraulic). The contact stated that while driving at an undisclosed speed, the brakes seized and made abnormal noises. The contact was able to drive to her residence. The dealer and manufacturer were not made aware of the failure. The vehicle was not diagnosed nor repaired. The failure mileage was 84,443.",
        "vin": "KMHDU46D07U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/28/2021",
        "dateOfIncident": "07/27/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11426881,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2007 Hyundai Elantra. The contact stated while depressing the brake pedal, the brake lights would not illuminate. The vehicle was not diagnosed nor repaired. Upon investigation, the contact associated the failure with NHTSA Campaign Number: 13V113000 (Exterior Lighting) however, the VIN was not included. The manufacturer was not informed of the failure. The failure mileage was approximately 159,544.",
        "vin": "KMHDU46D37U"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/05/2021",
        "dateOfIncident": "04/04/2021",
        "fire": true,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406480,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 HYUNDAI ELANTRA. THE CONTACT STATED THAT UPON START UP OF THE VEHICLE, HER BRAKES WOULD NOT FUNCTION UPON DEPRESSION OF THE BRAKE PEDAL; THE EMERGENCY BRAKE AND THE ABS WARNING LIGHTS ILLUMINATED. THE CONTACT IMMEDIATELY PULLED BACK INTO HER DRIVEWAY AND SHUT OFF THE VEHICLE. AS THE VEHICLE WAS OFF, A WHITE COLOR SMOKE BEGAN TO EMIT FROM THE ABS SYSTEM OF THE ENGINE. UPON FURTHER INSPECTION, THE CONTACT'S HUSBAND SAW THAT THE WIRES CONNECTED TO THE ABS HAD BEGAN TO MELT; THEREFORE, HE DISCONNECTED THE BATTERY AND FUSES. THE VEHICLE HAD YET TO BE SERVICED OR DIAGNOSED FOR THE FAILURE. UPON INVESTIGATION, THE CONTACT LINKED HER FAILURE TO NHTSA CAMPAIGN NUMBER: 20V061000 (SERVICE BRAKES, HYDRAULIC); HOWEVER, THE VIN WAS NOT INCLUDED IN THE RECALL. THE CONTACT ATTEMPTED TO CALL THE MANUFACTURER BUT WAS UNABLE TO REACH A REPRESENTATIVE. THE FAILURE MILEAGE WAS 125,000.",
        "vin": "KM8DU46D37U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/26/2021",
        "dateOfIncident": "02/12/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404968,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I SEVICE MY 2007 HYNDAI ELANTE GLS  SE LIMITED AT BILL HYNDIA WILLMINGTON MA.LAST 12 YEARS THIS YEAR THEY TOLD ME REAR END IS ROTTED OUT NOT SAFE TO DRIVE.1RST NOTICE FROM THEM .THE SERVICE MANGER SAID YOUR NOT ALONE 1000 OF THEM TRYING TO GET USED PARTS AND EVERY REAREND THEY LOOK AT THAAT WILL FIT MY CAR UP TO 2012 IS COMPLETLY ROTTED OUT THESE VECHILES ARE UN SAFE TO DRIVE THEY COVERED FRAME IN RUBBER WATER GETS BEHIND IT ROTS IT OUT.ON MY CAR SPRINGS WERE GOING THREW FRAME",
        "vin": "KMHDU46D87U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/16/2021",
        "dateOfIncident": "01/31/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403225,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI ELANTRA. THE CONTACT STATED WHILE DRIVING AT A SLOW SPEED, THE REAR TRAILING ARM FRACTURED WITHOUT WARNING. THE VEHICLE WAS TOWED TO THE CONTACT'S RESIDENCE. THE VEHICLE WAS THEN TOWED TO GARVEY HYUNDAI PLATTSBURGH (271 TOM MILLER RD, PLATTSBURGH, NY 12901) TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THE CROSS MEMBER HAD ROTTED, THE REAR CARRIER AND SPRINGS WERE FRACTURED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 112,000.",
        "vin": "KMHDU46D87U"
    },
    {
        "components": "SUSPENSION,STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/16/2021",
        "dateOfIncident": "01/31/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403290,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WASN'T ON A MAIN ROAD WAS COMING DOWN A DRIVEWAY AND HEARD A NOISE THOUGHT MAYBE IT WAS BUILT UP SNOW BUT THE CAR JUST FELL APART THE TRAILING ARM/ CROSS MEMBER CAME RIGHT OFF THE CAR HAD TO GET IT TOWED TO MY HOME",
        "vin": "KMHDU46D87U"
    },
    {
        "components": "SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/23/2021",
        "dateOfIncident": "12/10/2017",
        "fire": true,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397615,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2007 HYUNDAI ELANTRA. THE CONTACT STATED AFTER PARKING THE VEHICLE IN THE DRIVEWAY, THE VEHICLE'S ENGINE WAS ON FIRE. NO WARNING LIGHTS ILLUMINATED PRIOR TO THE FAILURE. THE VEHICLE WAS TOWED TO A JUNK YARD WHERE IT WAS DEEMED TOTALED. THE CONTACT STATED SHE LATER RECEIVED RECALL NOTIFICATION WITH NHTSA CAMPAIGN NUMBER: 20V061000 (SERVICE BRAKES, HYDRAULIC) AND SUSPECTED THE VEHICLE WAS EXPERIENCING THE RECALL FAILURE. THE DEALER AND MANUFACTURER WERE NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 140,000.",
        "vin": "KMHDU46D27U"
    },
    {
        "components": "SERVICE BRAKES, AIR",
        "crash": false,
        "dateComplaintFiled": "02/01/2021",
        "dateOfIncident": "01/29/2021",
        "fire": true,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11391064,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI ELANTRA. THE CONTACT STATED WHILE THE VEHICLE WAS PARKED IN THE DRIVEWAY, IT SPONTANEOUSLY CAUGHT FIRE. THERE WERE NO REPORTED INJURIES. THE FIRE DEPARTMENT EXTINGUISHED THE FIRE. THERE WAS NO POLICE REPORT FILED. THE LOCAL DEALER WAS NOT CONTACTED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE CONTACT STATED THE FAILURE WAS SIMILAR TO NHTSA CAMPAIGN NUMBER: 20V061000 (SERVICE BRAKES, HYDRAULIC). THE FAILURE MILEAGE WAS 160,000.",
        "vin": "KMHDU46D97U"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/23/2020",
        "dateOfIncident": "09/01/2020",
        "fire": true,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384674,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2007 HYUNDAI ELANTRA. THE CONTACT STATED THAT SHE PARKED HER VEHICLE AT HOME FOR ABOUT AN HOUR AND A NEIGHBOR INFORMED HER OF A FIRE IN THE FRONT ENDUNDER THE HOOD. THE VEHICLE WAS PARKED IN THE CONTACT'S DRIVEWAY AND THE FIRE DEPARTMENT WAS CONTACTED TO PUT OUT THE FLAMES. THE VEHICLE WAS COMPLETELY ENGULFED IN FLAMES AND DESTROYED. THE CONTACT RECENTLY RECEIVED A RECALL LETTER NHTSA NUMBER: 20V061000 (SERVICE BRAKES, HYDRAULIC). THE INSURANCE COMPANY DETERMINED THAT THE FIRE WAS MOST LIKELY ELECTRICAL SINCE THE VEHICLE HAD BEEN FOR OVER AN HOUR. THE DEALER AND MANUFACTURER HAD NOT BEEN CONTACTED. THE FAILURE MILEAGE WAS 120,000.",
        "vin": "KMHDU46D77U"
    },
    {
        "components": "STEERING,AIR BAGS,WHEELS",
        "crash": true,
        "dateComplaintFiled": "12/06/2020",
        "dateOfIncident": "12/05/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11378056,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "ON DECEMBER 5TH, 2020 AT APPROXIMATLY 0645AM I WAS DRIVING MY ELANTRA WITHOUT AND IISSUES OR PRE-INDICATORS THAT SOMETHING VERY BAD WAS ABOUT TO HAPPEN. I WAS ON A BUSY ROAD THAT IS TRAVELED ALL TIMES OF THE DAY, GETTING ON INTERSTATE 270 IN COLUMBUS HEADED WEST. I ESTIMATE (PICTURE INCLUDED FROM ACCIDENT SITE AND WHERE THE FREEWAY STARTED) ABOUT 1000 FEET UNTIL I MERGE ONTO THE WELL TRAVELED HIGHWAY. IWHEN I I COMPLETED MY SLIGHT TURN ASSOCIATED WITH THIS PATICULAR ON RAMP, I LOSE CONTROL OF THE VEHICLE WITHOUT WARNING, MY CAR WENT IN TWO CIRCLES. MY STEERING DID NOT WORK AS WELL AS MY BRAKES. I WOULD LIKE TO ALSO NOTE THAT THIS PATICULAR ON RAMP ALSO HAS STEADY, FAST MOVING TRAFFIC FROM ANOTHER STREET MERGING TOGETHER BEFORE WW ALL GET ON THE HIGHWAY. TWO CARS AND A TRACTOR TRAILOR WERE ABLE TO AVOID ME. I AM CONVINCED THAT ONLY BY THE GRACE OF GOD HIMSELF WAS I NOT SERIOUSLY HURT OR MY CHILDREN IN THE CAR WITH ME. MY ONLY MEANS TO STOP WAS FIANNLLY THE GUARDRAIL. I ALSO THANK GOD FOR THIS GUARD RAIL BECAIUSE THERE IS A STEEP EMBANKMENT WITH A BODY OF WATER AT THE BOTTOM. I ESTIMATE AT THE TIME OF COLLISON I WAS APPROACHING AT LEAST 40 MPH. MY HEAD HIT THE DRIVERS SIDE WINDOW. NO BLEEDING, JUST STUNNED. (NOBODY STOPPED BTW). WHEN I WAS ABLE TO COLLECT MY THOUGHTS AND CALL SOMEONE. I WAS ABLE TO CALL MY FRIEND FOR A RIDE. HE WAS SHOCKED WHEN HE ARRIVED THAT I WAS OKAY. HE WANTED TO GO TO THE ER BECAUSE OF THE GOOSE EGG ON MY NOGGIN BUT DURING A PANDEMIC I THINK I'LL WAIT. HE CALLS AAA FOR ME AND WE GET THE CAR TOWED BACK TO MY HOME. IT WILL NEVER BE DRIVABLE AGAIN BUT IN MY STATE OF SHOCK IT WAS MY MOST PLAUSIBLE OPTION. UPON, INSPECTING THE CAR, THE TIRE ROD SNAPPED CLEAN OFF THE WHEEL.",
        "vin": "KMHDU46D67U"
    },
    {
        "components": "SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/19/2020",
        "dateOfIncident": "05/17/2020",
        "fire": true,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325178,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT CALLED ON BEHALF OF THE VEHICLE OWNER HIS STEPSON. THE CONTACT STATED WHILE THE STEPSON'S VEHICLE A 2007 HYUNDAI ELANTRA WAS PARKED IN FRONT OF AN APARTMENT COMPLEX, THE VEHICLE CAUGHT ON FIRE. THE CONTACT WAS ALERTED BY THE FIRE DEPARTMENT WHOM EXTINGUISHED THE FIRE AND FILED A REPORT. THE CONTACT STATED THAT THE ENGINE COMPARTMENT WAS BURNT. THERE WAS NO WARNING INDICATORS ILLUMINATED PRIOR TO THE FAILURE. THE VEHICLE WAS TOTALED. THE CONTACT STATED THAT HE WAS INFORMED OF NHTSA CAMPAIGN NUMBER: 20V061000 (SERVICE BRAKES, HYDRAULIC) BY THE INSURANCE COMPANY HOWEVER, THE VIN WAS NOT INCLUDED IN THE RECALL. THE CONTACT CALLED AN UNKNOWN HYUNDAI DEALER IN ORLANDO, FL AND WAS REFERRED TO THE MANUFACTURER. THE CONTACT CALLED THE MANUFACTURER SEVERAL TIMES AND WAS UNABLE TO REACH A LIVE AGENT. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "KMHDU46D77U"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/16/2020",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321322,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI ELANTRA. THE CONTACT STATED THAT WHILE OPERATING THE VEHICLE, THE ABS AND PARK BRAKE SENSOR LIGHTS REMAINED ILLUMINATED. THE VEHICLE WAS TAKEN TO PRIORITY HYUNDAI GREENBRIAR (1499 S. MILITARY HWY, CHESAPEAKE VA) WHERE THE VEHICLE WAS REPAIRED UNDER NHTSA CAMPAIGN NUMBER: 20V061000 (SERVICE BRAKES) HOWEVER, THE FAILURE PERSISTED. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 130,000.",
        "vin": "KMHDU46D97U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/07/2020",
        "dateOfIncident": "04/07/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11320416,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A SAFETY RECALL NOTICE THAT MY ABS MODULE COULD DEVELOP A SHORT CIRCUIT RESULTING IN AN ENGINE COMPARTMENT FIRE. THIS FIRE COULD OCCUR EVEN WHEN THE CAR IS TURNED OFF, WHICH INCREASES THE RISK OF INJURY. I RECEIVED THIS NOTICE TODAY, APRIL 7, 2020. I HAVE CALLED THE HYUNDAI DEALERSHIPS IN MY PITTSBURGH AREA. THE WEXFORD SITE CANNOT SERVE ME UNTIL MAY 18 BECAUSE THEY HAVE ONLY RECEIVED 5 RECALL PARTS FROM HYUNDAI. THE SOUTH HILLS SITE DOES NOT HAVE ANY PARTS AT ALL. HYUNDAI IS FAILING TO EQUIP LOCATIONS WITH NECESSARY PARTS TO ADDRESS THIS RECALL. THEREFORE I AND HUNDREDS OF OTHER HYUNDAI CAR OWNERS ARE AT RISK OF A FIRE THAT COULD DEVELOP AND NO WAY TO PREVENT, AS THE FIRE COULD OCCUR EVEN WHEN THE CAR IS OFF.  *TR",
        "vin": "KMHDU46DX7U"
    },
    {
        "components": "SERVICE BRAKES, AIR,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/07/2020",
        "dateOfIncident": "03/27/2020",
        "fire": true,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11320432,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI ELANTRA.    WHILE PARKED THE VEHICLE CAUGHT FIRE.     NO INJURIES WERE REPORTED.     THE CAUSE OF THE FAILURE WAS NOT DETERMINED    THE CONTACT STATED THAT AFTER PARKING THE VEHICLE APPROXIMATELY 2 HOURS LATER THE VEHICLE CAUGHT FIRE AND FLAMES WERE PRESENT COMING FROM UNDER THE ENGINE COMPARTMENT. THE FIRE DEPARTMENT WAS CALLED TO THE SCENE AND EXTINGUISHED THE FLAMES. THE VEHICLE WAS DESTROYED AND TOWED AWAY. A FIRE DEPARTMENT REPORT WAS TAKEN AT THE SCENE. NO INJURIES WERE REPORTED. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE LOCAL DEALER AND MANUFACTURER WERE NOT NOTIFIED. THE CONTACT LATER RECEIVED A RECALL NOTICE FOR NHTSA RECALL CAMPAIGN NUMBER: 20V06100 (SERVICE BRAKES) REGARDING AN ELECTRICAL SHORT THAT MAY CAUSE A FIRE. THE FAILURE MILEAGE WAS 190,000.",
        "vin": "KMHDU46D27U"
    },
    {
        "components": "AIR BAGS,STRUCTURE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/19/2020",
        "dateOfIncident": "02/01/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310173,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "SOME TIME BETWEEN APPROXIMATELY BETWEEN 12:00 AM AND 4:00 AM ON 2/1/2020, THE  VEHICLE CAUGHT FIRE ON IT'S OWN (IT WAS PARKED AND OFF) AND BADLY BURNED OUR GARAGE/HOME CAUSING EXTENSIVE PROPERTY DAMAGE TO THE GARAGE AND INTERIOR OF OUR HOME.",
        "vin": "KMHDU46D97U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/03/2019",
        "dateOfIncident": "12/02/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11286690,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI ELANTRA. WHILE DRIVING APPROXIMATELY 10 MPH, THE EPS INDICATOR ILLUMINATED AND THE STEERING LOST POWER. THE FAILURE RECURRED. THE VEHICLE WAS TAKEN TO FOX HYUNDAI (616-942-5000, LOCATED AT 4141 28TH STREET SE, GRAND RAPIDS, MI 49512) WHERE IT WAS STATED THAT THE FAILURE WAS A KNOWN ISSUE AND THE STEERING COLUMN NEEDED TO BE REPLACED. THE CONTACT STATED THAT THERE WAS A MANUFACTURER COMMUNICATION NUMBER: 15-01-019-1 AND WAS INFORMED THAT THE EXTENDED WARRANTY EXPIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 112,000.",
        "vin": "KMHDU46D87U"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "06/26/2019",
        "dateOfIncident": "04/03/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11222759,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "SEAT BELT LIGHT CAME ON AROUND 137K MIKE'S. TOOK TO GET TESTED AT DEALERSHIP.  SAID BAD SEAT BUCKLES  ON DRIVERS AND PASSENGER SIDES.  147 TO TEST IT AND 500 TO FIX.  FOUND OUT THE PREVIOUS OWNER ALREADY REPLACED BUCKLES 5 YEARS AGO.  CALLED HYUNDAI DIRECTLY AND THEY SAID THEY CAN'T DO ANYTHING ABOUT IT EVEN THOUGH THERE ARE HUNDREDS OF SIMILAR REPORTS ONLINE.",
        "vin": "KMHDU46D37U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/14/2019",
        "dateOfIncident": "03/13/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11186769,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR PASSENGER SIDE CONTROL ARM RUSTED AND DISCONNECTED FROM THE SUPPORT WHILE DRIVING.",
        "vin": "KMHDU46D47U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/27/2018",
        "dateOfIncident": "06/26/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11104190,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR IS OUR EXTRA CAR SO IT DOESN'T GET DRIVEN THAT MUCH. THE OTHER DAY I WAS DRIVING ON THE HIGHWAY WHEN I WAS PULLED OVER AND NOTIFIED THE BREAK LIGHTS AREN'T COMING ON. MY MECHANIC DETERMINED IT THE STOP LIGHT SWITCH THE BRAKE LIGHT SWITCH. I WAS TOLD THERE WAS A RECALL BUT MY CAR ITS NOT PART OF THE RECALL. OBVIOUSLY FROM ALL THE COMPLAINTS I SEE ONLINE THIS RECALL NEEDS TO BE EXPANDED.",
        "vin": "KMHDU46D97U"
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/14/2018",
        "dateOfIncident": "03/12/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11079091,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI ELANTRA. WHILE DRIVING 40 MPH, THE REAR AXLE DETACHED FROM THE VEHICLE. THERE WERE NO WARNING INDICATORS ILLUMINATED BEFORE THE FAILURE. THE CONTACT STATED THAT THE REAR AXLE WAS ROTTED AND THERE WAS FRAME CORROSION ON THE REAR SIDE OF THE FRAME. THE CONTACT HAD THE VEHICLE TOWED TO RIVERHEAD HYUNDAI (1800 OLD COUNTRY RD, RIVERHEAD, NY 11901, (631) 369-0600) AND WAS ADVISED THAT NOTHING COULD BE DONE. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 120,000.",
        "vin": "KMHDU46D47U"
    },
    {
        "components": "SUSPENSION,WHEELS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/01/2018",
        "dateOfIncident": "03/01/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11075737,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY RIGHT FRONT AXLE COMPLETELY CAME OFF THE FRAME. AFTER TAKING IT TO A HYUNDAI MECHANIC I WAS TOLD THAT MY FRAME WAS CORRODED AND THAT CAUSED MY AXLE TO DISLOCATE. I ASKED IF THE REPAIR WAS COVERED UNDER THE TT1 CAMPAIGN AND WAS TOLD THAT IT WAS ONLY FOR PREVENTATIVE MEASURES AND DID NOT COVER REPAIRS.",
        "vin": "KMHDU46D67U"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/26/2018",
        "dateOfIncident": "02/05/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11074961,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE IGNITION IS NO GOOD AND, THE CAR WOULD NOT TURN OFF. I HAD TO TAKE IT TO A DEALER AND, HE TOOK FUSES OUT BEFORE THEY COULD GET THE CAR TO SHUT OFF. THEY REPLACED THE IGNITION BUT THE FLASHER LIGHT KEEP COMING ON AND THE THE SPOTTER AND THE DEALER DID NOT GIVE ME THE AUTOMATIC PART OF THE KEY. UNABLE TO START CAR.",
        "vin": "KMHDU46DO7U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/15/2018",
        "dateOfIncident": "02/15/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11073047,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS WORKING PROPERLY THEN ONE DAY THE BRAKE LIGHTS STOPPED WORKING.  ALL OTHER VEHICLE COMPONENTS WORK AS INTENDED INCLUDING THE NIGHT RUNNING LIGHTS, TURN SIGNALS AND HAZARD LIGHTS. I PUT IN NEW FUSES AND REPLACED THE BREAK LIGHTS BUT THE ISSUE REMAINS. ALL THREE BRAKE LIGHTS (LEFT, RIGHT, TOP CENTER) DO NOT WORK.",
        "vin": "KMHDU46D27U"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "01/08/2018",
        "dateOfIncident": "01/06/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11061329,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "RAN INTO THE REAR END OF A STOPPED VEHICLE AT OR ABOUT 25MPH - STRAIGHT.  THE AIRBAGS DID NOT DEPLOY AND THE SEATBELT STOP DID NOT ENGAGE CAUSING DRIVER'S CHEST TO HIT THE STEERING WHEEL.",
        "vin": "KMHDU46D57U"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/30/2017",
        "dateOfIncident": "11/25/2017",
        "fire": true,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11051523,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR SPONTANEOUSLY CATCH FIRE ON ITS OWN.  THE CAR PARKED ON MY FRONT YARD FOR AT LEAST 3 HOURS.  IT WENT AFLAME, THE WHOLE ENGINE WAS DESTROYED.   EVERY THING CAUGHT ON HOME SECURITY CAMERA.",
        "vin": "KMHDU46D88U"
    },
    {
        "components": "AIR BAGS,SEATS",
        "crash": false,
        "dateComplaintFiled": "11/20/2017",
        "dateOfIncident": "11/01/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11047369,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "SOLICITO DE FAVOR ME AYUDEN A REALIZAR EN MI VEHICULO LA APLICACION DEL RECALL 11V143000 Y  11V179000, INTENTO COMUNICARME CON EL DISTRIBUIDOR HYUNDAI PERO NO TENGO RESPUESTA.",
        "vin": "KMHDU46D07U"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/27/2017",
        "dateOfIncident": "11/02/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11040435,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. I WAS IN AN ACCIDENT WHERE I WAS INJURED DUE TO THE FACT THE AIRBAG DIDN'T DEPLOY.",
        "vin": "KMHDU46D47U"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "08/02/2017",
        "dateOfIncident": "07/17/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11012377,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH THE DRIVER AND PASSENGER SUN VISORS HAVE SUDDENLY BROKEN AND FALLEN DOWN EITHER COMPLETELY OR PARTIALLY WHILE DRIVING ON THE HIGHWAY, OBSTRUCTING LINE OF VISION AND BECOMING UNUSABLE.  THE BREAK OCCURRED AT THE SAME LOCATION ON BOTH SUN VISORS - THE PLASTIC ROD BROKE JUST ABOVE WHERE THE VISOR IS SCREW MOUNTED ONTO THE CEILING OF THE CAR.",
        "vin": "KMHDU46D47U"
    },
    {
        "components": "VEHICLE SPEED CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "07/29/2017",
        "dateOfIncident": "05/22/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11011407,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING VERY SLOWLY ON COLLEGE CAMPUS LOOKING FOR PARKING SPACE AS I HAVE DONE EVERY TIME I GO TO THE OFFICE FOR 45 YEARS WHEN SUDDENLY THE HYUNDAI ELANTRA ACCELERATED AT VERY HIGH RATE AND ROLLED OVER UPSIDE DOWN. AIRBAGS DEPLOYED AND I WAS RUSHED TO THE HOSPITAL. WINDSHIELD AND FRONT OF ROOF COLLAPSED FROM ROLLOVER! I ABSOLUTELY DID NOT PRESS DOWN THE GAS PEDAL BY MISTAKE. I AM SURE. THIS COULD VERY LIKELY KILLED ANYONE WALKING OR DRIVING IN FRONT OF THIS CRAZY CAR.",
        "vin": "KMHDU46D97U"
    },
    {
        "components": "EXTERIOR LIGHTING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/29/2017",
        "dateOfIncident": "07/27/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11011460,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MY STOP LAMP SWITCH FAILED.    THE NHTSA SITE SHOWS THAT THERE IS A RECALL HAVING TO DO WITH MY  YEAR AND MODEL FOR THE STOP LAMP SWITCH AND OR ASSEMBLY.  MINE FAILED,  BUT THE DEALER STATES THAT MY SPECIFIC VIN IT IS NOT COVERED BY THE RECALL.  WELL THE PROBLEM IS WIDER THAN REPORTED OBVIOUSLY BECAUSE THE PROOF IS MY SWITCH FAILED.  PLEASE INVESTIGATE.     WHEN I NOTICED THE PROBLEM THE CAR HAD BEEN ON THE DRIVEWAY FOR A COUPLE OF DAYS AND HAD NOT BEEN DRIVEN.  THE FAILURE MANIFESTED ITSELF RANDOMLY WHILE THE CAR WAS NOT IN USE AND HAD NOT BEEN IN USE.  THIS COULD HAVE BEEN ON GOING, BUT I MIGHT NOT HAVE NOTICE.",
        "vin": "KMHDU46DX7U"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/12/2017",
        "dateOfIncident": "02/01/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11004825,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER SIDE SUN VISOR BECAME DISCONNECTED AND ITS WEIGHT PULLED ITS WIRE OUT 2 INCHES SO THAT IT WOULD NOT GO BACK IN AND WOULD NOT STAY UP ANYMORE. NOW IT IS COMPLETELY OFF AND TOO EXPENSIVE TO FIX. MANY PEOPLE HAVE REPORTED THIS PROBLEM AND IT SHOULD BE A RECALL.  WE MAY HAVE TO HAVE IT FIXED WITHOUT HAVING THE ELECTRICAL HOOKED UP TO RUN THE MIRROR LIGHT, WHICH IS REALLY ANNOYING.",
        "vin": "KMHDU46DX7U"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/12/2017",
        "dateOfIncident": "07/04/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11004829,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR A FEW MONTHS I HAD A RATTLING NOISE COMING FROM THE REAR OF THE CAR WHEN MY CAR WAS IDLING ON A CITY STREET FACING DOWNHILL (AT A STOP SIGN). THEN IT GOT SUDDENLY WORSE FOR 2 DAYS, SO THAT IT RATTLED ALL THE TIME WHEN IDLING IN DRIVE OR PARK (STOPPED AT LIGHTS OR SIGNS OR IN A PARKING SPACE). THEN IT COMPLETELY STOPPED RATTLING - AND THE NEXT DAY ANOTHER DRIVER ON THE HIGHWAY, ON THE 4TH OF JULY, NOTIFIED ME THAT MY BRAKE LIGHTS WERE NOT WORKING. I DON'T KNOW IF IT IS A COINCIDENCE OR NOT.",
        "vin": "KMHDU46DX7U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/06/2017",
        "dateOfIncident": "06/30/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003433,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI ELANTRA. THE CONTACT STATED THAT THE VEHICLE VEERED TO THE RIGHT. THE CONTACT'S HUSBAND INSPECTED THE VEHICLE AND NOTICED THAT THE FRONT DRIVER SIDE CONTROL ARM CRACKED NEAR THE BALL JOINT. THE VEHICLE WAS TOWED TO BOB WAKELY FLEET REPAIR SHOP WHERE IT WAS DIAGNOSED THAT THE CONTROL ARM FAILED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND OFFERED NO ASSISTANCE. THE FAILURE MILEAGE WAS APPROXIMATELY 125,000.  UPDATED 09/01/17*LJ   UPDATED 09/05/2017*JS",
        "vin": "KMHDU46D67U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/22/2017",
        "dateOfIncident": "04/22/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10991002,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI ELANTRA. ON SEVERAL OCCASIONS, WHILE DRIVING VARIOUS SPEEDS, THE STEERING WHEEL PULLED WHILE MAKING LEFT AND RIGHT TURNS. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 80,000.",
        "vin": "KMHDU46D17U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/13/2017",
        "dateOfIncident": "05/12/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10985504,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I SEE THERE IS A RECALL ON THIS BUT NOT WITH MY VIN#? I WENT IN FOR AN OIL CHANGE AND THEY TESTED MY BRAKE LIGHTS AND NONE OF THEM WORKED?",
        "vin": "KMHDU46D67U"
    },
    {
        "components": "EXTERIOR LIGHTING,AIR BAGS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/23/2017",
        "dateOfIncident": "04/23/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10979960,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HYUNDAI ELANTRA .IT SHUT DOWN AUTOMATICALLY WHEN THE CAR IN THE SLOW SPPED ANOTHER PROBLEM IS THAT ITS SHOWS THE WRONG LEVEL FOR THE HEAT METER.",
        "vin": "KMHDU46D97U"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/25/2017",
        "dateOfIncident": "02/22/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10956876,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE I DRIVE DOWN THE ROAD, WEATHER IT BE AT 10MPH OR 55MPH, MY EPS LIGHT AND EMERGENCY BRAKE LIGHT WILL TURN ON AND MY CAR WILL STOP. IT WILL NOT TURN OFF UNTIL MY CAR IS STOPPED, TURNED OFF. AND TURNED BACK ON AGAIN. SINCE THE POWER STEERING IS LOST I CAN NOT JUST TURN TO THE SIDE OF THE ROAD. I HAVE TO PRAY THAT NO ONE WILL BE COMING UP BEHIND ME AND HIT ME CAUSING AN ACCIDENT.   BEFORE THAT WILL HAPPEN FOR TWO WEEKS MY ALARM WILL GO OFF AT ALL HOURS OF THE DAY AND NIGHT. OVER AND OVER AND OVER AGAIN UNTIL MY CARS EPS AND E BRAKE LIGHTS TURN ON WHILE I AM DRIVING, BUT THEN THE CYCLE WILL START ALL OVER AGAIN.     THE MOST FREQUENT TIEM THIS HAPPENED WAS WHILE I WAS DRIVING DOWN HIGHWAY 99W IN DUNDEE OREGON, I WAS GOING ABOUT 45MPH AND MY CARS EPS AND E BREAK .LIGHT TURNED ON AND I HAD TO TURN IT OFF AND THEN RESTART IT.     I HAVE TAKEN IT MANY TIMES TO A DEALERSHIP TO FIX BUT THEY JUST CHARGE ME MONEY AND SAY ITS FIXED, BUT THEN IT HAPPENS AGAIN. I WILL SUE, I AM SO OVER MY CAR THREATENING MY LIFE AND THE LIVES OF MY LOVED ONES.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/25/2017",
        "dateOfIncident": "02/24/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10956897,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MY AIRBAG LIGHT IS ON AND WON'T GO OFF, SO I LOOKED INTO IT AND IT CAN CAUSE THE BAGS TO DEPLOY AT ANY GIVEN TIME OR NOT AT ALL. THIS IS VERY UNSETTLING, AND NOT SAFE. PLEASE RECALL THIS.",
        "vin": "KMHDU46D47U"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/25/2017",
        "dateOfIncident": "02/25/2017",
        "fire": true,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10956981,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "COLD CAR CATCHES ON FIRE TOTAL LOST. WAS PARKED ON MY DRIVEWAY",
        "vin": "KMHDU46D57U"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "02/10/2017",
        "dateOfIncident": "02/10/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10953930,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "IT TIGHTEN UP ON MY CHILD AND WOULDNT RELEASE I HAD TO CUT IT",
        "vin": "KMHDU46D27U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/06/2017",
        "dateOfIncident": "02/03/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10949715,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI ELANTRA. THE CONTACT STATED THAT THE AIR BAG WARNING INDICATOR ILLUMINATED IN THE VEHICLE. THE CONTACT ALSO STATED THAT THE FRONT PASSENGER SIDE AIR BAG WAS INCLUDED IN A RECALL, BUT THE VIN WAS NOT INCLUDED. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE NHTSA CAMPAIGN NUMBER WAS UNKNOWN. THE FAILURE MILEAGE WAS 118,330.",
        "vin": "KMHDU46DX7U"
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/23/2017",
        "dateOfIncident": "12/28/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10946927,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR SUB FRAME ROTTED AND BROKE WHILE I WAS DRIVING. THERE IS A RECALL FOR FRONT END CORROSION. CALLED HYUNDAI AND WAS TOLD TOUGH LUCK.  *TR",
        "vin": "KMHDU46DX7U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/15/2017",
        "dateOfIncident": "01/13/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10945412,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "IT EXPLODED FOR NO REASON",
        "vin": "KMHDU44D67V"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/30/2016",
        "dateOfIncident": "12/22/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10938745,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING WHEEL START MAKING A NOISE AND BECOMES HARD TO STEER DRIVING ABOUT 35 MILES PER HOUR COMING OUT OF A HIGHWAY TURNING INTO A CITY STREET.  *TR",
        "vin": "KMHDU46D17U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/22/2016",
        "dateOfIncident": "10/01/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10918046,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN TURNING  THE CAR IT WILL SQUEAK CONSTANTLY. THE CAR HAS APPROXIMATELY 98000 MILES AND HAS BEEN DRIVEN UNDER NORMAL CONDITIONS. I AM TOLD THE CAR NEEDS A PART IN THE STEERING WHICH WILL COST $2000.00 JUST FOR THE PART.",
        "vin": "KMHDU46D97U"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/10/2016",
        "dateOfIncident": "09/10/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10915129,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SUN VISOR ON THE DRIVERS SIDE BROKE AND KEPT FALLING DOWN.  I WENT TO THE DEALER AND THEY WANTED $278 JUST FOR THE PART AND SAID THEY WOULD CHARGE EXTRA FOR INSTALLING.  THIS WAS WAY TOO COSTLY, SO I TRIED TAPING UP THE SUN VISOR, BUT THAT DID NOT WORK AS THE TAPE KEPT GIVING AWAY AND THE SUN VISOR FALLING WOULD INTERFERE WITH MY VISIBILITY OF THE ROAD.  I TOOK THE VEHICLE TO A REPAIR SHOP AND THEY INSTALLED A USED SUN VISOR AT THE COST OF $117.  THE VERY NEXT WEEK THE PASSENGER SIDE SUN VISOR BROKE AND FELL DOWN IN EXACTLY THE SAME MANNER AS THE DRIVERS SIDE (THAT I HAD REPAIRED THE WEEK BEFORE).  I DECIDED TO DO AN ONLINE SEARCH FOR A REPLACEMENT OF THE PASSENGER SIDE SUN VISOR AND EVERYWHERE I LOOKED I FOUND PEOPLE WHO HAD THE SAME PROBLEM WITH HYUNDAI SUN VISORS NOT ONLY MY 2007 HYUNDAI ELANTRA BUT OTHER YEARS MODELS OF HYUNDAI AND MODELS.  THIS IS A REAL SAFETY ISSUE AS THE SUN VISOR KEEPS FALLING DOWN IN YOUR LINE OF VISIBILITY AND INTERFERES WITH YOUR ABILITY TO SEE THE ROAD AHEAD CLEARLY AND IT CLEARLY IS AN EXPENSIVE REPAIR AND I ONLY HAVE 72000 MOLES ON MY VEHICLE.  THE INTERIOR OF A VEHICLE SHOULD NOT BE FALLING APART ESPECIALLY SOMETHING LIKE THIS, WITHOUT TOUCHING IT OR MOVING THE SUN VISOR IT JUST FALLS AND WILL NOT STAY UP.",
        "vin": "KMHDU46D97U"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/15/2016",
        "dateOfIncident": "08/01/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10906934,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER VISOR FAILED A FEW MONTHS AGO. DRIVER VISOR FAILED SHORTLY AFTER (AROUND 60,000 MILES). THIS APPEARS TO BE A KNOWN PROBLEM WITH HYUNDAI'S MANUFACTURED AFTER 2007. DEALER WOULD CHARGE $176 PER VISOR, BUT ABSORB THE COST OF INSTALLATION.    ONE PASSENGER BANGED HER HEAD WHEN GETTING IN THE CAR. DRIVER'S VISOR HAS FALLEN ON MY HEAD SEVERAL TIMES -- A HAZARD IN MY OPINION.",
        "vin": "KMHDU46DX7U"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "08/29/2016",
        "dateOfIncident": "08/27/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10899298,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "VISORS RIGHT AND LEFT SUDDENLY FELL DOWN AND OBSCUREDVISION. WHILE VEHICLE WAS IN MOTION SUN WAS BLINDING, BUT WAS CLOSE TO HOME.",
        "vin": "KMHDU46D27U"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/08/2016",
        "dateOfIncident": "08/04/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10894122,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKE SWITCH HAD TO REPLACED TWICE WITHIN A FEW MONTHS.  THE THREE REAR BRAKE LIGHTS WERE NOT WORKING.  THIS WAS A COMMON REPAIR ON OTHER MODEL YEARS OF THE HYUNDAI ELANTRA.  2007 SHOULD BE INCLUDED IN THE EXISTING RECALL. (RECALL CAMPAIGNS 110 AND 113.)",
        "vin": "KMHDU46D27U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/03/2016",
        "dateOfIncident": "03/13/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10893008,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2007 ELANTRA IS (LIKE ALL OF THESE OTHER COMPLAINTS EXPERIENCING A BREAK LIGHT THAT IS CHRONICALLY GOING OUT, EVEN AFTER GETTING THE STOP LAMP SWITCH REPLACED AND BEFORE THAT MULTIPLE LIGHT BULBS. AFTER GETTING THE SWITCH REPLACED, I WAS NOTIFIED 2 MONTHS-ISH LATER THAT MY BREAK LIGHT IS NOT ALLUMINATING. WHEN I CALLED THE DEALERSHIP THEY SAID THAT WAS NOT SHOWING UP AS A RECALL, EVEN THOUGH I KEEP FIND IT IN SERVICE CAMPAIGN #110 WHICH SAYS IT CAN CAUSE A CRASH. THIS HAS BEEN AN ONGOING THING FOR YEARS.  IT SEEMS LIKE EVERY TIME I GET IT FIXED IT WORKS FOR A SHORT TIME AND THE NEXT TIME I GET AN OIL CHANGE THEY TELL ME MY BREAK LIGHT IS OUT.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/01/2016",
        "dateOfIncident": "10/14/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10882010,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI ELANTRA. WHILE DRIVING AT ANY SPEED, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS ABLE TO RESTART AFTER NUMEROUS ATTEMPTS. THE VEHICLE WAS TAKEN TO A DEALER, BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": "KMHDU46D77U"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "06/14/2016",
        "dateOfIncident": "06/13/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10874135,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SUN VISOR ON MY 2007 HYUNDAI ELANTRA ON THE DRIVER'S SIDE BROKE WHILE I WAS DRIVING. IT DID NOT BREAK OFF COMPLETELY, BUT HUNG LOW, OBSTRUCTING MY VIEW. I TRIED TO PUSH IT BACK IT UP AND IT WOULD NOT STAY FOR LONG AND CONTINUED TO FALL AS I WAS DRIVING. THIS IS A HUGE SAFETY HAZARD AS IT CONTINUES TO FALL UNEXPECTEDLY AND OBSTRUCT MY VIEW. IT IS ALSO A SAFETY HAZARD TO NOT HAVE A SUN VISOR AS IT SERVES A CRITICAL PURPOSE IN ENSURING VISIBILITY. THE SUN VISOR ON THE PASSENGER SIDE BROKE IN A SIMILAR MANNER SEVERAL MONTHS AGO, HOWEVER THAT IS NOT AS IMPACTFUL AS IT DOES NOT CORRECTLY CAUSE A SAFETY HAZARD AND VISIBILITY DEFICIENCY WHILE DRIVING. THE COST TO REPAIR IS NEARLY $300.",
        "vin": "KMHDU46D47U"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/07/2016",
        "dateOfIncident": "06/06/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10873091,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI ELANTRA. WHILE DRIVING 5 MPH, THE VEHICLE FAILED TO ACCELERATE WHEN THE ACCELERATOR PEDAL WAS DEPRESSED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VIN WAS UNKNOWN. THE FAILURE MILEAGE WAS 160,000.",
        "vin": ""
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "05/15/2016",
        "dateOfIncident": "04/29/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10864983,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON A NEIGHBORHOOD ROAD AND THE SUN VISOR FELL DOWN IN FRONT OF MY VIEW.  I HAVE TRIED TO SHOVE IT BACK INTO PLACE, BUT IT WILL NOT STAY FOR MORE THAN A FEW MINUTES.  THIS IS IMPEDING MY VIEW OF THE ROAD AND MAKES THE CAR UNSAFE TO DRIVE.  THE SAME PROBLEM OCCURRED WITH THE PASSENGER SIDE SUN VISOR A FEW MONTHS AGO.",
        "vin": "KMHDU46D07U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/16/2016",
        "dateOfIncident": "04/16/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10859887,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG RECALL CHECK- TO SEE IF THERE HAS BEEN A RECALL.",
        "vin": "KMHDU46D37U"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "04/06/2016",
        "dateOfIncident": "11/02/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10853845,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SUN VISOR ON MY 2007 ELANTRA BROKE, AND IT HAPPENED WHEN I WAS DRIVING AND TRYING TO ADJUST THE VISOR TO SHIELD MY EYES FROM THE SUN. SPECIFICALLY, THE ARM HOLDING THE VISOR IN PLACE BROKE, RENDING THE SUN VISOR INOPERABLE. THIS IS A DANGEROUS DEFECT! THIS IS A MAJOR SAFETY CONCERN! I HAVE DONE MY RESEARCH ONLINE, AND THIS IS A CONSISTENT PROBLEM WITH THE 2007 ELANTRA. PLEASE ISSUE A RECALL!",
        "vin": ""
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/26/2016",
        "dateOfIncident": "12/01/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10851793,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE VEHICLE WAS MOVING, THE DRIVER'S SIDE SUN VISOR BROKE OFF ITS LEFT HINGE, OBSTRUCTING MY VISION. THIS WAS STARTLING AND VERY SCARY, BECAUSE I COULDN'T SEE. SINCE THE INCIDENT, THE PASSENGER'S SIDE SUN VISOR BROKE IN THE SAME MANNER.",
        "vin": "KMHDU46DX7U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/18/2016",
        "dateOfIncident": "02/18/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10837039,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI ELANTRA. THE CONTACT STATED THAT WHILE DRIVING AT 35 MPH, THE STEERING WHEEL BECAME DIFFICULT TO STEER AND THE EBS WARNING LIGHT ILLUMINATED. THE CONTACT COASTED OVER TO THE SIDE OF THE ROAD AND WAS ABLE TO RESTART THE VEHICLE. THE VEHICLE WAS TAKEN TO THE DEALER BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS MAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 136,000.",
        "vin": "KMHDU46D37U"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/16/2016",
        "dateOfIncident": "02/11/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10836526,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE HIT A GARD RAIL AT 65 MPH IN THE FRONT AND BROKE THE BUMPER IN HALF AND MESS THE HOLE FRONT END UP AND THE AIR BAGS NEVER WENT OFF. SO I WAS W ORDERING WHY WE NEVER RECEIVE A RECALL ABOUT THE AIR BAG SYSTEM. LUCKY SHE DIDN'T GET HURT TO BAD BUT I'M JUST CONCERNS ARE WHY DIDN'T THEY GO OFF",
        "vin": "KMHDU46D47U"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/03/2016",
        "dateOfIncident": "01/31/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10823952,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI ELANTRA. WHILE AT A RED LIGHT AWAITING TO MAKE A LEFT TURN, THE CONTACT'S VEHICLE WAS STRUCK HEAD ON BY A DRUNK DRIVER. THE FRONTAL AIR BAGS FAILED TO DEPLOY. THE CONTACT HAD TO BE TRANSPORTED TO THE HOSPITAL BY AMBULANCE. THE CONTACT SUSTAINED A HERNIATED DISC, SHOULDER, AND NECK BRUISES. A POLICE REPORT WAS FILED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VEHICLE WAS TOWED TO AN IMPOUND LOT. NO DETERMINATION WAS MADE BY THE INSURANCE COMPANY. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 101,000.",
        "vin": "KMHDU46D47U"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/02/2016",
        "dateOfIncident": "01/26/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10823721,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "SUN VISOR ARM ON MY 2007 HYUNDAI ELANTRA DRIVER SIDE BROKE CAUSING THE VISOR TO FALL IN FRONT OF DRIVER FACE.  IT CANNOT BE ADJUSTED TO BLOCK THE SUN FROM THE FRONT OR THE SIDE AND WILL NOT STAY IN A CLOSED POSITION TO GIVE A FULL VIEW OF THE AREA AHEAD.   THIS CAUSES NOT ONLY A PROBLEM WITH THE VISOR HANGING IN YOUR LINE OF VISION BUT ALSO CREATES A PROBLEM WITH NOT BEING ABLE TO BLOCK THE BRIGHT SUN WHILE DRIVING.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/19/2016",
        "dateOfIncident": "01/05/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10821029,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI ELANTRA. WHILE DRIVING 60 MPH AFTER RECEIVING A RECALL REPAIR, THE DRIVER SIDE AIR BAG LIGHT ILLUMINATED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 178,000.   UPDATED 05/03/16*LJ",
        "vin": "KMHDU46D77U"
    },
    {
        "components": "UNKNOWN OR OTHER,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/04/2016",
        "dateOfIncident": "08/15/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10817745,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE CITY DRIVING THE DRIVER SIDE SUN VISOR SWIVEL BRACKET BROKE AND WILL NOT STAY IN PLACE. WORSE WHEN THE VISOR CONNECTOR BROKE IT WAS SUDDEN AND BLOCKED VISIBILITY.  NOW THE VISOR WILL NOT STAY IN PLACE AND KEEPS FALLING INTO THE DRIVERS FIELD OF VISION WITHOUT WARNING . ABOUT A MONTH LATER THE SAME PROBLEM OCCURRED ON THE PASSENGER SIDE VISOR.     AFTER LOOKING AT THE VISOR HOUSING THE ONLY TRUE FIX IS TO REPLACE THE ENTIRE VISOR. AFTER TAKING IT TO THE LOCAL DEALERSHIP THEY AGREE THE ONLY FIX IS TO REPLACE BOTH VISORS WHICH WILL COST $170 EACH.     THIS SHOULD BE A RECALL AS NO USER ERROR CAUSED THE BROKEN VISORS AND UNEXPECTEDLY BLOCKS DRIVER VISIBILITY.",
        "vin": "KMHDU46D07U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/08/2015",
        "dateOfIncident": "04/07/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10808975,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI ELANTRA. THE CONTACT STATED THAT WHILE DRIVING AT 72 MPH, THE VEHICLE SEIZED AS THE ABS AND POWER STEERING WARNING LIGHTS ILLUMINATED. THE VEHICLE WAS TOWED TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE STEERING COLUMN MODULE NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE FAILURE. THE FAILURE MILEAGE WAS 132,000.",
        "vin": "KMHDU4AD1AU"
    },
    {
        "components": "UNKNOWN OR OTHER,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "11/08/2015",
        "dateOfIncident": "08/22/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10789111,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "VISOR ARM BROKE AND VISOR CANNOT BE RETURNED TO FOLDED POSITION, AFFECTING VISIBILITY.",
        "vin": "KMHDU46D77U"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "11/04/2015",
        "dateOfIncident": "10/30/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10788462,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING DOWN THE HIGHWAY, APPROXIMATELY 50 MPH, THE PASSENGER'S VISOR SUDDENLY CAME OUT OF THE STORED POSITION AND HUNG DOWN.  IT WOULD NOT STAY IN PLACE IN THE STORED POSITION.  THIS HAPPENED MONTHS AGO.  LAST WEEK ON 10/30/15, THE DRIVER'S VISOR SUDDENLY WOULD NOT STAY IN UP POSITION AND HUNG DOWN, SWINGING BACK AND FORTH WHILE DRIVING, OBSCURING MY VIEW.  THIS SHOULD BE A RECALL AS IT'S A SAFETY ISSUE.",
        "vin": "KMHDU46D87U"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/03/2015",
        "dateOfIncident": "10/02/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10779450,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "SUN VISORS HAVE A DEFECTIVE PART WHICH BRAKES AT THE MOUNT AND THEN FALLS DOWN INTO VISION AREA AND CREATES A HAZARD.  THE PROBLEM IS WHERE THE SUN VISOR IS THE ROD THAT MOUNTS INTO THE BRACKET IS MOLDED IN PLASTIC THAT IS FLANGES SO IT WILL STAY IN THE BRACKET. THE FLANGE BREAKS ALLOWING THE SUN VISOR TO FALL AND WILL NOT HOLD INTO POSITION.  THIS HAPPENED TO ME WHILE DRIVING ON THE FREEWAY AT FREEWAY SPEEDS UNEXPECTEDLY AND CAUSES NOT ONLY A DISTRACTION BUT A DANGEROUS SITUATION THAT ACTUALLY CAN TEMPORARILY BLOCK THE PATH OF VIEW.",
        "vin": "KMHDU46D27U"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "09/23/2015",
        "dateOfIncident": "07/01/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10775481,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "SUNVISOR KEPT FALLING IMPAIRING VIEW OF THE DRIVER. AT FIRST I COULD PUSH IT BACK IN BUT THE HINGE IS BROKEN. I HAVE TRIED VELCRO, TAPE ETC TO KEEP IT UP. WILL FALL RANDOMLY WHILE DRIVING AND DANGLE IN FRONT OF MY VISION. I WANT TO TAKE IT OFF BUT CANT BECAUSE OF WIRES. THIS IS A SAFETY HAZARD. IT WILL WORK FOR SEVERAL WEEKS THEN FALL AGAIN AND CANNOT GET IT TO STAY UP. HAVE FOUND THIS IS A COMMON PROBLEM. IT NEEDS TO BE FIXED AS IT IS A DEFECT ON HYUNDAI'S END AND IS A SAFETY HAZARD. THIS HAS BEEN GOING ON FOR OVER A YEAR ON AND OFF. THE PROBLEM IS ITS VERY RANDOM WHEN IT FALLS AGAIN AND IS SHOCKING. I AM LUCKY TO NOT HAVE GOTTEN IN AN ACCIDENT",
        "vin": "KMHDU46D07U"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "09/19/2015",
        "dateOfIncident": "09/06/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10765282,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING WEST AT SUNSET,  I PULLED MY VISOR DOWN ON THE DRIVERS SIDE  TO SHIELD THE SUN AND IT COMPLETELY FELL DOWN.  THE ONLY THING HOLDING IT UP SOMEWHAT ARE THE VISIBLE  WIRES AND THE SUPPORT CLIP ON THE RIGHT.  THIS IS A HAZARD DUE TO THE FACT THAT I CANNOT PULL THE VISOR COMPLETELY UP IN PLACE.  IT HAS ONE POSITION WHICH DOES NOT SHIELD THE SUN AND ALSO BLOCKS LINE OF SIGHT FOR SIDE MIRROR ON DRIVERS SIDE.  THIS IS A FLAW IN THE PART AND SHOULD BE CONSIDERED FOR RECALL AS IT WAS FOR THE 2007 HYNDAI SONATA.",
        "vin": "KMHDU46D87U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/29/2015",
        "dateOfIncident": "07/27/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10744795,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "IN FEBRUARY OF 2015 MY SON WAS DRIVING MY CAR THE ELANTRA WHEN THE STEERING LOCKED UP..MY HUSBAND HAD TO RESET THE COMPUTER THEN IT WORKED OTHER THAN THE KEY SOMETIMES GETTING STUCK IN THE IGNITION WHEN YOU WHERE IN PARK AND THE CAR WAS OFF.THEN IN APRIL OF 2015 HYUNDAI SENT US A RECALL NOTICE FOR A DEFECT IN THE STEERING SO I HAD IT REPAIRED .WHEN I GOT MY CAR BACK THE STEERING DID NOT LOCK UP ANYMORE AND IT SEEMED TO STEER VERY EASY  THE KEY WOULD STILL GET STUCK SOMETIMES.WELL ONJULY 27 2015 I WAS DRIVING AROUND A ROUNDABOUT IN THE INSIDE LANE WHEN I LOST CONTROL OF THE STEERING AND IT SKIDDED TO A STOP IN THE OUTSIDE LANE WHEN I GOT OUT TO LOOK AT MY TIRE I NOTICED THAT MY RACK AND PINION HAD SNAPPED CLEAN IN HALF.MY CAR HAS LESS THAN 98000 MILES ON IT AND I DID NOT HIT ANYTHING .WHEN I CAME HOME I DID SOME RESEARCH AND FOUND THAT THE 2008 ELANTRAS WERE RECALLED FOR THIS EXACT PROBLEM.UPON SPEAKING WITH HYUNDAI THEY SAID THERE IS NO CONNECTION BETWEEN THE TO BUT AN INDEPENDENT MECHANIC HAS SAID OTHERWISE.SO IF YOU COULD LOOK INTO THIS IT WOULD BE GREATLY APPRECIATED SO NO ONE GETS HURT.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/24/2015",
        "dateOfIncident": "07/16/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10743268,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH SUN VISOR'S WOULD RANDOMLY FALL FROM ITS HINGE AND WOULD BLOCK MY VISIBILITY WHILE DRIVING. THE REAR BRAKE CALIPERS HAVE NEVER WORKED. ESPECIALLY WITH SUCH LOW MILEAGE. I HAVE RECENTLY HAD A BRAKE INSPECTION AND THE FRONT LEFT CALIPER WAS THE ONLY BRAKE THAT HAS BEEN FUNCTIONAL FOR THE PAST 20,000 MILES.",
        "vin": "KMHDU46D07U"
    },
    {
        "components": "STEERING,SUSPENSION,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "07/15/2015",
        "dateOfIncident": "06/21/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10734166,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "2007 HYUNDAI ELANTRA.  CONSUMER WRITES IN REGARDS TO STEERING WHEEL VIBRATION ISSUES.  *SMD  THE CONSUMER STATED AS HE WAS DRIVING, HE HEARD A NOISE AND THEN THE STEERING WHEEL STARTED VIBRATING. THE CONSUMER STATED HE PULLED OVER,  TURNED THE VEHICLE OFF AND REMOVED THE OWNERS MANUAL FROM THE GLOVE COMPARTMENT. THE CONSUMER STATED NO WHERE IN THE OWNERS MANUAL WAS THERE A SECTION RELATING TO STRUTS, SPRINGS OR SHOCK ABSORBERS, WHICH HE THOUGHT WAS THE CAUSE OF THE VIBRATING STEERING WHEEL. *JB",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/25/2015",
        "dateOfIncident": "06/25/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10730494,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON HIGHWAY AT APPROXIMATELY 45 MPH, LOST POWER STEERING WHILE DRIVING IN FAST LANE. TOOK ALL MY MIGHT TO WREST CONTROL OF THE VEHICLE. STEERING STIFFENED UP, WAS ABLE TO GET VEHICLE ACROSS TRAFFIC LANES TO PARKING LOT ENTRANCE.  NOTICED EPS INDICATOR LIGHT LIT, PARKED VEHICLE, TURNED OFF IGNITION. RESTARTED, AND HAD POWER STEERING.   I WAS FORTUNATE IN HAVING DISTANCE BETWEEN VEHICLES WHEN I INITIALLY LOST THE POWER STEERING, AS I WAS ONLY ABLE TO MAKE WIDE TURNS IN DIRECTINBG THE VEHICLE OUT OF THE TRAFFIC FLOW.  VERY DANGEROUS. WILL NOT ALLOW ANYONE BUT ME TO DRIVE THIS VEHICLE AT THIS POINT.  HAS THERE EVER BEEN A RECALL ISUED FOR THIS PROBLEM?",
        "vin": "KMHDU46DX7U"
    },
    {
        "components": "VISIBILITY,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/22/2015",
        "dateOfIncident": "03/01/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10726597,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI ELANTRA. THE CONTACT STATED THAT THE SUN VISOR PIECE THAT CONNECTED THE DRIVER AND PASSENGER SIDE VISORS TO THE ROOF OF THE VEHICLE FRACTURED. AS A RESULT, THE VISORS COULD NOT BE USED. THE DEALER DIAGNOSED THAT THE PIECE WAS FRACTURED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED.  THE MANUFACTURER WAS NOTIFIED OF THE FAILURE.  THE FAILURE MILEAGE WAS 100,000.. . .. .UPDATED 07/21/15 *BF  THE CONSUMER WAS DRIVING 65 MPH WHEN THE SUN VISOR FELL INTO HIS LINE OF VISION. HE COULDN'T REMOVE IT OR PUT IT BACK UP. HE HAD TO HOLD IT IN THE UP POSITION UNTIL HE COULD GET HOME AND TAKE IT DOWN WITH A SCREW DRIVER. UPDATED 07/30/15*JB ...UPDATED 08/20/15 *BF  THE CONSUMER STATED THE FIRST TIME THE INCIDENT HAPPENED, HE WAS IN THE VEHICLE WITH HIS WIFE. SHE GENTLY PULLED DOWN THE PASSENGER SUN VISOR AND THE CLIP THAT HELD THE VISOR IN THE RETAINING BRACKET SWIVEL BROKE AND COULD NOT BE RE-ATTACHED OR PUT BACK IN THE UP POSITION. THE SECOND TIME IT HAPPENED, IT WAS TWO MONTHS LATER. THE CONSUMER GENTLY PULLED THE VISOR DOWN IN THE FORWARD POSITION AND HEARD A CRACK. THE CONSUMER HAD TO USE HIS HAND, TO HOLD THE VISOR UP.  UPDATED 09/01/15*JB",
        "vin": "KMHDU46D17U"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "06/08/2015",
        "dateOfIncident": "06/08/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10724156,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING SLOWLY, AND MY DRIVER-SIDE VISOR BROKE. THIS IS A SIGNIFICANT SAFETY HAZARD SINCE I CANNOT SUCCESSFULLY BLOCK THE SUN WHILE DRIVING. A QUICK INTERNET SEARCH REVEALS THAT THIS IS A COMMON PROBLEM WITH THIS SPECIFIC VEHICLE. PLEASE ISSUE A RECALL FOR THIS SAFETY PROBLEM!!!",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/22/2015",
        "dateOfIncident": "04/21/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10712215,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI ELANTRA. WHILE DRIVING APPROXIMATELY 35 MPH, AN ABNORMAL NOISE EMITTED FROM THE REAR OF THE VEHICLE. THE CONTACT CAME TO A COMPLETE STOP AND, AFTER INSPECTING THE VEHICLE, NOTICED THAT A PIECE OF METAL AND THE REAR PASSENGER SIDE TIRE WERE DRAGGING. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC. THE TECHNICIAN DIAGNOSED THAT THE SUBFRAME WAS RUSTED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 110,823.",
        "vin": "KMHDU46D07U"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "04/11/2015",
        "dateOfIncident": "07/09/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10705129,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SUN VISORS SPONTANEOUSLY DROP OUT AND THEN SWING FREELY CAUSING OBVIOUS ACCIDENT RISK. I FINALLY HAD TO REMOVE THEM BOTH FOR SAFETY REASONS. THIS SEEMS TO BE WIDELY REPORTED AND SEEMS TO BE DANGEROUS ENOUGH TO WARRANT A RECALL BUT I HAVE NOT SEEN THIS HAPPEN.  *TR",
        "vin": "KMHDU46D97U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/09/2015",
        "dateOfIncident": "04/05/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10704788,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CHECK ENGINE LIGHT HAS COME ON & HAS BEEN ON SINCE SUNDAY. I GOT ONLINE WHERE IT TOLD ME THAT THERE HAS BEEN RECALLS ON THIS CAR OVER THE AIRBAGS MALFUNCTIONING. I DONE THE VIN SEARCH & IT TOLD ME THAT THE RECALL IS INCOMPLETE ON MY CAR WHAT DO I NEED TO DO TO GET THIS FIXED?? I AM PREGNANT & GETTING READY TO HAVE MY BABY & DON'T WANT TO BE GOING DOWN THE ROAD & MAYBE HAVE AN ACCIDENT DUE TO THIS ISSUE.   *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,EXTERIOR LIGHTING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/25/2015",
        "dateOfIncident": "03/25/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10701808,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING HOME ANOTHER VEHICLE PULLED BESIDE MY WIFE AND INDICATED THAT WHEN SLOWING DOWN FOR THE TRAFFIC LIGHT NONE OF HER BRAKE LIGHTS WERE OPERATIONAL. UPON MY WIFE ARRIVING AT HOME I HAD ALL THE FUSES TESTED AND REPLACED, HAD BULBS REPLACED, BUT STILL NO BRAKE LIGHTS ON THE REAR OF CAR INCLUDING THE REAR WINDOW BRAKE LIGHT. CONTACTED HYUNDAI AND INDICATED THAT THERE WAS A NHTSA RECALL #13V113000/CAMPAIGN #110 IN REGARDS TO EXTERIOR LIGHTING:BRAKE LIGHTS:SWITCH. HYUNDAI REFUSED TO ACKNOWLEDGE THE RECALL FOR MY VEHICLE INDICATING THAT MY VIN MANUFACTURE DATE OF MID-2006 ELIMINATED MY VEHICLE FROM THE RECALL. I INFORMED HYUNDAI THAT A 2007 MODEL CAR HAD TO BE MANUFACTURED IN 2006. THE CASE MANAGER, [XXX] OF HYUNDAI (REFUSED TO GIVE LAST NAME) GAVE ME CASE NUMBER [XXX] AND INFORMED ME THAT HYUNDAI WOULD NOT REPAIR THE CAR OR HONOR THE RECALL BECAUSE OF THE PRODUCTION DATE. NONE OF THE WEB SITES I INVESTIGATED IN REGARDS TO THIS RECALL  INDICATE THAT A VEHICLE MUST MEET A SPECIFIC PRODUCTION DATE, ONLY THE MODEL YEAR, WHICH MINE DOES 2007 HYUNDAI ELANTRA.  HYUNDAI DOES NOT INDICATE ANYWHERE IN PUBLIC DOCUMENTATION IN REGARDS TO RECALLS THAT VEHICLES MUST MEET SPECIFIC PRODUCTION CRITERIA. HYUNDAI HAS DENIED MY REQUEST TO REPAIR THE SPECIFIC PART INVOLVED IN THE RECALL, THE BRAKE LIGHT SWITCH, AND [XXX] INFORMED ME THAT HE WAS NOT WILLING TO ENTERTAIN REVIEWING ANY OF MY DOCUMENTATION INVOLVING THIS RECALL.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "KMHDU46D77U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/17/2015",
        "dateOfIncident": "03/17/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10694967,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI ELANTRA. WHILE DRIVING 30 MPH, THE BRAKE LIGHTS FAILED TO FUNCTION. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 93,955.",
        "vin": "KMHDU46D77U"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/25/2015",
        "dateOfIncident": "01/20/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10690554,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER'S SIDE SUN VISOR SUPPORT BROKE, CAUSING IT TO HANG DOWN AND OBSTRUCT VISIBILITY. I AM ABLE TO PUSH IT BACK UP INTO PLACE, BUT IT FALLS AGAIN AFTER A FEW DAYS ON SMOOTH ROADS OR MORE QUICKLY, IF THE ROADS ARE ROUGH.",
        "vin": "KMHDU46D97U"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/24/2015",
        "dateOfIncident": "01/19/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10690206,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE DRIVER SIDE SUN VISOR FELL DOWN ALMOST CAUSING ME TO WRECK. I CAN PUSH IT UP, BUT IT WON'T STAY UP. ABOUT A WEEK OR TWO LATER THE PASSENGER SIDE SUN VISOR ALSO FELL. THIS IS A MAJOR SAFETY HAZARD!!!  *JS",
        "vin": "KMHDU46D27U"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/09/2015",
        "dateOfIncident": "02/02/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10682266,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 HYUNDAI ELANTRA.  THE CONTACT STATED THAT WHILE DRIVING AT APPROXIMATELY 10 MPH ENGAGING THE BRAKES, THE BRAKE LIGHTS FAILED TO ILLUMINATE.  THE VEHICLE WAS TAKEN TO A DEALER AND WAS NOT DIAGNOSED OR REPAIRED.  THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 107,000.",
        "vin": "KMHDU46D87U"
    },
    {
        "components": "UNKNOWN OR OTHER,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/01/2015",
        "dateOfIncident": "10/01/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10680415,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "BROKEN DRIVER SIDE VISOR CREATING A DRIVING HAZARD WHEN IT KEPT KEEPS FALLING DOWN OBSTRUCTING THE DRIVERS LINE OF SIGHT. VERY FLIMSY PLASTIC AND YOU ARE UNABLE TO EASILY REPAIR IT... I HAVE SINCE REMOVED THE VISOR ENTIRELY AND IT IS STILL A HAZARD WHEN DRIVING INTO THE SUN. COST TO REPLACE IS $200+ WHICH IS INSANE FOR SOMETHING THAT SHOULD MUCH STRONGER. SAME ISSUE WITH THE 2007 SONATA AND I SUSPECT THE SAME PART/DURABILITY APPLIES TO THE 2007 ELANTRA SINCE I'VE HEARD MANY OF THE SAME ISSUES. PLEASE ISSUE A RECALL FOR THE VISORS FOR THE 2007 HYUNDAI ELANTRA!   *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "01/31/2015",
        "dateOfIncident": "01/12/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10680130,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIR BAG LIGHT CAME ON IN MY 2007 HYUNDAI ELANTRA. WHEN I TOOK IT TO THE DEALERSHIP, THEY SAID THAT THERE WAS SOME KIND OF ELECTRICAL FAILURE IN THE DRIVER'S SIDE BUCKLE ASSEMBLY. I HAVE HEARD OF SIMILAR ISSUES IN 2006-2008 SONATAS. I AM CONCERNED THAT THIS MAY BE A FACTORY DEFECT.  *TR",
        "vin": "KMHDU46D07U"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "11/12/2014",
        "dateOfIncident": "07/04/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10654295,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING AT A LOWER RATE OF SPEED IN A HIGHLY RESIDENTIAL AREA WHEN THE SUN VISOR BROKE OFF FROM ITS PIN FROM THE CEILING OF THE TRIM, HIT ME IN THE FACE, AND DANGLED FROM THE ELECTRICAL CORD, BLOCKING MY WHOLE LINE OF VISION.  THE INCIDENT SCARED ME WHEN IT HIT ME IN THE FACE AS WELL AS BLOCKED MY SIGHT AND I SWERVED INTO ONCOMING TRAFFIC NEARLY HITTING A CAR.  I HAD TO PHYSICALLY HOLD THE VISOR OUT OF MY WAY UNTIL I COULD PULL OVER.    THE VISOR HAS A PLASTIC POST WHICH IS SUPPOSED TO SUPPORT THE WHOLE WEIGHT AND MOVEMENT OF THE VISOR, WITHIN WHICH AN ELECTRICAL CORD FOR THE ILLUMINATED MIRROR PLUGS INTO A CONNECTION (THUS HOW IT WAS DANGLING).  THIS SAME PIECE WAS RECALLED IN THE SONATA BUT NOT IN THE ELANTRA, AND THIS IS A SERIOUS SAFETY ISSUE.  *TR",
        "vin": ""
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/27/2014",
        "dateOfIncident": "04/15/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10650322,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH VISORS FELL WITHIN A WEEK OF EACH OTHER AS I WAS GOING DOWN THE HIGHWAY HINDERING MY VIEW AND SCARING THE CRAP OUT OF ME.  I SEE NO RECALLS?  ISN'T THIS A SAFETY CONCERN FOR HYUNDAI?  *TR",
        "vin": "KMHDU46D47U"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/27/2014",
        "dateOfIncident": "07/15/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10650330,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR WHEN I TRIED TO BRAKE ON THE HIGHWAY STARTING PULLING TO THE RIGHT AND WHEN I LET OFF THE BRAKE IT CORRECTS BACK.  I TOOK IT TO THE DEALER AND THEY SAID IT WAS THE BRAKE CALIPER AND BRAKE HOSE...MY BROTHER IS AN AUTO MECHANIC FOR LEXUS AND DECIDED TO LOOK INTO IT FURTHER AND IT IS ACTUALLY THE BRAKE ACTUATOR WHERE THE BRAKE FLUID ISN'T EVEN GETTING TO THE CALIPER.  I AM AFRAID TO DRIVE THE CAR.  THIS IS A HUGE SAFETY CONCERN FOR ME.  AND I DON'T SEE WHERE THIS IS RECALLED BY HYUNDAI?  AND, THE BRAKE LIGHT ISN'T ON TELLING ME THERE IS AN ISSUE IN THE ABS SYSTEM??????  HAS ANYONE ELSE EXPERIENCED THIS PROBLEM?  *TR",
        "vin": "KMHDU46D47U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/25/2014",
        "dateOfIncident": "10/22/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10649993,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "A BOLT ON THE LOWER STEERING SHAFT SHEARED OFF AND DISCONNECTED THE LOWER STEERING SHAFT AND DAMAGED THE CLOCKSPRING. IT ALSO CAUSED THE CAR TO SPIN OUT OF CONTROL IN THE RAIN BECAUSE I LOST THE ABILITY TO CONTROL STEERING. THE CAR FINALLY STOPPED INCHES AWAY FROM A ROCK WALL. THE CAR WAS UN-DRIVABLE DUE TO THE LOSS OF STEERING ABILITY. MY MECHANIC HAD TO REMOVE AND REPLACE THE LOWER STEERING SHAFT AND CLOCK SPRING ASSEMBLY.   *TR",
        "vin": "KMHDU46D87U"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/20/2014",
        "dateOfIncident": "05/05/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10648885,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "PROBLEM: THE DRIVER SIDE VISOR FELL DOWN FROM THE UP POSITION WHEN TRYING TO PUT IT UP. FOR A WHILE, I WAS ABLE TO GET IT *ALMOST* ALL THE WAY UP, TO PRESERVE VISIBILITY. HOWEVER, I WAS UNABLE TO USE THE VISOR IN ANY OTHER POSITION. UPON TAKING APART THE MOUNT WHICH SECURES THE VISOR TO THE ROOF, I SAW THAT A PLASTIC RING HAD BROKEN OFF THE VISOR ARM. DROVE WITH THE VISOR LOW. TWO-THREE MONTHS LATER, THE PASSENGER SIDE VISOR FELL IN A SIMILAR FASHION. THE PASSENGER VISOR FELL FURTHER THAN THE DRIVER'S ONE, HANGING ONLY FROM THE INTERNAL WIRE. OPENED THE MOUNT AND OBSERVED THE SAME BREAK AT THE PLASTIC RING AT THE END OF THE VISOR SHEATH. ATTEMPTED GLUE REPAIR EACH TIME, WHICH DID NOT FULLY WORK.     ATTEMPTED FIX: IN BOTH CASES, SUPER GLUE DID NOT HOLD & THE RING IS STILL SEPARATED. HOWEVER, RESIDUE FROM THE GLUE ON THE VISOR ARM CAUSES ENOUGH FRICTION TO KEEP THE PLASTIC SHAFTS IN THE CEILING MOUNTS MOST OF THE TIME. THE PASSENGER VISOR FALLS DOWN MOST FREQUENTLY (EVEN THO THIS CAR HAS A SINGLE DRIVER, AND THE PASSENGER SIDE VISOR IS RARELY USED -- USUALLY TO HOLD A SUNSHADE IN THE WINDSHIELD). IT DANGLES FROM THE INTERNAL WIRE, AND IT MUST BE SHOVED BACK IN THE CEILING WITH A GREAT BIT OF FORCE AND TWISTING.    SUMMARY: THE PROBLEM WITH THE VISOR ARM SHEATH IS A DESIGN FLAW. THE SHEATH NARROWS JUST BEFORE IT WIDENS OUT AGAIN TO FORM A RING. THE RING IS THE PART THAT PREVENTS THE VISOR FROM FALLING OUT OF THE CEILING MOUNT. HOWEVER, THE NARROWING OF THE PLASTIC WEAKENS THE ARM AT THE POINT WHERE IT IS BEARING STRESS, WHICH CAUSES IT TO BREAK. THERE'S NO REASON THAT A VISOR SHOULD BREAK WHEN IT'S ONLY USED 5-10% OF THE TIME. IT'S ALSO IMPOSSIBLE TO COMPLETELY REPAIR EXCEPT BY REPLACING THE ENTIRE VISOR, WHICH IS AROUND $150 EACH AT THE DEALER. HYUNDAI HAS ALREADY ADMITTED THAT THIS IS A PROBLEM BY RECALLING THEM ON THE SONATA. ELANTRA OWNERS SHOULD BE INCLUDED IN THIS.  *TR",
        "vin": ""
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/07/2014",
        "dateOfIncident": "10/05/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10643123,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VISOR ON THE DRIVER'S SIDE BROKE AND FELL INTO MY FACE WHILE DRIVING ON THE FREEWAY.  THE PLASTIC PIECE THAT HOLDS IT INTO THE ROOF OF THE CAR IS NOT ATTACHED.  THE ONLY THING HOLDING THE VISOR THERE IS A BLACK WIRE.  THE VISOR CANNOT BE USED TO SHIELD FROM THE SUN AND IS EXTREMELY DANGEROUS TO DRIVE WITH, AS IT HANGS LOW EVEN WHEN IT IS FOLDED UP TOWARDS THE ROOF OF THE CAR.  TODAY, 10/7, I WENT TO CHECK THE PASSENGER SIDE VISOR TO SEE IF I COULD FIGURE OUT HOW THE DRIVER'S SIDE BROKE, AND THE PASSENGER SIDE BROKE AND FELL ALSO!  THIS IS EXTREMELY HAZARDOUS AND I HAVE SEEN SEVERAL COMPLAINTS ABOUT THIS IN MAINLY 2007 HYUNDAI MODELS ON OTHER INTERNET FORUMS.  PLEASE INVESTIGATE!!!!  *TR",
        "vin": "KMHDU46D87U"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/07/2014",
        "dateOfIncident": "10/01/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10643136,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER SIDE SUN VISOR CAME DOWN UNEXPECTEDLY, HITTING ME IN THE FACE, AND OBSTRUCTED MY VIEW WHILE TRAVELING AT 65MPH. ONCE I PULLED OVER, I FOUND THE PLASTIC PIECE THAT SECURES THE VISOR TO THE TOP OF THE CAR BROKE INSIDE, LEAVING A PLASTIC RING INSIDE. UPON RESEARCH I FOUND THIS IS A FREQUENT FAILURE FOR HYUNDAI, BUT NO RECALL HAS BEEN ISSUED ON THE ELANTRA ONLY ON THE SONATA ~2006, BUT THE PARTS ARE IDENTICAL. HYUNDAI NEEDS TO DO A MASSIVE RECALL AND MAKE THIS RIGHT!  *TR",
        "vin": "KMHDU46D17U"
    },
    {
        "components": "EXTERIOR LIGHTING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/04/2014",
        "dateOfIncident": "10/03/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10641461,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TOOK HYUNDAI ELANTRA FOR RECALL REPAIR IN 2011, ONE OF THE REPAIRS SCHEDULED WAS THE STOP LAMP SWITCH. WAS APPROACHED IN TRAFFIC YESTERDAY BY A HELPFUL, CONCERNED DRIVER WHO SAID THE BRAKE LIGHTS WERE NOT COMING ON. GRATEFUL FOR THAT PERSON, WHO MAY HAVE SAVED OUR LIVES. NOT GRATEFUL TO THE DEALER WHO OFFERED ZERO ASSISTANCE - ONLY AN OVERPRICED DIAGNOSTIC FEE PLUS STANDARD PARTS AND LABOR COST. THIS WAS AFTER I HAD ALREADY DETERMINED THE SWITCH WAS THE EXACT PROBLEM. RATHER THAN FORK OVER $120 FOR AN UNNECESSARY DIAGNOSIS, I BOUGHT THE PART ELSEWHERE FOR $12 AND INSTALLED IT IN NO TIME, WITH A LITTLE HELP FROM AN 11YR OLD. BOTTOM LINE: THE STOP LAMP SWITCH NOT WORKING IN 2014 AFTER A 2011 RECALL SERVICE MEANS EITHER 1) BURNS HYUNDAI IN MARLTON NJ DIDN'T ACTUALLY REPLACE THE SWITCH THEY SAID THEY REPLACED OR 2) THEY FEEL OK ABOUT PUTTING CUSTOMERS AT RISK OF DEATH BY INSTALLING A CRITICAL PART THAT ONLY LASTS 3 YEARS. NEITHER SITUATION IS ETHICAL.  *TR",
        "vin": "KMHDU46D87U"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,EXTERIOR LIGHTING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/22/2014",
        "dateOfIncident": "09/18/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10637965,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE IS EXPERIENCING THE SAME IS AS THE HYUNDAI RECALL CAMPAIGN 110. MY CAR WAS MANUFACTURE BEFORE THE DATES IN THE CAMPAIGN BY APPROXIMATELY 5 MONTHS BUT FALLS IN THE SAME MODEL YEAR AS OTHER CARS IN THE CAMPAIGN.   HERE IS A LINK TO CAMPAIGN HTTPS://WWW.HYUNDAIUSA.COM/CAMPAIGN110.  I CONTACTED HYUNDAI AND THEY REFUSE TO TAKE CARE OF THIS EVEN THOUGH I AM EXPERIENCING THE SAME ISSUE.  THE CAMPAIGN PROBABLY NEEDS TO BE EXPANDED TO COVER ALL 2007 VEHICLES. SOMETHING LIKE BRAKE LIGHTS SHOULD NOT FAIL AND CREATES A SIGNIFICANT SAFETY HAZARD.  *TR",
        "vin": "KMHDU46D37U"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "09/03/2014",
        "dateOfIncident": "09/01/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10630397,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN THE ROAD WHEN MY DRIVER SIDE SUN VISOR SUDDENLY DROPPED SEVERAL INCHES OBSTRUCTING MY VIEW.  THE PLASTIC ARM HAS APPARENTLY SNAPPED, ALLOWING THE VISOR TO SHIFT FROM THE \"UP\" POSITION.  THIS HAS ALSO HAPPENED ON THE PASSENGER SIDE SEVERAL MONTHS AGO!  THE VISORS ARE NO LONGER USABLE SINCE THEY ARE TOO LOW WHEN IN THE \"DOWN\" POSITION AND OBSTRUCT THE VIEW.  THIS PRESENTS A HAZARD IN THREE WAYS, FIRST THE SUDDEN FAILURE OF THE VISOR PARTIALLY OBSTRUCTING THE VIEW OF THE DRIVER, SECOND WHEN THE VISOR IS DOWN AFTER FAILURE OF THE ARM THE VIEW IS OBSTRUCTED, THIRD SINCE THE VISOR CANNOT BE PUT DOWN, THERE IS NO WAY TO BLOCK THE SUN WHILE DRIVING AT DUSK AND DAWN RESULTING IN POOR FIELD OF VIEW DUE TO THE GLARE.  THIS IS AN ISSUE THAT NEEDS TO BE ADDRESSED BEFORE SOMEONE GETS HURT!  *TR",
        "vin": "KMHDU46D77U"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "08/31/2014",
        "dateOfIncident": "08/11/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10629734,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SIDE SUN VISOR BROKE AND FELL INTO FACE OF DRIVER WHILE DRIVING, IMPAIRING VISIBILITY. THE PLASTIC KNOB ON THE TOP SIDE OF THE MOUNT BROKE OFF, ALLOWING THE VISOR TO SLIP OUT OF THE MOUNT.  *TR",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/17/2014",
        "dateOfIncident": "05/10/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10625825,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DOOR HANDLE CAME OFF THE VEHICLE WHEN ATTEMPTING TO OPEN THE DOOR. THIS HAS HAPPENED TO THREE DOOR HANDLES.  *TR",
        "vin": "KMHDU46D87U"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "08/15/2014",
        "dateOfIncident": "11/12/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10622609,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SUN VISOR ESPECIALLY DRIVER SIDE DROPPED SUDDENLY WHILE I DROVE ON THE ROAD. WHEN THE SUN VISOR DROPPED, I DROVE ON THE HIGHWAY THAT CAUSE A SIGNIFICANT DANGER FOR DRIVING SAFETY. I EVEN CONTACTED WITH MANUFACTURER, HYUNDAI BUT THEY DENIED FREE REPLACEMENT OF THE BROKEN SUN VISOR. THEY TOLD ME SUN VISOR WAS NOT ONLY A TEMPORARY REPLACEMENT PARTS BUT IT DID NOT ALSO COVER BY WARRANTY. I RESEARCHED SIMILAR ISSUES I HAVE AND A LOT OF USERS HAVE SAME PROBLEM OF BROKEN SUN VISOR THAT MAY CAUSE POTENTIAL DANGER OF DRIVING EXPERIENCE. THE SUN VISOR IS STILL WORKING ORDER WHEREAS ONLY HOLDING PARTS BROKE WITHOUT FORCE. IT NEEDS TO RECALL FOR THIS SUN VISOR PROBLEM BECAUSE IT MAY HARM BOTH SAFETY FOR A DRIVER AND POTENTIAL DAMAGE OF AUTOMOBILE.   P.S. I WENT TO LOCAL HYUNDAI PARTS AND SERVICES TO REPLACE THIS BROKEN SUN VISOR BUT THEY QUOTED ME A REPLACEMENT $150 FOR PARTS AND AROUND $30 FOR LABOR. IT IS TOO PRICEY THAT MOST OF GENERAL DRIVERS DO NOT EXPECT TO PAY FOR THE REPLACEMENT. SHOULD RECALL FOR DEFECTIVE INTERNAL COMPONENTS LIKE THIS BROKEN SUN VISOR.  *TR",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/29/2014",
        "dateOfIncident": "01/06/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10617098,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH OF THE SUN VISORS IN MY VEHICLE FALL DOWN WHEN GOING OVER A SPEED HUMP.  THE PLASTIC DOWEL HOLDING THE VISOR IN PLACE IS DEFECTIVE.  THERE ARE NUMEROUS OTHER HYUNDAI VEHICLES SUFFERING FROM THE SAME PROBLEM, AS DOCUMENTED HERE:  HTTP://HOWTOMENDIT.COM/ANSWERS.PHP?ID=157121    UPDATED 8/5/2015*JS",
        "vin": "KMHDU46DX7U"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "07/14/2014",
        "dateOfIncident": "12/12/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10610313,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN THE FREEWAY AND MY DRIVER'S SIDE SUN VISOR FLOPPED DOWN.  AS IT WAS ATTACHED BY WIRES TO LIGHT THE MIRROR, IT DANGLED IN THE WAY.  SO, WITH ONE HAND I KEPT IT OUT OF MY WAY SO I COULD CONTINUE TO DRIVE AND PULL OVER TO SAFETY.  THE VISOR BROKE FROM WITHIN THE BALL JOINT THAT LETS IT ROTATE DOWN AND TO THE SIDE.  NOTHING I COULD DO WOULD HOLD IT IN PLACE, DUCT TAPE, VELCRO, ETC..., SO I HAD TO CUT THE WIRES AND REMOVE THE VISOR SO I COULD DRIVE.  THE SAME EXACT THING HAPPENED TWO WEEKS LATER TO MY PASSENGER SIDE VISOR.  I HAD TO REMOVE IT TOO.  NOW TO GET ONE VISOR REPLACED IT WOULD COST ME $150.00 OF WHICH I COULD NOT, AND HAVE NOT BEEN ABLE TO AFFORD SINCE IT HAPPENED.  I AM DRIVING AROUND IN A CAR THAT DOES NOT HAVE SUN VISORS IN SOUTHERN CALIFORNIA WHERE THE SUN SHINES LONG AND HARD.  *TR",
        "vin": "KMHDU46D97U"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "07/12/2014",
        "dateOfIncident": "06/02/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10610035,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ALONG AT ABOUT 35 MILES PER HOUR AND SUDDENLY THE PASSENGER SIDE SUN VISOR BROKE AND WAS LEFT HANGING BY THE WIRE THAT CONNECTS THE VANITY LIGHT. IT WAS VERY DISTRACTING. I'M JUST GLAD IT DIDN'T HAPPEN IN HEAVY TRAFFIC AT FREEWAY SPEED.  I CONTACTED MY LOCAL DEALER IN MESQUITE, TX. BUT WAS TOLD THERE WAS NOTHING THEY COULD DO BECAUSE THE MILEAGE WAS LOW ENOUGH. BUT DUE TO THE AGE OF THE VEHICLE IT WAS OUT OF WARRANTY.   I KNOW FROM BROWSING THE INTERNET THAT THIS PROBLEM IS WIDESPREAD ACROSS THE ENTIRE LINE OF HYUNDAI VEHICLES.  AND $200 TO REPLACE THE SUN VISOR IS TOO EXPENSIVE FOR SUCH A SIMPLE PART THAT WAS BADLY DESIGNED. IT IS A SIMPLE ROD GOING INTO THE MOUNTING BRACKET THAT BREAKS. THE ENTIRE SUN VISOR IS IN PERFECT CONDITION EXCEPT FOR THIS SIMPLE PIECE. THEY SHOULD HAVE MADE A REPLACEMENT PART JUST FOR THE MOUNTING AND LEAVE THE REST OF THE EXISTING SUN VISOR REUSABLE.  BECAUSE OF THE WIDE SPREAD PROBLEM I THINK HYUNDAI SHOULD HAVE DONE A RECALL.  THANK YOU.  *TR",
        "vin": "KMHDU46D17U"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "07/11/2014",
        "dateOfIncident": "06/15/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10609997,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE DRIVERS SIDE SUN VISOR FELL DOWN INTO VIEW. I WAS NOT TOUCHING OR ADJUSTING IT AT THE TIME.   IT IS NOW HANGING HALFWAY DOWN BLOCKING MY LINE OF VISION. I HAVE TRIED EVERYTHING POSSIBLE TO PUSH/HOLD IT UP BUT IT SEEMS TO BE MISSING WHATEVER MECHANISM KEPT THE VISOR ARM IN THE CEILING. I WOULD JUST REMOVE IT ACCEPT THE LIGHTING WIRES ARE ANCHORING IT. IT IS A HAZARD WHILE DRIVING, BLOCKING MY VIEW SO I HAVE RESORTED TO USING VELCRO TO HOLD IT UP, BUT IN THE HEAT IT DOESN'T STAY, AND KEEPS FALLING DOWN AND BLOCKING MY VISION. I HAVE SEEN VARIOUS FORUMS FILLED WITH PEOPLE HAVING THE SAME ISSUE WITH MODELS IN THE 2007-2009 RANGE. HERE IS ONE: HTTP://HOWTOMENDIT.COM/ANSWERS.PHP?ID=157121    SEEMS LIKE A FAULTY EQUIPMENT ISSUE. A RECALL SHOULD BE ISSUED.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/04/2014",
        "dateOfIncident": "07/01/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10608244,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MY AIRBAG LIGHTS CAME ON AND I TOOK IT TO THE DEALER.  IT TOOK THEM OVER TWO HOURS TO FIND THE PROBLEM: THE ENTIRE FLOOR HARNESS IS CORRODED FROM SOME SORT OF \"MELTDOWN\" AND NEEDS TO BE REPLACED.  COST = $4800.  I FEEL THIS IS A MAJOR DESIGN FLAW IN THE VEHICLE AND HYUNDAI SHOULD REPLACE THE FLOOR HARNESS AS A GOODWILL WARRANTY ISSUE.  THERE IS NO WAY A 6 YEAR OLD CAR WITH ONLY 35,000 MILES ON IT SHOULD BE EXPERIENCING THIS KIND OF PROBLEM!  THIS IS A MAJOR SAFETY ISSUE AS RIGHT NOW I AM FORCED TO DRIVE THE VEHICLE WITH AIR BAGS NON-FUNCTIONAL.  *TR",
        "vin": "KMHDU46DX7U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/02/2014",
        "dateOfIncident": "07/01/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10607877,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI ELANTRA. THE CONTACT STATED THAT THE AIR BAG INDICATOR REMAINED ILLUMINATED IN THE VEHICLE. THE DEALER STATED THAT THE ENTIRE ELECTRICAL HARNESS WAS CORRODED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 35,000.  UPDATED 08/14/14*LJ  HYUNADAI FIXED THE VEHICLE, FREE OF CHARGE. UPDATED 09/16/14",
        "vin": "KMHDU46DX7U"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/01/2014",
        "dateOfIncident": "09/01/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10607299,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH SUN VISORS WILL NOT STAY UP AND COME DOWN WHEN GOING OVER A BUMP.  THEY CAN BE MANEUVERED BACK IN PLACE, BUT WILL FALL DOWN AGAIN.  *TR",
        "vin": "KMHDU46D57U"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "06/17/2014",
        "dateOfIncident": "04/15/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10598941,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER'S SIDE SUN VISOR HAS BROKEN AT THE HINGE. THIS CAUSES THE SUN VISOR TO DROP SUDDENLY AND UNEXPECTEDLY WHEN GOING OVER A BUMP, THEREBY HINDERING VISIBILITY WHILE DRIVING.  *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "06/13/2014",
        "dateOfIncident": "11/14/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10598030,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI ELANTRA.  THE CONTACT STATED THAT THE AIR BAG LIGHT INDICATOR ILLUMINATED ON THE INSTRUMENT PANEL.  THE MANUFACTURER WAS CONTACTED.  THE VEHICLE WAS NOT TAKEN TO THE DEALER.  THE FAILURE MILEAGE WAS 76,000 AND THE CURRENT MILEAGE WAS 79,000. ..UPDATED 08/11/14 *BF  THE DEALER INFORMED THE CONSUMER, THE SEAT BELT SENSOR NEEDED TO BE REPLACED. UPDATED 8-26-14",
        "vin": "KMHDU46D87U"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "06/10/2014",
        "dateOfIncident": "06/09/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10597432,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MY PASSENGER SUN VISOR WILL NOT STAY UP AND IT CONSTANTLY FALLS WHILE DRIVING OR RUNNING OVER A BUMP.  IT'S VERY AGGRAVATING AND IT NEEDS TO BE FIXED BEFORE CAUSING AN ACCIDENT.   *TR",
        "vin": "KMHDU46D47U"
    },
    {
        "components": "VISIBILITY,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/30/2014",
        "dateOfIncident": "07/01/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10595076,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "SUN VISORS WON'T STAY UP, I LIVE IN LAS VEGAS WHERE IT IS EXTREMELY HOT & SUNNY.  THE VISOR WON'T STAY IN PLACE SO I CAN'T PLACE IT IN A POSITION WHERE I CAN SEE AROUND IT AND IT WON'T HOLD A WINDOW VISOR IN PLACE TO KEEP THE SUN OUT OF THE INTERIOR OF THE CAR.  *TR",
        "vin": ""
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "05/30/2014",
        "dateOfIncident": "03/03/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10595139,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH THE DRIVERS SIDE AND PASSENGER SIDE VISORS BROKE, FALLING DOWN INTO THE VIEW OF THE DRIVER CAUSING A MAJOR VISIBILITY PROBLEM AND DISTRACTION TRYING TO GET IT BACK IN PLACE. THE VISOR BROKE AT A PLASTIC JUNCTION.  *TR",
        "vin": "KMHDU46D47U"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "05/30/2014",
        "dateOfIncident": "03/03/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10595134,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH THE DRIVERS & PASSENGERS SUN VISORS HAVE BROKEN AT THEIR INTERNAL PLASTIC MOUNTS. WHEN A BUMP IN THE ROAD IS ENCOUNTERED THE VISOR WILL DROP DOWN AT THE MOUNT POINT AND OBSCURE VISIBILITY AND CREATE A DRIVING DISTRACTION OF TRYING TO GET IT BACK IN PLACE.  *TR",
        "vin": "JH4KB16556C"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "04/30/2014",
        "dateOfIncident": "04/02/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10585769,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER SIDE VISOR BROKE WHILE DRIVING.  IT FELL HALF-WAY DOWN BLOCKING MY LINE OF VIEW.  THE DRIVER'S SIDE BROKE 4 YEARS AGO IN THE SAME FASHION.   *JS",
        "vin": "KMHDU46D57U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/28/2014",
        "dateOfIncident": "03/15/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10585268,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR LOST POWER STEERING WHILE DRIVING ON THE LONG ISLAND EXPRESSWAY.  STEERING WHEEL JERKED, ESP LIGHT CAME ON AND POWER STEERING FAILED.  CAR SAT OVERNIGHT AND WAS FINE THE NEXT DAY.  SITUATION RECURRED ON OR ABOUT 1/19/13 AND 12/5/13. EACH TIME THE PROBLEM RESOLVED ITSELF OVERNIGHT.  IT OCCURRED AGAIN ON 4/23/14.  AFTER THE MOST RECENT OCCURRENCE, POWER STEERING HAS FAILED COMPLETELY AND HAS NOT BEEN RESTORED.   *JS",
        "vin": "KMHDU46D77U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/17/2014",
        "dateOfIncident": "04/02/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10583301,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TRAVELING ON A TWO LANE ROAD, THE CAR JURKED QUICKLY TO THE LEFT ACROSS CENTER LINE. THE ELECTRONIC POWER STEERING LITE CAME ON AND THE CAR WAS UNSTEERABLE. I FINALLY GOT THE CAR OFF THE ROAD TURNED IT OFF AND RESTARTED IT THE STEERING CAME BACK ON. THIS IS THE SECOND TIME IN A YEAR THIS SAME PROBLEM HAS HAPPENED. DEALER ADJUSTED MOTOR FIRST TIME SAID IT WAS FIXED. THIS IS A VERY DANGEROUS PROBLEM YOU CAN NOT STEER THE CAR WHEN THIS HAPPENS.I WAS VERY LUCKY THERE WAS NO CAR COMMING IN THE OTHER LANE. I HAVE LOOKED ON LINE TO SEE IF THIS IS A PROBLEM AND THERE ARE NUMEROUS COMPLAINTS ON THIS SAME PROBLEM.",
        "vin": "KMHDU46D47U"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "04/16/2014",
        "dateOfIncident": "10/29/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10583229,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER'S SUN VISOR DETACHED FROM ITS PIVOTING HINGE. THIS HAPPENED CONSTANTLY WHILE DRIVING (DUE TO NORMAL CAR VIBRATION), WHICH CAUSED A SAFE HAZARD. BEFORE IT WAS SECURED WITH ADHESIVE, I NOTICED THAT WHEN THE CABIN TEMPERATURE WAS HIGH (CAR PARKED UNDER THE SUN), IT WILL FALL OFF AS WELL WHILE THE CAR WAS STATIONARY. SINCE THE VISOR WAS SECURED WITH ADHESIVE AT ITS PIVOTING JOINT, THE VISOR CANNOT BE TURNED TO SHIELD THE DRIVER FROM DIRECT SUNLIGHT COMING FROM THE SIDE WINDOW.  *TT",
        "vin": "KMHDU46D57U"
    },
    {
        "components": "STRUCTURE,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "04/02/2014",
        "dateOfIncident": "04/11/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10576885,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SIDE SUN VISOR FALL OFF DURING DRIVING AND FEW MONTHS LATER PASSENGER SIDE SUN VISOR ALSO FELL OFF DURING THE DRIVING.THIS IS A SAFETY HAZARD WHILE DRIVING AGAINST THE SUN OR BRIGHT LIGHT.  THERE IS NO SECURED FIT TO ATTACHED SUN VISOR, ATTACHED ONLY WITH THE ELECTRIC WIRE GOING INSIDE THRU VISOR.MANUFACTURING/DESIGN DEFECT.  *TR",
        "vin": "KMHDU46D17U"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "04/01/2014",
        "dateOfIncident": "02/03/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10576137,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SIDE VISOR KEPT FLOPPING DOWN UNTIL IT CAME LOOSE FROM THE BRACKET WHICH HELD IT.    THIS HAPPENED WHILE DRIVING.  THE DEALER WANTS $175.00 TO REPLACE THE VISOR.  *TR",
        "vin": "KMHDU46DX7U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/20/2014",
        "dateOfIncident": "07/10/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10573717,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS ATTEMPTING TO PULL OUT OF A PARKING SPACE, AND THE CAR SHUT OFF. 2ND INCIDENT WAS WHILE DRIVING APPX. 45MPH IT SHUT OFF, ON OR ABOUT 29 OCT.2013. TOOK IT INTO THE DEALER AND THEY REPLACED THE PRESSURE CONTROL SOLENOID, THIS WAS 1NOV. 2013, GOT THE CAR BACK ON 6 NOV. 2013. 3RD TIME WAS 16 NOV. 2013 WHILE EXITING THE INTERSTATE IT SHUT OFF ON THE RAMP. TOOK IT BACK TO THE DEALER ON 17 NOV. 2013. GOT CAR BACK ON 19 NOV.2013. 4TH TIME WAS 27 NOV. 2013, SHUT OFF WHILE RUNNING IN PARK, RESTARTED AND SHUT OFF AGAIN WHILE TRYING TO LEAVE PARKING LOT. TOOK BACK TO DEALER ON 29 NOV. 2013 AND GOT IT BACK 9 JAN.2014. THEY INSTALLED A BATTERY. 5TH TIME WAS 7 FEB 2014, SHUT OFF WHILE PULLING OFF AT A RED LIGHT  AND AGAIN A HALF MILE FURTHER PULLING INTO A PARKING LOT. TOOK BACK TO THE DEALER ON 17 FEB. 2013 AND GOT IT BACK 20 FEB 2013. EACH TIME, DEALER SAYS COULD NOT DUPLICATE CONCERN AND OR COULD  NOT GET A CODE.  *TR",
        "vin": "KMHDU46DX7U"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/19/2014",
        "dateOfIncident": "03/18/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10573367,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE LIGHTS ARE NOT FUNCTIONING.  THIS MODEL WAS SUBJECT TO A RECALL FOR A FAULTY BRAKE LIGHT SWITCH BUT THE HYUNDAI INFORMS ME MINE IS NOT INCLUDED.  I SUSPECT IT MAY BE THE SAME ISSUE.  *TR",
        "vin": "KMHDU46D47U"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/18/2014",
        "dateOfIncident": "03/17/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10573216,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "NO BRAKE LIGHTS, STOP LAMP SWITCH WAS FAULTY.  *TR",
        "vin": "KMHDU46D07U"
    },
    {
        "components": "EXTERIOR LIGHTING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/21/2014",
        "dateOfIncident": "09/19/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10565318,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "IN SEPTEMBER 2012, FRIEND TOLD ME MY LEFT REAR BRAKE LIGHT WAS OUT.  UPON INSPECTION, I NOTICED THE LIGHT INTERMITTENTLY WORKED AND DID NOT WORK.  BROUGHT IT TO THE DEALER, WHO WAS UNABLE TO REPLICATE MY CONCERN.  SO THEY SAID NOTHING WAS WRONG.  I HAVE RECENTLY SEEN THE PROBLEM AGAIN.  NOW, I'VE RECEIVED A RECALL NOTICE FOR THE EXTERIOR BRAKE LIGHTING.  UPON FURTHER RESEARCH, I SEE THIS RECALL WAS ISSUED IN APRIL 2013.  WHY AM I ONLY BEING NOTIFIED NOW??  ESPECIALLY WHEN I BROUGHT THE ISSUE TO THEIR ATTENTION 6 MONTHS EARLIER AND THEY HAVE RECORD OF IT IN THE DEALER'S DATABASE??  *TR",
        "vin": "KMHDU46D27U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/16/2014",
        "dateOfIncident": "01/06/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10560201,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STEERING SQUEAKS AND RATTLES ON ROUGH OR BUMPY SURFACES. IF YOU RELEASE TILT STEERING LEVER AND MOVE STEERING WHEEL UP AND DOWN. ITS MAKES LOUD SQUEAKING NOISES. THE NOISE CONTINUES IN ANY POSITION TILT STEERING IS PUT IN WHILE DRIVING. VERY IRRITATING NOISE .LIKE HAVING A MOUSE IN YOUR CAR.  *TR",
        "vin": "KMHDU46D47U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/15/2014",
        "dateOfIncident": "01/14/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10560021,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DEALER REPLACED THE STEERING COLUMN TO RESOLVE ESCALATING PROBLEMS WITH ELECTRONIC POWER STEERING THAT FAILED INTERMITTENTLY AND WOULD NO LONGER RESET AFTER TURNING THE VEHICLE OFF AND RESTARTING THE ENGINE, RENDERING THE VEHICLE INOPERABLE.    127 MILES AFTER COMPLETION OF THE STEERING COLUMN REPLACEMENT, THE POWER STEERING AGAIN FAILED YESTERDAY EVENING WHILE ENTERING THE HIGHWAY DURING RUSH HOUR.  I REITERATE MY STATEMENT FROM THE PRIOR INCIDENT(S) THAT THIS IS A SERIOUS SAFETY ISSUE - NOT ONLY TO THE DRIVER OF THE VEHICLE, BUT TO OTHER DRIVERS AS WELL.    THIS LONG-TIME HYUNDAI PROMOTER IS ABOUT TO BECOME A DETRACTOR.  *TR",
        "vin": "KMHDU46DX7U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/14/2014",
        "dateOfIncident": "03/15/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10559783,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING FAILED AND EPS LIGHT ILLUMINATED.  CONDITION CLEARED UPON STOPPING VEHICLE, AND RESTARTING IT.  THIS CONTINUED INTERMITTENTLY (MAYBE 10-15 INSTANCES, OFTEN WITH MONTHS BETWEEN OCCURRENCES) UNTIL OCTOBER (182900 MILES), WHEN EPS FAILED TO RESET.  SPEED WAS NOT A CONSISTENT FACTOR; EPS WOULD DEACTIVATE AT ANY SPEED - INCLUDING AS LOW AS 20 MPH.  ESPECIALLY IF/WHEN OCCURRING AT HIGHWAY SPEED, THIS IS A SERIOUS SAFETY CONCERN.  I HAVE SEEN SIMILAR EPS COMPLAINTS FOR THIS MODEL/YEAR REPORTED ON VARIOUS TECH FORUMS AND AM CONCERNED THAT MY EXPERIENCE WAS NOT AN ISOLATED INCIDENT.  DEALER REPLACED STEERING COLUMN TO RESOLVE ISSUE.  *TR",
        "vin": "KMHDU46DX7U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/06/2014",
        "dateOfIncident": "01/03/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10558656,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI ELANTRA. WHILE DRIVING 65 MPH, THE CONTACT STATED THAT POWER STEERING SEIZED ON THE VEHICLE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC AND THE DEALER FOR INSPECTION. THE CONTACT WAS INFORMED THAT THE STEERING COLUMN MODULE NEEDED TO REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE APPROXIMATE FAILURE MILEAGE WAS 64,000.",
        "vin": "KMHDU46D47U"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "01/03/2014",
        "dateOfIncident": "03/07/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10558392,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH SUN VISORS HAVE FAILED ON OUR 2007 HYUNDAI ELANTRA.  WHEN THE DRIVER'S VISOR FELL OFF WHILE DRIVING DOWN THE ROAD, IT NEARLY CAUSED AN ACCIDENT BECAUSE IT WAS HANGING IN FRONT OF MY FACE, AND I COULDN'T SEE WHERE I WAS GOING.  I HAVE SINCE REMOVED THE VISORS ALTOGETHER, AND NOW HAVE PROBLEMS DRIVING IN THE MORNING OR LATE AFTERNOON DUE TO THE SUN SHINING IN MY FACE.  *TR",
        "vin": "KMHDU46D07U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/09/2013",
        "dateOfIncident": "12/08/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10555259,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "ITS BEEN HAPPENING SINCE THE COLD WEATHER HIT THE AREA. I WAS DRIVING ON ICE AND WENT TO TURN AND THE EPS LIGHT CAME ON AND MY ELECTRONIC ASSIST STEERING WENT OUT, OR GOT HARD TO STEER. ITS ALMOST CAUSED AN ACCIDENT  BUT MY EVASIVE MANEUVERING I MANAGED TO GET THE CAR OVER TO THE SIDE OF THE ROADWAY..I SHUT THE CAR OFF TO RESET THE EPS AND I WENT OFF. SO I HEADED BACK HOME AND BEFORE I COULD TURN THE CORNER THE LIGHT CAME BACK ON...NOW ITS BEEN HAPPENING MORE FREQUENTLY AND ITS BEGINNING TO SERIOUSLY BOTHER ME...ID HATE TO THINK OF ME DRIVING DOWN THE FREEWAY AND THAT HAPPENING TO MY CHILDREN..IM TAKING IT TO THE DEALERSHIP IN THE MORNING!  NOT HAPPY WITH IT.  *TR",
        "vin": "KMHDU46D07U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/09/2013",
        "dateOfIncident": "12/09/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10555269,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "LEFT SIDE HEADLIGHT HAS SHORT IN IT. I HAVE HAD TO REPLACE THE BULB 4 TIMES IN ONE MONTH AND NOW A NEW ONE DOESN'T EVEN WORK.    *TR",
        "vin": "KMHDU46D97U"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "11/15/2013",
        "dateOfIncident": "11/12/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10552386,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONTACT OWNS A 2007 HYUNDAI ELANTRA. WHILE THE VEHICLE WAS PARKED THE CONTACT NOTICED THE AIR BAG WARNING LIGHT ILLUMINATED ON THE INSTRUMENT PANEL. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSTIC TESTING WHERE THE TECHNICIANS STATED THE SEAT BELT BUCKLE ON THE FRONT DRIVER SIDE HAD TO BE REPLACED. THE CONTACT WAS ALSO INFORMED THAT THERE WERE TWO RECALL REPAIRS UNDER NHTSA CAMPAIGN ID NUMBER: 11V143000 (AIR BAGS:FRONTAL:SENSOR/CONTROL MODULE) AND NHTSA CAMPAIGN ID NUMBER: 11V179000 (AIR BAGS:FRONTAL:SENSOR/CONTROL MODULE) THAT WERE ASSOCIATED WITH THE VIN THAT HAD TO BE PERFORMED. THE RECALL REPAIRS WERE PERFORMED, HOWEVER, THE DEALER REFUSED TO REPLACE THE BUCKLE, STATED IT WAS NOT COVERED UNDER THE PLATINUM 100,000 MILE WARRANTY AND STATED THE CONTACT WOULD HAVE TO PAY $700 TO HAVE IT REPLACED.  MILEAGE OF FAILURE 70,110.  *TR",
        "vin": "KMHDU46D57U"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "11/07/2013",
        "dateOfIncident": "10/24/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10551407,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE ENTERING FREEWAY, WHEN TRYING TO USE SUNVISOR TO SAFELY NAVIGATE TRAFFIC THE SUN VISOR COMPLETELY FELL APART, THE ONLY THING HOLDING IT TOGETHER IS THE ELECTRICAL CORD FOR THE MIRROR. THIS WOULD HAVE EASILY CAUSED AN ACCIDENT IF THERE WAS ANY TRAFFIC ON THE ROAD. RESEARCH ON THIS ISSUE SHOWED THAT THIS IS AN ISSUE THAT MANY PEOPLE HAVE HAD AND THAT HYUNDAI IS AWARE OF; THEY HAVE REVISED THE SUN VISOR TO FIX THE ISSUE AND HAVE RECALLED IT IN THE SONATA, BUT WHEN I CALLED HYUNDAI TO DISCUSS THIS ISSUE ON NOVEMBER 4TH, THEY DENIED THAT THEIR WAS ANY ISSUE WHATSOEVER WITH THE ELANTRA SUN VISOR. BELOW ARE SOME LINKS TO FORUMS DISCUSSING THIS ISSUE.  HTTP://WWW.ARFC.ORG/COMPLAINTS/2007/HYUNDAI/ELANTRA/VISIBILITY/PROBLEM.ASPX  HTTP://WWW.AUTOPARTSCHEAPER.COM/2007-2010-HYUNDAI-ELANTRA-SUN-VISOR-GENUINE-NEW-UP-P/85210-2H161-4W.HTM  HTTP://WWW.CARGURUS.COM/CARS/DISCUSSION-T6382_DS464176  HTTP://WWW.CITY-DATA.COM/FORUM/AUTOMOTIVE/1000616-REPLACEMENT-SUN-VISOR-200-O.HTML.  *TR",
        "vin": "KMHDU46D77U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/22/2013",
        "dateOfIncident": "10/15/2013",
        "fire": true,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10548924,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI ELANTRA. THE CONTACT STATED THAT THE VEHICLE BECAME ENGULFED IN FLAMES. THE FIRE DEPARTMENT WAS CALLED TO EXTINGUISH THE FIRE. A FIRE REPORT WAS NOT FILED HOWEVER, THE FIRE DEPARTMENT DID CONCLUDE THAT THE FIRE ORIGINATED FROM ELECTRICAL WIRES AND CABLES. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC BUT HAD NOT BEEN INSPECTED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FIRE. THE APPROXIMATE FAILURE MILEAGE WAS 81,000.",
        "vin": "KMHDU46D77U"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/21/2013",
        "dateOfIncident": "10/17/2013",
        "fire": true,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10548829,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE CAUGHT FIRE AFTER SITTING OFF FOR 5 HOURS. FIRE DEPARTMENT DETERMINED THAT FIRE ORIGINATED IN ENGINE COMPARTMENT. NO INDICATION OF ARSON. PROBABLE CAUSE OF FIRE ELECTRICAL WITHIN ENGINE COMPARTMENT. VEHICLE WAS IN EXCELLENT CONDITION, NEVER HAD ANY PROBLEMS AND WAS NEVER IN AN ACCIDENT. NO RECALLS ISSUED FOR ELECTRICAL ISSUES IN ENGINE COMPARTMENT. VEHICLE WAS PURCHASED NEW. NO PREVIOUS OWNER.  *TR",
        "vin": "KMHDU46D37U"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/16/2013",
        "dateOfIncident": "10/09/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10548113,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS TURNING ONTO A MAIN ROAD IN MY TOWN MY VEHICLE STALLED OUT. I WAS NOT PRESSING ON THE BRAKES OR THE GAS, JUST COASTING INTO THE TURN. LIGHTS CAME ON MY DASHBOARD AND I LOST POWER COMPLETELY. THIS IS NOT THE FIRST TIME IT HAPPENED, BUT THE THIS WAS THE SCARIEST PLACE IT OCCURRED AT. I CALLED HYUNDAI AND THEY REFERRED ME TO MY LOCAL DEALER, BUT I'M NOT OPTIMISTIC ABOUT THE RESULTS. DEFINITELY CAME CLOSE TO CAUSING AN ACCIDENT. I DID HAVE MY PREGNANT FRIEND IN THE CAR. WE WERE THE ONLY PASSENGERS.  *TR",
        "vin": "KMHDU46D17U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/09/2013",
        "dateOfIncident": "06/25/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10547392,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI ELANTRA. THE CONTACT STATED THAT WHILE ATTEMPTING TO MAKE A TURN, THE STEERING FAILED TO OPERATE AS THE STEERING WHEEL HAD TO BE FORCED IN ORDER TO MANEUVER THE VEHICLE WITHOUT WARNING. THE CONTACT ALSO MENTIONED THAT THE PROBLEM RECURRED ON EVERY TURN. THE VEHICLE WAS TAKEN TO A DEALER AND THE MECHANIC STATED THAT THE PROBLEM WAS UNKNOWN. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED. THE APPROXIMATE FAILURE AND CURRENT MILEAGE WAS 17,709.",
        "vin": "KMHDU46D07U"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/03/2013",
        "dateOfIncident": "08/01/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10546644,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SUN VISOR ON THE DRIVER'S SIDE BROKE SO THAT IT WON'T HOLD THE VISOR IN PLACE.  IF I FORCE THE BROKEN ARM FURTHER INTO THE SOCKET, IT STAYS UP FOR A WHILE, BUT DROPS DOWN OCCASIONALLY.  THIS IS VERY DANGEROUS IF IT HAPPENS WHILE DRIVING, BUT THE DEALER SAID IT WOULD COST $200 TO FIX.  THE ARM BROKE WITH NORMAL USE ONLY, THERE WAS NO INCIDENT THAT CAUSED THE BREAKAGE.  *TR",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/23/2013",
        "dateOfIncident": "08/19/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10544958,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SUNVISOR ON THE DRIVER'S SIDE BROKE OFF, AND THEN 1 WEEK LATER THE VISOR ON THE PASSENGER SIDE BROKE OFF AS WELL.  THE PASSENGER'S VISOR BARELY GETS USED AND YET IT BROKE AT ALMOST THE SAME TIME AS THE DRIVERS SIDE.   AFTER DOING RESEARCH, IT WAS DISCOVERED THAT THE PART WAS DEFECTIVE AND WAS REDESIGNED BY HYUNDAI BUT IT HAS NOT BEEN OFFICIALLY RECALLED DESPITE POSING A SAFETY/VISIBILITY ISSUE.",
        "vin": "KMHDU46D57U"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ELECTRICAL SYSTEM,EXTERIOR LIGHTING,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/04/2013",
        "dateOfIncident": "08/21/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10541745,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2007 HYUNDAI ELANTRA WAS SUPPOSEDLY PREVIOUSLY A PART OF HYUNDAI RECALL NUMBER 092 FOR BRAKE LIGHT SWITCH FAILURE. ACCORDING TO HYUNDAI CUSTOMER SERVICE THIS PROBLEM WAS REPAIRED ON MARCH 09, 2010.  I UNDERSTAND NOW THERE IS A NEW RECALL OUT THERE FOR THE SAME ISSUE. I DID NOT RECEIVE ANY NOTIFICATION OF THIS RECALL THAT WAS ISSUED IN APRIL OF 2013. SO I AM ASSUMING THAT ACCORDING TO HYUNDAI MY VEHICLE IS NOT A PART OF THIS RECALL. THIS WILL BE VERIFIED WITH ANOTHER PHONE CALL TO HYUNDAI CUSTOMER SERVICE.. MY BRAKE LIGHT SWITCH HAS FAILED AGAIN AND I AM WITHOUT BRAKE LIGHTS.  I FIND IT HARD TO BELIEVE THAT SOMETHING AS CRITICAL AND SAFETY ORIENTED AS A SWITCH THAT CONTROLS THE BRAKE LIGHT FUNCTION OF YOUR VEHICLE COULD FAIL TWICE WITHIN A 6 YEAR PERIOD. UNLESS BOTH PARTS ARE DEFECTIVE. IN FACT IN MY PAST OWNERSHIP OF MANY VEHICLES AND ALSO OF THE VEHICLES OF FRIENDS AND FAMILY MEMBERS I HAVE NEVER HEARD OF THIS SWITCH FAILING ONCE LET ALONE TWICE!  HYUNDAI IS TELLING ME THAT SINCE THE RECALL WAS ALREADY PERFORMED ON THIS CAR IN 2010 (BEFORE I PURCHASED THE CAR) THAT THEY ARE NOT LIABLE FOR THIS REPAIR OR RECALL. THE CAMPAIGN ID# FOR THE LATEST RECALL IS 13V113000. IT WAS ISSUED BY HYUNDAI-KIA AMERICA TECHNICAL CENTER INC. HOW AM I TO BE SURE THAT WHEN THE CAR WAS REPAIRED (IF IT WAS REPAIRED PROPERLY OR AT ALL) IN 2010 IT WAS NOT REPAIRED WITH THE PART FROM THE CURRENT RECALL? THE VEHICLE HAS YET TO BE REPAIRED AND I WILL BE IN CONTACT WITH HYUNDAI CUSTOMER SERVICE ONCE AGAIN.    IN RESEARCHING THIS ISSUE I ALSO LEARNED OF PROBLEMS WITH THE AIR BAG WARNING LIGHT ILLUMINATING ON THE DASHBOARD. ALSO WITH THE SUN VISORS CRACKING AT THEIR PLASTIC CONNECTING POINT. CAUSING THE SUN VISOR TO FALL OFF AND THE WIRING TO BE EXPOSED. I HAVE ALSO RECENTLY EXPERIENCED BOTH OF THESE ISSUES. *JB",
        "vin": "KMHDU46D57U"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "08/30/2013",
        "dateOfIncident": "05/15/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10538146,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER AND DRIVER SUN VISORS NO LONGER LOCK INTO RECESSES IN VEHICLE CEILING. THEY NOW DROP DOWN AND MUST BE SECURED WITH VELCRO ON THE CLOTH AND SUPER GLUE AT THE HINGE. STARTED MAKING A POPPING SOUND INITIALLY AND EVENTUALLY FAILED.",
        "vin": "KMHDU46D47U"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "08/07/2013",
        "dateOfIncident": "06/15/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10534152,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI ELANTRA. THE CONTACT STATED THAT WHILE DRIVING 40 MPH, THE DRIVER'S SIDE SUN VISOR FAILED TO REMAIN SECURE AND WOULD FALL SEVERAL TIMES. THE FAILURE RECURRED ON SEVERAL OCCASIONS. THE VEHICLE WAS NOT REPAIRED AND THE MANUFACTURER WAS NOT NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 81,000.",
        "vin": "KMHDU46D77U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/27/2013",
        "dateOfIncident": "01/02/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10532123,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MY HYUNDAI ELANTRA 2007 STALLS RANDOMLY SOMETIMES UPON STARTING THE CAR OR AT TRAFFIC STOP. THE EPS LIGHT COMES ON AND I LOSE CONTROL OF THE VEHICLE. WHEN I TURN OFF THE CAR AND START IT AGAIN, IT WORKS NORMALLY. IT USED TO HAPPEN IN PARKING LOTS WHILE STARTING EARLIER. LAST WEEK IT STALLED IN THE MIDDLE OF A TRAFFIC STOP. I HAD TO TURN OFF AND START THE CAR AGAIN IN THE MIDDLE OF THE ROAD TO MOVE.    I HAD TAKEN MY CAR TO THE DEALER WITH THIS PROBLEM LAST YEAR. THE CAR WAS STILL UNDER 5 YEAR WARRANTY AT THE TIME. THE DEALER TOLD THAT THERE IS NO PROBLEM WITH THE CAR AFTER INVESTIGATING AND THAT THEY WERE NOT ABLE TO RECREATE THE ISSUE.    I AM EXTREMELY CONCERNED AFTER READING OTHER SIMILAR COMPLAINTS ON NHTSA WEBSITE AS WELL AS ON THE INTERNET ON THE SAME ISSUE WHERE CAR STALLS AFTER EPS LIGHT COMES ON. I ALSO SAW THAT THERE WAS A RECALL FOR 2008 ELANTRAS FOR STALLING WHERE FUEL PUMP WAS REPLACED. MY CAR'S MODEL YEAR IS 2007.    I AM SCARED THAT THIS COULD ALSO HAPPEN IN THE MIDDLE OF A HIGHWAY WHILE DRIVING WHICH IS EXTREMELY DANGEROUS.  *TR",
        "vin": "KMHDU46D87U"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "07/23/2013",
        "dateOfIncident": "07/22/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10526402,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVERS SIDE SUN VISOR PLASTIC MOUNTING BRACKET UNEXPECTEDLY FAILED ALLOWING THE SUN VISOR TO FALL DOWN OBSCURING TOTALLY MY VISION OF THE ROAD IN FRONT OF ME.  *TR",
        "vin": "KMHDU46D97U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/21/2013",
        "dateOfIncident": "07/20/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10525956,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "VENT FAN (WHICH IS REQUIRED FOR PROPER FUNCTIONING OF THE DEFROSTER DURING WINTER) STOPPED WORKING.  CONSUMERS WILL BE OUT OF POCKET TO FIX THIS OR WILL BE LEFT FORCING TO DRIVE IN UNSAFE CONDITIONS WITH FOGGY WINDOWS.  IF THERE IS A PATTERN HERE, PLEASE HAVE HYUNDAI ISSUE A RECALL.  THANKS.  *TR",
        "vin": "KMHDU46D27U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/28/2013",
        "dateOfIncident": "06/26/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10522218,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI ELANTRA. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 40 MPH, THE STEERING WHEEL SEIZED AND CAUSED THE VEHICLE TO INDEPENDENTLY VEER INTO THE RIGHT LANE. IN ADDITION, THE EPS WARNING INDICATOR WAS ILLUMINATED ON THE INSTRUMENT PANEL. THE VEHICLE WAS MANEUVERED TO THE SIDE OF THE ROADWAY AND TOWED FOR DIAGNOSIS. THE CONTACT WAS AWAITING DIAGNOSIS OF THE FAILURE. THE MANUFACTURER WAS NOT NOTIFIED OF THE DEFECT. THE APPROXIMATE FAILURE MILEAGE WAS 61,000.",
        "vin": "KMHDU46D99U"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "06/27/2013",
        "dateOfIncident": "06/24/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10522035,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI ELANTRA. THE CONTACT STATED THAT THE AIR BAG WARNING LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE DRIVER SIDE SEAT BELT SENSOR NEEDED TO BE REPLACED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE AND CURRENT MILEAGE WAS 6,341.  *TR",
        "vin": "KMHDU46D07U"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "06/24/2013",
        "dateOfIncident": "06/05/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10522360,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM REPORTING A SERIOUS MALFUNCTION OF THE TRANSMISSION SYSTEM IN THIS VEHICLE ON JUNE 05, 2013, WHEN MY WIFE WAS DRIVING THE VEHICLE.  SHE WAS PULLING INTO A PARKING SPACE EARLY THAT MORNING AS THE VEHICLE WAS ENGAGED IN \"DRIVE\" MODE, WITH HER FOOT ON THE BRAKE, WHEN SHE DISCOVERED THAT THE GEAR SHIFT WAS \"FROZEN\" AND REFUSED TO MOVE TO \"PARK\" TO ENABLE HER TO SHUT OFF THE MOTOR AND EXIT THE VEHICLE.  SHE WAS ALSO UNABLE TO MOVE THE GEAR SHIFT TO \"REVERSE\" OR TO ANY OTHER GEAR!  SHE TURNED THE KEY ONE NOTCH TO TRY TO FIND A WAY TO RELEASE THE TRANSMISSION; THE CAR \"JUMPED\" THE PARKING CURB AND COLLIDED ABOUT 4 FEET FORWARD WITH A TREE, HEAVILY DAMAGING THE FRONT END OF THE VEHICLE.  FORTUNATELY, THE AIR BAG DID NOT DEPLOY, AND MY WIFE WAS NOT INJURED; HOWEVER, THE DAMAGE TO THE VEHICLE WAS EXTENSIVE!  THIS WAS A SERIOUS MECHANICAL MALFUNCTION, AND WE CONTINUE TO BE CONCERNED FOR THE SAFE OPERATION OF THE VEHICLE.  WE HAD NO NEGATIVE EXPERIENCE WITH THE VEHICLE AND ITS OPERATION PRIOR TO THIS INCIDENT AND NOTHING SINCE THE INCIDENT.",
        "vin": "KMHDU46D57U"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "06/13/2013",
        "dateOfIncident": "06/01/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10519750,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "JUST TO CLARIFY THIS IS THE LIMITED TRIM PACKAGE. THE PLASTIC PIECE THAT HOLDS THE VISOR BROKE WHILE NOT EVEN USING IT. IT NOW HANGS AND FLOPS IN MY LINE OF VISION WHILE TRYING TO DRIVE. I HAVE HAD TO IMPROVISE TO KEEP IT FLUSH WITH THE HEADLINER AND TO KEEP IT FROM FALLING DOWN. OBVIOUSLY IT CAN'T BE USED TO SHIELD THE SUN WHEN NEEDED EITHER. ONLY THE DRIVER'S SIDE HAS BROKEN, THUS FAR.  *TR",
        "vin": "KMHDU46D47U"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "06/08/2013",
        "dateOfIncident": "06/15/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10515813,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "SUN VISOR FELL AND HIT ME IN THE EYE WHILE I WAS DRIVING ON THE FREEWAY.  I SEARCHED THE INTERNET FORUMS AND FOUND THIS IS A COMMON FAILURE ON HYUNDAI ELANTRA'S.  THE VISOR NO LONGER STAYS UP.  THIS PART SHOULD BE RECALLED BEFORE AN INJURY IS CAUSED BY THIS FAILURE.  *TR",
        "vin": "KMHDU46D37U"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "06/06/2013",
        "dateOfIncident": "08/11/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10515479,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH SUN VISORS BROKE AT ABOUT THE SAME TIME.  THERE WAS A POPING SOUND, THEN THE VISORS WOULD JUST HANG DOWN OR FLOP DOWN WHICH OBSTRUCTS THE DRIVER'S VIEW.  THEY WON'T STAY UP AND WHEN THEY FALL IT IS VERY DANGEROUS.  I TOOK THEM OFF AND SAW THAT A SMALL PLASTIC PART WAS BROKEN AT TEH SAME PLACE ON BOTH OF THEM.  IT IS A DESIGN FLAW AND SHOULD BE A RECALL FOR PARTS, AT LEAST.  *TR",
        "vin": ""
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "04/20/2013",
        "dateOfIncident": "01/01/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10508907,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I, TOO, HAVE HAD MY PASSENGER SIDE VISOR BREAK AT THE HINGE.  WE HAVE TRIED UNSUCCESSFULLY GLUEING IT AND HAVE FINALLY RESORTED TO USING VELCRO TO SECURE IT IN THE UP POSITION.  *TR",
        "vin": "KMHDU46D87U"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,SERVICE BRAKES,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "04/20/2013",
        "dateOfIncident": "07/17/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10508911,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "LAST JAN WE HAD OUR PASSENGER SIDE VISOR FALL WITHOUT ANY MANIPULATION AND AFTER TAKING THE VEHICLE TO HYUNDAI THEY TOLD US THAT THE SCREWS WHICH ARE HOLDING THEM TOGETHER ARE RUSTED. IN JULY 2012 THE DRIVER SIDE VISOR ALSO FELL OFF AND WE TOOK IT TO HYUNDAI AND THEY QUOTED US $380 JUST TO HAVE IT FIXED. IT WAS HYUNDAI WHO PLACED UNUSABLE AND RUSTED PARTS IN VEHICLES AND LATER STATED THAT WE ARE OUT OF WARRANTY AND WOULD NEED TO FURNISH THE PAYMENT FOR SOMETHING THAT WE ARE NOT AT FAULT FOR.   ALSO ABS LIGHT COMES UP AND EVEN AFTER CHANGING ALL THE BRAKE PADS AND ROTORS, DOES NOT RESOLVE.  IT IS THE MANUFACTURING DEFECT WHICH MADE THE VISORS COME OFF AND HANG BY THE WIRES SO WHY SHOULD WE BE RESPONSIBLE TO PAY FOR THE MANUFACTURING DEFECTS?? PLEASE INVESTIGATE.  *TR",
        "vin": "KMHDU46D57U"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "04/17/2013",
        "dateOfIncident": "04/14/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10508496,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "VIVA 2",
                "productYear": "9999",
                "size": "P195/65R15",
                "type": "Tire"
            }
        ],
        "summary": "GOOD YEAR TIRES P195/60R15.. VIVA 2 (WAL MART PURCHASE)  TIRES WEAR ON INSIDE OF AROUND  TIRES.. TIRES ARE UNABLE TO BE BALANCED DUE TO TREAD WEAR VERY UNEVEN.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/04/2013",
        "dateOfIncident": "04/01/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10507048,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "DOZENS OF OCCURRENCES 2007   SHORTLY AFTER WARRANTY EXPIRED 2009 +, 6000 MILES VEHICLE STARTED DOWN SHIFTING TO LOW GEAR AT SPEEDS FROM 30 TO 70    NEVER CONSISTENT,, OUT OF BLUE, JUST LIKE STOMPING ON BRAKES HYUNDAI LEWISVILLE TX, TEST DROVE REPORTED NO PROBLEM WANTED  SEVERAL HUNDRED TO DIAGNOSE SAME OR SEVERAL THOUSAND TO REPLACE, TOLD TO KISS OFF. TOTAL BS, 1 2010 VEHICLE FINALLY  GOT CONSISTENT AND WAS PARKED AND LEFT SITTING AS EXTREMELY DANGEROUS TO OPERATE AND PAID OFF ON  11/ 2012 STILL PARKED    READ ON NET CAUSED BY SHORT IN ELECTRICAL SYSTEM  TO TRANS MISSION SHIFTER MIGHT ADD ON ROAD ITS SHOCKING ON GRAVEL ROAD CAUSES LOSS OF CONTROL AND   MIGHT END UP IN DITCH ( SEVERAL TIMES, WRONG SIDE OR SIDEWAYS SPIN OUT   FURTHER WAS REPORTED YEARS BACK WITH NO RESULTS TO DATE.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/02/2013",
        "dateOfIncident": "05/25/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10505428,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE A 2007 HYUNDAI ELANTRA THAT IS CONTINUOUSLY BURNING UP HEADLIGHT BULBS. THERE ARE NUMEROUS COMPLAINTS IN REGARDS TO THIS, BUT HYUNDAI HAS YET TO RECALL ANY VEHICLES. MY HUSBAND IS REPLACING AT LEAST 1 BULB MONTH. PLEASE INVESTIGATE THIS. IT IS VERY DANGEROUS WHEN YOU'RE DRIVING AT NIGHT AND THE HEADLIGHTS GO OUT. THERE IS NO MOISTURE OF ANY KIND IN THE HEADLIGHT NOR HAS THERE EVEN BEEN.  *TR",
        "vin": "KMHDU46D97U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/27/2013",
        "dateOfIncident": "12/07/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10504731,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "EPS LIGHT CAME ON THE DASH AND I IMMEDIATELY LOST ALL POWER STEERING.  THE VEHICLES STEERING BECAME SO STIFF IT WAS EXTREMELY DIFFICULT TO STEER THE CAR.  SOMEONE WITH LESS STRENGTH LIKE A YOUNG LADY OR OLDER PERSON WOULD BE IN GRAVE DANGER OF CRASHING, ANYONE FOR THAT MATTER - I HAVE FOUND OUT THAT THE SYSTEMS IS TOTALLY INTEGRATED. THERE IS A MODULE THAT HAS FAILED BUT CAN NOT BE REPLACED ON IT'S OWN. THE ENTIRE STEERING COLUMN HAS TO BE REPLACED FOR ABOUT $2500.00.     THE LIGHT WENT OFF AFTER I SHUT THE CAR OFF AND STAYED OFF FOR A FOR SEVERAL WEEKS THEN WITHOUT WARNING CAME BACK ON AGAIN AND THE POWER STEERING WAS GONE. THIS CONTINUED TO HAPPEN SEVERAL MORE TIMES UNTIL THE LIGHT REMAINED ON. WHEN THIS HAPPENS IT IS VERY DANGEROUS. IT CAN HAPPEN ANYTIME AT ANY SPEED. I CONTACTED HYUNDAI TO NO SATISFACTION AND NOW MUST SPEND $2500.00 TO  REPLACE THE ENTIRE STEERING COLUMN WITHOUT KNOWING HOW LONG IT WILL LAST AND IF I WILL CRASH THE NEXT TIME IT HAPPENS. I WOULD BE SHOCKED IF THIS HAS NOT CAUSED ANY ACCIDENTS.    IF YOUR GOING TO USE AN INTEGRATED BRAKE SYSTEM IT SHOULD BE RELIABLE AND SAFE !!  *TR",
        "vin": "KMHDU46D37U"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "03/25/2013",
        "dateOfIncident": "10/25/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10504468,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI ELANTRA. THE CONTACT STATED THAT BOTH THE DRIVER AND PASSENGER SIDE SUN VISORS BECAME FRACTURED. THE MANUFACTURER WAS NOTIFIED, WHO STATED THAT THERE WAS NO RECALL FOR THE FAILURE AND OFFERED NO OTHER ASSISTANCE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 60,000.",
        "vin": "KMHDU46D97U"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "03/20/2013",
        "dateOfIncident": "07/07/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10503844,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2007 HYUNDAI ELANTRA NOW HAS TWO BROKEN SUN-VISORS. THEY NO LONGER RELIABLY STAY IN THE UPRIGHT POSITION, AND TEND TO FALL DOWN AT RANDOM TIMES, AND BLOCK MY VIEW OF THE ROAD, CREATING A SAFETY HAZARD. I HAVE HAD TO GLUE AND TAPE THEM FOR NOW, AS HYUNDAI MOTORS REFUSES TO ADDRESS THIS MATTER. ON SEARCHING THE INTERNET, I LOCATED HUNDREDS, IF NOT THOUSANDS OF SIMILAR REPORTINGS. SEEMS THERE IS AN INHERIT DESIGN FLAW, ALLOWING THE CHEAP PLASTIC TO BREAK, AS IT IS UNDER TENSION AT ALL TIMES. HYUNDAI HAS APPARENTLY RECENTLY REDESIGNED THIS PART. THE LOCAL DEALERSHIP LET ME KNOW THAT CORPORATE MUST APPROVE ANY FREE REPLACEMENT, AND CORPORATE SENT ME AN EMAIL TELLING ME TO VISIT MY DEALER, AND THUS THE TWO ENTITIES REFUSE TO TAKE ACTION. A REPLACEMENT VISOR COSTS ABOUT 160 DOLLARS PLUS INSTALLATION, NOT INEXPENSIVE BY ANY MEANS, AND I NEED TWO. I EVEN OFFERED TO REPLACE THEM ON MY OWN, IF THEY GIVE ME THE REDESIGNED PARTS. THEY BLEW ME OFF, AND SAID THEY STAND BY THEIR EARLIER RESPONSE. AND SO HYUNDAI HAS DECIDED NOT TO RECALL AND REPLACE THIS DEFECTIVE PART, AND THUS HELP PREVENT A SERIOUS ACCIDENT WHEN THE DRIVER IS UNABLE TO SEE THE ROAD ON THE SUDDEN DROPPING OF THE SUN-VISOR. MY WARNING SHOULD BE TAKEN SERIOUSLY, THIS IS A SAFETY ISSUE, SO BE WARY. AND KEEP IN MIND, HYUNDAI APPARENTLY FEELS THIS MATTER IS NOT COVERED IN ANYWAY, THUS FORCING THE CONSUMER TO PURCHASE A REPLACEMENT PART AFTER THE FACT. I WOULD LIKE TO SEE YOU GET INVOLVED AND FORCE HYUNDAI MOTORS TO MAKE THE NEEDED REPAIR AT NO CHARGE TO US OWNERS.  THANK YOU  *TR",
        "vin": "KMHDU46D57U"
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/14/2013",
        "dateOfIncident": "02/01/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10498157,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR SUSPENSION CROSS MEMBER ROTTED WHERE THE CONTROL ARM ATTACHES TO IT AND BROKE FREE. THE CONTROL ARM THEN FELL DOWN AND THE ENTIRE REAR TIRE AND SUSPENSION WAS DRAGGED UNDERNEATH THE REAR END OF THE CAR. THE METAL THAT THE CONTROL ARM ATTACHES TO IS VERY THIN AND THE ONLY THING UNDER THE CAR THAT IS NOT UNDERCOATED IS THAT SUSPENSION CROSS MEMBER. IF THIS PART BROKE FREE AT 55MPH I MAY NOT HAVE SURVIVED THE CRASH. IT BROKE FREE AS I TURNED INTO MY DRIVEWAY, MORE THAN LIKELY FROM THE TWIST OF THE TURN.  *TR",
        "vin": "KMHDU46D47U"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/16/2013",
        "dateOfIncident": "01/14/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10493175,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI ELANTRA. THE CONTACT STATED THAT WHILE ATTEMPTING TO MERGE INTO TRAFFIC, THE VEHICLE ACCELERATED INDEPENDENTLY WITHOUT WARNING. THE CONTACT MENTIONED THAT THE VEHICLE ACCELERATED TO 80 MPH. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC HOWEVER, THE TECHNICIAN WAS UNABLE TO DIAGNOSE THE FAILURE. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE VIN WAS NOT AVAILABLE. THE FAILURE AND CURRENT MILEAGE WAS 104,000.",
        "vin": ""
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "11/21/2012",
        "dateOfIncident": "05/09/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10485389,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI ELANTRA. THE CONTACT STATED THAT BOTH THE DRIVER AND PASSENGER SIDE SUN VISORS WOULD NOT REMAIN SECURE IN THE UPWARD POSITION. THE VEHICLE HAD NOT BEEN REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE DEFECT. THE APPROXIMATE FAILURE MILEAGE WAS 97,000.",
        "vin": "KMHDU46D57U"
    },
    {
        "components": "EXTERIOR LIGHTING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/19/2012",
        "dateOfIncident": "11/18/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10485164,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "A FRIEND DRIVING BEHIND ME NOTICED MY BRAKE LIGHTS NOT WORKING WHEN APPROACHING A RED LIGHT.  WHEN WE PARKED WE TESTED THEM AND NONE OF THE REAR BRAKE LIGHTS WORK.  I DO NOT KNOW HOW LONG MY BRAKE LIGHTS HAVE NOT BEEN WORKING BUT IT IS A MAJOR SAFETY ISSUE CONSIDERING I DRIVE IN RUSH HOUR TRAFFIC IN A CITY DAILY.  THERE IS CURRENTLY A RECALL (CAMPAIGN 09V122000) THAT I WOULD HAVE EXPECTED TO INCLUDE THE 2007 HYUNDAI ELANTRA THAT I DRIVE, BUT IT APPEARS THAT MY PARTICULAR VIN IS NOT INCLUDED (YET).  I AM ALSO BOTHERED THAT I HAD TO DO ALL THIS RESEARCH.  WHEN THE CAR DEALERSHIP AND THE HYUNDAI CUSTOMER SERVICE ENTERED MY VIN, THIS RECALL DOESN'T EVEN SHOW UP AS A POSSIBLE INCLUSION.  I UNDERSTAND MY VEHICLE WAS NOT PART OF THE RECALL BUT CONSIDERING OTHER VEHICLES OF MY MAKE, MODEL, AND YEAR ARE SUSCEPTIBLE TO THIS PARTICULAR RECALL, I WOULD HAVE HOPED THAT IT WOULD RED FLAG OTHER VEHICLES THAT COULD BE SUSCEPTIBLE.  OR AT THE VERY LEAST, WHEN A RECALL DOES OCCUR, OTHER OWNERS OF SIMILAR VEHICLES SHOULD BE INFORMED IN AN EFFORT FOR THOSE OWNERS TO WATCH OUT FOR THE SAFETY ISSUES THAT MAY ARISE.  *TR",
        "vin": "KMHDU46DX7U"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "11/03/2012",
        "dateOfIncident": "10/31/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10483237,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PARKED IN MY DRIVEWAY, MY WIFE TRIED TO LOWER AND MOVE SIDEWAYS THE PASSENGER SIDE SUN VISOR, MADE A LOUD \"CRACK\" NOISE AND IT BROKE OFF THE HINGE, LEAVING THE ELECTRICAL WIRES EXPOSED AND THAT'S THE ONLY THING KEEPING IT UP. I'M AFRAID IT WILL CAUSE A SHORT CIRCUIT IF WIRES BREAK AND TOUCH THE METAL EDGE.  NOW THE VISOR WILL NOT STAY UP AND SHE'S HIT THE SIDE OF HER FACE TWICE WHILE GETTING INTO THE CAR. *TR",
        "vin": "KMHDU46D97U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/16/2012",
        "dateOfIncident": "10/05/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10480746,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKE LIGHT FUSE WAS BURNING OUT REPEATEDLY. THE PROBLEM WAS DETERMINED TO BE COMING FROM THE 1157 BULB SOCKET. THE SOCKET IS PART OF A 3 BULB PIGTAIL THAT CONNECTS TO WIRING HARNESS.  I WAS TOLD BY TWO DEALERS AND HYUNDAI AMERICA THAT A $700 WIRING HARNESS NEEDED TO BE PURCHASED.  APPARENTLY HYUNDAI DOES NOT MARKET THE PIGTAIL SEPARATELY.  I FIND THIS VERY IRRESPONSIBLE. YOU CAN NOT SAFELY OR LEGALLY DRIVE WITHOUT BRAKE OR BLINKER LIGHTS. THE 1157, 1156 AND 194 BULBS HAVE BEEN IN USE FOR HALF A CENTURY. THE PIGTAIL OR A REPLACEMENT SOCKET SHOULD BE AVAILABLE WITHIN 24 HOURS AND AT A REASONABLE RATE. *TR",
        "vin": ""
    },
    {
        "components": "STEERING,POWER TRAIN,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/04/2012",
        "dateOfIncident": "02/19/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10473704,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PULLING INTO PARKING SPACE AT SHOPPING CENTER COMING TO STOP THEN CAR SUDDENLY LURCHED OVER A PARKING STOP POST AND CURB GOING INTO A BUILDING I MANAGED TO GET BRAKES TO STOP VEHICLE BEFORE HITTING THE BUILDING .. I DID NOT KNOW WHAT HAPPENED.  WHILE READING PROBLEMS ABOUT THE 2007 MODEL I FOUND ANOTHER PERSON WITH THE SAME PROBLEM.      I WAS LOOKING AT PROBLEM DUE TO A POPPING SOUND WHEN TURNING THE VEHICLE.  THERE SEEM TO BE MANY OF THOSE ALREADY REPORTED.  WE TOOK TO THE DEALER AND THE VEHICLE WAS OUT OF WARRANTY AT 60,000 MILES AND WE HAVE 68,000 NOW SO THEY WANTED $65 JUST TO LOOK AT THE VEHICLE.  I HAVE TAKEN THE CAR TO ANOTHER DEALERSHIP.    WHILE 2007 YEAR MODEL HAS NO RECALL IT SOUNDS LIKE IT SHOULD FOR THIS PROBLEM.  *TR",
        "vin": "KMHDU46D570"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "08/23/2012",
        "dateOfIncident": "06/01/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10472099,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVERS SIDE SUN VISOR HAS FALLEN DOWN SEVERAL TIMES AND HAS ALMOST CAUSED AN ACCIDENT. THE LITTLE BLACK WIRE THAT POWERS THE LIGHT IS THE ONLY THING THAT KEEPS IT FROM FALLING INTO MY LAP. I ALMOST HIT A CAR ONE TIME WHEN IT FELL AND IT BLOCKED MY VIEW.  I WAS IN THE MIDDLE OF MAKING A LEFT TURN.  SOMEONE NEEDS TO ADDRESS THIS AND MAKE IT SAFER TO USE.  *TR",
        "vin": "KMHDU46DX7U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/14/2012",
        "dateOfIncident": "03/11/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10470618,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2007 HYUNDAI ELANTRA. THE CONTACT STATED THAT A KNOCKING SOUND WAS COMING FROM THE STEERING COLUMN. THE CONTACT STATED THAT THE VEHICLE DID NOT HAVE A PROBLEM STEERING OR TURNING. THE CONTACT TOOK THE VEHICLE TO THE DEALER AND WAS TOLD THE STEERING BRACKET HAD TO BE REPLACED. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 22,000 AND THE CURRENT MILEAGE WAS 52,000.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/13/2012",
        "dateOfIncident": "08/10/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10470489,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI ELANTRA . THE CONTACT STATED THAT WHILE DRIVING 30 MPH AND MAKING A SLIGHT TURN, THE STEERING WHEEL TURNED IN THE OPPOSITE DIRECTION. THE CONTACT DEPRESSED THE BRAKE PEDAL HOWEVER THE VEHICLE WOULD NOT STOP. HE THEN ENGAGED THE EMERGENCY BRAKE AND THE VEHICLE CAME TO A STOP. THE VEHICLE WAS TAKEN TO THE DEALER WHO STATED THAT THEY HAD TO REPLACE THE POWER STEERING SYSTEM. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE AND THE CURRENT MILEAGE WAS 80,000.   ..UPDATED 09-19-12 *BF    THE CONSUMER STATED THE VEHICLE MADE 3 TO 4 360 DEGREE SPINS BEFORE COMING TO A STOP. UPDATED 09/21/2012 *JS",
        "vin": "KMHDU46D47U"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/20/2012",
        "dateOfIncident": "11/02/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10466829,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI ELANTRA. THE CONTACT STATED THAT BOTH OF THE SUN VISORSFAILED, CAUSING THE DRIVER'S VISIBILITY OF THE ROADWAY TO BE BLOCKED. THE VEHICLE WAS TAKEN TO THE DEALER WHO WAS UNABLE TO DETERMINE THE CAUSE OF THE FAILURE. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 68,000 AND THE CURRENT MILEAGE WAS 79,000.",
        "vin": "KMHDU46D97U"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "07/11/2012",
        "dateOfIncident": "06/23/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10465259,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THE MORNING OF JUNE 23, 2012, I WAS PARKING MY 2007 HYUNDAI ELANTRA IN A SHOPPING CENTER PARKING LOT. I PULLED INTO A PARKING SPACE AND PRESSED THE BRAKE PEDAL TO STOP, AS USUAL, AND FELT THE CAR SLOWING DOWN AT FIRST; BUT THEN, JUST AS I WAS COMING TO A COMPLETE STOP, THE ENGINE SUDDENLY GOT REALLY LOUD AND THE CAR VIOLENTLY LURCHED FORWARD VERY FAST.  IT JUMPED OVER THE PARKING STOP, THEN COLLIDED WITH A 2-FOOT HIGH CONCRETE WALL THAT WAS ONLY ABOUT 18\" OR SO PAST THE PARKING STOP (IT WAS A BARRIER SEPARATING THAT PARKING LOT FROM AN ADJACENT ONE).  LUCKILY FOR ME, THE AIR BAG DEPLOYED AND SO I ONLY HAD A FEW BRUISES.  THE CAR WAS DECLARED A TOTAL LOSS.  EVEN THOUGH IT'S TOO LATE FOR MY CAR, I REALLY WISH HYUNDAI WOULD DO SOMETHING ABOUT THIS PROBLEM BEFORE PEOPLE GET HURT.  SINCE I WAS IN A SHOPPING CENTER PARKING LOT, IF THAT CONCRETE BARRIER HAD NOT BEEN THERE TO STOP MY CAR, IT COULD HAVE ENDED UP MUCH WORSE - I COULD HAVE CRASHED INTO OTHER VEHICLES OR EVEN HIT A PEDESTRIAN.  IT REALLY SCARES ME WHEN I THINK ABOUT WHAT COULD HAVE HAPPENED.  *TR",
        "vin": "KMHDU46D17U"
    },
    {
        "components": "SUSPENSION",
        "crash": true,
        "dateComplaintFiled": "05/07/2012",
        "dateOfIncident": "04/27/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10457650,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI ELANTRA. WHILE TRAVELING 55 MPH, THE CONTACT TRAVELED OVER A SMALL ROAD BUMP AND NOTICED THAT THE REAR OF THE VEHICLE SUDDENLY LOST CONTROL CAUSING THE VEHICLE TO CRASH INTO A DITCH. NO ONE WAS INJURED DURING THE INCIDENT. THE VEHICLE WAS TOWED TO THE DEALER WHERE THE CONTACT WAS INFORMED THAT THE DRIVER SIDE INNER BOLT FLANGE NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE CURRENT AND FAILURE MILEAGES WERE 60,000.",
        "vin": "KMHDU46D17U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/13/2012",
        "dateOfIncident": "03/05/2012",
        "fire": true,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10451544,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "OWN A 2007 HYUNDAI ELANTRA SEDAN.  HAVE BEEN HAVING ISSUES WITH THE AIR BAG LIGHT STAYING ON AT ALL TIMES, FOR ABOUT THE PAST WEEK.  YESTERDAY WHEN I PARKED THE CAR, I PUT IN NEUTRAL PULLED UP THE EMERGENCY BRAKE AND CAR FILLED WITH SMOKE HAD SMALL FIRE, FIRE DEPT WAS CALLED OUT TO MY HOUSE NO INJURIES.  I WAS SURE TO GET OUT OF CAR QUICKLY IN CASE TURNED OUT TO BE HUGE FIRE.  NOT SURE WHAT HAPPENED GETTING LOOKED AT TOMORROW, NEED IT TOWED CAR FILLS UP WITH SMOKE AND YOU CAN PEEK IN AT THE WIRING AND WAS A SMALL FLAME THIS TIME.  IF I TURN THE KEY ON  THIS HAPPENS.  UNOPERATABLE, AS OF NOW.  THIS REALLY NEEDS TO BE INVESTIGATED AS PEOPLE COULD BE GETTING HURT.  *TR",
        "vin": "KMHDU46D67U"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/05/2012",
        "dateOfIncident": "01/13/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10450318,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI ELANTRA. THE CONTACT STATED THAT A VEHICLE CRASHED INTO THE DRIVER SIDE OF THE VEHICLE WHILE ATTEMPTING A LEFT TURN.  THE DRIVER AND SIDE CURTAIN AIR BAGS DID NOT DEPLOY. THE CONTACT RECEIVED INJURIES TO THE LOWER BACK.  THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS DESTROYED. THE FAILURE AND THE CURRENT MILEAGE WAS 47,483.",
        "vin": "KMHDU46D97U"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/22/2012",
        "dateOfIncident": "02/22/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10449000,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI ELANTRA. THE CONTACT STATED THAT THE VEHICLE STOP SWITCH MALFUNCTIONED AND AS A RESULT, THE TRANSMISSION SHIFT LOCK WAS DISABLED. THE CONTACT WAS NOT ABLE TO SHIFT INTO PARK. THE VEHICLE WAS NOT TAKEN TO THE DEALER. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE WHO DID NOT OFFER ANY ASSISTANCE SINCE THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN ID NUMBER: 09V122000 (SERVICE BRAKES, HYDRAULIC:SWITCHES:BRAKE LIGHT). THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGE WAS 100,000.",
        "vin": "KMHDU46DX7U"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/23/2012",
        "dateOfIncident": "12/20/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10444847,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "AT MY 30,000 MILE MAINTENANCE WORK ($600.+), I WAS CALLED BACK TO SHOP TO SHOW ME \"VERY DANGEROUS\" CORROSION AROUND REAR AXLE/FRAME PARTS. I BOUGHT THIS CAR NEW FROM SAME DEALER AND WAS SOLD A $800. WARRANTY RUST-PROOFING APPLICATION. IT WAS CLEAR THAT WHERE NO COATING WAS APPLIED, RUST WAS THERE AND I WAS TOLD IT WOULD BE RISKY DRIVING THE CAR. THE LOW MILLAGE AND NO HISTORY OF THE CAR BEING DRIVEN IN SALT WATER CONDITIONS, I WAS AMAZED AT ITS CONDITION.(I GREW-UP IN THE NORTH RUST-BELT) I RETIRED CLOSE TO THE SOUTH OCEAN AREA BUT NEVER HAD A CAR WITH SUCH ADVANCED RUST. (SEVERAL CARS) THE DEALER REFUSED TO HONOR THE WARRANTY AND HYUNDAI'S WARRANTY DOES NOT COVER IT. I THINK POOR QUALITY OF METAL WAS USED IN THE MANUFACTURING  OF THIS VEHICLE.  IT'S OBVIOUS THE DEALER IS ALSO AT FAULT AND REFUSES TO HONOR HIS WARRANTY. I GUESS THAT IS A LEGAL PROBLEM THAT I'M STUCK WITH. THE POSSIBLE SAFETY PROBLEM COMES UNDER YOUR CONCERN FOR SUB-STANDARD MANUFACTURING.  *TR",
        "vin": "KMHDU46D37U"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/23/2012",
        "dateOfIncident": "01/17/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10444969,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS BROADSIDED WITH MAJOR DAMAGE BEGINNING AT THE FRONT DOOR CONTINUING TO THE BACK DOOR AND THE REAR QUARTER PANEL. THE PILLAR BETWEEN THE FRONT AND BACK DOOR AND THE REAR PILLAR WERE BOTH SIGNIFICANTLY BOWED.  THE SUV THAT HIT ME WAS PROBABLY GOING ABOUT 25 MPH.  NO AIR BAGS DEPLOYED.  THE VEHICLE IS EQUIPPED WITH FRONT AND SIDE CURTAIN AIRBAGS.  *TR",
        "vin": "KMHDU46DX7U"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/12/2011",
        "dateOfIncident": "11/11/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10439662,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "YET ANOTHER DOOR HANDLE HAS FALLEN OFF MY 2007 HYUNDAI ELANTRA!  THIS IS #4.  THIS VEHICLE IS ONLY 4 YRS OLD, AND YET 4 OF THE DOOR HANDLES HAVE BROKEN OFF.  THE PRIOR COMPLAINTS I HAVE FILED HAVE BEEN 10400898 AND 10280729.  I AM REALLY DISGUSTED WITH HOW HYUNDAI IS TREATING THIS.      HYUNDAI TELLS ME THAT IT HAPPENED BECAUSE OF THE COLD.  2 OF THE DOOR HANDLES FELL OFF IN WINTER MONTHS OF DECEMBER AND FEBRUARY.  2 FELL OFF IN THE SUMMER MONTHS OF JULY AND AUGUST.  WHEN I MENTIONED THIS, THEY BACKTRACKED AND BLAMED ME FOR RIPPING THEM OFF...    I AM A 150 LB, 47 YR OLD WOMAN.  I DO EXERCISE, BUT I AM NOT A GORILLA!  I'VE NEVER HAD ANY OTHER VEHICLE LOOSE A SINGLE DOOR HANDLE, LET ALONE 4 OF THEM!    I AM UPSET THAT I AM BLAMED INSTEAD OF THEM LOOKING AND RESEARCHING THE PROBLEM!  I AM NOT A CERTIFIED HYUNDAI TECHNICIAN, BUT I CAN SEE THAT EACH AND EVERY ONE OF THEM HAVE BROKEN IN THE EXACT SAME SPOT ON THE PLASTIC!  IT HAS A LITTLE PIN IT RIDES ON AND THE PLASTIC BREAKS RIGHT THERE EACH AND EVERY TIME.  I'VE SEEN IT.  THE HYUNDAI TECHNICIAN SHOULD HAVE BEEN ABLE TO SEE IT ALSO.  BUT THEY CLAIM IT IS NOT A PART OR VEHICLE PROBLEM.  HYUNDAI CLAIMS THAT I HAVE BEEN TEARING THE HANDLES OFF IN SOME WAY!  IF THAT IS TRUE, I SURE WISH I KNEW HOW I WAS DOING IT SO I COULD QUIT WRECKING MY CAR!  IT IS OUT OF WARRANTY, SO THEY DON'T CARE NOR ARE THEY INTERESTED IN MAKING SURE IT DOESN'T HAPPEN TO ME (OR ANYONE ELSE!) AGAIN.  TOO BAD, WE AREN'T REQUIRED TO DO ANYTHING NOW, SO GO AWAY IS THE RESPONSE THEY GAVE ME WHEN I SENT THEM A LETTER...DO NOT PURCHASE A HYUNDAI!  *TR",
        "vin": "KMHDU46D07U"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "11/18/2011",
        "dateOfIncident": "10/25/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10436413,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH THE DRIVER'S SIDE AND THE PASSENGER'S SIDE SUN VISORS FELL COMPLETELY OFF WHILE I WAS DRIVING (THIS HAPPENED THREE WEEKS APART).  BECAUSE THERE IS A VANITY LIGHT IN EACH VISOR, THE WIRES BROKE WHEN THE VISORS FELL.  THE BARE WIRES TOUCHED AND SHORTED OUT MY ELECTRICAL SYSTEM.  IT'S NOT UNDER WARRANTY ANYMORE, BUT IT SEEMS AS THOUGH THIS MUST BE SOME KIND OF MANUFACTURING DEFECT SINCE IT HAPPENED TO BOTH VISORS!  *TR",
        "vin": "KMHDU46D07U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/04/2011",
        "dateOfIncident": "10/01/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10434254,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI ELANTRA.  THE CONTACT STATED THAT THE EXTERIOR BRAKE LIGHTS FAILED.  THE MANUFACTURER ADVISED THE CONTACT THAT THE VIN WAS NOT ASSOCIATED WITH NHTSA CAMPAIGN ID NUMBER: 09V122000 (SERVICE BRAKES, HYDRAULIC:SWITCHES:BRAKE LIGHT).  THE DEALER WAS NOT CONTACTED AND THE VEHICLE WAS NOT REPAIRED.  THE FAILURE MILEAGE WAS 53,000 AND THE CURRENT MILEAGE WAS 53,300.",
        "vin": "KMHDU46D07U"
    },
    {
        "components": "POWER TRAIN,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/17/2011",
        "dateOfIncident": "04/01/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10430459,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI ELANTRA. THE CONTACT STATED THAT THE SHIFT LOCK BECAME JAMMED AND THE VEHICLE WOULD NOT SHIFT OUT OF PARK GEAR. IN ORDER TO SHIFT THE VEHICLE OUT OF PARK, THE CONTACT HAD TO RELEASE THE SHIFT LOCK BUTTON WITH A SCREW DRIVER. THE VEHICLE WAS NOT TAKEN TO THE DEALER TO HAVE THE FAILURE DIAGNOSED OR REPAIRED. THE CONTACT ALSO STATED THAT THE BRAKE LIGHTS WERE NOT FUNCTIONING. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHO STATED THE VEHICLE WAS NOT INCLUDED IN THE RECALL ASSOCIATED WITH NHTSA CAMPAIGN ID NUMBER 09V122000 (SERVICE BRAKES, HYDRAULIC:SWITCHES:BRAKE LIGHT). THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE, BUT OFFERED NO ASSISTANCE. THE FAILURE MILEAGE WAS 110,000. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/13/2011",
        "dateOfIncident": "08/16/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10430005,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI ELANTRA. THE CONTACT WAS DRIVING APPROXIMATELY 55 MPH WHEN THE AIR BAG WARNING INDICATOR BEGAN TO ILLUMINATE UNTIL THE ENGINE WAS TURNED OFF. THE FAILURE OCCURRED WHENEVER THE VEHICLE WAS IN MOTION. THERE WAS A RECALL RELATED TO THE FAILURE UNDER NHTSA CAMPAIGN ID NUMBER 11V179000 (AIR BAGS: FRONTAL: SENSOR/CONTROL MODULE). THE DEALER ATTEMPTED TO PERFORM THE RECALL REPAIR AND WAS UNSUCCESSFUL DUE TO THE SEVERE CORROSION WITHIN THE AIR BAG WIRING HARNESS. THE MALFUNCTION CONTINUED TO OCCUR. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 75,000. UPDATED 11/16/11*LJ  UPDATED 11/18/11",
        "vin": "KMKDU46D97U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/20/2011",
        "dateOfIncident": "09/01/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10426417,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI ELANTRA. WHILE THE VEHICLE WAS PARKED THE CONTACT NOTICED THE AIR BAG WARNING LIGHT ILLUMINATED ON THE INSTRUMENT PANEL. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSTIC TESTING WHERE THE TECHNICIANS STATED THE SEAT BELT BUCKLE ON THE FRONT PASSENGER SIDE HAD TO BE REPLACED. THE CONTACT WAS ALSO INFORMED THAT THERE WERE TWO RECALL REPAIRS UNDER NHTSA CAMPAIGN ID NUMBER: 11V143000 (AIR BAGS:FRONTAL:SENSOR/CONTROL MODULE) AND NHTSA CAMPAIGN ID NUMBER: 11V179000 (AIR BAGS:FRONTAL:SENSOR/CONTROL MODULE) THAT WERE ASSOCIATED WITH THE VIN THAT HAD TO BE PERFORMED. THE RECALL REPAIRS WERE PERFORMED AND THE FRONT PASSENGER SIDE BUCKLE WAS REPLACED; HOWEVER, THE AIR BAG LIGHT ILLUMINATED AFTER THE VEHICLE WAS REPAIRED. THE VEHICLE WAS NOT TAKEN BACK TO THE DEALER FOR ADDITIONAL DIAGNOSTIC TESTING. THE APPROXIMATE FAILURE MILEAGE WAS 85,000.",
        "vin": "KMHDU46D17U"
    },
    {
        "components": "SUSPENSION,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/19/2011",
        "dateOfIncident": "11/08/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10425993,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI ELANTRA. THE CONTACT STATED THAT THERE WAS AN INTERMITTENT STALLING WHEN DRIVING 10-15 MPH. THE VEHICLE WAS TAKEN TO THE DEALER AT LEAST TEN TO FIFTEEN TIMES BUT THEY WERE UNABLE TO LOCATE OR DIAGNOSE THE CAUSE OF THE FAILURE. THE SWAY BAR WAS ALSO REPLACED AT LEAST THREE TIMES DUE TO BREAKAGE IN THE FRONT OF THE VEHICLE.  THE MANUFACTURER WAS CONTACTED WHO SENT A REPRESENTATIVE TO INSPECT THE FAILURE BUT THERE WERE NO FAILURES FOUND WITHIN THE VEHICLE. THEY OFFERED NO FURTHER ASSISTANCE. THE FAILURE MILEAGE WAS 17,000 AND THE CURRENT MILEAGE WAS 59,000.   KMJ",
        "vin": "KMHDU46D07U"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/16/2011",
        "dateOfIncident": "07/21/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10425802,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR CUT OFF WHILE DRIVING. WAS ABLE TO RESTART BUT I FEAR THAT THIS WILL OCCUR AGAIN. I HAVE TAKEN THE CAR TO A NEAR BY CAR REPAIR SHOP, NOT HYUNDIA BECAUSE I FEAR THE CAR MIGHT TURN OFF AGAIN ON THE EXPRESS WAY TO HYUNDIA. THE MASTER MECHANIC HOOKED UP MY CAR TO THE DIAGNOSTICS AND  IT IS A FUEL PUMPISSUE. WITH SO LITTLE MILES THIS IS CONCERNING.  *TT",
        "vin": "KMHDU46D87U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/15/2011",
        "dateOfIncident": "09/15/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10425572,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WENT TO DEALERSHIP TO GET ALL 3 RECALLS ON CAR FIXED. AIR BAG LIGHT WAS FIXED. AS SOON AS I DROVE OFF THE LOT THE AIR BAG LIGHT CAME BACK ON. I WENT BACK TO THE DEALERSHIP WHO EXPLAINED THAT THE AIR BAG WOULD NOT WORK UNLESS I PAY $300 PLUS DOLLARS TO GET A SENSOR IN MY  SEAT BELT FIX. STATING THAT THE AIR BAG ISSUE WAS NOT APART OF THE RECALL. AFTER READING SIMILAR POST ONLINE, I FOUND THAT OTHER OWNERS ARE EXPERIENCING THE SAME ISSUES.  *KB",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/15/2011",
        "dateOfIncident": "09/13/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10425582,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI ELANTRA. THE CONTACT STATED THAT THE AIR BAG WARNING LIGHT WAS ILLUMINATED. THE VEHICLE WAS TAKEN TO THE DEALER WHERE REPAIRS WERE PERFORMED UNDER NHTSA CAMPAIGN ID NUMBER: 11V143000 (AIR BAGS: FRONTAL: SENSOR/CONTROL MODULE).  THE FOLLOWING DAY, THE WARNING LIGHT WAS ILLUMINATED AGAIN. THE VEHICLE WAS TAKEN BACK TO THE DEALER WHO ADVISED THAT THE RECALL ISSUE WAS REPAIRED BUT THE CURRENT FAILURE WAS NOT INCLUDED IN THE RECALL. THE DEALER STATED THAT THE AIR BAG SENSOR IN THE SEAT BELT BUCKLE WOULD NEED REPLACING. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 85,000.",
        "vin": "KMHDU46D97U"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "09/01/2011",
        "dateOfIncident": "08/17/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10422890,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SIDE VISOR SPONTANEOUSLY DETACHED FRONT ITS MOUNT, DANGLING DIRECTLY IN THE DRIVERS' LINE OF VISION AND CAUSING THE POTENTIAL FOR AN ACCIDENT.  *TR",
        "vin": "KMHDU46D47U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/25/2011",
        "dateOfIncident": "08/23/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10421419,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY 2007 HYUNDAI ELANTRA WITH 73,000 (ABOUT I NEED TO GET THE FINAL DEATH MILEAGE) MILES ON IT. I HEARD A SLIGHT RATTLE WHEN I PUSHED IN THE GAS PEDAL. I NOTICED IT HAPPENED WHEN I STARTED. I WAS ABOUT A MILE FROM HOME AND FIGURED IT WAS A LOOSE SCREW AND DROVE CAREFULLY. ALL GAUGES AND LIGHTS WERE NORMAL, NO SMOKE ECT. I STARTED UP A HILL. THE RATTLE GOT LOUDER QUICKLY (10-15 SECONDS). THE TEMP GAUGE SPIKED SUDDENLY AND MY RPM'S DROPPED DOWN TO 1 AND BELOW. I PULLED INTO A LEFT HAND TURN LANE AT A LIGHT. THE CAR DIED.  FROM BEGINNING TO END THE WHOLE THING TOOK ABOUT FIVE MINUTES FROM RATTLE TO DEATH.  I TOOK IT TO THE HYUNDAI DEALERSHIP IN KIRKLAND. THE ENGINE IS DEAD DUE TO OVERHEATING OF AN UNKNOWN CAUSE.   I SEARCHED AN FOUND NHTSA ID # 08V429000. IT DESCRIBES A FUEL PUMP ERROR IN WHICH THE CAR SUDDENLY LOSES ENGINE PRESSURE LEADING TO OVERHEATING, ENGINE DEATH AND CAR CRASHES.  I BELIEVE MY CAR IS ONE OF THOSE CARS. I TAKE IMMACULATE CARE OF MY CAR AND WHAT HAPPENED IS WHAT IS DESCRIBED IN THE NHTSA CAMPAIGN.  MY CAR NEEDS A NEW ENGINE. I AM TRYING TO OPT FOR TRADE. I WANT TO KNOW WHAT TO DO. I AM WORKING WITH THE HYUNDAI DEALERSHIP IN KIRKLAND WA. THEY ARE GIVING ME A GOOD TRADE IN VALUE AND A FAIR DEAL ON A USED CAR.   I WOULD LIKE TO GET A REPLACEMENT OR REIMBURSED OR WHAT HAVE YOU AS THE CAR OBVIOUSLY HAD A DEFECT. I AM REALLY GLAD I AM SAFE. HAD IT HAPPENED TEN MINUTES EARLIER I WOULD HAVE BEEN TOAST.  *TR",
        "vin": "KMHDU46D57U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/15/2011",
        "dateOfIncident": "08/01/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10419577,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MECHANIC CHANGING THE SPARK PLUGS NOTICED THAT THE STEERING WAS QUESTIONABLE ON OUR 2007 ELANTRA.  WE BROUGHT IT BACK TO THE DEALER SINCE WE BOUGHT AN EXTENDED WARRANTY ON IT AND THEY DIAGNOSED IT AS A PROBLEM WITH THE STEERING COLUMN.  THEY REPLACED IT UNDER OUR WARRANTY.  I HATE TO THINK THAT THIS MAY BE MORE EXTENSIVE BASED ON THE OTHER REPORTS AND THAT WE WERE LUCKY TO HAVE OUR MECHANIC NOTICE IT BEFORE IT BECAME DANGEROUS. *TR",
        "vin": "KMHDU46D57U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/03/2011",
        "dateOfIncident": "07/01/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10416962,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS 2007 HYUNDAI ELANTRA.  THE CONTACT STATED AFTER RECEIVING NHTSA CAMPAIGN NUMBER 11V143000 (AIR BAGS:FRONTAL:SENSOR/CONTROL MODULE) SHE WAS UNABLE TO SCHEDULE AN APPOINTMENT TO HAVE THE VEHICLE REPAIRED.  THE CONTACT CALLED THE DEALER TWICE AND AFTER DRIVING TO THE DEALER SHE WAS UNABLE TO SCHEDULE AN APPOINTMENT. THE CONTACT CALLED THE MANUFACTURER REGARDING SCHEDULING AN APPOINTMENT AND WAS UNSUCCESSFUL. THE CONTACT STATED THE RECALL COULD CAUSE THE AIR BAG TO DEPLOY.  THE FAILURE MILEAGE WAS 14,000.",
        "vin": "KMHDU46D57U"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "07/17/2011",
        "dateOfIncident": "06/15/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10413205,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "2007 HYUNDAI ELANTRA GLS.  I WAS DRIVING HOME FROM WORK ON 6/15/11 ON OPEN HIGHWAY.  SPEED LIMIT WAS 75 MPH, AND I WAS DRIVING APPROXIMATELY 70 MPH.  I WAS IN THE LEFT LANE AND NOTICED THE CAR WAS STARTING TO DRIFT TO THE LEFT.  I TRIED TO CORRECT  THE VEHICLE TO THE RIGHT, AND THE CAR AUTOMATICALLY WENT OUT OF CONTROL.  I DID NOT HAVE TIME TO APPLY THE BRAKES.  THE CAR ROLLED ONCE, END OVER END.    I BELIEVE THERE WAS SOMETHING DEFECTIVE IN THE STEERING MECHANISM THAT CAUSED THE CAR TO GO OUT OF CONTROL.  I BELIEVE THERE ARE RECALLS FOR STEERING MECHANISMS ON LATER MODELS OF HYUNDAI AUTOMOBILES, BUT NOT ON 2007'S.  I CONTEND THAT THE 2007 MODELS SHOULD BE INCLUDED IN THE RECALLS AND THAT THE STEERING MECHANISMS OF SOME 2007'S ARE FAULTY, INCLUDING MY AUTOMOBILE.  I HAVE FILED A COMPLAINT WITH HYUNDAI SO THEY CAN INSPECT MY CAR.  MY CASE NUMBER IS [XXX].        INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).*TR",
        "vin": "KMHDU46D57U"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/15/2011",
        "dateOfIncident": "02/27/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10400898,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2007 HYUNDAI ELANTRA.  I HAVE HAD 3 DOOR HANDLES BREAK ON THIS VEHICLE.  THE FIRST TWO WERE ON THE PASSENGER SIDE AND BROKE OFF IN THE SUMMER 2 YRS AGO, WITHIN A MONTH OF EACH OTHER.  THEY WERE COVERED BY WARRANTY AND REPAIRED AFTER A SMALL FIGHT WITH THE DEALERSHIP.      THE LAST ONE BROKE IN FEBRUARY OF THIS YEAR.  THE VEHICLE HAS BEEN GARAGED EVERY NIGHT, NO MATTER THE WEATHER.      I'VE NEVER HAD MORE THAN ONE DOOR HANDLE BREAK ON ALL THE CARS I'VE EVER OWNED; AND THAT CAR ONLY HAD ONE HANDLE BREAK!      HYUNDAI SAYS THEY WON'T FIX THE LATEST BROKEN ONE, SINCE I AM OUT OF WARRANTY.  I KNOW THE DOOR HANDLES HAVE ALL BROKEN IN EXACTLY THE SAME PLACE EACH TIME.  THE PART OF THE HANDLE THAT HOLDS THE HANDLE ONTO THE CAR IS MADE OF PLASTIC, AND THE INSIDE OF THAT PART BREAKS AT EXACTLY THE SAME PLACE.   AS THIS PART IS REQUIRED TO KEEP THE HANDLE ON THE VEHICLE, I BELIEVE IT SHOULD BE MADE OF MATERIAL THAT CAN HANDLE SOME WEAR AND TEAR.  I THINK THIS PLASTIC IS JUST UNABLE TO WITHSTAND NORMAL DAILY USAGE!     I POSTED THE FIRST TWO BREAKAGES EARLIER, SO THAT IS ON HERE SOME PLACE.  I'M HOPING TO SEE HYUNDAI BACK UP THEIR PRODUCTS, BUT I DON'T THINK THEY WILL.  SOMEONE NEEDS TO LOOK INTO THIS AND SEE IF I'M THE ONLY ONE-AS THEY CLAIM-OR IF THIS PART IS INDEED UNABLE TO PERFORM CORRECTLY-AS I BELIEVE IS TRUE!  *TR",
        "vin": "KMHDU46D07U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/03/2011",
        "dateOfIncident": "05/02/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10399048,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TODAY, I RECEIVED AIR BAG CONNECTED RECALL CAMPAIGN SERVICE AT LOCAL HYUNDAI SERVICE DEALER REPAIR PLACE. BUT THE AIR BAG SIGNAL IS STILL ILLUMINATING. I WORRY ABOUT IT. I BELIEVE THAT I MUST NOT SEE THAT SIGNAL AFTER GETTING THE RECALL SERVICE. HELP ME, PLEASE",
        "vin": "KMHDU46D07U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,STEERING",
        "crash": false,
        "dateComplaintFiled": "04/07/2011",
        "dateOfIncident": "03/20/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10395149,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 HYUNDAI ELANTRA. THE CONTACT WAS DRIVING APPROXIMATELY 65 MPH WHEN THE EPS WARNING INDICATOR ILLUMINATED, FOLLOWED BY THE LOSS OF POWER STEERING. THE VEHICLE WAS MANEUVERED TO THE SIDE THE ROAD AND THE ENGINE WAS TURNED OFF. THE CONTACT RESTARTED THE ENGINE AS THE VEHICLE RESUMED NORMALLY YET THE FAILURE RECURRED ON A SEPARATE DATE. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER AND REPAIRED YET THE FAILURE CONTINUED TO RECUR.  THE FAILURE MILEAGE WAS APPROXIMATELY 34,252.   UPDATED 05/25/11  *BF    THE DEALER CLAIMED THE REPAIRS WERE MADE TO THE STEERING. HOWEVER, THE CONSUMER STATED WHILE DRIVING, THE ENGINE SUDDENLY SHUT OFF. UPDATED 06/08/11   UPDATED 11/16/11. *JB",
        "vin": "KMHDU46D97U"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/02/2011",
        "dateOfIncident": "12/22/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10374368,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE HAD TO REPLACE BRAKES TWICE SINCE PURCHASE.  RUSTED LAST REPAIR HAD ONLY 5000MILES BEFORE IT NEEDED TO BE REPLACED AGAIN.  MARCH 16, 2009 WITH 22,038 MILES FRONT AND REAR BRAKES WERE REPLACED ALONG WITH ROTOR RESURFACING IN CHICAGO.   DECEMBER 20, 2010 WITH 27,269 MILES BRAKES REPLACED AGAIN SEVERE RUST.",
        "vin": "KMHDU46D57U"
    },
    {
        "components": "STEERING,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/14/2010",
        "dateOfIncident": "12/13/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10370528,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYUNDAI ELANTRA. THE CONTACT STATED THAT THE ENGINE STALLED WHILE DRIVING 70 MPH AND THE CHECK ENGINE LIGHT WAS ILLUMINATED. IN ADDITIN, THE STEERING WOULD SPORADICALLY LOCK WITHOUT WARNING. THE VEHICLE WAS TURNED OFF MOMENTARILY AND THE CONTACT WAS ABLE TO DRIVE THE VEHICLE TO HIS PLACE OF RESIDENCE. THE FAILURE WAS AN INTERMITTENT OCCURRENCE.  THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGE WAS 75,000.",
        "vin": "KMHDU46D27U"
    },
    {
        "components": "SUSPENSION,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/19/2010",
        "dateOfIncident": "09/23/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10366904,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 HYUNDAI ELANTRA. WHILE STARTING THE VEHICLE THE AIR BAG LIGHT CAME ON AND STAYED ON. THE VEHICLE WAS TAKEN TO THE DEALER WHO REPLACED THE DEFECTIVE AIR BAG SENSOR. THE FIRST AIR BAG FAILURE OCCURRED IN SEPTEMBER 2008, SINCE THAT TIME THE FAILURE HAD OCCURRED THREE ADDITIONAL TIMES. THE AIR BAG SENSOR WAS REPLACED THREE TIMES AND THE LAST FAILURE THAT OCCURRED THE DEALER REPLACED THE AIR BAG CONTROL MODULE.  THE FRONT TIRES WERE REPLACED FOUR TIMES DUE TO THE SUSPENSION WHICH INCLUDED A FRONT END ALIGNMENT. SHE WAS ALSO INFORMED BY THE DEALER ON NOVEMBER 19, 2010 THAT THE REAR CAMPER WAS OUT OF SPECIFICATION AND THAT THE FRONT SWAY BAR LINKS WERE REPLACED TWICE. THE VEHICLE HAD NOT BEEN REPAIRED FOR THE REAR CAMPER SPECIFICATION. THE FAILURE MILEAGE WAS 13,000 AND THE CURRENT MILEAGE WAS 68,000.",
        "vin": "KMHDU46D17U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/26/2010",
        "dateOfIncident": "09/12/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10357740,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN TURNING THE STEERING WHEEL TO MAKE A TURN OR WHEN BACKING OUT OF A PARKING STALL AND THEN PULLING FORWARD YOU WILL RANDOMLY GET A POPPING SOUND COMING FROM THE STEERING COLUMN AREA. YOU CAN ALSO FEEL A LIGHT POP. THE VEHICLE HAS BEEN TOOK TO THE DEALER, FOR THEM TO CHECK BUT THEY SAID THEY COULD NOT FIND ANYTHING. THE LAST TIME THE SERVICE TECH SAID, HE DID HEAR A SMALL POP BUT IT WAS SO LIGHT HE WOULD NOT BE ABLE TO FIND IT. SO HE TIGHTEN THE BOLTS FOR THE STEERING COLUMN. HOWEVER NOW THE  NOISE IS HAPPENING MORE OFTEN. THE PROBLEM FIRST STARTED WHEN THE CAR HAD ABOUT 50K MILES ON IT. I TOOK THE CAR INTO THE DEALER A FEW TIMES FOR THE SAME PROBLEM THE FIRST TIME THEY LOOK AT IT AND SAID THEY COULD NOT FIND IT. I RE TOOK THE CAR IN ABOUT A MONTH LATER AND THIS TIME THE TECH DID HEAR IT WHEN WE WENT FOR A TEST DRIVE BUT HE TOLD ME HE WOULD NOT BE ABLE TO FIND IT AND TO BRING IT BACK IN LATER. WHEN I DID THEY SAID IT WOULD BE A CHARGE TO RELOOK AT IT BECAUSE ITS BEEN IN BEFORE FOR THE SAME PROBLEM. NOW IT HAVE BEEN ABOUT A YEAR SINCE I LAST TOOK IT IN FOR THIS BUT NOW IT IS DOING IT MORE OFTEN AND LOADER WHEN IT DOES DO IT. ALSO THE  AIR BAGS LIGHT TURNED ON AND WOULD NOT RESET. BUT AFTER MOVING THE STEERING WILL TILT THE LIGHT THEN RESET AND STAYED OFF. *TR",
        "vin": "KMHDU46D27U"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/19/2010",
        "dateOfIncident": "09/18/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10356304,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE DIVING AT A SPEED OF APPROXIMATELY 50 MPH WHEN WE STRUCK A TELEPHONE POLE WITH THE FRONT END OF OUR 2007 HYUNDAI ELANTRA.  THE IMPACT WAS 3\" OFF CENTER WITH A DIRECT FRONT END IMPACT.  NO AIRBAG DEPLOYMENT OCCURRED WITH A RESULT OF  PHYSICAL DAMAGE TO MYSELF AND MY FRIEND.  *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,EXTERIOR LIGHTING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/19/2010",
        "dateOfIncident": "08/17/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10350654,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "HYUNDAI DIDN'T FULLY ASSESS RECALL ID # 09V122000 ON THE BRAKE STOP LIGHT. MINE HAS MALFUNCTIONED TWICE IN 1.5 YEARS, YET THEY ARE NOW TELLING ME THAT I AM NOT A PART OF THE RECALL. THIS IS A VERY SERIOUS ISSUE THAT CAN ALSO INVOLVE THE CRUISE CONTROL NOT STOPPING, SHIFTING PROBLEMS, AND A POSSIBLE REAR-END ACCIDENT.     THIS NEEDS TO BE LOOKED IN TO - MORE PEOPLE THAN ORIGINALLY ESTIMATED CAN BE AT SERIOUS RISK - NOT TO MENTION MORE PEOPLE ARE PAYING TO HAVING THIS FIXED BY THEIR DEALER (I.E. ME) THAN THERE SHOULD BE! *TR",
        "vin": "KMHDU46D97U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/09/2010",
        "dateOfIncident": "08/04/2010",
        "fire": true,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10348279,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 HYUNDAI ELANTRA. WHILE DRIVING  APPROXIMATELY 65 MPH THE DRIVERS SIDE FOG LIGHT IGNITED INTO FLAMES.  THE VEHICLE WAS DRIVEN ONTO THE EMERGENCY LANE WHERE THE FIRE WAS EXTINGUISHED BY SOME PASSING BY. THE POLICE AND FIRE DEPARTMENT ARRIVED; HOWEVER, HE WAS UNSURE IF THERE WAS A REPORT FILED.  THE VEHICLE WAS TOWED TO AN AUTHORIZED DEALER WHO WAS UNABLE TO DIAGNOSE THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGES WERE 48,000.",
        "vin": "KMHDU46D67U"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/07/2010",
        "dateOfIncident": "06/01/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10341869,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 HYUNDAI ELANTRA. THE VEHICLE WAS TAKEN TO THE DEALER SEVERAL TIMES FOR STALLING WHILE DRIVING BETWEEN SPEEDS OF 35 TO 40 MPH. THE DEALER REPLACED THE SPARK PLUGS WIRES, AND THE CYLINDER. THE REPAIR DID NOT CORRECT THE FAILURE. THE VEHICLE WAS TAKEN BACK TO THE DEALER WHO REPLACED THE ORIGINAL TRANSMISSION AFTER THE VEHICLE ROLLED BACKWARDS WHEN THE GEAR WAS IN THE PARK POSITION. THE DEALER WAS UNABLE TO DIAGNOSIS OR DUPLICATE THE FAILURE. THE DEALER REPLACED THE TRANSMISSION THREE TIMES. THE MANUFACTURER WAS CONTACTED AND A REPORT 3973939 WAS FILED. THE MANUFACTURER STATED THAT THE DEALER WAS UNABLE TO DUPLICATE THE FAILURE; THEREFORE, THEY COULD NOT ASSIST HIM. THE FAILURE MILEAGE WAS NOT AVAILABLE.  THE CURRENT MILEAGE WAS 45,000.",
        "vin": "KMHDU46D47U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/10/2010",
        "dateOfIncident": "06/05/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10335600,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "1) EVENTS LEADING UP TO FAILURE: I WAS PULLING OUT OF A LEVEL PARKING SPOT AT ABOUT 2 MPH WHEN I HEARD A LOUD SNAP AND MY STEERING WENT OUT OF CONTROL.    2) THE FAILURE:  THE RIGHT FRONT TIE-ROD BROKE! THE INNER TIE-ROD END DISCONNECTED FROM THE OUTER TIE-ROD END! THE THREADS ON BOTH THE INNER AND OUTER TIE-RODS WERE STRIPPED AND THEY PULLED APART COMPLETELY! THE RIGHT FRONT WHEEL WAS COMPLETELY DISCONNECTED FROM THE STEERING MECHANISM AND WAS RANDOMLY FLOATING/TURNING IN DIFFERENT DIRECTIONS. I TURNED THE WHEELS LEFT, BUT THAT WHEEL WAS STILL TURNED RIGHT! THE CAR WAS DRAGGING THAT WHEEL AROUND AS I TRIED TO DRIVE FORWARD! THE TIRE MADE A TERRIBLE SCREECHING NOISE. IF THIS HAD HAPPENED AT 70 MPH (I JUST GOT OFF THE HIGHWAY) THE CAR WOULD HAVE FLIPPED END-OVER-END KILLING/INJURING ME AND THOSE AROUND ME!    3) WHAT WAS DONE TO CORRECT THE FAILURE: THE CAR IS STILL UNDER WARRANTY. HYUNDAI REPLACED BOTH THE INNER AND OUTER TIE-RODS AND DID A REALIGNMENT. THE HYUNDAI DEALER REFUSED TO GIVE ME THE OLD PARTS. *TR",
        "vin": "KMHDU46D77U"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "05/23/2010",
        "dateOfIncident": "02/01/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10331821,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "SUN VISORS NO LONGER STAY FLUSH TO ROOF AND DROP UNEXPECTEDLY INTO LINE OF VISION.  VISORS ON BOTH DRIVER'S AND PASSENGER'S SIDE ARE AFFECTED.  CANNOT EASILY REMOVE VISOR SINCE CONNECTED BY WIRE FOR LIGHT. VISORS REPLACED OUT OF WARRANTY. *TR",
        "vin": "KMHDU46D37U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/12/2010",
        "dateOfIncident": "03/01/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10325109,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 HYUNDAI ELANTRA. THE CONTACT STATED THAT THE AIR BAG SENSOR REMAINED ILLUMINATED ON THE INSTRUMENT PANEL WHENEVER THE VEHICLE WAS IN OPERATION. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER FOR DIAGNOSTIC TESTING. THE TECHNICIAN STATED THE AIRBAG MODULE SENSOR LOCATED UNDERNEATH THE PASSENGER SEAT NEEDED TO BE REPLACED. THERE WAS NO CHARGE FOR THE SERVICE REPAIR, AND THE OWNER WAS RESPONSIBLE FOR THE RENTAL VEHICLE EXPENSES. THE FAILURE MILEAGE WAS 62,000. THE CURRENT MILEAGE WAS 63,009.",
        "vin": "KMHDU46D97U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/03/2010",
        "dateOfIncident": "01/20/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10316220,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "ABOUT ON JANUARY 20, 2010 MY MOTHER WAS DRIVING HER 2007 HYUNDAI ELANTRA WHEN THE POWER STEERING SUDDENLY FAILED AS SHE WAS BACKING OUT OF A PARKING SPACE. SHE WAS ABLE, WITH SOME DIFFICULTY, TO GET THE AUTO HOME AND TURN THE CAR OFF. WHEN SHE TURNED IT BACK ON THE POWER STEERING WORKED AGAIN. SHE TOOK IT TO HER DEALER, AMATO HYUNDAIMAZDA IN MILWAUKEE, WI TO GET REPAIRED. THEY SUPPOSEDLY READ THE CODE THAT THE CAR'S COMPUTER SAID EXPLAINED THE PROBLEM, TOLD HER THEY WOULD HAVE TO ORDER PARTS AND MADE AN APPOINTMENT FOR HER TO RETURN IN A FEW DAYS. WHEN SHE GOT HOME, THE SERVICE MANAGER CALLED AND SAID THEY WERE NOT SURE WHAT WAS WRONG WITH THE CAR AND HE WOULD HAVE TO DRIVE IT FOR A FEW DAYS TO TRY AND REPRODUCE THE PROBLEM. SHE REFUSED SAYING THEY ALREADY TOLD HER THEY KNEW WHAT THE PROBLEM WAS. *TR",
        "vin": "KMHDU46D17U"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/01/2010",
        "dateOfIncident": "02/26/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10315296,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "HYUNDAI ELANTRA 2007,   NONE OF THE AIR BAGS DEPLOYED DURING A HEAD-ON CRASH WITH A TRUCK. THE FRONT OF THE CAR WAS TOTALLY DAMAGED AND THE DRIVER SIDE REAR END WAS SERIOUSLY DAMAGED BUT NONE OF THE SIX AIR BAGS DEPLOYED. THE CAR WAS TOTAL. LUCKILY THE SEATBELT WORKED AND RESULTED ONLY MINOR HEAD, NECK AND SHOULDER INJURIES. *TR",
        "vin": "KMHDU46DX7U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/21/2009",
        "dateOfIncident": "12/21/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10296628,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG SENSOR HAS FAILED THREE TIMES.  CAR WAS TAKEN TO THE DEALER TODAY AND THE DEALER HAS ORDERED NEW SENSOR.  AIR BAGS ON THE CAR ARE CURRENTLY NOT FUNCTIONAL. *TR",
        "vin": "KMHDU46D17U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/02/2009",
        "dateOfIncident": "12/02/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10294256,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "OWNER OF A 2007 HYUNDAI ELANTRA (<20,000 MILES). BROUGHT IT IN TO DEALERSHIP 3X FOR AIRBAG LIGHT BEING ON. NOW FOUND OUT THE DASH AND FLOOR WIRING HARNESS NEED TO BE REPLACED DUE TO CUPHOLDER LEAKING CONDENSATION ONTO WIRING HARNESS AND SHORTING IT OUT, THUS DISABLING THE AIR BAG SYSTEM. NOT COVERED UNDER HYUNDAI WARRANTY. EXACT SAME PROBLEM THAT WAS ISSUED A RECALL FOR IN 2001 HYUNDAI ELANTRA MODEL \"HYUNDAI IS RECALLING CERTAIN MY 2001 ELANTRA VEHICLES. IF A LIQUID IS SPILLED IN THE AREA OF THE CUPHOLDER ON THE CENTER CONSOLE, IT MAY SEEP THROUGH THE CONSOLE OPENING FOR THE PARKING BRAKE LEVER AND THEN DRIP ONTO THE AIR BAG CONTROL MODULE ELECTRICAL CONNECTOR. THE SPILLED LIQUID MAY CONTAMINATE THE AIR BAG CONTROL MODULE AND ITS ELECTRICAL CONNECTOR TO THE AIR BAG WIRING HARNESS AND CAUSE THE SUPPLEMENTAL RESTRAINT SYSTEM (SRS) WARNING LIGHT TO ILLUMINATE.\" *TR",
        "vin": "KMHDU46D47U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/09/2009",
        "dateOfIncident": "10/01/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10286856,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR IS A 2007 HYUNDAI ELANTRA SEDAN. WHILE DRIVING THE AIR BAG LIGHT CAME ON SO AN APPOINTMENT WAS MADE WITH THE DEALER (HAMILTON HYUNDAI, CHAMBERSBRUG, PA TO HAVE IT CHECKED. THE DEALER SAID THAT MOISTURE FROM THE CENTER MOUNTED CUP HOLDER GOT INTO A ELECTRICAL CONNECTION DIRECTLY BELOW AND CAUSED THE WIRING HARNESS TO GET HOT, MELT TOGETHER AND THE WIRING HARNESS ON THE PASSENGER SIDE UNDER THE DASH, ALSO MELTED. NO FUSES OR CIRCUIT BREAKERS ACTIVATED. THE AIR BAGS AT THIS POINT WERE INOPERABLE AND THE SERVICE MANAGER SAID THAT THE CAR COULD POSSIBLY CATCH FIRE WHILE OPERATING. THE CAR WAS ALSO THERE FOR THE RECALL ON THE BRAKE SWITCH THAT COULD CAUSE A CRASH SINCE THE BRAKE LIGHTS COULD OR COULDN'T ILLUMINATE. THE PARTS  AND LABOR TO REPLACE THE WIRING HARNESS ARE QUITE EXPENSIVE AND ALL DUE TO A POORLY ENGINEERED DESIGN. THE FACT THAT WE WERE WARNED THAT THE CAR COULD CATCH FIRE IS DISTURBING AND HYUNDAI SAID THAT THERE WAS NOTHING THEY COULD DO TO HELP. THERE IS ANOTHER 2007 HYUNDAI ELANTRA AT THE DEALER THAT HAS THE SAME HARNESS MELTED DOWN. *TR",
        "vin": "KMHDU46D87U"
    },
    {
        "components": "PARKING BRAKE,ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/30/2009",
        "dateOfIncident": "09/28/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10285815,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE INCIDENT IS LIQUID THAT DRIPPED INTO THE EMERGENCY BRAKE CAUSING WIRES TO MELT FOR THE AIRBAG SYSTEM.  THE CUP HOLDERS ARE LOCATED DIRECTLY BESIDE THE EMERGENCY BRAKE.  THE EMERGENCY BRAKE HOUSING, CONTAINS THE WIRING HARNESS FOR THE VEHICLE.   THERE IS NO SORT OF PROTECTIVE DEVICE TO KEEP LIQUIDS FROM GETTING ON THE WIRING.  WHAT HAPPENED IN MY INSTANCE IS THAT LIQUID MUST HAVE DRIPPED OFF OF A CUP IN THE CUPHOLDER, NOT SURE HOW CONDENSATION OFF OF A CUP, COULD CAUSE INSULATED WIRES TO MELT, BUT IT DRIPPED INTO THE CONSOLE AREA AND MELTED THE AIR BAG WIRING HARNESS.  IT REQUIRES A COMPLETE REPLACEMENT OF THE HARNESS.  WARRANTY NOT COVERED BECAUSE IT IS NOT A PART DEFECT.  SAFETY HAZARD BECAUSE IT CAN CAUSE A FIRE IF NOT FIXED.  SHOULD HAVE A PROTECTIVE COVER IN THE EVENT OF SOMETHING LIKE THIS OCCURRING.  *TR",
        "vin": "KMHDU46D87U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/13/2009",
        "dateOfIncident": "03/26/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10283809,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2007 HYUNDAI ELANTRA THAT WEARS THE FRONT TIRES UNEVENLY. THE ORIGINAL TIRES HAD ABOUT 28,000 MILES ON THEM. THE TIRES LOOKED FINE ON THE OUTSIDE BUT WERE WORN DOWN TO THE STEEL BELTS ON THE INSIDE. THEY ALSO HAD A DIAGONAL WEAR WHICH MADE THE FRONT END HOP. AFTER REPLACING THE TIRES WITH SNOWS I TOOK IT TO A SERVICE AUTO CENTER FOR AN ALIGNMENT AND WAS TOLD THERE WAS NO ADJUSTMENT FOR THE TIRE WEAR. I THEN TOOK BACK TO DEALER AND WAS TOLD THE VEHICLE WAS IN SPECS BUT THEY COULD NOT CORRECT THE PROBLEM. THE SERVICE PERSON SAID I SHOULD ROTATE THE TIRES EVERY 5,000 MILES. I HAVE DONE THIS TO NO PREVAIL.THE SNOWS HAD LESS THAN 8000 MILES WHEN THE NOTICEABLE HOP RETURNED. SPRING CAME AND PUT NEW ALL SEASON TIRES ON. I JUST HOPE THE TIRES DON'T BLOW OUT WHILE DRIVING. *TR",
        "vin": "KMHDU46D17U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/27/2009",
        "dateOfIncident": "06/30/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10281918,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "1. WEARING TIRES,  2. NON ADJUSTABLE REAR SUSPENSION OUT OF SPEC. 3. DEALER STATES LOOSENED BOLTS AND ADJUSTED. REPLACED TIRES AT 34,200 MILES. *TR",
        "vin": "KMHDU46D47U"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/17/2009",
        "dateOfIncident": "07/18/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10280729,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TWO DOOR HANDLES HAVE BROKEN ON MY 2007 HYUNDAI ELANTRA. BOTH OF THEM WERE ON THE PASSENGER SIDE OF THE VEHICLE.  THEY BOTH BROKE AT THE SAME PLACE, A PLASTIC PART INSIDE THE SMALL PIECE THAT THE HANDLE FITS INTO.  (THIS SMALL PIECE STAYS ON THE CAR WHILE THE DOOR HANDLE LIFTS UP.)  THE BACK DOOR BROKE OFF IN JULY, WHILE THE FRONT DOOR HANDLE BROKE THIS WEEKEND, IN AUGUST. I AM CONCERNED THAT THE DRIVER'S DOOR HANDLE WILL BE NEXT! *TR",
        "vin": "KMHDU46D07U"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/13/2009",
        "dateOfIncident": "08/04/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10280353,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG SENSOR LIGHT CONSISTENTLY ON IN 2007 HYUNDAI ELANTRA.  TAKEN TO DEALERSHIP AND THEY REPORTED THAT THE WIRING HAD BEEN SHORTED OUT BY SOFT DRINK SPILLING INTO THE CONSOLE FROM THE CUP HOLDERS AND SHORTING OUT THE WIRING HARNESS, DISABLING THE AIR BAGS. THERE ARE NO WARNING STICKERS ON THE CONSOLE WARNING OF THE RISK OF LEAKAGE FROM THE CUPHOLDER INTO THE CONSOLE AND NO WARNING TO THIS EFFECT IN THE OWNER?S MANUAL. WIRING HARNESS WAS REPLACED AND OWNER CAUTIONED BY TECHNICIAN AND SERVICE MANAGER ON DANGER OF LIQUID SEEPING FROM CUP HOLDER INTO CONSOLE AND RECOMMENDED NOT USING CONSOLE CUP HOLDERS BUT ONES IN BACK SEAT INSTEAD.  RESEARCH ON THE INTERNET RESULTED IN DISCOVERY THAT THIS EXACT SAME PROBLEM HAD RESULTED IN A NATIONAL HIGHWAY TRAFFIC SAFETY ADMINISTRATION RECALL OF THE 2001 - 2002 HYUNDAI ELANTRAS REQUIRING INSTALLATION OF A PROTECTIVE COVER TO CORRECT THE PROBLEM.  APPARENTLY THE PROBLEM HAS NOT BEEN RESOLVED IN THE 2007 ELANTRA AND A DESIGN FLAW STILL EXISTS SUCH THAT A MINOR SPILL FROM THE CUP HOLDER INSTALLED ON THE CONSOLE CAN SHORT OUT THE WIRING MAKING THE AIRBAG INOPERABLE AND PUTTING THE PASSENGERS AT RISK AND RESULTED IN AT LEAST ONE DEATH PRIOR TO THE EARLIER RECALL.    (HTTP://WWW.CONSUMERAFFAIRS.COM/NEWS04/2008/03/NHTSA_HYUNDAI.HTML). *TR",
        "vin": "KMHDU46D67U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/20/2009",
        "dateOfIncident": "05/15/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10277461,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "2007 HYUNDAI ELANTRA GLS. AIR BAG LIGHT COMES ON INDICATING THERE IS   SOME MALFUNCTION WITH AIR BAG DEPLOYMENT.  I'VE HAD THIS COVERED UNDER  WARRANTY LAST YEAR (MAY 2008) AND HYUNDAI REPLACED THE AIR BAG SENSOR  BY THE DRIVER'S SEAT.  THE AIR BAG LIGHT IS ONCE AGAIN ON RIGHT NOW.  BY  SIMPLY MOVING THE DRIVER'S SEAT BACK AND FORTH, APPARENTLY LEADS TO THE FAILURE/MALFUNCTION OF THE AIR BAGS.  THIS SEEMS TO BE A FAULTY AIR BAG SENSOR THAT SO OFTEN BREAKS DOWN AT THE PLACE THAT IT HAS BEEN INSTALLED. *TR",
        "vin": "KMHDU46D47U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/18/2009",
        "dateOfIncident": "07/13/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10277309,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JULY 13, 2009 I LEFT MY 2007 ELANTRA ON TO RUN IN SOMEWHERE, WHEN I CAME BACK TO MY CAR IT HAD DIED. I THOUGHT THAT I HAD JUST TURNED THE KEY OFF BEFORE I GOT OUT OF MY CAR WITHOUT THINKING AND DIDN'T WORRY ABOUT IT. I CONTINUED DRIVING FOR A COUPLE OF HOURS WITH NO PROBLEMS. WHEN I WAS LEAVING WORK I TURNED MY CAR ON AND IT DIED SO I TURNED IT OFF FOR A FEW SECONDS AND BACK ON PULLED OUT OF THE PARKING LOT INTO THE STREET AND IT DIED AGAIN. I TURNED IT OFF AND ON AGAIN AND IT WAS FINE. THE NEXT DAY I HAD NO PROBLEMS UNTIL I WAS ON MY LUNCH BREAK. I WAS DRIVING BACK TO WORK AND WAS STOPPED AT A RED LIGHT AND MY CAR DIED AGAIN, I TURNED IF OFF AND THEN ON AGAIN AND IT IMMEDIATELY DIED SO I TURNED IT OFF AND ON AGAIN AND THEN IT WAS FINE. THE NEXT DAY (JULY 15, 2009) I TOOK MY CAR INTO THE DEALERSHIP TO HAVE IT LOOKED AT. AFTER 2 DAYS IN THE SHOP THEY CALLED AND SAID THEY COULDN'T FIND ANYTHING WRONG WITH IT AND HAD NO IDEA WHY IT WAS DYING. SO I PICKED IT UP YESTERDAY AND SO FAR HAVE NOT HAD A PROBLEM BUT I AM WORRIED ABOUT DRIVING MY CAR NOW. I WAS LUCKY THAT IT WAS ONLY DYING WHEN I WAS IDLING BUT WHO KNOWS NEXT TIME IT COULD DIE WHILE ON THE HIGHWAY GOING 60 MPH! *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/12/2009",
        "dateOfIncident": "06/08/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10273590,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING TO WORK ON THE HIGHWAY AT VERY SLOW SPEEDS.  AT ONE POINT, I WAS COASTING AND THE CAR STALLED, TURNED OFF.  I COASTED OFF THE SHOULDER OF THE ROAD, WAITED FOR A FEW SECONDS AND RESTARTED THE CAR.  IN WEEKS PAST, I HAD NOTICED THE CAR SPUTTERING AND ROCKING AT VERY LOW SPEEDS ON MY COMMUTE HOME. *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/15/2009",
        "dateOfIncident": "04/05/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10268821,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 HYUNDAI ELANTRA.  WHEN THE VEHICLE IS STARTED, THE AIR BAG LIGHT REMAINS ILLUMINATED.  HE CALLED THE MANUFACTURER AND WAS ADVISED TO SUBMIT A COMPLAINT IN WRITING FOR THEIR REVIEW.  THE FAILURE MILEAGE WAS 18,480 AND CURRENT MILEAGE WAS 19,681.     UPDATED 06/27/09  *BF  THE CONSUMER STATED HE TOOK THE VEHICLE TO THE DEALER, BUT AFTER WAITING FOR 6 HOURS HE LEFT.  UPDATED 06/23/09.*JB",
        "vin": "KMHDU46D17U"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/21/2009",
        "dateOfIncident": "02/20/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10259527,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TRAVELING AT A SPEED OF APPROXIMATELY 55 MPH.  A CAR STOPPED SUDDENLY IN FRONT OF ME, SO I SLAMMED ON MY BRAKES.  THE BRAKES LOCKED UP, AND MY CAR CRASHED INTO THE CAR IN FRONT OF ME.  THE ENTIRE FRONT PORTION OF THE CAR WAS COMPLETELY SMASHED IN.  THE FRONT AIR BAG FAILED TO DEPLOY. *TR",
        "vin": "KMHDU46D87U"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/09/2009",
        "dateOfIncident": "01/18/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10258005,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING MY 2007 HYUNDAI ELANTRA SE IN 3RD GEAR (AUTO TRANSMISSION), THE 3RD GEAR INDICATOR LIGHT INTERMITTENTLY FLICKERS, CAUSING THE TRANSMISSION TO MOMENTARILY SHIFT INTO 4TH GEAR. TOOK CAR TO DEALER 3 TIMES AND HMA HAD AN ENGINEER LOOK AT THE CAR; REPLACED A GEARSHIFT PIN SWITCH AND INSTRUMENT CLUSTER AND VEHICLE STILL HAS THE SAME PROBLEM. HMA CLAIMS THAT THERE IS NO PROBLEM WITH THE CAR. CAR CAN ABRUPTLY SHIFT BETWEEN 3RD TO 4TH AND BACK TO 3RD GEAR AS LIGHT FLICKERS DUE TO THE ELECTRICAL PROBLEM. *TR",
        "vin": "KMHDU46D87U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/29/2008",
        "dateOfIncident": "06/16/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10253065,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "KEY GETS STUCK IN 2007 HYUNDAI ELANTRA.  IT WILL TURN OFF THE ENGINE AND POWER TO DASHBOARD BUT IT CANNOT BE RELEASED FROM THE IGNITION.   IT IS CONSTANTLY STUCK IN THE IGNITION RELEASING SPORADICALLY OR WHEN THE BATTERY IS COMPLETELY DRAINED BECAUSE THE KEY IS ALWAYS IN.  I HAVE TAKEN IT IN TO THE DEALER WHO SAYS THEY HAVE REPLACED THE CYLINDER AND SWITCH.  PROBLEM STILL OCCURS AND IS DRAINING MY BATTERY.  THE DEALER SAYS THEY WON'T DO ANYTHING MORE BECAUSE IT COSTS THEM TOO MUCH AND HYUNDAI IN S. KOREA WON'T REIMBURSE THEM.   *TR",
        "vin": "KMHDU46D77U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/12/2008",
        "dateOfIncident": "12/12/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10251586,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 HYUNDAI ELANTRA.  THE CONTACT NOTICED THAT THE AIR BAG WARNING INDICATOR WAS ILLUMINATED ON THE INSTRUMENT CONTROL PANEL.  SHE TOOK THE VEHICLE TO THE DEALER AND THEY STATED THAT BECAUSE THE CUP HOLDER WAS LOCATED IN THE CENTER CONSOLE, A LEAK FROM A BEVERAGE COULD ENTER INTO THE AIR BAG MODULE AND CAUSE THE MODULE AND HARNESS TO FAIL.  IN THE EVENT OF A CRASH, THE AIR BAG MAY NOT DEPLOY PROPERLY.  SHE HAD THE AIR BAG MODULE REPLACED.   UPDATED 2/2/09 *CN  UPDATED 02/04/09. *JB",
        "vin": "KMHDU46DX7U"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/18/2008",
        "dateOfIncident": "11/14/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10249145,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 HYUNDAI ELANTRA.  WHILE DRIVING UPHILL AROUND A CORNER AT A FAST SPEED, THE CONTACT REAR ENDED A HORSE TRAILER.  THE AIR BAGS DEPLOYED 3 TO 4 SECONDS AFTER  SHE HIT THE STEERING WHEEL.  SHE SUSTAINED BRUISED RIBS IN THE MIDDLE OF HER CHEST.  THE CONTACT WENT HOME IN PAIN AND THEN DECIDED TO GO TO THE HOSPITAL.  A POLICE REPORT WAS FILED.  THE CONTACT WAS THE ONLY OCCUPANT IN THE VEHICLE AT THE TIME OF THE CRASH, AND SHE WAS WEARING HER SEAT BELT.  THERE WAS NO MAINTENANCE OR SERVICE PERFORMED ON THE AIR BAGS.  THE INSURANCE COMPANY DECLARED THAT THE VEHICLE WAS DESTROYED.   THE FAILURE MILEAGE WAS 3,000.   UPDATED 12-15-08  *BF  UPDATED 12/17/08 8JB",
        "vin": "KMHDU46D67U"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/27/2008",
        "dateOfIncident": "10/27/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10246859,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I REARENDED SOMEONE IN MAY DESPITE THE FACT THAT I WAS COMPLETELY STOPPED.  I HAD MY FOOT COMPLETELY DEPRESSED ON THE BRAKE AND STOPPED AT A LIGHT, BUT STILL, MY CAR HIT THE CAR INFRONT OF ME WITH INCREDIBLE FORCE.  I THOUGHT THAT I WAS HIT FROM BEHIND AND PUSHED INTO THIS CAR BUT WHEN WE PULLED INTO THE PARKING LOT, THERE WERE NO SCRATCHES OR ANYTHING ON THE BACK OF MY CAR.  IT CAME DOWN TO BEING MY FAULT SINCE THERE WAS NO-ONE ELSE AND I COULDN'T PROVE THAT MY FOOT WAS ON THE BRAKE.  THEN, TODAY, AS I WAS REACHING DOWN TO PUT MY CAR IN PARK, IN A PARKING LOT WHERE I WAS, AGAIN, COMPLETELY STOPPED, MY CAR REPEATED THE FORCEFUL THRUST FORWARD.  THIS TIME THERE WAS NO CAR INFRONT OF ME, THANK GOODNESS, BUT MY CAR HIT AND BOUNCED OFF OF THE CONCRETE CURB IN THE PARKING LOT RESULTING IN ME GETTING A HEADACHE FROM THE FORCE.  AGAIN, I WAS COMPLETELY STOPPED AND MY CAR LURCHED FORWARD LIKE I WAS REARENDED.  I KNOW THAT THE INCIDENT IN MAY WAS NOT BECAUSE I HAD TAKEN MY FOOT OFF THE BRAKE BUT THAT THERE IS SOMETHING WRONG WITH MY CAR AND NOW THAT IT'S HAPPENED AGAIN, I KNOW I'M RIGHT.  ONCE, IT HAPPENED TO HAPPEN WHEN I WAS BEHIND A CAR AND THEN TODAY IT HAPPENED WHEN I WAS IN A PARKING LOT, BUT I'M SCARED OF WHAT MAY HAPPEN IF THERE IS SOMEONE ELSE INFRONT OF ME.   I TOOK IT TO THE DEALERSHIP BUT THEY COULDN'T FIND ANYTHING WRONG WITH IT.  I DON'T WANT ANYONE TO GET HURT BECAUSE OF THIS FAULTY CAR, SO THIS IS MY LAST HOPE OF GETTING SOMEONE TO FIND OUT WHAT THE PROBLEM IS.  IT HAS ONLY HAPPENED TWICE IN A YEAR AND A HALF BUT I DON'T KNOW WHEN THE NEXT TIME WILL BE AND I DON'T WANT ANYONE TO GET HURT FROM IT. *TR",
        "vin": "KMHDU46D87U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/22/2008",
        "dateOfIncident": "10/16/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10246323,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "ONE OF MY ELANTRA'S STARTED SHAKING REALLY BAD TO THE POINT THAT I COULDN'T DRIVE.  I BROUGHT IT INTO THE CLOSEST SHOP.  THEY TOLD ME THAT THE ALIGNMENT WAS WAY OFF SPEC.  THEY ORDERED THE PROPER PARTS AND WERE ABLE TO PUT THE FRONT ALIGNMENT IN SPEC.  THEN THEY TOLD ME THAT THE BAD COULD NOT BE FIXED, THEY ARE NON-ADJUSTABLE STRUTS.  I THEN TOOK IT TO THE DEALER WHICH HAS NOW TOLD ME THE SAME THING.  THE CAR IS 1 YEARS OLD AND CANNOT BE FIXED.  I CONTACTED HYUNDAI CORPORATE AND THEY ARE SENDING A REP TO CHECK OUT THE SITUATION.  UPON RESEARCHING THIS PROBLEM I FOUND THAT THERE WERE OTHER ELANTRA OWNERS OUT THERE WITH THIS SAME PROBLEM.  MY MECHANIC BELIEVES THAT THIS HAS TO DO WITH THE CAR NOT BEING BUILT TO HOLD EVEN THE MAXIMUM WEIGHT CAPACITY.  I AM ALSO CONCERNED BECAUSE I HAVE ANOTHER OF THE SAME CAR.  *TR",
        "vin": "KMHDU46D67U"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "10/09/2008",
        "dateOfIncident": "10/08/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10245001,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "PASS SEAT BELT STICKS. PASSENGER SIDE SEAT BELT WOULD NOT UNLATCH SO I TOOK THE VEHICLE TO A HYUNDAI DEALER THEY JERKED ON SEATBELT IT AND IT UNLATCHED, THEN STATED THEY COULD DO NOTHING ELSE.  THIS BELT JUST UNLATCHES WHEN YOU PULL IT. *TR",
        "vin": "KMHDU46D07U"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "09/30/2008",
        "dateOfIncident": "09/27/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10243968,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2007 HYUNDAI ELANTRA. I'VE HAD 35 YEARS OF DRIVING EXPERIENCE. I WAS DRIVING ON THE 60 FREEWAY ON SATURDAY, SEPT 27. AS I WENT TO CHANGE LANES, THE CAR STARTED TO SWERVE LEFT AND RIGHT, AS IF IT WAS LOSING CONTROL SOMEHOW. I TRIED TO CONTROL IT AS BEST AS I COULD, BUT MY EFFORTS WERE FUTILE. I HAD SWERVED NEARLY 6 LANES AND CRASHED INTO THE CENTER DIVIDER. THANKFULLY, NOBODY WAS INJURED. IT IS HIGHLY LIKELY THAT THERE WAS A SERIOUS PROBLEM WITH THE STEERING AND BRAKE SYSTEMS, POSSIBLY A DEFECT IN THE CAR. THE CAR IS CURRENTLY TOTALED.",
        "vin": "KMHDU46DX7U"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES, ELECTRIC",
        "crash": false,
        "dateComplaintFiled": "09/12/2008",
        "dateOfIncident": "09/11/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10241946,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "OWN A 2007 HYUNDAI ELANTRA. LAST YEAR I HAD TO TAKE IT TO THE DEALER AFTER THE SHIFT GEAR LOCKED ON ME IN THE DRIVE POSITION. I WAS UNABLE TO MOVE THE SHIFT TO THE PARKED POSITION HAD TO USE A SCREW DRIVER TO MANUALLY RELEASE THE GEAR AND SHIFTED TO PARK. I DROVE MY CAR HOME THAT DAY THE NEXT DAY I USED A SCREW DRIVER AGAIN AND SHIFTED TO DRIVE AND DROVE THE CAR TO THE DEALER. ON THE WAY TO THE DEALER OTHER DRIVER ON THE ROAD BLEW THEIR HORNS ALERTED ME THAT I HAD NO BRAKE LIGHTS. EVENTHOUGH MY HEAD LIGHTS AND REAR LIGHTS WERE ON. I  PULLED OVER AND SURE ENOUGH THE BRAKE LIGHTS WERE NOT WORKING. I AGAIN WENT THROUGH THE MOTIONS WITH THE SHIFTER AND MANAGE TO DRIVE THE CAR TO THE DEALER WITH THE EMERGENCY FLASHERS ON. AT THE DEALER THEY TOLD ME THAT THE BRAKE SWITCH THAT OPERATED THE BRAKE LIGHTS AND SHIFT GEAR BURNT OUT AND WAS REPLACED.  I EXPRESSED THE SERIOUSNESS OF THE SITUATION, DRIVING AROUND WITH NO BRAKE LIGHTS AND THE DEALER JUST BRUSHED IT OFF AND TOLD ME THAT I WOULD NOT HAVE THE PROBLEM AGAIN. WELL YESTERDAY (9/11/08) IT HAPPENED TO ME AGAIN ON MY WAY TO MY JOB IN JERSEY CITY NEW JERSEY. THE SHIFTER LOCKED IN THE DRIVE POSITION AND THE BRAKE LIGHTS WERE OUT AGAIN. AGAIN I HAD TO MANUALLY SHIFT THE GEAR TO PARK THEN BACK TO DRIVE IN ORDER TO DRIVE TO MY JOB A FEW MINUTES AWAY FROM THE INCIDENT. AT 11PM I DROVE FROM MY JOB TO  MY HOME, WITHOUT BRAKE LIGHTS. THIS MORNING I DROVE MY CAR UNDER THE SAME CONDITIONS TO THE HYUNDAI  IN NORTH PLAINFIELD, NEW JERSEY TO GET THE CAR REPAIRED. AGAIN I EXPRESSED THE SERIOUSNESS OF THIS SITUATION HOW IT COULD CAUSE A SERIOUS ACCIDENT. THE DEALER AGAIN INDICATED THAT THE PROBLEM WAS CAUSED BY A FAULTY BRAKE SWITCH, THEY CHANGED THE SWITCH AND TOLD ME THAT THE PROBLEM WAS REPAIRED THAT I SHOULD NOT EXPERIENCE IT AGAIN. I AM REPORTING THIS TO YOUR AGENCY BECAUSE THIS IS A LIFE THREATENING SITUATION HAVING NO BRAKE LIGHTS AND SHIFTER LOCKING INTO PLACE WITHOUT ANY WARNING. I FEEL THE CAR SHOULD BE RECALLED.  *TR",
        "vin": "KMHDU46D97U"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/13/2008",
        "dateOfIncident": "08/13/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10238085,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "HYUNDAI ELANTRA 2007 STALLS INTERMITTENTLY WHILE DRIVING AND AT A STOP. ONCE IT HAPPENS THE CAR STALLS EACH TIME PUT INTO DRIVE (FROM PARK OR NEUTRAL). SEEMS TO OCCUR MORE SO AFTER GASOLINE FILL-UP. DEALER HAS BEEN UNABLE TO DETERMINE THE PROBLEM OR REPAIR.*TR",
        "vin": "KMHDU46D57U"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/24/2008",
        "dateOfIncident": "06/16/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10235628,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "2007 HYUNDAI ELANTRA - I RECENTLY SAW ON THE NATIONAL NEWS THAT THERE IS CONCERNS ABOUT THE SAFETY OF THE 2007 - 2008 ELANTRA DUE TO POSSIBLE FUEL PUMP STALLING IN TRAFFIC.   I WANT TO REPORT THE SAME THING HAPPENED TO US ABOUT 60 DAYS AFTER PURCHASING THE AUTOMOBILE.   MY WIFE WAS NEARLY CREAMED ON THE INTERSTATE BY A SEMI-TRUCK WHEN THE VEHICLE JUST DIED.   *TR",
        "vin": "KMHDU46D47U"
    },
    {
        "components": "SEATS",
        "crash": true,
        "dateComplaintFiled": "05/22/2008",
        "dateOfIncident": "11/08/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10228658,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS INVOLVED IN A COLLISION ON I35 IN SALEDO, TX IN NOVEMBER 2007.  I WAS IN THE RIGHT LANE BEHIND A SEMI.  I SWITCHED LANES (INTO THE LEFT) TO PASS THE SEMI WHEN I SAW A SEMI TIRE IN MY LANE.  I HAD NO TIME TO REACT.  THERE WAS A RETAINING WALL WITH NO SHOULDER ON MY LEFT AND A SEMI ON RIGHT - I HAD NO CHOICE BUT TO HIT THE TIRE.  I WAS THROWN INTO THE RETAINING WALL WHERE THE FRONT END OF MY CAR STRUCK THE CONCRETE BARRIER.  MY CAR CONTINUED TO SPIN, HITTING FRONT TO BACK, 3-4 MORE TIMES.  DURING THE IMPACTS MY DRIVER'S SEAT BROKE (STUCK IN A RECLINED POSITION), WHICH RESULTED IN MY INJURY (L1 BURST FRACTURE).  I WAS TAKEN IN AN AMBULANCE TO SCOTT & WHITE HOSPITAL WHERE I UNDERWENT EXTENSIVE SURGERY, AND A THREE WEEK STAY (MY FAMILY AND I LIVE IN FORNEY, TX).  SINCE THAT TIME I HAVE BEEN UNABLE TO WORK AND AM CONTINUALLY SUFFERING COMPLICATIONS FROM THE BURST FRACTURE.  HAD MY SEAT NOT BROKEN, I WOULD NOT BE IN THIS SITUATION.  *TR",
        "vin": "KMHDU46D87U"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/22/2008",
        "dateOfIncident": "04/22/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10225414,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE IN-DASH FRONT-PANEL CONSOLE PIECES MAKE VERY IRRITATING SQUEAKY NOISES WHEN DRIVING OVER EVEN LITTLE BUMPS DISTRACTING THE DRIVER FROM NORMAL DRIVING EXPERIENCE.  *TR",
        "vin": "KMHDU46D47U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/01/2008",
        "dateOfIncident": "02/01/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10223075,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 HYUNDAI ELANTRA.  THE CONTACT TOOK HIS VEHICLE TO THE DEALER BECAUSE THE SPEEDOMETER DISPLAYED INACCURATE READINGS.  THE FAILURE WAS NOTICED WHILE DRIVING 40 MPH.  THE DEALER RESET THE COMPUTER SYSTEM, BUT THE FAILURE CONTINUED.  THE DEALER AND MANUFACTURER STATED THAT THE SPEEDOMETER WAS WORKING PROPERLY.  THE POWERTRAIN WAS UNKNOWN.  THE CURRENT MILEAGE WAS 11,000 AND FAILURE MILEAGE WAS 8,654.   UPDATED 05/19/08 *BF  UPDATED 05/20/08",
        "vin": "KMHDU46D17U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/04/2007",
        "dateOfIncident": "03/05/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10201864,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "SHORTLY AFTER DELIVERY OF THE VEHICLE, I NOTICED A SPEEDOMETER ERROR OF 5-7 MPH.  I TESTED THIS WITH TWO DIFFERENT RADAR GUNS AND BROUGHT IT TO THE DEALERS ATTENTION.  DEALER VERIFIED ERROR AND CONTACTED TECH LINE.  TECH LINE SAID THIS WAS NORMAL.  THIS IS NOT NORMAL AND NO PARTS WERE REPLACED PER HYUNDAI TECH LINE'S FINDINGS.  PROBLEM IS ONGOING AND CONTINUOUS.  *JB",
        "vin": "KMHDU46D77U"
    },
    {
        "components": "ELECTRICAL SYSTEM,BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "08/23/2007",
        "dateOfIncident": "08/12/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10200547,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "ALARM SYSTEM GOES OFF UNDER ALL WEATHER CONDITIONS, TIMES OF DAY OR NIGHT, UNDER ANY CIRCUMSTANCES.  *TR",
        "vin": "11111111111"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "07/23/2007",
        "dateOfIncident": "07/03/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10197228,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT HAD A 2007 HYUNDAI ELANTRA RENTAL.  WHILE PULLING INTO A PARKING SPACE, THE VEHICLE ACCELERATED ON ITS OWN.  THE CONTACT CRASHED INTO A POLE AND TWO OTHER VEHICLES.  A POLICE REPORT WAS FILED.  THE VEHICLE WAS TOWED AND IS NOW IN THE POSSESSION OF AVIS CAR RENTAL.  THE CURRENT AND FAILURE MILEAGES WERE 20,000.   UPDATED 08/14/07. *JB",
        "vin": "KMHDU46D47U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/23/2007",
        "dateOfIncident": "01/27/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10197279,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2007 HUNDAI ELANTRA IN JANUARY 2007. MY DAUGHTER ALSO PURCHASED THE SAME VEHICLE. WE BOTH NOTICED THAT WHEN DRIVING THE SPEED LIMIT EVERYTHING ON THE ROAD WOULD PASS US. I TIMED MYSELF ON A MEASURED MILE AT 60 MPH AND DISCOVERED  I WAS DOING 55 MPH. I STARTED RESEARCHING THE INTERNET AND DISCOVERED IT IS A COMMON PROBLEM. HUNDAI HAS REPLACED SOME SPEEDOMETERS BUT APPARENTLY IT DOES NOT CORRECT THE PROBLEM. IT HAS OCCURRED TO ME THAT THIS WOULD ALSO GIVE YOU A  BETTER MPG INDICATION THAN YOU ARE ACTUALLY GETTING. HAVE YOU RECEIVED ANY OTHER COMPLAINTS ABOUT THIS AND WHAT IS THOUGHTS. MY DEALER HAD NOT HEARD ABOUT THIS PROBLEM.  *JB",
        "vin": "KMHDU46D47U"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/23/2007",
        "dateOfIncident": "07/21/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10197281,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I WOULD LIKE TO FILE A COMPLAINT AGAINST HYUNDAI.  I WAS RECENTLY INVOLVED IN AN ACCIDENT IN A 07' HYUNDAI ELANTRA IN WHICH I WAS HIT BY ANOTHER VEHICLE ON THE DRIVER'S SIDE.  THE POSTED SPEED LIMIT WAS 45 MPH AND I'M SURE THAT THE DRIVER WAS GOING AT LEAST THAT SPEED IF NOT FASTER.  THE CRASH SMASHED THE DRIVER DOOR, A PORTION OF THE BACK SEAT DOOR AS WELL AS DISLODGING PART OF THE FRONT BUMPER.  MY FRONT TIRE WAS ALSO FLAT AND BENT OUT OF SHAPE.  I WAS UNABLE TO OPEN THE DRIVER-SIDE DOOR SO I HAD TO CRAWL OUT THE PASSENGER SIDE.  WHEN I WAS HIT, I FELT AS IF I WAS ABOUT TO PASS OUT.  MY VISION WAS BLACK AND FUZZY AND I FELT LIGHT-HEADED.  I ENDED UP HAVING A LARGE BUMP ON MY HEAD, BRUISES ON MY SHOULDER AS WELL AS A BRUISE ON MY KNEE.  I AM VERY UPSET THAT THE AIRBAGS DIDN'T DEPLOY BECAUSE HAD THE DRIVER BEEN GOING A LITTLE BIT FASTER OR HAD I BEEN IN A MORE SERIOUS ACCIDENT  I COULD HAVE BEEN SERIOUSLY INJURED IF NOT KILLED.  ONE OF THE REASONS I PURCHASED THE CAR WAS BECAUSE OF ITS SO CALLED 5 STAR SAFETY RATING.  HAD I KNOWN HYUNDAI HAD A PROBLEM WITH THEIR AIRBAGS I NEVER WOULD HAVE PURCHASED THE VEHICLE. I ALSO NOTICED ANOTHER COMPLAINT ON THIS CAR FOR THE SAME REASON.  I FEEL THAT HYUNDAI SHOULD MAKE A STATEMENT ABOUT THE DISFUNCTIONAL AIRBAGS IF NOT RECALL THE VEHICLE ALTOGETHER.  FURTHERMORE I BELIEVE THEY NEED TO STOP ADVERTISING THE SAFETY FEATURES OF THE CAR UNTIL THE PROBLEMS ARE FIXED.  I WOULD BE VERY INTERESTED IN KNOWING WHAT MY LEGAL OPTIONS ARE.  *JB",
        "vin": ""
    },
    {
        "components": "SUSPENSION,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/13/2007",
        "dateOfIncident": "12/12/2006",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10196316,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 HYUNDAI ELANTRA.  WHILE DRIVING 60 MPH OR GREATER, THE REAR OF THE VEHICLE SWAYED FROM LEFT TO RIGHT.  THE FAILURE WAS PREVALENT WHEN THERE WAS EXTRA WEIGHT IN THE VEHICLE.  THE DEALER STATED THAT THE EXTRA WEIGHT CHANGED THE REAR ALIGNMENT AND CAUSED THE VEHICLE TO SWAY.  THE DEALER ATTEMPTED TO ALIGN THE REAR OF THE VEHICLE ON FOUR DIFFERENT OCCASIONS, BUT WAS UNABLE TO CORRECT THE FAILURE.  THE CURRENT MILEAGE IS 8,252 AND FAILURE MILEAGE WAS 2,783.  THE CONSUMER STATED THE DEFECT IS DUE TO UNEQUAL CAMBER AND TOE SETTINGS IS WHAT THE CONSUMER WAS INFORMED BY THE HYUNDAI DEALERSHIP. SPECIALTY PARTS COMPANY ENGINEERS SUGGESTED REPLACING UPPER CONTROL ARMS THAT THE DEFECT WAS DUE TO POOR SUSPENSION. THE CONSUMER PROVIDED NUMEROUS REPAIR INVOICES AND PICTURES FOR THE VEHICLE. UPDATED 08/13/07  *TR",
        "vin": "KMHDU46D87U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/06/2007",
        "dateOfIncident": "07/06/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10195876,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 HYUNDAI ELANTRA.  THE DEALER TESTED THE VEHICLE AND CONFIRMED THAT THE SPEEDOMETER IS INACCURATE BY 5 MILES.  THE TEST WAS PERFORMED WHILE DRIVING 60 MPH.  THE CONTACT MUST CONTINUOUSLY MONITOR THE SPEEDOMETER AND SUBTRACT THE MILEAGE ACCORDINGLY.  THE CONTACT IS AWARE OF THE SAFETY RISK INVOLVED WHILE DRIVING.  THE MANUFACTURER DISAGREES WITH THE DEALER AND STATED THAT THE VEHICLE SHOULD NOT BE REPAIRED, EVEN THOUGH IT IS STILL UNDER WARRANTY.  THE CONTACT FILED CASE # 272638 WITH THE LOCAL MANUFACTURER AND CASE # 1062516 WITH THE CORPORATE OFFICE.  THE VIN WAS UNKNOWN.  THE CURRENT MILEAGE IS 2,575 AND FAILURE MILEAGE WAS 5.",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/27/2007",
        "dateOfIncident": "06/26/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10194723,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR CAMBER GOES OUT OF FACTORY SPECIFICATION WITH LOADS 75 POUNDS AND OVER CAUSING UNSTABILITY IN THE REAR END CAUSING THE REAR OF THE CAR TO OVER REACT WHEN STEERING THE CAR.",
        "vin": "KMHDU46D87U"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/18/2007",
        "dateOfIncident": "06/18/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10193670,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "DEAR  REPRESENTATIVE    I PURCHASED THE 2007 HYUNDAI ELANTRA GS FOR MY SON IN DECEMBER DUE TO IT'S MARKET SAFETY RATINGS. I WAS ENSURED BY THE SALES TEAMS AND REPORTS THAT THIS CAR WAS SAFE.  THIS MORNING MY SON WAS IN A BAD ACCIDENT, AND THE AIRBAGS DID NOT DEPLOY.  THE CAR REAR SIDE WINDOW WAS CRUSHED, THE TOP OF CAR WAS PUSHED INWARD AND PINNED UNDER A PIPE FENCE, THE DRIVER SIDE WHERE THE GAS TANK WAS LOCATED WAS SMASHED TO THE POINT THAT COMPONENTS MELTED TOGETHER. ALSO, THERE WAS MAJOR DAMAGE TO THE TIRES/RIM, SIDE ,AND FRONT OF THE CAR. BUMPERS IN THE FRONT AND BACK WERE DISLODGED AND SHREDDED IN SOME AREAS.  THIS \\WAS  NOT ACCEPTABLE TO SELL CARS THAT AIR BAGS DID  NOT DEPLOY WITH THE AMOUNT OF DAMAGE SUSTAINED.  I WISH TO FILE AN OFFICIAL COMPLAINT AGAINST HYUNDAI.  I WOULD LIKE TO KNOW WHAT OUTSIDE ORGANIZATION'S COULD  I REGISTER THE COMPLAINT WITH.  HYUNDAI COULD HAVE COST MY SON HIS LIFE TO MAKE A QUICK BUCK.*AK",
        "vin": "KMHDU46D67U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/12/2007",
        "dateOfIncident": "05/22/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10193024,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL-CONATCT OWNS 2007 HYUNDAI ELANTRA. CURRENT MILEAGE IS 1400. FAILURE MILEAGE 200. WHILE DRIVING,HIS GPS SHOWED HIS SPEEDOMETER WAS OFF. DEALER SAID THEY ARE AWARE OF PROBLEM BUT ARE UNAWARE TO FIX IT. THEY DO NOT KNOW WHEN THEY WILL BE ABLE TO FIX IT-WAS TOLD TO CHECKK WITH THEM PREIODICALLY. WEATHER WAS PROBABLY RAINY.  ENGINE/CYLINDER INFORMATION UNAVAILABLE. KTF",
        "vin": "KMHDU46D57U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/08/2007",
        "dateOfIncident": "06/07/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10192730,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "ALIGNMENT ON MY VEHICLE (2007 HYUNDAI ELANTRA SE) IS NOT ADJUSTED PROPERLY, AND CANNOT BE ADJUSTED PROPERLY. VEHICLE IS UNSAFE TO DRIVE ON THE HIGHWAY. REAR END GOES SIDEWAYS BECAUSE CAMBER SETTINGS ARE CREATING OVERSTEER SITUATION.",
        "vin": "KMHDU46D87U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/03/2007",
        "dateOfIncident": "03/29/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10186918,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "SPEEDOMETER/ODOMETER READ HIGHER BY 5-8% THAN ACTUAL TESTING. HYUNDAI REPLACED INSTRUMENT CLUSTER. VEHICLE STILL READS HIGH. HYUNDAI WILL NOT DO ANYMORE CITING THAT READING IS WITHIN SPECIFICATIONS.  *JB",
        "vin": "KMHDU46D17U"
    }
]