[
    {
        "components": "SUSPENSION,STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/22/2021",
        "dateOfIncident": "08/07/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437795,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I took my vehicle for a state inspection as I had just purchased it was explained to me as a body rust only no frame rust vehicle. Upon inspection the mechanic showed me that the frame was rushed out completely at the rear end subframe inboard mounts. The gas tank strap mount was missing and held in with a nylon strap. Most of the secondary subframe is nonexistent and frame at radiator core support is diminished.",
        "vin": "2HJYK162X7H"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "05/03/2021",
        "dateOfIncident": "04/19/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414973,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HONDA RIDGELINE. THE CONTACT STATED WHILE STATIONARY, ALL FOUR DOORS FAILED TO UNLOCK AS NEEDED. THE VEHICLE WAS NOT TAKEN TO A DEALER NOR INDEPENDENT MECHANIC. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS INFORMED OF THE FAILURE AND SUGGESTED THAT THE VEHICLE BE TAKEN TO AN AUTHORIZED DEALER FOR SERVICE. THE FAILURE MILEAGE WAS APPROXIMATELY 204,711.",
        "vin": "2HJYK16557H"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/12/2020",
        "dateOfIncident": "08/01/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348738,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE DEVELOPED A SUDDEN MISFIRE IN #4 CYLINDER FOR ABOUT 20 SECONDS, THEN CLEARED. SUBSEQUENTLY, HAD LARGE WHITE CLOUDS OF COOLANT AND BURNED OIL COMING FROM TAILPIPE WHILE DRIVING ON CITY STREETS.  AFTER TURNING ENGINE OFF AND LETTING IT COOL, NOTICED COOLANT LEVEL LOW IN RESERVOIR, LOW OIL LEVEL ON DIPSTICK. LOW COMPRESSION ON #4 CYL. AND BURNED OIL ON #4 SPARK PLUG. IF ALLOWED TO CONTINUE RUNNING, COOLANT WOULD BE CONSUMED, RESULTING IN OVERHEATING AND ENGINE SEIZING WHILE DRIVING.",
        "vin": "2HJYK16587H"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/26/2019",
        "dateOfIncident": "08/02/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11246570,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE I WAS DRIVING MY 2007 HONDA RIDGELINE THE SUPPORT WHICH CRADLES THE FUEL TANK BROKE APART FROM THE REAR PART OF THE FRAME (BY THE SUSPENSION, JUST TO THE INSIDE OF THE REAR LEFT WHEEL) AND WAS DRAGGING ON THE ROAD. I WAS ABLE TO DRIVE THE VEHICLE TO MY MECHANIC (1 MILE AWAY).  WHEN THIS OCCURRED, I WAS DRIVING ON A PAVED ROAD WITH A 35-MPH SPEED LIMIT. MY MECHANIC PUT THE VEHICLE ON A LIFT AND SHOWED ME THE DAMAGE.  THE REAR PART OF THE FRAME RUSTED/CORRODED TO THE POINT WHERE IT IS BARELY IN ONE PIECE.  THE VEHICLE IS NOT ABLE TO BE REPAIRED AND MY MECHANIC WOULD NOT ALLOW ME TO DRIVE THE VEHICLE HOME (2 MILES) BECAUSE HE WAS CONCERNED THAT THE REAR PART OF THE FRAME WOULD COMPLETELY BREAK, WHICH WOULD CAUSE THE REAR SUSPENSION TO COLLAPSE.  HE WAS ALSO CONCERNED THAT THE FUEL TANK MIGHT FALL OF THE VEHICLE.    I WOULD NOT EXPECT ANY VEHICLE, ESPECIALLY NOT A HONDA, TO FALL APART LIKE THIS AFTER ONLY TWELVE OR THIRTEEN YEARS.  THE VEHICLE ONLY HAD ABOUT 136,000 MILES ON THE ODOMETER.  THE VEHICLE HAS A CLEAN TITLE AND THE CARFAX DOES NOT SHOW ANY FLOOD HISTORY.    I'VE ATTACHED TWO PICTURES.",
        "vin": "2HJYK16497H"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/15/2019",
        "dateOfIncident": "07/15/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11232092,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM A DISABLED VETERAN AND I NEED SOME HELP. MY A/C FAN STOPPED WORKING! IT IS 120*F INSIDE MY VEHICLE!!! THE THERMOSTAT HAS BEEN A BIT TOUCHY FOR A FEW MONTHS, BUT IT NEVER CEASED TO FUNCTION. NOW IT HAS AND ITS BLAZING HOT!!!  MY DAUGHTER STARTED THE CAR AND THE A/C FAILED TO TURN ON. NO A/C AND IT IS 90*F IN THE SHADE. I TOOK MY VEHICLE IN FOR A RECALL A FEW YEARS AGO THAT REFERENCED THE FAN MOTOR HARNESS AND MOISTURE OF SOME SORT. THIS IS A TERRRIBLE DEVELOPMENT!",
        "vin": "2HJYK16257H"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/12/2019",
        "dateOfIncident": "07/11/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11231338,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "OIL CONSUMPTION - HAPPENS WHEN ENGINE IS RUNNING - CONSUMES ~1QT EVERY 2,000 MILES",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/09/2019",
        "dateOfIncident": "07/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11230549,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE A 2007 RIDGELINE. TWICE BEFORE WE HAVE EXPERIENCED THE THIRD BRAKE LIGHT PANEL RIPPING OFF ENTIRELY UNDER HIGHER SPEEDS.  IT HAPPENED BOTH TIMES WHEN WE WERE TRAVELING 65 MPH ON THE EXPRESSWAY.  THANKFULLY NO ONE WAS HURT AND BOTH TIMES THE DEALERSHIP REPAIRED THE ISSUE AT NO EXPENSE TO US.  UNFORTUNATELY WE ARE NOW AGAIN EXPERIENCING ISSUES WITH THE THIRD BRAKE LIGHT PANEL WHEREAS WE ARE HEARING WHISTLING NOISES AND THUMPING SOUNDS IF WE GO OVER 60 MPH.  THE PARTS ARE STILL IN PLACE AND I'M TRYING TO BE PROACTIVE TO GET THE PART FIXED BEFORE IT RIPS OFF AGAIN.  I HAVE CONTACTED BOTH THE DEALERSHIP WHERE WE PURCHASED THE VEHICLE AND AMERICAN HONDA CUSTOMER SERVICE, BUT NEITHER PARTY IS TAKING RESPONSIBILITY AND WE ARE TOLD WE WOULD HAVE TO HAVE IT REPAIRED AT OUR OWN EXPENSE.  I EVEN BROUGHT TO THEIR ATTENTION THAT NOT ONLY IS IT THE THIRD TIME IT HAS HAPPENED TO US, THERE ARE NUMEROUS ON-LINE REPORTS OF PEOPLE EXPERIENCING THE SAME ISSUE.  AND SOME HAVE REPORTED HAVING THE SAME PROBLEM MULTIPLE TIMES.  HERE ARE LINKS TO A COUPLE ON-LINE REPORTS:  HTTP://WWW.CARPROBLEMZOO.COM/HONDA/RIDGELINE/BODY-PROBLEMS.PHP  HTTPS://WWW.RIDGELINEOWNERSCLUB.COM/THREADS/THIRD-BRAKE-LIGHT-PANEL-FELL-OFF.36990/#POST-530200  HTTPS://WWW.RIDGELINEOWNERSCLUB.COM/THREADS/3RD-BRAKE-LIGHT-BODY-PANEL-BLEW-OFF.27241/#POST-387981  HTTPS://WWW.RIDGELINEOWNERSCLUB.COM/THREADS/WIND-NOISE-WHISTLING.30811/PAGE-4#POST-522368  HTTPS://WWW.RIDGELINEOWNERSCLUB.COM/THREADS/ROOF-BRAKE-LIGHT-ASSEMBLY-BLOWING-OFF.41175/#POST-591377  THIS IS THE ON-LINE RESEARCH I HAVE DONE IN JUST A SHORT TIME THIS AFTERNOON.  I'M SURE THAT DEEP, THOROUGH INVESTIGATION WOULD REVEAL THAT THIS IS A LEGITIMATE SAFETY ISSUE FOR WHICH A RECALL IS WARRANTED.",
        "vin": "2HJYK165X7H"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/15/2019",
        "dateOfIncident": "12/15/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11187180,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MY RADIATOR FAILED IN A FASHION IN WHICH THE RADIATOR FLUID MIXED WITH THE TRANSMISSION FLUID, DESTROYING MY TRANSMISSION. I WAS DRIVING MY 2007 HONDA RIDGELINE ON A MAIN ROAD IN VA WHEN THE TRANSMISSION FAILED CAUSING ME. THE FAILURE OF THE TRANSMISSION WAS CAUSED BY THE RADIATOR FAILING AND SUBSEQUENTLY MIXING COOLANT WITH THE TRANSMISSION FLUID. THIS MIX OF FLUIDS DESTROYED THE TRANSMISSION AND RADIATOR. I DID NOT WANT TO BUY A NEW CAR, SO I HAD A LOCAL SHOP INSTALL A USED TRANSMISSION AND RADIATOR AT THE COST OF ABOUT $4K. THIS APPEARS TO BE A COMMON PROBLEM WITH HONDA RIDGELINES AND MAY BE ASSOCIATED WITH THE FACT THAT THE TRANSMISSION LINE BOLTS LEADING TO THE RADIATOR ARE COMPRISED OF DISSIMILAR METALS CAUSING CORROSION AND A DANGEROUS TRANSMISSION FAILURE WHILE THE VEHICLE IS IN MOTION. I ATTEMPTED TO CONTACT HONDA OF AMERICA ASKING FOR ASSISTANCE IN THE REPAIR BECAUSE A HONDA SHOULD LAST AT LEAST 250K MILES WITHOUT PREMATURE CATASTROPHIC FAILURE. HONDA REPLIED BY MAKING ME AWARE OF THE WARRANTY AND THAT THERE WAS NOTHING THEY COULD DO BECAUSE THE VEHICLE WAS OUT OF WARRANTY. THIS IS CLEARLY A SAFETY ISSUE, AND SHOULD BE INVESTIGATED IMMEDIATELY BECAUSE IT IS A WELL KNOWN SCENARIO AS CITED ON RIDGELINE ENTHUSIAST WEBSITES. I HAVE BEEN A HONDA ENTHUSIAST AND OWNED 6 HONDAS SINCE 1991, AND I HAVE ALWAYS HAD GOOD LUCK WITH THESE VEHICLES, BUT THIS SCENARIO IS CERTAINLY AN EXCEPTION AND WILL EVENTUALLY LEAD TO SERIOUS INJURY.",
        "vin": "2HJK16537H5"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/14/2019",
        "dateOfIncident": "11/08/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11180101,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HONDA RIDGELINE. THE CONTACT STATED THAT THE VEHICLE WAS REPAIRED PER NHTSA CAMPAIGN NUMBER: 10V001000 (ELECTRICAL SYSTEM). THE CONTACT WAS CONCERNED THAT THE REPAIR CAUSED THE VEHICLE STABILIZATION MOTOR TO FAIL. ADDITIONALLY, THE TIRE PRESSURE MONITORING SYSTEM WARNING INDICATOR ILLUMINATED. THE CONTACT STATED THAT THE INCORRECT WIRING HARNESS WAS INSTALLED IN THE VEHICLE WHILE REPLACING THE BLOWER MOTOR. THE CONTACT STATED THAT THE HEATER WAS ALSO INOPERABLE. THE VEHICLE WAS TAKEN TO RIVERSIDE AUTO MALL (LOCATED AT 2025 US-41, MARQUETTE, MI 49855, (906) 228-4900) WHERE IT WAS DETERMINED THAT THE VEHICLE OPERATED AS INTENDED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 118,166.",
        "vin": "2HJYK16267H"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/12/2019",
        "dateOfIncident": "12/15/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11166617,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I BOUGHT THE HONDA RIDGELINE I FOUND THE TRANSMISSION LINE AN COOLANT LINE BROKE INSIDE RADIATOR CAUSING ISSUES AND HAVING TO REPLACE LINES AN RADIATOR ALONG WITH TRANNY FLUSH.  NOW THE TRANSMISSION SHIFTS HARD INTO FOURTH SHAKING THE TRUCK EVERY TIME TOUCHING THE GAS AROUND 60MPH AND SOMETIMES NORMAL CITY DRIVING.  ALDO THE BRAKES ARE SOFT AND SPONGY AND HAS TO BE PUT ALMOST TO THE FLOOR TO START STOPPING.  I LIKE HUNDREDS OF OTHER RIDGELINE OWNERS DON'T UNDERSTAND WHY HONDA DOESN'T FIX THESE ISSUES THAT BASICALLY ALL RIDGELINES HAVE.  ALSO WHOEVER THE IDIOT WAS THAT DECIDED TO PUT A 4SPEED TRANSMISSION IN THE TRUCK SHOULD BE BEATEN AN FIRED!    HONDA NEEDS TO STOP RIPPING PEOPLE OFF,  YOU KNOW YOUR SCREWING PEOPLE OVER CHARGING A LOT FOR WHAT HAPPENS TO BE CRAP.   IT WOULD BE A GREAT TRUCK IF WASN'T MADE SO CHEAPLY AN SLAPPED TOGETHER WITH GARBAGE PARTS.",
        "vin": "2HJYK16297H"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/30/2018",
        "dateOfIncident": "09/20/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11144223,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ISSUE SEEMS TO OCCUR RANDOMLY. WHEN IT OCCURS THE CHECK ENGINE LIGHT, VTM4 LIGHT, VSA LIGHT AND A FEW OTHER WARNING LIGHTS LIGHT UP ON THE INSTRUMENT PANEL. WHEN THIS OCCURS THE TRUCK WILL SLOW DOWN GRADUALLY WITH NO RESPONSE FROM THE ACCELERATE PEDAL. I HAVE TO PULL TO THE SIDE OF THE ROAD TURN OFF THE TRUCK OR LET VEHICLE COST AND IT WILL EVENTUALLY KICK IN. I HAVE SAFETY CONCERNS WITH THIS HAPPENING AT UNKOWING TIMES WHICH CAN EITHER POSSIBLY CAUSE ME TO WRECK OR SOMEONE TO HIT ME FROM BEHIND BECAUSE THE VEHICLE JIST WONT MOVE I JAVE TO COAST IT TO THE SIDE OF THE ROAD.",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/24/2018",
        "dateOfIncident": "09/07/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11130882,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS NO KNOWN WAY TO OPEN THE IN BED TRUNK. I'VE TAKEN THE TRUCK TO THE DEALER AND CONTACTED HONDA AND NEITHER HAVE AN ANSWER. IF SOMETHING IN THE TRUNK PREVENTS THE TRUNK FROM OPENING, THE OWNER NEEDS TO DESTROY THE TRUNK TO OPEN IT. WHAT IF A CHILD WAS STUCK IN THE TRUNK AND COULDN'T FIND THE RELEASE? I DID FIND A WAY TO OPEN THE TRUNK BY CUTTING A 4\"X4\" WHOLE. HONDA OFFER NO HELP WHAT'S SO EVER. (THE VEHICLE WAS STATIONARY)",
        "vin": "2HJYK16437H"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/02/2018",
        "dateOfIncident": "07/02/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11105110,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "IGNITION KEY DOES NOT GO IN ALL THE WAY IN THE IGNITION AND WILL NOT TURN",
        "vin": "2HJYK16538H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/05/2018",
        "dateOfIncident": "09/07/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11076191,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "\"TAKATA RECALL\"  RECEIVED RECALL NOTICE FROM HONDA IN REGARD TO DEFECTIVE AIR BAGS, BOTH BAGS HAVE BEEN ALREADY REPLACED BY HONDA.",
        "vin": "2HJYK16597H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/04/2018",
        "dateOfIncident": "12/30/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11058465,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING HOME ON A SECONDARY ROAD, OUR RIDGELINE LOST POWER AND WOULD NOT ENGAGE THE TRANSITION.  I COASTED TO THE SHOULDER AND FOUND IT WOULDN'T GO IN FORWARD OR REVERSE. WE HAD IT TOWED TO OUR FAMILY MECHANIC WHO STATED THAT THE TRANSMISSION AND COOLANT LINES BLED TOGETHER WITHIN THE RADIATOR, AND IT CAN BE SEEN IN THE COOLANT RESERVOIR, AND RAN THE TRANSMISSION DRY.  THE END RESULT IS THE NEED FOR A TRANSMISSION FLUSH, A NEW RADIATOR, AND NEW TRANSMISSION. THEY CANNOT GUARANTEE THAT THE NEW RADIATOR WON'T FAIL IN THE SAME MANNER AS THE OLD ONE.  THE VEHICLE IS CURRENTLY IN THE SHOP WITH AN EXPECTED COST TO EXCEED $4000. ON A VEHICLE WITH 125K MILES. THE EXACT SAME ISSUE HAPPENED TO MY NEIGHBORS RIDGELINE AS WELL.",
        "vin": "2HJYK16447H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/05/2017",
        "dateOfIncident": "12/04/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11052624,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL I WAS NOTIFIED OF CLASS ACTION SUIT INVOLVING TAKATA AIR BAG INFLAOR NOT WORKING PROPERLY",
        "vin": "2HJYK16267H"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/18/2017",
        "dateOfIncident": "09/04/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11024016,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SPARK PLUG EJECTED, W/ COIL BLOW OUT WHILE ON THE HIGHWAY AT 70 MPH ON THE HIGHWAY. NO ADVANCE WARNING OF A PROBLEM NOR DID THE ENGINE CHECK-LIGHT WARNING COME ON PRIOR TO THE INCIDENT. THE TRUCK WAS SERVICED ROUTINELY ACCORDING TO THE FACTORY RECOMMENDATIONS BY CERTIFIED HONDA DEALERS. THE SPARK PLUG BLEW OUT OF THE ENGINE HEAD IN TWO PIECES. ONE PEACE CAME OUT AND BLEW THE COIL PACK INTO THE FAN, WHICH THEN LANDED ON THE BATTERY AND MELTED RIGHT THROUGH IT. THE SECOND HALF WENT DOWN THRU THE ENGINE SHOOTING METAL AND DEBRIS INTO THE ENGINE BLOCK DESTROYING THE ENGINE AT ONLY 67,442 MILES. REPLACEMENT/REPAIRS QUOTE WAS $12,048.85 AND THE EXTENDED WARRANTY (5 YRS OR 100,000 MILES) ALLEGEDLY DOESN'T COVER SPARK PLUGS!    IT APPEARS THAT THIS IS A COMMON PROBLEM, ACCORDING TO ONLINE OWNER BLOGS WITH HONDA ENGINES IN GENERAL:    HTTP://WWW.RIDGELINEOWNERSCLUB.COM/FORUMS/7-1G-UNDER-HOOD-PERFORMANCE/45379-BLEW-SPARK-PLUG-HEAD.HTML    HTTPS://WWW.FITFREAK.NET/FORUMS/1ST-GENERATION-GD-01-08/76611-SPARK-PLUG-EJECTION-W-COIL-BLOW-OUT.HTML",
        "vin": "2HJYK165X7H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/03/2017",
        "dateOfIncident": "03/15/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10970129,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2007 HONDA RIDGELINE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS). THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "2HJYK16467H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/27/2017",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10968628,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2007 HONDA RIDGELINE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 16V344000 (AIR BAGS) AND 16V061000 (AIR BAGS). THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "2HJYK16497H"
    },
    {
        "components": "POWER TRAIN,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/10/2017",
        "dateOfIncident": "03/09/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10959946,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE UNIBODY IS RUSTED THROUGH.  THE FRAME PART THAT HOLDS THE REAR WHEELS HAS RUSTED THROUGH . THE ENTIRE WHEEL ASSEMBLY  IS FALLING OF!! I NOTICED THIS FIRST WITH A NOISE WHICH THEN STARTED SHAKING I SLOWLY STOPPED AND HAD THE VEHICLE LOOK AT AND WAS TOLD THAT THE ENTIRE REAR POWER TRAIN WOULD HAVE BROKE OFF AT ANY TIME CAUSING A BAD ACCIDENT HAD I BEEN ON A HIGHWAY !!",
        "vin": "2HJYK16347H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/07/2017",
        "dateOfIncident": "02/12/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10950172,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2007 HONDA RIDGELINE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 16V344000 (AIR BAGS) AND 16V061000 (AIR BAGS). THE DEALER SCHEDULED AN APPOINTMENT FOR THE RECALL AND LATER STATED THAT THEY WOULD CALL THE CONTACT ONCE THEY WERE AVAILABLE TO SCHEDULE THE REPAIR, BUT MADE NO MENTION OF PART AVAILABILITY. THE DEALER FAILED TO FOLLOW-UP TO LET THE CONTACT KNOW THE STATUS OF SCHEDULING THE TWO RECALL REPAIRS. THE MANUFACTURER WAS CONTACTED TO DETERMINE WHEN THE PARTS WOULD BE SUPPLIED TO THE DEALER. THE CONTACT WAS EXPERIENCING A FAILURE WITH THE AIR BAG WARNING INDICATOR RANDOMLY ILLUMINATING. THE FAILURE MILEAGE WAS UNKNOWN. PARTS DISTRIBUTION DISCONNECT. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2HJYK16247H"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/11/2017",
        "dateOfIncident": "01/09/2017",
        "fire": true,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10944467,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON MONDAY, JAN 9TH AT 11:50AM ON RANKIN ROAD IN GREENSBORO WHEN SMOKE WAS COMING FROM THE PASSENGER HOOD AREA, THEN A FLAME OF FIRE, I GOT OUT AND CALLED 911, THE FIRE DEPARTMENT CAME AT 11:54 AND PUT OUT THE FIRE,DAMAGING THE PASSENGER GLASS SIDE AND SPRAYING WATER THROUGHOUT THE TRUCK AND CUTTING THE CABLE TO THE BATTERY OF THE TRUCK. FIRE DEPT TOOK REPORT AND FIRE MARSHALL SAID IT LOOKED LIKE IT WAS ELECTRICAL COMING FROM THE AIR BAG AREA BEING THE FIRE DID NOT COME FROM ENGINE, THE ENGINE PART WAS FINE JUST WHERE THE AIR BAG AREA WAS. THERE WAS NO WARNING LIGHTS THAT CAME ON OR ANYTHING. FIRE DEPT CALLED A TOW TRUCK TO TOW TRUCK TO MY HOUSE, I HAD TO PAY 95.00 TO TOW COMPANY.  MY SIDE BUSINESS IS ON HOLD BECAUSE I DO NOT HAVE A TRUCK TO PUT MY EQUIPMENT IN SO NOW I AM LOSING MONEY.  *TR",
        "vin": "2HJYK16367H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/10/2017",
        "dateOfIncident": "01/10/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10944205,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "HONDA/TAKATA RECALL: WE RECEIVED A NOTICE IN JUNE 2016 THAT OUR VEHICLE HAD A RECALL. RECALL IS DATED 5/23/16. IT HAS BEEN 7 1/2 MONTHS AND IT STILL HAS  NOT BEEN REMEDIED.  THEIR SUGGESTION IS FOR NO ONE TO SIT IN THE FRONT PASSENGER SEAT.  THAT IS NOT A OPTION FOR OUR FAMILY.  WHEN ARE THEY GOING TO FIX THIS? I WANT A NEW VEHICLE IF THEY CANNOT FIX IT SOON.",
        "vin": "2HJYK16217H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/08/2017",
        "dateOfIncident": "11/08/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10940417,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL, STARTED GETTING RECALL NOTICES SINCE APRIL 2016. ATTEMPTED TO MAKE A REPAIR APPOINTMENT STARTING ON NOV 8 2016, CASE # 05210626, IT HAS BEEN 60 DAYS SINCE I FIRST TRIED TO MAKE AN APPOINTMENT AND ABOUT 8 MONTHS SINCE I RECEIVED WARNING THE AIRBAGS WERE BAD AND HONDA HAS NOT BEEN ABLE TO REMEDY THE ISSUE OF ME DRIVING MY CAR WITH POTENTIALLY UNSAFE AIRBAGS.    NHTSA RECALL: 16V-344  *TR",
        "vin": "2HJYK16327H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/02/2017",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10939085,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL",
        "vin": "2HJYK16557H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/09/2016",
        "dateOfIncident": "12/09/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10934154,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MY TRUCK NEED A NEW DRIVE SHAFT ..I GOOGLE AND SO MANY TRUCKS NEED THE SAME THINGS..IT SHOULD BE A RECALL I NEVER HEARD CARS NEED THIS SO SOON MY TRUCK IS 2007 HONDA RIDGELINE.  THANKS [XXX].    ('PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).')*JB",
        "vin": "2HJYK165X7H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/06/2016",
        "dateOfIncident": "12/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10929328,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "2007 HONDA RIDGELINE.  CONSUMER WRITES IN REGARDS TO REPLACEMENT PARTS NOT AVAILABLE TO REPAIR PASSENGER AIRBAG INFLATOR RECALL NOTICE.  *SMD",
        "vin": "2HJYK16507H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/27/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10928107,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVENT RECEIVED A RESPONSE FROM HONDA SINCE MARCH 2016.  THE REMEDY WAS SUPPOSED TO TAKE PLACE DURING THE SUMMER OF 2016.  FRONT AIRBAG INFLATOR.",
        "vin": "2HJYK16537H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/21/2016",
        "dateOfIncident": "11/21/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10927304,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HONDA RIDGELINE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER; 16V061000 (AIR BAGS). THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "2HJYK16287H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/12/2016",
        "dateOfIncident": "08/15/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10925590,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. GETTING THE RUN AROUND WITH HYANNIS HONDA IN MASSACHUSETTS. ORDERED REPLACEMENTS BACK IN JULY OR AUGUST. NOTHING HAS HAPPENED WITH THE VEHICLE YET.",
        "vin": "2HJYK16427H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/07/2016",
        "dateOfIncident": "11/07/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10924808,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2007 HONDA RIDGELINE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS). THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "2HJYK16547H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/02/2016",
        "dateOfIncident": "04/02/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10923931,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A TAKATA RECALL NOTICE FOR DEFECTIVE DRIVER'S AND PASSENGER AIR BAGS.  I CONTACTED MY LOCAL DEALER, OCEAN HONDA, IN APRIL 2016 TO GET THE AIR BAGS REPLACED AND WAS ADVISED OF AN ALTERNATE TRANSPORTATION OPTION.  THE DEALER INFORMED ME THAT I WOULD NOT BE PROVIDED AN EQUIVALENT VEHICLE, BUT RATHER $35 PER DAY WHICH WOULD ALLOW ME TO COVER THE COST OF A COMPACT CAR.  I EXPLAINED I WORKED CONSTRUCTION AND NEEDED MY TRUCK FOR MY JOB. THE DEALER ADVISED ME TO CONTACT THE NUMBER ON MY RECALL NOTICE.  I CALLED THE NUMBER ON MY RECALL NOTICE AND REQUESTED AN ALTERNATE TRANSPORTATION EQUIVALENT TO MY HONDA PICKUP ON APRIL 2, 2016 AND CASE # 04574876 WAS OPENED.  I WAS ADVISED I WOULD BE CONTACTED WITH A DECISION.  I NEVER WAS.  FROM APRIL 2016 TO THE PRESENT, I TOOK MY CAR TO OCEAN HONDA FOR ROUTINE SERVICE MULTIPLE TIMES AND REQUESTED THE STATUS OF THE TAKATA RECALL.  EACH TIME I REQUESTED STATUS, I WAS ADVISED THE PARTS WERE ON BACK ORDER.  I TOOK MY CAR IN A FEW WEEKS AGO AND VERY ADVISED THE PARTS WERE STILL ON BACK ORDER.  I CONTACTED HONDA AGAIN TODAY, NOVEMBER 2, 2016, TO FIND OUT THE STATUS OF MY REPLACEMENT PARTS AND ALTERNATE TRANSPORTATION REQUEST AND WAS ADVISED THE PARTS WERE AVAILABLE, BUT NO DECISION WAS MADE ON MY ALTERNATE TRANSPORTATION REQUEST.  IT HAS BEEN SEVEN MONTHS SINCE MY INITIAL REQUEST AND I HAVE BEEN PUTTING MY OWN WELL BEING AT RISK DRIVING AN UNSAFE VEHICLE WITH NO EXPLANATION AS TO WHY THE PARTS HAVE NOT BEEN REPLACED OR WHY HONDA WOULD NOT CONSIDER MY SPECIAL CIRCUMSTANCES OF ALTERNATE TRANSPORTATION.  I BELIEVE AMERICAN HONDA HAS FAILED TO REMEDY THE DEFECT IN MY VEHICLE AND TO ACCOMMODATE MY SPECIAL ALTERNATE TRANSPORTATION REQUEST WITHIN A REASONABLE PERIOD OF TIME (60 DAYS FROM THE DATE I FIRST CONTACTED MY DEALER FOR A REPAIR APPOINTMENT) AND AM; THEREFORE, LODGING A FORMAL COMPLAINT TO TRY TO BRING THIS MATTER TO A CLOSE.  *TR",
        "vin": "2HJYK16307H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/24/2016",
        "dateOfIncident": "03/15/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10918572,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2007 HONDA RIDGELINE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 16V061000 (AIR BAGS) AND 16V344000 (AIR BAGS). THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2HJYK16427H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/17/2016",
        "dateOfIncident": "04/25/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10916894,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "2007 HONDA RIDGELINE.  CONSUMER WRITES IN REGARDS TO AIRBAG RECALL REPAIR ISSUES.  *SMD",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/08/2016",
        "dateOfIncident": "05/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10914857,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL:    I WAS MAILED A RECALL NOTICE FROM HONDA CONCERNING MY FROM AIR BAG.   I CONTACTED FAIRFAX HONDA OF VIRGINIA IN THE SPRING TO SIGN UP FOR THIS RECALL. I HAVE FOLLOWED UP SEVERAL TIMES. I HAVE NOT BEEN ABLE TO MAKE ANY PROGRESS. I HAVE BEEN REPEATEDLY TOLD THE PART IS ON ORDER. PLEASE HELP MAKE HONDA AND THE DEALER TAKE ACTION TO RESOLVE THIS.",
        "vin": "2HJYK16557H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/03/2016",
        "dateOfIncident": "03/02/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10911272,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "SAFETY RECALL DUE TO PROPELLANT WAFERS IN AIRBAGS. OVER THE PAST SIX MONTHS I HAVE SCHEDULED APPOINTMENTS TO HAVE MY VEHICLES AIRBAGS REPLACED. THE LAST APPOINTMENT  WAS ON 08-15-2016 AT 10:00 A.M. AT THE BUENA PARK HONDA 6411 BEACH BLVD BUENA PARK CA 90621 CONFIRMATION CODE X046XD29XP DESPITE GOING TO MULTIPLE HONDA DEALERSHIPS AND MAKING MULTIPLE APPOINTMENTS I AM CONSTANTLY TOLD THAT I HAVE TO COME BACK AS THEY DO NOT HAVE THE PARTS. I NEVER RECEIVE A FOLLOW UP CALL OR AM ABLE TO GET HONDA TO CORRECT THEIR DEFECTIVE AIRBAGS WHICH CAN POTENTIALLY ENDANGER MY LIFE AND THE LIVES OF MY PASSENGERS. SHOULD ANYTHING HAPPEN I WILL HOLD HONDA ACCOUNTABLE LEGALLY AS I HAVE MADE NUMEROUS ATTEMPTS TO HAVE MY VEHICLE FIXED WITH HONDA DEALERSHIPS. PLEASE ASSIST ME IN GETTING HONDA TO CORRECT THEIR DEFECTIVE AIRBAGS.",
        "vin": "2HJYK165X7H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/01/2016",
        "dateOfIncident": "09/30/2006",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10910906,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL:   I HAVE RECEIVED TWO DATED LETTERS FROM HONDA.  I HAVE CALLED THE DEALER A NUMBER OF TIMES TO HAVE THE AIR BAGS REPLACED.  I WOULD LIKE HONDA TO REPLACE THE AIR BAGS AS SOON AS POSSIBLE",
        "vin": "2HJYK16457H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/12/2016",
        "dateOfIncident": "06/13/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10905702,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2007 HONDA RIDGELINE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V384000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE VIN WAS UNKNOWN. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.  UPDATED 11/17/16*LJ  UPDATED 11/17/16.*JB",
        "vin": "77206017219"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/12/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10905354,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "2007 HONDA RIDGELINE.  CONSUMER WRITES IN REGARDS TO REPLACEMENT PARTS NOT AVAILABLE TO REPAIR DRIVER SIDE AND FRONT PASSENGER SIDE AIRBAG INFLATOR RECALL NOTICES.  *SMD",
        "vin": "2HJYK16567H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/12/2016",
        "dateOfIncident": "02/03/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10905852,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2007 HONDA RIDGELINE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 16V344000 (AIR BAGS) AND 16V061000 (AIR BAGS) HOWEVER, THE PARTS TO DO THE REPAIRS WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIRS. THE MANUFACTURER WAS MADE AWARE OF THE ISSUES. THE CONTACT HAD NOT EXPERIENCED A FAILURE.  VIN TOOL CONFIRMS PARTS NOT AVAILABLE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "2HJYK16557H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/07/2016",
        "dateOfIncident": "03/28/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10904366,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL    OUR 2007 RIDGELINE VIN 2HJYK16307H42849 WAS RECALLED ON MARCH 28, 2016 FOR THE FAULTY TAKATA DRIVER'S SIDE AIRBAG AND RECALLED IN JULY, 2016 FOR THE FAULTY TAKATA FRONT PASSENGER'S SIDE AIRBAG. WE CONTACTED OUR LOCAL HONDA DEALER, PRESCOTT HONDA, 3291 WILLOW CREEK ROAD, PRESCOTT, ARIZONA 86301, 928-778-5500 ON MARCH 28; MARCH 29; JULY 11; AND SEPTEMBER 7, 2016 REQUESTING REPAIRS. WE HAVE BEEN REPEATEDLY TOLD THAT THE PARTS FOR THE DRIVER'S SIDE AIRBAG ARE NOT YET IN. (THE PARTS FOR THE FRONT PASSENGER'S SIDE AIRBAG REPAIR CAME IN JULY--BUT WE CANNOT SAFELY DRIVE THE VEHICLE AS THE DRIVER IS STILL AT RISK WITH THE FAULTY AIRBAG! THEREFORE WE ARE WAITING SO WE CAN GET BOTH AIRBAGS FIXED AT THE SAME TIME.)    IT HAS NOW BEEN OVER 155 DAYS SINCE WE FIRST RECEIVED NOTICE OF THE DRIVER'S AIRBAG RECALL. WE ARE WITHOUT THE USE OF OUR TRUCK DURING THIS TIME. WHILE A RENTAL VEHICLE WAS OFFERED (ONLY AFTER I INQUIRED), THE TWO VEHICLES OFFERED DO NOT MEET OUR VEHICLE NEEDS OF A TRUCK.    WE JUST WANT OUR AIRBAGS REPAIRED! NOW! ENOUGH WAITING!",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/05/2016",
        "dateOfIncident": "01/14/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10903629,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE BEEN WAITING FOR OVER 1 YEAR AND PER LAST LETTER DATED JULY 2016 NOW STATES SOME 60 DAYS HAVE PASSES AND NO DEALER HAS CONTACTED ME THERE FOR HONDA & THIS WEB SITE AND ALL OTHERS INVOLVED HAVE FAILED IN THIS SAFETY RECALL FIASCO, I AM SEEKING LEGAL ASSISTANCE ASAP AS I KNOW THIS ACTION HEREIN WILL NOT BE ADDRESSED OR TAKEN WITH A NAY CONCERNS OR ACTION RELATING TO AIR BAG REPLACEMENT!!!",
        "vin": "2HJYK16547H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/25/2016",
        "dateOfIncident": "02/03/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10898469,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2007 HONDA RIDGELINE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS). THE PART TO DO THE REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.  UPDATED 09/30/16*LJ  *TR",
        "vin": "2HJYK162X7H"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/23/2016",
        "dateOfIncident": "08/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10897893,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER HAVING SPARK PLUGS, VALVE COVER GASKETS, INTAKE PLENUM GASKETS REPLACED, VEHICLE IS NOW CONSUMING HUGE AMOUNTS OF OIL WITH MINIMAL USE; MECHANIC SAYS IT NEEDS COMPLETE ENGINE OVERHAUL, RING JOB, ETC. OR REPLACEMENT ENGINE AT COST OF SEVERAL THOUSAND DOLLARS.",
        "vin": "2HJYK15487H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/22/2016",
        "dateOfIncident": "03/22/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10897673,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HONDA RIDGELINE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 16V344000 (AIR BAGS) AND 16V061000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2HJYK16557H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/19/2016",
        "dateOfIncident": "08/19/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10897163,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2007 HONDA RIDGELINE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "2HJYK16517H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/17/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10896678,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "\"TAKATA RECALL\"  I HAVE RECEIVED TWO LETTERS FROM HONDA ABOUT THE AIRBAG RECALLS, ONE DATED MARCH 2016 FOR DRIVER AIRBAG RECALL AND ONE DATED JULY 2016 FOR PASSENGER AIRBAG RECALL.  TO DATE, NOTHING HAS BEEN REPLACED, MUCH TO MY DISMAY.  I KEEP CHECKING WITH HONDA OF OCALA (FLORIDA) AND THEY KEEP TELLING ME THEY CAN'T GET THE PARTS.  SINCE THIS IS SO VERY DANGEROUS, WHY CAN'T THIS BE CORRECTED?  IT HAS BEEN OVER 5 MONTHS SINCE I RECEIVED THE FIRST LETTER OF RECALL AND ALMOST TWO MONTHS SINCE I RECEIVED THE SECOND LETTER OF RECALL.  WHAT IS THE PROBLEM?  I KEEP READING ABOUT THE DANGERS OF NOT GETTING THESE REPLACED AND IT IS VERY SCARY. WHEN WILL THIS BE TAKEN CARE OF IN MY VEHICLE.......CAN YOU DELIVER ME AN ANSWER?",
        "vin": "2HJYK16567H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/15/2016",
        "dateOfIncident": "08/12/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10895851,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL-  HONDA HAS ACKNOWLEDGED THAT BOTH MY DRIVER'S SIDE AND PASSENGER SIDE AIR BAGS ARE AFFECTED.  THE AUTOPARK HONDA IN CARY, NC IS REFUSING TO PROVIDE ME WITH AN ALTERNATIVE VEHICLE WHEN ACCORDING TO AMERICAN HONDA I AM ENTITLED TO ONE SINCE IT IS DRIVER'S SIDE AIR BAG",
        "vin": "2HJYK16507H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/15/2016",
        "dateOfIncident": "01/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10896073,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL-[XXX]: HI MARINA- MY 2007 HONDA RIDGELINE HAS A RECALL FOR THE TANAKA AIRBAG. I HAVE CONTACTED HONDA NUMEROUS TIMES ABOUT WHEN I CAN BE FIXED AND IF THEY CAN PROVIDE A RENTAL IN THE MEANTIME. THEY OFTEN HANG UP ON ME AND IF CHATTING THEY TERMINATE IT OR SAY THAT SOMEONE WILL CALL ME, WHICH THEY NEVER DO. I CONTACT THE HONDA CORPORATE OFFICE AND THE SAME RESULTS OCCURRED, WHICH IS NOTHING. THIS IS THE ONLY CAR MY WIFE AND I HAVE THAT CAN SHUTTLE OUR 2 YEAR OLD TO AND FROM DAYCARE AND THE VEHICLE IS UNSAFE AND HONDA WILL DO NOTHING ABOUT IT.    ('PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).')*JB",
        "vin": "2HJYK16557H"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/12/2016",
        "dateOfIncident": "06/17/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10895331,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR YEARS I HAVE ALWAYS WANTED A RIDGE LINE HONDA. NOW I HAVE ONE. I HAD PURCHASED MY TRUCK FEBRUARY 2015. I ONLY DROVE THE TRUCK LITERALLY FOR 4 MONTHS AND I PAY A LOT OF MONEY EACH MONTH TO CAPITAL ONE. I HAVE ALREADY PLACED A TRANSMISSION AND RADIATOR IN IT AROUND FEBRUARY OR MARCH OF 2016. I WAS TOLD THAT THE TRUCK WAS OKAY DON'T WORRY ABOUT ANYTHING. IT IS SAFE TO DRIVE AND TRAVEL WITH. SO TOWARDS THE END OF JUNE - I HAD DROVE FROM OHIO TO ALABAMA.  ON JUNE 17, ON MY WAY TO CHURCH THE ENGINE BLEW UP ON THE EXPRESSWAY. IT HAS BEEN ALMOST 2 MONTHS WITHOUT MY TRUCK. I AM PAYING A LOT OF MONEY FOR IT. I HOLD CAPITOL ONE AND THEY SAID ASK YOU ALL IF YOU ARE WILLING TO LET ME EXCHANGE FOR SOMETHING DIFFERENT BECAUSE THEY ARE ONLY IN CHARGE OF LETTING ME BORROW MONEY. THEY SAID THAT HONDA HAS THE POWER TO DO THAT.",
        "vin": "2HJYK16447H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/09/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10894285,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HONDA RIDGELINE. THE CONTACT STATED THAT THE RECALL NOTICE FOR NHTSA CAMPAIGN NUMBERS: 16V344000 (AIR BAGS) WAS RECEIVED IN JUNE OF 2016 AND 16V061000 (AIR BAGS) WAS RECEIVED IN MARCH OF 2016. AFTER CONTACTING THE DEALER AND THE MANUFACTURER ON MULTIPLE OCCASIONS, THE CONTACT WAS INFORMED THAT THE PARTS NEEDED TO REPAIR THE VEHICLE WERE STILL NOT AVAILABLE AND NO ESTIMATED TIME FOR RECEIVING THE PARTS COULD BE GIVEN. THE CONTACT HAD NOT EXPERIENCED A FAILURE.   UPDATED 10/04/16*LJ",
        "vin": "2HJYK16587H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/09/2016",
        "dateOfIncident": "04/15/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10894496,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2007 HONDA RIDGELINE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V344000 (AIR BAGS); HOWEVER, THE PARTS FOR THE RECALL REPAIR WERE NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "08/09/2016",
        "dateOfIncident": "08/06/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10894611,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HONDA RIDGELINE. WHILE DRIVING 65 MPH, THE SUN ROOF IN THE VENT POSITION BLEW UP. THE CONTACT SUSTAINED A CUT TO THE LEFT ELBOW AS A RESULT OF THE SHATTERED GLASS FROM THE SUN ROOF, BUT DID NOT REQUIRE MEDICAL ATTENTION. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 140,000.",
        "vin": "2HJYK16577H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/05/2016",
        "dateOfIncident": "02/12/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10893564,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2007 HONDA RIDGELINE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 16V344000 (AIR BAGS) AND 16V061000 (AIR BAGS). THE PART TO DO THE REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE.  THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE. ...UPDATED 09/12/16 *BF  UPDATED 09/20/16.*JB",
        "vin": "2HJYK16487H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/02/2016",
        "dateOfIncident": "05/04/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10892590,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2007 HONDA RIDGELINE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER,THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2HJYK16567H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/28/2016",
        "dateOfIncident": "03/07/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10889191,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2007 HONDA RIDGELINE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2HJYK16437H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/28/2016",
        "dateOfIncident": "04/02/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10889198,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA INFLATORS. NOTIFIED IN MARCH. DEALER HAS HAD VEHICLE SINCE APRIL 2 TO DATE. UNABLE TO TOW MY BOAT WITH LOANER VEHICLE. HAVE MISSED MOST OF THIS FISHING SEASON.  I'M UPSET, I BOUGHT A TRUCK FOR THE EXPRESS PURPOSE OF TOWING MY BOAT. RECOURSE?",
        "vin": "2HJYK165X7H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/28/2016",
        "dateOfIncident": "06/13/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10889285,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2007 HONDA RIDGELINE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V344000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "2HJYK16267H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/27/2016",
        "dateOfIncident": "03/10/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10889097,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HONDA RIDGELINE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 16V344000 (AIR BAGS) AND 16V061000 (AIR BAGS). THE PART FOR THE REPAIR WAS NOT AVAILABLE WITHIN A REASONABLE TIME FRAME TO SCHEDULE THE RECALL REPAIR. THE DEALER DID NOT GIVE A SPECIFIC DATE FOR WHEN THE PART WOULD BECOME AVAILABLE. THE MANUFACTURER COULD NOT PROVIDE AN ESTIMATED DATE FOR WHEN THE VEHICLE WOULD RECEIVE THE RECALL REPAIR. THE CONTACT WAS NOT EXPERIENCING A FAILURE. PARTS DISTRIBUTION DISCONNECT. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2HJYK16507H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/26/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10888683,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "RE: NHTSA RECALL 16V-061 AND 16V-344:  RECEIVED HONDA RECALL NOTICES BEGINNING MARCH 2016.  HAVE HAD NO REPAIRS/REPLACEMENT TO AIRBAGS SINCE MARCH 2016 EVEN THOUGHT HONDA WARNS YOU NOT TO DRIVE YOUR VEHICLE OR HAVE ANYONE SIT IN THE PASSENGER SEAT.THIS IS NOT ACCEPTABLE!!",
        "vin": "2HJYK16477H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/25/2016",
        "dateOfIncident": "07/19/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10888091,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2007 HONDA RIDGELINE. THE CONTACT RECEIVED A RECALL NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V344000 (AIR BAGS) HOWEVER, THE PART NEEDED TO PERFORM THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2HJYK16567H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/22/2016",
        "dateOfIncident": "07/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10887707,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL    HONDA IS UNABLE TO REMEDY THE DEFECT INVOLVING THE AIRBAGS RECALL WITHIN A REASONABLE PERIOD OF TIME.",
        "vin": "2HJYK16487H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/21/2016",
        "dateOfIncident": "03/21/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10887468,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2007 HONDA RIDGELINE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2HJYK16447H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/21/2016",
        "dateOfIncident": "05/24/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10887571,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2007 HONDA RIDGELINE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V344000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "2HJYK16467H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/20/2016",
        "dateOfIncident": "03/18/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10886102,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2007 HONDA RIDGELINE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 16V344000 (AIR BAGS) AND 16V061000 (AIR BAGS); HOWEVER, THE PARTS TO DO THE REPAIRS WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2HJYK16327H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/19/2016",
        "dateOfIncident": "03/22/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10885894,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2007 HONDA RIDGELINE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER, THE PART NEEDED TO PERFORM THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2HJYK16557H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/18/2016",
        "dateOfIncident": "04/04/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10885508,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I REGISTERED MY VEHICLE WITH CROWN HONDA ON 4/4/16 FOR REPAIR.  I CALLED TODAY 7/18/16 AND STILL NO AIRBAG AVAILABLE.  I BELIEVE I HAVE BEEN PATIENT AND WAITED LONG ENOUGH.",
        "vin": "2HJYK16597H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/18/2016",
        "dateOfIncident": "02/12/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10885639,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2007 HONDA RIDGELINE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS:  16V344000 (AIR BAGS) AND 16V061000 (AIR BAGS); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIRS. THE MANUFACTURER WAS MADE AWARE OF THE ISSUES. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE AND PARTS DISTRIBUTION DISCONNECT.",
        "vin": "2HJYK163X7H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/14/2016",
        "dateOfIncident": "02/12/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10884772,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2007 HONDA RIDGELINE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 16V344000 (AIR BAGS) AND 16V061000 (AIR BAGS). THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2HJYK16317H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/12/2016",
        "dateOfIncident": "07/12/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10884299,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2007 HONDA RIDGELINE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 16V344000 (AIR BAGS/PASSENGER) AND 16V061000 (AIR BAG/DRIVER); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "2HJYK16537H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/11/2016",
        "dateOfIncident": "02/12/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10883948,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HONDA RIDGELINE.  THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS:  16V344000 (AIR BAGS) AND 16V061000 (AIR BAGS).  HOWEVER, THE PARTS TO DO THE REPAIRS WERE NOT AVAILABLE.  THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR.  THE MANUFACTURER WAS MADE AWARE OF THE ISSUE.  THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2HJYK16297H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/05/2016",
        "dateOfIncident": "07/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10881195,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "2007 HONDA RIDGELINE.  CONSUMER WRITES IN REGARDS TO REMEDY NOT AVAILABLE TO REPAIR DRIVER FRONT AIRBAG INFLATOR RECALL NOTICE.  *SMD",
        "vin": "2HJYK16557H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/05/2016",
        "dateOfIncident": "07/05/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10882630,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "SAME AS MY EARLIER COMPLAINT, DIFFERENT VEHICLE",
        "vin": "2HJYK16597H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/01/2016",
        "dateOfIncident": "07/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10882102,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  DOES NO GOOD TO ISSUE A RECALL WHEN THE DEALERSHIP SIMPLY STATES THAT THEY HAVE NO IDEA WHEN REPLACEMENT PARTS WILL BE READY TO INSTALL IF EVER.",
        "vin": "2HJYK16577H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/27/2016",
        "dateOfIncident": "06/14/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10876946,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2007 HONDA RIDGELINE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V344000 (AIR BAGS); HOWEVER, THE PART NEEDED TO PERFORM THE REPAIR WAS UNAVAILABLE. THE DEALER DENIED A LOANER VEHICLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2HJYK16577H"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "06/22/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10875989,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HONDA RIDGELINE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V344000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.  UPDATED 08/16/16*LJ  THE DOOR LOCK ON THE DRIVE SIDE WAS REPLACED AT A COST OF $120. THE DOOR WOULD OPEN WHILE THE CONSUMER WAS DRIVING. ALSO, THE ALARM WOULD RANDOMLY GO OFF. IT WAS DETERMINED THEY WAS A SECURITY FAILURE. UPDATED 09/21/16.*JB",
        "vin": "2HJYK16497H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/16/2016",
        "dateOfIncident": "03/07/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10874541,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2007 HONDA RIDGELINE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE VIN WAS UNAVAILABLE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/13/2016",
        "dateOfIncident": "06/13/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10873868,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2007 HONDA RIDGELINE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAG) HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.  UPDATED 09/23/16*LJ  UPDATED 03/14/17*JB",
        "vin": "2HJYK164X7H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/07/2016",
        "dateOfIncident": "03/16/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10873076,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TAMARA RECALL. MORE THAN 2 MONTHS SINCE RECEIVING RECALL NOTICE. TOLD ONLY 10 REPAIR KITS PER DEALER AVAILABLE. NEED TO SPEED UP OR GIVE US NEW VEHICLES.",
        "vin": "2HJYK16527H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/01/2016",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10871867,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HONDA RIDGELINE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER 15V286000 (AIR BAGS). HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/01/2016",
        "dateOfIncident": "06/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10871898,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  THIS RECALL IS BEING MISMANAGED.  I'VE CONTACTED THE LOCAL DEALER 3 TIMES AND THEIR ONLY RESPONSE IS TO SAY THERE ARE NO PARTS.  AND THEY WON'T TAKE MY NAME THEY INFORM ME TO CALL BACK WEEKLY.  THEY ACKNOWLEDGED THEY DO GET SOME PARTS BUT CAN'T CALL CUSTOMERS WHEN THEY GET THEM.  SO BASICALLY I HAVE TO GET LUCKY AND CALL ON THE DAY THEY RECEIVE THE PARTS.  IN THE MEANTIME, I HAVE TO DRIVE AN UNSAFE CAR.  ALSO I HEARD ON THE NEWS THERE ARE MILLIONS OF CARS BEING ADDED TO THE RECALL.  THIS IS NOT BEING MANAGED TO PROVIDE FOR SAFE CARS.",
        "vin": "2HJYK16577H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/23/2016",
        "dateOfIncident": "03/23/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10870386,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2007 HONDA RIDGELINE. THE CONTACT RECEIVED A RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS); HOWEVER, THE PARTS NEEDED WERE NOT AVAILABLE. THE CONTACT BELIEVED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME TO PROVIDE THE RECALL REPAIRS. THE DEALER AND MANUFACTURER WERE MADE AWARE OF THE DELAY. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2HJYK16297H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/12/2016",
        "dateOfIncident": "02/22/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10864561,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2007 HONDA RIDGELINE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V061000 (AIR BAGS) AND STATED THAT THE PART NEEDED FOR THE REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2HJYK16467H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/13/2016",
        "dateOfIncident": "03/29/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10855385,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL-AFTER RECEIVING MY RECALL NOTICE 3/28 I CONTACTED HONDA CORPORATE AS WAS TOLD TO MAKE ARRANGEMENTS FOR RENTAL AND IT COULD BE 6 MONTHS UNTIL THE PART IS IN TO FIX MY TRUCK, I EXPLAINED TO THEM THAT I AM DISABLED AND HAVE SEVERAL DISABLING CONDITIONS FROM AN ACCIDENT WITH THE MOST SEVERE BEING 26 RODS AND 13 FUSIONS IN MY SPINE WHICH THEREFORE I CAN'T BEND AND AM IN NEED OF A VEHICLE THE SAME SIZE THAT I DRIVE AS I LITERALLY CAN'T BEND BEING AS I AM FUSED FROM MY NECK TO MY TAILBONE. I WAS TOLD THE SUPERVISOR WOULD CALL BACK IN 24 HOURS. AFTER 24 HOURS NO CALL SO I CALLED BACK AND THEY TOLD ME TO CONTACT MY LOCAL DEALER RENSSELAER HONDA AS TO THE CAP OF $35 DOLLAR A DAY ALLOTMENT FOR RENTALS. I HAVE DOCUMENTED NOTES OF THE LAST 3 WEEKS BETWEEN CORPORATE AND THE DEALERSHIP AS WHEN I WAS FINALLY SENT TO RENT A CAR I WAS OFFERED JUST THAT-A SONATA CAR WHICH I CAN'T BEND TO GET IN TO. WHEN MY DAUGHTER ASKED WHAT ABOUT THE RAV4 ON THE LOT WE WHERE THEN BROUGHT OUT TO SEE IT AND WHEN THEY OPENED THE DOOR THE SMELL OF CIGARETTE SMOKE WAS UNBEARABLE AND I COULDN'T EVEN APPROACH THE VEHICLE. I SAID TO HIM I SUFFER FROM MIGRAINES AS A SIDE EFFECT TO ALL THE METAL IN MY SPINE TO THE POINT MY NEUROLOGIST GIVES ME BOTOX EVERY 12 WEEKS-WELL HE THOUGHT I WAS LOOKING FOR EXCUSES AND SAID CAN'T YOU DRIVE IT UNTIL I GET SOMETHING ELSE IN, I SAID SIR I CAN'T I GET ILL AND AT THAT POINT HE BECAME RUDE AND SAID YOU GOT TOO MANY PROBLEMS FOR ME. RENSSELAER HONDA WAS MADE AWARE OF THIS HOWEVER IN THE INTERIM THEY HAD GIVING ME THE CONTRACT HONDA CORPORATION WANTED ME TO SIGN IN ORDER TO OBTAIN A RENTAL, I DON'T AGREE WITH ALL OF THE WORDING AS WRITTEN SO I EXPLAINED TO THE SERVICE MGR. THAT I WOULD HAVE TO MAKE A FEW CHANGES BEFORE I COULD SIGN (FOR EXAMPLE:AS PER MY MECHANIC IT IS UNHEALTHY FOR THE BRAKES AND ROTARS, BATTERY ETC. TO SIT FOR 6 MONTHS WITHOUT BEING STARTED).",
        "vin": "2HJYK16277H"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/12/2016",
        "dateOfIncident": "03/02/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10855018,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HONDA RIDGELINE. WHILE DRIVING AT APPROXIMATELY 55 MPH, THE ENGINE MADE AN ABNORMAL NOISE. IN ADDITION, THE CONTACT PULLED THE VEHICLE OVER TO THE SIDE OF THE ROAD AND THE CHECK ENGINE WARNING LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN TO A DEALER WHERE THE TECHNICIAN INFORMED THE CONTACT THAT THE SPARK PLUG FRACTURED AND FELL INTO THE ENGINE. THE ENGINE WAS DESTROYED AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 124,000.   UPDATED 06/29/16*LJ  *TR",
        "vin": "2HJYK16357H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/29/2016",
        "dateOfIncident": "03/29/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10852171,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2007 HONDA RIDGELINE. THE CONTACT RECEIVED NOTIFICATION OF A RECALL FOR THE AIR BAGS AND STATED THAT THE PART NEEDED FOR THE REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE NHTSA CAMPAIGN NUMBER WAS UNKNOWN. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOLS CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2HJYK164X7H"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "11/07/2015",
        "dateOfIncident": "10/29/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10789031,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "HONDA RIDGELIBE REAR CENTER SLIDING WINDOW EXPLODED FOR NO REASON AND WITHOUT ANY CAUSE DURING A DRIVE WITH MY 6 YEAR OLD IN THE BACK SEAT. AFTER READING ON THE INTERNET CAUSES I HAVE DISCOVERED THIS IS NOT AN ISOLATED OCCURRENCE. MY DAUGHTER COULD HAVE BEEN SERIOUSLY INJURED.  WE WERE DRIVING IN A SUBDIVISION WITH NO OTHER CARS ON THE STREET.",
        "vin": "2HJYK16377H"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/27/2015",
        "dateOfIncident": "10/25/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10786263,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS ISSUES HAS OCCURRED 4 TIMES IN THE PAST 3 MONTHS. TWICE AT HIGHWAY SPEEDS AND TWICE AT SPEEDS BELOW 10 MPH.     THE ISSUE SEEMS TO OCCUR RANDOMLY. WHEN IT OCCURS THE CHECK ENGINE LIGHT, VTM4 LIGHT, VSA LIGHT AND A FEW OTHER WARNING LIGHTS LIGHT UP ON THE INSTRUMENT PANEL. WHEN THIS OCCURS THE TRUCK WILL SLOW DOWN GRADUALLY WITH NO RESPONSE FROM THE ACCELERATE PEDAL. I HAVE TO PULL TO THE SIDE OF THE ROAD TURN OFF THE TRUCK AND TURN BACK ON. THE TRUCK OPERATES NORMALLY AFTER IT IS TURNED BACKED ON (CHECK ENGINE LIGHT STAYS ON FOR ABOUT 100 MORE MILES THEN TURN OFF). I HAVE SAFETY CONCERNS WITH THIS HAPPENING AGAIN ON A BUSY HIGHWAY.",
        "vin": "2HJYK16557H"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/22/2015",
        "dateOfIncident": "08/09/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10758527,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE TRAVELING IN THE ADIRONDACKS ON 08-09-2015 WHEN SUDDENLY WITHOUT WARNING THE CAR STARTED TO JERK A FEW TIMES THEN AS IT WAS IN DRIVE I HAD NO FORWARD MOTION IN DRIVE.I PUSHED THE ACCELERATOR DOWN AND THE CAR ACTED AS IF IT WAS IN NEUTRAL.I SLOWLY CAME TO A STOP ON THE SIDE OF THE ROAD AND SAW THE RADIATOR AND TRANSMISSION FLUID WERE LEAKING FROM THE CAR.WE CALLED AAA AND HAD IT TOWED TO A GARAGE.THE MECHANIC INFORMED US THE RADIATOR WAS NO GOOD AND NEEDED TO BE REPLACED.THE COOLING SYSTEM WAS BLED AND THE THERMOSTAT AND RADIATOR REPLACED.AT THIS TIME THE CAR WAS DRIVABLE BUT WAS STILL OVERHEATING.THE MECHANIC THAT SAID HE BELIEVED IT MAY BE A CRACKED HEAD OR HEAD GASKET THEY NEEDED REPAIR.WE HAD TO LEAVE OUR CAR IN THE ADIRONDACKS AND RETURN HOME IN A RENTAL.THIS WAS ON  08-14-2015.  TODAY IS 08-22-2015 AND WE ARE STILL WAITING FOR WORD ON THE REPAIR PROCESS.  MY COMPLAINT IS THAT AFTER THIS HAPPENED WE FOUND OUT THAT WHAT HAPPENED TO US HAS HAPPENED TO OTHER RIDEGLINE OWNERS.THERE SEEMS TO BE A DEFECT IN A WASHER ON THE RADIATOR THAT IS MADE FROM A DIFFERENT ALLOY FROM THE REST OF THE VEHICLE.THIS WASHER CAN FAIL AT ANY TIME,AND WHEN IT DOES IT MIXES TRANSMISSION FLUID AND RADIATOR FLUID TOGETHER AND CAUSES CATASTROPHIC DAMAGE TO THE RADIATOR AND ENGINE.    COULD SOMEONE PLEASE LET ME KNOW WHY HONDA WILL NOT DEAL WITH THIS AND ISSUE A RECALL,ALSO IF THEY DO ISSUE A RECALL IN THE FUTURE WILL ANY OF IT COVER THE REPAIRS I MAKE NOW.",
        "vin": "2HJYK16387H"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/18/2015",
        "dateOfIncident": "06/16/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10734963,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE LOCKOUT SWITCH FAILED. TRUCK WOULD NOT SHIFT SINCE BRAKE APPLIED DID NOT REGISTER THROUGH SWITCH. BRAKE LOCKOUT SWITCH WAS REPLACED. WE TOOK THE FAILED BRAKE LOCKOUT SWITCH APART AT THE FACTORY SEAM/KEEPERS AND IT SMELLED LIKE INTERNALS HAD MELTED AND OR BURNED, A SMOKE LIKE SMELL. I STILL HAVE THE FAILED PART IN POSESSION.",
        "vin": "2HJYK16337H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/16/2015",
        "dateOfIncident": "05/01/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10716824,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER STARTING TRUCK AND LEAVING DRIVEWAY SRS LIGHT CAME ON. IT DOES THIS EACH TIME YOU START DRIVING TRUCK NOW. WENT TO DEALER, PAID FEE TO PUT IT ON THEIR COMPUTER AND IT SAID NOTHING WAS WRONG. THEY RESET LIGHT AND IT CAME ON AGAIN. THE DEALER LOOKED AT IT AGAIN (NO CHARGE THIS TIME) AND SAID THEY FEEL IT IS THE DRIVER SIDE SEAT SENSOR THAT IS PART OF THE SRS SYSTEM. IT WILL BE ABOUT $1200.00 TO REPLACE IT, IT MAY NOT FIX THE PROBLEM AND IS NOT COVERED BY HONDA EVEN THOUGH IT IS PART OF THE AIRBAG SAFETY SYSTEM. HOW CAN A SAFETY FEATURE NOT BE COVERED FOR THE LIFE OF VEHICLE LIKE SEAT BELTS? HONDA HAS HAD SO MANY AIR BAG RECALLS HOW IS THIS ANY DIFFERENT?",
        "vin": "2HJYK16527H"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/03/2015",
        "dateOfIncident": "03/28/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10703576,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE HAS CATASTROPHIC INTERNAL ENGINE FAILURE. THERE WAS NO INDICATION OF ANY ISSUE WITH MY VEHICLE. I HAD MY 3 YEAR OLD GRANDSON WITH ME AND WE WERE OUT TO RUN A QUICK ERRAND. I DETECTED A STRANGE NOISE THAT I THOUGHT WAS A STONE IN MY WHEEL.  I DECIDED TO TURN THE TRUCK AROUND AND FOREGO THE ERRAND, AS IT WAS AN ODD NOISE. MOMENTS AFTER I TURNED THE TRUCK AROUND MY VTM-4 AND VSA WARNING LIGHTS CAME ON. I PULLED TO THE SIDE OF THE ROAD AND LOOKED THESE WARNING LIGHTS UP IN MY OWNER'S MANUAL. BASED ON WHAT I READ, THEIR WAS NO DANGER IN PROCEEDING SLOWING, AS THESE INDICATOR LIGHTS ARE RELATED TO STABILIZATION AND EQUAL DISTRIBUTION OF TORQUE. THE MANUAL SUGGESTED IT BE TAKEN TO A MECHANIC. I NO SOONER PULLED OUT AND THE ENGINE LIGHT CAME ON AND THE RIDGELINE CEASED. I HAD NO STEERING, NO POWER, NOTHING. I MANAGED TO GET TO THE SIDE OF THE ROAD. THANKFULLY, I WAS NOT ON THE HIGHWAY AND WAS GOING AT A SLOW RATE OF SPEED, OTHERWISE I WOULD NOT HAVE BEEN ABLE TO CONTROL THE VEHICLE. NEEDLESS TO SAY, IT WAS A SCARY EXPERIENCE FOR MY GRANDSON AND ME. I HAD TO HAVE THE RIDGELINE TOWED TO MY MECHANIC AND IT HAS BEEN DETERMINED THAT A PISTON RING BROKE AND GOUGED THE CYLINDER. THE ENGINE NEEDS REPLACED. I TALKED TO HONDA OF AMERICA TO INQUIRE IF THIS HAS BEEN A PROBLEM HISTORICALLY WITH THIS ENGINE, BUT COULDN'T GET A STRAIGHT ANSWER. I PURCHASED THE EXTENDED WARRANTY OFFERED WITH THIS VEHICLE BUT IT EXPIRED AT 100,000 MILES. I AM CONVINCED THAT THIS IS A MANUFACTURING  DEFECT BASED ON THE INFORMATION I HAVE SINCE READ REGARDING THIS TYPE OF INCIDENT WITH THIS ENGINE. BECAUSE MY WARRANTY HAS EXPIRED, I BEAR THE COST OF THIS EXPENSE. DISAPPOINTED THAT MY HONDA DIDN'T LIVE UP TO IT'S REPUTATION. THIS IS A VEHICLE  THAT WAS WELL MAINTAINED, WITH AN EXPECTED ENGINE LIFE OF TENS OF THOUSANDS MORE MILES.   *TR",
        "vin": "2HJYK16577H"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/10/2014",
        "dateOfIncident": "06/10/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10663333,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HONDA RIDGELINE. THE CONTACT STATED THAT THE IGNITION BECAME INOPERABLE AND FAILED TO TURN. THE FAILURE RECURRED ON SEVERAL OCCASIONS. THE VEHICLE WAS TAKEN TO A DEALER. THE TECHNICIAN DIAGNOSED THAT THE VEHICLE NEEDED A NEW IGNITION AND KEY. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE FAILURE MILEAGE WAS 100,000.",
        "vin": "2HJYK16327H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/19/2014",
        "dateOfIncident": "11/19/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10659302,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "HONDA POSTED ON YOUR WEBSITE THAT THEY WOULD REPAIR AIR BAGS TO VEHICLES OUTSIDE OF THE REGIONS THEY THINK ARE LIMITED TO AIR BAG PROBLEMS. I CALLED HONDA AMERICA AND THEY REFUSED TO REPAIR THE AIR BAG IN MY RIDGELINE EVEN THOUGH THEY SAID IT IS A TAKATA AIR BAG. I WANT IN REPAIRED FOR MY AND MY FAMILIES PERSONAL SAFETY AND PEACE OF MIND.  *TR",
        "vin": "2HJYK16557H"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/23/2014",
        "dateOfIncident": "06/08/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 10649487,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE ONE TRAVELING AT HIGH RATE OF SPEED & WITHOUT BRAKING, CROSSED INTO ONCOMING TRAFFIC STRUCK (OUR VEHICLE) HONDA TRUCK FROM DRIVER FRONT SIDE WITH PARTIAL FRONT IMPACT CAUSING HONDA TRUCK TO THEN CROSS SLOW LANE TRAFFIC AND COME TO REST IN FIELD OFF THE ROADWAY.  THE DRIVER SUFFERED CUTS ON NECK AREA. I WAS SEATED IN THE PASSENGER FRONT AND SUFFERED THE WORSE INJURY WITH AN UNEXPLAINED STRAIGHT CUT SPLITTING MY HAND FROM TOP BETWEEN KNUCKLES ALL THE WAY TO MY MID PALM.  THERE WERE NO EXPLANATIONS FOR THE STRAIGHT CUT. THERE WERE NO BROKEN WINDOWS ETC. OUR VEHICLE WAS COMPLETELY TOTALED FROM IMPACT AND TO MY KNOWLEDGE ALL AIRBAGS DEPLOYED. BOTH THE EMERGENCY ROOM DOCTOR & ORTHOPEDIC AGREED EVEN IF THE AIRBAG HAD FORCED MY INDEX & MIDDLE FINGERS APART IT WOULD NOT BE A STRAIGHT LINE CUT BUT A RIPPED JAGGED SKIN TYPE WOUND. SO BOTH DOCTORS AGREED THERE WAS NO REASONABLE EXPLANATION FOR MY INJURY UNLESS MAYBE THE PLASTIC PIECE COVERING THE AIRBAG COULD HAVE SOMEHOW SLICED ME LIKE A KNIFE?  PASSENGER IN THE DRIVER REAR SEAT SUFFERED CUTS ON FACE HAVING THE APPEARANCE OF MULTIPLE CAT SCRATCHES DEEP ENOUGH TO CAUSE BLEEDING.  WE DO BELIEVE AFTER SEEING THE RECALL THE MEDAL SHAVINGS FROM AN AIRBAG DEFECT WOULD EXPLAIN MY INJURY.  I ENDURED 16 STITCHES BETWEEN MY FIRST & SECOND FINGERS ON MY RIGHT HAND FROM ONE SIDE TO OTHER, WITH AN ADDITIONAL COUPLE OF SUTURES ON THE INDEX FINGER ITSELF FOR A SEPARATE CUT.  I HAVE PICTURES OF OUR INJURIES & A FEW OF THE VEHICLE ITSELF IF THAT WOULD ASSIST YOU WITH FURTHER INVESTIGATION.  *TR...UPDATED 12/10/15 *BF  *JS",
        "vin": "2HJYK16507H"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/15/2014",
        "dateOfIncident": "08/16/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10633123,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING 65 MPH ABRUPT LOSS OF ENGINE POWER INCLUDING POWER STEERING AND BRAKES. ENGINE WOULD NOT START. FINDINGS OF \"SEIZED\" WATER PUMP AND PULLEYS WHICH \"SHREDDED\" TIMING BELT RESULTING IN ENGINE VALVES BEING \"BENT IN HEAD\".   FORTUNATELY NO COLLISION OR INJURY, THOUGH SIGNIFICANT POTENTIAL FOR SAME  EXTENSIVE REPAIR TOTALING $5,000.  ORIGINAL TIMING BELT. RECOMMENDED REPLACEMENT 105K MILES PER HONDA.   [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "2HJYK16577H"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "09/09/2014",
        "dateOfIncident": "09/01/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10630806,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "2007 HONDA RIDGELINE.  CONSUMER WRITES IN REGARDS TO LIFT UP REAR SEAT DEFECT.  *SMD  THE CONSUMER STATED WHEN THE LIFT-UP SEAT WAS LOWERED, ITS SUPPORTING LEGS WOULD LOCK INTO PLACE. HOWEVER, WHEN THE SEAT WAS RETURNED TO THE STORED, OR UPRIGHT POSITION, THE LEGS REMAINED EXTENDED AND WOULD NOT LOCK INTO PROPER STORAGE. *JB",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/16/2014",
        "dateOfIncident": "07/15/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10611099,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEATER/AC BLOWER MOTOR QUIT WORKING.  FOUND THE WIRE HARNESS TO THE BLOWER MOTOR MELTED.  FIRE HAZARD!!!  *TR",
        "vin": "2HJYK16357H"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "04/30/2014",
        "dateOfIncident": "04/23/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10585764,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "BACK MIDDLE WINDSHIELD SHATTERED WHILE STOPPED AT A STOP SIGN, GLASS SHATTERED INTO THE BACKSEAT AND FLOOR BOARD.    *JS",
        "vin": "2HJYK16337H"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/31/2014",
        "dateOfIncident": "02/01/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10575981,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HONDA RIDGELINE. THE CONTACT STATED THAT THE DRIVER'S SIDE DOOR FAILED TO OPEN WHEN USING THE INTERIOR DOOR HANDLE. THE VEHICLE WAS TAKEN TO THE DEALER HOWEVER,THE TECHNICIAN WAS UNABLE TO DIAGNOSE THE FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 77,000 AND THE CURRENT MILEAGE WAS 78,000.",
        "vin": "2HJYK16527H"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/03/2014",
        "dateOfIncident": "02/28/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10566804,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING VEHICLE EXPERIENCED A COMPLETE LOSS OF BRAKING CAPABILITY DUE TO FAILURE OF THE BRAIDED PORTION (BOTTOM END) OF HONDA PART: PIPE V, BRAKE PART NUMBER: 46375-SJC-A51.  *TR",
        "vin": "2HJYK16287H"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/03/2013",
        "dateOfIncident": "11/23/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10554588,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "HIT A DEER AT 55 MPH, DEAD CENTER ON THE FRONT OF MY VEHICLE. ENTIRE FRONT END WAS CAVED IN BUT THE AIR BAGS DIDN'T DEPLOY. I WAS TOLD BY THE INSURANCE ADJUSTER THAT THE DEPLOYMENT SENSOR IS LOCATED BEHIND THE RADIATOR, AND HE WAS SURPRISED ALSO THAT THE BAGS DIDN'T DEPLOY. THIS IS A PUBLIC SAFETY ISSUE THAT NEEDS TO BE HANDLED SWIFTLY. I'M THANKFUL THAT I DIDN'T RUN OFF THE ROAD AND HIT A TREE. IF YOU THINK YOU'RE GOING TO BE PROTECTED BY AIRBAGS IN THE EVENT OF A CRASH, DON'T BE LULLED INTO A FALSE SENSE OF SECURITY. THIS IS A MAJOR SAFETY FAILURE ON THE PART OF HONDA USA.  *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/06/2013",
        "dateOfIncident": "08/06/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10533864,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG DASHBOARD LIGHT AND FRONT PASSENGER AIRBAG LIGHT ACTIVATED DESPITE NO COLLISION TO TRIGGER THEM.  INDEPENDENT MECHANIC SAYS THE AIR BAGS HAVE BEEN ACTIVATED AND NEED TO BE REPLACED.  ADVISED TO HAVE EVALUATED BE HONDA DEALER  FOR WHICH I AM LOATHE TO DO SINCE THEY ALWAYS \"PAD THE BILL''.  THIS SEEMS TO BE A MANUFACTURE DEFECT.  *TR",
        "vin": "2HJYK16547H"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/13/2013",
        "dateOfIncident": "05/10/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10511604,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTED VEHICLE AND NOTICED THAT BOTH LOW BEAM HEADLIGHTS WERE NOT WORKING. ALL OTHER RUNNING LIGHTS WERE WORKING (TAIL LIGHTS, PARKING LIGHTS, FOG LIGHTS, TURN SIGNALS, ETC). HIGH BEAM HEADLIGHTS WERE BOTH WORKING. HAD REPLACED THE HEADLIGHT BULBS ABOUT 90 DAYS AGO. HAVE HAD NO PROBLEMS PRIOR TO THE FAILURE. I'VE HEARD IN RESEARCHING THE PROBLEM A PRIOR RECALL FOR THE HEADLIGHT WIRING ON EARLIER HONDA CR-V'S, PILOTS AND CIVICS. AM WONDERING IF THIS IS A RELATED PROBLEM? *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/27/2012",
        "dateOfIncident": "11/27/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10486270,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTED VEHICLE AND NOTICED THAT BOTH LOW BEAM HEADLIGHTS WERE NOT WORKING. ALL OTHER RUNNING LIGHTS WERE WORKING (TAIL LIGHTS, PARKING LIGHTS, FOG LIGHTS, TURN SIGNALS, ETC). HIGH BEAM HEADLIGHTS WERE BOTH WORKING. HAD REPLACED THE HEADLIGHT BULBS ABOUT A MONTH AGO. HAVE HAD NO PROBLEMS PRIOR TO THE FAILURE. IN RESEARCHING THE PROBLEM I FOUND A PRIOR RECALL FOR THE HEADLIGHT WIRING ON EARLIER HONDA CR-V'S, PILOTS AND CIVICS. AM WONDERING IF THIS IS A RELATED PROBLEM?  *TR",
        "vin": "2HJYK16577H"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/18/2012",
        "dateOfIncident": "02/17/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10448394,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MY COMPLAINT IS I HAVE A 2007 RIDGELINE RTS W/83000 MI, ORIG OWNER. NOTICED THIS AND BROUGHT TO DEALER AT 50K THAT UNDER VERY LIGHT LOAD, TOP GEAR, ~45-48 MPH, TORQUE CONVERTER \"PULSES\" IN AND OUT OF LOCKUP WHICH PRODUCES A SLIGHT AUDIBLE AND VIBRATION SENSATION. TACH NEEDLE PULSES TO CONFIRM AND SEEMS TO BE GETTING WORSE AT TRUCK AGES.  *TR",
        "vin": "2HJYK16447H"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,POWER TRAIN,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/24/2012",
        "dateOfIncident": "01/21/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10445058,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "1.  AT A CONSTANT SPEED OF APPROXIMATELY 45 MPH, LEVEL SURFACE OR SLIGHT UPHILL GRADE, TRANSMISSION IN OD, TORQUE CONVERTER LOCKED,  I EXPERIENCE A SERIOUS VIBRATION AND AUDIBLE TONE COMING FROM THE ENGINE COMPARTMENT.  IN ADDITION, THAT TACH REFLECTS A SLIGHT PULSATION IN ENGINE RPM AT APPROXIMATELY 1500 RPM. THIS IS THE SAME DESCRIPTION AS IN THE ODYSSEY AND ELEMENT RECALLS WHICH INDICATES A FAULTY TORQUE CONVERTER.    2.  BRAKE PEDAL IS SPONGY AND SOFT.  WHEN APPLYING BRAKES, THE PEDAL DROPS TO A LEVEL CLOSE TO THE FLOOR. BRAKING IS MINIMAL.  WHEN APPLYING 2 PUMPS OF THE PEDAL WHILE BRAKING, THE PEDAL BECOMES FIRM AND HIGH, AS IT SHOULD.  BRAKING THEN APPEARS FINE.  MY BRAKES WERE BLED TWO TIMES.  ON BOTH OCCASIONS,  A CONSIDERABLE AMOUNT OF AIR WAS REMOVED FROM THE LINES.  THE PROBLEM QUICKLY REAPPEARED AFTER BLEEDING THE BRAKES.  THERE WERE NO BRAKE FLUID LEAKS ANYWHERE, JUST AIR IN THE LINES.   SIMILAR TO THE ODYSSEY AND ELEMENT RECALL, THE VSA MODULATOR IS ALLOWING A SMALL AMOUNT OF AIR INTO THE SYSTEM ON INITIAL START.    3.  THE RIGHT REAR OUTER BRAKE PAD WEARS PREMATURELY.  MY RIDGELINE JUST TURNED 100K MILES.  I RECENTLY INSTALLED THE THIRD SET OF REAR BRAKE PADS AND THE SECOND SET OF ROTORS.  THE CALIPER PISTONS AND ATTACHING HARDWARE MOVED FREELY AND WAS FREE OF CORROSION.  I BELIEVE ISSUE # 2, AIR IN LINES, MAY CONTRIBUTE TO THIS.  THE BRAKES WITH THE LEAST AMOUNT OF AIR IN THE LINES ARE PERFORMING THE MAJORITY OF THE BRAKING, THEREFORE WEARING THOSE PARTICULAR PADS BEFORE THE OTHERS.  *TR",
        "vin": "2HJYK16307H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/05/2012",
        "dateOfIncident": "01/01/2011",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10442501,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MY COMPLAINT IS SIMILAR TO THE COMPLAINTS THAT HONDA ODYSSEY OWNERS HAVE EXPERIENCED.  I HAVE A 2007 RIDGELINE RTX W/102000 MI, ORIG OWNER. NOTICED IT MANY MILES AGO (65K) THAT UNDER VERY LIGHT LOAD, TOP GEAR, ~45-48 MPH, TORQUE CONVERTER \"PULSES\" IN AND OUT OF LOCKUP WHICH PRODUCES A SLIGHT AUDIBLE AND VIBRATION SENSATION. TACH NEEDLE SHOWS PULSE TOO. SEEMS TO BE GETTING WORSE AT TRUCK AGES.     CHANGING THROTTLE POSITION CAUSES TORQUE CONVERTER TO UNLOCK, BUT PULSE WILL RETURN ONCE IT RE-LOCKS ONCE \"CRUISING @ 45-48 MPH\" RESUMES.  *TR",
        "vin": "2HJYK16307H"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/26/2011",
        "dateOfIncident": "10/05/2011",
        "fire": true,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10432912,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HONDA RIDGELINE TRUCK. WHILE DRIVING APPROXIMATELY BETWEEN 50-75 MPH, THE CONTACT NOTICED SMOKE EMITTED FROM UNDERNEATH THE FRONT PASSENGER'S SIDE DASHBOARD. THE CONTACT MANEUVERED TO THE SIDE OF THE ROAD TO INSPECT THE VEHICLE AND DETECTED THE AIR CONDITIONER CONTROL HEAD, WIRING HARNESS CONNECTOR AND BLOWER MOTOR MELTED. IMMEDIATELY THE BLOWER MOTOR WIRES WERE DISCONNECTED AND THE CONTACT RESUMED IN OPERATION. THERE WAS A RECALL ASSOCIATED WITH NHTSA CAMPAIGN ID NUMBER 10V001000 (ELECTRICAL SYSTEM: INSTRUMENT PANEL). THE VEHICLE WAS REPAIRED UNDER THE RECALL WHICH INCLUDED THE REPLACEMENT OF THE WIRING HARNESS CONNECTOR; HOWEVER THE BLOWER MOTOR PROTECTIVE COVER WAS NOT INSTALLED WHICH WAS MENTIONED IN THE RECALL REMEDY. THE MANUFACTURER WAS NOTIFIED OF THE PROBLEM. THE APPROXIMATE FAILURE MILEAGE WAS 76,000.",
        "vin": "2HJYK16427H"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/13/2011",
        "dateOfIncident": "06/13/2011",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10406149,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Michelin North America, Inc.",
                "productMake": "MICHELIN NORTH AMERICA",
                "productModel": "LTX A/T 2",
                "productYear": "9999",
                "size": "LT 275/70R18",
                "type": "Tire"
            }
        ],
        "summary": "ALL 4 TIRES ARE PREMATURELY DRY ROTTING CAUSING A SAFETY HAZZARD  FOR THE DRIVER, PASSENGERS AND OTHER DRIVERS ON THE ROAD. TRUCK HAS 33,000 MILES AND IS 4 YRS OLD.  OTHER RIDGELINE OWNERS HAVE REPORTED SAME PROBLEM WITH SAME TIRES AT HONDARIDGELINEOWNERS.COM.  *TR",
        "vin": "2HJYK16597H"
    },
    {
        "components": "STEERING,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/06/2010",
        "dateOfIncident": "11/01/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10369303,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WE OWN A 2007 HONDA RIDGELINE.  THE METAL INNER RING ON THE STEERING WHEEL SEPARATED FROM THE RUBBERY OUTER RING.  THIS DEFECT CAUSES THE OUTER RING TO TWIST AND GIVE OFF AN ODOR.  THE ODOR MAKES ME FEEL LIKE I NEED TO VOMIT.  THE COMBINATION OF THE UNSECURED OUTER RING AND THE DISTRACTION OF THE URGE TO VOMIT MAKES FOR UNSAFE DRIVING.  THIS STARTED OVER A YEAR AGO AND HAS GRADUALLY GOTTEN WORSE.  WE CONTACTED HONDA AS WELL AS OUR EXTENDED WARRANTY COMPANY AND GOT NO HELP.  WE WOULD LIKE THE STEERING WHEEL REPLACED.  *TR",
        "vin": "2HJYK16377H"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "11/24/2010",
        "dateOfIncident": "11/06/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10367774,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 HONDA RIDGELINE. THE CONTACT STATED THAT THE TIRE PRESSURE MONITORING SYSTEM MALFUNCTIONED BECAUSE THE VALVE STEM WAS CORRODED AND UNABLE TO BE OPENED. THE VEHICLE WAS INSPECTED BY AN AUTHORIZED DEALER WHO OFFERED NO ASSISTANCE. THE VEHICLE HAD NOT BEEN REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 80,000.",
        "vin": "2HJYK16317H"
    },
    {
        "components": "VISIBILITY,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/21/2010",
        "dateOfIncident": "11/10/2007",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10361646,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THREE BROKEN WINDSHIELDS IN 3 YEARS.  CRACK ALWAYS STARTS IN LOWER LEFT CORNER.  HAPPENS ONCE A YEAR.  HONDA WILL NOT REPLACE SO I PAY 600 - 800 EVERY YEAR.  DRIVE FOR ABOUT 9 MONTHS - BREAKS AGAIN.  WAIT A FEW MONTHS - REPLACE WINDSHIELD.  BREAKS AGAIN . . . .  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/26/2010",
        "dateOfIncident": "08/19/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10351909,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "2007 HONDA RIDGELINE RADIATOR FAILURE, CAUSED THE ENGINE TO OVERHEAT AND ANTIFREEZE LEAK INTO TRANSMISSION FLUID. *TR",
        "vin": "2HJYK16587H"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/03/2010",
        "dateOfIncident": "05/03/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10328607,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HONDA RIDGELINE. THE CONTACT STATED  HE RECEIVED NOTIFICATION OF NHTSA RECALL CAMPAIGN ID NUMBER:  10V001000 (ELECTRICAL SYSTEM: INSTRUMENT PANEL). THE CONTACT MADE AN APPOINTMENT FOR REPAIRS AND WHEN ARRIVING AT THE DEALER HE WAS ADVISED THE PARTS NEEDED TO MAKE THE REPAIRS HAD NOT YET ARRIVED. THE DEALER ADVISED THE CONTACT THAT HE WOULD NEED TO RESCHEDULE HIS APPOINTMENT. THE CONTACT DID NOT FEEL THE RECALL HAD ADDRESSED THE SAFETY DEFECT WITHIN A REASONABLE TIME FRAME. THE CURRENT MILEAGE WAS 52,478.",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "05/02/2010",
        "dateOfIncident": "03/01/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10328442,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2007 HONDA RIDGELINE AND THE REAR SLIDING WINDOW SHATTERED INTO THE PASSENGER COMPARTMENT FOR NO APPARENT REASON WHILE DRIVING. I REPORTED IT TO THE POLICE AS I THOUGHT THAT IT WAS POSSIBLE THAT SOMEONE MIGHT HAVE SHOT IT OUT WITH A BULLET. I HAVE SINCE LEARNED THAT THIS HAS HAPPENED SEVERAL TIME SWITCH OTHER HONDA RIDGELINES. *TR",
        "vin": "2HJYK16547H"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "04/28/2010",
        "dateOfIncident": "04/28/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10327998,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT DRIVERS SEAT HAS BECOME LOOSE AND WILL SHIFT SIDE TO SIDE UPON TURNING A CORNER OR TRAVERSING A SPEED BUMP. PRESENTED PROBLEM TO DEALERSHIP WHERE THEY STATED THAT THE FRONT SEAT BOLTS/SCREWS WERE TIGHTENED DOWN YET THIS HAS NOT FIXED THE PROBLEM. THIS PROBLEM OCCURS ALL  THE TIME AND HAS ME CONCERNED THAT THE SEAT WILL ULTIMATELY BECOME DISLODGED COMPLETELY, POTENTIALLY RESULTING IN INJURY OR AN ACCIDENT. UPON READING AND RESEARCHING SEAT PROBLEMS WITH HONDA ON THE INTERNET, IT APPEARS AS THOUGH THIS IS A RECURRENT PROBLEM WITH HONDA MANUFACTURING ACROSS THE BOARD WITH MANY MAKES AND MODEL YEARS. *TR",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "04/05/2010",
        "dateOfIncident": "04/02/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10323903,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER REAR WINDOW CENTER SLIDER PIECE SHATTERED.  I WAS DRIVING ON HIGHWAY WITH ALL THE WINDOWS AND REAR SLIDER OPEN. THE CENTER SLIDING PORTION OF THE WINDOW WAS IN THE OPEN POSITION WHEN IT SHATTERED SENDING GLASS FRAGMENTS THOUGH OUT THE VEHICLE. THE GLASS COVERED THE BACKSEAT, BACKSEAT FLOOR, AND SOME ON THE DASHBOARD AND FRONT FLOOR.  THE REPLACEMENT GLASS IS ON ORDER FROM THE DEALERSHIP. *TR",
        "vin": "2HJYK16597H"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/08/2010",
        "dateOfIncident": "02/10/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10317788,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2007 HONDA RIDGELINE WAS INVOLVED IN AN ACCIDENT. THE VEHICLE STRUCK ANOTHER VEHICLE AND DUE TO A SHORT CIRCUIT THE AIR BAGS DID NOT DEPLOY.   THE CONSUMER STATED IT WAS NOTED BY THE TECHNICIAN THAT A SHORT CIRCUIT CAUSED BY A FAULTY GROUND WIRE DISABLED THE AIR BAG SYSTEM. UPDATED 04/28/10",
        "vin": "2HJYK16347H"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/08/2010",
        "dateOfIncident": "02/10/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10317891,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 2/10/10 AT APPROXIMATELY 11:00AM MY 2007 HONDA RIDGELINE WAS INVOLVED IN A COLLISION ON FLORENCE & HENNESS IN THE CITY OF CASA GRANDE, AZ. THE VEHICLE SUSTAINED FRONT END DAMAGE AFTER REAR ENDING ANOTHER VEHICLE. THE RIDGELINE WAS TRAVELING APPROXIMATELY 20 MPH AT THE TIME OF IMPACT. IT WAS NOTED IMMEDIATELY AFTER THE ACCIDENT THAT THE INSIDE CAB HAD A BURNING ODOR. IT WAS ALSO NOTED THAT THE AIRBAGS DID NOT DEPLOY. AFTER FURTHER INVESTIGATION BY HONDA SERVICE TECHNICIANS LOCATED AT SAN TAN HONDA, IT WAS DETERMINED THAT A SHORT CIRCUIT CAUSED BY A FAULTY GROUND WIRE DISABLED THE AIR BAG SYSTEM. *TR",
        "vin": "2HJYK16347H"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/12/2010",
        "dateOfIncident": "02/10/2010",
        "fire": true,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10310057,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "2007 HONDA RIDGELINE HEATER MOTOR STOPPED BLOWING.  TROUBLESHOOT THE PROBLEM AND FOUND A MELTED WIRING HARNESS.  DID SOME RESEARCH AND FOUND THE RECALL TO TAKE PLACE IN MARCH.  CALLED HIDY HONDA TO REQUEST A FIX AND WAS TOLD MY VEHICLE IS NOT COVERED.  CALLED HONDAUSA AND WAS TOLD THE SAME THING.  AT THIS POINT I NEED THE MOTOR FOR DEFROST PURPOSES.  I AM PURCHASING THE MOTOR ON MY OWN AND WILL REPAIR MYSELF IF I CAN GET PARTS AT ALL.  *TR",
        "vin": "2HJYK16297H"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/29/2010",
        "dateOfIncident": "01/14/2007",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10303138,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "HEAD LIGHTS BURN OUT ABOUT EVERY EIGHT THOUSAND MILES. *TR",
        "vin": "2HJYK16507H"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "07/24/2009",
        "dateOfIncident": "01/11/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10278162,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDSHIELD WIPERS STOP WHILE DRIVING WHEN IT IS SNOWING. *TR",
        "vin": "2HJYK16257H"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/21/2009",
        "dateOfIncident": "06/23/2009",
        "fire": true,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10277584,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 HONDA RIDGELINE.  THE CONTACT TOOK THE VEHICLE TO THE DEALER FOR ROUTINE MAINTENANCE, AN OIL CHANGE, AND A TIRE ROTATION.  AN HOUR AFTER HE ARRIVED BACK HOME, HE NOTICED SMOKE COMING FROM THE REAR TAIL LIGHT AREA.  WITHIN SECONDS, FLAMES APPEARED WHILE THE VEHICLE WAS PARKED IN THE GARAGE.  THE CONTACT WAS ABLE TO EXTINGUISH THE FLAMES.  THE FIRE DEPARTMENT ARRIVED AND THE INSURANCE COMPANY IS INVESTIGATING THE FAILURE.  THE MANUFACTURER STATED THAT THERE WERE NO RECALLS AND HAVE NOT RECEIVED ANY REPORTS CONCERNING FIRES WITH THIS MODEL VEHICLE.  THE MANUFACTURER STATED THAT THEY WOULD WORK WITH THE INSURANCE INVESTIGATORS.  THE ISSUE AS WELL.  THE DEALER STATED THAT THE FIRE WAS CAUSED BY AN ELECTRICAL MALFUNCTION.  SEVERAL PARTS WERE REPLACED IN THE VEHICLE, BUT THE CONTACT DID NOT KNOW WHICH ONES.  THE CURRENT AND FAILURE MILEAGES WERE 28,000.  UPDATED 08/28/09. *LJ  UPDATED 09/02/09.*JB",
        "vin": "2HJYK16527H"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/15/2009",
        "dateOfIncident": "07/05/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10276930,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "2007 HONDA RIDGELINE WITH APPROX 52,000 MILES THE A/C STOP BLOWING FOR NO REASON. TOOK IT TO FREEMAN HONDA DALLAS,TX. SAID BAD TRANSISTOR AND BLOWER. HAD TO WAIT FOR PARTS 2 DAYS. THE PARTS CAME IN  AND  THEN THEY  SAID I NEEDED A WIRE HARDNESS BECAUSE THE WIRE HARDNESS WAS MELTED APPROX 4 FEET IN DASH . YOU WOULD THINK THAT THEY WOULD CHECK THE WIRE HARDNESS WHEN THEY TELL YOU IT'S THE TRANSISTOR AND THE BLOWER. HAD TO WAIT ANOTHER DAY TO ORDER WIRE HARDNESS JUST TO FIND OUT THAT THE WIRE HARDNESS IS BACK ORDER NATIONWIDE . THE DEALERSHIP RIGGED UP ANOTHER WARRANTY WIRE HARDNESS TO GET MY TRUCK BACK TO ME OR ELSE I HAD TO WAIT 3WEEKS FOR THE WIRE HARDNESS.THEY WARRANTY THE WORK FOR 12,000 OR 12 MONTHS, BUT I HAD TO PAY OUT OF MY POCKET $730.83 . I  FEEL THAT I SHOULDN'T HAVE TO PAY FOR SOMETHING THAT IS NOT MY FAULT . APPARENTLY  IM NOT THE FIRST ONE WITH THIS ISSUED THAT'S PROBABLY WHY THEIRS A NATION WIDE BACK ORDER ON WIRE HARDNESS. MY SELF AS WELL AS MANY OTHERS ON THE INTERNET FEEL THAT IT IS A FIRE AND SAFETY HAZARD THAT NEEDS TO BE RECALLED BY HONDA IT IS NOT FAIR TO CONSUMERS. *TR",
        "vin": "2HJYK16517H"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "07/10/2009",
        "dateOfIncident": "04/15/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10276327,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "HELLO,    IN WISCONSIN IT IS NOT UNCOMMON TO GET A SMALL AMOUNT OF ICE AND SNOW ACCUMULATION ON A CAR.    WHEN SNOW AND ICE ACCUMULATE THEIR IS ALWAYS A SMALL AMOUNT USUALLY LESS THAN 1/4 INCH THAT IS IMPOSSIBLE TO SCRAPE OFF WITHOUT DESTROYING THE PAINT ON THE VEHICLE.    ON THE OTHER 24 CARS I HAVE OWNED WHEN THIS MELTS AFTER DRIVING A SHORT TIME FROM THE CABIN TEMPERATURE, IT SLIDES ONTO THE WINDSHIELD AFTER BREAKING THE FIRST TIME AFTER MELTING LOOSE.  THE WIPERS THEN PUSH THE SLUSH OFF TO THE SIDES SO YOU CAN SEE.    ON MY 2007 HONDA RIDGELINE INSTEAD OF THAT HAPPENING THE WIPERS SHUT OFF UNDER THE INCREASED MOMENTARY LOAD.  THE ONLY WAY TO GET THEM TO RESET IS TO STOP, TURN THE VEHICLE OFF AND RESTART IT.    THIS IS VERY DIFFICULT TO DO WHEN YOU ARE COMPLETELY BLINDED WITH SLUSH LOOKING FORWARD.  THIS HAS HAPPENED 3 TIMES, THE LAST TIME I WAS COMING UP ON A ROAD BLOCKED OFF DUE TO A FATALITY ACCIDENT.  I SLAMMED ON THE BREAKS, BECAUSE I COULD NOT SEE I ENDED UP STOPPING IN ONCOMING TRAFFIC LANE ABOUT 5 FEET FROM THE POLICE VEHICLE BLOCKING THE ROAD.    I CALLED HONDA SEVERAL TIMES.  THERE LINE IS THAT THE WIPERS MEET FEDERAL STANDARDS AND THEY WILL NOT FIX THE PROBLEM.  MY NEIGHBOR DOWN THE STREET IS ALSO HAVING THE SAME PROBLEM, AND THE DEALERSHIP HAS NOTED THE PROBLEM WITH OTHER RIDGELINES.  MY VEHICLE WA EXAMINED BY THE DEALERSHIP AND IS WORKING AS DESIGNED.    PLEASE FORCE THEM TO FIX THIS PROBLEM BEFORE I OR SOMEBODY ELSE KILLS SOMEONE AS A RESULT OF THIS ISSUE. *TR",
        "vin": "2HJYK16297H"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/07/2009",
        "dateOfIncident": "06/29/2009",
        "fire": true,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10276026,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 6/25/2009 I REPORTED TO MY HONDA DEALER MY AC WAS NOT COOLING PROPERLY  AND THE A/C FAN WAS CONTINOUSLY RUNNING EVEN WITH THE A/C OFF. THEY TOLD ME THAT THEY HAD NO LOANER CARS AVAILABLE AND I SHOULD RETURN ON WED EVENING 7/1/2009 TO DROP OFF ME CAR FOR REPAIRS. . ON  MONDAY AM @ 11:04 (ROSELAND NJ POLICE REPORT) I STARTED MY RIDGELINE AND SMELLED A VERY ACRID ODOR A FEW MINUTES LATER MY CAR INTERIOR FILLED WITH SMOKE AND I HAD TO PULL OVER AND LEAVE MY CAR. BY LUCK I FLAGGED DOWN  A PASSING POLICE CAR AND HE PUT OUT THE FLAMES AND CALLED THE FIRE DEPARTMENT MY CAR HAS 29,400 MILES+/-  AND IS STILL UNDER WARRANTY.THE HONDA DEALER EXPLAINED TO ME THEY KNEW THE PROBLEM TO BE IN SOME SWITCH THAT CONTROLS THE FAN MOTOR, PLEASE TELL ME HOW THIS PART HAS NOT BEEN RECALLED AND WHY THEY LET ME LEAVE THE DEALERSHIP WITH OUT WARNING ME TO NOT OPERATED SUCH A DANGEROUS CAR . I HAVE FOUND OTHER OCCASIONS ON THE INTERNET WHERE SIMILAR RIDGELINE EXPERIENCED THE SAME PROBLEM. THIS WAS THANKFULLY THE ONLY TIME THIS HAPPENED. THE CAR IS AT THE DEALERS NOW. I AM AFRAID TO DRIVE IT  I DON'T BELIEVE IT IS A SAFE CAR.THEY TELL ME THEY WILL FIX IT AS GOOD AS NEW. DUH!  IT BURNED AS A NEW CAR. THIS DEFECT HAS A POTENTIAL FOR GREAT TRAGEDY. *TR",
        "vin": "2HJYK16527H"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/18/2009",
        "dateOfIncident": "06/18/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10274266,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I WOULD LIKE TO FILE A COMPLAINT AGAINST HONDA MOTOR COMPANY FOR THEIR DEFECTIVE CONDENSER THAT THEY BUILD INTO THEIR VEHICLES KNOWING THAT THEY CAN BE EASILY DAMAGED.  THEY ARE AWARE OF THE DEFECT BUT CHOOSE TO IGNORE THAT IT IS AN ISSUE.  THEY ALSO HAVE CHANGED THEIR 2008-2009 MODELS AND CLAIM THAT THEY HAVE THE RIGHT TO CHANGE THEIR MODELS WHENEVER AND HOWEVER THEY WANT.  THEY TRULY ARE NOT CUSTOMER SERVICE ORIENTED.  THIS IS AN UNJUST COST THAT THEY ARE PLACING ON THEIR CONSUMERS. *TR",
        "vin": "2HJYK16467H"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,AIR BAGS,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "04/24/2009",
        "dateOfIncident": "03/01/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10266654,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2007 RIDGELINE FAILED TO ACTIVATE EITHER THE ABS OR THE VSA AS I BEGAN SKIDDING ON THE SNOW THAT WAS BETWEEN THE TIRE LANES. THE DRIVE LANES WERE CLEAR PAVEMENT AND AT 64 MPH IN CRUISE CONTROL I CHANGED LANES AND THE VEHICLE BEGAN 4 WHEEL SKIING ON THE SNOW. I APPLIED THE BRAKE AND LOST ALL CONTROL OF MY  RIDGELINE AS THE VEHICLE WITH ALL 4 WHEELS LOCKED, SKID OVER TO THE SIDE OF THE ROAD AND BECAME ENTANGLED WITH THE SNOW BANK. WITH ALL 4 WHEELS LOCKED THE VEHICLE SLOWED DUE TO THE DEPTH OF THE SNOWBANK. AS IT SLOWED THE RIDGELINE SWUNG AROUND SIDEWAYS AND SLOWLY ROLLED ON ITS SIDE. AT THAT POINT THE SIDE AIR BAG CURTAIN DEPLOYED. SCRATCHING MY EYE BALL AND HITTING MY EAR SO HARD I HAD TO PUT MY HAND TO MY EAR TO SEE IF IT WAS STILL ATTACHED. EITHER THE VSA OR THE ABS SHOULD HAVE ACTIVATED. AND THE DRIVERS AIR BAG SHOULD NOT HAVE DEPLOYED DUE TO THE FACT THE VEHICLE WAS LAYING ON THE PASSENGER SIDE. CAUSING OVER $10,000 DAMAGE. AFTER THE REPAIR I TOOK THE VEHICLE TO MY DEALER AND I WAS TOLD THERE IS NOTHING WRONG WITH ANY OF THE SYSTEMS. NOR WERE THEY CONCERNED THAT THIS INCIDENT, UNDER DIFFERENT CIRCUMSTANCES COULD HAVE EASILY ENDED IN DEATH. *TR",
        "vin": "2HJYK16277H"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/10/2009",
        "dateOfIncident": "03/01/2008",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10261426,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THREE TIMES IN THE PAST YEAR, A PIECE ON THE TOP OF MY 2007 HONDA RIDGELINE HAS BECOME DETACHED. THE FIRST TIME, THE DEALER WHERE I PURCHASED IT REPLACED THE RETAINING CLIPS. THE SECOND TIME, THE PIECE FLEW OFF WHILE I WAS ON THE HIGHWAY, HITTING A CAR BEHIND ME. THE DEALER REFUSED TO FIX IT. I CONTACTED HONDA CORPORATE WHO REFERRED ME TO ANOTHER DEALER, AND THEY FIXED IT REPLACING ALL DESIRED PARTS. THE THIRD TIME WAS JUST THIS PAST SATURDAY. THE SECOND DEALER HAS ASKED TO SEE IT AND SAID THEY WOULD HAVE TO GET SOME PICTURES AND HAVE SOMEONE ELSE LOOK AT IT. THIS IS THREE TIMES IN THE PAST YEAR, AND I BELIEVE I HAVE A LEMON ON MY HANDS. *TR",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "12/23/2008",
        "dateOfIncident": "02/10/2008",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10252628,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS IN FULL SIGHT DURING A 3-HOUR VISIT WITH A FRIEND. UPON LEAVING, NOTICED GLASS ALL INSIDE THE CAB AND BED. CENTER, SLIDING PORTION OF REAR WINDOW APPEARED TO HAVE EXPLODED. NO EVIDENCE OF VANDALISM WHATSOEVER. DEALER STATED THEY WOULD HAVE A FIELD ENGINEER EVALUATE THE SITUATION, BUT AFTER TWO WEEKS THERE WAS NO RESULT, SO I OPTED FOR MY INSURANCE COMPANY TO REPLACE THE GLASS. *TR",
        "vin": "2HJYK16527H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/29/2008",
        "dateOfIncident": "07/26/2008",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10236296,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2007 HONDA RIDGELINE VIN[XXX]  IS LESS THAN A YEAR OLD I WAS DRIVING BACK WITH MY FAMILY WHICH INCLUDES CHILDREN ON I95 SOUTH BOUND. I WAS DOING 70MPH. I DID NOT GO OVER ANYTHING. THE HONDA LOST POWER. I HAD TO GLIDE TO THE SHOULDER OF THE ROAD. THE HONDA WOULD NOT GO INTO DRIVE OR REVERSE. AFTER BEING SENT TO THE HONDA REPAIR I WAS INFORMED THE TRANSMISSION NEEDS TO BE REPLACED.  I ALWAYS KEPT UP WITH MY DAILY MAINTENANCE AT MY LOCAL HONDA DEALER. I DO NOT TRUST THIS HONDA RIDGELINE WITH MY FAMILY OR ANYONE ELSE'S FAMILY. I TOLD THE DEAL I EITHER WANT A NEW CAR OR I WILL GO TO ANOTHER MANUFACTURE AND PURCHASE A NEW CAR. I HAVE A MASTERS DEGREE AND BACHELOR'S DEGREE IN INFORMATION TECHNOLOGY. REPLACING THE TRANSMISSION WILL NOT SAFEGUARD THE CAR. I WOULD LIKE TO KNOW WHY THE TRANSMISSION WENT OUT LESS THAN A YEAR WHEN I PURCHASED THE CAR NEW.      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *TR",
        "vin": "2HJYK16227H"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "05/10/2008",
        "dateOfIncident": "11/01/2007",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10227230,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2007 HONDA RIDGELINE.  MY WIFE COMPLAINS ABOUT THE PASSENGER SEAT HEATING UP ALL THE TIME WITH THE SWITCH IN THE OFF POSITION.  I HAVE ALSO FELT THE HEAT IN THE PASSENGER SEAT WITHOUT THE SWITCH TURNED ON.  I HAVE TAKEN MY TRUCK TO LUCAS HONDA OF JACKSONVILLE, FL SEVERAL TIMES AND THEY KEEP TELLING ME THERE IS NO PROBLEM.  THIS PROBLEM PERSISTS, IT IS DISHEARTENING TO HAVE A PROBLEM THAT THE DEALER WON'T ACKNOWLEDGE AND WON'T RESOLVE!  I HOPE THIS IS NOT AN ELECTRIC ISSUE THAT COULD LEAD TO A FIRE IN THE VEHICLE.  *TR",
        "vin": "2HJYK16597H"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/15/2007",
        "dateOfIncident": "12/14/2007",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10211985,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "DUE TO BRAKE AND ACCELERATOR PEDAL HEIGHT AND POSITION IT IS POSSIBLE TO BE APPLYING ENGINE THROTTLE AT THE TIME OF BRAKING.  I'M NOT SURE WHICH WILL WIN OUT BUT IT IS A BAD FEELING.  NO ACCIDENTS AT THIS TIME.  *TR",
        "vin": "2HJYK16327H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/04/2007",
        "dateOfIncident": "09/01/2006",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10189771,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 HONDA RIDGELINE.  WHEN THE CONTACT ACTIVATED THE FOUR WHEEL DRIVE BUTTON, THE VEHICLE MOVED SIX FEET BEFORE THE FOUR WHEEL DRIVE ENGAGED.  HE STATED THAT THE FOUR WHEEL DRIVE DISENGAGED WHEN THE TRANSMISSION WAS SHIFTED INTO PARK.  THE DEALER STATED THAT THE FAILURE WAS A RESULT OF HOW THE VEHICLE WAS ENGINEERED.  THE CURRENT MILEAGE IS 7,000 AND THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "2HJYK16367H"
    },
    {
        "components": "CHILD SEAT",
        "crash": false,
        "dateComplaintFiled": "03/16/2007",
        "dateOfIncident": "02/28/2007",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10185361,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            },
            {
                "manufacturer": "COSCO, INC.",
                "productMake": "COSCO",
                "productModel": "TOURIVA 5 POINT",
                "productYear": "9999",
                "type": "Child Seat"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HONDA RIDGE LINE TRUCK. THE CONTACT TESTED THREE CHILD SAFETY SEATS TO ENSURE THAT THE TETHER STRAP WOULD WORK PROPERLY.  THE CHILD SAFETY SEAT INSPECTOR ATTEMPTED TO INSTALL THE CHILD SAFETY SEAT ,AND STATED THAT THE TETHER FAILED TO LOCK.  THE CONTACT ATTEMPTED TO CALL THE  DEALER AND WAS UNSUCCESSFUL.  THE CONTACT STATED THAT THIS  WAS A SAFETY RISK.  *AK",
        "vin": "2HJYK16237H"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/02/2007",
        "dateOfIncident": "02/19/2007",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10184064,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "RIDGELINE",
                "productYear": "2007",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "COMPLETE SEPARATION OF TREAD FROM THE SIDEWALLS;  MICHELIN LTX OEM LIGHT TRUCK TIRE.  THE TREAD REMAINED IN ONE PIECE BUT THERE WAS A CLEAN & COMPLETE SEPARATION FROM THE SIDEWALLS APPROX. 2 INCHES FROM THE BEAD [BOTH SIDES].  THERE WAS NO WARNING [VIBRATION, RUMBLING, LOSS OF CONTROL, ETC.] UNTIL THE FAILURE AT APPROX. 65 MPH ON INTERSTATE 93, CONCORD, NH.  IT WAS A CLEAR, COLD [17 DEG. F] DAY WITH NO OBSTRUCTIONS OR DEBRIS IN OR ON THE HIGHWAY.  [NOTE:  I HAVE SEVERAL PHOTOS OF THE TIRE IN QUESTION AFTER THE SEPARATION].   *JB",
        "vin": "2HJYK16277H"
    }
]