[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/11/2010",
        "dateOfIncident": "07/28/2010",
        "fire": false,
        "manufacturer": "HYOSUNG MOTORS AMERICA INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10348713,
        "products": [
            {
                "manufacturer": "HYOSUNG MOTORS AMERICA INC.",
                "productMake": "HYOSUNG",
                "productModel": "GV650",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2009 HYOSUNG GB250 MOTORCYCLE (NA). THE CONTACT STATED THAT WHEN HE PUT ON ANY TYPE OF TINTED EYE-WEAR THE INSTRUMENT GAUGE BECAME UNREADABLE. THE MANUFACTURER WAS NOTIFIED ABOUT THE FAILURE BUT THEY WERE UNABLE TO OFFER ANY ASSISTANCE. THE VEHICLE WAS NOT REPAIRED.  THE FAILURE MILEAGE WAS 70.",
        "vin": "KM4MJ525091"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/04/2010",
        "dateOfIncident": "12/30/2008",
        "fire": false,
        "manufacturer": "HYOSUNG MOTORS AMERICA INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10347671,
        "products": [
            {
                "manufacturer": "HYOSUNG MOTORS AMERICA INC.",
                "productMake": "HYOSUNG",
                "productModel": "GV650",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "UNITED MOTORS MOTORCYCLE MODEL V2C650S. CONSUMER REQUESTS REIMBURSEMENT DUE TO DEFECTS *TGW  THE CONSUMER STATED THE MOTORCYCLE HAS BEEN PARKED DUE TO A DEFECTIVE GAS TANK THAT LEAKED AT THE SEAMS AND DEFECTIVE WORKMANSHIP OF THE ELECTRIC STARTER WHEN THE SLIGHTEST AMOUNT OF MOISTURE CAME INTO CONTACT WITH IT.  WHICH ULTIMATELY CAUSED THE STARTER TO STOP WORKING.  *JB",
        "vin": "KM4VP571771"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/13/2010",
        "dateOfIncident": "05/15/2008",
        "fire": false,
        "manufacturer": "HYOSUNG MOTORS AMERICA INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10342959,
        "products": [
            {
                "manufacturer": "HYOSUNG MOTORS AMERICA INC.",
                "productMake": "HYOSUNG",
                "productModel": "GV650",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 HYOSUNG GV650 MOTORCYCLE. THE CONTACT STATED THERE WAS AN OVERPOWERING SMELL OF GASOLINE AND DISCOVERED THE FUEL TANK WAS FRACTURED AT THE SEAMS. THE DEALER REPLACED THE FUEL TANK TWICE TO CORRECT THE FAILURE BUT THE FAILURE CONTINUED TO RECUR. THE MANUFACTURER WOULD NOT PROVIDE ANY ASSISTANCE. THE VEHICLE WAS NOT FURTHER REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 1,000 AND THE CURRENT MILEAGE WAS 4,149.",
        "vin": "KM4VP571171"
    },
    {
        "components": "FUEL SYSTEM, OTHER,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/03/2008",
        "dateOfIncident": "12/03/2008",
        "fire": false,
        "manufacturer": "HYOSUNG MOTORS AMERICA INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10250663,
        "products": [
            {
                "manufacturer": "HYOSUNG MOTORS AMERICA INC.",
                "productMake": "HYOSUNG",
                "productModel": "GV650",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "IN SEPTEMBER 2008 MY HYOSUNG GV250; PURCHASED IN NOVEMBER 2007, EXPERIENCED A FAILURE OF THE STARTER SYSTEM AND WOULD NOT START. AFTER ABOUT 5 WEEKS AT A HYOSUNG DEALER (SF MOTO IN SAN FRANCISCO, CA) THE STARTER MOTOR AND STARTER SOLENOID WAS REPLACED, AND THE MOTORCYCLE WAS PICKED UP.    WITHIN TWO WEEKS THE MOTORCYCLE STARTING SYSTEM FAILED AGAIN, AND THE MOTORCYCLE WAS RETURNED TO THE DEALER A SECOND TIME FOR REPAIR (MID NOVEMBER 2008). ON DECEMBER 3, 2008, I CONTACTED THE DEALER AND WAS INFORMED THAT THEY WERE JUST STARTING TO WORK ON THE MOTORCYCLE AND THAT HYOSUNG AMERICA HAD INFORMED THEM THAT THEY HAVE HEARD OF THIS PROBLEM. AS THE DEALER DESCRIBES THE PROBLEM \"THE FUEL PETCOCK WAS LEFT ON; WHEN NOT RUNNING, AND FUEL HAS GOTTEN INTO THE STARTER CAUSING IT TO FAIL\".    THIS EXPLANATION MAKES NO SENSE TO ME, SINCE THE START IS NO WHERE NEAR THE FUEL PETCOCK OR EVEN THE CARBURETORS. IF THIS IS THE CASE THEN IT IS A POTENTIAL SAFETY ISSUE; AS SPARKS CAN BE GENERATED BY THE STARTER SHOULD IT TURN AND COULD IGNITE ANY FUEL VAPOR IN OR NEAR THE INTERNAL WORKING OF THE STARTER.    I REQUEST THIS BE INVESTIGATED AS A SAFETY ISSUE, AND IF NECESSARY HYOSUNG AMERICA BE REQUIRED TO CORRECT THE ISSUE OR RECALL THE PRODUCT FOR RECTIFICATION.    DAVID MCNARY *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/28/2008",
        "dateOfIncident": "07/25/2008",
        "fire": false,
        "manufacturer": "HYOSUNG MOTORS AMERICA INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10235970,
        "products": [
            {
                "manufacturer": "HYOSUNG MOTORS AMERICA INC.",
                "productMake": "HYOSUNG",
                "productModel": "GV650",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 HYOSUNG GV650.  WHILE DRIVING 50 MPH, THE CONTACT BEGAN TO LIFT ON THE HANDLE BAR AND NOTICED THAT IT WAS LOOSE.  HE NOTICED THAT THE RIGHT HANDLE BAR WAS SHEERED OFF, WHICH CAUSED IMBALANCE.  ONCE HE ARRIVED HOME, THE CONTACT DISCOVERED THAT THE LEFT HANDLE BAR WAS ALMOST JUST AS LOOSE AS THE RIGHT ONE.  HE BELIEVES THAT A CRASH COULD HAVE OCCURRED DUE TO THE LOOSE HANDLE BARS.  THE DEALER HAS NOT INSPECTED THE VEHICLE.  THE VIN WAS UNKNOWN.  THE FAILURE AND CURRENT MILEAGES WERE 3,300.",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/07/2008",
        "dateOfIncident": "06/06/2008",
        "fire": false,
        "manufacturer": "HYOSUNG MOTORS AMERICA INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10230232,
        "products": [
            {
                "manufacturer": "HYOSUNG MOTORS AMERICA INC.",
                "productMake": "HYOSUNG",
                "productModel": "GV650",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE HAS A RECALL FOR THE SAME PROBLEM (STALLING AT FREEWAY SPEEDS).  I HAD THE RECALL WORK DONE AND THIS VEHICLE SUBSEQUENTLY STALLED OR THREATENED TO STALL AT FREEWAY SPEEDS.  ON THE DATE LISTED BELOW, I WAS RIDING ON THE FREEWAY AT FREEWAY SPEEDS WHEN THE VEHICLE STALLED.  I WAS FORTUNATE AND ABLE TO GET TO THE MEDIAN AND UNABLE TO START THE BIKE.  IF OTHER DRIVERS WERE NOT PAYING ATTENTION, MY SUDDEN DROP IN SPEED WOULD HAVE RESULTED IN A CRASH, SINCE I DID NOT USE MY BRAKES AND PROVIDE A WARNING OF THE SLOWDOWN.  THIS BIKE HAD PREVIOUSLY THREATENED TO STALL ON THE FREEWAY AND I WAS ABLE TO GET OFF BEFORE IT DID IN FACT STALL.  I TOOK IT TO THE DEALER FOR REPAIR AND THIS 6/6/08 INCIDENT OCCURRED SUBSEQUENT TO THAT.  EVIDENTLY, THE PREVIOUS RECALL SOLUTION WAS INEFFECTIVE IN RESOLVING THE ORIGINAL PROBLEM.  I HAVE SEEN AT LEAST ONE BLOG ENTRY THAT DOCUMENTS THE SAME PROBLEM BY ANOTHER OWNER, WHO ALSO HAD THE RECALL WORK DONE AND CONTINUED TO HAVE PROBLEMS WITH GAS LEAKS.  SINCE MY VEHICLE WAS COMPLETELY INCAPACITATED BY THE STALL AND WOULD NOT START, HIGHWAY PATROL HAD TO GET INVOLVED AND BREAK TRAFFIC SO THAT I COULD GO FROM THE MEDIAN TO THE OTHER SIDE OF THE FOUR LANE HIGHWAY WHERE I WAS TO BE TOWED FROM THERE.  I DON'T KNOW IF A REPORT WAS MADE.  *TR",
        "vin": "KM4VP571671"
    }
]