[
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/26/2010",
        "dateOfIncident": "11/14/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10373059,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G37",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "FROM A COLD START, PUSHING THE IGNITION BUTTON SEVERAL TIMES ENGINE FAILED TO START, THEN NOTICED AN OVERWHELMING GASOLINE ODOR; GOT OUT OF CAR AND CHECKED UNDERNEATH AND DISCOVERED A LARGE VOLUME OF GASOLINE (APPROX A GALLON OR MORE) ACCUMULATED DIRECTLY BELOW THE ENGINE.  CALLED THE DEALERSHIP 24-HOUR TOWING SERVICE, THEY SAID THEY HAD TO CALL THE POLICE AND FIRE DEPARTMENT TO REPORT BEFORE THEY COULD REMOVE OUR CAR FROM THE GARAGE TO DETERMINE IF THE CAR HAD BEEN TAMPERED WITH AND TO SAFELY REMOVE ALL OF THE GASOLINE.  CAR WAS DELIVERED TO PARKWAY MOTOCARS DEALERSHIP IN VALENCIA, CA, TO INVESTIGATE AND MAKE REPAIRS (THE CAR WAS PURCHASED AT TUSTIN INFINITY IN TUSTIN, CA).      UPON INVESTIGATION BY THE SERVICE DEPARTMENT OF THE DEALERSHIP, IT WAS FOUND THAT THE FUEL LINE IN THIS BRAND NEW CAR (156 MILES) HAD BEEN TAMPERED WITH.  APPROXIMATELY 5 INCHES OF FUEL LINE HAD BEEN CUT, REMOVED, AND REPLACED WITH A VACUUM HOSE TYPE PIECE OF RUBBER HAD BEEN CLAMPED WITH SPRING CLAMPS (NON FUEL-LINE RATED CLAMPS) TO THE SHORTENED UNITIZED FUEL LINE.  WE HAVE PICTURES TAKEN AT THE DEALERSHIP OF THIS TAMPERED FUEL LINE.      WE COULD HAVE BEEN KILLED WHILE DRIVING GIVEN THE HIGH TEMPERATURES THAT WE DRIVE IN CA.  WHILE THE CAR HAS BEEN REPAIRED, WE STILL DON'T KNOW IF WHAT HAPPENED TO US WAS DUE TO SHODDY WORK BY INFINITY OR A DISGRUNTLED INFINITY EMPLOYEE.  IF A DISGRUNTLED EMPLOYEE, WHAT ELSE MIGHT BE WRONG WITH THE CAR?  ARE WE STILL AT RISK.  DID INFINITY REPAIR OTHER CARS IN THIS DANGEROUS AND NON-FACTORY AUTHORIZED MANNER?  INFINITY HAS DECLINED TO DISCUSS THE MATTER WITH US AND TELL US WHY THIS HAPPENED.  THE INFINITY REFERENCE # FOR THIS INCIDENT IS #6987437.  WE WISH TO REPORT THIS BECAUSE WE ARE CONCERNED THAT OTHERS MAY, TOO BE AT RISK, AND WE REQUEST THAT THE RESULTS OF THIS INCIDENT BE SHARED WITH US.",
        "vin": "JN1CV6AP5AM"
    }
]