[
    {
        "components": "AIR BAGS,STRUCTURE,SEATS",
        "crash": false,
        "dateComplaintFiled": "03/14/2022",
        "dateOfIncident": "03/08/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456672,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "dash is cracked air bag is not secure seat are torn",
        "vin": "19UUA76588A"
    },
    {
        "components": "STEERING,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/19/2022",
        "dateOfIncident": "01/19/2022",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11448063,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving down HWY 101 in Oregon State in the rain. I was accelerating because I had just turned onto the highway, I got up to about 60 mph whe the car started dinging as it does when you open the door with the keys still in the ignition. The VSA light, as well as the engine, oil, abs and battery lights all started flashing on the dash and the car turned off. The steering wheel locked up and I had to throw it in neutral, turning the key back and forth from the off position to the start position to get it to unlock right before I crashed into on coming traffick! There has been nothing wrong with the car other than routine maintenance an absolutely no signs anything is wrong with the car. It has 168436 miles on it and has been religiously maintained.  There is a SERIOUS problem with this vehicle for something like this to happen. I've owned hundreds of cars and never experienced anything like this happening, ever!",
        "vin": "19UUA66268A"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/15/2021",
        "dateOfIncident": "07/05/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433039,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "Random slipping/stalling causes not to go in gear.. torque converter could. coolant expansion tank needs replacement hoses and cap causes car not to heat up and operate at regulating temperature. Power steering pump replacement",
        "vin": "19uua66278a"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/26/2021",
        "dateOfIncident": "06/19/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11422396,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I noticed a vertical straight line/crack in the dashboard of my 2008 Acura TL located on the passenger side, which is directly in the area of the air bag system. Oddly enough it seemed to appear literally overnight. I’ve noticed the crack seems to expand when in cooler temperatures, however the crack appears to fuse back together  when the temperature is warmer and/or hot outside, which is concerning in itself. My vehicle has been stored in a garage since it’s purchase and when not in use a sunshade is used to protect the dash when exposed outside. I am very concerned that there may be a bigger problem with the air bag system that may result in the air bags being inadvertently deployed resulting in an accident, injury or even greater death. Internet searches reveal this a common problem among individuals similarly situated with the same make and model, and Acura is apparently aware. My vehicle is regularly serviced and maintained at the Acura Dealership in Memphis. I have reached out to the dealership regarding this issue, however I have not heard back from them regarding a possible resolution. I believe this issue warrants some type of safety recall before someone or their loved ones become seriously injured.",
        "vin": "19UUA66278A"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/16/2021",
        "dateOfIncident": "11/04/2020",
        "fire": true,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11408419,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2008 ACURA TL. THE CONTACT STATED THAT WHILE DRIVING AT 30 MPH, HE DETECTED A FUEL AND OIL ODOR. THE CONTACT THEN SAW SMOKE AND FLAMES COMING FROM UNDER THE HOOD NEAR THE FRONT DRIVER'S SIDE WINDSHIELD. THE FIRE WAS EXTINGUISHED BY THE FIRE DEPARTMENT AND A FIRE DEPARTMENT REPORT WAS FILED. THE VEHICLE WAS TOWED TO THE CONTACT'S FRIEND'S RESIDENCE. THE DEALER LYLE PEARSON ACURA (7675 W GRATZ DR, BOISE, ID 83709) AND MANUFACTURER WERE MADE AWARE OF THE FAILURE AND OPENED A CASE, HOWEVER NO FURTHER ASSISTANCE HAD BEEN PROVIDED. THE CONTACT WAS RELATING THE FAILURE TO NHTSA CAMPAIGN NUMBER: 12V222000 (STEERING). THE FAILURE MILEAGE WAS 160,000. *DT",
        "vin": "19UUA66238A"
    },
    {
        "components": "SUSPENSION,POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/15/2021",
        "dateOfIncident": "02/27/2008",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11408204,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING: HYDRAULIC POWER ASSIST: HOSE, PIPING, AND CONNECTIONS, SUSPENSION: FRONT: CONTROL ARM:LOWER BALL JOINT, STEERING: HYDRAULIC POWER ASSIST: HOSE, PIPING, AND CONNECTIONS, VEHICLE SPEED CONTROL: ACCELERATOR PEDAL02",
        "vin": "19UUA76598A"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/26/2021",
        "dateOfIncident": "01/20/2021",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390002,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS LOOKING TO SELL MY CAR SOON AND WAS LOOKING ON KELLY BLUE BOOKS AND TURNED OUT MY CAR HAD AN UNRESOLVED RECALL BUT I WAS NEVER GIVEN A NOTICE OR ANY PAPER WORK FROM THE CURRENT DEALERSHIP I AM BUYING FROM. I DID NOTICE THE SAME EXACTLY PROBLEM ON MY CAR THAT WAS LISTED ON THE RECALL INFORMATION PROVIDED TO ME.",
        "vin": "19UUA662X8A"
    },
    {
        "components": "STEERING,SUSPENSION,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "12/14/2020",
        "dateOfIncident": "02/21/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11383368,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FEBRUARY 2020 GOING DOWNHILL AT 30MPH ON A CURVED ROAD, AND MY WHEEL SNAPS TO THE RIGHT THANKS TO RECALLED BALL JOINTS!!!!!!!!! HIT THE CURB, SNAPPED MY ROTOR IN HALF AND THE BRAKE LINE. LOWER CONTROL ARM WENT THRU MY CRADLE. SPINNING OUT OF CONTROL WITH NO STEERING AND NO FREAKING BRAKES AT ALL. OUT OF NOWHERE! TOTALED SUSPENSION ALL THE WAY AROUND. ONLY FREAKIN AIRBAG TO GO OFF WAS THE PASSENGER WINDOW AIRBAG. WHOLE CAR WAS [XXX] BECAUSE OF MANUFACTOR ISSUES! SOUNDS LIKE ACURA SHOULD REPLACE MY FREAKING CAR. OH WAIT.. I DID. AND TODAY THE ONE IM DRIVING RIGHT NOW RANDOMLY HAD THE POWER STEERING EXPLODEEEEEE AND I ALMOST GOT HIT BY A SEMI WHILE TURNING AND RANDOMLY LOSING STEERING OUT OF NOWHERE ONCE AGAIN!! WHICH FRIED MY COOLING FAN, AND OVERHEATED MY MOTOR ON MY ATTEMPT TO DRIVE HOME WITH NO POWER STEERING.... SO YEAH. NEVER BUYING ANOTHER ACURA AGAIN,    PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "19UUA66216A"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/19/2020",
        "dateOfIncident": "01/06/2020",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300243,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES FEEL SPONGY EVEN AFTER MULTIPLE BRAKE BLEEDING AS WELL AS A MASTER CYLINDER REPLACEMENT.  PEOPLE ON ACURA TL TYPE S FORUMS ARE REPORTING THAT AIR IS BEING INTRODUCED THROUGH THE VSA/ABS MODULATOR.",
        "vin": "19UUA765X8A"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/23/2019",
        "dateOfIncident": "11/28/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11290858,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A LONG GASH IN THE DASHBOARD BY THE PASSENGER AIRBAG. APPARENTLY THIS IS A KNOWN ISSUE BASED ON INTERNET SEARCHES AND ACURA HAS NOT ISSUED ANY RECALL FOR THE SAME EVEN THOUGH IT POSES A POTENTIAL SAFETY RISK. I REACHED OUT TO ACURA CORPORATE AND THEIR RESPONSE WAS THAT BECAUSE MY VEHICLE IS OUTSIDE THE INITIAL WARRANTY PERIOD, THERE IS NOTHING THEY CAN DO. THERE ARE NUMEROUS ONLINE RECORDS OF INDIVIDUALS WITH THE SAME MODEL YEAR REPORTING THIS ISSUE. I AM CONCERNED THAT THIS NOT BEING RESOLVED POSES A SAFETY RISK TO MY FAMILY AND OTHER OCCUPANTS OF MY 2008 ACURA TL WHICH WAS PURCHASED BRAND NEW. THANK YOU FOR YOUR HELP.",
        "vin": "19UUA76508A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/11/2019",
        "dateOfIncident": "04/01/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11288451,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM THE ONLY OWNER WITH 39,000 MILES ON IT. I MOVED TO SOUTH FLORIDA 5 YEARS AGO. THE DASHBOARD HAS MAJOR CRACKS OVER THE PASSENGER AIRBAG. I SAW THIS \"LETTER SENT IN CONJUNCTION WITH THE FLORIDA HIGHWAY SAFETY AND MOTOR VEHICLES DEPARTMENT TO REMIND FLORIDA OWNERS OF THE TAKATA RECALL AND TO SCHEDULE AN APPOINTMENT AT THEIR EARLIEST CONVENIENCE.\" I SHOULD BE INCLUDED IN THE RECALL. THE VEHICLE WAS STATIONARY.",
        "vin": "19UUA66228A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/21/2019",
        "dateOfIncident": "08/05/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11281612,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AREA AROUND MY PASSENGER SIDE AIRBAG ON THE DASH IS COMPLETELY CRACKED AND DAMAGED.  I'M CONCERNED THAT THE AIRBAG IS DAMAGED UNDER NEATH AND WILL NOT DEPLOY DURING A ACCIDENT.   THESE CRACKS JUST APPEARED ONE DAY WHILE THE VEHICLE WAS PARKED AND A FEW DAYS LATER MORE CRACKS.  ACURA SHOULD TRULY CONSIDER RECALLING THESE VEHICLES BEFORE SOMEONE DIES DUE TO THERE NEGLIGENCE.  THIS IS MY 2ND REQUEST.   I AM AWARE OF OTHER ACURA OWNERS WITH THE SAME ISSUE.",
        "vin": "19UUA662X8A"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/14/2019",
        "dateOfIncident": "10/03/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11268387,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER OWNING THE ACURA TL FOR 11 YEARS, ONE DAY LAST WEEK, I NOTICED 2 CRACKS IN THE DASHBOARD ON BOTH SIDES OF THE PASSENGER AIRBAG. THE CAR WAS PARKED ON A CITY STREET. I AM AFRAID THAT IF THE AIRBAG DEPLOYS, PIECES OF THE DASHBOARD COULD FLY OUT.",
        "vin": "19UUA66278A"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/30/2019",
        "dateOfIncident": "07/15/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11252486,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DASHBOARD CRACKS: POTENTIAL DANGER OF AIRBAG FAILURE    OVER THE LAST FEW YEARS, MY CAR HAS DEVELOPED SEVERAL CRACKS IN THE DASHBOARD.      OF PARTICULAR CONCERN IS A LARGE CRACK WHICH JUST RECENTLY APPEARED ALONG THE LEFT SIDE OF THE FRONT PASSENGER AIRBAG UNIT.  (SEE PHOTOS)    I AM VERY CONCERNED THAT THE CRACKS CAN ALLOW MOISTURE OR CONDENSATION TO ENTER THE AIRBAG UNIT, POSSIBLY CAUSING IT FAIL, DEPLOY PREMATURELY, OR NOT PROPERLY DEPLOY IN A CRASH SITUATION.     ALTHOUGH THE DASHBOARD CRACKS ARE SEEMINGLY COSMETIC, ITS POTENTIAL TO CREATE A SEVERE SAFETY ISSUE IS OF GREAT CONCERN.    ESPECIALLY IN LIGHT OF THE TAKATA RECALL FOR AIRBAGS, I HOPE THAT THE MANUFACTURER CAN HELP REPAIR OR REPLACE THESE FAULTY DASHBOARDS WITH A QUALITY MATERIAL THAT WILL NOT DEGRADE IN SUCH A MANNER.",
        "vin": "19UUA75588A"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/02/2019",
        "dateOfIncident": "03/01/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11241235,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CRACKED DASH BOARD. THREE SEPARATE CRACKS. I'M POSITIVE THIS IS GOING TO EFFECT THE AIRBAG DEPLOYMENT. CLEARLY THIS IS A KNOW ISSUE. I'D SUGGEST GETTING AN ATTORNEY. THE CAR HAS NOT BEEN IN ANY TYPE OF ACCIDENT",
        "vin": "19UUA66208A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/29/2019",
        "dateOfIncident": "07/22/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11240332,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 ACURA TL. WHILE THE CONTACT'S GRANDDAUGHTER WAS DRIVING, THE AIR BAG DEPLOYED WITHOUT WARNING OR AN IMPACT. THE DRIVER AND FRONT AND REAR PASSENGERS HAD RINGING IN THEIR EARS AND SAW FLASHING LIGHTS DUE TO THE AIR BAG EXPLOSION. THERE WERE NO INJURIES AND MEDICAL ATTENTION WAS NOT RECEIVED. THE VEHICLE WAS TOWED TO THE CONTACT'S RESIDENCE. THE VEHICLE WAS NOT TAKEN TO A DEALER OR AN INDEPENDENT MECHANIC FOR DIAGNOSTIC TESTING. THE CONTACT CALLED THE ACURA HOTLINE AIR BAG DEPLOYMENT NUMBER AT 800-382-2238 AND WAS INFORMED THAT THEY WOULD CALL THE ACURA DEALER AND SCHEDULE AN APPOINTMENT TO TOW THE VEHICLE. THE CONTACT WAS PROVIDED CASE NUMBER: 09727380. THE APPROXIMATE FAILURE MILEAGE WAS 125,000.",
        "vin": "19UUA66298A"
    },
    {
        "components": "STEERING,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/22/2019",
        "dateOfIncident": "07/05/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11233774,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIRBAG ON THE PASSENGER SIDE HAS TWO DEEP CRACKS AROUND THE PERIMETER.  MY CONCERN IS THE AIRBAG WILL NOT WORK PROPERLY.  MY CAR WAS PARKED WHEN THE FIRST CRACK APPEARED.  THE SECOND CRACK HAPPENED WHILE DRIVING AND I SITTING ON THE PASSENGER SIDE.  THE STEERING HAS A LOUD KNOCKING SOUND WHEN THE STEERING WHEEL IS TURNED LEFT AND RIGHT.",
        "vin": "19UUA662X8A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/17/2019",
        "dateOfIncident": "07/08/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11232897,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR DASHBOARD IS COMPLETELY CRACKED RIGHT ABOVE THE AIRBAG, WHICH IS ALLOWING HEAT TO SEEP IN.",
        "vin": "19UUA662X8A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/14/2019",
        "dateOfIncident": "07/05/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11231799,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE ALREADY PAID ACURA TO REPLACE MY DASHBOARD ONCE DUE TO THE AIRBAG PUSHING UP ON DASH AND CRACKING IT.  I NOW HAVE THE SAME PROBLEM AGAIN, THE DASH HAS CRACKED ON PASSENGER SIDE IN PERFECT RECTANGLE WHERE AIRBAG IS LOCATED.  I AM VERY CONCERNED THAT DEPLOYMENT IS LIKLEY/IMMINENET AND I AM URGING NHTSA TO REQUIRE ACURA TO REPLACE AIRBAGE AND DASH.",
        "vin": "19UUA66286A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/18/2019",
        "dateOfIncident": "05/10/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208447,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS SITTING AT A RED LIGHT, AND WHEN THE LIGHT TURNED GREEN AND I ACCELERATED, THE CAR WOULD NOT MOVE WITH MODERATE THROTTLE. I HAD TO FLOOR THE THROTTLE TO MOVE, AND THE ENGINE RPM JUMPED TO ABOUT 6000. THE CAR WOULD NOT SHIFT, EITHER AUTOMATICALLY OR THROUGH THE \"MANUAL\" FUNCTION ON THE GEAR SELECTOR. OVER THE NEXT 1.5 MILES, I NOTICED SMOKE IN THE REAR VIEW MIRROR AND A BURNING SMELL. I PULLED THE CAR OVER AND NOTICED SMOKE FROM THE HOOD AND A TRAIL OF AUTOMATIC TRANSMISSION FLUID FROM THE CAR. CAR WAS TOWED TO A TRANSMISSION SHOP AND I WAS TOLD THAT THE TRANSMISSION COOLER LINE RUNNING TO THE RADIATOR HAD RUPTURED DUE TO CORROSION. TRANSMISSION COOLER LINES AND RADIATOR HAD TO BE REPLACED.",
        "vin": "19UUA66248A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/01/2019",
        "dateOfIncident": "03/29/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11193132,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HIT A POTHOLE ON THE FRONT, DRIVERS SIDE TIRE AND THE AIRBAGS ON THE SIDE PASSENGERS SIDE AND SEAT DEPLOYED BUT DID NOT INFLATE. I HAVE SEEN SEVERAL SIMILAR ISSUES REPORTED OF THE SAME THING HAPPENING. I AM CONCERNED THAT IF IT WOULD HAVE BEEN AN ACCIDENT, MY AIRBAGS WOULDN'T HAVE INFLATED IN THAT INSTANCE EITHER AND IT WOULDN'T HAVE HELPED AT ALL. WITH THEM NOW BEING DEPLOYED AND NO USE IF I'M IN AN ACCIDENT, I AM NO LONGER SAFE IN THIS VEHICLE.",
        "vin": "19UUA66278A"
    },
    {
        "components": "AIR BAGS,STRUCTURE,SEATS",
        "crash": false,
        "dateComplaintFiled": "03/12/2019",
        "dateOfIncident": "01/04/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11186211,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL -  MY AIRBAGS ON MY 2008 ACURA TL HAVE EXPLODED ON MY SEATS, ROOF, AND SIDE AIRBAGS.   I DON'T UNDERSTAND WHY PREVIOUSLY SUBMITTED COMPLAINTS ABOUT THIS ISSUE HAVE NOT BEEN RESPONDED TO.  MY AIRBAG LIGHT IS ON AND WILL NOT GO OFF AND MY SAFETY IS BEING JEOPARDIZED EVERYDAY ON THIS VEHICLE AND IT APPEARS FOR THE LAST DECADE OTHER OWNERS OF THE 2008 TL HAVE REPORTED ON THE ACURA FORUMS WHAT I HAVE, YET FOR SOME REASON,  THE RECALLS ARE EXCLUDING THIS MODEL.  WHY, WHY WHY????? DOES IT TAKE ANOTHER DEATH FOR SOMEONE TO RECOGNIZE THIS???? THE VEHICLE WAS MOVING WHEN THIS OCCURED ON AN EXITING ACCESS ROAD.",
        "vin": "19UUA66258A"
    },
    {
        "components": "SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/06/2019",
        "dateOfIncident": "01/02/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11184576,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 ACURA TL. WHILE THE VEHICLE WAS MAKING A LEFT TURN, THE FRONT DRIVER'S SIDE BALL JOINTS AND AXLE FRACTURED AND THE FRONT DRIVER'S SIDE WHEEL DETACHED FROM THE VEHICLE. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THAT THE AXLE AND BALL JOINTS FAILED AND FRACTURED DUE TO THE WEIGHT OF THE VEHICLE. THE MECHANIC REPLACED THE BALL JOINTS AND AXLE. THE VEHICLE WAS REPAIRED. ON ANOTHER OCCASION, WHILE REVERSING THE VEHICLE, THE CONTACT HEARD A POP SOUND. WHEN HE STOPPED THE VEHICLE, IT DROPPED TO THE GROUND. THE CONTACT NOTICED THAT THE FRONT DRIVER'S SIDE WHEEL WAS LEANING AT A SIXTY DEGREE ANGLE AND THE FENDER WAS BENT OUTWARDS. THE VEHICLE WAS CURRENTLY PARKED ON THE SIDE OF THE ROAD. THE DEALER AND MANUFACTURER WERE NOT CONTACTED. THE FAILURE MILEAGE WAS 142,000.",
        "vin": "19UUA662X8A"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/23/2018",
        "dateOfIncident": "12/22/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11163178,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN OPENING THE HOOD OF THE CAR, THE HOOD DOESN'T STAY UP.   YESTERDAY, IT HAPPENED 4 TIMES.  THE FIRST TIME, IT CAME DOWN WHEN I OPENED IT TO LOOK UNDER THE HOOD.  LATER,, IT CAME DOWN ON ANOTHER PERSON'S ARM WHILE HE WAS LOOKING UNDER THE HOOD -- IT HAD BEEN OPENED FOR A COUPLE OF MINUTES BEFORE IT CAME DOWN.  THE THIRD TIME, WE HAD THE CAR AT THE MECHANIC AND THEY MENTIONED THAT THEY HAD TO HOLD THE HOOD UP TO LOOK UNDER THE CAR.  IN THE FOURTH INCIDENT, THE HOOD CAME DOWN WHEN ANOTHER PERSON WAS BENDING OVER TO LOOK UNDER THE HOOD AND HIT HIM IN THE HEAD.  IT APPEARS THAT BOTH HOOD SUPPORTS NEED TO BE REPLACED, BUT IT SEEMS ODD THAT BOTH WOULD FAIL AT THE SAME TIME.    ADDITIONALLY, THERE HAS ALWAYS BEEN A PROBLEM WITH THE FRONT DOORS NOT STAYING OPEN WHEN THE CAR IS PARKED ON A SLOPE -- THE DOORS SWING BACK SHUT UNLESS YOU HOLD THEM OPEN",
        "vin": "19UUA66278A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/23/2018",
        "dateOfIncident": "09/01/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11163179,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "IN SEPTEMBER 2018, SEEMINGLY OVERNIGHT, 2 LARGE CRACKS DEVELOPED IN MY DASHBOARD, ON THE PASSENGER SIDE, DIRECTLY OVER THE AIRBAG.  I'M CONCERNED THAT THIS IS A SAFETY ISSUE, BECAUSE THE DAMAGE IS DIRECTLY OVER THE AIRBAGS.",
        "vin": "19UUA66278A"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/01/2018",
        "dateOfIncident": "06/18/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11132421,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 ACURA TL. WHILE DRIVING, THE VEHICLE SUDDENLY SHUT OFF. THE VEHICLE WAS TOWED TO SPRINGFIELD ACURA(243 US-22, SPRINGFIELD, MO) WHERE IT WAS DIAGNOSED THAT THE MAIN COMPUTER HAD SHORT CIRCUITED DUE TO MOISTURE FROM THE AIR CONDITIONING PIPES POSITIONED ABOVE THE COMPUTER. THE COMPUTER WAS REPLACED AND THE VEHICLE OPERATED NORMALLY. APPROXIMATELY THREE YEARS AND 25,000 MILES LATER, THE FAILURE RECURRED. THE VEHICLE WAS TOWED TO BOARDWALK ACURA (6806 TILTON RD, EGG HARBOR TOWNSHIP, NJ) WHERE IT WAS CONFIRMED THAT THE COMPUTER HAD SHORT CIRCUITED AGAIN DUE TO MOISTURE FROM THE AIR CONDITIONING PIPES. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURES. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS APPROXIMATELY 30,000.",
        "vin": ""
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/04/2018",
        "dateOfIncident": "08/31/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11124394,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FROM THE DAY AFTER THAT WE TOOK THE CAR FROM THE LOT THE CAR HAD A LIGHT TURN ON TO TIGHTEN FUEL CAP. WE HAVE REPLACED THAT AND THE SOLENOID AND FAILED. THE COOLANT SYSTEM HAS BEEN REPLACED AND IT STILL OVERHEATS. NOW THE CAR IS SUFFERING OF NO START CONDITION. DONT UNDERSTAND WHY SO MUCH TROUBLE HAS BEEN EXPERIENCED AND WE ONLY TOOK IT FROM THE LOT 7 MONTHS AGO. 119,000 MILES. ONLY 91 OCTANE.",
        "vin": "19UUA66228A"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/07/2018",
        "dateOfIncident": "01/02/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11118307,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL- PASSENGER ROOF, SEAT AND SIDE AIRBAGS DEPLOYED WHEN I HIT A CURB ON THE DRIVERS SIDE.  HOW CAN THIS BE?  I HAVE A 2008 ACURA TL. IT NEEDS TO BE CONSIDERED IN THE RECALL.      UPON THE ABOVE MENTIONED, THE PASSENGER SIDE DASH HAS SEPARATED FROM THE FRONT PASSENGER FRAME.  THIS IS VERY DANGEROUS AND COULD SEPARATE WHILE DRIVING.  ALL OF THE DAMAGE IS ON PASSENGER SIDE AND NOT ON THE DRIVERS SIDE WHERE THE IMPACT WAS. CURRENTLY I DO NOT FEEL SAFE IN THE DRIVERS SIDE IF THE AIRBAGS MALFUNCTION LIKE THAT NOR CAN I HAVE PASSENGERS IN MY CAR.  THIS AIRBAG RECALL NEEDS TO INCLUDE SOME 2008 MODELS THAT ARE NOT SHOWING AT THIS TIME.",
        "vin": "19UUA66258A"
    },
    {
        "components": "STEERING,SUSPENSION,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/07/2018",
        "dateOfIncident": "08/06/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11118320,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE SOME SUSPENSION RELATED ISSUES THAT HAVE RECENTLY BEEN DIAGNOSED THAT ARE INCLUDED IN THE NHTSA CAMPAIGN # 11E022000 BUT WHEN I TYPE IN MY VIN# ON YOUR WEBSITE IT SAYS THERE ARE NO RECALLS FOR THIS ITEM ON MY 2008 ACURA TL.     I HAVE ANOTHER DIAGNOSED ISSUE WITH THE STEERING  FROM YOUR RECALL # 08V091000 AND THERE IS NO LISTING FOR THIS RECALL ON MY VEHICLE ON YOUR WEBSITE.  I WAS TOLD THAT I WAS LOSING POWER STEERING FLUID DUE TO INTENSE HEAT AND THAT THE POWER STEERING HOSE IS DETERIORATING.  THIS IS VERY DANGEROUS FOR ME TO DRIVE MY VEHICLE, YET SEE THE RECALL IS FOR CERTAIN 2008 MODELS.  WHO CAN HELP ME WITH THIS?    ANOTHER DIAGNOSED ISSUE IS THE POWERTRAIN RECALL # 04V176000 THAT IS ALSO NOT LISTED FOR MY VEHICLE.  I AM HAVING PROBLEMS WITH THE GEARS AND AM WORRIED ABOUT THE SAFETY OF THIS VEHICLE.  I HAVE PROBLEMS WITH THE 2ND GEAR.  I WILL BE NOTIFYING HONDA, ON ALL THESE ISSUES, BUT THE PUBLIC NEEDS TO BE AWARE ON THE DETERMINATION OF \"CERTAIN 2008\" MODELS.",
        "vin": "19UUA66258A"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/12/2018",
        "dateOfIncident": "07/09/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11110971,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR BATTERY DRAINS ITSELF TOO QUICK. CAR ELECTRICAL SYSTEM DRAWS CURRENT TOO MUCH.  AFTER 3-4 DAYS PARK WITHOUT DRIVING BATTERY DEAD. IT WON'T START. BATTERY IS VERY GOOD CONDITION.",
        "vin": "19UUA66238A"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/10/2018",
        "dateOfIncident": "07/10/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11110410,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DASH BOARD IS CRACKING WHERE THE AIR  BAG IS AT LITTLE  BY LITTLE",
        "vin": "19UUA66278A"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/25/2018",
        "dateOfIncident": "06/24/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11103729,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BATTERY ON THIS CAR DRAINS DUE TO A FACTORY FAULTY HFL UNIT.  THIS CAUSES EVEN A NEW BATTERY TO BE DRAINED AND THEN LEFT MY WIFE STRANDED ON SEVERAL OCCASION.  WE ORIGINALLY THOUGHT THE ISSUE WAS THE BATTERY.  ACURA REPLACED THE BATTERY EVEN THOUGH IT WAS ONLY 2 YEARS OLD RATHER THAN FIXING THE REAL PROBLEM.  NOW THE CAR IS NO LONGER UNDER WARRANTY BUT WE HAVE TO REPLACE THE BATTERY EVERY COUPLE OF YEARS.",
        "vin": "19UUA66208A"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/25/2018",
        "dateOfIncident": "01/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11103800,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HANDSFREE LINK STOPPED WORKING IN 2016.  I CONSIDER THIS A SAFETY HAZARD IN ITSELF SINCE THAT WAS THE MAIN REASON I PURCHASED A VEHICLE WITH HFL. THE BATTERY THEN STARTED DYING WHEN I DID NOT DRIVE THE CAR FOR 2-3 DAYS CAUSING FREQUENT BATTERY REPLACEMENTS.  IT'S ESCALATED TO WHERE NOW WITH A BRAND NEW BATTERY, IF I DO NOT DRIVE THE CAR IN A 24 HOUR PERIOD, THE CAR IS DEAD THE NEXT DAY.",
        "vin": "19UUA66268A"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/21/2018",
        "dateOfIncident": "05/20/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11097035,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2008 ACURA TL-S, IT IS GARAGED AT NIGHT AND I DO MY BEST TO TAKE CARE OF IT.  THE OTHER DAY I DEVELOPED TWO CRACKS RUNNING FROM THE WINDSHIELD TO THE GLOVEBOX, ALONG THE EDGES OF THE AIRBAG. I DIDN'T NOTICE THEM UNTIL I GOT HOME LAST NIGHT, BUT THEY ARE QUITE NOTICEABLE.  I HAVE READ ABOUT SEVERAL OTHER COMPLAINTS O THIS HAPPENING TO ACURA'S AND I AM WONDERING WHY AND WHAT CAN BE DONE ABOUT THIS.  WILL THIS IMPACT THE AIRBAG OPERATIONS AND MAYBE IMPACT WAS A BAD CHOICE OF WORDS.",
        "vin": "19UAA76678A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/15/2018",
        "dateOfIncident": "06/13/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11079650,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT HIGHWAY SPEED, LOST POWER TO DRIVE TRAIN DESPITE ENGINE RUNNING. WAS ABLE TO COAST TO STOP ON BERM. TURNED OFF ENGINE. FLUID OBSERVED BENEATH VEHICLE. CAR TOWED. INSPECTION REVEALED THAT TRANSMISSION SUPPLY LINE FITTING CONNECTION FAILED AT LEAST IN PART DUE TO DISSIMILAR METAL CORROSION. THREADED SECTION ALSO SEPARATED COOLANT AND TRANSMISSION FLUIDS TOTALLY LOST. DEALER ADVISED THAT THIS PROBLEM NOT SEEN ON TL BUT INTERNET SEARCH REVEALED OTHER MODELS HAD BEEN REPORTED. RADIATOR REPLACED BY OWNER. TRANSMISSION PAN DROPPED AND CLEANED. FLUIDS REPLACED.",
        "vin": "19UUA66258A"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/02/2017",
        "dateOfIncident": "09/30/2017",
        "fire": true,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11030765,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "9/30/2017 ACURA TL 2008, 4DOOR SEDAN, BURST INTO FLAMES INSIDE GARAGE, JUST MINUTES WTIHIN PARKING THE CAR FROM DRIVING.  BURNT CAR COMPLETELY CAUSING HOUSE FIRE.",
        "vin": "19UUA662X8A"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/25/2017",
        "dateOfIncident": "09/19/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11025456,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 ACURA TL. THE CONTACT STATED THAT THE DASHBOARD WAS FRACTURED ON THE PASSENGER SIDE NEAR THE AIR BAG. A LOCAL DEALER WAS NOT CONTACTED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND OFFERED NO ASSISTANCE. THE FAILURE MILEAGE AND VIN WERE UNKNOWN.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/30/2017",
        "dateOfIncident": "08/06/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11020640,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "A LARGE CRACK HAS APPEARED ON THE DASH PANEL COVERING PASSENGER SIDE AIRBAG. I FEAR THIS WILL GET IN THE WAY OF DEPLOYING PASSENGER SIDE AIRBAG IN AN EMERGENCY SITUATION AND/OR POTENTIALLY GENERATE DANGEROUS SHARDS.  THIS SEEMS TO BE A KNOWN PROBLEM WHEN I VISITED THE ACURA SERVICE DEPARTMENT EARLIER TODAY, BUT THEY HAVE SO FAR REFUSED TO ADVISE ME ON A SUITABLE COURSE OF ACTION.   MY CAR HAS NEVER BEEN IN AN ACCIDENT AND HAS BEEN VERY WELL TAKEN CARE OFF, WITH MOST OF THE DRIVING BEING LIMITED TO SURFACE STREETS AND ALWAYS BEING GARAGED OVERNIGHT.",
        "vin": "19UUA66298A"
    },
    {
        "components": "AIR BAGS,SEAT BELTS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/28/2017",
        "dateOfIncident": "09/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11020140,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SEPT 2016 WAS HAVING AN ISSUE WITH THE SRS LIGHT REMAINING ON CONSTANTLY. SEAT BELT BUCKLE UNDER RECALL, HAD THAT REPLACED'THAT DID NOT FIX THE PROBLEM. JULY 2017 NOW THE DASHBOARD ON PASSENGER SIDE HAS A DEEP STRAIGHT CRACK. I HAVE DONE RESEARCH AND HUNDREDS OF OTHER ACURA TL HAVE THIS ISSUE. THE AIRBAG IS IN THAT DASHBOARD RIGHT WHERE THE CRACK IS. ACURA REFUSES TO ACKNOWLEDGE A SAFETY ISSUE AND WILL NOT REPAIR, REPLACE OR RECALL. I HAVE KEPT THE CAR IMMACULATE, I HAVE REGULAR SERVICE AND A HONDA/ACURA REPAIR SHOP. I UNDERSTAND ACURA TL SPECIFICALLY 2008 HAS THIS PROBLEM AROUND THE COUNTRY IN A VARIETY OF CLIMATES, AND WHETHER THE CAR HAS BEEN GARAGED OR NOT. IT'S A DESIGN FLAW. IT IS ENDANGERING MY PASSENGER. ALSO, IF YOU FIND A JUNK PART AND REPLACE THE DASH, APPARENTLY THE REPLACEMENT DASH WILL CRACK ALSO AND THE SRS LIGHT WILL BE ON AND THE AIRBAG COMPROMISED AGAIN.",
        "vin": "19UUA66208A"
    },
    {
        "components": "AIR BAGS,SEAT BELTS,SEATS",
        "crash": false,
        "dateComplaintFiled": "08/25/2017",
        "dateOfIncident": "07/06/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11019471,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER SIDE CURTAIN AIRBAG DEPLOYED AFTER HITTING A SMALL POTHOLE GOING AROUND 35 MPH ON A PAVED CITY ROAD.",
        "vin": "19UUA66238A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/13/2017",
        "dateOfIncident": "08/01/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11014881,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CRACKS ARE APPEARING AROUND THE PASSENGER SIDE AIR BAG DASH COVERING, I FEAR THIS WILL SEND DANGEROUS SHARDS EVERYWHERE IN CASE OF DEPLOYMENT IN ADDITION TO THE ONES POSSIBLY SENT BY THE AIRBAG ITSELF.",
        "vin": "19UUA66208A"
    },
    {
        "components": "STEERING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/07/2017",
        "dateOfIncident": "04/15/2017",
        "fire": true,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003571,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 ACURA TL. WHILE DRIVING 30 MPH, THE DRIVER NOTICED A STRANGE ODOR WHILE THE AIR CONDITIONER WAS ACTIVATED. ADDITIONALLY, THE POWER STEERING FAILED AND THE STEERING WHEEL BECAME EXTREMELY DIFFICULT TO TURN. ANOTHER DRIVER NOTICED SMOKE UNDER THE HOOD. THE VEHICLE WAS NOT TAKEN TO A DEALER OR INDEPENDENT MECHANIC. THE CONTACT SPOKE TO MCGRATH ACURA OF DOWNTOWN CHICAGO WHO OFFERED TO DIAGNOSE THE VEHICLE, BUT THE CONTACT DID NOT BRING IN THE VEHICLE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STATED THAT THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 12V222000 (STEERING). THE APPROXIMATE FAILURE MILEAGE WAS 70,000.",
        "vin": "19UUA76598A"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/07/2017",
        "dateOfIncident": "04/20/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10993715,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "NHTSA 12V-222. ACURA SAYS THERE ISN'T ANY RECALL ON THIS MATTER. MEANWHILE, THE SMOKE THAT IS CAUSING THIS PROBLEM MAKES IT UNBEARABLE FOR US TO TURN ON THE HEAT OR A/C BECAUSE OF THIS FAULTY MANUFACTURE PROBLEM.",
        "vin": "19UUA76598A"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/30/2017",
        "dateOfIncident": "04/21/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10992182,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING LEAK INTO CATALYTIC CONVERTER AND SYSTEM MALFUNCTION. SMOKE FROM THE ENGINE.",
        "vin": "19UUA76598A"
    },
    {
        "components": "AIR BAGS,SEAT BELTS,SEATS",
        "crash": false,
        "dateComplaintFiled": "04/08/2017",
        "dateOfIncident": "04/08/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10971441,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVERS SIDE CURTAIN AND TORSO AIRBAG DEPLOYED, AND SEAT BELT TENSIONER OPERATED WHEN PASSENGER SIDE TIRE HIT A POTHOLE ON THE OFF RAMP OF A LIMITED ACCESS HIGHWAY. CAR WAS TRAVELING AT APPROXIMATELY 65 MPH.",
        "vin": "19UUA662X8A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/28/2017",
        "dateOfIncident": "02/26/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10957521,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING ON HIGHWAY ABOUT 70 MILES PER HOUR SPEED, CAR SUDDENLY LOSS ACCELERATION POWER.  HOWEVER, THE CAR RADIO WAS STILL ON.  I WAS ABLE TO PULL OFF TO THE SHOULDER OF THE ROAD.  SAT THERE ABOUT 2 MINUTES. TURNED CAR BACK ON, AND WAS ABLE TO ACCELERATE AGAIN AND CAR STARTED TO OPERATE PROPERLY.  VERY SCARY TO BE DRIVING AT HIGH SPEED AND SUDDENLY LOOSE ACCELERATION POWER.  THANK GOD IT WAS A SUNDAY MORNING WITHOUT MUCH TRAFFIC AND I WAS ALREADY IN THE FAR LEFT LANE.  OTHERWISE, THIS COULD HAVE BEEN A SERIOUS SAFETY HAZARD, WITH ANOTHER CAR STRIKING ME BECAUSE I SUDDENLY DECELERATED AND STOPPED.  PLEASE LET ME KNOW IF OTHER OWNERS HAVE REPORTED SUCH PROBLEMS.  THIS NEEDS TO BE ADDRESSED IMMEDIATELY.",
        "vin": "19UUA66268A"
    },
    {
        "components": "AIR BAGS,SEATS",
        "crash": false,
        "dateComplaintFiled": "12/23/2016",
        "dateOfIncident": "02/02/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10937181,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE ARE THREE LONG CRACK ON MY DASHBOARD, I'M AFRAID THAT IT WILL AFFECT MY FRONT PASSENGER AIR BAG.",
        "vin": "19UUA76678A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/22/2016",
        "dateOfIncident": "07/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10937108,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CRACK DEVELOPED ALONG THE PERIMETER OF THE PASSENGER AIRBAG LOCATION. THIS PRESENTS A POTENTIAL SAFETY HAZARD. THERE NEEDS TO BE A SAFETY RECALL TO FIX THIS POTENTIAL SAFETY HAZARD THAT COULD BE FATAL. ALMOST EVERYONE I KNOW THAT OWNS THIS THIRD GENERATION ACURA TL HAS THIS CRACK PROBLEM. SOMETHING NEEDS TO BE DONE. THIS IS UNACCEPTABLE.",
        "vin": "19UUA66288A"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/19/2016",
        "dateOfIncident": "05/19/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10907523,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 ACURA TL. THE CONTACT STATED THAT THE DOORS HAD TO BE MANUALLY OPENED USING THE KEY FOB. THE FAILURE OCCURRED WITHOUT WARNING. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 120,000.",
        "vin": "19UUA66288A"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/22/2016",
        "dateOfIncident": "08/22/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10897824,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "HANDSFREELINK SYSTEM LOCKED INTO \"BOOTING UP\" MODE. HANDS-FREE CELL USE NO LONGER FUNCTIONS. AFTERWARD, BATTERY WAS DEAD NEXT TIME THE CAR WAS ATTEMPTED TO BE STARTED.",
        "vin": "19UUA66248A"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/15/2016",
        "dateOfIncident": "08/15/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10896155,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "3 ISSUES 1) TWO VERTICAL CRACKS OVERNIGHT ON PASSENGER SIDE DASH AT AIR BAG LOCATION-HORIZONTAL CRACK FORMING-FEAR OF AIRBAG DEPLOYING WHILE DRIVING CAUSING ME TO WRECK-SHOULD BE RECALL-I NO LONGER FEEL SAFE FOR FEAR OR ACCIDENTAL DEPLOYMENT 2)BLUETOOTH MODULE FAILURE-TWO BATTERIES AND ALTERNATOR REPLACED-NOW HAVE MODULE DISCONNECTED-SAFETY ISSUE OF NOT BEING ABLE TO USE HFL WHILE DRIVING 3)SINCE BUYING CAR IN 2008, COMPLAINED ABOUT DRIVERS DOOR CLOSING BACK ON MY LEG WHEN I OPEN IT-HAVE AVOIDED INJURIES SO FAR-AS OTHERS STATED, I HAVE TO KICK DOOR OPEN OR HOLD FOOT ON IT WHEN EXITING VEHICLE FROM WHAT I HAVE READ MANY 2008 TL OWNERS ARE HAVING THE SAME ISSUES -",
        "vin": "19UUA66208A"
    },
    {
        "components": "AIR BAGS,STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/29/2016",
        "dateOfIncident": "06/29/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10881384,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "3 ISSUES  1) TWO VERTICAL CRACKS OVERNIGHT ON PASSENGER SIDE DASH AT AIR BAG LOCATION-HORIZONTAL CRACK FORMING-FEAR OF AIRBAG DEPLOYING WHILE DRIVING CAUSING ME TO WRECK-SHOULD BE RECALL-I NO LONGER FEEL SAFE FOR FEAR OR ACCIDENTAL DEPLOYMENT    2)BLUETOOTH MODULE FAILURE-TWO BATTERIES AND ALTERNATOR REPLACED-NOW HAVE MODULE DISCONNECTED-SAFETY ISSUE OF NOT BEING ABLE TO USE HFL WHILE DRIVING    3)SINCE BUYING CAR IN 2008, COMPLAINED ABOUT DRIVERS DOOR CLOSING BACK ON MY LEG WHEN I OPEN IT-HAVE AVOIDED INJURIES SO FAR-AS OTHERS STATED, I HAVE TO KICK DOOR OPEN OR HOLD FOOT ON IT WHEN EXITING VEHICLE    FROM WHAT I HAVE READ MANY 2008 TL OWNERS ARE HAVING THE SAME ISSUES - WHATS IT GOING TO TAKE FOR NHTSA TO FORCE ACURA/HONDA TO ADDRESS THESE ISSUES? I DONT HAVE $2000 TO REPLACE A DASH THAT I CAUSED NO PART IN THE FAILURE OF. IF MY AIRBAG DEPLOYS ON ITS ON WHILE I AM DRIVING AND I HAVE AN ACCIDENT, THERE WILL BE A LAWSUIT.",
        "vin": "19UUA66258A"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/14/2016",
        "dateOfIncident": "06/06/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10874071,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HANDS FREE LINK WORKS SOME OF THE TIMES I HAVE TO BUMP THE PLASTIC COVER FOR IT TO CONNECT TO MY PHONE, ALSO THE POWER STEERING PUMP AND RESOVOR LEAKS CONSTANTLY AND THE ACURA DEALERSHIP WILL NOT FIX THE PROBLEM BECAUSE THE CAR ISN'T UNDER WARRANTY THIS SHOULD BE FIXED WHEN YOU GET THE HOSES REPLACED BECAUSE OF THE RECALL I THINK IT SHOULD BE AS WELL. VERY DISSATISFIED HOW ACURA WILL NOT ADDRESS THE ISSUES WITH THE HFL AND THE POWER STEERING!!!!",
        "vin": "19UUA66268A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/19/2016",
        "dateOfIncident": "09/01/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10865748,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT APPROXIMATELY 50MPH THE CAR SUDDENLY STALLED. VSA AND TRANSMISSION LIGHT ILLUMINATED. I PULLED OVER TO A SAFE SPOT, TURNED THEY VEHICLE OFF AND BACK ON. THE LIGHTS WENT OFF AND DRIVING SEEMED NORMAL, BUT AFTER DRIVING FURTHER IT HAPPENED AGAIN. TOOK THE CAR TO DEALERSHIP AND THEY SAID IT WAS THE PEDAL POSITION SENSOR, PAID TO HAVE IT REPLACED. THE NEXT DAY WE DROVE TO TEXAS FROM NC AND THE SAME THING HAPPENED. WE CALLED THE DEALERSHIP AND THEY SAID IT MAY TAKE A MONTH FOR EVERYTHING TO REPROGRAM. WE GAVE IT A YEAR AND NOTHING CHANGED SO TOOK IT TO A MECHANIC WHO DISCOVERED THE PART WAS NEVER REPLACED. WE PAID TO HAVE IT REPLACE AGAIN. PROBLEM IS NOW RESOLVED.",
        "vin": "19UUA6608A0"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/09/2016",
        "dateOfIncident": "05/06/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10863897,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 ACURA TL. WHILE DRIVING AT APPROXIMATELY 40 MPH, THE VEHICLE LOST ALL POWER AND THE CHECK ENGINE AND VSA WARNING LIGHTS ILLUMINATED. THE CONTACT DEPRESSED THE ACCELERATOR PEDAL THREE TIMES TO MOVE THE VEHICLE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE ACCELERATOR PEDAL POSITION SENSOR NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED; HOWEVER, AFTER THE CONTACT LEFT THE DEALER, THE FAILURE RECURRED. THE VEHICLE WAS NOT TAKEN BACK TO A DEALER OR DIAGNOSED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 124,000.",
        "vin": "19UUA66258A"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/19/2016",
        "dateOfIncident": "10/01/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10837085,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "HANDS FREE LINK MODULE HAS FAILED. IT NOW CAUSES BATTERY DRAIN, CAUSING THE BATTERY TO FAIL AFTER 1 WEEK OF NOT DRIVING. NOW ON MY 3RD BATTERY IN TWO MONTHS. THIS IS A KNOWN PROBLEM ACROSS THE ACURA MODELS WITH HANDS FREE LINK, REFERENCED IN THE ACURA FORUMS. ADDITIONALLY, NOT HAVING A HANDS FREE SYSTEM FOR CELLULAR USE POSES A MAJOR PUBLIC SAFETY RISK.",
        "vin": "19UUA76598A"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/31/2015",
        "dateOfIncident": "05/05/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10836189,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 ACURA TL.  CONSUMER WRITES IN REGARDS TO POWER STEERING FEED HOSE LEAK RECALL REPAIRS.  *SMD  THE CONSUMER IS SEEKING REIMBURSEMENT FOR THE REPAIR HE PAID FOR. *JB",
        "vin": "19UUA66258A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/01/2015",
        "dateOfIncident": "09/26/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10779161,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DASHBOARD ON 2008 ACURA TL IS CRACKED NEAR THE PASSENGER SIDE AIR BAG. THE MANUFACTURES OF ACURA CLAIMS THIS IS NOT A SAFETY ISSUE. THEY ARE WELL AWARE OF THIS DEFECT AS IT IS A PROBLEM WITH SEVERAL MODELS.THIS DEFECT COULD EFFECT THE DEPLOYMENT OF THE AIRBAG DUE TO THE FACT THIS AREA IS NOW BEING EXPOSED TO ENVIRONMENTAL ELEMENTS. PLEASE SEE PHOTO ATTACHED BELOW.",
        "vin": "19UUA66258A"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "08/12/2015",
        "dateOfIncident": "07/24/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10748163,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 ACURA TL. WHILE ACCELERATING FROM A STOP SIGN, THE CONTACT HEARD A LOUD NOISE COMING FROM THE TOP OF THE VEHICLE. UPON FURTHER INSPECTION, THE CONTACT NOTICED THAT THE SUN ROOF SHATTERED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THAT THE SUN ROOF NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 100,000.",
        "vin": "19UUA66218A"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/28/2015",
        "dateOfIncident": "06/13/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10744130,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "RECEIVED \"IMPORTANT SAFETY RECALL NOTICE\" FROM ACURA IN JUNE 2012 REGARDING ISSUES WITH POWER STEERING FLUID LEAKING POSSIBLY CAUSING A FIRE.  THE VEHICLE WAS RETURNED TO AN AUTHORIZED ACURA DEALER FOR REPAIRS SOON AFTER RECEIPT OF NOTICE.  IN JUNE 2015 THE SAME AUTHORIZED ACURA DEALER STATED AFTER A ROUTINE SERVICE VISIT THAT THE STEERING RACK IS LEAKING AND THE STEERING PUMP IS LEAKING.  THE ESTIMATED COST TO REPAIR IS $2,299.00.  SOON AFTER I WROTE LETTERS TO BOTH ACURA CUSTOMER SERVICE DEPARTMENT AND THE COGGIN ACURA REQUESTING AN INQUIRY AND FINANCIAL ASSISTANCE TO REPAIR THE HAZARDOUS VEHICLE.  I DID NOT RECEIVE A RESPONSE FROM COGGIN ACURA; HOWEVER, ACURA CUSTOMER SERVICE DEPARTMENT RESPONDED WITH A COMPLETE REJECTION.  THIS IS CLEARLY A VERY DANGEROUS ISSUE, ONE THAT WAS SERIOUS ENOUGH AT ONE TIME FOR A RECALL.   I AM THE ORIGINAL VEHICLE OWNER AND HAVE SERVICED THE VEHICLE AT ACURA AUTHORIZED DEALER.",
        "vin": "19UUA75528A"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/21/2015",
        "dateOfIncident": "07/15/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10735452,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 ACURA TL. WHILE DRIVING AT 2 MPH, THE ENGINE STALLED AND THE CHECK ENGINE WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VIN WAS NOT AVAILABLE. THE APPROXIMATE FAILURE MILEAGE WAS 100,000.",
        "vin": ""
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/16/2015",
        "dateOfIncident": "06/15/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10725606,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AS MY CAR SAT IN A PARKING GARAGE, NOT BEING DRIVEN, MY DASHBOARD DEVELOPED TWO HUGE AND DEEP CRACKS RIGHT ON TOP OF WHERE MY PASSENGER AIRBAG IS. I CALLED ACURA CUSTOMER SERVICE AND WAS TOLD THAT THIS IS NOT A SAFETY ISSUE AND SINCE THERE IS NO RECALL ANYWHERE ON MY VEHICLE THAT I WOULD HAVE TO COVER THE ENTIRE COST OF REPLACEMENT. I DO BELIEVE THIS IS A SAFETY CONCERN CONSIDERING THE CRACKS ARE RIGHT ON TOP OF MY AIRBAG AND DO NOT KNOW HOW THIS COULD AFFECT THE POSSIBLE DEPLOYMENT OF THE AIRBAGS IF NEEDED.",
        "vin": "19UUA66268A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/16/2015",
        "dateOfIncident": "06/15/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10725656,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "6/16/15  I NOTICED A STRAIGHT LINE CRACK ON THE PASSENGER SIDE DASHBOARRD. IT LOOKS LIKE IT IS WHERE THE AIRBAG IS KEPT AND I AM EXTREMELY CONCERNED. I HAVE READ OTHERS HAVING THE SAME PROBLEM ONLINE AND WANTED TO REPORT THIS PROBLEM AND SEE IF THERE IS A RECALL. I HAVE NEVER HAD THIS PROBLEM ON ANY OF THE HONDA'S I HAVE DRIVEN IN THE PAST 30 YEARS, ALL OF WHICH WERE IN CENTRAL FLORIDA.     I WOULD APPRECIATE A RESPONSE.",
        "vin": "19UUA66268A"
    },
    {
        "components": "SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/10/2015",
        "dateOfIncident": "05/30/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10724607,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2008 ACURA TL'S COMPLIANCE BUSHINGS WERE FOUND TO BE CRACKED. HOWEVER, WHAT MAKES ME REPORT THIS TO THE NHTSA IS THE FACT THAT ACURA'S 2004-2008 TL COMPLIANCE BUSHINGS CONSISTENTLY CRACK, POSING A DANGER TO THE CAR'S OCCUPANTS, AND ANY SURROUNDING CARS. THE CRACKED COMPLIANCE BUSHINGS POSE A DANGER BECAUSE IT BECOMES POSSIBLE FOR THE LOWER CONTROL ARM TO COME LOOSE, CAUSING THE COLLAPSE OF THE RESPECTED WHEEL, POSING A THREAT TO TRAFFIC. ON ANOTHER OCCASION, A 2004-2006 ACURA TL'S WHEEL COLLAPSED IN THE MIDDLE OF A CROWDED STREET, AND THANKFULLY OTHER CARS WERE ABLE TO AVOID THE TL, HOWEVER, A BIGGER ISSUE COULD ARISE IF THIS WERE TO HAPPEN ON A HIGHWAY, OR IF A DRIVER COULDN'T AVOID THE TL. NHTSA, PLEASE LOOK INTO THIS ISSUE. IT'S A PRICEY FIX AT DEALERS, AND ACURA SHOULD TAKE THIS INTO CONSIDERATION.",
        "vin": "19UUA66278A"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/16/2015",
        "dateOfIncident": "12/23/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10706178,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2008 ACURA TL CONTINUES TO DISPLAY A \"TIGHTEN FUEL CAP\" WARNING LIGHT.  I'VE REPLACED THE FUEL CAP, BUT IT CONTINUES TO DISPLAY THIS LIGHT.  IT IS VERY ANNOYING, AND I'VE BEEN READING OTHER COMPLAINTS ONLINE.  MY CAR IS NOT THE ONLY ONE WITH THIS PROBLEM.  I ALSO HAD TO REPLACE MY FRONT MOTOR MOUNT AND TRANSMISSION.    *TR",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "04/15/2015",
        "dateOfIncident": "04/06/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10705839,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "ALL SEASON",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "COMING BACK FROM NEW YORK ON 95 NORTH I HIT A HUGE  POTHOLE WHEN I WAS SWITCHING LANES. AS I STOPPED TO TAKE A LOOK I NOTICED A BULGE ON THE SIDEWALL OF MY RIGHT FRONT TIRE AND THE RIM IS DAMAGED. IT IS NOT FIXABLE AND THE TIRE NEED TO BE REPLACED!  *TR",
        "vin": "19UUA66228A"
    },
    {
        "components": "STRUCTURE,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "04/08/2015",
        "dateOfIncident": "03/19/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10704551,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I TRAVEL THIS ROAD MONDAY-FRIDAY AND THE ROAD CONSTRUCTION HAS CAUSED LOSE ROCKS AND DEBRIS TO FLY ALL OVER AND DUE TO THAT I NOW HAVE MUTIPLE WINDSHEILD CHIPS AND TWO CRACKS.  *TR",
        "vin": "19UUA66298A"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/08/2015",
        "dateOfIncident": "03/30/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10704559,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON 301 NORTH BOUND JUST BEFORE CEDERVILLE ROAD AND JUST BEFORE 7-11 AND WAWA FAR LEFT LANE THERE IS A MASSIVE SINK HOLE . DAMAGE AREA ON MY CAR IS FRONT DRIVER WHEEL .   *TR",
        "vin": "19UUA66298A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/13/2015",
        "dateOfIncident": "11/13/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10694134,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A 2008 ACURA TL FROM WITH 50,000 MILES ON IT. AFTER THE FIRST YEAR OF OWNING IT I NOTICED A CRACK ON THE RIGHT SIDE OF THE DASH WHERE THE AIR BAG IS. CALLED ACURA THEY SAID THERE IS  NOTHING THEY CAN DO ABOUT IT BUT BUY A NEW ONE REALLY. I SEE THE SAME COMPLAINTS IN HERE THAT I HAVE, SO IT'S NOTHING WE HAVE DONE TO THE DASH. THERE NEEDS TO BE A RECALL ON THESE DASH. ALSO AT 55,000 MILES MY BLUETOOTH HAS GONE OUT AS WELL. AGAIN NO HELP BUY A NEW ONE. CAN SOMEONE PLEASE TELL ME WHAT IS GOING ON WITH THIS    THANK YOU   *TR",
        "vin": "19UUA66218A"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/07/2015",
        "dateOfIncident": "10/31/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10670811,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 ACURA TL. THE CONTACT STATED THAT WHILE DRIVING 15 MPH, THE STEERING WHEEL BECAME DIFFICULT TO TURN. THE CONTACT HAD TO APPLY EXCESSIVE FORCE TO THE STEERING WHEEL IN ORDER TO TURN THE VEHICLE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC. THE TECHNICIAN STATED THAT THE POWER STEERING FLUID AND THE POWER STEERING HOSE NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 85,000.",
        "vin": "19UUA765X8A"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/26/2014",
        "dateOfIncident": "12/24/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10668302,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "12\" VERTICAL CRACK ON PASSENGER SIDE DASHBOARD, FOUND MANY COMPLAINTS OF SAME NATURE ON THE INTERNET AND ONE HERE,  HERE IS THE COMPLAINT FOUND HERE:  MY 2008 TL DASHBOARD STARTED TO CRACK IN AUGUST OVER THE PASSENGER AIRBAG AREA. NOW IN SEPTEMBER THERE ARE AT LEAST 3 LENGTHY CRACKS THROUGHOUT THE DASHBOARD. ALTHOUGH I LIVE IN FL. I PARK IN A COVERED GARAGE EVERY DAY FOR WORK FROM 10 AM TO 6:30 PM. I PREVIOUSLY OWNED A 2001 TL AND NEVER HAD THE DASH CRACK IN THE 7 YEARS OWNED. I FEEL THAT THE CRACKING DASHBOARD IS A MANUFACTURER DEFECT THAT SHOULD BE RECOGNIZED BY ACURA.  *TR",
        "vin": "19UUA66238A"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "12/24/2014",
        "dateOfIncident": "12/01/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10661701,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 ACURA TL. CONSUMER STATES BLUETOOTH MODULE STOPPED WORKING. *TA  THE DEALER INFORMED THE CONSUMER, THEY COULD NOT TELL WHAT WAS WRONG, UNLESS THEY TOOK THE UNIT APART, A COST OF $125.00.*JB",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/10/2014",
        "dateOfIncident": "03/01/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10643755,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "BLUETOOTH MODULE FAILED AND REMAINS INOPERABLE. A LOOK ONLINE SHOWED THAT MANY OTHER ACURA OWNERS HAVE HAD BLUETOOTH FAILURES AND AT FAR HIGHER RATES THAN OTHER CARS.  *TR",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/24/2014",
        "dateOfIncident": "08/01/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10638835,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2008 TL DASHBOARD STARTED TO CRACK IN AUGUST OVER THE PASSENGER AIRBAG AREA.  NOW IN SEPTEMBER THERE ARE AT LEAST 3 LENGTHY CRACKS THROUGHOUT THE DASHBOARD.  ALTHOUGH I LIVE IN FL. I PARK IN A COVERED GARAGE EVERY DAY FOR WORK FROM 10 AM TO 6:30 PM.  I PREVIOUSLY OWNED A 2001 TL AND NEVER HAD THE DASH CRACK IN THE 7 YEARS OWNED.  I FEEL THAT THE CRACKING DASHBOARD IS A MANUFACTURER DEFECT THAT SHOULD BE RECOGNIZED BY ACURA.  *TR",
        "vin": "19UUA66248A"
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/27/2014",
        "dateOfIncident": "08/24/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10628634,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 08/24/2014, FEW MINUTES AFTER LEAVING MY HOUSE, WHILE MAKING A LEFT TURN AT A LOCAL INTERSECTION W/ SPEED < 10 MPH, SUDDENLY I HEARD THIS LOUD METALLIC NOISE, N I FELT MY CAR HAD DROPPED A BIT.  MY CAR STOPPED RIGHT IN THE MIDDLE OF STREET, N COULD'T MOVE AT ALL.  LOWER BALL JOINT HAD SEVERED.  PASSENGER FRONT WHEEL IS TILTED OUTWARD AT A 60 DEGREE ANGLE.  RIGHT FRONT AXAL GOT PULLED OUT OF TRANSMISSION.  CAR BODY DAMAGED BECAUSE ALL THE UNSUPPORTED WEIGHT PLACED ON TILTED WHEEL.  THERE'RE WITNESSES, AND MY MOM IS W/ ME AT THE TIME OF INCIDENT.  HAD AAA TOWED IT TO THE SHOP AND SINCE IT WAS CLOSED ON SUNDAY, I HAD TO WAIT TILL MONDAY TO CALL THEM FOR QUOTES.  I WAS GONNA HAVE MY INSURANCE TAKING CARE OF IT, BUT FIGURED THIS HAS NOTHING TO DO WITH ME, I DIDN'T  DO ANYTHING WRONG, N THE CAR NEVER HAD ANY MAJOR ACCIDENTS.  I DID ALMOST ALL A1B1 SERVICES AT ACURA DEALER AND MOSTLY THOMAS ACURA LOCATED IN COVINA.  I WAS THERE FOR SERVICE ON JULY 16TH, 2014, N THE REPORT THEY GAVE ME NEVER MENTIONED ANYTHING ABOUT BALL JOINT.  I CALLED THOMAS ACURA ON MONDAY, 08/25/2014 REGARDING  THE INCIDENT, THE GUY NAME [XXX] WANTED ME TO BRING IN THE CAR SO THEY CAN INSPECT IT SO THEY CAN DETERMINED WHO'S AT FAULT,  BUT AT THE SAME TIME HINTING ME THERE'S MUST BE SOME SORTS OF IMPACT CAUSING THIS.  I TOLD HIM THERE'S NOTHING ON THE STREET, AND NO OTHER PARTY/CAR HAS HIT MY VEHICLE.  I HAD MY CAR TOWED FROM THE SHOP TO THE DEALER N LET THEM INSPECT IT.  I ALSO SENT ACURA NORTH AMERICA AN EMAIL AND STATED THE INCIDENT.  THE GUY NAME [XXX] FROM THOMAS ACURA CALLED ME BACK ON 08/26/14, N TOLD ME THAT THERE'S AN IMPACT, N I BETTER HAVE INSURANCE INFO READY.  I AM PRETTY SURE ACURA N AMERICA IS GONNA TAKE THEIR SIDE.  THERE MUST BE SOME SORTS OF DEFECTS BUT SEEMS LIKE THERE IS NOTHING I CAN DO.  MY FAMILY COULD BE DEAD IF THIS HAPPENED ON A HIGHWAY.  SOMEONE NEEDS TO DO SOMETHING ABOUT THIS.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "19UUA66268A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/27/2014",
        "dateOfIncident": "12/20/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10628845,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION SHIFTING GEAR GETS STUCK IN NEUTRAL AND IT TAKES MANY ATTEMPTS TO SHIFT GEAR WHEN IT HAPPENS.  IT IS OCCURRING MORE FREQUENTLY LATELY ALMOST ON A DAILY BASIS.  GEAR GETS STUCK SO BAD IT IS CLOSE TO IMPOSSIBLE TO MOVE IT INTO DRIVE OR PARKING POSITION.  I'VE HAD OTHER VEHICLES IN THE PAST, OLDER THAN THIS ONE, YET NEVER EXPERIENCED ANYTHING LIKE THIS WITH EITHER ONE OF THEM.  THIS IS DANGEROUS BECAUSE THE CAR CAN STALL IN TRAFFIC AND CAN GET HIT BY ANOTHER VEHICLE WHILE I'M TRYING TO SHIFT INTO GEAR.  *TR",
        "vin": "19UUA66278A"
    },
    {
        "components": "STRUCTURE,SEATS",
        "crash": false,
        "dateComplaintFiled": "07/29/2014",
        "dateOfIncident": "10/01/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10617424,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THIS VEHICLE, A 2008 ACURA TL, IN FEBRUARY OF 2012 IN SOUTH FLORIDA.  BY APRIL OF 2013 THE DRIVER'S SEAT LEATHER WAS COMING APART AT THE SEAMS. I TAKE CARE OF MY VEHICLES AND HAD NEVER HAD THIS HAPPEN.  ACURA \"MADE A DEAL WITH ME AS THE CAR WAS OUT OF WARRANTY,\" AND I HAD TO PAY A SUBSTANTIAL AMOUNT OF MONEY FOR THEM TO FIX THE SEAT.  WITHIN FIVE (5) MONTHS OF THAT, THE PASSENGER'S SEAT BEGAN TO COME APART AS WELL.  IT SHOULD BE NOTED THAT IT WAS VERY RARE FOR ME TO HAVE ANY PASSENGERS WITH ME.  WHEN I WAS CLEANING THE CAR, I NOTICED THE DASHBOARD WAS CRACKING DIRECTLY IN FRONT OF THE PASSENGER'S SEAT.    I TOOK THE CAR BACK TO ACURA AND THEY, AFTER TAKING PICTURES AND CONTACTING THEIR CORPORATE OFFICE ,ACURA TOLD ME I WOULD HAVE TO PAY FOR THE SEAT IN IT'S ENTIRETY AND HALF OF THE COST TO REPLACE THE DASHBOARD.  THEY SAID DASHBOARDS CRACK IN SOUTH FLORIDA AND THEY WOULD ONLY PAY FOR PART OF THE REPLACEMENT AND THE SEAT WAS OLD AND WAS NORMAL WEAR.  AGAIN, RARELY DID ANYONE RIDE WITH ME IN MY CAR. ADDITIONALLY, WHEN I TOOK THE CAR TO PEMBROKE PINES ACURA TO HAVE IT EXAMINED, THEY SAID THE CENTER CONSOLE COVER WAS ALSO BAD AND NEEDED TO BE REPLACED--TOTALLY AT MY COST.  I HAVE LIVED IN SOUTH FLORIDA MY ENTIRE LIFE AND THE LAST CAR I OWNED THAT HAD A DASHBOARD CRACK WAS BACK IN THE 1970'S.  WITH BOTH FRONT SEATS COMING APART AND THE DASHBOARD CRACKING, IT IS MY OPINION THAT THERE WAS DEFECTIVE MATERIAL USED ON THIS CAR.   I DO HAVE E-MAILS DOCUMENTING ALL THIS TO AND FROM ACURA DATED NOVEMBER OF 2013 TO BACK UP WHAT IS STATED HEREIN.   *JS",
        "vin": "19UUA66298A"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/14/2014",
        "dateOfIncident": "06/30/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10610427,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 ACURA TL. THE CONTACT STATED THAT WHILE DRIVING AT AN UNKNOWN SPEED, THE STABILITY ASSISTANCE WARNING INDICATOR ILLUMINATED. THE CONTACT THEN NOTICED THAT THE VEHICLE BEGAN TO DRIVE DIFFERENTLY. A MECHANIC WAS UNABLE TO DIAGNOSE THE CAUSE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED AND THE MANUFACTURER WAS NOTIFIED. THE FAILURE MILEAGE WAS 102,000.",
        "vin": "19UUA66288A"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/24/2014",
        "dateOfIncident": "06/02/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10605768,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TO WHOM CONCERN :  DASHBOARD PASSENGER SIDE SUDDENLY CRACKED OVER THE AIR BAG, DURING THE DAY , TEMPERATURE AT 98 AT THIS DAY. ACURA NOTIFIED ;HOWEVER THEY DO NOT REPLACE IT EVEN THE CAR IS UNDER WARRANTY STILL. THE CAR HAS 82000 MILES ,WARRANTY COVERS UNTIL 100000 OR FIVE YEARS. AS I KNOW THERE ARE A LOT C/O ABOUT IT , WE NEED ACURA STEPS ON IT AND GIVE TO US ANSWERS AND REPLACE IT. I HOPE NHTSA ADVOCATE FOR US .  *TR",
        "vin": "19UUA76598A"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/10/2014",
        "dateOfIncident": "04/25/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10597298,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2008 ACURA TL TYPE-S AND THE DASHBOARD ON THE PASSENGER CAR IT COMPLETELY CRACKED. IT HAS ONLY BEEN SERVICED AT ACURA DEALERSHIPS AND I TAKE EXTREMELY CARE OF THE CAR. I ALWAYS USE A SUNSHADE AND THE OFFICIAL ACURA TL'S CAR COVER TO PROTECT IT FROM THE SUN. I NOTICE THE INITIAL CRACKING ON APRIL 25TH, AND IT WAS ABOUT 6-INCHES LONG RIGHT ON THE PASSENGER'S AIRBAG. AT THE TIME THE CAR HAD LESS THAN 79,000 MILES. I MADE A COMPLAINT TO THE DEALERSHIP ABOUT THE EVIDENT DEFECTIVE PART. IT TOOK THEM A MONTH TO GET BACK TO ME WITH A NEGATIVE ANSWER. ACCORDING TO THEM, IT WILL NOT AFFECT AIRBAG DEPLOYMENT AND THE ONLY SOLUTION IS FOR ME TO PAY $1,600.00 FOR THE REPLACEMENT. HOWEVER, NO CHECKS OR STUDIES WERE DONE TO THE CAR TO DETERMINE THIS. I DID MY RESEARCH ONLINE, AND THIS HAPPENS TO HUNDREDS OF ACURA TLS. THEREFORE, IT IS OBVIOUS THAT THIS ARE DEFECTIVE PARTS. I DO NOT THINK THAT ANYONE PAYING FOR A PRODUCT SHOULD HAVE TO PAY THOUSANDS OF DOLLARS A FEW YEARS LATER, DUE TO LACK OF QUALITY OF THAT \"PREMIUM\" PRODUCT. I WOULD THINK THAT AFTER GM'S RECENT LAWSUIT REGARDING A SMALL IGNITION SWITCH, WHICH HAS CAUSED DEATH TO SEVERAL PEOPLE, ACURA WOULD TAKE MORE RESPONSIBILITY ABOUT THEIR CRACKED DASHBOARDS ALONG THE AIRBAGS.   *TR",
        "vin": "19UUA76518A"
    },
    {
        "components": "STEERING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/01/2014",
        "dateOfIncident": "04/01/2014",
        "fire": true,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10576224,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 ACURA TL. THE CONTACT STATED UPON START UP HE NOTICE SMOKE AND HEARD A HISSING NOISE UNDERNEATH THE  HOOD. AN INDEPENDENT MECHANIC EXAMINED HIS VEHICLE AND STATED THE POWER STEERING HOSE DETERIORATED PREMATURELY, RESULTING IN THE POWER STEERING FLUID LEAKING ON THE CATALYTIC CONVERTER. THE MANUFACTURER WAS ALERTED OF THE FAILURE; HOWEVER, STATED THAT HIS VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 12V222000 (STEERING) OR NHTSA CAMPAIGN NUMBER: 08V091000 (STEERING). THE CONTACT HAD INDEED EXPERIENCED THE FAILURE DESCRIBED IN THE RECALL. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGE WAS 86,000.",
        "vin": "19UUA66248A"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/21/2014",
        "dateOfIncident": "03/07/2014",
        "fire": true,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10573930,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 ACURA TL. THE CONTACT STATED THE VEHICLE WAS PARKED, WHEN IT IGNITED INTO FLAMES. THE FIRE DEPARTMENT EXTINGUISHED THE FIRE WHICH ORIGINATED UNDERNEATH THE HOOD. THE VEHICLE WAS COMPLETELY DESTROYED AND TOWED TO AN INDEPENDENT MECHANIC. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 60,000.  UPDATED 5/13/14*CN",
        "vin": "19UUA76538A"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/12/2014",
        "dateOfIncident": "03/02/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10568794,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 ACURA TL. THE CONTACT STATED THAT WHILE THE ACCELERATOR PEDAL WAS DEPRESSED, THE VEHICLE STALLED WITHOUT WARNING.THE CONTACT WAS ABLE TO RESTART THE ENGINE AND RESUME WITHOUT INCIDENT.  THE DEALER PERFORMED AN INSPECTION AND INDICATED THAT THE  ELECTRONIC SYSTEM WAS OPERATING NORMALLY, AND ALSO STATED THAT ADDITIONAL KEYS COULD HAVE CAUSED THE IGNITION SWITCH TO FAIL AND SHUT THE ENGINE OFF. THE FAILURE WAS CORRECTED. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 67,000.  *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/23/2014",
        "dateOfIncident": "01/11/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10565471,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING STRAIGHT AHEAD AT APPROXIMATELY 25-30 MPH, WITH MY FAMILY IN THE VEHICLE, THE FRONT AND BACK DRIVER'S SIDE CURTAIN AIRBAGS DEPLOYED WITHOUT INCIDENT.  FORTUNATELY, I WAS ABLE TO MAINTAIN CONTROL OF THE VEHICLE, AVOIDING ANY INJURIES TO MYSELF OR ANY OF THE PASSENGERS.  I REPORTED THE INCIDENT TO THE LOCAL ACURA DEALERSHIP THAT SOLD ME THE VEHICLE AND THEY EVALUATED THE CAR A FEW DAYS LATER DETERMINING THAT \"THEY SAW NO CAUSE ON THE VEHICLE FOR THE DEPLOYMENT OF THE AIR BAGS...NOR DID THEY SEE ANY WAY IN WHICH THE CAR MALFUNCTIONED.\"  *TR",
        "vin": "19UUA66228A"
    },
    {
        "components": "SUSPENSION,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/18/2014",
        "dateOfIncident": "10/23/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10564736,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE MAKING A LEFT TURN, I HEAD LOUD NOISE ON THE DRIVER SIDE. THE CAR STOPPED ACCELERATING. AFTER I HIT THE GAS PEDAL MUCH HARDER, IT STARTED ACCELERATING BUT VERY SLOWLY. THE MOVEMENT FELT LIKE JERKING MOVEMENT. I STOPPED THE CAR ON THE SIDE OF THE ROAD, AND MADE AN APPOINTMENT AT THE ACURA DEALERSHIP. THEY FOUND OUT THAT THE FRONT LOWER CONTROL ARM BUSHINGS WERE CRACKED. NOT REPLACEABLE UNDER WARRANTY, EVEN THOUGH THEY ACKNOWLEDGED THAT ALL ACURAS HAVE THIS ISSUE, SOME AT 35K MILES, SOME AT HIGHER MILES.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/05/2014",
        "dateOfIncident": "02/04/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10562991,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ON OUR ACURA TL W/NAV 08, THE BATTERY HAS BEEN REPLACED 3 TIMES IN 6 MONTHS. FINALLY FEED UP, TOOK THE VEHICLE TO THE DEALERSHIP. $1000 LATER, PARTS HAD TO BE REPLACED IN THE NAV SYSTEM AND BOTH MOTORS IN THE MIRRORS HAD TO BE REPLACED. THE NAVIGATION SYSTEM IS WHAT WAS CAUSING THE BATTERY TO DRAIN AND THE MIRRORS ON BOTH SIDES WOULD FREELY CLICK AND MOVE AT WILL. I THINK AT A MINIMUM, ACURA SHOULD RECALL THEIR VEHICLES AND FIX THIS PROBLEM AND ISSUE REFUNDS TO THOSE OF US WHO HAVE PAID TO HAVE THEIR VEHICLES FIXED.  *TR",
        "vin": "19UUA66298A"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/22/2013",
        "dateOfIncident": "08/24/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10513146,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "PLEASE NOTE THE PERSISTENT PROBLEMS FOUND IN 3RD GENERATION ACURA TL VEHICLES' POWER STEERING SYSTEMS.  THESE PROBLEMS SEEM TO BE REPORTED FREQUENTLY BY ACURA TL OWNERS AND I BELIEVE THEM TO BE A RESULT OF FAULTY DESIGN AND POOR MANUFACTURING.  THESE PROBLEMS EFFECT THE PERFORMANCE AND SAFETY OF THE VEHICLES AND I BELIEVE SHOULD BE THE BASIS FOR A MANDATORY RECALL.    IN MY OWN VEHICLE, ALONG WITH HAVING TO REPLACE THE POWER STEERING FEED HOSE DUE TO A PREVIOUS RECALL, I HAVE ALSO HAD TO REPLACE THE POWER STEERING PUMP AND POWER STEERING SUCTION HOSE.  I HAVE BEEN TOLD THE POWER STEERING FLUID RESERVOIR LEAKED AND FINALLY THAT THE POWER STEERING RACK NEEDED REPLACEMENT.  GIVEN THE MULTITUDE OF PROBLEMS WITH THIS SYSTEM, I CALLED ACURA CORPORATE TO RELAY THE PROBLEM AND WAS TOLD TO SIMPLY CALL MY LOCAL SERVICE STATION TO GET THE PROBLEMS FIXES AS THEY ARISE.    I RESEARCHED THE ISSUE AND FOUND THAT MANY ACURA OWNERS ARE EXPERIENCING THE ISSUES I HAD AND CONTINUE TO HAVE. RESEARCHING THE ISSUE I HAVE FOUND THAT THE '08 MODEL SEEMS TO GET THE MOST COMPLAINTS DESPITE IT BEING THE \"YOUNGEST\" OF THE TL THIRD GENERATION CARS.    YOUR OWN EXPERTS CAN TAKE A LOOK BUT ONE MECHANIC I CAME ACROSS NOTED THE FOLLOWING:  \"ITS NO WONDER THAT THESE RACKS ARE DESTINED TO FAIL AND LEAK WITH TIME. THE SEALS INSIDE MUST BE SLOWLY ROASTING ON EVERY DAILY COMMUTE THE SYSTEM ENDURES WITH THE SUPER HOT PS FLUID. OVER TIME THE RUBBER IS GOING TO WARP AND DEFORM, BREAKING THE SEAL IN THE SYSTEM, THUS NEGATING ITS SOLE PURPOSE OF HOLDING ANY PS FLUID ALTOGETHER.    ACURA MUST HAVE BECOME AWARE OF THIS AS PROBLEM. HOWEVER, ONLY MADE A REVISION ON THE TYPE-S. IF YOU LOOK AT THE PARTS WEBSITE, YOU'LL SEE HOW THE TYPE-S HAD INTEGRATED A PS FLUID COOLER INTO THEIR SYSTEM:\"    I BELIEVE ACURA KNOWS THERE DESIGN WAS FAULTY AND KNEW THERE WOULD BE A VERY LARGE NUMBER OF FAILURES AND DID NOTHING.  *TR",
        "vin": "19UUA66268A"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/15/2013",
        "dateOfIncident": "02/15/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10498309,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR'S MOONROOF SPONTANEOUSLY EXPLODED -- GLASS SHATTERED INTO THOUSANDS OF PIECES.   DROVE CAR IMMEDIATELY TO A BODY SHOP, WHERE THE INSPECTOR FELT THAT THERE HAD BEEN NO IMPACT FROM ANY KIND OF PROJECTILE.  INSPECTOR KNEW OF A WRAL-TV INVESTIGATION INTO SUNROOF / MOONROOF EXPLOSIONS, AND RECOMMENDED THAT I REPORT THIS INCIDENT TO THE NHTSA.   I WAS DRIVING IN LIGHT TRAFFIC ON THE HIGHWAY AT THE TIME, HEARD A SOUND AKIN TO A RIFLE SHOT AT CLOSE RANGE, AND LOOKED UP TO SEE THE GLASS IN A ZILLION PIECES.  I HAVE PHOTOGRAPHS IF YOU WANT THEM.  *TR",
        "vin": "19UUA66248A"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/28/2013",
        "dateOfIncident": "06/01/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10494900,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 ACURA TL. THE CONTACT STATED THE BRAKES MADE A LOUD SQUEAKING NOISE WHILE DRIVING. THE VEHICLE WAS TAKEN TO THE DEALER SEVERAL TIMES FOR THE FAILURE AND THE DEALER ADVISED THAT THE NOISE WAS NORMAL. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS FOUND THAT THE VEHICLE'S ROTORS WERE NOT THE CORRECT SIZE AND CAUSED BRAKE PAD TO BECOME MISALIGNED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE.  THE FAILURE MILEAGE WAS 36,000 AND THE CURRENT MILEAGE WAS 95,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "09/26/2012",
        "dateOfIncident": "09/26/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10477182,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE SELF ACCELERATED IN PARKING LOT. WENT OVER PARKING CURB, LENDING ON THE TREE 14FT FROM THE CURB AND WAS STOP BY THE TREE. THE VEHICLE MADE INTENSE ACCELERATED NOISE, BEFORE JUMPING THE CURB.  *TR",
        "vin": "19UUA66298A"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/01/2012",
        "dateOfIncident": "11/10/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10463862,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR 2008 ACURA TL AND ALMOST EVERY ACURA TL I SEE HAS A PROBLEM OR IS DEVELOPING A PROBLEM WITH THE SEALS OF THE HEADLIGHTS. THE VEHICLE IS EQUIPPED WITH HID HEADLIGHTS. THE PROBLEM STARTS WITH A SMALL DISCOLORATION OR FOG ON THE INSIDE OF THE HEADLIGHT LENS COVER, AND EXPANDS WITH TIME. THE DISCOLORATION OR FOG LESSENS THE INTENSITY OF THE HEADLIGHTS, CUTTING BACK ON VISIBILITY AND ILLUMINATION. THE DEALER SAID THE FOG IN THE HEADLIGHT PROBLEM IS LOCAL TO ARIZONA ONLY. REALLY?    I WOULD LIKE NTSB OR RESPONSIBLE AGENCY TO DETERMINE IF THIS IS A FACTORY DEFECT AND IF A RECALL SHOULD BE ORDERED TO REPLACE THE HEADLIGHT HOUSING. AS I MENTIONED, I SEE THIS PROBLEM ON MOST ACURA TLS THAT I SEE ON THE STREET.  *TR",
        "vin": "19UUA66278A"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/18/2012",
        "dateOfIncident": "04/14/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10455712,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING HOSE IS LEAKING WHICH CAN POTENTIALLY LEAD TO AN UNDER HOOD FIRE.  CAR WAS RECALLED; HOWEVER, MY CAR'S VIN IS OUTSIDE THE RANGE OF THE RECALL NUMBERS.  THE RECALLED PART IS THE SAME ISSUE THAT I AM HAVING.  MY CAR IS LESS THAN 4 YEARS OLD.   *JS",
        "vin": "19UUA66248A"
    },
    {
        "components": "STEERING,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/27/2012",
        "dateOfIncident": "03/12/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10453220,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2008 ACURA TL TYPE-S.  THERE IS A SAFETY RECALL FOR THE POWER STEERING HOSE FOR THIS MODEL, HOWEVER THE VIN OF MY CAR IS NOT COVERED.  I AM EXPERIENCING THE ISSUE WITH THE POWER STEERING HOSE LEAKING (VERIFIED BY AN ACURA DEALERSHIP).  I CALLED ACURA AND THEY SAID THAT EVEN THOUGH I AM EXPERIENCING THE SAME ISSUE AS CARS THAT ARE COVERED UNDER THE RECALL, MY CAR IS NOT COVERED.  I KNOW FROM READING REPORTS FROM OTHER TL OWNERS WHO HAVE HAD THE SAME ISSUE, THE HOSE ON MY CAR DOES NOT HAVE THE HOSE WITH THE HEAT-SHIELD THAT IS INSTALLED WHEN THE RECALL WORK IS PERFORMED, THUS MY CAR HAS THE DEFECTIVE HOSE AND SHOULD BE COVERED.  *TR",
        "vin": "19UUA76558A"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/06/2012",
        "dateOfIncident": "02/05/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10446838,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "HELLO,           I RECENTLY GOT THE 2008 ACURA TL 3.2 LTR VEHICLE FROM USED CARS DEALER. I OBSERVED THAT POWER STEERING FLUID IS LEAKING AND IS CAUSING THE BURNT SMELL AND SMOKE IS COMING FROM THE HOOD. MY CAR HAS 57750 MILES AND HAD NO WARRANTY. MY VEHICLE WAS NOT ON THE RECALL LIST. I AM PLANNING TO TAKE THE CAR TO ACURA DEALER AND HAVE THEM TAKE A LOOK AT IT.  *TR",
        "vin": "19UUA66298A"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/15/2012",
        "dateOfIncident": "11/24/2011",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10443846,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH MY FOOT ON THE BRAK PEDAL WHEN COMING TO A STOP THE CAR ACCERLERATED.  THE CAR LURCHED FPRWARD.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/07/2011",
        "dateOfIncident": "11/14/2011",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10438954,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY ACURA TL IS A TYPE S. THEY HAVE A RECALL FOR THE HIGH PRESSURE POWER STEERING HOSE ON THE TL BUT NOT THE TYPE S. MY HIGH PRESSURE POWER STEERING HOSE IS LEAKING IN THE SAME PLACE AS ALL THE OTHER TLS (VERIFIED BY NUMEROUS ACURA FORUMS). IT IS LEAKING DIRECTLY ON THE EXHAUST ON THE PASSENGER SIDE OF THE ENGINE COMPARTMENT. SMOKE CAN BE SMELLED AT ALL SPEEDS WHILE DRIVING. THIS IS DEFINITELY A FIRE HAZARD. I AM A MECHANICAL ENGINEER AND AN ASE CERTIFIED AUTO MECHANIC. I PURCHASED A REPLACEMENT OUT OF POCKET AFTER THE DEALER DENIED COVERAGE AND REPAIRED IT. THE REPLACEMENT HOSE CAME WITH HEAT SHIELD WRAP AROUND THE EXACT PLACE MINE IS LEAKING. THE RECALLED HOSE WAS DUE TO HEAT DETERIORATION. MY ORIGINAL HOSE HAD NO HEAT WRAP. IF THE TL-S IS NOT SUBJECT TO THE RECALL, WHY WOULD IT NEED THIS UPGRADE?  *TR",
        "vin": "19UUA76688A"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/14/2011",
        "dateOfIncident": "11/01/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10390082,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR THE LAST 1.5 YEARS, MY WIFE AND I HAVE BEEN COMPLAINING TO THE ACURA DEALERSHIP IN RIVERSIDE, CALIFORNIA ABOUT THE HARD STEERING ON HER 2008 ACURA TL.  THE HARD STEERING HAS ALREADY CAUSED DAILY PAIN AND MUSCLE STRAIN ON MY WIFE'S SHOULDER.  OUR COMPLAINTS HAVE GONE TO DEAF EARS. THEY CHECKED AND ALWAYS SAID THAT \"THE CAR IS FINE, THE CAR IS FINE.\"  I BELIEVE THE CAR IS NOT FINE OR SAFE BECAUSE WE PRESENTLY EXPERIENCE THE PROBLEM.  ISN'T THERE A RECALL WITH REGARDS TO THIS STEERING PROBLEM ON 2008 ACURA TL.  *TR",
        "vin": "19UUA66248A"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/14/2010",
        "dateOfIncident": "11/15/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10370655,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 ACURA TL. THE CONTACT STATED WHILE DRIVING 30 MPH, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE INDEPENDENTLY RESTARTED WITHIN SECONDS. THE VEHICLE WAS TAKEN TO THE DEALER WHERE A DIAGNOSTIC WAS PERFORMED BUT THE TEST DID NOT GENERATE ANY FAILURE CODES. THE MANUFACTURER WAS CONTACTED AND ADVISED THAT THERE WERE NO RECALLS ON THE VEHICLE. THE CONTACT STATED THE MAIN CONCERN WAS IF THE VEHICLE STALLED WHILE DRIVING AT HIGHWAY SPEEDS AND POTENTIALLY CAUSING A CRASH. THE FAILURE MILEAGE WAS 65,000.  UPDATED 01/31/11/ *BF   UPDATED 02/04/11*JB  UPDATED 03/03/11  *BF  UPDATED 03/07/11*JB",
        "vin": "19UUA66278A"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/01/2010",
        "dateOfIncident": "09/30/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10358785,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 ACURA TL. THE CONTACT STATED THAT HIS VEHICLE HAD THE SAME SYMPTOMS MENTIONED IN RECALL NHTSA CAMPAIGN ID NUMBER: 08V091000, STEERING HYDRAULIC POWER ASSIST, HOSE, PIPING, AND CONNECTIONS. THE VEHICLE LEAKED POWER STEERING FLUID ON THE ENGINE.  ACURA REPAIRED THE VEHICLE AT A 50% DISCOUNT. THE FAILURE AND CURRENT MILEAGES WERE 53,800.",
        "vin": "19UUA66298A"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "04/28/2010",
        "dateOfIncident": "12/25/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10327909,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "HEATING SYSTEM ON ACURA TL 2008 IS NOT PROPERLY WORKING. MILEAGE ON CAR IS 21729. PIAZZA ACURA OF READING 1001 LANCASTER AVE. READING PA 19607 TELEPHONE 610-777-0100 LOOK AT ON 04/27/10 AND SAYS THAT MANUFACTURE PUT NEW SYSTEM. AT TEMPERATURE SET 75 STILL FEEL COLD. DEALER ADVISED ME TO SET TEMPERATURE 80 OR 85 TO GET HEAT. THAT'S NOT RIGHT. THIS NEW SYSTEM IS NOT WORKING PROPERLY. I HAVE NEW CAR PLEASE LOOK INTO. THANK YOU *TR",
        "vin": "19UUA66218A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/17/2010",
        "dateOfIncident": "04/08/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10326149,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ACURA TL 2008: ONE INCIDENT, OCCURRED APRIL 8TH, 2008. CAR TOOK OFF FROM A PARKING SPACE, JUST AS I WAS INCHING IT FORWARD WITH MY FOOT ON THE BRAKE. THE BRAKE WOULD NOT STOP THE CAR. IT JUMPED TWO CURBS, I AVOIDED HITTING TWO PARKED CARS. THE CAR STOPPED WITH A PUMP OF THE FOOT BRAKE, ABOUT 90 FEET FROM WHERE IT TOOK OFF. THE SPEED WAS ENOUGH TO GO OVER TWO CURBS, BLOWING OUT THE FRONT PASSENGER TIRE, DAMAGING THE RIM, AND DAMAGING THE REAR PASSENGER TIRE. THE IMPACT CAUSED A SLIGHT INDENTATION TO THE ROOF OF THE ACURA, NEXT TO THE SUN ROOF. *TR",
        "vin": "19UUA66278A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/19/2010",
        "dateOfIncident": "02/16/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10312038,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS APPROACHING A TRAFFIC LIGHT IN MY ACURA TL 2008 CAR. AS I WAS PRESSING THE BRAKES, MY DRIVER SIDE AIR BAGS DEPLOYED. THERE WAS NO CAUSE THAT COULD HAVE TRIGGERED THE AIR BAGS TO DEPLOY; MY CAR WAS NOT HIT IN THE SIDE, THERE WAS NO DEBRIS ON THE ROAD, THERE WERE NO POT HOLES IN THE ROAD. THE AIR BAGS DEPLOYED FOR NO REASON. I HAVE TAKEN MY CAR TO THE ACURA DEALERSHIP AND UPON INSPECTING IT THEY DECIDED THAT THE AIRBAGS DEPLOYED BECAUSE OF A POT HOLE, WHICH IS NOT TRUE. *TR",
        "vin": "19UUA66248A"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/09/2010",
        "dateOfIncident": "01/28/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10308137,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2008 ACURA TL TYPE-S, HAS THE SAME BRAKING PROBLEM AS THAT OF TOYOTA PRIUS.  IT CAUSES BRIEF BUT FRIGHTENING DELAYS, ESPECIALLY IN SLOW SPEED. THE PROBLEM OCCURS INCONSISTENTLY AT VARIOUS INTERVALS.  THIS HAS BEEN AN ONGOING PROBLEM SINCE I PURCHASED THE VEHICLE IN FEBRUARY 2008.  I TOOK THE CAR IN TO THE DEALERSHIP TWICE TO FIX THE PROBLEM.  THEY ATTEMPTED TO FIX THE PROBLEM BY FINDING CLOUDY FLUID IN MASTER CYLINDER AND FLUSHED THE SYSTEM.  IT SEEMED TO WORK FOR A COUPLE OF WEEKS BUT THE PROBLEM RESURFACED. I COMPLAINED TO THE ACURA CLIENT SERVICES OF INCONSISTENT BRAKE FEEL DURING SLOW AND STEADY APPLICATION OF BRAKES.  IN APRIL 2009, THEY SENT A DISTRICT MANAGER TO INSPECT THE BRAKE SYSTEM.  AFTER THE MANAGER INSPECTED THE FLUID LEVEL AND DROVE MY VEHICLE FOR 7 MILES, HE DID NOT FIND ANY PROBLEM AND STATED THAT THE VEHICLE OPERATED NORMALLY.  HOWEVER, THE PROBLEM STILL OCCURS AT LEAST 2-3 TIMES A MONTH.  UNLIKE PRIUS, THE BRAKING SYSTEM DELAYS THAT I EXPERIENCE OCCUR ON SMOOTH, PAVED ROADS. *TR",
        "vin": "19UUA76538A"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "11/18/2009",
        "dateOfIncident": "11/17/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10292675,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH FRONT DOORS DO NOT REMAIN IN OPENED CONDITION CAUSING DIFFICULTIES IN EGRESSING VEHICLE. *TR",
        "vin": "19UUA66248A"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/16/2009",
        "dateOfIncident": "08/01/2008",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10292421,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE AN ONGOING COMPLAINT WITH THE FRONT DRIVER SIDE DOOR CLOSING ON ITS OWN EVEN ON A VERY SLIGHT INCLINE.  WE HAVE TO PUT OUR FOOT ON THE DOOR TO KEEP IT OPEN WHILE EXITING THE VEHICLE.  WE REPORTED THIS TO THE DEALER, BUT AS PER USUAL THEY COULD NOT DUPLICATE THE PROBLEM.  IT HAS NOT GOTTEN ANY BETTER.  THEY SAID EVERYTHING WAS NORMAL.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/27/2009",
        "dateOfIncident": "10/02/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10290008,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "REPLACED TIMING BELT, TENSIONER, FAN BELT, AND BACK LEATHER SEAT (BOTTOM PART). *TR",
        "vin": "19UUA66278A"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/18/2009",
        "dateOfIncident": "10/17/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10288822,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AS A PASSENGER, I OFTEN FIND THE BIG HEAVY DOOR WILL NOT STAY IN THE OPEN POSITION WHILE I AM TRYING TO EXIT FROM THE CAR.  THERE ARE SEVERAL \"LOCKING\" POSITIONS, BUT NONE OF THEM HOLD FIRMLY.  THIS IS ESPECIALLY TRUE IF THE CAR IS ON EVEN A SLIGHT INCLINE.  I FIND MYSELF KICKING THE DOOR OUT OF THE WAY SO I CAN SAFELY EXIT.  THE CAR IS LEASED, AND I WOULD CONSIDER NOT BUYING IT BECAUSE OF THIS PROBLEM.  NO CRASH, NO INJURY, NO DAMAGE TO OUR CAR OR OTHER CARS.  THIS IS AN ANNOYING DESIGN FLAW.  THIS HAS BEEN AN ONGOING PROBLEM SINCE WE  GOT THE CAR. *TR",
        "vin": "19UUA66278A"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/18/2009",
        "dateOfIncident": "11/10/2008",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10288842,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DOORS DO NOT STAY OPEN AND TEND TO CLOSE ON PASSENGERS AS THEY ARE ENTERING OR EXITING THE VEHICLE. *TR",
        "vin": "19UUA66278A"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/15/2009",
        "dateOfIncident": "01/01/2008",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10287471,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 ACURA TL - DOORS WILL NOT STAY OPEN WHEN GETTING OUT OF CAR.  DOORS CLOSE ON INDIVIDUALS WHEN EXITING THE VEHICLE. *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/11/2009",
        "dateOfIncident": "02/08/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10258333,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "HIT ICE ON ROAD AND SLID OFF EMBANKMENT AND HIT ANOTHER CAR.      AIR BAGS DID NOT DEPLOY. *TR",
        "vin": "19UUA76528A"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "01/26/2009",
        "dateOfIncident": "01/23/2008",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10256375,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "TURANZA EL42",
                "productYear": "9999",
                "size": "P215/55R17",
                "type": "Tire"
            }
        ],
        "summary": "I AM THE OWNER OF 2008 ACURA TL WHICH I PURCHASED BACK IN LATE NOVEMBER OF 2008 I HAVE ABOUT 3000 MILES ON THE VEHICLE AND HAVE HAD ONE BLOW OUT DURING REGULAR DRIVING (ON 12/24/08 WITH ONLY 2200 MILES) ON RESIDENTIAL STREETS WITHOUT AND WARNING I CONTACTED BRIDGESTONE ON REGARDS TO THIS AND THE COVERED ONLY 80% OF THE COST TO REPLACE THE TIRE. I NOW HAVE WHAT APPEARS TO BE A BUBBLE ABOUT THE SIZE OF AN EGG NOW IN THE SIDE WALL OF THE DRIVER SIDE TIRE. I BELIEVE THAT THE TIRES THAT CAME WITH THE CAR ARE DEFECTIVE. MY CONCERN IN NOT WITH THE OVER LINE OF TIRE BUT THAT THE LOT OF TIRES THAT WAS PROVIDED ON MY VEHICLE IS DEFECTIVE. ALL THE DRIVING THAT I HAVE DONE HAS BEEN UNDER NORMAL CONDITIONS AND HAVE HAD NO ACCIDENTS NOR COME IN TO CONTACT WITH ANY ROADWAY HAZARDS. I FEEL THIS MATTER NEEDS FURTHER LOOKING INTO BY ANOTHER AUTHORITY. FEEL FREE TO CONTACT ME. *TR",
        "vin": "19UUA66238A"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/01/2008",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10237138,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 ACURA TL WITH EXTERIOR DAMAGE OVER THE DOOR. CONSUMER STATES  THE EXTERIOR FRAME OVER THE DOORS WAS UNUSUALLY SUSCEPTIBLE TO DAMAGE. THAT SECTION OF THE EXTERIOR SHOWED DENTS OR IMPRESSIONS. HE STATES HIS PREVIOUS ACURA TL SHOWED THIS SAME PROBLEM.  *KB",
        "vin": "19UUA66218A"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/14/2008",
        "dateOfIncident": "06/28/2008",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10234278,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR IS A 2008 ACURA TL WITH 2000 MILES.  IT HAD A \"MAJOR ENGINE FAILURE\" TO QUOTE THE ACURA DEALER.  A PISTON ROD BROKE AND DESTROYED THE ENGINE ALONG WITH THE OIL PAN.  I WAS TOLD THIS IS EXTREMELY RARE IF EVER THAT IT HAS HAPPENED.  I WAS ALSO TOLD THIS INFORMATION WAS PASSED ALONG TO THE HIGHEST LEVELS OF THE ACURA CORPORATION.  WHEN THE ENGINE DIED I WAS ON A BUSY ROAD AND HAD TO BE PUSHED INTO A PARKING LOT.  THE CAR HAD TO BE TOWED 120 MILES AWAY SINCE I DO NOT LIVE CLOSE TO A DEALER.  I HAD TO HAVE SOMEONE DRIVE ME TO THE DEALERSHIP TO PICK UP A LOANER CAR.  I ASKED FOR A NEW CAR, INSTEAD I WAS TOLD THAT I WAS ONLY ENTITLED TO AN ENGINE REPLACEMENT.  THIS SEEMS OUT OF LINE CONSIDERING THE EXTREME DAMAGE THE CAR SUFFERED.  IF I WERE ACURA, I WOULD BE CONCERNED THAT THIS IS EITHER METAL FATIGUE OR HUMAN ERROR IN ASSEMBLY.  EITHER, WOULD CERTAINLY CALL INTO QUESTION OTHER CARS THAT WERE PRODUCED ON THAT ASSEMBLY LINE.  *TR",
        "vin": "19UUA66288A"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": true,
        "dateComplaintFiled": "12/26/2007",
        "dateOfIncident": "12/20/2007",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10212858,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 ACURA TL TYPE-S.  THE CONTACT STATED THAT ANOTHER VEHICLE CRASHED INTO THE REAR OF HIS VEHICLE WHILE HE WAS STOPPED.   THE DEALER STATED THAT A SWITCH UNDERNEATH THE DASHBOARD WAS BROKEN WHICH MADE THE BRAKE LIGHTS INOPERABLE.  AS OF DECEMBER 26, 2007, THE DEALER HAD NOT REPAIRED THE VEHICLE.  THE CONTACT FELT THAT THE BRAKE LIGHT FAILURE CAUSED THE CRASH.   THE CURRENT AND FAILURE MILEAGES WERE 500.  UPDATED 02/15/08.  *LJ",
        "vin": "19UUA755X8A"
    }
]