[
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/20/2019",
        "dateOfIncident": "06/20/2019",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11221493,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XK",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "OBD2 SCAN SHOWS THAT THE RUN FLAT TIRES ARE NOT BEING PROTECTED BY A LOW INFLATION WARNING THAT HAS BEEN DISABLED FOR THE VEHICLE. THE RECALL #09V161000 IS REVEALED BY THE OBD2 COMPUTER REPORT SAYING THAT THERE IS A RECALL AND PROVIDING THIS INFO. THE MANUFACTURE MAKES CLAIM THERE IS NOT CURRENT RECALL. I WOULD LIKE TO HAVE THIS CONFIRMED BY NHTSA.",
        "vin": "SAJDA44B575"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/27/2018",
        "dateOfIncident": "03/13/2018",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11081479,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XK",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 JAGUAR XK. THE CONTACT STATED THAT THE CHECK ENGINE LIGHT REMAINED ILLUMINATED WHILE DRIVING APPROXIMATELY 35 MPH. AN UNKNOWN DEALER CONFIRMED THAT THE FAILURE WAS DUE TO THE OXYGEN SENSORS BEING DEFECTIVE. THE SENSORS WERE REPLACED TWICE. THE FAILURE BEGAN AFTER ADDING O'REILLYS OCTANE BOOSTER TO THE FUEL TANK. WHILE USING A FUNNEL THE CONTACT OBSERVED THAT THERE WAS A SEDIMENT IN THE CONTAINER AFTER IT WAS ADDED TO THE FUEL TANK. HE WAS ADVISED BY THE MECHANIC THAT THE SEDIMENT WAS PAINT THINNER. THE CONTACT STATED THAT THE CHECK ENGINE LIGHT ILLUMINATED AFTER THE VEHICLE WAS REPAIRED. THE VIN WAS NOT AVAILABLE. THE APPROXIMATE FAILURE MILEAGE WAS 172,000. *TT    THE CONSUMER STATED THE DEFECTIVE PRODUCT REMAINED AVAILABLE FOR PURCHASE ON THE SHELVES AT THE STORE. *JS",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/12/2014",
        "dateOfIncident": "11/09/2014",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10654457,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "X-TYPE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 JAGUAR X-TYPE. THE CONTACT STATED WHILE DRIVING APPROXIMATELY 35 MPH, A VEHICLE CRASHED INTO THE DRIVER'S SIDE OF THE CONTACT'S VEHICLE AND THE DRIVER'S SIDE AIR BAG FAILED TO DEPLOY. THE DRIVER'S AND REAR WINDOWS FRACTURED DURING THE CRASH AND AS A RESULT, THE CONTACT SUSTAINED INJURIES TO THE FACE, HEAD AND LEFT ARM. A POLICE REPORT WAS FILED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS TOWED. THE FAILURE MILEAGE WAS 74,000.",
        "vin": "SAJWA51A57W"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/06/2014",
        "dateOfIncident": "02/04/2014",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10563267,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XK",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE PASSENGER FOOTWELL BECAME DRENCHED WITH WATER WHICH STARTLED THE DRIVER AND OBVIOUSLY THE PASSENGER WHO WAS WET AND HER SHOES SOAKED IN WATER.  THE CAUSE IS SOMETHING JAGUAR IS AWARE OF BECAUSE THEY HAVE ISSUED A SERVICE BULLETIN TSB JTB001211 WHICH REPLACES THE DRAIN TUBE FROM THE AC.    THIS IS A REAL SAFETY CONCERN AND MANY JAGUAR XK VEHICLES 2007-2011 HAVE EXPERIENCED THIS PROBLEM AND HAVE BEEN FORCED TO PAY $1,200 - $1,500 FOR THE DEFECT TO BE REPAIRED.  MANY VEHICLES ARE OUTSIDE OF WARRANTY PERIOD.      THE SUDDEN RUSH OF WATER FROM THE DASH IS LIKELY TO CAUSE A SERIOUS ACCIDENT.  *TR",
        "vin": "SAJDA43B975"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,POWER TRAIN,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/10/2013",
        "dateOfIncident": "12/21/2012",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10555415,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "X-TYPE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE STALLED OUT WHEN WE WERE TRAVELING IN THE PASSING LANE AT SPEED ON AN INTERSTATE HIGHWAY.  WE HAD TO MOVE TO THE RIGHT SIDE SHOULDER OF THE HIGHWAY IN FRONT OF ANOTHER VEHICLE WE HAD JUST PASSED AND OTHER TRAFFIC COMING CLOSE BEHIND.  DEFINITELY A SCARY SITUATION FOR US AND THE OTHER DRIVERS.  WE WERE TOWED TO THE NEAREST JAG DEALER. THE DEALER HAD OUR CAR FOR TWO WEEKS.  THEY REPLACED THE FUEL PUMP.  THE SERVICE TECH'S TOLD US THAT THEY HAD NEVER HEARD OF A FUEL PUMP GOING BAD IN AN X-TYPE.  WHEN I QUESTIONED THE COST OF THE JOB, ABOUT $1450, I WAS TOLD THAT THE FUEL TANK HAD TO BE REMOVED TO REPLACE THE FUEL PUMP.  SINCE THAT TIME, WE HAVE HAD A BATTERY REPLACED, THE SECOND FOR THIS CAR SINCE WE HAVE OWNED IT, AND HAD TO HAVE BRAKE PADS REPLACED, AT WHICH TIME, WE WERE TOLD THAT THE REAR BRAKES HAD A PROBLEM IN THE CALIPERS THAT CAUSED THE PADS TO SIT FURTHER FROM THE DISCS THAN THEY SHOULD.  THIS BRAKE PROBLEM CAUSES US TO USE EXTRA PEDAL TRAVEL WHEN BRAKING THE CAR.  THEN, ON DEC 9, 2013, THE REAR DIFFERENTIAL FELL OUT OF THE BOTTOM OF OUR CAR.  WE WERE ONLY DOING ABOUT 20 MPH SO THERE WAS NO ACCIDENT, BUT WE HAD TO BE TOWED TO A JAG DEALER ABOUT 30 MILES AWAY.  MY RESEARCH FOUND THAT WHEN THE FUEL TANK IS REMOVED, THE DIFFERENTIAL WOULD ALSO BE REMOVED.  THIS WAS CONFIRMED BY THE SERVICE WRITER WHERE MY JAG WAS TOWED.  ONE OF THE DIFFERENTIALS BOLTS BROKE WHERE IT APPEARED TO HAVE BEEN CRACKED, AS IF IT HAD BEEN OVER TORQUED WHEN INSTALLED!  THE SERVICE WRITER ASKED TO SEE THE WORK ORDER FOR THE FUEL PUMP WORK, SO I ASKED HIM TO LOOK IT UP.  HE WAS NOT ABLE TO FIND THE INFO, BECAUSE THE WORK WAS DONE OUT OF WARRANTY AND THE JAG SYSTEM DOES NOT RECORD OUT OF WARRANTY WORK!  THAT IS PROBABLY WHY THE TECHS NEVER HEARD OF A FUEL PUMP GOING BAD OR A DIFFERENTIAL FALLING OUT OF A JAG CAR, EVEN THOUGH THERE HAVE BEEN EXAMPLES OF BOTH REPORTED HERE!   *TR",
        "vin": "SAJWA51A87W"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/04/2013",
        "dateOfIncident": "01/04/2013",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10515012,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XK",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "INCIDENT #1 - JAN 2013: AS I WAS BRAKING TO A STOP, THE CAR SUDDENLY WENT TO WHAT I WOULD CALL \"FULL THROTTLE\".  MY FOOT WAS ON THE BRAKE SO I FIRMLY PRESSED THE BRAKE TO PREVENT THE CAR FROM CRASHING INTO MY BUILDING. I TRIED PUMPING THE ACCELERATOR QUICKLY WHILE PRACTICALLY STANDING ON THE BRAKE BUT THAT MADE NO DIFFERENCE IN THE RPMS.  I PRESSED THE BUTTON TO STOP THE ENGINE.  I RE-STARTED THE CAR AND IT RAN NORMALLY.    INCIDENT #2 - FEB 2013: THINKING INCIDENT #1, ABOVE, WAS A FLUKE, I CONTINUED DRIVING THE CAR WITHOUT REPORTING THE INCIDENT TO MY JAGUAR DEALER.  MY VICE PRESIDENT AND I STOPPED AT A MCDONALD'S, PAID AT WINDOW #1 AND AS WE MOVED TO WINDOW #2 TO PICK UP THE FOOD, THE CAR AGAIN WENT TO FULL THROTTLE'WITH NO ADVANCE WARNING WITH THE BACK WHEELS SPINNING.  MY FOOT WAS ON THE BRAKE AS THERE WAS A CAR IN THE LANE IN FRONT OF ME.  THIS TIME I KNEW TO TURN THE ENGINE OFF QUICKLY.  AGAIN, THE CAR RAN NORMALLY AFTER RE-STARTING IT.  MY VICE PRESIDENT, JACK FRENCH, WILL PROVIDE TESTIMONY TO THIS INCIDENT.    INCIDENT #3 - EARLY APRIL 2013:  THE CAR WAS PARKED ALL DAY.  I GOT IN TO LEAVE FOR THE DAY AND STARTED THE ENGINE.  WHILE THE CAR WAS STILL IN PARK, THE ENGINE REVVED TO RED-LINE 4 TIMES IN A ROW ABOUT 2 SECS EACH.  I TOOK MY FOOT OFF THE BRAKE PEDAL WHILE IT WAS DOING THIS AND NEVER TOUCHED THE ACCELERATOR OR BRAKE PEDAL DURING THE INCIDENT. AFTER REVVING FOUR TIMES TO RED LINE, THE ENGINE WENT BACK TO NORMAL IDLE.    INCIDENT #4 - APRIL 25TH:  MY VP AND I WERE AT A MEETING WITH THE CAR PARKED FOR SEVERAL HOURS.  WE GOT IN AND DROVE ABOUT 4 BLOCKS.  AS I BRAKED TO A STOP AT A STOP SIGN WITH A CAR IN FRONT OF ME , THE ENGINE AGAIN WENT FULL-THROTTLE WITH NO WARNING; THE BACK WHEELS SPINNING.  I AGAIN PRESSED THE START BUTTON AND TURNED THE ENGINE OFF.  MY VICE PRESIDENT WILL PROVIDE WRITTEN TESTIMONY OF THIS INCIDENT AS WELL.  *TR",
        "vin": "SAJDA44B575"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/01/2013",
        "dateOfIncident": "09/07/2007",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10514619,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "X-TYPE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED CAR NEW FROM MONTCLAIR NJ, HAD IT SIX MONTHS TOOK IT TO DEALER THEY KEPT IT 4 WEEKS FOR PART, BOX, TRANSMISSION.  2YRS YEARS LATER TO IT JAGUAR DEALER (MONTCLAIR NJ JAGUAR NO LONGER OPEN) THEY KEPT CAR 10 DAYS GEAR BOX, 2MONTHS LATER NEEDED AND ALTERNATOR,  1WK LATER BATTERY,  NOW SINCE  AUGUST 2012 BRAKES REPLACED TWICE STILL SQUEAK AND THEY SAY IT IS A BRAKE BUSHING.   PART $20 DOLLARS TO INSTALL 350.00  JTB00077 PART C2S46380 INFO FROM DEALER.  WOULD LIKE TO START A LAW SUIT (LEMON) FROM THE BEGINNING PUT CAR IN REVERSE AND IT SOUNDS AS IF THE REAR BOTTOM OF THE CAR IS FALLING OUT. *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/22/2013",
        "dateOfIncident": "04/01/2013",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10509041,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "X-TYPE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "2007 JAGUAR X.  CONSUMER WRITES IN REGARDS TO AIR BAG SENSOR IN PASSENGER SEAT WILL NOT TURN OFF THE DASHBOARD MOUNTED INDICATOR.  *SMD  THE CONSUMER STATED AFTER GAINING FIVE POUNDS, THE LIGHT WOULD COME ON AFTER DRIVING 5-6 MILES AND WOULD NOT GO OUT. WHEN HER FRIEND SAT IN THE PASSENGER SIT, THE LIGHT WOULD GO OUT.  THE DEALER STATED THERE WAS NOTHING WRONG WITH THE VEHICLE.  FOUR MONTHS LATER, THE DRIVERS SIDE INDICATOR LIGHT ILLUMINATED AND THE CONSUMER RETURNED TO THE DEALER. IT REGISTERED A CODE AND AN APPOINTMENT WAS MADE FOR A REPLACEMENT SENSOR. THE CONSUMER STATED SINCE THE REPLACEMENT, THE PASSENGER INDICATOR HAS SINCE ILLUMINATED AGAIN.",
        "vin": ""
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "01/22/2013",
        "dateOfIncident": "01/22/2013",
        "fire": true,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10493781,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "X-TYPE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER'S SEAT HEATER BURNED THROUGH SEAT SCORCHING LEATHER AND COAT OF PASSENGER.  *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/18/2012",
        "dateOfIncident": "12/04/2012",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10489187,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XK",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE ACCELERATING TO CHANGE LANES MY VEHICLE WENT INTO WIDE OPEN THROTTLE.  DESPITE REMOVING MY FOOT FROM THE ACCELERATOR AND SLAMMING ON THE BRAKES THE CAR COULD ONLY BE SLOWED TO 40 MPH. HIT THE IGNITION SWITCH WHICH SHUT THE VEHICLE DOWN INCLUDING LIGHTS. APPEARED I WOULD BE REAR ENDED THEREFORE HIT IGNITION AND VEHICLE RESTARTED WITH CAR STILL STUCK IN WOT WITH FOOT OFF ACCELERATOR.  WITH ENGINE SCREAMING AND RIGHT FOOT FULLY ON BRAKE ONLY ABLE TO HOLD CAR DOWN TO 40 MPH. HIT IGNITION AGAIN WHICH SHUT CAR DOWN BUT ONCE AGAIN FOLLOWING CAR ABOUT TO REAR END ME AND THEREFORE ONCE AGAIN HIT THE IGNITION WITH SAME RESULT WITH CAR RACING FORWARD AT WIDE OPEN THROTTLE DESPITE NO ENGAGEMENT OF THE ACCELERATOR.  THIS TIME AFTER HOLDING THE VEHICLE TO ABOUT 40 MPH WITH FULL PRESSURE ON THE BRAKE WITH MY RIGHT FOOT, AND THE ENGINE AT WIDE OPEN THROTTLE, ALL CARS HAD CLEARED OUT OF THE WAY.  I THEREFORE HIT THE IGNITION SWITCH WHICH SHUT DOWN THE VEHICLE. THIS TIME I BROUGHT THE VEHICLE TO A FULL STOP. I THEN PUT THE CAR IN NEUTRAL (UP UNTIL THIS TIME IT HAD BEEN IN DRIVE) AND PUSHED THE IGNITION ON THE CAR AND IT STARTED AT NORMAL RPM. I THEN SHIFTED INTO DRIVE AND THE ENGINE REMAINED AT IDLE SPEED. I THEN , AT IDLE SPEED, TRAVELED TWO BLOCKS TO MY HOUSE.  THE SMELL OF THE BURNING BRAKE PADS WAS TERRIBLE.  THE NEXT MORNING I HAD THE VEHICLE TRANSPORTED ON A FLAT BED TRUCK TO THE LOCAL JAGUAR DEALER WHERE THE VEHICLE REMAINS TO THIS DATE.  THIS ALL TRANSPIRED OVER APPROXIMATELY 300-400 YARDS OVER A NUMBER OF SECONDS.  THERE WAS NOTHING ON THE FLOOR OR IN THE DRIVING COMPARTMENT THAT INTERFERED WITH THE ACCELERATOR   OR BRAKE.  *TR",
        "vin": "SAJWA43B375"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/28/2012",
        "dateOfIncident": "01/27/2012",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10486337,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "X-TYPE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "ON TWO SEPARATE OCCASIONS (1/27/12 AND 3/23/12) THE VEHICLE WAS TRAVELING 65-70 MPH ON AN INTERSTATE  HIGHWAY AND THE ENGINE STALLED.  THE VEHICLE COULD NOT BE RESTARTED AND WAS TOWED TO THE DEALER.  FOR THE 1/27/12 EVENT, THE VEHICLE STALLED OUT IN THE PASSING LANE AND I HAD TO MAKE IT TO THE RIGHT SHOULDER.  THE DEALER DID NOT DETERMINE THE CAUSE AFTER AN EXHAUSTIVE DIAGNOSIS.  IT ALSO INCLUDED DRIVING THE VEHICLE OVER 400 MILES, MOST OF  THEM AT A HIGH SPEED, IN AN ATTEMPT TO DUPLICATE THE PROBLEM.  IT DID STALL-OUT ONCE, AND THE VEHICLE RESTARTED AFTER 30 MINUTES.      THE SECOND EVENT WAS A MERGE FROM ONE INTERSTATE TO ANOTHER WITH THE VEHICLE STOPPING ON AN EXIT RAMP BRIDGE LEAVING LITTLE ROOM BETWEEN THE CAR AND BRIDGE WALL ON ONE SIDE AND THE EXIT RAMP ON THE OTHER.  THIS RESULTED IN THE RECOMMENDATION TO REPLACE THE TWO FUEL PUMPS - WHICH I HAVE IN MY POSSESSION.    I DO WANT TO POINT OUT THAT IN BOTH EVENTS WE WERE IN GREAT FEAR FOR OUR SAFETY.     I ASSUME THIS IS NOT A COMMON PROBLEM, SINCE THERE HAS BEEN NO RECALL OF THE FUEL PUMPS.  I DID WANT TO REPORT IT IN CASE THERE IS AN EMERGING PROBLEM.  *TR",
        "vin": "SAJWA51A27W"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/06/2011",
        "dateOfIncident": "06/04/2010",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10404576,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "X-TYPE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 JAGUAR X-TYPE. THE CONTACT STATED THAT WHEN DRIVING IN REVERSE AT LOW SPEEDS SHE NOTICED THAT THE BRAKES WOULD SQUEAK VERY LOUD. THE VEHICLE WAS INSPECTED BY A DEALER WHO  ADVISED HER THAT THEY WERE UNABLE TO DIAGNOSE THE FAILURE. THE PROBLEM CONTINUED TO OCCUR AND WHEN SHE NOTIFIED THEM  THEY ADVISED HER THAT IT  NORMAL FOR JAGUAR BRAKES TO MAKE THAT SQUEAKING NOISE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 15,000.",
        "vin": "SAJWA51A97W"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/30/2010",
        "dateOfIncident": "08/26/2010",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10352896,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XK",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MY JAGUAR XK 2007'S ACCELERATOR PEDAL GOT STUCK IN THE ON POSITION. I WAS TRAVELING AT APPROXIMATELY 10-20 MILES ON HOUR WHEN I PUNCHED THE GAS PEDAL TO ABOUT 60 MILES AN HOUR. WHEN I RELEASED THE GAS PEDAL THE ACCELERATION CONTINUED. I THEN APPLIED THE BRAKE AND THE CAR CONTINUED TO ACCELERATE. I THEN PUSHED THE BRAKE TO THE FLOOR AND SHIFTED INTO SPORTS MODE AND DOWNSHIFTED. AT SOME POINT THE ACCELERATOR MUST OF DISENGAGED AS I WAS ABLE TO STOP AT THE APPROACHING INTERSECTION. THANK GOD, NO ONE WAS HURT AND I DID NOT HAVE TO CRASH THE CAR TO STOP. I SUBSEQUENTLY HAD THE CAR TOWED TO THE DEALERSHIP WHERE I BOUGHT THE CAR ONLY 5 WEEKS AGO. THEY HAVE HAD THE CAR NOW FOR 3 DAYS AND HAVE NOT GIVEN ME ANY INFORMATION ABOUT WHY THIS OCCURRED. *TR",
        "vin": "SAJWA43B575"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/19/2010",
        "dateOfIncident": "02/12/2007",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10350499,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "X-TYPE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER TRAIN, SIX MONTHS AFTER PURCHASING MY BRAND NEW 2007 JAGUAR X-TYPE IN OCTOBER OF 2006 THE AUTO WAS PUT IN THE SHOP (DEALER MONTCLAIR JAGUAR)AND THEY HELD IT FOR 4 TO 6 WEEKS TO REPLACE THE POWER TRAIN.  THE BUSHINGS HAVE ALSO BEEN PROBLEMS FROM DAY ONE AND THE BRAKES SQUEAK ALL OF THE TIME.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/17/2010",
        "dateOfIncident": "03/30/2009",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10311270,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XK",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I EXPERIENCED 4 UNCONTROLLED ACCELERATION EVENTS WITH MY LEASED 2007 JAGUAR XK COUPE IN THE MONTHS PRIOR TO MARCH 2009. THE CAR WAS TAKEN TO DEALER EACH TIME AND \"EXTENSIVELY TESTED\". THERE WAS NO ANSWER EVER GIVEN FOR THE CAUSE. THE JAGUAR NORTH AMERICA DISTRIBUTOR CONSUMER OFFICE WAS INEFFECTIVE AND UNRESPONSIVE DESPITE NUMEROUS CONTACTS WITH THEM.  I RETURNED THE CAR TO BILL KNIGHT FORD/JAGUAR TULSA IN MARCH 2009 AND LEASED A 2009 JAGUAR XK. *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/11/2009",
        "dateOfIncident": "02/10/2009",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10258326,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "X-TYPE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 JAGUAR X-TYPE.  THE CONTACT WAS DRIVING WHEN THE VEHICLE ACCELERATED UNEXPECTEDLY.  AT THE TIME OF THE FAILURE, THE RPM'S DRAMATICALLY INCREASE, BUT THE WARNING INDICATORS WERE NOT ILLUMINATED ON THE INSTRUMENT PANEL.  THE CONTACT HAD TO PLACE THE VEHICLE INTO NEUTRAL TO PREVENT IT FROM MOVING.  THE RISK OF A SERIOUS CRASH WAS INCREASED.  THE MANUFACTURER STATED THAT THE CAUSE OF THE FAILURE WAS UNKNOWN AND THERE WAS NO CURRENT REMEDY.  THE FAILURE AND CURRENT MILEAGES WERE 32,390.   UPDATED 3/19/09 *CN  THE INCIDENT ALSO OCCURRED WHILE STOPPED WITH THE BRAKES APPLIED. UPDATED 03/26/09.*JB",
        "vin": "SAJWA51A66W"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/27/2008",
        "dateOfIncident": "01/16/2008",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10249985,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XKR",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A BRAND NEW JAGUAR XKR CONVERTIBLE FROM MY LOCAL JAGUAR DEALER ON 1ST AUGUST 2007. SHORTLY AFTERWARDS, WHILST DRIVING ON THE MOTORWAY I ACCELERATED TO OVERTAKE A CAR IN THE MIDDLE LANE. WHEN I RELEASED MY FOOT FROM THE ACCELERATOR, THE CAR CONTINUED TO GO FAST. IT WOULD NOT SLOW DOWN. I APPLIED THE BRAKES AND THE CAR MOMENTARILY APPEARED TO SLOW DOWN BUT THE SHEER POWER OF THE ENGINE CONTINUED TO MAKE THE CAR GO FASTER. THE ONLY WAY I COULD STOP THE CAR, WAS TO PUT THE GEARSTICK INTO PARK AND PRESS THE START/STOP BUTTON. I TOOK THE CAR BACK TO THE DEALERS AND THEY SAID THERE WAS NOTHING WRONG WITH IT BUT THEY RESET THE COMPUTER. THIS SAME PROBLEM HAS HAPPENED ON A FEW OCCASIONS. THE LAST TIME WAS ON 16TH JANUARY 2008 WHICH WAS THE LAST TIME I DROVE THE CAR. THE CAR WENT BACK TO THE DEALERS AND THAT IS WHERE IT REMAINS SOME 10 MONTHS LATER .I HAVE 3 WITNESSES INCLUDING MY WIFE AND A TRAFFIC COP WHO WERE BOTH IN THE CAR ON SEPARATE OCCASIONS. I HAD A MEETING WITH JAGUAR CARS UK AND THE DEALERS BACK IN AUGUST, BUT THEY FAILED TO PROVE ANYTHING. A COURT CASE IS ARRANGED FOR 7TH AND 8TH JANUARY 2009. *TR",
        "vin": "SAJAC44R589"
    },
    {
        "components": "STEERING,TIRES",
        "crash": true,
        "dateComplaintFiled": "09/28/2008",
        "dateOfIncident": "03/05/2007",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10243815,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "X-TYPE",
                "productYear": "2007",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "CONTINENTAL TOURINGCONTACT AS",
                "productYear": "9999",
                "size": "205/65R15",
                "type": "Tire"
            }
        ],
        "summary": "I HAVE HAD THE CAR FOR ONLY 19 MONTHS. HAD ALL 4 TIRES BLOW OUT,  REPLACED IT IN LESS THEN ONE YEAR, THEN HAD TWO MORE REPLACED FOR THREAD ISSUE. DUE TO THE TIRES AND ALIGNMENT , HAD LEFT FENDER INCIDENT AND RIGHT FENDER INCIDENT. ON THE LEFT INCIDENT WAS MAKING A LEFT TURN ON THE HIGHWAY WHEN MY CAR STARTED PUSHING ME TO THE LEFT, THE OTHER CAR SAW ME COMING IN TO HER WHEN , I COULDN'T STOP IT FROM PUSHING IT'S SELF MORE TO THE LEFT. I REPORTED THIS TO MY INSURANCE, BUT THEY TOLD ME THERE WAS NOTHING I COULD DO. SO I WAS BLAMED FOR THIS INCIDENT. AFTER THAT I WENT TO THE DEALER AND THEY GAVE ME AN ALIGNMENT. THEY TOLD ME THERE WAS NOTHING THEY COULD DO FOR THE TIRES AND THE INCIDENT THAT WAS CAUSED. THEY TOLD ME THERE NOT RESPONSIBLE FOR THE TIRES. THE RIGHT FENDER INCIDENT WAS THE SAME THING. THE DRIVER SAW THAT I WAS MAKING A RIGHT TURN WITH MY RIGHT BLINKER ON, CAR STARTED SWERVING MORE TO THE RIGHT AND WE BOTH HIT EACH OTHER. COPS CAME AND TOLD US BOTH THAT HE WOULDN'T FILE IT AS AN ACCIDENT, THAT WE BOTH HAD TO REPORT IT TO OUR INSURANCE. BOTH INCIDENTS WERE NEVER POSTED AS ACCIDENTS. I HAVE NOTICED THAT NO ONE WANTS TO HELP ME. NOT MY INSURANCE NOT THE DEALER. I HAVE BEEN SO FRUSTRATED WITH THIS CAR , IT'S A 2007 CAR . I HAVE FILED A COMPLAINT AGAINST THE DEALER, BUT THERE TELLING ME I NEED TO BE REALISTIC, HOW MORE REALISTIC CAN I GET. I'M SCARED TO DRIVE THIS CAR, BUT I HAVE NO CHOICE I NEED TO GET TO WORK. *TR",
        "vin": "SAJWA51A97W"
    },
    {
        "components": "SUSPENSION,ENGINE AND ENGINE COOLING,FUEL SYSTEM, OTHER,POWER TRAIN,SEATS,EQUIPMENT,UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/28/2008",
        "dateOfIncident": "08/26/2008",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10243821,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "X-TYPE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSFER CASE BURNOUT HAD INTERNAL MANUFACTURE DEFECTS. TEMPERATURE COOLANT SENSOR OVER HEATED AND COMPLETELY MELTED, CAUSING CAR TO OVERHEAT. DRIVERSIDE DOOR PANEL CLIPS DETORIATED. DIMMER LIGHT KNOB HAD 2 REPLACEMENTS AND CONTINUED TO BRAKE. CAR WENT FOR SERVICING, CAR WAS FINE BEFORE SERVICING, CAR CAME BACK FROM DEALERSHIP WITH BREAK PAD AND ROTOR PROBLEMS. DEALERSHIP REPLACED ORIGINAL CAR BREAK PADS WITH FAULTY PADS TO DAMAGE ROTORS AND HAVE ME AS A CUSTOMER PAY FOR A SERVICE THAT IS NOT WARRANTED. CAR ALSO CAME BACK FROM DEALERSHIP WITH AN ENGINE TICK AND TIRE GRINDING SOUND THAT IT NEVER HAD, DEALERSHIP SERVICE MANAGER SAID IT'S NORMAL TO GET OUT OF ENGINE INSPECTION WHEN THESE SOUNDS ARE NEW SOUNDS THAT HAD NEVER EXISTED. GAS CAP FILLER CAME CRACKED AT TIME OF PURCHASE, CAR WAS TAKEN TO DEALERSHIP FOR THAT REPLACEMENT, CAR WAS BRAND NEW WITH THIS DEFECT EXISTING AT TIME OF PURCHASE. CAR LEATHER SEATS ARE DETERIORATING, FADING, PEELING, CHIPPING AND CRACKING. PASSENGER SIDE VISOR SNAPPED OFF. DRIVING TRACTION STABILITY LIGHT COMES ON AND OFF WITH OUT BEING SWITCHED ON. CAR FEELS LIKE IT HAS NO SHOCKS, CAR RIDES OVER SMALL RODE BUMP AND FEELS LIKE IT RAN INTO A BIG WHOLE IN THE RODE, WHEN PAVEMENT IS COMPLETELY SMOOTH, DEALER SAYS SHOCKS ARE FINE, BUT THE CAR DID NOT HAVE THIS EFFECT UNTIL IT CAME OUT OF SERVICE FOR THE DEFECTIVE TRANSFER CASE. *TR",
        "vin": "SAJWA51A97W"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/14/2008",
        "dateOfIncident": "08/25/2008",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10242173,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XK",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE IS EQUIPPED WITH A KEYLESS START OPTION. ON TWO OCCASIONS WITHIN 3 DAYS, THE CAR WOULD NOT STAY RUNNING WHEN THE START BUTTON WAS DEPRESSED. ON EACH OCCASION, AFTER 5-6 ATTEMPTS AT STARTING THE ENGINE, EACH TIME THE ENGINE WOULD STALL WHEN THE TRANSMISSION WAS PLACED IN EITHER D OR R. AFTER WAITING APPROXIMATELY 5 MINUTES, THE CAR WOULD START AND OPERATE NORMALLY. BOTH TIMES THE VEHICLE WAS DRIVEN TO DEALER SERVICE AND EACH TIME THE TECHNICIAN WOULD NOTE \"NO PROBLEM FOUND-COULD NOT DUPLICATE PROBLEM.\" IN BOTH INSTANCES, TECHNICIAN REPROGRAMMED ALL KEYS. IN THE SECOND INSTANCE, THE TECHNICIAN REPLACED THE BATTERIES IN ALL KEYS. THE PROBLEM HAS NOT RECURRED. *TR",
        "vin": "SAJDA44B575"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/02/2008",
        "dateOfIncident": "06/01/2007",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10240634,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XK",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 JAGUAR XK CONVERTIBLE.  WHILE APPROACHING A STOP SIGN, THE CONTACT APPLIED THE BRAKES.  THE VEHICLE LUNGED FORWARD INSTEAD OF STOPPING.  THE BRAKE PEDAL WAS DEPRESSED, BUT THE VEHICLE KEPT MOVING FORWARD AT LESS THAN 2 MPH.  THE VEHICLE DID NOT COME TO A COMPLETE STOP UNTIL IT WAS APPROXIMATELY THREE FEET INTO THE INTERSECTION.  THE DEALER STATED THAT THE ISSUE WAS COMMON AND TO CONTINUE DRIVING THE VEHICLE.  HE WAS ADVISED TO CALL BACK IF THE FAILURE RECURRED.  THE VEHICLE WORKED NORMALLY FOR APPROXIMATELY 3,000 MILES BEFORE THE FAILURE RECURRED.  IN THIS INCIDENT, THE VEHICLE LUNGED FORWARD AND STOPPED APPROXIMATELY TWO INCHES FROM THE PRECEDING VEHICLE.  THE VEHICLE WAS TOWED TO THE DEALER.  THEY KEPT THE VEHICLE FOR APPROXIMATELY 24 HOURS, BUT WERE UNABLE TO FIND ANY FAILURES.  THE VEHICLE WAS TOWED BACK TO THE CONTACT'S RESIDENCE; HOWEVER, HE IS SCARED TO DRIVE IT BECAUSE THE FAILURE COULD RECUR.  THE FAILURE MILEAGE WAS 2,000 AND CURRENT MILEAGE WAS 5,000.  UPDATED 09/29/08. *JB",
        "vin": "SAJWA44B675"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/22/2008",
        "dateOfIncident": "03/03/2008",
        "fire": true,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10239275,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XK",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "JAQUAR 2007 XR XENON HEADLIGHTS (BILATERAL!) BULBS WITHIN HEADLAMP CASE ACTUALLY FULLY MELTED. CAUSED A SMALL CONTAINED FIRE, WHILE CAR WAS PULLING OUT OF DRIVEWAY. DRIVER WITNESSED THIS & CALLED FOR TOW AFTER CONTAINING RT SIDE FIRE INSIDE HEADLAMP..BROUGHT IN FOR SERVICE...ORDERED NEW HEADLIGHTS....WAITED 1 MONTH FOR PARTS TO COME FROM UK....COULDNT DRIVE CAR---NO LAMPS AVAILABLE AT NIGHT...JAGUAR RULED CAR DRIVEABLE WHILE AWAITING PARTS...DRIVER DISAGREED FOR SAFETY REASONS.  ONE MONTH WENT BY, HEADLAMPS, BULBS REPLACED....CALLED JAQUAR SAID I WAS 1 ST SERIOUS HEADLAMP DEFECT.  *TR",
        "vin": "SAJWA43B475"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/15/2008",
        "dateOfIncident": "03/25/2008",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10231062,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XKR",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE AND I NEARLY SUFFERED A FATAL ACCIDENT OWING TO WHAT TURNED-OUT TO BE A KNOWN DEFECT IN THE JAGUAR MOTOR MANAGEMENT SOFTWARE RESIDENT IN OUR AND LIKELY EVERY 2007 AND LATER SUPERCHARGED JAGUAR ENGINE.      OUR AUTOMOBILE, WITH 2800 MILES ON THE ODOMETER, WITHOUT WARNING WENT FROM ACCELERATING INTO THE IDLE MODE AND THEN REMAINED UNRESPONSIVE TO THROTTLE INPUT PLACING  THE AUTOMOBILE IN A DEADLY 'T-BONE,' FORTUNATELY, THE DRIVER OF THE LINCOLN SUV (I CAN STILL SEE THE GRILL IN THE PASSENGER WINDOW AND HEAR MY WIFE'S SCREAMS), MANAGED TO STOP HIS VEHICLE JUST INCHES FROM THE PASSENGER DOOR.  JAGUAR CALLS THE CONDITION THAT DISABLED THE CAR WITHOUT WARNING ITS \"LIMP MODE.\"  THE 'LIMP MODE' WAS FURTHER DESCRIBED BY THE DEALER AND A REPRESENTATIVE OF JAGUAR MANAGEMENT AS 'A MEANS OF PROTECTING A DRIVE-BY-WIRE ENGINE FROM DAMAGE.'      SUBSEQUENT CORRESPONDENCE AND INCREDIBLY UNPRODUCTIVE AND ILL-INFORMED WITH CONVERSATIONS WITH JAGUAR OFFICIALS IN NEW JERSEY REVEALS THAT WHILE THEY TOO KNOW THIS CONDITION EXISTS THEY INTEND TO DO ABSOLUTELY NOTHING ABOUT IT UNLESS A CUSTOMER COMPLAINS.      GIVEN ALL THE ABOVE AND A GREAT DEAL MORE, I REQUEST ODI, IN THE INTERESTS OF AMERICAN PUBLIC SAFETY AND TO ENFORCE CORPORATE INTEGRITY AND RESPONSIBILITY LAWS; REQUIRE JAGUAR TO CONDUCT A PUBLIC, IMMEDIATE RECALL AND PERMANENT REPAIR OF ALL VEHICLES EQUIPPED WITH THE DEFECTIVE SOFTWARE, AND FURTHER, THAT JAGUAR BE REQUIRED TO CERTIFY IN WRITING TO EVERY OWNER AND PERSPECTIVE BUYER A PERMANENT FIX TO THE PROBLEM HAS BEEN MADE AND THAT JAGUAR WILL REMAIN ACCOUNTABLE FOR ENSURING SUCH FOR THE LIFE OF THE VEHICLE.    THANK YOU FOR YOUR ATTENTION TO THIS MATTER.  I HAVE A GREAT DEAL OF INCREDIBLE DOCUMENTATION ON THE INCIDENT AND SUBSEQUENT DISCUSSIONS WITH JAGUAR OFFICIALS. I LOOK FORWARD TO WORKING WITH ODI TO QUICKLY AND PERMANENTLY RESOLVE IT.  *TR",
        "vin": "SAJWA43C679"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/05/2008",
        "dateOfIncident": "01/19/2008",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10216948,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XK",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 1/14/07, TOOK 6-MONTH-OLD 2007 XK TO DEALER FOR KNOCKING SOUND COMING FROM FRONT OF VEHICLE. FOUND TO BE \"RUNNING AS INTENDED,\" NO PROBLEM FOUND. FIVE DAYS LATER, FOUND CAR TO BE COMPLETELY DEAD IN PARKING LOT AFTER LEAVING A RESTAURANT. JAGUAR ROADSIDE ASSISTANCE JUMP-STARTED THE VEHICLE THE FOLLOWING MORNING, RECEIVING AN 'ENGINE FAILURE' WARNING MESSAGE UPON START-UP. CAR WAS TOWED IN ON FLATBED. SOFTWARE UPDATE PERFORMED BY BARRETT JAGUAR SERVICE DEPARTMENT. ALSO REPAIRS MADE AS REQUESTED DUE TO GAS-CAP RELEASE PROBLEMS.  *TR",
        "vin": "SAJWA44B675"
    },
    {
        "components": "STEERING,SERVICE BRAKES, HYDRAULIC,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/29/2008",
        "dateOfIncident": "06/01/2007",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10216415,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XK",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2007 JAGUAR XK.  WHILE DRIVING 20 MPH, THE VEHICLE EXPERIENCED NUMEROUS COMPUTER FAILURES, WHICH CAUSED A COMPLETE LOSS OF POWER, MANUAL STEERING, AND BRAKING ABILITY.  THE VEHICLE WAS TAKEN TO THE DEALER FIVE TIMES.  EACH TIME, THE DEALER DIAGNOSES A DIFFERENT FAILURE; HOWEVER, THE SYMPTOMS ARE ALWAYS THE SAME.  THE BATTERY WAS REPLACED THREE TIMES AND THEY ENHANCED THE COMPUTER PROGRAM AND REPLACED THE ABS.  THE FAILURES ARE TEMPORARILY CORRECTED FOR APPROXIMATELY A WEEK, BUT THEN RECUR.  THE FAILURE MILEAGE WAS LESS THAN 1,000 AND CURRENT MILEAGE WAS 9,500.",
        "vin": "SAJWA44B575"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/28/2007",
        "dateOfIncident": "12/03/2007",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10213865,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XK",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "2007 JAGUAR XK CONVERTIBLE WITH BAD DESIGN WITH DASH AND WINDSHIELD. CONSUMER STATES THAT THE REFLECTION OF THE DASHBOARD ON THE WINDSHIELD NEARLY CAUSED HER TO RUN OVER 2 PEOPLE .  *KB  THE CONSUMER STATED THE COMBINATION OF THE SUN REFLECTING ONTO THE LIGHT COLORED DASHBOARD CREATED A SHADOW EFFECT ON THE WINDSHIELD FIVE INCHES HIGH HORIZONTALLY AND GRADUATING ON EACH END OF THE WINDSHIELD VERTICALLY SEVEN INCHES,  WHICH CAUSED A BLIND SPOT OVER THE WINDSHIELD.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/21/2007",
        "dateOfIncident": "12/20/2007",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10212524,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "X-TYPE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WHOLE REAR END OF THE CAR FELL ON TO THE GROUND.  *TR",
        "vin": "SAJWA51A77W"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/23/2007",
        "dateOfIncident": "10/01/2006",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10188608,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "X-TYPE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2007 JAGUAR X-TYPE.  THE CRUISE CONTROL AUTOMATICALLY GOES BEYOND THE NORMAL OPERATING PROCEDURES AS STATED IN THE OWNER'S MANUAL.  THE CONTACT ATTEMPTED TO ADJUST THE CONTROL AND IT CONTINUED TO MALFUNCTION.  WHILE DRIVING 50 MPH NEAR ANOTHER VEHICLE THE CRUISE CONTROL SPEED DECREASED,  INCLUDING WHEN CHANGING LANES AND WITHOUT WARNING,  IT INCREASED.  JAGUAR STATED THAT THIS  WAS AN OPTION FOR THE VEHICLE,  AND THEY  WERE UNABLE TO ASSIST HIM WITH THIS CONCERN.  THE MANUFACTURER  STATED THAT HE COULD  HAVE THAT OPTION REMOVED.  THE DEALER ADVISED THE CONTACT TO FILE A COMPLAINT.  THE CURRENT AND FAILURE MILEAGE WERE 5,040.   *AK",
        "vin": "SAJDA44B875"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/17/2006",
        "dateOfIncident": "10/12/2006",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10171038,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XK",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "IN THE EVENING OF 10/12/2006, WITHIN ONE DAY OF DRIVING A NEWLY PURCHASED 2007 JAGUAR XK, UPON STARTING, THE VEHICLE RACED INDEPENDENTLY BETWEEN 6 AND 8,000 RPMS UNCONTROLLABLY.  THIS \"RUNAWAY\" CAR EVENT COULD ONLY BE CEASED BY SHUTTING THE CAR DOWN. THE VEHICLE WAS RETURNED TO THE JAGUAR DEALERSHIP IMMEDIATELY THE NEXT MORNING WITH DETAILS OF THE OCCURRENCE.  ON 10/13/2006, THE SERVICE MANAGER AT CROWN JAGUAR, JOHN SCHNEPP INDICATED THAT HE HAD REPORTED THE INCIDENT TO JAGUAR AND HAD BEEN INFORMED BY JAGUAR THAT THE VEHICLE WAS RELEASED WITH DEFECTIVE SOFTWARE AND THAT THERE HAD BEEN AT LEAST TWO OTHER DEALERSHIPS THAT HAD REPORTED THE PROBLEM ALREADY.  HE INDICATED THAT HE WAS INSTRUCTED TO UPGRADE THE ONBOARD SOFTWARE FOR THE PURCHASED VEHICLE TO THE MOST CURRENT RELEASE.  WE ASKED WHAT WERE THEY GOING TO DO WITH THE OTHER 6 OR MORE  OTHER VEHICLES THAT THEY HAD IN INVENTORY.  THE SERVICE MANAGER STATED \"...NOTHING UNLESS THEY EXHIBIT THE SAME PROBLEM\".  WE BELIEVE THAT THIS TYPE OF DEFECT IS NOT ONLY SERIOUS ENOUGH TO WARRANT A COMPREHENSIVE REVIEW OF HIS VEHICLES IN INVENTORY, BUT ALSO WARRANTS A MANUFACTURER RECALL.  A RUNAWAY VEHICLE COULD RESULT IN NOT ONLY DEATH OR INJURY TO A DRIVER AND PASSENGER(S), BUT ALSO PEDESTRIANS.  THIS EVENT WAS REPORTED IN THE AM ON 10/13/2006 VIA PHONE TO GREGORY MAGNO AT THE OFFICE OF DEFECT INVESTIGATION AT NHTSA.  MR. MAGNO INSTRUCTED US TO REPORT THIS DEFECT VIA THIS WEB SITE.  *NM",
        "vin": "SAJWA44B075"
    }
]