[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/09/2019",
        "dateOfIncident": "11/13/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11287905,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A8",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 AUDI A8. WHILE THE VEHICLE WAS IN USE, THE CHECK ENGINE WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS TAKEN TO AUDI PITTSBURGH (2050 LIBERTY AVE, PITTSBURGH, PA 15222, (412) 245-4200) WHERE IT WAS DIAGNOSED THAT THE MASSIVE AIR FLOW SENSORS FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPLACED, BUT THE FAILURE RECURRED MULTIPLE TIMES WITH AN ABNORMAL VACUUM NOISE COMING FROM THE ENGINE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND DID NOT ASSIST. THE FAILURE MILEAGE WAS APPROXIMATELY 119,000.",
        "vin": "WAULV94E48N"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/04/2018",
        "dateOfIncident": "06/04/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11099573,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A8",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL - I JUST RECEIVED WORK ONLINE THROUGH CREDIT KARMA THAT MY CAR HAS A RECALL ON IT DATING BACK TOWARDS 2016. I FINANCED THIS CAR IN 2015. THE CAR HAS BEEN FINE, FOR THE MOST PART ASIDE FROM SMALL ELECTRICAL ISSUES.. HOWEVER MY BIGGEST COMPLAINT SAYS THIS RECALL IS BECAUSE THE AIRBAGS ARE PRONE TO EXPLODING CAUSING METAL SHRAPNEL TO FLY AND CAUSE HEAVY DAMAGE AND POSSIBLY DEATH TO THE PEOPLE IN THE CAR. IN SOME CASES IT SEEMS THE AIRBAGS WILL NOT WORK AT ALL BECAUSE OF POSSIBLE HEAT RUINING THE PARTS THE CAUSE THE AIRBAG TO WORK.",
        "vin": "WAUAF78E78A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/31/2017",
        "dateOfIncident": "12/14/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11057729,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A8",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2008 AUDI A8 WITH ABOUT 48200 MILES. IT IS GREAT VEHICLE BUT HAVING PROBLEMS WITH TRANSMISSION DURING DRIVING. UNDER LOAD IT WILL GO IN FAIL SAFE MODE AROUND 4,5,6 GEARS. IT IS CAUSING DANGEROUS SITUATIONS AS CAR STARTS STOPPING SUDDENLY AND CAUSING DRIVER MOMENTARILY LOOSE CONTROL OF A VEHICLE. THIS IISSUE WAS BROUGHT UP TO A AUDI BUT THEY SAID IT IS PAST WARRANTY. BY DOING AN INDEPENDENT RESEARCH, IT WAS FOUND THAT THERE IS ONE SINGLE TEFLON SEAL CONTROLLING FLUID PRESSURE FOR A CLUTCH E.THAT SEAL WEARS OUT PREMATURELY CAUSING FLUID TO LOOSE PRESSURE AND FAILING SAFE TRANSMISSION. IN ORDER TO REPAIR THIS ISSUE SEAL NEEDS TO BE REPLACED WITH AFTERMARKET ONE. INFORMATION ABOUT IT WAS OBTAINED FROM ZF TRANSMISSION SERVICE BULLETIN AND IS AVAILABLE ONLINE. ZF MANUFACTURING KNOWS ABOUT THIS AND REBUILDING THIS TRANSMISSION. WHEN FLUID PRESSURE IS LOST IT CAUSING TRANSMISSION FAIL SAFE IN ORDER TO PREVENT COMPLETELY BEING DAMAGED. ALL FAIL SAID OCCURS WHEN VEHICLES SHOW BEING DRIVEN. PLEASE INVESTIGATE THIS PROBLEM BECAUSE IT CREATES A SAFETY HAZARD. THE ATTACHED PICTURES ARE SCREENSHOTS FROM SCANNING TRANSMISSION ERRORS. ALSO, THERE IS A COPY OF ZF TECHNICAL BULLETIN MANUAL DESCRIBING CAUSE OF A CLUTCH E.IT SEEMS TO BE DESIGNING FLOW WITH THIS TRANSMISSION. THANK YOU",
        "vin": "WAULV94E98N"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/27/2017",
        "dateOfIncident": "10/27/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11040627,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A8",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL.  MY PASSENGER AIRBAG WAS RECALLED IN JANUARY, 2017.  TEN MONTHS HAVE PASSED WITH NO REPLACEMENT PART OR SOLUTION AND WAS INSTEUCTED NOT TO HAVE PASSENGERS IN THE FRONT SEAT.  HOW LONG AM I SUPPOSED TO WAIT?",
        "vin": "WAUDN74F18N"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/10/2016",
        "dateOfIncident": "10/20/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10934464,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A8",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTOMATIC TRANSMISSION GOING INTO FAIL SAFE MODE DURING DRIVING AROUND 4,5,6 GEARS WHEN GOING AROUND 70+ MPH AND RELEASE GAS PEDAL AND APPLYING GAS AGAIN IN ORDER TO PASS VEHICLE. CAR GOES INTO FAIL SAFE MODE, NEEDS TO BE PULLED OVER TO RESTART AND RESET TRANSMISSION. CAR WAS TAKEN TO A AUDI DEALER FOR AN INSPECTION AND BY TECHNICIAN AT FLUID LEVEL WAS LOW. TOP UP TRANS FLUID . WAS DRIVING OK FOR TWO WEEKS , PROBLEM STARTED AGAIN. TOOK CAR BACK TO A DEALER, TECHNICIAN CALLED AN AUDI SUPPORT CENTER. BY AUDI SUPPORT CENTER WAS RECOMMENDED TO REPLACE ATF FILTER WITH OPTIMIZED ATF FILTER. REASON FOR REPLACEMENT WAS SEAL ON A TOP OF ATF STRAINER THAT WAS SHRINKING BY TEMPERATURE OF FLUID ( PER ZF TRANSMISSION MANUFACTURERS.) BECAUSE OF DESIGN CHANGE , ATF STRAINER CAN COME LOOSE FROM THE GUIDE OF ATF PUMP INTAKE DUCT. AS A RESULT, AIR CAN BE DRAWN IN. AIR CAUSES THE OIL TO FOAM , WHICH PREVENTS THE CLUTCHES FROM CLOSING COMPLETELY AND CAUSE FAIL SAFE MODE TO TRANSMISSION. THIS IS AN INFORMATION I HAVE OBTAINED FROM BOTH DEALER AND ZF TRANSMISSION ENGINEERING.  OWNERS OF AUDI MODELS 2010 A4, 2008-2010 A6, 2008-2010 A8,2010 Q5 MAY HAVE COMPLAINED ABOUT THIS PROBLEM AS WELL. AS A REMEDY, OPTIMIZED ATF STRAINER WAS DEVELOPED. THERE ARE SOME VEHICLES THAT HAVE SAME SAFETY PROBLEM AS MINE. THIS IS A BIG SAFETY CONCERN BECAUSE VEHICLE CAN NOT BE DRIVEN ON EXPRESSWAY BECAUSE OF TRANSMISSION FAIL SAFE MOSTLY DURING PASSING ANOTHER VEHICLES OR CHANGING LANES. WHEN TRANSMISSION FAIL SAFE IT IS ONLY DRIVEN IN 4 GEAR AND WILL NOT SHIFT . VEHICLE HAS TO SLOWED DOWN AND STOPPED FOR RESETTING TRANSMISSION BY SHUTTING CAR OFF AND RESTARTING IT AGAIN. THIS CREATED HAZARDOUS SITUATION FOR MYSELF FEW TIMES AND A BIG SAFETY CONCERN. I DID INFORM AUDI CORPORATION ABOUT THIS ISSUES AND THEY STATED THAT NOTHING CAN BE DONE ON THEIR SIDE TO HELP ME BECAUSE CAR IS OUT OF WARRANTY. CAR WITH 42000 M",
        "vin": "WAULV94E98N"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/09/2016",
        "dateOfIncident": "09/08/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10905010,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A8",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 AUDI A8. THE CONTACT STATED THAT THE VEHICLE HESITATED TO ACCELERATE AND THE BRAKE PEDAL FAILED TO RESPOND WHEN DEPRESSED. THE VEHICLE WAS TAKEN TO THE DEALER, BUT THE FAILURE COULD NOT BE DUPLICATED. THE MANUFACTURER WAS NOT NOTIFIED. THE VIN AND FAILURE MILEAGE WERE NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "05/25/2013",
        "dateOfIncident": "03/22/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10513552,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A8",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE 2008 AUDI A8L WAS INVOLVED IN A ROLLING REAR-END COLLISION WHILE STARTING TO MOVE AT A STOP SIGN. VELOCITY WAS LESS THAN 5 MPH. MINOR COLLISION WITH NO DEPLOYMENT OF AIRBAGS AND NO DAMAGE TO THE CAR AHEAD. THE A8L DROVE NORMALLY AFTER THE COLLISION. INSPECTION AT THE BODY SHOP REVEALED STRESS FRACTURE AND BENDING OF THE FRAME. CAR WAS DECLARED A TOTAL LOSS. IT IS UNACCEPTABLE THAT A FULL SIZE PREMIUM SEDAN SHOULD SUFFER CATASTROPHIC FAILURE OF THE FRAME AT A LOW SPEED COLLISION. A HIGH SPEED COLLISION WOULD HAVE PROVIDED NO PROTECTION TO THE OCCUPANTS OF THE VEHICLE. MULTIPLE CONTACTS MADE WITH AUDI USA VIA UPS LETTER, EMAIL, TELEPHONE, TWITTER AND FACEBOOK. AUDI USA REFUSES TO PROVIDE ANY CRASH TEST DATA ON THE A8 WHICH IS VERY CONCERNING.  I  REQUEST THE NHTSA TO INVESTIGATE IF THIS CAR IS SAFE.  *TR",
        "vin": "WAUMV94E68N"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "09/29/2010",
        "dateOfIncident": "09/28/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10358339,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A8",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL. HI, THIS MORNING I WAS INVOLVED IN AN ACCIDENT WHEN MY 2008 AUDI A8L SUDDENLY ACCELERATED OUT OF CONTROL AS I WAS ENTERING A PARKING GARAGE. THANKFULLY IT APPEARS NO ONE WAS INJURED. I AM EXTREMELY DISTURBED BY THIS INCIDENT. I HAVE ALSO CONTACTED AUDI USA. IS THUS A KNOWN PROBLEM WITH THIS CAR? PLEASE LET ME KNOW WHAT I SHOULD DO. I DON'T WANT THIS TO HAPPEN TO ANYONE ELSE AND I DO NOT KNOW IF I SHOULD ESCALATE THIS ISSUE SOMEWHERE ELSE. I AM ALSO CONCERNED ABOUT DRIVING IT AGAIN AFTER IT IS REPAIRED. I ALWAYS LIKED THE CAR AND IF I DON'T DRIVE IT AGAIN I COULD NOT IN GOOD CONSCIOUS SELL IT TO SOMEONE ELSE. PLEASE LET ME KNOW ANYTHING THAT COULD HELP ME WITH THIS SITUATION. THANKS BOB    (CONTACT WANTED THIS COMPLAINTED COPY AND PASTED INTO THE COMPLAINT FORM)",
        "vin": "WAUMV94E68N"
    }
]