[
    {
        "components": "UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM,FORWARD COLLISION AVOIDANCE",
        "crash": false,
        "dateComplaintFiled": "01/28/2022",
        "dateOfIncident": "06/10/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449215,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "My vehicle [XXX] has a few symptoms that no Audi dealer or European repair shop can tell me the issue first the EPG blinks on then the vehicle won’t start  Then once it finally starts up in the parking gear it’s revving up as if I pressing on the gas it does this on its own my check engine light comes on even when the necessary maintenance have been done.  INFORMATION Redacted PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "Wa1by74l48d"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/04/2022",
        "dateOfIncident": "11/19/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446104,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "Unknown my esp fault was blinking then my car wouldn’t start took it to Audi of Bedford and and another European auto and was told they didn’t know why my vehicle wouldn’t start  After 8 days of sitting it finally started back up still with no explanation as to why it didn’t start",
        "vin": "Wa1by74l48d"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/03/2021",
        "dateOfIncident": "11/30/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11442559,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "Good day,  I took the car for the oil change and was advised by auto repairman that there is a fuel leak underneath the rear passenger side seat and the issue has a recall by Audi.  Repairman stated he was unable to fix it due to the recall and instructed me to contact Audi direct to have the issue fixed.  Sincerely, [XXX]  INFORMATION Redacted PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "WA1BY74L88D"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/25/2021",
        "dateOfIncident": "10/23/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438036,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "Good morning, As of two days ago I began smelling gas when I exited my vehicle. I paid it no mind at the time since I was parked amongst other vehicles in the parking lot and this has never happened before or at least since I owned the vehicle. I placed a card board box under the vehicle just to sense if it was my vehicle and have a sense of security that I had nothing to worry about. The next day I did notice that the box contained stains of fluid and smelled like gas. As this is my only vehicle I had to drive to work and noticed that the smell got worst. As I arrived at work I immediately did some research and found out that there was a recall on the matter, but I did not receive any information pertaining to recall etc. On my way back home I drove below the speed limit and in the slow lane just as a pre-caution. During that time the engine light came on putting my stress level even higher. As of today I have reached out to the dealership and expressed my concerns about the safety of my family with the fluid being gas and may cause a fire.  The response I received was that there was a recall, but it has since been closed. I have been taking the vehicle to be serviced at the Audi dealership and you would think that they would inform me of that information. I am awaiting a call from the corporate office to address my concerns at the moment and I don't think that it is going to be a good one. I contacted them before about the steering column issue where the system locks you out and would not allow access to get the vehicle started. I was told that it was my responsibility because of the age and mileage on the vehicle. Please note, I have not modified or changed anything on the vehicle. These are all manufacturing defects that they know exist.",
        "vin": "wa1ev74lx8d"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/24/2021",
        "dateOfIncident": "09/23/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434157,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I have an audi 2008 q7, that has a gas leak of some kind. Local mechanic says that it could be fuel pump leak. I looked for recalls to this problem and found two for 2008 q7 gas leaks. When I contacted the local audi dealership and gave them my vin, they said no recalls on that vin. When I called Audi corporate, they said the same thing when I gave them my vin. I clearly see the recalls on line and it states all q7 gas engines. This is a fire hazard and Audi is refusing to fix my car, because my vin number isnt listed. Its obvious that its associated with this recall and Im getting no help at all from Audi. They must take care of this recall.",
        "vin": "wa1ey74lx8d"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/02/2021",
        "dateOfIncident": "07/26/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427470,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2008 Audi Q7. The contact stated that his vehicle was included in NHTSA campaign number: 16V660000 (Fuel System, Gasoline). The contact had taken the vehicle to a local dealer where the recall repair was performed. Two years later the VIN was included in NHTSA campaign number: 18V818000 (Fuel System, Gasoline) after the initial remedy failed to correct the failure. The contact recently discovered that fuel had been leaking from the vehicle. Upon investigation, it was discovered that his vehicle was not included in the second recall. The dealer was notified of the failure and informed him that his vehicle was not included in NHTSA Campaign Number: 18V818000 (Fuel System, Gasoline). The manufacturer was notified of the failure but offered no assistance. The vehicle was not repaired. The failure mileage was approximately 146,000.",
        "vin": "wa1by74l48d"
    },
    {
        "components": "UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/07/2019",
        "dateOfIncident": "01/31/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11278646,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY AUDI Q7 WAS CONDUCTED SAFETY RECALL (NHTSA: 16V660) LAST 2017, BUT AFTER RECALL THE CONDITION WAS SAME AS PREVIOUS. THE CONDITION WAS GAS SMELL INSIDE PASSENGER CABIN, AND OUTSIDE (IN WAY OF EXHAUST PIPE..). WHEN I DRIVE COUPLE OF MINUTES, I FELT HEADACHE AND CAN'T DRIVE CONTINUED. I HAD VISITING DEALER SHOP LOCATED IN SPRING IN TEXAS, AND EXPLANATION MY CAR CONDITION, BUT THEY SAID THAT THEY CAN NOT DO AGAIN DUE TO ALREADY ONE YEAR OVER. SO, I'VE CHECKED THEIR REPORTING, BUT I COULDN'T LOCATED ANY CHANGED   ANY REPAIR OR CHANGED PARTS (I.E., SEAL, PACKING) FOR FUEL PUMP SYSTEM. PLEASE SEE ATTACHED. I BELIEVE THIS IS VERY IMPORTANT FOR MY HEALTH DUE TO VERY STRONG GAS LEAK. PLEASE  CONSIDERATION OF MY SITUATION. THANK YOU SO MUCH.",
        "vin": "WA1BY94L88D"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "11/07/2018",
        "dateOfIncident": "11/06/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11149923,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY PASSENGER WINDSHIELD WIPER FLEW OFF WHILE I WAS DRIVING ON THE HIGHWAY. IT WAS RAINING PRETTY HARD AND THE AUTOMATIC WIPERS WERE GOING PRETTY FAST WHEN SUDDENLY IT SNAPPED OFF AND FLEW BEHIND ME. THIS HAPPENED ON MAY 17, 2018. THE DEALER I PURCHASED THE VEHICLE FROM REPLACED IT WITH ANOTHER Q7'S WIPER THAT WAS ON THEIR LOT. THIS HAPPENED AGAIN ON 11/06/2018... I WAS AROUND THE SAME AREA OF THE HIGHWAY, IT WAS RAINING AND THE WIPERS WERE GOING PRETTY FAST. I WAS GOING ABOUT 50  MILES PER HOUR WHEN IT FLEW OFF AGAIN. I THINK THIS IS VERY UNSAFE AS THE WHOLE ARMS FLIES OFF WHICH IS MADE OF HEAVY METAL THAT CAN CRACK SOMEONE'S WINDSHIELD ON THE HIGHWAY OR EVEN WORSE. THERE HAS TO BE SOMETHING THAT CAN BE DONE ABOUT THIS.",
        "vin": "WA1BY74L88D"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/13/2018",
        "dateOfIncident": "09/28/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11140117,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "HI,  MY CAR WAS FOUND HAS BAD GAS SMELL BACK ON SEP 27TH, AND WE BROUGHT CAR TO MIDAS AUTO SERVICE TO CHECK IT UP. LATER THEY CALLED ME THE FUEL PUMP IS CRACKED AND FUEL IS LEAKING WHICH NEED BE FIXED ASAP TO PREVENT FIRE RISK. THEN WE ASK THEM TO DO IT. THEY FINISHED THE FIX ON SAME DAY AND WE PAID $943.38 . LATER AFTERNOON, WE PICKED THE CAR AND WENT BACK HOME. WE CHECKED ONLINE TO SEE IF THERE IS ANY RECALL FOR IT. AND FOUND IT HAS RECALL!  SO, WE CALL THE AUDI RECALL SERVICE DEPARTMENT AT  1800-822-2834. THE REPRESENTATIVE ALAINA TOLD ME TO EMAIL REQUIREMENT REPAIR DOC AND PAYMENT DOC TO THEM TO START THE REIMBURSEMENT PROCESS. I EMAILED TO RIGHT WAY.  AFTER THAT, WE DIDN'T HEAR FROM THEM FRO ALMOST 2 WEEKS AND WE CALLED THEM AGAIN ON OCT 13TH. THEY TOLD US THAT AUDI DECLINED OUR REQUEST AND MAILED US A LETTER ON OCT 12TH WHICH WE DIDN'T RECEIVE YET.    THE PARTS HAS PROBLEM AND WE DON'T KNOW THE RECALL BEFORE THE GAS PUMP IS CRACKING. AUDI SHOULD TAKE RESPONSIBLY FOR THE REPAIRING EXPENSE. WE NEED YOUR HELP!!!  INVOICE AND PAYMENT PROVE ARE ATTACHED FOR YOUR REFERENCE.    THANKS!  LISHAN",
        "vin": "WA1BY74L58D"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/28/2018",
        "dateOfIncident": "01/27/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11065499,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON A CAUSEWAY WHILE RAINING AND SUDDENLY PASSENGER SIDE WIPER ARM BROKE. IT MADE HUGE NOISE AND THANKS GOD IT DID NOT BREAK THE WINDSHEILD OR HIT ANYBODY BEHIND THE WHEEL. COULD HAVE BEEN WORSE. SEEN SEVERAL COMPLAINTS ON AUDIWORLD FORUM BUT NO REMEDY. I ORDERED ONE AND REPLACING ONE NOW. BUT THIS WINDSHIELD WIPER SYSTEM SHOULD HAVE BEEN RECALLED DUE TO SAFETY CONCERN.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/31/2017",
        "dateOfIncident": "01/01/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11041810,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AND MAKING TURNS I WATER COMES OUT FROM UNDERNEATH THE DASHBOARD. IT COMES OUT ON BOTH THE DRIVE AND PASSENGER SIDE DEPENDING ON WHICH WAY I'M TURNING. I HAVE REPORTED THIS TO AUDI AND HAVE READ ABOUT OTHER OWNERS EXPERIENCING THE SAME THING. WHAT I HAVE FOUND OUT IS THAT IT IS A DRAIN PROBLEM. THE PIPING IS CRIMPED DUE TO THE TYPE OF MATERIAL IT IS MADE OUT OF. THIS IS VERY UNSAFE WHEN IT COMES OUT OF THE DRIVER SIDE BECAUSE NOT ONLY IS IT SHOCKING WHILE DRIVING TO HAVE WATER SPLASHED ON YOU, BUT ALSO BECAUSE THE FLOOR IS NOW WET WHERE THE BREAK AND GAS PEDALS ARE LOCATED.",
        "vin": "WA1EY74L18D"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/03/2017",
        "dateOfIncident": "12/01/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11002743,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR HAS A RECALL FOR A FUEL TANK FLANGE AND THE DEALER HAS BEEN TELLING ME SINCE DECEMBER 2016 THAT THE PARTS ARE NOT IN STOCK. I'M GETTING THE RUN-AROUND, EITHER YOUR RECALL IS BS OR THEY ARE IGNORING ME. WHICH IS IT?",
        "vin": "WA1BY74L38D"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/27/2017",
        "dateOfIncident": "01/13/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10968646,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL .I WAS SOLD A VEHICLE UNAWARE OF RECALL AND IT ALSO HAD A OIL LEAK.  THE VEHICLE WAS LEAKING GAS.",
        "vin": "WA1BV94L28D"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/19/2016",
        "dateOfIncident": "12/12/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10936127,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY LIGHTS FREQUENTLY BURN OUT, DAYLIGHT RUNNING LIGHT, BRAKE LIGHTS, LOWER LIGHTS, TAIL LIGHTS, NIGHT LAMPS.  I'VE HAD TO REPLACE MORE BULBS THAN OIL CHANGES.  PLEASE HELP, THIS IS COSTLY AND DEEMED NOT RELIABLE OR SAFE.",
        "vin": "WA1BY74L18D"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/30/2016",
        "dateOfIncident": "11/30/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10928775,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A OPEN RECALL FOR LEAKING FUEL, IN THE PRESENCE OF AN IGNITION SOURCE, COULD LEAD TO A FIRE CAUSING INJURY AND/OR DAMAGE TO PROPERTY.    BUT AUDI HAS NOT PROVIDED ANY REMEDY YET. CALLED UP THE DEALER AND VISITED THE SHOWROOM COUPLE OF TIMES AND THEY SAY THE FIX IS NOT AVAILABLE. AS A PRECAUTIONARY  MEASURE I WOULD LIKE TO GET THIS FIXED AS EARLY AS POSSIBLE. ANY POTENTIAL DAMAGE COULD BE FATAL DUE TO THIS.    I AM NOT ABLE TO SELL OR TRADE-IN MY CAR AS WELL DUE TO THIS PROBLEM.",
        "vin": "WA1EY74L78D"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/28/2016",
        "dateOfIncident": "10/24/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10919747,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AUDI RECALL 20W9... MY 2008 Q7 HAS DEVELOPED A GAS ODOR AFTER TURNING OFF THE MOTOR. THERE IS NO FUEL LEAKAGE OR WARNING LIGHTS THE SMELL IS VERY POTENT AND I DONT THINK IT IS SAFE FOR MY CHILDREN TO RIDE IN I NEED IT FIXED OR FULL COMPENSATION",
        "vin": "WA1BY74LX8D"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/28/2016",
        "dateOfIncident": "10/24/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10919777,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 AUDI Q7. THE CONTACT STATED THAT STRONG FUEL FUMES ENTERED THE VEHICLE WITHOUT WARNING. THE DEALER STATED THAT THE PARTS AND REMEDY WERE NOT PROVIDED FROM THE MANUFACTURER FOR NHTSA CAMPAIGN NUMBER: 16V660000 (FUEL SYSTEM, GASOLINE). THE WINDOWS HAD TO BE OPENED BECAUSE DUE TO THE FUME ODOR, WHICH MADE THE CONTACT NAUSEAS. THE MANUFACTURER WAS NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 60,000. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WA1BY74LX8D"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/20/2016",
        "dateOfIncident": "08/08/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10917543,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE UPPER PLASTIC INTAKE RUNNER FLAPS IN THE INTAKE MANIFOLD BROKE CAUSING THE FLAPS AND PLASTIC DEBRIS TO BE PULLED INTO THE INTAKE PORTS OF THE CYLINDER HEAD RESULTING IN INTAKE VALVE AND INJECTOR DAMAGE.  THIS CAUSED THE ENGINE TO STOP RUNNING.",
        "vin": "WA1EV94L28D"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/09/2016",
        "dateOfIncident": "06/04/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10914984,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "STRONG GASOLINE SMELL WHILE DRIVING AND AFTER CAR IS PARKED IN GARAGE.  DEALERSHIP DIAGNOSED AS BAD FUEL INJECTORS, AFTER FUEL LINE WAS REPLACED AND SMELL DID NOT GO AWAY.  AUDI-CERTIFIED MECHANIC DOES NOT BELIEVE IT IS THE FUEL INJECTORS.  THE SAME MODEL WITHIN A FEW YEARS OF MINE HAS HAD A RECALL FOR FUEL LINE ISSUES.",
        "vin": "WA1EV74L28D"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/07/2016",
        "dateOfIncident": "01/23/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10824712,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR IS LEAKING GAS PROFUSELY WHILE DRIVING.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/15/2015",
        "dateOfIncident": "07/01/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10734103,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "INTAKE MANIFOLD FLAP ON PASSENGER NOT OPENING  FULLY CAUSING THE CHECK ENGINE LIGHT TO TURN ON. I CHECKED THE WEB AND I THERE ARE A LOT OF COMPLAINTS ABOUT THE SAME PROBLEM. I'VE HAD BMW, MERCEDEZ, TOYOTA'S AND A LOT MORE, NONE OF THOSE VEHICLE GAVE ME PROBLEM. AUDI IS TAKING CARE OF OTHER MODELS WITH 2.0 TFSI ENGINE, THEY EXTENDED THE EMMISSION WARRANTY TO 10 YRS OR 100K.  AUDI SHOULD TAKE CARE OF THIS ISSUE ASWELL.",
        "vin": "WA1BV74L08D"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "04/01/2015",
        "dateOfIncident": "01/08/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10703135,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR WAS SLIPPING ON ICE WHEN THERE WAS NOT THAT MUCH ICE. THEN I WAS TOLD IT HAS AN ISSUE WITH AN ABS CONTROL MODULE. THE PART IS OVER $2500 AND THE CAR DOES NOT EVEN HAVE 70 000 MILES. VW HAS RECALLED THIS PART AND SO SHOULD AUDI BEFORE INJURIES AND DEATHS OCCUR.  *TR",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/19/2015",
        "dateOfIncident": "03/02/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10695240,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE NOTICED A FUEL SMELL IN MY GARAGE AND AT FIRST I THOUGHT IT IS MY MOWER. THE NEXT DAY IT HAS GOT STRONGER AND I START GETTING NAUSEA AND HEADACHE. I TOOK IT TO A REPAIR SHOP AND THE SHOWED ME THERE IS A FUEL LEAK ON THE TANK. THEY TOLD ME IT COULD BE THE FUEL PUMP. I DO NOT BELIEVE IT IS THE FUEL PUMP. IT LEAKS LIKE THERE IS A WHOLE OR SOME THING IS BROKEN INSIDE THE COVERED AREA OF THE TANK WHERE THERE IS NO VISUAL ACCESS UNLESS IT IS OPENED. I THINK IT IS A MAJOR ISSUE THAT THEY HAVE TO FIX BEFORE SOMEONE BURNS ALIVE.  *TR",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/26/2013",
        "dateOfIncident": "02/26/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10504604,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 AUDI Q7. THE CONTACT STATED THAT WHILE CLOSING THE REAR  HATCH, A KNOCKING SOUND WAS HEARD. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE HATCH PULL DOWN MOTOR NEEDED TO BE REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 85,300 AND THE CURRENT MILEAGE WAS 86,364.  *TR  UPDATED 5/22/13 *CN",
        "vin": "WA1BY74L38D"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/11/2012",
        "dateOfIncident": "10/11/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10479774,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* (COUNTERFEIT AIRBAG CONCERN) THE CONTACT OWNS A 2008 AUDI Q7. THE CONTACT SUSPECTED THAT HER VEHICLE COULD POSSESS A COUNTERFEIT AIR BAG. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE MANUFACTURER WAS NOT CONTACTED. THE CURRENT MILEAGE WAS 70,000. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/14/2010",
        "dateOfIncident": "02/05/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10336264,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 AUDI Q7. THE CONTACT STATED WHENEVER IT WOULD RAIN OR WHEN WASHING THE VEHICLE, WATER WOULD LEAK INTO THE FRONT PASSENGERS SIDE OF THE VEHICLE. THE DEALER ADVISED THE DRAIN WAS CLOGGED WITH LEAVES AND THE DRAIN WAS UNCLOGGED BUT THE FAILURE PERSISTED. THE DEALER THEN ATTEMPTED TO REPLACE THE CIRCULATOR TO ADDRESS THE FAILURE BUT TO NO AVAIL. THE MANUFACTURER ADVISED TAKING THE VEHICLE BACK TO THE DEALER AND WOULD NOT PROVIDE ANY FURTHER ASSISTANCE. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS APPROXIMATELY 24,000 AND THE CURRENT MILEAGE WAS APPROXIMATELY 30,000.",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "05/08/2010",
        "dateOfIncident": "05/07/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10329366,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Michelin North America, Inc.",
                "productMake": "MICHELIN",
                "productModel": "PILOT SPORT PS2",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "I WAS DRIVING AT 70 MPH ON INTERSTATE WHEN BLOWOUT OCCURRED ON MICHELIN PILOT SPORT PS2 TIRE WITH ONLY 11,000 MILES ON TIRES. THE LEFT FRONT TIRE BLEW. THE TIRES HAD BEEN WELL MAINTAINED BY ROTATING AND BALANCING EVERY 3,500 MILES AND TIRE INFLATION PROPERLY MAINTAINED. THE WEATHER WAS CLEAR AND DRY. I HAD BEEN DRIVING FOR ABOUT 2.5 HOURS WHEN THE INCIDENT OCCURRED. I WAS ABLE TO STEER THE CAR TO THE EMERGENCY LANE  AND CALL FOR ASSISTANCE TO CHANGE TIRE TO SPARE. UPON EXAMINATION, THE INSIDE EDGE OF THE TIRE THE STEEL BELT CAME THROUGH THE TIRE AND CAUSED BLOWOUT. THE OUTSIDE EDGE OF TIRE DID NOT SHOW THE WEAR THAT THE INSIDE EDGE SHOWED AND HAD NOT BEEN READILY NOTICEABLE UPON VISUAL INSPECTION EARLIER IN THE DAY. THE TIRES HAD JUST BEEN ROTATED, BALANCED AND ALIGNED 1 MONTH PRIOR AND THERE WAS A NOTATION TO MONITOR THE TREAD BAR AS THE FRONT TIRES WERE WEARING FASTER THAN THE BACK TIRES (THE CAR IS ALL WHEEL DRIVE). I HAD BEEN DOING A VISUAL INSPECTION OF THE TIRES EACH TIME I GOT IN THE CAR AND HAD NOT NOTICED THAT THE INSIDE EDGE OF THE LEFT FRONT TIRE WAS WEARING UNEVENLY FROM THE OUTSIDE EDGE. THE AAA EMPLOYEE WHO REMOVED THE TIRE STATED THAT HE BELIEVED THAT AIR LEAKED OUT THROUGH THE STEEL AND CAUSED THE BLOWOUT. THE CAR HAS TIRE PRESSURE MONITORING SYSTEM HOWEVER NEVER SHOWED TIRE PRESSURE LOSS UNTIL THE BLOWOUT OCCURRED. *TR",
        "vin": "WA1BV74L38D"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,PARKING BRAKE,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "04/20/2010",
        "dateOfIncident": "01/25/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10326716,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Brake Parts Inc.",
                "productMake": "BRAKE PARTS",
                "productModel": "390377",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "I HAVE ATTEMPTED TO GET MY BRAKES REPAIRED ON A 2008 AUDI Q7.  I HAVE TAKEN IT TO TWO DIFFERENT SERVICE CENTERS WITH 2 VISITS TO EACH ONE.  NONE OF THEM HAVE FIXED THE PROBLEMS COMPLETELY. *TR",
        "vin": "WA1AY74LX8D"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/09/2009",
        "dateOfIncident": "05/30/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10273278,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE START BUTTON:  WITHIN 9,800 MILES, THE ESB STARTED TO BE INOPERABLE. VERY INCONVENIENT.  IT IS CURRENTLY BEING DIAGNOSED AT THE MOMENT. *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/12/2008",
        "dateOfIncident": "08/09/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10237814,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "Q7",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 AUDI Q7.  THE CONTACT STATED THAT THE VEHICLE WOULD SPORADICALLY EXPERIENCE ELECTRICAL FAILURES.  ONE EVENING AS SHE TURNED THE IGNITION SWITCH, THE VEHICLE LOST POWER, WHICH PREVENTED HER FROM REMOVING THE KEY FROM THE IGNITION.  MINUTES LATER, THE RADIO ACTIVATED AND THE VEHICLE BECAME OPERATIONAL.  THE CONTACT IS IN THE PROCESS OF HAVING THE VEHICLE INSPECTED TO DETERMINE THE CAUSE OF THE FAILURE.  THE FAILURE AND CURRENT MILEAGES WERE 5,200. UPDATED 09/17/08. *LJ  THE DEALER REPALCED THE ELECTRICAL WIRES UNDER THE SEAT. UPDATED 09/24/08. *JB",
        "vin": "WA1BY74L78D"
    }
]