[
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/06/2017",
        "dateOfIncident": "07/26/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11013060,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 R",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FUEL TANK {FROM THE INSIDE OUT} AT THE FILLER HOLE HAS MASSIVE CORROSION RENDERING THE TANK USELESS. FUEL HAS THE ABILITY TO LEAK AN LEAK SUBSTANIALLY WHEN THE BIKE IS IN MOTION. FUME LEAKAGE READILY APPARENT AS WELL. PER THE CERTIFIED BMW MECHANIC AN THE SERVICE SUPERVISOR AND I AGREE THE FUEL TANK IS USELESS DUE TO MASSIVE PRE-MATURE  CORROSION AN DEGRADATION OF THE TANK ITSELF. NOTE THAT THE MOTORCYCLE IS MAINTAINED UNDER A CARPORT AND ALWAYS OUT OF THE ELEMENTS. THIS IS A KNOWN FAILURE WITH BMW AND OF COURSE BMW HAS A HISTORY AS YALL WELL KNOW OF REFUSING TO STEP UP AN CORRECT DESIGN FAILURES UNLIKE OTHER COMPANIES SUCH AS TOYOTA. THE DISCOVERY WAS MADE WHEN THE WELL DOCUMENTED FUEL STRIP FAILURE OCCURRED AND THE 3RD STRIP WAS BEING INSTALLED. HOLES THE SIZE OF A POSTAGE STAMP AND \"ROTTEN PAPER THIN\" DEGRADATED METAL UNDERNEATH THE FILLER CAP IS EASILY TOTALLY DETAECTABLE. PER BMW THE TANK IS USELESS AN THERE IS NO FIX UNDER THAN REPLACEMENT- AND GET THIS PER THE BMW DEALER QUOTE - THIS PART IS OBSOLET- BMW IS NOT EVEN MAKING A REPLACEMENT FOR A 9 YR OLD BIKE. IT IS A FIRE HAZARD NOT ONLY TO THE MOTORCYCLE BUT TO THE OPERATOR AS WELL. IT IS CLEARLY A MANUFACTORS DEFECT WHICH BMW REFUSES TO ADDRESS. IT PRESENTS A SITUATION WHERE THE OPERATOR SHOULD NOT BE IN TRAFFIC DUE TO BEING A HAZARD TO HIMSELF, PASSENGERS, OR OTHER DRIVERS. LEAKING FUEL AN FUMES PRESENT A CLEAR HAZARD WHETHER IN MOTION OR EVEN AT IDLE. YALL MUST INVESTIGATE AN DEMAND BMW CORRECT THIS OUTRAGEOUS DESIGN FLAW, MATERIAL FAILURE IF FOR NO OTHER REASON THAN FROM A SAFETY VIEWPOINT. AGAIN, THIS IS A KNOWN ISSUE FOR R1200R'S AND THE 1200RT MODELS. REPLACE THE FUEL TANK IS THE SOLUTION TO THIS PROBLEM.  PLEASE HOLD BMW ACCOUNTABLE FOR TOTALLY SUB-STANDARD WORKMANSHIP WHICH EQUATES TO POTENTIALLY FATAL CONSEQUENCES IF NOT RESOLVED. THK YOU",
        "vin": "WB10398068Z"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/06/2017",
        "dateOfIncident": "08/15/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11013059,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 R",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL PUMP FLANGE LEAKING DUE TO CRACKING. BMW'S 1ST FACTORY ATTEMPT WAS TO PUT A \"SIZING\" RING ON FLANGE TO COMPRESS THE MICRO CRACKS WHICH OF COURSE WAS A JACKLEG APPROACH QUITE COMMON TO BMW MOTORCYCLES. EVENTUALLY WITH IN 1 YR FUEL STARTED MASSIVELY FLOWING DOWN ONTO HOT ENGINE MAKING THE BIKE A ROLLING FIREBALL POTENTIALLY.",
        "vin": "WB10398068Z"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/15/2015",
        "dateOfIncident": "12/01/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10705825,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 R",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BMW R1200 R. WHILE DRIVING APPROXIMATELY 30 MPH, THE SERVICE BRAKE WARNING LIGHT ILLUMINATED. THE CONTACT LOST CONTROL OF THE VEHICLE WHEN THE BRAKE PEDAL WAS DEPRESSED. THE FAILURE RECURRED NUMEROUS TIMES. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE ABS MODULATOR FAILED AND NEEDED BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 16,210.   UPDATED 5/18/15*CN    THE CONSUMER STATED THE DEALER ADVISED THIS FAILURE WAS A COMMON PROBLEM ON THE THREE OR FOUR MODEL. THE CONSUMER BELIEVED THIS FAILURE SHOULD HAVE BEEN RECALLED.   UPDATED 11/16/2015*JS",
        "vin": "WB10398078Z"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/21/2013",
        "dateOfIncident": "08/22/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10536603,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 R",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL GAUGE FAILURE, SUDDENLY STOPPED WORKING AND READS EMPTY AT ALL TIMES.  *TR",
        "vin": "WB103980X8Z"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/20/2013",
        "dateOfIncident": "04/07/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10499477,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 R",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "LOW FUEL WARNING LAMP DID NOT COME ON LEADING TO ME RUNNING OUT OF FUEL ON INTERSTATE HIGHWAY. FUEL GAUGE INDICATED APPROXIMATELY 1/4 TANK (3 BARS) BUT WAS INACCURATE. THIS IS AN UNSAFE CONDITION SINCE LOSS OF ENGINE POWER FROM RUNNING OUT OF FUEL CAN BE QUITE DANGEROUS ON A MOTORCYCLE. THE \"FUEL STRIP\" (PER BMW NOMENCLATURE) FAILS CAUSING FUEL GAUGE TO READ INACCURATELY AND RENDERING LOW FUEL WARNING LAMP INOPERATIVE. THIS IS A COMMON FAILURE ON MANY BMW MOTORCYCLE MODELS FROM 2005-2013. *TR",
        "vin": "WB10398098Z"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/19/2013",
        "dateOfIncident": "10/13/2009",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10499342,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 R",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FROM THE DEALER'S REPAIR ORDER DESCRIPTION: \"THE CUSTOMER REPORTS THE FUEL GAUGE READS LOW (LIGHT ON) WHEN FULL AND READS FULL WHEN EMPTY. ALSO THE RESIDUAL RANGE TO ZERO COUNTS DOWN FROM 253 TO THREE DASHES IN ABOUT THREE MILES AFTER EVERY FILL-UP.\" FUEL LEVEL SENDER PART 16147697815 REPLACED.  *TR",
        "vin": "WB10398039Z"
    }
]