[
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,ENGINE",
        "crash": true,
        "dateComplaintFiled": "11/28/2021",
        "dateOfIncident": "11/01/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441871,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "The problem with the 2008 BMW X3 transmission is going to get someone KILLED!! This transmission DOES NOT RESPOND when depressing the accelerator at random times & HAS DONE THIS SINCE THE DAY I BOUGHT IT. it happened once after pulling away from an ezpass booth - the car just froze and would not accelerate nearly causing an accident. Now it has caused an accident. How are you not doing anything when this has CAUSED DEATHS!!! here is a link to a blog that shows many bmw x3 owners have the problem - some have had their cars replaced by bmw and others have been ignored. this is a serious safety issue that is being ignored by the manufacturer (similar to the toyota issue). please investigate before someone gets killed. http://www.bimmerfest.com/forums/showthread.php?t=262130.",
        "vin": "WBXPC93448W"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/28/2021",
        "dateOfIncident": "11/28/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11441875,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I am working with a journalist at CNBC to get info about this death trap out since NHTSA is ignoring the issue completely. People are telling you their family members are injured and/or dying because 2008 BMW X3’s simply loose power at 70mph and transmission issues that make this care not accelerate, jerk, stall, etc. I have been helping contact other owners    in an effort to see if they have any unreported issues and many say their complaints were also ignored. when you try to accelerate, the transmission \"thinks\" about what gear it should be in. the vehicle hesitates, stalls slightly, and creeps along slowly before second gear catches. the rpms are erratic when accelerating. very unpredictable when trying to accelerate. the hesitation is the main issue, especially when trying to pull out of an intersection across traffic. it can become a very scary situation when you want to accelerate and nothing happens. this is an ongoing problem. nothing in particular causes it to happen besides regular acceleration. the problem is intermittent and may disappear while driving. however, it will appear again for no real reason. a software update was performed in mid-july. the problem was still noticeable. on august 3rd, the vehicle was once again brought in for service work. the service manager came along for the drive and noticed the transmission problem. another 2008 bmw x3 that was on the lot was driven under the same driving conditions. the same issues with the transmission were noted. he told me that they will contact bmw to see if there are any service bulletins on how to correct the problem, but was unaware of any fix currently available. after two service calls the problem still persists without any fix as of yet.",
        "vin": "WBXPC93418W"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/23/2021",
        "dateOfIncident": "03/03/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404395,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT PASSENGER WINDOW REGULATOR FAILED MAKING THE WINDOW NOT WOR AND SIT IN THE FRAME WRONG AT HIGH SPEEDS IT SOUNDS LIKE THE WINDOW WILL SHATTER",
        "vin": "WBXPC93498W"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "02/18/2021",
        "dateOfIncident": "12/19/2020",
        "fire": true,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11396729,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ON DECEMBER 19, 2020 WHILE DRIVING WITH MY DRIVER'S SEAT HEATER ON WARMING MY SEAT DUE TO COLD WEATHER, I WAS ON MY WAY TO PICK UP MEDICATION AT THE PHARMACY WHEN I NOTICED A SHARP STING AND BURNING SENSATION ON MY LOWER RIGHT SIDE. I LOOKED DOWN AND NOTICED MY COAT ON FIRE. I IMMEDIATELY PULLED OVER AND TURNED THE CAR OFF.  I GOT OUT, FRANTICALLY PATTED MY COAT THAT WAS BURNING, AND LOOKED AT MY SEAT TO SEE IF THERE WAS A FIRE AND THERE WAS A HOLE WHERE THE HEATER HAD BURNED COMPLETELY THRU THE LEATHER SEAT. I GOT BACK IN, DIDN'T TURN THE HEATER ON, AND WHEN I ARRIVED HOME I DIDN'T DRIVE UNTIL THAT MONDAY, DECEMBER 21, 2020 I DROVE TO MY LOCAL BMW DEALERSHIP THAT REGULARLY SERVICES MY VEHICLE AND EXPLAINED WHAT HAPPENED AND ASKED IF THERE WAS A KNOWN RECALL OR ISSUES.  HE EXPLAINED IT WAS A KNOWN ISSUE WITH THE HEATER SYSTEM IN THE SEATS FAILING AND CAUSING DAMAGE BUT CURRENTLY NO RECALLS FOR THE ISSUE. I ASKED HOW COULD THAT BE WITH THE DANGER INVOLVED?  I EXPLAINED IT COULD HAVE BEEN TRAGICALLY WORSE IF I HAD CAUGHT FIRE AND COULDN'T GET IT OUT. I WAS LUCKY I FELT IT QUICKLY AND WAS ABLE TO PULL OVER AND  GET OUT OF THE VEHICLE.  CHRIS AT CAIN BMW, NORTH CANTON, OHIO INSPECTED MU VEHICLE AND GAVE ME AN ESTIMATE OF $1,495.00 TO REPLACE THE PART OF MY SEAT AFFECTED WITH A NEW HEATING SYSTEM AND REPAIR.  I FEEL THAT THIS SHOULD BE A RECALL DUE TO THE MANUFACTURER ALREADY KNOWING THERE'S AN ISSUE.  I JUST WANT THEM TO RECALL VEHICLES THEY KNOW ARE AFFECTED AND REPAIR. OR AT LEAST VOLUNTARILY REPAIR VEHICLES THAT REPORT THE ISSUE. (JUST FOR CLARIFICATION: I WAS DRIVING THRU TOWN ON A STATE HIGHWAY AND CITY STREETS) I KEPT THE COAT THAT CAUGHT FIRE JUST IN CASE IT WOULD BE NEEDED LATER.",
        "vin": "WBXPC93488W"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/15/2021",
        "dateOfIncident": "08/01/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11388375,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SHEARED MOTOR MOUNT SUPPORT BRACKET TO ENGINE BOLT AT OR BEFORE 112K MILES.  FOUND BOLT HEAD ON REINFORCEMENT PLATE UNDER SUPPORT BRACKET.",
        "vin": "WBXPC93408W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/12/2021",
        "dateOfIncident": "01/12/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387649,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "BMW FORT LAUDERDALE REFUSES TO REPLACE PASSENGER SIDE AIR BAG! THEY CLAIM ONLY DRIVERS SIDE TANAKA AIRBAG NEEDS REPLACEMENT!",
        "vin": "WBXPC93478W"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,ENGINE",
        "crash": true,
        "dateComplaintFiled": "12/18/2020",
        "dateOfIncident": "05/02/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384143,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR HAS SUDDENLY LOST POWER IN SEVERAL OCCASIONS NEARLY CAUSING AN ACCIDENT AT 60 MPH ON ONE OCCASION. WHEN POWER IS LOST STEERING SEIZES UP COMPLETELY. THIS HAPPENS WITH ABSOLUTELY NO WARNING WHATSOEVER & MY CAR HAS STARTED UP AS THOUGH NOTHING IS WRONG AFTER.  THE SECOND ISSUE IS SO WELL KNOWN IT HAS BEEN LABELED AS THE \"TERRIBLE TRIAD\" AC ROAD ALL BMW FORUMS, YOUTUBE. TWITTER, ETC. YOU CAN FIND THOUSANDS OF CHATS & FORUMS DISCUSSING THE 3 LIGHTS WHICH APPEAR SIMULTANEOUSLY DUE TO TRANSFER CASE ACTUATOR & I DRIVE ISSUES. MY 4X4 LIGHT IS ON INDEFINITELY & ALL OF THE SYMPTOMS CAN BE FELT.",
        "vin": "WBXPC93418W"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/22/2020",
        "dateOfIncident": "06/01/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360382,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "NHTSA: PLEASE HELP, OUR 2008 (BESIDES ALL LOST TIME FOR THE REPAIRED RECALLS)  OUR 2008 BMW X3 IS SUFFERING THE EXACT AS IN THE RECALL BELOW; NHTSA 14V176000,   THE BMW DEALER REPLACED THE CAMSHAFT POSITION SENSORS DUE TO \"ENGINE PROBLEMS\"JULY 2020,MILES 135,000      THIS DID NOT FIX THE PROBLEM.  THAT BMW DEALER, NASHUA NH THEN CALLED US TO SAY IT WOULD BE $4,500.00 TO FIX.  UNSAFE TO DRIVE, IT LOST POWER BY 70% OR GREATER-MY WIFE, AND I HAVE BEEN NEARLY _REAR ENDED WHEN THIS OCCURED AT HIGWAY SPPEDS-AND SLOWER LOCAL SPEEDS IE 65MPH OR 30 MPH LIMITS.....WE HAD TO STOP DRIVING FOR LIFE SAFETY.  1. HOW DID BMW GET AWAY WITH NOT INCLUDING THE OTHER YRS WITH SAME ENGINE SAFETY ISSUES(OURS 2008)  AND WHY DID A BMW SERV.ADVISOR REPLACE PARTS FOR OVER $1000.00 KNOWING THAT A BMW SERV.BULLETIN HAD CITED THE MANUFACTURE DEFECTS?   3. PLEASE HELP WITH RECOURSE?   I AM SENDING TITLE COPY FOR OWNERSHIP, I AM AWAITING COPIES OF REPAIRS BY BMW (THEY ARE BEING SLOW / DELAYING)    I AM COLLECTING ALL REPAIR RECEIPTS AT THIS TIME.  AGAIN: THE VEHICLE WAS MOVING AND LOST POWER, STALLED AND EVENTUALLY STARTED WITH LOST POWER.",
        "vin": "WBXPC93408W"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "05/01/2020",
        "dateOfIncident": "05/01/2020",
        "fire": true,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322973,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER TURNING ON THE DRIVER'S SEAT HEATER, IT DEFAULTS TO HIGH, THE LEFT SIDE SEAT BOLSTER STARTED TO SMOKE. A FEW SECONDS LATER BEFORE MY WIFE REALIZED WHAT WAS HAPPENING SHE FELT HER LEFT ARM AND SIDE GETTING A LOT HOTTER THAN THE REST OF HER SEAT. THE SEAT HEATER THEN IMMEDIATELY BURNED A HOLE THROUGH THE LEATHER SEAT WHILE MY WIFE WAS DRIVING DOWN A CITY ROAD.",
        "vin": "WBXPC93478W"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/24/2019",
        "dateOfIncident": "08/16/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11246217,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSFER CASE NEED TO BE REPAIRED VARIOUS TIMES. THE PLASTIC PIECE INSIDE THE CASE KEEP GOING BAD CAUSING ME TO PAY THOUSANDS OF DOLLARS TO REPLACE THE TRANSFER CASE MOTOR AND LABOR COST TO DO SO. WITHOUT A PROPER TRANSFER CASE YOU CAN NOT SWITCH GEARS PROPERLY WHICH ALMOST CAUSED AN ACCIDENT WHEN TRYING TO MERGE ON THE HIGHWAY WITH MY CHILD IN A REAR CAR SEAT.",
        "vin": "WBXPC93438W"
    },
    {
        "components": "STEERING,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/14/2019",
        "dateOfIncident": "04/22/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11220155,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING ON HIGHWAY GOING 80 AND THE CAR JUST SHUT DOWN, WAS UNABLE TO STEER, LEFT ME AND MY 9 YEAR OLD STRANDED FOR ABOUT 30 MINUTES UNTILL IT STARTED BACK UP, EVERYDAY EVERYTIME I DRIVE IT NO MATTER WHAT THE SPEED IT SHUTS DOWN AND HAVE TO PRAY THAT I DON'T GET HIT BY A CAR OR AM ABLE TO GLIDE TO SAFETY, VERY UNSAFE NOT KNOWING WHEN THE CAR WILL SHUT DOWN ON ME, TOOK TO MECHANIC THERE WERE NO CODES NO CHECK ENGINE LIGHT OR ANYTHING, THEREFORE COULDN'T BE FIXED, SOMETHING IS NOT RIGHT WITH CAR, CAR ONLY STARTED DOING THIS FROM APRIL 2019 TO PRESENT,IT DOESN'T MATTER IF I'M ON HIGHWAY, STREET, STOPPED HAS ALWAYS HAPPENED, LIKE I SAID I DON'T KNOW WHEN IT'S GOING TO HAPPEN.IM GOING TO GET KILLED ONE OF THESE DAYS OR SERIOUSLY INJURED",
        "vin": "WBAVC73568K"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/03/2019",
        "dateOfIncident": "11/10/2018",
        "fire": true,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217626,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2008 BMW 335XI WITH 42000 MILES WAS STORED IN MY HEATED SHOP.  THE CAR STARTED ON FIRE AND DESTROYED THE CONTENTS OF MY SHOP AND THE CAR.  BMW SENT AN INSPECTOR TO CHECK THE DAMAGE AND TOOK HUNDREDS OF PICTURES.  CLEARLY THE FIRE STARTED UNDER THE GLOVE COMPARTMENT AREA AND CONTINUED TO BURN UNTIL THE FRONT OF THE CAR, WINDSHIELD AND INTERIOR WAS DESTROYED. CONTENTS IN MY SHOP WERE DESTROYED AND THE INTERIOR OF THE BUILDING HAD TO BE GUTTED TO THE STUDS.  BMW OFFERED NOTHING.  DAMAGES TOTALLED MORE THAN $150,000.  I RECEIVED A RECALL LETTER FROM BMW 3 WEEKS AFTER THE FIRE.  * (RECALL RELATED INCIDENT)",
        "vin": "WBAVD53568A"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/13/2018",
        "dateOfIncident": "03/15/2018",
        "fire": true,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11161077,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A RECALL LETTER TELLING ME TO STAND BY FOR ANOTHER RECALL LETTER TO THEN TELL ME TO HAVE THE CAR FIXED. THE CAR BLOWN UP PARKED OUTSIDE OF MY HOUSE IT HAS NOT BEEN USED FOR 24 HOURS PRIOR TO THE INCIDENT. I HAVE JUST NOW RECENTLY RECIEVED THE SECOND RECALL LETTER MONTHS LATER    NO. 17V-676",
        "vin": "WBAVD53578A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/11/2018",
        "dateOfIncident": "12/07/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11160665,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, THE 4X4 AND BREAK LIGHTS COME ON THE DASHBOARD, AFTER A FEW MILES OF DRIVING THE POWER TRAIN CAN BE FELT TO BE FAILING/SLIPPING, IT IS MORE NOTICEABLE WHEN MAKING A TURN, ACCORDING TO THE BMW DEALERSHIP, THE TRANSFER CASE NEEDS TO BE REPLACED, AFTER SOME RESEARCH, THIS SEEMS TO BE A COMMON FAILURE WITH BMW CARS.",
        "vin": "WBXPC93478W"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/30/2018",
        "dateOfIncident": "10/01/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11154884,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2008 335I TWIN TURBO BMW 3 SERIES, WHILE DRIVING I STARTED SMELLING A FRESH GAS SMELL IN THE BACK OF MY CAR INSIDE AND OUTSIDE, REALLY STRONG SMELL SO MUCH I HAVE TO KEEP MY WINDOWS DOWN AND IT GIVES ME A HEADACHE AND I FEEL LIKE MY CAR IS GOING TO CATCH ON FIRE WITH ANY GIVEN SPARK AND IT COULD, THE CERTIFIED MECHANIC SAID MY FUEL PUMP ASSEMBLY IS FAULTY SO I WENT ONLINE AND THERE IS A RECALL ON THE 2008 335I TWIN TURBO BUT FOR SOME REASON WHEN I CALLED BMW THEY SAID MY CAR IS NOT ON THE RECALL LIST SO THEY WONT FIX IT! MY CAR HAS THE PROBLEM, MY CAR HAS APX 80,000 , EIGHTY THOUSAND MILES ONI IT.  WHY IS MY CAR NOT COVERED WHEN IT HAS THE PROBLEM OF ALL THE OTHER CARS? THIS IS A VERY DANGEROUS SITUATION I HAVE.  PLEASE HELP. THANK YOU FOR YOUR TIME",
        "vin": "WBAVB77548N"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/28/2018",
        "dateOfIncident": "11/15/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11154408,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL CAMPAIGN NUMBER 17V-605. I NEED THIS PART INSTALLED NOW.",
        "vin": "WBXPC93488W"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/09/2018",
        "dateOfIncident": "10/05/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11139363,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WIRES ON THE INSIDE OF MY HEADLIGHTS ARE CRACKED, AND HAVE A LOT OF BARE COPPER SHOWING. THE PLASTIC SHEATHING (CABLE JACKET) HAS BECOME BRITTLE FROM THE HEAT, AND IS FALLING APART, EXPOSING THE CONDUCTOR. THIS IS CREATING THE RISK OF AN ELECTRICAL FIRE OR DAMAGE TO THE ELECTRICAL SYSTEM.   THE RIGHT HEADLIGHT AND THE ANGEL LIGHTS OF MY CAR IS NOT WORKING IT WHEN OFF WHILE THE CAR WAS IN MOTION - ALL IT TAKES IS TO TOUCH A CABLE WITH YOUR FINGERS AND THE COOPER WILL BE EXPOSE.  I'M REQUESTING IMMEDIATE RECALL FROM BMW - SEVERAL CARS ARE HAVING THE SAME ELECTRICAL AND FIRE HAZARD ISSUES.   PLEASE FIX THIS PROBLEM BEFORE SOMEBODY GET'S HURT.",
        "vin": "WBAVB73568P"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/03/2018",
        "dateOfIncident": "12/01/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11133166,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BMW X3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V683000 (ENGINE AND ENGINE COOLING); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. BMW OF MONROVIA (1425 MOUNTAIN AVE, MONROVIA, CA 91016, (855) 627-5361) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WBXPC93458W"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/30/2018",
        "dateOfIncident": "10/25/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11132372,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "A RECALL WAS ISSUE FOR BLOWER MOTOR WIRING.  IT HAS ALMOST BEEN A YEAR AND EVERY TIME I INQUIRE WITH THE DEALER THEY SAY THEY DON'T HAVE THE REMEDY AVAILABLE. SHOULD I BE CONCERNED ABOUT THE VEHICLE CATCHING FLAMES WHILE IN MY GARAGE?",
        "vin": "WBAVB73508V"
    },
    {
        "components": "AIR BAGS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/04/2018",
        "dateOfIncident": "09/01/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11124220,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BMW X3. THE CONTACT STATED THAT THE RECALL NOTICES FOR NHTSA CAMPAIGN NUMBERS: 17V605000 (AIR BAGS) AND 17V83000 (ENGINE) WERE RECEIVED IN SEPTEMBER AND OCTOBER OF 2017. AFTER CONTACTING BMW OF BIRMINGHAM (11000 TOM WILLIAMS WAY, IRONDALE AL), THE CONTACT WAS INFORMED THAT THE PARTS NEEDED TO REPAIR THE DEFECTS WERE NOT AVAILABLE. THE MANUFACTURER WAS NOT NOTIFIED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WBXPC93438W"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/28/2018",
        "dateOfIncident": "08/28/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11122901,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MANUFACTURER HAS NOT REMEDY THE SAFETY RECALLS IN A TIMELY MANNER AS IT'S BEEN ALMOST A YEAR SINCE THE RECALLS AND THERE ARE STILL NO PARTS/FIXES AVAILABLE. THERE ARE 2 RECALLS FROM OCT 2017 AND AS OF TODAY AUG 2018 THERE ARE NO PARTS AVAILABLE TO FIX THE ISSUES: POSITIVE CRANKCASE VENTILATION (PCV) VALVE HEATER AND BLOWER MOTOR WIRING. SAFETY RISKS: OVER TIME, IT COULD DETERIORATE AND, IN RARE CASES, COULD LEAD TO OVERHEATING. AND CONNECTION BETWEEN THE WIRING AND THIS SYSTEM COULD DETERIORATE AND, IN RARE CASES, COULD LEAD TO OVERHEATING.",
        "vin": "WBAVA33568K"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/11/2018",
        "dateOfIncident": "08/11/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11119312,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "UNREASONABLE TIME TO REMEDY",
        "vin": "WBAVC73568K"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/13/2018",
        "dateOfIncident": "05/11/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11111225,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BMW X3. THE CONTACT RECENTLY PURCHASED THE VEHICLE AND NOTICED THAT THERE WAS AN OIL LEAK.  THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO LAUDERDALE BMW OF PEMBROKE PINES (14800 SHERIDAN ST, PEMBROKE PINES, FL 33028, 954-620-5050) WHERE THE CONTACT WAS INFORMED OF NHTSA CAMPAIGN NUMBER: 17V683000 (ENGINE AND ENGINE COOLING) AND THAT THE CV JOINT NEEDED REPLACEMENT. THE CONTACT STATED THAT THE RECALL WAS REMEDIED, BUT THE CV JOINT WAS NOT REPLACED. THE VEHICLE WAS TAKEN BACK TO THE DEALER FROM WHERE IT WAS PURCHASED AND WAS INFORMED THAT THE CV JOINT WAS NOT COVERED UNDER A WARRANTY. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURES. THE FAILURE MILEAGE WAS APPROXIMATELY 92,000. *TT",
        "vin": "WBXPC93428W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/11/2018",
        "dateOfIncident": "07/10/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11110747,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BMW X3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V605000 (AIR BAGS); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR AS THE RECALL NOTICE WAS RECEIVED OVER A YEAR AGO. THE DEALER (NIELLO BMW, 2020 FULTON AVE, SACRAMENTO, CA 95825, (916) 486-1011) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS CONTACTED SEVERAL TIMES AND WAS UNABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WBXPC93458W"
    },
    {
        "components": "AIR BAGS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/02/2018",
        "dateOfIncident": "06/20/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11105129,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "RECEIVED 2 RECALL NOTICES FROM BMW USA 11/17 AND 12/17 FOR ISSUES WITH THE FRONT PASSENGER SEAT OCCUPANT DETECTION MAT AND THE ENGINE PCV VALVE HEATER.  CONTACTED MY LOCAL DEALERSHIP TO HAVE THEM FIXED.  WAS ADVISED THAT THEY DID NOT HAVE AUTHORIZATION FROM THE NATIONAL OFFICE TO PERFORM THE REPAIRS.  WHEN QUESTIONED ABOUT HAVING THE PARTS THE SERVICE REPRESENTATIVE ADMITTED THAT THEY COULD GET THE PARTS BUT WOULD NOT BE REIMBURSED FOR THE REPAIR BECAUSE THE NATIONAL OFFICE HAD NOT AUTHORIZED THEIR USE. REPEATEDLY CHECK WITH THEM OVER THE NEXT SEVERAL MONTHS.  RECEIVED THE SAME ANSWER AGAIN AND AGAIN.  CONTACTED BMW USA DIRECTLY THROUGH THEIR CUSTOMER SERVICE AND SPOKE WITH THEIR REPRESENTATIVE WHO STATED THAT THEY DID NOT HAVE THE PARTS TO REPAIR THE KNOWN SAFETY ISSUES AND WERE HOPING TO HAVE THEM FIXED LATER THIS YEAR.  WHEN I INFORMED THEM THAT THE LOCAL DEALERSHIP SAID THEY COULD GET THE PARTS THEY FINALLY ADMITTED THAT YES THEY HAD THEM BUT NOT ENOUGH TO COVER ALL THE RECALLED VEHICLES SO THEY WERE NOT AUTHORIZING REPAIRS YET.",
        "vin": "WBXPC93468W"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/29/2018",
        "dateOfIncident": "05/30/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11104658,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ABOUT A MONTH AGO, MY 2008 BMW 3 SERIES ENGINE STALLED WHILE DRIVING AT SPEED 45 MPH. I RECEIVED NO WARNING BEFORE THE ENGINE STALLED. IT WAS A MIRACLE THAT I WAS ABLE TO MOVE OVER A LANE AND GET OFF THE ROAD BEFORE AN IMPACT FROM OTHER VEHICLES. THIS OCCURS EVERY TIME I DRIVE THE VEHICLE, MULTIPLE TIMES AND AT VARIOUS SPEEDS. IT'S VERY DANGEROUS BECAUSE I RECEIVE NO WARNING BEFORE IT HAPPENS. THE VEHICLE IS ALWAYS IN MOTION WHEN IT HAPPENS AND AT VARIOUS SPEEDS, ON HIGHWAYS, STREETS, ANYWHERE WHILE DRIVING STRAIGHT, TURNING AND ANY OTHER MANEUVERS.",
        "vin": "WBAVA375X8N"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/15/2018",
        "dateOfIncident": "11/01/2007",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11093924,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "BLOWER MOTOR WIRING AND PCV RECALL ISSUED NOV. 2017   REMEDY UNAVAILABLE",
        "vin": "WBAVC53508F"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/29/2018",
        "dateOfIncident": "04/27/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11090858,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE ARE (3) CURRENT RECALLS FOR THIS MODEL, 2008 BMW 328I. ONLY (1) RECALL HAS A 'REMEDY' AVAILABLE.  ACCORDING TO MY LOCAL BMW DEALERSHIP, THE 'REMEDIES' FOR THE OTHER (2) RECALLS, BOTH OF WHICH COULD POTENTIALLY CAUSE A FIRE EVEN IN A NON-RUNNING PARKED SITUATION, ARE 'NOT YET AVAILABLE'. THESE RECALLS ARE: NHTSA #17V76 AND  NHTSA #17V683.  BMW USA HAS 'RECOMMENDED' THAT THE AFFECTED VEHICLES ALWAYS BE 'PARKED OUTSIDE'. I DO NOT CONSIDER THIS AN ACCEPTABLE SOLUTION TO THESE <POSSIBLY> DANGEROUS AND SERIOUS RECALL ISSUES, AS I LIVE IN A 'MARGINAL' NEIGHBORHOOD PRONE TO AUTO THEFT AND WEATHER DAMAGE.  MY QUESTION IS, WHEN/HOW SOON WILL NHTSA (FEDERAL GOVERNMENT) FORCE THIS AUTO MFR (BMW) TO QUICKLY AND ADEQUATELY ADDRESS AND PROVIDE PERMANENT MECHANICAL SOLUTIONS FOR THESE (2) RECALLS. IN FACT, JUST RECENTLY (4/28/18) A HOUSE WAS DESTROYED BY A FIRE <LIKELY CAUSED> BY ONE OF THESE BMW MODEL RECALLS, PARKED IN THE GARAGE AND NOT RUNNING.  BMW SAID THEY WOULD CONTACT OWNERS OF ALL AFFECTED VEHICLES WHEN A SOLUTION HAS BEEN FOUND, BUT 'HAVE NO IDEA WHEN THAT WILL BE'.  NOT ACCEPTABLE.  THESE ARE A SERIOUS SAFETY ISSUES THAT AFFECTS ONE MILLION+ VEHICLES AND THE HEALTH AND SAFETY OF MILLIONS OF AMERICAN FAMILIES.  PLEASE ADVISE WHAT YOU INTEND TO DO TO PROTECT THESE CAR OWNERS?",
        "vin": "WBAVC53528F"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/24/2018",
        "dateOfIncident": "12/15/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11089786,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL.   I HAVE NOT BEEN ABLE TO HAVE THE DEFECTIVE AIRBAGS REMOVED. I CALL MY LOCAL DEALER AND ALL THEY SAY IS THAT THE AIRBAGS ARE BACKORDER. WHEN THEY RECEIVE THEM THEY WILL CALL ME. I HAVE WAITED OVER ONE YEAR AND NO ANSWER.",
        "vin": "WBAWL13538P"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/24/2018",
        "dateOfIncident": "09/11/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11089882,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BMW X3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 17V605000 (AIR BAGS) AND 17V683000 (ENGINE AND ENGINE COOLING); HOWEVER, THE PARTS TO DO THE REPAIRS WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIRS. BMW OF FORT WAYNE (929 AVE OF AUTOS, FORT WAYNE, IN) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDIES. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WBXPC93488W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/20/2018",
        "dateOfIncident": "04/04/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11089086,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3 SAV",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER SEAT OCCUPANCY SENSOR IS DEFECTIVE.  THIS IS PART OF THE \"SEAT MAT\", WHICH IS UNDER RECALL.  BMW SENT AN INITIAL NOTICE OF RECALL IN SEPTEMBER OF 2017.  AS OF APRIL 20, 2018 THE PARTS ARE STILL NOT AVAILABLE TO PERFORM THIS RECALL.  OVER 7 MONTHS!  NO ONE AT THE DEALER OR BMW USA CAN GIVE US A STRAIGHT ANSWER AS TO WHEN THE PARTS WILL BECOME AVAILABLE.  THE Q AND A PART OF THE NOTICE INDICATES NO ONE SHOULD SIT IN THE PASSENGER SEAT UNTIL THIS IS FIXED!  WHY IS BMW BEING ALLOWED TO CONTINUE TO DELAY FIXING THIS SAFETY DEFECT?  I WOULD LIKE TO KNOW WHAT THE NHTSA IS DOING TO MAKE BMW REPAIR THIS IN A TIMELY MANNER!",
        "vin": "WBXPC934X8W"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/12/2018",
        "dateOfIncident": "06/20/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11084794,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3 SAV",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BROUGHT MY VEHICLE TO BLOOMFIELD NJ DEALERSHIP ON SEVERAL OCCASIONS IN 2013, 2014, 2015 DUE TO VEHICLES INABILITY TO SHIFT GEARS SWIFTLY, RMP GOING TO 34,000 AND TRANSMISSION NOT SHIFTING GEARS.  I DRIVE ABOUT 6,000MILES PER YEAR SOMETIMES LESS.  ALL DEALER WOULD SAY \"VEHICLE PERFORMS AS DESIGNED\"....OR \"UNABLE TO DUPLICATE THE PROBLEM\".  AROUND JUNE 20, 2016 WHEN IN THE DRIVEWAY I PUT GEAR IN REVERSE BUT VEHICLE WOULD NOT MOVE. I CALLED BMW DEALER DESCRIBING THE INABILITY OF MY CAR MOVING IN REVERSE DEALER REPRESENTATIVE STATED ITS TRANSMISSION FAILURE.  THE VEHICLE WAS TOWED TO  TRA-PAR TRANSMISSIONS IN BELLEVILLE NJ ON JUNE 23, 2016 CONFIRMED TRANSMISSION FAILURE AND  REPLACED IT JUNE 27, 2016 FOR  $ 3, 092.19 !!!    COME TO FIND OUT THROUGH READING COPIES OF RECEIPTS DEALER HAD NOT DESCRIBED ISSUES AS THERE WERE ON THEIR WORK ORDERS!  AFTER I READ MOST OF THEM, THEY DON'T EVEN MENTION THE TRUE REASON WHY THE VEHICLE WAS BROUGHT IN !  I'M VERY DISGUSTED WITH THEM AND I FIND BMW DEALER STALLING TACTICS AND DECEPTION CRIMINAL.",
        "vin": "WBXPC93488W"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/12/2018",
        "dateOfIncident": "04/06/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11084806,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3 SAV",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "LAST WEEK DASH 4X4 LIGHT COMES ON A,UDIBLE RAPID CLICKING SOUND COMES FROM REAR  JUST AFTER CAR IS TURNED OFF...I BROUGHT THE VEHICLE TO WEST PATERSON MOTORS  IN WOODLAND PARK, NJ  FOR DIAGNOSTICS. MECHANIC STATES COMPUTER CODES INDICATE IT'S TRANSFER CASE FAILURE, AND TO REPLACE IT COSTS OVER $ 2,600.00 !  HOW DOES THE VEHICLE SUCH AS BMW GETS AWAY WITH SUCH POOR QUALITY,  PARTS THAT FAIL SO SOON, SO EXPENSIVE? HOW IS THIS POSSIBLE?   PLEASE RECALL TRANSFER CASE PLEASE, THIS VEHICLE DOES NOT EVEN HAVE 85,000 MILES ON ODOMETER YET ...",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/10/2018",
        "dateOfIncident": "10/30/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11084277,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3 SAV",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL NOTIFICATION WAS RECEIVED IN NOV 2017.  DEALER HAS YET TO REPAIR.  IS THIS LENGTH OF DELAY ACCEPTABLE?",
        "vin": "WBXPC93418W"
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/08/2018",
        "dateOfIncident": "04/08/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11083842,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "HELLO THERES TWO RECALL FOR BMW 3 SERIES THAT NEED TO DONE ASAP BUT WHEN I CHECK THE PARTS ARE NOT YET AVAILABLE AND IT'S A SAFETY ISSUE THAT NEED TO FIX IMMEDIATELY",
        "vin": "WBAWC33588P"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/03/2018",
        "dateOfIncident": "04/02/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11083091,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE THE CAR WAS TRAVELLING AT A RATE OF ABOUT 45 MPH, IT DID SOMETHING I NEVER EXPERIENCED BEFORE.  IT STARTED TO SHAKE, SPUTTER AND LOSE POWER WHILE ASCENDING A ON A PAVED CITY STREET THAT HAD ABOUT A 20 DEGREE UPHILL GRADE.  THE VEHICLE BEHIND ME DIDN'T EXPECT MY SUDDEN SPEED CHANGE AND NEARLY REAR ENDED ME..  THE  ENGINE ICON APPEARED ON THE DASH AND I SPUTTERED ALL THE WAY HOME.",
        "vin": "WBAVD53518A"
    },
    {
        "components": "SEATS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/29/2018",
        "dateOfIncident": "11/17/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11082069,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3 SAV",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE 2 DANGEROUS RECALLS. ONE-NO ONE CAN SIT IN THE PASSENGER SEAT BECAUSE THE AIR BAGS MAY NOT DEPLOY AND THE SECOND, MY ENGINE CAN BE ON FIRE DUE TO A PVC VALVE. BMW HAS NO REMEDIES AND IT HAS BEEN OVER 4 MONTHS, THIS IS UNACCEPTABLE.  SOMEONE HAS TO PUT THE PRESSURE ON BMW TO GET THIS FIXED IMMEDIATELY. THANK YOU [XXX]     INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "WBXPC93458W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/26/2018",
        "dateOfIncident": "09/03/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11081276,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BMW X3. THE CONTACT STATED THAT NHTSA CAMPAIGN NUMBER: 17V605000 (AIR BAGS) EXCEEDED A REASONABLE AMOUNT OF TIME FOR REPAIR. THE CONTACT RECEIVED THE RECALL NOTIFICATION IN SEPTEMBER OF 2017. THE DEALER LEITH BMW (5603 CAPITAL BLVD, RALEIGH, NC 27616) STATED THAT THE PARTS WERE NOT AVAILABLE FOR THE REPAIR. THE MANUFACTURER WAS NOT CONTACTED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOLS CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WBXPC93458W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/22/2018",
        "dateOfIncident": "09/01/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11074319,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 BMW X3. THE CONTACT STATED THAT NHTSA CAMPAIGN NUMBER: 17V605000 (AIR BAGS) EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE REPAIR. THE CONTACT RECEIVED THE RECALL NOTIFICATION IN AUGUST OF 2017. THE DEALER (BMW OF DEVON, 20 LANCASTER AVE, DEVON, PA 19333) COULD NOT PROVIDE A DATE FOR WHEN THE REMEDY WOULD BE AVAILABLE. THE MANUFACTURER WAS NOT NOTIFIED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WBXPC93498W"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/16/2018",
        "dateOfIncident": "11/01/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11073250,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BMW X3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBERS: 17V605000 (AIR BAGS) AND 17V683000 (ENGINE AND ENGINE COOLING). THE PART TO DO THE RECALL REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. A LOCAL DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE FOR BOTH NHTSA CAMPAIGN NUMBERS: 17V605000 (AIR BAGS) AND 17V683000 (ENGINE AND ENGINE COOLING). *TT  *TR",
        "vin": "WBXPC93488W"
    },
    {
        "components": "AIR BAGS,SEATS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/15/2018",
        "dateOfIncident": "09/16/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11073125,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SEAT OCCUPATION DETECTION MAT AND POSITIVE CRANKCASE VENTILATION (PCV) VALVE HEATER.  BOTH RECALLS BUT NO REMEDY SINCE SEPTEMBER 2017. DANGEROUS CONDITIONS THAT NEED TO BE RESOLVED IMMEDIATELY",
        "vin": "WBXPC93458W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/15/2018",
        "dateOfIncident": "02/15/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11073157,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2008 BMW X3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V605000 (AIR BAGS); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER AND MANUFACTURER WERE NOT CONTACTED TO CONFIRM PART AVAILABILITY AS THE RECALL NOTICE STATED THAT OWNERS WOULD RECEIVE A SECOND NOTICE WHEN PARTS BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WBXPC93488W"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/26/2018",
        "dateOfIncident": "10/25/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11065287,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS FOR 2 NHTSA RECALLS ISSUED 10/25/17 AND 10/30/17  NHTSA RECALL NUMBER17V676 AND NHTSA RECALL NUMBER17V683.    IT IS NOW  3 MONTHS LATER AND BMW OF NORTH AMERICA STILL HAS NO REMEDY AVAILABLE! BOTH RECALL STATEMENTS CAUTION THAT \"OVER TIME\" THE PART COULD DETERIORATE, LEADING TO THE CAR CATCHING ON FIRE. SINCE THE CAR IS 10 YEARS OLD, I AM CONCERNED THAT THE BMW DEFINITION OF \"OVER TIME\" HAS BEEN MET, AND THEREFORE WE ARE LEFT WITH A NON-DRIVEABLE CAR DUE TO THEIR WARNINGS. HOW LONG SHOULD ONE WAIT WITH NO COMPENSATION, EITHER MOBILITY OR FINANCIAL?",
        "vin": "WBAVC53548F"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/16/2018",
        "dateOfIncident": "08/16/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11063105,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BMW X3. THE CONTACT STATED THAT THE AIR BAG WARNING LIGHT ILLUMINATED. THE CONTACT STATED THAT THE VEHICLE WAS BROUGHT TO BMW GALLERY OF NORWOOD LOCATED AT 918 BOSTON PROVIDENCE HWY, NORWOOD, MA TO GET NHTSA CAMPAIGN NUMBER: 16V071000 (AIR BAGS) COMPLETED. UPON CHECKING THE PAPERWORK AFTER LEAVING THE DEALER, THEY WERE INFORMED THAT THE RECALL HAD NOT BEEN REMEDIED. THE DEALER WAS CONTACTED AND THEY INFORMED THE CONTACT THAT THE CAMPAIGN WAS UNABLE TO BE DONE DUE TO THEM NOT HAVING A RESOLUTION. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT'S VIN NO LONGER SHOWED UNDER THE RECALL DUE TO BMW'S SYSTEM. THE FAILURE MILEAGE WAS APPROXIMATELY 119,000.",
        "vin": "WBXPC93478W"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "01/08/2018",
        "dateOfIncident": "01/07/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11061095,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BMW X3. WHILE DRIVING, THE DRIVER'S SEAT HEATING ELEMENT BURNED THROUGH THE SEAT TO THE CONTACT'S CLOTHES. THE CONTACT SUSTAINED A BURN ON THE RIGHT SIDE OF HIS BEHIND, WHICH REQUIRED MEDICAL ATTENTION. THE DEALER WAS NOT CONTACTED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 203,000. THE VIN WAS NOT PROVIDED.",
        "vin": ""
    },
    {
        "components": "AIR BAGS,SEATS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/12/2017",
        "dateOfIncident": "05/04/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11054369,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "-TAKATA  RECALL    -FRONT PASSENGER SEAT OCCUPANT DETECTION MAT  RECALL  -POSITIVE CRANKCASE VENTILATION (PCV) VALVE HEATER",
        "vin": "WBXPC93428W"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/07/2017",
        "dateOfIncident": "12/06/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11052943,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "RECENTLY I GOT A LETTER FROM BMW THAT MY VEHICLE WAS RECALLED FOR TWO ISSUES WHICH I HAVE BEEN EXPERIENCING SINCE A YEAR. 1 OVERHEATING 2. PLASTIC BURNING SMELL INSIDE THE COMPARTMENT. I BROUGHT THIS TO THEIR BMW'S NOTICE MANY TIMES WHICH THEY IGNORED.  AND RECENTLY WHEN I GOT THIS RECALL LETTER FROM BMW I GAVE THEM A CALL(PRINCETON BMW), THEY GAVE ME AN APPOINTMENT SAYING THEY WILL FIX THAT. I TOLD THEM CRYSTAL CLEARLY THAT I WAS THERE FOR THE TWO RECALL ISSUES ONLY AND NOTHING ELSE. AND TO MY SHOCK ,LET ALONE REPAIRING THE MANDATORY RECALL ISSUES, THEY GAVE A BIG LIST OF OTHER THINGS, WHICH I DID NOT EVEN ASK FOR, AND THEY CHARGED ME AROUND 170 DOLLARS(ATTACHED COPIES).  I AM BRINGING THIS TO YOUR NOTICE FOR SOLELY ONE REASON, AND THAT IS THERE ARE MILLIONS OF UNSUSPECTING PEOPLE  WHO ARE UNAWARE OF THIS MALPRACTICE WHO WILL BE FALLING INTO THIS KIND OF TRAP. BMW IS TRYING TO MAKE MONEY OUT OF THIS SITUATION TOO. I AM ATTACHING ALL THE COPIES. PLEASE LOOK INTO THIS MATTER  AND PLEASE MAKE THEM REALIZE THERE IS AN AUTHORITY WATCHING. I FELT LIKE SOMEBODY STOLE MONEY FROM ME. HOPE TO GET A RESPONSE FROM THE DEPARTMENT. THANK YOU VERY MUCH.",
        "vin": "WBAVC73588K"
    },
    {
        "components": "AIR BAGS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/04/2017",
        "dateOfIncident": "05/29/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11052231,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 BMW X3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V071000 (AIR BAGS) AND WAS UNABLE TO RECEIVE THE REMEDY AND PART WITHIN A REASONABLE TIME FRAME. IN ADDITION, THE CONTACT WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 17V683000 (ENGINE AND ENGINE COOLING); HOWEVER, THE RECALL NOTICES STATED THAT THE REMEDY AND PARTS WERE UNAVAILABLE. THE CONTACT WAS UNCERTAIN AS TO WHEN THE VEHICLE WOULD BE REPAIRED FOR MONTHS. A DEALER WAS CONTACTED (BMW OF FREEHOLD, 4225 U.S. 9, FREEHOLD, NJ 07728, (732) 410-6096), BUT THE CONTACT RELOCATED. THE MANUFACTURER WAS NOTIFIED OF THE CONCERNS PERTAINING TO THE RECALL REPAIRS. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WBXPC93477W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/10/2017",
        "dateOfIncident": "11/09/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11045060,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  1. BMW SENT ME RECALL NOTICE IN MARCH 2016, WITH NO FOLLOW UP REPAIR IMPLEMENTATION AS OF NOV. 2017 = 1.5YRS SINCE THE INITIAL RECALL NOTICE = UNREASONABLY LONG?  2. WHEN I GO TO SAFERCAR.GOV / AIRBAG RECALL.COM & CHECK MY VIN, MY CAR DOES NOT SHOW UP W/ AIRBAG INFLATOR RECALL (IT SHOWS UP FOR BLOWER MOTOR WIRING RECALL, BUT THAT'S IT). MAYBE I'M MISSING SOMETHING?",
        "vin": "WBAWB735X8P"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/06/2017",
        "dateOfIncident": "06/30/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11043612,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3 SAV",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL - I CALLED EAST BAY BMW AND BMW OF CONCORD DEALERSHIPS SINCE RECEIVING SAFETY RECALL IN JUNE 2017 TO MAKE AN APPOINTMENT FOR THE AIRBAG RECALL SERVICE AND I HAVEN'T RECEIVED A CALL BACK REGARDING THE PARTS ARRIVING TO THE DEALERSHIP. IT IS NOT NOVEMBER AND I STILL HAVEN'T RECEIVED A SINGLE PHONE CALL.",
        "vin": "WBXPC93458W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/02/2017",
        "dateOfIncident": "07/01/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11042537,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  NEEDS TO BE REPLACED.  NO DEALERS IN AREA",
        "vin": "WBXPC93448W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/03/2017",
        "dateOfIncident": "07/01/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11031492,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BMW X3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V071000 (AIR BAGS). THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT CALLED PETER PAN BMW AT 650-349-9077 AND INFORMED THE CONTACT THAT THE PART WAS NOT AVAILABLE. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "WBXPC93448W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/03/2017",
        "dateOfIncident": "02/03/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11031566,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 BMW X3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V071000 (AIR BAGS); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. PRINCETON BMW (3630 QUAKERBRIDGE RD, HAMILTON TOWNSHIP, NJ) WAS CONTACTED AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "WBXPC93498W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/27/2017",
        "dateOfIncident": "09/27/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11030229,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAHATA RECALL  FOR 3 TIMES I HAVE GONE TO THE OFFICIAL SERVICE BMW AND NEVER HAVE THE PART THAT MUST REPLACE BY DEFAULT, SINCE 1 YEAR",
        "vin": "WBXPC93408W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/26/2017",
        "dateOfIncident": "01/10/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11029896,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SUMMARYDRIVER'S FRONT AIR BAG: DURING AIR BAG DEPLOYMENT CAUSE THE INFLATOR TO RUPTURE. IN AN ACCIDENT, THE DRIVER'S FRONT AIR BAG MODULE MAY PRODUCE EXCESSIVE INTERNAL PRESSURE THAT COULD",
        "vin": "WBXPC93478W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/10/2017",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11014180,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BMW X3. THE CONTACT STATED THAT NHTSA CAMPAIGN NUMBER: 16V071000 (AIR BAGS) EXCEEDED A REASONABLE AMOUNT OF TIME FOR REPAIR. THE CONTACT RECEIVED THE RECALL NOTIFICATION IN MARCH OF 2016. THE DEALER (BMW OF EL PASO, 6318 MONTANA AVE, EL PASO, TX, 79925) STATED THAT THE PARTS WERE UNAVAILABLE FOR THE REPAIR AND WAS UNCERTAIN WHEN PARTS WOULD BE MADE AVAILABLE. THE DEALER STATED THAT THEY WOULD CALL THE CONTACT WHEN THE PARTS ARRIVE. THE MANUFACTURER WAS NOT CONTACTED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "WBXPC93448W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/08/2017",
        "dateOfIncident": "05/02/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11013703,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "\"TAKATA RECALL\" FOR AIR BAGS AND DUE TO THE LARGE VOLUME OF NEW IN-FLATORS NEEDED TO REPAIR VEHICLES, THE BMW DEALERSHIP IS NOT GIVING AN ETA OR PROVIDE HELP.",
        "vin": "WBXPC93458W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/27/2017",
        "dateOfIncident": "06/20/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11010939,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 BMW X3. THE CONTACT STATED THAT NHTSA CAMPAIGN NUMBER: 16V071000 (AIR BAGS) EXCEEDED A REASONABLE AMOUNT OF TIME FOR REPAIR. THE CONTACT RECEIVED THE INITIAL NOTIFICATION IN THE SPRING OF 2016 AND THE FINAL REMEDY NOTIFICATION LETTER IN JUNE OF 2017. THE DEALER (WAGNER BMW OF SHREWSBURY 770 BOSTON TURNPIKE, SHREWSBURY, MA, 01545) STATED THAT THE PARTS WERE UNAVAILABLE, AND THEY WERE ONLY SERVICING 2007 MODELS CURRENTLY. THE CONTACT WOULD BE INFORMED WHEN IT WAS TIME TO BRING IN THE VEHICLE. THE MANUFACTURER WAS NOT CONTACTED AND MADE AWARE OF THE FAILURE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "WBXPC93428W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/25/2017",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11010546,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BMW X3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER:  16V071000 (AIR BAGS) HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. PASSPORT BMW OF SUITLAND, MARYLAND WAS MADE AWARE OF THE RECALL AND STATED THAT THE PARTS WERE UNAVAILABLE. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PART DISTRIBUTION DISCONNECT.",
        "vin": "WBXPC93448W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/06/2017",
        "dateOfIncident": "07/06/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003315,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 BMW X3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V071000 (AIR BAGS) FOR THE DRIVER FRONTAL AIR BAG INFLATOR; HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT CALLED THE LOCAL DEALER (BMW SEATTLE, LOCATED AT 1002 AIRPORT WAY S, SEATTLE, WA, 98134) AND WAS INFORMED THAT PARTS WERE NOT AVAILABLE. THE DEALER STATED THAT IF THE CONTACT FAXED OVER THE FINAL REMEDY LETTER HE RECEIVED, THEY WOULD ADD HIM TO THE LIST FOR WHEN PARTS ARRIVED TO SCHEDULE AN APPOINTMENT. THE CONTACT DID NOT HAVE ACCESS TO A FAX MACHINE; HOWEVER, THE MANUFACTURER WAS NOTIFIED OF THE ISSUE AND INFORMED THE CONTACT THAT THEY WOULD EMAIL THE DEALER ON HIS BEHALF. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "WBXPC93498W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/05/2017",
        "dateOfIncident": "02/05/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003177,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 BMW X3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V071000 (AIR BAGS). THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER WAS CONTACTED (AUTOPLEX BMW IN AMARILLO, TEXAS) AND CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "WBXPC93488W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/03/2017",
        "dateOfIncident": "06/15/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11002847,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BMW X3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V071000 (AIR BAGS); HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT YET AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. BMW OF SOUTH ATLANTA (LOCATED AT 4171 JONESBORO ROAD, UNION CITY, GA 30291, TEL: (770) 969-0755) WAS CONTACTED FOR PART AVAILABILITY. THE CONTACT WAS INFORMED THAT THERE WAS NO PART TO REMEDY THE RECALL. THE MANUFACTURER WAS ALSO CONTACTED, BUT THERE WAS NO RESPONSE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "WBXPC93448W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/03/2017",
        "dateOfIncident": "02/05/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11002887,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 BMW X3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V071000 (AIR BAGS); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE CONTACT CALLED BEVERLY HILLS BMW (5070 WISHIRE BLVD, LOS ANGELES, CA 90036, (877) 794-4678) WHERE IT WAS CONFIRMED THAT THE PARTS WERE NOT AVAILABLE FOR THE RECALL REMEDY. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE AND WAS NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "WBXPC93458W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/27/2017",
        "dateOfIncident": "02/05/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11001639,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. BMW HAS FAILED TO PROVIDE ANY INFORMATION REGARDING THE RECALL. IT HAS NOW BEEN A YEAR AND A HALF SINCE THE RECALL WAS ANNOUNCED AND EVERY TIME I CALL BMW TO ASK FOR DETAILS THEY SAY THERE IS NOTHING THEY CAN DO. IF BMW CANT PROVIDE REPLACEMENT AIRBAGS FAST ENOUGH TO FIX THEIR CARS THAT ARE DEFECTIVE, THEN THEY NEED TO PROVIDE LOANER CARS OR A BUY-BACK PROGRAM. HAVING TO WAIT 18 MONTHS WITHOUT EVEN GETTING AN UPDATE AS TO WHEN MY CAR WILL EVEN BE FIXED IS RIDICULOUS.",
        "vin": "WBXPC93488W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/26/2017",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11001493,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 BMW X3. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V071000 (AIR BAGS) HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND WERE NOT ABLE TO CONFIRM WHEN THE PARTS WERE TO BECOME AVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT. UPDATED 08/29/17*LJ    *CN",
        "vin": "WBXPC93448W"
    },
    {
        "components": "AIR BAGS,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/12/2017",
        "dateOfIncident": "03/08/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10994565,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM A 2008, BMW X3 DRIVER. I HAD MY AIR BAG FIXED (I THINK) YET, THE AIR BAG LIGHT IS STILL ON. ALSO, THE BRAKE LIGHT AND ENGINE LIGHT. I DO NOT KNOW WHAT IS GOING ON. THIS DRAMA IS OVER A YEAR OLD. I HAVE SUPPORTIVE DOCUMENTS, VOICEMAILS AND EMAILS TO SUPPORT MY EFFORTS.",
        "vin": "WBXPC93408W"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "06/04/2017",
        "dateOfIncident": "05/22/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10993087,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3 SAV",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE PURCHASE IN 2013 FROM A DEALER, WITH ONLY 43000 MILE CHANGED BATTERY TWICE AT BMW PETER PAN, REPLACED POWER STEERING PUMP, WINDOW REGULATOR, REPLACED STARTER , PLUS OTHER SERVICES AND WINDOW WIPERS ARE FAULTY, T-CASE ACTUATOR REPLACED, SWAY BAR REPLACED, TOTALING $9531.38. I TRIED TO COMPLAIN TO BMW CORPORATION FOR SELLING A LEMON CAR . PLEASE LET ME KNOW WHO I CAN COMPLAIN ABOUT THIS CAR. RIGHT NOW IT ONLY HAS 57K MILES ON IT AND I AM BEING TOLD IT NEEDS MORE WORK.",
        "vin": "934X8WJ0787"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/02/2017",
        "dateOfIncident": "05/03/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10992876,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SHEARED ENGINE MOUNT BOLTS ON VEHICLE WITH NO ACCIDENTS, NO OFF ROAD USE AND ONLY 60K MILES.  BMW DID HAVE A SERVICE NOTICE ON THIS, BUT WE ARE TOLD IT HAS EXPIRED. IT APPEARS TO BE MANUFACTURING DEFECT, IN WHICH CASE BMW SHOULD FIX, BUT THEY SAY TOO LATE.",
        "vin": "WBXPC93438W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/26/2017",
        "dateOfIncident": "05/26/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10991788,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3 SAV",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "NHTSA CAMPAIGN NUMBER: 16V071000 . ALMOST A YEAR AND A HALF AND STILL NO RESOLUTION FROM BMW MEANWHILE WE ARE AT RISK EVERYDAY.  I WOULD LIKE TO AT LEAST SEE A SCHEDULE FOR REPAIR RATHER THAN THEM USING ATTRITION TO MITIGATE THEIR COST.",
        "vin": "WBXPC93488W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/19/2017",
        "dateOfIncident": "02/05/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10990683,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  IT HAS BEEN 15 MONTHS SINCE I WAS NOTIFIED OF THE RECALL, AND BMW HAS YET TO REMEDY THE SITUATION.  I DO NOT THINK THIS IS REASONABLE.",
        "vin": "WBAWL13568P"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/12/2017",
        "dateOfIncident": "05/11/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10985117,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3 SAV",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE BOLTS ARE LOOSE OR HAVE FALLEN OUT.",
        "vin": "WBXPC93468W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/12/2017",
        "dateOfIncident": "02/05/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10985450,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. RECEIVED FIRST NOTIFICATION ON 02/2016, NO RESPONSE TILL NOW. IT HAS BEEN OVER A YEAR, NEED TO KNOW IF THIS WILL BE FIX OR WHAT IS THE RISK OF KEEP DRIVING WITH THIS ISSUE, BMW WILL BE RESPONSIBLE IF SOMETHING HAPPEN TO ME OR WHO EVER DRIVES THE VEHICLE?",
        "vin": "WBAVC53518F"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/04/2017",
        "dateOfIncident": "11/01/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10970534,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3 SAV",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 BMW X3 SAV. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V071000 (AIR BAGS); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. ONE DEALER STATED THAT BMW HAD NOT YET RELEASED THE PARTS. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "WBXPC93408W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/28/2017",
        "dateOfIncident": "12/01/2008",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10969014,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3 SAV",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. I HAVE BEEN  NOTIFIED OF THE RECALL FOR THIS ITEM MORE THAN A YEAR AGO AND THERE HAS BEEN NO PROGRESS IN REPLACING DEFECTS.  MEANWHILE, WE ARE DRIVING A TIME BOMB THAT IS MORE LIKELY TO INJURE US THAN OFFER PROTECT FROM IMPACTS.WHEN IS NHTSA GOING TO FORCE BMW TO MAKE REPAIRS. MY CAR IS 9 YEARS OLD NOW AND I HAVE BEEN DRIVING WITHOUT PROTECTION FOR THAT LONG AND THE CAR'S RESALE VALUE IS AFFECTED BY THIS AS WELL.",
        "vin": "WBXPC93418W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/08/2017",
        "dateOfIncident": "03/09/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10950297,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  I HAVE YET TO RECEIVE A SECONDARY LETTER FROM BMW ADVISING THEY ARE READY TO REPLACE MY DEFECTIVE AIRBAG INFLATOR.  I HAVE BEEN WAITING A FULL YEAR FOR THIS ISSUE TO BE RESOLVED.",
        "vin": "WBAWB33568P"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/03/2017",
        "dateOfIncident": "06/21/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10949470,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3 SAV",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL - BECAME AWARE OF DRIVER'S SIDE AIR BAG RECALL IN JUNE 2016; CONTACTED LOCAL BMW DEALER WHO ESTIMATED PARTS AVAILABLE TO FIX BY OCTOBER 2016. CONTACTED MY BMW DEALER AGAIN IN JANUARY 2017 AND WAS TOLD PARTS ARE PROVIDED TO BMW DEALERS BASED ON VIN, THAT MY VIN WAS ON RECORD WITH BMW, AND THAT I'D BE CONTACTED WHEN THEY BECAME AVAILABLE. THIS NINE MONTH WAIT IS UNREASONABLE FOR THIS SIGNIFICANT SAFETY ISSUE, AND NO ESTIMATE OF WHEN REPAIRS WILL BE MADE HAS BEEN PROVIDED.  *TR",
        "vin": "WBXPC93438W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/19/2017",
        "dateOfIncident": "02/01/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10946414,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3 SAV",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "\"TAKATA RECALL\" I AM NOT SURE IF THIS VEHICLE HAS BEEN FIXED. I BOUGHT THE VEHICLE IN MARCH OF 2016.  I AM GETTING A WARNING LIGHT REGARDING THE AIRBAG AND I AM CONCERNED.",
        "vin": "WBXPC93488W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/21/2016",
        "dateOfIncident": "02/05/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10936650,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3 SAV",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BMW X3 SAV. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V071000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "WBXPC93468W"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/09/2016",
        "dateOfIncident": "12/03/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10934311,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3 SAV",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR WAS ON RECALL FOR A DEFECTIVE AIRBAG.  I WAS NOTIFIED IN MARCH 2016.  I WAS TOLD BY MY DEALER THEY WOULD NOTIFY ME WHEN THEY HAD AN AIRBAG. WHEN I DIDN'T HEAR FROM THEM STILL BY EARLY AUGUST I ASKED FOR A LOANER CAR AS I NO LONGER FELT SAFE IN MY CAR BECAUSE OF THE CONSTANT WORRY ABOUT THE AIRBAG.  BMW INSTRUCTED ME TO PARK MY CAR AND \"NOT DRIVE IT\"  WHICH I DID.  FINALLY ON 11/28/16 THEY SAID THEY HAD AN AIRBAG.  I BROUGHT THE CAR IN. THE RESULT FROM IT SITTING FOR SO LONG HAS RUSTED MY PERFECTLY MAINTAINED BRAKES AND ROTORS TO BE NOT SAFE TO DRIVE AND MY HOOD IS FROZEN SHUT WITH POSSIBILITY OF FLYING OFF AND KILLING SOMEONE. BMW WILL NOT BE RESPONSIBLE FOR THE DAMAGE CAUSED BY THE CAR SITTING SO LONG AND I BELIEVE THEY SHOULD BE. IT IS THOUSANDS OF DOLLARS WORTH OF DAMAGE ON A CAR THAT WAS PERFECTLY SAFELY DRIVABLE BEFORE I PARKED IT TO WAIT FOR AN AIRBAG. I HAVE THE BMW RECALL AND THE PAPERWORK THAT SAYS I HAD TO PARK AND NOT DRIVE MY CAR. THEY SAY I WAS SUPPOSED TO MAINTAIN MY CAR.  I STARTED IT REGULARLY TO BE SURE BATTERY WAS GOOD AND EVERYTHING SEEMED OK.  I DON'T KNOW WHAT ELSE I SHOULD HAVE KNOW TO MAINTAIN IF THE CAR WAS ORDERED TO BE PARKED AND NOT DRIVEN. THEY SHOULD BE RESPONSIBLE FOR THIS. CAN YOU PLEASE HELP?",
        "vin": "WBXPC93448W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/22/2016",
        "dateOfIncident": "02/01/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10927405,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3 SAV",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL:  I FIRST RECEIVED NOTICE FROM NHTS IN FEB. 2016 AND WENT TO DEALER TO HAVE PART REPLACED HOWEVER THEY DID NOT HAVE THE NOTICE OR THE PART.  I RECEIVED A NOTICE FROM BMW IN OCT. 2016 AND WENT TO THE DEALER AGAIN AND STILL NO REPLACEMENT PART AVAILABLE IN OUR AREA.  I WAS TOLD TO JUST HANG TIGHT.  PLEASE ADVISE",
        "vin": "WBXPC93488W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/21/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10917958,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "NO PROGRESS ON RECALL CAMPAIGN NO. 16V-071 SINCE NOTIFICATION 7+ MONTHS AGO.  GIVEN THE YEAR OF MY BMW SERIES 3 SPORTSWAGON (2008) AND MY COASTAL LOCATION, I AM VERY CONCERNED THAT PARTS ARE STILL NOT AVAILABLE TO CORRECT THIS DANGEROUS PROBLEM.  THE RECALL NOTICE DIRECTS THE CONSUMER TO CONTACT WWW.SAFECAR.GOV \"IF YOUR BMW CENTER IS UNABLE TO REMEDY THE DEFECT ... WITHIN A REASONABLE PERIOD OF TIME.\"",
        "vin": "WBAVS13528F"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/17/2016",
        "dateOfIncident": "10/17/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10916638,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3 SAV",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 BMW X3 SAV. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V071000 (AIR BAGS). THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "WBXPC93498W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/10/2016",
        "dateOfIncident": "10/10/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10915124,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3 SAV",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AS OF TODAY, OCT 10TH 2016, THE RECALL REPAIRS HAS NOT BEEN DONE.",
        "vin": "WBXPC93468W"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/08/2016",
        "dateOfIncident": "10/08/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10914918,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3 SAV",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE SLOWING DOWN MY CAR (BMW X3 YEAR 2008)ENGINE SUDDENLY SHUT DOWN. I PULL OVER PUT IT IN PARK AND IT AND RE-START AUTO. THIS HAS HAPPEN A NUMBER OF TIMES. THE LAST TIME WAS TODAY 10/08/2016 WHILE SLOWING DOWN AT A YIELD SIGN. LUCKY FOR ME THERE HASN'T BEEN AN ACCIDENT YET.    THIS HAS HAPPENED A NUMBER OF TIMES ON A BUSY STREET, PULLING IN MY DRIVEWAY AND ON THE HIGHWAY DURING A BACKUP.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/05/2016",
        "dateOfIncident": "10/05/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10913916,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3 SAV",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL...RECEIVED RECALL NOTICE MONTHS AGO. BMW HAS NO IDEA WHEN THE PART WILL BE AVAILABLE TO FIX",
        "vin": "WBXPC934X8W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/05/2016",
        "dateOfIncident": "10/05/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10914105,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3 SAV",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A NOTICE THE START OF THE YEAR,CALLED BMW AND WAS TOLD THAT I HAD AN OPTION TO HAVE A REPLACEMENT VEHICLE WHICH I DECLINED AS I WAS INFORMED PARTS WOULD BE IN SOON. I CALLED BACK IN THE SUMMER AND WAS TOLD PARTS ARE SLOWLY BEING SHIPPED AND THAT BECAUSE I LIVED IN A COLD PART OF THE USA THOSE PARTS WITH WATER CLIMATES WOULD HAVE THE REPAIRS COMPLETED FIRST AND THAT I'M TO CALL BACK IN THE FALL. I CALLED TODAY OCT 5TH,2016 TO BE TOLD THAT MY VEHICLE COULD NOT CURRENTLY BE REPAIRED AND BMW ARE WAITING ON A GOVERNMENTAL SOLUTION AND IN THE MEANTIME I MUST DRIVER A LOAN VEHICLE UNTIL THE FINAL DECISION OR SOLUTION IS FOUND. MY COMPLAINT IS THAT I WAS NEVER CALLED ABOUT THE ISSUE SINCE RECEIVING THE NOTICE IN JANUARY 2016 AND IF I'D NOT CALLED TODAY I'D HAVE NEVER KNOWN.",
        "vin": "WBXPC93498W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/06/2016",
        "dateOfIncident": "02/05/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10903886,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3 SAV",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 BMW X3 SAV. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V071000 (AIR BAGS). THE PART TO DO THE REPAIR WAS NOT AVAILABLE.  THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WBXPC93408W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/16/2016",
        "dateOfIncident": "02/01/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10896317,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3 SAV",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL: AFTER BEING NOTIFIED THAT MY X3 WAS UNDER RECALL EARLIER THIS YEAR, I STILL HAVE NOT RECEIVED ANY UPDATES TO THE RECALL OR ALTERNATIVE OPTIONS TO MAKE MY CAR SAFE AGAIN. I HAVE REACHED OUT TO NIELLO BMW HERE IN SACRAMENTO AND THEY ARE UNWILLING TO PUT ME IN A RENTAL OR OTHERWISE ACCOMMODATE MY SAFETY NEEDS. I NEED BMW TO AGGRESSIVELY PROVIDE A SOLUTION SO I CAN DRIVE MY FAMILY AROUND WITHOUT RISKING OUR LIVES BY AN AIRBAG EXPLOSION. I AM MAKING A CAR PAYMENT AND INSURANCE PAYMENT FOR A CAR THAT HAS BEEN DANGEROUS TO DRIVE FOR 6 MONTHS. IT CANNOT KEEP SITTING IN MY GARAGE. I NEED ANSWERS. THANKS.",
        "vin": "WBXPC93498W"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/04/2016",
        "dateOfIncident": "07/29/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10893113,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3 SAV",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON A FLAT PAVED ROAD AND HEAR TWO MENTAL PING SOUNDS ON THE FRONT PASSENGER SIDE.I PULLED OVER TO CHECK  THE VEHICLE, AND COULDN'T SEE ANYTHING. I PULLED OUT AND WHEN I TURNED THERE WAS A LOUD VIBRATION. THIS HAPPENED WHEN TURNING LEFT OR RIGHT FROM A STOP.  WHEN FURTHER INSPECTED YOU COULD SEE THE MOTOR WAS HANGING AT AN ANGLE.  THE FOUR BOLTS ON THE ENGINE MOUNT BRACKET HAD BROKEN OFF CAUSING THE ENGINE TO HANG DOWN.  AFTER INSPECTING THE PARTS YOU COULD SEE BY THE DISCOLORATION OF TWO BOLTS THAT THEY HAD BEEN BROKEN FOR SOMETIME .   THERE IS NO WAY OF KNOWING WHEN THE FIRST ONE BROKE OR HOW LONG IT TOOK THE LAST TWO TO BREAK .THIS COULD CAUSE A SERIOUS PROBLEM TO THE OPERATION OF THE VEHICLE.  I SPOKE WITH A BMW MECHANIC AND HE SAID THEY FIX THIS PROBLEM ALL THE TIME,ITS NOT UNUSUAL.   ITS DEFIANTLY A SAFETY CONCERN .",
        "vin": "WBXPC93448W"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/02/2016",
        "dateOfIncident": "08/02/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10892567,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR ABRUPTLY LOSSES ALL POWER. IT'S LOST POWER ON THE FREEWAY (3 TIMES), AT STOP LIGHTS (TOO MANY TO COUNT) AND AFTER THE CAR SITS; EITHER AT WORK, OVER NIGHT OR EVEN IF I'M OUT RUNNING ERRANDS. IN OTHER WORDS, THE POWER FAILURE CANNOT BE DUPLICATED, IT HAPPENS RANDOMLY (MY CAR IS UNABLE TO START AS I TYPE THIS!!). NEEDLESS TO SAY MY LIFE AS WELL AS MY FAMILIES SAFETY HAVE BEEN PUT TO THE TEST SEVERAL TIMES. ON 2 SEPARATE OCCASIONS, I WAS NEARLY REAR-ENDED ON THE FREEWAY WHEN MY CAR LOST POWER AT HIGHWAY SPEEDS. I COULDN'T MOVE OVER TO THE SHOULDER AND ENDED UP STALLING IN THE SLOW LANE. AFTER SPENDING A SMALL FORTUNE TRYING TO FIX THIS DILEMMA A FRIEND SENT ME THIS LETTER THAT THE NHTSA SENT TO BMW IN 2013 REGRADING  A POWER FAILURE THAT MANY CARS WERE EXPERIENCING AT THE TIME. HERE'S THE LETTER: HTTP://WWW-ODI.NHTSA.DOT.GOV/ACMS/CS/JAXRS/DOWNLOAD/DOC/UCM433921/RCAK-13V044-6848.PDF  I'VE ALSO DRAFTED BMW THIS LETTER I SENT THEM YESTERDAY: (IN PART)    TO WHOM IT MAY CONCERN,  I AM WRITING TO VOICE GRAVE CONCERN REGARDING MY M3, WHICH HAS:  1). LOST POWER SEVERAL TIMES WHILE TRAVELING ON THE FREEWAY AT HIGHWAY SPEEDS AND HAS ALMOST CAUSED A CRASH ON 2 SEPARATE OCCASIONS (NEAR REAR END COLLISION)  2). LOST POWER AT STOP LIGHTS AND SEVERAL TIMES AS I STARTED TO ACCELERATE   3). CONSISTENT FAILURE TO START THE CAR (NO POWER) OR IT TRIES TO START AND IMMEDIATELY TURNS OFF AFTER A BRIEF SECOND     IN ADDITION TO THE IMMINENT DANGER TO MY FAMILY AND OTHERS, THIS HAS COST ME THOUSANDS OF DOLLARS  THE INCLUDED LINK BELOW SHOWS A DOCUMENT WHICH WAS SENT BY THE NHTSA TO BMW NA IN 2013. I WAS HAPPY TO REALIZE THAT BMW ACKNOWLEDGED THE PROBLEM FOR THE E92 3 SERIES (MY CAR SHARES THE EXACT SAME PART NUMBER FOR THE MENTIONED FAULTY PART), BUT I WAS EQUALLY SHOCKED TO FIND OUT THAT MY SPECIFIC VEHICLE WAS NOT COVERED UNDER THE RECALL WHICH IS WHAT MY CAR IS EXPERIENCING.",
        "vin": "WBSWD93568P"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/29/2016",
        "dateOfIncident": "03/14/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10891568,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3 SAV",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 BMW X3 SAV. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V071000 (AIR BAGS); HOWEVER, THE PART DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE VIN WAS UNAVAILABLE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/21/2016",
        "dateOfIncident": "02/05/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10887506,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3 SAV",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 BMW X3 SAV. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER:   16V071000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "WBXPC93418W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/08/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10883615,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3 SAV",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 BMW X3 SAV. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V071000 (AIR BAGS); HOWEVER, THE PARTS FOR THE REPAIR WERE NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WBXPC93438W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/07/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10883362,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  I RECEIVED A RECALL NOTICE IN MARCH FOR MY 2008 BMW 3 SERIES CONVERTIBLE,  [XXX] STATING THAT THE DRIVER'S FRONT AIR BAG MODULE NEEDS TO BE REPLACED AND THAT I WOULD BE NOTIFIED WHEN PARTS BECOME AVAILABLE.    I HAVE RECENTLY PURCHASED ANOTHER CAR (NOT A BMW) BUT THE TRADE IN ON THE BMW IS BLOCKED BY THE PENDING RECALL REPAIR.    MY LOCAL DEALER, WEATHERFORD IN BERKELEY, CA INFORMS ME THAT THEY STILL DO NOT HAVE THE PARTS AND HAVE NO INFORMATION ON WHEN THEY MAY BECOME AVAILABLE. THERE IS OBVIOUSLY A SAFETY ISSUE FOR ME AND FOR AN EVENTUAL BUYER OF THE CAR.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "WBAWR33518P"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/28/2016",
        "dateOfIncident": "06/27/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10881266,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3 SAV",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BMW X3 SAV. WHILE DRIVING 55 MPH, THE ENGINE STALLED WITHOUT WARNING. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE FAILURE MILEAGE WAS APPROXIMATELY 139,000.",
        "vin": "WBXPC934X7W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/21/2016",
        "dateOfIncident": "06/18/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10875522,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3 SAV",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 BMW X3 SAV. THE CONTACT STATED THAT THE AIR BAG WARNING LIGHT REMAINED ILLUMINATED. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V071000 (AIR BAGS); HOWEVER, THE REMEDY WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE VIN WAS UNKNOWN. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/31/2016",
        "dateOfIncident": "03/07/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10871584,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3 SAV",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 BMW X3 SAV. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V071000 (AIR BAGS). THE PART WAS NOT AVAILABLE WITHIN A REASONABLE TIME FRAME TO RECEIVE THE REPAIR. THE DEALER AND THE MANUFACTURER WERE UNABLE TO PROVIDE A SPECIFIC DATE AND ONLY INDICATED A GENERAL TIME FRAME, INDICATING THAT THE PARTS MAY BE AVAILABLE MID FALL OF 2016. THE CONTACT WAS UNABLE TO DETERMINE WHEN THE VEHICLE WOULD BE REPAIRED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE. ...UPDATED 06/30/16 *BF    *CN",
        "vin": "WBXPC93458W"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/31/2016",
        "dateOfIncident": "05/14/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10871664,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3 SAV",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BMW X3 2008 57,000 MILES.  ENGINE VIBRATION AT IDLE SPEED,  FIND OUT ALL 4 BOLT  ENGINE SUSPENSION ON THE PASSENGER SIDE BROKEN.",
        "vin": "WBXPC934X8W"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/12/2016",
        "dateOfIncident": "05/06/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10864596,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CURRENTLY I HAVE THE HIGH PRESSURE FUEL PUMP IN MY 335I (2008).  I HAVE MY \"SERVICE ENGINE SOON ENGINE MALFUNCTION. REDUCED POWER\" LIGHT ON - IT JUST CAME ON YESTERDAY. ORIGINAL WARRANTY WAS 4 YEARS 40,000 MILES. WHICH ACCORDING TO BMW WAS EXTENDED 10 YEARS 120,000. SO I AM OUT OF WARRANTY BECAUSE I ALREADY HAVE 130K, MY CAR WAS BROUGHT TO BMW SEVERAL OCCASION, IT WAS NEVER BROUGHT TO MY ATTENTION THAT THERE MAY A POTENTIAL PROBLEMS WITH THE HIGH PRESSURE FUEL PUMP.",
        "vin": "WBAVB77578N"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/04/2016",
        "dateOfIncident": "05/04/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10863247,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL",
        "vin": "WBAVA37558N"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/27/2016",
        "dateOfIncident": "04/13/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10861859,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3 SAV",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 BMW X3 SAV. THE CONTACT RECEIVED A NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V071000 (AIR  BAGS),BUT THE REMEDY FOR THE RECALL WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED THE FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.   UPDATED 04/05/17*LJ UPDATED 10/11/2017*JS",
        "vin": "WBXPC93458W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/06/2016",
        "dateOfIncident": "04/01/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10853769,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3 SAV",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL -- BMW SENT ME A LETTER FOR THE RECALL, BUT SAYS THEY HAVE NO PARTS AND BY SUMMER MAY HAVE LIMITED PARTS. THEY QUOTED NHTSA WHEN I CALLED SAYING THEY ARE PROBABLY SAFE. WHAT IS THE POINT IF THERE ARE NO PARTS?",
        "vin": "WBXPC934X8W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/22/2016",
        "dateOfIncident": "02/05/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10851101,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3 SAV",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2008 BMW X3 SAV. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V071000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "WBXPC93478W"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/15/2016",
        "dateOfIncident": "02/01/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10836295,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I EXPERIENCED A BREAK DOWN WHEN I WAS DRIVING ON A CITY STREET. MY CAR WAS THEN TOWED TO THE LOCAL DEALER AND DEALER DISCOVERED WATER PUMP WAS BAD SO IT WAS THEN REPLACED UNDER WARRANTY. 3 YEARS LATER MY CAR BROKE DOWN AGAIN AND WAS TOWED TO LOCAL DEALER AN AGAIN THE WATER PUMP WAS DETERMINED BAD AND REPLACED. I CONTACTED BMW NORTH AMERICA TO SEE IF THEY WOULD HELP CONSIDERING THE WATER PUMP HAS BROKEN TWICE BUT NO HELP FROM THEM.",
        "vin": "WBAWB73548P"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/19/2016",
        "dateOfIncident": "01/16/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10821082,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3 SAV",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS STATIONARY.  I WAS CHANGING A FUSE AND WAS LEANING OVER FROM THE DRIVER SEAT ON TO THE PASSENGER SEAT.  AFTER CHANGING THE FUSE, I STARTED THE CAR AND THE AIRBAG LIGHT ILLUMINATED.  UPON DRIVING THE CAR LATER WITH MY WIFE, I NOTICED THAT THE PASSENGER AIRBAG OFF LIGHT WAS ILLUMINATED AS WELL.  I THEN HAD THE CODE DIAGNOSED AND IT INDICATED A MALFUNCTIONING PASSENGER SEAT SENSOR.  I HAVE SPORT COMFORT SEATS IN MY CAR.",
        "vin": "WBXPC93438W"
    },
    {
        "components": "STRUCTURE,SEATS",
        "crash": false,
        "dateComplaintFiled": "12/07/2015",
        "dateOfIncident": "11/27/2015",
        "fire": true,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10808824,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3 SAV",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY 2008 BMW X3, THE DRIVER SIDE HEATED SEAT WAS TURNED ON, THAN SHORTED OUT, BURNED THROUGH THE PROTECTIVE LAYERS, A STINKY SMOKE CREATED, MELTED MY LEATHER SEAT, AND PARTIALLY BURNED MY JEANS AND LEG.    DUE TO THE YEAR AND MILES ON THE VEHICLE, BMW WOULD NOT FIX ANY OF THE PARTS.",
        "vin": "WBXPC93468W"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/04/2015",
        "dateOfIncident": "09/16/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10779547,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED CAR AUGUST 29 2015. ON SEPTEMBER 15 2015 AFTER FUELING AND TURNING  ON CAR THE BRAKE, ABS, TRACTION CONTROL AND SERVICE ENGINE LIGHT APPEARED. WAS UNABLE TO ACCELERATE VEHICLE OUT OF GAS STATION PARKING LOT. LIGHTS WENT AWAY BUT INTERMITTENTLY WOULD COME ON WHILE DRIVING WHICH CAUSED SUDDEN INABILITY TO ACCELERATE WHILE DRIVING IN TRAFFIC. VEHICLE FEELS LIKE IT CANNOT SWITCH AND GEAR AND IS BEING PUSHED BACK.WHEN THIS HAPPENS THE RESR LIGHTS STOP WORKING SO DRIVERS BEHIND COULD CRASH INTO ME BECAUSE OF SUDDEN DECREASE IN SPEED.TOOK TO DEALER SEPTEMBER 22. SAID THEY FIXED CONTROL MODULE. BUT PROBLEM CONTINUES",
        "vin": "WBAVC935X8K"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/24/2015",
        "dateOfIncident": "08/02/2015",
        "fire": true,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10758905,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS PARKED IN THE DRIVEWAY, DROVE IT EARLIER THAT DAY FOR ABOUT AN HOUR, PARKED IT 3PM AND 2 HOURS LATER NEIGHBOR CAME KNOCKING SAYING CAR WAS SMOKING. RAN OUTSIDE AND CAR WAS ON FIRE. INTERIOR WAS SMOKED OUT. KEYLESS ENTRY WAS DEAD. BROKE THE WINDOW TO GET THE CAR OPEN, TURNED THE GARDEN HOSE ON TO TRY AND STOP THE CAR FROM BURNING. CALLED 911 FIRE DEPT ARRIVED AND HAD TO PRY THE TRUCK OPEN BECAUSE IT WAS STILL SIZZLING.  FIRE DEPT CUT THE BATTERY CABLES AND SAID IT LOOKED LIKE AN ELECTRICAL FIRE UNDER THE DASH.  GLOVE BOX AND PASSENGER SIDE FRONT SEAT WAS COMPLETELY CHARRED. AFTER 22 DAYS, A BMW ENGINEER AND ALLSTATE INS CALLED IT A TOTAL LOSS.  BMW ENGINEERS REPORT STILL HAS NOT BEEN PUBLISHED. TOTAL LOSS ON A PARKED VEHICLE; CLEARLY THIS VEHICLE WAS UNSAFE AND A DESIGN FAULT.  MANUFACTURERS ARE SUPPOSE TO ENGINEER CARS TO WITHSTAND FIRES.",
        "vin": "WBVA375X8NL"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/20/2015",
        "dateOfIncident": "07/20/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10735356,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON A HIGHWAY AROUND 60 MPH SPEED AND SUDDENLY MY CAR COULDN'T SPEED ANY FURTHER AND LUCKY FOR ME I WAS DRIVING NEXT TO CENTER DIVIDE AND COULD PULL IT, I WAS ABLE TO AVOID ANY ACCIDENT. IT WAS PEAK TRAFFIC TIME ( EARLY MORNING COMMUTE ).  SO I BELIEVE THIS NEEDS TO LOOKED INTO THAT IF THERE WAS A RECALL WHICH WAS NOT APPLIED TO ALL THE MAKE, MODELS.    AFTER DIAGNOSIS IT WAS FOUND THE ISSUE WAS WITH FUEL PUMP ON WHICH THERE ARE CERTAIN RECALLS ON THE NEWER MODELS BUT FOR 2008 MODEL THEY WAS NONE I CONFIRMED WITH THE CUSTOMER SERVICE.",
        "vin": "WBAVC53558F"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "05/29/2015",
        "dateOfIncident": "05/01/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10722343,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3 SAV",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SEAT BELT SENSOR WARNING LIGHT AND ALARM WOULD INDICATE THAT THE SEAT BELTS ARE NOT WORN BY DRIVER AND / OR PASSENGER WHEN THE TEMPERATURE INSIDE THE VEHICLE IS 90 DEGREES FAHRENHEIT OR MORE.",
        "vin": "WBXPC93488W"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/21/2015",
        "dateOfIncident": "05/15/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10717629,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3 SAV",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BMW HAD BEEN HAVING A ROARING, VIBRATING NOISE IN IT.  THEN IT STARTED RUNNING HOT.  I PARKED IN MY GARAGE ONLY TO FIND WATER AND ANTIFREEZE ALL OVER THE GARAGE FLOOR.  WHEN I TOOK IT TO GET IT FIXED, THE MECHANIC TOLD ME THAT THE BOLTS WHICH HOLD THE ENGINE MOUNTS UP ON THE PASSENGER SIDE HAD BROKEN AND THE ENGINE WAS SITTING SIDEWAYS AND HAD DROPPED DOWN AND CRUSHED THE WATER PUMP AND COOLANT RESERVOIR.  THE BOLTS ARE NOT SUBSTANTIAL ENOUGH TO SUPPORT THE ENGINE.  THEY ARE VERY LIGHTWEIGHT METAL (MAYBE ALUMINUM) AND JUST BROKE.  THE CAR HAS NOT BEEN INVOLVED IN ANY CRASH.  THERE IS NO REASON WHY THE BOLTS BROKE, BUT IT COULD HAVE REALLY PUT MY FAMILY IN JEOPARDY.  WHEN I CONTACTED THE DEALER TO SEE IF THERE HAD BEEN ANY RECALLS ON THESE BOLTS, THEY ACTED LIKE I WAS CRAZY AND DIDN'T KNOW WHAT I WAS TALKING ABOUT.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/04/2015",
        "dateOfIncident": "05/02/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10714294,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING CAR AND VEHICLE STARTED TO SHAKE, MAKE RUMBLING NOISE AND FEELS SLUGGISH WHEN ACCELERATING.   DOESN'T FEEL SAFE TO DRIVE WITH SLUGGISH, ENGINE POWER INTERMITTENT.  *TR",
        "vin": "WBAVC57568N"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/11/2015",
        "dateOfIncident": "03/06/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10693727,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DOOR LOCKS FAILED. CAN ONLY OPEN DOOR WITH KEY.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE,SEATS",
        "crash": false,
        "dateComplaintFiled": "01/28/2015",
        "dateOfIncident": "06/25/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10679453,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "BLACK MOLD FORMED ON REAR SEATS, DASHBOARD INTERMITTENTLY WORKED (1/2 OF DASHBOARD ACTIVE, 1 FUSE POWERS THE DASH), 6\" OF WATER POOLED IN REAR BACK PASSENGER FOOTWELL (LOCATION OF MAIN ELECTRICAL UNIT); WATER WAS DRIPPING ON MY FOOT WHEN RESTING ON PETAL OF MY 42000 MILE, $50,000, 2008 BMW 328XI COUPE. I CONTACTED BMW OF NA WHO ADVISED ME NOT TO USE THE CAR BECAUSE IT WAS DANGEROUS. AFTER SEVERAL ATTEMPTS TO WORK WITH BMW OF NA & BMW DEALERSHIP (PLACE OF PURCHASE) A VAPOR BARRIER LEAK WAS FOUND BUT MORE WAS BELIEVED TO BE AT CAUSE. THE DASH NEEDED TO BE REMOVED, FOR $1800. I REFUSED TO PAY; REQUESTED BMW OF NA TO PAY. REQUEST DENIED. THE DEALER SAID BMW OF NA WOULD ONLY PAY VAPOR BARRIER REPAIR COSTS. I ASKED FOR NO REPAIRS; TOWED THE CAR HOME. FINALLY REACHING LINDA VITALE, EXEC. CUSTOMER SERVICES OF BMW NA, NJ, SHE TOLD ME THE DEALER DID DO THE REPAIRS. THIS WAS AGAINST MY EXPRESSED WISHES. I WANTED THE CAR INVESTIGATED ELSEWHERE TOO. IN A LATER CONVERSATION, [XXX] CLAIMED THE REASON FOR THE WATER WAS FROM A LEAK FROM A 3RD PARTY WINDSHIELD INSTILLATION. NOTE: MOLD, WATER, AND ELECTRICAL PROBLEMS EXISTED PREVIOUS TO 3RD PARTY WINDSHIELD INSTALLMENT. [XXX] , PROVEN WRONG, DUE TO DATES, STATED, IN A SUBSEQUENT RECORDED CONVERSATION, PER THE DEALER, THE WATER ENTERED THE CAR BECAUSE THE DOORS WERE DISMANTLED AND INCORRECTLY PUT BACK. NOTE:[XXX] HAS PROOF THAT THE DOORS WERE NEVER REMOVED. [XXX] TOTALED THE CAR DUE TO BLACK MOLD CONTAMINATION, HEALTH RISKS; RISK OF INJURY TO ME AND OTHERS DUE TO MOLD, THE ELECTRICAL COMPROMISED, AND POSSIBLE POWER CUT TO ENGINE WHILE IN MOTION. A PAID LOAN BUT HAVING NO CAR, BMW OF NA WISHED ONLY TO COMPENSATE ME WITH $1000 TOWARDS A NEW BMW. I FOUND MANY FORUMS, ON THE INTERNET, REGARDING 2002-2015 BMW'S W/THE SAME PROBLEMS & OWNERS SUSTAINING SAME LOSS OF PROPERTY WITH NO ETHICAL OR SUSTAINABLE COMPENSATION FROM BMW OF NA.     INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).'  *TR",
        "vin": "WBAWV53568P"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/14/2015",
        "dateOfIncident": "09/14/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10672466,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BMW 318I.  THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, THE AIR BAG WARNING LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN TO THE DEALER. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 55,000.",
        "vin": "WBAVA375X8N"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/31/2014",
        "dateOfIncident": "11/23/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10669416,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3 SAV",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE TURNED OFF ON INTERSTATE 40 NEAR GREENSBORO, NORTH CAROLINA. FORTUNATE TO BE ABLE TO PULL ONTO SHOULDER. TRAVELING CLOSE TO 60MPH.  STARTED RIGHT BACK UP. THIS IS THIRD OCCURRENCE IN PAST TWO MONTHS. NEVER A PROBLEM PRIOR; ALMOST TWO YEARS OF OWNERSHIP. VERY SCARY AND DANGEROUS. PLEASE ADVISE ON IF THIS IS MORE COMMON THAN THE 40-60 CASES I'VE READ ABOUT ONLINE. WHAT SEEMS TO BE ISSUE?   *JS",
        "vin": "WBXPC93468W"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/11/2014",
        "dateOfIncident": "11/21/2011",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10663609,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3 SAV",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR NEARLY THE ENTIRE TIME I HAVE OWNED THE VEHICLE I HAVE HAD ISSUES WITH THE CAR JERKING AND LURCHING WHILE ACCELERATING IN THE LOWER RPM RANGES.  OF LATE THIS HAS BECOME SO BAD I AM AFRAID TO DRIVE THE VEHICLE.  THE PROBLEM MANIFESTS ITSELF MOSTLY BETWEEN 1,800 AND 2,400 RPM WITH THE MOST SEVERE ISSUES IN THE 2,200 TO 2,400 RPM RANGE.  WHEN GOING FROM A STOP THE CAR WILL BEGIN TO ACCELERATE AND WHEN IT GETS JUST ABOVE 2,000 RPM IT BEGINS TO JERK AND LURCH WITH THE TACHOMETER FLUCTUATING WILDLY.  THE 4X4 LIGHT THEN COMES ON AND THE CAR COMPLETELY LOSES ACCELERATION.  THIS HAS HAPPENED MANY TIMES WHILE IN THE MIDDLE OF A BUSY INTERSECTION.  I HAVE BEEN NEARLY T-BONED TWICE AND NOW FEAR FOR MY LIFE DRIVING THIS CAR.  *TR",
        "vin": "WBXPC93498W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/19/2014",
        "dateOfIncident": "10/15/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10659211,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3 SAV",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT MY CAR AT 88,000 MILES AND SHORTLY AFTER (5 DAYS) MY AIRBAG LIGHT CAME ON.  I TOOK IT BACK TO THE DEALER AND THEY FIGURED OUT WHAT WAS WRONG WITH IT, THEN REPLACED THE DRIVER SIDE CURTAIN AIRBAG.  ABOUT A MONTH LATER MY LIGHT CAME ON AGAIN AND HAS BEEN ON SINCE.  SINCE THE SECOND TIME THE LIGHT HAS COME ON I TOOK IT TO A DIFFERENT DEALER (BECAUSE I MOVED) AND THEY SAID IT IS SOMETHING TO DO WITH THE PASSENGER AIRBAGS BUT THEY WOULD HAVE TO PLUG IT UP TO A COMPUTER TO FIGURE OUT EXACTLY WHAT IT IS.  *TR",
        "vin": "WBXPC934X8W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/14/2014",
        "dateOfIncident": "10/14/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10644528,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "HI,     I AM QUITE FRUSTRATED WITH BMW. THEY HAVE EXPERIENCED WIDESPREAD ISSUES WITH THEIR PASSENGER RESTRAINT SYSTEMS HAVE MULTIPLE RECALLS OUT, HOWEVER MY CAR AT THIS TIME IS NOT PART OF IT BUT MY PASSENGER AIRBAGS ARE FAULTY. BMW WANTS TO CHARGE ME $150 DIAGNOSIS INSTEAD OF ENSURING THE SAFETY OF MY PASSENGERS. I'M WRITING YOU AS THIS IS VERY SCARY TO ME THAT BMW IS WILLING TO RISK TEH SAFETY OF THE MY PASSENGERS AND NOT TAKE CARE OF THEIR CUSTOMERS.  *TR",
        "vin": "WBAVC53568F"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/06/2014",
        "dateOfIncident": "10/03/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10641853,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THREE BOLTS ON ENGINE MOUNT BRACKET SHEARED OFF AND ONE BOLT ON THE SAME ENGINE MOUNT BRACKET WAS MISSING. THE THREE BOLTS THAT SHEARED ARE IN THE ENGINE BLOCK. THIS INCIDENT OCCURRED ONLY TWO WEEKS AFTER BRINGING IN MY CAR TO THE PETER PAN BMW DEALERSHIP TO HAVE MY CAR INSPECTED.  *TR",
        "vin": "WBAVC53568F"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/09/2014",
        "dateOfIncident": "08/09/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10621149,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS INFORMED THE VALVE COVER GASKET AND OIL FILTER HOUSING GASKET WERE LEAKING, WHICH CAUSED A PROBLEM WITH THE ECCENTRIC SHAFT SENSOR. I PAID FOR A NEW VALVETRONIC MOTOR, ECCENTRIC SHAFT SENSOR, VALVE COVER AND GASKETS, AND OIL FILTER HOUSING GASKET, AND THE ASSOCIATED REPAIR. FAST FORWARD 3 MONTHS, I GO IN FOR A OIL CHANGE AND AM TOLD THAT AGAIN I HAVE A SIGNIFICANT LEAK FROM THE VALVE COVER GASKET AND OIL FILTER HOUSING GASKET.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/28/2014",
        "dateOfIncident": "07/18/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10616761,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS GOING OVER A SMALL BUMP IN THE ROAD AT 30 MPH AND MY ENGINE MOUNT FAILED.  ALL FOUR ALUMINUM BOLTS SHEARED OFF AND THE ENGINE DROPPED.  THIS DROP SNAPPED MY PASSENGER DRIVE   SHAFT (HALF AXLE) IN TWO PIECES.     *JS    I THINK BMW HAS A SERIOUS PROBLEM WITH THE STRENGTH OF THE ENGINE MOUNT HARDWARE.   THE ENGINE MOUNT BOLTS SHOULD BE STRONGER.  THE FAILURE MODE IS DANGEROUS.      *JS",
        "vin": "WBAVC73558K"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/15/2014",
        "dateOfIncident": "06/05/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10610665,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3 SAV",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS INFORMED BY AN INDEPENDENT BMW REPAIR SHOP THAT THE REAR SPRINGS WERE BROKEN. A SUBSEQUENT VISIT TO A BMW DEALER CONFIRMED THIS. I WAS ALSO INFORMED BY BOTH THE INDEPENDENT SHOP AND THE DEALER THAT THIS WAS A COMMON PROBLEM WITH 3 SERIES BMWS.  BMW OF NORTH AMERICA TOLD ME THAT THIS WAS NOT AN ITEM THAT WOULD BE COVERED UNDER THEIR CPO WARRANTY OR ANY OTHER WARRANTY. I WOULD THINK THAT BROKEN SPRINGS WOULD AFFECT HANDLING AND THEREFORE CONSTITUTE A SAFETY HAZARD. BOTH THE DEALER AND INDEPENDENT SHOP STRONGLY RECOMMENDED THAT I HAVE THEM REPLACED AS SOON AS POSSIBLE. *TR",
        "vin": "WBXPC93498W"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/08/2014",
        "dateOfIncident": "07/03/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10608823,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BRAKES FAILED. I WAS AT A STOPLIGHT ON A SIDE STREET. WITH 3 OTHER CARS IN FRONT OF ME, THE LIGHT TURNED GREEN AND I PROCEEDED TO STEP ON THE GAS PEDAL. AS I PICKED UP SPEED, THE CARS IN FRONT OF ME STARTED TO BRAKE AS THERE WERE PEDESTRIANS AND OTHER TRAFFIC.  I WENT TO APPLY MY BRAKES AND THE CAR DID NOT SLOW DOWN OR STOP. I VERED TO THE RIGHT TO AVOID REAR-ENDING THE CAR IN FRONT OF ME AND STARTED TO PUMP MY BRAKE PEDAL. IT STILL WAS NOT SLOWING THE CAR. I NOTICED THE BRAKE PEDAL FELT HARD AS I TRIED TO PRESS IT DOWN. I APPLIED THE EMERGENCY BRAKE AS I MOVED OFF THE ROAD AND ONTO THE SHOULDER. I HAD THE CAR TOWED TO THE DEALERSHIP WHERE I WAS TOLD THE VACUUM PUMP FAILED. THEY DID CHECK THE BRAKE LINE, BRAKE FLUIDS AND NOTED THERE WERE NO LEAKS. THE VACUUM PUMP JUST FAILED WITH NO WARNING. NO INDICATOR OR WARNING LIGHT CAME ON TO WARN ME OF ANY EMERGENCY OR SAFETY ISSUE.  THIS IS IN A 2008 BMW 328I WITH ONLY 54000 MILES.    *JS",
        "vin": "WBAVC53528F"
    },
    {
        "components": "AIR BAGS,SEATS",
        "crash": false,
        "dateComplaintFiled": "07/01/2014",
        "dateOfIncident": "01/21/2009",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10607392,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3 SAV",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SEAT OCCUPANCY DETECTION MAT FAILED AT 7,285 AND WAS REPLACED, THEN WAS FAILING AGAIN AT 31,592 AND BMW DID NOT REPAIR/REPLACE WHEN SERVICED BUT DID CONFIRM THE PROBLEM. KNOW THE SEAT OCCUPANCY MAT IS IN TOTAL FAILURE AT 59,000. BMW WILL NOT ADDRESS THE PROBLEM. THIS PROBLEM IS PART OF A RECALL FOR MOST VEHICLE OF THIS AGE BUT FOR SOME REASON NOT THE X3.  *TR",
        "vin": "WBXPC93408W"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/26/2014",
        "dateOfIncident": "02/20/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10574906,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTICED AN UNUSUAL ENGINE VIBRATION.  WENT TO MY MECHANIC WHO INSPECTED VEHICLE.  POINTED OUT BROKEN MOTOR MOUNT BOLTS.  HIS COMMENT  I HAVE SEEN SEVERAL OF THESE OVER THE YEARS.  THE BOLTS ARE MADE FROM ALUMINUM -- THEY BREAK.  SAID HE THIS WAS AN ONGOING AND WELL KNOWN ISSUE WITH BMW FROM THAT YEAR AND 2009.  SAID BMW WOULD NOT COVER IT.  HE ALSO STATED THE CAR HAD NO VISIBLE SIGNS OF DAMAGE, TO UNDERCARRIAGE THAT WOULD SUGGEST ANY DAMAGE.   HE SAID IT JUST HAPPENS, AND A LOT OF PEOPLE HAVE COMPLAINED TO BMW, ALL TO NO AVAIL.     INSTEAD OF BEAMERS... THEY SHOULD CALL THIS CAR  A BUMMER.  IT IS AN VERY EXPENSIVE PROBLEM, CREATED BY POOR ENGINEERING AND MANUFACTURING.    ALUMINUM BOLTS HOLDING AN ENGINE.  *TR",
        "vin": "WBAVC53568F"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/26/2014",
        "dateOfIncident": "07/23/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10566091,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AC UNIT WENT FROM BLOWING COLD TO HOT AIR WITH NO WARNING .. A BURNING SMELL WAS ALSO NOTICED AT THE SAME TIME. MY CAR HAD JUST COME OUT BMW SERVICE FOR AN OIL CHANGE . BURNT CONNECTORS , WIRES AND AC BLOWER REPLACED (AT OWNERS EXPENSE ) SHORTLY AFTER I (OWNER ) RECEIVED A RECALL LETTER REGARDING CABLE WIRE TO BATTERY WERE NOT PROPERLY INSULTED AND BMW WOULD REPLACE THEM AT NO COST TO OWNER.. WAS ADVISED BY BMW SERVICE THIS HAD NOTHING TO DO WITH THE BURNED UP CONNECTING WIRES TO THE AC BLOWER.. ONLY HAD MY CAR 1/12YR UNDER WARRANTY WHEN I PURCHASED IT OF COURSE NOT WHEN THIS PROBLEM HAPPEN WHICH WAS COSTLY.  *TR",
        "vin": "WBAVA37578N"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "02/22/2014",
        "dateOfIncident": "02/01/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10565404,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TIRE SIDEWALL SEPARATION, JUST BELOW THE TIRE BEAD.  THE MAKE OF THE TIRE WAS A MICHELIN PILOT SP, PS2, ZP.  *TR",
        "vin": "WBAVB73578P"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "02/17/2014",
        "dateOfIncident": "02/05/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10564627,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Michelin North America, Inc.",
                "productMake": "MICHELIN",
                "productModel": "PILOT SPORT",
                "productYear": "9999",
                "size": "255/35ZR20 97Y",
                "type": "Tire"
            }
        ],
        "summary": "THIS IS THE THIRD TIRE, ON MY CAR, FROM THIS MANUFACTURER WHERE THE SIDEWALL HAS FAILED.  SIDE-WALL SEPARATION.   EACH TIRE IS THE SAME MODEL.  *TR",
        "vin": ""
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "01/12/2014",
        "dateOfIncident": "09/16/2010",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10559500,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3 SAV",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER SEAT ALARM WOULD ACTIVATE FOR NO APPARENT REASON ON A DAILY USE.  UNDER WARRANTY SEAT PAD WAS REPLACED.  REPORTED SAME SEAT MALFUNCTION ONE MONTH AFTER WARRANTY RAN OUT AND BMW AGREED TO PAY FOR SEAT PAD AND I WOULD HAVE TO PAY FOR LABOR OF $300.00.  AT THIS TIME SEAT NO LONGER SOUNDING ALARM.  SEAT ALARM WOULD MALFUNCTION AGAIN THE ENTIRE HOT WEATHER SEASON OF 2013.  AFTER CONTACTING BMW  IN DEC OF 2013 I WAS TOLD  NO COVERAGE. AFTER RESEARCHING INTERNET I DISCOVERED THIS TO BE A REGULAR COMPLAINT SINCE 2003 WHEN 1ST X3 WAS MANUFACTURED.  I DISCOVERED LAST WEEK THAT AS LONG AS THIS PAD IS NOT FUNCTIONING PROPERLY THE AIR BAG MAY NOT WORK IN AN ACCIDENT.  THIS A VERY SERIOUS DRIVING SITUATION THAT COULD RESULT IN SERIOUS INJURY.  BMW NEEDS TO BE HELD ACCOUNTABLE AND MADE TO ADDRESS THIS SAFETY HAZARD IMMEDIATELY.  *TR",
        "vin": "WBXPC93468W"
    },
    {
        "components": "AIR BAGS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/08/2014",
        "dateOfIncident": "06/15/2010",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10558979,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3 SAV",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BMW X3. THE CONTACT STATED THAT THE FRONT PASSENGER'S SEAT BELT WARNING CHIME ACTIVATED INDEPENDENTLY WITHOUT THE SEAT BEING OCCUPIED. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSIS WHERE THE TECHNICIAN STATED THAT THE SEAT SENSOR MAT IN THE FRONT PASSENGER'S SEAT WOULD NEED TO BE REPLACED. THE FAILURE RECURRED AFTER THE REPAIR. ADDITIONALLY, THE ENGINE WARNING LIGHT WAS ILLUMINATED. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THE TECHNICIAN STATED THAT THE DMTL PUMP WOULD HAVE TO BE REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 25,000.",
        "vin": "WBXPC93468W"
    },
    {
        "components": "AIR BAGS,SEATS",
        "crash": false,
        "dateComplaintFiled": "01/01/2014",
        "dateOfIncident": "08/02/2011",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10558092,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3 SAV",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER SEAT ALARM WOULD GO OFF CONSTANTLY WITHOUT ANYONE OR ANYTHING IN THE SEAT.  BMW REPLACED SENSOR UNDER WARRANTY.  PROBLEM APPEARED TO BE FIXED UNTIL THE FOLLOWING SUMMER 2012 WHEN ALARM ON SEAT WOULD GO OFF AGAIN ON A REGULAR BASIS. BMW REFUSED TO REPLACE UNTIL COMPLAINT FILED AND I STATED IT WAS A DRIVING HAZARD DUE TO ATTEMPTING  TO FUMBLE WITH BELT WHILE DRIVING TO STOP ALARM BY SECURING BELT. BMW OFFERED TO REPLACE ALARM  SENSOR I HAD TO PAY $300.00 FOR LABOR. THIS WAS LATE SEPT 2012.  SHORTLY AFTER DUE TO COLD WEATHER ALARM DID NOT GO OFF ANY LONGER.I DID NOT HAVE ALARM SENSOR REPLACED BECAUSE IT WAS NOW WORKING PROPERLY UNTIL APRIL OF 2014 WHEN ALARM AGAIN BEGAN TO SOUND AND CONTINUED THROUGHOUT THIS PAST SUMMER. ACCORDING TO INTERNET AND FORUMS ON THE INTERNET THIS IS A PROBLEM THAT HAS EXISTED ON X3S FROM THE FIRST YEAR THE CAR WAS SOLD.  BMW APPARENTLY AVOIDS DOING ANYTHING TO PREVENT THIS FROM OCCURRING EVEN IN THE NEWER MODELS.THIS IS AN ANNOYING AND DANGEROUS SITUATION WHICH SHOULD BE ADDRESSED .IN MY COMPLAINT THEY STATED I DIDN'T ACCEPT THEIR OFFER EVEN THOUGH THE ALARM WAS NO LONGER GOING OFF AND THAT MY WARRANTY WAS OVER. SOMEONE NEEDS TO MAKE THEM ACCOUNTABLE AND THEIR CARS SAFER..    *TR",
        "vin": "WBXPC93468W"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/01/2014",
        "dateOfIncident": "11/15/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10558094,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3 SAV",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SERVICE ENGINE SOON LIGHT CAME ON.  DIAGNOSED AT DEALERSHIP THAT IT WAS THE DMTL PUMP THAT SENSES AND GAS LEAKS. I WAS TOLD BY SERVICE MANAGER THAT IT WAS OUT OF WARRANTY AND I DIDN'T HAVE TO REPLACE IT SINCE I LIVED IN PA IN AN AREA THAT DIDN'T REQUIRE IT TO WORK UNDER OUR STATE INSPECTIONS. THE ONLY PROBLEM WAS THAT THE SERVICE ENGINE LIGHT WOULD BE ON AND I WOULD NOT KNOW IF SOMETHING ELSE WAS WRONG WITH THE CAR.  LATER I WAS TALKING TO SERVICE MANAGER AT LEXUS WHO WAS A FORMER BMW SERVICE MANAGER WHO STATED IT WAS COVERED UNDER PA EMISSION LAWS.  I CONTACTED MANAGER AT BMW WHO INFORMED ME THAT I WOULD HAVE TO CONTACT BMW. I REGISTERED A COMPLAINT WITH BMW WHO CAME BACK 3 WEEKS LATER DENYING ANY COVERAGE. WHEN ASKED WHY GENTLEMAN COULD NOT ANSWER STATING HE WAS NOT A TECHNICIAN. I REPEATEDLY STATED FROM MY RESEARCH THAT PA ADOPTED CALIFORNIA EMISSION LAW IN 1996 AND FROM MY UNDERSTANDING IT SHOULD BE REPLACED BY BMW. ONCE AGAIN I WAS TOLD NO COVERAGE AND I ASKED IF HIS 3 WEEKS OF RESEARCH INVOLVED A CORPORATE ATTORNEY.  HE WOULD NOT ANSWER.IT APPEARS THAT A BMW BUYER IS GIVEN 4 YEAR WARRANTY BECAUSE AFTER THAT EVERYTHING IS DENIED WITH NO EXPLANATION AS TO WHY.  THIS DMTL PUMP IS A SENSOR FOR FUEL LEAKS AND COULD REALLY CAUSE A SERIOUS ACCIDENT IF NOT REPLACED.  I BELIEVE PA EMISSION LAWS UNDERSTAND THE HAZARD AND THAT IS WHY THEY STATE IT SHOULD BE REPLACED.  THIS PROBLEM WITH BMW GOES BACK OVER 10 YEARS ACCORDING TO INTERNET FORUMS..  I CANNOT UNDERSTAND WHY THEY HAVE NOT BEEN HELD ACCOUNTABLE AND MADE TO CORRECT THIS HAZARDOUS SITUATION. *TR",
        "vin": "WBXPC93468W"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/12/2013",
        "dateOfIncident": "10/23/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10551921,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3 SAV",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I NOTICED WATER ON THE GARAGE FLOOR ABOUT A WEEK AGO AND THAT THE COOLANT WAS LOW.  I TOOK IT TO BMW DEALER EXPECTING A RADIATOR LEAK.  I WAS TOLD THAT ALL 4 ALUMINUM SUPPORT BOLTS HAD BEEN SHEARED AND THAT THE ENGINE WAS RESTING ON THE WATER PUMP CAUSING THE LEAK.  THE SOLUTION, WHILE COVERED BY MY EXTENDED WARRANTY, IS STILL COSTING ME $50 DEDUCTIBLE AND ANOTHER $200 OR SO TO FLUSH AND REPLACE THE COOLANT (WHICH WAS CAUSED BY THE WATER PUMP DAMAGE).  IF I DIDN'T HAVE THE WARRANTY AND WAS FORCED TO PAY FOR THE LABOR, BOLTS, SUPPORT BRACKETS AND A WATER PUMP - I WOULD BE EVEN MORE IRATE THAT BMW HASN'T ISSUED A RECALL ON THIS WELL KNOWN ISSUE.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/05/2013",
        "dateOfIncident": "08/29/2011",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10550906,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AUC SENSOR UNDER THE HOOD IS NOT WELL SECURED.  THE BRACKET SECURING THE SENSOR IS BROKEN LEAVING THE SENSOR LOOSE UNDER THE HOOD.  THE LOOSE SENSOR WIRE RUBS AGAINST SHARP EDGE OF THE CAR BODY, BREAKING THE OUTER PROTECTIVE SHIELD OF THE WIRE.  THE EXPOSED WIRE IS A FIRE HAZARD.  *TR",
        "vin": "WBAVD53578A"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/04/2013",
        "dateOfIncident": "11/09/2010",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10550802,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AS AN EXAMPLE, WHEN ATTEMPTING TO ACCELERATE THE VEHICLE ONTO A  MOVING TRAFFIC SITUATION THE CAR HESITATES/LAGS/DELAYS BEFORE THE ENGINE CATCHES, THEN IT TAKES OFF LIKE A RABBIT WHEN YOU DON'T EXPECT IT. THIS VEHICLE BEHAVIOR HAS CAUSED NEAR MISS ACCIDENTS MORE THAN ONCE WHEN I WAS DRIVING.     IT'S NOT A DELAY WHICH DECREASES A TRANSIENT SURGE. IT INCREASES THE TRANSIENT SURGE AS THE CAR DOES NOT RESPOND TO THE THROTTLE FOR A HALF SECOND THEN BOLTS FORWARD WITH AN AWKWARD LURCH AND A SLAM. IT'S MUCH ROUGHER THAN A NORMAL TAKEOFF WOULD BE. IT'S NOT AT ALL SMOOTH. SOME HAVE DESCRIBED IT AS BEING REAR-ENDED. THE HAS BEEN HAPPENING SINCE I PURCHASED THE CAR IN NOVEMBER 2010    MANY BMW OWNERS HAVE REPORTED THE PROBLEM TO BMW AS I HAVE. THE ANSWER I GOT AS WELL AS MANY OTHERS FROM BMW WAS, \"IT'S NORMAL\".   *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/08/2013",
        "dateOfIncident": "08/06/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10534197,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3 SAV",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I BROUGHT MY CAR INTO THE DEALERSHIP BECAUSE IT STALLED AND THE CHECK ENGINE LIGHT CAME ON BRIEFLY AND SHUT OFF. THE CAR WAS ALSO HESITATING ON ACCELERATION. THE DEALER DETERMINED THE CAUSE WAS A NEEDED THERMOSTAT REPLACEMENT. HOWEVER, ONCE UNDER THE CAR, THE TECHNICIAN NOTED 3 OF 4 ENGINE MOUNT BOLTS WERE \"BROKEN\" AND NEEDED TO BE REPLACED. HE SAID IT WAS CONSIDERED \"WEAR AND TEAR\" AND WAS NOT COVERED UNDER WARRANTY EVEN THOUGH ONLY ONE BOLT WAS NOW HOLDING THE ENGINE FROM FALLING OUT. THIS REPAIR WOULD COST APPROXIMATELY $400. UPON INVESTIGATION, I NOTICED THIS WEBSITE: HTTP://WWW.BIMMERFEST.COM/FORUMS/SHOWTHREAD.PHP?T=528870 WHERE PEOPLE POST ABOUT THEIR BMWS. IT SEEMS THAT SEVERAL OTHERS HAVE HAD THIS SERIOUS PROBLEM AROUND THE SAME MILEAGE POINT WITH THE SAME MAKE AND MODEL, AND SEVERAL COMPLAINED THAT THE REPAIR WAS NOT COVERED UNDER WARRANTY, EVEN THOUGH IT APPEARS TO BE A MANUFACTURING DEFECT AS THE BOLTS ARE MADE OF ALUMINUM, NOT A STRONG MATERIAL, AND ONE THAT EASILY BREAKS.  *TR",
        "vin": "WBXPC93418W"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/08/2013",
        "dateOfIncident": "02/01/2011",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10534385,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL INJECTORS CONSTANTLY NEED REPLACEMENT EVERY 15,000 MILES OR SO.  ALL 6 WERE INITIALLY REPLACED ON RECALL AT 35,000 MILES AND THEN 3 MORE NEEDED REPLACEMENT 49,000 MILES.  NOW THE CAR HAS ABOUT 61,000 MILES AND NEEDS ANOTHER 3 REPLACED.  THIS IS OBVIOUSLY A PROBLEM WITH THE DESIGN OF THE FUEL INJECTION SYSTEM AND NEEDS TO BE RECALLED AGAIN OR WARRANTIED FOR AN EXTENDED PERIOD OF TIME.    SAFETY ISSUES ARE THAT WHEN YOU TRY TO ACCELERATE THE VEHICLE HESITATES PUTTING THE OCCUPANTS IN AN UNSAFE SITUATION.  MERGING INTO TRAFFIC OR TURNING ONTO A BUSY STREET CAN BE REALLY SCARY.  *TR",
        "vin": "WBAVB73558K"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/17/2013",
        "dateOfIncident": "12/27/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10525418,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY NAME IS ? AND I'M HAVING A SERIOUS PROBLEM GETTING MY CAR FIXED BY THE BMW DEALERSHIP SPECIFICALLY THE ONE LOCATED AT EDISON, NJ.  I'VE ALSO EXPERIENCED THE BRAKES NOT WORKING (2) WHEN THE CAR HAS BEEN DRIVEN IN BAD WEATHER, I.E. SNOW AND RAIN. BACK IN APRIL (4/11/2013) BMW CORPORATION A LETTER STATING THAT IF THE ABOVE PROBLEM AND OTHER PROBLEMS MENTIONED IN THERE LETTER WAS EVIDENT, I NEEDED TO STOP DRIVING IMMEDIATELY AND HAVE THE CAR SERVICED, WHICH I DID. WELL THE PROBLEM SUBSIDED FOR ABOUT A MONTH THEN STARTED UP AGAIN (THE PROBLEM IS MY CAR'S DASH BOARD WHILE DRIVING WILL GO COMPLETELY OR AS YOU'LL SEE IN THE ATTACHMENT PARTIALLY BLANK ON ME WHILE I'M DRIVING. WHEN IT GOES COMPLETELY BLANK THE CAR SHUTTERS AS IF IT WANTS TO TURN OFF).  I WASN'T ABLE TO MAKE IT BACK TO THE DEALERSHIP UNTIL AROUND 6/10/2013 TO COMPLAIN THAT THE ISSUE WAS STILL HAPPENING. ON OR AROUND THE 6/10/2013 DATE THIS SAME TECH RAN A DIAGNOSTIC ON MY CAR (WHICH I HAVE THE COPY OF). TO MAKE A VERY LONG STORY SHORT I RETURNED TO THE EDISON LOCATION TODAY 7/17/2013 AND TEXT THE SAME ATTACHMENT TO [XXX] MEMBERS OF THE BMW MANAGEMENT/SERVICE TEAM, TO MY AMAZEMENT I WAS TOLD THEY COULDN'T FIND A PROBLEM, EVEN THOUGH MANAGEMENT AGREED THAT VIA THE PICTURE THEIR WAS A PROBLEM. AT THIS POINT WHAT WILL IT TAKE TO FIND THE PROBLEM LISTED IN THE ABOVE ATTACHMENT? DEATH!!!!!!!...... THERE IS A BRAKE AND ELECTRICAL PROBLEM WITH MY CAR. JUST IN CASE ANYONE WANTS TO MAKE THE ASSUMPTION THAT IN SOME WAY I'M TRYING TO GET OVER, PLEASE REVIEW MY PAYMENT HISTORY, I PAY FOR MY CAR IN ADVANCE. THIS IS RIDICULOUS!!!! I'M FEARFUL TO DRIVE IN BAD WEATHER, AND I'M FEARFUL THAT IN THE MIST OF GETTING DRIVING DIRECTION FROM MY CAR'S GPS IT'S GOING TO BLACK OUT ON ME, LEAVING ME IN THE MIDDLE OF NOW-WHERE. THANK GOD THE TIMES IT HAS BLANKED OUT, I'VE BEEN ABLE TO FIGURE OUT WHERE TO GO.      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "WBAVC93578K"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "07/11/2013",
        "dateOfIncident": "07/03/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10524450,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN PUTTING ON MY SEAT BELT, THE BELT LOCKED WHEN PULLED OUT OF THE RETRACTOR. THE BELT WOULD NOT PULL OUT FAR ENOUGH TO FASTEN THE SEAT BELT. IT TOOK ABOUT 100 TRIES OF REELING THE BELT IN AND THEN GENTLY PULLING IT OUT TO GET THE SEAT BELT FASTENED. THE BMW DEALER SAYS THE UPPER BELT REEL AND THE COUPLER MECHANISM NEEDS TO BE REPLACED. *TR",
        "vin": "WBAWL73568P"
    },
    {
        "components": "SUSPENSION,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/12/2013",
        "dateOfIncident": "04/08/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10508062,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3 SAV",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT ABOUT 25 MPH ON RESIDENTIAL STREET, FELT AN UNUSUAL \"BUMP\", CONTINUED DRIVING HOME WITH NO APPARENT PROBLEM.  STARTED CAR NEXT MORNING AND FELT AN UNUSUAL VIBRATION AND NOISE WHICH DISAPPEARED WHEN DRIVING.  VIBRATION AT IDLE CONTINUED, TWO DAYS LATER, AFTER DRIVING ON FREEWAY, I FOUND A BROKEN BOLT UNDER THE CAR IN GARAGE, I IMMEDIATELY TOOK CAR TO DEALER SERVICE DEPARTMENT.  WAS TOLD THAT SEVERAL MOTOR MOUNT BOLTS HAD SHEARED AND WAS LUCKY NO SERIOUS DAMAGE OCCURRED.  QUICK INTERNET SEARCH INDICATED SHEARED MOTOR MOUNT BOLTS TO BE A PROBLEM WITH BMW X3 YEARS 2007 & 2008.  BROKEN MOTOR MOUNT BOLTS COULD RESULT IN SERIOUS ACCIDENT AND/OR INJURY - AGAIN, I WAS LUCKY.  *TR",
        "vin": "WBXPC93418W"
    },
    {
        "components": "STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "03/06/2013",
        "dateOfIncident": "03/06/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10501878,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3 SAV",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I LEFT MY CAR PARKED ON THE CORNER OF ELMHURST AVENUE AND ITHACA STREET IN ELMHURST, QUEENS NY. ANOTHER CAR BY THE LICENSE PLATE OF [XXX]  A VOLKSWAGEN WAS PARKED LITERALLY ON MY CAR. THERE WAS A CLEAR IMPACT AND THE CAR WAS LEFT LITERALLY TOUCHING THE BACK OF MY CAR. I HAVE PLENTY OF PICTURES AS EVIDENCE.      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "WBXPC93498W"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/19/2013",
        "dateOfIncident": "07/26/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10499301,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE HIGHWAY AT ABOUT 70 MILES AN HOUR WHEN THE ENGINE JUST SUDDENLY STOPPED.  WHILE THE CAR WAS SLOWING DOWN I HAVE TO PULL OVER AND RESTART THE CAR.  THEN AFTER DRIVING FOR ANOTHER 10 MIN  THE ENGINE STOPPED AGAIN THIS TIME I DIDN'T HAVE TIME TO PULL OVER AND STOPPED IN THE MIDDLE OF A HIGHWAY.  I HAVE TO KEEP TRYING BEFORE IT RESTARTED.   I STOPPED AT A GAS STATION AND WAS AFRAID TO DRIVE IT AGAIN.  FINALLY WITHOUT A CHOICE AFTER AN HOUR I STARTED THE CAR BACK UP AND WAS ABLE TO DRIVE BACK HOME.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/22/2013",
        "dateOfIncident": "01/22/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10493707,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AFFECTED STEERING, FAILING FRONT CONTROL ARM BUSHING.",
        "vin": "WBAVB73578P"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/03/2013",
        "dateOfIncident": "12/28/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10490933,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A CRACK IN THE RIM WHICH IS A MANUFACTURING DEFECT. THIS FINE CRACK CAUSES LOSS OF AIR PRESSURE IN THE TIRE. THE TIRE ITSELF IS INTACT AND UNDAMAGED AS IS THE RIM. BOTH TIRE AND RIM ARE ORIGINAL EQUIPMENT AND WERE ON THE VEHICLE AT THE TIME OF DELIVERY IN DEC. 2008. THE VEHICLE HAS NEVER BEEN INVOLVED IN AN ACCIDENT OR STRUCK ANY OBJECT WHICH COULD HAVE CAUSED THIS DEFECT.  SINCE THE MANUFACTURING DEFECT CAUSES LOSS OF AIR PRESSURE IN THE TIRE, THIS IS A SAFETY ISSUE. THE CRACK IN RIM WAS DIAGNOSED AFTER TWO VISITS BY DISCOUNT TIRE ON CERRILLOS ROAD IN SANTA FE, NM.  [XXX] AT BMW N.A. SUGGESTED I CONTACT THE DEALER TO FIND OUT WHO MANUFACTURED THE RIM AND THEN DEAL WITH THE RIM MANUFACTURER. HE SAYS THAT BMW ASSUMES NO RESPONSIBILITY FOR THEIR RIMS AND THAT RIMS ARE NOT COVERED BY THE VEHICLE WARRANTY. [XXX]. SAID HE COULD NOT TELL ME WHO MANUFACTURED THE RIM.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "WBAWB73568P"
    },
    {
        "components": "ELECTRICAL SYSTEM,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "07/22/2012",
        "dateOfIncident": "07/20/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10466934,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER EXITED CAR TO PUMP GAS. PASSENGERS REMAINED IN VEHICLE. GAS DOOR COULD NOT BE OPENED AS MAIN DOOR LOCK WAS ENGAGED (THOUGH DRIVERS DOOR WAS UNLOCKED). KEY FOB UNLOCK FUNCTION WOULD NOT WORK TO UNLOCK CAR / GAS CAP. DRIVER PUSHED KEY FOB BUTTONS TO ATTEMPT UNLOCK, DRIVERS DOOR BECAME LOCKED DURING THIS ACTIVITY. NOW NO DOORS COULD BE UNLOCKED. DUE TO FAILURE ALL DOORS EXPERIENCED \"2 PULL\" DOOR UNLOCK SYSTEM FAILURE, THIS \"2 PULL\" SYSTEM, THAT IS SUPPOSED TO ENSURE DOORS CAN BE OPENED FROM INSIDE IF LOCK IS ENGAGED APPARENTLY REQUIRE SAME POWER AS GENERAL LOCKING SYSTEM.    DRIVER COULD ONLY ENTER CAR BY USING EMERGENCY KEY AND UNLOCKING DRIVER'S DOOR. PASSENGER AND REAR DOORS REMAINED LOCK (AND ARE STILL LOCKED / INOPERABLE DUE TO SYSTEM FAILURE).    POWER FAILURE IN DOOR LOCK SYSTEM (OR OTHER ASSOCIATED FAULT) MADE DOOR OPERATION IMPOSSIBLE. ALL DOORS WERE COMPLETELY INOPERABLE FROM THE INSIDE. PASSENGERS COULD NOT EXIT VEHICLE AS DOORS WERE LOCKED AND HANDLES DID NOT WORK. DRIVER COULD NOT ENTER VEHICLE BY KEY FOB UNLOCK FUNCTION.    DRIVERS DOOR EXPERIENCED INTERMITTENT OPERATION UNTIL SOME KIND OF MANUAL OVERRIDE, OR SOME OTHER SYSTEM CHANGE, MADE DRIVERS DOOR FUNCTIONAL BY \"2 PULL\" DOOR UNLOCK / OPEN METHOD.    IF DRIVER HAD NOT BEEN PRESENT (IE: IN STORE PAYING FOR GAS OR FOR SOME OTHER REASON) PASSENGERS WOULD HAVE BEEN TRAPPED IN CAR.    IF ANY PASSENGER HAD BEEN PHYSICALLY DISABLED AND UNABLE TO CRAWL OUT OF CAR VIA DRIVERS DOOR THERE WOULD HAVE BEEN NO WAY FOR PASSENGER TO EXIT CAR !!!!!.    DOOR LOCK SYSTEM REMAINS INOPERABLE, PASSENGER AND REAR DOORS STILL LOCKED CLOSED WITH NO WAY TO OPEN THEM. *TR",
        "vin": "WBAVC53588F"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "06/25/2012",
        "dateOfIncident": "06/19/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10462930,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER SIDE FRONT DOOR WINDOW SHATTERED ON MY 2008 BMW 335XI WHILE THE  CAR IS PARKED ON A HOT DAY AT AROUND 96 DEGREES OUTDOORS.  THE GLASS IS COMPLETELY SHATTERED BUT HELD TOGETHER BY WINDOW TINT FILM.  THERE IS NO EVIDENCE OF IMPACT WITH ANY OBJECT OF ANY KIND ON THE GLASS OR SURROUNDING AREA.  THERE IS NO HOLES ON THE GLASS.  THIS IS OBVIOUS A CASE OF DEFECTIVE MATERIAL OF THE GLASS.  BMW DEALERSHIP DENIED WARRANTY COVERAGE, ALLEGING THERE IS A PIT ON THE GLASS THAT CAUSES THE BREAKAGE.  IF WHAT THE DEALERSHIP ALLEGED IS TRUE THEN IS THE WINDOW SUPPOSED TO FAIL COMPLETELY LIKE THIS WITH ONE PIT THAT WAS NOT VISIBLE TO ME?  OR IS THE PIT THE RESULT OF DEFECTIVE PRODUCTION OF THE GLASS? *TR",
        "vin": "WBAVD53578A"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/16/2012",
        "dateOfIncident": "04/12/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10455371,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3 SAV",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BMW X3. THE CONTACT STATED THAT WHILE DRIVING 60 MPH, THE LATCH UNDER THE STEERING WHEEL DISENGAGED AND CAUSED THE STEERING WHEEL TO MOVE UP AND DOWN. THE CONTACT WAS ABLE TO LOCK THE STEERING WHEEL BACK INTO PLACE AND MAINTAINED CONTROL OF THE VEHICLE. THE VEHICLE WAS NOT TAKEN TO THE DEALER. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGES WERE 52,000.  UPDATED 05/11/12*LJ  THE CONSUMER STATED SHE HAS AN APPOINTMENT SCHEDULED FOR JUNE 12, 2012. UPDATED 06/01/12",
        "vin": "WBXPC93438W"
    },
    {
        "components": "TIRES,WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/10/2012",
        "dateOfIncident": "04/06/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10454669,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3 SAV",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY VEHICLE WHEN ALL FOUR TIRES INDICATED A MAJOR MALFUNCTION OF TIRE PRESSURE WARNING.  I IMMEDIATELY WENT TO MY LOCAL AUTHORIZED DEALER WHERE IT WAS DISCOVERED THAT ALL 4 TIRES NEEDED TO BE REPLACED, THE 2ND TIME IN 2 YEARS, BECAUSE OF INTERIOR DETERIORATION FROM WITHIN THE TIRE WALLS.  IT WAS EXPLAINED TO ME THAT THE NITROGEN USED TO FILL THE TIRES, THAT ARE RUN FLATS, CAUSES THIS.  THE COST TO REPLACE EACH TIRE WAS $274.01.  MIND YOU THIS IS THE SECOND TIME IN 2 YEARS AND THE DEALER AND TIRE MANUFACTURER REFUSE TO RECTIFY THIS ISSUE AS WELL AS MAKE GOOD ON ANY WARRANTIES THAT ARE STILL IN AFFECT.  *TR",
        "vin": "WBXPC93408W"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/22/2012",
        "dateOfIncident": "03/17/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10452625,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN TRAVELLING ON HARLEM RIVER DRIVE MIDDLE LANE,  MY CAR ALL THE SUDDEN DISPLAYED AN ENGINE OVERHEAT LIGHT YELLOW THAT TURNED RED WITHIN 3 SECONDS AND STARTED LOSING POWER (FROM 50-60 MPH TO 1 MPH) WITHIN 5 SECONDS...THE CAR HAD TO BE TOWED TO THE NEAREST DEALERSHIP.    THIS IS AN EXTREMELY DANGEROUS SITUATION, AS I DID NOT HAVE ENOUGH WARNING TIME TO PULL TO THE SHOULDER. THE DEALERSHIP IS STATING THAT THIS IS A WATER PUMP FAILURE. I AM AWARE THAT THERE ARE RECALLS ON X5S BUT NOT ON MY CAR. MY FRIEND WHO OWNS THE SAME CAR AND YEAR HAD THE EXACT SAME PROBLEM RESULTING IN THE SAME COST OF REPAIR ($1600).     MY VEHICLE ALREADY HAS MANY RECALLS INCLUDING SEAT BELTS, AIR BAGS, AND HIGH PRESSURED FUEL PUMPS.    THIS SHOULD NOT HAPPEN TO A CAR THAT HAS BEEN MAINTAINED BY BMW AND JUST OUT OF WARRANTY (LESS THAN 60000 MILES). NOT EVEN 4 YEARS YET. I HAVE OWNED MANY BMWS AND OTHER CARS AND NEVER HAD A WATER PUMP FAILURE THAT CAUSED A DANGER OF THIS MAGNITUDE...    I WOULD APPRECIATE IF YOU WOULD INVESTIGATE THE SITUATION TO PREVENT THIS FROM HAPPENING TO OTHER OWNERS.  *TR",
        "vin": "WBAWC73518E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/20/2011",
        "dateOfIncident": "08/21/2009",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10436491,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 335I 2008 HAS HAD THREE RECALLS ALL RELATED TO THE FUEL SYSTEM. WITH 24,000 MILES IT NOW HAS ISSUES WITH STARTING.I RECENTLY HAVE TAKEN IT BACK TO MY DEALER,LEFT IT FOR FOUR DAYS, PICKED IT UP WITH \"CANNOT DUPLICATE CUSTOMER COMPLAINT\". IN LESS THAN A WEEK THE START UP HAS GONE FROM THREE TO FIVE UN,UN,UN,UN,UNS TO CRANK. THE CAR IS ABOUT TO GO OUT OF WARRANTY AND I BELIEVE THAT BMW KNOWS THERE ARE SERIOUS PROBLEMS AND IS REFUSING TO REPAIR UNTIL THEY ARE ABLE TO GET REPAIRS INCOME. I GUESS I SHOULD HAVE CANCELLED MY SPECIAL ORDER WHEN TWO WEEKS BEFORE DELIVERY THEY CALLED AND SAID MY CAR HAD ARRIVED IN US BUT WOULD NOT BE RELEASED DUE TO \"ENGINE COMPRESSION PROBLEMS\". ALL OTHER ISSUES I HAVE ASKED TO BE REPAIRED ARE NOT WITH DEALER NOTING \"CANNOT DUPLICATE CUSTOMER COMPLAINT\". AN ACCIDENT WAITING TO HAPPEN. I HAVE CALLED AND EMAILED BMW AND DEALER NO ONE RESPONDED. AND LET'S NOT EVEN GET TO THE TIRES!  *TR",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "02/27/2011",
        "dateOfIncident": "02/21/2011",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10384670,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "TURANZA EL42",
                "productYear": "9999",
                "size": "P205/55R16",
                "type": "Tire"
            }
        ],
        "summary": "SERIOUS PROBLEM, I CAN NOT DRIVE AND CAN NOT REPLACE BLOWOUT, BROKEN RUN FLAT TIRES FROM BRIDGESTONE ON MY '08 BMW 328I.  IT'S THE 4TH WARRANTY COVERAGE REPLACEMENT IN 6MONTHS BUT THIS TIME IT IS OUT OF STOCK AT MY COSTCO TIRE WHERE I PURCHASED THEM AND WAS TOLD BY THE MAKER, BRIDGESTONE TIRES THAT THERE'S 18,000+ BACKORDERS ON THESE TIRES AND THEY HAVE NO IDEA ON ETA. *TR",
        "vin": "WBAVA37538N"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/23/2011",
        "dateOfIncident": "01/23/2011",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10378357,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 BMW 328I STALLS WHILE DRIVING.  ONCE STALLED UNDER POWER AS I WAS MAKING A LEFT TURN ACROSS TRAFFIC - DEALER SAID NO CODE WAS THROWN SO THEY WERE UNABLE TO ADDRESS.  THE OTHER STALLS HAVE NOT DURING SLOWDOWN PERIOD, NOT AS CRITICAL BUT THEY COME WITH NO WARNING WHATSOEVER WHICH IS DANGEROUS!   NO ACCIDENT FROM IT YET BUT I NO LONGER FEEL SAFE DRIVING THIS CAR.  FIRST OCCURRENCE IN 2010, TWO MORE RECENTLY DEC 2010 & JAN 2011. *LN",
        "vin": ""
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "11/01/2010",
        "dateOfIncident": "10/23/2010",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10363520,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 BMW 320I. THE CONTACT STATED THAT THE ELECTRONIC KEYS FAILED AND PASSENGER SIDE DOORS WOULD NOT LOCK; THE DRIVER SIDE DOOR WAS THE ONLY ONE TO UNLOCK. THE PASSENGERS HAD TO EXIT FROM THE DRIVER SIDE. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHERE THE VEHICLE WAS REPAIRED (REPAIRS WERE UNKNOWN) UNDER WARRANTY. THE MANUFACTURER HAD NOT BEEN NOTIFIED. THE FAILURE MILEAGE WAS APPROXIMATELY 20,000.",
        "vin": "WBAVA37538N"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/26/2010",
        "dateOfIncident": "10/23/2010",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10362405,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2008 BMW 328I, STILL UNDER FACTORY WARRANTY, REQUIRED A NEW BATTERY.  I WAS DENIED WARRANTY/MAINTENANCE COVERAGE FOR THE BATTERY DUE TO MY 'DRIVING PROFILE' - I DROVE MORE THAN 100 TRIPS OF LESS THAN 5KM IN THE LAST 36 DAYS.  HOWEVER, I DROVE A TOTAL OF 2420 MILES IN THE LAST 32 DAYS, AS INDICATED ON TWO CAR REPAIR RECEIPTS.  BMWNA STATED THAT DUE TO ME DRIVING SUCH SHORT DISTANCES, THE BATTERY WAS UNABLE TO CHARGE PROPERLY.  THIS SOUNDS LIKE AN ENGINEERING DEFECT, NOT A DRIVER-RELATED ISSUE. *TR",
        "vin": "WBAVA33578K"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/03/2010",
        "dateOfIncident": "07/01/2010",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10347033,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3 SAV",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE IS A BMW X3 3.0SI.  WHEN THE VEHICLE IS IN FIRST GEAR, THERE IS A SEVERE HESITATION IN THE TRANSMISSION.  WHEN YOU TRY TO ACCELERATE, THE TRANSMISSION \"THINKS\" ABOUT WHAT GEAR IT SHOULD BE IN.  THE VEHICLE HESITATES, STALLS SLIGHTLY, AND CREEPS ALONG SLOWLY BEFORE SECOND GEAR CATCHES.  THE RPMS ARE ERRATIC WHEN ACCELERATING.  VERY UNPREDICTABLE WHEN TRYING TO ACCELERATE.  THE HESITATION IS THE MAIN ISSUE, ESPECIALLY WHEN TRYING TO PULL OUT OF AN INTERSECTION ACROSS TRAFFIC. IT CAN BECOME A VERY SCARY SITUATION WHEN YOU WANT TO ACCELERATE AND NOTHING HAPPENS.       THIS IS AN ONGOING PROBLEM.  NOTHING IN PARTICULAR CAUSES IT TO HAPPEN BESIDES REGULAR ACCELERATION.  THE PROBLEM IS INTERMITTENT AND MAY DISAPPEAR WHILE DRIVING.  HOWEVER, IT WILL APPEAR AGAIN FOR NO REAL REASON.    A SOFTWARE UPDATE WAS PERFORMED IN MID-JULY.  THE PROBLEM WAS STILL NOTICEABLE.  ON AUGUST 3RD, THE VEHICLE WAS ONCE AGAIN BROUGHT IN FOR SERVICE WORK.  THE SERVICE MANAGER CAME ALONG FOR THE DRIVE AND NOTICED THE TRANSMISSION PROBLEM.  ANOTHER 2008 BMW X3 THAT WAS ON THE LOT WAS DRIVEN UNDER THE SAME DRIVING CONDITIONS. THE SAME ISSUES WITH THE TRANSMISSION WERE NOTED.  HE TOLD ME THAT THEY WILL CONTACT BMW TO SEE IF THERE ARE ANY SERVICE BULLETINS ON HOW TO CORRECT THE PROBLEM, BUT WAS UNAWARE OF ANY FIX CURRENTLY AVAILABLE.      AFTER TWO SERVICE CALLS THE PROBLEM STILL PERSISTS WITHOUT ANY FIX AS OF YET. *TR",
        "vin": "WBXPC93418W"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/19/2010",
        "dateOfIncident": "06/18/2010",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10339148,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON MOUNTING NEW TIRES ON MY 2008 BMW 328I CONVERTIBLE (W/ SPORT PKG) AT BIG O TIRES IN DANVILLE, CA, THE TECHNICIANS INFORMED ME THAT BOTH OF MY REAR WHEELS WERE CRACKED, AND THEY COULD NOT MOUNT THE NEW TIRES ON THE VEHICLE.  UPON INSPECTION AT BMW OF SAN FRANCISCO, MY SERVICE ADVISOR TOLD ME THAT IT WAS IN THEIR OPINION THAT AN \"IMPACT\" FROM A POTHOLE OR OTHER IRREGULAR ROAD SURFACE CAUSED THE CRACKS IN BOTH REAR WHEELS AND THAT WARRANTY COVERAGE IS DENIED.  UPON MY OWN INVESTIGATION, I FOUND SEVERAL OTHER BMW CUSTOMERS DESCRIBE A SIMILAR CONCERN ON WWW.BIMMERFEST.COM, AS WELL AS AN INVESTIGATION PERFORMED BY THE BBC IN OCTOBER OF 2009.  FOR BBC'S ARTICLE, PLEASE REFER TO HTTP://WWW.BBC.CO.UK/BLOGS/WATCHDOG/2009/10/BMW_ALLOY_WHEELS.HTML . *TR",
        "vin": "WBAWR33558P"
    },
    {
        "components": "ELECTRICAL SYSTEM,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "05/11/2010",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10329633,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 BMW 328I. CONSUMER STATES WHEN POWER IS LOST TO THE DOORS, FOR ANY REASON, THE PASSENGER DOORS REMAIN LOCKED WITH NO WAY TO OPEN THEM FROM THE INSIDE OR THE OUTSIDE OF THE VEHICLE *TGW  THE DRIVER'S SIDE DOOR OPENED FROM THE INSIDE WHEN THE HANDLE WAS PULLED. *JB",
        "vin": ""
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "05/04/2010",
        "dateOfIncident": "05/03/2010",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10328882,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 BMW, ELECTRONIC DOOR LOCKS STUCK IN LOCKED POSITION, MUST OPEN DRIVER SIDE DOOR WITH VALET KEY.  REMAINING DOORS STUCK IN LOCKED POSITION, MAKING IT IMPOSSIBLE FOR PASSENGERS TO LEAVE VEHICLE IN AN EMERGENCY SITUATION.  RELATED PROBLEM IS THAT GAS CAP (WHICH LOCKS WHEN DOORS ARE LOCKED) WILL ALSO NOT OPEN. *TR",
        "vin": "WBAVA33538K"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/27/2010",
        "dateOfIncident": "03/15/2009",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10314764,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3 SAV",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "OWN A 2008 BMW X3 3.0 SI AWD.  WE HAD AN ENGINE CRANKING ISSUE AND TOOK TO VEHICLE TO DEALER TO HAVE TSB SERVICE BULLETIN NUMBER : SIB-12-17-07/NHTSA ITEM NUMBER : 10028464 PERFORMED.  SINCE THIS WAS PERFORMED, THERE IS VERY POOR THROTTLE RESPONSE IN THE NORMAL TRANSMISSION MODE.  THE TRANSMISSION WILL STALL TO ENGAGE WITH VERY ERRATIC AND HARD UP AND DOWN SHIFTS.  THE CONCERN IS WITH THE DELAY IN THROTTLE RESPONSE WHEN PULLING INTO TRAFFIC, WHEN YOU GIVE IT THROTTLE, IT IS DELAYED TO RESPOND, PRESENTING A TRUE SAFETY CONCERN.  THE VEHICLE HAS BEEN BACK TO THE DEALER 2 TO 3 TIMES SINCE WITH NO RESOLUTION.  BMW NORTH AMERICA WAS CONTACTED AND THEY SIMPLY REFERRED ME BACK TO THE DEALER.  SPOKE WITH THE DEALER THIS WEEK AND THERE IS STILL NO RESOLUTION AS THEY SAY THEY ARE STILL WAITING ON NEW COMPUTER PROGRAMMING; HOWEVER, THEY HAVE 3 OTHER X3S IN THIS DEALERSHIP WITH THE SAME CONCERN.  MY FEAR IS THAT WHEN MY WIFE IS PULLING INTO TRAFFIC THAT THE VEHICLE WILL BE DELAYED IN THROTTLE RESPONSE AND A CRASH MAY RESULT.  BMW HAS AN ISSUE WITH THIS IN LOOKING AT THE BIMMERFEST.COM BLOG AS THERE ARE NUMEROUS COMPLAINTS OF THE SAME ISSUE ON THIS SITE. *TR",
        "vin": "WBXPC93448W"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/24/2010",
        "dateOfIncident": "03/15/2008",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10313845,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THREE OCCASIONS SINCE I PURCHASED THIS VEHICLE NEW, WHILE DRIVING AND ACCELERATING THE ENGINE CUTS OUT AND RPM'S SUDDENLY DROP.  THE DATE REFERENCED BELOW WAS THE FIRST TIME THIS HAPPENED. THIS HAS HAPPENED TWICE SINCE THEN. I HAVE TAKEN THE VEHICLE IN ALL THREE TIMES. THEY CHANGED SOME PARTS, BUT THIS CONTINUES TO HAPPEN. AT ONE TIME, I WAS TRY TO GET THROUGH AN INTERSECTION WITH ONCOMING TRAFFIC, ALTHOUGH THERE WAS NOT AN ACCIDENT, IT WAS SCARY. ANOTHER TIME WAS CHANGING LANES ON A HIGHWAY. THIS SEEMS TO BE INTERMITTENT PROBLEM. *TR",
        "vin": "WBAWL73538P"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/05/2010",
        "dateOfIncident": "01/06/2009",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10306300,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3 SAV",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BMW X3 2008 WAS 'BOUGHT BACK' BY BMW AFTER THREE MONTHS OF OWNERSHIP IN DEC 2008 DUE TO A PROBLEM WITH THE TRANSMISSION. THE TRANSMISSION WOULD NOT RESPOND WHEN DEPRESSING THE ACCELERATOR AT RANDOM TIMES. IT HAPPENED ONCE AFTER PULLING AWAY FROM AN EZPASS BOOTH - THE CAR JUST FROZE AND WOULD NOT ACCELERATE NEARLY CAUSING AN ACCIDENT.  THIS WAS SO SERIOUS THAT BMW RECOGNIZED IT AS A PROBLEM BUT COULD NOT FIX IT DESPITE REPLACING MAJOR TRANSMISSION PARTS. THEY ASSURED ME IT WAS NOT A GENERAL PROBLEM IN X3'S SO I ALLOWED THEM TO REPLACE THE 2008 X3 WITH A 2009 MODEL. LESS THAN 1000 MILES AND ONE MONTH LATER THE 2009 STARTED EXHIBITING THE SAME PROBLEMS. THIS TIME BMW WOULD NOT REMEDY THE SITUATION INSTEAD DENYING THERE WAS A PROBLEM WITH THE CAR. THE MATTER IS CURRENTLY WITH MY  LEMON LAW LAWYERS AND BMW. HERE IS A LINK TO A BLOG THAT SHOWS MANY BMW X3 OWNERS HAVE THE PROBLEM - SOME HAVE HAD THEIR CARS REPLACED BY BMW AND OTHERS HAVE BEEN IGNORED. THIS IS A SERIOUS SAFETY ISSUE THAT IS BEING IGNORED BY THE MANUFACTURER (SIMILAR TO THE TOYOTA ISSUE). PLEASE INVESTIGATE BEFORE SOMEONE GETS KILLED.  HTTP://WWW.BIMMERFEST.COM/FORUMS/SHOWTHREAD.PHP?T=262130. *TR",
        "vin": "WBXPC93409W"
    },
    {
        "components": "TIRES,WHEELS",
        "crash": false,
        "dateComplaintFiled": "11/18/2009",
        "dateOfIncident": "11/02/2009",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10292819,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "CONTINENTAL RUN FLAT TIRES NEW WITH NEW 328I BMW SEDAN PURCHASED IN 2008 HAD TREAD WORN DOWN AFTER 8100 MILES, AS NOTICED WHEN VEHICLE WAS BROUGHT IN FOR SERVICING. TIRES WERE REPLACED BY DEALER. RESEARCH ON THE WEB SHOWED A LARGE NUMBER OF INDIVIDUALS REPORTING SIMILAR PROBLEMS:  HTTP://WWW.BMWRUNFLATTIRE.COM;   HTTP://FORUMS.AUTOMOTIVE.COM/70/6318820/BMW/BMW-RUN-FLAT-TIRES/INDEX.HTML. *TR",
        "vin": "WBAVA37518N"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/02/2009",
        "dateOfIncident": "03/28/2009",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10263943,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE 08 BMW M3 WITH THE DCT TRANSMISSION STALLS IN 2ND GEAR WHEN GOING AROUND TURNS CAUSING NEAR COLLISIONS. BMW HAS NOT FIXED THIS PROBLEM AS OF YET. *TR",
        "vin": ""
    },
    {
        "components": "PARKING BRAKE",
        "crash": false,
        "dateComplaintFiled": "03/31/2009",
        "dateOfIncident": "03/27/2009",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10263719,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON FREEWAY IN DOWNTOWN LOS ANGELES, THE REAR END OF THE VEHICLE BEGAN MAKING INTERMITTENT NOISES AND SHAKING. ALL OF A SUDDEN THERE WAS A LOUD BAND COMING FROM THE REAR END AND THE VEHICLE IMMEDIATELY BEGAN TO SLOW (IN HEAVY LOS ANGELES TRAFFIC). I WAS ABLE TO GET THE VEHICLE OFF OF THE FREEWAY AND PULLED TO THE SIDE OF THE ROAD. THE VEHICLE WOULD ONLY PULL FORWARD OR BACKWARD FOR A FEW FEET BEFORE STOPPING. THE CAR WAS TOWED TO THE DEALERSHIP, STEVE THOMAS BMW IN CAMARILLO, CA. THIS HAPPENED ON FRIDAY. WHEN THEY FINALLY GOT AROUND TO EXAMINING THE VEHICLE ON MONDAY, THEY SAID IT WASN'T COVERED UNDER WARRANTY AS THE REAR BREAKS HAD DISINTEGRATED FROM THE EMERGENCY BRAKE BEING ON. THEY ACCUSED ME OF DRIVING THE VEHICLE WITH THE EMERGENCY BRAKE ON. I NEVER USE THE EMERGENCY BRAKE AND AM THE ONLY DRIVER OF THE VEHICLE. THE CAR IS 5 MONTHS OLD AND HAS ONLY 5000 MILES ON IT. I TOLD SERVICE WRITER THAT EMERGENCY BRAKE IS NEVER USED AND EVEN IF IT HAD BEEN, THERE WOULD HAVE BEEN A SIGNAL AND SOUND WARNING. HE SAID HE CHECKED WARNING LIGHT AND SOUND AND IT WAS WORKING. STILL ACCUSED ME OF DRIVING WITH EMERGENCY BRAKE ON. THERE IS SOMETHING FAULTY WITH THE EMERGENCY BRAKE THAT CAUSED THIS. *TR",
        "vin": "WBAVA37588N"
    },
    {
        "components": "TIRES,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "02/10/2009",
        "dateOfIncident": "01/29/2009",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10258206,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "POTENZA",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            },
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "82110393954",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "A LITTLE WHILE BACK AN ERROR MESSAGE CAME UP ON THE DASHBOARD OF MY CAR SAYING THERE WAS A MALFUNCTION WITH THE TIRE PRESSURE MONITOR. NOT LONG AFTER, I LEFT MY OFFICE ONE NIGHT; I GET IN MY CAR WITH MY COWORKER AND BEGIN DRIVING. AS I DROVE WE BOTH HEARD A SCREECHING NOISE FROM MY CAR AND THE CAR WAS STRUGGLING TO ACCELERATE, CARS BEHIND ME BEGIN TO HONK AND DRIVE AROUND ME LEAVING ME IN A VERY DANGEROUS SITUATION WHERE A CAR MAY HIT ME OR MY CAR. I WAS STUCK IN THE MIDDLE OF TRAFFIC WITH MY CAR ALMOST COMPLETELY DISABLED. THE NEXT DAY I HAD THE CAR PICKED UP FROM MY HOME AND DROPPED OFF BY A SERVICE CENTER. THEY CALL ME A COUPLE OF DAYS LATER SAYING THERE WAS DAMAGE DONE TO ALL THE TIRES OF THE CAR AND THE PRESSURE MONITOR FOR THE TIRES. THE TIRES FOR THIS CAR ARE SPECIAL TIRES WITH PRESSURE MONITORS TO INDICATE WHEN THEY ARE LOW ON PRESSURE OR FLAT. I'VE ONLY PUT 6500 MILES ON THE CAR AND DRIVEN IT WITH A LOT OF CARE UNDER NORMAL CONDITIONS. THE SERVICE CENTER IS SAYING I INFLICTED THE DAMAGE AND THEY WANT ME TO PAY FOR IT. I HAD BEGUN SPEAKING WITH FRIENDS WHO HAVE THE SAME CAR AND THEY ALL SAID THEY ARE EXPERIENCING THE SAME PROBLEM. PLEASE LOOK INTO THE SITUATION AND RESPOND AS SOON AS POSSIBLE. THIS CAN BE VERY DANGEROUS. *TR",
        "vin": "WBAWL13578P"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/20/2008",
        "dateOfIncident": "11/12/2008",
        "fire": true,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10252352,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "GO HERE FOR THE ENTIRE STORY: WWW.BMWFIRE.COM    I PURCHASED A BRAND NEW 2008 BMW 328I FOR $38,000 FROM SONNEN BMW IN SAN RAFAEL, CALIFORNIA. THE CAR HAD A SERIOUS MANUFACTURERS DEFECT THAT CAUSED AN ELECTRICAL FIRE AND RESULTED IN MY CAR BEING TOTALED. I HAD MULTIPLE ISSUES WITH THE FRONT PASSENGERS SIDE FOG LIGHT FALLING OUT OF ITS CASING INTO THE LOWER CORNER OF THE BUMPER WHICH CAUSED THREE SEPARATE FIRES. BMW HAS REFUSED TO REPLACE MY VEHICLE THAT HAD 11,500 MILES AND IS COVERED UNDER WARRANTY.    AT THE END OF JUNE 2008 I FIRST REALIZED THIS PROBLEM HAPPENED UPON A CLOSER INSPECTION OF THE EXTERIOR OF THE CAR. I BROUGHT THE CAR RIGHT AWAY TO SONNEN BMW'S SERVICE DEPARTMENT, AS I WAS WORRIED ABOUT THE SAFETY OF THE VEHICLE. I SHOWED THEM WHAT HAPPENED, BUT THEY TOLD ME THAT THEY HAD NO AVAILABLE APPOINTMENTS UNTIL TWO WEEKS OUT AND THAT MY CAR WAS SAFE TO DRIVE. TWO WEEKS LATER I BROUGHT MY VEHICLE TO SONNEN'S SERVICE DEPARTMENT, THEY \"VERIFIED THE DEFECT\" AS STATED IN THEIR SERVICE RECORDS. THEY REPLACED THE COMPLETE FRONT BUMPER AND SUPPOSEDLY RE SECURED THE FOGLIGHT. ALL OF THIS WAS COVERED UNDER BMW'S WARRANTY AS IT WAS A MANUFACTURES DEFECT. I ASKED TOM MURTHA (MY SERVICE ADVISOR) WHY THIS HAD HAPPENED, HE TOLD THAT BECAUSE THERE WAS ABSOLUTELY NO IMPACT DAMAGE, THE ONLY WAY THIS COULD HAVE OCCURRED WAS A MISTAKE WHEN BUILDING THE VEHICLE AT THE FACTORY.    I THOUGHT ALL OF MY PROBLEMS WERE SOLVED UNTIL A FOGGY DAY IN SAN FRANCISCO, CALIFORNIA. ON OCTOBER 25TH, 2008 AT APPROXIMATELY 4:00 PM. WHILE WAITING AT A STOPLIGHT I TURNED ON MY FOG LIGHTS AT THE INTERSECTION OF FRONT & BROADWAY (ASSUMING THAT THE FOGLIGHT HAD BEEN SECURED). IT WAS FOGGY OUT AND MY PASSENGER AND I COULD NOT SEE THE SMOKE THAT WAS COMING FROM THE PASSENGER SIDE FOG LIGHT BECAUSE OF A SMALL FIRE IT CAUSED. I WAS MADE AWARE OF THIS WHEN A PEDESTRIAN WALKED UP TO MY CAR AND ALERTED ME THAT THERE WAS A FIRE. I PULLED OVER RIGHT AWAY AND I DUMPED THE CONTENTS OF A LARGE WATER BOTTLE ON THE FLAME. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/14/2008",
        "dateOfIncident": "09/10/2008",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10242095,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "3 SERIES",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOOK THE VEHICLE FOR THE FOLLOWING SYMPTOMS:    1.) LONG(ER) CRANK  2.) ENGINE MALFUNCTION, REDUCED POWER  3.) SERVICE ENGINE SOON  4.) HEAVY, ERRATIC SHAKING AND SHUDDERING  5.) ENGINE SOUNDED LIKE A UNION PACIFIC TRAIN WITH LOUD PUMPING SOUND  6.) BECAUSE OF 4 + 5, DECIDE TO TURN-OFF THE ENGINE OR SOMETIMES IT JUST STALLS BEFORE  7.) AFTER RESET, THE CAR BECOMES DRIVABLE BUT SYMPTOMS WILL REOCCUR.  8.) ABLE TO RECREATE PROBLEM WHEN I MASH THE GAS    AFTER DOING SOME RESEARCH ON AN AUTO FORUM, I SUSPECTED THAT THE CAUSED OF THE PROBLEM WAS A FAILING HIGH PRESSURE FUEL PUMP.  THE DEALERSHIP KEPT THE CAR FOR 3 DAYS TO RUN SOME TESTS AND CONCLUDED THAT THE FUEL PUMP WAS THE PROBLEM.  SINCE THEY REPLACE THE PART, THE CAR HAS NOT BROKEN DOWN AGAIN.  HOWEVER, THEY INTRODUCE ANOTHER PROBLEMS. 1) THE CAR'S EXHAUST NOISE IS MUCH LOUDER NOW 2) THE CAR IS LESS FUEL EFFICIENT, LOWER MILES PER GALLON 3) THE CAR NOW HAS A TURBO LAG WHICH WAS PREVIOUSLY NON-EXISTENT.  THIS MEANS BMW IS FALSELY ADVERTISING THE 335I TWIN-TURBO HAS ZERO LAG.  THIS WAS TRUE BEFORE THEY UPDATED THE CAR'S SOFTWARE BUT IS NOT LONGER TRUE AT THIS MOMENT IN TIME.  *TR",
        "vin": "WBAWB735X8P"
    }
]