[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/01/2016",
        "dateOfIncident": "04/15/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10910909,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING DOWN THE FREEWAY THE FORWARD DRIVE SHAFT UNIVERSAL JOINT FAILED, LOCKING THE REAR WHEEL. THE SPINNING FORWARD END OF THE UNCONSTRAINED DRIVE SHAFT DAMAGED THE SWING ARM.",
        "vin": "WB103130X8Z"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/02/2015",
        "dateOfIncident": "07/05/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10760928,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELLING AT THE SPEED LIMIT ON THE LEFT LANE IN BUSY TRAFFIC, THE MOTORCYCLE QUIT AS IF I HAD SHUT OFF THE KEY.  I HAD TO MANEUVER THROUGH 4 LANES OF TRAFFIC TO GET TO THE SHOULDER.  I BELIEVE THAT THE FUEL LEVEL INDICATOR SHUT THE BIKE OFF EVEN THOUGH THERE WAS FUEL IN THE TANK.  ONCE STOPPED, THE BIKE STARTED AGAIN AND RAN NORMALLY.      I BELIEVE THAT THE FUEL LEVEL INDICATOR CAN INTERRUPT ENGINE OPERATION WHEN IT GETS TO A POINT OF ZERO RANGE, EVEN THOUGH THE BIKE HAS ADEQUATE FUEL IN THE TANK.  I HAVE ASKED BMW TO VERIFY THIS AND THEY WILL NOT.  OWNERS SHOULD BE ADVISED THAT THIS CAN HAPPEN AS I NARROWLY AVOIDED A SERIOUS ACCIDENT. IF IT CANNOT HAPPEN, THEN I NEED TO LOOK WHAT DID HAPPEN.      BMW RECOMMENDS THAT I TALK TO THE DEALER, BUT HE HAS ALREADY TOLD ME THAT HE CANNOT ANSWER THE QUESTION.   THEY HAVE ALSO OFFERED TO SEND A REP TO LOOK AT THE BIKE, BUT AS CUSTOMERS, WE NEED TO KNOW IF THIS CAN HAPPEN AND BE WARNED ABOUT IT SO WE KNOW WHAT TO DO. THE DEALER DID REPLACE THE FUEL STRIP AND SINCE THEN THE FUEL STRIP HAS BEEN REPLACED TWO MORE TIMES, AND IS NOW INOPERABLE.      BMW NEEDS TO ANSWER MY QUESTION BECAUSE IF THE FUEL STRIP CAN INTERRUPT ENGINE OPERATION BMW OWNERS NEED TO KNOW.  WITHOUT KNOWING THIS, IT IS A SERIOUS SAFETY ISSUE WHICH EASILY COULD HAVE RESULTED IN A FATALITY WHICH PROBABLY WOULD HAVE BEEN ATTRIBUTED TO OPERATOR ERROR.",
        "vin": "WB10313028Z"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/09/2015",
        "dateOfIncident": "10/17/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10705717,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "2008 R 1200GS MOTORCYCLE WITH 9218 MILES ON THE ODOMETER. BRAKE FAILURE LIGHT RECENTLY STARTED COMING ON (SOLID) OCCASIONALLY. *BF     UPDATED 10/05/2017*CN",
        "vin": "WB10313038Z"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/14/2014",
        "dateOfIncident": "04/06/2011",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10644654,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THE MOTORCYCLE NEW FROM VALLEY CYCLE & MOTORSPORTS IN BAKERSFIELD, CA ON 6/23/08.  DURING THE 18,000 MILE SERVICE ON 04/06/11 (ODO: 17,732) , BMW OF SANTA CRUZ, CA SERVICE TECHNICIAN NOTICED REAR SHOCK STRUT WAS LEAKING OIL AND ORDERED A REPLACEMENT. ON 06/28/11 (ODO: 21,500) VALLEY CYCLE & MOTORSPORTS, CA INSTALLED THE REPLACEMENT SHOCK STRUT UNDER WARRANTY.   ON 9/12/14 (ODO: 38,768) WHILST ON AN EXTENDED MOTORCYCLE VACATION THE REPLACEMENT REAR SHOCK STRUT STARTED LEAKING, SPEWING OIL ON THE BACK TIRE CREATING A DANGEROUS CONDITION. I IMMEDIATELY RODE IT TO BMW OF SANTA FE, NM TO DOCUMENT THE LEAKAGE AND THEY AGREED IT NEEDED TO BE REPLACED AND ADVISED ME TO RIDE IT TO VALLEY CYCLE AND MOTORSPORTS IN BAKERSFIELD, CA WHERE I BOUGHT IT. VALLEY CYCLE BMW TECH. EXAMINED THE SHOCK STRUT (ALL THE OIL HAD LEAKED OUT OF IT AT THIS TIME) AND SAID HE'D OPEN A PUMA? CASE WITH BMW TO SEE IF THEY'D HONOR ANOTHER REPLACEMENT. HE ADVISED ME TO ALSO CONTACT BMW CUSTOMER SERVICE FOR A RESOLUTION. I SENT VALLEY CYCLE DATE-STAMPED PHOTOS OF THE LEAKING SHOCK STRUT TO FORWARD TO BMW WHICH THEY DID.  ON 10/7/14 \"GRANT\" FROM BMW CUSTOMER SERVICE CALLED AND SAID BMW HAD DENIED THE CASE AND WOULD NOT BE ABLE TO ASSIST WITH THE REPLACEMENT OF THE SHOCK STRUT EVEN THOUGH THIS WAS THE SECOND (2ND) ONE THAT HAD FAILED IN 35,000 MILES.   THE FIRST SHOCK FAILED AT 17,732 MILES, THE SECOND SHOCK FAILED AFTER 17,268 MILES. THESE ESA SHOCK STRUTS COST OVER $2,000 EACH (EXCLUDING LABOR) AND I BELIEVE THAT COMPETE FAILURE AT THAT MILEAGE DURING SOLO STREET RIDING,IS UNACCEPTABLE, ESPECIALLY SINCE THIS MOTORCYCLE IS DESIGNED AS A \"DUAL-SPORT\" MOTORCYCLE CAPABLE OF OFF-ROAD TRAVEL.   FURTHER, THE FACT THAT WHEN THEY FAIL, OIL LEAKS OUT OF THE SHOCK AND ONTO THE REAR WHEEL CAUSING AN EXTREMELY DANGEROUS CONDITION.   I HAVE SEEN NUMEROUS COMPLAINTS ABOUT THIS SAME CONDITION ON LINE.  *TR",
        "vin": "WB10313028Z"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/04/2014",
        "dateOfIncident": "08/17/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10630849,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 17 AUGUST 2014 AT NEWCOMB'S RANCH IN THE ANGELES NATIONAL FOREST EAST OF LOS ANGELES AT APPROXIMATELY 10:15 AM I DISCOVERED THAT THE IGNITION SWITCH DETENT MECHANISM HAD FAILED ON MY 2008 BMW R1200GS MOTORCYCLE. I WAS ABLE TO FREELY ROTATE THE IGNITION KEY BETWEEN ON AND OFF, SO THAT THE SLIGHTEST TORQUE FROM A KEY FOB OR WIND COULD TURN THE KEY TO OFF, WHICH WOULD SHUT THE ENGINE AND ALL ELECTRICAL SYSTEMS OFF, PERHAPS UNEXPECTEDLY DURING OPERATION OF THE VEHICLE. THE FAILED IGNITION SWITCH DETENT CONDITION APPARENTLY OCCURRED DURING MY ONE HOUR RIDE ON L.A. FREEWAYS AND CA 2 TO NEWCOMB'S RANCH. A FELLOW RIDER AT NEWCOMB'S ON A BMW K1200S INDICATED THAT HIS MOTORCYCLE HAD THE EXACT SAME PROBLEM (FAILED IGNITION SWITCH DETENT), AND THAT HE RODE WITH THE KEY FOB REMOVED. I RODE HOME WITH TWO BAR STRAWS TIED BETWEEN THE KEY AND THE HANDLEBAR CLAMPS. FURTHER INSPECTION REVEALED A MISSING METAL RETAINING PLUG IN A HORIZONTAL HOLE IN THE FRONT OF THE STEERING LOCK HOUSING, AND A SPRING STILL IN THE HOLE. BMW MOTORCYCLES OF LONG BEACH REPLACED MY DEFECTIVE STEERING LOCK HOUSING (BMW PART # 51257700072) AND THE IGNITION SWITCH DETENT MECHANISM NOW FUNCTIONS PROPERLY, ALTHOUGH THE NEW PART SEEMS TO BE OF THE EXACT SAME DESIGN AS THE DEFECTIVE PART. IN 2008 MY R1200GS HAD ITS IGNITION RING ANTENNA REPLACED UNDER RECALL. WHILE AT LONG BEACH BMW MOTORCYCLES, THE TECHNICIAN MENTIONED TO ME THAT DURING AN DURING AN ANTENNA RING SERVICE THAT HE PERFORMED SOME YEARS AGO, THE SAME RETAINING PLUG FOR THE IGNITION SWITCH DETENT SPRING POPPED OUT WHILE REMOVING THE STEERING LOCK HOUSING. ACCORDING TO BMW, PART # 51257700072 IS USED ON 6 MODELS AND 161 VEHICLE VARIANTS MADE BETWEEN 2003 AND 2014. A FAILED IGNITION SWITCH DETENT COULD RESULT IN AN UNRECOVERABLE SHUT DOWN OF THE VEHICLE, OR A RECOVERABLE SHUT DOWN BUT WITH HAZARDS ASSOCIATED WITH LOSS OF ALL ELECTRICAL SYSTEMS.  *TR",
        "vin": "WB10313088Z"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/25/2014",
        "dateOfIncident": "06/16/2009",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10605939,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BMW R1200 GS MOTORCYCLE. THE CONTACT STATED THAT THE ANTI- LOCK BRAKING SYSTEM ENGAGED AND TURNED OFF INDEPENDENTLY WITHOUT ANY WARNINGS. THE VEHICLE WAS TAKEN TO THE DEALER. THE TECHNICIAN DIAGNOSED THAT THE ANTI-LOCK BRAKE SYSTEM CONTROL UNIT NEEDED TO BE REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE WHO DID NOT OFFER ANY ASSISTANCE SINCE THE VEHICLE WAS NOT INCLUDED IN RECALL NHTSA CAMPAIGN NUMBER: 09V129000 (ELECTRICAL SYSTEM). THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 2,000 AND THE CURRENT MILEAGE WAS 6,000.   UPDATED 8/27/14*CN  UPDATED 08/29/2014   *JS",
        "vin": "WB10313058Z"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/05/2014",
        "dateOfIncident": "06/03/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10596522,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "RIGHT ANGLE FINAL DRIVE ON 2008 R1200 GS HAS BECOME A SAFETY HAZARD. THE BEARING AND SPLINES HAVE FAILED. FINAL DRIVE FLANGE AND SPLINES HAVE BECOME UN REPAIRABLE AND FINAL DRIVE IS INOPERATIVE. MOTORCYCLE HAS BEEN DEEMED BY BMW DEALER \"UN-SAFE TO RIDE\" UNLESS FINAL DRIVE IS REPLACED.  *TR",
        "vin": "WB10313068Z"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/30/2014",
        "dateOfIncident": "05/25/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10595133,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS RIDING MY MOTORCYCLE ON A MAJOR HIGHWAY WHEN THE MOTORCYCLE SUDDENLY STALLED. IT WAS A SCARY MOMENT SINCE I NOTICED THE VEHICLES BEHIND ME SLAMMING THERE BRAKES, TRYING TO AVOID HITTING ME!. THE FUEL LIGHT WAS FLASHING AND WARNING (YELLOW TRIANGLE) ON. I CALLED MY BMW DEALER FOR REPAIR APPOINTMENT AND THE TECH. SAID THAT IT'S A COMMON PROBLEM IN THIS MODELS WITH A FUEL SENSOR FAILURE AND IT'S NOT UNDER WARRANTY BY BMW.  AFTER TALKING TO SEVERAL BMW OWNERS AND READING SOME FORUMS, I LEARNED THAT THIS MODEL EQUIPPED WITH A FUEL SENSOR STRIP THAT HAPPENS TO FAIL OFTEN. SOME R1200GS OWNERS HAD TO CHANGE IT 3-7 TIMES, BUT BMW OF NORTH AMERICA WANT ADMIT THERE FAULTY PART!.  HOPE YOU CAN GET INVOLVED IN THIS HIGH RISK MATTER.  *TR",
        "vin": "WB10313078Z"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/23/2014",
        "dateOfIncident": "05/22/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10593632,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "RUNNING OUT OF GAS DUE TO FAULTY FUEL STRIP SENSOR WHICH PREVENTS DETERMINING FUEL LEVEL IN GAS TANK. DANGER IS BEING REAR ENDED BY ON COMING VEHICLES.  THIS IS THE 7TH BMW FUEL SENSOR STRIP THAT HAS FAILED FOR MY WIFE AND I IN THE YEARS FROM 2005 TO 2014.   THERE HAVE BEEN 2 ON TWO 2005 K1200SES, 1 ON A 2006 K1200S, 3 ON TWO 2008 K1200SES, AND 1 ON A 2008 R1200GS FUEL LEVEL STRIPS THAT HAVE FAILED.  *TR",
        "vin": "WB10313048Z"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/13/2014",
        "dateOfIncident": "04/17/2013",
        "fire": true,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10588000,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING DOWN A FREEWAY A SLIGHT VIBRATION WAS FELT WHEN THE SUSPENSION UNLOADED. THE VIBRATION SUDDENLY TURNED IN TO A BUCKING FROM THE BIKE'S REAR AND THE DRIVE SHAFT FROZE, LOCKING THE REAR WHEEL. SMALL FLAMES WERE NOTICED FROM THE FORWARD SWING ARM BOOT WHICH SELF EXTINGUISHED. INSPECTION SHOWED THE FORWARD UNIVERSAL JOINT FAILED AND THE ROTATING DRIVE SHAFT TORE THE SWING ARM.  *TR",
        "vin": "WB103130X8Z"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/27/2013",
        "dateOfIncident": "01/11/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10554036,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I SMELLED GAS AND FOUND GAS LEAKING FROM THE FUEL PUMP ATTACHED TO THE GAS TANK. I FOUND CRACKS ON THE PERIPHERY OF THE FUEL QUICK-DISCONNECT PORT.   *TR",
        "vin": "WB10313078Z"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/22/2013",
        "dateOfIncident": "08/22/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10536724,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL TANK IS LEAKING AT THE PLASTIC FLANGES WHERE THE FUEL PUMP RESIDES. THIS APPEARS TO BE A RECURRING PROBLEM FOR THIS MODEL YEAR AND OTHERS.  *TR",
        "vin": "WB10313048Z"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/13/2013",
        "dateOfIncident": "04/16/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10535147,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE RIDING DOWN THE FREEWAY AN ODD VIBRATION IN THE BIKE OCCURRED WHEN THE SUSPENSION UNLOADED. ABOUT A HALF MILE LATER THE REAR WHEEL SUDDENLY LOCKED UP, CAUSING THE BIKE TO JERK VIOLENTLY. IMMEDIATELY PULLING IN THE CLUTCH ALLOWED ME TO COAST TO THE SIDE. SMOKE WAS COMING OUT THROUGH THE TWO SWING ARM JOINT BOOTS. THE LOWER U-JOINT OF THE DRIVE SHAFT SEIZED AND BROKE DUE TO THE FAILURE OF A NON-MAINTAINABLE SEALED BEARING. THE DRIVESHAFT IS LOCATED IN THE SWINGARM AND THE FLAILING DRIVESHAFT CAUSED SIGNIFICANT DAMAGE TO THAT PART AS WELL.  THE REPAIRS INCLUDED REPLACING THE DRIVE SHAFT, SWINGARM AND BOOTS.  *TR",
        "vin": "WB103130X8Z"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/07/2013",
        "dateOfIncident": "07/07/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10523549,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE CRUISING AT MODERATE SPEED ON PAVED SURFACE ROAD FIRST NOTICED STRONG GASOLINE SMELL, FOLLOWED IN FEW MINUTES BY SOAKING OF THE LEFT LEG OF THE PANTS WITH GASOLINE, AND THEN OBSERVED GASOLINE DRIPPING  ON THE LEFT CYLINDER HEAD. STOPPED, REMOVED LEFT SIDED COWLING TO INSPECT FUEL LINES AND NOTED STEADY STREAM OF FUEL LEAKING FROM FUEL PUMP HOUSING WHEN ENGINE RUNNING.  *TR",
        "vin": "WB10313098Z"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/18/2013",
        "dateOfIncident": "03/11/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10503488,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BMW R1200 MOTORCYCLE. THE CONTACT STATED THAT THERE WAS FUEL LEAKING FROM THE VEHICLE. THE VEHICLE WAS NOT INSPECTED BY A DEALER OR AN INDEPENDENT MECHANIC. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE AND CURRENT MILEAGES WAS APPROXIMATELY 26,200.  *TR",
        "vin": "WB10388028Z"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/23/2012",
        "dateOfIncident": "07/09/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10467136,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE RIDING MY MOTORCYCLE, I NOTICED FUEL LEAKING FROM THE FRONT BOTTOM LEFT SIDE OF THE FUEL TANK. FUEL WAS SPRAYING ON TO MY LEFT LEG SOAKING IT IN FUEL. THE LOCATION OF THE SPRAY WAS DIRECTLY ON TOP OF THE FRONT LEFT CYLINDER AND EXHAUST PIPE. THE POTENTIAL FOR A FIRE WAS REAL. AFTER TAKING IT TO THE DEALER ( GULF COAST BMW IN HOUSTON ), THEY TOLD ME THAT THIS WAS A COMMON FAILURE AND SHOWED ME A SAMPLE OF THE FAILED PART. I WAS THEN FORCED TO BUY A COMPLETE FUEL PUMP ASSEMBLY AS BMW DID NOT SELL THE FUEL PUMP FLANGE THAT FAILED. THE FLANGE DEVELOPED A CRACK THAT ALLOWED FUEL TO ESCAPE UNDER HIGH PRESSURE. THE PARTS ALONE COST OVER 700 DOLLARS. I CONSIDER THIS A SAFETY ISSUE COMMON TO THE R SERIES TWIN CYLINDER ENGINES. WHAT'S WORSE IS THAT THEY REPLACED THE FAILED PART WITH EXACTLY THE SAME THING SO NOW I AM WAITING FOR THIS PART TO FAIL AGAIN. THIS IS SOMETHING THAT COULD HAVE EASILY ENDED TRAGICALLY. I AM WORRIED FOR THE SAFETY OF MANY OTHER RIDERS OUT THERE USING THIS MOTORCYCLE AND THUS I AM FILING THIS FORMAL COMPLAINT. I HAVE NOTIFIED BMW ABOUT THIS AND THEY JUST THANKED ME FOR INFORMING THEM - WITH NO FURTHER ACTION OR RELIEF FOR HAVING TO PURCHASE AN ENTIRE ASSEMBLY FOR WHICH AN INDIVIDUAL PART FAILED.  *TR",
        "vin": "WB10313068Z"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "04/19/2012",
        "dateOfIncident": "04/05/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10455787,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL GAUGE SENSOR STRIP, FUEL GAUGE DOES NOT WORK OR WORKS INTERMITTENTLY, IS A WELL KNOW PROBLEM WITH POST 2005 BMW MOTORCYCLES. THIS IS A MAJOR SAFETY FEATURE, COULD POSSIBLY RUN OUT OF GAS IN HEAVY TRAFFIC AND CAUSE AN ACCIDENT OR RUN OUT OF GAS IN THE MIDDLE OF NO WHERE. BMW NEEDS TO RECALL ALL BIKES WITH THIS FUEL STRIP AS A PREVENTATIVE MEASURE TO ENSURE THE PUBLIC IS OUT OF HARMS WAY!!!       *JS",
        "vin": "WB10313038Z"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "06/05/2011",
        "dateOfIncident": "05/18/2010",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10404523,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 GS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 BMW GS MOTORCYCLE RAN OUT GAS WHILE AT A STOP LIGHT. GAS GAGE SHOWED A RANGE OF 50 MILES LEFT IN THE TANK BEFORE EMPTY. THIS HAS BEEN REPAIRED TWICE BECAUSE OF THE FUEL STRIP IN THE TANK FAILS TO READ THE FUEL LEVEL. I HAVE BEEN LUCKY, AND HAVE NOT HAD THIS HAPPEN WHILE IN MOTION ON THE FREEWAY OR HIGHWAY   PUTTING ME IN DANGER FROM OTHER VEHICLES DUE TO SUDDEN LOSS OF FUEL TO THE ENGINE. *TR",
        "vin": "WB10313008Z"
    }
]