[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/26/2022",
        "dateOfIncident": "03/18/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458471,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "The crank shaft sensor went out and caused the steering and brakes to go out.  It took out all communications with the car.  I had had intermittent problems with it as it went out, and it didn't throw a code showing what the problem was.  (I took it to AAMCO once and Goodyear twice before they could identify the problem.)  (Some Buick dealers do not work on cars over 10 years, and some do not use off-market parts when GM has chosen to stop making replacement parts, such as the rack and pinion/steering gear.  Their goal is to sell cars, not maintain.)  At 150,000+ miles, sensors go out, and I expect to replace them.  What I don't expect is deliberate design that will cause the vehicle to be or cause damage(d).  This is a design flaw by GM and I wonder how many mystery crashes can be related to this.",
        "vin": "1G4HD57288U"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/11/2022",
        "dateOfIncident": "03/01/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11456337,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "Engine coolant leak at engine timing belt cover per repair service. Not available for inspection , already had repaired (see attached invoice). Had to pull over on busy major roadway due to high temperature warning on temperature gauge. Problem confirmed by service center.",
        "vin": "1G4HP57238U"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/09/2021",
        "dateOfIncident": "09/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439863,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2008 Buick Lucerne. The contact stated while driving approximately 20 MPH, the vehicle stalled without warning. The contact was unable to restart the vehicle. The contact stated there was no warning light illuminated. The vehicle was towed to the residence. The vehicle was inspected by a local mechanic and diagnosed with needing the fuel pump relay to be replaced. The vehicle was repaired however, the failure persisted. The manufacturer was not informed of the failure. The failure mileage was 72,479.",
        "vin": "1G4HD57208U"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/30/2021",
        "dateOfIncident": "07/27/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430965,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "1.  Fuse box was replaced, yes.   4th repair shop replaced.  I say only time will tell for sure. i don't drive every day  2.  driving I-95 from VA to MD at speeds of  30+ to 75+ cars driving close behind could have ran into rear causing my car, their car, and multiple other cars to be in major accident with possible multiple deaths.    3.   reproduced, no.  independent service center, no  4.   No.  Other - the 4th repair shop inspected vehicle component.  5.   No warning lamps.  No messages or symptoms, car just stalled and would not start/move        and w​hen I tried  to start car again car would not start, but had all kinds of warnings lamps         lit up.         The first time the engine stalled was driving (moving) into entrance of toll booth in        Richmond, VA, July 27, 2021 approx. 2:15 pm.   additional info:  Four (4)  times car stalled while driving in traffic without warning, car would not start again had to be towed each time to a repair shop.  Three (3) repair shops did not repair the problem.  First repair shop charged me approx. $350.00 +- for repairs.  PLUS I had to stay over night in hotel costing me approx. $120.00+-  Total $470.00 +-  Car still had same problem!!  Second repair shop did  not charge me for repairs, but not sure if any work was done, had to get a car rental to get back to Maryland. s second shop kept car ofr 6 days before working on problem.  Car rental cost me $467.27. Total $467.27  Car still had same problem!!!  Third repair shop kept car for 5 days, charged me approx. $125.+-, still the car had the same problem. Total $125.00+-   Car still had same problem!!!!  Fourth repair shop says he found fuse box to be the problem, repair cost me approx $554.00+- Total $554.00  My total expenses are approx. $1,491.20 only time will tell if problem has been fixed, not to mention the extreme emotional stress dealing with delays on repairs and extreme emotional stress driving not knowing when or how car would stall again.",
        "vin": "1G4HD57278U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/12/2021",
        "dateOfIncident": "08/12/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428906,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "To start things off the car would crank but not start. My wife did some research and these cars have a problem with the fuel pump relay shorting out. So I replaced it and it fixed the problem for a few days. I was driving home from work and the car shut off. I could smell plastic burning. I pulled over and pulled the fuse box cover off which is located under the rear seat and I pulled the relay out and burned my fingers in the process. So something is wrong and it's causing the relay to overheat and melt. There are many people according to carcomplaints.com that have the same issue. I've seen a lot of people saying that GM says that the seat bracket touches the fuse box putting pressure on the relay causing this problem. Well after I replaced the relay I did not put the rear seat on and it still burned out. In my mind it seems to be a fire safety hazard. No check engine lights came on either.",
        "vin": "1G4HD57228U"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEATS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/27/2021",
        "dateOfIncident": "06/05/2021",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11426686,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "-The electrical system failed, causing the fuel pump to not work properly due to design flaw in the backseat putting pressure on the fuse box which is located under the backseat. The spot where contact is made to the fuse box, is where the fuel pump relay is. Pressure from the seat bracket (with or without a passenger in the seat) causes the pump replay to not make proper contact with the terminal, therefore causing the power to arc and get so hot that the relay starts smoking, melting the relay, fuse box and surrounding fuses and leaving black scorch marks on the inside of the lid to fuse box and making the car smell like burnt plastic. In addition to now having to purchase multiple replacement relays it has also caused additional electrical issues which resulted in having to replace multiple fuses as well as purchase another battery due to theses issues putting added strain on my battery which caused it to drain and not hold a charge any more. Yes the car and parts are available for inspection. -My safety and the safety of others is at risk due to major risk of catching on fire which could happen while driving and therefore cause an accident, could cause one of my passengers, including my child or myself to be severely hurt/burnt. -Yes the issue has been reproduced by many other owners of the same year/make/model as per the hundreds of previous complaints found about the same issue.  -No there were no warning lights, signals or messages before the failure. No warning at all.",
        "vin": "1g4he57y18u"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/05/2021",
        "dateOfIncident": "06/26/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11423447,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I keep fixing this car for the last 11 months , and still can not drive it after $5,000 in repairs, the car stops in the middle of the intersection , on the freeway several times. I went to different mechanics, the dealership to, they keep fixing it, charging me, but the car is still not fixed. I'm afraid to drive it because I don't wanna lose my life and to jeopardize another's people lives.The car just stops while I'm driving.",
        "vin": "1G4HP572X8U"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/01/2021",
        "dateOfIncident": "04/23/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414724,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I FIRST BOUGHT THE CAR OVER A YEAR AGO THERE WERE 3 DIFFERENT OCCASIONS THAT MY CAR WOULD NOT START SO I CONTACTED THE DEALERSHIP THAT I BOUGHT IT FROM AND THEY EXPLAINED TO ME THAT IT WAS A REOCCURRING PROBLEM WITH THAT MODEL FOR THE FUEL PUMP RELAY TO GO OUT AND AFTER A COUPLE TIMES OF IT GOING OUT IT WOULD ULTIMATELY FRY THE FUSE AND RELAY BLOCK AND IT WOULD NEED TO BE REPLACED SO THAT IS WHAT THEY DID AT THE DEALERSHIP AND WITHIN THEY YEAR THAT I HAVE OWNED IT I HAVE REPLACED THE FUEL PUMP RELAY 3 TIMES AND DRIVING TO THE PARTS STORE LAST WEEK THE CAR JUST DIED IN THE MIDDLE OF THE STREET AND HAS NOT STARTED SINCE. I WAS TOLD IT WAS DUE TO THE HINGE ON THE SEAT RUBBING THE SIDE OF THE FUSE AND RELAY BOX SPECIFICALLY THE FUEL PUMP RELAY THAT IS THE CAUSE OF THE FUSE AND RELAY BLOCK TO SHORT OUT",
        "vin": "1G4HD572X8U"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/29/2021",
        "dateOfIncident": "04/01/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11414488,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "RECENTLY REPLACED FUEL PUMP.  AFTER REPAIR, CAR WAS STILL A CRANK/NO START.  REPLACED FUEL PUMP RELAY WHICH HAD OBVIOUS BURN/SCORCHING EVIDENCE, AS WELL AS MELTING AROUND FEMALE PORT ON THE FUSE BOX.  SINCE THEN HAVE HAD TO REPLACE 3 OTHER NEW FUEL PUMP RELAYS DUE TO PROBLEM OF EXCESSIVE HEAT OR ELECTRICAL SURGE FRYING THE RELAY.  AFTER RESEARCHING THE PROBLEM, IT WAS FOUND THAT THE PROBLEM IS CAUSED BY THE BACK SEAT OF THE VEHICLED COMING IN CONTACT WITH THE TOP OF THE FUSE BOX CAUSING THE RELAY TO MOVE, CAUSING THE RELAY TO WORK HARDER TO MAINTAIN A CONNECTION, WHICH IN TURN CREATES MORE CURRENT AND THE RESULTING HEAT INCREASE MELTS THE CASING IN THE FUSE BOX AND KILLS THE RELAY.   WHEN THE RELAY IS COMPROMISED IN SUCH A WAY THE FUEL PUMP STOPS OPERATING AND THE ENGINE GETS NO GAS THUS CREATING A CRANK/NO START IF THE CAR IS PARKED OR CAUSES THE CAR TO STALL OUT IF THE CAR IS IN MOTION.  IN REASEARCHING THIS MATTER, IT IS CLEAR THAT GM HAS BEEN AWARE OF THIS SITUATION FOR OVER 10 YEARS.  THERE ARE MULTITUDES OF INDIVIDUALS EFFECTED BY THIS PROBLEM WITH SOME OF THEM HAVING SMOKING OR BURNING ISSUES WITH THE RELAY.  PERSONALLY, I HAVE HAD STALL OUTS WHILE GOING WITH THE FLOW OF TRAFFIC WHICH RESULTED IN VEHICLE CONTROL ISSUES SUCH AS BRAKING AND STEERING AND EXCELLERATION,  GM HAD EXTENDED REPAIR PERIOD FOR THE ISSUE BUT FAILED TO NOTIFY OWNERS SO MANY WERE UNAWARE OF THE REPAIRS OR EVEN THE ISSUE UNTIL THE PROBLEMS OCCURRED.  NO RECALL HAS BEEN INITIATED BY GM EVEN THOUGH IT IS A CLEAR SAFETY ISSUE DUE TO THE CONTROL ISSUES WHEN STALL OUTS OCCUR AND THE POTENTIAL FOR FIRES UNDER THE SEAT AS THE PROBLEM PROGRESSES.  GM REFUSES TO COVER REPAIRS TO AFFECTED VEHICLES SINCE THE COURTESY REPAIR ORDER EXPIRED AND THE VEHICLES ARE TYPICALLY OUT OF WARRANTY.  VEHICLE INVOLVED IS A 2008 BUICK LUCERNE BUT THE ISSUE EFFECTS OTHER GM CARS.  GM TSB 15-NA-051 FOR TECH DIRECTIVES",
        "vin": "1G4HP57208U"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/26/2021",
        "dateOfIncident": "04/24/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413890,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL SUPPLY LINE AT FIREWALL RETAINER SEVERELY RUSTED, COULD LEAK SPRAYING FUEL ON ENGINE OR EXHAUST CAUSING FIRE",
        "vin": "1G4HP572X8U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/20/2020",
        "dateOfIncident": "09/23/2019",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11384305,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WOULDN'T START KEPT TRYING TO START IT AND IT WOULD MAKE A CLICKING NOISE AND THEN ALL OF A SUDDEN A SMALL ELECTRICAL FIRE STAFFED IN THE FUSE BOX IN THE REAR SEAT OF CAR",
        "vin": "1G4HP57298U"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/30/2020",
        "dateOfIncident": "09/01/2020",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11377185,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BUICK LUCERNE. THE CONTACT STATED THAT WHILE OPERATING THE VEHICLE, A BURNING PLASTIC ODOR WAS PRESENT INSIDE THE VEHICLE. THE VEHICLE WAS TAKEN TO THE LOCAL MECHANIC WHO INDICATED THAT THE FUSE BOX LOCATED UNDER THE REAR SEAT WAS HOT TO THE TOUCH AND THE RELAYS INSIDE HAD MELTED CAUSING THE FUEL PUMP TO OVERHEAT AND FAIL. THE VEHICLE WAS NOT YET REPAIRED. THE LOCAL DEALER COURTESY BUICK LOCATED AT 7 AUTO CENTER DR. LOUISVILLE KY WAS NOTIFIED OF THE FAILURE. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 70,000.",
        "vin": "1G4HP57238U"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/20/2020",
        "dateOfIncident": "10/03/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365308,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL RELAY WENT OUT 2X, THE SECOND IT ALMOST CAUGHT THE CAR ON FIRE. THE CAR FILLED WITH SMOKE. ITS LOCATED UNDER THE REAR SEAT OF THE CAR. CALLED DEALERSHIP SAID THERE WAS A RECALL TO BRING IT IN, NOW THE DEALERSHIP IS SAYING THE WARRANTY HAS EXPIRED, AND WANTS $1700 TO FIX.IF I'D BEEN DRIVING IT WOULD'VE BURNED THE CAR, AND WORSE HOW ABOUT IF MY GRANDBABY WOULD'VE BEEN BUCKLED IN THAT SPOT. THE CAR ONLY HAS AROUND 80,000 MILES ON IT. THE CAR WAS IN MOTION. THE CAR IS STILL AT THE DEALERSHIP",
        "vin": "1G4HP57258U"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/28/2020",
        "dateOfIncident": "09/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11361507,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BUICK LUCERNE. THE CONTACT STATED WHILE DRIVING, THE ACCELERATOR PEDAL WAS DEPRESSED AND THE VEHICLE JERKED WITH AN ABNORMAL THUD BEFORE RESPONDING. MIKE HAGGERTY BUICK GMC, INC. (9301 S CICERO AVE, OAK LAWN, IL 60453; (708) 762-9813) WAS CONTACTED AND THE CONTACT WAS INFORMED THAT THE PASSENGER'S SIDE MOTOR MOUNT NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 40,000.*DT  *TR",
        "vin": "1G4HP57258U"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/15/2020",
        "dateOfIncident": "09/14/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11355056,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR CRANKED BUT DOES NOT START. JUST REPLACED THE FUEL PUMP RELAY WITH OEM AND FUEL PUMP.  WORKED.  ONE DAY LATER, DOESN'T WORK.  THE FUEL PUMP RELAY WAS BURNT. SEEMS TO BE A COMMON PROBLEM IN THE CHAT BOXES FOR THIS CAR.  I WAS TOLD THERE IS A TECH NEW BULLETIN ON THIS.",
        "vin": "1G4HD57228U"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/11/2020",
        "dateOfIncident": "09/03/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354330,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE IT'S SHUTTING OFF WHILE DRIVING, AND AFTER IT GETS COLD IT WILL RESTART, BUT AFTER DRIVING AGAIN ANOTHER FEW MILES IT WILL SHUT OFF AGAIN. THERE ARE NO LIGHTS ON, SO NO MECHANIC TO TELL ME WHAT THE PROBLEM IS. I EVEN CALLED THE DEALER, AND I WAS TOLD THAT THEY CAN'T DIAGNOSE THE CAR BECAUSE IS NO CHECK ENGINE LIGHT ON.. I TRIED FEW DIFFERENT AUTO SHOPS WITH NO ANSWER, SO MY CAR IS PARKED IN THE DRIVEWAY BECAUSE I'M SCARED TO DRIVE IT, I DON'T KNOW HOW OR WHEN THE ENGINE WILL STOP.. ANOTHER MECHANIC TOLD ME TO DROP THE CAR TO HIS SHOP BUT IT MAKE 2 WEEKS OF WORK TO FIND OUT THE PROBLEM AND I WILL HAVE TO PAY FOR 2 WEEKS, AND THAN TO PAY TO FIX IT. IT USUALLY STOPS WHILE IN MOTION WHEN CLOSE TO THE A TRAFFIC LIGHT, WHEN I MAKE A TURN AND ALWAYS WHEN I SLOW DOWN",
        "vin": "1G4HP572X8U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/03/2020",
        "dateOfIncident": "07/27/2020",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343037,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BUICK LUCERNE. THE CONTACT STATED A FUSE BLOCK MELTED DUE TO THE FUEL RELAY UNDER THE REAR SEAT MALFUNCTIONING. THE CONTACT STATED THAT THE FAILURE OCCURRED SEVERAL YEARS AGO, AND THE VEHICLE WAS TAKEN TO A DEALER WHOM INFORMED THAT THERE WAS NO RECALL FOR THE FAILURE. THE CONTACT STATED THAT THE DEALER REPLACED THE RELAY.  THE CONTACT STATED THAT HER SPOUSE ORDERED A NEW PART AND WOULD DO THE REPAIRS ON HIS OWN. THE DEALER AND MANUFACTURER WERE NOT CONTACTED. THE FAILURE MILEAGE WAS 82,500.",
        "vin": "1G4HD57278U"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/20/2020",
        "dateOfIncident": "04/01/2018",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321729,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BUICK LUCERNE. THE CONTACT STATED THAT THE VEHICLE WAS AT STAND STILL AT A HOSPITAL PARKING LOT, WHEN HE ENTERED THE VEHICLE AND DETECTED PLASTIC BURNING ODOR AS THE VEHICLE FAILED TO START. THE VEHICLE WAS NOT DRIVABLE AND TOWED TO HIS RESIDENCE. THE CONTACT CALLED AN INDEPENDENT MECHANIC AND WAS INFORMED THAT THE ELECTRONIC FUEL PUMP WAS NEEDING TO BE REPLACED. UPON INVESTIGATION, THE CONTACT READ A TECHNICAL SERVICE BULLETIN FROM GENERAL MOTORS ON-LINE ON HOW TO REPLACE THE ELECTRONIC RELAY MODULE AND REPLACED THE PART ON HIS OWN. THE CONTACT STATED HE EXPERIENCED THE FAILURE AGAIN ON DECEMBER 16, 2019. THE MANUFACTURER HAD BEEN INFORMED OF THE FAILURE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED AS OF YET. A DEALER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 125,000.  *BF",
        "vin": "1G4HD57258U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/23/2020",
        "dateOfIncident": "01/20/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301475,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BUICK LUCERNE. THE CONTACT STATED THAT THE FUSE PANEL LOCATED IN THE REAR MIDDLE SEAT WAS INOPERABLE. THE CONTACT WAS UNABLE TO START THE VEHICLE DUE TO THE FAILURE. THE CONTACT STATED THAT THE ABS WARNING LIGHT, BRAKE WARNING LIGHT AND TPMS WARNING LIGHTS WERE ILLUMINATED. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC TO BE DIAGNOSED. THE DIAGNOSTIC TESTING INFORMATION WAS NOT AVAILABLE.  THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT CONTACTED OR NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 72,000.",
        "vin": "1G4HP57268U"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/25/2019",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11282320,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT ENGINE MOUNT HAS BROKEN AND BEEN REPLACED TWO TIMES IN UNDER 100K MILES. LOUD CLUNK IS PRESENT ON TAKE OFF, SHAKING AND VIBRATION WHEN ACCELERATING IS PRESENT TOO.     THE FIRST TIME WAS JUST OUTSIDE OF WARRANTY AT 60K MILES.",
        "vin": "1G4HP57288U"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/10/2019",
        "dateOfIncident": "09/10/2019",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11279220,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR HAS GONE THROUGH 3 FUEL PUMP RELAY FUSES IN 3 MONTHS LAST ONE STARTED ON FIRE JUST FROM STARTING VEHICLE",
        "vin": "1G4HP57298U"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/07/2019",
        "dateOfIncident": "09/10/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11278626,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BUICK LUCERNE. WHEN ATTEMPTING TO START THE VEHICLE, IT WOULD CRANK, BUT THERE WAS NO FUEL BEING TRANSFERRED TO THE ENGINE. THE VEHICLE WAS TOWED TO A CERTIFIED MECHANIC WHO DIAGNOSED THAT THE FUEL PUMP AND THE FUEL RELAY BOTH FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS TOWED TO BORCHERDING BUICK GMC (LOCATED AT 9737 KINGS AUTO MALL RD, CINCINNATI, OH 45249, 866-666-6291) WHERE IT WAS FURTHER DIAGNOSED THAT THE FAILURE WAS DUE TO AN OVERHEATING OF THE ELECTRICAL FUSE BOX THAT BURNED THE RELAY. THE VEHICLE WAS REPAIRED. APPROXIMATELY THREE DAYS LATER, THE FAILURE RECCURED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STATED THAT DUE TO THE VEHICLE NO LONGER BEING COVERED UNDER THE SPECIAL COVERAGE, THEY WERE UNABLE TO PROVIDE A REPAIR. THE APPROXIMATE FAILURE MILEAGE WAS 55,000.",
        "vin": "1G4HD57228U"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/15/2019",
        "dateOfIncident": "09/15/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11268750,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BUICK LUCERNE. WHILE DRIVING FOR OVER AN HOUR, THE CONTACT ATTEMPTED TO RESTART THE VEHICLE AND THE FUEL PUMP FUSE BURNED OUT. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND PROVIDED CASE NUMBER: 9-5583355801. THE MANUFACTURER ADVISED THE CONTACT TO CALL A LOCAL DEALER TO HAVE THE VEHICLE DIAGNOSED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 119,000.",
        "vin": "1G4HD57258U"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/14/2019",
        "dateOfIncident": "10/08/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11268415,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "HAD TO REPLACE A GMC PLASTIC GAS TANK DUE TO FUEL LEAK AROUND A EMISSIONS VENT ON TOP OF THE FUEL TANK. EVERY TIME THE CAR WOULD TAKE A TURN, FUEL WOULD POUR OUT FROM THE POOR CONFIGURATION & MATERIAL CRAFTSMANSHIP OF TANK AROUND THE VENT CAP. FLASH BACK TO THE FORD PINTO ISSUES OF THE 70'S. CAR HAS 64,886 MILES ON IT. SITS IN GARAGE, WHICH ALSO SMELLS OF FUEL VAPORS AFTER USE. NOTE ATTACHED PHOTO DOC'S. .",
        "vin": "1G4HD57288U"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "10/07/2019",
        "dateOfIncident": "08/28/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11266761,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTO WAS IN ACCIDENT. LEFT FRONT QUARTER PANEL, IN FRONT OF L WHEEL. BASICALLY, CAR WAS RUN OVER. SEE PHOTOS. AIR BAGS DID NOT GO OFF.  ACCIDENT ON 8-28-2019. CAR BEING HELD IN CASE NHTSA WANTS TO INSPECT IT. PLEASE CONTACT ME SO I MAY NOTIFY INS. CO. REGARDING STATUS OF SAID CAR, ACCIDENT AND IF THEY SHOULD KEEP IT.",
        "vin": "1G4HD57228U"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEATS",
        "crash": false,
        "dateComplaintFiled": "09/22/2019",
        "dateOfIncident": "09/22/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11257225,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WITHIN THE LAST MONTH, MY CAR HAS BURNED THOUGH 3 FUEL PUMP RELAYS. ONE CONNECTION IS BUBBLING UP IN A CERTAIN SPOT. THE FUSE BOX IS HOT TO THE TOUCH, AND A GLOVE WAS NEEDED TO PULL THE FUEL RELAY OUT AND THE BUBBLING IS NOW APPARENT ON THE FUSE BOX ITSELF. I HAD JUST FINISHED A 260 MILE ROUND TRIP WITH MY SISTER AND WHEN WE STOPPED FOR FOOD, THE CAR WOULD CRANK BUT NOT START.",
        "vin": "1G4HP57238U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/12/2019",
        "dateOfIncident": "08/02/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11254995,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS STATIONARY  FUEL RELAY BURNT OUT. WE REPLACED IT AND NEW ONE WENT OUT. THOUGHT IT WAS FUEL PUMP. REPLACED PUMP AND STILL WOULDN'T  CRANK.  REALISED THE FUSE BLOCK IS BAD.  SAW ONLINE WHERE THIS IS A COMMON ISSUE. WE ARE HAVING A HARD TIME FINDING THE CORRECT BLOCK. ORDERED ONE FROM GM ONLINE AND IT WAS THE WRONG ONE. SENT IT BACK.  CAR HAS BEEN DOWN FOR OVER A MONTH. THIS SHOULD BE A RECALL.",
        "vin": "1G4HD57228U"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/03/2019",
        "dateOfIncident": "09/03/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11253069,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "IN THE LAST MONTH AND A HALF MY 2008 BUICK LUCERNE HAS BURNED UP SIX FUEL PUMP RELAYS IT KEEPS MELTING THE RELAYS AND THE FUSE BLOCK  I BELIEVE THIS TO BE A SAFETY HAZARD AS IT COULD CATCH ON FIRE THIS SHOULD DEFINITELY BE RECALLED",
        "vin": "1G4HP57278U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/16/2019",
        "dateOfIncident": "08/14/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11244473,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR SEAT MAKES CONTACT WITH TOP OF FUSE BLOCK COVER CAUSING IT TO PUSH AGINST FUEL PUMP RELAY CAUSING IT TO OVERHEAT AND BURN OUT. THIS RELAY GETS HEATED TO THE POINT THAT IT COULD PRESENT A FIRE HAZARD.  DUE TO THE HEAT IT GENERATES, IT MELTS THE FUSE BLOCK CAUSING IT TO HAVE TO BE REPLACED. BACK SEAT CANNOT SUPPORT WEIGHT OF AN AVERAGE SIZE PERSON. THIS PROBLEM CAUSES THE VEHICLE TO SHUT DOWN AND LOSE POWER RENDERING LOSE OF POWER STEERING  AND POWER BRAKES. IT IS UNREPREHENSIBLE  THAT GM IS NOT MADE TO CORRECT THIS BLATANT MISTAKE. THIS HAS HAPPENED 4 TIMES  AND THE BLOCK HAS BEEN REPLACED BY AUTHORIZED BUIC DEALER.",
        "vin": "1G4HD57228U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/15/2019",
        "dateOfIncident": "04/10/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11231919,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BUICK LUCERNE. THE CONTACT STATED THAT THE FUSE BOX FAILED THREE TIMES IN THREE MONTHS. ALSO, WHILE DRIVING, A BURNING ODOR WAS DETECTED. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE CONTACT COASTED THE VEHICLE OVER TO THE SIDE OF THE ROAD, OPENED THE BACK SEAT OF THE VEHICLE, AND NOTICED THAT THE FUEL FUSE WAS BURNED. THE CONTACT REPLACED THE FUSE, BUT THE FAILURE RECURRED. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC WHERE THE FUEL BOX AND FUEL PUMP WERE REPLACED; HOWEVER, THE FAILURE RECURRED. THE CONTACT SPOKE WITH MURDOCK HYUNDAI LOGAN (LOCATED AT 3131 MAIN ST, LOGAN, UT 84341, (888) 494-8023) AND THE CONTACT WAS INFORMED THAT THERE WOULD BE A FEE FOR DIAGNOSTIC TESTING AND REPAIRS. THE VEHICLE WAS NOT TAKEN TO A DEALER AND WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 110,000.",
        "vin": "1G4HD57288U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/15/2019",
        "dateOfIncident": "01/10/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11232049,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVE A LETTER FROM GM STATING THAT THE REAR SEAT BRACKETS MAY CONTACT THE ELECTRICAL SYSTEM CAUSING DAMAGE INCLUDING FIRES AND DRAINING OF THE BATTER.  THE LETTER FURTHER GAVE A VERY NARROW TIME FRAME AS WELL AS CONDITIONS WHERE OWNERS COULD GET REIMBURSEMENT OR REPAIR OF THE PROBLEM WHICH PROHIBITS MYSELF OTHER OWNERS FROM BEING ABLE TO CORRECT THIS DESIGN DEFECT WITHOUT INCURRING SIZABLE REPAIR BILLS.  I HAVE REPLACED MY BATTERY TWICE BECAUSE OF THE DRAINING ISSUES.  THE VEHICLE CAN NOT STAY DORMANT FOR MORE THAN 2 DAYS BEFORE THE BATTERY DIES.  IT IS UNCONSCIONABLE AS WELL AS AN  UNSCRUPULOUS BUSINESS PRACTICE TO NOT RECALL THE AFFECTED  VEHICLES AND HAVE THE PROBLEM CORRECTED AT NO COSTS TO THE OWNERS.  I AM LUCKY THAT IT IS JUST A BATTERY DRAIN, IN SOME CASES THERE HAVE BEEN FIRES AND ENGINE STALLS. THIS IS A POTENTIAL LIFE-THREATENING PROBLEM THAT SHOULD BE CORRECTED BY GM IMMEDIATELY.",
        "vin": "1G4HD57298U"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/18/2019",
        "dateOfIncident": "06/16/2019",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11221077,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BUICK LUCERNE. THE CONTACT STATED WHILE DRIVING AT AN UNKNOWN SPEED, THE VEHICLE STALLED WITH NO WARNING. THE VEHICLE WAS UNABLE TO RESTART AND TOWED TO A TRUCK STOP.  THE CONTACT STATED THAT UPON INVESTIGATING THE FAILURE, DISCOVERED THAT THE FUEL PUMP RELAY WAS MELTED AND BURNT. THE CONTACT STATED THAT PRIOR TO THE DISCOVERY NO SMOKE OR FIRE WAS NOTICED UNDER THE REAR SEAT WHERE THE FUEL PUMP RELAY WAS LOCATED IN THE FUSE BOX. THE CONTACT STATED HE PURCHASED AND REPLACED THE PART HIMSELF.  THE VEHICLE WAS ABLE TO START AND THE VEHICLE WAS DRIVEN TO THE CONTACT'S RESIDENCE. THE VEHICLE WAS NOT TAKEN TO AN INDEPENDENT MECHANIC OR DEALER FOR DIAGNOSIS OR REPAIRS. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 211,000.",
        "vin": "1G4HD572X8U"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/26/2019",
        "dateOfIncident": "05/20/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11210090,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FUSE BOX UNDER THE SEAT OVERHEATS AND BURNS OUT FUEL PUMP RELAY ALONG WITH THE FUSE BOX. UNSAFE IF IT HAPPENS WHILE DRIVING",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/06/2019",
        "dateOfIncident": "01/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205718,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A LETTER IN JANUARY, 2019 REGARDING THIS VEHICLE, STATING THAT THE \"VEHICLE'S REAR SEAT BRACKET COULD CONTACT THE VEHICLE'S REAR ELECTRICAL CENTER (REC), WHICH CAN, OVER TIME, DAMAGE ELECTRICAL COMPONENTS WITHIN THE REC ENCLOSURE. IF DAMAGE OCCURS, THE COMPONENTS CAN MELT OR OVERHEAT, WHICH THE CUSTOMER MAY DETECT BY A MELTING ODOR IN THE VEHICLE. DAMAGE COULD ALSO CAUSE THE VEHICLE'S BATTERY TO DRAIN, A NO-START CONDITION, OR A STALL.\"  WE HAVE HAD 2 NEW BATTERIES INSTALLED IN THIS VEHICLE IN RECENT YEARS AND I'VE ALSO SMELLED THE BURNING SMELL THAT THEY ARE REFERRING TO IN THIS LETTER.  I TOOK THE VEHICLE TO SHELTON PONTIAC BUICK IN ROCHESTER, MI TO FIND OUT IF OUR CAR HAD BEEN AFFECTED BY THIS CONDITION, AND AFTER EXAMINING THE REC HARNESS, THEY SAID THAT IT HAS BEEN AFFECTED AND NEEDS REPAIR.  THEY QUOTED ME $720 TO REPAIR IT.  BUICK WAS THE ONE WHO CONTACTED ME REGARDING THIS SITUATION, WHICH IS UNSAFE AND SHOULD BE UNDER A RECALL WITH NO CHARGE TO THE CUSTOMER TO FIX. IT IS A MANUFACTURER'S PROBLEM AND NOT DUE TO WEAR AND TEAR AND I BELIEVE I SHOULD NOT BE CHARGED FOR THIS REPAIR BECAUSE OF THEIR FAULTY DESIGN.  I HAVE SPOKEN WITH THEIR CUSTOMER ASSURANCE CENTER MANY TIMES AND HAVE GOTTEN NOWHERE WITH THEM. I ALSO WROTE A LETTER TO NEELIE O'CONNOR, THE EXECUTIVE DIRECTOR OF BUICK'S NORTH AMERICAN CONTACT CENTER AND NEVER RECEIVED A RESPONSE.  SHE WAS THE  PERSON WHO SIGNED THE LETTER, ALERTING US TO THE PROBLEM.  I DO NOT WANT THIS VEHICLE TO BE UNSAFE AS I AM ON THE ROAD A LOT, GOING BACK AND FORTH TO DETROIT FOR CANCER TREATMENTS. IT NEEDS TO BE FIXED AND BUICK SHOULD PAY FOR IT.",
        "vin": "1G4HD57278U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/17/2019",
        "dateOfIncident": "05/07/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11196310,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 BUICK LUCERNE. CONSUMER WRITES SEEKING REIMBURSEMENT FOR VEHICLE REPAIRS. *LD    THE CONSUMER REQUESTED TO BE REIMBURSED FOR REPAIRS TO THE REAR ELECTRICAL CENTER. THE VEHICLE EXCEEDED THE MILEAGE PARAMETERS. *JS",
        "vin": "1G4HE57YX8U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/16/2019",
        "dateOfIncident": "04/14/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11196794,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TWICE IN THE LAST TWELVE MONTHS THERE HAS BEEN A SHORT IN THE TAIL LIGHT  ASSEMBLY RESULTING IN MY BATTERY GETTING DRAINED. I COULD NOT GET TO MY TOOLS IN THE TRUNK BECAUSE I COULD NOT GET THE ELECTRICAL SYSTEM TO OPEN THE TRUNK AND I COULD NOT OPEN IT MANUALLY. THE SHORT HAS BEEN DUE TO AN ELECTRICAL WIRE BEING PINCHED BETWEEN A WASHER AND THE FRAME WHEN THE TAIL LIGHT ASSEMBLY WAS REPLACED AFTER A BULB WAS REPLACED. IT CAUSED MY CAR TO DIE WHILE RUNNING.",
        "vin": "1G4HD57268U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/14/2019",
        "dateOfIncident": "04/12/2019",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11196101,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FULE PUMP RELAY FUSE BOX COUGHT FIRE",
        "vin": "1G4HD57208U"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/11/2019",
        "dateOfIncident": "04/11/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11195730,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR SHUT OFF WILL NOT START WITH KEY IN THE IGNITION, AND WHEN STARTED WITH THE KEYLESS REMOTE IT STILL WILL NOT MOVE AND CAR WILL NOT COME OUT OF PARK. THE WHOLE ENTIRE IGNITION SYSTEM IS LOCKED UP. I TRIED MY SPARE KEY THE CAR HAS SHUT DOWN AND IT HAD TO BE TOWED HOME. THE CAR WAS STATIONARY.",
        "vin": "1G4HD57258U"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/07/2019",
        "dateOfIncident": "03/17/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11194410,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "EXPERIENCED A CRANK NO START ON MY 2008 BUICK LUCERNE, DID SOME RESEARCH TO FIND THIS MAKE/MODEL/YEAR HAS A LONG HISTORY OF ISSUES WITH THE REAR ELECTRICAL CENTER DUE TO THE PLACEMENT UNDER THE BACK SEAT.  THE FUEL PUMP RELAY FUSE WAS EXTREMELY BURNT AND NOTICED THE FUSE BOX WAS MELTED NEAR THE RELAY FUSE.  BROUGHT MY CAR TO THE LOCAL BUICK DEALERSHIP AND THEY NOTIFIED ME A 10 YEAR \"SPECIAL COVERAGE\" WAS AVAILABLE ON THIS CAR BUT I WAS NEVER NOTIFIED OF THE ISSUE.  I AM THE 2ND OWNER OF THIS VEHICLE.  ENDED UP HAVING TO PAY FOR AN ENTIRE NEW REAR ELECTRICAL CENTER AND THE LABOR TO REPLACE IT (~$700).  I CALLED GM CUSTOMER SERVICE AND THEY SAID THEY WOULDN'T BE ABLE TO DO ANYTHING ABOUT IT.  IF THE ELECTRICAL BOX IS BEING BURNED AND IT'S DIRECTLY UNDER A SEAT I FEAR THIS IS A MAJOR SAFETY CONCERN.  I BELIEVE THIS SHOULD HAVE WARRANTED A RECALL AND IT ABSOLUTELY SHOULD BE REQUIRED FOR GM TO NOTIFY THE CURRENT OWNER OF THE VEHICLE FOR THIS ISSUE.",
        "vin": "1G4HD57228U"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/12/2019",
        "dateOfIncident": "03/12/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11186244,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WOULDN'T START CHECKED FUSE PANEL AND FUEL PUMP RELAY TERMINAL IS MELTED UPON FURTHER RESEARCH THIS IS A COMMON OCCURRENCE IN THE 2008-2011 BUICK LUCERNE MODELS CAUSED BY THE PANEL BEING DIRECTLY UNDER THE REAR SEAT BRACKET. BRACKET APPLIES PRESSURE TO PANEL LID WHICH INTERN PUSHES AND APPLIES PRESSURE TO FUEL PUMP RELAY GM RECOMMENDS REPLACING RELAY WITH LOW PROFILE STYLE RELAY AND CUTTING SEAT BRACKETS. IF THIS IS SUCH A KNOW ISSUE AND GM RECOMMENDS THESE MODIFICATIONS WHY IS THIS NOT A SAFETY RECALL? IF THE TERMINAL IS MELTING AND BURNING LIKE THAT THIS COULD CAUSE A FIRE DIRECTLY UNDER A FOAM SEAT IN THE REAR OF A CAR AND IN MY CASE DIRECTLY UNDER MY CHILDREN'S CAR SEATS!!!!!!!!! I HAVE TO REPLACE THE ENTIRE FUSE PANEL DUE TO THE MELTED CONTACTS WITH ESTIMATE REPAIR COSTS OF OVER $300 FOR SOMETHING THAT COULD BE PREVENTED BY GM DOING THE RIGHT THING AND FIXING THEIR PROBLEM!",
        "vin": "1G4HD57208U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/21/2019",
        "dateOfIncident": "01/31/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11171201,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A NOTICE FROM BUICK ON FRIDAY, JAN 18, 2019 STATING THAT THE REAR SEAT BRACKET MAY BE CONTACTING THE REAR ELECTRICAL CENTER (REC) WHICH CAUSES AN SMOKEY ODOR IN THE VEHICLE. REIMBURSEMENT IS ELIGIBLE IF YOU HAVE IT REPAIRED BUT I'M NOT ELIGIBLE FOR A RECALL OR THE FUNDS BECAUSE MY CAR WAS ORIGINALLY DELIVERED JULY 2008.  I BOUGHT IT WITH ONLY 24,000 ORIGINAL MILES ON IT IN JUNE 2017.  I HAVE NEVER BEEN NOTIFIED BY BUICK ABOUT THIS SITUATION.  ALL THIS TIME WE THOUGHT THAT THE PREVIOUS OWNER WAS A SMOKER.  SOMETHING HAS OBVIOUSLY BURNED OR IS BURNING IN THE CAR.   DUE TO THE SUPERIOR CONDITION OF THIS VEHICLE AND THE SERVICE RECORDS SHOWING WE HAVE WELL MAINTAINED IT, WE ARE REQUESTING ASSISTANCE TO GET THIS REPAIR COMPLETED AT NO CHARGE BY THE BUICK CORPORATION. WHEN CONTACTING THE BUICK CORPORATION ON MONDAY, JAN 21, 2019, THEY SAID THAT BECAUSE OF THE ORIGINAL DELIVERY AGE AND IT'S ABOUT 6 MONTHS PAST ELIGIBILITY, THAT THEY WON'T ASSIST. I FIND IT IRONIC THAT I WAS NOT NOTIFIED OF THIS SITUATION BEFORE JANUARY 2019 AND HAVE BEEN THE CAR'S SECOND OWNER SINCE JUNE 2017.  BUICK HAS KNOWN ABOUT THIS PROBLEM BUT HAS DONE NOTHING ABOUT IT.",
        "vin": "1G4HD57218U"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/12/2018",
        "dateOfIncident": "12/07/2018",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11160912,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BUICK LUCERNE. ON SEVERAL OCCASIONS, THE FUEL PUMP RELAY BECAME OVERHEATED AND MELTED. THE CONTACT WAS CONCERNED THAT A FIRE COULD OCCUR DUE TO THE PLACEMENT OF THE RELAY. THE CONTACT WAS ABLE TO REMOVE AND REPLACE THE FUEL PUMP RELAY; HOWEVER, THE FAILURE RECURRED. AN UNKNOWN DEALER WAS CONTACTED, BUT THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 135,000.",
        "vin": "1G4HD57208U"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEATS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/08/2018",
        "dateOfIncident": "11/29/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11156962,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "\"TAKATA RECALL\"RELAY TO FUEL PUMP IN FUSE BOX UNDER DRIVERS SIDE REAR SEAT. KEEPS MELTING (RELAY AND FUSE BOX) LEAVING AN ELECTRICAL FIRE SMELL IN CAR. THIS IS THE 2ND BOX AND FUEL PUMP TO BE REPLACEED IN LESS THAN 2 YEARS.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,SEATS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/04/2018",
        "dateOfIncident": "12/02/2018",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11155874,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BATTERY IS LOCATED UNDER THE BACK SEAT AND CAUGHT FLAMES YESTERDAY WITH MY SMALL CHILDREN IN THE BACK. I DONT UNDERSTAND WHY U WOULD PUT A BATTERY UNDER A PASSENGER SEAT  WHERE PEOPLE SIT ON TOP OF WITH FABRIC",
        "vin": "1G4HP57268U"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/09/2018",
        "dateOfIncident": "10/01/2018",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11150368,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2008 BUICK LUCERNE. AFTER STARTING THE VEHICLE, AN ELECTRICAL SURGE OCCURRED AND THE DRIVER NOTICED SMOKE UNDER THE HOOD. AFTER OPENING THE HOOD, FLAMES APPEARED FROM THE ENGINE COMPARTMENT. THE FIRE DEPARTMENT WAS CALLED TO THE SCENE AND EXTINGUISHED THE FLAMES. THE VEHICLE WAS DESTROYED AND TOWED AWAY. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE LOCAL DEALER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 170,000.",
        "vin": "1G4HE57Y38U"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/08/2018",
        "dateOfIncident": "05/10/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11150155,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BUICK LUCERNE. WHEN THE CONTACT TURNED THE VEHICLE, IT SHUT OFF. ALSO, WHILE DRIVING OVER A PUDDLE, WATER ENTERED THE ENGINE AND CAUSED THE ENGINE TO MOMENTARILY SHUT DOWN. THERE WAS NO WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS TAKEN TO GARBER BUICK GMC (772-467-0835, LOCATED AT 5255 US-1, FORT PIERCE, FL 34982), BUT THE TECHNICIAN WAS UNABLE TO DIAGNOSE THE FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND INFORMED THE SAME DEALER TO PERFORM A DIAGNOSTIC TEST. THE VEHICLE WAS NOT DIAGNOSED BECAUSE THE CONTACT DID NOT WANT TO BE FINANCIALLY RESPONSIBLE FOR THE TEST. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 5,000.",
        "vin": "1G4HD57298U"
    },
    {
        "components": "STEERING,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/08/2018",
        "dateOfIncident": "05/03/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11150180,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN MAKING A  TURN WHERE THERE IS A PUDDLE OF WATER, THE ENGINE DIES, AND I LOSE CONTROL OF THE POWER STEERING FOR SERVAL SECONDS, IT SEEMS TO MOSTLY HAPPEN WHEN MAKING A RIGHT TURN THROUGH WATER. I'M NOT TALKING ABOUT A LOT OF WATER. THE DEALER MAINTENANCE DEPT. THE LAST TIME I SPOKE TO THEM, AND FOR THE FIRST TIME IN 8 YEARS, OF COMPLAINING OF THIS PROBLEM, THE SERVICE MANAGER SAID IT IS BECAUSE THE ENGINE IS MOUNTED SIDEWAYS, AND WHEN THE WATER HITS THE FAN BELTS IT CAUSES IT TO SLIP, WHICH MAKES IT SEEM LIKE THE ENGINE HAS DIED. ON 10/20/2018 I HAVE REACHED OUT TO GENERAL MOTORS AND GOT NO PLACE, THEY SAID THAT THE DEALERSHIP SUGGEST THAT I BRING IT IN FOR THEM TO DIAGNOSE THE PROBLEM, AND FOR WHICH I WOULD HAVE TO PAY FOR THAT,  AND ANY REPAIRS THAT IS NEEDED, BECAUSE IT IS OUT OF WARRANTEE. THIS IS TOTALLY UNFAIR, FOR I HAVE HAD THIS PROBLEM FOR OVER 8 YEARS, 6 OF WHICH WERE UNDER WARRANTEE.  THIS IS SO WRONG WITH THE DEALERSHIP AND GENERAL MOTORS HANDLING OF THIS ISSUE THAT I FELT IT SHOULD BE BROTH TO THE ATTENTION OF YOUR DEPT. TO LOOK INTO IT, AND GET THEM TO DO A RECALL IF IT IS POSSIBLE. ON YOUR WEB SITE UNDER VEHICLE COMPLAINTS THERE ARE OTHER PEOPLE WHO HAVE COMPLAINED ABOUT THIS VERY SAME PROBLEM. SO I AM NOT THE ONLY ONE, IT IS THE CAR.",
        "vin": "1G4HD57298U"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/26/2018",
        "dateOfIncident": "10/16/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11142787,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STALLED OUT ON A HIGHWAY (AND AT HIGHWAY SPEED) AND WOULD NOT RESTART. OBVIOUSLY THIS CREATED A VERY DANGEROUS CONDITION FOR ME AND THOSE AROUND ME AS I TRIED TO COAST OVER TO THE SHOULDER (ESP WITH LOSS OF POWER STEERING AND BRAKES).  THE PROBLEM CAME WITHOUT ANY WARNING, AND WAS DETERMINED TO HAVE BEEN ISOLATED TO THE IGNITION CONTROL MODULE. MILEAGE ON THE CAR IS ONLY 43K",
        "vin": "1G4HP57228U"
    },
    {
        "components": "SEATS,ELECTRONIC STABILITY CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/12/2018",
        "dateOfIncident": "09/05/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129082,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CRANK NO START.  BACK SEAT HOUSING WAS PUSHING AGAINST FUSE BOX IN BACKSEAT CHUSHION CAUSING FUEL RELAY TO NOT WORK.  RELAY WAS DAMAGED AS A RESULT.  FUEL PUMP WAS ALSO DAMAGE",
        "vin": "1G4HD57238U"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/27/2018",
        "dateOfIncident": "05/25/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11098168,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTOMATIC DOOR LOCKS ON VARIOUS DOORS HAVE FAILED REPEATEDLY. THIS PROBLEM HAS REQUIRED ENTIRE REPLACEMENT OF THE DOOR LOCK/LATCH ASSEMBLY'S WHICH IS QUITE EXPENSIVE. FAILURE OF DOOR LOCKS IS SOMETIMES NOT IMMEDIATELY NOTICEABLE SINCE IT IS INTERMITTENT AT FIRST, UNTIL IT DOES NOT WORK AT ALL. CHILDREN OR PERSONS COULD FALL OUT OF CAR AS RESULT OF FAILED LOCKS THAT YOU THINK ARE LOCKED BUT THEY ARE NOT. YOU RELY ON THE DOOR LOCKS TO KEEP EVERYONE SAFE FROM ACCIDENTALLY OPENING THE DOORS.",
        "vin": "1G4HD57258U"
    },
    {
        "components": "UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/23/2018",
        "dateOfIncident": "03/20/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11081113,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR SHUT DOWN AND WILL TURN OVER BUT WON'T START AGAIN THE RELAY FOR THE FUEL PUMP IS MELTED AND THERE IS NO VOLTAGE GOING TO THE FUEL PUMP FUSE IN THE FUEL BOX UNDER THE BACK SEAT OF THE VEHICLE THIS SHOULD BE A RECALL DUE TO A FIRE COULD START OR THE VEHICLE COULD SHUT DOWN AT ANY MOMENT AND CAUSING A ACCIDENT AND OR DEATH",
        "vin": "1G4HF57928U"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": true,
        "dateComplaintFiled": "03/07/2018",
        "dateOfIncident": "10/22/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11076724,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "BUICK LUCERNE ELECTRICAL PROBLEMS - ONSTAR SUSPECTED. I 'M NOT SURE THAT THIS IS OR ISN'T A SAFETY PROBLEM, BUT AFTER COMPLAINING TO BUICK I WAS ADVISED BY THEM TO FILE A CLAIM(?) WITH YOU.   ABOUT A MONTH TO 6 WEEKS AFTER AN IN-TOWN ACCIDENT (10/22/16) THAT WAS REPAIRED IMMACULATELY BY THE LOCAL GM DEALER, THE CAR SAT IN A PARK AND FLY LOT FOR ABOUT 5 DAYS WHILE WE HAD GONE VISITING OUT EAST. WHEN WE GOT BACK THE CAR WAS DEAD AS A STONE. AFTER A TRIPLE A CALL WE GOT HOME AND IMMEDIATELY GOT A NEW BATTERY (12/20/16), EVEN THOUGH I WAS SURPRISED THAT IT HAD GONE DEAD BECAUSE THERE WAS NO WARNING (SLOW STARTING, ETC). HOWEVER, IN THE NEXT 6  MONTHS OR SO, TWO MORE NEW ONES WENT DEAD (2ND 1/3/17, 3RD 3/13/17) AND WERE REPLACE BY THE DEALER AT NO CHARGE.  HOWEVER, IN THE NEXT YEAR OR SO, NOT ONLY DID THE ONSTAR GO DEAD, THE BRAKES LIGHTS QUIT AND WAS REPLACED, THE CRUISE CONTROL QUIT, THE STABILTRAK QUIT, (AND BOTH WERE REPLACED).  MY INSURANCE COMPANY - AMERICAN FAMILY - INFORMED ME THAT THE ACCIDENT IS NOT THE CAUSE OF THE PROBLEMS.  SO FINALLY I TOOK IT TO ANOTHER SHOP CAS (COMPLETE AUTO SERVICE - AUSTIN) THAT DOES THE CITY'S POLICE CARS, AND THEY RAN A DIAGNOSTIC ON IT AND EVEN THOUGH THE ONSTAR HAS QUIT WORKING, BY REMOVING THE FUSE IN IT THAT 'SEEMS'  - AFTER SPENDING OVER $1300 AND STILL NOT REPLACING THE ONSTAR FOR ANOTHER $650, - TO HAVE SOLVED THE PROBLEM. AT LEAST SO FAR.",
        "vin": "1G4HD57288U"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/30/2018",
        "dateOfIncident": "01/29/2018",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11065898,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BUICK LUCERNE. THE CONTACT STATED THAT THE VEHICLE FAILED TO START WITHOUT WARNING. THE VEHICLE WAS NOT TAKEN TO AN INDEPENDENT MECHANIC OR DEALER FOR DIAGNOSTIC TESTING OR REPAIRS. THE CONTACT RESEARCHED THE FAILURE ONLINE AND FOUND COMPLAINTS RELATING TO THE FUEL PUMP RELAY BEING BURNT. THE CONTACT REMOVED THE FUEL PUMP RELAY AND NOTICED THAT IT WAS BURNT. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 81,000.",
        "vin": "1G4HD57268U"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/11/2018",
        "dateOfIncident": "01/03/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11062159,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BUICK LUCERNE. THE CONTACT STATED THAT THE VEHICLE STALLED. WINEGARDNER BUICK GMC (15113 CRAIN HWY, BRANDYWINE, MD) DIAGNOSED THAT THE FUEL PUMP CIRCUIT FAILED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE VIN WAS UNKNOWN. THE APPROXIMATE FAILURE MILEAGE WAS 143,000.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/06/2017",
        "dateOfIncident": "11/06/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11043973,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING AND VEHICLE STARTED TO STUTTER,HESITATE , THEN TOTAL LOSS OF STEERING BRAKES DIDN'T WORK PROPERLY. WE WERE ON AN OVER PASS DURING RUSH HOUR TRAFFIC BUSY INTERSECTION. FINALLY AFTER ABOUT 1 HR WE MADE IT TO AUTOZONE LIMP MODE ALL THE WAY. PURCHASED COILS X 3 , COIL IGNITION MODULE, SPARK PLUG WIRES,SPARK PLUGS, CAMSHAFT SENSOR,CRANKSHAFT SENSOR. THEN FIND OUT IT WAS ONLY A FREAKING FUSE UNDER SEAT THAT WAS BURNT AND MELTING AWAY. NOT VERY HAPPY. GM SHOULD BE HELD ACCOUNTABLE FOR KNOWING ABOUT THIS AND NOT OFFERING TO FIX IT.",
        "vin": "1G4HD57248U"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/27/2017",
        "dateOfIncident": "10/13/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11040483,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DOOR LATCH ISSUE ON  CAR THE SAME AS FORD DOOR LATCH RECALL. HAVE FOUR DOOR VEHICLE AND BOTH BACK DOORS WILL NOT OPEN DUE TO MALFUNCTIONING DOOR LATCHES. REAR PASSENGER SIDE STOP WORKING 2 YEARS AGO AND NOW DRIVERS SIDE PASSENGER DOOR HAS FAILED.",
        "vin": "1G4HD57248U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/11/2017",
        "dateOfIncident": "09/29/2017",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11032889,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BUICK LUCERNE. WHILE THE KEY WAS PLACED IN THE IGNITION, THE CONTACT ATTEMPTED TO START THE VEHICLE, BUT IT FAILED TO CRANK. THE VEHICLE WAS TOWED TO BURNS FORD INC. (188 N BROADWAY AVE, BURNS, OR 97720 (541) 573-6014) WHERE IT WAS DIAGNOSED THAT THE RELAY THAT GOES TO THE FUEL PUMP HAD MELTED AND THE RELAY NEEDED TO BE REPLACED. THERE WAS NO FIRE. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND CONFIRMED THAT NO RECALL WAS ASSOCIATED WITH THE VIN. THE APPROXIMATE FAILURE MILEAGE WAS 68,000. *LN  CARFAX CANNOT PROCESS VIN UPDATED 7/26/18*JB",
        "vin": "1G4HD572384"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/06/2017",
        "dateOfIncident": "10/04/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11032063,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL PUMP RELAY BURNT UP  IT IS UNDER BACK SEAT  REPAIR SHOP SAID THE CAR WOULD HAVE BURNT UP COMPLETELY IF CONTINUED  MY LITTLE BABIES RIDE IN BACK SEAT AS REQUIRED BY LAW I WOULD NOT GET THEM OUT IN TIME IF THE CAR ON FIRE UNDER THEM1 HELP HELP",
        "vin": "1G4HD57268U"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/14/2017",
        "dateOfIncident": "09/14/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11023559,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BUICK HAS BEEN CONSTANTLY BREAKING DOWN AND EVERY MECHANIC HAS TOLD ME THE SAME PROBLEM. IT IS THE FUEL PUMP AND THE FUSE BOX UNDER THE SEAT. I NEVER THOUGHT THAT I WOULD HAVE ANY PROBLEMS SINCE BUYING THIS CAR IN 2016. BUT, I HAVE HAD NUMEROUS PROBLEMS AND ALL I SEE ARE RECALLS ON MY BUICK. EVERYTIME I CALL IN TO COMPLAIN AND ASK ABOUT THE RECALL ITS ALWAYS SOMETHING NEW AND THAT YOU GUYS CAN'T DO ANYTHING. THIS WAS MY FIRST PURCHASE FOR MY 21ST BIRTHDAY AND I NEVER WANT A BUICK EVER AGAIN. IF THERE IS SOMEONE THAT COULD HELP ME REGARDING MY FUEL PUMP AND FUSE BOX PLEASE CONTACT ME AND MAYBE YOU COULD DO BETTER AND SEND ME THE PARTS TO FIX MY CAR. THIS IS RIDICULOUS AND I HOPE SOMEONE COULD CONTACT ME RIGHT AWAY.",
        "vin": "1G4HD57298U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/07/2017",
        "dateOfIncident": "08/02/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11022121,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BUICK LUCERNE. WHILE DRIVING VARIOUS SPEEDS, THE DRIVER SIDE TURN SIGNAL BECAME INOPERABLE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE LOCAL DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND REFERRED THE CONTACT TO NHTSA. THE FAILURE MILEAGE WAS APPROXIMATELY 32,000.",
        "vin": "1G4HP57238U"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/28/2017",
        "dateOfIncident": "07/27/2017",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11011332,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BUICK LUCERNE. ON SEVERAL OCCASIONS, THE FUEL PUMP RELAY OVERHEATED AND MELTED. UPON INSPECTION, THE CONTACT BECAME AWARE THAT THE FUSE/RELAY ENCLOSURE MELTED. THE CONTACT'S HUSBAND WAS ABLE TO REPLACE THE FUSE/RELAY ENCLOSURE, BUT THE FAILURE RECURRED. NEITHER THE DEALER NOR THE MANUFACTURER WERE CONTACTED. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 137,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/12/2017",
        "dateOfIncident": "06/01/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11004832,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS ,PUMP AND RELAY STOPPED WORKING . REPLACED PUMP THREE TIMES,   PUMP RELAY ONCE.  CAR WILL NOT START AGAIN. ANOTHER PUMP . NUMBER 4.CALLED GM CHECKED ON  RECALL NOTHING .THIS ALL WITHIN A TWO YEAR PERIOD.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/26/2017",
        "dateOfIncident": "11/28/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11001325,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS CAR'S ENGINE WOULD STOP FOR NO REASON AND NOT RESTART AT STOP SIGNS AND WHILE DRIVING.  THE POWER STEERING AND POWER BRAKES WOULD GO OUT WHEN THIS WOULD HAPPEN WHICH WAS ESPECIALLY DANGEROUS WHEN DRIVING.  IT WAS TAKEN TO THE DEALERSHIP FOR REPAIRS ON AT LEAST 4 OCCASIONS AND NEVER FIXED.  IT IS AGAIN LISTED ON THE DEALERSHIP SITE FOR SALE AFTER I TOOK A $3,000 LOSS TRADING IT IN FOR ANOTHER VEHICLE.  I WAS TOLD BY THE MANAGER THAT THE CAR WOULD NOT BE SOLD AGAIN, BUT IT IS ON THE PRE-AUCTION LOT OF THE DEALERSHIP FOR SALE AT NEARLY THE AMOUNT I PAID FOR THE VEHICLE IN NOVEMBER 2016.  IT WAS DRIVEN ABOUT 2,000 MILES IN THE 6 MONTHS I OWNED IT BECAUSE MOST OF THE TIME IT WAS BROKEN DOWN.  IT SAT IN THE DEALERSHIP LOT FOR THE LAST 2 MONTHS BECAUSE I WAS TOLD THAT THERE WAS \"NOTHING WRONG WITH YOUR CAR.\"  I TRADED IT IN RATHER THAN HAVE AN ACCIDENT WHERE EITHER MYSELF OR SOMEONE ELSE MAY BE HURT OR KILLED DUE TO THE LACK OF ABILITY TO CONTROL THE CAR WHEN THE ENGINE SHUT DOWN.  THE CAR FAX FOR THIS VEHICLE CAN BE SEEN ON LINE WITH SOME OF THE REPAIRS THAT WERE COMPLETED DURING THE TIME I OWNED IT.  THE REPAIRS WERE FOR VARIOUS SENSORS; ONE OF THEM WAS REPLACED MORE THAN ONCE.  I WAS INSTRUCTED TO BY ONE OF THE SERVICE MANAGERS TO HAVE THE CAR \"TOTALED\" BY THE INSURANCE COMPANY BECAUSE THEY WOULDN'T BE ABLE TO FIGURE OUT WHAT WAS WRONG WITH THE CAR UNLESS IT STOPPED RUNNING WHILE THEY WERE WORKING ON IT.  I HAD A VIDEO OF THE ENGINE STOPPING WHICH SHOWED THAT THERE WAS NO WARNING.  I MADE IT BECAUSE I WAS BEING ASKED WHAT LIGHTS CAME ON, ETC., BEFORE IT SHUT DOWN.  THE VIDEO WAS SHOWN TO THE SERVICE MANAGER, BUT IT WAS USELESS AS THE CAR ENGINE AGAIN STOPPED FOR NO REASON.  IT FIRST BROKE DOWN THREE DAYS AFTER I HAD PURCHASED THE CAR, BUT BEYOND THE \"NO QUESTIONS ASKED\" RETURN POLICY OF HAVING LESS THAN 150 MILES ON THE CAR DUE TO MY HAVING DRIVEN IT OVER 200 MILES.",
        "vin": "1G4HD57228U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/26/2017",
        "dateOfIncident": "06/25/2017",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11001524,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BUICK LUCERNE. THE CONTACT STATED THAT THE ELECTRONIC CONTROL PANEL AND A FUSE BOX INTERNALLY FAILED WITH A WIRES MELTED AND THE CONTACT WAS UNCERTAIN AS TO WHAT CAUSED THE FAILURE. THE VEHICLE WAS TOWED TO A REPAIR SHOP AND AN INDEPENDENT MECHANIC INSPECTED, DIAGNOSED AND REPAIRED THE VEHICLE. THE REPAIRS WERE UNKNOWN AND THE CONTACT WAS UNCERTAIN IF THE PART MAY FAIL AGAIN. THE DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": "1G4HD57258U"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/06/2017",
        "dateOfIncident": "06/02/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10993457,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR WAS PARKED AND WOULD NOT START HAD IT TOWED TO A REPAIR SHOP. THE REPAIR SHOP FOUND THE FUEL RELAY HAD OVER HEATED AND MELTED THE FUSE PANEL UNDER THE BACK SEAT. I DID SOME RESEARCH ONLINE AND FOUND ON REPAIR PAL THAT 105 OTHER PEOPLE HAD THE SAME PROBLEMS. EBAY SELLER HAS SOLD 1264 FUSE BOXES LIKE THIS ANOTHER EBAY SELLER SOLD 275 FUSE BLOCKS FOR BUICK AND GM CARS. DID SOME MORE RESEARCH FOUND PROBLEMS BACK TO 1996 2006-2011  BUICK LUCERNE'S HAD ISSUES.",
        "vin": "1G4HD57238U"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "05/03/2017",
        "dateOfIncident": "11/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10983282,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BUICK LUCERNE. THE CONTACT STATED THAT THE TIRE PRESSURE LOW WARNING INDICATOR ILLUMINATED. THE CONTACT TOOK THE VEHICLE TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE VALVE STEM FAILED AND NEEDED TO BE REPLACED. THE CONTACT HAD THE VEHICLE REPAIRED; HOWEVER, THE FAILURE RECURRED AND THE TIRE BEGAN TO LEAK. THE CONTACT HAD THE VEHICLE REPAIRED A SECOND TIME. THE FAILURE RECURRED TO THE REAR DRIVER SIDE TIRE. THE CONTACT TOOK THE VEHICLE TO THE DEALER AND THE CONTACT WAS INFORMED THAT THE PEELING OF THE CHROME ON THE RIMS CAUSED THE FAILURE, INCLUDING THE FAILED VALVE STEM. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURES AND INFORMED THE CONTACT THAT THE REPAIRS WERE NOT COVERED UNDER WARRANTY. THE APPROXIMATE FAILURE MILEAGE WAS 21,800.   UPDATED 07/12/17*LJ  *AS",
        "vin": "1G4HD57228U"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/29/2017",
        "dateOfIncident": "03/03/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10981381,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL PUMP RELAY BURNED OUT TWICE. SCORCH MARKS FROM SERIOUS OVERHEAT POSSIBLY FIRE ON BOTTOM OF REAR SEAT.  CAR STOPS IN MIDDLE OF ROAD WHEN FUEL PUMP RELAY APPEARS   TO POP LOOSE SHUTTING OFF FUEL TO ENGINE. HAVE TO PRESS AND WIGGLE RELAY TO RESTART CAR. POSSIBLE BAD CONNECTION IN FUSE BOX UNDER REAR SEAT.. RECOMMEND MAKING MANUFACTURERS BE PROHIBITED FROM INSTALLING BATTERIES AND ELECTRICAL FUSE BOX FROM INSIDE PASSENGER COMPARTMENT. HIGH FIRE HAZARD  IN CASE OF ACCIDENT!!!",
        "vin": "1G4HD57288U"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/02/2017",
        "dateOfIncident": "02/22/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10958322,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "LOST POWER WHILE DRIVING 65 MPH ON HIGHWAY WHICH CAUSED POWER STEERING AND BRAKES TO BECOME HARD TO USE. I TOOK IT TO MECHANIC AND FOUND THAT THE FUEL PUMP RELAY HAD OVER HEATED CAUSING THE FUEL PUMP TO STOP. I LOOKED ON RECALLS ON THE INTERNET AND SAW WHERE THIS HAS BECOME A COMMON PROBLEM WITH THESE CARS AND THAT GENERAL MOTORS REFUSES TO ISSUE A RECALL. THIS IS A VERY DANERVOUS CONDITION AND NEEDS TO BE CORRECTED.",
        "vin": "1G4HD57248U"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/12/2017",
        "dateOfIncident": "01/12/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10944557,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT THIS BUICK USED A COUPLE OF MONTH AGO WITH 87K. I'VE SINCE DRIVEN OVER 4K MILES. I BOUGHT THIS CAR BECAUSE IT WAS A BIG TOURING CAR AND I NEEDED SOMETHING RELIABLE AND COMFORTABLE FOR LONGS DAYS ON THE ROAD. SEVERAL HUNDRED MILES AGO IT JUST WOULDN'T START IN THE DRIVEWAY. RESEARCH LED ME TO THE FUSE BOARD. CHECKED THE FUSES AND RELAYS FOUND NOTHING OBVIOUS. CAR STARTED UP A FEW MINUTES LATER. THIS HAPPENED LATER THAT DAY WHEN IN ANOTHER CITY AND THEN A FEW MORE TIMES THAT DAY. ALMOST HAD IT TOWED BUT THEN IT STARTED. NOW, AFTER ALMOST 1000 MILES IT GAVE UP THE GHOST AND I FOUND ONE OF THE TEETH ON THE RELAY BURNED AND THE PLASTIC PARTIALLY MELTED ON THE RELAY HOUSING AND THE FUSE PANEL. WENT TO THE PARTS STORE AND BOUGHT A RELAY REPLACEMENT BUT IT DIDN'T DO ANY GOOD. SHOPPING FOR A MECHANIC NOW. MY THINKING IS I NEED TO GET RID OF IT. I TRAVEL A LOT THROUGHOUT THE SNOW BELTS IN NY STATE AND THIS BOTHERS ME IT COULD HAPPEN ON THE HIGHWAY AND EFFECT CONTROL. AND A FIRE HAZARD. WHY IS GM NOT RECALLING THIS!",
        "vin": "1G4HP57278U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/12/2017",
        "dateOfIncident": "01/04/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10944650,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL PUMP REPACED 2015 , 54000 MILEAGE , THEN FUSE BOX MELTED 1-04-2017 74000 MILEAGE AND WAS STRANDED. FOUND OUT THESE TWO PROBLEMS TIED TOGETHER FROM OTHER COMPAINTS.NO RECALLS OR ANY REIMBURSEMENT. WITH THIS MANY COMPLAINT ISSUES I FEEL SOMETHING SHOULD COME OUR WAY FOR OWNING A BIUCK WHICH I GREW UP BEING TOLD YOU CAN'T GO WRONG WITH A BUICK  ...  NOT RIGHT. $ 1300 LATER STILL WAITING!",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/11/2017",
        "dateOfIncident": "01/11/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10944474,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR WAS GARAGED AND HARDLY DRIVEN BY THE PREVIOUS OWNER, AND THE CURRENT MILEAGE IS ABOUT 43,000. SINCE THE BEGINNING OF MY OWNERSHIP THE CHECK ENGINE LIGHT COMES AND GOES RANDOMLY.  THE CAR ALSO SAYS ON THE DIGITAL READOUT \"SERVICE AIR BAG,\" PRETTY MUCH ALL THE TIME.      I HAVE HAD THREE DIFFERENT MECHANICS SCAN FOR THE ERROR CODES AND THEY COULD FIND NOTHING FOR THEM TO RECOMMEND A NEXT STEP. WHILE I WAS IN WHITE PLAINS, NY, I GOT A NOTICE FOR AN AIR BAG SERVICE RECALL FROM THE DEALER.  ALL THEY DID WAS TO PUT AN INSERT ONTO MY IGNITION KEY AFTER A TWO HOUR WAIT. WHEN I ASKED WHAT THIS HAD TO DO WITH THE CHECK AIR BAG LIGHT, THEY SAID, \"IF YOU DRIVE WITH A HEAVILY LOADED KEY CHAIN THE PULLS DOWN, THE SERVICE AIR BAG/CHECK ENGINE LIGHTS ERRONEOUSLY COME ON.\" IT WAS THE MOST STUPID THING I HAVE EVER HEARD, AND I CAN'T BELIEVE THE NHTSA WOULD HAVE ALLOWED THIS SHAM TO PASS AS A RECALL.    HAVING READ THE BULLETIN BOARD OF COMPLAINTS I SEE A NUMBER OF COMPLAINTS ABOUT AIR BAGS NOT DEPLOYING AFTER AN ACCIDENT. YOU NEED TO PUT OUT A RECALL---A REAL RECALL--ON THIS VEHICLE FOR THE AIR BAG. PLEASE FEEL FREE TO CONTACT ME.  *TR",
        "vin": "1G4HP57258U"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/04/2017",
        "dateOfIncident": "12/30/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10939760,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR 2008 BUICK LUCERNE WAS IN THE HOV LANE TRAVELING ON 84 W TOWARD HARTFORD, CT.  WITHOUT WARNING - NO WARNING LIGHTS CAME ON - THE CAR STARTED TO DECELERATE.  MY DAUGHTER TRIED TO ACCELERATE AND NOTHING HAPPENED; SHE THEN TRIED TO BRAKE TO PULL OVER AND WAS UNABLE TO FREELY TURN THE WHEEL.  SHE STRUGGLED TO MOVE TO SAFETY TO THE SHOULDER ON THE SIDE OF THE ROAD BUT THEN FELT THE STEERING WHEEL AND BRAKES LOCK COMPLETELY AS THE CAR STALLED.  WHEN SHE ATTEMPTED TO RESTART THE CAR TO MOVE TO SAFETY, THE CAR VIOLENTLY SHOOK.  SINCE THE CAR WAS STILL PARTIALLY ON THE HIGHWAY, MY HUSBAND AND I CALLED THE CT STATE POLICE TO REQUEST HELP WHILE MY DAUGHTERS WERE WAITING FOR AAA.  WHEN THE TROOPER ARRIVED ON THE SCENE HE CALLED US TO SAY THAT THE CAR WAS PARTIALLY IN THE ROAD AND THAT TWO CRUISERS WERE THERE TO ENSURE THE SAFETY OF OUR DAUGHTERS. THE CAR WAS TOWED TO OUR SERVICE STATION OF 25 YEARS IN SCRANTON PA AND FOUND THAT THE FUEL PUMP RELAY POST HAD OVERHEATED AND MELTED.  A DIAGNOSTIC TEST DID NOT REVEAL ANY PROBLEMS EITHER. THE CAR HAD TO BE TOWED ONE WEEK EARLIER TO THIS SAME STATION BECAUSE THE CAR WAS SHAKING VIOLENTLY.  AFTER A DIAGNOSTIC TEST REVEALED NOTHING, THEY DETERMINED THAT THE CAR WAS LOW ON FUEL (AND THAT IT WASN'T A FUEL PUMP ISSUE).  WE THEN DROVE THE CAR ANOTHER 517 MILES WITHOUT INCIDENT.  I HAVE FOUND THAT COMPLAINTS HAVE BEEN FILED WITH BUICK (I HAVE FILED ONE TOO) REGARDING THIS PROBLEM AND THAT FIRES HAVE RESULTED FROM THE OVERHEATING.  THESE COMPLAINTS INDICATE THAT SOMETIMES THE CAR STARTS, SOMETIMES IT DOESN'T.  I BELIEVE THESE 2 INCIDENTS, ONE WEEK APART, WERE RELATED AND THAT BOTH TIMES, NO WARNING OR DIAGNOSTIC TEST REVEALED A PROBLEM.  IF MY DAUGHTER HAD BEEN DRIVING ON THE 4 LANE HIGHWAY LEADING INTO HARTFORD AND THIS PROBLEM OCCURRED, I HAVE NO DOUBT THAT SHE AND MY OTHER DAUGHTER WOULD HAVE BEEN IN A SERIOUS, IF NOT FATAL ACCIDENT.  *TR",
        "vin": "1G4HD572X8U"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/13/2016",
        "dateOfIncident": "11/23/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10935162,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY FATHER-IN-LAW HAD THE COMPLAINT THAT HIS CRUISE CONTROL WAS NOT WORKING.  I CHECKED THE CAR OVER AND IT WAS WORKING FINE.   ON HIS WAY HOME IT QUIT WORKING AFTER ABOUT 75 MILES.  ANOTHER CHECK AND ALL WAS FINE.  SHORTLY AFTER THAT, I JUST HAPPENED TO BE FOLLOWING HIM AND THE BRAKE LIGHTS CAME ON AND NEVER WENT OFF.   I CONFIRMED WITH HIM THAT HIS FOOT WAS NOT ON THE PEDAL.   I PUT TOGETHER THAT THE BRAKE LIGHTS WERE COMING ON AND SHUTTING OFF THE CRUISE CONTROL.  HE TOOK THE CAR IN AND THEY ADDED BRAKE FLUID.   THE CRUISE CONTROL KEPT KICKING OUT.   I CAME TO THE CONCLUSION THAT THE BRAKE LIGHT SWITCH WAS EITHER OUT OF ADJUSTMENT OR DEFECTIVE AND WROTE IT DOWN  FOR HIS DEALER.  IT TURNED OUT THE SWITCH WAS DEFECTIVE AND IT WAS REPLACED.    THE CAR HAS 68,000 AND GARAGED.    AS A DRIVER YOU WON'T KNOW THE BRAKE LIGHTS ARE ON WITHOUT LOOKING OR FIND THAT THE CRUISE CONTROL WAS NOT WORKING.   WITH THE BRAKE LIGHTS PERMANENTLY ON, OTHER DRIVERS CAN'T TELL WHEN YOU ARE ACTUALLY SLOWING DOWN OR STOPPING, AND THAT IS A POTENTIAL RISK FOR BEING REAR ENDED.  MY FATHER-IN-LAW TRIED TO BE AWARE OF THIS SITUATION BY ENGAGING THE CRUISE CONTROL WHEN POSSIBLE.  AS LONG AS IT WAS WORKING, HE KNEW HIS BRAKE LIGHTS WERE  OPERATING AS THEY WERE SUPPOSE TO.       HAPPENED ON HIGHWAY AND CITY, MOVING.   BRAKE LIGHTS REMAINED ON AFTER STOPPING.   EVERYTHING WAS BACK TO NORMAL AFTER AWHILE,   I SUSPECT INSIDE TEMPERATURE WAS AT PLAY SOMEWHAT ALSO.",
        "vin": "1G4HP57258U"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/12/2016",
        "dateOfIncident": "12/11/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10934692,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BUICK LUCERNE. THE CONTACT STATED THAT THE VEHICLE WAS LEAKING FUEL FROM UNDERNEATH THE FUEL TANK AND ABOVE THE EXHAUST SYSTEM. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "1G4HD57228U"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/13/2016",
        "dateOfIncident": "06/10/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10925659,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN READY TO LEAVE WORK THE VEHICLE WOULD NOT START.  DETERMINED THE FUEL PUMP WAS NOT OPERATING.  REPLACED THE FUEL PUMP AND THE VEHICLE STILL WOULD NOT START.  I FOUND THE FUEL PUMP RELAY WAS THE ULTIMATE CAUSE OF FAILURE.  AFTER REPLACING THIS RELAY TWO OTHER TIMES I DECIDED TO LOOK FURTHER INTO THE CAUSE.  I DISMANTLED THE  FUSE BOX TO FIND IT WAS NOT COMPLETE INSIDE.  THE FUSE BOX IS FILLED WITH FEMALE TO FEMALE COUPLERS TO CONNECT THE BOTTOM WIRING HARNESS TO THE FUSES.  THE FUEL PUMP RELAY SHOULD HAVE FOUR OF THE COUPLERS INSTALLED IN THE FUSE BOX.  THERE ARE ONLY THREE INSTALLED.  THE MALE PINS ARE LONG ENOUGH TO TOUCH AND MAKE CONTACT.  THEY WILL EVENTUALLY OVERHEAT.  THIS IS A MANUFACTURING DEFECT AND A FIRE HAZARD; AS MANY PEOPLE HAVE HAD THE ISSUE.  BUICK STILL HAS NOT ISSUED A SAFETY RECALL AND REFUSES TO ACTUALLY INVESTIGATE THE REASON THIS IS HAPPENING.  THE AVERAGE CONSUMER IS BEING HIT WIT A $400.00 FUSE BOX AND $600.00 FUEL PUMP REPLACEMENT.  I ACTUALLY HAVE SINCE INSTALLED MY ORIGINAL FUEL PUMP.  THE REPLACEMENT PUMP DID NOT HAVE A SENDING UNIT FOR THE FUEL GAUGE.  WHY ARE THE DEALERS REPLACING PROBABLY PERFECTLY FINE FUEL PUMPS.  THIS HAS BECOME A RACKET.",
        "vin": "1G4HD57258U"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/30/2016",
        "dateOfIncident": "10/17/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10920076,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE STALLED AFTER STARTING AND DRIVING  ABOUT 20 YARDS IN A PARKING LOT. THEN WOULD CRANK BUT NOT START AND HAD BURNING SMELL INSIDE CAR. HAD TOWED TO DEALER AND THEY FOUND A MELTED FUEL PUMP RELAY AND FUSE BOX LOCATED UNDER REAR SEAT. THEY SAID THERE WAS A POTENTIAL FIRE HAZARD IF DIDN'T REPLACE FUSE BOX TOO. CAR HAD 106,079 MILES AT TIME.  *TR",
        "vin": "1G4HD57218U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/10/2016",
        "dateOfIncident": "10/07/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10915016,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRIC COMPONENTS OF FUEL DELIVERY SYSTEM SHORT CAUSING FIRE HAZARD. THE FUEL PUMP, FUEL PUMP RELAY, AND UNDER SEAT FUSE PANEL MALFUNCTION CAUSING THE RELAY AND FUSE PANEL TO OVERHEAT AND MELT DOWN.  THE HEAT BUILDS WHILE DRIVING OR WHILE STARTING.  THIS HAPPENED THREE TIMES IN A WEEK.",
        "vin": "1G4HP57228U"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/23/2016",
        "dateOfIncident": "09/02/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10909322,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BUICK LUCERNE. THE CONTACT STATED THAT THE VEHICLE FAILED TO START. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE FUEL BOX FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 135,000.",
        "vin": "1G4HD57268U"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/07/2016",
        "dateOfIncident": "07/26/2016",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10904282,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JULY 26, 2016, WHILE DRIVING ON CLEVELAND DRIVE, LOTS OF SMOKE STARTED COMING OUT FROM UNDER THE HOOD OF THE CAR THEN ALL OF A SUDDEN FIRE STARTED TO SHOOT OUT AS WELL.  THERE WERE NO ISSUES PREVIOUSLY WITH THE CAR AS IT WAS IN PERFECT CONDITION INSIDE AND OUT.  I CONTACTED BUICK TO SEE IF THE CAR WAS EVER RECALLED BUT IT WAS NOT, HOWEVER, IT PROBABLY SHOULD HAVE BEEN.  NOW I AM WITHOUT A CAR BECAUSE IT WAS DEEMED A TOTAL LOSS.  I ATTACHED PICTURES BUT DID NEED TO UPLOAD THE FIRE DEPT REPORT.",
        "vin": "1G4HD572X8U"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/13/2016",
        "dateOfIncident": "08/12/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10895497,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WOULD CRANK OVER BUT WOULD NOT START. HAD FUEL PUMP AND BURNT RELAY REPLACED AND AND AN HOUR LATER THE CAR FUEL RELAY FAILED DUE TO OVERHEATING.",
        "vin": "1G4HD57298U"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/04/2016",
        "dateOfIncident": "08/01/2016",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10893058,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BUICK LUCERNE. THE CONTACT STATED THAT AFTER SHUTTING THE VEHICLE OFF, THE VEHICLE WOULD NOT IMMEDIATELY RESTART. WHILE INSPECTING THE VEHICLE IT WAS DISCOVERED THAT THE FUSE BOX AND FUEL PUMP HAD MELTED. THE CAUSE OF THE FAILURE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 125,000.",
        "vin": "1G4HD57208U"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/09/2016",
        "dateOfIncident": "06/09/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10873525,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL RELAY BURNT SO REPLACED FUEL PUMP AND RELAY AND MY BRAND NEW RELAY JUST BURNT UP WHILE SITTING IN DRIVEWAY MY WIFE WAS DRIVING THE CAR WHEN CAR STOPPED AS SHE WAS LEAVING THE PARKING LOT OF A FRIENDS HOME WHERE I CHANGED THE FUEL PUMP AND FOUND OUT RELAY WAS BURNT AND NOW IT'S MELTING RELAYS",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/06/2016",
        "dateOfIncident": "05/25/2016",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10872704,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BUICK LUCERNE. WHILE DRIVING APPROXIMATELY 70 MPH, A STRONG BURNING ODOR WAS PRESENT. THE CONTACT DROVE HOME AND SHUT OFF THE VEHICLE. TWO HOURS LATER, THE VEHICLE WOULD NOT START AND WAS TOWED TO AN INDEPENDENT MECHANIC. IT WAS DIAGNOSED THAT THE REAR FUSE BOX TERMINAL BURNED AND NEEDED REPLACEMENT. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 62,100.",
        "vin": "1G4HD572X8U"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/23/2016",
        "dateOfIncident": "03/21/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10851180,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL PUMP SHORTS OUT AND MELTS THE FUSE BOX  THIS WAS WITH THE CAR PARKED IN THE DRIVEWAY COULD BE A FIRE HAZARD IF THIS HAPPENS YOU LOSE ALL CONTROL OF THE CAR AND MAKES IT A DEATH TRAP",
        "vin": "1G4HP57268U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/26/2016",
        "dateOfIncident": "02/05/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10838636,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BUICK LUCERNE. THE CONTACT STATED THAT THE VEHICLE HAD AN ABNORMAL BURNING SMELL AND WOULD NOT OPERATE. IN ADDITION, THE CRUISE CONTROL DID NOT OPERATE. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE FUSE BOX OVERHEATED AND MELTED, WHICH CAUSED THE FUEL PUMP AND VARIOUS OTHER ELECTRICAL COMPONENTS TO MALFUNCTION. THE TECHNICIAN DIAGNOSED THAT THE FUEL PUMP AND FUSE BOX NEEDED TO BE REPLACED. THE VEHICLE NEEDED TO BE RECALIBRATED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 92,000...UPDATED 05-10-16 *BF  UPDATED 6/14/18*JB",
        "vin": "1G4HD57288U"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/30/2015",
        "dateOfIncident": "12/23/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10817035,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STREERING PUMP WENT BAD HAD TO REPLACE AT 79,000 MILES ALSO UNDERSEAT FUSE BLOCK BURNED OUT FUEL PUMP RELAY STOPPED WORKING THIS HAPPENED IN MY DRIVEWAY.   *JS",
        "vin": "1G4HD572280"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/09/2015",
        "dateOfIncident": "11/09/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10809221,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BUICK LUCERNE. THE CONTACT STATED THAT THE VEHICLE BECAME INCREASINGLY DIFFICULT TO SHIFT OUT OF PARK. THE FAILURE OCCURRED WITHOUT WARNING. THE VEHICLE WAS TOWED TO THE DEALER, BUT THE FAILURE COULD NOT BE DIAGNOSED. PRIOR TO THE FAILURE, THE VEHICLE WAS PREVIOUSLY REMEDIED UNDER NHTSA CAMPAIGN NUMBER: 14V355000 (ELECTRICAL SYSTEM). THE FAILURE OCCURRED APPROXIMATELY SIX TIMES. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 21,800.",
        "vin": "1G4HD57268U"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "12/07/2015",
        "dateOfIncident": "09/01/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10808731,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BUICK LUCERNE. THE CONTACT STATED THAT THE FRONT PASSENGER SIDE SEAT BELT BUCKLE DID NOT LOCK INTO PLACE AND THE PASSENGER SIDE SEAT BELT BUCKLE WARNING LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE SEAT BELT NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 8,000.  UPDATED 02/19/16*LJ  UPDATED 05/04/18*JB",
        "vin": "1G4HD57278U"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "11/04/2015",
        "dateOfIncident": "11/02/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10788295,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS CONCERNS MY 2008 BUICK LUCERNE, IT HAS THE CASHMERE INTERIOR COLOR. SOMETHING I HAVE JUST FOUND OUT. GM DOES NOT MAKE AN IMPORTANT REPLACEMENT INTERIOR PART ANYMORE. PN: 20954443 IS NOT AVAILABLE FROM ANY DEALER IN THE U.S. THIS IS A SEAT TRIM PART FOR THE OUTSIDE OF THE PASSENGER SEAT. IT CRACKS FROM NORMAL USE BECAUSE IT IS FORCED TO FLEX WHEN A PERSON SITS IN THE PASSENGER SEAT, OVER TIME THIS FLEXING CRACKS THE PART. THE CRACKED PART THEN HAS SHARP EDGES WHICH CATCHES CLOTHING, AND COULD CAUSE LEG CUTS. AS A SIDE NOTE, THE SHALE COLORED PART IS PN: 15273992, AND THE TITANIUM PN: IS 15273994 (THIS PART I WAS ABLE TO STILL FIND, AND I WILL HAVE TO PAINT IT CASHMERE TO MATCH MY CAR). THESE PARTS FIT ALL THE \"NOT HEATED SEATS\" LUCERNE MODELS FROM 2006 TO 2011, THOUSANDS OF CARS I SUSPECT.  THE DRIVER'S SIDE TRIM PART (MIRROR OPPOSITE) IS STILL AVAILABLE FROM A FEW SOURCES. IT ALSO FALLS AND CRACKS FOR THE SAME REASON. HAS GM PULLED THIS PART FROM INVENTORY FOR A REDESIGN? IT HAS BEEN JUST FOUR YEARS SINCE THAT LAST BUICK LUCERNE WAS SOLD, THE 2011 MODEL; IT SHOULD BE POSSIBLE TO FIND REPLACEMENT PARTS.",
        "vin": "1G4HD57208U"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/22/2015",
        "dateOfIncident": "10/21/2015",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10785427,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2008 BUICK LUCERNE. WHILE DRIVING AT 45 MPH, THE VEHICLE LOST POWER AND BEGAN TO EMIT SMOKE. THE CONTACT OPENED THE HOOD AND THE VEHICLE BURST INTO FLAMES. THE FIRE DEPARTMENT EXTINGUISHED THE FIRE. A POLICE REPORT WAS FILED AND THERE WERE NO INJURIES REPORTED. THE VEHICLE WAS TOWED AND DESTROYED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 63,200.",
        "vin": "1G4HD57268U"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/12/2015",
        "dateOfIncident": "08/15/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10781450,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE OUT OF TOWN WHEN CAR FAILED TO START, NOT BATTERY RELATED.  HAD TO BE TOWED TO SERVICE CENTER WHERE THEY DIAGNOSED, INSPECTED, AND REPLACED THE FUEL PUMP RELAY.  ON 10/01/2015, 2000 MILES LATER SIMILAR INCIDENT EXCEPT THIS TIME MY LOCAL MECHANIC. HE CLEANED ALL CAVITIES, APPLIED DIELECTRIC GREASE, CHECKED THE FUEL PUMP AMPERAGE AT 7.5,  TIGHTENED ALL RELAY CONTACTS AND REPLACED RELAY.  BAD RELAY HAD SCORCH MARKS AROUND SEVERAL PINS.  ON 10/07, 500 MILES LATER, SAME SCENARIO EXCEPT THIS TIME REPLACED FUEL PUMP MODULE.  ON 10/10, AGAIN NO START, SIMILAR, SYMPTOMS.  MECHANIC CAME TO MY HOUSE ON 10/12, COULD GET CAR TO START AFTER SEVERAL TRIES, TESTING AND MANIPULATION OF COMPONENTS , BUT IMMEDIATELY SHUT IT DOWN SINCE RELAY WAS VERY HOT. CONCERNED OVER SAFETY, HAD TO REPLACE THE WHOLE MODULE.  REPLACEMENT MODULE WAS DEFINITELY AN UPGRADE TO ORIGINAL AND WAS SUCH BECAUSE OF, I UNDERSTAND, THE FAILURES EXPERIENCED WITH THE ORIGINALS AND CONCERN OVER STARTING A FIRE.  I NOW UNDERSTAND THAT SEVERAL FIRES RESULTED FROM THIS PROBLEM.  FORTUNATELY, ALTHOUGH TREMENDOUSLY INCONVENIENCED BOTH IN TIME AND EXPENSE, NO ONE IN OUR FAMILY WAS INJURED NOR WERE WE THE CAUSE OF ANY ACCIDENT WHICH ON THE HIGHWAY COULD HAVE BEEN DISASTROUS.",
        "vin": "1G4HD57288U"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/02/2015",
        "dateOfIncident": "09/23/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10779179,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVING A PROBLEM WITH THE CAR NOT STARTING. IT WAS STATIONARY IN THE GARAGE. HAD IT TOW TO GARAGE. THEY DIAGNOSED IT WAS A FUEL RELAY BURNING UP. A NEW RELAY DID START THE CAR.WE TOOK A SHORT TRIP OUT OF TOWN AND THE CAR STOPPED RUNNING...LEFT US STRANDED ON THE HIGHWAY. THE RELAY GAVE OUT AGAIN. A MECHANIC WILL NOW LOOK INTO THE FUEL PUMP REPLACEMENT. AND ELECTRICAL BOX UNDER THE SEAT.",
        "vin": "1G4HP57238U"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/29/2015",
        "dateOfIncident": "09/24/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10778350,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BUICK LUCERNE. WHILE HAVING ROUTINE MAINTENANCE PERFORMED ON THE VEHICLE, AN INDEPENDENT MECHANIC DISCOVERED THAT THE MOTOR MOUNT HAD BECOME INOPERABLE AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 93,000.",
        "vin": "1G4HD57208U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/10/2015",
        "dateOfIncident": "06/25/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10762977,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BUICK LUCERNE. WHILE DRIVING AT AN UNKNOWN SPEED, AN ABNORMAL CLUNKING SOUND EMITTED FROM THE REAR PASSENGER SIDE OF THE VEHICLE. THE VEHICLE WAS TAKEN TO A DEALER. THE TECHNICIAN WAS UNABLE TO DIAGNOSE THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 97,000.",
        "vin": "1G4HD57258U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/04/2015",
        "dateOfIncident": "08/05/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10746186,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BUICK LUCERNE. UPON TRAVELING OVER A PUDDLE OF WATER, THERE WAS A SUDDEN LOSS OF POWER STEERING. THE CONTACT EXPERIENCED THE STEERING WHEEL BECOMING EXTREMELY TIGHT UPON TRYING TO TURN LEFT AND RIGHT WHEN THERE WAS EXCESSIVE RAIN. THE VEHICLE WAS TAKEN TO THE DEALER MORE THAN TWICE. THE TECHNICIAN WAS UNABLE TO REPLICATE OR DIAGNOSE THE FAILURE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND PROVIDED NO REMEDY. THE FAILURE MILEAGE WAS NOT AVAILABLE. MA 09/25",
        "vin": "1G4HD57268U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/29/2015",
        "dateOfIncident": "06/27/2015",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10730945,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BUICK LUCERNE. AFTER THE VEHICLE WAS DRIVEN FOR APPROXIMATELY 100 MILES, THE CONTACT PARKED THE VEHICLE. WHEN THE IGNITION WAS TURNED TO THE ON POSITION, THE ENGINE DID NOT START. THE CONTACT NOTICED A BURNING ODOR COMING FROM THE REAR OF THE VEHICLE. THE CONTACT REPLACED THE RELAYS AND THE ENGINE RESTARTED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 57,000. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/23/2015",
        "dateOfIncident": "06/22/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10726878,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL PUMP STOPPED WORKING, REPLACED THEN FOUND OUT FUSE BOX UNDER BACK SEAT WAS MELTED AND HAD TO BE REPLACED. COULD HAVE STARTED A FIRE.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/20/2015",
        "dateOfIncident": "05/18/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10717554,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FUEL PUMP RELAY OVERHEATED AND MELTED IN THE FUSE BOX. I HAD TO HAVE THE RELAY AND FUSE BOX REPLACED. THE MECHANIC TOLD ME THAT THE FUSE BOX COULD HAVE STARTED A FIRE. HE TOLD ME TO GOOGLE THE PROBLEM WITH MY CAR BECAUSE HUNDREDS OF OTHER CAR OWNERS HAVE HAD THE SAME PROBLEM. SURE ENOUGH I DID JUST THAT AND I SAW HUNDREDS OF PEOPLE WITH THE SAME COMPLAINT ABOUT THIS MODEL CAR.  GM NEEDS TO BE HELD ACCOUNTABLE. ARE THEY WAITING UNTIL SOMEBODY DIES FIRST BEFORE THEY ACKNOWLEDGE THE PROBLEM OF THE FUEL PUMP RELAY AND THE FUSE BOX? BTW I HAD TO REPLACE THE FUEL PUMP.",
        "vin": "1G4HP57228U"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/11/2015",
        "dateOfIncident": "05/11/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10715711,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BUICK LUCERNE. WHILE STOPPED AT A TRAFFIC LIGHT AND ACCELERATING, THERE WAS A THUMPING NOISE THAT CAME FROM THE FRONT OF THE VEHICLE. THE FAILURE RECURRED ON SEVERAL OCCASIONS. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THAT THE  MOTOR MOUNT NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 41,000.",
        "vin": "1G4HP57278U"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/16/2015",
        "dateOfIncident": "11/28/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10672936,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BUICK LUCERNE. THE CONTACT STATED THAT WHILE DRIVING AT APPROXIMATELY 50 MPH, ALL WARNING LIGHTS ILLUMINATED AND A LOUD NOISE EMERGED FROM THE ENGINE ALONG WITH SMOKE. A POLICE REPORT WAS NOT FILED. THE VEHICLE WAS TOWED TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE ENGINE FAILED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 130,000.    UPDATED 2/24/15*CN  UPDATED 03/02/15*JB",
        "vin": "1G4HE57Y28U"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/12/2015",
        "dateOfIncident": "01/02/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10671951,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BUICK LUCERNE. THE CONTACT STATED THAT THE TIRES DEFLATED WHEN SALT FROM THE ROAD CAME IN CONTACT WITH THE WHEELS. THE VEHICLE WAS DIAGNOSED, BUT NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 23,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/27/2014",
        "dateOfIncident": "12/26/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10668454,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING DOWN HIGHWAY AND VEHICLE STALLED FOR NO REASON.  ENGINE LIGHT DID NOT COME ON.  ATTEMPTED TO START, BUT NOTHING HAPPENED...NO CLICK, NO CRANK, NOTHING.  HAD TO WAIT 10 MIN. UNTIL KEY START ATTEMPT DID ANYTHING AND THEN RAN FINE.  HAVE BEEN DRIVING IN TOWN ~35MPH AS WELL AS SLOWER SPEEDS AND VEHICLE WILL DO THE SAME THING...STALL.  ATTEMPTED TO START, BUT NOTHING HAPPENED...NO CLICK, NO CRANK, NOTHING.  HAD TO WAIT 10 MIN. UNTIL KEY START ATTEMPT DID ANYTHING AND THEN RAN FINE.  THIS HAS HAPPENED APPROXIMATELY 12 TIMES IN THE LAST 2 MONTHS.  THE GM RECALL (SOLUTION WAS A KEY INSERT) HAS BEEN PERFORMED AND THIS ISSUE HAS OCCURRED BEFORE AND AFTER THE RECALL FIX.  *TR",
        "vin": "1G4HP57228U"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/24/2014",
        "dateOfIncident": "12/12/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10668177,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BUICK LUCERNE. THE CONTACT STATED THAT WHILE DRIVING AT APPROXIMATELY 10 MPH, THE VEHICLE MADE A LOUD ABNORMAL NOISE AND STALLED. THE VEHICLE WAS ABLE TO RESTART BUT THE CONTACT WAS UNABLE TO DRIVE. THE VEHICLE WAS TOWED TO THE DEALER BUT THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 57,000.",
        "vin": "1G4HD57258U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/17/2014",
        "dateOfIncident": "10/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10659536,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 BUICK LUCERNE RECALL ON THE WEIGHT ON THE KEY RING.  CAR WENT DEAD IN THE PARKING LOT.  *MW  THE IGNITION COIL AND MODULE WERE REPLACED. *JB",
        "vin": "1G4HD57208U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/16/2014",
        "dateOfIncident": "10/15/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10659529,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 BUICK LUCERNE  THE CONSUMERS WIFE WAS STOPPED AT AN INTERSECTION WHEN SHE SUDDENLY REALIZED THE ENGINE WAS NO LONGER ON AND THE VEHICLE DID NOT MOVE. THE VEHICLE WOULD NOT RE-START AND HAD TO BE TOWED TO THE DEALER.   DIAGNOSIS WAS THAT THE \"IGNITION MODULE\" HAD DEFAULTED.  *MW  THE CONSUMER STATED THE IGNITION FAILED, ONE DAY PRIOR TO RECEIVING THE RECALL NOTICE IN THE MAIL. *JB",
        "vin": "1G4HD57258U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/16/2014",
        "dateOfIncident": "07/28/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10659543,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 BUICK LUCERNE. THE CAR STALLED AND LOST POWER STEERING AND BRAKE CAPABILITY ON A NARROW COUNTRY ROAD. *TA  THE CONSUMER RECEIVED A RECALL LETTER ON AUGUST 21, 2014. THE PROBLEM REGARDING THE IGNITION IN RECALL, DESCRIBED THE PROBLEM SHE EXPERIENCED. *JB",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/03/2014",
        "dateOfIncident": "11/03/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10661985,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BUICK LUCERNE. THE CONTACT STATED THAT WHILE DRIVING AT APPROXIMATELY 35 MPH, THE LANE DEPARTURE WARNING SYSTEM BECAME INOPERABLE AND THE WARNING INDICATOR ILLUMINATED. THE FAILURE RECURRED ON A DAILY BASIS. THE VEHICLE WAS TAKEN TO A DEALER. THE TECHNICIAN DIAGNOSED THAT THE VEHICLE'S WARNING CAMERA NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE FAILURE MILEAGE WAS 29,000.  UPDATED 01/07/14*LJ    THE CONSUMER STATED THE \"LANE DEPARTURE WARNING SYSTEM\" FAILURE OCCURRED DIRECTLY AFTER THE IGNITION RECALL REPAIR WAS PERFORMED.   UPDATED 10/7/2015  *JS",
        "vin": "1G4HD57258U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/01/2014",
        "dateOfIncident": "10/06/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10654370,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 BUICK LUCERNE. CONSUMER STATES HE RECEIVED A RECALL NOTICE IN THE MAIL, AND ALSO MADE AN APPOINTMENT BUT HE WAS TOLD IT WOULD TAKE ONE MONTH TO FIX THE VEHICLE.*SS",
        "vin": "1G4HP57208U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/20/2014",
        "dateOfIncident": "11/20/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10659854,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BUICK LUCERNE. THE CONTACT RECEIVED A NOTIFICATION FOR RECALL NHTSA CAMPAIGN ID NUMBER: 14V355000 (ELECTRICAL SYSTEM) AND STATED THAT THE PART NEEDED WAS UNAVAILABLE TO REPAIR THE VEHICLE. THE DEALER WAS UNABLE TO INFORM WHEN THE PART WOULD BECOME AVAILABLE. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE VIN WAS UNAVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/19/2014",
        "dateOfIncident": "10/20/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10659254,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "A WARNING MESSAGE CAME ON TO SAY SERVICE AIR BAG. WHEN I TOOK IT IN FOR THE RECALL REPAIR, I ASKED THE SERVICE DEPARTMENT TO CHECK FOR THE WARNING MESSAGE ON THE AIR BAG. I WAS TOLD I WOULD HAVE TO HAVE MY AIR BAG MODULE REPLACE. MY CAR IS ONLY 6 YEARS OLD. WHY WOULD AN AIR BAG MODULE NEED TO BE REPLACED ON SUCH A NEW CAR? I EXPRESSED MY CONCERNS TO GM. I EVEN ASKED FOR MY MONEY BACK FOR THE COST OF REPAIR BECAUSE I JUST COULDN'T AND CAN'T IMAGINE A CAR THIS NEW NEEDING SUCH A REPAIR. THERE MAY BE MORE CARS LIKE MINE OUT THERE WHOSE AIR BAG MODULE HAVE OR NEED TO BE REPLACED. I WANTED THE REPAIR MADE BECAUSE I WAS AFRAID THAT MY AIR BAG MAY NOT DEPLOY WHEN NEEDED OR PERHAPS DEPLOY UNNECESSARILY.  *TR",
        "vin": "1G4HP57228U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/14/2014",
        "dateOfIncident": "08/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10644624,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BUICK LUCERNE. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 14V355000 (ELECTRICAL SYSTEM); HOWEVER, THE PARTS NEEDED TO REPAIR THE VEHICLE WERE NOT AVAILABLE. THE DEALER STATED THAT THE CONTACT HAD TO WAIT FOR THE SECOND RECALL NOTIFICATION. THE SECOND NOTIFICATION WAS RECEIVED, BUT THE PARTS WERE STILL NOT AVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE DELAY. THE VEHICLE WAS NOT REPAIRED. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "2G4WC582481"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/06/2014",
        "dateOfIncident": "08/04/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10641766,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BUICK LUCERNE. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 14V355000 (ELECTRICAL SYSTEM); HOWEVER, THE PART NEEDED TO REPAIR THE VEHICLE WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "1G4HD572X8U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/06/2014",
        "dateOfIncident": "10/06/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10641825,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BUICK LUCERNE. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 14V355000 (ELECTRICAL SYSTEM); HOWEVER, THE PART NEEDED TO REPAIR THE VEHICLE WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "1G4HD57248U"
    },
    {
        "components": "STEERING,SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "10/01/2014",
        "dateOfIncident": "05/21/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10638955,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 BUICK LUCERNE. CONSUMER WRITES IN REGARDS TO POWER STEERING AND BRAKE FAILURE, THAT WAS A CONSTANT ISSUE. *TGW  THE CONSUMER WAS INVOLVED IN AN ACCIDENT, WHERE THE STEERING AND BRAKES FAILED. *JB",
        "vin": "1G4HD57288U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/01/2014",
        "dateOfIncident": "10/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10639969,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 BUICK LUCERNE.  CONSUMER WRITES IN REGARDS TO EXPRESS DISCONTENT WITH A LOCAL DEALERSHIP. *TGW   THE CONSUMER STATED THE RECALL WAS PERFORMED, BY HER LOCAL MECHANIC AND SHE SHOULD BE REIMBURSED. RECALL #10V240000     *JB",
        "vin": "1G4HD57228U"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/30/2014",
        "dateOfIncident": "09/26/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10640292,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BUICK LUCERNE. WHILE DRIVING APPROXIMATELY 55 MPH, THE CRUISE CONTROL FAILED. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSTIC TESTING AND WAS REPAIRED, BUT THE FAILURE RECURRED. THE CONTACT WAS UNAWARE OF THE SPECIFIC REPAIRS TO THE VEHICLE. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 50,000. UPDATED 12/01/14*LJ",
        "vin": "1G4HD572X8U"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/29/2014",
        "dateOfIncident": "06/21/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10639889,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BUICK LUCERNE. WHILE DRIVING 25 MPH, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS TOWED TO THE DEALER. THE TECHNICIAN STATED THAT THE IGNITION COIL AND MODULE NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED. THE FAILURE MILEAGE WAS 24,863.    UPDATED 12/2/14*CN   UPDATED 05/7/2015  *JS",
        "vin": "1G4HP57298U"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/25/2014",
        "dateOfIncident": "08/23/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10638961,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I BEGAN TO ENTER A MAJOR HIGHWAY MY TRANSMISSION FAILED, CAR WOULD NOT DRIVE FORWARD.  I ALMOST WAS STRUCK MY AN EIGHTEEN WHEELER(TRACTOR-TRAILER).  THE FORWARD DRIVE BAND COMPLETELY BROKE IN THE TRANSMISSION SUDDENLY WITHOUT WARNING.",
        "vin": "1G4HD57208U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/24/2014",
        "dateOfIncident": "07/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10638686,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BUICK LUCERNE. THE CONTACT STATED THAT THE VEHICLE FAILED TO TURN OFF WHEN THE KEY WAS IN THE IGNITION. THE VEHICLE ALSO FAILED TO RESPOND WHEN THE CONTACT ATTEMPTED TO START THE VEHICLE. THE VEHICLE HAD NOT BEEN DIAGNOSED OR REPAIRED. THE VEHICLE WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 14V355000 (ELECTRICAL SYSTEM); HOWEVER, THE PART NEEDED TO REPAIR THE VEHICLE WAS UNAVAILABLE. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 35,000.",
        "vin": "1G4HD57218U"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/19/2014",
        "dateOfIncident": "06/13/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10637628,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BUICK LUCERNE. THE CONTACT'S VEHICLE CRASHED INTO FOUR OTHER VEHICLES. THE AIR BAGS FAILED TO DEPLOY. A POLICE REPORT WAS FILED AND THERE WERE NO INJURIES REPORTED. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC, BUT WAS NOT DIAGNOSED OR REPAIRED. THE CONTACT MENTIONED THAT A RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 14V355000 (ELECTRICAL SYSTEM) WAS RECEIVED IN AUGUST OF 2014. THE CONTACT STATED THAT THE PART NEEDED TO REPAIR THE VEHICLE WAS UNAVAILABLE. THE MANUFACTURER WAS NOTIFIED. THE FAILURE MILEAGE AND SPEED WERE NOT AVAILABLE.",
        "vin": "1G48P57248U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/17/2014",
        "dateOfIncident": "09/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10632855,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 BUICK LUCERNE.  CONSUMER WRITES IN REGARDS TO VEHICLE KEY RECALL NOTICE AND STATES NOT SURE REPAIRS WILL BE A REMEDY.  *SMD  ACCORDING TO THE RECALL NOTICE, THE PARTS WERE NOT AVAILABLE. *JB",
        "vin": "1G4HD57228U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/16/2014",
        "dateOfIncident": "08/15/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10633561,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, I WENT OVER A BUMP IN THE ROAD.  THE DASHBOARD LIGHTS AND BELL STARTED FLASHING,  AND MESSAGE CENTER SAID \"ENGINE POWERING DOWN\", THEN IMMEDIATELY SAID \"ENGINE POWERED OFF\".  THERE WAS NO POWER STEERING OR BRAKES.  I WAS ABLE TO PULL SOMEWHAT OFF THE SIDE OF THE ROAD.  I TURNED THE KEY, AND NO RESPONSE.  AFTER APPROX. FIVE MINUTES, I TRIED THE KEY AGAIN, AND THE  CAR STARTED (NOT SMOOTHLY), AND WAS FINE.  AFTER ONE WEEK, THE SAME THING HAPPENED WHILE DRIVING  AT APPROX. 20 MPH (AUG 24), AND AGAIN HAPPENED WHILE DRIVING 45 MPH (AUG 27).    EACH TIME, WE WERE FORTUNATELY NOT  AROUND OTHER VEHICLES.  AFTER THE SECOND STALL, WE RECEIVED A RECALL NOTICE FROM GM FOR  THE IGNITION SWITCH.  TALKED TO THE RECALL CENTER, WHO TOLD US IT WAS NOT UNDER THE RECALL  BECAUSE WE DID NOT KNOW IF THE KEY HAD ACTUALLY TURNED OFF.  WE HAD TAKEN ALL OTHER KEYS  AND FOBS OFF THE KEY, BUT THE THIRD INCIDENT OCCURRED ON AUGUST 27.  WE THEN TOOK THE CAR TO THE GM DEALER WHO DID A DIAGNOSTIC CHECK ON SEPTEMBER 2.  HE FOUND A LOOSE GROUND WIRE, AND FELT IT WAS FIXED.  WE PICKED UP THE CAR, DROVE APPROXIMATELY 1.5 MILES AND THE CAR STALLED AGAIN. WHEN IT STARTED, WE  DROVE IT BACK TO THE GM DEALERSHIP. IT HAS NOW BEEN AT THE  GM DEALER SINCE SEPTEMBER 2.  THEY CONTINUE TO TEST DRIVE AND RUN DIAGNOSTIC CHECKS  AND NOTHING SHOWS UP.  WE HAVE CONTACTED GM RECALL CENTER THREE TIMES SINCE, AND HAVE  HAD NO RETURN PHONE CALLS.  *TR",
        "vin": "1G4HD57288U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/15/2014",
        "dateOfIncident": "08/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10633178,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BUICK LUCERNE. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 14V355000 (ELECTRICAL SYSTEM); HOWEVER, THE PART NEEDED TO REPAIR THE VEHICLE WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "1G4HP572X8U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/12/2014",
        "dateOfIncident": "09/11/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10632722,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BUICK LUCERNE. WHILE DRIVING APPROXIMATELY 65 MPH, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER STATED THAT THE VIN WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 14V355000 (ELECTRICAL SYSTEM). THE FAILURE MILEAGE WAS 31,126.  UPDATED 11/12/14*LJ  UPDATED 92/03/15.*JB",
        "vin": "1G4HD57278U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/10/2014",
        "dateOfIncident": "09/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10631833,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 BUICK LUCERNE.  CONSUMER WRITES IN REGARDS TO DASHBOARD LIGHTS ISSUES AND VEHICLE KEY FOB RECALL NOTICE.  *SMD    THE CONSUMER STATED THE DASHBOARD LIGHTS WOULD GO OUT. ESPECIALLY, IN THE EVENING. BY THE TIME HE ARRIVED AT THE DEALER, THE LIGHTS WOULD COME BACK ON. THE PARTS FOR THE RECALL, WERE NOT AVAILABLE. *JB",
        "vin": "1G4HD57268U"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/10/2014",
        "dateOfIncident": "07/07/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10632149,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BUICK LUCERNE. WHILE DRIVING APPROXIMATELY 30 MPH AND CHANGING LANES, ANOTHER VEHICLE CRASHED INTO THE DRIVER SIDE OF THE CONTACT'S VEHICLE. THE SIDE AIR BAGS FAILED TO DEPLOY. A POLICE REPORT WAS FILED. THE DRIVER SUSTAINED BACK AND NECK INJURIES THAT REQUIRED MEDICAL ATTENTION. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO INDICATED THAT THE AIR BAGS DID NOT DEPLOY DUE TO A FAILED IGNITION SWITCH. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 93,000.",
        "vin": "1G4HE57YX8U"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/29/2014",
        "dateOfIncident": "08/24/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10629413,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BUICK LUCERNE. WHILE DRIVING AT AN UNKNOWN SPEED, THE ENGINE STALLED. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC. THE TECHNICIAN DIAGNOSED THAT THE FUSE BLOCK WAS DEFECTIVE AND CAUSED THE FUEL PUMP MODULE TO FAIL. THE VEHICLE WAS REPAIRED AND THE MANUFACTURER WAS NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 77,602. UPDATED 09/24/14*LJ..UPDATED 09/25/14 *BF    THE CONSUMER STATES THE VEHICLE WOULD NOT START. HOWEVER WHILE DRIVING ON 9/13 AT VARIOUS SPEEDS THE ENGINE DIED. IT DIED ONCE AGAIN FOR THE MECHANIC.THE DIAGNOSTIC SHOWED THE VEHICLE WAS NOT RECEIVING FUEL.   UPDATED 2/24/2015 *JS",
        "vin": "1G4HD57278U"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/26/2014",
        "dateOfIncident": "07/09/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10628433,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BUICK LUCERNE. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 35 MPH, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS NOT ABLE TO RESTART AND WAS TOWED TO AN INDEPENDENT MECHANIC. THE TECHNICIAN DIAGNOSED THAT THE CLUTCH FUSE ASSEMBLY, INSULATOR HARNESS AND INSULATOR COIL NEEDED TO BE REPLACED. THE MANUFACTURER HAD NOT BEEN NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 70,000.    UPDATED 9/29/14*CN     UPDATED 2/25/2015 *JS",
        "vin": "1G4HD57298U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": true,
        "dateComplaintFiled": "08/26/2014",
        "dateOfIncident": "07/16/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10628516,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL-THE CONTACT OWNS A 2008 BUICK LUCERNE. THE CONTACT STATED WHILE DRIVING APPROXIMATELY 15 MPH, THE BRAKE PEDAL WAS DEPRESSED AND FAILED TO RESPOND. AS A RESULT, THE CONTACT CRASHED INTO FOUR VEHICLES AND THE AIR BAGS FAILED TO DEPLOY. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC FOR REPAIRS. THE FRONT END, THE FRONT DRIVER'S SIDE DOOR AND MIRROR WERE REPLACED. THE CONTACT RECEIVED A NOTIFICATION FOR RECALL NHTSA CAMPAIGN ID NUMBER: 14V355000 (ELECTRICAL SYSTEM). HOWEVER, THE PARTS NEEDED FOR THE REPAIRS WERE UNAVAILABLE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 63,000. PAM",
        "vin": "1G4HP57248U"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/22/2014",
        "dateOfIncident": "03/03/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10627555,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BUICK LUCERNE. THE CONTACT STATED THAT WHILE ENGAGING THE BRAKES, THE BRAKES MALFUNCTIONED CAUSING THE VEHICLE TO SURGE FORWARD. THE CONTACT INDICATED THAT THE FAILURE WAS INTERMITTENT. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 45,000.",
        "vin": ""
    },
    {
        "components": "STEERING,SUSPENSION,SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/21/2014",
        "dateOfIncident": "09/01/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10627305,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "IN AUGUST OF 2011 I PURCHASED WHAT WAS SUPPOSED TO BE A CERTIFIED PRE-OWNED BUICK SUPERIOR BUICK.  I HAD NUMEROUS PROBLEMS THAT I TRIED TO GET FIXED UNDER WARRANTY(SUSPENSION, THERMOSTAT, AIR BAGS, STEERING ETC.) OR GOOD FAITH (ONLY BRAKES) JUST TO NAME A FEW, AND TRIED TO GET A REFUND UNDER MY WARRANTY OR DIFFERENT CAR WITHIN THE FIRST 72 HOURS/150 MILES OF RESIGNING MY CONTRACT AND WAS DENIED. I MADE NUMEROUS TRIPS TO THE DEALERSHIP TO GET THESE PROBLEMS SERVICED AND WAS TOLD EVERY TIME THAT NOTHING WAS WRONG, THEY FOUND DEBRIS HERE A SCREW THERE, TIGHTENED THIS, BLAMED IT ON THIS ETC. THEY NEVER FIXED OR REPLACED  ANYTHING BUT A WATER PUMP AND A COUPLE OF ELECTRICAL BULBS (THE SAME ONES). AFTER AT LEAST 5 ATTEMPTS TO GET IT FIXED( PER LAWS SET FORTH) I HAD A COUPLE OF FACE-TO- FACE MEETINGS WITH THE G.M./PART OWNER  LOUIS FALLER. DURING THESE MEETINGS, HE TELLS ME EVERYTHING FROM YOU GOT A LEMON, THAT HE BELIEVED THE CAR WAS WRECKED PRIOR, TO THAT HE FIRED A COUPLE OF EMPLOYEES FOR PUTTING BAD CARS ON HIS LOT AND NOT FIXING THEM PROPERLY UNDER WARRANTY, AMONGST OTHER THINGS. SO AFTER NO LUCK WITH A REFUND I BEGAN TO GET OPINIONS WHICH UNCOVERED EVERYTHING FROM PRIOR DAMAGE TO SEVERAL THINGS WRONG WITH THE SUSPENSION IN LATE 2012 ETC. SO IN LATE 2013, AFTER ALL THE THINGS PROGRESSED TO REALLY BAD AND I GOT MY X-MAS BONUS I BEGAN FIXING IT AND REACHED OUT TO HENDRICK CORPORATE. THEY LIED TO ME AND SAID THEY WOULD GIVE ME AT LEAST THE MONEY FOR FIXING WHAT I ALREADY FIXED AND THAT I HAD TO GET REST FROM DEALERSHIP. THEY LATER TOOK IT BACK CAUSE I WASN'T SIGNING OVER NO RIGHTS BECAUSE I STILL HAD SEVERAL THOUSAND IN DAMAGES. SO I REACHED OUT G.M. CUSTOMER SERVICE AND EXECUTIVE BRANCHES. THEY WERE LIKE AUTOMATED PUPPETS. PLEASE REFER TO ATTACHMENTS.  THE RIGHT FRONT BEARING, WAS REPLACED. THERE WAS AN ISSUE WITH THE ANTI-LOCK BRAKES THE RIGHT FRONT STRUT SHIELD WAS STICKING AND MAKING A CLICKING SOUND, THE TIRES WERE CUPPING, CREATING A RUMBLING SOUND, TIE RODS NEEDED TO BE REPLACED, THE PRESSURE LINE FROM THE POWER STEERING WAS LEAKING.",
        "vin": "1G4HD572X8U"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/06/2014",
        "dateOfIncident": "08/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10618565,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 BUICK LUCERNE. CONSUMER WRITES IN REGARDS TO VEHICLE STOPPED SEVERAL TIMES WHILE DRIVING.  *SMD  THE CONSUMER STATED FOUR MECHANIC'S WORKED ON THE VEHICLE, AND THEY WERE UNABLE TO FIX IT.  THE CONSUMER NO LONGER OWNS THE VEHICLE. *JB",
        "vin": "1G4HP572980"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/01/2014",
        "dateOfIncident": "06/13/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10607494,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I RAN OFF ROAD AND HIT A TREE. NOTED WHITE SMOKE BUT AIRBAG DID NOT DEPLOY. SEAT BELT IN USE. ONLY MINOR INJURIES. INSURANCE COMPANY TOTALED CAR. REPORTED INCIDENT TO GM. THEY REPLIED WITH PHONE NUMBER WHICH LED TO VOICE MAIL AND NO ANSWER.  *TR",
        "vin": "1G4HD57208U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/23/2014",
        "dateOfIncident": "12/15/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10605386,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2008 BUICK LUCERNE.  I HAD APPROXIMATELY 78,200 MILES ON THE CAR. IN DECEMBER  2013   I WAS PLAYING MUSIC IN MY  VEHICLE WITH OUT THE CAR BEING ON. THE CAR BATTERY WAS DRAINED BUT, WHAT SURPRISING TO ME WAS THE FACT THAT I COULDN'T GET THE KEY TO MOVE (UP OR DOWN/ IN OR OUT ) THE IGNITION .   AFTER WAITING 45 MINUTES FOR AAA,  ALL IT TOOK WAS A JUMP, AND THE KEY WAS RELEASED .  SO I    *TR",
        "vin": "1GH4D57238U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/23/2014",
        "dateOfIncident": "12/15/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10605410,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "IN DECEMBER OF 2013 I WAS PLAYING MUSIC IN MY VEHICLE,  ( 2008, BUICK LUCERNE)  THE BATTERY GOT GO DRAINED. THE THING THAT SURPRISED ME WAS THE FACT THAT AFTER,  THE BATTERY WAS DRAINED THE IGNITION CEASED.  I COULDN'T MOVE THE KEY UP/DOWN OR IN/OUT OF THE IGNITION. I THINK THAT THIS COULD HAVE BEEN VERY SERIOUS IF I HAD LOST POWER ON THE HIGH WAY. (ALTERNATOR OR BATTERY) WHEN AAA CAME ON THE SCENE  AS SOON AS THEY HOOKED UP MY VEHICLE TO A PORTABLE BATTERY AND, TURNED IT ON THE KEY WAS RELEASED IMMEDIATELY.  *TR",
        "vin": "1GH4D57238U"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/11/2014",
        "dateOfIncident": "03/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10597690,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BUICK LUCERNE. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 50 MPH, ANOTHER VEHICLE CRASHED INTO THE CONTACT'S VEHICLE WHEN IT FAILED TO YIELD THE RIGHT-OF-WAY. THE FRONT FENDER AND BALL JOINT WERE DAMAGED.  ADDITIONALLY, THE DRIVER'S SIDE FRONT AND SIDE AIR BAGS FAILED TO DEPLOY.  THE CONTACT WAS UNINJURED AND THE VEHICLE WAS REPAIRED.  THE MANUFACTURER WAS NOT NOTIFIED.  THE FAILURE MILEAGE WAS 60,000.    UPDATED 8/15/14*CN     UPDATED 08/26/2014 *JS",
        "vin": "1G4HD57288U"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "05/29/2014",
        "dateOfIncident": "05/02/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10594776,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Sumitomo Rubber Industries, Ltd.",
                "productMake": "SUMITOMO",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "ONE TIRE SHREDDED AT 70 MPH WITH LESS THAN 12,000 MILES ON THEM. HAD FULL PRESSURE ONE MOMENT AND FAILED THE NEXT.   I NOTICED ALL 3 OTHER  TIRES DEVELOPED BUBBLES CLOSE TO THE TREAD AND 2 OTHERS STARTED LEAKING A WEEK LATER.  SUMITOMO DEALER LOCALLY REFUSED TO REPLACE OR HONOR WARRANTY.   *TR",
        "vin": "1G4HD57288U"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/27/2014",
        "dateOfIncident": "05/24/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10594201,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE ACCELERATING ON THE ON RAMP TO A BUSY INTERSTATE HIGHWAY, ACCELERATOR PEDAL STUCK TO FLOOR. (NO FLOOR MATS OR OTHER ITEMS WERE IN THE ANY WAY RESPONSIBLE FOR THIS.) CAR CONTINUED ACCELERATING, AND PEDAL CONTINUED TO STICK TO THE FLOOR DESPITE REPEATED ATTEMPTS TO GET IT TO RELEASE. RPM'S WERE OVER 4500.  SINCE I COULDN'T GET THE ACCELERATOR PEDAL TO RELEASE, I SHIFTED TO NEUTRAL.  ABOUT 20 SECONDS AFTER SHIFTING, RPM'S WENT DOWN TO NORMAL AND PEDAL RELEASED.  AT THAT TIME I COULD GET THE CAR TO SLOW DOWN TO A NORMAL SPEED.  *TR",
        "vin": "1G4HE57Y48U"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/27/2014",
        "dateOfIncident": "05/23/2014",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10594231,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BUICK LUCERNE. THE CONTACT STARTED THE IGNITION AND A FEW MOMENTS LATER THE ENGINE STALLED. THE CONTACT WAS A CERTIFIED MECHANIC, WHO REPLACED THE BURNED FUEL PUMP RELAY SWITCH. THE FAILURE RECURRED TWICE AND THE VEHICLE WAS REPAIRED EACH TIME. THE MANUFACTURER WAS NOT NOTIFIED OF THE DEFECT. THE APPROXIMATE FAILURE MILEAGE WAS 60,000.",
        "vin": "1G4HD57248U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/23/2014",
        "dateOfIncident": "05/10/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10593646,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BUICK LUCERNE.  THE CONTACT STATED  WHILE TRAVELING 55 MPH, THERE WAS A BURNING SMELL THROUGHOUT THE VEHICLE. A PRIVATE MECHANIC REPLACED THE STARTER RELAY SWITCH; HOWEVER WHEN THE CONTACT STARTED THE VEHICLE THE FOLLOWING DAY THE FUSE BOX WAS BURNED OUT. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED AND STATED THAT THE FUSE BOX NEEDED TO BE REPLACED. THE FAILURE MILEAGE WAS 42,000 AND THE CURRENT MILEAGE 44,000.",
        "vin": "1G4HD57248U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/22/2014",
        "dateOfIncident": "07/01/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10583797,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 BUICK LUCERNE.  CONSUMER WRITES IN REGARDS TO DOOR LOCKING PROBLEMS.  *SMD  THE CONSUMER STATED THE DOORS WOULD LOCK ON THEIR OWN. A FEW WEEKS AGO, THE DOORS LOCKED WITH THE CONSUMER STILL INSIDE THE VEHICLE, AND SHE WAS UNABLE TO GET OUT, EVEN THOUGH SHE PRESSED THE UNLOCK BUTTON. THE DOOR LOCK PROBLEM WAS INTERMITTENT.  ALSO, THE VEHICLE STALLED, AND THE VEHICLE HAD TO BE TOWED. THE IGNITION , MODULE WAS REPLACED. *JB",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/02/2014",
        "dateOfIncident": "04/01/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10576944,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "INSTRUMENT PANEL GAUGES ARE DIFFICULT TO READ ON 2008 BUICK LUCERNE     I HAVE A 2008 BUICK LUCERNE WITH AN INSTRUMENT PANEL LIGHTING PROBLEM. MOST OF THE TIME THE GAUGES ARE VERY DIFFICULT TO READ. BUICK HAS AN ONGOING PROBLEM WITH THIS PROBLEM. THE EARLIEST CARS THAT I'VE FOUND TO EXHIBIT THIS PROBLEM ARE 2003 BUICKS. THE LATEST IS 2013. BUICK DOES NOT ACKNOWLEDGE THIS PROBLEM AND STONEWALLS WHEN ASKED TO ASKED CORRECT IT. I BELIEVE IT IS A SAFELY ISSUE AND SHOULD BE CORRECTED. BELOW ARE TWO OF THE MANY SITES WHERE OWNERS ADDRESS THE PROBLEM. HTTP://CAR-AND-SAFETY.COM/BUICK-DIGITAL-INSTRUMENT-PANEL.HTM HTTP://WWW.ABOUTAUTOMOBILE.COM/COMPLAINT/2006/BUICK/LUCERNE/INSTRUMENT+PANEL.  *TR",
        "vin": "1G4HD57218U"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/27/2014",
        "dateOfIncident": "11/23/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10567194,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WOULD NOT START, AND THE FUEL RELAY FUSE HAD BLOWN, DAMAGING THE FUSE BOX.  FUSE WAS REPLACED AND ON DEC 4, 2013 THE CAR WOULD NOT START AGAIN.  NEW FUSE BLOCK HAD TO BE INSTALLED.  MECHANIC'S DIAGNOSES SAID THE FUEL PUMP WAS NOT RECEIVING GOOD VOLTAGE AT TIME, FURTHER INSPECTION AND TESTING SHOWED UNDER THE REAR SEAL LEFT SIDE FUSE BLOCK IS RECEIVING GOOD VOLTAGE BUT SENDING A LOW VOLTAGE SIGNAL TO THE FUEL PUMP.  FURTHER INVESTIGATION SHOWS A BURNT AND MELTED HIGH RESISTANCE CONNECTION AT THE FUEL PUMP RELAY.  NORMALLY, I UNDERSTAND THE FUSE NEXT TO THE RELAY SHOULD HAVE BLOWN.  PROBLEM SEEMS TO STEM WITH THE FUSE BOX AND THERE WAS ONLY ONE AVAILABLE IN THE UNITED STATES ON 12/4/2013 WHICH I GOT.  MY MECHANIC WAS TOLD THEY ARE ON NATIONAL BACKORDER AND IT COULD TAKE UP TO 6 MONTHS TO RECEIVE ONE.  SO THERE IS AN OBVIOUS PROBLEM WITH THESE FUSE BOXES.",
        "vin": "1G4HD57228U"
    },
    {
        "components": "STRUCTURE,SEATS,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "12/12/2013",
        "dateOfIncident": "01/04/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10555863,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SOMETIME BETWEEN 1998 AND 2008 THE BUICK LINE, AND ALMOST ALL OTHER LINES, ENLARGED THE SIZE OF THE COLUMNS SUPPORTING THE ROOF, MODIFIED THE FRONT SIDE WINDOWS TO ADD A SMALL TRIANGLE OF MATERIAL AT THE FRONT OF THE WINDOWS, AND RAISED THE HEIGHT OF THE SIDE MIRRORS AND RAISED THE HEIGHT OF THE \"DASH\" ABOVE THE INSTRUMENT CLUSTER.   I AM IN EXCESS OF 6 FT TALL AND THIS HAD LITTLE IMPACT ON MY FIELD OF VISION. MY WIFE IS LESS THAN 5 FT AND AGE IS TAKING A TOLL ON BOTH OF US AND THIS HAS A SEVERE IMPACT ON HER FIELD OF VISION, EVEN WITH THE USE OF BOOSTER PILLOWS. THE CURRENT MODELS HAVE THE SAME DESIGN FLAW, EXCEPT FOR THE HONDA CIVIC AND THE FORD FUSION.    I HAVE PERSONALLY \"TESTED\" THIS CONDITION BY LOCATING MYSELF AT AN INTERSECTION WHERE SEVERAL CRASHES, SOME FATAL, AND \"SCROOCHING\" DOWN AS BEST I COULD TO SIMULATE A 5 FT PERSON WITH THE SEAT AT ITS MAX HEIGHT, AND THERE IS A CRITICAL LOSS OF VISIBILITY, PARTICULARLY TO THE RIGHT. THERE WERE THREE CRASHES, ALL INVOLVED SENIORS, THAT WERE IN A COLLISION BECAUSE THEY PROCEEDING, AFTER STOPPING, TO CROSS THE INTERSECTION IN FRONT OF ONCOMING TRAFFIC.    I HEARTILY SUPPORT YOUR PROPOSAL TO DEVELOP SOME TYPE OF RECOMMENDATIONS, OR \"RATING\", FOR VEHICLES THAT ARE THE MOST APPROPRIATE FOR SENIORS.    THANK YOU.  *TR",
        "vin": "1G4HD57248U"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/30/2013",
        "dateOfIncident": "11/28/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10554201,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WENT TO OPEN DRIVER SIDE DOOR WHEN THE HANDLE PULLED OUT FROM THE CAR.  *TR",
        "vin": "1G4HP57248U"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "10/24/2013",
        "dateOfIncident": "10/10/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10549325,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BUICK LUCERNE. THE CONTACT STATED THAT AFTER EXITING THE VEHICLE, SHE MANUALLY LOCKED THE PASSENGER AND THE REAR DOORS. WHEN THE CONTACT RETURNED TO THE VEHICLE, THE DOORS WERE UNLOCKED. THE VEHICLE WAS TAKEN TO TAKEN TO THE DEALER FOR DIAGNOSIS. THE CONTACT WAS ADVISED THAT THE LATCH LOCK ASSEMBLIES WERE FAULTY. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE INCIDENT. THE APPROXIMATE FAILURE MILEAGE WAS 56000.",
        "vin": "1G4HP57298U"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/19/2013",
        "dateOfIncident": "08/18/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10536081,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR DROVE PERFECTLY FINE IN THE MORNING. EARLY AFTERNOON I WENT TO DRIVE THE CAR AND ALTHOUGH IT CRANKED, IT DID NOT  AND WOULD NOT START. I TOOK IT THE DEALER WHO INFORMED ME THAT THE FUEL PUMP PULLED TOO MUCH AMPERAGE, CAUSING THE RELAY AND THE FUSE BOX TO BURN. HE STATED I WAS LUCKY THE CAR DID NOT CATCH ON FIRE. HE FURTHER ADVISED ME THAT I HAD TO CHANGE ALL THREE PARTS AT A COST OF OVER $1600!!    I DID FURTHER RESEARCH AND DISCOVERED THAT THIS IS A KNOWN AND COMMON PROBLEM WITH THE 2008 BUICK LUCERNE. I AM AMAZED THAT I WAS NOT ADVISED OF THIS POTENTIAL LIFE THREATENING PROBLEM AND THAT EVEN WITH THE KNOWLEDGE, GM DID NOT ISSUE A RECALL. I HAVE ASKED GM TO PAY FOR THE FIXING OF THIS PROBLEM, BUT THUS FAR THERE HAS NOT BEEN ANY DECISION AS TO WHAT THEY WILL DO.    I NEED GM TO FIRST PAY TO FIX THE PROBLEM, AND SECOND TO ISSUE A RECALL BEFORE SOMEONE GETS KILLED.  *TR",
        "vin": "1G4HD57288U"
    },
    {
        "components": "TIRES,WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/15/2013",
        "dateOfIncident": "07/15/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10525035,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "OWNER PUT NEW GOODYEAR ASSURANCE TIRES ON THE VEHICLE ON 12/31/10 AT A GOODYEAR DEALERSHIP.  IN SPRING 2013 ALL FOUR TIRES STARTED LOSING AIR, AND THE LOW TIRE PRESSURE LIGHT ON THE DASH ILLUMINATED.  THE OWNER BROUGHT THE CAR BACK TO THE GOODYEAR DEALER, WHO STATED THAT THE TIRES ARE FINE, BUT THAT THE OEM CHROME WHEELS ARE DEGRADING, CAUSING SMALL GAPS FOR THE AIR TO LEAK OUT.  NOW IN SUMMER 2013 THE AIR LEAKS OUT SO QUICKLY THAT THE LOW TIRE PRESSURE LIGHTS COME ON IN LESS THAN ONE WEEK AFTER A COMPLETE REFILLING.  THE GOODYEAR DEALER STATES THAT THE ONLY WAY TO FIX THIS PROBLEM WILL BE TO REPLACE THE WHEELS.   *TR",
        "vin": "1G4HD57258U"
    },
    {
        "components": "SUSPENSION,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/09/2013",
        "dateOfIncident": "06/01/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10523874,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS STOPPED WITH ENGINE RUNNING AND AIR CONDITIONER FAN ON HIGH. I TURNED THE WIPERS ON TO CLEAN WINDSHIELD. IMMEDIATELY I WAS OVERCOME WITH EXTREME BURNING IN MY EYES I COULD NOT OPEN THEM. I REACHED FOR DOOR HANDLE AND GOT OUT. I WAS IN A PANIC, HAVING NO IDEA WHAT HAPPENED. I ASKED 2 PEOPLE FOR HELP,THE SECOND PERSON CAME TO MY CAR AND WE SEARCHED CAR FOR SOMETHING BURNING AND FOUND NOTHING. I WAS AFRAID TO GET BACK INTO MY CAR.I HAVE NEVER EXPERIENCED A BURNING IN MY EYES AS THIS. I FELT HELPLESS BECAUSE NO ONE WITNESSED THIS FREAK INCIDENT. FINALLY I USED WET PAPER TOWELS AND COVERED ALL THE AC VENTS AND DROVE HOME IN FEAR THAT IT WAS GOING TO HAPPEN AGAIN. THERE IS NO DOUBT WHAT SO EVER IF I WAS DRIVING WHEN THIS HAPPENED I WOULD OF CRASHED. I COULD NOT SEE.  WHEN TUBING BROKE THE FLUID LANDED ON A HOT ENGINE PAET AND THE WATER EVAPORATED AND THE METHANOL VAPORS CAME THROUGH THE AC VENTS DIRECTLY INTO MY FACE. THE BUICK DEALER DIDN'T MENTION OR DISCUSS THIS PLASTIC TUBING BE REPLACED. HE JUST PUT A PIECE OF RUBBER TO HOLD THE ENDS OF BROKEN PLASTIC TUBING. IM VERY UNCOMFORTABLE USING WIPERS NOW BECAUSE AS I MENTIONED IF IT WERE TO HAPPEN WHILE DRIVING I MIGHT AS WELL BE BLIND. I WANT TO KNOW IF THE TUBING IS NOT SUPPOSE TO EVER BREAK AND MORE SO, WHY DID IT COME THROUGH THE AC VENTS THAT WAS ON HIGH.?  *TR",
        "vin": "1G4HP57208U"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/05/2013",
        "dateOfIncident": "07/05/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10523251,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BUICK LUCERNE. THE CONTACT STATED THAT WHILE ENTERING THE VEHICLE, THE DRIVER'S SIDE DOOR HANDLE DETACHED FROM THE VEHICLE. THE VEHICLE WAS NOT REPAIRED AND THE MANUFACTURER WAS NOT NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 85,000.  *TR",
        "vin": "1G4HP57288U"
    },
    {
        "components": "STRUCTURE,FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "04/06/2013",
        "dateOfIncident": "03/19/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10507357,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN MY WIFE WAS PARKING THE CAR IN A SHOPPING CENTER PARKING LOT, THE ENGINE ROARED (EVEN THOUGH SHE HAD HER FOOT ON THE BRAKE) AND THE VEHICLE JUMPED OVER THE CURB AND STRUCK SMALL BUSHES AND TREES IN THE MEDIAN BETWEEN THE STEIN MART AND HOME DEPT PARKING LOTS CAUSING DAMAGE TO THE FRONT GRILL AND DRIVER SIDE FRONT FENDER.  MY WIFE WAS NOT INJURED LUCKILY.    HAD THIS EVENT OCCURRED UNDER NORMAL DRIVING CONDITIONS SOMEBODY COULD HAVE BEEN SERIOUSLY INJURED AND OR KILLED DEPENDING UPON THE CIRCUMSTANCES.  I HAD A SIMILIAR INSTANCE ABOUT A YEAR AGO WHEN THE CAR SURGED FORWARD WHILE I WAS STOPPED AT A INTERSECTION.  MY FOOT WAS ON THE BRAKE AND I GOT THE CAR STOPPED.   I CONTINUED TO DRIVE THE CAR AND DID NOT EXPERIENCE ANY FURTHER PROBLEMS.  I THOUGHT IT MIGHT HAVE BEEN A STUCK ACCELERATOR LINKAGE THAT CLEARED.   I'VE SINCE LEARNED THE NEWER VEHICLES ARE DRIVE BY WIRE CONTROLLED.  THEIR IS NO DIRECT THROTTLE LINKAGE FROM THE GAS PEDAL.   THE VEHICLE IS CURRENTLY AT A BUICK DEALERS BODY SHOP BEING REPAIRED..  THEIR SERVICE MANAGER STATED THEY WOULD READ THE COMPUTER CODES AND USE A SCAN TOOL TO DETERMINE WHAT CAUSED THE ACCIDENT.    AN ACCIDENT REPORT WAS RECORDED BY THE LOCAL POLICE DEPARTMENT.  *TR",
        "vin": "1G4HD57298U"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/13/2013",
        "dateOfIncident": "01/21/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10502692,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKE LIGHTS WOULD PERIODICALLY COME ON WHILE DRIVING WITHOUT ME TOUCHING THE BRAKE PEDAL AT ALL. IT ALSO CONTINUALLY TRIPPED MY CRUISE CONTROL. GM  DEALERSHIP DID THE REPAIRS. *TR",
        "vin": "1G4HP572X8U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/05/2013",
        "dateOfIncident": "02/01/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10496477,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS TURNING A CORNER IN THIS VEHICLE THE ENGINE SUDDENLY STOPPED RUNNING. AS I WAS ON A LIGHTLY TRAVELED STREET INSIDE A DEVELOPMENT I WAS ABLE TO STOP NEAR THE CURB. I ATTEMPTED TO RESTART THE CAR BUT IT WOULD NOT START. I CALLED FOR ASSISTANCE AND A FLAT BED TOW TRUCK CAME AFTER 1 HOUR. THE CAR WAS TAKEN TO A BUICK DEALER THAT I NORMALLY USE.   THE PROBLEM WAS DIAGNOSED AS THE FAILURE OF THE IGNITION MODULE AND 3 IGNITION COILS THAT WERE SUPPOSEDLY DAMAGED BY THE FAILING IGNITION COIL.   I FEEL THAT THIS IS A SERIOUS PROBLEM AS THE SUDDEN LOSS OF POWER CAUSED THE POWER STEERING AND BRAKING TO CEASE. IF I HAD BEEN ON A BUSY HIGHWAY OR INTERSTATE IT COULD HAVE RESULTED IN AN CRASH AS A RESULT OF THE LACK OF CONTROL OF THE VEHICLE.  I BELIEVE I WAS FORTUNATE TO BE ON A LIGHTLY TRAVELED ROAD INSIDE A DEVELOPMENT.  *TR",
        "vin": "1G4HD57278U"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/18/2012",
        "dateOfIncident": "08/01/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10489149,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL GAUGE IS INACCURATE. READS UP TO 1/4 TO 1/2 TANK TOO FULL OR TOO EMPTY. TOOK IT TO GM REPAIR FACILITY (DEALER) 5 TIMES WHERE NUMEROUS AND DIFFERENT REPAIRS WERE DONE OVER THE COURSE OF ABOUT 7 MONTHS, BUT STILL NOT FIXED. HAVE TO KEEP FILLING THE TANK SINCE FUEL LEVEL IS UNKNOWN. COLLISION HAZARD IF RUN OUT OF FUEL WHILE DRIVING.  *TR",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/18/2012",
        "dateOfIncident": "03/20/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10489153,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "HORIZONTAL EXTERIOR CHROME DOOR TRIMS LOOSE AT THE ENDS AT TIME OF PURCHASE AND HAVE WORSENED. TOOK CAR IN TO GM REPAIR FACILITY (DEALER) 3 TIMES WHO REPLACED THEM, BUT CONDITION ALWAYS RETURNED. WAS TOLD THAT IF I BROUGHT IT IN AGAIN FOR REPLACEMENT, IT WOULD HAPPEN AGAIN. CANNOT HAVE CAR WASHED BY A FACILITY THAT USES ROTATING BRUSHES SINCE THE BRUSHES WOULD PROBABLY TEAR OFF THE DOOR TRIMS AND DAMAGE THE EXTERIOR PAINT WITH THEM. HAVE TO WASH CAR BY HAND.  *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/18/2012",
        "dateOfIncident": "04/26/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10489164,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES LIGHTS WOULD COME ON BY THEMSELVES WHILE DRIVING OR WHILE PARKED WITHOUT DEPRESSING THE BRAKE PEDAL. ALSO CRUISE CONTROL WOULD BE DISABLED WITHOUT USING THE BRAKE OR ANY SWITCH TO DISABLE IT. TOOK IT TO A GM REPAIR FACILITY (DEALER) WHO RECALIBRATED THE BRAKE PEDAL SWITCH, BUT THE CONDITION RETURNED. TOOK IT TO AN INDEPENDENT REPAIR FACILITY WHO RECALIBRATED THE BRAKE PEDAL SENSOR. THAT INDEPENDENT REPAIR FACILITY THOUGHT THAT THE CRUISE CONTROL PROBLEM WAS RELATED TO THE BRAKE LIGHTS COMING ON BY THEMSELVES. HAZARD: SOMEONE DRIVING BEHIND COULD CONFUSE THE BRAKE LIGHTS COMING ON AS A SIGN THAT THE CAR WAS SUDDENLY STOPPING, WHICH MIGHT CAUSE THE CAR FOLLOWING TO SLAM ON THEIR BRAKES AND CAUSING AN ACCIDENT.   *TR",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/18/2012",
        "dateOfIncident": "04/21/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10489157,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "INSIDE CENTER PILLAR (COLUMN BETWEEN FRONT AND REAR) TRIMS HAD GAPS WHERE TRIMS DIDN'T COVER THE OPENING. TOOK CAR TO A GM REPAIR FACILITY (DEALER) 4 TIMES. THEY INSTALLED CLIPS BUT STILL THERE IS A GAP ON ONE.  *TR",
        "vin": ""
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "12/18/2012",
        "dateOfIncident": "03/20/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10489159,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING HOME AFTER PURCHASING THE CAR, THE ONSTAR SYSTEM KEPT STATING THAT WE WERE OFF COURSE (IT DIDN'T RECOGNIZE WHERE THE CAR WAS). ONSTAR ATTEMPTED TO REPAIR IT REMOTELY, WHICH DIDN'T WORK. TOOK CAR TO A GM REPAIR FACILITY (DEALER) WHO ATTEMPTED A REPAIR. AFTER THAT, ONSTAR WOULD OCCASIONALLY DIAL A NUMBER BY ITSELF USING THE BUILT IN CELL PHONE WITHOUT MY INITIATING THE CALL, AND ALSO WOULD HANG UP BY ITSELF WHILE I WAS TALKING TO AN ONSTAR REPRESENTATIVE. THE GM REPAIR FACILITY (DEALER) SAID THERE WAS NO PROBLEM, BUT ONSTAR VERIFIED THAT THEY CALLED THE DEALER AND ADVISED THEM THAT THERE WAS A PROBLEM.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/18/2012",
        "dateOfIncident": "08/01/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10489169,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THREE DOOR LOCKS CEASED WORKING AT VARIOUS TIMES REGARDLESS OF USING A KEY FOB OR THE SWITCH ON THE INSIDE OF THE DOOR. TWO WERE REPAIRED AT A GM REPAIR FACILITY (DEALER). THAT GM REPAIR FACILITY ATTEMPTED TO FIX THE 3RD ONE, BUT WAS UNSUCCESSFUL. IT IS AGGRAVATING TO HAVE TO LOOK AT ALL 4 DOORS EACH TIME THE CAR IS UNLOCKED OR LOCKED TO CHECK THE POSITION OF THE LOCK KNOB. HAZARD: IF THE DOOR WOULD NOT LOCK WHEN THE CAR IS LEFT PARKED, IT MIGHT BE EASILY BROKEN INTO, OR IF THE DOOR DIDN'T UNLOCK IN AN EMERGENCY, IT MIGHT TRAP SOMEONE INSIDE.  *TR",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/18/2012",
        "dateOfIncident": "01/25/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10489155,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "OUTSIDE DRIVER'S CHROME DOOR HANDLE PULLS OFF WHEN OPENING THE DOOR. TOOK IT TO A GM REPAIR FACILITY (DEALER) WHO REPLACED IT, BUT SAME PROBLEM RETURNED WITH THE NEW HANDLE. WAS TOLD BY AN EMPLOYEE AT A GM DEALER THAT THEY ARE AWARE OF THE PROBLEM WITH THE CHROME DOOR HANDLE. HAZARD: IF A THIEF PULLS ON THE HANDLE WHILE CAR IS IN A PARKING LOT, OR WHEN CAR IS STOPPED AT A TRAFFIC LIGHT, THE HANDLE WOULD COME OFF AND EXPOSE THE INNER WORKINGS OF THE LOCK, POSSIBLY ALLOWING THE DOOR TO BE OPENED.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/24/2012",
        "dateOfIncident": "06/30/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10467588,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED VEHICLE 4/2/12. 6/30/12 CAR WOULD NOT START. FULL POWER AND CRANK BUT WOULD NOT ENGAGE. CAR TOWED AND DIAGNOSED AS FUEL PUMP/RELAY. THE RELAY WAS MELTED. REPAIRED WITHOUT INCIDENT.    JULY 23,2012 CAR REPEATED. NO START. CAR TOWED AGAIN AND RELAY IS MELTED AGAIN. RESEARCHING IT SEEMS TO BE A COMMON EVENT OCCURRING IN 2008 V8.     MECHANIC HAS DETERMINED IT TO BE AN ELECTRICAL PROBLEM STEMMING FROM FUSE AND AMPS BEING DELIVERED TO RELAY. *TR    THE CONSUMER STATED THE MANUFACTURER EXCEEDED AND A REASONABLE AMOUNT OF TIME ADDRESSING THE FAILURE.*JS",
        "vin": "1G4HE57Y78U"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/04/2012",
        "dateOfIncident": "06/01/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10464173,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING A HIGHWAY SPEED,MY 2008 BUICK LUCERNE SHOWED A SERVICE STABILITRAK LIGHT.THIS CAUSED A LOSS OF TRACTION AND I HAD TO SLOWLY BRING THE VEHICLE UNDER CONTROL MANUALLY. THIS CONDITION LASTED A FEW SECONDS AND THEN RETURNED TO NORMAL. THIS HAS HAPPENED SEVERAL TIMES AT HIGHWAY SPEED UP TO THE PRESENT DATE. I TOOK THE VEHICLE TO MY DEALER(KARP BUICK). THEY WERE UNABLE TO REPLICATE THE PROBLEM.THE CONDITION STILL EXISTS. IT ALSO SOMETIMES SHOWS A STABILITRAK NOT READY LIGHT AND CAUSES THE SAME LOSS OF CONTROL.I UNDERSTAND THE BUICK LACROSSE,THE GMC ACADIA AND THE GMC SIERRA HAD SIMILAR PROBLEMS.  *JS",
        "vin": "1GHP57238U1"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "03/12/2012",
        "dateOfIncident": "03/12/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10451226,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I UNDERSTAND THERE IS A RECALL TO DISABLE AND REMOVE THE HEATED WINDSHIELD SOLUTION FROM THE CAR.  THIS IS A FEATURE THAT COST EXTRA WHEN BUYING THE CAR AND I FEEL YOU SHOULD REPAIR IT, NOT JUST REMOVE THE FEATURE.  IS THERE ANY REPAIR INSTEAD OF REMOVAL?  IF NOT HOW DO YOU COMPENSATE OWNERS FOR THE LOSS OF FUNCTIONALITY OF THE HEATED WINDSHIELD SYSTEM.  I LIVE IN THE NORTHEAST AND USE IT OCCASIONALLY IN THE WINTER.  *TR",
        "vin": "1G4HE57Y08U"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/24/2012",
        "dateOfIncident": "02/10/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10449162,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DAMAGE WAS EXTENSIVE ENOUGH TO TOTAL OUT THE CAR, BUT AIR BAGS NEVER DEPLOYED.  *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/29/2011",
        "dateOfIncident": "06/25/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10437753,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT 55 M.P.H. GOING DOWNHILL AT A 6% GRADE VEHICLE'S FRONT END AND STEERING COLUMN STARTED VIBRATING VIOLENTLY. PULLED OVER AND LET CAR SIT FOR 30-45 MINUTES, THEN TRAVELED ON. TOOK CAR TO BUICK DEALER AND FOUND ROTORS SEVERELY WARPED. ROTORS WERE TURNED(MACHINED) AND CAR BRAKES WERE OK FOR NEXT 2-3000 MILES. DRIVING AT 55M.P.H. NOTICED PULSATION/VIBRATION WHEN APPLYING BRAKES. TOOK CAR TO LOCAL DEALER AND THEY DID NOT SEEM IT WAS ANYTHING TO WORRY ABOUT. DROVE CAR AT 55 M.P.H. ON HIGHWAY AND VIBRATION AND PULSATION BECAME WORSE. TOOK CAR TO A NATIONAL RETAILER AND HAD TO HAVE ROTORS REPLACED WITH HEAT DISSIPATING ROTORS. CAR SHOULD HAVE HAD THESE TYPE ROTORS TO BEGIN WITH DUE TO SIZE AND WEIGHT. THIS PROBLEM COULD CAUSE A FIRE OR THE INABILITY TO STOP WHEN NEEDED, CAUSING POSSIBLE SERIOUS ACCIDENTS.  *KB",
        "vin": "1G4HG57298U"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/29/2011",
        "dateOfIncident": "10/29/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10433549,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS GETTING BACK INTO MY CAR AND WENT TO OPEN THE DRIVER'S SIDE DOOR, WHEN THE DOOR HANDLE MECHANISM PULLED OUT OF THE DOOR.  I WAS SHOCKED....NEVER EXPERIENCE THIS IN 41YEARS OF DRIVING.  *TR",
        "vin": "1G4HD57268U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/25/2011",
        "dateOfIncident": "07/15/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10415052,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CLUNK IN STEERING WHEN TURNING STEERING WHEEL WHEN PARKED OR MOVING.  CAN ALSO HEAR THE CLUNK NOISE WHEN DRIVING ON ROUGH ROADS.  THIS IS A PROBLEM THAT DOES NOT GO AWAY.  *TR",
        "vin": "1G4HD57288U"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/15/2011",
        "dateOfIncident": "02/19/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10396009,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2008 BUICK LUCERNE. WHILE DRIVING APPROXIMATELY 45 MPH, THE VEHICLE WAS INVOLVED IN A CRASH IN WHICH THE AIR BAGS DID NOT DEPLOY. THE CONTACT WAS TRANSPORTED TO THE HOSPITAL VIA AMBULANCE TO TREAT SERIOUS INJURIES. A POLICE REPORT WAS FILED AND THE CONTACT WAS THE ONLY PERSON REPORTED INJURED. THE VEHICLE WAS DESTROYED AND TOWED TO AN INSURANCE LOT. THE FAILURE WAS NEVER DIAGNOSED. THE FAILURE AND CURRENT MILEAGE WAS 28,248.  UPDATED 5/24/11 *CN  UPDATED 06/03/11",
        "vin": "1G4HD57228U"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/14/2011",
        "dateOfIncident": "03/04/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10390050,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH ONLY 85 MILES LEFT ON MY WARRANTY FOR MY 2008 BUICK LUCERNE THE DRIVER'S SIDE DOOR HANDLE FELL OFF.  MY HUSBAND WAS ABLE TO TEMPORARILY PUSH IT BACK ON.  WE IMMEDIATELY DROVE TO THE DEALERSHIP.  THEY REPLACED THE DOOR HANDLE UNDER THE WARRANTY. THE BILL WOULD HAVE BEEN $94 OTHERWISE.  NO WAY SHOULD A DOOR HANDLE FALL OFF A VEHICLE WHICH IS STILL BARELY NEW.  *TR",
        "vin": "1G4HP57208U"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "02/18/2011",
        "dateOfIncident": "01/28/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10383217,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN OPENING DRIVER'S DOOR THE HANDLE CAME APART IN MY HAND.  I HAD MY MECHANIC PUT IT BACK TOGETHER.  THIS HAS HAPPENED TWICE SO I AM REALLY AFRAID TO OPEN THIS DOOR.  WILL BUICK REPLACE THIS DOOR HANDLE?  UPDATED IVOQ 02/24/11  *LN",
        "vin": "1G4HD57238U"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/03/2011",
        "dateOfIncident": "08/01/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10373941,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BUICK LUCERNE. THE CONTACT WAS DRIVING APPROXIMATELY 30 MPH AND APPLYING THE BRAKES WHEN THE VEHICLE EXHIBITED AN ABNORMAL THUMPING NOISE. THE VEHICLE WAS TAKEN TO THE DEALER AND THE DEALER ADVISED THE CONTACT THAT THE REAR ROTORS WOULD NEED REPLACING. THE VEHICLE WAS REPAIRED. THE FAILURE MILEAGE WAS 18,641 AND THE CURRENT MILEAGE WAS 19,512.   UPDATED 03/02/11 *BF  UPDATED 03/08/11*JB   UPDATED 12/14/11 *CN",
        "vin": "1G4HP572X8U"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "12/16/2010",
        "dateOfIncident": "12/14/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10370928,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 BUICK LUCERNE CXL. THE CONTACT NOTICED THAT THE WINDSHIELD WASHER WAS INOPERABLE. THE DEALER WAS INFORMED AND ADVISED THE CONTACT TO LEAVE THE VEHICLE IN HIS GARAGE. THE MANUFACTURER WAS NOTIFIED BUT OFFERED NO ASSISTANCE.  THE VEHICLE WAS NOT REPAIRED.  THE CURRENT AND FAILURE MILEAGES WERE  APPROXIMATELY 16,000.  UPDATED 03/25/11*LJ  UPDATED 05/03/11*LJ  THE CONSUMER STATED THE WINDSHIELD WIPER FLUID FREEZES AND THERE IS NO WAY TO PREVENT IT.  UPDATED 08/05/11  UPDATED 09/19/11",
        "vin": "1G4HD57238U"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "11/04/2010",
        "dateOfIncident": "10/30/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10364005,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 BUICK LUCERNE. WHILE DRIVING APPROXIMATELY 2 MPH WITH HER FOOT ON THE BRAKE PEDAL THE VEHICLE SURGED FORWARD, RESULTING IN A CRASH. A POLICE REPORT WAS NOT FILED AND THERE WERE NO INJURIES. THE VEHICLE WAS TOWED TO AN INDEPENDENT REPAIR SHOP BUT THE FAILURE WAS NOT DIAGNOSED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGES WERE 13,800. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,VISIBILITY,LATCHES/LOCKS/LINKAGES,TRACTION CONTROL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/17/2010",
        "dateOfIncident": "08/13/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10350122,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 BUICK LUCERNE.  THE CONTACT STATED WHEN REFUELING THE VEHICLE, GASOLINE WOULD SPEW BACK OUT FROM THE FILLER TUBE AND ONTO THE CONTACT. THE DEALER ADVISED THAT THE VEHICLE WAS REPAIRED BUT THE FAILURE PERSISTED.  IN ADDITION, THE FRONT DRIVER WINDOW WAS ABNORMALLY SLOW IN OPENING AND WOULD SQUEAK. THE DRIVER SEAT HAS NO PADDING AND WHEN EXITING THE VEHICLE, SHE WOULD HAVE TO TILT THE STEERING WHEEL UPWARD IN ORDER TO EXIT. THE VEHICLE WAS NOT REPAIRED.  THE FAILURE AND CURRENT MILEAGE WAS 19,950.    UPDATED 12/7/10 *CN  THE CONSUMER ALSO STATED THE TRACTION LIGHT ILLUMINATED AND THE DOOR LOCKS HAD TO REPAIRED. UPDATED EVOQ 03/01/11",
        "vin": "1G4HP57298U"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "08/02/2010",
        "dateOfIncident": "06/01/2010",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10346912,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEATED WINDSHIELD WASHER RECALL  10153 IS NOT SUFFICIENT. THEY ARE NOT OFFERING A REPAIR BUT TO DISABLE IT. I AND MANY OTHERS WHO HAVE THIS OPTION ARE NOT GOING TO GET THE RECALL DONE BECAUSE WE WANT THIS FEATURE TO WORK. BECAUSE OF THIS MANY ARE AT RISK. WHAT IF SOMEONE DOES NOT GET IT DONE AND PARKS THEIR VEHICLE UNDER AN APARTMENT COMPLEX GARAGE AND IT IGNITES? EVEN PEOPLE WHO THAT DO NOT HAVE THIS CAR ARE AT RISK. I BOUGHT A MUCH MORE EXPENSIVE CAR THEN I REALLY NEEDED BECAUSE OF THIS FEATURE. GM SHOULD BE FORCED TO FIND A NEW VENDOR TO DESIGN A REPLACEMENT MODULE. IT'S BEING DISABLED BECAUSE IT IS CHEAPER FOR THEM TO GIVE YOU $100 THEN TO REDESIGN AND FIX THE PROBLEM. WHAT WILL BE NEXT, IF THE ABS MODULES START TO BURN AND THE VENDOR GOES OUT OF BUSINESS WILL THEY THEN HAVE A RECALL TO DISABLE THE ABS? I PLEAD WITH YOU TO NOT LET GM GET AWAY WITH THIS.  THANK YOU *TR",
        "vin": "1G4HD57238U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/29/2010",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10345527,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 BUICK LUCERNE. CONSUMER WRITES REGARDING RECALL AND CLASS ACTION SUIT INVOLVING GM *TGW  THE CONSUMER STATED THE HEATED WASHER FLUID SYSTEM (HWFS) WAS A MARKETING FEATURE ON THE GM PRODUCT. THE PROPOSED SOLUTION OF PERMANENTLY DISABLING AND REMOVING THE HEATED WASHER FLUID SYSTEM IS NEITHER ACCEPTABLE NOR JUST.  *JB",
        "vin": "1G4HE57Y48U"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "06/10/2010",
        "dateOfIncident": "11/24/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10335594,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER FUEL GAUGE GETS DOWN TO FULL ,SHUT ENGINE OFF,RESTART ENGINE FUEL GAUGE WILL DROP ONE EIGHTH,SHUT ENGINE OFF, RESTART ENGINE GAUGE WILL READ UP ONE EIGHTH OR BACK TO WHERE IT WAS. IT READS UP1/8 THEN DOWN 1/8 THEN BACK UP 1/8. *TR",
        "vin": "1G4HD57228U"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "06/09/2010",
        "dateOfIncident": "12/21/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10335442,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS COMPLAINT IS AN EXACT COPY OF ANOTHER ONE BECAUSE WE EXPERIENCE THE EXACT SAME ISSUE.  DURING FREEZING RAIN OR SNOW CONDITIONS THERE IS A BUILD-UP OF ICE AT THE BASE OF THE WINDSHIELD BELOW THE POINT OF THE DEFROSTERS. HEAT FROM THE DEFROSTER SYSTEM CANNOT REACH THE AREA OF BUILD-UP CAUSING THE WIPERS TO CONSTANTLY PASS OVER THE ICE AND BECOME CLOGGED WITH ICE WHICH IS THEN DRAGGED ACROSS THE WINDSHIELD CAUSING POOR VISIBILITY AND A POTENTIAL DRIVING HAZARD. IN JUST A FEW MILES OF DRIVING IT WAS NECESSARY TO PULL OVER AND SCRAPE THE WINDSHIELD AND CLEAR THE ICE FROM THE WIPERS IN ORDER TO HAVE ADEQUATE VISIBILITY. THIS IS A POTENTIAL SAFETY CONDITION DUE TO THE LIMITING OF VISIBILITY AND THE REPEATED STOPS TO CLEAR THE ICE. *TR",
        "vin": ""
    },
    {
        "components": "INTERIOR LIGHTING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/09/2010",
        "dateOfIncident": "02/15/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10324646,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING DAYLIGHT HOURS THE INSTRUMENTAL PANEL LIGHTS WILL BE DIM OR GO DIM WHILE DRIVING. YOU WILL NOT BE ABLE TO READ ANY INFORMATION ON THE DASH WHEN SUN SHINES ON OR NEAR THE PANEL.    DEALER REPLACED PANEL BUT IT DID NO GOOD.  WENT BACK TO DEALER BUT HE SAID THEY COULD NOT FIX IT. *TR",
        "vin": "1G4HD57248U"
    },
    {
        "components": "INTERIOR LIGHTING,EQUIPMENT,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/07/2010",
        "dateOfIncident": "02/10/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10317499,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "GM PRODUCTS DIV. GM CORP.",
                "productMake": "GM PRODUCTS",
                "productModel": "GM PRODUCTS",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "I HAVE AN 08 BUICK LUCERNE CXL UNDER WARRANTY.  AT TIMES THE INSTRUMENT PANEL LIGHTS ARE SO DIM YOU CANNOT READ THE PANEL WHEN THE SUN SHINES ON THEM A BIT. I TOOK IT TO DEALER AND THEY REPLACED PANEL LIGHT. NO HELP.  THEY SAID BUICK WILL NOT HELP THEM. TOOK IT BACK AND EXPLAINED PROBLEM AND THEY SAID  YES, YOU AND A THOUSAND OTHERS. I CONTACTED BUICK DIVISION AND THEY FILE MY EMAIL AND GIVE ME A LONG NUMBER. DEALER AGREES IT IS A SAFETY PROBLEM. WHEN DRIVING IN MOUNTAINS I WANT TO KNOW MY SPEED, GEAR I'M IN ETC.  IT DON'T HAPPEN ALL THE TIME SO I AM SURE THERE IS A SIMPLE FIX. A SWITCH OR COMPUTER OR SOMETHING SIMILIAR.   THANKYOU. *TR",
        "vin": "1G4HD57248U"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/08/2010",
        "dateOfIncident": "01/03/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10298690,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 BUICK LUCERNE. WHILE DRIVING 20 MPH HIS VEHICLE SHUT OFF AND WOULD NOT RESTART. THE VEHICLE WAS TOWED TO THE DEALER. THE VEHICLE WAS REPAIRED AT NO COST TO THE OWNER. THE FAILURE MILEAGE 13,600.      UPDATED 1/28/10 *CN     THE CONSUMER STATED UPON ENTERING A HIGHWAY FROM AN ENTRANCE RAMP, AS HE TRIED TO MERGE WITH TRAFFIC, HE DISCOVERED HE WAS UNABLE TO ACCELERATE AND COMPLETELY LOST POWER WITHOUT ANY WARNING OR LIGHTS ON THE DASH.  THE VEHICLE WAS TOWED TO THE DEALER WHERE THE FUEL PUMP MODULE WAS REPLACED. THE CONSUMER STATED THE VEHICLE WAS REPAIRED IN A TIMELY FASHION.  UPDATED 02/03/10.*JB",
        "vin": "1G4HP57278U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/28/2009",
        "dateOfIncident": "09/20/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10290149,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 BUICK LUCERNE. THE CONTACT WAS DRIVING APPROXIMATELY 35 MPH IN SEVERE RAINY WEATHER CONDITIONS.  SUDDENLY, THE STEERING WHEEL LOCKED WITHOUT WARNING. THE DRIVER EXERTED GREATER EFFORT TO TURN THE STEERING WHEEL. THE SPEED WAS REDUCED AND THE VEHICLE WAS PULLED OVER TO THE SIDE OF THE ROAD WITH CAUTION.  THE GEAR SHIFT WAS PLACED INTO \" NEUTRAL\" POSITION AND THEN TO THE \"DRIVE\" POSITION. THE VEHICLE WAS ABLE TO RESUME NORMAL OPERATION.  WHENEVER THE VEHICLE WAS IN OPERATION IN RAINY WEATHER CONDITIONS THE FAILURE OCCURRED. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER FOR INSPECTION. THE FAILURE WAS CONTRIBUTED TO THE WATER SEEPAGE TO THE STEERING SERPENTINE BELT. THE VEHICLE HAS NOT BEEN REPAIRED FOR THE MALFUNCTION. THE CONTACT HAD CONCERNS OF THE SAFETY RISK INVOLVED. THE FAILURE MILEAGE WAS 16,000 AND THE CURRENT MILEAGE WAS 17,500.",
        "vin": "1G4HD57268U"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/18/2009",
        "dateOfIncident": "03/11/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10262375,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MARCH 11, THE ACCELERATOR STUCK ON MY MOTHER'S 2008 BUICK LUCERNE AND SHE JUMPED A RR TIE BARRIER AND CROSSED THE FRONT YARD AND HIT AN OAK TREE AT PERHAPS 30 MPH.  SHE THINKS SHE TURNED OFF THE ENGINE IN ATTEMPT TO PREVENT VEHICLE FROM GOING DOWN A STEEP HILL AND INTO THE STREET.  SHE'S NOT SURE SHE WAS WEARING A SEATBELT.  AIRBAG DID NOT DEPLOY.  SHE SUSTAINED SERIOUS INJURY TO HIP AND PELVIS.  I DON'T KNOW IF AIRBAG SHOULD HAVE DEPLOYED OR IF IT WOULD HAVE SAVED HER FROM SERIOUS INJURY, BUT I WOULD LIKE AN INDEPENDENT PARTY INVESTIGATE THE BLACK BOX DATA TO SEE WHAT LIGHT COULD BE SHED. *TR",
        "vin": "1G4HD57238U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/11/2009",
        "dateOfIncident": "03/10/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10261553,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOOK DELIVERY OF A 2008 BUICK LUCERNE.LAST YEAR. ALMOST IMMEDIATELY I HAD PROBLEMS. I PROCEEDED UNDER PA. LEMON LAW DUE TO ELECTRICAL ISSUES (ENGINE LIGHT INDICATING A PROBLEM) REPRESENTED BY COUNSEL. I WAS TOLD THE PROBLEM WAS FIXED AND SETTLED FOR A FLAT AMOUNT. SINCE THAT TIME  I HAVE HAD ADDITIONAL ENGINE LIGHT ISSUES BUT THIS TIME IT HAS BEEN DIAGNOSED (AND DOCUMENTED) AS A PROBLEM COMPLETELY DIFFERENT THAN THAT WHICH OCCURRED PREVIOUSLY.  THE ORIGINAL PROBLEM  WAS WELL IN EXCESS OF FIVE TIMES AND CLOSE TO 30 DAYS DOWN TIME. THIS NEW PROBLEM IS NOW ON ITS SECOND OCCURRENCE AND NOW I AM IN RENTAL CAR. I HAVE INFORMED GM AND THE DEALER THAT THIS VEHICLE IS AN ACCIDENT WAITING TO HAPPEN. IT IS A POTENTIAL DEATH TRAP. THE DEALER FINALLY ADMITS TODAY THAT THIS VEHICLE IS DEFECTIVE. HOWEVER, GM HAS TAKEN A POSITION THAT THE FIRST INCIDENT WAS SETTLED THAT THEY REFUSE TO ACKNOWLEDGE THAT THERE IS A NEW & SECOND PROBLEM NOT FIXED BY THE FIRST RECALL. I HAVE EVEN OFFERED TO GIVE THEM THEIR SETTLEMENT MONEY BACK ON THE FIRST OCCURRENCE I AM SO DISGUSTED. THE CAR IS A DANGER NOT ONLY TO  MYSELF BUT TO OTHERS THAT I AM ON THE ROAD WITH AS A TRAVEL THE PA TPK. EVERYDAY FOR WORK. GM REFUSES TO LISTEN TO THEIR DEALER WHO NOW ADMITS  THAT THIS VEHICLE IS DEFECTIVE AND CONFIRMS A NEW AND SECOND PROBLEM. GM WILL NOT LISTEN TO THEIR DEALER NOR TAKE THIS SERIOUSLY. ONE PROBLEM SOLVED ANOTHER ELECTRICAL PROBLEM (SUPPOSEDLY INVOLVING AN EMISSION SYSTEMS BREAKDOWN) TO GO. CAN SOMEONE AT THE AGENCY PLEASE HELP ME?  *TR",
        "vin": "1G4HD57268U"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "03/02/2009",
        "dateOfIncident": "12/17/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10260407,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING FREEZING RAIN OR SNOW CONDITIONS THERE IS A BUILD-UP OF ICE AT THE BASE OF THE WINDSHIELD BELOW THE POINT OF THE DEFROSTERS. HEAT FROM THE DEFROSTER SYSTEM CANNOT REACH THE AREA OF BUILD-UP CAUSING THE WIPERS TO CONSTANTLY PASS OVER THE ICE AND BECOME CLOGGED WITH ICE WHICH IS THEN DRAGGED ACROSS THE WINDSHIELD CAUSING POOR VISIBILITY AND A POTENTIAL DRIVING HAZARD. IN JUST A FEW MILES OF DRIVING IT WAS NECESSARY TO PULL OVER AND SCRAPE THE WINDSHIELD AND CLEAR THE ICE FROM THE WIPERS IN ORDER TO HAVE ADEQUATE VISIBILITY. THIS IS A POTENTIAL SAFETY CONDITION DUE TO THE LIMITING OF VISIBILITY AND THE REPEATED STOPS TO CLEAR THE ICE. *TR",
        "vin": "1G4HD57278U"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/05/2009",
        "dateOfIncident": "09/30/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10257568,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED AN 08 BUICK LUCERNE IN SEPT. OF 08. MY CONCERN DEALS WITH THE ACCELERATOR. THIS MODEL I AM TOLD HAS AN ALL ELECTRONICALLY CONTROLLED ACCELERATOR. I FIND IT ALMOST IMPOSSIBLE TO HOLD AN EVEN SPEED ON THE HIGHWAY AS IT IS CONSTANTLY EITHER SPEEDING UP OR SLOWING DOWN, AND I HAVE NO PERCEPTION OF EVER MOVING THE PEDAL. AT STOP SIGNS/LIGHTS IT WILL SOMETIMES LEAP OUT WITH A \"JACK RABBIT\" START WHICH WAS TOTALLY UNPLANNED FOR. THIS  I FEEL IS A MAJOR SAFETY ISSUE PLUS I ALSO THINK IT HAS  A LOT TO DO WITH THE POOR MILEAGE I AM EXPERIENCING. I AM ONLY GETTING 15-23 MPG WHICH IS FAR FROM THE 23-29 I GOT ON MY 05  LASABRE WITH THE SAME ENGINE. I HAVE HAD IT TO TWO DEALERSHIPS AND THEY BASICALLY TELL ME THIS IS ALL ELECTRONIC AND THERE IS NOTHING THEY CAN DO. I FIND THIS ANSWER UNACCEPTABLE AND HOPE THAT YOU CAN POSSIBLY HELP.  THANK YOU *TR",
        "vin": "1G4HD57288U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "01/17/2009",
        "dateOfIncident": "01/15/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10255443,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DEFROSTER VENTS IMPROPERLY POSITIONED TO KEEP FRONT WINDSHIELD CLEAR IN NEAR ZERO CONDITIONS.  WINDOW WIPER BLADES PARK IN AN AREA BELOW THE HEATED PORTION OF THE WINDSHIELD. WIPERS FROZE TO THE WINDOW, DURING THE DELAY IN THE INTERRUPTED OPERATION, WHILE DRIVING IN A SNOW STORM AT 3 DEG. TEMP. WINDOW ACTUALLY BECAME TOTALLY FROZEN OVER AND VISIBILITY BECAME IMPOSSIBLE. ON THE PASSENGER SIDE, ICE ACCUMULATED IN THE WIPER PAVE IN THE LOWER RIGHT CORNER, ABOUT 3 X 6 X 1/4 THICK AND THE WIPER HAD TO NAVIGATE UP AND OVER THIS FROZEN MASS. *TR",
        "vin": "1G4HE57Y68U"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/10/2008",
        "dateOfIncident": "02/15/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10248259,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 BUICK LUCERNE.  THE VEHICLE WAS PURCHASED NEW WITH EXCESSIVE SCRATCHES ON THE EXTERIOR PAINT.  THE SCRATCHES COVERED THE ENTIRE BODY OF THE VEHICLE.  THE SALES REPRESENTATIVE OBSERVED THE DEFECTS DURING THE NEW VEHICLE INSPECTION.  IMMEDIATELY, THE AUTHORIZED DEALER COLLISION CENTER INSPECTED THE VEHICLE AND STATED THAT THE SCRATCHES WERE DUE TO FAULTY PAINT WORKMANSHIP.  THE MANUFACTURER WAS NOTIFIED OF THE DEFECTIVE EXTERIOR PAINT AND REFUSED TO REPAIR THE VEHICLE.  THE CONTACT WAS DISPLEASED TO KNOW THAT THERE WAS NO REMEDY FOR THE DEFECT ONCE IT WAS REPORTED TO THE DEALER AT THE TIME OF SALE.  THE FAILURE MILEAGE WAS 456 AND CURRENT MILEAGE WAS 4,000.",
        "vin": "1G4HE57Y68U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/03/2008",
        "dateOfIncident": "07/31/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10240829,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ON A SUNNY DAY IT IS NOT POSSIBLE TO READ THE INSTRUMENT PANEL UNDER THE COWL.  MOST IMPORTANT : ONE CANNOT READ THE SPEEDOMETER SO THAT YOU CAN ONLY JUDGE YOUR SPEED BY WHETHER YOU ARE PASSING EVERYONE OR THEY ARE PASSING YOU. NOR ARE ANY OF THE OTHER INSTRUMENTS READABLE.  AT NIGHT THERE IS NO PROBLEM AS THE INSTRUMENT LIGHTS ARE FINE, BUT THE INSTRUMENT LIGHTS DO NOTHING TO HELP THE DAY PROBLEM.  THESE ARE ALL ACCIDENTS WAITING TO HAPPEN.  I SPOKE WITH BUICK IN DETROIT AND ALSO MY LOCAL BUICK DEALER.  DETROIT SAID THEY WERE AWARE OF THE PROBLEM BUT HAD NO SUGGESTION.  MY DEALER ALSO HAD NO SUGGESTION.  THIS IS CLEARLY A DESIGN FLAW THAT NEEDS CORRECTION.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/26/2008",
        "dateOfIncident": "07/03/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10239786,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 BUICK LUCERNE.  THE CONTACT NOTICED THAT THE LIGHTING ON THE INSTRUMENT CONTROL PANEL HAD A CONSTANT LOW INTENSITY, RESULTING IN POOR ILLUMINATION.  AS A RESULT, HE WAS UNABLE TO SEE THE WARNING LIGHTS AND OTHER IMPORTANT INFORMATION ON THE INSTRUMENT CONTROL PANEL.  HE TOOK THE VEHICLE TO THE DEALER AND THEY STATED THAT IT WAS A CHARACTERISTIC OF THE VEHICLE.  THE FAILURE MILEAGE WAS 90 AND CURRENT MILEAGE WAS 1,300. UPDATE 10/01/08 *CW   UPDATED 10/02/08. *JB",
        "vin": "1G4HP57258U"
    },
    {
        "components": "POWER TRAIN,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "08/16/2008",
        "dateOfIncident": "06/21/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10238469,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS A REPORT OF A DESIGN FLAW THAT MIGHT RESULT IN A SAFETY ISSUE.    I RECENTLY TOOK DELIVERY OF A 2008 BUICK LUCERNE CXL. I PURCHASED THE OPTIONAL SIX-PASSENGER VERSION WHICH MEANS THAT THE GEARSHIFT LEVER IS MOUNTED ON THE STEERING COLUMN INSTEAD OF ON A FLOOR CONSOLE, LIKE MOST OTHER CARS.    WHEN THE GEARSHIFT LEVER IS IN THE \"DRIVE\" POSITION, THE VIEW OF THE RADIO DISPLAY IS OBSCURED, CAUSING ME TO MOVE MY HEAD TO LOOK AROUND THE GEARSHIFT LEVER TO VIEW THE DISPLAY. AS A RESULT, MY ATTENTION TO THE ROAD IS MUCH MORE DISTRACTED THAN IF I HAD AN UNOBSTRUCTED VIEW OF THE RADIO DISPLAY. THIS COULD LEAD TO AN ACCIDENT.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "07/06/2008",
        "dateOfIncident": "01/18/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10233291,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "GM PRODUCTS DIV. GM CORP.",
                "productMake": "GM PRODUCTS",
                "productModel": "GM PRODUCTS",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "I PURCHASED A NEW 2008 BUICK LUCERNE AND UNABLE TO READ INSTRUMENT PANEL  GAUGES ESPECIALLY SPEED, GAS, ETC DURING DAYLIGHT PERIODS WITH BRIGHT SUN AND/OR HAZY WHEN AUTO RUNNING LIGHTS ARE ON. DRIVER IS UNABLE TO OBSERVE THE AUTO'S SPEED, AMOUNT OF FUEL AND OTHER INSTRUMENTS ON PANEL. THIS IS CAUSED BY THE INSTRUMENT PANEL BEING INSTALL TO FAR BACK INTO THE CONSOLE , THEREFORE IN DEEP SHADOW . ALSO THERE IS  NO BACK LIGHTING WHEN THE AUTO RUNNING LIGHTS ARE ON. THIS IIS A MAJOR SAFETY DAY TIME CONCERN  AS DRIVER IS UNABLE TO PROPER JUDGE HIS SPEED AS WELL AS BEING ABLE TO OBSERVE OTHER INSTRUMENT PANEL MONITORS.  *TR",
        "vin": "1G4HD572X8U"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/04/2008",
        "dateOfIncident": "06/29/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10233185,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A CLUNKING OF THE DRIVERSIDE FRONT BRAKES FOLLOWED WITH A SCRAPING SOUND IN THE ENGINE COMPARTMENT ACCOMPANIED WITH A HESITATION IN MAINTAINING DRIVING SPEED.  THE CAR WILL THEN SHOW A WARNING TO SERVICE THE STABILITRACK SYSTEM.  WHEN THIS OCCURS BRAKES FEEL LIKE THERE IS SOMETHING LOOSE THAT IS BETWEEN BRAKE PAD AND DISC. DEALERSHIP SAID IT NEEDED TO REPROGRAM THE MODULE.  THEY DID BUT PROBLEM PERSISTS.  NOW MODULE NEEDS REPLACING.  THE VEHICLE IS A HAZARD SHOULD BRAKES FAIL OR LOCK UP.  *TR",
        "vin": "1G4HD57238U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/26/2007",
        "dateOfIncident": "09/26/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10204154,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LUCERNE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 BUICK LUCERNE.  AFTER PURCHASING THE VEHICLE, THE CONTACT REALIZED THAT THE BATTERY WAS LOCATED UNDER THE REAR PASSENGER SEAT.  THE CONTACT STATED THAT IF A CRASH OCCURRED, BATTERY FUMES AND ACIDS COULD BE RELEASED INTO THE PASSENGER COMPARTMENT.  THE DEALER AND MANUFACTURER HAVE NOT BEEN NOTIFIED.  THERE HAD BEEN NO FAILURE TO DATE.  THE CURRENT MILEAGE WAS 25.",
        "vin": "1G4HP57298U"
    }
]