[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/11/2022",
        "dateOfIncident": "11/01/2020",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451544,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2008 Cadillac DTS. The contact stated that while operating the vehicle there was smoke coming from under the hood. Upon inspection, it was discovered that engine oil had leaked onto the hot surface in the engine compartment. The leaking oil also caused damage to the alternator. The cause of the failure was not determined. The manufacturer and local dealer were not notified of the failure. The failure mileage was 115,000.",
        "vin": "1G6KD57Y38U"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/18/2021",
        "dateOfIncident": "12/16/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403767,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DECEMBER 16 2020 NHTSA ID NUMBER 11383838  OIL LEAK UNDER ENGINE COMING FROM  ENGINE, TRANSMISSION, AND POWER STEERING PUMP. ALSO WHITE SMOKE COMING FROM ENGINE ON PASSENGER SIDE FOLLOWING STOP ON DRIVEWAY.",
        "vin": "1G6KD57Y08U"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/16/2020",
        "dateOfIncident": "12/04/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383838,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "OIL LEAK UNDER ENGINE COMING FROM ENGINE TRANSMISSION AND POWER PUMP. ALSO WHITE SMOKE COMING FROM ENGINE ON PASSENGER SIDE WHEN STOPPED ON DRIVEWAY.",
        "vin": "1G6KD57Y08U"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/20/2020",
        "dateOfIncident": "11/06/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11375660,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CADILLAC DTS. THE CONTACT STATED THAT THERE WAS OIL AND TRANSMISSION FLUID LEAKING FROM THE BOTTOM OF THE ENGINE WHILE THE VEHICLE WAS PARKED IN THE DRIVEWAY.  ALSO, UPON COMING TO A STOP, THERE WAS WHITE SMOKE COMING FROM UNDERNEATH THE ENGINE ON THE PASSENGER'S SIDE. THERE WAS NO WARNING LIGHT ILLUMINATED. NEITHER THE DEALER NOR THE MANUFACTURER WERE NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 92,000.",
        "vin": "1G6KD57Y08U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/14/2020",
        "dateOfIncident": "08/20/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11364417,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR FUSE BLOCK FUEL PUMP RELAY SHORTED OUT MELTED FUSE BLOCK...COULD CATCH BACK SEAT ON FIRE AND VERY CLOSE TO GAS TANK.",
        "vin": "1G6KD57Y78U"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "09/20/2020",
        "dateOfIncident": "07/24/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360123,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WINDSHIELD WASHER SPRAYER JUST STOPPED WORKING AND NOW I'M BEING TOLD THAT THIS   IS A COMMON WITH THIS YEAR VEHICLE.  I JUST BROUGHT THIS VEHICLE AND HAVE NOT EVEN   REGISTER IT AT THE BMV.  JUST WANTING TO KNOW IF ANY RECALLS FOR THIS PROBLEM WAS MADE.",
        "vin": "1G6KD57Y08U"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/12/2020",
        "dateOfIncident": "05/05/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11338907,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR GIVES OFF FALSE OIL PRESSURE INFORMATION ON CARS MESSAGE CENTER. I REPLACED THE SENSOR AS DISCRIBED, VERIFIED MY OIL LEVEL, CLEANED THE CONNECTOR TO OIL PRESSURE SENSOR AND STILL EVERY 2 OR 3 MINTUES I GET ENGINE OIL PRESSURE LOW, STOP VEHICHLE. WHEN I STOP THE OIL LEVEL IS GREAT AND THE OIL IS VERY CLEAN. THIS HAS BEEN GOING ON FOR OVER 3 MONTHS. IF THE OIL PRESSURE WAS LOW THE ENGINE WOULD HAVE SIEZED UP BY NOW. THIS IS ONGOING ISSUE WITH THESE 08 CADILLAC DTS 4.7L NORTHSTAR ENGINES.",
        "vin": "1G6KD57Y58U"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/11/2020",
        "dateOfIncident": "02/23/2020",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11317549,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR PASSENGER FUSE BLOCK (P/N 19116816) GETS MELTED BY A FAULTY FUSE PUMP RELAY BURNING UP DUE TO A FAULTY DESIGN WITHIN THE FUEL PUMP SYSTEM. FUEL PUMP PUTTING A LOT OF RESISTANCE ON THE WIRING, RELAY WON'T BLOW, BUT IT MELTS. WITHOUT CORRECTING THIS, THE FUSE BOX WILL BE AFFECTED ONCE THE FUSE PUMP RELAY OVERHEATS AND EVENTUALLY MELTS AND BURNS. CAR WAS STATIONED. THIS IS UNSAFE BY ANY MEANS. THE FIRE COULD HAVE SPREAD AND CAUSED THE SEATS TO BURN AND WORSE, IT'S RIGHT BY THE GAS TANK.",
        "vin": "1G6KD57Y68U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/17/2020",
        "dateOfIncident": "11/30/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11300190,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2008 CADILLAC DTS WOUDL NOT START, I FOUND THE FUEL PUMP RELAY TO BE BURNT. I REPLACED AND WAS ABLE TO DRIVE FOR 150 MILES, SAME THING HAPPENED AGAIN. REPLACED THE RELAY AGAIN IN ORDER TO GET HOME. I THEN REPLACED THE FUEL PUMP, SAME THING HAPPENED. THEN I RESEARCHED THAT THIS IS A KNOWN PROBLEM AND THAT THE FUSE BOX UNDER THE REAR SEAT NEEDS TO BE REPLACED. FUEL PUMP RELAY KEEPS BURNING UP UNDER THE REAR SEAT, POTENTIAL FIRE HAZARD. IT WILL CONTINUE TO BURN UNTIL YOU REMOVE IT.",
        "vin": "1G6KD57Y984"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/27/2019",
        "dateOfIncident": "06/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11291610,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CADILLAC DTS. THE CONTACT NOTICED OIL SPOTS ON THE GARAGE FLOOR. THE CONTACT TOOK THE VEHICLE TO GUYS BUICK GMC TRUCK (1316 N MILDRED ST, RANSON, WV 25438) WHERE IT WAS DETERMINED THAT OIL WAS LEAKING FROM THE CRANK CASE IN THE ENGINE. THE CONTACT WAS REFERRED TO A CADILLAC DEALER FOR THE REPAIR. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND OFFERED A $100 VOUCHER TOWARDS THE REPAIR COST. THE CONTACT WAS REFERRED TO NHTSA. THE FAILURE MILEAGE WAS 95,000.",
        "vin": "1G6KD57Y68U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/20/2019",
        "dateOfIncident": "11/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11290350,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CADILLAC DTS. THE CONTACT SMELLED A ROTTING ODOR INSIDE THE VEHICLE AND THE RADIO REMAINED IN VALET MODE. ALSO, THE TURN SIGNALS FAILED TO ACTIVATE CORRECTLY AND THE HEADLIGHTS FAILED TO ILLUMINATE TO FULL CAPACITY. THE CONTACT ALSO EXPERIENCED SEVERAL OTHER ELECTRICAL FAILURES WITH THE VEHICLE. THE CONTACT TOOK THE VEHICLE TO LES STANDFORD CHEVROLET (LOCATED AT 21730 MICHIGAN AVE, DEARBORN, MI 48124, 313-444-7537), BUT IT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURES AND STATED THAT THE VIN WAS NOT INCLUDED IN A RECALL THE APPROXIMATE FAILURE MILEAGE WAS 219,000.",
        "vin": "1G6KD57Y28U"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/13/2019",
        "dateOfIncident": "09/22/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11279834,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR STOPPED OPERATING ALL OF A SUDDEN.  BATTERY CHARGING ISSUE.",
        "vin": "1G6KD57Y78U"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "11/08/2019",
        "dateOfIncident": "02/20/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11278821,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CADILLAC DTS. THE CONTACT STATED THAT THE CHROME ON THE RIMS PEELED AND BUBBLED, CAUSING THE TIRES TO CONSTANTLY LOSE AIR. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THAT THE RIMS NEEDED TO BE REPLACED. THE VEHICLE WAS TAKEN TO WONDERLAND TIRE (616-399-3070, LOCATED AT 12671 JAMES ST, HOLLAND, MI 49424) WHERE IT WAS STATED THAT THE FAILURE WAS A DESIGN FLAW. THE MANUFACTURER AND DEALER WERE NOT MADE AWARE OF THE FAILURE. THE RIMS WERE NOT REPLACED OR REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 75,000.",
        "vin": "1G6KD57988U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/05/2019",
        "dateOfIncident": "07/30/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11241860,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 CADILLAC  DTS (100K MI) WAS PARKED AND ENGINE WOULD TURN OVER BUT NOT START.  I DETERMINED THAT THERE WAS NO FUEL TO ENGINE BY CHECKING SCHRADER VALVE ON FUEL RAIL.  PROCEEDED TO CHECK FUEL PUMP (FP) FUSE (OK) AND FP RELAY (BURNED ON PIN 30 ALONG WITH FUSE BLOCK).  REPLACED FP RELAY; HOWEVER, AFTER A FEW MINUTES FROM VEHICLE START, THE RELAY HEATS TO ABOUT 200 DEGREES F.  AFTER READING SEVERAL FORUMS, THIS IS NOT UNCOMMON:  IT APPEARS THE FUSE BLOCK (UNDER REAR SEAT ). IS DEFECTIVE.  I HAVE ORDERED GM BLOCK 19116810 WHICH APPARENTLY SUPERSEDES THE ORIGINAL FACTORY GM BLOCK 13599106.  THIS PROBLEM CLEARLY POSES MANY SAFETY ISSUES: FIRE, ENGINE SHUT DOWN WHILE DRIVING, ETC.  GM NEEDS TO TAKE OWNERSHIP OF THIS PROBLEM.  MOREOVER, I HAVE ALSO EXPERIENCED THE BURNED OUT CONNECTOR (UNDER PASSENGER SEAT) FOR THE HEATED SEATS.  FORTUNATELY, I DID NOT HAVE THE HEATED WINDSHIELD WASHER OPTION WHICH ALSO EXPERIENCED ELECTRICAL ISSUES.  SHAME ON GM FOR NOT CORRECTING THESE ENGINEERING DESIGN DEFECTS.  SAFETY SHOULD BE PARAMOUNT WITH THESE TYPES OF ISSUES ON YOUR VEHICLES ESPECIALLY YOUR PREMIER BRAND (CADILLAC).",
        "vin": "1G6KD57Y78U"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/07/2019",
        "dateOfIncident": "02/07/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11184787,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CADILLAC DTS. THE CONTACT STATED THAT THE WINDOW WASHER FLUID WAS LEAKING AND COULD POTENTIALLY SHORT OUT THE OTHER ELECTRICAL COMPONENTS OF THE REAR WINDSHIELD WIPER. THE FAILURE WAS BURNING UP THE FUSES AND COULD CAUSE A FIRE. THE VEHICLE WAS EXPERIENCING THE SAME FAILURE AS LISTED IN NHTSA CAMPAIGN NUMBER: 08V441000 (ELECTRICAL SYSTEM). THE CONTACT SPOKE WITH BRITAIN CHEVROLET CADILLAC (4495 INTERSTATE HWY 30, GREENVILLE, TX 75402, (903) 274-4401) AND WAS INFORMED TO BRING IN THE VEHICLE. THE CONTACT WOULD BE CHARGED FOR THE REPAIRS. THE MANUFACTURER WAS NOT CONTACTED. AN INDEPENDENT MECHANIC DIAGNOSED THAT THE ENTIRE FUSE BOX AND HARNESS LOCATED UNDER THE BACK SEAT NEEDED TO BE REPLACED. THE MECHANIC WOULD NOT PERFORM ANY REPAIRS DUE TO A POTENTIAL FIRE.  THE FAILURE MILEAGE WAS 200,000.",
        "vin": "1G6KD57Y48U"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/05/2019",
        "dateOfIncident": "01/28/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11174637,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CHECK ENGINE CODE SHOWED THE INTERNAL POWER MODULE FAILURE CAUSED THE ENGINE TO SHUT DOWN WHILE TRAVELING AT  A HIGH RATE OF SPEED.  THIS WAS WITHOUT WARNING AND MADE THE CAR'S POWER BRAKES AND STEERING TO BECOME ALMOST IMPOSSIBLE TO STEER AND BRAKE THE CAR BY MY WIFE. I TOOK THE CAR TO THE DEALER WHO TOLD ME WITH THE CHECK ENGINE OFF THEY SAID I HAD TO DRIVE THE CAR UNTIL THE CHECK ENGINE LIGHT CAME BACK ON.    WHILE DRIVING THE CAR THE CHECK ENGINE LIGHT CAME ON WHILE I WAS IN HEAVY TRAFFIC AND AGAIN AN ACCIDENT WAS NARROWLY AVOIDED.   THE DEALER DID A DIAGNOSTIC CHECK  AND REPLACED THE MODULE PLUS THE COMPUTER AT A COST OF  $750.  THIS IS THE NINTH CADILLAC I HAVE OWNED SINCE 1980 WHEN I PURCHASED A SEVILLE WITH A DIESEL ENGINE   AND THIS IS THE FIRST THAT HAD A DEFECTIVE POWER MODULE AND COMPUTER.  THIS WAS A SAFETY HAZARD AND BOTH CADILLAC AND I WERE LUCKY THAT THERE WAS NO ACCIDENT WITH INJURIES.  NOW WITH THE PROBLEM CORRECTED MY WIFE IS HESITANT ABOUT DRIVING AFTER THE CLOSE CALL SHE HAS EXPERIENCED.  SHE ALWAYS INSISTED ON DRIVING A CADILLAC BECAUSE OF THEIR SAFETY RATING AND BECAUSE THEY WON THE MALCULAM BALDRIDGE QUALITY AWARD BACK IN THE 1980'S. I THINK A RECALL TO REPLACE THOSE MODULES  AFTER HIGH MILEAGE OF AT LEAST 65K MILES.  MY 2008 CADILLAC DTS MILEAGE INDICATOR SHOWS 84,000 MILES.",
        "vin": "1G6KD57Y18U"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/10/2019",
        "dateOfIncident": "12/15/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11166334,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CADILLAC DTS. THE CONTACT STATED THAT OIL WAS LEAKING FROM THE OIL PAN AND THE OIL FILTER HOUSING. TEXAS DIRECT AUTO (12053 SOUTHWEST FWY, STAFFORD, TX 77477, (281) 499-8200) REPAIRED THE OIL LEAK, BUT CALLED THE CONTACT BACK AND INFORMED HIM OF ANOTHER OIL LEAK AT THE ENGINE MANIFOLD. THE DEALER STATED THAT FURTHER REPAIRS WOULD REQUIRE THE MOTOR TO BE REPLACED. THE CONTACT HAD THE OIL PAN, OIL HOUSING, AND VALVE COVERS REPLACED; HOWEVER, THE FAILURE RECURRED. THE FAILURE MILEAGE WAS 99,000.",
        "vin": "1G6KD57Y48U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/17/2018",
        "dateOfIncident": "10/17/2017",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11140821,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CADILLAC DTS. WHILE INSPECTING THE VEHICLE, THE CONTACT NOTICED THAT THE HEADLIGHTS WERE PROJECTING TOO MUCH HEAT AND CAUSED THE PLASTIC COVERS TO BURN AND MELT FROM THE INSIDE. THE VEHICLE WAS TAKEN TO RILEY CHEVROLET BUICK GMC (2033 CHRISTY DR, JEFFERSON CITY, MO 65101, (573) 298-6142) WHERE THE CONTACT WAS INFORMED THAT THE FAILURE WAS COSMETIC. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 105,000.",
        "vin": "1G6KD57Y48U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/24/2018",
        "dateOfIncident": "07/24/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11113464,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TRIED TO START MY CAR AND IT WOULD TURN OVER BUT NOT CRANK. REPLACED THE FUEL PUMP AND FUEL PUMP RELAY. CAR STARTED AND I DROVE ABOUT 10 MILES AND IT CUT OFF WHILE DRIVING.  SINCE WE REPLACED THE RELAY MY HUSBAND TOOK OUT THE BACK SEAT TO CHECK IT TO FIND THE FUSE BOX TOO HOT TO TOUCH AND SMELLED LIKE BURNING WIRES. HE DISCONNECTED THE BATTERY TO AVOID A FIRE. THIS COULD HAVE BEEN A DISASTER HAD HE NOT HAD THE FORETHOUGHT TO CHECK THE FUEL RELAY. IT WAS JUST BEFORE CAUSING A FIRE AND WE HAD TWO PASSENGERS IN THE BACK SEAT.",
        "vin": "1G6KD57YX8U"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/16/2018",
        "dateOfIncident": "05/01/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11111504,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "LOWER ENGINE OIL LEAK. I UNDERSTAND THAT THIS IS A COMMON PROBLEM DATING BACK A NUMBER OF YEARS AND CADILLAC HAS NOT RECTIFIED THE PROBLEM AND HAS NOT ISSUED A RECALL. I AM FORCED TO INSTALL A NEW ENGINE BECAUSE THE PROBLEM IS SO COSTLY TO RESOLVE. APPROXIMATELY $4,500. IS THERE ANY CLASS ACTION AGAINST CADILLAC OR IS THERE ANY RELIEF AVAILABLE.",
        "vin": "1G6KD57998U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/19/2018",
        "dateOfIncident": "11/15/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11063720,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DASH LIGHTS ARE INTERMITTENT, OR VERY DIM. THE BRIGHTNESS DOES NOT COME ON FOR MILES AT A TIME. YOU CANNOT SEE THE SPEEDOMETER TO SEE HOW FAST YOU ARE GOING. IT IS A SAFETY ISSUE. IN MOTION, CITY STREETS AND ON THE HIGHWAY. HAVE REPORTED THIS TO CADILLAC AND HAVE HAD IT TO THE CADILLAC DEALER. THEY SAY THERE IS NOTHING WRONG. I HAVE HAD IT TO EARNHARDT CADILLAC  SCOTTSDALE, AZ. SO FAR  NO FIX. THIS HAS BEEN GOING ON FOR YEARS. AFTER THE WARRANTY STOPPED I DID NOT GO BACK TO DEALER.",
        "vin": "1G6KD57Y18U"
    },
    {
        "components": "STEERING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/11/2017",
        "dateOfIncident": "12/10/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11053978,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR WON'T START IF THE TILT WHEEL IS NOT IN A CERTAIN POSITION.  THE ENGINE WILL NOT   START UNTIL YOU PUT IT DOWN IN A CERTAIN POSITION---WHICH I GUESS AT.  AFTER I START IT I CAN  ADJUST THE TILT WHEEL AND I HAVE NO PROBLEM.  AFTER STOPPING AND PARKING THE CAR, I HAVE  TO GET IT IN THE RIGHT POSITION TO HAVE IT START.  (YESTERDAY AFTER 3 ADJUSTMENTS, IT WOULD   NOT START.)   AFTER RESTING FOR A FEW HOURS, IT STARTED.",
        "vin": "1G6KD57Y28U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/08/2017",
        "dateOfIncident": "06/28/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11013675,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY CAR ONE DAY AND I STARTED TO SMELL SOMETHING MELTING IT WASN'T TO STRONG BUT YOU COULD SMELL IT THE NEXT DAY  I SMELLED IT AGAIN AND THEN I NOTICED IT COMING FROM UNDER THE FRONT PASSENGER SEAT SO WHEN I GOT HOME I STARTED TO UNPLUG THE CONNECTORS TO SEE IF SOMETHING WAS MELTING AND WHEN I UNPLUG THE ONE FOR THE HEATED SEATS I SAW IT WAS MELT AND I WENT ONLINE TO LOOK IF THIS IS A PROBLEM AND MANY OWNERS HAVE THIS PROBLEM AND THIS COULD CAUSE A FIRE IT LOOKS  LIKE AND THERE SHOULD BE A RECALL FOR THIS I DO NOT THIS ITS SAFE, CONTACTED GM TOLD THEM ABOUT IT AND THEY SAID ITS OUT OF WARRANTY",
        "vin": "1G6KD57Y98U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/27/2017",
        "dateOfIncident": "06/18/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11001683,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CADILLAC DTS. THE CONTACT STATED THAT THE VEHICLE FAILED TO START WITHOUT WARNING. THE CONTACT INDEPENDENTLY REPLACED THE RELAY SENSOR AND THE VEHICLE STARTED. IN ADDITION, WHILE DRIVING 55 MPH, THE ENGINE POWER AND BRAKES FAILED, AND THE STEERING WHEEL SEIZED. THE VEHICLE FAILED TO RESTART. THE VEHICLE WAS TOWED TO THE LOCAL DEALER (RUDDELL AUTO, LOCATED ON 110 S GOLF COURSE RD, PORT ANGELES, WA, 98362) WHERE IT WAS DIAGNOSED THAT THE RELAY FUSE BOX AND PANEL MELTED AND NEED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 97,000.",
        "vin": "1G6KD57Y38U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/24/2017",
        "dateOfIncident": "04/05/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10980059,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL PUMP RELAY OVERHEATED TO THE POINT OF MELTING CAUSING IRREPARABLE DAMAGE TO THE RELAY AND THE FUSE BLOCK LOCATED INSIDE THE PASSENGER CABIN UNDER THE BACK SEAT OF THE VEHICLE CREATING A POTENTIAL FIRE HAZARD. VEHICLE WAS IN MOTION ON A CITY STREET WHEN FAILURE OCCURRED CAUSING LOSS OF ALL POWER STEERING AND BRAKING.",
        "vin": "1G6KD57Y38U"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/26/2017",
        "dateOfIncident": "02/23/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10957126,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT THE CAR WITH 69K MILES IN MAY OF 2016 AND NOW ITS HAS 80K MILES FEB 2017 AND I HAVE AN OIL LEAK THAT IS LEAKING ON THE DRIVE SIDE OF THE OIL PAN FROM THE FRONT TO THE BACK AND ITS LEAKING ON THE THE EXHAUST THE RUNS FROM THE FRONT OF THE ENGINE THAT IS BOLTED ON THE THE OIL PAN  AND I AM WORRIED THAT IT IS GOING TO CATCH ON FIRE AND I SEE THAT THIS PROBLEM IS ON A LOT OF THIS CARS AND WITH LOWER MILES THEN MINE I THINK GM SHOULD RECALL IT BECAUSE LESS THEN 100K MILES AND TO HAVE AN OIL LEAK THAT LEAKS ABOUT 1 QUART EVERY 1500 MILES OR SO AND ITS LEAKING RIGHT NEXT TO THE EXHAUST AND RIGHT ON TOP OF IT THE COULD CASE FIRE IS UNSAFE, AND TO COST $1000-2000 TO FIX THERE DESIGN FLAW THE OWNERS SHOULD NOT HAVE TO PAY I COULD UNDERSTAND IF IT HAD MORE THEN 100K MILES",
        "vin": "1G6KD57Y98U"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/15/2017",
        "dateOfIncident": "11/24/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10945398,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "IN NOV. OF 2016, MY DTS  WAS PARKED AND AFTER ATTEMPTING TO START, IT WOULD NOT TURN OVER AS IF WERE OUT OF GAS. I HAD TO HAVE IT  TOWED TO  REPAIR FACILITY. IT WAS DIAGNOSED AND DETERMINED THAT THE PROBLEM WAS CAUSED BY THE FUEL PUMP RELAY, WHICH HAD SHORTED. FURTHER INVESTIGATION REVEALED THAT THE ACTUAL CAUSE WAS THE FUSE BLOCK (REAR SEAT).  THIS ITEM IS A DEALER REPAIR LEVEL AND SHOULD HAVE BEEN RECALLED SINCE THERE ARE SEVERAL CASES  OF THIS AND OTHER ELECTRICAL PROBLEMS INVOLVING SUDDEN CUT-OFFS, POWER STEERING ISSUES AND IGNITION KEY PROBLEMS NOTED HERE. MY CAR HAS EXPERIENCED ALL OF THESE.  *TR",
        "vin": "1G6KD57908U"
    },
    {
        "components": "UNKNOWN OR OTHER,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/28/2016",
        "dateOfIncident": "06/06/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10919910,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL PUMP RELAY MELTED  REPLACED REAR FUSE BOX AND RELAY  TRIED TO START VEHICLE ON 6 JUNE 2016 VEHICLE WOULD NOT START AT ALL. HAD VEHICLE TOWED IN TO DIAGNOSE $81.99 JUST PURCHASED ABOUT 6 MONTHS AGO.  PURCHASED A WARRANTY BUT THIS PROBLEM WAS NOT COVERED.  I HAVE NEVER HAD THIS EXPERIENCE WITH A VEHICLE.  AFTER EXTENSIVE READING I FIND THIS IS A PROBLEM WITH A VARIETY OF CADILLAC VEHICLES. I HAD TO PAY $796.43, PARTS WERE $397.51.THIS SHOULD  HAVE NEVER HAPPEN AND COULD HAVE CAUSED MAJOR DAMAGE.  SINCE CADILLAC KNOW THIS IS A PROBLEM I FEEL I SHOULD BE REIMBURSED FOR MY SUFFERING AND PAIN. THIS PROBLEM COULD HAVE RESULTED IN A FIRE STARTING IN THE SEAT AREA.  I PROBABLY WOULD NOT HAVE KNOWN UNTIL IT WAS TO LATE.",
        "vin": "1G6KD57968U"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "07/11/2016",
        "dateOfIncident": "05/19/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10884087,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG DIDN'T DEPLOY AFTER HEAD ON COLLISION TRAVELING 23 MILES PER HOUR, ON A CITY STREET, GOING STRAIGHT. CAR WAS CONSIDERED TOTALED BY USAA.",
        "vin": "1G6KD57Y58U"
    },
    {
        "components": "UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/28/2016",
        "dateOfIncident": "06/28/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10881319,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ABS WILL RANDOMLY APPLY IN GOOD DRIVING CONDITIONS FOR NO REASON WHEN THE BRAKES ARE APPLIED CAUSING YOU TO POTENTIALLY LOOSE CONTROL OF THE VEHICLE. HAD THE ABS MODULE REPLACED AND ISSUE HAPPENED AGAIN 3 MONTHS AFTER VERY COSTLY REPAIR.      NOTE: VEHICLE HAD A CODE \"YAW RATE SENSOR\"",
        "vin": "1G6KD57Y68U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/06/2016",
        "dateOfIncident": "03/15/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10872838,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "RECEIVED RECALL NOTICE STATING  #14299 IGNITION KEY ROTATION WAS AN ISSUE.  STATED SERVICE HAD NOT BEEN COMPLETED.  I HAD INSTALLED AND PAID FOR A COMPLETE NEW IGNITION UNIT EARLIER THIS SPRING AT A COST OF $400.OO PLUS.  I AM NOT HAPPY TO KNOW THE OLD UNIT NEEDED RECALL, AND FURTHER THAT MY DEALER NEVER NOTIFIED THE MANUFACTURER.  I BELIEVE I HAVE A REFUND DUE AT THIS TIME.  PLEASE REPLY AS SOON AS POSSIBLE.",
        "vin": "1G6KD57Y37U"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/14/2015",
        "dateOfIncident": "09/04/2015",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10763722,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 9/4/15 @ APPROX 5:45 P.M, VEHICLE WOULD NOT START - IT ACTED LIKE THERE WAS NO FUEL GETTING TO THE INJECTORS.  THREE HOURS LATER I TRIED TO START THE CAR AND IT STARTED JUST FINE; TOOK IT FOR A DRIVE AROUND THE BLOCK W/O ANY ISSUES.  ON 9/7/15 THE PROBLEM RESURFACED; I HAD THE CAR TOWED TO A LOCAL MECHANIC WHO DIAGNOSED THE PROBLEM ON 9,/8/15, TO BE A BAD FUEL PUMP RELAY.  CAR WORKED FINE FOR ONE DAY; ON 9/9/15 THE PROBLEM RESURFACED ONCE AGAIN - IF THE CAR SAT OFF FOR A COUPLE OF HOURS THE PROBLEM WOULD GO AWAY.  I TOOK THE CAR TO THE BUICK GMC DEALER AND THEY DIAGNOSED THE ROOT CAUSE TO BE A BAD FUSE BOX ASSEMBLY ($318 PART).    THE FUEL PUMP RELAY GOT HOT ENOUGH TO MELT THE HARD PLASTIC OF THE FUSE BOX ASSEMBLY, AND THERE ARE BURN MARKS ON THE BODY OF THE FUEL PUMP RELAY - I HAVE THE OLD PARTS AND PICTURES OF SAME.  THE SERVICE REP AT THE   BUICK GMC DEALER SAID THEY HAVE SEEN THIS PROBLEM ON BUICK LACROSSE.  BEING THAT THE FUSE BOX IS UNDER THE REAR SEAT OF THE CAR, THERE IS THE POTENTIAL FOR THE CAR TO CATCH ON FIRE.",
        "vin": "1G6KD57Y58U"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/14/2015",
        "dateOfIncident": "07/01/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10733957,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CADILLAC DTS. WHILE DRIVING APPROXIMATELY 50 MPH AND ATTEMPTING TO DECELERATE, THE BRAKE PEDAL WAS ENGAGED AND FAILED TO SLOW THE VEHICLE DOWN. THE CONTACT STATED THAT THE PEDAL SANK TO TO THE FLOORBOARD. THE VEHICLE INDEPENDENTLY ACCELERATED FROM 50 MPH TO 70 MPH. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSTIC TESTING. THE TECHNICIAN STATED THAT THERE WAS NOTHING WRONG WITH THE VEHICLE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 5,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,POWER TRAIN,WHEELS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/20/2015",
        "dateOfIncident": "03/18/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10706591,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CADILLAC DTS. WHILE DRIVING APPROXIMATELY 25 MPH, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE RESTARTED; HOWEVER, THE FAILURE RECURRED ON SEVERAL OCCASIONS. THE VEHICLE WAS TAKEN TO THE DEALER BUT THE CAUSE OF THE FAILURE WAS UNABLE TO BE DETERMINED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 24,000.     THE CONSUMER WAS ADVISED TO CONTINUE TO DRIVE THE VEHICLE UNTIL THE ENGINE SHUT OFF AND HAVE IT TOWED INTO THE DEALER. THE CONSUMER FELT THIS WAS DANGEROUS AND DECLINED. THE CONSUMER WOULD LIKE TO BE ADVISED OF POSSIBLE OTHER OPTIONS TO RESOLVE THE MALFUNCTION. UPDATED 09/12/2017*JS",
        "vin": "1GEEH00Y98U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/15/2015",
        "dateOfIncident": "11/11/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10705801,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CADILLAC DTS. THE CONTACT STATED THAT THE ENTIRE INSTRUMENT PANEL ILLUMINATED INTERMITTENTLY. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "1G6KD57Y88U"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/31/2015",
        "dateOfIncident": "01/15/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10680243,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER PARKING MY CAR IN THE GARAGE,APPROXIMATELY 3 WEEKS LATER,I WENT TO START MY CAR,BUT IT WOULD NOT START,IT WOULD CRANK OVER GOOD ,BUT WOULD NOT START.  I PROCEEDED WITH  MY OWN ASSUMPTIONS AND FOUND A PIN(#30)ON THE FUEL PUMP RELAY WAS BURNT,I HAD AN ELECTRICAL DIAGNOSIS PERFORMED ON THE WIRING AND THE FUEL PUMP,BOTH PASSED OKAY,I WAS TOLD THE FUSE BLOCK WAS BAD,(WHICH I SUSPECTED),WHICH I HAD PREVIOUSLY ORDERED FROM THE CADILLAC DEALER.  ON INSTALLING THE NEW FUSE BLOCK,THE PROBLEM WAS SOLVED.   *TR",
        "vin": "1G6KD57Y58U"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/30/2015",
        "dateOfIncident": "01/08/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10680088,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL PUMP MODULE OVERHEATED, ALMOST TO THE POINT OF FIRE.  THIS PART WAS RECALLED IN 2006-2007 CTS-V AND STS-V, BUT CONTINUES IN THEIR 2008 DTS. IT IS DIFFERENT IN THE MANNER IT OCCURS, BUT WITH SAME RESULT. REPLACED THE MODULE, CAR DIED AGAIN, REPLACED FUEL PUMP AND MODULE AGAIN, CAR DIED AGAIN. THIS IS VERY DANGEROUS WITH CHILDREN STRAPPED IN SITTING RIGHT OVER THE BURNING HOT MODULE.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/18/2014",
        "dateOfIncident": "12/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10660615,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 CADILLAC DTS. RECALL REGARDING IF KEY RING IS ADDING WEIGHT TO VEHICLE. *TA  ACCORDING TO THE RECALL LETTER, THE PARTS ARE NOT AVAILABLE. *JB",
        "vin": "1G6KD57Y68U"
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "11/16/2014",
        "dateOfIncident": "11/13/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10655316,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE HIT IN RIGHT SIDE BY A DRIVER WHO PULLED OUT FROM A STOP SIGN AND CROSSED TWO LANES HITTING OUR CAR IN THE PASSENGER SIDE ON THE FENDER AND FRONT DOOR. AIR BAGS DID NOT DEPLOY CAUSING INJURY TO HEAD AND NECK.  *TR",
        "vin": "1G6KD57Y68U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/14/2014",
        "dateOfIncident": "11/14/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10655063,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CADILLAC DTS. THE CONTACT RECEIVED A NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 14V355000 (ELECTRICAL SYSTEM). HOWEVER, THE PARTS NEEDED FOR THE REPAIRS WERE UNAVAILABLE. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "1G6KD57Y98U"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/07/2014",
        "dateOfIncident": "07/12/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10653416,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DAYTIME RUNNING LIGHTS AND FRONT TURN SIGNAL LIGHT SOCKETS IN BOTH HEADLAMPS HAVE BURNT CONTACTS. I TOOK   MY 2008 CADILLAC DTS TO THE DEALER TO HAVE THE BULBS REPLACED AS MY TURN SIGNALS WEREN'T WORKING. THEY   REPLACED THE BULBS. TWO DAYS LATER THEY QUIT WORKING AGAIN. I TOOK THE CAR BACK AND THEY CHECKED IT AGAIN  AND INFORMED ME THAT THE LAMP SOCKETS WERE BURNT AND THAT I WOULD HAVE TO REPLACE THE ENTIRE HEADLAMP  ASSEMBLY BECAUSE THERE WASN'T A REPLACEMENT SOCKET AVAILABLE. THE COST WAS GOING TO BE APPROXIMATELY  $1000 EACH WITH LABOR. I BELIEVE THIS A SAFETY ISSUE AND CADILLAC SHOULD EITHER PROVIDE A REPLACEMENT SOCKET  OR COVER A PART OF THE PART AND LABOR. RIGHT NOW I HAVE THE SOCKETS TEMPORARILY REPAIRED WITH PAPER CLIPS AND  ALUMINUM FOIL BECAUSE ON SOCIAL SECURITY I CAN'T AFFORD THEIR COST TO FIX BUT I WON'T DRIVE ON THE ROAD WITH NO  FRONT TURN SIGNALS AND ENDANGER OTHER FOLKS ON THE ROAD.  *TR",
        "vin": "1G6KD57Y98U"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "11/07/2014",
        "dateOfIncident": "09/09/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10653477,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2008 CADILLAC DTS. THE CONTACT STATED THAT THE REAR DRIVER AND PASSENGER SIDE SEAT BELTS FAILED TO PROPERLY FIT ACROSS THE CHEST AREA AND WENT ACROSS THE NECK AREA. THE CONTACT STATED THAT THE SHOULDER ANCHOR WAS ADJUSTED TO THE LOWER LEVEL BUT THE SEAT BELT CONTINUED TO LIE ACROSS THE NECK AREA. THE CONTACT WAS CONCERNED THAT IN THE EVENT OF A CRASH, THE SEAT BELT WOULD CAUSE FATAL INJURIES. ALSO, THE CONTACT STATED THAT HER NECK WAS BLISTERED DUE TO THE FAILURE BUT MEDICAL ATTENTION WAS NOT REQUIRED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND RECOMMENDED THE CONTACT TO PURCHASE SEAT BELT PADS. THE FAILURE MILEAGE WAS 50,000.",
        "vin": "1G6KD57Y28U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/06/2014",
        "dateOfIncident": "10/29/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10653114,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CADILLAC DTS. WHILE DRIVING APPROXIMATELY 50 MPH, THE KEY FELL OUT OF THE IGNITION. THE VEHICLE WAS TAKEN TO THE DEALER WHO STATED THAT THE IGNITION NEEDED TO BE REPLACED. THE VEHICLE HAS NOT BEEN REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 90,000.",
        "vin": "1G6KD57Y08U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/04/2014",
        "dateOfIncident": "11/04/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10652415,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TOOK MY VEHICLE IN FOR SAFETY RECALL 14299 NOTHING WAS DONE TO THE SWITCH THEY JUST PUT SOMETHING ON THE KEY AND 2 SMALL KEY RINGS AND TOLD ME THAT NOTHING ELSE WAS TO BE PUT ON THE KEY RING. IN MY OPINION THE REPAIR WAS NOT DONE WHAT IS STOPPING THE KEY SWITCH FROM SHUTTING OFF AS A MECHANIC NOTHING WAS DONE.  *TR",
        "vin": "1G6KD57Y88U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/07/2014",
        "dateOfIncident": "08/04/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10641922,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CADILLAC DTS. THE CONTACT RECEIVED A NOTIFICATION FOR RECALL NHTSA CAMPAIGN NUMBER: 14V355000 (ELECTRICAL SYSTEM). THE CONTACT STATED THAT THE PART NEEDED TO REMEDY THE VEHICLE WAS UNAVAILABLE. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCE A FAILURE.",
        "vin": "1G6KD57YX8U"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/16/2014",
        "dateOfIncident": "03/21/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10633541,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CADILLAC DTS. WHILE DRIVING 30 MPH, A DEER CRASHED INTO THE FRONT PASSENGER SIDE OF THE VEHICLE. THE AIR BAGS FAILED TO DEPLOY. THERE WERE NO INJURIES. THE VEHICLE WAS TAKEN TO A PRIVATE MECHANIC WHERE IT WAS DIAGNOSED THAT THE COMPUTER MODULE NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED AND THE MANUFACTURER WAS NOT NOTIFIED. THE CONTACT RECEIVED A RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 14V355000 (ELECTRICAL SYSTEM); HOWEVER, THE PART NEEDED TO REPAIR THE VEHICLE WAS UNAVAILABLE. THE FAILURE MILEAGE WAS 90,000.",
        "vin": "1G6KD57Y28U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/15/2014",
        "dateOfIncident": "09/12/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10633152,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CADILLAC DTS. WHILE DRIVING AT LOW SPEEDS, THE POWER STEERING FAILED AND SMOKE APPEARED. THE CONTACT NOTICED POWER STEERING FLUID LEAKING. THE DEALER STATED THAT THE HIGH PRESSURE HOSES NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 112,000.",
        "vin": "1G6KD57Y98U"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/05/2014",
        "dateOfIncident": "09/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10631124,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CADILLAC DTS. THE CONTACT STATED THAT WHEN IT WOULD RAIN, WATER WOULD LEAK FROM THE FRONT DRIVER'S SIDE DOOR. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 93,400.",
        "vin": "1G6KD57Y08U"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,AIR BAGS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/04/2014",
        "dateOfIncident": "09/04/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10630774,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "GM RECALL 14299/NHTSA RECALL 14V355000  THE GM FIX FOR THIS FAULTY IGNITION SWITCH IS TO INSTALL A SMALLER (13MM) KEY RING AND SMALL INSERTS ON THE IGNITION KEYS TO PREVENT INSTALLING ANY OTHER THINGS ON THE KEY RING.   THIS IS NOT A FIX FOR A FAULTY IGNITION SWITCH, BUT A MEANS TO CIRCUMVENT THE PROBLEM!  I FIND IT EXTREMELY DIFFICULT TO BELIEVE THAT YOUR ORGANIZATION WOULD RUBBER STAMP THIS SHODDY CIRCUMVENTION OF THE REAL PROBLEM!  HOW MANY VEHICLE ACCIDENTS ARE YOU AND GM WILLING TO ALLOW BEFORE FIXING THE PROBLEM PROPERLY?  REST ASSURED, MY ATTORNEY HAS A COPY OF THIS COMPLAINT AND WILL TAKE THE APPROPRIATE ACTION SHOULD MY VEHICLE MALFUNCTION!   *TR",
        "vin": "1G6KD57Y08U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/25/2014",
        "dateOfIncident": "08/25/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10628090,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CADILLAC DTS. THE CONTACT RECEIVED A RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 14V355000 (ELECTRICAL SYSTEM); HOWEVER, THE PARTS WERE UNAVAILABLE TO REPAIR THE VEHICLE. THE CONTACT WAS AFRAID TO DRIVE THE VEHICLE. THE DEALER WAS UNCERTAIN WHEN THE PARTS WOULD BECOME AVAILABLE. THE MANUFACTURER WAS NOTIFIED. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "1G6KD57Y68U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/19/2014",
        "dateOfIncident": "08/18/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10626283,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "RECEIVED NOTICE OF GM RECALL 14299 ON 8/18/14.  FURIOUS THAT THE PARTS TO REMEDY THIS PROBLEM ARE SAID TO BE UNAVAILABLE AND NO DATE - OR EVEN AN EXPECTED DATE - FOR THEIR AVAILABILITY IS GIVEN IN THE LETTER RECEIVED.  GM HAS KNOWN OF THIS PROBLEM LITERALLY FOR YEARS NOW AND I DON'T APPRECIATE THE FACT THAT THERE ARE NO PARTS TO PROVIDE AN IMMEDIATE REMEDY OR AN ANTICIPATED DATE FOR ITS RESOLUTION.  TOTALLY UNCONSCIONABLE!  MEANWHILE, OWNERS ARE EXPECTED TO USE ONLY THEIR IGNITION KEY (NO OTHER IMPLEMENTS ARE TO BE ON THE KEY RING - SUCH AS THOSE FOR SELF-DEFENSE OR CONVENIENCE) TO OBVIATE GM'S SAFETY LAPSE FOR AN UNDETERMINED LENGTH OF TIME THAT WILL BE AT THE CONVENIENCE OF GM, NOT THEIR CUSTOMERS.  ADDITIONALLY, SINCE THERE HAS BEEN MEDIA COVERAGE OF THIS PARTICULAR PROBLEM FOR YEARS, WHY AM I ONLY NOW RECEIVING NOTICE THAT MY CAR IS INVOLVED IN THIS RECALL?  *TR",
        "vin": "1G6KD57Y78U"
    },
    {
        "components": "SUSPENSION,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/18/2014",
        "dateOfIncident": "07/23/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10626074,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CADILLAC DTS.  THE CONTACT STATED WHILE DRIVING APPROXIMATELY 40 MPH, THE ENGINE STALLED WITHOUT WARNING.   THE CONTACT THEN INSPECTED THE VEHICLE AND NOTICED THAT THE POWER  STEERING PUMP DETACHED FROM THE VEHICLE.  THE CONTACT ALSO STATED THAT  THE STEERING WHEEL BECAME HARD TO TURN. THE CONTACT ALSO NOTICED THE STRUTS WERE LEAKING. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED.  THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE CONTACT RECEIVED NHTSA CAMPAIGN NUMBER 14V355000 (ELECTRICAL SYSTEM) AND STATED THAT THE PARTS WERE NOT AVAILABLE UNDER THE RECALL.  THE APPROXIMATE FAILURE MILEAGE WAS 90,000.",
        "vin": "1G6KD57Y78U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/17/2014",
        "dateOfIncident": "09/12/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10625835,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A 41 INCH BRAKE LIGHT INSTALLED ON THE TRUNK LID WHICH COSTS $223.75 TO REPLACE. IT WOULD HAVE BEEN NO BIG DEAL, BUT, AS I WAS REPLACING IT, I NOTICED IT WAS NEVER PROPERLY FITTED TO THE TRUNK AT THE FACTORY, WHICH CAUSED THE ORIGINAL DAMAGE, BROKEN COMPLETELY THROUGH IN THE MIDDLE, AND SEVERAL CRACKS, NOT WORKING. TO BOLT ON A NEW ONE IMPROPERLY FITTED WILL CAUSE THE SAME DAMAGE BECAUSE THE HARD PLASTIC IS UNDER HEAVY STRESS WHEN TIGHTENED DOWN. TO PROPERLY FIX THE SITUATION WILL COST THOUSANDS, MY WIFE AND I BOTH HAVE DISABILITIES AND WE CANNOT POSSIBLY AFFORD THE FIX AS THE CAR ALREADY NEEDS OVER $3000 IN SUSPENSION PARTS AS WELL, PLUS LABOR. IT IS A SAFETY ISSUE AND A TICKETABLE OFFENSE. WE EXPECT GM TO FULLY PAY FOR A PROPER FIX AS THEY HAD TO KNOW WHAT WOULD HAPPEN UP THE ROAD. I'M SURE THEY'VE ALSO NOTICED A LARGE NUMBER OF THE LIGHTS BEING ORDERED. DOESN'T PRESIDENT OBAMA RIDE IN A STRETCHED DTS? HE MIGHT WANT TO HAVE HIS FIXED TOO. BY THE WAY, WE JUST PURCHASED A NEW MALIBU 6 DAYS AGO, WHICH IF THIS ISN'T HANDLED RAPIDLY WILL GO RIGHT BACK TO THE DEALER AND BOTH PERSONAL AND CLASS ACTION SUITS FILED.   *TR",
        "vin": "1G6KD57968U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/27/2014",
        "dateOfIncident": "05/23/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10606505,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2008 CADILLAC DTS. THE CONTACT STATED THAT THE STEERING WHEEL ADJUSTER FAILED WHICH CAUSED THE CONTACT TO BECOME TRAPPED IN THE DRIVERS SEAT. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THE TECHNICIAN WAS UNABLE TO DUPLICATE THE FAILURE. THE VEHICLE WAS NOT MADE AWARE OF THE FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 50,000 AND THE CURRENT MILEAGE WAS 55,000.",
        "vin": "1G6KD57Y08U"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "05/14/2014",
        "dateOfIncident": "05/25/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10587979,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 CADILLAC DTS.  CONSUMER WRITES IN REGARDS TO VEHICLE ELECTRICAL PROBLEMS.  *SMD  THE CONSUMER STATED HE LOST POWER FOR A COUPLE OF SECONDS, THEN EVERYTHING RETURNED TO NORMAL. WHEN IT HAPPENED AGAIN, EVERYTHING, DID NOT RETURN TO NORMAL. THE BATTERY, ALTERNATOR AND HEADLIGHT HAD TO BE REPLACED. ALSO, THE WINDSHIELD WASHER HEATER BURNED OUT. THE HEATER WAS REPLACED. *JB",
        "vin": "1G6KD57Y48U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/13/2014",
        "dateOfIncident": "05/12/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10588069,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD A PROBLEM WITH MY CAR FOR OVER A YEAR. I KEEP GETTING FUMES FROM THE VENT AND SEVERAL TIMES I HAVE HAD THE CAR TO  CADILLAC ON SEVERAL OCASSIONS. HAD MADE SEVERAL COMPLAINTS TO GENERAL MOTORS AND I ALWAYS GET A CALL BACK, MOST OF THE TIME IT WOULD BE A DIFFERENT PERSON BUT THEY ALL SAID THE SAME THING, JUST LIKE THEY WERE PROGRAMED.MY SON HAS A FRIEND WHO WAS A TROUBLE SHOOTER FOR GM AND WORKED FOR FROST MOTORS UNTIL THEY LOST THEIR FRANCHISE AND HE WENT OUT ON HIS OWN. HE TOLD MY SON THAT THIS WAS A COMMON PROBLEM WITH THESE CARS FROM 2006 TO 2010  AND MOST OF THE TIME THE VEHICLES HAD HIGH MILAGE ON THEM AND GM WOULD STALL THEM OFF AND THEIR WARRANTE WOULD RUN OUT. I HAVE 64,000 ON MY CAR NOW  AND TWO WEEKS LEFT ON MY WARRANTE. TODAY I CONTACTED CONGRESSMAN KENNEDYS OFFICE DUE TO WHAT I HAVE SEEN ON THE NEWS AND THE CHIEF EXECDUTIVE OFFICER OF GENERAL MOTORS GOING BEFORE CONGRESS OVER OTHER VEHICLE SAFETY PROBLEMS. I WAS ADVISED TO MAKE THIS COMPLAINT WHICH I AM DOING AND I WOULD HOPE OTHERS THAT ARE HAVING THE SAME PROBLEM MAKE THE SAME COMPLAINT AND MABY GM WOULD BE FORCED TO FIX OUR CAR'S.  I HAD ALSO WROTE TO MARY T. BARRA CHIEF EXECUTIVE OFFICER FOR GM (CERTIFIED MAIL AND IT WAS SIGNED FOR) AND  I HAVE SPOKEN TO HER ASSISTANCE [XXX] AND ALL HE WOULD SAY IS THEY ARE VERY CONCERNED WITH THEIR CUSTOMERS ISUES.AND TAKE ALL COMPLAINTS SERIOUSLY. ONE THING THEY DID DO WAS OFFER ME $1,000.00 TOWARDS A NEW CADILLAC, I HAVE PUT THE INCIDENT DATE DOWN AS 5-12-14 AS WE WERE GOING TO THE DOCTOR YESTERDAY AND GOT THE FUMES AGAIN. WHEN I TOLD THEM I WAS WRITING TO CONGRESSMAN KENNEDY, THEY STOPPED TALKING TO ME. ( I WONDER WHY)?     INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "1G6KD57Y98U"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/31/2014",
        "dateOfIncident": "03/19/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10576089,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CADILLAC DTS 2008 WOULD NOT START..                HAD DTS TOWED TO FOREMAN-BLAIR GM DEALERSHIP.. 896382 SCAN FOR CODES  NONE FOUND NO FUEL PRESSURE  NO VOLTAGE AT CIRCUIT TO FUEL PUMP NO VOLTAGE BURN CONNECTOR AT FUSE BOX  REPLACE BOX  C MULTI POINT INSPECTION                    THE RELAY 19116057 GOT HOT  AND BURN CONNECTOR AT FUSE BOX AND MELTED THE FUSE BLOCK 19116816 WHICH IS LOCATED UNDER THR BACK SEAT,, THAT MIGHT SET THE CAR OF FIRE..   THIS NOT THE FIRST  TIME THIS HAS HAPPEN ON DTS CAR  THERE ARE MORE ON THE INTERNET THAT HAD THE SAME   PROBLEM,,, I NEED TO GET MY MONEY BACK $735.18 , BECAUSE THIS WAS NOT MY FOUGHT.  *TR",
        "vin": "1G6KD57Y08U"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/29/2014",
        "dateOfIncident": "03/13/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10575477,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "OIL SMELL FUMES COMINING FROM THE HEATER VENTS. SO BAD AT TIMES WE HAD TO GET OUT OF THE CAR. HAVE TAKEN THE CAR TO TWO DIFFERENT CADILLAC DEALERS AND HAVE BEEN TOLD THEY COULD NOT FIND ANYTHING. I HAVE HAD THE ENGINE LIGHT COME ON CODE P0411 AND IT WENT OUT. TOOK IT TO THE DELEAR AND THEY RESET THE COMPUTER. ON MARCH 2ND THE LIGHT CAME ON AGAIN AND WENT OUT THE NEXT DAY. I WAS TOLD NEXT TIME THE I GOT THE SMELL  TO GO DIRECTLY TO ANY GM DELEAR. I HAD TAKEN MY WIFE TO THE DOCTOR IN NATICK MASS AND WE GOT THE FUMES AND I WENT TO LONG CADILLAC WHICH I WAS TOLD TO DO ONLY TO FIND OUT THEY MOVED TO WESTBORO MASS. A FORMER TROBULE SHOOTER FOR GM WHO USED TO WOREK FOR FROST CADILLAC UNTIL THEY LOST THEIR FRANCHISE TOLD MY SON THIS IS A COMMON THING WITH 2006 TO 2010 CADILLACS AND IF THIS IS THE CASE THE MOTOR HAS TO COME OUT OF THE VEHICLE SO IT CAN BE RESEALED. I HAVE A FEW MONTHS LEFT ON MY BUMBER TO BUMBER WARRANTY AND IT SEEMS THAT GM IS STALLING ME UNTIL THE WARRANTY RUNS OUT. I HAVE SENT TWO LETTERS TO GM ONE WAS TO THEIR PRESIDENT AND ALL I WOULD GET IS A NICE PERSON WHOM SEEMED THEY WERE INTERESTED BUT NOTHING WAS EVER DONE BY THEM EXCEPT MAKE AN APPOINTMENT AT THE CADILLAC DEALER. MY CAR HAS 64,000 ON IT.  *TR",
        "vin": "1G6KD57Y98U"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/21/2014",
        "dateOfIncident": "09/24/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10560782,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CADILLAC DTS. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 25 MPH, THE STEERING WHEEL SEIZED. THE CONTACT CRASHED INTO CEMENT WALL AS A RESULT.  THE AIR BAGS FAILED TO DEPLOY. THE VEHICLE WAS DESTROYED. THE CONTACT WAS NOT INJURED AND A POLICE REPORT WAS NOT FILED. THE VEHICLE WAS TOWED TO A SALVAGE YARD. THE MANUFACTURER WAS MADE AWARE OF THE PROBLEM. THE APPROXIMATE FAILURE MILEAGE WAS 111,730.  *TR",
        "vin": "1G6KD57Y78U"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "12/23/2013",
        "dateOfIncident": "10/12/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10557034,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CADILLAC DTS. THE CONTACT STATED THAT BOTH THE REAR DRIVER AND PASSENGER SIDE LAP-SHOULDER BELTS FAILED TO LATCH. THE CONTACT MENTIONED THAT THE FAILURE WOULD OCCUR INTERMITTENTLY. THE VEHICLE WAS NOT TAKEN TO A DEALER FOR INSPECTION. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 50,000 AND THE CURRENT MILEAGE WAS 60,000.",
        "vin": "1G6KD57Y88U"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/23/2013",
        "dateOfIncident": "02/12/2012",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10553559,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I STARTED TO SMELL SMOKE IN THE CAR, I SHUT THE ENGINE, THE SMOKE WAS COMING FROM UNDER THE BACK SEAT. I REMOVED THE BACK SEAT, AND SMELLED THE FUSE BOX, AND OPENED THE FUSE BOX COVER, AND I FOUND THAT TWO RELAYS WERE VERY HOT, AND ONE OF THEM WAS BURNED, AND MELTED ALL THE WAY INTO THE BOTTOM OF  THE WHOLE FUSE BOX BLOCK. I HAD THE WHOLE FUSE BLOCK REPLACED THE PART ALONE WAS $225.71 PLUS INSTALLATION. A YEAR LATER SAME EXACT THING HAPPENED, I WENT TO THE DEALER, AND I WAS TOLD THAT THERE IS NO RECALL ON THIS FUSE BLOCK. SO I GUESS I HAVE TO DO THIS ALL OVER AGAIN IF I WANT TO DRIVE THIS VEHICLE.  *TR",
        "vin": "1G6KD57Y58U"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "10/28/2013",
        "dateOfIncident": "09/25/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10549845,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CADILLAC DTS. THE CONTACT STATED THAT THE STEERING WHEEL SEIZED WITHOUT WARNING, CAUSING THE CONTACT TO LOSE CONTROL OF THE VEHICLE. THE CONTACT CRASHED INTO A CEMENT WALL BUT DID NOT SUFFER ANY INJURIES. A POLICE REPORT WAS NOT FILED. THE VEHICLE WAS TOWED TO THE DEALER FOR FURTHER INSPECTION. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE AND CURRENT MILEAGE WAS 111,730.  UPDATED 12/04/13*LJ  ..UPDATED 12-05-13 *BF",
        "vin": "1G6KD57Y78U"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/28/2013",
        "dateOfIncident": "08/23/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10537697,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CADILLAC DTS. THE CONTACT STATED THAT A GASOLINE ODOR EMITTED IN THE REAR OF THE VEHICLE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED AS HAVING A CRACKED FUEL PUMP. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE INCIDENT. THE APPROXIMATE FAILURE MILEAGE WAS 144,205.  ..UPDATED 09/30/13 *BF  UPDATED 10/24/13*JB",
        "vin": "1G6KD57Y88U"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "06/26/2013",
        "dateOfIncident": "06/25/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10521917,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CADILLAC WAS STOPPED IN TRAFFIC ON THE HIGHWAY AND AIRBAGS FAILED TO DEPLOY WHEN REAR ENDED BY SEMI-TRUCK GOING POSSIBLY 40MPH CAUSING THE CADILLAC TO CRASH INTO THE CAR IN FRONT AS WELL. THE CAR WAS TOTAL LOSS, THE SPEED OF SEMI TRUCK IS UNKNOWN BUT SEEING THE CADILLAC WAS TOTAL LOSS AND WITH SERIOUS DAMAGE TO THE FRONT AND BACK OF THE VEHICLE THE AIRBAG SHOULD HAVE GONE OFF AND DID NOT.  *TR",
        "vin": "1G6KD57Y98U"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/04/2013",
        "dateOfIncident": "05/01/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10510641,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH REAR DOORS WILL NOT OPEN IN WARM WEATHER.   DEALER WILL NOT REPAIR BECAUSE VEHICLE IS OUT OF FACTORY WARRANTY.  WE ARE UNABLE TO OPEN THE DOOR WHEN DISEMBARKING CHILDREN AND ELDERLY HANDICAPPED ADULTS. THERE IS A CONCERN THAT WE CANNOT GET PEOPLE OUT OF THE CAR WHEN THEY CANNOT OPEN IT THEMSELVES FROM THE INSIDE.   THIS IS ALSO A HAZARD IF THE VEHICLE IS INVOLVED IN AN ACCIDENT. ALSO THIS PROLONGS THE TIME INDIVIDUALS REMAIN IN THE CAR IN HOT WEATHER WITH THE WINDOWS UP AND THE DRIVER HAS SHUT OFF THE MOTOR, AND ASSISTING INDIVIDUALS FROM THE VEHICLE.  *TR",
        "vin": "1G6KD57Y18U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/14/2012",
        "dateOfIncident": "08/12/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10470567,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CADILLAC DTS. THE CONTACT STATED THAT IGNITION FAILED AND AS A RESULT, HE WAS UNABLE TO REMOVE THE KEY OUT OF THE IGNITION. THE CONTACT MENTIONED THAT HE LEFT THE KEY IN THE IGNITION OVER NIGHT WHICH CAUSED THE BATTERY TO BE COMPLETELY DRAINED. THE VEHICLE WAS TAKEN TO THE DEALER WHO DIAGNOSE THAT THE SHIFTER SWITCH MECHANISM FRACTURED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE WHO DID NOT OFFER ANY ASSISTANCE AND REFERRED HIM TO NHTSA. THE FAILURE MILEAGE WAS 30,000.",
        "vin": "1G6KD57Y98U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/13/2011",
        "dateOfIncident": "09/01/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10424913,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 CADILLAC DTS. CONSUMER WRITES IN REGARDS TO WARNING LIGHTS, GAUGES AND INDICATORS BEING ILLUMINATED WHILE DRIVING *TGW  THE CONSUMER ALSO STATED THE ALARM SYSTEM GOES OFF AT NIGHT. THE DEALER WAS UNABLE TO FIND A PROBLEM. *JB",
        "vin": "1G6KD57YX8U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/15/2011",
        "dateOfIncident": "03/07/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10390199,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 CADILLAC DTS - PROBLEM WITH DASH BOARD LIGHTS NOT BEING RESET TO BRIGHT WHEN IN SUNLIGHT.  *TR",
        "vin": "1G6KD57Y98U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/17/2011",
        "dateOfIncident": "05/29/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10383052,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DASH LIGHTS AT TIMES WILL NOT COME UP TO BRIGHT LEVEL , VERY HARD TO SEE INSTRUMENTS IN DAYLIGHT ON SUNNY DAY. ONCE DROVE FROM NASHVILLE,TN. TO LOUISVILLE,KY.,BEFORE DASH LIGHTS CAME ON ,THIS WAS STARTING AT ABOUT 8:30 AM IN MAY. WHEN DAYLIGHT  AND SUNNY PLUS DRIVING EAST INTO BRIGHT SUN. *TR",
        "vin": "1G6KD57Y68U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/03/2011",
        "dateOfIncident": "05/03/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10380678,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DASH LIGHTING IS DIMMED WHEN EVER HEADLIGHTS ARE ON DURING DAYLIGHT HOURS.  AUTOMATIC SYSTEM DOES NOT RETURN PANEL LIGHT LEVELS TO DAYLIGHT BRIGHTNESS.  THIS MAKES THE DASH INVISIBLE IN BRIGHT DAYLIGHT.  CONDITION EXISTS UNTIL THE SUN IS HIGH IN THE SKY. DEALER SAYS THIS IS A DESIGN ISSUE!  OWNERS MANUAL SAYS THAT \"PARADE DIMMING\" CAPABILITY IN CAR ELECTRONIC IS INTENDED TO PREVENT THIS FROM HAPPENING.  THIS IS A MAJOR SAFETY HAZZARD.  I HAVE TAKEN THE CAR TO THE DEALER SEVERAL TIMES, THEY HAVE NO CURE.  I HAVE CALLED THE CUSTOMER ASSISTANCE NUMBER.  NO ONE EVER RETURNS MY CALL.  E-MAIL ARE ALSO UNANSWERED.",
        "vin": "1G6KD57Y68U"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/14/2010",
        "dateOfIncident": "04/02/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10355454,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CADILLAC DTS. THE VEHICLE WAS BEING SERVICED AT AN AUTHORIZED DEALER FOR A SIGNAL LIGHT THE MECHANIC HAD TO REMOVE THE LOWER WIND DEFLECTOR. AFTER LEAVING THE DEALER, THE CONTACT WAS DRIVING APPROXIMATELY 60 MPH WHEN THE LOWER WIND DEFLECTOR FRACTURED. THE CONTACT WENT BACK TO THE DEALER AND THE DEALER ADVISED HIM THAT SOMETHING HAD TO HAVE STRUCK THE BOTTOM OF THE VEHICLE FOR THE LOWER WIND DEFLECTOR TO FRACTURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 51,000 AND THE CURRENT MILEAGE WAS APPROXIMATELY 61,000.",
        "vin": "1G6KD57Y18U"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "07/12/2010",
        "dateOfIncident": "06/10/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10342736,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 CADILLAC DTS. THE CENTER POST OBSTRUCTED THE CONSUMERS VIEW WHEN APPROACHING AN INTERSECTION. THE MANUFACTURER TOOK A REPORT, BUT HE NEVER RECEIVED A RESPONSE FROM THE MANUFACTURER CONCERNING THE FAILURE. THE DEALER WASN'T  ABLE OFFER HIM ANY ASSISTANCE. THE CONTACT STATED THAT VEHICLE WILL BE REPLACED. THE FAILURE MILEAGE WAS 5,000 AND THE CURRENT MILEAGE WAS 27,000.  UPDATED 09/01/10. *LJ  UPDATED 09/10/10*JB",
        "vin": "1G6KD57Y98U"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/27/2010",
        "dateOfIncident": "04/17/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10327776,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2008 CADILLAC'S BRAKES HEATED U AND CAUSED SEVERE VIBRATION AND NOISE WHEN DRIVING DOWN ROUTE 58 MOUNTAIN IN PATRICK COUNTY VA. I CALLED TWO DEALERSHIPS, PATTERSON/COLLINS IN MT. AIRY NC AND NELSON CADILLAC IN MARTINSVILLE VA AND BOTH TOLD ME THAT THEY HAD SEVERAL COMPLAINTS BUT THERE WAS NOTHING THAT COULD BE DONE AS THE ASBESTES WAS TAKEN OUT OF THE BRAKE PADS THAT CREATED THIS PROBLEM. *TR",
        "vin": "1G6KD57Y28U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/11/2010",
        "dateOfIncident": "10/29/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10308733,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 CADILLAC DTS. THE INSTRUMENT CLUSTER LIGHTS FAILED AT LEAST TWO TO THREE TIMES A WEEK WHILE DRIVING APPROXIMATELY 25-55 MPH AT NIGHT. THE CONTACT STATED THAT HE CANNOT SEE ANYTHING ON HIS INSTRUMENT PANEL WHENEVER THE LIGHTS SHUT OFF INTERMITTENTLY. THE VEHICLE WAS TAKEN TO THE DEALER FOR A DIAGNOSTIC TEST AND THE FAILURE COULD NOT BE DUPLICATED. THE DEALER ALSO TEST DROVE THE VEHICLE FOR MORE THAN TWO WEEKS AND WAS UNABLE TO DIAGNOSE THE FAILURE. HE CALLED THE GM MANUFACTURER AND WAS TOLD THAT THEY COULD NOT REPAIR THE VEHICLE. THERE WAS NO MAINTENANCE PERFORMED ON THE VEHICLE PRIOR TO THE FAILURE. THE FAILURE MILEAGE WAS 18,000.  UPDATED 03/19/10. *LJ  UPDATED 10/05/10",
        "vin": "1G6KD57Y98U"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "02/25/2009",
        "dateOfIncident": "12/09/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10259966,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR PASSENGER LAP-SHOULDER BELTS ARE UNUSABLE BECAUSE THE BUCKLES ARE TOO FAR DOWN INTO THE SEAT CREVICE TO GET THE LATCH PLATE INTO THE BUCKLE.  THE DEALER HAS TRIED TO PULL THE BUCKLES OUT FURTHER BUT CANNOT.  I HAVE LOOKED AT OTHER CADILLAC AND BUICK AUTOS AND THE BUCKLES ARE LOCATED MUCH FURTHER OUT SO THAT THE LATCH PLATE CAN BE EASILY INSERTED INTO THE BUCKLE AS DESCRIBED ON PAGE 1-24 OF THE CADILLAC DTS OWNERS MANUAL.  THIS IS A SERIOUS SAFETY PROBLEM BECAUSE THE REAR SEAT PASSENGERS CANNOT USE THE LAP-SHOULDER BELTS.  WHAT IS NEEDED IS A LONGER BELT FOR THE BUCKLE END SO THAT THE BUCKLE PROTRUDES MUCH FURTHER OUT OF THE SEAT CREVICE. *TR",
        "vin": "1G6KD57Y58U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/16/2009",
        "dateOfIncident": "02/06/2009",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10258882,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2008 CADALLIC DTS WAS TRYING TO START ON ITS ON. THE KEYS WERE ON THE TABLE AND THE SPARE KEY HANGING ON THE KEY RACK.  IN DOING SO IT CAUSED MY CAR TO CATCH ON FIRE WHICH CAUGHT MY GARAGE ON FIRE. MY FAMILY WAS ALL IN BED WHEN WE WERE AWOKEN BY A PERSON  PASSING BY THE HOUSE AND RECOGNIZED THAT THE LIGHT HE WAS SEEING WAS A FIRE. IN RETURN OUR LIVES WERE SAVED, ALSO  IT WAS DETECTED THE NEXT DAY THAT OUR SPOKE DETECTOR BATTERY WAS DEAD. WE THANKFUL TO GOD ABOVE FOR THE  YOUNG MAN WHO JUST HAPPENED TO BE A FIREFIGHTER AND  OUR HERO. *TR",
        "vin": "1G6KD57Y084"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "11/13/2008",
        "dateOfIncident": "11/03/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10249232,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "LTR FROM SENATOR CARDIN ON BEHALF OF CONSTITUENT RE THE RIGIDNESS OF THE SEAT BELTS IN HER 2008 CADILLAC DTS.   *NJ  THE CONSUMER STATED THE SEAT BELTS WERE VERY TIGHT TO THE SEAT. THE CONSUMER STATED GM NO LONGER USED THE FLEXIBLE STEM FOR THE SEAT BELTS ON ANY OF THE DTS VEHICLES. *JB",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/01/2008",
        "dateOfIncident": "09/24/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10244137,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 CADILLAC DTS.  WHILE DRIVING BETWEEN 15-20 MPH, THE DRIVER SIDE CURTAIN AIR BAGS SUDDENLY DEPLOYED WITHOUT AN IMPACT.  AFTER THE AIR BAGS DEPLOYED, THE LIGHTS ILLUMINATED.  THE CONTACT DROVE THE VEHICLE TO HER RESIDENCE AND THEN CALLED THE DEALER.  THE DEALER DID NOT WANT TO REPAIR THE FAILURE.  THE CONTACT TOOK THE VEHICLE TO ANOTHER DEALER, BUT THEY WOULD NOT ASSIST.  THE DEALER FINALLY AGREED TO REPAIR THE VEHICLE, BUT WOULD NOT STATE WHAT CAUSED THE FAILURE.  THE CONTACT STATED THAT THIS WAS A SERIOUS SAFETY HAZARD.  HIS DAUGHTER AND GRANDSON SUSTAINED TEMPORARY HEARING LOSS AND HEADACHES WHEN THE AIR BAGS DEPLOYED.  THE CURRENT AND FAILURE MILEAGES WERE 30,000.      UPDATED 11/12/08  *BF  UPDATED 11/13/08. *JB",
        "vin": "1G6KD57YX8U"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "09/24/2008",
        "dateOfIncident": "09/10/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10243334,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 CADILLAC DTS.  THE CONTACT STATED THAT THE DRIVER'S SIDE SEAT BELT WAS DEFECTIVE AND NOT IDENTICAL TO THE PASSENGER SIDE SEAT BELT.  THE SEAT BELT ON THE DRIVER'S SIDE IS RIGID AND NOTICEABLY SHORTER THAN THE ONE ON THE PASSENGER SIDE.  THE DEALER SENT A SEAT BELT EXTENDER, BUT IT HAS NOT REMEDIED THE ISSUE.    THE CURRENT MILEAGE WAS 400 AND FAILURE MILEAGE WAS 275.  UPDATED 10/16/08.  *LJ  UPDATED 10/17/08.*JB",
        "vin": "1G6KD57Y48U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/15/2008",
        "dateOfIncident": "09/01/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10242630,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 CADILLAC DTS HAS SEVERAL SAFETY PROBLEMS.  *NJ  THE CONSUMER STATED WHILE DRIVING, THE CHIMES SOUNDED, THE DOORS UNLOCKED AND LOCKED, THE GAUGES AND SPEEDOMETER WENT TO ZERO AND THE CRUISE CONTROL DISENGAGED. THE CONSUMER STATED ALL OF THE MALFUNCTIONS HAPPENED SIMULTANEOUSLY.  THE TRACTION LIGHT THEN ILLUMINATED, THE GAUGES WOULD COME BACK UP AND THE FOLLOWING MESSAGE APPEARED ON THE DRIVERS INFORMATION SCREEN THAT READ SERVICE BRAKE ASSIST, SERVICE PARK ASSIST, SERVICE STABILITRAK AND CRUISE WILL NOT RESUME YOU MUST RESET. *JB",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/04/2008",
        "dateOfIncident": "01/28/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10216841,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM WRITING TO COMPLAIN ABOUT THE TAILLIGHTS OF LATE MODEL CARS, SPECIFICALLY CADILLAC'S.  THESE TAILLIGHTS, I SUSPECT ARE LED, ARE TOO BRIGHT, AND SEEM TO \"PULSATE\" IN A WAY THAT IS VERY TROUBLING FOR DRIVERS TO LOOK AT.  EVEN FROM A DISTANCE THE LIGHTS HURT EYES AND CAUSE FOR A MAJOR UNSAFE DISTRACTION ON THE ROADS.  PLEASE EXAMINE THIS ISSUE, AND REGULATE THE BRIGHTNESS ON TAILLIGHTS, OR ELIMINATE THE LED TYPE, IF, INFACT THIS IS WHAT THEY ARE.  THANKS.  MIKE   *TR",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/08/2008",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10214984,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "EMAIL FORWARDED ABOUT CONCERNS ON GM CADILLACS, THE TURN SIGNAL WILL NOT TURN OFF UNLESS THE VEHICLE MAKES A 90 DEGREE TURN, WAS TOLD BY DEALER THAT THIS PROBLEM CAN NOT BE REPAIRED.  *KB",
        "vin": ""
    }
]