[
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/29/2017",
        "dateOfIncident": "09/01/2015",
        "fire": false,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11030468,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "SPYDER RS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CAN-AM SPYDER ROADSTER. THE CONTACT STATED THE MOTORCYCLE WAS INCLUDED IN AN UNKNOWN RECALL REGARDING THE STEERING, WHICH CALLED FOR THE SOFTWARE CLUSTER CONSOLE TO BE REPLACED. THE MOTORCYCLE RECEIVED THE REPAIR. IN ADDITION, THE CONTACT STATED THAT THE POWER STEERING ASSIST FAILED. THE CONTACT HAD TO APPLY EXCESSIVE FORCE IN ORDER TO STEER THE MOTORCYCLE. THE CONTACT TOOK THE MOTORCYCLE TO THE TAMPA BAY POWER SPORTS DEALER (13521 N FLORIDA AVENUE, TAMPA, FL; 813-968-7888) AND INFORMED THE CONTACT THAT THE FAILURE WAS RELATED TO NHTSA CAMPAIGN NUMBER: 09V162000 (STEERING); HOWEVER, THE VIN WAS NOT INCLUDED. THE MOTORCYCLE HAD NOT BEEN REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND INFORMED THE CONTACT THAT DUE TO THE PREVIOUS RECALL AND WARRANTY, THE VEHICLE WAS DEEMED REPAIRED AND WOULD NOT RECEIVE A SECOND REPAIR FREE OF CHARGE. THE VIN WAS INVALID. THE APPROXIMATE FAILURE MILEAGE WAS 10,000.",
        "vin": "2BEJAUA168V"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/21/2016",
        "dateOfIncident": "09/14/2015",
        "fire": false,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10860731,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "SPYDER RS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CAN-AM SPYDER ROADSTER MOTORCYCLE. WHILE DRIVING APPROXIMATELY 75 MPH, THE VEHICLE INDEPENDENTLY STEERED TO THE RIGHT AND THEN THE OPPOSITE DIRECTION. THE VEHICLE WAS MANEUVERED TO THE SIDE OF THE ROAD. THE CONTACT DISCONNECTED THE POWER STEERING FUSE. THE VEHICLE RESUMED NORMAL OPERATION; HOWEVER, A CHECK DPS WARNING INDICATOR ILLUMINATED. THE FAILURE RECURRED. THE VEHICLE WAS TAKEN TO THE DEALER THREE TIMES FOR THE SAME FAILURE. ON ONE OCCASION, THE DPS WAS RESET. THE VEHICLE WAS ALSO TAKEN TO AN INDEPENDENT MECHANIC WHERE THE ROTOR ALTERNATOR WAS REPLACED. IN 2010, THE PREVIOUS OWNER HAD THE VEHICLE SERVICED UNDER NHTSA CAMPAIGN NUMBER: 09V162000 (STEERING). THE VEHICLE WAS NOT REPAIRED FOR THE MOST RECENT FAILURE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 15,000.",
        "vin": "2BXJAUA138V"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/22/2015",
        "dateOfIncident": "09/16/2015",
        "fire": false,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10767422,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "SPYDER RS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CAN-AM SPYDER ROADSTER. ONCE THE CONTACT BEGAN RIDING THE VEHICLE, THE STEERING FAILED AND A CHECK DPS WARNING INDICATOR ILLUMINATED. THIS WAS A RECURRING FAILURE. THE VEHICLE WAS DRIVEN TO THE DEALER FOR DIAGNOSTIC TESTING. THE TECHNICIAN STATED THAT THE DPS UNIT NEEDED TO BE REPLACED. THE MANUFACTURER WAS NOTIFIED. THE VIN WAS INVALID. THE APPROXIMATE FAILURE MILEAGE WAS 19,500.",
        "vin": "2BXJAWA198V"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/27/2014",
        "dateOfIncident": "04/04/2014",
        "fire": false,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10616635,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "SPYDER RS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "EXCESSIVE HEAT COMING FROM THE BODY PANEL AREA CAUSING THE FUEL IN THE GAS TANK TO BOIL.  *JS",
        "vin": "2BXJAUA138V"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/19/2014",
        "dateOfIncident": "06/19/2014",
        "fire": false,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10604634,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "SPYDER RS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON I 75 NORTHBOUND IN TROY, MI, THE MOTORCYCLE OVERHEATED, EVEN THOUGH IT WAS ONLY 78 DEGREES OUTSIDE. IT WENT INTO LIMP MODE, CAUSING RAPID DECELERATION, NEARLY CAUSING A REAR END COLLISION, WHICH THE DRIVER BEHIND JUST AVOIDED HITTING ME. THIS HAS HAPPENED TO MY OTHER CAN AM SPIDER ALSO. THE DEALER CLAIMS THIS IS A NORMAL THING, AND BOMBARDIER SAYS IT IS SUPPOSE TO HAPPEN IN EXTREME HEAT. BUT 78 DEGREES IS NOT EXTREME HEAT. SOMEONE IS GOING TO DIE BECAUSE OF THIS DEFECT.  *TR",
        "vin": "2BXAJUA148V"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/06/2014",
        "dateOfIncident": "04/30/2013",
        "fire": false,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10558649,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "SPYDER RS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2008 CAN-AM SPYDER AND HAD ISSUES WITH THE BRAKE FAILURE LIGHT. AS I INVESTIGATED MORE INTO IT, I DISCOVERED MULTIPLE RECALLS LISTED FOR THIS PARTICULAR BIKE. I TOOK THE BIKE TO A CERTIFIED CAN AM DEALER IN ST AUGUSTINE IN MAY 2013 FIRST COAST POWER SPORTS. THEY KEPT THE BIKE THE FIRST TIME 62 DAYS, WHEN IT WAS RETURNED TO ME, I WAS ABLE TO USE FOR 1 WEEK BEFORE I HAD TO RETURN TO THE SHOP.  WHEN IT WAS RETURNED TO ME THE SECOND TIME, I WAS ABLE TO KEEP FOR ABOUT A MONTH WHEN THE BRAKE FAILURE LIGHT CAME ON AGAIN, WHEN I RETURNED IT TO THE SHOP, I WAS ADVISED THE BIKE NEEDED THE BRAKES BLED AND IT WOULD COST $700.  I HAVE BEEN TOLD THAT THE BIKE WAS UNREPAIRABLE AND I NEEDED TO GET A DIFFERENT BIKE BY THIS DEALER SHIP.  THE BIKE WAS SUPPOSE TO RETURNED TO ME DURING THE THANKSGIVING WEEKEND BUT THE DELIVERY DRIVER WAS NOT AVAILABLE.  I WAS ASSURED I WOULD RECEIVE THE BIKE WITHIN THE WEEK.  I RECEIVED A PHONE CALL A WEEK LATER FROM THE NEW SERVICE MANAGER AND WAS TOLD THEY USED PARTS OFF MY BIKE TO REPAIR SOMEONE ELSES BIKE INSTEAD OF DELIVERING MY BIKE TO ME. SIX WEEKS LATER, I STILL DO NOT HAVE MY BIKE AS THEY ARE WAITING FOR A REPLACEMENT PART. I WAS TOLD THE PERSON WHO ORIGINALLY WORKED ON MY BIKE WAS NOT CERTIFIED TO WORK ON CAN AM PRODUCTS AND CAUSED MORE HARM THEN GOOD.  I ATTEMPTED TO TALK WITH THE OWNER OF THE COMPANY AND HE REFUSED TO DISCUSS THE SITUATION WITH ME.  BOB (THE SERVICE MANAGER) KEEPS ADVISING ME THERE IS NOT PART AND UNSURE HOW LONG THE DELAY IS GOING TO BE.  THE SPYDER IS MY PRIMARY FORM OF TRANSPORTATION DURING THE LAST TWO YEARS, I HAVE LOST SHIFT OF WORK BECAUSE OF THE REPAIR DELAYS.  I AM UNSURE EXACTLY HOW MANY PARTS WERE REMOVED FROM MY BIKE OR HOW MANY USED PARTS WERE PLACED ON MY BIKE WHICH MAY LEAD TO THE REASON THE REPAIRS WERE NOT EFFECTIVE.  IT APPEARS TO ME THAT THIS COMPANY IS DEALING IN STOLEN PARTS FOR PROFIT.A  *TR",
        "vin": "2BXJAWA118V"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/26/2013",
        "dateOfIncident": "06/09/2012",
        "fire": true,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10501621,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "SPYDER RS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CAN AM SPYDER WAS BEING RIDDEN BY OWNERS WHEN IT CAUGHT FIRE AND WITHIN 5 MINUTES THE GAS TANK HAD EXPLODED AND BIKE WAS ENGULFED IN FLAMES .  THE MOTORCYCLE HAD BEEN IN THE DEALERSHIP LESS THAN A MONTH BEFORE THE INCIDENT AND NOTHING WAS MENTIONED OF PROBLEMS WITH THE EVAPORATION CANISTER WHICH WE HAVE SINCE HEARD THERE WAS PROBLEMS WITH THIS MAKE AND YEAR.  WE HAVE CONTACTED THE BRP COMPANY AND THEY HAVE NOT ACKNOWLEDGED THERE WAS A PROBLEM UNTIL THEY ISSUED A RECALL IN DECEMBER 2012.  WE COULD HAVE BEEN KILLED VERY EASILY HAD SOMEONE NOT SPOTTED THE FIRE UNDERNEATH THE SPYDER CLOSE TO THE GAS TANK AND ALERTED US TO GET OFF THE BIKE.   WITHIN MINUTES THE BIKE WAS CONSUMED IN FLAMES AND THE FIRE DEPT. HAD TO EXTINGUISH THE FIRE.  WE HAD ALL ROUTINE MAINTENANCE DONE ON THE BIKE AND ALL RECALLS PERFORMED.   WE STILL HAVE NOT BEEN ABLE TO GET BRP TO RESPOND TO OUR CORRESPONDENCE.",
        "vin": "2BXJAHA138V"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/11/2012",
        "dateOfIncident": "06/30/2012",
        "fire": true,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10465230,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "SPYDER RS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED 2008 CAN-AM SPYDER RS MOTORCYCLE. THE CONTACT STATED THAT SHE CAME TO A COMPLETE STOP AFTER DRIVING 5 MPH. WHILE STOPPED, THE VEHICLE CAUGHT ON FIRE. THE VEHICLE WAS TOWED TO A REPAIR SHOP; HOWEVER AN INSPECTION WAS NOT CONDUCTED. THERE WERE NO INJURIES. THE VEHICLE WAS DESTROYED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE AND CURRENT MILEAGES WERE 12,000.",
        "vin": "2BXJAWA188V"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/09/2012",
        "dateOfIncident": "07/07/2012",
        "fire": true,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10464669,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "SPYDER RS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "IT APPEARS THE FOIL-FOAM HEAT SHIELD IGNITED FROM THE HEAT OF THE EXHAUST PIPE.  *TR",
        "vin": "2BXJAHA108V"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/04/2012",
        "dateOfIncident": "05/17/2012",
        "fire": false,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10460508,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "SPYDER RS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CLUTCH FAILED CAUSING MOTORCYCLE TO STALL IN GEAR.  BACK WHEEL LOCKED UP AND BIKE COULD NOT BE PUSHED OUT OF THE ROAD.  WHEN THE CLUTCH FAILED IT RUINED THE MOTOR AND TRANSMISSION BEYOND REPAIR. *TR",
        "vin": "2BXJAHA128V"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/09/2012",
        "dateOfIncident": "04/07/2012",
        "fire": false,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10454556,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "SPYDER RS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS TRAVELING ABOUT 35 MPH AND ENTERED A RIGHT HAND CURVE. THE POWER STEERING STOPPED WORKING WHICH CAUSED ME TO CROSS THE CENTER LINE. LUCKY NOBODY COMING OTHER DIRECTION. THE MOTORCYCLE HAS HAD A DEALER RECALL UPGRADE OF SOFTWARE AND THE POWER STEERING UNIT REPLACED UNDER RECALL.  *TR",
        "vin": "2BXJAWA128V"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/13/2011",
        "dateOfIncident": "08/25/2011",
        "fire": true,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10430025,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "SPYDER RS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS RIDING MY 2005 CANAM SPYDER MOTORCYCLE TO WORK AND ABOUT 2 BLOCKS AWAY WHILE I WAS STOPPED AT A STOPLIGHT I HEARD A POP AND SAW A SMALL AMOUNT OF SMOKE COME UP FROM UNDER THE COWLING.  I IMMEDIATELY RUSHED TO MY WORK PARKING LOT (BECAUSE THERE WERE NO TREES OR ANYTHING FLAMMABLE AROUND) AND WENT INTO WORK TO GET SOME WATER TO EXTINGUISH THE SMALL FLAMES I SAW.  BY THE TIME I GOT BACK OUTSIDE THE BIKE WAS ENGULFED AND MELTING.  (THE OUTER SKIN IS MAINLY FIBERGLASS) I HAVE BEEN ON THE WEB AND HAVE FOUND NUMEROUS POSTINGS OF FIRES ON THE MOTORCYCLES AND ALSO THE WATERCRAFT AND ATV'S THIS COMPANY MANUFACTURES. *TR",
        "vin": "2BXJAHA168V"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/26/2011",
        "dateOfIncident": "08/25/2011",
        "fire": true,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10421571,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "SPYDER RS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2008 CAN-AM SPYDER RS. THE CONTACT STATED THAT THE VEHICLE WAS PARKED MOMENTARILY WHEN IT ENGULFED INTO FLAMES. THE CONTACT EXTINGUISHED THE FLAMES, BUT THE FIRE DEPARTMENT ALSO APPEARED ON THE SCENE. THE CONTACT ALSO STATED THAT THE FIRE ORIGINATED NEAR THE FUEL TANK. THE VEHICLE WAS DESTROYED AND WAS NOT TAKEN TO HAVE THE FAILURE DIAGNOSED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE AND CURRENT MILEAGES WERE 9,000.",
        "vin": "2BXJAUA128V"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/19/2011",
        "dateOfIncident": "07/18/2011",
        "fire": false,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10420748,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "SPYDER RS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "BRP, DESPITE ISSUING SERVICE BULLETINS ABOUT HIGH DRIVE BELT TENSION, WILL NOT REPAIR DAMAGE CAUSED BY THE HIGH TENSION SPECIFIED IN MANUFACTURE AND SERVICE FOR THEIR CAN AM SPYDER ROADSTER. TSB 2010-06 ADVISES REDUCED TENSION FROM 1400 NEWTONS TO 450 NEWTONS TO PROTECT AGAINST DAMAGE TO FRONT OUTPUT SHAFT AND REAR BEARING FAILURES. CONSEQUENTLY, COSTS TO REPAIR DAMAGE RESULTING FROM THEIR ORIGINAL TENSION SPECIFICATION ARE ASSESSED TO THE OWNER. REPAIR COSTS ARE IN EXCESS OF $2,000.  *TR",
        "vin": "2BXJAWA168V"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/19/2011",
        "dateOfIncident": "07/18/2011",
        "fire": false,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10420756,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "SPYDER RS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "BRP ISSUED SERVICE BULLETINS SB-2009-01 IDENTIFYING FAILURE OF THE GEAR POSITION SENSORS ON SOME OF THEIR CAN AM SPYDER ROADSTERS. SYMPTOMS OF FAILURE INCLUDE \"E\" OR INCORRECT GEAR NUMBER INDICATED IN CLUSTER INDICATOR; INTERMITTENT POWER STEERING OPERATION; DIFFICULTY SHIFTING; \"CHECK ENGINE\" WARNING SCROLL IN CLUSTER INDICATOR. PRESENTED TO AUTHORIZED DEALER FOR SERVICE 3 TIMES WHILE UNDER WARRANTY, UNSUCCESSFUL REMEDY WAS RESET OF GEAR POSITION SENSOR. PRESENTED TO SAME DEALER AFTER EXPIRATION OF WARRANTY, REMEDY WAS REPLACEMENT AT CUSTOMER EXPENSE IN EXCESS OF $200. BRP FACTORY TECH AT BRP EVENT INDICATED THAT REPLACEMENT WAS PROPER REMEDY. FAULTY ORIGINAL MANUFACTURER INSTALLED GEAR POSITION SENSORS ARE REPLACED WITH NEW DESIGNED PART FROM BRP ONLY AT OWNERS EXPENSE.  *TR",
        "vin": "2BXJAWA168V"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/15/2011",
        "dateOfIncident": "09/07/2010",
        "fire": false,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10390266,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "SPYDER RS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "BRP HAS ISSUED A RECALL FOR DYNAMIC POWER STEERING UNIT REPLACEMENT.  DATE OF MY NOTICE WAS 9-7-2010.  MY CAN AM ROADSTER IS STILL NOT REPAIRED AS BRP WILL NOT SEND OUT A REPLACEMENT PART UNTIL THEY REC'D THE OLD UNIT.  THIS MAKES DEALER REPAIR DEFECTIVE  ROADSTERS 1 AT A TIME.  6 MONTHS WITH A RECALL NOTICE AND I AM 8TH OF MY DEALERS LIST.  HOW COME BRP DOESN'T RAMP UP PRODUCTION OF REPLACEMENT UNITS TO GET THEM OUT TO THE DEALERS.  *TR",
        "vin": "2BXJAUA178V"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/03/2010",
        "dateOfIncident": "05/17/2008",
        "fire": false,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10369077,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "SPYDER RS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 CAN-AM SPYDER RS. THE CONTACT STATED THAT THERE WAS A RECALL 09V162000 (STEERING); THE VEHICLE WAS REPAIRED BY THE DEALER. HOWEVER, AFTER THE REPAIR, THE VEHICLE STILL EXPERIENCED FAILURE. THE VEHICLE DARTED ACROSS THE ROAD. THE CONTACT HAD A FRONT ALIGNMENT PERFORMED AND ADDED NEW TIRES; THE FAILURE CONTINUED. THE VEHICLE WAS TAKEN BACK TO THE DEALER WHERE A NEW POWER STEERING BOX WAS INSTALLED. THE FAILURE CONTINUED. THE DEALER STATED THAT THEY COULD OFFER NO FURTHER ASSISTANCE. THE MANUFACTURER HAD NOT BEEN NOTIFIED. THE FAILURE MILEAGE WAS APPROXIMATELY 38,000.",
        "vin": "2BXJAWA188V"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/08/2010",
        "dateOfIncident": "09/28/2010",
        "fire": true,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10365063,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "SPYDER RS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY 2008 CANAM SPYDER ROADSTER AND IT STARTED ON FIRE - I GOT OFF JUST IN TIME AND BLUE FLAMES WERE COMING UP FROM THE TANK/ SEAT AREA.  THE BIKE WAS A TOTAL LOSS AND IF I HAD BEEN ON THE HIGHWAY VS. A BACK ROAD THIS COULD HAVE ENDED WITH INJURIES.  THE SPYDER HAD BEEN MAINTAINED PERFECTLY. *TR",
        "vin": "2BXJAWA1X8V"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": true,
        "dateComplaintFiled": "09/29/2010",
        "dateOfIncident": "09/08/2010",
        "fire": true,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10358300,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "SPYDER RS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD RIDDEN THE CAN AM SPYDER ROADSTER FOR APPROXIMATELY 30 MINUTES BEFORE STOPPING AT COSTCO AND FILLING IT UP. NO OVERFILL OR GAS SPILLED. I ROAD APPROX. 2 MILES HOME, PARKED, AND WENT INTO THE HOUSE FOR APPROX. 3 OR 4 MINUTES. I RETURNED TO SPYDER STARTED IT & BACKED UP APPROX. 10 FEET, PULLED FORWARD, BACKED UP AGAIN, STARTED FORWARD OUT OF MY DRIVEWAY. WHEN I TURNED & STARTED FORWARD THERE WAS A SMELL ELECTRICAL WIRE BURNING. I SAW SMOKE COMING FROM THE FRONT OF MY SEAT & CENTRAL PLASTIC PANEL. BEFORE I COULD REACT TO THAT I HAD MOVED FORWARD MAYBE 10 OR 15 FEET. THERE WAS A WHOOSHING SOUND & A LARGE AMOUNT OF SMOKE FROM THE SAME AREA. IT SCARED ME ENOUGH THAT I PANICKED & TRIED STEPPING OFF THE SPYDER AS IT WAS MOVING. I TRIPPED AND STRUCK THE DRIVEWAY ON MY LEFT ARM, SHOULDER AND HEAD. I ROLLED OVER & LOOKED TO SEE WHAT HAPPENED. THE SPYDER HAD CONTINUED FORWARD INTO THE FENCE & TREE AT THE SIDE OF MY DRIVEWAY. THERE WAS A LOT OF SMOKE AND A SMALL FLAME APPROX. A FOOT HIGH AT THE FRONT OF THE SEAT & CENTER PANEL. WHEN THE SPYDER HIT THE TREE THE FLAME JUMPED TO AROUND 3 TO 4 FEET. THE SPYDER HAD RUN OVER MY GARDEN HOSE AND HIT THE WATER LINE SO THAT I COULD NOT GET TO A HOSE OR TURN THE WATER ON. I WAS AFRAID THE GAS TANK WOULD EXPLODE ANY WAY SO I CALLED 911. BY THE TIME THE FIRE DEPARTMENT ARRIVED THE SPYDER WAS APPROXIMATELY 75 % BURNT. THE FIREMAN IN CHARGED STATED HE FELT THE FIRE STARTED ON THE RIGHT SIDE. MY CAN AM SPYDER IS THE 8TH ONE TO BURN UP THIS WAY. ON 09/28/2010 ANOTHER 2008 CAN AM SPYDER SELF-IGNITED WHILE THE RIDE WAS MOVING. HE REPORTED THAT HIS MACHINE WAS ALSO A TOTAL LOSS. FIRE DEPARTMENT STATION #21 INCIDENT #10-0107129  UPDATED IVOQ 10/26/10*JB  *TR",
        "vin": "2BXJAUA168V"
    },
    {
        "components": "STEERING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/21/2010",
        "dateOfIncident": "11/14/2008",
        "fire": false,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10356787,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "SPYDER RS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 CAN-AM SPYDER RS MOTORCYCLE. THERE WERE NUMEROUS DEFECTS AND FAILURES ON HIS MOTORCYCLE. THE POWER STEERING PULLED TO THE RIGHT AND THE DEALER REPLACED THE GPS UNIT UNDER THE WARRANTY. THE FUEL GAUGE WAS NOT READING AS IF THERE WAS A FULL TANK OR IF IT WAS EMPTY. THE DEALER REPLACED THE SENDING UNIT WITHIN THE TANK AND THE INSTRUMENTATION PANEL UNDER WARRANTY. THE MANUFACTURER WAS CALLED IN REGARDS TO ALL OF THE PROBLEMS THE MOTORCYCLE HAD AND WAS TOLD THAT THEY WOULD CONTACT HIM. THEY HAD NOT CONTACTED HIM WHEN THE COMPLAINT WAS FILED. THE FAILURE MILEAGE WAS 1,781.",
        "vin": "2BXJACA118V"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/31/2010",
        "dateOfIncident": "08/04/2010",
        "fire": false,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10353068,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "SPYDER RS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 CAM AM SPIDER. WHILE DRIVING 45 MPH THE CONTACT NOTICED THAT THE HANDLE BARS HAD BEGAN TO LOCK WITHOUT WARNING. THE VEHICLE WAS TAKEN TO THE DEALERSHIP WHERE THE CONTACT WAS INFORMED THAT A PART ON THE POWER STEERING SYSTEM NEEDED TO BE REPLACED. THERE WERE NO PRIOR WARNINGS AND THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 500 AND THE CURRENT MILEAGE WAS 600.",
        "vin": "2BXJAUA128V"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/06/2010",
        "dateOfIncident": "02/09/2010",
        "fire": false,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10324105,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "SPYDER RS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CAN AM SPYDER EVERY NOW AND THEN WHILE GOING AROUND A SHARP CURVE THE POWER STEERING WILL TURN OFF AND COME BACK ON CAUSING AN OVER CORRECTION AND POSSIBLE UNINTENDED LANE CHANGE. *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/11/2009",
        "dateOfIncident": "10/17/2009",
        "fire": false,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10291824,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "SPYDER RS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 CAN-AN SPYDER MODEL SE5 POWER STEERING PROBLEMS :POWER STEERING LOCKS UP OR CATCHES AND EXTRA EFFORT IS REQUIRED TO TURN THE HANDLE BARS. WHEN THE BARS DO RELEASE THE EXTRA EFFORT CAUSES VEHICLE TO SWERVE MAKING OF A VERY DANGEROUS CONDITION. ALSO MOTOR SURGES WHEN SHIFTING, BACK FIRES WHEN SLOWING AND QUITS AT RED LIGHTS  ....EVEN THOUGH THE INCIDENT DATE  IS STATED AS 10-17 THIS HAS BEEN AN ONGOING PROBLEM FROM DATE OF PURCHASE,AND THERE HAVE BEEN 2 UPDATES DONE BY CAN-AM BUT THE PROBLEMS REMAIN. *TR",
        "vin": "2BXJAHA148V"
    },
    {
        "components": "SUSPENSION,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/08/2009",
        "dateOfIncident": "11/07/2009",
        "fire": false,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10291394,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "SPYDER RS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY CAN AM SPYDER SM5 ON THE FREEWAY ON 11/7/O9 IT PULL TO THE RIGHT INTO THE OTHER LANE IT FELT LIKE IT LOCK UP AND VERY HARD TO STRAIGHTENED WHEELS, IT HAPPEN ABOUT SIX TIMES IN FIVE MILE RADIUS. *TR",
        "vin": "2BXJAWA158V"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/29/2009",
        "dateOfIncident": "10/29/2009",
        "fire": false,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10290264,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "SPYDER RS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING APPROXIMATELY 45 MPH ON MY CAN-AM SPYDER, I NOTICED THAT THE BIKE HAD DRIFTED TOWARDS THE RIGHT OF THE ROAD. NORMAL DRIFT, NO PULLING. TRIED TO CORRECT IT BUT THE HANDLEBARS WOULD NOT MOVE, THEY FELT AS IF THEY WERE LOCKED IN POSITION. AFTER 3 TRIES TO CORRECT BEFORE LEAVING THE ROAD, IT FELT AS IF IT BROKE LOOSE MAKING ME ABRUPTLY LOSE LANE POSITION ENDING UP IN THE ONCOMING TRAFFIC LANE. NO INJURIES OR ACCIDENT OCCURRED. ALSO AFTER RETURNING HOME, AT A STOPPED POSITION AND THE BIKE RUNNING, THE STEERING WOULD NOT TURN LEFT OR RIGHT ON GRASSY SURFACE. THIS SEEMED TO FREE UP AFTER THE BIKE WAS IN A ROLLING MOTION. *TR",
        "vin": "2BXJAWA158V"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/29/2009",
        "dateOfIncident": "10/10/2009",
        "fire": false,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10290285,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "SPYDER RS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING PULLED TO RIGHT TWICE AFTER RIDING BACK FROM DEALER AFTER THEY PERFORMED 3 RECALLS. ONE WAS FOR STEERING ISSUES. *TR",
        "vin": "2BXJAHA178V"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/28/2009",
        "dateOfIncident": "10/10/2009",
        "fire": false,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10290102,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "SPYDER RS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SATURDAY, OCTOBER 10, 2009 - WHILE RIDING COUNTRY ROADS IN NORTH TEXAS, THE SPYDER'S STEERING AGAIN BECAME DANGEROUS' IT PREVENTED A LEFT TURN (EVEN A SLIGHT TURN) TO THE LEFT.  THERE SEEMED TO BE A 'CATCH' IN THE MIDDLE OF THE STEERING MECHANISM'S WHICH NEEDED QUITE A BIT OF PRESSURE (APPROXIMATELY 20-25 POUNDS) TO OVERCOME.  ALSO, WHEN THE 'CATCH' WAS OVERCOME, AN OVERREACTION OCCURRED WHICH CAUSE THE SPYDER TO SUDDENLY STEER LEFT FAR MORE THAN WHAT WAS DESIRED.  IN ADDITION, THE STEERING WOULD SUDDENLY OVERCOMPENSATE FOR RIGHT TURNS AND PULL THE BIKE FAR FURTHER TO THE RIGHT THAN WHAT WAS DESIRED OR INPUT BY THE RIDER.     AFTER ABOUT FIVE MINUTES, I STOPPED AND PULLED THE 5 AMP FUSE FROM THE FORWARD FUSE BOX. THAT DISABLED THE POWER STEERING AT LEAST PARTIALLY, AND THE OVERREACTION TO RIGHT STEERING STOPPED.  HOWEVER, THE MIDDLE 'CATCH' WAS STILL OCCURRING AND REQUIRED ABOUT 25 POUNDS OF PRESSURE TO OVERCOME THE SPYDER'S PREVENTION OF A LEFT TURN.      I IMMEDIATELY DROVE (SLOWLY) TO RICHARDSON MOTORSPORTS WHERE JEREMY (THE SERVICE TECHNICIAN) RECOGNIZED A PROBLEM JUST FROM DRIVING IT INTO THE SHOP AND APPLIED A SECOND UPDATE TO THE SOFTWARE AND CLEARED 'A FEW COMPUTER ERROR CODES'.  I LEFT RICHARDSON MOTORSPORTS AND DROVE TO MY HOME IN ALLEN, TEXAS, ABOUT 15 MILES AWAY.  NO FURTHER STEERING ANOMALIES OCCURRED.      MONDAY, OCTOBER 12, 2009 -  I AGAIN TOOK TO THE ROAD WITH THE SPYDER TO DETERMINE IF THE FIX WAS, IN FACT, REAL AS I HAD AN ARKANSAS TRIP COMING UP LATER IN THE WEEK.  NO PROBLEMS OCCURRED IN THE APPROXIMATELY 50 MILES RIDDEN THAT DATE.      FRIDAY, OCTOBER 16, 2009 - WHILE ENROUTE TO OUR DESTINATION IN OZARK, ARKANSAS (APPROXIMATELY 375 TOTAL MILES), THE SPYDER'S STEERING AGAIN MALFUNCTIONED AT ABOUT THE HALFWAY POINT.  AGAIN, A 'CATCH' IN THE MIDDLE OF THE STEERING (STRAIGHT AHEAD) PREVENTED THE SPYDER FROM TURNING LEFT.  AND, AS BEFORE, RIGHT TURNS WERE ASSISTED MORE THAN USUAL REQUIRING A QUICK DRIVER CORRECTION TO THE SPYDER'S OVER-COMPENSATION. *TR",
        "vin": "2BXJAWA108V"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/27/2009",
        "dateOfIncident": "10/27/2009",
        "fire": false,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10289975,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "SPYDER RS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TODAY WHILE DRIVING MY 2008 CAN-AM SPYDER ROADSTER, I NEEDED TO EXERT A FORCE GREATER THAN EXPECTED TO INITIATE THE TURNING OF STEERING THE HANDLEBAR OFF CENTER IN ORDER TO CORRECT VEHICLE DRIFT FROM A STRAIGHT LINE PATH.  THIS HIGHER THAN EXPECTED STEERING CONTROL INPUT COULD HAVE EASILY RESULTED IN AN UNEXPECTED DEVIATION OF THE VEHICLE FROM MY INTENDED PATH.    IT FELT LIKE THE STEERING WOULD LOCK UP OR WANT TO CONTINUE TO THE LEFT AND WHEN I APPLIED A GREATER PRESSURE THAN NORMAL, IT FELT LIKE IT WOULD \"BREAK FREE\" FROM THE LOCKED POSITION.    IT WAS A VERY UNPLEASANT EXPERIENCE AND A LESS EXPERIENCED DRIVER COULD HAVE EASILY OVER CORRECTED AND AN ACCIDENT COULD HAVE RESULTED.    MY CAN-AM SPYDER ROADSTER RECENTLY HAD THE MANDATORY RECALL COMPLETED FOR THE STEERING ISSUE.  THIS WAS THE FIRST TIME I EXPERIENCED THIS PROBLEM. *TR",
        "vin": "2BXJAUA188V"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/26/2009",
        "dateOfIncident": "10/19/2008",
        "fire": false,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10289846,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "SPYDER RS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS RIDING WITH MY WIFE ON A STRAIGHT  SINGLE LANE ROADWAY DOING ABOUT 50MPH WHEN , WITH NO WARNING , THE VEHICLE TOOK A TURN TO THE LEFT, CAUSING IT TO ENTER THE OPPOSING TRAFFIC LANE. HAD THERE BEEN TRAFFIC IN THE OTHER LANE A HEAD ON COLLISION MIGHT HAVE OCCURRED.  I WAS ABLE TO REGAIN CONTROL.  THIS INCIDENT RE- OCCURRED AT LEAST TWICE BEFORE I WAS ABLE TO GET HOME.  I HAVE NOT USED THE VEHICLE SINCE BECAUSE OF THE SCARE THIS HAD GIVEN ME.  CAN-AM (BRP) HAD A RECALL TO REVISE THE VEHICLE SOFTWARE. IT HAS MADE THE PROBLEM WORSE FOR MANY OWNERS WHO HAD THE UPDATE DONE. THE MANUFACTURER CHOSE A \"CHEAP INEFFICIENT FIX\" THAT DIDN'T CURE THE DANGEROUS PROBLEM !!  ALL SPYDERS SHOULD BE PULLED OFF THE ROAD UNTIL THE PROBLEM CAN BE CORRECTED.  ( BY THE WAY, A CAN-AM ROADSTER IS A 3 WHEEL TRIKE AND SHOULD BE LISTED UNDER MOTORCYCLES, NOT CARS AND TRUCKS.) *TR",
        "vin": "2BXJAUA158V"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/23/2009",
        "dateOfIncident": "10/17/2009",
        "fire": false,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10289638,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "SPYDER RS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS RIDING MY 2008 CAN-AM SPYDER ROADSTER ON THE INTERSTATE AT APPROXIMATELY 70MPH WHEN I NOTICED THAT IT BEGAN DRIFTING INTO THE NEXT LANE ALL ON ITS OWN, WHEN I TRIED TO CORRECT BACK INTO MY LANE THE STEERING FELT STUCK AND WHEN I PULLED HARDER TO CORRECT IT THEN IT WOULD SUDDENLY OVERCORRECT AND SHOOT OVER INTO THE LANE ON THE OTHER SIDE. THIS HAPPENED SEVERAL TIMES AND AS I SLOWED TO MERGE ONTO ANOTHER HIGHWAY I HEARD A LOUD POPPING SOUND AND THE FRONT WHEELS STARTED TURNING LEFT AND RIGHT ALL BY THEMSELVES AND CLICKING AND POPPING. I WAS BARELY ABLE TO CONTROL THE VEHICLE AND GET IT OUT OF HEAVY TRAFFIC AND OFF OF THE ROAD. I HAD LITTLE TO NO CONTROL OF THE VEHICLE'S TRAVEL DIRECTION. THE CONSOLE SHOWED NO ERRORS OR CODES. THE STEERING CONTINUED TO ACT THIS WAY THE ENTIRE TIME I WAS EASING DOWN THE EMERGENCY LANE AND EXITING THE HIGHWAY. I HAVE TOWED THE BIKE TO THE DEALER AND THEY ARE IN THE PROCESS OF DIAGNOSING THE PROBLEM. *TR",
        "vin": "2BXJAUA118V"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/21/2009",
        "dateOfIncident": "10/11/2009",
        "fire": false,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10289201,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "SPYDER RS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING FELT LIKE IT WAS LOCKED.  AS I APPLIED MORE (SIGNIFICANTLY) FORCE TO CORRECT  THE STEERING IT SUDDENLY JERKED AND STEERED IN THE DIRECTION I WAS TRYING TO GET IT TO GO.  IT WOULD STEER IN QUICK JERKS AND IT WAS DIFFICULT TO KEEP IT IN THE LANE OF THE ROAD.  EVEN WHILE GOING IN A STRAIGHT LINE IT FELT LIKE IT WAS TRYING TO STEER LEFT ON ITS OWN.  I HAD TO HOLD A LOT OF PRESSURE ON THE HANDLE BARS TO KEEP IT GOING IN A STRAIGHT LINE.  AT ONE POINT I ALMOST RAN INTO A CAR ON MY RIGHT AS THE ROAD WAS CURVING AND THE STEERING WAS LOCKED.  I FELT I COULD ONLY MAINTAIN SOME CONTROL BELOW 40 MPH.  ONCE I GOT STOPPED AND SHUT IT OFF FOR A BIT , IT DID NOT ACT UP AGAIN WHEN I RODE IT FOR ABOUT 15 MORE MILES HOME.  I NEVER HAD ANY WARNING LIGHT INDICATIONS.  BIKE IS AT DEALER NOW AND VIN IS NOT READILY AVAILABLE TO ME.  I CAN PROVIDE THIS AT A LATER TIME. *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/20/2009",
        "dateOfIncident": "09/25/2009",
        "fire": false,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10289182,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "SPYDER RS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "BESIDES A NUMBER OF MECHANICAL PROBLEMS WITH MY CAN AM SPYDER THAT HAVE BEEN FIXED UNDER WARRANTY, THE WORST EPISODE WAS WHEN MY POWER STEERING BECAME INTERMITTENT.  I WAS HUNDREDS OF MILES FROM HOME WHEN IT WENT OUT ON ME TWICE.  I WAS MOVING AT ABOUT 35 MPH WHEN THE SPYDER PROCEEDED TO STEER TO THE RIGHT ALL ON IT'S OWN AND IT TOOK A BIT OF MUSCLE TO STEER IT BACK TO CENTER TO AVOID HITTING A TREE.  THIS WAS THE FIRST TIME IT HAPPENED.  A DAY LATER THE SAME THING HAPPENED AT AROUND THE SAME SPEED.  A BRP TECH LOOKED AT IT (WITHOUT TEST DRIVING IT) AND DOWNLOADED SOME \"UPDATE\" INTO MY SPYDER BUT SINCE THEN I'VE BEEN AFRAID TO RIDE IT, FEARING THAT THIS WILL HAPPEN AGAIN.  IT WAS HARD TO STEER IT BACK INTO CONTROL AND IT MADE A \"CLICKING\" NOISE WHEN I DID BOTH TIMES.  A NUMBER OF OTHER OWNERS HAVE HAD THE SIMILAR PROBLEM, EVEN AFTER THE UPDATES WERE INSTALLED SO I DO NOT PERSONALLY BELIEVE THAT A SOFTWARE PATCH IS GOING TO REMEDY THIS PROBLEM.  I AM NOT GETTING ANY CLEAR ANSWERS FROM BRP WHO MAKES THIS MACHINE. *TR",
        "vin": "2BXJACA118V"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/18/2009",
        "dateOfIncident": "05/04/2009",
        "fire": true,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10269056,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "SPYDER RS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 BOMBARDIER BOMBARDIER PRODUCTS CAN-AM SPYDER ROADSTER.  WHILE PULLING INTO THE GARAGE, THE CONTACT NOTICED SMOKE ON THE PASSENGER SIDE OF THE VEHICLE.  HE GRABBED THE CLUTCH AND PUSHED THE VEHICLE OUT OF THE GARAGE, WHERE IT CAUGHT FIRE IN THE DRIVEWAY.  THE FIRE DEPARTMENT ARRIVED AND FILED A REPORT.  HIS HOME SUSTAINED HEAT DAMAGE.  THE VEHICLE WAS DESTROYED.   THE CURRENT AND FAILURE MILEAGES WERE 36,500.    UPDATED 05/26/09  *BF  UPDATED 05/29/09.*JB",
        "vin": "2BXJAUA198V"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/05/2009",
        "dateOfIncident": "03/05/2009",
        "fire": false,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10260871,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "SPYDER RS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 CAN-AM SPYDER POWER STEERING IS INTERMITTENTLY TURNING 'ON' AND 'OFF' AND 'LOCKING UP' CAUSING DRIVER OF MOTORCYCLE TO FIGHT STEERING TO KEEP BIKE ON ROAD. THIS ONLY STARTED TO OCCUR AFTER I HAD AROUND 5,000 MILES ON THE BIKE. THIS IS HAPPENING ON MY OWN SPYDER, AS WELL AS MANY OTHERS I HAVE SPOKEN TO IN VARIOUS ONLINE FORUMS.     THERE HAS BEEN 1 DEATH IN TEXAS THAT MAY BE DUE TO THIS FAILURE. THERE HAS BEEN 1 SERIOUS ACCIDENT IN CALIFORNIA WHERE THE RIDER HAS STATED THIS STEERING PROBLEM WAS THE CAUSE OF THE ACCIDENT.     THE MANUFACTURER (BRP-CAN-AM CANADA) AND THEIR DEALERS DO NOT SEEM AWARE OR WILLING TO TAKE ACTION AND PERFORM A RECALL.    THIS ISSUE IS VERY SERIOUS AND SHOULD BE ADDRESSED AS SOON AS POSSIBLE.    I WENT FOR A RIDE TODAY AND THE PROBLEM STILL EXISTS. ALMOST LOST CONTROL ON A TURN DUE TO FIGHTING THE POWER STEERING - ONLY TO HAVE THE POWER STEERING KICK BACK ON WHILE PUSHING HARD ON THE HANDLEBARS--- THUS CAUSING THE BIKE TO OVER-STEER THE TURN. *TR",
        "vin": "2BXJAUA178V"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/25/2009",
        "dateOfIncident": "02/20/2009",
        "fire": false,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10259898,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "SPYDER RS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE IS A 2008 CAN-AM SPYDER ON 2/20/2009 WHILE MOVING THE VEHICLES STEERING LOCKED COMPLETELY. I WAS UNABLE TO MOVE THE STEERING EITHER LEFT OR RIGHT. WHILE TRYING TO TURN I FELT A \"POP\" AND THE VEHICLE STEERING RETURNED. THIS HAS HAPPENED BEFORE WHILE SITTING STILL BUT NEVER WHEN THE VEHICLE WAS IN MOTION. *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/25/2009",
        "dateOfIncident": "02/16/2009",
        "fire": false,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10259893,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "SPYDER RS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2008 CAN-AM SPYDER (NEW STREET DRIVEN 3 WHEELER) AND I WAS DRIVING 70MPH ON THE HIGHWAY AND THE STEERING FELT STUCK AND THE SPYDER STARTED DRIFTING LEFT.  I TRIED TO GENTLY PULL THE STEERING RIGHT, BUT IT KEPT GOING.  THEN ALL OF THE SUDDEN THE STEERING FREE'D UP AND IT JERKED RIGHT.  THIS ALMOST CAUSED ME TO LOSE CONTROL ON THE HIGHWAY IN TRAFFIC WITH OTHER CARS!  APPARENTLY I AM NOT THE FIRST TO EXPERIENCE THIS AND EVEN ONE SPYDER OWNER CRASHED AND WAS FLOWN TO THE HOSPITAL WITH SERIOUS INJURIES!    HERE IS HIS STORY:  HTTP://WWW.SPYDERTALK.COM/FORUMS/INDEX.PHP?SHOWTOPIC=9212&ST=0    BRP - THE MANUFACTURER OF THIS VEHICLE HAS BEEN TIGHT LIPPED ABOUT THIS AND TO DATE IS OFFERING NOTHING IN TERMS OF DIAGNOSIS OR RECTIFICATION OR EVEN SIMPLE ACKNOWLEDGMENT.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/02/2009",
        "dateOfIncident": "10/18/2008",
        "fire": false,
        "manufacturer": "Bombardier Recreational Products, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10257204,
        "products": [
            {
                "manufacturer": "Bombardier Recreational Products, Inc.",
                "productMake": "CAN-AM",
                "productModel": "SPYDER RS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 10/19/2008, WHILE DRIVING EASTBOUND ON IH40 IN OKLAHOMA (ON A STRAIGHT-A-WAY), THE CAN AM SPYDER'S POWER STEERING ABRUPTLY PULLED ME INTO THE LANE TO THE LEFT.  THIS HAPPENED TWICE WITHIN A PERIOD OF MINUTES.  THANKFULLY, IT WAS AN EARLY SUNDAY MORNING WITH LITTLE TRAFFIC.    ON 11/15/2008, WHILE RIDING SOME \"TWISTIES\" IN NORTH TEXAS, THE SPYDER AGAIN EXHIBITED MULTIPLE STEERING MALFUNCTIONS... THIS TIME PULLING THE BIKE TO THE LEFT AND THE RIGHT.  IN CONJUNCTION WITH THE STEERING PROBLEMS, THE GEAR SELECTION INDICATOR ALSO SHOWED EITHER THE WRONG GEAR OR AN \"E\", FOR ERROR.      ON THIS OCCASION, I IMMEDIATELY STOPPED AND DISABLED THE POWER STEERING BY REMOVING  THE ASSOCIATED FUSE.  NO PROBLEMS OCCURRED AFTER DISCONNECTING THE SYSTEM.      BECAUSE OF THE SECOND SET OF OCCURRENCES, I RESEARCHED THE CONNECTION BETWEEN THE GEAR POSITION SENSOR AND THE POWER STEERING AND DETERMINED THAT THE GEAR POSITION SENSOR PROVIDED (ALONG WITH ABOUT SIX OTHERS) DIRECT INPUT INTO THE COMPUTER STEERING LOGIC.      I ORDERED AND REPLACED THE GEAR POSITION SENSOR ($90+) AND HAVE HAD NO PROBLEMS SINCE.      THE CAN-AM SPYDER'S ELECTRICAL SYSTEM IS A CAN-BUS TYPE WHERE MULTIPLE AND DIFFERENT SENSORS, LIGHTS, ETC.  SEND INPUT ALONG ONE WIRING ROUTE.  FROM WHAT I CAN PIECE TOGETHER ON MY OWN (AND I AM NO EXPERT), THE GEAR POSITION SENSOR WAS FAULTY (HAS SUBSEQUENTLY BEEN REPLACED BY ANOTHER PART NUMBER BY CAN-AM) AND SENDING \"CONFUSING SIGNALS\" TO THE STEERING SYSTEM.    BASED ON MY PERSONAL EXPERIENCE, THIS IS AN EXTREME SAFETY HAZARD AS A RIDER MAY NOT BE ABLE TO RECOVER, OR ACTUALLY \"OVER RECOVER\", IN THE EVENT OF THE MALFUNCTION.    BTW, THE SPYDER SHOULD BE LISTED IN THE \"MOTORCYCLE\" SECTION, NOT AUTOMOBILE. *TR",
        "vin": "2BXJAWA108V"
    }
]