[
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/17/2022",
        "dateOfIncident": "02/17/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11452488,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact's son owns a 2008 Chevrolet Aveo. The contact stated that while her son was driving at an undisclosed speed, the passenger's side air bag warning light was illuminated. The vehicle was taken to an independent mechanic and diagnosed that the passenger's side air bag needed to be replaced. The vehicle was not repaired. The manufacturer was not made aware of the failure. The failure mileage was unavailable.",
        "vin": "KL1TD56608B"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/01/2022",
        "dateOfIncident": "02/01/2022",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11449748,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "In-dash clock module contains the vehicle 'Check Engine Light' - required to pass inspection. Solder joints are defective ('cold' or cracked) creating intermittent electrical connections. Prevents warning of engine defects to driver. Solder defects eventually cause destruction of the module incurring unreimbursed denial of transport and expense to driver to repair.",
        "vin": "KL1TD66608B"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/12/2021",
        "dateOfIncident": "08/06/2021",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428877,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2008 Chevrolet Aveo. The contact stated that the vehicle was parked and had the headlights illuminated. The contact's wife went to start the vehicle and turned off the lights when smoke began to emit from the dashboard and the engine compartment. The contact was able to disconnect the battery and the smoke had stopped. The contact stated no warning lights were illuminated. Upon investigation, the contact associated the failure with, NHTSA Campaign Number: 14V261000 (EXTERIOR LIGHTING) however the VIN was not included. The vehicle was not diagnosed or repaired. The manufacturer was informed of failure and told the contact that they were able to assist but would not without the contact having computer access. The failure mileage was approximately 110,000.",
        "vin": "KL1TD56668B"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/01/2021",
        "dateOfIncident": "09/02/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11398506,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CHEVROLET AVEO. THE CONTACT STATED THAT THE VEHICLE STARTED LOSING MOTIVE POWER AND DECELERATED HOWEVER, THE VEHICLE DID NOT STALL. THE CONTACT PULLED OVER AND WAITED FOR THE VEHICLE TO REGAIN FULL POWER. THE FAILURE RECURRED INTERMITTENTLY. THE VEHICLE WAS DIAGNOSED BY AN INDEPENDENT MECHANIC HOWEVER, THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE VEHICLE WAS NOT REPAIRED. NEITHER A DEALER NOR THE MANUFACTURER WERE MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "KL1TD66638B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/30/2019",
        "dateOfIncident": "11/24/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11283037,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 CHEVY AVEO SEDAN -  [XXX] -    AIRBAG WARNING LIGHT REMAINS ON AT ALL TIMES -   NO BODY CODES ARE PRESENT  / DETECTED  - (USING FOXWELL ELITE NT630 SCANNER WHICH CLAIMS TO READ / CLEAR AIRBAG CODES) -       I'VE ALREADY RESEARCHED THIS ISSUE - \"MUCHO PROBLEMOS\"  - WITH OVER HALF OF ALL CHEVY AVEO COMPLAINTS INCLUDING AIRBAG WARNING LIGHT REMAINS ON.   IT'S MOST LIKELY EITHER THE CLOCK MODULE - WHICH PASSES THE PASSENGER SIDE AIRBAG SIGNALS TO THE MAIN SRS CONTROLLER, THE SRS CONTROLLER MODULE (LOCATED UNDER CENTER SHIFT CONSOLE AREA)  OR THE PASSENGER SIDE AIRBAG ITSELF -      CODE SCANNER ONLY SEES PASSENGER SIDE AIRBAG STAGE 2  -  (NO STAGE 1  SEEN) ... DRIVER'S SIDE SHOWS BOTH  STAGE 1 AND STAGE 2 ...   ALL PRETENSIONERS ARE PROPER  (2 OHMS CIRCUIT RESISTANCE) ... BATTERY STRONG / GOOD / NEW - 1 YEAR OLD - 13.5 VOLTS -     I'M WORRIED DEALER (HAWTHORNE CHEVROLET - HAWTHORNE NJ)  WILL ACTUALLY NOT KNOW THE EXTENSIVE ISSUE WITH CHEVY AVEO AIRBAG WARNING LIGHT COMING ON - AND WILL WRONGLY DIAGNOSE AND TRY TO CHARGE BIG BUCKS -  AND PROBLEM WILL RETURN -    THIS IS A SAFETY ISSUE -  SINCE WITH AIRBAG WARNING LIGHT STAYING ON  -   SRS AIRBAG SYSTEM WILL NOT OPERATE,  NO AIRBAG PROTECTION -   I HAVE ALSO NOW CONTACTED CHEVROLET ON THIS SUBJECT / PROBLEM -  WAITING FOR THEIR REPLY -   LOCATED IN NORTHERN NJ -   HAWTHORNE CHEVROLET WOULD BE THE PROPER DEALERSHIP -  (I PURCHASED THE CAR THERE -  10 YEARS AGO -  THEY HAVE SERVICED THE CAR FOR ROUTINE REPAIRS) ...    WILL BE CONTACTING THEM ON THIS SRS AIRBAG WARNING LIGHT PROBLEM -  BUT WORRIED THEY ARE NOT REALLY KNOWLEDGEABLE ON IT ...   THERE SHOULD BE A RECALL ON THIS PROBLEM -  SRS / AIRBAG WARNING LIGHT STAYING ON - SAFETY RELATED FAILURE -  CHEVY KNOWS ABOUT THIS BY NOW FOR SURE -     INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "KL1TD56668B"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/15/2019",
        "dateOfIncident": "11/14/2019",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11280257,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2008 CHEVROLET AVEO. WHILE DRIVING 20 MPH, SMOKE ENTERED THE CABIN OF THE VEHICLE FROM UNDER THE STEERING PANEL. THE CONTACT WAS ABLE TO SAFELY EXIT THE VEHICLE. THE FIRE DEPARTMENT WAS CALLED AND WAS ABLE TO EXTINGUISH THE FIRE. A FIRE REPORT WAS FILED. THERE WERE NO INJURIES SUSTAINED. THE VEHICLE WAS TOWED TO A SALVAGE YARD. PRIOR TO THE FIRE, THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC DUE TO AN ABNORMAL CHEMICAL ODOR IN THE VEHICLE. THE CONTACT WAS INFORMED TO LUBRICATE THE WIRES IN THE INSTRUMENT PANEL, REMOVE THE FUSES FROM THE FUSE PANEL, AND DO THE SAME WITH THE PROPER DI-ELECTRIC GREASE. THE CONTACT STATED THAT THE VEHICLE CAUGHT FIRE BEFORE PERFORMING THE LUBRICATION. THE VEHICLE WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 14V261000 (EXTERIOR LIGHTING). THE DEALER AND MANUFACTURER WERE NOT CONTACTED. THE VEHICLE WAS DESTROYED. THE APPROXIMATE FAILURE MILEAGE WAS 124,000.",
        "vin": "KL1TD66678B"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/05/2019",
        "dateOfIncident": "04/15/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11241846,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CHEVROLET AVEO. WHILE DRIVING APPROXIMATELY 15 MPH, THE VEHICLE SHUT OFF WITHOUT WARNING. THE VEHICLE RESTARTED AND WAS TAKEN TO ANTELOPE VALLEY CHEVROLET (877-385-0885, LOCATED AT 1160 MOTOR LN, LANCASTER, CA). THE DEALER REPLACED THE THROTTLE BODY. THE CONTACT ALSO STATED THAT THE VEHICLE LOST POWER IN THE MIDDLE OF TRAFFIC. THE CONTACT SHIFTED INTO PARK, SHUT OFF THE ENGINE, AND RESTARTED THE VEHICLE. WHEN THE VEHICLE WAS IN PARK, THE ENGINE REVVED AND JERKED WHEN IT WAS SHIFTED INTO DRIVE. THE CONTACT STATED THAT THE FAILURE RECURRED SEVERAL TIMES, BUT THE VEHICLE RESTARTED EACH TIME. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO REPLACED THE THROTTLE BODY AGAIN, BUT THE FAILURE RECURRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURES AND STATED THAT THERE WAS NO RECALL. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 50,000.",
        "vin": "KL1TD66648B"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/06/2019",
        "dateOfIncident": "06/05/2019",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11218247,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT CALLED ON BEHALF OF THEIR MOTHER WHO OWNED A 2008 CHEVROLET AVEO. THE CONTACT STATED THAT WHILE THE DRIVER WAS DRIVING APPROXIMATELY 35 MPH, A WHITE SMOKE WAS PRESENT COMING FROM THE REAR OF THE VEHICLE AND THE INSTRUMENT GAUGES BEGAN TO MALFUNCTION. THE ENGINE RPMS VIOLENTLY INCREASED AND DECREASED. THE HAZARDS WERE ENGAGED AND MOMENTS LATER SMOKE WAS SCENE COMING FROM UNDER THE HOOD OF THE VEHICLE. AFTER STOPPING AND EXITING THE VEHICLE, FLAMES WERE SEEN COMING FROM UNDER THE VEHICLE AND FROM UNDER THE HOOD. THE FIRE DEPARTMENT WAS CALLED TO THE SCENE AND EXTINGUISHED THE FLAMES. DURING THE INCIDENT THE VEHICLE WAS DESTROYED. A FIRE REPORT WAS TAKEN AT THE SCENE. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE LOCAL DEALER WAS NOT NOTIFIED. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 124,000.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,ENGINE",
        "crash": true,
        "dateComplaintFiled": "04/24/2019",
        "dateOfIncident": "04/04/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11203401,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR SHUTOFF WHILE DRIVING",
        "vin": "KL1TD66628B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/12/2019",
        "dateOfIncident": "02/23/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11186052,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG LIGHT IS ON, HAS BEEN ON WHEN I BOUGHT THE CAR FROM THE DEALER, SAID PASSENGER SIDE AIRBAG FUSE WAS BAD, NEEDED REPLACED.  NOTED THAT THE PASSENGER ON/OFF WILL AT RANDOM TURN ON OR OFF OR NOT EVEN SHOW AT TIMES, I HAVE ALSO NOTED THE SEAT MAKING SOME SORT OF NOISE WHEN TURNING THE CAR ON.",
        "vin": "KL1TD56678B"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/09/2019",
        "dateOfIncident": "12/29/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11166124,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SOMEWHERE IN BETWEEN THE 81,100 - 81,300 MILES MARK MY VEHICLE HAS RECEIVED THE CHECK ENGINE LIGHT P2135 CODE, FOR THROTTLE/PEDAL SENSOR/SWITCH A / B VOLTAGE CORRELATION. AT THE TIME OF RECEIVING THE CODE I DID NOT NOTICE ANYTHING IRREGULAR UNTIL I RESEARCHED THE PROBLEM. ONE OF THE SYMPTOMS BEING, REVVING OF THE ENGINE WHEN GAS PEDAL IS NOT PRESSED. THAT'S WHEN I REALIZED MY CAR HAD BEEN DOING THAT JUST RECENTLY ON START UP BEFORE RECEIVING THE CODE. FINALLY AFTER ABOUT A MONTH, DRIVING VERY MINIMALLY MAYBE 10 SHORTS TRIPS OR LESS, THE CAR STALLED OUT AFTER APPROXIMATELY 0.1 MILES OF BELOW 15MPH DRIVING. I GOT OUT AND CHECKED UNDER THE HOOD AND I DIDNT SEE ANYTHING WRONG SO I BEGAN TO PUSH THE CAR BACK HOME. AFTER I REALIZED IT WOULD TAKE SOME MANEUVERING I DECIDED TO TRY STARTING THE CAR BACKUP AND IT DID SO I QUICKLY TURNED IT AROUND AND DROVE IT BACK HOME. STALLING OF THE ENGINE IS ALSO A SYMPTOM OF THE P2135 CODE. SINCE THAN OUT OF NECESSITY I'VE DRIVEN THE CAR TWICE FOR 13 MILE TRIPS WITHOUT STALLING OUT BUT THE CHECK ENGINE LIGHT HAS NOT GONE AWAY. THE ENGINE STILL REVS ON ITS ON START UP UNTIL FINALLY SETTLING INTO CONSISTENCY. AFTER TRYING TO FIGURE OUT WHAT EXACTLY NEEDS REPLACING ONLINE, IT APPEARS EVIDENT TO ME THAT A LARGE AMOUNT CHEVY AVEOS NO MATTER THE YEAR OR SPECIFIC MODEL, ENCOUNTER THIS PROBLEM. IT'S JUST A MATTER OF HOW MANY OWNERS TALKED ABOUT THE PROBLEM ONLINE AND REPORTED IT. THOSE WHO HAVE TAKEN IT ONLINE FIXED THE PROBLEM BY CLEANING THE THROTTLE BODY, WHICH ONLY LASTED FOR SO LONG AND COULD RESULT IN DAMAGE OR GETTING A WHOLE NEW THROTTLE BODY ASSEMBLY WITH A NEW THROTTLE POSITION SENSOR ATTACHED.",
        "vin": "KL1TD56628B"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/30/2018",
        "dateOfIncident": "11/28/2018",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11154906,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "\"TAKATA RECALL\" I WAS TRAVELING ALONG THE GARDEN STATE PARKWAY NORTHBOUND WHEN MY CAR STOPPED ACCELERATING. I PULLED OVER TO THE SHOULDER THE CAR COMPLETELY SHUT OFF AND CAUGHT ON FIRE. THE WHOLE CAR WENT UP INTO FLAMES WHILE I WAS STILL IN THE CAR AND WAS ABLE TO JUMP OUT OF THE PASSENGEER SIDE DOOR. THE CAR IS TOTALED.",
        "vin": "KL1TG566X8B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/05/2018",
        "dateOfIncident": "02/03/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11149543,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "\"TAKATA RECALL\" THE AIRBAG LIGHT IS ILLUMINATED AND NEVER GOES OUT.  ALWAYS ON.",
        "vin": "KL1TD566580"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/28/2018",
        "dateOfIncident": "09/16/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11132117,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CHEVROLET 4 DOOR AVEO. THE PASSENGER REAR TAILLIGHT WON'T WORK, THE LEFT SIDE WORKS, WAS LOOKING IT UP AND PEOPLE WAS SAYING THAT THEY WERE HAVING THE SAME PROBLEM. THE FUSEBOX UNDER THE HOOD WIRES, NEED TO SPLICE WIRES ELECTRICAL PROBLEM.",
        "vin": "KL1TD56618B"
    },
    {
        "components": "POWER TRAIN,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/13/2018",
        "dateOfIncident": "02/01/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129271,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CHEVROLET AVEO. WHILE DRIVING AT UNKNOWN SPEEDS, THE TRUNK LID OPENED INDEPENDENTLY. ADDITIONALLY, THE GEAR SHIFTER FAILED TO ENGAGE IN GEAR. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE LOCAL DEALER AND MANUFACTURER WERE NOT CONTACTED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE FAILURE MILEAGE WAS 64,000.    *JS",
        "vin": "KL1TD56628B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/25/2018",
        "dateOfIncident": "04/01/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11122346,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG PASSENGER LIGHT COMES ON AND MULTIPLE TIMES REPAIR SHOP CLEARS IT, STAYS OFF FOR A BIT, THEN COMES BACK ON, BEEN TOLD NOTHING WRONG WITH IT.",
        "vin": "KL1TG566X8B"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/17/2018",
        "dateOfIncident": "06/10/2018",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11111925,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CHEVROLET AVEO. WHILE THE AIR CONDITIONER WAS ACTIVATED, THE VEHICLE STALLED. WHEN THE BRAKE PEDAL WAS DEPRESSED, THE VEHICLE ALSO STALLED. FURTHERMORE, THE TIRE PRESSURE WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE FUSE BOX WAS MELTED. THE CONTACT WAS REFERRED TO THE LOCAL DEALER. THE VEHICLE WAS TOWED TO GREY CHEVROLET (4949 HOVDE RD, PORT ORCHARD, WA 98367, (800) 803-8091) WHERE IT WAS DIAGNOSED THAT THE POSITIVE BATTERY CABLE AND UNDERHOOD BUSSED ELECTRICAL CENTER FUSE BOX NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED AND REFERRED THE CONTACT TO NHTSA. THE FAILURE MILEAGE WAS 67,396.   *JS",
        "vin": "KL1TD56668B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/16/2018",
        "dateOfIncident": "02/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11079821,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CHEVROLET AVEO. WHILE OPERATING THE VEHICLE, THE AIR BAG WARNING INDICATOR REMAINED ILLUMINATED. THE FAILURE WAS NOT DIAGNOSED OR REPAIRED. THE LOCAL DEALER (FRANK BASHAY IN RACINE, WI) WAS NOTIFIED OF THE FAILURE. THE MANUFACTURER WAS NOT NOTIFIED. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 70,000.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/28/2018",
        "dateOfIncident": "02/01/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11075474,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG INDICATOR HAS DISAPPEARED FROM DASHBOARD.  THE AIRBAG ON/OFF SYMBOL IS NO LONGER ILLUMINATED ON MY DASH AND MY AIRBAG WARNING LIGHT HAS TURNED ON.  IT STARTED AS THE AIRBAG ON/OFF LIGHT WOULD SOMETIMES BE ILLUMINATED, AND SOMETIMES NOT BE ILLUMINATED, AND NOW THE INDICATOR IS COMPLETELY GONE (NEVER SHOWS ON OR OFF).",
        "vin": "KL1TG56618B"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/12/2018",
        "dateOfIncident": "01/04/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11062411,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ABS LIGHT GOES ON AND OFF AND AT TIMES HAS A HARD TIME STOPPING.  ALSO MY DOORS WILL LOCK BY THEM SELF.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/19/2017",
        "dateOfIncident": "11/17/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11055560,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I MADE A REPORT MORE THAN A WEEK AGO.  THE HEADLIGHTS SPORADICALLY TURN OFF WITHOUT WARNING.  I WAS DRIVING AT NIGHT AND BOTH HEADLAMPS WENT OUT.  I HAVE TO DO NIGHT DRIVING WITH THE ILLUMINATION OF HAZARD LIGHTS ONLY.  UNSAFE!!!  THIS SITE CLAIMED I WOULD BE CONTACTED 72 HRS. AFTER I MADE THE FIRST REPORT.  WELL, I'M STILL WAITING.  I AM STILL WITHOUT HEADLIGHTS.  PERIODICALLY, THERE WAS ELECTRICAL (OZONE) SMELLS. SINCE THE LIGHTS ARE OUT, THIS IS NOTICED LESS,  BUT I HAVE SMELT IT ON A FEW OCCASIONS.",
        "vin": "KL1TD56608B"
    },
    {
        "components": "EXTERIOR LIGHTING,AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/06/2017",
        "dateOfIncident": "12/06/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11052871,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CHIEF DEFICIENCY: HEADLIUGHTS HAVE SPONTANEOUSLY STOPPED ILLUMINATING. NO HIGH OR LOW BEAM FUNCTION OF THE DRIVER OR PASSENGER HEADLAMPS.  BULBS WERE JUST REPLACED BECAUSE LIGHTS WERE DIMMING.  UPON REPLACEMENT IT WAS NOTED THAT THE PASSENGER PLUG IN/SOCKET WAS PARTIALLY MELTED. WORKED FINE FOR 20 DAYS; NOW NO HEADLIGHTS AT ALL. THIS OCCURRED WHILE I WAS DRIVING AFTER DARK. I FOUND THERE IS A GM RECALL CAMPAIGN 14236, DATED 19MAY2014: RECALL # 14V261000 FOR EXTERIOR HEADLIGHTS. ADDITIONALLY, TO WHAT IS NOTED ABOVE, I HAVE BEEN SMELLING PERIODICAL WHIFFS OF OZONE WHILE OPERATING THE VEHICLE THESE PAST FEW DAYS. THIS VEHICLE IS EQUIPPED WITH DAYTIME RUNNING LIGHTS (DRL).",
        "vin": "KL1TD56608B"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/12/2017",
        "dateOfIncident": "07/15/2016",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10994400,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CHEVROLET AVEO. WHILE DRIVING AT ANY SPEED, THE INSTRUMENT PANEL LIGHTING FAILED AND THE KEY WAS VERY HOT ONCE IT WAS REMOVED FROM THE IGNITION. THE CONTACT STATED THAT ALL THE WARNING INDICATORS ILLUMINATED ONCE THE VEHICLE WAS STARTED; HOWEVER, THE INSTRUMENT PANEL LIGHTING DID NOT OPERATE WHILE DRIVING. THE CONTACT NOTICED AN OCCASIONAL ODOR OF BURNING PLASTIC. THE DEALER (CHEVROLET OF LAFAYETTE IN LAFAYETTE, INDIANA) STATED THAT THERE WAS NO RECALL AND THAT THE WARRANTY DID NOT COVER THE FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STATED THAT THERE WAS NO RECALL. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 105,000.",
        "vin": "KL1TG56698B"
    },
    {
        "components": "AIR BAGS,STRUCTURE,ENGINE",
        "crash": true,
        "dateComplaintFiled": "04/25/2017",
        "dateOfIncident": "04/25/2017",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10980559,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS REAR ENDED BY ANOTHER VEHICLE WHILE DRIVING IN TRAFFIC ON THE HIGHWAY IN SLOW AND GO TRAFFIC. I WAS DRIVING AT A SLOW PACE, ABOUT 15 MPH.THE OTHER VEHICLE WAS TRAVELING AT ABOUT 30 MPH. WHEN HE HIT ME, HE FORCED MY VEHICLE INTO THE ONE IN FRONT OF ME. MY AIRBAG DID NOT GO OFF. MY CAR BURST INTO FLAMES ABOUT 5 MINUTES AFTER THE ACCIDENT. THE FLAMES WERE COMING UP FROM THE ENGINE. MY CAR IS TOTALED AS A RESULT OF THIS. I AM 12 WEEKS PREGNANT WITH TWINS. ONE OF MY PLACENTA'S HAS A TEAR IN IT AND IS BLEEDING AS A RESULT OF THIS ACCIDENT. I WILL HAVE TO BE ON BED REST FOR THE REMAINDER OF MY PREGNANCY. I AM AT RISK OF MISCARRYING ONE OR MAYBE BOTH OF MY BABIES.",
        "vin": "KL1TD56678B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/24/2017",
        "dateOfIncident": "02/15/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10980117,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CHEVROLET AVEO. THE CONTACT STATED THAT THE AIR BAG INDICATOR ILLUMINATED INDEPENDENTLY. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE AIR BAG MODULE WAS DEFECTIVE AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 47,000.",
        "vin": "KL1TG56698B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/31/2017",
        "dateOfIncident": "03/01/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10969662,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER AIRBAG OFF STAYS ON ALL THE TIMES.",
        "vin": "KL1TD56658B"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/24/2017",
        "dateOfIncident": "01/12/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 10947479,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2008 CHEVROLET AVEO. WHILE DRIVING APPROXIMATELY 10 MPH, ANOTHER VEHICLE CRASHED INTO THE CONTACT'S VEHICLE. THE AIR BAGS FAILED TO DEPLOY. THE DRIVER SUSTAINED RIBS INJURIES, THE FRONT SEAT PASSENGER SUSTAINED KNEE AND HEAD INJURIES, AND THE REAR PASSENGER SUSTAINED RIGHT HAND AND NECK INJURIES. MEDICAL ATTENTION WAS REQUIRED. THE VEHICLE WAS TOWED TO A TOWING LOT. A POLICE REPORT WAS FILED. THE VEHICLE WAS DESTROYED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 91,164.",
        "vin": "KL1TD56668B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/10/2017",
        "dateOfIncident": "01/11/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10944155,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CHEVROLET AVEO. THE CONTACT STATED THAT THE AIR BAG WARNING INDICATOR REMAINED ILLUMINATED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC, BUT THE FAILURE COULD NOT BE DETERMINED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 70,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/10/2017",
        "dateOfIncident": "12/27/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10944161,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CHEVROLET AVEO. THE CONTACT STATED THAT THE AIR BAG WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS TAKEN TO A DEALER, BUT THE CAUSE OF THE FAILURE COULD NOT BE DIAGNOSED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO STATED THAT THE HARNESS NEEDED TO BE REPLACED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VIN AND FAILURE MILEAGE WERE NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "12/31/2016",
        "dateOfIncident": "07/07/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10938951,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG LIGHT STAYS ON.  WAS TOLD PASSENGER SIDE AIR BAG PROBLEM ARE COMMON ON THE 2008 CHEVY AVEO. I USE THIS VEHICLE FOR A COMMUTER CAR. LIGHT CAME ON AROUND 25,000 MILES.  HARDLY EVER HAVE A PASSENGER IN THIS CAR. CHEVY NEEDS TO FIX THIS PROBLEM. BY THE INCREDIBLE LARGE AMOUNT OF COMPLAINTS ABOUT THE PASSENGER SIDE AIRBAG, IT MUST BE A MANUFACTURING DEFECT.",
        "vin": "KL1TD66618B"
    },
    {
        "components": "EXTERIOR LIGHTING,AIR BAGS,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "12/11/2016",
        "dateOfIncident": "12/03/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10934493,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG MALFUNCTION.  LIGHT IS ON AND STAYS ON.  THERBY DISABLING AIRBAG FUNCTIONALITY.  DO NOT UNDERSTAND HOW THIS IS NOT A RECAL ALREADY.  BELIEVE IT HAS ALREADY BEEN DETERMINED A RECALL ON PRIOR YEARS.  HEADLIGHT PLASTIC DETERIORATION.  PLASTIC HAS CRUMBLED AND WILL SOON MAKE VISIBILITY UNSAFE.",
        "vin": "KL1TG56638B"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "12/11/2016",
        "dateOfIncident": "12/10/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10934494,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVERS SIDE WIPER IS COMMING LOOSE.  HAS AN INCH OF TRAVEL BACK AND FORTH ON ITS SPINDLE. HAS 3 INCHES OF TRAVEL AT THE WIPER END.  UNKNOWN DATE OF OCCURENCE.",
        "vin": "KL1TG56638B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/09/2016",
        "dateOfIncident": "10/12/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10934094,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS 2008 CAR HAD 30,985 MILES ON IT WHEN PROBLEMS STARTED. THE AIRBAG LIGHT ON THE MAIN DASH WOULD COME ON WHILE DRIVING AND THE PASSENGER AIR BAG LIGHT WOULD GO OFF WHEN NO ONE WAS SITTING IN THE SEAT. ON 10/19/16 THE GM DEALER SAID THAT IT NEEDED A NEW BATTERY (CHECKED OUT OK IN LATE JULY) AND POSSIBLY A REPLACEMENT PASSENGER PRESENCE MODULE (THE ENTIRE SEAT BOTTOM). THEY REPLACED THE BATTERY AND THE LIGHTS WORKED PROPERLY UNTIL 11/12/16. THE SENSOR/SEAT HAD TO BE PREPAID FOR $1,195 AND THE WORK WAS DONE BY THE DEALER ON 11/15/16 FOR A TOTAL COST OF $1,386. I SAVED THE OLD PART. AS OF 12/9/16 THE PROBLEM HAS NOT RETURNED. PHOTOS ARE AVAILABLE.  *TR",
        "vin": "KL1TD56618B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/14/2016",
        "dateOfIncident": "09/15/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10916042,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG LIGHT CAME ON AND HAS BEEN ON FOR A FEW WEEKS NOW. THE CAR WAS NOT IN ANY ACCIDENTS WHEN THIS OCCURED. IT WAS PARKED ON FRIDAY AND NOT USED UNTIL THE FOLLOWING MONDAY. ON THAT MONDAY MORNING, THE LIGHT CAME ON AND STAYED ON SINCE THEN.",
        "vin": "KL1TG56608B"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/28/2016",
        "dateOfIncident": "09/26/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10910141,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE KEY COMES OUT OF THE IGNITION EVEN WHILE THE CAR IS RUNNING AND DRIVING. I DROVE THE CAR AND THOUGHT I TURNED IT OFF ALL THE WAY - TURNS OUT THERE WAS ANOTHER 'CLICK' TO TURN THE ENGINE COMPLETELY OFF. ENGINE ALSO CLICKS AFTER BEING TURNED OFF.    HEADLIGHTS WENT OUT, REPLACED BULBS ONLY TO REALIZE THE CONNECTORS WERE MELTED, BULBS BEING BLOWN ARE NOT THE CAUSE OF THIS ISSUE. AFTER DOING RESEARCH INTO THE PROBLEM I CAME ACROSS RECALLS FOR THIS YEAR, MAKE MODEL I CAME ACROSS A RECALL FROM 2014 (DOCUMENTS ON THIS SITE) THAT SAID ALL 2008 CHEVY AVEO'S WERE AFFECTED. I PURCHASED THE CAR FROM A USED CAR DEALERSHIP IN MAY, 2014 - I DON'T BELIEVE THIS CAR SHOULD HAVE BEEN SOLD GIVEN THE ISSUES AND RECALL NOTICES OUT AT THE TIME. I ONLY FOUND OUT THIS WEEK (SEPT 2016) ABOUT THE ISSUES. HOWEVER WHEN CALLING GM AND A CHEVY DEALERSHIP I WAS TOLD THERE ARE NO OPEN RECALLS ON THIS VEHICLE EVEN THOUGH THE ISSUE CAN CAUSE FIRES. THIS IS A PROBLEM! THE CAR GOES INTO BRYNER CHEVROLET TOMORROW SEPT 29, 2016 FOR A SERVICE APPOINTMENT.",
        "vin": "KL1TD56628B"
    },
    {
        "components": "POWER TRAIN,AIR BAGS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/22/2016",
        "dateOfIncident": "09/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10908658,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CHEVROLET AVEO. THE CONTACT STATED THAT THE PASSENGER SIDE AIR BAG AND THE CHECK ENGINE WARNING INDICATORS ILLUMINATED. IN ADDITION, THE HOLD BUTTON TO ACTIVATE THE FOUR WHEEL DRIVE FAILED. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE ENGINE SENSOR FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED TWICE. THE DEALER WAS UNABLE TO DIAGNOSE THE OTHER FAILURES; HOWEVER, ALL THE FAILURES RECURRED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURES. THE APPROXIMATE FAILURE MILEAGE WAS 125,000.  UPDATED 12/20/16*LJ  UPDATED 12/21/16.*JB",
        "vin": "KL1TD56668B"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/07/2016",
        "dateOfIncident": "08/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10893803,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY LIGHTS WANT GO OFF",
        "vin": "KL1TD666X8B"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/03/2016",
        "dateOfIncident": "03/21/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10882389,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN USING THE CIGARETTE LIGHTER THE FUSE WAS BLOWN ON THE RADIO. NOW THE DELEARSHIP IS ASKING FOR $120.00 JUST TO GIVE US THE CODE.",
        "vin": "KL1TG566988"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/21/2016",
        "dateOfIncident": "05/20/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10870148,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL ON AIR BAG LIGHT COMING ON WITHOUT AN ACCIDENT OR INCIDENT. THE VEHICLE WAS IN MOTION.",
        "vin": "KL1TD566810"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/01/2016",
        "dateOfIncident": "04/09/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10862424,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING SMELLING SMOKE LIKE SOMETHING BURNING, EVERY OTHER DAY I DIDN'T KNOWN WHAT IT WAS UNTIL THE FRONT DRIVER HEADLIGHT NOT OUT BUT DIM MY SON WAS  ABOUT TO REMOVE IT THE BULB AND FOUND THAT THE WIRES GOING TO THE SOCKET IS BURNED IT WASN'T  THE BULB IT COULD HAVE CAUGHT FIRE AND BURN THE HOLD CAR A FIRE!",
        "vin": "KL1TD56698B"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/25/2016",
        "dateOfIncident": "04/24/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10861231,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WENT TO  CHANGE THE PASSENGER SIDE FRONT HEADLAMP BULB SINCE IT WAS SHOWING HIGH BEAMS ON AND WAS DIMMED. TURNS OUT THE WIRING HARNESS THE BULB PLUGS INTO WAS MELTED. ACCORDING TO THE LOCAL DEALERSHIP MY VIN HAS NO RECALLS ON IT BUT IN DOING SOME RESEARCH IT SOUNDS VERY FAMILIAR TO RECALL #14236.",
        "vin": "KL1TD56618B"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/07/2016",
        "dateOfIncident": "04/07/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10853970,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWN A 2008 CHEVROLET AVEO. THE CONTACT STATED THAT THE VEHICLE HAD EXPERIENCED A PERIOD OF UNINTENDED ACCELERATION SPORADICALLY. THE FAILURE OCCURRED WITHOUT WARNING. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE THE TECHNICIAN CLEANED THE FUEL INJECTORS. THE VEHICLE WAS ABLE TO BE OPERATED NORMALLY HOWEVER THE FAILURE RECURRED AFTER A FEW DAYS. THE VEHICLE WAS ALSO TAKEN TO A DEALER WHERE THE FAILURE COULD NOT BE REPLICATED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 37,000.",
        "vin": "KL1TD56688B"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/05/2016",
        "dateOfIncident": "09/25/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10853605,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE, I OBTAINED THE VEHICLE FROM PHONE# 909-379-3256 GO=MOTORS CHRISTOPHER IN HEMET, CA.  IT HAS HAD PROBLEMS.  1)  NO AC, 2)PROBLEMS WITH STARTER & STARTING VEHICLE, TOOK IT BACK AND 3) FORTH TO DEALER4X PROBLEM NEVER RESOLVED TOOK IT TO ANOTHER DEALER FRIEND 4)WHO REPAIRED AND CHARGED ME $1500.00, 5) AS OF 3/31/16 THERE HAS BEEN A LOUD RATTLING IN THE ENGINE, I HAD THE OIL CHARGED AND THE MECHANIC @ WALMART SAID IT 6) SOUNDS LIKE A TIMING-BELT OR WATER/FLUID PUMP RATTLING, AND BE CAREFUL IT DOESN'T BLOW.  SO, THE VEHICLE IS SETTING IN OUR DRIVEWAY.  YOUR MOVE ON RESOLUTION.  PLEASE INFORM, NEXT MOVE, I DO NOT WANT TO KEEP MAKING PAYMENTS FOR A LEMON OF A VEHICLE?  I ENJOY DRIVING SUCH AN ECONOMICAL VEHICLE, BUT!!!  7) I HAVE A LOAN WITH PREMIER AUTO CREDIT, ARTURA CALDAS 818-933-4966.",
        "vin": "KL1TD6608B0"
    },
    {
        "components": "AIR BAGS,SEATS",
        "crash": false,
        "dateComplaintFiled": "02/24/2016",
        "dateOfIncident": "01/14/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10838028,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIRBAG MODULE IN THE PASSENGER SEAT NEEDS TO BE REPLACED. TO FIX THIS PROBLEM IT WILL COST $1400.00. MY EXTENDED WARRANTY WON'T COVER IT.",
        "vin": "KL1TD66698B"
    },
    {
        "components": "EXTERIOR LIGHTING,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/05/2016",
        "dateOfIncident": "12/01/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10824433,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG (RED LIGHT) LIGHT STAYS ON.  ALSO HEADLIGHTS PLASTIC MOUNTS, WHERE THE BOLTS GO IN  TO HOLD HEADLIGHTS IN PLACE, ARE DETERATED, HEADLIGHTS B BHEARLY HOLDING ON.",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/08/2015",
        "dateOfIncident": "04/23/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10809052,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS REAR ENDED AND IT WAS NOT A BAD ACCIDENT BUT NEEDED A BUMPER AND I NOTICED THAT AFTER THIS HAPPENED MY AIRBAG SENSOR LIGHT CAME ON.  WHEN WE TOOK THE VEHICLE IN FOR REPAIR I TOLD THE TECHNICIAN THAT I WAS MORE CONCERNED ABOUT THE AIRBAG SENSOR LIGHT THEN THE BUMPER.  THEY SAID THEY WOULD LOOK AT IT.  WHEN WE PICKED UP OUR VEHICLE THEY SAID THEY LOOKED AT THE AIRBAG LIGHT SENSOR AND RESET IT.  NOW 6 MONTHS LATER THE LIGHT IS BACK ON. I TOOK IT BACK AND THEY SUGGESTED I CHECK ON THE INTERNET FOR ANY RECALLS. I DID NOT SEE ANY.  CAN YOU SUGGEST ANYTHING.  I FEEL THAT THEY DID NOT REALLY PROPERLY CHECK OUT THE SENSOR LIGHT OR TO MAKE SURE THE AIRBAG IS OK.",
        "vin": "KL1TD56628B"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/19/2015",
        "dateOfIncident": "11/05/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10794903,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY AIRBAGS DID NOT DEPLOY WHEN I HIT A DEER IN 2013. NOW MY WIRING THAT COMES FROM ENGINE COMPARTMENT THAT CONTROLS MY WINDOW LOCK AND POWER WINDOWS IS SHORTING OUT. MY NEIGHBOR HAS A 2007 CHEVY COLORADO HAS GOTTEN A RECALL ON HIS DUE TO SAME REASON.",
        "vin": "KL1TG56618B"
    },
    {
        "components": "EXTERIOR LIGHTING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/28/2015",
        "dateOfIncident": "06/01/2015",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10786801,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CHEVROLET AVEO. AFTER DRIVING THE VEHICLE FOR PROLONGED PERIODS OF TIME, FUMES EMITTED FROM THE FRONT OF THE VEHICLE. WHEN THE CONTACT OPENED THE HOOD, SMOKE APPEARED. THE CONTACT SUSTAINED INJURIES THAT DID NOT REQUIRE MEDICAL ATTENTION. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 14V261000 (EXTERIOR LIGHTING). THE FAILURE MILEAGE WAS 80,000.",
        "vin": "KL1TD56688B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/21/2015",
        "dateOfIncident": "06/01/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10785024,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER AIR BAG INDICATOR LIGHT ON CONSTANTLY",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/01/2015",
        "dateOfIncident": "10/09/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10779045,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CHEVROLET AVEO. WHILE DRIVING VARIOUS SPEEDS, THE AIR BAG WARNING LIGHT WAS CONSTANTLY ILLUMINATED. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE WIRING FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED, BUT THE FAILURE WAS PERSISTENT. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 64,000.",
        "vin": "KL1TD56698B"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/24/2015",
        "dateOfIncident": "04/01/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10776408,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CHEVROLET AVEO. THE CONTACT STATED THAT THE PLUGS TO THE HEADLIGHTS BURNED OUT WITHOUT WARNING. THE CONTACT REPLACED THE HEADLIGHT PLUGS FOUR TIMES. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE FAILURE MILEAGE WAS 105,000.",
        "vin": "KL1TD56658B"
    },
    {
        "components": "SUSPENSION,ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/14/2015",
        "dateOfIncident": "09/04/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10763517,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER SIDE HEAD LAMP IS NOT WORKING PROPERLY. THE WIRE LIGHTING HARNESS KEPT SHORTING OUT, I HAD IT REPAIRED AT A SHOP. IT LATER MELTED AND THE LIGHT WENT OUT. I TRIED TO ORDER ANOTHER ON, BUT THE DEALERSHIP ONLY SELLS THE WHOLE KIT NOT JUST THE LIGHT BULB ITSELF. I AM HAVING TO PAY OVER $300 FOR A NEW KIT WHEN ALL I NEEDED WAS A BULB AND THE HARNESS. THIS IS INSANE, ESPECIALLY WHEN THERE HAVE BEEN RECALLS FOR THIS VERY SAME PROBLEM. I ALSO HAD AN ELECTRICAL PROBLEM WHERE MY CAR BATTERY WOULD DRAIN, AND LOSE POWER.",
        "vin": "KL1TD56638B"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/02/2015",
        "dateOfIncident": "02/02/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10760520,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 CHEVROLET AVEO.  CONSUMER WRITES IN REGARDS TO PARTS NOT AVAILABLE TO COMPLETE RECALL NOTICE 14V-261.  *SMD",
        "vin": "KL1TD66628B"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/27/2015",
        "dateOfIncident": "02/16/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10744010,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THIS VEHICLE BRAND NEW.  THE FIRST WINTER I HAD IT, THE THROTTLE BODY SEIZED LEAVING THE THROTTLE OPEN AND THE ENGINE RACING - THE CAR HAS A MANUAL TRANSMISSION, THEREFORE I WAS ABLE TO DEPRESS THE CLUTCH AND PULL IT OVER.  THE LOCAL CHEVROLET DEALER IN CIRCLEVILLE, OH PERFORMED A TECHNICAL SERVICE BULLETIN ON THE CAR, REROUTING THE EGR SYSTEM & REMOVING SOME PARTS AROUND THE THROTTLE BODY.  ON SUBSEQUENT EVENTS, THE CAR EXPERIENCED SEVERE LOSS OF POWER AND SURGES.  THE THROTTLE BODY WAS REPLACED.  THE PROBLEM OCCURRED AGAIN WITH THE SAME TROUBLE CODE BEING SET.  THE CAR IS NOW ON ITS THIRD THROTTLE BODY (TPS SENSOR CANNOT BE REPLACED SEPARATELY) THIS MODEL YEAR HAS A THROTTLE-BY-WIRE ENGINE CONTROL SYSTEM.  MY CAR STILL SUFFERS FROM AN INTERMITTENT ENGINE TROUBLE CODES RELATED TO THE THROTTLE BODY AND SURGING PROBLEMS.  FINALLY, THE MANUAL TRANSMISSION BROKE ITS INTERNAL SHIFTING MECHANISM AND THE CAR LOCKED ITSELF IN GEAR.  AT THE SAME TIME, THE CLUTCH DID NOT SEEM TO FUNCTION.  I AM AFRAID TO DRIVE WITH FAMILY MEMBERS IN THIS CAR.",
        "vin": "KL1TD66678B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/22/2015",
        "dateOfIncident": "07/18/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10735878,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CHEVROLET AVEO. WHILE STARTING THE VEHICLE, THE PASSENGER SIDE AIR BAG DEPLOYED INADVERTENTLY. NO INJURIES WERE SUSTAINED. THE VEHICLE WAS DRIVEN TO THE CONTACT'S RESIDENCE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 90,000.",
        "vin": "KL1TD66668B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/10/2015",
        "dateOfIncident": "07/06/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10733103,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CHEVROLET AVEO. WHILE DRIVING 25 MPH, THE AIR BAG WARNING INDICATOR ILLUMINATED. THE FAILURE OCCURRED INTERMITTENTLY. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 114,000.",
        "vin": "KL1TD66698B"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/02/2015",
        "dateOfIncident": "06/28/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10731829,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE HIGHWAY ON MY WAY HOME FROM 3 HOURS AWAY, AND I WAS ABOUT AN HOUR AND 30 MIN FROM HOME. I STOPPED AT MCDONALD S TO FEED THE 3 KIDS, I WAS THERE FOR 35 MIN WITH THE CAR OFF. NOT EVEN 10 MIN LATER, BACK ON THE HIGHWAY, THE CAR SORT OF SPIT AND/OR SPUTTERED. I THOUGHT MAYBE I HAD GOTTEN SOME BAD GAS BECAUSE IT ONLY DID IT ABOUT 3 TIMES AND IT WAS OK, THERE WERE NO LIGHTS ON INDICATING ANYTHING WAS WRONG. JUST A COUPLE MINUTES LATER IT DID IT SPIT AND/OR SPUTTERED 2 MORE TIMES, STILL NO LIGHT INDICATORS HAD COME ON AND I LOOKED DOWN AT THE GAUGES I HAD 6/8THS TANK OF GAS, ALMOST FULL. THE ENGINE TEMP WAS READING HOT THOUGH, BUT NO LIGHTS WERE ON, SUDDENLY WE WERE GOING UP A SLIGHT INCLINE BUT THE CAR WOULD NOT GO FASTER, IN-FACT IT WAS ACTUALLY SLOWING DOWN AND IT WOULD NO LONGER SWITCH TO A HIGHER GEAR.   AS SOON AS THE HIGHWAY LEVELED OFF, I PUT THE CAR IN NEUTRAL TO GIVE THE ENGINE A BRAKE UNTIL WE REACHED THE NEXT GAS STATION, BUT AS SOON AS IT HIT NEUTRAL THE CAR SHUT OFF AND WAS COASTING. I HAD TO PULL OVER AS QUICK AS I COULD. WHEN SOMEONE FINALLY STOPPED TO HELP, WE FOUND A TINY HOLE IN A HOSE, WE CUT THE HOSE, READJUSTED IT BUT IT STILL WOULDN'T START, AFTER 3 JUMPS IT STILL WOULDN'T START. WE WERE STRANDED FOR OVER 4 HOURS, AND THE BATTERY FINALLY COMPLETELY DIED OUT AS OUR RIDE HAD JUST GOTTEN THERE.      THERE WAS ABSOLUTELY NO WARNING FOR THE BREAK DOWN, NOT EVEN A CHECK ENGINE LIGHT HAD CAME ON. BECAUSE OF THIS ME 3 KIDS ALL 5 YEARS OLD AND UNDER, AND MY AUNT WHO IS DEATHLY AFRAID OF SEMI'S WERE STRANDED ON THE SIDE OF A HIGHWAY FOR OVER 4 HOURS!",
        "vin": "KL1TD66678B"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/02/2015",
        "dateOfIncident": "03/08/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10723056,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN INVOLVED IN 2 WRECKS, AND MY AIRBAG HAS NOT GONE OFF EITHER TIME. SECONDLY MY HEADLIGHTS BURNED OUT THE WIRE MELTS GETS HOT AND MY LIGHTS JUST TURN OFF WHILE I'M DRIVING.",
        "vin": "KL1TG56678B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/22/2015",
        "dateOfIncident": "01/01/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10721057,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CHEVROLET AVEO. THE CONTACT STATED THAT THE FRONT PASSENGER SEAT FAILED TO DETECT AN OCCUPANT IN THE PASSENGER SEAT. THE CONTACT MENTIONED THAT IT FAILED TO RECOGNIZE A 95 LB FRONT PASSENGER SEATED IN THE SEAT. THE VEHICLE WAS TAKEN TO A DEALER WHO STATED THAT THE SEAT WAS UP TO NORMAL SPECIFICATION. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 100.",
        "vin": "KL1TD66638B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/06/2015",
        "dateOfIncident": "04/02/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10703836,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG LIGHT BURNS CONTINUOUSLY AND FAILED STATE INSPECTION.   *TR",
        "vin": "KL1TD56648B"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/18/2015",
        "dateOfIncident": "05/23/2014",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10695021,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CHEVROLET AVEO. WHILE DRIVING APPROXIMATELY 40 MPH AT NIGHT, THE HEADLIGHTS BECAME INOPERABLE WITHOUT WARNING. IN ADDITION, THE CONTACT STATED THAT THERE WAS SMOKE EMITTING UNDER THE HOOD AND INTO THE VEHICLE. AS A RESULT, THE CONTACT DISCOVERED THAT THE HEADLIGHT PLUG AND WIRING WERE MELTED. THE FAILURE RECURRED THREE TIMES. A POLICE REPORT WAS NOT FILED AND NO INJURIES WERE REPORTED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 14V261000 (EXTERIOR LIGHTING); HOWEVER, THE PART NEEDED TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 120,000.",
        "vin": "KL1TD66628B"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/12/2015",
        "dateOfIncident": "03/12/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10693948,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CHEVROLET AVEO. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 14V261000 (EXTERIOR LIGHTING); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.   UPDATED 4/20/15*CN",
        "vin": "KL1TD66688B"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/09/2015",
        "dateOfIncident": "02/18/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10693098,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CHEVROLET AVEO. WHILE DRIVING AT AN UNKNOWN SPEED, THE DRIVER SNEEZED AND, AS A RESULT, THE DRIVER CRASHED INTO THE REAR OF ANOTHER VEHICLE. THE AIR BAGS FAILED TO DEPLOY. A POLICE REPORT WAS FILED AND THERE WERE NO INJURIES REPORTED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 5,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/05/2015",
        "dateOfIncident": "03/05/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10692229,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DASH BOARD LIGHTS, MY PASSENGER REAR BLINKER LIGHT, PASSENGER READ BREAK LIGHT, AND FRONT PASSENGER RUNNING LIGHT ALL WENT OUT. FUSES WERE CHECKED AND THE RECALL RELAY SWITCH WAS REPLACED BUT THE LIGHTS ARE STILL OUT. I SMELL HOT ELECTRICAL WHEN THEY WENT OUT. THE LIGHTS WERE ACTING WEIRD FOR A COUPLE WEEKS. THEY WOULDN'T TURN ON THEN WOULD WHEN I WAS DRIVING OR THEY WOULD SHUT OFF WHILE I WAS DRIVING. NOW I HAVE NOTHING.   *TR",
        "vin": "KL1TD66668B"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/02/2015",
        "dateOfIncident": "03/02/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10691478,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CHEVROLET AVEO. THE CONTACT STATED THAT THE HEADLIGHT ASSEMBLY BECAME INOPERABLE. THE VEHICLE WAS NOT TAKEN TO A DEALER OR INDEPENDENT MECHANIC TO BE DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE VIN WAS UNAVAILABLE. THE FAILURE MILEAGE WAS 20,000.",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/25/2015",
        "dateOfIncident": "02/07/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10690557,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CHEVROLET AVEO. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER:14V261000 (EXTERIOR LIGHTING) HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "KL1TD66648B"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/19/2015",
        "dateOfIncident": "02/18/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10684232,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CHEVROLET AVEO. WHILE DRIVING APPROXIMATELY 35 MPH, THE CONTACT'S VEHICLE CRASHED INTO THE REAR OF ANOTHER VEHICLE. THE AIR BAGS FAILED TO DEPLOY. THE CONTACT SUSTAINED MINOR INJURIES, WHICH DID NOT REQUIRE MEDICAL ATTENTION. THE DRIVER IN THE OTHER VEHICLE WAS UNINJURED. A POLICE REPORT WAS FILED. THE CONTACT DROVE THE VEHICLE TO HER RESIDENCE. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 90,000.",
        "vin": "KL1TD56658B"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/17/2015",
        "dateOfIncident": "02/13/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10683933,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CHEVROLET AVEO. THE CONTACT STATED THAT WHILE DRIVING AT 65 MPH, THE VEHICLE LOST POWER. IN ADDITION, THE CONTACT NOTICED SMOKE COMING FROM THE REAR OF THE VEHICLE.  THE VEHICLE WAS TOWED TO A DEALER. THE TECHNICIAN DIAGNOSED THAT THE CATALYTIC CONVERTER, THE IGNITION COIL, AND THE OXYGEN SENSORS NEEDED TO BE REPLACED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 39,500.",
        "vin": "KL1TD666X8B"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/04/2015",
        "dateOfIncident": "01/03/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10681367,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON HIGH WAY RADIO SHUT OFF AND DASH LIGHTS FLICKERED. THEN IT WAS FINE THEN I GO AND TURN CAR ON DASHLIGHTS NOT ON AND CAR WONT COME OUT OF PARK. ALSO HEADLIGHTS KEEP BLOWING OUT.  *TR",
        "vin": "KL1TG566X8B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/03/2015",
        "dateOfIncident": "02/03/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10681061,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY AIR BAG LIGHT  GOES ON AND OFF AND HAPPENS  AT ANY TIME,NOW  MY   TIRE LIGHT IS ON AND I  HAD THE SENSORS  CHECKED   AND EVERYTHING IS FINE. WHAT IS THE SOLUTION?  *TR",
        "vin": "KL1TD56658B"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/28/2015",
        "dateOfIncident": "01/27/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10679536,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE LIGHT WAS ON IN MORNING WHEN CAR WAS TURNED ON, WHILE GOING TO WORK 20MPH UPHILL MY CAR STARTED ACTING LIKE I STOPPED PRESSING ON THE THROTTLE PEDAL. I CAME TO A STOP ON THE HILL PLACED CAR IN PARK AND RESTARTED UP HILL. CAR WAS NOTICEABLY TRYING TO WORK 2X AS HARD. AFTER WORK CAR WAS TAKEN TO A AUTO SERVICE CENTER. THE AUTO SHOP GAVE ME THESE CODES AFTER THE READING WAS COMPLETED; P2106, P2110, P2135, P2101.  *TR",
        "vin": "KL1TG56648B"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/02/2014",
        "dateOfIncident": "12/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10661830,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2008 CHEVROLET AVEO. THE CONTACT RECEIVED NHTSA CAMPAIGN NUMBER: 14V261000 (EXTERIOR LIGHTING) HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE VIN WAS UNAVAIABLE.",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/19/2014",
        "dateOfIncident": "11/19/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10659449,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CHEVROLET AVEO. THE CONTACT RECEIVED A NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 14V261000 (EXTERIOR LIGHTING) AND STATED THAT THE PART NEEDED WAS UNAVAILABLE TO REPAIR THE VEHICLE. THE DEALER WAS UNABLE TO INFORM WHEN THE PART WOULD BECOME AVAILABLE. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "KL1TD66648B"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/28/2014",
        "dateOfIncident": "10/28/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10650595,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS THE SECOND TIME I COULD NOT SHIFT MY CAR OUT OF PARK. I PAID LAIT OF MONEY AND HAD IT FIXED ALMOST TWO YEARS AGO. WHEN I WENT TO TAKE MY DAUGHTER TO SCHOOL THIS MORNING OF COURSE IT HAPPENED AGAIN. I CAN NOT AFFORD TO KEEP FIXING A PART THAT I DID NOT BREAK. SO RIGHT NOW I HAVE TO USE THE SHIFT RELEASE BUTTON UNTIL CHEVROLET REALIZES THEY HAVE AN ISSUE. A RECALL NEEDS TO BE MADE. I HAVE ONLY HAD THE CAR 6 YEARS. I GOT IT BRAND NEW. THESE PROBLEMS SHOULD NOT BE HAPPENING. THANK YOU[XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/23/2014",
        "dateOfIncident": "10/23/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10649388,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2008 CHEVY AVEO,IT HAS 29,000 MILES WHICH WAS PURCHASED IN NEW JERSEY.  THE VEHICLE WAS SHIPPED TO EGYPT, AND HAVE BEEN EXPERIENCING THE FOLLOWING PROBLEMS:    1.  AIR BAG LIGHT IN ALWAYS ON  2. CRUISE CONTROL IS NOT WORKING  3. CLOCK LIGHT IS OFF AND ON INTERMITTENTLY    I TOOK THE VEHICLE TO AN AUTHORIZED DEALER IN HURGHADA, EGYPT.  THEY WERE UNABLE TO SERVICE THE VEHICLE.  I HAVE NO INCIDENT.  *TR",
        "vin": "KL1TG56668B"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/14/2014",
        "dateOfIncident": "09/22/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10644707,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "IT STARTED OUT AS A DIM HEADLIGHT ON MY 08 CHEVY AVEO, SO I WENT AND BOUGHT A NEW HEADLIGHT FOR IT THINKING THAT IS WAS BURNT OUT OR GETTING CLOSE TO IT. AT TIMES THE DIMMED LIGHT WAS STUCK ON HIGHBEAM AND THEN THE HIGHBEAM WOULD STAY ON, OTHER TIMES IT JUST LOOKED DIMMER/BURNT OUT FROM THE OTHER ONE.  I TOOK THE THREE BOLTS OFF OF THE LEFT HEADLAMP AND DISCONNECTED THE POWER PLUG, I FOUND OUT THAT THE CONNECTOR THAT PLUGS INTO THE LIGHT BULB WAS MELTED/BURNT LOOKING. IT ALSO HAD A STRONG ODOR OR WHAT TO ME SMELLED LIKE BURNT RUBBER. I HAD DECIDED TO TAKE THE MELTED BULB OUT AND DISCARD IT. THE NEW ONE I DID NOT PUT IN, BECAUSE I DID NOT WANT IT TO HAVE THE SAME THING HAPPEN TO IT. SO FOR THE TIME BEING IT IS DISCONNECTED AND LAYING BY THE BATTERY AREA. I DID LOOK ONLINE AND MY VEHICLE IS ON A RECALL FOR SOMETHING DEALING WITH THE LIGHTING AREA. AS OF NOW OCTOBER 14TH IT IS STILL DISCONNECTED FROM THE MAIN HEADLIGHT IN FEAR OF IT MELTING AND PERHAPS CAUSING A FIRE TO THE CAR. I HAVE CONTACTED MY LOCAL CHEVY DEALER WHERE THE CAR WAS PURCHASED FROM AND NO ONE SEEMS TO HAVE ANY IDEA ABOUT IT, BUT YET ITS RECALLED AS OF MAY 2014 FROM WHAT I HAVE FOUND OUT.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/09/2014",
        "dateOfIncident": "10/04/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10643508,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE IGNITION GETS EXTREMELY HOT AFTER DRIVING TO THE POINT OF MY KEY ACTUALLY BURNING ME WHEN I TAKE IT OUT.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/06/2014",
        "dateOfIncident": "07/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10641664,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE IGNITION SWITCH GETS HOT WHEN DRIVING MORE THAN 30 MILES AND THE FAN MOTOR FOR AC AND HEAT DOES NOT TURN ON.  *TR",
        "vin": "KL1TD56628B"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/08/2014",
        "dateOfIncident": "08/04/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10631452,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CHEVROLET AVEO. WHILE DRIVING APPROXIMATELY 60 MPH, THE HEADLIGHTS RANDOMLY SHUT OFF AND WOULD NOT ILLUMINATE AGAIN. AN INDEPENDENT MECHANIC DIAGNOSED THAT THE WIRES, MODULES, AND HEADLIGHT CONNECTIONS WERE MELTED. THE VEHICLE WAS NOT REPAIRED AND THE MANUFACTURER WAS NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 79,000.",
        "vin": "KL1TD56668B"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/03/2014",
        "dateOfIncident": "09/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10630364,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER SIDE SENSOR DOES NOT REGISTER PASSENGER. I HIT A DEER AND NO AIR BAG DEPLOYMENT.  *TR",
        "vin": "KL1TG56618B"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/30/2014",
        "dateOfIncident": "07/15/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10629580,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIR BAG INDICATOR LIGHT CAME ON AND HAS STAYED ON CONSTANTLY. ACCORDING TO THE OWNER'S MANUAL, THIS COULD INDICATE A PROBLEM WITH THE AIRBAG NOT DEPLOYING WHEN IT SHOULD, OR POSSIBLY DEPLOYING WHEN NOT NEEDED. THIS SEEMS TO BE AN OCCURRING PROBLEMS ON SEVERAL MAKES AND MODELS I HAVE SEEN ON THE NEWS, ALL WITH RECALLS ISSUED, AND YET, CHEVY AND GM HAVE NOT ISSUED A RECALL FOR THIS. SEVERAL OTHER COMPLAINTS HAVE BEEN REPORTED ABOUT THIS ISSUE. THIS IS CLEARLY A SAFETY ISSUE THAT NEEDS TO BE ADDRESSED ON MY VEHICLE, AS WELL AS OTHERS. WHAT WILL IT TAKE BEFORE CHEVY AND GM DECIDE TO RECALL AND FIX THIS PROBLEM WITH THE AIRBAGS, AS THIS APPEARS TO BE A VERY SERIOUS, AND POTENTIALLY HARMFUL, IF NOT FATAL, POTENTIAL PROBLEM.  *TR",
        "vin": "KL1TG56608B"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/24/2014",
        "dateOfIncident": "04/14/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10627849,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2008 AVEO THAT I PURCHASED FROM A CHEVROLET DEALERSHIP IN RUSSELLVILLE, KY. SINCE THE 2ND DAY I OWNED IT, IT HAS BEEN NOTHING BUT PROBLEMS. AIR BAG SENSORS NOT WORKING, HAVE HAD THIS REPAIRED THREE TIMES. YESTERDAY THE AIR BAG LIGHT CAME ON AGAIN. MY BIGGEST TROUBLE HAS BEEN WITH THE THROTTLE POSITION SENSOR. GET A P2135 CODE THAT TELLS YOU TO REPLACE THE ENTIRE THROTTLE BODY. I DID THIS ($300 PART) DID NO GOOD. THE CAR HAS BEEN IN THE SHOP FOR OVER 7 MONTHS IN THE 15 MONTHS I'VE OWNED THE CAR. COMPUTER HAS BEEN \"FLASHED\" NUMEROUS TIMES. DIDN'T WORK. GM CUSTOMER CARE ASKED ME TO TAKE THE CAR TO AND AUTHORIZED CHEVROLET REPAIR SHOP. I DID. AFTER 2 TRIPS THERE AND A TOTAL OF 6 WEEKS IN THE SHOP, THEY TELL ME THEY THINK THE PROBLEM IS WITH THE ECM ENGINE CONTROL MODULE. THIS PART HAS AN 8 YEAR, 80,000 MILE WARRANTY. I BOUGHT THE CAR WITH 76,000 MILE ON IT. THE PROBLEM HAS BEEN DOCUMENTED BY THE CHEVY DEALERSHIP I PURCHASED THE CAR FROM FOR MANY THOUSANDS OF MILES PRIOR TO ME PURCHASING THE CAR. GM REFUSED TO HONOR THE WARRANTY BECAUSE THE CAR NOW HAS 82,000 MILES. THIS IS THE THING THAT GETS ME. WHEN I BOUGHT THIS CAR, THEY KNEW I WAS BUYING IT FOR A DAUGHTER IN COLLEGE. THEY KNEW THE CAR HAD THESE PROBLEMS AND SOLD IT TO ME ANYWAYS.     I HAD TO PURCHASE ANOTHER CAR FOR MY DAUGHTER.  I AM CURRENTLY DRIVING THE AVEO TO AND FROM WORK.  THE LIGHTS THAT ARE CURRENTLY \"ON\" ARE THE CHECK ENGINE LIGHT, THE AIR BAG LIGHT, AND I CAN NOT ALLOW A PASSENGER IN THE CAR BECAUSE, WHEN THEY SIT IN THE PASSENGER SEAT THE AIR BAG LIGHT THAT INDICATES THAT THE PASSENGER SIDE AIR BAG IS NOW ENGAGED DOES NOT GO OFF.  *TR",
        "vin": "KL1TD66638B"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/22/2014",
        "dateOfIncident": "07/21/2014",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10627629,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JULY 21, 2014 AT ABOUT 7:45 IN THE MORNING, MY WIFE WHO WAS GOING TO CHURCH WENT TO THE GARAGE TO USE THE AVEO. WHEN SHE OPENED THE DOOR, SHE WAS MET WITH DARK SMOKE AND SMELL OF BURNED PLASTIC. THEN SHE SAW THE MIDDLE OF THE DASHBOARD BURNED CREATING A BIG HOLE. THEN I HAD THE AVEO TOWED TO THE CHARLES CLARK CHEVROLET  WHERE I BOUGHT THE AVEO FOR THEM TO SEE. THEN I WENT HOME AND PASSING BY THE MAILBOX I GOT THE MAIL AND SAW AN ENVELOPE FROM GENERAL MOTORS. WHEN I OPENED THE ENVELOPE, I SAW THE LETTER OF THE RECALL OF THE AVEO DUE TO THE DEFECTIVE HEADLAMP SWITCH OR DAYTIME RUNNING LAMP WHICH GENERATE HEAT WHICH COULD MELT HEADLAMP SWITCH  AND DRL MODULE CAUSING FIRE. THAT WAS WHAT HAPPENED TO THE AVEO. SO I CALLED GM AND TOLD THEM WHAT HAPPENED. THEN AFTER SEVERAL DAYS OF CALLS AND AN INSPECTION BY THEIR ENGINEERS, I WAS TOLD THAT THE DAMAGE WAS BEYOND REPAIR AND THEY WILL PAY A LITTLE OVER $4,000 BECAUSE THEY WILL NOT REPAIR THE AVEO. I TOLD THEM I DO NOT AGREE BECAUSE THE AVEO WAS IN GOOD CONDITION AT SEVEN YEARS OLD, LESS THAN 16,000 MILEAGE, THE TIRES WERE STILL THE ORIGINAL TIRES WHEN BOUGHT AND HAD NEVER BEEN BROUGHT TO A REPAIR SHOP. SO I TOLD THEM TO REPAIR THE AVEO TO ITS CONDITION BEFORE THE FIRE. I COULD NOT BELIEVE THEY CANNOT REPAIR WHEN THEY CAN CREATE A NEW CAR. THE RECALL WAS A SAFETY-RELATED DEFECT AND MY WIFE WAS LUCKY SHE WAS NOT IN THE CAR WHEN THE FIRE HAPPENED. IF THE CAR WAS NOT BURNED, IT WOULD STILL BE GOOD FOR ANOTHER SEVEN YEARS. WITH GM'S PROPOSAL, MY WIFE AND I WILL INCUR A DEBT TO GET ANOTHER CAR AND WHEN SHE RETIRES AS A NURSE SUPERVISOR AT TEXAS STATE VETERANS HOME IN TWO OR THREE YEARS, WE WILL BE BURDENED WITH A LOAN PAST OUR RETIREMENT. MY WIFE IS 72 YEARS OLD NOW. WE DON'T WANT THAT TO HAPPEN.  THE CONSUMER WAS INFORMED, THE PARTS WERE NOT AVAILABLE. UPDATED 09/24/14.  UPDATED 03/04/15. *JB",
        "vin": "KL1TD66668B"
    },
    {
        "components": "POWER TRAIN,WHEELS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/19/2014",
        "dateOfIncident": "08/04/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10626247,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR STARTED TO SHAKE, SQUEAK, AND JERK. THIS HAS BEEN ONGOING FOR A FEW DAYS NOW, AFTER TAKING IT TO TWO DIFFERENT MECHANICS. I THEN LEARNED ABOUT THE SAFETY RECALLS FOR THE WHEEL BEARING, DRIVE TRAIN, AND PULLEY SYSTEM FOR THE ENGINE. I CALLED MY DEALERSHIP WHERE I PURCHASED THE USED CAR AND WAS TOLD THEY COULDN'T HELP ME WITH RECALLS. I THEN CALLED GM DIRECTLY AND WAS TOLD THERE WAS NO OPEN RECALL ON MY CAR. I FURTHER RESEARCHED AND FOUND THAT TO BE A LIE, YOUR DATA BASE ALONE STATES THERE IS ONE THAT MAY CAUSE THE CAR TO CATCH FIRE. THIS IS MY FIRST CAR TO PURCHASE AND WITH IT HAVING MAJOR SAFETY RECALLS AND NO ONE WANTING TO HELP, I DIDN'T KNOW WHO ELSE TO CONTACT.  *TR",
        "vin": "KL1T656648B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/17/2014",
        "dateOfIncident": "08/08/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10625824,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIR BAG LIGHT IS ON. I TOOK IT TO THE DEALER AND THEY SAID IT NEEDS A NEW AIRBAG CONTROL MODULE. THE COST IS 908.89 AND THE EXTENDED WARRANTY HAS RECENTLY EXPIRED.  *TR",
        "vin": "KL1TD666X8B"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/03/2014",
        "dateOfIncident": "06/13/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10618433,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR HAS BEEN HAVING NUMEROUS AIRBAG ISSUES AND ELECTRICAL PROBLEMS. THE FIRST ISSUE WITH MY AIRBAGS HAPPENED LAST YEAR AROUND THIS TIME. I TOOK CAR TO CHEVY SERVICE CENTER AND THEY TOLD ME THEY HAD TO REPLACE WHOLE FRONTAL AIRBAG SENOR AND OTHER SYSTEMS. IN MAY OF THIS  YEAR AIRBAG LIGHT CAME ON AGAIN. TOOK CAR TO CHEVY SERVICE CENTER AND THERE WERE NUMEROUS FAULT CODES PARTICULARLY THE PASSENGER SIDE AIRBAG SENSOR. THEY TOLD ME THAT THEY BELIEVE THERE IS A MALFUNCTION IN THE SYSTEM BUT THEY WERE SUGGESTING I REPLACE THE PASSENGER AIRBAG SENSOR. I ASKED GM TO DO A FULL SYSTEM CHECK ON MY AIRBAG SYSTEM BUT THEY REFUSED. I COULD NOT AFFORD THE REPAIRS SO I DID NOT HAVE THE ISSUE FIX. ALSO, I WAS NOT CONVINCED THAT IT WOULD HAVE SOLVED THE PROBLEM BECAUSE THEY WERE NOT 100% SURE SINCE THERE WERE NUMEROUS FAULT CODES. THE NEXT ISSUE IS HARD TO DESCRIBE BUT WHEN I AM DRIVING MY CAR JERKS AND SHAKES AND ALMOST SHUTS DOWN AND STARTS BACK UP AT THE SAME TIME. THIS HAPPENS WHETHER I AM STANDING BY A LIGHT OR FULLY IN DRIVE MODE. I TOOK CAR TO SHOP BUT THEY COULD NOT DIAGNOSE ISSUE BECAUSE CHECK ENGINE LIGHT IS NOT ON AND IT DOES NOT HAPPEN ALL THE TIME. ONLY WHEN I DRIVE MY CAR FOR MORE THAN AN 30 MINUTES TO AN HOUR.   *TR",
        "vin": "KL1TD566X8B"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/25/2014",
        "dateOfIncident": "07/18/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10616347,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THE CHEVY AVEO, ALL MODEL YEARS, THE PARK LOCK SITCH , THAT ALSO MAKES THE BRAKE LIGHTS WORK , SOMETIMES DOESN'T FUNCTION . THIS MAKES IT IMPOSSIBLE TO SHIFT OUT OF PARK WHEN THE BRAKE PEDAL IS DEPRESSED, ALSO THE BRAKE LIGHTS DON'T COME ON. THEREFORE, WHEN DRIVING THE BRAKE LIGHTS SOMETIMES DON'T WORK, WHICH IS A VERY DANGEROUS SITUATION.  *TR",
        "vin": "KL1TD66648B"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/22/2014",
        "dateOfIncident": "06/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10615254,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG LIGHT CAME ON AND STAYED ON., DASHBOARD CLOCK AND CD RADIO ALSO WENT OUT. THE CHEVROLET SERVICING DEALER SUGGESTED THAT THE SERVICE CODES REFLECTED A SHORT IN WIRING AND THE DASHBOARD HAS TO BE REMOVED TO CHECK THE WIRE HARNESS FOR THE SHORT. THEY WANTED TO CHARGE ME $315 , MANAGER CONTINUED TO STATE ALSO THE SENSOR MODULE FOR THE AIRBAG MAY BE DEFECTIVE. WHY DO THEY CHARGE FOR DIAGNOSIS WHEN THEIR DIAGNOSIS MEASURES CANNOT FIND THE PROBLEM AND WANT TO CHARGE ANOTHER $315 FOR FURTHER DIAGNOSIS?I WITH THE I'VE CHECKED WITH  OTHER AVEO OWNERS AND SOME HAVE THE SAME EXACT PROBLEM. I DO BELIEVE THERE IS A FAULT WITH THIS CAR. I DO NOT KNOW IF THE AIRBAGS WILL DEPLOY IF THEIR IS AN ACCIDENT WITH THIS CAR.   *TR",
        "vin": "KL1TG56648B"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/13/2014",
        "dateOfIncident": "02/03/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10610136,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY GRANDMOTHER HAS SOUGHT HELP BECAUSE HERE KEY GETS EXTREMELY HOT. HER GEAR SHIFTER LOCKS UP AND SHE CANT MOVE IT. THE AIR BAG LIGHT POPS ON AND WONT GO OFF. ALSO SHE HAS ASKED MULTIPLE TIMES AT VARIOUS DEALERS ETC, ABOUT IT AND THEY TELL HER THERE ARE NO RECALLS OR ANYTHING KNOWN. WE KNOW THEIR ARE PROBLEMS WITH THE DAYTIME RUNNING LIGHT MODULE BUT NOBODY SEEMS TO HAVE ANY INFORMATION ON THIS... AS I SAID THIS IS FOR MY GRANDMOTHER.   *TR",
        "vin": "KL1TG56678B"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/02/2014",
        "dateOfIncident": "07/02/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10607782,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG LIGHT CAME ON AND STAYED ON. UPON INSPECTION AT DEALERSHIP IT WAS SUGGESTED THAT THE CLOCK AND WIRING FROM THE AIRBAG COMPONENT TO THE CLOCK BE REPLACED TO FIX A SENSOR MALFUNCTION ISSUE. WARNED THAT IF ISSUE WAS NOT FIXED, IT WAS POSSIBLE THAT THE AIRBAG WOULD FAIL TO DEPLOY IN THE CASE OF AN ACCIDENT.   *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/01/2014",
        "dateOfIncident": "06/11/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10607276,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TO WHOM THIS MAY CONCERN,     I  RECENTLY REPLACED A DEFECTIVE IGNITION CYLINDER AND A IGNITION HOUSING IN MY STEERING WHEEL COLUMN COSTING OVER FOUR HUNDRED DOLLARS INCLUDING LABOR COST. I HAVE OWNED MANY OLD USED CARS AND SEVERAL NEW VEHICLES.  I HAVE NEVER REPLACED  A IGNITION SWITCH. I AM THE ORIGINAL OWNER AND STILL OWN THIS VEHICLE TODAY. I HAVE SPENT THOUSANDS OF DOLLARS ON  MY AUTOMOBILE. THE MOST EXPENSIVE WAS THE $1600. DOLLAR TIMING CHAIN BREAKDOWN.   IT IS REALLY A SHAME NEW CARS ARE BUILT SO THAT THEY DO BREAKDOWN.  BEING THE IGNITION SWITCH AND IGNITION HOUSING I BELIEVE THIS PROBLEM SHOULD BE RECALLED ON CHEVROLET  AVEOS, AS WELL.  THIS PART WAS DEEMED TO HAVE BROKEN DUE TO THE EXTREME NATURE OF GMC IGNITION PROBLEM. THANK YOU FOR YOUR TIME AND ALL EFFORTS.   [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "KL1TD56688B"
    },
    {
        "components": "SUSPENSION,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/30/2014",
        "dateOfIncident": "06/19/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10607110,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CHEVROLET AVEO. THE CONTACT STATED THAT WHILE DRIVING AT AN UNKNOWN SPEED, THE REAR END OF THE VEHICLE MADE AN ABNORMAL NOISE. THE CONTACT ALSO MENTIONED THAT THE AIR BAG WARNING INDICATOR ILLUMINATED. AN INDEPENDENT MECHANIC NOTICED THAT THE BUSHING WAS WORN. THE MANUFACTURER WAS NOT NOTIFIED.  THE APPROXIMATE FAILURE MILEAGE WAS 40,000.",
        "vin": "KL1TD56668B"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/23/2014",
        "dateOfIncident": "06/23/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10605409,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING AT 40 MPH OR OVER THE ANTANI MAKES A LOUD HUMMING INSIDE THE CAR YOU CANT HEAR ITS SO LOUD . SO IF THE COPS FIRE OR EMSA WAS COMING YOU WOULDN'T BE ABLE TO HEAR THEM OR OTHER THINGS YOU MAY NEED TO HEAR . THE ANTANI IS  ON TOP THE ROOF AND LONG AT CENTER FRONT OF THE ROOF THE WIND HITS IT AND THE HUMMING STARTS VERY LOUD . EVERY TIME I DRIVE 40 MPH AND ABOVE IT STARTS TO HUMMING AND IT IS THE ANTANI.  *TR",
        "vin": "KL1TD66658B"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/16/2014",
        "dateOfIncident": "04/25/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10598432,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HIT THE BACK OF A SUV AND IT HIT SO HARD THAT THE HITCH WENT THRU MY BUMPER, BUT AIRBAG DID NOT DEPLOY. NOW I HAVE A WARNING SIGN THAT JUST CAME UP STATING THERE IS A MALFUNCTION WITH THE AIR BAG.  *TR",
        "vin": "KL1TD56638B"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/28/2014",
        "dateOfIncident": "05/28/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10594666,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I PUT MY CAR IN PARK AND IT WILL NOT COME OUT OF PARK. I FOUND OUT IT WAS TORQUE LOCKED AND HAD TO FOLLOW ALL THE STEPS FROM MY MANUAL AND AT THE END IT SAYS GET FIXED ASAP. I HAVE READ THAT THERE ARE THE SAME THINGS HAPPENING TO ALOT OF AVEOS 2008 AND WHY IS THIS NOT ON THE RECALL.   *TR",
        "vin": "KL1TD56658B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/21/2014",
        "dateOfIncident": "11/11/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10592946,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "LIGHT FOR AIR BAG IS  ON TELLING ME THEY DO NOT WORK.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/21/2014",
        "dateOfIncident": "05/21/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10593155,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED NHTSA CAMPAIGN NUMBER 14V26 IN MY EMAIL MESSAGES.   I REGISTERED TO RECEIVE THEM. I AM NOT SURE IF THE MESSAGE WAS FOR AN INDIVIDUAL CAR OR ALL CARS INVOLVED.  THE MESSAGE STATED THAT 218,000 CARS WERE INVOLVED.   I GAVE THE CUSTOMER SERVICE REPRESENTATIVE THE LAST 8 DIGITS OF MY VIN.  I AM CONFUSED.    MY CAR IS ONE OF THE CARS INVOLVED.  WHY WASN'T RECALLED?  I HAVE ENCLOSED A COPY OF NOTICE 14236.      REPORT RECEIPT DATE: MAY 19, 2014   NHTSA CAMPAIGN NUMBER: 14V261000   COMPONENT(S):  POTENTIAL NUMBER OF UNITS AFFECTED: 218,000   ALL PRODUCTS ASSOCIATED WITH THIS RECALL   DETAILS   2 ASSOCIATED DOCUMENTS   MANUFACTURER: GENERAL MOTORS LLC    SUMMARY:   GENERAL MOTORS IS RECALLING CERTAIN MODEL YEAR 2004-2008 CHEVROLET AVEO VEHICLES EQUIPPED WITH DAYTIME RUNNING LIGHTS (DRL). IN THE AFFECTED VEHICLES, THERE MAY BE HEAT GENERATED WITHIN THE DRL MODULE LOCATED IN THE CENTER CONSOLE IN THE INSTRUMENT PANEL, WHICH COULD MELT THE DRL MODULE.   CONSEQUENCE:   IF THE DRL MODULE MELTS DUE TO THE HEAT GENERATION, IT COULD CAUSE A VEHICLE FIRE.   REMEDY:   THE REMEDY FOR THIS RECALL CAMPAIGN IS STILL UNDER DEVELOPMENT. THE MANUFACTURER HAS NOT YET PROVIDED A NOTIFICATION SCHEDULE. OWNERS MAY CONTACT GENERAL MOTORS CUSTOMER SERVICE AT 1-800-222-1020 (CHEVROLET). GENERAL MOTORS RECALL NUMBER FOR THIS CAMPAIGN IS 14236.     I AM CONFUSED.   IF I MADE A MISTAKE EXPLAN THE PROCEDURE.  IS A RECALL FOR AN INDIVIDUAL CAR OR ALL CARS THAT ARE IN THE RECALL?   *TR",
        "vin": "KL1TD56658B"
    },
    {
        "components": "SUSPENSION,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/16/2014",
        "dateOfIncident": "06/11/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10588954,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A USED 2008 CHEVY AVEO IN JUNE 2011. NEARLY ONE YEAR LATER I STARTED HAVING ISSUES WITH IT.  JUNE 2012 - VALVE COVER GASKET WAS CRACKED AND CAUSED SMOKING AFTER AN OIL CHANGE. REPAIRED AT DEALERSHIP.  SEPT. 9, 2013 - SPUTTERING AND STALLING. WAS TOLD IT WAS DUE TO A HOLD IN THE EXHAUST PIPE. REPLACED AT DEALERSHIP.  SEPT. 16, 2013 - STILL EXPERIENCING POWER ISSUES. WAS TOLD I NEEDED NEW SPARK PLUGS AND WIRES. REPLACED AT DEALERSHIP.  NOV. 7, 2013 - ENGINE LIGHT CAME ON. WAS TOLD IT WAS A FAULTY CAM SENSOR. REPLACED AT DEALERSHIP.  JAN. 23, 2014 - ENGINE LIGHT CAME ON. WAS TOLD THE OXYGEN SENSOR HAD FAILED. REPLACED AT DEALERSHIP.  APRIL 20, 2014 - TPMS LIGHT FINALLY WENT OFF AFTER BEING ON FOR 3 MONTHS. AIR CONDITIONER STOPPED WORKING THE SAME DAY. WAS TOLD IT WAS AN ELECTRICAL ISSUE (AC CLUTCH). DURING THE SAME VISIT AN INSPECTION FOUND THE RIGHT FRONT TOP BUSHING WORN, LEFT LOWER BUSHING WORN, AND REAR CROSS MEMBER BUSHING BROKEN.    I SENT A LETTER TO CHEVROLET, EXPRESSING MY DISAPPOINTMENT IN THE QUALITY OF THE AVEO. MY OTHER CHEVY VEHICLES HAD BEEN GREAT, BUT THIS AVEO FELL SHORT. AFTER SPEAKING TO SOMEONE IN CUSTOMER SERVICE, WHO?IN RESPONSE TO MY STATEMENT \"INDIVIDUALS WHO PURCHASE THESE KINDS OF ECONOMY CARS ARE TYPICALLY ON A BUDGET AND CAN'T AFFORD THE REPAIRS THE AVEO HAS NEEDED DUE TO ITS POOR QUALITY\"?SIMPLY TOLD ME THAT IT WAS NOT HER FAULT THAT I COULDN'T AFFORD A BETTER CAR.    I WILL NEVER BUY ANOTHER CHEVY AGAIN.  *TR",
        "vin": "KL1TG56698B"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/11/2014",
        "dateOfIncident": "04/21/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10587655,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "IN MARCH OF LAST YEAR I PURCHASED A USED CHEVROLET AVEO FROM AUTO NATION CHEVROLET IN SUGAR LAND, TX (HWY. 6).  I HAVE BEEN COMFORTABLE IN MY CAR UP UNTIL 2 1/2 WEEKS AGO WHEN I HAD TO HAVE MY CAR REPAIRED AT CLASSIC CHEVROLET IN SUGAR LAND, TX ON APRIL 21,2014. MY BRAKE SHIFT SENSOR HAD TO BE REPLACED, MY BRAKE SWITCH, AND MY CLOCK. THE PROBLEMS WITH MY SHIFT CAUSED MY BRAKE LIGHTS NOT TO WORK AND I DID NOT KNOW THEY WERE NOT WORKING UNTIL I HAD A CONVERSATION WITH SOMEONE AT PEP BOYS. NO ONE BLEW THEIR HORN OR ANYTHING TO LET ME KNOW MY BRAKE LIGHTS WERE OUT. I KNEW SOMETHING WAS WRONG WHEN MY GEAR WOULD NOT COME OUT OF PARK AND I HAD TO ENGAGE THE SHIFT RELEASE BUTTON. YESTERDAY MAY 6, 2014 I ARRIVED AT WORK AND I WANTED TO DROP SOME ITEMS OFF AT MY CLASSROOM THEREFORE I WAS GOING TO PARK CLOSE TO THE DOOR. I BRAKED AND WENT TO OR MY CAR IN PARK BUT WAS UNABLE TO DO SO. MY BUTTON ON MY SHIFT COULD NOT BE ENGAGED AND WITHOUT THE BUTTON ENGAGED THE CAR WOULD ONLY GO INTO NEUTRAL FROM DRIVE. I WAS ABLE TO DRIVE MY CAR BACK TO CLASSIC CHEVROLET IN SUGAR LAND, TX THAT HAD DONE MY REPAIRS TWO WEEKS PRIOR. THIS TIME I WAS TOLD BY THE SERVICE DEPARTMENT THAT THE SHIFT WAS BINDING IN THE TRANSMISSION. I NOW HAVE A NEW SHIFT BUT MY CONCERN NOW IS WHAT IS NEXT. I HAVE HAD THIS CAR FOR ONLY A YEAR NOW. YES IT IS USED BUT MY FIRST CAR A 2005 FORD FOCUS WAS USED AND DID NOT NEED REPAIRS LIKE THIS IN ONLY A YEAR. I HAVE TO KID'S AND NOW I AM CONSIDERING LETTING THIS CAR GO BECAUSE I DO NOT WANT TO END UP IN AN ACCIDENT IN THIS VEHICLE EVEN AFTER REPAIRS HAVE BEEN DONE.  *TR",
        "vin": "KL1TG56678B"
    },
    {
        "components": "SUSPENSION,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/08/2014",
        "dateOfIncident": "05/08/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10587306,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HEAR LOUD BANGS COMING FROM THE REAR SECTION OF THE VEHICLE AND TOOK IT TO A LOCAL MECHANIC. HE INFORMED ME THAT THE AXLE HOUSING BUSHINGS WERE WORN CAUSING MOVEMENT SIDE TO SIDE IN THE HOUSING. WHEN HE CALLED A DEALER TO PURCHASE BUSHINGS THE PARTS PERSON SAID HE COULD NOT SELL THE BUSHINGS BUT HAD TO SELL THE COMPLETE HOUSING BECAUSE THERE WERE PROBLEMS WITH THE PARTS AND IT WAS REDESIGNED. IF THEY KNEW ABOUT A DESIGN FLAW WHY DID THEY NOT ISSUE A RECALL FOR THE PARTS. ESTIMATED COST FOR NEW REAR AXLE IS $1,000.00 PLUS LABOR VERSES REPLACING BUSHING FOR AROUND $70.00 PLUS LABOR.  *TR",
        "vin": "KL1TD66608B"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/02/2014",
        "dateOfIncident": "05/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10586115,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SECOND TIME THAT THE HEADLIGHTS  WENT OUT WHILE I WAS DRIVING AT NIGHT.      CAR SMELLS LIKE SOMETHING IS  BURNING.  *TR",
        "vin": "KL1TD566788"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/30/2014",
        "dateOfIncident": "03/07/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10575686,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIR BAG LIGHT CAME ON AS THE CAR WAS GOING DOWN THE ROAD AND WILL NOT GO OFF.  *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/21/2014",
        "dateOfIncident": "06/09/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10574051,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS 2008 CHEVY AVEO. THE CONTACT STATED THE AIR BAG LIGHT CAME ON IN HER VEHICLE AND HAD CONTINUALLY  STAYED ON FOR A PERIOD OF TIME. THE CONTACT STATED THAT THIS FAILURE HAD FREQUENTLY REOCCURRED. THE CONTACT STATED THE VEHICLE SENSOR WAS REPLACED BUT FAILURE CONTINUED. THE CONTACT IS CONCERNED THAT IN THE EVENT OF A CRASH HER AIR BAGS WOULD NOT DEPLOY. THE MANUFACTURER HAD NOT BEEN CONTACTED.  THE FAILURE MILEAGE WAS 3,930.",
        "vin": "KL1TD66668B"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "03/04/2014",
        "dateOfIncident": "03/03/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10566988,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SEATBELT BUCKLE FROM THE REAR DRIVERS SIDE SEAT AND THE MIDDLE REAR SEAT CAME OFF THE ANCHOR.  THE SEATBELT DOES NOT SHOW ANY USER DAMAGE.  THE STITCHING THAT HOLDS THE SEATBELT TOGETHER CAME APART.  *TR",
        "vin": "KL1TD56678B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/31/2013",
        "dateOfIncident": "11/01/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10558021,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A PROBLEM WITH THE RED AIR BAG LIGHT, IT STAYS ON. IT NEVER GOES OFF.  *TR",
        "vin": "KL1TD56648B"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": true,
        "dateComplaintFiled": "10/08/2013",
        "dateOfIncident": "03/11/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10547174,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "IN MARCH THE VEHICLE SHUT COMPLETELY DOWN AND THE FAN BELT POPPED AND WRAP AROUND THE MOTOR AND HAD DAMAGED THE TIMER BELT.  TWO MONTHS LATER THE VEHICLE WAS DRIVEN TO THE POST OFFICE AND WHEN CRANKING IT UP TO LEAVE IT WOULDN'T START BECAUSE IT HAD SHUT DOWN AGAIN.  SEPTEMBER 27, 2013 THE VEHICLE SHUT DOWN THE STEERING WHEEL LOCKED UP AND COULDN'T BE GUIDED AND RAN INTO A FIRE HYDRANT.  *TR",
        "vin": "KL1TG56638B"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/16/2013",
        "dateOfIncident": "09/11/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10543909,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2008 CHEVROLET AVEO. THE CONTACT STATED THAT WHILE TRAVELING APPROXIMATELY 10 MPH, THE STEERING WHEEL SEIZED. THE VEHICLE WAS TOWED TO THE CONTACT'S RESIDENCE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE FAILURE MILEAGE WAS 26,000.     THE CONSUMER STATED THE VEHICLE WOULD NOT START. UPDATED 11/18/13",
        "vin": "KL1TD66678B"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/13/2013",
        "dateOfIncident": "09/11/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10543459,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG LIGHT CAME ON AND HAS NOT GONE OFF.  I HAVE HAD NOTHING BUT PROBLEMS OUT OF THIS VEHICLE.  MAR 2010, I TOOK THE VEHICLE IN TO THE DEALER FOR MAKING LOUD SCRUBBING NOISES WHEN TURNING.  I WAS TOLD IT WAS NOTHING.  OCT 2010 IT WAS ELECTRICAL PROBLEMS.  I HAD 19,300 MILES ON THE VEHICLE WHEN THE BRAKE LIGHTS WENT OUT AND CHECK ENGINE LIGHT WAS ON. OCT  2012, IT WAS ELECTRICAL PROBLEMS AND THE VEHICLE WOULD NOT START AT ALL.  I HAD 30,300 MILES ON THE VEHICLE AND IT COST 600.00 IN REPAIRS.  JUNE 2013 ,THE A/C WENT OUT. I HAD 34,000 MILES ON THE VEHICLE AND IT COST 573.00 TO REPLACE THE COMPRESSOR (FIRST AND ONLY TIME I WENT TO ANOTHER MECHANICS SHOP).  SEP 2013, THE AIRBAG LIGHT CAME ON.  GM WANTS 100.00 JUST TO RUN A DIAGNOSTIC TO TELL ME WHY IT'S ON.  MY GOODNESS, AS MANY TIMES AS I HAVE BROUGHT THE VEHICLE TO GM HAVEN'T I PAID ENOUGH IN DIAGNOSTICS?    THIS IS RIDICULOUS!  I AM NEVER BUYING ANYTHING WITH CHEVROLET WRITTEN ON IT AGAIN. I BELIEVE GM KNOWS WHAT IS WRONG WITH THIS VEHICLE.  IF I WASN'T ON A FIXED INCOME I WOULD GET RID OF IT.  *TR",
        "vin": "KL1TD566X8B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/09/2013",
        "dateOfIncident": "08/14/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10542654,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2008 CHEVY AVEO WITH APPROXIMATELY 27,000 MILES RECENTLY SHOWED THE AIRBAG LIGHT CONTINUALLY LIT.  I TOOK IT INTO THE LOCAL CHEVY DEALERSHIP AND THEY SAID THE DTC CODE WAS B2502 AT A COST OF $110 FOR DIAGNOSING IT.  HE CLEARED THE CODE AND THE LIGHT IS NOT LIT ANYMORE.  HE SAID HE HAD SEEN THIS BEFORE AND SAID THE LIGHT MIGHT COME BACK ON AND WANTED ME TO ORDER A CLOCK/PPS INDICATOR FOR $87.89 AND WITH LABOR, SHOP COSTS,AND  TAX WOULD TOTAL $266.15.  DO ALL CAR MANUFACTURES USE THE SAME DTC CODES?   I TOLD HIM I WOULD TAKE IT AS IT IS AND SEE IF THE LIGHT COMES ON IN THE FUTURE.  DOES THIS MAKE SENSE FOR THIS CODE?  *TR",
        "vin": "KL1TD56698B"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/19/2013",
        "dateOfIncident": "08/19/2013",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10536176,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS DRIVING ON THE 805 FREEWAY BETWEEN H ST AND L ST IN SAN DIEGO CALIFORNIA MY CAR STARTED TO SMOKE FROM THE ENGINE. I DECIDED TO PULL OVER TO LET MY CAR REST. THIS HAS NEVER HAPPENED TO ME BEFORE. WHEN I PULLED OVER  AT 10:09 AM THE SMOKE STARTED TO COME IN THROUGH THE AIR CONDITIONER. I THEN GOT OUT TO AVOID SMELLING THE SMOKE. WHEN I GOT OUT OF THE VEHICLE NOT EVEN A MINUTE LATER THE ENGINE CAUGHT FIRE. I CALLED 911 AND A FIRE TRUCK SHOWED UP AT 10:18AM. THE FLAMES DEVOURED THE WHOLE FRONT OF MY CAR, MY ENGINE, MY INTERIOR, MY VEHICLE IS COMPLETELY TOTALED. *TR",
        "vin": "KL1TD56648B"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/14/2013",
        "dateOfIncident": "08/14/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10535435,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE ON OUR WAY TO THE LOCAL MARKET,  GOING ABOUT 10 MILES AN HOUR, WE STARTED LEAVING ONE STORE TO THE NEXT...AS I PULL OUT TO THE LIGHT I START TO HEAR A RATTLE ..THEN A LOUD EXPLOSION UNDER THE HOOD..SPARKS AND FIRE SHOT OUT AND THE ENGINE DIED AND WE COASTED ABOUT 20 FEET AND PARKED IT.....I GET OUT AND LOOK UNDER THE HOOD..THE ENGINE HAD DROPPED 8 INCHES FROM THE FRAME AND IS MERELY 3 INCHES FROM THE CONCRETE ......THE ENGINE PULLEYS ARE PUSHED UP TO THE SIDE OF THE CAR AND I BELIEVE EVERYTHING ATTACHED TO THE ENGINE IS BENT ONE WAY OR ANOTHER AND WHEN IT DROPPED IT BUSTED THROUGH THE SUSPENSION!!!!  WE HAD IT TOWED TO CLARK'S AUTOMOTIVE IN HUNTINGTON WEST VIRGINIA 25703 (304-522-3876).       EVERYONE WE TALKED TO HAD NEVER SEEN THAT HAPPEN BEFORE!      THANK YOU!!  *TR",
        "vin": "KL1TG56698B"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/12/2013",
        "dateOfIncident": "08/11/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10534921,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CHEVROLET AVEO. THE CONTACT STATED THAT THE VEHICLE BECAME INVOLVED IN A CRASH WHILE TRAVELING 60 MPH AND THE AIR BAGS FAILED TO DEPLOY. THE DRIVER SUSTAINED LACERATIONS TO THE ARMS AND FACE. THE FRONT PASSENGER ALSO SUSTAINED LACERATIONS TO THE ARM.  A POLICE REPORT WAS NOT FILED. THE VEHICLE WAS NOT DIAGNOSED TO DETERMINE THE CAUSE OF THE AIR BAG FAILURE OR FOR REPAIRS. A POLICE REPORT WAS NOT FILED. THE MANUFACTURER WAS MADE AWARE OF THE INCIDENT. THE FAILURE MILEAGE WAS 86,705.",
        "vin": "KL1TD56658B"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/07/2013",
        "dateOfIncident": "05/25/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10515588,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS GOING 60-65 IN CARPOOL LANE OF FREEWAY WHEN MY HUSBAND, DRIVING, SAID HE LOST THE ABILITY TO ACCELERATE. THIS WAS WITHOUT WARNING. WE MANAGED TO CROSS 3 LANES AND EXIT THE FREEWAY AND HE LOST THE ABILITY TO STEER. THE CAR BROKE DOWN AT THE FIRST STOP LIGHT AND BEGAN SMOKING VERY HEAVILY. THE CAR SMOKED FOR 30-40 MINUTES AFTER THE ENGINE WAS ALREADY SHUT OFF. ALL I KEPT THINKING WAS 'THANK GOODNESS WE GOT OFF THE FREEWAY!'     APPARENTLY, ACCORDING TO THE MECHANIC WHICH WAS LATER CONFIRMED BY BULLETIN NO. 08-06-02-002B THE FAN SHROUD HAD BEEN RUBBING AGAINST THE RADIATOR CAUSING IT TO CRACK AND LEAK FLUID. IT OVERHEATED, MELTING AND DAMAGING MANY PARTS AND CAUSING US TO BREAK DOWN ON THE FREEWAY GOING 60+ MILES AN HOUR.  *TR",
        "vin": "KL1TG56658B"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/01/2013",
        "dateOfIncident": "06/15/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10514622,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTICED A CREAKING SOUND WHEN TURNING AND GOING OVER THE BUMPS COMING FROM THE FRONT SUSPENSION AREA.  TOOK IT TO THE DEALERSHIP AND THEY REPLACED THE SHOCKS AND STRUTS.  STILL HAVE THE NOISE.  NOW THE CAR IS OUT OF WARRANTY BUT IT STILL MAKE NOISE LOUDER THAN EVER. *TR",
        "vin": "KL1TD56698B"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/16/2013",
        "dateOfIncident": "10/06/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10508416,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CHEVROLET AVEO. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 70 MPH, THE VEHICLE DECELERATED INDEPENDENTLY AND THE ENGINE WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS MANEUVERED TO THE SHOULDER WHERE THE ENGINE WAS TURNED OFF. UPON RESTARTING, THE VEHICLE RESUMED NORMALLY FOR TEN MINUTES AND THE PROBLEM RECURRED SIX TIMES BEFORE ARRIVING AT THE CONTACT'S RESIDENCE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC FOR DIAGNOSIS AND THEY STATED THAT THE FAILURE WAS CONTRIBUTED TO THE THROTTLE POSITIONING SENSOR, CATALYTIC CONVERTER, AND ACCELERATOR PEDAL. IN 2010 THE SAME DEFECTIVE COMPONENTS WERE REPLACED UNDER SERVICE WARRANTY. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE PROBLEM. THE APPROXIMATE FAILURE MILEAGE WAS 52,973.",
        "vin": "KL1TD56638B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/24/2013",
        "dateOfIncident": "02/22/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10499876,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER AIR BAG LIGHT WILL NOT GO OFF.  *TR",
        "vin": "KL1TD66688B"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/02/2013",
        "dateOfIncident": "11/25/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10490700,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I BEGAN HEARING A \"THUD\" FROM UNDERNEATH THE CAR WHILE MAKING NEAR-90 DEGREE LEFT TURNS, AND OCCASIONALLY WHEN GOING OVER BUMPS AT SPEEDS FROM 5-25 MPH.  ON 11/25/2012 I WAS ASCENDING LEVEL AFTER LEVEL IN A PARKING RAMP, MAKING LEFT TURNS.  DURING MANY OF THE LEFT TURNS THE \"THUD\" NOISE WAS HEARD, AT ONE POINT I HEARD WHAT SOUNDED LIKE A PIECE OF METAL FALLING OFF THE REAR HALF OF THE CAR.  IT MADE NOISE AS IT BOUNCED AROUND THE UNDERSIDE OF THE CAR BEFORE FALLING OFF.  I STOPPED, GOT OUT, AND TRIED TO FIND WHAT HAD MADE THE NOISE BUT AFTER LOOKING AROUND IN THE IMMEDIATE AREA I COULDN'T FIND ANYTHING.  IN THE WEEKS AFTER THIS EVENT I NOTICED A SLIGHT WOBBLE OCCASIONALLY WHILE DRIVING THE CAR.  THE \"THUD\" NOISE WAS CONTINUING TO INCREASE IN FREQUENCY AND INTENSITY.  I DIDN'T FEEL THAT IT WAS SAFE TO DRIVE THE VEHICLE AS IT WAS NOW OBVIOUS THAT SOMETHING WAS NOT RIGHT IN THE STEERING OR SUSPENSION.  I WAS WORRIED THAT A TIE ROD WOULD COME LOOSE ON THE FREEWAY OR SOMETHING SIMILAR TO THAT.  I BROUGHT THE CAR TO MY MECHANIC FOR INSPECTION.  HE INFORMED ME THAT THE BUSHINGS HAD COMPLETELY RUSTED OUT ON THE REAR AXLE. THE AXLE WAS LOOSE AND MOVING AROUND WHILE DRIVING! IT WAS BEGINNING TO DAMAGE OTHER PARTS OF THE UNDER BODY.  HE WAS UNABLE TO LOCATE ANY REPLACEMENT BUSHINGS FROM PARTS STORES OR THE CHEVY DEALERSHIP.  THE ONLY WAY TO REPAIR THE DEFECTIVE BUSHINGS WAS TO COMPLETELY REPLACE THE REAR AXLE. MY MECHANIC INFORMED ME THAT THERE WERE PLENTY OF AXLES AVAILABLE IN STOCK FOR THIS REPAIR BUT NOT A SINGLE BUSHING.  THIS INDICATES THAT THIS IS NOT AN ISOLATED CASE, BUT THAT THERE IS A MUCH LARGER SAFETY ISSUE WITH THESE DEFECTIVE BUSHINGS ON MANY OTHER VEHICLES.  *TR",
        "vin": "KL1TG56668B"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/05/2012",
        "dateOfIncident": "11/03/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10483440,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CHEVROLET AVEO. THE CONTACT STATED THAT HE WAS NOT ABLE TO PASS STATE INSPECTION DUE TO THE HORN BEING DEFECTIVE. THE VEHICLE WAS TAKEN TO THE DEALER WHO WAS UNABLE TO REPAIR THE FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE WHO DID NOT OFFER ANY ASSISTANCE. THE VEHICLE WAS NOT REPAIRED.  THE VIN WAS NOT AVAILABLE. THE FAILURE AND CURRENT MILEAGE WAS 68,000.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/23/2012",
        "dateOfIncident": "11/12/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10481515,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CHEVROLET AVEO. THE CONTACT WAS DRIVING APPROXIMATELY 35 MPH, THE BRAKE PEDAL WAS ENGAGED WHEN APPROACHING A STOP AND THE ENGINE BEGAN TO REV. THE ENGINE WAS TURNED OFF AND UPON RESTARTING THE VEHICLE RESUMED NORMALLY. THE FAILURE OCCURRED FIVE DIFFERENT TIMES. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER AND HAD NOT BEEN DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE PROBLEM. THE APPROXIMATE FAILURE MILEAGE WAS 12,000.  UPDATED 12/06/12*LJ",
        "vin": "KL1TG566188"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/11/2012",
        "dateOfIncident": "10/05/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10479771,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I NOTICED MY DRIVER'S SIDE HEADLIGHT WAS OUT AND WIRES ATTACHED TO THE HEADLIGHT UNDERNEATH THE HOOD HAD BURNT OUT. THE NEXT DAY THE VEHICLE WOULD NOT  START AT ALL. I HAD IT JUMPED OFF AND HAD A DIAGNOSTIC RAN ON THE BATTERY. I WAS TOLD IT WAS NOT THE BATTERY BUT THE ALTERNATOR. THE NEXT DAY, I DECIDED TO TAKE THE VEHICLE TO A CHEVROLET DEALER SO I HAD IT JUMPED OFF AGAIN. INITIALLY, BOTH HEADLIGHTS CAME ON AND A MINUTE LATER; BOTH HEADLIGHTS WENT OUT. THE DEALER KEPT THE CAR TWO DAYS BEFORE TELLING ME SOCKETS MELTED, THE BATTERY WOULD HAVE TO BE REPLACED ALONG WITH BULBS AND WIRES. NEVER ONCE DID THEY MENTION THAT THERE WAS A PROBLEM WITH THE 2002-2008 CHEVY AVEO ELECTRICAL SYSTEM. THE DEALER INITIALLY WANTED TO CHARGE 1027.42 AND THEY SAID THEY HAD NO IDEA HOW THIS PROBLEM HAD OCCURRED. I ONLY HAD 30,300 MILES ON THE VEHICLE. THE DEALER LATER CHARGED ME 563..44 BUT THEY CUT MANY CORNERS. AFTER SOME INTERNET RESEARCH, I DISCOVERED THAT THESE TYPE OF PROBLEMS HAVE OCCURRED WITH THE CHEVY AVEO FOR YEARS! WHEN I CONTACTED GM, THEIR RESPONSE WAS THAT THE 3 YEAR WARRANTY HAD EXPIRED SO THERE WASN'T MUCH THEY COULD DO. GM DIDN'T EVEN MENTION THE ELECTRICAL SYSTEM PROBLEM!  *TR",
        "vin": "KL1TD566X8B"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/27/2012",
        "dateOfIncident": "08/01/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10477235,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER AIRBAG SENSOR MALFUNCTIONED, AND THE AIRBAG IS NO LONGER ENGAGED, WHICH IS INDICATED BY THE DRIVER AIR BAG LIGHT REMAINING ON WHILE THE ENGINE IS TURNED ON. THE DASH LIGHT, PASSENGER TAIL LAMP AND THE PASSENGER FOG LIGHT ALL STOPPED WORKING SIMULTANEOUSLY. PASSENGER TAIL LAMP DOESN'T WORK EVEN AFTER REPLACING THE BULBS, WHICH SUGGESTS THERE IS AN ELECTRICAL ISSUE.  *TR",
        "vin": "KL1TD66608B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/24/2012",
        "dateOfIncident": "09/22/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10476858,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CHEVROLET AVEO. THE CONTACT STATED THAT WHILE DRIVING 55 MPH, THE AIR BAG WARNING LAMP ILLUMINATED. THE VEHICLE WAS TAKEN TO THE DEALER WHO DIAGNOSED THAT THE CLOCK SPRING WAS DEFECTIVE, CAUSING THE AIR BAGS TO DEACTIVATE. AS A RESULT, THE CLOCK SPRING NEEDED TO BE REPLACED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND THE CURRENT MILEAGE WAS 46,000.  UPDATED 11/28/12*LJ  UPDATED 12/03/12",
        "vin": "KL1TD56698B"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/30/2012",
        "dateOfIncident": "04/01/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10473106,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR CONTINUALLY STALLS AND I WILL HAVE TO STOP AND RESTART IT OR IT WILL CONTINUALLY SURGE EVEN WHEN GAS IT NOT PUSHED.  I HAVE BEEN READING ONLINE FORUMS ON THIS CAR AND OVER AND OVER AND OVER AGAIN PEOPLE ARE REPORTING THE SAME EXACT THING!!  WHY IS NO ONE LOOKING INTO THIS!!  THE 07 WAS RECALLED FOR A FUEL LINE ISSUE I THINK WHATEVER THEY DID TO FIX IT CAUSED MORE PROBLEMS.  PLEASE PLEASE FOLLOW UP ON THIS IT IS NOT RIGHT!!  JUST GOOGLE THE 08 AVEO AND WILL SEE ALL THE COMPLAINTS PEOPLE ARE SAYING ABOUT THIS CAR!!     *TR  -JS",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/25/2012",
        "dateOfIncident": "04/22/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10456510,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY HUSBAND REAR ENDED A CAR DUE TO A CAR STOPPING SUDDINGLY AND THE ROADWAY WAS WET. THE AIRBAG DEPLOYED BUT THE OPENING IT CAME OUT OF SPLIT THE AIRBAG ON BOTH SIDES, SO IT DID NOT INFLATE PROPERLY.  *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/23/2012",
        "dateOfIncident": "04/16/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10456268,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG LIGHT STAYS ON.  CHECKED IT AND RECEIVED CODE B1448, WHICH REFERS TO A SENSOR ON THE PASSENGER SEAT.  THE PASSENGER SEAT RARELY IS USED AND NOW SENSOR IN SEAT IT NEEDS TO BE REPLACED FOR A COST OF 1000 + INSTALLATION.  *TR",
        "vin": "KL1TD566X8B"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/19/2012",
        "dateOfIncident": "10/05/2011",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10455733,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PARKED OUTSIDE WHERE MY HUSBAND WORKS, A FIRE OCCURRED IN THE DASHBOARD OF THE CAR.  THE HEAT WAS SO INTENSE, THE WINDSHIELD SHATTERED.  A GIANT HOLE - BIGGER THAN A BOWLING BALL WAS LEFT IN THE TOP OF THE DASHBOARD.  THE CAR WAS A TOTAL LOSS AND WE STILL HAD 23 PAYMENTS ON THIS CAR.  SINCE THE ELECTRICAL SYSTEM WAS DESTROYED, NO DIAGNOSTICS WERE RUN, AND NO ASSISTANCE WITH TRYING TO FIND OUT WHY THIS HAPPENED OR IF IT WAS DUE TO A MANUFACTURING ISSUE WAS OFFERED. PRIOR TO THIS, NOTHING INDICATED A PROBLEM.  I'M JUST GLAD WE WEREN'T DRIVING THE CAR AT THE TIME OR I MIGHT NOT BE HERE TO WRITE THIS.  UPDATED 05/17/12 *BF          *JS",
        "vin": "KL1TD66668B"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/04/2012",
        "dateOfIncident": "02/02/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10446683,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TRAVELING SE ON ENTRANCE ROAD. A CAR WAS STOPPED ON MY LEFT ON JEAN CHAPEL ROAD. THE DRIVER UNEXPECTEDLY PULLED DIRECTLY IN FRONT OF ME CREATING AN UNAVOIDABLE CRASH SITUATION. I PUMPED MY BRAKES HEAVILY AND ATTEMPTED TO SWERVE TO MISS THE VEHICLE BUT DO TO WET ROAD CONDITIONS AND MY SPEED (5MPH UNDER THE LIMIT), I COULD NOT AVOID SLAMMING INTO THE PASSENGER SIDE OF HER VEHICLE. THE PASSENGER IN THE OTHER CAR RECEIVED AMBULANCE RECOVERY. THE DRIVER WAS OBVIOUSLY STUNNED AND RECEIVED MEDICAL ATTENTION. MY AIR BAGS DID NOT DEPLOY, AND I SUBSEQUENTLY RECEIVED DIRECT STEERING WHEEL AND WINDSHIELD CONTACT. FIRST FAILURE AT APPROXIMATELY 25,000 MILES, PASSENGER WARNING AIRBAG MALFUNCTION.   *KB",
        "vin": "KL1TD66658B"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/31/2012",
        "dateOfIncident": "04/01/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10446066,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CHEVROLET AVEO. THE CONTACT STATED THAT WHILE DRIVING 40 MPH, THE VEHICLE INITIATED IN POWER DOWN MODE.  THE CONTACT MENTIONED THAT THE FAILURE RECURRED SEVERAL TIMES AND AT TIMES, WOULD CAUSE THE VEHICLE TO STALL. THE VEHICLE WAS TAKEN TO THE DEALER WHO DIAGNOSED THAT THE THROTTLE BODY WAS DEFECTIVE AND NEEDED TO BE REPLACED. THE REMEDY FAILED TO REPAIR THE PROBLEM. THE VEHICLE WAS TAKEN BACK TO THE DEALER THREE TIMES WHERE THEY AGAIN, REPLACED THE THROTTLE BODY AS WELL AS THE SPARK PLUGS AND THE O2 SENSOR. THE REPAIRS FAILED TO REMEDY THE PROBLEM. THE VEHICLE WAS TAKEN TO THE DEALER A THIRD TIME WHO WAS NOT ABLE TO DETERMINE WHAT WAS CAUSING THE FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE WHO DID NOT OFFER ANY ASSISTANCE. THE VEHICLE WAS NOT FURTHER REPAIRED. THE FAILURE MILEAGE WAS 45,000 AND THE CURRENT MILEAGE WAS 85,000.",
        "vin": "KL1TD66678B"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/24/2012",
        "dateOfIncident": "12/23/2011",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10445115,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CHEVROLET AVEO. THE CONTACT WAS NOTIFIED THAT HIS VEHICLE WAS ON FIRE. THE FIRE DEPARTMENT REPORTED TO THE SCENE AND A FIRE REPORT WAS FILED AND THE VEHICLE WAS TOWED TO AN AUTO BODY SHOP. THE CAUSE OF THE FIRE WAS UNKNOWN BUT ORIGINATED IN THE ENGINE. THE VIN WAS NOT AVAILABLE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 77,000.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/18/2011",
        "dateOfIncident": "07/01/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10414328,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE PURCHASE OF MY 2008 CHEVY AVEO I HAVE EXPERIENCED STRANGE AND INCONSISTENT ELECTRICAL ISSUES.  I AM NO LONGER DRIVING THE CAR, AND GM NEVER FIGURED OUT THE CAUSE OF THE ISSUE.  I WOULD LIKE AN INVESTIGATION THAT WOULD LEAD TO YOU GUYS TAKING THE CAR, FINDING THE CENTRAL ISSUE (BECAUSE NOBODY CAN) TO FIND OUT IF IT IS WORTHY OF A NATIONAL RECALL!",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/13/2010",
        "dateOfIncident": "12/18/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10360346,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 CHEVROLET AVEO. THE CONTACT NOTICED A RUMBLING SOUND IN THE FRONT END OF THE VEHICLE AS IF SOMETHING WERE LOOSE. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER FOUR TIMES BUT DESPITE REPAIRS AND ADJUSTMENTS TO THE TIRES, RIMS AND BRAKE PADS, THE FAILURE CONTINUED. THE MANUFACTURER WAS NOT NOTIFIED. THE CURRENT MILEAGE WAS APPROXIMATELY 32,000. THE FAILURE MILEAGE WAS APPROXIMATELY 20,000.",
        "vin": "KL1TG56618B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/03/2010",
        "dateOfIncident": "09/01/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10353789,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING DOWN THE HIGHWAY, AND THE RED AIRBAG MALFUNCTION LIGHT CAME ON. I PULLED OVER, SHUT OFF THE CAR AND RESTARTED IT, THE LIGHT TURNED OFF, STAYED OFF FOR ABOUT 30 MINS, AND THEN CAME BACK ON, AND IS NOW ON STEADY EVERY TIME THE CAR IS RUNNING. I HAVE ALSO HAD PROBLEMS WITH THE SENSOR IN THE PASSENGER SEAT NOT REGISTERING A PASSENGER SITTING IN THE SEAT, AND THE PASSENGER AIRBAG OFF LIGHT STAYS ON. *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/06/2010",
        "dateOfIncident": "08/04/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10347588,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2008 CHEVY AVEO. UPON DRIVING TO WORK MY AIRBAG LIGHT CAME ON FOR NO REASON AND WILL NOT GO OFF. I CALLED MY DEALERSHIP AND THEY ADVISED ME MY AIRBAG NEEDS TO BE \"SERVICED\". SINCE MY VEHICLE MILEAGE IS 38K AND JUST OUT OF THE BUMPER TO BUMPER WARRANTY THEY REFUSE TO GUARANTEE ME THERE WILL NOT BE A FEE FOR DIAGNOSING AND FIXING THE PROBLEM. I THAN CALLED GM AND THEY ADVISED ME TO HAVE THE CAR DIAGNOSED AT A DEALERSHIP AND IF THERE IS A DEFECT I WOULD HAVE TO PAY FOR THE DIAGNOSIS AND REPAIR AND THEY WOULD REIMBURSE ME. THIS IS INSANE! THIS IS A SAFETY FEATURE JUST LIKE A SEATBELT AND THE MAKER SHOULD BE RESPONSIBLE FOR SAFETY FEATURES THAT ARE OBVIOUSLY DEFECTIVE! *TR",
        "vin": "KL1TD56618B"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "06/16/2010",
        "dateOfIncident": "04/01/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10336600,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CHEVROLET AVEO. WHILE DRIVING AT  APPROXIMATELY 60 MPH, THE HOOD OF THE VEHICLE POPPED OPEN BUT DID  NOT DISCONNECT FROM THE VEHICLE. THE VEHICLE WAS NOT TAKEN TO AN  AUTHORIZED DEALER TO BE EXAMINED FOR THE CAUSE OF FAILURE BUT THE CONTACTS INSURANCE COMPANY REPLACED THE HOOD. APPROXIMATELY ONE YEAR LATER, THE FAILURE RECURRED. THE VEHICLE WAS NOT TAKEN IN TO BE EXAMINED FOR THE CAUSE OF FAILURE OR REPAIRS. THE FAILURE MILEAGE WAS 20,000 AND THE CURRENT MILEAGE WAS 43,000.",
        "vin": "KL1TD56628B"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "05/25/2010",
        "dateOfIncident": "05/21/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10332253,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2008 CHEVY AVEO IN MAY OF 2008 I HAVE HAD PROBLEM WITH FRONT END VIBRATION AND PULLING TO THE LEFT. I STARTED REPORTING THE PROBLEM AUG. 08. THEY ROTATED TIRES AND THAT SHOULD SOLVE THE PROBLEM. AGAIN I TOOK IT TO THE DEALER OCT. 2008, MAR. 2009,AND THEN AGAIN JULY, 2009. THEY TOLD ME ONCE AGAIN THAT TIRES NEEDED ROTATED AND FRONT IN ALIGNMENT. I STORED THE CAR FOR THE WINTER OCT. 2009  TO APRIL, 2010. I NOW HAVE TAKEN BACK FOR THE SAME PROBLEM. THEY NOW TELL ME IT HAS TO BENT RIMS WITH NO SIGN OF DAMAGE. THEY JUST WON'T SPIN OUT TRUE WHEN THEY ARE PUT ON MACHINE. THIS VEHICLE HAS NEVER BEEN IN ANY TYPE OF ACCIDENT. TIRES ARE WORN OUT WITH 20,000 MILES ON IT. I DID SOME INVESTIGATING AND OTHERS ARE COMPLAINING THAT THEY HAVE HAD TO REPLACE RIMS. TALK TO ANOTHER DEALERSHIP ABOUT THIS PROBLEM AND THEY TOLD ME THAT THESE STEEL RIMS ON AVEO BEND EASILY AND HAVE REPLACED ALOT OF THEM. TALK TO GM ABOUT THIS AND TOLD THEM WHAT I HAD FOUND OUT. THEY WILL NOT REPLACE THEM. TALK WITH OTHER DEALERSHIP SERVICE MANAGER AND HE STATED THAT THEY WON'T BECAUSE THEY WOULD HAVE TO ADMIT THEY KNOW THEY HAVE A PROBLEM WITH THESE RIMS. CALL GM AGAIN TALKED TO THEM ABOUT THIS PROBLEM AND THE GUY AT GM STATED I DON'T CARE HOW MANY COMPLAINTS THERE ARE NHTSA HAS NOT ISSUED A RECALL. I HOPE THAT YOU WILL TAKE A CLOSE LOOK AT THIS COMPLAINT. I TRULY BELIEVE GM KNOWS THAT THEY HAVE A PROBLEM AND WON'T DO  ANYTHING BECAUSE THESE VEHICLES WERE MANUFACTURED IN SOUTH KOREA. *TR",
        "vin": "KL1TD666X8B"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/15/2010",
        "dateOfIncident": "02/12/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10319629,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING AND MADE A LEFT TURN CAR STARTED SHAKING THEN WOULD NOT ACCELERATE ABOVE 15 MPH. *TR",
        "vin": "KL1TD66648B"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/12/2010",
        "dateOfIncident": "02/12/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10310083,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "LOSS OF POWER STRANDED ON THE HIGHWAY. HAS JUST ENOUGH POWER TO GET YOU OFF OF THE ROAD. *TR",
        "vin": "KL1TD56698B"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/10/2010",
        "dateOfIncident": "02/07/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10308524,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 CHEVY AVEO - ON 9/4/2009 TRANSMISSION 5TH GEAR FORK BROKE WHILE DRIVING ON FREEWAY (MECHANIC LATER TOLD ME FORK IS MADE OF ALUMINUM).  DEALERSHIP REPLACED UNDER WARRANTY WITH SIMILAR ALUMINUM PART.     ON 2/7/2010 2008 CHEVY AVEO MOTOR MOUNT SHEARED WHEN STARTING OUT FROM INTERSECTION.  ENGINE AND TRANSMISSION DROPPED JUST ENOUGH TO STALL CAR AND COULD NOT START OR PUT IN NEUTRAL GEAR TO PUSH VEHICLE OUT OF INTERSECTION. *TR",
        "vin": "KL1TD66658B"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/25/2010",
        "dateOfIncident": "03/10/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10302254,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR IS VERY UNSTABLE ON HIGHWAY AT SPEEDS ABOVE 50 MPH. THE CAR HAS HAD A VIBRATION SINCE NEW AT 45MPH. OR SO BALANCE TIRES CHECK RIMS TURN DOWN ROTOR  STILL A PROBLEM AT 31,000 MILES CAR IS GOING ON SECOND SET OF ROTORS AND BRAKE LININGS WITH PROBABLY 4 ROTOR TURN DOWNS. *TR",
        "vin": "KL1TD56608B"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": true,
        "dateComplaintFiled": "12/22/2009",
        "dateOfIncident": "12/19/2009",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10296724,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 CHEVROLET AVEO.  WHILE DRIVING APPROXIMATELY 50 MPH THE DRIVER STRUCK A DEER IN THE ROADWAY.  THE VEHICLE SPUN OUT OF CONTROL.  HE THEN GAINED VEHICLE CONTROL, AND PULLED OVER TO THE SIDE OF THE ROAD AND EXITED THE VEHICLE.   SUDDENLY, THE  VEHICLE ENGULFED INTO FLAMES WITHOUT WARNING.  THE FIRE DEPARTMENT AND POLICE WERE CALLED TO THE SCENE.  THERE WAS MINOR INJURY SUSTAINED.  THE VEHICLE WAS COMPLETELY DESTROYED.  THE VEHICLE WAS TOWED TO A COLLISION CENTER.  THE CAUSE OF FAILURE HAS NOT BEEN DETERMINED AT THIS TIME.  THE FAILURE AND CURRENT MILEAGES WERE 36,000.",
        "vin": "KL1TD66658B"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/02/2009",
        "dateOfIncident": "11/29/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10294279,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SISTER RECENTLY CUT HER HAND WHEN SHE GRABBED THE INSIDE DOOR HANDLE ON MY 2008 CHEVROLET AVEO. WHEN WE LOOKED CLOSER AT THE HANDLE, IT APPEARS TO BE SEPARATING AT THE TOP JOINED SEAMS. IT HAS A VERY SHARP EDGE TO IT SIMILAR TO THE LID OF A PULL TOP CAN. I DON'T TRANSPORT MANY PEOPLE SO I WAS NOT AWARE OF IT'S CONDITION. I'M GLAD THAT THE INCIDENT DID NOT INVOLVE A CHILD BECAUSE THEY COULD HAVE SUSTAINED A SERIOUS CUT. I HAVE NOT HAD ANY WRECKS OR DAMAGE TO MY CAR TO RESULT IN THE DOOR HANDLE SEPARATING. I FELL THIS IS A SERIOUS ENOUGH SITUATION TO WARRANT REPORTING. I'VE ALSO HAD PROBLEMS WITH THE AIRBAG LIGHT CONSISTENTLY MALFUNCTIONING. IT'S BEEN SUPPOSEDLY FIXED TWICE..BUT IT STILL MALFUNCTIONS. *TR",
        "vin": "KL1TD56668B"
    },
    {
        "components": "ELECTRICAL SYSTEM,INTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/11/2009",
        "dateOfIncident": "05/18/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10291907,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CHEVY AVEO 2008 BOUGHT BRAND NEW  IN MAY 18 2009 STILL UNDER WARRANTY WHEN I BOUGHT THE CAR THERE WAS A DEFECT IN IT AND THE CAR SALESMAN DID NOT REPORT IT TO US WHEN WE BOUGHT THE CAR.   THE FAILURE IS THE INSTRUMENT PANEL AND SHIFTER INDICATOR LIGHTS ARE NOT WORKING.  I CAN NOT SEE AT NIGHT HOW FAST I AM GOING, CAN'T SEE MY GAUGES, OR WHEN I AM SHIFTING INTO DRIVE ETC.  I FEEL IT IS VERY UNSAFE ESPECIALLY DRIVING AT NIGHT.  I DID READ THAT CHEVY AVEO HAVE ELECTRICAL PROBLEMS WHICH I DID NOT KNOW UNTIL AFTER BUYING THE CAR. THE CONSEQUENCES OF THE FAILURE IS THAT IT IS UNSAFE AND IT WILL NOT PASS SAFETY INSPECTION HERE IN THE STATE OF HAWAII.  THE FAILURE TO FIX THE NEEDED REPAIR CAN RESULT IN AN ACCIDENT AND BE DANGER TO OTHERS.        CORRECT THE PROBLEM......I REPORTED IT TO THE SALESMAN ON MAY 20 AND WAS REFERRED TO SERVICE THE CAR.  THE DEALERSHIP CLOSED DOWN AND 2 MONTHS LATER THE SERVICE DEPT. OPEN.  THE WRONG PART WAS ORDERED AND IT IS OVER 3 MONTHS THE CAR STILL NOT FIXED...THE SERVICE DEPT WILL CLOSE DOWN THIS FRIDAY ON NOV. 13 2009.  I HAVE BEEN IN CONTACT WITH COSTUMER ASSISTANCE SEVERAL TIMES AND THE SERVICE DEPT LOCALLY BUT THEY CAN'T DO ANYTHING AS IT MIGHT TAKE SEVERAL MONTHS OR A YEAR NO TIME FRAME ACCORDING TO CUSTOMER ASSISTANCE FROM GMC.  PLEASE LET ME KNOW WHAT TO DO.  THANK YOU. *TR",
        "vin": "KL1TD56618B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/30/2009",
        "dateOfIncident": "08/01/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10290408,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2008 CHEVROLET AVEO. SINCE YEAR 2008  THE PASSENGER FRONTAL AIR BAG WARNING LIGHT REMAINED ILLUMINATED ON THE INSTRUMENT CONTROL PANEL.  THE VEHICLE WAS TAKEN TO THE DEALER TWICE, AND THE PASSENGER SEAT WAS REPLACED UNDER WARRANTY.  RECENTLY THE DRIVERS FRONTAL AIR BAG FAILED HAS FAILED. THE DEALER WANTED TO CHARGE $95.00 DOLLARS TO DIAGNOSE THE FAILURE.  THE FAILURE MILEAGE WAS 3600 AND THE CURRENT MILEAGE WAS 69,400.",
        "vin": "KL1TD56648B"
    },
    {
        "components": "STRUCTURE,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "10/01/2009",
        "dateOfIncident": "09/30/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10285906,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "PRESENT PROBLEM:    2008 CHEVROLET AVEO    ON 09/30/2009, I CUT A FINGER ON MY LEFT HAND TRYING TO OPEN THE DOOR TO GET OUT OF MY CAR.  A BREAK IN 'SILVER COATING MATERIAL' ON HANDLE WAS WHAT CAUSED THE CUT. I WAS THE DRIVER OF THE VEHICLE, SO THAT YOU WILL KNOW THE BAD HANDLES WILL BE ON THE LEFT SIDE OF THE CAR.  EITHER THE DRIVER OR THE PASSENGER BEHIND THE DRIVER, AS THESE TWO HANDLES ARE PROBABLY FORMED IN THE SAME TYPE MOLD.  MY FINGER WAS BLEEDING AND STINGING IN CUT AREA.  I HAVE HAD TO TAPE THE HANDLE OF THE CAR TO USE IT TO GET OUT NOW.  CUT CAME AS TOTAL SURPRISE. ARE OTHER PEOPLE DRIVING THIS CAR GETTING THEIR FINGERS CUT TOO? *TR",
        "vin": "KL1TD56608B"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/27/2009",
        "dateOfIncident": "06/08/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10278466,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 CHEVROLET AVEO.  THE CONTACT STATED THAT THE BRAKES WERE WARPED ON HER VEHICLE.  THE DEALER PERFORMED AN ALIGNMENT AND TURNED THE ROTORS, BUT NEVER CHANGED THE BRAKE PADS.  THE REPAIRS COST $50.  CURRENTLY, THE VEHICLE IS SHAKING VIOLENTLY.  THE MANUFACTURER HAS NOT BEEN NOTIFIED.  THE FAILURE MILEAGE WAS 7,928.  UPDATED 08/28/09. *LJ  THE REAR DRUMS NEEDED TO BE REPLACED AS WELL. UPDATED 09/02/09.*JB",
        "vin": "KL1TD66638B"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": true,
        "dateComplaintFiled": "06/24/2009",
        "dateOfIncident": "05/26/2009",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10274795,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "LIGHT FRONT-END IMPACT RESULTED IN ENGINE FIRE. *TR",
        "vin": "KL1TD56698B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/16/2009",
        "dateOfIncident": "04/28/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10268891,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HELPED OUR DAUGHTER, WHO IS IN COLLEGE, PURCHASE HER FIRST AUTOMOBILE. WE WENT TO AUTOWORLD IN PETALUMA, SPECIFICALLY PETALUMA HYUNDAI (OWNED BY AUTOWORLD). THIS MEANS, IF YOU WALK INTO HYUNDAI, IT DOESN'T REALLY MEAN ANYTHING BECAUSE THE SALESPERSON CAN SELL YOU A CAR FROM ANY OF THEIR OTHER DEALERSHIPS. IN OUR CASE, WE WERE SOLD 2008 CHEVROLET AVEO, WHICH WAS PREVIOUSLY A RENTAL CAR WITH FACTORY WARRANTY STILL LEFT ON IT. WE BOUGHT AN EXTENDED WARRANTY, AS WE EXPLAINED TO OUR SALESPERSON; THAT SINCE OUR DAUGHTER WAS IN COLLEGE, AND WORKING PART TIME, SHE COULD AFFORD HER PAYMENT, NORMAL MAINTENANCE/ VEHICLE COSTS; HOWEVER, SHE NEEDED TO HAVE COVERAGE FOR MAJOR REPAIR PROBLEMS IF THEY AROSE. UNFORTUNATELY, THE AIRBAG COMPUTER SYSTEM IS HAVING PROBLEMS FOR THE SECOND TIME NOW AND VICTORY CHEVROLET SAYS THE COST TO REPAIR IS $2,600.00. OK, THE EXTENDED WARRANTY SHOULD COVER THAT, RIGHT? NO. APPARENTLY, THE WARRANTY WE WERE SOLD DOESN'T COVER AIRBAGS. VICTORY CHEVROLET CONTACTED THE FACTORY DISTRICT SERVICE MANAGER TO ASK FOR ASSISTANCE, SINCE THE VEHICLE WAS SO NEW AND IT WAS ONLY DUE TO THE FACT, THAT THE CAR HAD EXCEED THE 36,000 MILE FACTORY WARRANTY. CHEVROLET TOLD VICTORY THAT IT WOULD HAVE BEEN POSSIBLE IF WE WERE THE FIRST BUYERS, BUT SINCE WE WERE THE SECOND OWNERS THEY WOULD NOT HELP. SO THEN THE QUESTION IS; IS IT A PRODUCT WARRANTY? OR, IS IT A BUYER WARRANTY? WE WERE TOLD IT IS A PRODUCT WARRANTY. WE DID A CHECK ON THE NHTSA WEB SITE AND ACCORDING TO THE NATIONAL HIGHWAY TRAFFIC SAFETY ADMINISTRATION; THERE HAVE BEEN NUMEROUS PROBLEMS WITH THE AIRBAG SYSTEM OF THIS MAKE AND MODEL OVER NUMEROUS YEARS. IT WOULD APPEAR THAT CHEVROLET IS WELL AWARE OF THE PROBLEM; HOWEVER, THE COMPANY IS TAKING A MINIMALIST APPROACH TO THE PROBLEM, IN THE HOPE THE WARRANTY EXPIRES; SO THE BURDEN WILL FALL TO THE VEHICLE OWNERS. NOR, HAS THE DEALERSHIP'S MANAGEMENT REALLY MADE ANY GOOD FAITH EFFORT STRONG ASSERTIONS TO CHEVROLET ON OUR BEHALF. *TR",
        "vin": "KL1TD56608B"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,POWER TRAIN,TIRES",
        "crash": false,
        "dateComplaintFiled": "05/05/2009",
        "dateOfIncident": "02/20/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10267810,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Kumho Tire Co., Inc.",
                "productMake": "KUMHO",
                "productModel": "KUMHO",
                "productYear": "9999",
                "size": "P195/55R15",
                "type": "Tire"
            }
        ],
        "summary": "I BOUGHT A 2008 CHEVROLET AVEO LS BRAND NEW. REAR DRUMS OF BACK BRAKE REPLACED AT 4,000 MILES. ROTORS TURNED AT 3,000 MILES ROTORS TURNED DOWN AT 14,000MILESS. ROTORS TURNED AT 22,000MILES ROTORS REPLACED AT 7,500 MILES . ROTORS /BRAKE SHOES NEEDING REPLACED AT 23,500 MILES  TIRES WORE OUT AT 14,000 MILES  DEALER SAID LACK OF ROTATION. SHOWED DOCUMENTATION ON ROTATION/BALANCE BECAUSE BALANCE WAS AN ISSUE EVERY 1,000 MILES OR SO. DEALER SAID NO DEFECT FOUND TIRE MANUFACTURE WOULDN'T REPLACE, NEITHER WOULD CHEVY BRAND NEW TIRES AT 15,500 MILES MY COST!!! VALVEPAN GASKET NEEDING REPLACED 20,000 MILES. *TR",
        "vin": "KL1TD56608B"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "01/20/2009",
        "dateOfIncident": "12/12/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10255717,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY GRANDDAUGHTER WAS INVOLVED IN AN MVC IN FLORIDA.  SHE WAS EXITING ON AN INTERSTATE RAMP AND FAILED TO LEAVE ROOM FOR ANOTHER STOPPED VEHICLE RESULTING IN A FRONT END/REAR END CRASH.  THE AIR BAGS FAILED TO DEPLOY AND HER SEAT BELT DID NOT FULLY RESTRAIN HER, RESULTING A  FRACTURED STERNUM (3 PLACES).  SHE AS BEEN RECOVERING EVER SINCE AND NEITHER THE AUTO REPAIR SHOP NOR THE CHEVROLET DEALER HAS BEEN ABLE OR WILLING TO FIND OUT WHY THESE SYSTEMS FAILED. *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION,ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/11/2009",
        "dateOfIncident": "05/01/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10254672,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED NEW 2008 AVEO IN APRIL 2007 WHICH HAS EXCESSIVE VIBRATION. I TOOK INTO DEALERSHIP AND WAS ADVISED IT WAS DUE TO THE AC CAUSING EXTRA WORK FOR THE MOTOR. SINCE IT WAS SUMMER TIME I WENT ON MY WAY AND DEALT WITH THIS VIBRATION (WHICH ONLY HAPPENS WHILE IN DRIVE) IT IS NOW JANUARY AND NO AC IS BEING USED. I TOOK THE CAR BACK IN TO THE DEALERSHIP AND WAS TOLD YES THERE IS EXCESSIVE VIBRATION AND WE WILL LOOK INTO IT 4 HOURS LATER THEY CALLED TO LET ME KNOW THEY CANNOT FIND THE PROBLEM AND EVEN CONTACTED THE GM ADVISORS AND ARE ALL IN AGREEMENT WITH THIS ISSUE HOWEVER SINCE THERE IS NOT SERVICE BULLETIN OR RECALL REGARDING THIS I WILL HAVE TO JUST DEAL WITH IT AND WAIT AND SEE IF SOMETHING COMES UP WITH A FIX. I CANNOT BELIEVE I AM HAVING TO JUST DEAL WITH A BRAND NEW CAR WITH ISSUES...THIS CAR HAS BEEN TAKEN IN SEVERAL TIMES ALREADY..SHIFTER LOCKED UP AND WOULD NOT MOVE FROM PARK SO THEY REPLACED THAT...THEN CAR DIES ON HWY AND WAS TOWED INTO THE DEALERSHIP HAD TO FIX SOMETHING THAT HAD TO DO WITH THE THROTTLE, PAINT IN NOW PEELING AND ONLY HAS 11,000 MILES ANY HELP WOULD BE GREAT. *TR",
        "vin": "KL1TD56658B"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/29/2008",
        "dateOfIncident": "12/11/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10253044,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 CHEVROLET AVEO.  WHILE AT A GAS STATION, THE CONTACT NOTICED THAT THE FRONT DRIVER'S SIDE TIRE WAS COVERED IN BRAKE DUST.  AFTER LEAVING THE GAS STATION, DRIVING APPROXIMATELY 70 MPH, ANOTHER VEHICLE SWITCHED LANES IN FRONT OF HIM.  THE CONTACT APPLIED PRESSURE TO THE BRAKES AND THE FRONT END OF THE VEHICLE BEGAN SHAKING ROUGHLY.  THE VEHICLE WAS DRIVEN TO HIS RESIDENCE.  THE DEALER FROM WHERE THE VEHICLE WAS PURCHASED IS OUT OF BUSINESS.  THE MANUFACTURER OFFERED TO CORRECT THE FAILURE.  THE CURRENT AND FAILURE MILEAGES WERE 14,733.    UPDATED 03-06-09 *BF   THE FRONT ROTORS WERE OUT OF ROUND. THE REAR BRAKES PULSATED AND VIBRATED. THE SECOND REPAIR, THE CONSUMER RECEIVED NEW BRAKE PADS AND BOOSTER. THE DRUMS AND SHOES WERE ALSO REPLACED. UPDATED 03/10/09. *JB",
        "vin": "KL1TD56638B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/22/2008",
        "dateOfIncident": "06/25/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10252521,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 CHEVROLET AVEO.  WHEN THE VEHICLE WAS PURCHASED IN JUNE OF 2008, THE CONTACT NOTICED THAT THE FRONT PASSENGER SIDE AIR BAG INDICATOR REMAINED ILLUMINATED.  HE TOOK THE VEHICLE TO THE DEALER FOUR TIMES AND THEY STATED THAT THE FAILURE WAS DUE TO THE AIR BAG SYSTEM BEING UNHOOKED.  THE DEALER HOOKED THE SYSTEM BACK, BUT THE FRONT DRIVER AND PASSENGER AIR BAG INDICATORS CURRENTLY REMAIN ILLUMINATED.  HE TOOK THE PASSENGER WITH HIM TO THE DEALER, BUT THEY WERE UNABLE TO RETRIEVE A DIAGNOSTIC CODE FOR THE FAILURE.  THE DEALER WAS UNABLE TO DETERMINE THE CAUSE OF THE FAILURE ; HOWEVER, THEY WILL ORDER THE AIR BAG SEAT SENSOR.  THE VEHICLE HAS NOT BEEN REPAIRED.  THE VIN WAS UNKNOWN.  THE FAILURE MILEAGE WAS 3,000 AND CURRENT MILEAGE WAS 6,500.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "10/27/2008",
        "dateOfIncident": "10/20/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10246867,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MONDAY OCTOBER 20, 2008 I WAS INVOLVED IN AN AUTOMOBILE ACCIDENT, THAT I BELIEVE WAS DIRECTLY RELATED TO FAULTY BRAKES.  ON TWO PRIOR OCCASIONS, DIFFERENT LOCAL CHEVROLET DEALERSHIPS WERE CONTACTED.  ON THE 2ND VISIT TO THE DEALERSHIP, THEY STATED THAT THE REAR BRAKES WERE NEVER \"ADJUSTED\" WHEN THIS VEHICLE WAS PURCHASED, AND MADE AN ADJUSTMENT.  THEY STATED THAT THE FRONT BRAKES WERE \"GLAZED\" DUE TO THE PRESSURE ON THEM, AND NOT EQUAL PRESSURE ON ALL FOUR BRAKES.  THEY STATED THEY CLEANED THE FRONT BRAKES THE BEST THEY COULD.  THE BRAKES NEVER SEEMED TO BE COMPLETELY CORRECTED--MOST NOTICEABLE WHEN THE ENGINE WAS \"COLD\".  THE PROBLEM WAS ERRATIC.  PUMPING THE BRAKES PRIOR TO DRIVING BECAME A NECESSITY.  THE ACCIDENT OCCURRED ON DRY ASPHALT, WHEN THE BRAKES DID NOT FUNCTION PROPERLY.  THE 2008 CHEVROLET AVEO (APPX 5650 TOTAL MILES) COULD NOT MAKE A COMPLETE OR IMMEDIATE STOP WITH THESE BRAKES.  A STOPPED PICKUP TRUCK WAS HIT IN THE REAR.  NO INJURIES WERE REPORTED AT THE SCENE.  BY NM LAW, A POLICE REPORT IS ONLY REQUIRED IF THERE IS A REPORTED INJURY.  SINCE BOTH DRIVERS EXCHANGED INFORMATION, AND DECIDED TO LEAVE THE SCENE ON THEIR OWN, NO IMMEDIATE REPORTS WERE FILED UNTIL OCTOBER 24, 2008.  ON OCTOBER 25, 2008 AN INDEPENDENT INSPECTION WAS COMPLETED BY JUST BRAKES, IN ALBUQUERQUE, NM.  THE STATIC TEST FAILED THE FIRST TWO TIMES WHEN THE VEHICLE WAS COLD.  A GOOD POSSIBILITY THAT THERE IS AN ERRATIC PROBLEM WITH THE VACUUM BOOSTER. *TR",
        "vin": "KL1TG56618B"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/05/2008",
        "dateOfIncident": "06/28/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10241118,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED ON 6/14/08 WITH 272 MILES, ABOUT 2 WKS LATER, TIRE PRESSURE LIGHT COMES ON AND STAYS ON, CHECK TIRES THEY ARE OK, CALL DEALER, WAS TOLD TO BRING IT IN, TOOK ON 7/17/08 TO DEALER, SERVICE DEPT CHECK AND FOUNT THE SENSOR OPEN, REPAIR SHEET SAYS THEY REPLACED SENSOR 5.890 AND ORDERED MODULE. WAITED FOR THEM TO CALL ME, I CALLED ON 8/13/08 THEY HAD THE PART IN FOR WKS BUT HAD NOT CALLED, TOOK BACK IN ON 8/20/08 AND REPAIR SHEET STATES THE THEY FOUND THE TIRE SENSOR MODULE OPEN AGAIN AND REPLACED THE TIRE SENSOR MODULE 5.890. ALL WORK WAS DONE UNDER WARRANTY, BUT THIS HAS NOT FIXED THE PROBLEM. NOW THE SENSOR LIGHT DOESN'T STAY ON ALL THE TIMES, BUT IF YOU HAVE TO SIT IN TRAFFIC AND IDLE THAN THE LIGHT COMES ON AND STAYS ON UNTIL YOU TURN THE CAR OFF AND RESTART IT. ALSO, THE SALESMAN SAID IT WOULD GET 38 MPG AND I'M LUCKY TO GET 27-29 MPG. AFTER THE NEXT VISIT TO THE DEALER FOR THIS SENSOR AND I WILL CONTACT THE STATE OF NC ABOUT THIS CAR BEING A LEMON.  *TR",
        "vin": "KL1TD56698B"
    },
    {
        "components": "POWER TRAIN,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/04/2008",
        "dateOfIncident": "07/05/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10236865,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ABOUT 300 HUNDRED MILES AGO NOW 2008 CHEVY AVEO LT WITH 1740 MILES AS OF NOW AND STILL DRIVING. MY WIFE AND I FEELING A VIBRATIONS ON THE CAR EVERY TIME WE STOP AT THE TRAFFIC LIGHT. WHEN CAR SHIFT TO DRIVE IT VIBRATE A WHOLE LOTS FOR PASSENGER TO NOTICE AND I TOOK THE CAR TWICE TO DEALER AND THEY SAID THE CAR IS FINE WITH READING FROM COMPUTER. I TOOK IT SECOND TIME AND THEY CHECK THE MOTOR MOUNTS AND TRANSMISSION MOUNTS ( VISUAL INSPECTIONS I THINK) BUT THEY SAID EVERYTHING IS FINE BUT EVEN THE SERVICE MANAGER SAYS ITS NORMAL FOR VIBRATIONS BUT NOT SO WHEN I WAS SITTING IN THE BACK SEAT WHERE I COULD STILL FEEL THE VIBRATIONS. I LIKE TO KNOW IF THE IS A LEMON OR A DEFECTIVE PART OR WHAT? PLEASE LET ME KNOW WHAT YOU THINK AND WHO TO CONTACT? I WAS TOLD TO COME AT THE DEALER ON AUGUST 4, 2008 BECAUSE A GM TECH PERSON WAS COMING TO ANSWER QUESTIONS CONCERNING CARS.  MANAGER AND  TECH FROM GM DID NOT SHOW UP SO IM LEFT WITH A VIBRATIONS ON THE CAR THAT IM PAYING UNHAPPILY. PLEASE HELP.  HAVE A NICE DAY CARMEN  *TR",
        "vin": "KL1TG56628B"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/07/2008",
        "dateOfIncident": "05/15/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10233436,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 CHEVROLET AVEO.  THE CONTACT STATED THAT THE AIR BAG LIGHT ILLUMINATES OCCASIONALLY WHEN A PASSENGER IS SEATED IN THE PASSENGER SEAT.  THE FAILURE ONLY OCCURS WHEN THE OCCUPANT WEIGHS BETWEEN 110 TO 145 POUNDS, AND HAS BEEN OCCURRING SINCE MAY 15, 2008.  THE VEHICLE HAS BEEN TAKEN TO THE REPAIR SHOP THREE TIMES REGARDING THE AIR BAG LIGHT.  SHE STATED THAT NO SHOP HAS BEEN ABLE TO GIVE HER A DIAGNOSIS OR EXPLANATION FOR THE AIR BAG LIGHT FAILURE.  THE CONTACT FEELS THAT THIS IS A SAFETY ISSUE BECAUSE THE VEHICLE IS LIGHTWEIGHT.  SHE ALSO FEELS THAT THE AIR BAG SHOULD NEVER BE DEACTIVATED.  THE CURRENT MILEAGE WAS 2,200 AND FAILURE MILEAGE WAS 35.  THE CONSUMER STATED WHEN SHE APPLIED THE BRAKES, THE VEHICLE CONTINUED TO MOVE. AFTER A FEW SECONDS. THE BRAKE WOULD FUNCTION AND THE VEHICLE WOULD STOP. UPDATED  *JB",
        "vin": "KL1TD56608B"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,AIR BAGS,TIRES",
        "crash": false,
        "dateComplaintFiled": "06/18/2008",
        "dateOfIncident": "05/16/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10231451,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 CHEVROLET AVEO.  THE CONTACT STATED THAT FUMES LEAKED INTO THE VEHICLE AND HE NOTICED MOISTURE ON ALL THE WINDOWS.  HE ACTIVATED THE DEFROSTER, BUT THE MOISTURE REMAINED.  THE DEALER WIPED BLACK SOOT OFF OF THE INTERIOR WINDOWS AND STATED THAT THE FAILURE MAY HAVE SOMETHING TO DO WITH THE ENVIRONMENT, INSTEAD OF BEING A MANUFACTURER'S DEFECT.  THE MANUFACTURER AGREED WITH THE DEALER'S ENVIRONMENTAL THEORY.  THE VEHICLE WAS ALSO TAKEN TO THE DEALER TWICE BECAUSE THE AIR PRESSURE SENSOR LIGHT WAS ILLUMINATING.  THE TIRES WERE FILLED WITH NITROGEN, BUT THE SENSOR LIGHT CONTINUED TO ILLUMINATE.  THE CONTACT WAS ADVISED TO KEEP RESTARTING THE ENGINE SO THAT THE MODULE WOULD RESET ITSELF.  WHEN HIS WIFE WAS SEATED IN THE PASSENGER SEAT, THE AIR BAG LIGHT ALSO CONTINUED TO ILLUMINATE.  THE CURRENT MILEAGE WAS 1,937 AND FAILURE MILEAGE WAS APPROXIMATELY 550.",
        "vin": "KL1TD66628B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/21/2007",
        "dateOfIncident": "11/19/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10209625,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVEO",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE AT WORK AT LARSON AUTOMOTIVE, AS A SALES MANAGER, IN BARABOO WISCONSIN I WENT TO MOVE A 2008 CHEVY AVEO.  THIS VEHICLE WAS BRAND NEW.  I STARTED THE CAR AND SHIFTED FROM REVERSE TO FIRST GEAR (MANUAL TRANSMISSION) AND THE SIDE AIR BAG EXPLODED.  I DID NOT PURCHASE VEHICLE.    THE RESULT OF THE NOISE CAUSED A SIGNIFICANT LOSS OF HEARING IN MY RIGHT EAR, MY RIGHT SIDE OF MY FACE WENT NUM AND TINGLING.  AS OF TODAY MY HEARING IS STILL NOT FULLY FUNCTIONAL.  I AM SCHEDULED FOR A RECHECK NEXT MONDAY ON NOVEMBER 26, 2007.  *TR",
        "vin": "KL1TD56658B"
    }
]