[
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "04/03/2021",
        "dateOfIncident": "04/02/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406167,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "JOURNEY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE DRIVING ON A CITY STREET AND SUDDENLY THE ELECTRICAL WENT CRAZY.  THE HORN STARTED GOING OFF REPEATEDLY, THE WIPERS TURNED ON AND WOULDN'T SHUT OFF, THE WIPER FLUID KEPT SPRAYING, THE BLINKER LIGHTS KEPT BLINKING, AND IT CONTINUED EVEN AFTER WE TURNED OFF THE CAR.  I WAS IN THE MIDDLE OF DRIVING AND COULDN'T SEE ANYTHING BECAUSE OF THE WINDSHIELD FLUID'S CONSTANT SPRAYING AND COULD HAVE EASILY GOTTEN INTO A WRECK IF THERE WERE OTHER CARS AROUND.  THE ONLY WAY TO STOP IT WAS TO DISCONNECT THE BATTERY.  IF I HAD BEEN ON THE FREEWAY, IT COULD HAVE ENDED VERY BADLY.   IT WAS MOST LIKELY A FAULTY TIPM AFTER RESEARCHING AND FINDING MULTIPLE COMPLAINTS FROM OTHER PEOPLE WITH THE SAME ISSUE.  THIS HAS BEEN RECALLED ON OTHERS VEHICLES BUT NOT ON THIS SPECIFIC MODEL, WHICH I'M NOT UNDERSTANDING WHY THAT IS THE CASE, SINCE IT SEEMS TO BE JUST AS DANGEROUS IN OUR MODEL AS THE ONES THEY RECALLED.",
        "vin": "2D8HN54P98R"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/08/2018",
        "dateOfIncident": "06/07/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11118616,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "JOURNEY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "A SHORT IN THE DRIVERS DOOR WIRING HARNESS CAUSES HEAD LIGHTS TO FLASH, TURN SIGNALS TO FAIL TO OPERATE, SPEEDOMETER FAILURE, CRUISE CONTROL FAILURE, AND WARNING LIGHTS TO FLASH. IT ALSO FEELS LIKE ABS IS DISABLED. THIS PROBLEM OCCURS AT RANDOM WHILE DRIVING. VEHICLE HAS BEEN TAKEN TO DEALERSHIP AND DIAGNOSED AND THE PROBLEM CONFIRMED BY TECHNICIANS. THE ESTIMATED REPAIR COST IS OVER $900 AND THE PARTS NEEDED FOR THE REPAIR IS ON NATIONAL BACKORDER FOR AT LEAST THREE WEEKS. THIS PROBLEM OCCURS WITH NUMEROUS MODEL YEARS OF THE DODGE JOURNEY. I HAVE EXPERIENCED THIS PROBLEM REPEATEDLY BOTH WHILE VEHICLE IS STATIONARY AND WHILE OPERATING ON STREETS AND HIGHWAYS. THE ONLY REMEDY IS TO PULL OVER AND REPEATEDLY TURN THE VEHICLE ON AND OFF AS WELL AS OPENING AND CLOSING THE DOOR ON THE DRIVER SIDE. THIS BECOMES EXTREMELY HAZARDOUS ON THE HIGHWAY AS THERE IS NO WAY TO UTILIZE THE SAFETY SIGNALS AND OPENING AND CLOSING THE DRIVERS DOOR CREATE A HAZARD TO OT HER VEHICLES ON THE HIGHWAY. I NEED A COPY OF THE",
        "vin": "3D4GG57V79T"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/04/2016",
        "dateOfIncident": "12/20/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10817507,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "JOURNEY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "GOODYEAR ASSURANCE TIRES, 225 70R16, SET OF FOUR, APPROXIMATELY LESS THAN 5,000 MILES.  AT 70 MPH ON EXPRESSWAY, ENTIRE OUTER SIDEWALL BLEW OUT, LEAVING TREAD AND INNER SIDEWALL INTACT. THIS IS ON MY 87 YEAR OLD MOTHER'S VEHICLE, BUT FORTUNATELY I WAS DRIVING AND THE TIRE WAS ON THE REAR OF THE CAR. THIS WAS ON A DRY HIGHWAY, NORMAL DRIVING AND CONDITIONS.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/16/2015",
        "dateOfIncident": "07/11/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10734604,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "JOURNEY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 DODGE JOURNEY. THE CONTACT STATED THAT THE KEY BECAME STUCK IN THE IGNITION AND THE VEHICLE FAILED TO SHUT OFF UNTIL THE BATTERY WAS REMOVED. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 14V373000 (AIR BAGS, ELECTRICAL SYSTEM); HOWEVER, THE PART NEEDED FOR RECALL REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR RECALL REPAIR. THE APPROXIMATE FAILURE MILEAGE WAS 91,000.",
        "vin": "3D4GG47B49T"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/14/2015",
        "dateOfIncident": "06/02/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10716457,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "JOURNEY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 DODGE JOURNEY. THE CONTACT STATED THAT THE RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 11V139000 (ELECTRICAL SYSTEM) WAS RECEIVED IN JUNE OF 2014. AFTER CONTACTING THE DEALER AND THE MANUFACTURER ON MULTIPLE OCCASIONS, THE CONTACT WAS INFORMED THAT THE PARTS NEEDED TO REPAIR THE VEHICLE WERE STILL NOT AVAILABLE AND NO ESTIMATED TIME FOR RECEIVING THE PARTS COULD BE GIVEN. THE VIN WAS UNAVAILABLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "3D4DD57VX9T"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/26/2015",
        "dateOfIncident": "01/26/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10679018,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "JOURNEY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2009 DODGE JOURNEY. THE CONTACT RECEIVED A NOTIFICATION FOR NHTSA CAMPAIGN ID NUMBER: 11V139000 (ELECTRICAL SYSTEM) AND STATED THAT THE PART NEEDED WAS UNAVAILABLE TO REPAIR THE VEHICLE. THE DEALER WAS UNABLE TO INFORM WHEN THE PART WOULD BECOME AVAILABLE. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "3D4GG57V49T"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/15/2013",
        "dateOfIncident": "03/31/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10508266,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "JOURNEY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 DODGE JOURNEY. THE CONTACT STATED THAT HE TOUCHED THE VALVE AND THE TIRE DEFLATED. THE VEHICLE WAS TAKEN TO THE DEALER FOR INSPECTION AND THEY STATED THAT THE VALVE CORRODED AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED BUT PROVIDED NO ASSISTANCE. THE FAILURE MILEAGE WAS 55,000. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/26/2012",
        "dateOfIncident": "06/15/2012",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10463147,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "JOURNEY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 DODGE JOURNEY. THE CONTACT STATED THAT THE VEHICLE WOULD NOT START. THE VEHICLE WAS TOWED TO A DEALER FOR A DIAGNOSIS AND IT WAS DISCOVERED THAT THE WIRELESS IGNITION NEEDED TO BE REPLACED. THE MANUFACTURER WAS NOTIFIED, BUT OFFERED NO ASSISTANCE. THE VEHICLE WAS REPAIRED. THE FAILURE AND CURRENT MILEAGES WERE 59,000.",
        "vin": ""
    }
]