[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/05/2021",
        "dateOfIncident": "04/16/2020",
        "fire": false,
        "manufacturer": "Thor Motor Coach",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406438,
        "products": [
            {
                "manufacturer": "Thor Motor Coach",
                "productMake": "DAMON",
                "productModel": "CHALLENGER",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 DAMON CHALLENGER. THE CONTACT RECEIVED A NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V745000 (EQUIPMENT) SEVERAL YEARS AGO HOWEVER, HE DID NOT CONTACT A DEALER OR THE MANUFACTURER TO HAVE THE RECALL SERVICED. THE CONTACT STATED RECENTLY THE RETRACTABLE STEPS FAILED TO COMPLETELY RETRACT. THE CONTACT STATED HE HAD TO BEND THE HANDRAILS IN ORDER FOR THE STEPS TO RETRACT. THE LOCAL DEALER NOR THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE HAD NOT BEEN DIAGNOSED OR REPAIRED. THE FAILURE MILEAGE WAS 19,000.",
        "vin": "1F6NF53Y970"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "05/06/2016",
        "dateOfIncident": "05/05/2016",
        "fire": false,
        "manufacturer": "Thor Motor Coach",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10863529,
        "products": [
            {
                "manufacturer": "Thor Motor Coach",
                "productMake": "DAMON",
                "productModel": "CHALLENGER",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDSHIELD WIPERS FAILED IN THE MIDDLE OF THE GLASS DURING A RAINSTORM.  VERY DANGEROUS. THE MOTOR IS RUNNING SO HAS POWER BUT THE LINK TO THE ARMS IS STALLED OUT WITH DRIVE ARM JAMMED AGAINST THE MOUNTING BOLT.  28\" ARMS ARE TOO LONG  SO HAVE BEEN REPLACED WITH 24\" BLADES AS USED IN 2007.  DEFECTIVE WINDSHIELD WIPER ASSEMBLY WITH LINKAGE.  THIS IS THE SECOND ASSEMBLY TO FAIL WITHIN 3 YEARS ON THE SAME MOTORHOME.",
        "vin": "5B4MP67G173"
    },
    {
        "components": "STRUCTURE,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "10/26/2010",
        "dateOfIncident": "10/11/2010",
        "fire": false,
        "manufacturer": "Thor Motor Coach",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10362494,
        "products": [
            {
                "manufacturer": "Thor Motor Coach",
                "productMake": "DAMON",
                "productModel": "CHALLENGER",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 DAMON CHALLENGER. WHILE DRIVING APPROXIMATELY 65 MPH THE TV, WHICH WAS POSITIONED ON THE CEILING ABOVE THE DRIVER AND PASSENGERS SEAT BEGAN TO SLIDE FORWARD. UPON FURTHER EXAMINATION HE NOTICED THAT THE MOUNTING SCREWS WERE OUT OF PLACE. THE VEHICLE WAS DRIVEN ONTO THE EMERGENCY LANE AND HE REPLACED THE MOUNTING SCREWS. AFTER DRIVING ANOTHER 200 MILES THE FAILURE RECURRED AND HE ADDED A LARGER SET OF SCREWS TO MOUNT THE TV IN PLACE. WHILE EXITING THE VEHICLE HE ALSO NOTICED THAT THE STEPS TO EXIT THE VEHICLE WERE SEVERELY DETERIORATED. HE PERFORMED A REPAIR ON THE STEPS HIMSELF AS WELL. THE RV WAS TAKEN TO THE DEALER TO BE EXAMINED FOR STEP FAILURE.  THE FAILURE MILEAGE WAS 14,300 AND THE CURRENT MILEAGE WAS 15,200.    UPDATED 02/10/11  *BF  UPDATED 04/20/11",
        "vin": "5B4MP67G573"
    }
]