[
    {
        "components": "STRUCTURE,TIRES",
        "crash": false,
        "dateComplaintFiled": "04/10/2010",
        "dateOfIncident": "05/21/2008",
        "fire": false,
        "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10324802,
        "products": [
            {
                "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
                "productMake": "FLEETWOOD",
                "productModel": "AMERICAN EAGLE",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "AMERICAN EAGLE",
                "productYear": "9999",
                "size": "P235/55R16",
                "type": "Tire"
            }
        ],
        "summary": "WE TOOK DELIVERY OF A NEW AMERICAN EAGLE 42 ' 11. FOOT MOTOR HOME MODEL 42F ON MAY 21, 2008  THIS VEHICLE IS DESIGNED TO CARRY 14,600 LB. IF FULLY LOADED THIS WOULD CREATE A DANGEROUS SITUATION.  IF YOU LOADED THIS MOTOR HOME TO FULL CAPACITY OF WATER, FUEL, PASSENGER (2) WEIGHTS THE FRONT AXLE WOULD EXCEED THE RATING ON THE FRONT AXLE.  UPON REVIEWING OUR MOTORHOME FOR HE FIRST TIME ON MAY 21, 2008 (WE WERE NOT ALLOWED TO VIEW MOTORHOME UNTIL CONTRACTS WERE SIGNED)  WE NOTICED THAT THE NEW MODELS 2009 AMERICAN EAGLE HAD BIGGER RIMS, TIRES AND AFTER FURTHER INQUIRY THE FRONT AXLE HAD BEEN CHANGED FROM 14600 LB TO 16600  WE CONTACTED  FLEETWOOD AND ASKED WHY THESE CHANGES WERE MADE.  WE WERE TOLD THAT THERE WAS A OVERWEIGHT PROBLEM IF WE CARRIED FULL CAPATICY ON FUEL, WATER AND THEY RECOMMENDED THAT WE CARRY LESS FUEL & WATERL, CARGO, PROPANE WHEN TRAVELING.  WE WERE ALSO TOLD THAT THE PROBLEM WAS UNDER INVESTIGATION AND THAT THE ISSUE WOULD BE CORRECTED.    TO DATE AN OFFER HAS BEEN MADE BY SPARTAN CHASSIS THAT THEY WOULD CORRECT THE PROBLEM IF WE DROVE 2500 MILES TO MICHIGAN ONE WAY, AND PAID $18995.00 TO HAVE THE RIMS, TIRES, AND AXLE UPGRADED TO BE IN COMPLIANCE WITH THE 2009 MOTORHOMES.  FLEETWOOD AND SPARTAN KNOW AND KNEW THAT THEY HAD A PROBLEM WHICH IS WHY THEY UPGRADED THE 2009 COACHES TO CORRECT THE FRONT AXLE WEIGHT PROBLEM. *TR",
        "vin": "4VZBT1D948C"
    },
    {
        "components": "SUSPENSION,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "02/24/2010",
        "dateOfIncident": "02/24/2010",
        "fire": false,
        "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10314296,
        "products": [
            {
                "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
                "productMake": "FLEETWOOD",
                "productModel": "AMERICAN EAGLE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 FLEETWOOD AMERICAN EAGLE MOTORHOME WEIGHT PROBLEMS.  *BF  THE RV WILL NOT CARRY THE MANUFACTURER'S PRINTED AND CERTIFIED CCC. THE CONSUMER STATED HE REQUESTED THAT THE NHTSB SEND OUT NOTICES TO OWNERS OF 2007, 2008 AND SOME 2009 FLEETWOOD AMERICAN COACH 42 FT. MOTORHOMES WITH 16,600 FRONT AXLES. THE NOTICES SHOULD SAY THAT THE AFFECTED COACHES SHOULD CARRY MINIMAL WATER, CARGO AND 1/2 FUEL. THE CONSUMER WAS INFORMED FLEETWOOD WAS AWARE OF THE FRONT AXLE UNDERRATING PROBLEM SINCE EARLY 2007 AND HAD REQUESTED THAT THE FRONT END MANUFACTURER LOOK AT UPGRADING THE PROBLEM WITH THE FRONT AXLES TO A 15,200 AXLE.",
        "vin": "4VZAT1C998C"
    },
    {
        "components": "SUSPENSION,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "02/24/2010",
        "dateOfIncident": "02/24/2010",
        "fire": false,
        "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10314297,
        "products": [
            {
                "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
                "productMake": "FLEETWOOD",
                "productModel": "AMERICAN EAGLE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 FLEETWOOD EAGLE CONSUMER CONCERN ABOUT FRONT AXLE  DESIGN .    *BF  THE CONSUMER STATED THE FRONT AXLE DESIGN RATING OF THE MOTORHOME IS 14,600 POUNDS. IT WAS NOT POSSIBLE TO LOAD THE MOTORHOME WITHOUT OVERLOADING THE FRONT AXLE WHICH IS A VERY DANGEROUS SITUATION. THE MOTORHOME HAS A 5,792 POUND DESIGN CARGO CARRYING CAPACITY, BUT WITH AN ESTIMATED CARGO OF 792 POUNDS, THE FRONT AXLE IS OVERLOADED BY 520 POUNDS.",
        "vin": "4VZBT1D958C"
    },
    {
        "components": "SUSPENSION,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "02/24/2010",
        "dateOfIncident": "02/24/2010",
        "fire": false,
        "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10314299,
        "products": [
            {
                "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
                "productMake": "FLEETWOOD",
                "productModel": "AMERICAN EAGLE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 FLEETWOOD AMERICAN EAGLE FRONT WEIGHT PROBLEM.  *BF  THE CONSUMER STATED HE KNEW THE FRONT AXLE GAWR WOULD BE GROSSLY EXCEEDED IF HE LOADED IT TO THE MANUFACTURER'S CERTIFIED CARGO CARRYING CAPACITY. THE CONSUMER STATED THE FRONT AXLE NEEDED TO BE ADJUSTED BY ADDING FUEL, WATER AND PEOPLE WEIGHT TO REFLECT THE ACTUAL CONFIGURATION THE COACH IS DRIVEN.  DATA SHOWED, THAT THE WEIGHT OF THE FRONT AXLE EXCEEDED THE GAWR BY ABOUT 1,265 POUNDS. *JB",
        "vin": "4VZAT1C9X8C"
    },
    {
        "components": "SUSPENSION,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "02/24/2010",
        "dateOfIncident": "02/24/2010",
        "fire": false,
        "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10314301,
        "products": [
            {
                "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
                "productMake": "FLEETWOOD",
                "productModel": "AMERICAN EAGLE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 FLEETWOOD AMERICAN EAGLE FRONT AXLE PROBLEM.  *BF  THE CONSUMER STATED THE DESIGN AND CERTIFIED RATING OF THE FRONT AXLE WAS NOT SUFFICIENT TO ALLOW FOR THE USUAL AND INTENDED USE OF THE MOTORHOME. THE CONSUMER WAS INFORMED A FIX WAS BEING WORKED ON FOR THE FRONT AXLE.  THE FRONT AXLE HAS A DESIGN AND CERTIFICATION LOAD RATING OF 14,600 POUNDS. WITH THE MOTORHOME LOADED AS SPECIFIED IN THE FLEETWOOD OWNER'S MANUAL, THE FRONT AXLE IS OVERLOADED BY 588 LBS. THE LOAD INCLUDED FULL FUEL, FRESH WATER TANKS, EMPTY WASTED WATER TANKS, TWO PEOPLE WITH A COMBINED WEIGHT OF 325 LBS AND A EMPTY CARGO OF 820 LBS. THE GROSS VEHICLE WEIGHT UNDER THESE CONDITIONS AS WEIGHED IS 39,600 LBS WITH A DESIGN RATING OF 44,000 LBS. THE CERTIFIED CARGO CARRYING CAPACITY IS 5,792. *JB",
        "vin": "4VZAT1C958C"
    },
    {
        "components": "SUSPENSION,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "02/24/2010",
        "dateOfIncident": "02/24/2010",
        "fire": false,
        "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10314308,
        "products": [
            {
                "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
                "productMake": "FLEETWOOD",
                "productModel": "AMERICAN EAGLE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 FLEETWOOD AMERICAN EAGLE AXLE PROBLEM.  *BF  THE CONSUMER STATED THE MOTORHOME WAS DESIGNED TO CARRY 14,600LBS. BUT, WITH IT FULLY LOADED COULD CREATE A VERY DANGEROUS SITUATION. IF THE MOTORHOME WAS LOADED AS IT SHOULD BE, THE FRONT AXLE WOULD EXCEED THE RATING ON THE FRONT AXLE. THE CONSUMER STATED KNOWING THERE IS A PROBLEM WITH OVERLOADING THE FRONT AXLE, HE ONLY TRAVELS WITH 3/4 TANK OF FUEL AND 1/2 TANK OF WATER. THE CONSUMER STATED HE IS IN THE PROCESS OF REPLACING THE TIRES AND RIMS TO HELP COMPENSATE FOR SOME OF THE WEIGHT ISSUES. *JB",
        "vin": "4VZAT1C998C"
    }
]