[
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/06/2012",
        "dateOfIncident": "06/30/2012",
        "fire": false,
        "manufacturer": "Dutchmen Manufacturing, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10469383,
        "products": [
            {
                "manufacturer": "Dutchmen Manufacturing, Inc.",
                "productMake": "DUTCHMEN",
                "productModel": "GRAND JUNCTION",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JUNE 30, 2012 LESS THAN 10 MINUTES FROM OUR HOME THE LEFT REAR TIRE BLEW OUT ON OUR CAMPER CAUSING DAMAGE TO OUR CAMPER.  WE REPLACED IT WITH OUR SPARE.  APPROXIMATELY 30 MINUTES FROM OUR DESTINATION MYRTLE BEACH, SC THE LEFT FRONT TIRE BLEW OUT CAUSING MORE DAMAGE TO OUR CAMPER.  THE TIRES THAT BLEW OUT HAD MANUFACTURING DATES OF 2007 AND 2006.  THE 2 REMAINING TIRES WERE STARTING TO SEPARATE AS WELL.  WE REPLACED ALL 5 TIRES WHILE IN MYRTLE BEACH, SC WITH A TOTALLY DIFFERENT BRAND NAME OF TIRE.  THE POWER KING TOWMAX TIRES ST235/80R16 THAT BLEW OUT HAVE CAUSED THUS FAR $8653.78 WORTH OF DAMAGE TO OUR CAMPER AND WE HAVE ALREADY BEEN TOLD THE DEEPER THEY GO INTO IT THE MORE DAMAGE THEY ARE FINDING.  WE OWN AND OPERATE AN AUTOMOTIVE REPAIR GARAGE AND ALSO SELL TIRES.  WE ALWAYS KEEP OUR CAMPER, BOAT, AND PERSONAL VEHICLE TIRES IN CHECK.  WE WERE NOT OVERLOADED, AND WERE RUNNING ANYWHERE FROM 55 MPH TO 60 MPH ON OUR TRIP.  ALL TIRES ON THE CAMPER INCLUDING OUR VEHICLE ARE GAUGED AND INSPECTED BEFORE A TRIP.  TO DATE THE TIRE MANUFACTURER HAS NOT BEEN HELPFUL.  WE ARE HAVING TO DEAL WITH A COMPANY IN CANADA AND IN THE US FOR TIRES THAT WERE MANUFACTURED IN CHINA.  THEY HAVE ALREADY SUGGESTED TO US THAT THIS IS PROBABLY DUE TO FAULT OF OURS OR BAD AXELS ON OUR CAMPER.  THE TIRES HAD APPROXIMATELY 2000 MILES ON THEM AND HAD 9/32 OF TREAD ON THEM.  THESE TIRES COME OUT WITH 10/32 OF TREAD.  THE 2 TIRES THAT DID BLOW OUT HAVE BEEN SHIPPED BACK TO CANADA FOR THEM TO ANALYZE THE TIRES WHAT IS LEFT OF THEM.  WE DO STILL HAVE THE OTHER 2 TIRES AT OUR BUSINESS THAT WERE SEPARATING.  THESE TIRES NEED TO BE RECALLED BEFORE SOMEONE IS KILLED.  IF BOTH TIRES HAD BLOWN AT THE SAME TIME WE COULD HAVE BEEN IN OR CAUSED AN ACCIDENT.   WIRING HARNESSES AND PROPANE LINES WERE TOTALLY JERKED OUT AND MISSING.  THE PROPANE LINE JERKED OUT HAD STARTING LEAKING PROPANE.  *TR",
        "vin": ""
    }
]