[
    {
        "components": "STEERING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/28/2021",
        "dateOfIncident": "05/28/2021",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11418934,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I purchased this vehicle a week ago and I also downloaded car fax and it states my vehicle was due for a recall in 2014 but the previous owner next got it.",
        "vin": "2fahp71v68x"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/14/2020",
        "dateOfIncident": "06/10/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339379,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 FORD INTERSEPTER GAS TANK STRAPS AND TANK FELL. VEHICAL WAS TOWED TO A FORD.",
        "vin": "2FAFP71V28X"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/22/2020",
        "dateOfIncident": "06/19/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11330032,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 FORD CROWN VICTORIA. THE CONTACT STATED THAT WHILE DRIVING AT 70 MPH, THE STEERING WHEEL INDEPENDENTLY TURNED 180 DEGREES. THE CONTACT REGAINED CONTROL OF THE VEHICLE, AND PULLED OVER AND PARKED THE VEHICLE. THE CONTACT INSPECTED THE VEHICLE AND BECAME AWARE OF A LOOSENED STEERING SHAFT BUSHING. THE VEHICLE WAS TOWED TO THE RESIDENCE. NEITHER THE DEALER NOR THE MANUFACTURER WERE NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 166,000.",
        "vin": "2FAFP71V68X"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/16/2020",
        "dateOfIncident": "03/04/2020",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11318188,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I DROVE MY CAR TO WORK. I PARKED IT ON THE SIDE OF THE STREET. WHEN I GOT OUT HOURS LATER IT HAD CAUGHT ON FIRE.",
        "vin": "2FAFP74V38X"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/15/2020",
        "dateOfIncident": "01/14/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11299622,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTICED INTERMITTENT STIFFNESS IN THE STEERING, AN INSPECTION BY OWNER AT THE STEERING COLUMN DETERMINED THAT THE BEARING CONNECTING THE UPPER AND LOWERS SHAFTS HAD EXTENDED FROM ITS HOUSING.  IT WAS DETERMINED THIS FAILURE WAS CONSISTENT WITH A PREVIOUS RECALL 13R01.  THE VEHICLE WAS TAKEN TO GILLESPIE FORD IN GURNEE, IL, WHO STATED THE RECALL HAD BEEN CLOSED OUT IN 2013.  THEY WENT ON TO STATE THAT THE ONLY REPAIR MADE IN 2013 WAS REPLACEMENT OF THE LOWER, EXTERIOR STEERING SHAFT, AND NO RETAINING CLIP WAS INSTALLED TO PREVENT SEPARATION OF THE BEARING.  GILLESPIE FORD STATED THERE WAS NO CORROSION OR ANY OTHER CAUSE OF THE BEARING FAILURE, SAYING THAT WHEN THE RECALLS WERE DONE THEY WOULD SIMPLY REPLACE THE ENTIRE STEERING COLUMN AND NOT INSTALL THE RETAINING CLIP. GILLESPIE FORD DECLINED TO MAKE ANY FURTHER REPAIRS UNDER THE RECALL EVEN THOUGH THE CONDITION EXISTED WITH SERIOUS SAFETY CONCERNS, BUT DID OFFER TO REPLACE THE ENTIRE STEERING COLUMN FOR $1600.00.",
        "vin": "2FAFP71VX8X"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/09/2019",
        "dateOfIncident": "02/07/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11175945,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS EXITING THE FREEWAY AND TURNED ONTO MY STREET WHEN MY LOWER STEERING SHAFT COLLAPSED AND CAUSED MY UPPER BEARING RETAINING CLIP TO SEPARATE FROM THE STEERING COLUMN CAUSING ME TO LOSE ALL STEERING CONTROL.",
        "vin": "2FAFP71VX8X"
    },
    {
        "components": "STEERING,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/29/2018",
        "dateOfIncident": "12/04/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11164014,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL    FOR SOME ODD REASON ANY LITTLE BUMP OR IN LEVEL GROUND I GO OVER , THE STEERING WHEEL RESPONSE IS HORRIBLE. ALSO MY CHECK GAS CAP LIGHT COMES ON AND I CHANGED THE FUEL PUMP TWICE & HORRIBLE FUMES FLOATS AROUND INSIDE MY CAR CABIN.",
        "vin": "2FAFP71V08X"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "06/27/2018",
        "dateOfIncident": "06/27/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11104225,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 FORD CROWN VICTORIA. WHILE DEPRESSING THE BRAKE PEDAL, THE VEHICLE ACCELERATED INDEPENDENTLY AND CRASHED INTO A TREE. THE AIR BAGS DID NOT DEPLOY. A POLICE REPORT WAS NOT FILED AND THERE WERE NO INJURIES. THE VEHICLE WAS TOWED TO AN AUTO SERVICE. THE DEALER WAS NOT CONTACTED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 103,000.",
        "vin": "2FAHP71VX8X"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/11/2018",
        "dateOfIncident": "01/10/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11062258,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ANTI BRAKE LIGHT COMES ON THE REAR PASSENGER SIDE SENORS IS SHOW OPEN CIRCUIT",
        "vin": "2FAHP71V88X"
    },
    {
        "components": "STEERING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/23/2017",
        "dateOfIncident": "11/06/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11048133,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2008 FORD CROWN VICTORIA (P71) POLICE INTERCEPTOR.  I AM HAVING A KNOCKING NOISE WHEN I TURN THE STEERING WHEEL LEFT TO RIGHT.  THE NOISE IS ACCOMPANIED BY A WANDERING STEERING WHEEL WHEN THE VEHICLE GOES OVER BUMPS.  ALSO THE STEERING WHEEL SOMETIMES BECOMES HARD TO TURN THEN RAPIDLY BECOMES LOOSE LIKE SOMETHING IS BINDING UP, THEN FINALLY BREAKING FREE THROUGHOUT THE TURN.  THIS HAPPENS WHEN TAKING LOW SPEED WIDE TURNS.    AFTER INSPECTING THE STEERING COMPONENTS I NOTICED MY EXCESSIVE PLAY WHERE TJE INTERMITTENT STEERING SHAFT ATTATCHES TO THE RACK N PINION.  I THINK MY UPPER SHAFT MAY HAVE BEEN REPLACED BEFORE SINCE IT IS NOT NEARLY AS CORRODED AS THE LOWER INTERMITTENT SHAFT.  I CAN ROTATE THE WHOLE SHAFT ABOUT A QUARTER TURN IN EITHER DIRECTION WHILE THE CAR PARKED AND AT THE END OF EACH TURN THE KNOCK RESONATES NEAR THE LOWER INTERMEDIATE STEERING SHAFT KNUCKLE TO WHERE IT CONNECTS INTO TJE PINION GEAR OF THE RACK N PINION.  NOW,  I INSPECTED ALL STEERING AND SUSPENSION COMPONENTS AND THEY ARE ALL IN GOOD SHAPE....NO PLAY ANYWHERE 8N THE SYSTEM BESIDES THE \"RECALLED\" STEERING SHAFT!  I HAVE TWO KIDS AND IF I GET INTO AN ACCIDENT AND THEY GET HURT BECAUSE A \"RECALLED\" PART DIDNT GET REPLACED BY FORD WHEN IT SHOULD HAVE(FOR FREE) I WILL NEVER FORGIVE THE COMPANY RESPONSIBLE.  HONORING A FREE REPLACEMENT FOR AN OBVIOUSLY POORLY ENGINEERED AND DEFECTIVE FACTORY PART SEEMS TO BE TJE RIGJT THING TO DO.....SO WHERE IS MY RECALL AND WHY DOESNT IT SHOW UP WHEN I SEARCH MY CARS VIN NO???   THIS NEEDS TO BE FIXED BEFORE SOMEONE GETS SERIOUSLY INJURED OR EVEN DIES.  I DONT MAKE A LOT OF MONEY AND THIS NEEDS TO BE FIXED FOR FREE LILE IT WAS ON ALL THE OTHER VEHICLES.  IT DRIVES LILE NEW BESIDES THE SCARY KNOCK AND WANDERING STEERING.  IT'S JUST RIDICULOUS NOT TO RECALL THIS PART!",
        "vin": "2FAFP71V18X"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/29/2017",
        "dateOfIncident": "07/29/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11011486,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS GOING DOWN THE ROAD AND MY GAS PEDAL STUCK TO FLOOR TURNED KEY OFF AND HIT BRAKES FELT LIKE PEDAL WANTED TO STAY DOWN.CITY STREET.",
        "vin": "2FAFP71V08X"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/18/2017",
        "dateOfIncident": "01/09/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10946172,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 FORD CROWN VICTORIA. WHILE DRIVING 20 MPH, THE BRAKE PEDAL WAS DEPRESSED, BUT THE VEHICLE STILL ACCELERATED ON ITS OWN. THE DEALER COULD NOT DUPLICATE THE FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 200,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "08/05/2016",
        "dateOfIncident": "07/29/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10893344,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING STRAIGHT ON A HIGHWAY- ROUTE 2 IN MASSACHUSETTS. AFTER TAPPING ON THE BRAKES TO BEGIN THE PROCESS OF SLOWING DOWN, THE CROWN VICTORIA- ON IT'S OWN- BEGAN TO ACCELERATE AT THE SAME TIME.  IT WAS SUDDEN AND UNINTENDED ACCELERATION.  AT THAT POINT, I SLAMMED AS HARD AS I COULD ONTO THE BRAKE PEDAL- TO THE POINT WHERE THE BRAKES WERE SMOKING.  THE ENGINE OVERWHELMED BRAKES AND I COULD NOT STOP THE VEHICLE- I COULD ONLY SLOW IT DOWN.  I ENDED UP REAR ENDING THE VEHICLE IN FRONT OF ME (WHICH HAD COME TO A STOP).  EVEN AFTER THE IMPACT, THE CROWN VICTORIA CONTINUED TO PUSH AGAINST THE VEHICLE IN FRONT OF ME.  THEN, JUST AS SUDDENLY AS IT STARTED, THE FULL BORE ACCELERATION STOPPED.     I HAD A PERFECT DRIVING HISTORY PRIOR TO THIS MALFUNCTION.  NO ACCIDENTS EVER.  I HAD AMPLE SPACE AND TIME TO SAFELY STOP MY VEHICLE.  THERE WAS NO PROBLEM WITH MATS.  I AM NOT SUING FORD.  I AM NOT TRYING TO AVOID THE SURCHARGE. I CAN'T OFFER YOU TANGIBLE PROOF THAT THERE WAS A SUDDEN UNINTENDED ACCELERATION IN MY 2008 FORD CROWN VICTORIA- OTHER THAN MY TRUTHFUL TESTIMONY.  I RECENTLY BOUGHT THE VEHICLE AND, UNTIL THAT ONE INCIDENT, IT WAS RUNNING NORMALLY.  IT WAS RUNNING NORMALLY IN THE DAYS AFTER THE ACCIDENT. I HAD A \"WRENCH\" LIGHT COME ON ONCE, A COUPLE OF WEEKS EARLIER BUT IT WAS GONE THE NEXT TIME I STARTED UP THE CAR.  SO I DISMISSED IT.  THE DAMAGE WAS RELATIVELY MINOR AND I HAVE FULL COLLISION.  I CONSIDERED THE CAR SO UNSAFE TO DRIVE, HOWEVER, THAT I TOOK IT OFF THE ROAD AND GAVE IT AWAY.  I WARNED THE PERSON I GAVE IT TO THAT THE VEHICLE WAS UNSAFE AND SHOULD BE USED ONLY FOR PARTS.    WHAT I AM SAYING IS THE TRUTH AND IT IS CONSISTENT WITH WHAT I TOLD THE MOTORIST I STRUCK AT THE TIME OF THE ACCIDENT.",
        "vin": "2FAFP71V38X"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/09/2016",
        "dateOfIncident": "06/01/2013",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10873481,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 FORD CROWN VICTORIA. WHILE THE VEHICLE WAS BEING OPERATED, THE FRONT PASSENGER SIDE VISOR LIGHT REMAINED ILLUMINATED AFTER THE VISOR WAS CLOSED. AS A RESULT, THE VISOR MATERIAL WAS BURNED. THE CONTACT MENTIONED THAT THE VISOR HAD TO BE SLIGHTLY OPENED TO PREVENT FURTHER BURNING WHILE DRIVING. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE ELECTRICAL WIRE HARNESS TO THE VISOR FAILED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 73,000.",
        "vin": "2FAFP73V88X"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/19/2016",
        "dateOfIncident": "04/28/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10865792,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 FORD CROWN VICTORIA. WHILE DRIVING VARIOUS SPEEDS, THE INSTRUMENT PANEL BECAME INOPERABLE INTERMITTENTLY. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 140,000.   UPDATED 06/29/16*LJ  UPDATED 08/2/16.*JB",
        "vin": "2FAFP74V68X"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/14/2016",
        "dateOfIncident": "04/14/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10855494,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TWICE NOW WHILE SLOWING FOR AN INTERSECTION SOON AFTER VEHICLE START, THE VEHICLE GAS TRIED TO SURGE FORWARD WHILE BRAKES HAVE E BEEN APPLIED.    THE CAR TRIED TO REV UP TO 5000RPM. UPON MANAGING TO STOP CAR, I PUT IT IN NEUTRAL , IT REVVED TO 5000RPM THEN SUDDENLY DROPPED BACK TO IDLE.  BOTH TIMES HAVE NEARLY ENDED UP IN VEHICLE GOING THROUGH INTERSECTIONS.  CAR DROVE NORMALLY AFTER THAT.",
        "vin": "2FAHP71V78X"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/17/2016",
        "dateOfIncident": "03/01/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10850226,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 FORD CROWN VICTORIA. THE CONTACT STATED THAT WHILE DRIVING AT 5 MPH, THE VEHICLE ACCELERATED INDEPENDENTLY WITHOUT ANY WARNING. THE VEHICLE WAS STOPPED AND PLACED INTO THE PARK POSITION AFTER THE BRAKE PEDAL WAS DEPRESSED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED.  THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 200,000.",
        "vin": "2FAHP71V18X"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/23/2015",
        "dateOfIncident": "09/23/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10785543,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 FORD CROWN VICTORIA. THE CONTACT STATED THAT THE REPAIR FOR NHTSA CAMPAIGN NUMBER: 14V704000 (STEERING) WAS PERFORMED, BUT THE FAILURE RECURRED. THE CONTACT HEARD A LOUD POPPING NOISE WHILE DRIVING. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO DISCOVERED THAT THE STEERING WHEEL LOWER SHAFT SEPARATED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 41,567.   UPDATED 02/10/16*LJ  UPDATED 05/21/18*JB",
        "vin": "2FAFP74V48X"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "09/01/2015",
        "dateOfIncident": "09/01/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10760845,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 FORD CROWN VICTORIA. WHILE DRIVING 30 MPH AND APPROACHED A STOP SIGN, THE ACCELERATOR PEDAL WAS DEPRESSED AND BECAME STUCK TO THE FLOORBOARD. AS A RESULT, THE VEHICLE ACCELERATED UNCONTROLLABLY AND CRASHED INTO AN ELECTRIC POLE. THE FRONT AIR BAGS DEPLOYED. THE CONTACT SUSTAINED UNKNOWN INJURIES THAT REQUIRED MEDICAL ATTENTION. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO AN IMPOUND LOT, BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 164,446.",
        "vin": "2FAHP71V68X"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/31/2014",
        "dateOfIncident": "01/01/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10669252,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 FORD CROWN VICTORIA. THE CONTACT STATED THAT THE UPPER AND LOWER BEARINGS SEPARATED FROM THE VEHCLE, CAUSING THE POWER STEERING TO FAIL. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE CONTACT REFERENCED NHTSA CAMPAIGN NUMBER: 13V385000 (STEERING). THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 117,000.",
        "vin": "2FAFP71V08X"
    },
    {
        "components": "STEERING,POWER TRAIN,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "11/24/2014",
        "dateOfIncident": "08/06/2011",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 1,
        "numberOfInjuries": 0,
        "odiNumber": 10660688,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "UNMARKED POLICE CROWN VICTORIA SEDAN TRAVELING IN LEFT LANE OF 4-LANE, GRASS MEDIAN-SEPARATED HIGHWAY WITH POSTED SPEED LIMIT 55 MPH. POLICE OFFICER DRIVER DECEASED IN CRASH. WITNESSES REPORT: AFTER ENTERING HIGHWAY, VEHICLE ACCELERATED TO HIGH RATE OF SPEED; IN VICINITY POLICE MEDIAN TURNAROUND, POLICE STROBE LIGHTS WENT ON; VEHICLE STARTED WOBBLING AND MOVING GRADUALLY TO LEFT IN STRAIGHT PATH. EVENT DATA RECORDER INDICATED BRAKES APPLIED AND VEHICLE SLOWED BEFORE COLLIDING WITH CONCRETE BRIDGE UNDERPASS ABUTMENT. SMALL GRASS FIRE EXTINGUISHED AROUND FRONT-END OF VEHICLE. CURSORY VEHICLE EXAMINATION ON 09/15/11 REPORTS: AIRBAG DEPLOYED, SEAT BELT LOCKED UP DUE TO IMPACT, UNABLE TO CHECK BRAKE PEDAL, UNABLE TO CHECK FRONT BRAKES, AND BAD STEERING (NO FURTHER DETAILS ON CONDITION STEERING PARTS).   *TR",
        "vin": "2FAHP71V28X"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/19/2014",
        "dateOfIncident": "02/07/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10637557,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS A PASSENGER IN THE ABOVE VEHICLE. ON 02/07/2013 THE CAR HYDRO PLANED FROM THE ROAD AND THE DRIVER LOST CONTROL OF THE CAR. IT BEGAN SPINNING AROUND AND LEFT THE ROAD, THE CAR HIT A FENCE AND TWIRLED AROUND AND SLAMMED REAR END FIRST INTO A POLE. THE IMPACT WAS SO HARD IT CAUSED THE FRONT SEATS TO BREAK AND WE BOTH FELL BACK INTO THE BACK OF CAR. THE REAR WINDOW SHATTERED AND GLASS FLEW INSIDE THE ENTIRE CAR. THE TRUNK WAS CRAMMED INTO THE BACK SEAT. THE AIR BAGS DID NOT DEPLOY AT THE TIME OF IMPACT. THE WHOLE DASH AND CONSOLE FELL DOWN INTO OUT LAPS AND THE STEREO EJECTED FROM THE DASH AND FLEW INTO THE BACK OF THE CAR. A FOREIGN OBJECT CUT ME ON THE RIGHT SIDE OF MY FACE AROUND MY EAR WHICH CAUSE ME TO REQUIRE STITCHES AND LEFT ME WITH SLIGHT NERVE DAMAGE AND SLIGHT JAW PARALYSIS OF THE RIGHT SIDE OF MY FACE.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/17/2014",
        "dateOfIncident": "07/20/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10625822,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CORRECTED DESCRIPTION FOR COMPLAINT 10618222:  DRIVING ON HIGHWAY AT 70 M.P.H., NOTICED INCREASING \"PLAY\" IN STEERING WHEEL; STOPPED AT REST AREA. WHEN READY TO LEAVE, STARTED TO BACK OUT AND TURNED  STEERING WHEEL LESS THAN 1/2 TURN TO THE LEFT.  I HEARD/FELT SOMETHING \"POP,\" AT WHICH POINT THE STEERING WHEEL WOULD SPIN FREELY AND NO LONGER AFFECTED THE FRONT WHEELS--COMPLETE LOSS OF STEERING CONTROL.  HAD CAR TOWED TO A FORD DEALER, WHO CONFIRMED THE STEERING COLUMN HAD BROKEN COMPONENTS.  THE DEALER ALSO NOTED THAT THIS VEHICLE HAD PREVIOUSLY RECEIVED REPAIRS TO THE STEERING UNDER FORD RECALL 13S08.  FORD DEALER STATED THEY HAD CONTACTED FORD MOTOR COMPANY ABOUT COVERING ALL OR PART OF THE REPAIR, BUT \"CORPORATE HAD REFUSED.\"  THE EXPENSIVE REPAIR ($1,093.60) WAS ALL MINE.  CAN 'T HELP BUT WONDER IF THE RECALL REPAIR WENT FAR ENOUGH.  *TR",
        "vin": "2FAFP71V88X"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/11/2014",
        "dateOfIncident": "09/04/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10579097,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 FORD CROWN VICTORIA. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 40 MPH, A LOUD ROARING NOISE EMITTED UNDERNEATH THE VEHICLE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO STATED THAT BOTH FRONT WHEEL BEARINGS AND HUB ASSEMBLIES NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THERE WAS A RECALL RELATED TO THE FAILURE UNDER NHTSA CAMPAIGN ID NUMBER 07V270000 (SUSPENSION) BUT THE VIN WAS NOT INCLUDED. THE MANUFACTURER WAS NOTIFIED OF THE PROBLEM. THE APPROXIMATE FAILURE MILEAGE WAS 140,000. UPDATED 07/28/14 MA",
        "vin": "2FAFP71V68X"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "01/12/2014",
        "dateOfIncident": "10/12/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10559533,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE SUDDENLY JERKED TO THE LEFT CAUSING IT TO FLIP OVER AND DAMAGING TWO UTILITY POLES AND BRINGING DOWN POWER LINES.  *TR",
        "vin": "2FAFP71V08X"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "10/29/2013",
        "dateOfIncident": "08/07/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10549941,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS 2008 FORD CROWN VICTORIA. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 30 MPH, THERE WAS A LOSS OF STEERING CONTROL. THE CONTACT THEN UNEXPECTEDLY CRASHED INTO ANOTHER VEHICLE. THE DRIVER AND FRONT SEAT PASSENGER SUSTAINED INJURIES TO THE NECK, BACK AND BODY. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO AN INDEPENDENT AUTO CENTER FOR INVESTIGATION. THREE WEEKS AFTER THE CRASH, THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN ID NUMBER: 13V385000 (STEERING). THE MANUFACTURER WAS NOTIFIED OF THE PROBLEM. THE APPROXIMATE FAILURE MILEAGE WAS 180,000.",
        "vin": "2FAHP71V58X"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "07/29/2013",
        "dateOfIncident": "07/19/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10532459,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTE: THIS IS A POLICE CAR.  OFFICER WAS DRIVING APPROXIMATELY 40MPH WHEN SUDDENLY, WITHOUT WARNING, THE STEERING WHEEL HAD A LOT OF PLAY IN IT, WHICH BECAME MORE APPARENT WHEN THE STEERING WHEEL DID A COMPLETE 360 DEGREE TURN WHILE THE VEHICLE KEPT GOING STRAIGHT.  HE WAS ABLE TO TURN THE WHEEL HARD ENOUGH AT THE LAST SECOND AND LANDED ONTO A HOMEOWNERS DRIVEWAY.  UNIT WAS TOWED TO THE FLEET DEPARTMENT WHERE THE UNIT IS BASED.   OFFICER DID NOT HAVE ANY WARNING THAT THIS WAS ABOUT TO HAPPEN, NO POPPING, GRINDING OR HARD STEERING PRIOR TO THE EVENT. I AM THE LEAD FLEET TECHNICIAN, ASE MASTER AND ADVANCED CERTIFIED & 30 YEARS EXPERIENCE.   FINDINGS UPON INSPECTION:  I FOUND THE SPLINED STEERING SHAFTS IN THE COLUMN HAD SEPARATED AND THE LIGHT GREEN PLASTIC BUSHING AT THE LOWER SECTION OF THE COLUMN WAS BROKEN, THE SPLINED BLACK HARD PLASTIC ON THE SPLINED SHAFT WAS CHEWED UP ON THE END (UNKNOWN IF THESE OCCURRED AFTER SHAFT SEPARATION).  AFTER INSPECTION, THE COLUMN WAS REASSEMBLED AND BENCH TESTED.  NO PROBLEM WAS NOTED.  NO VISIBLE CRACKS, ABNORMAL WEAR OR LOOSENESS NOTED.  NEW FORD STEERING COLUMN AND CLOCK-SPRING INSTALLED, ALIGNMENT AND UNIT WAS PUT BACK IN SERVICE.  THE FAULTY COLUMN IS ON HAND.   *TR",
        "vin": "2FAHP71V58X"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/12/2012",
        "dateOfIncident": "10/10/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10479893,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ON WEDNESDAY, OCTOBER 10 AT APPROXIMATELY 3:45 PM TROOPER WAS TRAVELING ON RESERVOIR AVENUE IN THE CITY OF CRANSTON.  AS THE TROOPER APPROACHED THE ON-RAMP FOR ROUTE 10 SOUTH HE ATTEMPTED TO TURN ONTO THE RAMP.  AS HE DID SO HE HEARD A LOUD SNAP AND THE STEERING WHEEL  KEPT TURNING WITHOUT TURNING THE FRONT WHEELS.  HE APPLIED THE BRAKES AND WENT UP ONTO THE CURBING NEXT TO THE RAMP.  WHEN HE CAME TO A STOP THE HORN WAS SOUNDING AND THE LIGHTS AND SIREN WERE ALSO GOING ON AND OFF.  THE CRUISER IN QUESTION IS A 2008 AND  HAD NOT EXPERIENCED ANY SERIOUS PROBLEMS UNTIL THIS.  IT WAS TOWED TO TASCA FORD AND THEY ADVISED THAT THE STEERING COLUMN HAD SNAPPED AND AFFECTED THE WIRING IN THE VEHICLE.  THE VEHICLE IS CURRENTLY AT TASCA AWAITING REPAIRS.  THANK YOU FOR YOUR ASSISTANCE.  *TR",
        "vin": "2FAFP71V48X"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/01/2012",
        "dateOfIncident": "09/26/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10478030,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "INSPECTION FOUND DISLOCATED BUSHING.  *TR",
        "vin": "2FAHP71V28X"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/01/2012",
        "dateOfIncident": "09/26/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10478034,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "INSPECTION FOUND DISLOCATED BUSHING.  *TR",
        "vin": "2FAHP71V68X"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/01/2012",
        "dateOfIncident": "09/26/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10478045,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "INSPECTION FOUND DISLOCATED BUSHING.  *TR",
        "vin": "2FAHP71V18X"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/01/2012",
        "dateOfIncident": "09/26/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10478047,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "INSPECTION FOUND DISLOCATED BUSHING.  *TR",
        "vin": "2FAHP71V48X"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/26/2012",
        "dateOfIncident": "09/25/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10477192,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 FORD CROWN VICTORIA. THE CONTACT STATED THAT WHILE DRIVING 5 MPH, THE POWER STEERING ASSIST FAILED. THE CONTACT STATED THAT HE ATTEMPTED TO TURN THE VEHICLE BUT INSTEAD, HEARD A LOUD NOISE AS THE WHEEL BEGAN TO MOVE INDEPENDENTLY. THE VEHICLE WAS TOWED TO A REPAIR SHOP FOR INSPECTION WHERE THEY STATED THAT THE STEERING COLUMN HAD BECOME DISASSEMBLED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 96,000. THE VIN WAS UNAVAILABLE.",
        "vin": "2FAFP71V68X"
    },
    {
        "components": "STEERING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/19/2012",
        "dateOfIncident": "08/27/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10475954,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER FELT RESISTANCE IN STEERING AND HEARD NOISE UNDER DASH. DROVE CAR FOR SOME UNTIL IT WOULD NOT SHIFT INTO PARK THEN BROUGHT IN FOR SERVICE. TECHNICIAN EXAMINING VEHICLE NOTICED SMALL PLASTIC PARTS ON FLOOR UNDER STEERING COLUMN AND FOUND THE LOWER BUSHING OUT OF TUBE. STEERING SHAFT WAS STILL CONNECTED. *TR",
        "vin": "2FAHP71V68X"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/16/2012",
        "dateOfIncident": "06/08/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10471184,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 FORD CROWN VICTORIA. THE CONTACT STATED THAT THE STEERING KNUCKLE AND THE ENGINE COMPARTMENT WERE FRACTURED. THE VEHICLE WAS TAKEN TO THE DEALER WHO STATED THAT THE PLASTIC OF THE STEERING KNUCKLE WAS DEFECTIVE AND OFFERED TO REPLACE THE PLASTIC WITH A RUBBER BAND. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND OFFERED NO ASSISTANCE. THE FAILURE WAS 98,000 AND THE CURRENT MILEAGE WAS 106.000.    *UPDATE SUBMITTED...I AM A DEPUTY SHERIFF AND ON THE DATE OF THIS INCIDENT, I WAS TRAVELING AT 15 MPH. I NOTICED A GRANULAR FEELING IN THE STEERING COLUMN AND THE STEERING WHEEL HAD NO RESISTANCE. THE STEERING COLUMN WHEEL COULD BE SPUN CONTINUOUSLY IN EITHER DIRECTION WITHOUT AFFECTING THE VEHICLES DIRECTION. THIS IS A VERY DANGEROUS SITUATION AND COULD'VE BEEN DEADLY FOR ME AND OTHERS ON THE ROAD THAT DAY IF MY SPEED WAS FASTER THAN WHAT IT WAS.",
        "vin": "2FAFP71V68X"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/14/2012",
        "dateOfIncident": "08/11/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10470556,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 FORD CROWN VICTORIA. THE CONTACT STATED THAT WHILE DRIVING 45 MPH THE ACCELERATOR PEDAL BECAME STUCK ON THE FLOORBOARD WHEN IT WAS DEPRESS. THE CONTACT MENTIONED THAT THE FAILURE RECURRED MULTIPLE TIMES. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THAT THE THROTTLE BODY WAS DEFECTIVE AND NEEDED TO BE REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND A REPORT WAS FILED. THE FAILURE MILEAGE WAS 40,714.",
        "vin": "2FAFP71V58X"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/05/2010",
        "dateOfIncident": "08/04/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10347391,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STEERING COLUMN BEGINS TO SEPARATE IN THE UPPER PORTION OF THE STEERING COLUMN TUBE. THE STEERING WHEEL BINDS AND IS VERY DIFFICULT TO MOVE FROM LEFT TO RIGHT. WE HAVE EXPERIENCED IN A LIKE VEHICLE THAT THE SHAFTS IN THE UPPER COLUMN ACTUALLY SEPARATED AND THE VEHICLE HAD NO MECHANICAL CONNECTION TO THE FRONT WHEELS. THE OPERATOR WAS ABLE TO BRING THE VEHICLE TO A SAFE STOP BUT THEY HAD JUST BEGUN TO ACCELERATE FROM A TRAFFIC LIGHT WHEN THE SHAFTS SEPARATED AND THE VEHICLE SPEED WAS MINIMAL. *TR",
        "vin": "2FAFP71V08X"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/05/2010",
        "dateOfIncident": "05/18/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10347404,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STEERING COLUMN IN THIS VEHICLE SEPARATED IN THE UPPER PORTION OF THE STEERING COLUMN TUBE. THE STEERING WHEEL BINDS AS REPORTED AT FIRST AND IS VERY DIFFICULT TO STEER FROM LEFT TO RIGHT. WHEN THE UPPER STEERING COLUMN SHAFTS SEPARATED FROM THIS VEHICLE IT HAD NO MECHANICAL CONNECTION TO THE FRONT WHEELS. THE OPERATOR WAS ABLE TO BRING THE VEHICLE TO A SAFE STOP BUT THEY HAD JUST BEGUN TO ACCELERATE FROM A TRAFFIC LIGHT WHEN THE SHAFTS SEPARATED AND THE VEHICLES SPEED WAS MINIMAL. *TR",
        "vin": "2FAFP71V48X"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/03/2010",
        "dateOfIncident": "10/26/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10314349,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 FORD CROWN VICTORIA.  CONSUMER STATES UNINTENDED ACCELERATION AND NO RESPONSE TO BRAKE PEDAL.  *TGW  THE CONSUMER STATED WHEN HE ATTEMPTED TO APPLY THE BRAKES TO MAKE A TURN, THE VEHICLE DID NOT STOP AND THE ENGINE BEGAN TO REV AT A HIGH RATE. HE HAD TO PUMP THE BRAKES IN ORDER TO GET THE VEHICLE TO STOP.  *JB  THE CONSUMER STATED THE SAME PROBLEM HAS SINCE HAPPENED A SECOND TIME. THE DEALER WAS UNABLE TO FIND A PROBLEM. UPDATED 09/22/10*JB",
        "vin": "2FAFP74VX8X"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/13/2009",
        "dateOfIncident": "06/25/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10292772,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 FORD CROWN VICTORIA  HAS A PROBLEM WITH UNINTENDED ACCELERATION.   *NJ  THE CONSUMER STATED THE VEHICLE ACCELERATED 3 TIMES WITH NO WARNING. THE CONSUMER STATED THE PROBLEM HAPPENED WHEN THE VEHICLE WAS STARTED AND PLACED INTO DRIVE AND DRIVEN APPROXIMATELY 150 FEET. THE RPM'S INCREASED WITHOUT THE ACCELERATOR BEING APPLIED. THE CONSUMER APPLIED THE BRAKE AND THE RPM'S RETURNED TO NORMAL AFTER ABOUT 30 SECONDS. THE CRUISE CONTROL WAS NOT ENGAGED.  IN JUNE 2009, THE CONSUMER TOOK THE VEHICLE TO THE DEALER AND THEY REPLACED THE THROTTLE BODY AND AIR INTAKE. HOWEVER, ON AUGUST 13, 2009 THE VEHICLE ACCELERATED SUDDENLY AS IT DID PREVIOUSLY.  THE CONSUMER TOOK THE VEHICLE BACK TO THE DEALER AND THEY FOUND 2 PIN HOLES IN THE BASIC WIRING HARNESS. THE CONSUMER WAS INFORMED THE PIN HOLES WERE A RESULT OF THE WIRING HARNESS BEING INSTALLED UPSIDE DOWN WHICH CAUSED TENSION AND RUBBING ON THE WIRE INSULATION UNTIL THE BARE WIRES WERE EXPOSED WHICH CAUSED A SHORT IN THE WIRING HARNESS. THE DEALER REPAIRED THE WIRES, BUT DID NOT REPLACE ANY PARTS.  TO DATE NO FURTHER PROBLEMS HAVE OCCURRED. *JB",
        "vin": "2FAFP74V08X"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/15/2009",
        "dateOfIncident": "06/29/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10276869,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE SEVERAL FORD CROWN VIC POLICE CARS IN OUR AGENCY AND WE ARE HAVING TROUBLES WITH THE COOLING FANS BREAKING DOWN.  OTHER AGENCIES ARE ALSO HAVING THE SAME TROUBLES.  THE COST FOR THESE REPAIRS ARE OVER $600.00 PER SQUAD AND WITH OUR TIGHT BUDGET THESE COSTS ARE ADDING UP.  IS THERE ANY ACTIVE SERVICE BULLETIN OR RECALLS ON THESE PARTS? *TR",
        "vin": "2FAFP71VX8X"
    },
    {
        "components": "STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "05/25/2009",
        "dateOfIncident": "05/21/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10269890,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 FORD CROWN VICTORIA POLICE INTERCEPTOR: BRAKE PEDAL IS TOO CLOSE TO THE ACCELERATOR.  OFTEN, BOTH PEDALS ARE PRESSED INADVERTENTLY WHEN TRYING TO STOP.  I PERSONALLY KNOW SEVERAL POLICE OFFICERS WHO REPORT HAVING THIS PROBLEM WHEN DRIVING '08 CROWN VICTORIAS.  THESE SAME POLICE OFFICERS, MYSELF INCLUDED, REPORT THIS PROBLEM IS UNIQUE TO THE '08 CROWN VICTORIA AND DOES NOT EXIST WITH OLDER MODELS.  *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "12/29/2008",
        "dateOfIncident": "09/23/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10253036,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "POLICE CAR 2008 CROWN VICTORIA WAS SOUTHBOUND THROUGH INTERSECTION AND STRUCK BY AN EASTBOUND VEHICLE. THE CROWN VIC ACCELERATED POST IMPACT BY A STUCK THROTTLE LINKAGE AND LED TO TWO ADDITIONAL COLLISIONS. EVENT DATA RECORDER DOWNLOAD CONFIRMED THE OFFICER COMPLAINT OF THE STUCK THROTTLE. INITIAL IMPACT SPEED WAS 22 MPH, POST IMPACT ACCELERATED TO 25 FOR HEAD ON WITH STOPPED VAN IN ONCOMING LANE PUSHING VAN BACK AND SIDEWAYS. CV CONTINUED PAST AT A SPEED OF 16 MPH TO STRIKE IMPALA HEADON AND ACCELERATED TO 20 MPH BEFORE OFFICER COULD STOP. THROTTLE AT 100% WHILE IN NEUTRAL AND HIGH RPMS (4600) UNTIL OFFICER SHUT ENGINE OFF. CCSO REPORT NUMBER S08-14160. *TR",
        "vin": "2FAHP71V58X"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/28/2008",
        "dateOfIncident": "04/01/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10240078,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 FORD CROWN VICTORIA.  WHILE ATTEMPTING TO DEPRESS THE BRAKE PEDAL AT SPEEDS LESS THAN 50 MPH, THE VEHICLE WOULD ACCELERATE INSTEAD OF ATTEMPTING TO STOP.  THE DEALER COULD NOT FIND ANY FAILURES AND THE ISSUE RECURRED SEVERAL TIMES AFTERWARDS.  WHILE DRIVING 72 MPH WITH THE CRUISE CONTROL ACTIVATED, THE VEHICLE SUDDENLY ACCELERATED TO 90 MPH UNTIL THE CRUISE CONTROL WAS DISENGAGED.  THE MANUFACTURER ADVISED HIM TO TAKE THE VEHICLE TO THE DEALER FOR INSTALLATION OF A MONITORING SYSTEM; HOWEVER, THE DEALER STILL COULD NOT DETERMINE THE CAUSE OF THE FAILURE.  THE DEALER ALSO STATED THAT HE WAS DEPRESSING BOTH THE BRAKE AND ACCELERATOR PEDALS SIMULTANEOUSLY, WHICH MAY HAVE CAUSED THE FAILURE.  THE CONTACT STATED THAT WAS IMPOSSIBLE BECAUSE THE PEDALS WERE INCHES AWAY FROM EACH OTHER.  THE FAILURE MILEAGE WAS 11,000 AND CURRENT MILEAGE WAS 15,460.   UPDATED 09/25/08  *BF  UPDATED 09/26/08. *JB",
        "vin": "2FAFP74V58X"
    },
    {
        "components": "SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "01/22/2008",
        "dateOfIncident": "01/07/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10215611,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CROWN VICTORIA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVERS SIDE SEAT BELT BUCKLE BROKE DURING A COLLISION / ACCIDENT.  THE VEHICLE HAS BEEN TAKEN OUT OF SERVICE AND SECURED SO THAT NOBODY CAN TAMPER WITH IT.  THERE IS NO INFORMATION REGARDING INJURY TO THE OCCUPANT.  *TR",
        "vin": "2FAFP71V58X"
    }
]