[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/23/2019",
        "dateOfIncident": "06/08/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11254931,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-650 SD",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "23-YEAR-OLD SUBJECT WAS A PASSENGER IN A LIMOUSINE/BUS WHICH HAD BEEN BUILT OUT BY LIMOS BY TIFFANY, INC. SHE WAS LOCATED NEAR THE EMERGENCY EXIT WINDOW AREA. EMERGENCY LATCH WAS IN CLOSED POSITION AND WINDOW APPEARED CLOSED; HOWEVER, WHEN DRIVER NEGOTIATED A LEFT CURVE, SUBJECT MADE CONTACT WITH THE WINDOW AND IT OPENED, CAUSING HER TO FALL OUT ONTO THE ROADWAY AND SUSTAIN SERIOUS INJURIES. POST-ACCIDENT TESTING DEMONSTRATED LOCKING HANDLE COULD BE IN THE CLOSED POSITION YET THE WINDOW COULD BE PUSHED OPEN WITH SLIGHT LOADING. THE POSTED SPEED LIMIT AT TIME OF ACCIDENT WAS 55 MPH. *DT*JB *DT*JB",
        "vin": "3FRNF65C48V"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/07/2011",
        "dateOfIncident": "11/07/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10434453,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-650 SD",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 FORD F-650. THE CONTACT WAS DRIVING 35 MPH WHEN HE APPLIED THE BRAKES AND THE PEDAL WAS ABNORMALLY DEPRESSED INTO THE FLOORBOARD. THE VEHICLE DID NOT RESPOND AND THE CONTACT HAD TO SHIFT INTO NEUTRAL IN ORDER TO STOP THE VEHICLE. THE VEHICLE WAS TAKEN TO THE DEALER WHO REPLACED THE MASTER CYLINDER AND CLUTCH SLADE BUT THE BRAKES CONTINUED TO FAIL. THE CONTACT STATED THAT THE CLUTCH SLADE CYLINDER AND MASTER CYLINDER FAILED AND WAS REPAIRED FOUR TIMES. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE WHO PROVIDED A PARTIAL REIMBURSEMENT TO THE CONTACT FOR THE COST OF REPAIRS AND A COMPLAINT WAS FILED WITH THE MANUFACTURER.  THE FAILURE MILEAGE WAS 80,000 AND THE CURRENT MILEAGE WAS 122,000.",
        "vin": "3FRNF65B88V"
    }
]