[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/18/2020",
        "dateOfIncident": "09/08/2020",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11359863,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION DOWN SHIFTS TO LOW GEAR WHILE DRIVING AT HIGH SPEEDS ON THE INTERSTATE.",
        "vin": "1FDAW57R78E"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/10/2020",
        "dateOfIncident": "01/01/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11298415,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT STATED THEIR COMPANY OWNS A 2008 FORD F-550 SD. THE CONTACT STATED THE VEHICLE'S HEATER CHORD HAD FAILED A TOTAL 5 TIMES IN THE PAST 2 YEARS. THE VEHICLE HAD BEEN TAKEN TO THE DEALER (ROESH FORD LOCATED AT 303 W GRAND AVE BENTONVILLE IL 60106  PHONE NUMBER: 630-279-6000) WHO REPLACED THE HEATER CHORD A TOTAL OF THREE TIMES, HOWEVER, THE FAILURE PERSIST. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE APPROXIMATE FAILURE MILEAGE WAS 150,000.",
        "vin": "1FDAF57R28E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/07/2018",
        "dateOfIncident": "03/01/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11076629,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 FORD F-550 SD. WHILE DRIVING 65 MPH, THE CONTACT HEARD AN ABNORMAL NOISE COMING FROM THE ENGINE COMPARTMENT AND THE VEHICLE STALLED. THE CHECK ENGINE AND ENGINE OVERHEATING INDICATORS ILLUMINATED DURING THE FAILURE.  THE VEHICLE WAS TOWED TO CHAPMAN FORD OF HORSHAM (1100 EASTON RD, HORSHAM, PA 19044) WHERE IT WAS DIAGNOSED THAT THE ENGINE FAILED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED AND STATED THAT THE VEHICLE WAS OUT OF WARRANTY. THE FAILURE MILEAGE WAS 33,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/29/2016",
        "dateOfIncident": "02/12/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10839026,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 FORD F-550 SD. WHILE DRIVING APPROXIMATELY 55 MPH, THE CHECK ENGINE WARNING INDICATOR ILLUMINATED AND A \"STOP SAFETY NOW\" MESSAGE DISPLAYED. THE VEHICLE WAS MANEUVERED TO THE SIDE OF THE ROAD. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE EXHAUST FUEL TEMPERATURE SENSOR WOULD NEED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER ISSUED A RECALL FOR THE 2011-2012 MODEL YEAR VEHICLES ASSOCIATED WITH NHTSA CAMPAIGN NUMBER: 13V535000 (ENGINE). THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 110,000.",
        "vin": "1FDAF56R68E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/27/2015",
        "dateOfIncident": "07/08/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10713207,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WE BOUGHT THIS TRUCK AND PAID OVER 30K AND PUT DOWN 10K. THEY NEVER GAVE US THE FULL REPORT HISTORY OF THE TRUCK... WITH TWO TO THREE MONTHS THE ENGINE WENT OUT. WE TOOK IT TO THE MECHANIC AND HE TOLD US ITS NOT WORTH IT. THE ENGINE IF REPLACED WILL GO OUT AGAIN. FORD HAD A DIFFERENTCOMPANY BUILD THE ENGINES AND ALL OF THERE ENGINES WERE BAD. I BELIEVE FROM 2006 TO 2008 UNTIL FORD TOOK OVER. SO, WE BOUGHT THIS TRUCK FROM 1900 HAMNER AVE, NORCO, CA 92860  (951) 737-6151. WE CONTACTED THEM AND THEY DID NOTHING ABOUT IT. SO, NOW I AM STILL MAKING MONTHLY PAYMENTS OF 543 A MONTH AND THE TRUCK BROKE DOWN AROUND JUNE JULY OF2014. I'VE BEEN PAYING FOR STORAGE PLUS MONTHLY TRUCK PAYMENT. THIS COMPANY KNEW THE HISTORY OF THE TRUCK BUT THEY WENT AHEAD AND SOLD IT TO US. I FOUND OUT THE HISTORY BECAUSE THE LAWYER RECOMMENDED THAT TO ME. I GUESS ITS HARD FOR LEMON COMMERCIAL TRUCK TO HANDLE. I JUST WANT MY MONEY BACK AND FOR THEM TO TAKE THE TRUCK BACK. THEY HAVE BEEN FRAUDULENT ABOUT THIS.  *TR",
        "vin": "1FDAW56R88E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/27/2015",
        "dateOfIncident": "07/16/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10713225,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 FORD F-550. THE CONTACT STATED THAT WHILE DRIVING AT UNKNOWN SPEED, THE VEHICLE STARTED TO LOSE POWER AND THE ENGINE WARNING LIGHT ILLUMINATED. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC. THE TECHNICIAN DIAGNOSED THAT THE ENGINE WAS FAULTY. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 150,000. ...UPDATED 06-12-15 *BF  THE CONSUMER STATED THE DEALERSHIP BOUGHT THE TRUCK BACK. THE ISSUE WAS RESOLVED. UPDATED 06/30/15*JB",
        "vin": "1FDAW56R88E"
    },
    {
        "components": "POWER TRAIN,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/19/2015",
        "dateOfIncident": "01/08/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10676458,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRUCK HAS NOT RUN PROPERLY SINCE IT WAS PURCHASED, AND THE MOTOR WAS REPLACED BACK IN 2013 WITH MILEAGE OF 31,00 DUE TO OIL BEING SPLATTERED ALL OVER AND NO POWER. WE HAD SPEND OVER 10,000.00 TO FIX THE DEFECTIVE ISSUES. NOW ALMOST 2 YEARS TO THE DAY THE ENGINE HAS AGAIN FAILED. FORD OFFERS NO HELP OR EXPLANATIONS AS TO WHY THIS CONTINUES TO HAPPEN..   *TR",
        "vin": "1FDAF56R38E"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/27/2014",
        "dateOfIncident": "06/28/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10568430,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AT FORTY FIVE MILE AN HOUR THE TRANSMISSION LITERALLY FELL APART INTERNALLY.  MY F-550 HAS ONLY PULLED A TRAILER FIVE TIMES AND IT HAS A COMPLETE TOW PACKAGE.  I WAS NOT TOWING ANYTHING NOR DID I HAVE ANY OTHER WEIGHT ON THE TRUCK WHEN THE TRANSMISSION MADE A LOW CLUNK AND STOPPED FUNCTIONING.  THE F-550 HAS LESS THAN 75000 MILES ON THE ODOMETER, AND HAS BEEN USED VERY SELDOM TO HAUL ANYTHING.  I HAVE SPOKEN TO SEVERAL DEALERSHIPS CONCERNING THIS ISSUE AND FIND THAT MANY OF THESE SAME TRANSMISSIONS HAVE LIKEWISE FAILED.",
        "vin": "1FDAW56R68E"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/13/2014",
        "dateOfIncident": "02/05/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10564224,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RIGHT FRAME RAIL HAS COMPLETELY SEVERED AT THE RIGHT FRONT SHOCK. THE LEFT FRAME RAIL AT THE LEFT FRONT SHOCK IS 80% CRACKED. THE ENGINE CRADLE CROSS MEMBER ATTACHES IN THIS AREA. THE ENTIRE FRONT END OF THE TRUCK HAS DROPPED TWO INCHES. THE FAN SHROUD  HAS DROPPED TO THE POINT THAT THE FAN HAS CUT A GROOVE IN IT. THIS IS A CAB/CHASSIS.  *TR",
        "vin": "1FDAF56Y18E"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/13/2014",
        "dateOfIncident": "02/06/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10564236,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH FRAME RAILS ARE CRACKED AT THE LEFT AND RIGHT FRONT SHOCKS IN THE AREA OF THE ENGINE CRADLE CROSS MEMBER. THIS IS A CAB/CHASSIS TRUCK.  *TR",
        "vin": "1FDAF56YX8E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/21/2014",
        "dateOfIncident": "01/06/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10560786,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE OVERHEATS AND LOOSES POWER AT DIFFERENT SPEEDS; WE HAD OVER $1100.00 IN REPAIRS DONE AND IT STILL OVERHEATS WITH THE WRENCH LIGHT COMING ON, TOOK IT BACK TO MECHANIC AND HE RAN THE CODES AND NOW SAYS IT IS THE OIL COOLER NOT WORKING.  FORD SAID THEY DO NOT HAVE A RECALL ON THIS AND THE HEART OF TEXAS FORD PLACE IN BRADY, TX MECHANIC SAID THERE ARE ALOT OF COMPLAINTS ON THIS OIL COOLER PART FOR THE F550 6.4 DIESEL.  *TR",
        "vin": "1FDAX57R08E"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/21/2013",
        "dateOfIncident": "08/01/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10536573,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FORD 6.4L DIESEL ENGINES (2008-2010) IN F-250, F-350, F-450, AND F-550 TRUCKS CONTAIN RADIATORS THAT WERE IMPROPERLY CONSTRUCTED AND UNABLE TO WITHSTAND ENGINE PRESSURES AND LEAK COOLANT, AND CAN CAUSE CATASTROPHIC ENGINE FAILURES DUE TO OVERHEATING.  FORD REPLACED COUNTLESS RADIATORS IN ITS 6.4L VEHICLES UNDER WARRANTY AND ISSUED A NUMBER OF SERVICE BULLETINS RELATED TO ITS 6.4L RADIATOR FAILURES.  HOWEVER, EVEN ITS REDESIGNED RADIATORS CONTINUE TO FAIL.  IN OUR VERY LOW MILEAGE F550 DIESEL, THE RADIATOR FAILED AT 23000 MILES EVEN AFTER BEING INSPECTED BY FORD AND \"APPROVED\" AS ADEQUATE.  FORD REFUSES TO PROVIDE A FIX.  THE FORD DEALERSHIP TELLS US THAT SOME CUSTOMERS HAVE REPLACED RADIATORS AS MANY AS 10 TIMES, OR MORE.  AN INTERNET SEARCH (E.G., GOOGLE) FOR \"FORD 6.4L RADIATOR\" SHOWS COUNTLESS OTHERS HAVE EXPERIENCED MULTIPLE RADIATOR FAILURES.  AGAIN, FORD IS UNWILLING TO RECALL THE DEFECTIVE ENGINE PARTS OR PROVIDE A WARRANTY REPLACEMENT.  *TR",
        "vin": "1FDAW57R48E"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/20/2013",
        "dateOfIncident": "02/09/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10499419,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 FORD F-550. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS TAKEN TO THE DEALER AND THE TECHNICIAN DIAGNOSED THAT THE FUEL PUMP WAS CLOGGED DUE TO THE FUEL TANK DELAMINATING. AS A RESULT, BOTH THE FUEL PUMP AND THE FUEL TANK NEEDED TO BE REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND OFFERED TO PAY THE REPAIR COSTS FOR THE FUEL PUMP AND A PERCENTAGE OF THE FUEL TANK REPAIR EXPENSE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 20,000 AND THE CURRENT MILEAGE WAS 32,000.",
        "vin": "1FDAF57R38E"
    },
    {
        "components": "WHEELS",
        "crash": true,
        "dateComplaintFiled": "07/25/2012",
        "dateOfIncident": "06/21/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10467610,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AN FORD F-550 DRIVEN BY [XXX], AN EMPLOYEE OF WIREGRASS CONSTRUCTION USDOT-[XXX], HIT MY WIFE'S CAR PUNCTURING THE DRIVER'S SIDE REAR TIRE AND RUINING RIM.  UPON THE EXCHANGE AND THE VESTAVIA POLICE REPORT, DRIVER PRODUCED A PROOF OF INSURANCE OF TRAVELER'S INSURANCE THAT HAD EXPIRED. THIS VEHICLE WAS NOT IN POSSESSION OF THE CURRENT PROOF OF INSURANCE AND HAS STILL NOT RESOLVED OUR CLAIM.      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *TR",
        "vin": "1FDAF56R18E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/19/2012",
        "dateOfIncident": "08/01/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10467342,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM  ORIGINAL OWNER OF A 2008 F-550 SUPERDUTY USED FOR MY BUSINESS.  IT HAS APPROXIMATELY 108,000 AND HAS REQUIRED THE REPLACEMENT OF  ENTIRE ENGINE ASSEMBLY TWICE.  BOTH INSTANCES THE TRUCK WAS TRAVELING DOWN THE INTERSTATE AT HIGHWAY SPEEDS WHEN THE FAILURES OCCURRED AND THE DRIVER WAS UNABLE TO GET TO  SHOULDER OF  ROAD.  BOTH FAILURES ALSO GAVE NO WARNING.   FIRST FAILURE OCCURRED IN AUGUST 2009 @ 32,225 WHEN  DRIVER HEARD A LOUD NOISE COMING FROM  ENGINE AND IT IMMEDIATELY STALLED.  TRUCK WAS TOWED TO DEALER UPON WHICH IT WAS DETERMINED A CONNECTING ROD HAD GONE THROUGH BLOCK.  THERE WAS NO EXPLANATION PROVIDED EXCEPT THE ENGINE WAS STILL UNDER  POWERTRAIN WARRANTY.   SECOND FAILURE OCCURRED  APRIL 2012 @ 107,000 WHILE  DRIVER WAS ON HIS WAY TO DEALER TO GET  RADIATOR FIXED DUE TO A LEAK.  HE WAS ON THE BELTWAY WHEN HE IMMEDIATELY STARTED TO LOOSE POWER, IT STALLED WITH A CHANCE OF GETTING TO SHOULDER.  WHEN TOWED TO THE DEALER, IT WAS DIAGNOSED AS EXCESSIVE COOLANT IN OIL PAN (3 GALLONS) WHICH CAUSED INTERNAL FAILURE TO THE BEARINGS/CRANK/RODS.   ENGINE HAD TO BE REPLACED AGAIN.  THIS TIME  FAILURE WAS CAUSED BY THE WATER PUMP FRONT COVER THAT WAS SEVERELY PITTED ALLOWING COOLANT TO ENTER  ENGINE.  THIS FRONT COVER HAD BEEN REPLACED AROUND 71,000 FOR  SAME PROBLEM, WHICH ACCORDING TO THE MECHANIC, IS COMMON WITH  6.4L ENGINE.  I HAVE SERVICED THIS TRUCK ACCORDING TO FORDS RECOMMENDATIONS. HAVE HAD THE OIL CHANGED MORE FREQUENTLY THAN  10,000 MILE THAT IS RECOMMENDED FOR THE TYPE OF USAGE.  DEALER AGREED THAT 7,500 MILES BETWEEN OIL CHANGES WAS SUFFICIENT SINCE  TRUCK WAS NOT USED IN SEVERE OPERATING CONDITIONS.  CONCERNED FOR  SAFETY OF MY DRIVER SINCE THIS TRUCK HAS STALLED TWICE ON  ROAD RESULTING IN MAJOR ENGINE REPAIRS EVEN THOUGH I HAVE PROPERLY MAINTAINED THE TRUCK.  I HAVE GOOGLED AND FOUND MANY OTHER OWNERS OF FORD TRUCKS WITH 6.4L DIESEL THAT HAVE HAD  SAME PROBLEMS I HAVE HAD.  UPDATED 07/19/12 *BF  UPDATED 10/02/12",
        "vin": "1FDAW57R88E"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/05/2011",
        "dateOfIncident": "12/19/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10394348,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 FORD F550 SD DIESEL. THE CONTACT STATED THAT THE VEHICLE WOULD INDEPENDENTLY DECELERATE WITHOUT WARNING. THE VEHICLE WAS TAKEN TO A DEALER WHO WAS UNABLE TO DIAGNOSE THE PROBLEM. THE MANUFACTURER WAS CONTACTED WHO DID NOT OFFER ANY ASSISTANCE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGE WAS 50,000.",
        "vin": "1FDAF56RX8E"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "03/28/2011",
        "dateOfIncident": "12/08/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10393538,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE - EATON HYBRID FORD F550DR BUCKET TRUCK VIN [XXX]. DRIVING ON IH 35 AT APPROX. 50 MPH, TRAFFIC CAME TO AN ABRUPT STOP. I HIT THE BRAKES ON THE HYBRID TRUCK AND THE BRAKE PEDAL WENT TO THE FLOOR ( I WAS PUSHING THE PEDAL VERY HARD ), THE FRONT AND REAR TIRES DID NOT LOCK UP NOR DID I FEEL THE BRAKE PEDAL PULSATE INDICATING THE ABS HAD BEEN ACTIVATED. I HIT A VAN FROM BEHIND HARD ENOUGH TO  PUSH IT FORWARD AND THEN HIT IT A SECOND TIME  AND PUSHED IT UNTIL THE VAN BROUGHT US TO A STOP. I BELIEVE THE BRAKES FAILED, IT OCCURRED ONLY ONCE, RESULTING IN A COLLISION. I THINK THAT THE ADDED WEIGHT OF THE  BATTERIES AND THE AERIAL TOWER ON THE 550 CHASIS IS MORE THAN THE BRAKES ON THE TRUCK ARE ABLE TO HANDLE. THE TRUCK WAS SENT FOR BODY REPAIR AND THEN TO RIATA FORD IN MANOR TX FOR THE BRAKES TO BE CHECKED. ACCORDING TO THE QUALITY CARE REPORT  \" TEST DRIVE VEHICLE AND BRAKE SYSTEM IS OPERATING PROPERLY. \" NO PARTS WERE REPLACED.  *TR",
        "vin": "1FDAF56R88E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/29/2010",
        "dateOfIncident": "06/20/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10373328,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 FORD F-550. WHILE DRIVING APPROXIMATELY 50 MPH, THE CHECK ENGINE WARNING LIGHT ILLUMINATED AND THE CONTACT SMELLED A STRONG ODOR OF EXHAUST FUMES INSIDE THE CABIN. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHERE THEY REPLACED THE EXHAUST INLET PIPE AND OXIDATION CATALYTIC CONVERTER. THE FAILURE MILEAGE WAS 43,975.  UPDATED 12/05/2011 *LN",
        "vin": "1FDAF56R28E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/03/2010",
        "dateOfIncident": "05/16/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10363872,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 FORD F-550 SUPERDUTY. THE CONTACT STATED THAT THE ACR COOLER FAILED WHICH CAUSED ANTIFREEZE TO BE INJECTED INTO THE ENGINE FORMING A FUEL CLOUD BEHIND THE VEHICLE. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALERSHIP WHERE THE CONTACT WAS TOLD TO MONITOR THE COOLANT AND CHANGE IT EVERY 15,000 MILES. THE DEALER INSTALLED A NEW ACR COOLER BUT THE FAILURE CONTINUED. THE CONTACT CALLED THE MANUFACTURER AND WAS AWAITING A RESPONSE. THE VIN WAS UNAVAILABLE. THE CURRENT MILEAGE WAS APPROXIMATELY 60,000. THE FAILURE MILEAGE WAS APPROXIMATELY 20,000.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/20/2010",
        "dateOfIncident": "07/24/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10361340,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 FORD F-550. THE CONTACT THAT THE CRUISE CONTROL SHUT OFF SUDDENLY. THERE WAS A LOSS OF POWER WHEN IT SHUT OFF. THE DEALER INSPECTED THE VEHICLE BUT WAS UNABLE TO DUPLICATE THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 15,000 AND THE CURRENT MILEAGE WAS APPROXIMATELY 20,000.",
        "vin": "1FDAW56R48E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "10/01/2010",
        "dateOfIncident": "09/30/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10358591,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE INTERSTATE MY VEHICLE LOST POWER VERY QUICK. RUST IN THE FUEL TANK CLOGGING THE FILTER STOPPED FUEL TO THE ENGINE WAS THE PROBLEM AFTER STOPPING SEVERAL TIMES. HAVING NO SHOULDER ON THIS AREA OF THE INTERSTATE TO EXIT THE FLOW OF TRAFFIC, AN EIGHTEEN WHEELER NEARLY KILLED US ALL.  WE HAD THE TANK REMOVED AND CLEANED.  *TR",
        "vin": "1FDAW56RX8E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/24/2009",
        "dateOfIncident": "02/17/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10259808,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE WAS PURCHASED NEW AND AT 14,000 MILES IT STARTED BOGGING AND THE CHECK ENGINE LIGHT CAME ON AND THE VEHICLE DIED OUT AROUND 5 TIMES, AFTER THE DEALERSHIP SAT ON THE VEHICLE FOR 5 DAYS WITHOUT DIAGNOSING I MOVED THE VEHICLE TO A DIFFERENT DEALERSHIP WHERE THEY CONDUCTED A SERVICE BULLETIN FOR ECM REPROGRAMMING NOW AT 16,000 MILES THE VEHICLE IS DOING IT ALL OVER AGAIN AND NOT TO MENTION RADIATOR LEAKING, BRAKES SQUEALING, TRANS FLUID SEEPAGE AND FUEL LEVEL GAUGE NOT OPERATING CORRECTLY. PLEASE HELP!!!! $65,000 VEHICLE THEY SHOULD BE FORCED TO BUY IT BACK. *TR",
        "vin": "1FDAF56R68E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/22/2008",
        "dateOfIncident": "07/18/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10235256,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "EVENTS LEADING UP TO THE FAILURE IS TYPICAL OVER ROAD DRIVING. THE FAILURE IS WITH THE MAIN COOLING RADIATOR, AFTER ABOUT 20,000 IT BEGINS TO LEAK AT THE DRIVERS SIDE BOTTOM LEFT CORNER. CONSEQUENCES ARE THE VEHICLE IS NOT DRIVABLE UNTIL REPAIRS ARE MADE. THE TRUCK WAS PURCHASED IN JUNE 2007 AND WE ARE NOW HAVING TO REPLACE THE THIRD RADIATOR. THE TRUCK WAS UNDER WARRANTY WITH THE FIRST REPLACEMENT, WE HAD TO PAY A WARRANTY ADJUSTMENT WITH THE SECOND RADIATOR. NOW WITH THE THIRD ONE GONE OUT THEY WANT US TO PAY FOR THE ENTIRE REPLACEMENT COST. *TR",
        "vin": "1FDAW56RX8E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/17/2008",
        "dateOfIncident": "09/05/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10221423,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 FORD F-550 SD.  WHILE DRIVING AT ANY SPEED, WHITE SMOKE POURS FROM THE EXHAUST TIPS.  THE VEHICLE WAS TAKEN TO THE DEALER AND THEY PERFORMED A DIAGNOSTIC, WHICH HAS NOT BEEN CONCLUDED.  THE SMOKE FROM THE EXHAUST IS OCCURRING MORE FREQUENTLY.  THE CONTACT BELIEVES THAT DIESEL FUEL IS MIXING WITH THE MOTOR OIL.  THE RADIATOR HAS BEEN REPLACED THREE DIFFERENT TIMES.  THE CURRENT MILEAGE WAS 38,900 AND FAILURE MILEAGE WAS 20,000.",
        "vin": "1FDAF56R68E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/30/2007",
        "dateOfIncident": "06/15/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10197789,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 FORD F-550.  WHILE DRIVING 70 MPH, THE VEHICLE LOST POWER AND THE SPEED IMMEDIATELY DECREASED TO 15 MPH.  THERE WERE NO WARNING INDICATORS.  THE CONTACT PULLED OVER AND THE VEHICLE WAS TOWED TO THE DEALER.  THE DEALER WAS UNABLE TO DETERMINE THE CAUSE OF FAILURE,  HOWEVER, THEY HAD TO REPLACE THE WIRE HARNESS TO RESTART THE VEHICLE.  THE CURRENT MILEAGE WAS 18,000 AND FAILURE MILEAGE WAS 16,000.",
        "vin": "1FDAW56R68E"
    }
]