[
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/02/2011",
        "dateOfIncident": "06/26/2011",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10416621,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "SALEM",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 FOREST RIVER SALEM TRAILER. THE CONTACT STATED THAT BOTH FRONT AND REAR AXLES WERE SEVERELY DAMAGED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO ADVISED THAT THE FOUR LEAF SPRINGS WERE POORLY DESIGNED AND DANGEROUS. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS MADE AWARE PROBLEM. THE FAILURE AND CURRENT MILEAGE WAS UNKNOWN.",
        "vin": "4X4TSMD208R"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "04/18/2011",
        "dateOfIncident": "02/26/2011",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10396715,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "SALEM",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "CARLISLE TIRE & RUBBER CO",
                "productMake": "CARLISLE",
                "productModel": "CARLISLE",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "PURCHASED A 2008 FLAGSTAFF TRAILER MODEL 31FKBBS IN JUNE 2009.  HAVE HAD THREE TIRE BLOW OUTS ONE EACH IN OCTOBER 2009, JULY 2010, AND FEB 2011 AND A WHEEL BEARING FAILURE POSSIBLY CAUSED BY LAST BLOW OUT IN FEB 2011.  UNABLE TO TOW TRAILER IN EXCESS OF 45 MPH BECAUSE OF TIRE PROBLEM. AFTER LAST TIRE BLOWOUT TIRE DEALER POINTED OUT DATA ON TRAILER STATES TIRES SHOULD BE ST225/75R15 LOAD RANDE D VS. ST205R/7515  TIRES THAT CAME ON TRAILER.  OVER $3000 IN TIRES AND REPAIR COST.  DEALER CLAIMS THAT FORREST RIVER SUPPLIED INCORRECT TIRES.  HAVE ONE OF THE BLOWN OUT TIRES AND RECEIPTS FOR THE REPAIRS TO THE TRAILER AND TIRE REPLACEMENT.  *TR",
        "vin": "4X4TFLG2581"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/26/2009",
        "dateOfIncident": "08/25/2009",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10289871,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "SALEM",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE A 2008 FOREST RIVER SURVEYOR MODEL 301 30 FT TRAVEL TRAILER EQUIPPED WITH LIPPERT AXLES. WE WERE ON VACATION AND WE HEARD A LOUD BANG LIKE A TIRE BLOWING OUT. I PULLED OVER GOT OUT AND INSPECTED THE TRAILER AND MY TOW VEHICLE AND FOUND NOTHING WRONG. WITHIN 600 MILES MY RT REAR TIRE WENT BALD ON THE OUTSIDE  AND I TOOK IT TO A TIRE DEALER IN  KALLISPELL MONTANA AND THEY PUT MY SPARE TIRE ON. WE THEN DROVE HOME. I INSPECTED THE TRAILER AND FOUND THE LEFT FRONT TIRE BALD AND ONE OTHER TIRE GOING BALD. I HAD THE TIRES REPLACED AND TOOK THE TRAILER TO MY DEALER AND POINTED OUT TO THEM THAT THE FRONT AXLE WAS BENT UPWARD IN THE MIDDLE AND THE FRONT AXLE SHACKLES WERE NOT TIGHT AGAINST THE FRAME. THE AXLE IS ACTUALLY TOUCHING THE FLOOR IN THE MIDDLE. PICTURES WERE SENT TO THE MANUFACTURER AND THEY INSIST IT IS A TIRE PROBLEM ANGOODYEAR SAYS IT IS AN AXLE PROBLEM. I FILED A REPORT WITH GOODYEAR AND I TOOK THE TIRE TO AN INDEPENDENT TIRE EXPERT AND BOTH CONFIRMED IT WAS A MISALIGNED OR DAMAGED AXLE. I DID NOTHING ON THE TRIP TO CAUSE THIS PROBLEM.THE AXLE IS A MODEL 3500 BUT I CANNOT GET ANYONE TO GIVE ME A MANUFACTURE DATE.REPEATED CALLS TO FOREST RIVER HAVE BEEN UNANSWERED.ONE OTHER PROBLEM I FOUND WITH THE AXLES WEREPLASTIC DUST COVERS OVER THE AXLE BEARINGS HAD DISINTEGRATED(THIS WAS BEFORE THE TRIP). I TOOK THE RV TO MY DEALER AND THEY REPACKED THE BEARINGS AND REPLACED THE REAR SEALS.I REPLACED THE DUST COVERS WITH METAL ONES. WHEN I CALLED LIPPERT AND DISCUSSED MY AXLE PROBLEM I BROUGHT THE DUST COVER PROBLEM TO THEIR ATTENTION AND THEY SAID THEY WEREN'T USING THEM ANY MORE. I ASKED THEM WHEN THEY STOPPED AND THEY DIDN'T KNOW WHEN. THE RV HAS BEEN AT THE DEALER FOR 6 WEEKS AND NOBODY CAN TELL MEWHAT CAUSED THE AXLE TO FAIL. THIS IS A SAFETY HAZARD THAT SOMEONE NEEDS TO LOOK INTO. I AM NOT MOVING THIS RV UNTIL THE PROBLEM IS IDENTIFIED PROPERLY REPORTED AND FIXED.  NOTE:  ON YOUR WEBSITE \"SURVEYOR\" MODEL NOT LISTED SO I LISTED \"SALEM\" TO PROCEED. *TR",
        "vin": "4X4TSVF278L"
    }
]