[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "12/02/2015",
        "dateOfIncident": "06/12/2015",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10808023,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "WILDWOOD",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Cooper Tire & Rubber Co.",
                "productMake": "POWER KING",
                "productModel": "TOWMAX",
                "productYear": "9999",
                "size": "ST225/75R15",
                "type": "Tire"
            }
        ],
        "summary": "NEW TIRES INSTALLED  APRIL 2013 ON OUR 2008 FOREST RIVER, WILDCAT FIFTH WHEEL TRAVEL TRAILER BY LES SCHWAB IN FOLSOM, CA.   POWERKING TOWMAX ST225/75R15      MAY 2013, FOLSOM, CA. TO PORT ANGELES, WA.  AND RETURN TOTAL MILES THIS TRIP 1664.     JULY 2013, FOLSOM, CA. TO ROSEBURG, ORE. AND RETURN TOTAL MILES THIS TRIP 894.     DEC. 2014, FOLSOM, CA. TO ROCKLIN, CA. AND RETURN TOTAL MILES THIS TRIP 20.     NO OTHER TRIPS WERE MADE IN 2014 DUE TO KNEE REPLACEMENT SURGERIES.   JUNE 12, 2015 DEPARTED FOLSOM, CA.,  TIRE A BLEW OUT FIVE MILES SOUTH OF GRANTS PASS, ORE.   TOTAL MILES THIS TRIP TRIP 354.   LIMPED INTO LES SCHWAB IN GRANTS PASS, ORE.  THEY  REPLAICED A AND AFTER CHECKING THE OTHER THREE TIRES THEY REPLACED TIRE B AS IT WAS BOWED OUT IN THE TREAD.  THERE WAS NO CHARGE. WE THEN CONTINUED ON TO PORT ANGELES, WA.     JUNE 25, 2015 357 MILES OUT OF PORT ANGELES, WA.,   NEAR COTTAGE GROVE, ORE.  TIRE C BLEW OUT WITH 3767 MILE ON IT, WE MANAGED TO GET TO A REST STOP THAT WAS ABOUT .25 MI. AHEAD.  CALLED LES SCHWAB IN COTTAGE GROVE.  THEY SENT OUT ROADSIDE SERVICE TO CHANGE TIRE C. THE SERVICE MECHANIC CHECKED TIRE D WHICH WAS BOWED OUT ON THE TREAD AND HE SAID IT WAS SAFE TO TRAVEL ON. WE WERE CHARGED $98.00 FOR THE SERVICE CALL AND HE PRO RATED THE TIRE AT 63% AND CHARGED $33.94 FOR IT. WE CONTINUED ON TO FAMILY 20 MILES WEST OF ROSEBURG.      JUNE 26, 2015 REMOVED TIRE D AND TOOK IT INTO ROSEBURG LES SCHWAB TO BE CHECKED FOR SAFETY AS IT WAS BOWED OUT JUST LIKE TIRE B HAD BEEN.   TIRE A FRONT LEFT, TIRE C BACK LEFT, TIRE D FRONT RIGHT, TIRE B BACK LEFT.",
        "vin": "4X4FWCD248V"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "01/06/2009",
        "dateOfIncident": "07/19/2008",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10253971,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "WILDWOOD",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "CARLISLE TIRE & RUBBER CO",
                "productMake": "CARLISLE",
                "productModel": "RADIAL TRAIL",
                "productYear": "9999",
                "size": "245/75R16",
                "type": "Tire"
            }
        ],
        "summary": "WE EXPERIENCED A BLOWOUT OF A TIRE ON MY CAMPER TRAILER. THE TIRES WERE INSTALLED WITH DEFECTIVE TIRE VALVES, AS VERIFIED BY THE TIRE DEALER. ALL 4 TIRES ON THE CAMPER WERE REMOVED AND REPLACED AS WELL AS NEW VALVE STEMS. *TR",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "12/12/2008",
        "dateOfIncident": "09/08/2008",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10251627,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "WILDWOOD",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "TOWMASTER",
                "productMake": "TOWMASTER",
                "productModel": "TOWMASTER",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TOW-MASTER ST 205/75R15 MADE IN INDONESIA SIDE WALL BLOW OUT [ HAVE PICTURE OF BULGE] TWO TIRES BLEW OUT ON TRAILER WITHIN 200 KM. COMPANY WILL NOT GIVE ANY WARRANTY AT ALL. WE HAVE BOUGHT REPLACEMENT TIRES FOR ALL FOUR HUBS. *TR",
        "vin": "4X4TWDY238T"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/26/2008",
        "dateOfIncident": "06/17/2008",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10249916,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "WILDWOOD",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 FOREST RIVER WILDWOOD.  IMMEDIATELY AFTER PURCHASING THE VEHICLE ON JUNE 17, 2008, THE ELECTRICAL AWNING BEGAN TO COLLECT WATER, WHICH PREVENTED IT FROM RETRACTING ON ITS OWN.  THE DEALER STATED THAT THE SENSOR USED TO RETRACT THE AWNING DID NOT EXIST AND WAS REPLACED WITH A MANUAL AWNING.  A FEW DAYS LATER, THE CONVERTER BOX BEGAN TO OVERHEAT AND THE VEHICLE LOST POWER.  THE DEALER STATED THAT THE FAN FOR THE CONVERTER BOX WAS DEFECTIVE.  THE CONVERTER BOX WAS REPLACED.  THE DEALER RETURNED THE CONVERTER BOX TO THE MANUFACTURER TO BE INSPECTED.  THE MANUFACTURER THEN RETURNED THE CONVERTER BOX TO THE DEALER AND STATED THAT IT WAS NOT DEFECTIVE.  THEY SUGGESTED THAT THERE MAY HAVE BEEN AN OVERLOAD ON THE SWITCHES, WHICH COULD CAUSE A FIRE.  THE CONTACT WAS INFORMED TO TAKE THE VEHICLE BACK TO THE DEALER FOR REPAIRS.  AFTER THESE FAILURES, THE VEHICLE BEGAN LEAKING PROPANE, WHICH CAUSED THE HEATER NOT TO WORK.  THE MANUFACTURER WAS NOTIFIED AGAIN AND THEY INFORMED THE CONTACT TO FAX THEM ALL OF THE FAILURE DOCUMENTATION IN ORDER TO INVESTIGATE THE MATTER.   THE FAILURE MILEAGE WAS NOT APPLICABLE.",
        "vin": "4X4TWBE238U"
    },
    {
        "components": "SUSPENSION,TIRES,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "11/12/2008",
        "dateOfIncident": "06/01/2008",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10248611,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "WILDWOOD",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "TOWMASTER",
                "productMake": "TOWMASTER",
                "productModel": "TOWMASTER",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            },
            {
                "manufacturer": "Lippert",
                "productMake": "LIPPERT",
                "productModel": "3500 (AXLE)",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "AUGUST 2006 I PURCHASED A 28-FOOT TRAVEL TRAILER FROM MY LOCAL DEALER IN HELENA MONTANA. THE TRAVEL TRAILER IS MANUFACTURED BY FOREST RIVER.    IN THE BARELY 14 MONTHS I HAVE OWNED THE TRAVEL TRAILER, THE TIRES HAVE BEEN REPLACED ONCE AND ARE AGAIN IN NEED OF REPLACEMENT. (LESS THAN 5,000 MILES.) AN AXLE HAS ALSO BEEN REPLACED.  I BELIEVE THIS VEHICLE IS UNSAFE TO OPERATE AS IT WAS BUILT WITH DEFECTIVE OR UNDER-RATED PARTS. THE MANUFACTURER REFUSES TO ACKNOWLEDGE THIS AND ONLY WANTS TO REPLACE THE TIRES YET AGAIN. I AM CONCERNED THAT THE CONTINUED USE OF THIS TRAVEL TRAILER POSES A SIGNIFICANT HAZARD TO THE SAFETY OF MYSELF AND FELLOW MOTORISTS. I WOULD LIKE TO REQUEST AN INVESTIGATION AND SUGGESTION FOR RESOLUTION. *TR",
        "vin": "4X4TPUD2X8P"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "05/30/2008",
        "dateOfIncident": "05/26/2008",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10229280,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "WILDWOOD",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FIRST TRIP OUT WITH A 2008 FOREST RIVER XLR 30X12 TOYHAULER AND HEARD A LOUD BOOM. PULLED OVER AND THE RIGHT REAR TIRE WAS BLOWN. IT HAPPENED AT 60-65 MPH ON THE HIGHWAY. THE ROAD WAS SMOOTH AND I FELT THE BRAKE DRUM TO CHECK IF IT WAS HOT FROM MAYBE DRAGGING BRAKES, BUT IT WAS COOL. THE TIRES HAVE UNDER 250 MILES ON THEM. THE TRAILER WAS DAMAGED FROM THE TREAD SEPARATING FROM THE TIRE, AND THE WIRING FOR THE BRAKES WAS RIPPED APART ON THAT AXLE. AFTER GETTING THE TRAILER HOME I DID SOME RESEARCH AND FOUND OUT THAT THE TIRE WAS MANUFACTURED IN 2004 AND ITS INSTALLED ON A 2008 TRAILER. I ALSO FOUND OUT THE DATA PLATE ON THE TRAILER HAD THE INCORRECT TIRE PRESSURE AND INCORRECT TIRE SIZE, THIS DIDN'T MATCH WHAT THE TRAILER HAD FOR INSTALLED TIRES. I CALLED FORREST RIVER AND THEY SAID THEY WOULD SEND A NEW DATA STICKER BUT THE DAMAGE TO THE TRAILER WAS NOT GOING TO BE COVERED, IT WAS A TIRE MANUFACTURE ISSUE.   DATA PLATE ON TRAILER HAS THE TIRES ST235/80R16/D AT 65 PSI COLD  TIRES INSTALLED ON THE TRAILER- GREENBALL HIWAY TROOPER LT235/85R16 LRE SIDEWALL INFLATION 8O PSI . TIRE WERE INFLATED TO 65PSI AS RECOMMENDED ON THE DATA PLATE. FOREST RIVER HASN'T OFFERED TO COVER THE COST OF REPAIR OR ADMIT ANY WRONG DOING BUT SAID THEY WILL SEND ME A NEW DATA PLATE STICKER.  *TR",
        "vin": "4X4FASF258W"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/25/2008",
        "dateOfIncident": "04/19/2008",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10225758,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "WILDWOOD",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED NEW. TOWED LESS THAN 150 MILES, TANDEM AXLE FIFTH WHEEL CAMPER. LEFT REAR AXLE \"U\" BOLTS WERE NOT TIGHTENED AT THE FACTORY CAUSING REAR AXLE TO SHIFT REARWARD THE LENGTH OF THE LEAF SPRING DESTROYING THE REAR AXLE, BRAKE WIRES TORE LOOSE, \"U\" BOLTS BENT BEYOND USE, REAR LEAF SPRING AND MOUNTING POCKETS BENT. OTHER SECONDARY DAMAGE TO CAMPER. WORKING ON HAVING TOWED TO NEAREST DEALER TO BE REPAIRED.  THIS IS A WORKMANSHIP FAILURE. I'VE SEEN OTHERS LISTED ON FORUMS BY THIS MANUFACTURER, APPEARS TO BE A QUALITY CONTROL TREND. THE ACCIDENT COULD HAVE LEAD TO INJURIES OR DEATH. THE CAMPER SHIFTED TWO FEET INTO THE LANE BESIDE ME AND ALL FOUR TIRES WERE HOWLING AND SMOKING PROFUSELY. THIS VEHICLE IS A 2008 FOREST RIVER WILDCAT 31THSB. YOUR COMPLAINT SYSTEM IS OUT OF DATE AND IT FORCED ME TO SELECT WILDWOOD AND THAT'S NOT THE MODEL.  *TR",
        "vin": "4X4FWCG298V"
    }
]