[
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "08/08/2021",
        "dateOfIncident": "06/27/2021",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11428227,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I was riding my motorcycle with a group of bikes and had to make an emergency stop. When the brakes were applied, as directed in the owners manual, the ABS failed and caused the rear tire to lock and skid. The resulting skid caused a loss of control of the motorcycle and ultimately laying the bike down on the asphalt highway. This resulted in the rider and passenger sustaining injuries. The passenger received a Tramatic Brain Injury which a month and a half later she is still in recovery. The motorcycle has not yet been repaired or looked at by any Police or Technical personnel. There were no warnings or lights prior to the accident.",
        "vin": "1HD1FC4158Y"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/25/2020",
        "dateOfIncident": "03/14/2020",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322224,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TRAVELING ABOUT 35MPH AND APPROACHING AN INTERSECTION NEAR MY HOME. I HAD TO STOP QUICKLY AS A CAR TURNED INTO MY LANE JUST A HEAD OF ME.  I APPLIED THE FRONT AND REAR BRAKES OF MY MOTORCYCLE BUT THE FRONT BRAKE LEVER DID NOT MOVE AT ALL.  IT WAS AS IF IT WAS FROZEN IN PLACE.  I HAD NO CONTROL OF THE FRONT BRAKES.  I WAS ABLE TO SLOW USING THE REAR BRAKE AND AVOIDED A COLLISION BY STEERING OUT OF THE WAY.  AFTER ARRIVING HOME AND INVESTIGATING, I FOUND THE ABS MODULE HAD FAILED.  I ALSO FOUND THIS IS AN ISSUE KNOWN BY HARLEY DAVIDSON OF THEIR 2008-2014 MOTORCYCLES WITH ABS.  THEIR SOLUTION, IS TO BLEED THE BRAKE FLUID EVERY TWO YEARS NO MATTER WHAT.  I DO THAT MYSELF EVERY TWO YEARS.  THERE IS NO GUARANTEE THAT IF I REPLACE THE ABS MODULE, AT SIGNIFICANT COST, THAT A FAILURE WON'T HAPPEN AGAIN.",
        "vin": "1HD1FC4158Y"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/11/2020",
        "dateOfIncident": "01/02/2014",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11317570,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 HARLEY DAVIDSON ELECTRA GLIDE ULTRA FLHTCUI. THE CONTACT RECEIVED NOTIFICATION OF NHTSA RECALL NUMBER: 18V076000 (SERVICE BRAKES, HYDRAULIC). THE VEHICLE WAS TAKEN TO GREELEY HARLEY-DAVIDSON AND WILD WEST MOTORSPORTS, INC. LOCATED AT (3010 29TH ST, GREELEY, CO 80631 (970) 351-8150) TO PERFORM THE RECALL REPAIR. THE BRAKE SYSTEM WAS FLUSHED REFILLED WITH PLATINUM DOT 4 BRAKE FLUID. THE CONTACT STATED THAT WHILE RIDING THE MOTORCYCLE, THE BRAKES FAILED TO OPERATE AS DESIGNED AFTER THE RECALL REPAIR WAS PERFORMED. THE MOTORCYCLE WAS TAKEN BACK TO THE SAME DEALER. THE TECHNICIAN SOUGHT PERMISSION FROM THE MANUFACTURER TO AUTHORIZE AN ADDITIONAL REPAIR HOWEVER, THE MANUFACTURER DECLINED TO AUTHORIZE A SECOND REPAIR. THE CONTACT PURCHASED A REPLACEMENT PART AND REPAIRED THE MOTORCYCLE HOWEVER, THE FAILURE PERSISTED. THE FAILURE MILEAGE WAS 60,000.",
        "vin": "1HD1FC4358Y"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/17/2019",
        "dateOfIncident": "09/11/2019",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11256221,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 HARLEY-DAVIDSON FLHTCU. WHILE RIDING  AND ATTEMPTING TO STOP, THE REAR BRAKES MALFUNCTIONED AND WERE INOPERABLE. MOMENTS LATER, BOTH THE REAR AND FRONT BRAKES MALFUNCTIONED AND THE MOTORCYCLE DID NOT IMMEDIATELY STOP, NEARLY CAUSING A CRASH. THE MOTORCYCLE WAS TAKEN TO CENTENNIAL PARK HARLEY-DAVIDSON (12477 E. BROAD ST SW, PATASKALA, OH) WHERE IT WAS DIAGNOSED THAT THE BRAKE HYDRAULIC UNIT AND MASTER CYLINDER NEEDED TO BE REPLACED. THE OWNER WAS INFORMED THAT THE VEHICLE COULD NOT BE REPAIRED PER NHTSA CAMPAIGN NUMBER: 18V016000 (SERVICE BRAKES) WITHOUT REPLACING THE MASTER CYLINDER AND HYDRAULIC SYSTEM. THE MOTORCYCLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 21,000.",
        "vin": "1HD1FC4468Y"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/14/2019",
        "dateOfIncident": "03/01/2019",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11186861,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 HARLEY-DAVIDSON FLHTCU. WHILE DRIVING 45 MPH, THE FRONT BRAKES WERE APPLIED, BUT FAILED TO RESPOND. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE VEHICLE WAS TAKEN TO HANNUM'S HARLEY-DAVIDSON (1011 W BALTIMORE PIKE, MEDIA, PA 19063, (610) 566-5562) WHERE IT WAS DIAGNOSED THAT THE ABS MODULE NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS CONTACTED AND REFERRED THE CONTACT TO THE LOCAL DEALER FOR SERVICE. THE FAILURE MILEAGE WAS 11,000.",
        "vin": "1HD1FC4198Y"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/28/2019",
        "dateOfIncident": "02/20/2019",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11183127,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 HARLEY-DAVIDSON FLHTCU (ULTRA CLASSIC). WHEN REVERSING THE VEHICLE, THE CONTACT APPLIED THE BRAKES, BUT THE VEHICLE DID NOT STOP. HARLEY-DAVIDSON OF GREENVILLE (30 CHROME DR, GREENVILLE, SC 296615) DIAGNOSED THAT THE BRAKES NEEDED TO BE REPLACED. THE MANUFACTURER WAS CONTACTED AND DID NOT ASSIST. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 30,000. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/30/2018",
        "dateOfIncident": "06/23/2018",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11123476,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I,M LIVING IN THE NETHERLANDS. OWNER OF A HARLEY DAVIDSON. MY STEEL REAR BRAKELINE WAS SANDED THROUGH.( RESULT NO BRAKE WHILE RIDING) I WENT TO MY DEALER IN BELGIUM, I REPORTED BY THE AFTERSALES MANAGER MR. ANDERSON HARLEY DAVIDSON BENELUX. I ASKED THEM TO TAKE ACTION. (SAFETY RESEARCH) I SENT A E-MAIL TO HARLEY DAVIDSON COMPANY. ( MILWAUKEE) NO REACTION. IN MY E-MAIL I ASK SEVERAL TO DO RESEARCH, I TOLD THEM THAT THEIR ARE RESPONSIBLE, TAKE CARE ABOUT SAFETY OF ALL ROAD USERS. ( NO REACTION. I WROTE THAT I TAKE RESPONSIBILTY AND I REPORT IT BY COMPETENT AUTHORITIES.  I REPORT IT BY : N.H.T.S.A. ( COUNTRY OF MANUFACTERING), BELGIUM, OFFICE OF HOMOLOGATIE VAN VOERTUIGEN, NETHERLANDS, R.D.W. ( NATIONAL ROAD SECURITY) I HAVE THE BROKEN BRAKELINE IN MY POSSESSION. I OFFER THE BELGIUM OR DUTCH INSPECTION THIS BRAKELINE FOR A CHECK WHEN REQUIRED. I HOPE YOU CAN HELP. PLEASE INFORM ME.",
        "vin": "5HD1FC44X8Y"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/16/2018",
        "dateOfIncident": "08/04/2018",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11120388,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 HARLEY-DAVIDSON FLHTCU. THE CONTACT RECEIVED A RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 18V076000 (SERVICE BRAKES, HYDRAULIC). THE MOTORCYCLE WAS TAKEN TO SANDY'S HARLEY-DAVIDSON SPORT CENTER (11940 N MAPLE ISLAND RD, FREMONT, MI 49412, (231) 924-3020) FOR SERVICING. WHILE THE MECHANIC WAS BLEEDING THE BRAKE FLUID PER THE RECALL, THE ABS MODULE BECAME DAMAGED. THE VEHICLE WAS REPAIRED AT THE CONTACT'S EXPENSE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND ADVISED THE CONTACT TO FILE A COMPLAINT. THE FAILURE MILEAGE WAS APPROXIMATELY 21,000.",
        "vin": "1HD1FC4138Y"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/26/2018",
        "dateOfIncident": "07/26/2018",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11113923,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "KNOWN DEFECT IN THROTTLE POSITION SENSOR WIRING IS NOT BEING CORRECTED BY LOCAL DEALERS WHEN PROBLEM VEHICLES ARE PRESENTED FOR SERVICE. I BELIEVE A RECALL IS WARRANTED TO ENSURE CORRECTIVE ACTIONS ALREADY IDENTIFIED BY THE MANUFACTURER ARE IMPLEMENTED BEFORE MORE OPERATORS/RIDERS ARE PLACED IN DANGER.     THIS DEFECT CAN BE EXTREMELY HAZARDOUS AS THE MOTORCYCLE INSTANTLY REDUCES THE ENGINE POWER AVAILABLE WITHOUT PREVIOUS NOTICE TO THE RIDER, WHICH CAN RESULT IN THE MOTORCYCLE FAILING TO MAINTAIN ADEQUATE SPEED TO MAINTAIN STABILITY IN A TURN. THIS SO-CALLED \"LIMP MODE\" CONTINUES UNTIL THE MOTORCYCLE IS BROUGHT TO A COMPLETE STOP AND THE ENGINE IS TURNED OFF AND THEN RESTARTED. THIS \"LIMP MODE\" BEHAVIOR MAY IN AND OF ITSELF ALSO CAUSE A HAZARD TO BOTH THE MOTORCYCLE OPERATOR AND NEARBY VEHICLES SHOULD THE FAILURE OCCUR WHILE THE MOTORCYCLE IS ON A ROADWAY WITH LIMITED OR NON-EXISTENT EMERGENCY  OR BREAKDOWN AREAS. (A WEB SEARCH FOR \"LIMP MODE HARLEY\" RESULTS IN OVER 400,000 RESULTS, MOST OF WHICH WILL REFER TO THIS ISSUE.)    TO HELP TECHNICIANS RESOLVE THE INTERMITTENT PROBLEM NATURE OF THIS DESIGN ISSUE (BY REPLACING TERMINALS IN THE WIRING HARNESS WITH A MORE RESILIENT TYPE) THE MANUFACTURER ISSUED MULTIPLE THEORY AND DIAGNOSTICS PAPERS (TT418 IN 2009 AND TT418A IN 2011) DESCRIBING ACTIONS TO REMEDY THE PROBLEM. OF NOTE IS THAT THE DIAGNOSTIC TROUBLE CODES (DTC) WHICH IDENTIFY THE PROBLEM ARE UNIQUE AND CAN ONLY BE REMOVED FROM THE ELECTRONIC CONTROL MODULE (ECM) MANUALLY.     MY MOTORCYCLE HAS HAD NUMEROUS EPISODES OF THIS FAILURE OVER THE LAST 10 YEARS. IN THE LATEST CASE, I ALMOST DROPPED THE BIKE LEAVING A PARKING LOT AS THE LIMP MODE KICKED IN. ALTHOUGH THE DTC CODES (P2135 AND P1511) WERE PRESENT IN THE ECM THE DEALER CHARGED ME FOR THEIR TECHNICIAN TIME WITHOUT ADDRESSING THE REPAIRS CLEARLY IDENTIFIED IN THE TT418A PAPER.",
        "vin": "1HD1FC4118Y"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/15/2018",
        "dateOfIncident": "05/30/2018",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11102150,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ABS UNIT FAILED I HAVE NO REAR BRAKE ON THE MOTORCYCLE.",
        "vin": "1HD1FC4148Y"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/19/2018",
        "dateOfIncident": "12/20/2017",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080216,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A RECALL ON HD ULTRA CLASSIC 2008 ABS SYSTEM. HOWEVER ABOUT 2 MONTHS BEFORE THE FRONT BRAKE FROZE UP AND BECAME NON-FUNCTIONAL RESULTING IN A VERY UNSAFE EXPERIENCE. WILL THIS RECALL COVER THIS OR AM I ON MY OWN TO PAY FOR THIS FAILURE? I HAVE OWNED MANY VEHICLES IN MY LIFE AND HAVE NEVER HAD THIS HAPPEN.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/08/2018",
        "dateOfIncident": "10/22/2017",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11071740,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE ATTEMPTING TO COME TO A STOP AT A TRAFFIC SIGNAL THE REAR BRAKE LOCKED UP WITH NO WARNING. LUCKILY I WAS GOING STRAIGHT AND WAS ABLE TO RECOVER THE SKIDDING BIKE BEFORE I HIT THE CAR AHEAD OF ME. I BROUGHT MY BIKE THE LOCAL DEALER AND THE CLAIM THE ABS MODULE IS BAD.NO ONE MENTIONED TO ME ABOUT THE RECALL.",
        "vin": "1HD1FC4498Y"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/16/2017",
        "dateOfIncident": "07/07/2014",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11055067,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "1. SUDDEN THROTTLE LOST CONTROL,  GET TO SHOULDER, TURNED BIKE OFF AND STARTED. RANDOMLY HAPPENED.  2. LAST YEAR I REPLACE ECU - IT'S OK OVER A YEAR AND NOW IT HAPPENED AGAIN.  3. I SEARCH IN INTERNET - MANY OWNER HAVE SAME ISSUES AND DON'T KNOW HOW TO FIX. THE DEALER SERVICE CHARGE ME A LOT OF MONEY AND THEY COULD NOT FIGURE OUT SINCE WHEN IT'S IN THE SHOP THE BIKE SEEM TO BE OK. NOW THE ISSUE SEEM TO HAPPEN MORE OFTEN  4. CODE P1511  AND P2135",
        "vin": "1HD1FC4128Y"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/01/2017",
        "dateOfIncident": "11/26/2017",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11051676,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE APPROACHING AN INTERSECTION I TRIED TO APPLY THE BRAKES AND THE FRONT BRAKE LEVER WOULD NOT MOVE. IT WAS LOCKED IN PLACE. LUCKILY THE REAR BRAKE STILL WORKED AND I WAS ABLE TO STOP. AFTER I STOPPED AND PULLED OVER I WAS ABLE TO GET THE BRAKE LEVER TO MOVE AGAIN. IT DID THE SAME THING AGAIN ON THE NEXT ATTEMPT TO STOP SO I SLOWLY DROVE HOME USING ONLY THE REAR BRAKE. I HAVE BEEN RIDING BIKES FOR 40 YEARS AND HAVE NEVER HAD ANYTHING LIKE THIS HAPPEN.  I HAVE READ ON THE INTERNET THAT THIS IS A COMMON OCCURRENCE AND I WOULD BE SURPRISED IF IT HAS NOT CAUSED SERIOUS ACCIDENTS LIKE IT ALMOST DID FOR ME AND MY WIFE. THE ABS MODULE HAS A SERIOUS DESIGN FLAW AND SHOULD NEVER HAVE BEEN USED ON ANY BIKE!  ON TOP OF THAT THE DEALERSHIP WANTS AROUND $1200 TO FIX THE ISSUE.",
        "vin": "1HD1FC4148Y"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/25/2017",
        "dateOfIncident": "05/21/2017",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11010505,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM CONTACTING YOU TO IMPLORE THAT YOU LOOK INTO THE POSSIBLE NEED TO HAVE A RECALL ISSUED FOR THE REAR WHEEL ASSEMBLY OF THE HARLEY DAVIDSON 2008 TOURING MODELS. I HAVE NOW REPLACED PORTIONS OF MY REAR WHEEL ON MY 2008 HARLEY DAVIDSON FLHTCU THAT SHOULD NOT NEED TO BE REPLACED OR REPLACED AS OFTEN AS THEY HAVE.    UPON RESEARCH, THERE HAVE BEEN NUMEROUS REPORTS OF THE RUBBER ISOLATORS INSIDE THE BOWL COMPENSATOR FAILING, THEREBY CAUSING THE BOLTS THAT CONNECT THE BOWL COMPENSATOR TO THE REAR WHEEL TO FAIL. THERE ARE 5 BOLTS AND ONCE THEY FAIL, THE MOTORCYCLE WILL BE LEFT WITHOUT POWER TO THE REAR WHEEL, POTENTIALLY CAUSING A CRASH.     HARLEY DAVIDSON HAS REDESIGNED THE REAR WHEEL ASSEMBLY CONSIDERABLY FOR THE 2009 MODEL YEAR BY CREATING A ONE PIECE RUBBER ISOLATOR AND ELIMINATING THE BOWL COMPENSATOR COMPLETELY.",
        "vin": "1HD1FC4408Y"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/06/2017",
        "dateOfIncident": "06/20/2017",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003513,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING HOME FROM WORK ON THE EXPRESS WAY A CAR CHANGED LANES IN FRONT OF ME TO CLOSE FOR COMFORT.  I ATTEMPTED TO APPLY THE REAR BRAKE BUT COULD NOT PUSH THE PEDAL DOWN.  I SWERVED AND USED THE FRONT BRAKE TO SLOW DOWN TO CREATE SPACE BETWEEN MYSELF AND OTHER TRAFFIC.  I CONTINUED HOME KNOWING I ONLY HAD FRONT BRAKES.   ONCE HOME I ATTEMPTED TO PUSH THE BRAKE PEDAL.  IT WOULD NOT MOVE.      UPON RESEARCHING THIS ON THE COMPUTER I FOUND MANY COMPLAINTS OF THIS HAPPENING TO OTHERS SOMETIMES THE REAR BRAKE SOMETIMES THE FRONT BRAKE.       I TOOK THE BIKE TO THE DEALERS FOR MAINTENANCE.   WHAT FAILED WAS THE REAR ABS CONTROL MODULE.  THIS IS THE SAME PART LISTED ONLINE BY MANY AS FAILING.  ONE WEEK AFTER TAKING THE MOTORCYCLE TO THE DEALER I RECEIVED A LETTER FROM HARLEY DAVIDSON INFORMING ME THAT MY MOTORCYCLE CONTAINED DOT 4 BRAKE FLUID AND THAT IT WAS REQUIRED TO BE CHANGED EVERY TWO YEARS TO PREVENT POSSIBLE FAILURE.  I HAVE OWNED THIS BIKE SINCE NEW, 2008,  AND NEVER RECEIVED A LETTER FROM HARLEY  BEFORE.  THE DEALER CONFIRMED THAT IT WAS THE ABS MODULE THAT HAD FAILED AND ORDERED ONE.  THE PART THAT WAS ON MY BIKE IS NO LONGER AVAILABLE. (I AM ASSUMING BECAUSE HARLEY KNOWS THEY ARE NO GOOD).  THE NEW PART THAT IT HAS BEEN REPLACED WITH WILL NOT WORK ON MY MOTORCYCLE UNLESS I PURCHASE A NEW ELECTRONIC ABS ELECTRONIC CONTROL UNIT ALSO WHICH IS IN EXCESS OF FIVE HUNDRED DOLLARS.        WHEN THE ABS BRAKES FAILED ON THE HIGHWAY, THEY FAILED IN A MANNER THAT I HAD NO BRAKES.  NOT JUST NO ABS BUT NO BRAKES ON THE REAR SYSTEM WHAT SO EVER.        ALTHOUGH HARLEY DAVIDSON KNOWS THAT THIS PART WAS DEFECTIVE, AS IT WAS DISCONTINUED AND REPLACED WITH ANOTHER PART, THEY BLAME THE CONSUMER BY SAYING THE BRAKE FLUID WAS NOT CHANGED OFTEN ENOUGH.   THIS WAS NOT A GRADUAL FAILURE BUT SUDDEN.  THEY WORKED FINE THAT MORNING.  THE COMPLETE LOSS OF BRAKES COULD BE FATAL.",
        "vin": "1HD1FL4108Y"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/23/2017",
        "dateOfIncident": "03/13/2017",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10967954,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT BRAKE LEVER SUDDENLY BECAME VERY HARD TO PULL. I KNEW FROM OTHER RIDERS EXPERIENCES WITH THIS THIS SAME PROBLEM THAT IT WAS PROBABLY A PROBLEM WITH THE ABS (ANTI-LOCK BRAKE SYSTEM). MY HARLEY CERTIFIED MECHANIC VERIFIED THAT THE ABS MODULE HAD GONE BAD. I CONTACTED MY LOCAL HARLEY-DAVIDSON DEALER AND THEY TOLD ME THAT ABS MODULE WAS OBSOLETE AND THERE WAS NO REPLACEMENT. AFTER SEVERAL CALLS TO HARLEY CUSTOMER SERVICE I WAS GIVEN TWO PART NUMBERS THAT SHOULD WORK ON MY MOTORCYCLE. MY MECHANIC HAS TO DETERMINE WHICH TYPE OF ABS IS ON MY MOTORCYCLE AND THEN I HAVE TO FIND A DEALER THAT CAN GET THE PERT. THE MOTORCYCLE IS STILL OPERABLE BUT IT IS QUESTIONABLE WHETHER OR NOR THE ABS IS WORKING. ALSO WITH THE FRONT BRAKE LEVER VERY HARD TO PULL IT CERTAINLY LEADS TO A POTENTIALLY DANGEROUS SITUATION. I AM THE ORIGINAL OWNER OF THIS VEHICLE AND BOUGHT IT BRAND NEW FROM THE DEALERSHIP. I FEEL THAT THIS CONDITION SHOULD HAVE BEEN BROUGHT TO MY ATTENTION BY THE MANUFACTURER AND SINCE IT INVOLVES CONTROL AND BRAKING OF THE VEHICLE SHOULD HAVE MERITED A SAFETY RECALL OR AT THE VERY LEAST A TECHNICAL SERVICE BULLETIN. IF I AM ABLE TO LOCATE THE CORRECT ABS MODULE IT WILL COST ME $373.71 - $ 481.73 PLUS LABOR COSTS OF INSTALLATION. THE MOTORCYCLE HAS 50,000 MILES ON IT IS GARAGE KEPT AND SERVICED ON A REGULAR BASIS. I FEEL THE MANUFACTURER SHOULD HAVE WARNED ME OF THIS PROBLEM AND SHOULD HAVE REPLACED A CRITICAL PART THEY KNEW WAS GOING TO FAIL.",
        "vin": "1HD1FC41X8Y"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/19/2017",
        "dateOfIncident": "02/17/2017",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10955504,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ON CITY STREET APPLIED FRONT BRAKE TO SLOW DOWN TO MAKE TURN AND LEVER WAS ROCK SOLID. NO FRONT BRAKE AT ALL. ABS LIGHT WAS NOT ON. REAR BRAKE WORKED. DEALER SAID THEY HAD TO ORDER ABS MODULE FROM HARLEY DAVIDSON BECAUSE HARLEY DAVIDSON NEEDED THE OLD ONE TO INSPECT. BIKE IS CURRENTLY AT THE DEALER WAITING ON NEW PART.",
        "vin": "1HD1FC4128Y"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/06/2017",
        "dateOfIncident": "12/30/2016",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10940087,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR BRAKE PEDAL LOCKED UP- NO REAR BRAKES- ABS MODULE FAILED-VALVE NOT LETTING BRAKE FLUID TO GET TO REAR BRAKE CALIPER-DANGEROUS SITUATION. WORKED FINE ON THE WAY TO RESTAURANT. CAME OUT TO LEAVE AND NO REAR BRAKES.",
        "vin": "1HD1FC4468Y"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/11/2016",
        "dateOfIncident": "08/30/2016",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10917014,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AT THE END OF AUGUST 2016, I WAS RIDING MY 2008 HARLEY DAVIDSON AND WITHOUT WARNING, MY REAR BRAKE FAILED. THANK GOD, I WAS IN A PARKING LOT, NOT ON THE MAIN STREET. I TOOK IT DOWN TO THE DEALERSHIP AND IT TOOK OVER TWO HOURS OF LABOR TO FIGURE OUT THAT IT WAS THE ABS UNIT THAT FAILED. EVEN THE TECHNICIAN WAS SURPRISED THAT THE ABS LIGHT NEVER LIT TO INDICATE A FAILURE. I FOUND IT STRANGE THAT ABS FAILURE WILL DISABLE THE BRAKING SYSTEM. I HAD AN ABS FAILURE ON A CAR BEFORE AND BOTH SYSTEM ARE INDEPENDENT.   I AM A CANADIAN, AND I DID REPORT TO TRANSPORT CANADA  THE ABS UNIT ITSELF IS $1000, WITH LABOR AND MISC PARTS, THE BILL CAME OVER $1800. IT TOOK OVER A MONTH TO GET MY MOTORCYCLE BACK, THE ABS PART WAS ON BACK ORDERED.   THANKS FOR YOUR SUPPORT.",
        "vin": "SHD1FC4148Y"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/01/2016",
        "dateOfIncident": "09/01/2016",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10910971,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "COMPENSATOR SPROCKET ASSEMBLY IS MAKING A LOUD BANGING NOISE ON START UP AND WORSE WHEN ENGINE IS HOT",
        "vin": "1HD1FC4418Y"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/27/2016",
        "dateOfIncident": "09/17/2016",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10909990,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT BRAKE LEVER FROZE UP LEAVING ME WITHOUT ANY FRONT BRAKES. IT WAS WORKING NORMALLY DURING A RIDE WITH MY WIFE AS A PASSENGER, THEN JUST FROZE UP. THANKFULLY IT WAS NOT AT A CRITICAL MOMENT AND I WAS ABLE TO PULL OVER SAFELY AND CALLED AAA FOR A TOW. I HAD JUST PULLED OUT OF A PARKING LOT ONTO HIGHWAY. THIS BIKE IS EQUIPPED WITH ABS. I STILL HAD REAR WHEEL BRAKES. I LOOKED ON INTERNET AND I AM NOT THE ONLY ONE THIS HAS HAPPENED TO. INTERNET SEEMS TO THINK ITS THE ABS. I HAVE AN APPOINTMENT WITH BRUCE ROSSMEYER HARLEY DAVIDSON DEALER TOMORROW.",
        "vin": "1HD1FL4198Y"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/07/2016",
        "dateOfIncident": "03/09/2016",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10904281,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 HARLEY-DAVIDSON FLHTCU. WHILE RIDING THE MOTORCYCLE AT 30 MPH, IT SUDDENLY LOST POWER AND WOULD NOT ACCELERATE. THE MOTORCYCLE WAS TOWED TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE WIRE HARNESS, CONNECTING THE THROTTLE AND CARBURETOR, WAS FAULTY. THE PINS ON THE HARNESS WERE REPLACED AND THE FAILURE WAS CORRECTED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 30,000. UPDATED 11/07/16*LJ  *TR",
        "vin": "1HD1FC4158Y"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/05/2016",
        "dateOfIncident": "08/25/2016",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10903637,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "RIDING AT 60 MPH STARTED TO SLOW DOWN DO TO A PULSATING REAR CALIPER. TRIED TO STOP WITH THE FRONT ONE AND THERE WAS NO PRESSURE AND SQUEZZED ALL THE WAY TO THE END UNRESPONSIVE. REAR WORKED, STOPPED FOR A MINUTE TO CHECK...NO LICKAGE AND NO SIGN OF ANYTHING WRONG. STARTED RIDING AGAIN AND A MINUTE LATER WAS WORKING NORMAL AGAIN...HAPPENED TWICE IN FIVE DAYS, STOP RIDING IT AND THE DEALER PICK IT UP...THEY CAN'T FIND THE ISSUE....LOOKS LIKE ABS FAILURE.",
        "vin": "1HD1FC4428Y"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "09/04/2016",
        "dateOfIncident": "05/22/2016",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10903529,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE IN MOTION ON A CITY STREET APPROACHING A RED LIGHT. I APPLIED MY REAR BRAKES AND NOTHING HAPPENED.  I ATTEMPTED THE REAR BRAKES AGAIN, AND STILL, NOTHING.  I THEN APPLIED MY FRONT BRAKES, THIS CAUSED LOSS OF CONTROL OF THE MOTORCYCLE,  AND WE CRASHED.",
        "vin": "1HD1FC4108Y"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/02/2016",
        "dateOfIncident": "07/16/2016",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10903200,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD JUST GOT ON I65 HEADING SOUTH. I WENT MAYBE 2 MILES,  AND ALL OF THE SUDDEN,  MY MOTORCYCLE ACTED LIKE IT HAD JUST RAN OUT OF GAS.  OR SOMEBODY HAD HIT THE KILL SWITCH. I KNOW IT HAD GAS. AS IT WAS WINDING DOWN IN REVOLUTIONS, I TRIED EVERYTHING WITH THROTTLE, KILL SWITCH, IGNITION SWITCH. WHEN I FINALLY STOPPED, I TRIED STARTING IT, NOTHING. IT ACTED LIKE I HAD NO GAS. I OPENED THE TANK AND ROCKED THE BIKE A LITTLE, AND I HAD AT LEAST A HALF A TANK LIKE MY GAUGE READ. AFTER GETTING IT HOME I PUNCHED MY VIN NUMBER IN TO HE'S RECALL PAGE, AND THERE WAS A RECALL FOR THE FUEL FILTER ENCLOSURE.  I PURCHASED ANOTHER ENCLOSURE AND PUT IT BACK TOGETHER. STILL NOTHING. I CHECKED FIRE AND THE PLUGS LIT ON FIRE. SO I SPRAYED EITHER INTO THROAT OF CARBURETOR, AND IT STARTED FOR A SECOND AND DIED. I HAVE TAKEN IT TO THE DEALER AND THEY SAY ONE OF THE GASKETS WAS NOT SEATING CORRECTLY ON THE FUEL PRESSURE REGULATOR.",
        "vin": "1HD1FC4418Y"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/29/2016",
        "dateOfIncident": "08/29/2016",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10899229,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN CITY DRIVING AT 25 MPH ON DRY PAVEMENT, AS YOU ARE APPROACHING A STOP SIGN AND APPLYING THE REAR BRAKES IF YOU HIT A SMALL BUMP, THE ABS SYSTEM RESTRICTS YOUR BRAKING ABILITY AND THE MOTORCYCLE WILL ROLL INTO THE INTERSECTION BEFORE STOPPING. THIS HAS HAPPENED NUMEROUS TIMES OVER THE PAST TWO YEARS THAT I HAVE OWNED THIS BIKE.",
        "vin": "1HD1FC4128Y"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/12/2016",
        "dateOfIncident": "08/10/2016",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10895416,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ACCESSORY P/N 91573-06 (CENTER STAND) FAILED. IT WAS PURCHASED MARCH 2009 FROM A LOCAL H-D DEALER AND INSTALLED PER PRINTED INSTRUCTIONS. IN AUGUST 2016 IT WAS DISCOVERED DURING USE THAT THE RIGHT AND LEFT LEGS HAD SEPARATED AND CAN MOVE INDEPENDENT OF ONE ANOTHER.    WHEN ATTEMPTING TO PLACE A PARKED MOTORCYCLE ONTO THE CENTER STAND WITH THIS UNEXPECTED CONDITION, THE MOTORCYCLE WILL INITIALLY BEGIN TO MOVE UPRIGHT (FROM LEFT) AS EXPECTED, BUT WILL CONTINUE PAST CENTERLINE UNTIL IT FALLS OVER TO THE RIGHT. PROPERTY DAMAGE OR INJURY TO SELF OR OTHERS MAY RESULT. (IN MY CASE, TWO ADULTS WERE PRESENT AND WERE ABLE TO PREVENT THE FALL AND SAFELY PUT THE MOTORCYCLE BACK ONTO IT'S SIDE STAND.)    THE MOTORCYCLE WEIGHT IS ~850 POUNDS. ONE USER ALONE (AS DESIGNED) MAY NOT REACT QUICKLY ENOUGH OR BE PHYSICALLY ABLE TO PREVENT THE UNEXPECTED FALL. DAMAGE TO THE MOTORCYCLE AND ANYTHING NEARBY IS LIKELY. THE USER TRYING TO PREVENT THE FALL MAY BE PULLED OFF HIS FEET AND ONTO THE FALLEN MOTORCYCLE (RISK OF INJURY AND BURNS FROM HOT COMPONENTS). ADDITIONAL INJURY TO ANYONE TO THE RIGHT SIDE IS LIKEWISE POSSIBLE, ESPECIALLY CHILDREN AND PERSONS OF SMALL STATURE.",
        "vin": "1HD1FC4198Y"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/06/2016",
        "dateOfIncident": "06/20/2016",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10893714,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR BRAKE LINE WAS WORN THRU AND LOSS OF BRAKE FLUID AND USE OF REAR BRAKE.  THE FAILURE WAS DUE TO THE CLUTCH CABLE IN CONTACT WITH THE REAR BRAKE LINE.  THE VEHICLE HAD 64,000 MILES AT THE TIME OF THE INCIDENT.  THE FAILURE WAS WHEN APPROACHING A RED TRAFFIC LIGHT AND I WAS TO MAKE A RIGHT TURN.  THE STOP WAS MADE USING THE FRONT BRAKE.",
        "vin": "1HD1FC4158Y"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/12/2016",
        "dateOfIncident": "06/28/2016",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10884386,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 HARLEY-DAVIDSON FLHTCU MOTORCYCLE. WHILE DRIVING APPROXIMATELY 50 MPH, THE FOOT BRAKE PEDAL WAS APPLIED AND THE VEHICLE CONTINUED TO ACCELERATE. THE FRONT BRAKE WAS ENGAGED IN ORDER TO COME TO A COMPLETE STOP. THERE WAS NO BRAKE FLUID VISIBLE ON THE GROUND. THE VEHICLE WAS TOWED TO THE DEALER WHERE IT WAS DIAGNOSED THAT THERE WERE AIR BUBBLES IN THE BRAKE LINES. THE MECHANIC BLED THE FOOT BRAKE LINES. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 35,102.",
        "vin": "1HD1FC4158Y"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/10/2016",
        "dateOfIncident": "07/10/2016",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10883854,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR BRAKE WILL LOCK UP FOR AN INSTANT IF YOU ARE APPLYING THE BRAKE AND YOU HIT A BUMP OR OVER A HOLE.",
        "vin": "1HD1FC41X8Y"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/20/2016",
        "dateOfIncident": "05/19/2016",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10870040,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 HARLEY-DAVIDSON FLHTCU MOTORCYCLE. WHILE DRIVING APPROXIMATELY 20 MPH AND UTILIZING A HAND BRAKE AND FOOT BRAKE TO STOP, THE BRAKES MALFUNCTIONED. THE MOTORCYCLE RODE INTO AN INTERSECTION. UPON INSPECTION, IT WAS DETERMINED THAT THE BRAKES WERE COMPLETELY NON-FUNCTIONAL. THE MOTORCYCLE WAS TOWED TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE ABS MODULE WAS FAULTY. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED. THE FAILURE MILEAGE WAS 36,584. UPDATED 08/02/16*LJ  ACCORDING TO THE INVOICE, THE BRAKE PEDAL AND LEVER WERE HARD AND THE BIKE WOULD NOT STOP.  THE TECHNICIAN REPLACED THE ABS ELECTRONIC CONTROLLER AND HYDRAULIC CLUTCH UNIT.  ALSO, THE BRAKE MASTER CYLINDER WAS LEAKING. UPDATED 08/15/16.*JB",
        "vin": "1HD1FC4408Y"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/21/2016",
        "dateOfIncident": "01/20/2016",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10821535,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY FRONT BRAKE LEVER LOCKED UP! NO FRONT BRAKES!! ABSOLUTELY NO MOVEMENT AT ALL WHEN APPLYING FRONT BRAKE, WITH OR WITHOUT BIKE BEING STARTED! NO ABS LIGHT ON. THE WAY I UNDERSTAND IT (AFTER REVIEWS OF MANY OF THE SAME PROBLEMS WITH BOTH THE FRONT AND REAR BRAKE DOING SAME AS MINE, ON MANY DIFFERENT FORUMS), IT'S DUE TO A DEFECTIVE ABS VALVE MODULE, THAT SHOULD BE RECALLED. AGAIN, THE WAY I UNDERSTAND IT, THE ABS VALVE MODULE IS SUPPOSED TO GO INTO MANUAL MODE AND I WOULD STILL HAVE AT LEAST SOME FRONT BRAKES! I HAVE NOTHING, NONE! NO WARNING LIGHTS COME ON, AND ABS LIGHT OPERATED NORMALLY! BEING A MOTORCYCLE MANUFACTURER, I'VE GOT TO BELIEVE SOMEONE THERE REALIZES THAT THE FRONT BRAKE IS 70% OF A BIKE'S STOPPING POWER.. ARE THEY WAITING FOR A DEATH TOLL SIMILAR TO FIRESTONE/EXPLORER ROLLOVERS, TO BE FORCED TO DO SOMETHING TO PREVENT THE CERTAIN ACCIDENTS THAT WILL CERTAINLY BE CAUSED DO TO THIS?!? THIS OCCURRED YESTERDAY, WHEN I WAS ABOUT TO TAKE THE BIKE OUT OF THE GARAGE. THANK GOD, FROM DRIVING TRACTOR TRAILERS FOR 25 YRS, I'M ANAL ABOUT MY \"PRE-TRIP\" INSPECTION, AND I DISCOVERED IT THEN, RATHER THAN ON THE ROAD WHEN IT WAS NEEDED!!",
        "vin": "1HD1FC4438Y"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/13/2015",
        "dateOfIncident": "11/12/2015",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10790297,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A SPEED WOBBLE STARTING IN THE 60'S AND CONTINUING THROUGH THE 70'S+ ON STRAIGHT ROADS AND CURVES. THIS HAS BEEN HAPPENING FOR YEARS AND I STILL CONTINUE TO SPEND MONEY ADJUSTING ETC. THE BIKE  I'VE SPENT THOUSANDS IN LABOR AND PARTS TO FIX AND OR ADJUST THE BIKE WITHOUT SUCCESS.  I'VE CALLED HARLEY DAVIDSON MORE THAN ONCE TO BE TOLD THAT THEY ARE NOT AWARE OF AN ISSUE AND I'M ON MY OWN BECAUSE IT IS OUT OF WARRANTY. I'VE RESEARCHED THE INTERNET TO FIND DOZENS OF NEWS AND PRIVATE COMPLAINTS TO THE PROBLEM. EVEN A CLASS ACTION SUIT WEBSITE.",
        "vin": "1HD1FC4458Y"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/14/2015",
        "dateOfIncident": "08/14/2015",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10782039,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY COMPENSATOR WENT BAD ABOUT A YEAR AGO WHILE MY BIKE WAS STILL UNDER EXTENDED WARRANTY. THE DEALER SAID IT WAS JUST NORMAL NOISE. NOW COME TO FIND OUT HARLEY DAVIDSON KNOWS THEY HAVE A PROBLEM WITH THEIR COMPENSATOR. THEY DON'T EVEN LAST 20,00 MILES AND I THINK THEY SHOULD RECALL THEM. ALL YOU HAVE TO DO IS GO ON THE HARLEY DAVIDSON FORUMS AND THERE YOU WILL FIND ALL KINDS OF MAD OWNERS THAT THIS HAS HAPPENED TO. THEY KNOW ABOUT IT AND WON'T DO ANYTHING ABOUT IT. I THOUGHT THE WHOLE POINT OF A RECALL IS WHEN THE PART IS AT DEFAULT THEY SHOULD GET FIXED.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/02/2015",
        "dateOfIncident": "09/28/2015",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10779228,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "08 ULTRA CLASSIC ANNIVERSARY ISSUE. SAME ABS LOCKUP ON FRONT BRAKES, AS IT WAS MOVED TO OTHER SIDE OF BASEMENT, WHEN I NOTICED THAT I ONLY HAD ABOUT HALF INCH OF MOVEMENT. 3 WEEKS LATER, I GET READY TO RIDE AND THE FRONT BRAKE HAD NO MOVEMENT. TRACED BACK TO ABS MOD. THESE VALVES IN THE MODULE SHOULD NOT LOCK OUT ON A MECHANICAL FAIL, THE SPRINGS SHOULD FORCE THE VALVE SPOOLS INTO OPEN POSITION, PISS POOR MECHANICAL ENGINEERING THAT WILL GET SOMEONE KILLED IF NOT ALREADY HAPPENED.  THE ONLY DIFFERENCE BETWEEN THE TWO LEVER TESTS IN THAT 3 WEEKS, I RAN THE MOTOR FOR 10MINS FOR BATTERY CHARGE AFTER I MOVED IT. I DID START IT UP AFTER, THE LOCKED BRAKE, BUT NO CHANGE. I'M LUCKY I CHECKED BEFORE LEAVING HOME BECAUSE MY HOUSE IS ON A HILL. NOW AFTER SEEING HOW DANGEROUS THIS SITUATION COULD BE, I'M THINKING ABOUT HAVING THE ABS SYSTEM BYPASSED, UNTIL THEY MECHANICALLY RE-ENGINEERED THAT DANGEROUS VALVE MODULE. BESIDES, AFTER RIDING FOR 44YRS BEFORE THIS BEAUTY OF A BEAST, I'VE HATED THE ABS SYSTEM FROM THE BEGINNING.    THIS IS FROM THE HARLEY FORUM - \"THESE \"LOCKED PEDAL OR LEVER\" ABS MALFUNCTIONS RESULTING IN NO BRAKE ARE GETTING FAR TOO COMMON. PLEASE FILE YOUR EXPERIENCE WITH THE NTSB. THESE ABS MODULES NEED TO BE REDESIGNED AND RETROFITTED AT NO COST BEFORE PEOPLE START GETTING KILLED.\"",
        "vin": "1HD1FC4468Y"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/12/2015",
        "dateOfIncident": "08/06/2014",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10682924,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 ULTRA CLASSIC ELECTRA GLIDE HARLEY DAVIDSON.  GAS TANK LINING PEALED OFF INSIDE THE TANK RESULTING IN SHEDDING FUEL FILTERS, LINE, PUMP, INJECTORS.  ALL PARTS INSIDE THE TANK HAND TO BE REPLACED.  $1800 WORTH OF PARTS PLUS THE TANK HAD TO BE BLASTED AND RECOATED $600.  POWER WOULD CUT OUT WHEN RIDING MOTOR WOULD QUIT.   *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/06/2015",
        "dateOfIncident": "02/04/2015",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10681818,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "IN APRIL 2012 I WAS EXPERIENCING LOUD NOISES FROM THE PRIMARY SIDE OF MY 96 V TWIN ENGINE AND IT WOULD NOT START.  UPON INSPECTION BY A CERTIFIED HARLEY TECH. IT WAS DISCOVERED THE ENTIRE CLUTCH ASSEMBLY AND COMPENSATOR SPROCKET WERE DAMAGED DUE TO THE DISINTEGRATION OF THE SPLINES AND GEARS.  AS ADVISED BY HARLEY DAVIDSON, \"THEIR SUPPLIER SHIPPED THESE PARTS WITHOUT HEAT TREATING THEM\".  I WAS NEVER ADVISED THIS WAS A PROBLEM BY HARLEY.  THE PARTS WERE REPLACED WITH HARLEYS HEAVY DUTY SCREAMIN EAGLE COMPENSATOR AND THE BIKE RAN FINE UP UNTIL THE WINTER OF 2014.  MY BIKE WAS IN THE SHOP FOR AN OIL LEAK IN THE PRIMARY AREA AND THE TECH HAD TO TAKE THE PRIMARY APART TO GET TO IT.  HE DISCOVERED THE COMPENSATOR HAD SEVERE WEAR AND PRESENTED A DANGER OF FAILURE IF RIDDEN.  THEREFORE, WE ARE GOING THROUGH THIS SAME PROCESS OF REPLACING THE SAME PARTS FOR A THIRD TIME.  *JS",
        "vin": "1HD1FC4138Y"
    },
    {
        "components": "VEHICLE SPEED CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/25/2014",
        "dateOfIncident": "10/01/2012",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10649933,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE RIDING IN RESIDENTIAL AREA BIKE BEGAN LURCHING AND UNABLE TO MAINTAIN CONSTANT SPEED OR RPM.  TOOK TO SHOP AND THEY STATED BIKE DID NOT HAVE ANY CODES DISPLAYING.  THEY LUBRICATED ALL CONNECTIONS ON THROTTLE ASSEMBLY AND IT TEMPORARY RESOLVED ISSUE. NOW WHEN I START THE BIKE THE THROTTLE IS UNRESPONSIVE AND BIKE IS NOT ABLE TO BE DRIVEN. SOMETIMES SHUTTING DOWN AND RESTARTING WILL TEMPORARILY RESOLVE ISSUE, HOWEVER, BIKE IS NOT SAFE TO RIDE.  I BELIEVE THIS IS A SAFETY ISSUE AND WARRANTS A RECALL, HOWEVER NOT RECALLS TO DATE.     *TR",
        "vin": "1HD1FC4348Y"
    },
    {
        "components": "FUEL SYSTEM, OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/30/2014",
        "dateOfIncident": "07/27/2013",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10595171,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 HARLEY DAVIDSON FLHTCUI. THE CONTACT STATED THAT THE VEHICLE STALLED WITHOUT WARNING. THE FAILURE OCCURRED ON SEVERAL OCCASIONS. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE O-RING AND THE FUEL FILTER NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED BUT THE FAILURE WAS NOT RECTIFIED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STATED THAT THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN ID NUMBER: 08V357000 (FUEL SYSTEM, GASOLINE). THE FAILURE MILEAGE WAS 35,000 AND THE CURRENT MILEAGE 45,000.",
        "vin": "1HD1FC4178Y"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/30/2014",
        "dateOfIncident": "05/30/2014",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10595223,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE COMING TO A SLOW STOP USING BOTH FRONT AND REAR BRAKES THE FOOT PEDAL FOR THE REAR BRAKES FELT SOFT AND WENT DOWN TO THE FLOOR BOARD. UPON STOPPING THE MOTORCYCLE I NOTICED BRAKE FLUID DRIPPING FROM UNDER THE MOTOR. DURING EXAMINATION I SAW THAT THE REAR BRAKE LINE WAS LEAKING AT THE POINT WHERE THE CLUTCH CABLE CROSSES BETWEEN THE MOTOR AND THE LINE. THE VIBRATION OF THE MOTOR APPARENTLY CAUSED THE CLUTCH CABLE TO WEAR A HOLE IN THE REAR BRAKE LINE DUE TO THE ROUTING OF THE TWO PARTS.  *TR",
        "vin": "1HD1FC4108Y"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/17/2014",
        "dateOfIncident": "10/25/2013",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10564630,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE RIDING MY 2008 FLHTCU AT LOW SPEEDS MY FRONT BREAK LEVER BECAME FROZEN IN PLACE, THE LEVER WOULD NOT ENGAGE THE BRAKES AT ALL. THE BIKE DID NOT DISPLAY ANY FAULT CODES. I TOOK THE BIKE TO MY LOCAL DEALERSHIP AND THEY VERIFIED MY ABS MODULE HAD FAILED AND NEEDED REPLACED. MY COMPLAINT IS, THE BIKE WAS IN GOOD MECHANICAL CONDITION AND WITH OUT WARNING I HAD A CATASTROPHIC BREAK FAILURE. I BELIEVE THIS WARRANTS AN INVESTIGATION BECAUSE OF THE NATURE AND IMPORTANCE BREAKS ARE TO RIDING A MOTORCYCLE AND HOW MANY DEATHS ARE DUE TO OR FUTURE ACCIDENTS BECAUSE OF THIS. I HAVE SEEN ONLINE OTHER OWNERS REPORTING THE SAME ISSUE.  *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/06/2013",
        "dateOfIncident": "10/29/2013",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10551177,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING ON AN INTERSTATE AND EXITING ON THE OFF RAMP, I EXPERIENCED A CATASTROPHIC FRONT BRAKE FAILURE CAUSED BY A MALFUNCTIONING ABS MODULE.  THE FRONT BRAKE COULD NOT BE APPLIED.  THE BRAKE LEVER WAS FROZEN AS IF IT WERE WELDED IN PLACE..  THERE WAS NO PREVIOUS WARNING PRIOR TO THIS TIME.  I WAS ABLE TO STOP THE BIKE USING THE BACK BRAKE ONLY AND NOT BY A LARGE MARGIN!  AFTER THE INCIDENT THE BRAKE LEVER REMAINED FROZEN AND I HAVE NOT REPAIRED THE PROBLEM YET.  AFTER A LOT OF HEAD SCRATCHING I WAS ABLE TO DETERMINE THAT THE ABS MODULE IS NOT ALLOWING ANY BRAKE FLUID TO PASS THROUGH.  THIS CAUSES THE BRAKE LEVER TO FREEZE.  *TR",
        "vin": "1HD1FC4448Y"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/01/2013",
        "dateOfIncident": "09/19/2013",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10546371,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "GOODYEAR DUNLOP TIRES NORTH AMERICA, LTD",
                "productMake": "DUNLOP",
                "productModel": "D401",
                "productYear": "9999",
                "size": "90/90-19 52H",
                "type": "Tire"
            }
        ],
        "summary": "THE INSIDE OF TIRE CAME APART.  *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/08/2013",
        "dateOfIncident": "09/15/2012",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10511056,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 HARLEY DAVIDSON ULTRA CLASSIC. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 65 MPH, THE VEHICLE FAILED TO ACCELERATE. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSIS. THE TECHNICIAN STATED THAT THE WIRING IN THE THROTTLE WOULD HAVE TO BE REPLACED. THE TECHNICIAN ALSO ADVISED THE CONTACT THAT THE REPAIR WOULD NOT GUARANTEE A REMEDY TO THE FAILURE AND IF THE FAILURE RECURRED, THE THROTTLE WOULD THEN HAVE TO BE REPLACED. THE VIN WAS NOT AVAILABLE. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 14,500.  *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/06/2013",
        "dateOfIncident": "05/05/2013",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10510784,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 HARLEY DAVIDSON FLHTCU. THE COTNACT STATED THAT WHILE DRIVING APPROXIMATELY 50 MPH, THE FRONT END WOBBLED CONTINUOUSLY. THE CONTACT MANEUVERED TO THE SIDE OF THE ROAD WHERE HE NOTICED THAT THE FRONT WHEEL BEARING FRACTURED. THE VEHICLE WAS TOWED TO THE RESIDENCE. THE VEHICLE HAD NOT BEEN REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE PROBLEM. THE APPROXIMATE FAILURE MILEAGE WAS 27,000. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "STEERING,SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/26/2013",
        "dateOfIncident": "06/19/2012",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10509712,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2008 HARLEY DAVIDSON ULTRA CLASSIC THAT HAS DEVELOPED A REAR WHEEL WOBBLE WHILE CORNERING OR GOING THROUGH CURVES. THE VEHICLE FEELS LIKE THE REAR WHEEL SLIDES OR SHIFTS TO THE SIDE WHILE CORNERING UPSETTING THE BALANCE OF THE BIKE AND MAKING IT UNCOMFORTABLE/DANGEROUS TO RIDE. IT HAS PROGRESSIVELY GOTTEN WORSE AND I WILL NO LONGER RIDE THE MOTORCYCLE. I'VE HAD THE MOTORCYCLE INTO THE DEALER AT LEAST 3 TIMES FOR THE PROBLEM. THE FIRST TWO TIMES THEY ADVISED ME THEY COULDN'T FIND A PROBLEM. I CURRENTLY HAVE THE VEHICLE AT A H-D DEALER SERVICE SHOP. THEY ADVISED ME THAT THEY HAVE HAD SEVERAL CUSTOMERS WITH THIS COMPLAINT AND THEY WERE ABLE TO FIX IT BY THE USE OF AFTERMARKET PARTS HOWEVER I WOULD BE RESPONSIBLE FOR ALL COSTS INVOLVED WITH FIXING THE PROBLEM EVEN THOUGH I HAVE AN EXTENDED WARRANTY ON THE VEHICLE. I'VE ALSO LEARNED THAT H-D MAY HAVE SENT OUT A SERVICE BULLETIN TO THEIR DEALERS TELLING THEM NOT TO DISCUSS THIS PROBLEM WITH BIKE OWNERS DUE TO POSSIBLE LEGAL ACTION. I HAVE CONTACTED H-D CUSTOMER RELATIONS DEPARTMENT ABOUT THIS ISSUE AND THEY WOULD ONLY GIVE ME A FILE NUMBER ON MY CASE AND TOLD ME TO GIVE IT TO MY DEALER AND HAVE THEM CALL H-D ABOUT IT. PRIOR TO TAKING THE MOTORCYCLE IN TO THE DEALER TODAY I HAD A POLICE MOTORCYCLE PATROL OFFICER/INSTRUCTOR WITH THE IL. STATE POLICE RIDE THE VEHICLE TO SEE IF HE FELT THE SAME PROBLEM WITH THIS VEHICLE AS I DID. HE ADVISED ME HE COULD FEEL WHAT FELT LIKE THE REAR WHEEL SLIDE AS HE WENT THROUGH CURVES AND IT WAS SCARY.  *TR",
        "vin": "1HD1FL4158Y"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/03/2013",
        "dateOfIncident": "03/20/2013",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10505496,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "COMPLETE FAILURE OF REAR BRAKE.  LINE FAILURE DUE TO CHAFING FROM CLUTCH CABLE AND LOSS OF FLUID.  *TR",
        "vin": "1HD1FC4188Y"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/12/2012",
        "dateOfIncident": "12/12/2012",
        "fire": true,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10488104,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 HARLEY DAVIDSON FLHTCU. THE CONTACT ATTEMPTED TO START THE VEHICLE BUT FLAMES WERE COMING FROM THE CARBURETOR. THE CONTACT ATTEMPTED TO RESTART THE VEHICLE AND THE FAILURE RECURRED. THE CONTACT WAS ABLE TO DRIVE THE VEHICLE TO THE DEALER TO BE INSPECTED; HOWEVER, THEY WOULD NOT ADDRESS THE CAUSE OF FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED AND STATED THEY WOULD REPLACE THE COMPENSATOR ASSEMBLY AT HIS EXPENSE. THE FAILURE MILEAGE WAS 70,000.",
        "vin": "1HD1FC4108Y"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/19/2012",
        "dateOfIncident": "11/20/2011",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10448488,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE RIDING  AT 60MPH, THE ENGINE SLOWED THE BIKE DOWN TO 25MPH.  I WAS LUCKY THAT I WAS NOT IN TRAFFIC WHERE A SURPRISE SLOW DOWN WOULD HAVE BEEN VERY DANGEROUS.  I WAS ABLE TO RIDE THE BIKE ON THE SHOULDER AT 25MPH, AND LET TRAFFIC GO AROUND ME UNTIL THERE WAS AN OPPORTUNITY TO SAFELY GET OFF OF THE ROAD.  I TURNED THE ENGINE OFF AND WAITED 4 TO 5 MINUTES.  I THEN RESTARTED THE ENGINE, THE ENGINE RESPONDED NORMALLY, AND I RODE HOME WITH NO FURTHER PROBLEMS.  THIS HAS HAPPENED 2 MORE TIMES OVER THE LAST 3 MONTHS.  THE LAST TIME WAS THE MOST DANGEROUS FOR ME AS I WAS IN 55MPH, ALMOST BUMPER TO BUMPER TRAFFIC.  I WAS LUCKY THAT THERE WAS AN IMMEDIATE OPPORTUNITY TO EXIT THE ROAD WHERE I GOT OFF AND FOUND A SAFE PLACE TO STOP. *TR",
        "vin": "1HD1FC4178Y"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/26/2011",
        "dateOfIncident": "08/17/2011",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10421627,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS OPERATING MY 2008 HARLEY DAVIDSON FLHTCU WHEN I APPLIED MY REAR BREAKS ONLY TO FIND I HAD NO REAR BREAKS.  I STILL HAD MY FRONT BREAKS THAT WORKED VERY WELL.  I HAVE 9,600 MILES ON THE MOTROCYCLE.  I TOOK MY MOTORCYCLE TO THE HARLEY DEALER  AND ASKED THE SERVICE WRITER TO CHECK MY REAR BREAKS AS I TOLD HIM THERE WERE NO BREAKS.  THE SERVICE WRITER WALKED OUT TO MY MOTORCYCLE BENT DOWN ON ONE KNEE UNDER THE RUNNING BOARD ON THE RIGHT SIDE, PUSHED DOWN ON THE BREAK  AND SAID YOU HAVE A PIN HOLE IN YOUR BREAK LINE CAUSED BY THE CLUTCH CABLE RUBBING ON THE BREAK LINE.  I HAD CONCERNED THAT HE KNEW EXACLTY WHERE TO LOOK AND I ASKED IF THIS WAS SOMETHING HE HAD SEEN BEFORE, HE ANSWERED YES I HAVE SEEN IT A FEW TIMES AND AS A MATTER OF FACT HE JUST HAD ANOTHER ONE WITH THE SAME PROBLEM, IT WAS A 2003 AND HE WOULD HAVE TO ORDER THE PART AND ASKED THAT I BRING IT BACK THE FOLLOWING THURSDAY.  HAVING BEEN A TRAFFIC ACCIDENT INVESTIGATOR FOR MANY YEARS AS A MOTOR POLICE OFFICER.  I SENT AN E-MAIL TO HARLEY CUSTOMER CARE AND GOT A PHONE CALL BACK AND I TOLD THEM OF THE PROBLEM, THE REPRESENATIVE THERE HAD NOT HEARD OF THE PROBLEM BEFORE AND I STATED I THOUGHT THEY HAD A PROBLEM WHEN THE DEALER SERVICE WRITER GOES TO THE EXACT PLACE WHERE THE PIN HOLE WAS. I TOLD HIM I WAS CONCERNED IF THIS HAD HAPPEND AT LEAST THREE TIMES AT THE SAME DEALER IT HAD TO BE MORE OF A PROBLEM AND HE SHOULD CHECK TO SEE HOW MANY BREAKLINES HAD BEEN ORDERED FOR THE SAME MODEL. HIS STATEMENT TO ME WAS THEY RECEIVE INFORMATION FROM DEALERS ALL OVER AND IF IT WAS A PROBLEM THEY WOULD KNOW ABOUT IT. I TOLD HIM NOT IF THEY ARE GETTING VARIED REASONS FOR THE DEALERSHIP AND MY CONCER WAS NO PERSON GET INJURED DUE TO THIS PROBLEM AS IT IS A SAFETY ISSUE AND MAYBE A SERVICE NOTICE SHOULD BE PUT OUT TO CHECK THESE LINES.  HE DID NOT APPEAR TO BE VERY CONCERNED AND THIS IS WHY I AM REPORTING THIS TO YOU. LINE REPLACED UNDER EXTENDED WARRANTY. I DID NO KEEP OLD PART.  INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6)  *TT",
        "vin": "1HD1FC4438Y"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/17/2011",
        "dateOfIncident": "07/22/2011",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10419889,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY 2008 HARLEY ULTRA CLASSIC THE BIKE BEGAN TO SKID AND VIBRATE AT 50 MPH. THOUGHT I WAS GOING DOWN THEN BEGAN TO FREE UP, AND I STOPPED. CALLED FOR PICKUP AND TRANSFERRED TO HARLEY SHOP IN TYLER, TX I ASK TO CK COMPENSATOR SPROCKET AS WAS TOLD SAME DAY WHEN GETTING NEW TIRES AT ANOTHER SHOP THE COMPENSATOR SPROCKET WAS GOING OUT. HAVE NOT RECEIVED BIKE FROM HARLEY SHOP BUT THEY HAVE CONFIRMED THAT COMPENSATOR SPROCKET ORDERED AND UPGRADED FROM EXISTING SPROCKET. I AM AWARE OF OTHER COMPENSATOR SPROCKETS GOING OUT ON 08 MODELS. THIS COULD HAVE BEEN SERIOUS AND HAVE BEEN INFORMED THAT HARLEY NO LONGER SUPPLIES THE STOCK COMPENSATORS. THERE SHOULD BE A RECALL BEFORE A DEATH OCCURS. *KB",
        "vin": ""
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/17/2011",
        "dateOfIncident": "07/14/2011",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10414250,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS RIDING AT ABOUT 60 MPH WHEN MY FRONT WHEEL BEARING STARTED TO FAIL (NOISE ONLY, NOT CATASTROPHIC). I WAS NEXT TO AN INDEPENDENT HARLEY SHOP AND WAS ABLE TO GET THE BEARING REPLACED.  DURING A CONVERSATION WITH THE OWNER, I LEANED THAT HARLEY CHANGED WHEEL BEARING WITH 2007 MODELS. HE HAD NEVER REPLACED A WHEEL BEARING, EXCEPT ON BIKES WITH VERY HIGH MILEAGE, PRIOR TO THE 2007 MODEL. HE HAS CHANGED AN ALARMING NUMBER ON 2007 AND NEWER MODELS WITH AROUND 20000 MILES ON THE ODOMETER.  I PICKED UP A JULY '11 THUNDER PRESS MOTORCYCLE NEWSPAPER LATER AT MY LOCAL HD DEALER. THERE WAS A LETTER TO THE EDITOR ABOUT FAILED WHEEL BEARING ON 2008 HARLEY'S AND WHEEL BEARING MADE IN MEXICO.  I HAVE NO IDEA ABOUT REPORTING REQUIREMENTS FOR SUCH FAILURES ON MOTORCYCLES, BUT THERE SHOULD BE ONE. IN THE MEAN TIME, IT APPEARS THAT HD HAS A VERY HAZARDOUS WHEEL BEARING PROBLEM. I HOPE HD HAS LEARNED ABOUT THE PROBLEM AND MADE CORRECTIVE ACTIONS, AS THEY DID A MAJOR OVERHAUL ON MANY MODELS IN 2009.  THANK YOU.",
        "vin": "1HD1FC4128Y"
    },
    {
        "components": "TIRES",
        "crash": true,
        "dateComplaintFiled": "06/29/2011",
        "dateOfIncident": "06/12/2010",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10409380,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "GOODYEAR DUNLOP TIRES NORTH AMERICA, LTD",
                "productMake": "DUNLOP",
                "productModel": "D401",
                "productYear": "9999",
                "size": "90/90-19 52H",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 HARLEY DAVIDSON FLHTCU MOTORCYCLE, WITH DUNLOP D402 TIRES, LINE SIZE MU85B16 M/C77H, DOT NUMBER: 301823DAF4M18M. THE CONTACT WAS DRIVING 70 MPH, WHEN THE REAR TIRE WENT FLAT. THE VEHICLE SKIDDED ACROSS THE HIGHWAY, AND LANDED FLAT AS THE CONTACT AND PASSENGER WERE THROWN 100 FEET FROM THE VEHICLE. BOTH THE CONTACT AND THE PASSENGER SUSTAINED MINOR INJURIES AND A POLICE REPORT WAS FILED.  THE VEHICLE WAS TOWED TO A DEALER AND WAS IN THE PROCESS OF BEING REPAIRED.  THE MANUFACTURER OF THE TIRE WAS NOTIFIED OF THE FAILURE BUT DID NOT PROVIDE ANY ASSISTANCE TO THE CONTACT.  THE FAILURE AND CURRENT MILEAGE WAS 13,000.    UPDATED 8/29/11 *CN  UPDATED 09/26/11",
        "vin": "1HD1FF4148Y"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/12/2011",
        "dateOfIncident": "05/25/2011",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10406003,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2008 HARLEY DAVIDSON FLHTCUI. I HAVE HAD IT IN THE SHOP THREE TIMES BECAUSE OF THIS SAME PROBLEM. IT HAS AN ELECTRONIC THROTTLE. IT WILL ONLY IDLE. RIGHT NOW. IT HAS BEEN IN THE SHOP FOR 3 WEEKS AND THE DEALER CLAIMS THEY CANNOT GET THE NEEDED PART FOR ANOTHER 3 WEEKS. IT IS AN UPGRADED PART. I FEEL A RECALL IS WARRANTED. IT DID THIS WHEN I WAS GOING DOWN THE ROAD.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/02/2011",
        "dateOfIncident": "06/01/2011",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10404131,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "STOCK COMPENSATOR ON 2008 ULTRA CLASSIC FAILED AND NOW HAVE TO PAY FOR REPLACEMENT TO PUT THE UPGRADED ONE IN. LUCKY I WAS NOT TRAVELING AT HIGHWAY SPEEDS OR I WOULD HAVE BEEN KILLED. HARLEY IS AWARE THERE IS A PROBLEM AND REFUSE TO FIX THE PROBLEM. THE STOCK COMPENSATOR IS INFERIOR TO THE UPGRADE AND HARLEY NOW PUTS THE UPGRADE STOCK ON THE 2011 BIKES. I FEEL THIS SHOULD BE REPLACED AT NOT COST SINCE IT IS A SAFETY ISSUE.  *TR",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/01/2011",
        "dateOfIncident": "05/28/2011",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10404077,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Pirelli Tire, LLC",
                "productMake": "METZELER",
                "productModel": "ME 880 MARATHON",
                "productYear": "9999",
                "size": "130/90B16 M/TLC 73H REINF",
                "type": "Tire"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 HARLEY DAVIDSON ULTRA CLASSIC MOTORCYCLE. THE CONTACT STATED THIS WAS THE SECOND SET OF TIRES THAT DELAMINATED. THERE WERE ALSO LARGE PIECES OF THE TIRE SEPARATING ON SEVEN DIFFERENT SIDES OF THE TIRE; ALTHOUGH, THERE WAS 95% OF THE TREAD DEPTH THAT WAS STILL ON THE TIRES. THE TIRE BRAND NAME, METZLER ME880 MARATHON, SIZE MU85B/16,  DOT# XE13J7032609 AND SERIAL #E375R0023664.",
        "vin": "1HD1FC4408Y"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/07/2011",
        "dateOfIncident": "01/10/2011",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10399446,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2007/08/09/10 HARLEYDAVIDSON MOTORCYCLES WITH THE 96IN/103IN MOTORS THE STOCK COMPENSATOR ASSEMBLY WEARS OUT PREMATURE BECAUSE IT AS MADE FOR THERE 88IN ENGINE AND AFTER A WHILE YOUR ENGINE WONT START IF IT DOES IT BACK FIRES THREW THE AIR CLEANER AND COULD CATCH ON FIRE THE COMPANY KNOWS ABOUT THIS AND HAS REPLACED IT WITH A SCREAMIN EAGLE COMPENSATOR ASSEMBLY PART ON ALL 2011 MODELS THE NEW PART COST 300 DOLLARS TO REPLACE AND HARLEY WONT PAY FOR IT BECAUSE THE ENGINE DOESNT SHOW A CODE FOR THIS THE GOVERNMENT NEEDS TO STEP IN AND FORCE THEM TO REPLACE THESE WITH THE NEW ONES YOU CAN CONTACT AMERICAN IRON MAG IN THERE TECK DEPT ASK THEM THEY CAN EXPLAIN IT TO YOU BETTER PLEASE HELP IT STARTS TAKING PLACE ABOUT 17K TO 18K MILES ON YOUR CYCLE.  *TR",
        "vin": "1HD1FC4198Y"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/26/2011",
        "dateOfIncident": "09/16/2010",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10397474,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT BRAKE ROTOR FOUND TO BE  WARPED AT 12,946 MILES AFTER BRAKE PADS CHANGED AT 10,163 MILES. ONLY ONE ROTOR WARPED CAUSING A LESSENING OF BRAKE EFFECTIVENESS.  WARPING OF ROTOR (S) APPEARS TO BE ON-GOING HARLEY DAVIDSON PROBLEM.  *TR",
        "vin": "1HD1FC4108Y"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/21/2011",
        "dateOfIncident": "03/18/2011",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10392294,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FAULTY COMPENSATOR ON HARLEY.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/16/2011",
        "dateOfIncident": "09/09/2010",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10391711,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 HARLEY DAVIDSON. CONSUMER STATES DESIGN FLAW AND SERIOUS SAFETY ISSUE WITH MOTORCYCLE *TGW  THE CONSUMER STATED THE MOTORCYCLE HAD BEEN AT THE REPAIR SHOP SINCE SEPT 9, 2010 BECAUSE OF A THROTTLE PROBLEM CREATED BY THE BIKE GOING INTO LIMP MODE ON ITS OWN WHILE BEING DRIVEN OR WHILE AT A STOP.  THE CONSUMER WAS INFORMED THE WIRING HARNESS NEEDED TO BE REPLACED. HOWEVER, THE CONSUMER STATED THERE WAS NO WAY TO TEST THE BIKE UNTIL THE WEATHER IMPROVES IN ORDER TO DETERMINE IF THE PROBLEM HAS BEEN RECTIFIED. *JB",
        "vin": "1HD1FC4258Y"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/08/2010",
        "dateOfIncident": "08/07/2010",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10354582,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "COMPENSATOR FAILED ON 2008 HD FLHTCU. CAUSES LOSS OF CONTROL AND COULD HAVE BEEN FATAL.  HD WILL NOT ACKNOWLEDGE THE WIDESPREAD PROBLEM. *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/29/2009",
        "dateOfIncident": "06/17/2009",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10275198,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY MOTORCYCLE WHEN I STARTED REMAINED AT HIGH IDLE AND WOULD NOT REDUCE TO NORMAL. I WAS WITH A GROUP OF RIDERS WHO WERE LEAVING SO I TOOK OFF AS IS AND WHEN COMING TO A STOP THE BIKE ONLY SLOWED TO 2000 RPM'S ALMOST CAUSING ME TO RUN INTO CAR AHEAD OF ME.  THIS PROBLEM OCCURS INTERMITTENTLY AND MOTOR COMPANY INSTRUCTION WAS TO USE A IDLE RESET PROCEDURE CONSISTING OF TURNING THE IGNITION ON-OFF 4 TIMES. THIS WORKED FOR A FEW STARTS THEN WOULD OCCUR AGAIN.   I RECENTLY SAW A BLOG IN A CHAT ROOM WHERE MOTOR COMPANY HAD ISSUED A TECH BULLETIN WHERE A DOWNLOAD TO THE ECU WOULD RESET THE CALIBRATION TIMING OF THE IDLE PROCEDURE. I ASKED THE DEALER TO UPDATE MY ECU AND THE RESPONSE WAS THAT BECAUSE I HAD MODIFIED MY BIKE IT WOULD COST $150 FOR THE UPDATE. I CALLED CUSTOMER SERVICE NUMBER AND AFTER MANY TRANSFERS WAS TOLD THAT THERE WAS NO SUCH BULLETIN OR UPDATE I THEN GAVE THE PHONE TO DEALERS SERVICE MGR WHO GAVE THEM INFO HE HAD AND TOLD HIM TO NOT CHARGE FOR THE UPDATE AS A CUSTOMER SATISFACTION ACTION AND THE DEALER UPDATED AND I HAVE HAD NO PROBLEM SINCE. I THINK SINCE THIS IS A POSSIBLE SAFETY ISSUE THE UPDATE SHOULD BE ANNOUNCED AND PERFORMED UNDER NORMAL WARRANTY. THIS DEFECT ONLY SEEMS TO EFFECT 08M AND 09M BIKES WHERE MOTOR COMPANY UPDATED FROM CABLE THROTTLE CONTROL TO ELECTRONIC THROTTLE CONTROL. *TR",
        "vin": "1HD1FC4198Y"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/18/2009",
        "dateOfIncident": "06/17/2009",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10274249,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "IRON BLOCK HARLEY DAVIDSON REFUSED TO PERFORM A SAFETY RECALL ON MY HARLEY DAVIDSON ULTRA CLASSIC FUEL CANISTER. *TR",
        "vin": "1HD1FC4438Y"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/02/2009",
        "dateOfIncident": "04/18/2009",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10267538,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 HARLEY DAVIDSON FLHTCUI (ULTRA CLASSIC.  ENGINE QUIT WHILE CRUISING AT 50MPH. DIAGNOSED AS IGNITION COIL FAILURE. *TR",
        "vin": "1HD1FC4488Y"
    },
    {
        "components": "STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "01/02/2009",
        "dateOfIncident": "08/15/2008",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10253638,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MOTORCYCLE RIDING ON A CLEAR DAY ON NEW CONCRETE 2 LANE HIGHWAY, VERY LITTLE TRAFFIC IN RURAL IOWA. TOTAL OF THREE MOTORCYCLES. ALL THREE BRAND NEW HARLEY TOUR BIKES, ALL WITH LESS THAN 1000 MILES. I WAS LAST BIKE IN GROUP WHEN MIDDLE BIKE EXPERIENCED REAR WHEEL WOBBLE WHILE ENTERING A SWEEPING CURVE AT 60 MPH.BIKE \"WALKED\" ITSELF ACROSS ONCOMING LANE AND INTO DITCH BEFORE RIDER COULD STOP IT. BIKE AND RIDER WERE NOT SERIOUSLY HURT. BIKE WAS DRIVABLE BUT FOR SAFETY, HAULED TO DEALER. DEALER SAID NOTHING WRONG AND NEVER HEARD OF PROBLEM BEFORE. UPON SEARCHING WEBSITES, FIND OUT MANY WITH SAME PROBLEM AND SAME RESPONSE FROM DEALER AND HARLEY, OWNER REFUSED DEALERS CLAIM OF NOTHING WRONG WITH BIKE AND ENDED UP ACCEPTING LOW BALL BUYBACK OFFER FROM DEALER. PROBLEM IS INHERENT DESIGN FLAW IN RUBBER ISOLATOR DONUTS IN REAR SWING ARM ALLOWING LATERAL MOVEMENT OF REAR WHEEL. *TR",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/04/2008",
        "dateOfIncident": "11/03/2008",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10247701,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WOBBLE IN FRAME OF 2008 HARLEY DAVIDSON ULTRA CLASSIC. MANY AFTERMARKET PARTS TO ADDRESS THE PROBLEM, BUT THE COMPANY SHOULD TAKE RESPONSIBILITY FOR IT.  THE FLAW COULD BE LIFE THREATENING AND CAUSE CRASHES. *TR",
        "vin": "1HD1FC41X8Y"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/02/2008",
        "dateOfIncident": "11/02/2008",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10247472,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I NOTICED A VIBRATION ON OUR MOTORCYCLE WHEN WE REACHED 65 MPH OR FASTER ON THE MOTORCYCLE FROM THE WARRANTY REPAIRS LAST MONTH.  WHEN I POLISHED THE MOTORCYCLE I NOTICED A AN IMPERFECTION ON THE REAR DRIVE GEAR.  IT MAY BE A CASTING PROBLEM. I HAVE PICTURES TO SEND.   PLEASE ADVISE.    SINCERELY,    BRIAN CULLIVER *TR",
        "vin": "1HD1FC4138Y"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "10/10/2008",
        "dateOfIncident": "10/04/2008",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10245110,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A HARLEY DAVIDSON 2004 ULTRA CLASSIC ELECTRAGLIDE AND AS MY WIFE AND I WERE RIDING LAST SATURDAY, SHE FELT THE BACK OF HERE SEAT GO BACK. SHE ALMOST FELL OFF THE BIKE AND IF IT WASN'T FOR THE LICENSE PLATE BRACKET NOT ONLY WOULD I HAVE LOST THE TOUR PACK, BUT MY WIFE WOULD HAVE BEEN SCATTERED ON THE STREET. THE BRACKET THAT HOLDS THE TOUR PACK BROKE WERE THE SCREWS GO THROUGH IT LIKE IF SOMEONE HAD HACKSAW THE PIPE. I FELL THAT THIS IS A DANGEROUS SITUATION. I HAVE HERD THAT I AM NOT THE  ONLY ONE THAT THIS HAS HAPPENED. SOME OF MY FELLOW RIDERS HAVE TAKE TO ME ABOUT THIS. I WOULD APPRECIATE AN ANSWER TO THIS PROBLEM. THANKYOU, RAFAEL *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/19/2008",
        "dateOfIncident": "08/01/2008",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10242918,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 HARLEY DAVIDSON FLHTCU.  THE CONTACT RECEIVED A RECALL NOTICE FOR NHTSA CAMPAIGN ID NUMBER 08V357000 (FUEL SYSTEM, GASOLINE:STORAGE:TANK ASSEMBLY:FILLER PIPE AND CAP) AND IMMEDIATELY CALLED THE DEALER.  A TECHNICIAN STATED THAT THE PARTS WERE UNAVAILABLE AND THE CONTACT WOULD RECEIVE A CALL WHEN THEY ARRIVED.  HE WAS NEVER CALLED SO THE DEALER WAS CALLED AGAIN.  THE TECHNICIAN STATED THAT WHEN THEY RECEIVED THE PARTS, THEY REPAIRED OTHER VEHICLES.  THE CONTACT WAS INFORMED THAT HE WOULD BE PLACED ON A WAITING LIST FOR THE NEXT SHIPMENT.  THE VEHICLE HAS NOT BEEN REPAIRED.  HE CALLED THE MANUFACTURER AND IS WAITING FOR A RESPONSE.  THERE HAD BEEN NO FAILURE TO DATE.     *UPDATED 10/20/08 *BF  AS OF OCT 7, 2008 THE BIKE STILL HAD NOT BEEN REPAIRED. UPDATED 10/21/08",
        "vin": "1HD1FC4348Y"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/15/2008",
        "dateOfIncident": "07/31/2008",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10242270,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 HARLEY DAVIDSON FLHTCU.  THE CONTACT RECEIVED A RECALL NOTICE FOR NHTSA CAMPAIGN ID NUMBER 08V357000 (FUEL SYSTEM, GASOLINE:STORAGE:TANK ASSEMBLY:FILLER PIPE AND CAP).  HE CALLED THE DEALER TO HAVE THE VEHICLE REPAIRED AND WAS INFORMED THAT THE PARTS NEEDED TO COMPLETE THE REPAIR, WOULD BE UNAVAILABLE UNTIL AUGUST 4, 2008.  THE DEALER PLACED HIM ON A WAITING LIST AND STATED THAT THEY WOULD CALL HIM WHEN THE PARTS ARRIVED.  THE MANUFACTURER STATED THAT THEY WOULD SEND THE PARTS TO THE LOCAL DEALER AND WOULD CALL THE CONTACT THE FOLLOWING DAY.  AS OF SEPTEMBER 15, 2008, THE PARTS HAVE NOT BEEN SHIPPED, NOR HAS THE CONTACT RECEIVED A RESPONSE FROM THE MANUFACTURER.  THERE HAD BEEN NO FAILURE TO DATE.",
        "vin": "1HD1FC4468Y"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/10/2008",
        "dateOfIncident": "10/13/2007",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10241724,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 HARLEY DAVIDSON ULTRA CLASSIC FLHTCU.  WHENEVER THE CONTACT ATTEMPTED TO SHIFT INTO FIRST GEAR, HE HEARD A CLANKING SOUND COMING FROM THE TRANSMISSION.  THE VEHICLE WAS TAKEN TO THE DEALER AND THEY STATED THAT THERE WERE NO DEFECTS ON HIS VEHICLE.  THE CONTACT DID NOT NOTICE ANY DIFFERENCES BEFOREHAND.  THE CURRENT MILEAGE WAS 7,061 AND FAILURE MILEAGE WAS 300.",
        "vin": "1HD1FC4458Y"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/03/2008",
        "dateOfIncident": "08/30/2008",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10240751,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 HARLEY DAVIDSON FLHTCU.  THE VEHICLE WAS REPAIRED ACCORDING TO NHTSA CAMPAIGN ID NUMBER 08V357000 (FUEL SYSTEM, GASOLINE:STORAGE:TANK ASSEMBLY:FILLER PIPE AND CAP).  THE CONTACT STATED THAT THE DEALER WOULD NOT PAY FOR THE DAMAGES ON THE VANCE HINES PIPE ON THE EXHAUST DUE TO THE RECALLED COMPONENT.  THE VIN WAS UNKNOWN.  THE CURRENT AND FAILURE MILEAGES WERE 74,000.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "08/25/2008",
        "dateOfIncident": "07/19/2008",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10239666,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "OUT FOR AN AFTERNOON RIDE WITH FRIENDS ON MY 08 ELECTRA GLIDE ULTRA CLASSIC.  WHILE ENTERING A LEFT CURVE, THE THROTTLE ACCELERATED ON ITS OWN.  THIS CAUSED THE BIKE TO SPEED UP UNEXPECTEDLY AND DRIFT RIGHT.  TRIED RETARDING THE THROTTLE AND GOT NO RESPONSE.   DEPRESSED THE CLUTCH AND APPLIED REAR BRAKES IN ATTEMPT TO SLOW THE BIKE DOWN WITHOUT RESULTS.   THIS RESULTED IN A SERIOUS SINGLE RIDER CRASH WITH LIFE THREATENING  INJURIES.  THIS BIKE HAS FLY-BY-WIRE THROTTLE.  HARLEY DAVIDSON CUSTOMER SERVICE STATES THAT THEY HAVE BEEN AWARE OF THROTTLE ISSUES WITH THE NEW TOURING MODELS SINCE SUMMER OF 2007.  HOWEVER INFORMATION/RECALL HAS NOT BEEN PASSED ON TO THE CUSTOMER CONCERNING THIS ISSUE.  I AM LUCKY TO BE ALIVE, SOMEONE ELSE MAY NOT BE SO FORTUNATE. *TR",
        "vin": "1HD1FC4148Y"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/20/2008",
        "dateOfIncident": "05/22/2008",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10238995,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE THROTTLE CONTROL ON THE MOTORCYCLE IS A \"THROTTLE BY WIRE\" TYPE OF CONTROL AND THE IDLE POSITION DOES NOT REMAIN CONSTANT. ONE TIME THE MOTOR WILL IDLE AT 1050 RPM'S AND THE NEXT TIME IT WILL IDLE AT 1400 RPM'S. ALSO WHILE DRIVING THE MOTORCYCLE THE IDLE POINT WILL INCREASE AND YOU CAN END UP WITH THE \"IDLE POINT\" AT 1800 RPM'S WHEN IT SHOULD BE SETTING AT 1050RPM'S. HARLEY DAVIDSON HAS NOT TAKEN ANY ACTION TO ADDRESS THIS HIGH IDLE CONDITION AND IT PUTS THE DRIVER AND PASSENGER IN DANGER OF A ACCIDENT. *TR",
        "vin": "1HD1FC4138Y"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/05/2008",
        "dateOfIncident": "08/04/2008",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10237066,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 HARLEY DAVIDSON FLHTCU.  THE CONTACT STATED THAT HE RECEIVED A RECALL NOTICE PERTAINING TO THE FUEL SYSTEM, GASOLINE.  THE DEALER STATED THAT THEY DID NOT KNOW WHEN THEY WOULD RECEIVE THE NECESSARY PARTS TO PERFORM THE REPAIR.  THE MANUFACTURER DID A SYSTEM OF \"WAVE SHIPMENTS\", SENDING ONLY A FEW PARTS TO EVERY DEALER.  THE MANUFACTURER HAS NOT BEEN NOTIFIED.  THERE HAD BEEN NO FAILURE TO DATE.  THE RECALL NUMBER WAS UNKNOWN.",
        "vin": "1HD1FC4158Y"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/09/2008",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10233930,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 HARLEY DAVIDSON FLHTCU ELECTRA GLIDE ULTRA CLASSIC MOTORCYCLE HAS A BRAKE PROBLEM.   CONSUMER STATES THAT THE REAR BRAKES ARE MAKING A SCREAMING NOISE.     *NJ  THE DEALER CLEANED THE PADS WITHOUT REMOVING THEM WITH BRAKE CLEAN. THE DEALER THEN REPLACED THE PAD PINS, BUT THE PROBLEM RETURNED 10 MILES LATER. *JB",
        "vin": "1HD1FC41X8Y"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/24/2008",
        "dateOfIncident": "06/21/2008",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10232134,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL FILTER HOUSING INSIDE GAS TANK. FAULTY HOUSING BREAKS.  *TR",
        "vin": "1HD1FC4108Y"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "06/11/2008",
        "dateOfIncident": "05/24/2008",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10230758,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THROTTLE ACCELERATES ON IT'S OWN. TOOK IT TO DEALER ON MAY 30TH TO REPAIR. WAS TOLD THAT HARLEY IS WORKING ON A FIX. WHEN IN TIGHT TURN IF BIKE ACCELERATES LOSS OF CONTROL AND LIFE CAN OCCUR.  *TR",
        "vin": "1HD1FC4108Y"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "11/08/2007",
        "dateOfIncident": "08/24/2007",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10208374,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTCU",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 HARLEY DAVIDSON MOTORCYCLE DEFECTIVE FRONT BRAKE SYSTEM. CONSUMER STATED THAT HE GOT INTO AN ACCIDENT THE DAY HE BOUGHT THE MOTORCYCLE. MECHANIC STATED THAT THERE WAS NOTHING WRONG WITH THE MOTORCYCLE.  *KB  THE CONSUMER STATED AS HE WAS ATTEMPTING TO STOP, HE BEGAN TO GEAR THE MOTORCYCLE DOWN FROM A SPEED OF 35 MPH AND BEGAN TO FEATHER THE FRONT BRAKE TO REDUCE SPEED. THE SECOND TIME HE GENTLY SQUEEZED THE FRONT BRAKE HANDLE, AND IT DIDN'T FEEL COMPLETELY NORMAL. THE THIRD TIME HE TOUCHED THE BRAKE LEVER THE FRONT BRAKE AND WHEEL COMPLETELY LOCKED. HE IMMEDIATELY RELEASED THE BRAKE LEVER GRIP WHEN THE WHEEL LOCKED. THE SPEED AT THAT TIME WAS 5-10 MPH. THE CONSUMER LOST CONTROL OF THE MOTORCYCLE AND IT WENT OFF THE RIGHT SIDE OF THE PAVEMENT THEN FELL OVER ON THE CONSUMERS LEG. THE CONSUMER WAS TOLD BY SOMEONE THAT HIS BIKE WAS EQUIPPED WITH BREMBO BRAKES THAT WERE CONSIDERED HIGH END BRAKES USED ON EXOTIC CARS AND RACING BIKES.  THE CONSUMER WAS TOLD THE BRAKES WOULD BUILD UP PRESSURE WHEN FEATHERING FOR A STOP, INSTEAD OF RELEASING PRESSURE WHEN THE LEVER WAS RELEASED, IT WOULD HOLD THE PRESSURE AND WHEN ENOUGH PRESSURE BUILT UP THE BRAKE WOULD LOCK THE NEXT TIME IT WAS TOUCHED.  *JB",
        "vin": "1HD1FC4108Y"
    }
]