[
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/15/2014",
        "dateOfIncident": "07/07/2014",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10610622,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLSTC",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEEL BEARING LOCKED UP ON REAR WHEEL. GILLETTE WY HARLEY DAVIDSON SERVICE FOREMAN TOLD ME THAT THE WHEEL BEARINGS USED WERE KNOWN TO FAIL AS EARLY AS 5000 MILES, AND COULD LAST UP TO 50,000 MILES. IN MY OPINION, THESE UN SAFE BEARINGS SHOULD NOT BE USED. BEARING WAS REPLACED WITH THE SAME TYPE THAT FAILED. H.D. PART NO.IS 9276A, BALL BEARING 25MM, DEEP GR. I WAS TOLD THAT THIS WAS THE ONLY BEARING AVAILABLE..  SERVICE MANAGER TOLD ME THAT THESE BEARINGS WERE NOT CONSIDERED SEALED OR SERVICEABLE BEARINGS. SERVICE MANAGER EASILY REMOVED SIDE COVER OF BEARING AND I COULD SEE THAT THERE WAS NOT MUCH GREASE INSIDE. HE TOLD ME THAT HE HAS SEEN THESE BEARINGS FULL OF RUST, INDICATING TO ME THAT THESE BEARINGS ARE NOT WATER PROOF. THESE BEARINGS ARE NOT ON A SCHEDULED MAINTENANCE PROGRAM BY H.D. NEITHER IS THERE A RECOMMENDED REPLACEMENT SCHEDULE.      AM I RESPONSIBLE FOR REPLACING THESE BEARINGS WITH THOSE THAT ARE MORE RELIABLE FROM A REPUTABLE MANUFACTURER? WHAT ARE MY OPTIONS IF ANY? I DO NOT FEEL SAFE RIDING ON THESE BEARINGS.  *TR",
        "vin": "1HD1BW5168Y"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/29/2012",
        "dateOfIncident": "07/29/2012",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10468143,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLSTC",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR BEARINGS BLEW OUT AT 25,300 MILES. HARLEY DAVIDSON REPLACED THE BEARINGS. 350 MILES LATER, SAME REAR BEARING BLEW OUT AGAIN EXCEPT NOW THERE IS DAMAGE TO FLY WHEEL, TIRE SHROUD AND TIRE DUE TO TIRE SHIFTING TO LEFT SIDE OF MOTORCYCLE. POSSIBLE FENDER DAMAGE.    *JS",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/09/2009",
        "dateOfIncident": "02/07/2009",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10258039,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLSTC",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2008 DIABLO PERFORMANCE CHOPPER THAT HAS A CRACKED FRAME LOCATED RIGHT UNDER THE GUSSET.  I PURCHASED THE BIKE ON 21 MAY 2008.  SINCE THEN THE BIKE HAS BEEN IN THE SHOP FOR FAULTY CHARGING SYSTEM, SPROCKET SCREWS BROKE IN HUB, BROKEN MOTOR MOUNT, BAD REAR SHOCKS, NEW IGNITION MODULE, AND THE BIKE HAD ONE THROTTLE CABLE WHEN IT SHOULD HAVE HAD TWO SO IT RESORTED IN THROTTLE CABLE BREAKING TWICE SINCE MAY OF 2008.  THE ABOVE VEHICLE WAS NOT LISTED IN THE DROP DOWN MENU.  PLEASE INCLUDE IN LIST. *TR",
        "vin": "1D9SL295380"
    }
]