[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/02/2018",
        "dateOfIncident": "09/25/2017",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11066699,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTC",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WOULD LIKE TO BRING TO LIGHT AN ISSUE I HAVE RECENTLY HAD FOUND. I RIDE A 2008 HARLEY DAVIDSON ELECTRAGLIDE. I ONLY   HAVE 42000 MILES ON IT. LAST FALL I WAS COMING BACK FROM A MEMORIAL MISSION WITH THE AMERICAN LEGION RIDERS. I NOTICED A STRANGE RATTLE IN MY PRIMARY CASE AREA. I GOT HOME AND PARKED IT UNTIL I COULD OPEN IT UP TO SEE WHAT THE ISSUE IS. A FEW WEEKS LATER I FINALLY WAS ABLE TO OPEN UP THE PRIMARY CASE. WHAT I FOUND WAS 2 LARGE PIECES OF METAL LOOSE IN THE PRIMARY CASE. THIS IS WHERE THE CLUTCH, DRIVE CHAIN, COMPENSATOR, AND STATOR ARE. IMMEDIATELY I WAS SCARED AND THANKFUL THAT ONE OF THOSE PIECES DIDN'T GET STUCK IN THE DRIVE CHAIN AND SPROCKET. IF IT HAD WHEN I WAS GOING DOWN THE ROAD IT WOULD HAVE LOCKED UP THE REAR WHEEL IMMEDIATELY AND I WOULD NOT BE HERE.   I FINALLY WAS ABLE TO DETERMINE THE PIECES CAME OFF THE COMPENSATOR. I BEGAN SEARCHING THE INTERNET TO SEE IF THIS WAS COMMON. TO MY SURPRISE IT IS COMMON AND HARLEY DAVIDSON CORPORATE KNEW ABOUT THE FLAWED DESIGN AND DID NOT DO A RECALL OR INFORM OWNERS OF THE ISSUE. I CONTACTED SALEM HARLEY DAVIDSON AND THEY PUT ME IN TOUCH WITH HARLEY DAVIDSON CUSTOMER CARE. WHEN I TALKED TO THEM I FOUND THEY KNEW OF THE ISSUE AND CHANGED THE DESIGN IN 2012.   I WAS TRYING TO GET THEM TO FIX MY BIKE BUT THEY REFUSED SAYING IT WAS OUT OF WARRANTY. GRANTED IT IS BUT THIS WAS A KNOWN ISSUE AND OWNERS SHOULD HAVE BEEN NOTIFIED. ONE OF THE MAIN REASONS FOR CONTACTING YOU IS TO HOPEFULLY MAKE PEOPLE AWARE OF THE PROBLEM. I CAN'T HELP TO WONDER HOW MANY MOTORCYCLE RIDERS HAVE LOST THEIR LIVES DUE TO THE SAME THING HAPPENING TO THEM. EXCEPT THEY WEREN'T AS FORTUNATE AS I WAS. AS I SAID BEFORE IF 1 OF THOSE PIECES GOT STUCK IN THE PRIMARY CHAIN WHILE GOING DOWN THE ROAD IT WOULD BE CATASTROPHIC. UNFORTUNATELY THE ACTUAL CAUSE MAY NOT BE FOUND BECAUSE OF THE EXTENSIVE DAMAGE.",
        "vin": "1HD1FF4138Y"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/01/2017",
        "dateOfIncident": "10/19/2017",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11042028,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTC",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 10-19-2017 I WAS RIDING WITH A GROUP OF FRIENDS ON OUR WAY TO A FELLOW BIKERS FUNERAL. WE WERE DOING ABOUT 45 MPH ON THE HIGHWAY, AS WE APPROACHED OUR TURN I ATTEMPTED TO START BRAKING WITH MY BACK BRAKE. WHEN I TRYED TO PUSH THE BACK BRAKE PEDAL DOWN NOTHING HAPPENED!!!!!!!!!!! THE PEDAL WAS FROZEN IN PLACE!!!!!!!!!  I BROUGHT THE BIKE TO A FRIENDS AND HE AND I STARTED TO LOOK INTO THE PROBLEM. WHEN WE GOT TO THE ABS BRAKE MANIFOLD, WE FOUND THAT WHEN WE CRACKED THE INLET LINE THE BACK BRAKE PEDAL WOULD GO DOWN AND PUSH FLUID OUT. WE TIGHTENED THE INLET LINE BACK AND BROKE LOOSE THE OUTLET LINE AND THE BACK BRAKE PEDAL WOULD NOT MOVE AGAIN. ON 11-1-2017 I SPOKE TO THE DEALERSHIP I BOUGHT THE BIKE FROM ( MIKE BRUNO'S HOUMA LOUISIANA) AND TOLD THEM WHAT HAPPENED. THEIR RESONSE WAS ...DO YOU HAVE THE EXTENDED WARRANTY? I TOLD THEM NO, SO THEY TOLD ME THE PART WILL COST $417.00. THANK GOD I DID NOT HAVE A PASSENGER WITH ME OR DID NOT HIT THE BIKE IN FRONT OF ME. THERE WAS ZERO WARNING BEFORE THIS FAILURE NO LIGHTS NO TIGHTING OF BRAKE PEDAL NOTHING!!!!!!!!!! I GUESS MY LIFE AND OTHERS IS ONLY WORTH $417.00 AND THAT IS ONLY IF I BUY THE NEW PART AND IT DON'T FAIL ALSO.",
        "vin": "1HD1FC4158Y"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/21/2016",
        "dateOfIncident": "10/15/2016",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10936640,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTC",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOOK MY BIKE OUT FOR A NICE RIDE AND NOTHING IN THE WAY OF A PROBLEM. THE NEXT DAY WENT TO RIDE THE BIKE AND MY FRONT BRAKE LEVER IS AS HARD AS A ROCK I WENT TO STOP AND HAD NO FRONT BRAKE. WENT THROUGH THE INTERSECTION . I CHECKED FOR TROUBLE CODES IN THE MEMORY AND IT SHOWED NONE.  TRIED TO BLEED THE FRONT BRAKES CRACKED THE BLEEDER AND LEVER MOVED FINE AND FLUID CAME OUT AS NORMAL . TRIED TO USE BRAKE AND LEVER WAS HARD AGAIN.  CALL THE LOCAL DEALER AND WAS INFORMED THE ABS MODULE WAS BAD AND IT WOULD COST A 1000.00 . I WAS UNDER THE IMPRESSION THAT IF THE SYSTEM FAILED IT WOULD JUST REVERT  BACK TO BRAKES WITH OUT ABS.AM I WRONG ABOUT THE WAY THEY SHOULD WORK INFORMED BY SERVICE WRITER THAT THEY COULD LOCK UP OR HAVE NO BRAKES AT ALL . I THINK THEY SHOULD TAKE A LITTLE MORE OF EFFORT TO FIND OUT WHAT THE PROBLEM RATHER THAN JUST COME UP WITH THE FIGURE OF 1000 AND SAY THE MODULE IS BAD . MAKES ME THINK THAT I AM NOT THE FIRST PERSON THAT THIS HAS HAPPENED TO. SAID HARLEY WOULD COVER BUT I INFORMED HIM IT RAN OUT 6 MONTHS AGO.  BY THE WAY I BOUGHT THE BIKE NEW. THANK YOU [XXX]      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "1HD1FF4198Y"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/14/2016",
        "dateOfIncident": "07/30/2016",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10906432,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTC",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECENTLY WAS RIDING WHEN THE FRONT BRAKE HANDLE ON THE BIKE STARTED TO VIBRATE. I WAS CLOSE TO HOME SO I WENT THERE. SINCE IT WAS TIME TO DO SOME MAINTENANCE ON THE BIKE I ORDERED PARTS AND OVER THE NEXT COUPLE OF MONTHS CHANGED FLUIDS AND DID OTHER ITEMS INCLUDING REPLACING THE FRONT RIGHT HANDGRIP. AFTER REPAIRS WERE COMPLETE I STARTED THE BIKE AND DID A TEST RIDE A FEW 100 METERS DOWN MY STREET AND WHEN I WENT TO USE THE BRAKES THE FRONT BRAKE HANDLE WAS FROZEN.  I ALSO NOTICED THAT THE REAR BRAKE WAS FEELING VERY STIFF. I REMOVED THE FRONT BRAKE FLUID COVER AND INSPECTION THE MASTER CYLINDER, CLEANS THE COVER AND REPLACED WITH THE SAME ISSUE OCCURRING. I THOUGHT MAYBE THERE WAS AN ISSUE WITH FLUID REACHING THE FRONT CALIPER AND INSPECTED THE BLEEDERS WHICH I OPENED SLIGHTLY WITH NO FLUID BEING ABLE TO REACH THE CALIPERS.  AT THIS TIME I DECIDED THAT THIS WAS BEYOND MY ABILITY TO SAFELY REPAIR AND SINCE THE BIKE NEEDED TIRES I TRAILERED THE BIKE TO THE DEALER. WHEN I REACHED THE DEALER I STARTED THE BIKE AND ATTEMPTED TO BACK THE BIKE DOWN AND AT THAT TIME THE REAR BRAKE FAILED COMPLETELY. I INFORMED THE DEALER OF THIS AND THE FRONT BRAKE BEING FROZEN.  THE DEALER THEN TOLD ME THAT BOTH MASTER CYLINDERS NEEDED TO BE REBUILT. NO MENTION OF ANY NOTICE FROM HARLEY WAS MENTIONED.  THE DEALER HAD NUMEROUS ISSUES GETTING THE PARTS FOR THE MASTER CYLINDERS AND THE BIKE SAT FOR OVER A MONTH.  THEY FINALLY RECEIVED THE PARTS AND TOLD ME THE BIKE WOULD BE READY ON THE AFTERNOON OF THAT DAY.  WHEN I WENT TO GET THE BIKE THEY INFORMED ME THAT THE ABS HAD FAILED AND THEY WAS A NEW PART FROM HARLEY DAVIDSON THAT WAS REPLACING THE OLD ABS CONTROLLER AND THAT IS WAS ON BACK-ORDER. I THEN CALLED HARLEY DAVIDSON DIRECTLY AND AS SOON AS THE HEARD THE MAKE AND MODEL OF THE BIKE THE CUSTOMER SERVICE PERSON SAID \"YES SIR THERE IS AN ISSUE WITH THE ABS CONTROLLER",
        "vin": "1HD1FF4198Y"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/18/2016",
        "dateOfIncident": "07/11/2016",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10885670,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTC",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "COMPENSATOR IN PRIMARY WENT OUT WITH ONLY 25,000 MILES. UPON RESEARCH, IT IS FOUND THAT THIS IS A KNOWN PROBLEM TO HARLEY, YET THEY HAVEN'T SAID ANYTHING. THIS IS A MAJOR COST TO THE CONSUMER AND MOST IMPORTANTLY DANGEROUS!!! IF THIS GOES OUT WHILE YOU ARE RIDING DOWN THE HIGHWAY, IT LOCKS THE BACK WHEEL AND PRIMARY ENGINE! NO TELLING HOW MANY DEATHS HAPPENED WITH THIS AND IT'S GOES WITHOUT ANYTHING BEING SAID. THERE SHOULD BE AN IMMEDIATE RECALL BEFORE MORE DEATHS OCCUR. THANK GOD MY MECHANIC FOUND THIS WHILE FIXING ANOTHER UNRELATED PROBLEM. HARLEY SHOULD RECALL AND FIX ASAP WITHOUT COST TO US CONSUMERS! BRYAN, TX",
        "vin": "1HD1FC4128Y"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/02/2016",
        "dateOfIncident": "04/01/2016",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10862470,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTC",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT BRAKES FAILED COMPLETELY. BRAKE LEVER BECAME ROCK HARD & WOULD NOT ACTIVATE THE FRONT BRAKES AT ALL. THIS OCCURRED WHEN ATTEMPTING TO USE VEHICLE AFTER IT HAD BENEFITTING A FEW DAYS. VERY SHOCKED WHEN I WENT TO USE THE FRONT BRAKES & THEY WOULD NOT WORK, ALMOST CAUSING AN ACCIDENT.",
        "vin": "1HD1FF4198Y"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/24/2015",
        "dateOfIncident": "08/14/2015",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10758755,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTC",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MET FRIENDS AT QUAKER STEAK FOR A RIDE,STARTED BIKE,RAN FOR 10 SECONDS THEN DIED,FUEL FILTER HOUSING CRACKED,WAS TOLD THERE WAS A RECALL ON THIS BUT DEALER STATED WAS NOT PART OF THE RECALL,TO ME IT SHOULD BE,HAD TO BE TOWED AND THEN 52.00 IN PARTS WITH ME FIXIG MYSELF",
        "vin": "1HD1FF4118Y"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/23/2014",
        "dateOfIncident": "04/23/2014",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10584542,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTC",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING MY HARLEY AT ABOUT 20-30 MPH PULLING UP TO RED LIGHT. GO TO HIT FRONT BRAKE. NOTHING. FRONT BRAKE IS COMPLETELY DISABLED WITHOUT ANY WARNING. IT APPEARS THAT HARLEY DAVIDSON HAS FAULTY ABS MODULES AND THIS IS NOT THE FIRST NOR PROBABLY THE LAST OF THIS ISSUE. THANK YOU FOR TAKING THE TIME TO READ MY COMPLAINT.   *TR",
        "vin": "1HD1FV4198Y"
    },
    {
        "components": "POWER TRAIN,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/02/2013",
        "dateOfIncident": "06/22/2013",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10554371,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTC",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THROTTLE GAVE OUT FOR NO APPARENT REASON. HAD NO RESPONSE FROM THE THROTTLE. STOPPED AND REMOVED HAND GRIP AND MOVED THE ELECTRONIC PART AND REPLACED HAND GRIP. THROTTLE WAS THE OK, THIS HAS HAPPENED ON 2 MORE OCCASIONS ON AUGUST 31ST AND SEPTEMBER 1ST, I DID THE SAME TO FIX THE PROBLEM. LUCKILY I WAS NOT A BUSY FREEWAY WHEN THESE INCIDENTS OCCURRED OR I MAY HAVE BEEN IN DANGER.  *TR",
        "vin": "5HD1FF4168Y"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/18/2013",
        "dateOfIncident": "01/17/2009",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10520433,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTC",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 HARLEY DAVIDSON FLHTC MOTORCYCLE. THE CONTACT STATED HE RECEIVED A NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 08V357000 (FUEL SYSTEM, GASOLINE) AND TOOK THE VEHICLE TO THE DEALER FOR RECALL SERVICE. THE CONTACT HAD NOT EXPERIENCED A FAILURE PRIOR TO THE RECALL SERVICE. THE CONTACT STATED THAT AFTER THE RECALL SERVICE, THE FUEL FILTER SHELL CRACKED LEADING TO A LOSS OF FUEL PRESSURE. AS A RESULT, THE VEHICLE STALLED WITHOUT WARNING. THE RECALL FAILURE WAS EXPERIENCED IN LESS THAN ONE YEAR AFTER THE SERVICE. THE VEHICLE WAS REPAIRED BUT THE FAILURE CONSISTENTLY RECURRED. THE FAILURE MILEAGE WAS 6,000 AND THE CURRENT MILEAGE WAS 36,000.  UPDATED 07/30/13*LJ",
        "vin": "1HD1FF4188Y"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/14/2013",
        "dateOfIncident": "05/19/2012",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10502754,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTC",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "BIKE WENT INTO LIMP MODE CAUSING THE BIKE TO SUDDENLY SHUT DOWN TO ABOUT 15 MPH. CAUSE WAS FRETTING OF THROTTLE BODY WIRING CONNECTOR PINS. FACTORY HAS KNOWN OF PROBLEM AND HAS A TCB OUT ON ISSUE. THIS IS VERY DANGEROUS WHEN RIDING ON HIGHWAYS. COMPANY NEED TO HAVE RECALL BUT THEY WON'T.  *TR",
        "vin": "1HD1FF4138Y"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/30/2013",
        "dateOfIncident": "06/10/2012",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10495183,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTC",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "RIDING FOR (RIDE FOR A REASON RUN) BIKE WENT INTO LIMP MODE CAUSING A TROUBLE CODE OF P1511. TOOK TO DEALER AND HAD NEW CONNECTOR PINS REPLACED IN THROTTLE CONTROL ACTUATOR. A COST OF $332.07 FOR REPLACEMENT OF 7 TERMINAL PINS, PINS COST $6.30 TOTAL. LABOR WAS OUT OF LINE. SAID IT TOOK 2.5 HR. THIS IS A SIMPLE FIX. SHOULD HAVE TOOK NO LESS THEN 1 HR. THIS IS ALSO A MAJOR PROBLEM ON THESE BIKES. I WAS RIDING WITH A LARGE GROUP WHEN LIMP MODE HAPPENED, BIKE SHUT DOWN IN LESS THEN 3 SECONDS. ALMOST WAS REAR ENDED . THE COMPANYS  GOT TO HAVE A RECALL ON THIS PROBLEM.  THERE IS A TSB ON PROBLEM. (TSB-418-1).  *TR",
        "vin": "1HD1FF4138Y"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/19/2012",
        "dateOfIncident": "06/03/2012",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10462211,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTC",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AT ANY GIVEN TIME THE VEHICLE SHUTS DOWN INTO LIME MODE WHEN DTCS 1511/2135 ARE STORED. WHEN CODES ARE GIVEN THE VEHICLE WILL REDUCE SPEED IN LESS THEN 5 SECONDS WHEN TRAVELING AT ANY SPEED. MY WIFE AND I WERE RIDING WITH A LARGE GROUP OF RIDERS WHEN BIKE SHUT DOWN CAUSING A NEAR PILE-UP.  THE SUSPECTED REASON FOR THE CODES IS THE REPLACEMENT OF TERMINALS PINS OF THE SOCKET ON THE PCM WIRES AND -OR THE TCA TERMINALS PINS ON THE SOCKET WIRES CAUSED BY FRETTING OF THE TERMINAL PINS.  THIS IS AN ON GOING PROBLEM ON 2008-LATER TOURING,POLICE AND TRIKE MODELS. THERE  IS A TECHNICAL SERVICE BULLETIN OR TECH TIP # TT-418-1. VERY DANGEROUS WHEN TRAVELING AT HIGHWAY SPEEDS AND IN GROUPS. I FEEL THEIR IS A NEED FOR A RECALL ON THIS PROBLEM.       *JS",
        "vin": "1HD1FF4138Y"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/06/2010",
        "dateOfIncident": "09/04/2010",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10353987,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTC",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 HARLEY DAVIDSON FLHTC WHEEL BEARING FAILURE. PROBLEM WAS FOUND DURING ROUTINE MAINT. HAD TO REPLACE FRONT AND REAR WHEEL BEARINGS. MOTORCYCLE ONLY AS 35,000 MILES THESE BEARINGS ARE SUPPOSED TO BE GOOD FOR 100,000 PLUS. WHEEL BEARING FAILURES ON A MOTORCYCLE CAN BE VERY DANGEROUS. *TR",
        "vin": "1HD1FF4188Y"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/11/2008",
        "dateOfIncident": "03/22/2008",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10230588,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTC",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 HARLEY DAVIDSON FLHTC.  THE CONTACT STATED THAT THE VEHICLE IDLED IRREGULARLY.  THE FAILURE WAS INTERMITTENT AND OCCURRED WHILE RIDING AT 60 MPH.  IF HE TOUCHED THE THROTTLE WHEN THE IGNITION WAS OFF OR WHEN JUST STARTING THE VEHICLE, THE IRREGULAR IDLING WOULD BEGIN.  THE NEXT TIME HE WOULD START THE VEHICLE, THE RPM'S WOULD OCCASIONALLY INCREASE TO 2,000 RPM'S OR HIGHER.  THE VEHICLE WOULD NOT DECELERATE DUE TO THE THROTTLE FAILURE.  THE CONTACT SPOKE WITH THE DEALER ON NUMEROUS OCCASIONS AND WAS INFORMED THAT MANY CONSUMERS HAVE COMPLAINED ABOUT THIS ISSUE; HOWEVER, THEY DID NOT KNOW THE REMEDY.  THE DEALER NEVER MADE AN ATTEMPT TO CORRECT THE FAILURE.  THE CURRENT MILEAGE WAS 2,950 AND FAILURE MILEAGE WAS 1.   UPDATED 07/29/08 *BF  THE MOTORCYCLE WOULD CHANGE IDLE RPM'S UP TO AND EXCEEDING 2000 RPM'S. AT THIS RPM, THE  MOTORCYCLE WILL NOT DECELERATE AS EXPECTED ON THROTTLE ROLL OFF. IF THE CONSUMER ROLLS OFF THE THROTTLE ENTERING A TURN OR WHEN ATTEMPTING TO STOP, THE MOTORCYCLE WILL CONTINUE ON AT AROUND 60 MPH. UPDATED. 07/29/08",
        "vin": "1HD1FF4188Y"
    }
]