[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/16/2018",
        "dateOfIncident": "05/11/2018",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11096405,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHP",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER RECENT BRAKE FLUID RECALL AND A FEW DAYS OF RIDING, ON MY WAY HOME AT A STOP THE FRONT BRAKE LEVER DIDN'T RELEASE AS USUAL. AT THE NEXT STOP THE BRAKES WOULDN'T FULLY DISENGAGE, THIS MADE IT SO THE BIKE COULD BARELY MOVE UNDER ITS OWN POWER. THE FRONT BRAKES ARE LOCKED UP AND WILL NOT ALLOW THE BIKE TO ROLL FORWARD. AFTER SITTING FOR A DAY OR SO THE BRAKES LOOSEN UP, AS SOON AS THE BIKE IS STARTED THE FRONT BRAKES LOCK UP AGAIN. THE ABS LIGHT IS NOW ON. EXTREMELY DANGEROUS CONDITION. THE DEALERSHIP THINKS IT IS THE HCU UNIT, BUT IS CURRENTLY INVESTIGATING.",
        "vin": "1HD1FHM168Y"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "07/12/2016",
        "dateOfIncident": "06/30/2016",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10884300,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHP",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 HARLEY-DAVIDSON FLHP STREET GLIDE. WHILE DRIVING 15 MPH, THE CONTACT DEPRESSED THE BRAKE PEDAL AND THE HAND BRAKES TO STOP THE MOTORCYCLE. THE BRAKES FAILED AND THE MOTORCYCLE CRASHED INTO A BUILDING. THERE WERE NO INJURIES AND A POLICE REPORT WAS NOT FILED. THE MOTORCYCLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THAT THE BRAKES FAILED.  THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED.  THE FAILURE MILEAGE WAS APPROXIMATELY 38,000.",
        "vin": "1HD1KB4478Y"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/09/2014",
        "dateOfIncident": "02/01/2013",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10578439,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHP",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THIS MOTORCYCLE ON 1/17/2014. ON 1/18/2014 I TOOK THIS VEHICLE FOR A RIDE. THE FRONT BRAKES OPERATED BUT HAD VERY LITTLE DEFLECTION OR MOVEMENT FROM THE BRAKE LEVER. THE FRONT BRAKE LEVER WAS EXTREMELY HARD TO PULL. I CONTACTED THE DEALER AND WAS TOLD THAT THIS WAS NORMAL. I CONTINUED TO RIDE THE VEHICLE AND I NOTICED THAT NOT ONLY WERE THE BRAKES HARD TO ENGAGE, THEY ALSO WOULD NOT HOLD AT RED LIGHTS.   I THEN BROUGHT THIS TO THE ATTENTION OF THE DEALER AND I WAS TOLD THAT THE HMU HAD A STICKING VALVE AND THAT IT NEEDED TO BE REPLACED AT THE TUNE OF $1200.00.    I WAS INFORMED THAT THE ABS ON THESE MOTORCYCLES WAS SUPPOSED TO FEEL LIKE A NORMAL BRAKING SYSTEM AND HAD A FAILSAFE IN PLACE THAT INSURED THAT IF SOMETHING WENT WRONG IT WOULD RESORT TO A SAFE MODE AND THE BRAKES WOULD OPERATE NORMALLY.    IN THIS CASE THEY ARE NOT ACTING NORMAL AND I DESCRIBE IT IN THIS MANOR. IF YOU HAVE EVER SHOT A HAND GUN, THE TRIGGER PULL IS APPROXIMATELY13 POUNDS OF PULL. MY FROM BRAKE LEVER IS APPROXIMATELY 60 POUNDS OF PULL AND IT WILL CREEP TOWARDS THE GRIP AT A RED LIGHT. AFTER A MINUTE OF BEING STOPPED AND HOLDING THE FRONT BRAKE LEVER, THE FRONT BRAKES ARE NONEXISTENT.    I HAVE DONE INTERNET RESEARCH AND MY FINDINGS ARE THAT THIS MALFUNCTION IS VERY COMMON AND DOES POSE A SAFETY HAZARD TO THOSE THAT EXPERIENCE IT.    I WAS ALSO AMAZED THAT MANY PEOPLE THAT HAVE EXPERIENCED THIS HAVE SUFFERED MORE SERIOUS PROBLEMS. FRONT BRAKES THAT LOCK UP AND CAUSE SERIOUS BODILY INJURY AND PROPERTY DAMAGE.    I'M REPORTING THIS BASED UPON THE SEVERITY AND THAT IT CAN CAUSE BRAKE FAILURE LEADING TO A CATASTROPHIC ACCIDENT.  *TR",
        "vin": "1HD1FHM1X8Y"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/03/2009",
        "dateOfIncident": "03/28/2009",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10264076,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHP",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 SPENCER BOWMAN CUSTOMS HIGH ROLLER CHOPPER HT MOTORCYCLE (NA).  WHILE DRIVING LESS THAN 30 MPH, THE FRAME FRACTURED ON THE VEHICLE.  NO REPAIRS HAVE BEEN MADE.  THE CURRENT AND FAILURE MILEAGES WERE LESS THAN 1,200.  UPDATED 05/05/09",
        "vin": "1S9HC299780"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/10/2008",
        "dateOfIncident": "07/31/2008",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10237581,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHP",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM IN RECEIPT OF A RECALL NOTICE FROM HARLEY DAVIDSON MOTORCYCLE COMPANY REGARDING A POTENTIALLY DEFECTIVE FUEL FILTER HOUSING, THE FAILURE OF WHICH \"COULD LEAD TO A CRASH WHICH WOULD CAUSE INJURY OR DEATH TO THE RIDER.\" IN CONTACTING THE SERVICING DEALER, I AM INFORMED THEY DO NOT HAVE PARTS FROM THE MANUFACTURER, AND ARE UNABLE TO PROVIDE A DATE WHEN PARTS WILL BECOME AVAILABLE ADDING THAT THE MANUFACTURER IS SHIPPING SPORADICALLY.    THE SERVICE DEPARTMENT ADVISE THEY HAVE HAD A NUMBER OF INCIDENTS PRIOR TO THE OFFICIAL RECALL, HENCE THERE WAS PRIOR NOTICE OF FAILURE AND THE DEALER SHOULD HAVE ACTED TO INSURE ADEQUATE SUPPLY OF NECESSARY PARTS. IN FACT, MOTORCYCLES AT RISK DATE TO MID-2007. AS THIS IS MY PRIMARY TRANSPORTATION AND THERE IS NO WAY OF DETERMINING PRIOR TO FAILURE THAT YOUR PARTICULAR MOTORCYCLE IS AT RISK, THIS FAILURE TO SUPPLY ADEQUATE PARTS IS COMPLETELY UNACCEPTABLE AND GROSSLY NEGLIGENT.  *TR",
        "vin": "1HD1FF4128Y"
    }
]