[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/13/2012",
        "dateOfIncident": "08/28/2008",
        "fire": false,
        "manufacturer": "Heartland Recreational Vehicles, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10475301,
        "products": [
            {
                "manufacturer": "Heartland Recreational Vehicles, LLC",
                "productMake": "HEARTLAND",
                "productModel": "CYCLONE",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "MARATHON",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT 2008 HEARTLAND CYCLONE RV EQUIPPED WITH GOODYEAR MARATHON TIRES, SIZE: ST225/75/15 D. THE CONTACT STATED THAT WHILE TRAVELING 55 MPH, THE PASSENGER SIDE CENTER TIRE BLEW. THE VEHICLE WAS DRIVEN TO A PRIVATE MECHANIC WHERE THE CONTACT WAS TOLD THAT THE TIRES COULD NOT HANDLE THE AXLE WEIGHT. THE VEHICLE WAS REPAIRED. THE FAILURE RECURRED EIGHT TIMES. THE FAILURE MILEAGE WAS 300.",
        "vin": "5SFGF40398E"
    },
    {
        "components": "SUSPENSION,POWER TRAIN,TIRES,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "09/13/2012",
        "dateOfIncident": "06/23/2012",
        "fire": false,
        "manufacturer": "Heartland Recreational Vehicles, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10475303,
        "products": [
            {
                "manufacturer": "Heartland Recreational Vehicles, LLC",
                "productMake": "HEARTLAND",
                "productModel": "CYCLONE",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "MARATHON",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 HEARTLAND CYCLONE TRAILER. THE CONTACT STATED THAT WHILE THE VEHICLE WAS PARKED WHEN HE NOTICED THAT THE PASSENGER SIDE FRONT WHEEL WAS LEANING INWARD. THE CONTACT DIAGNOSED THAT THE FAILURE WAS A BROKEN LEAF SPRING. THE VEHICLE WAS NOT TAKEN TO A MECHANIC. THE VEHICLE WAS REPAIRED BY THE CONTACT. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 5,000 AND THE CURRENT MILEAGE WAS 6,000.    ..UPDATED 09-28-12 *BF    THE CONSUMER STATED THERE WAS ALSO FAILURES WITH THE FRONT LIFTING JACKS. THE FIRST TIME THEY FAILED, THE WERE REPAIRED. AFTER THE SECOND FAILURE, THE CONSUMER WAS TOLD, BY BEST RV, THAT THE TRAILER WAS TO HEAVY TO HEAVY FOR THE MOTOR ON THE JACKS. THE JACKS WERE NOT REPAIRED. THE CONSUMER WENT TO THE DEALERSHIP TO HAVE THE AXLES LOOKED AT TO SEE IF THAT COULD BE THE CAUSE OF THE TIRE BLOW OUTS. THE CONSUMER WAS TOLD THE AXLES WERE TO LIGHT FOR THE TRAILER AND THE BEARINGS NEED TO BE PACKED. THE BEARINGS WERE PACKED. THE WARRANTY EXPIRED ON THE JACKS,AXLES, AND LEAF SPRINGS, AFTER A (1)YEAR. IT WAS ALSO DISCOVERED THAT THE TRAILER EMPTIED  IS OVER THE MAXIMUM WEIGHT. UPDATED 10/01/2012 *JS   UPDATED 9/26/12 *CN  THE CONSUMER STATED HE RECEIVED A LETTER IN THE MAIL FROM THE MANUFACTURER, STATING THE AXLES DID NOT HANDLE THE ORIGINAL AMOUNT OF WEIGHT HE WAS TOLD, WHEN HE PURCHASED THE TRAILER. THE CONSUMER WAS PROVIDED STICKERS, TO PLACE ON THE TRAILER AS A REMINDER. UPDATED 10/09/12",
        "vin": "5SFGF40398E"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/10/2011",
        "dateOfIncident": "07/14/2009",
        "fire": false,
        "manufacturer": "Heartland Recreational Vehicles, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10411680,
        "products": [
            {
                "manufacturer": "Heartland Recreational Vehicles, LLC",
                "productMake": "HEARTLAND",
                "productModel": "CYCLONE",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "22575R15",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "2008 CYCLONE TOYHAULER, HEARTLAND. I HAVE HAD UP TO EIGHT BLOW OUTS ON THIS TRAILER DUE TO UNDER RATED TIRES AND AXLE. I HAVE HAD TO HAVE THE SIDES OF THE CAMPER REPAIRED ON BOTH SIDES IN 2009. THEN THIS YEAR I HAD TWO BLOW OUT AND NOW HAVE TO HAVE THE SIDE OF CAMPER REPAIRED AGAIN. CAN SOME ONE DO SOMETHING TO HEARTLAND ABOUT THIS? THERE ARE PEOPLE OUT THERE WITH THE SAME ISSUES.  *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION,TIRES",
        "crash": false,
        "dateComplaintFiled": "05/31/2011",
        "dateOfIncident": "05/29/2011",
        "fire": false,
        "manufacturer": "Heartland Recreational Vehicles, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10403866,
        "products": [
            {
                "manufacturer": "Heartland Recreational Vehicles, LLC",
                "productMake": "HEARTLAND",
                "productModel": "CYCLONE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE AN 2008 HEARTLAND CYCLONE MODEL 4012 (41 FT LONG) 5TH WHEEL TOYHAULER RV TRAILER. IT CAME WITH 3 AXLES WITH 15\" LOAD RANGE \"D\" TIRES ON IT. EVERYTIME I USE THE TRAILER I HAVE A BLOWOUT SCATTERING TIRE CARCASS AND TRAILER DEBRIS ALL OVER THE ROAD BEHIND ME. IT HAS COST ME TIME AND MONEY EACH TIME AND I AM AFRAID IS EVENTUALLY GOING TO LEAD TO A CATASTROPHIC ACCIDENT DUE TO LOSS OF CONTROL. AFTER CONTACTING [XXX] (SERVICE DEPT. AT HEARTLAND) CONCERNING IF A RECALL FOR HEAVIER TIRES AND AXLES HAD BEEN MADE, HE SAID A NEW \"STICKER\" HAD BEEN ISSUED TO ORIGINAL OWNERS DROPPING THE AXEL RATINGS DOWN. IT IS OBVIOUS THAT BY DOING THIS THEY RECOGNIZE THEY HAVE A PROBLEM BUT INSTEAD OF RECALLING THEIR VEHICLES AND RE-FITTING THEM WITH AXLES AND TIRES APPROPRIATE TO CARRY THE WEIGHT THESE UNITS ARE DESIGNED TO THEY SEND OUT A .25 CENT STICKER AND REDUCE THE WEIGHT CARRYING CAPACITY OF THE UNIT. OVER HALF OF MY BLOW OUTS HAVE BEEN WITH NO CARGO WHAT SO EVER IN THE TOY HAULER AREA. [XXX] ALSO WANTED TO KNOW HOW MUCH WATER I WAS CARRYING ON MY LAST BLOW OUT, IT DOESN'T MATTER, HECK IF YOU CAN'T PUT WATER IN YOUR FRESH WATER HOLDING TANKS THEN WHY PUT THEM ON THE CAMPERS? HE WANTS ME TO TAKE MY TRAILER AND HAVE IT WEIGHED NOW THE WAY IT WAS LOADED DURING MY LAST BLOW OUT, HECK I AM AFRAID I WILL HAVE A BLOW OUT ON THE WAY. I KEEP NEW TIRES ON THIS THING ALSO AND ALSO HAVE UPGRADED TO LOAD RAGE \"E\" TIRES WHICH HAVEN'T HELPED. THE NEWER MODELS ARE COMING WITH 8 LUG AXLES AND HEAVIER TIRES, HEARTLAND KNOWS THEY HAVE A PROBLEM BUT SOMEONE NEEDS TO FORCE THEM TO REMEDY THE PROBLEM THEY HAVE NOT PUT A .25 STICKER ON THE FRAME AND SAY, ITS FIXED!!!      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).*TR",
        "vin": "5SFGF40388E"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/03/2010",
        "dateOfIncident": "10/01/2008",
        "fire": false,
        "manufacturer": "Heartland Recreational Vehicles, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10369074,
        "products": [
            {
                "manufacturer": "Heartland Recreational Vehicles, LLC",
                "productMake": "HEARTLAND",
                "productModel": "CYCLONE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 HEARTLAND CYCLONE. THE VEHICLE WAS LOADED TO THE PROPER LOAD CARRYING CAPACITY. WHILE ACCELERATING FROM A STOP, THE CONTACT HEARD A DRAGGING NOISE. THE CONTACT PULLED OVER AND NOTICED THAT THE SPARE TIRE WAS DRAGGING ON THE GROUND UNDER THE VEHICLE. THE CONTACT CALLED THE MANUFACTURER WHO STATED THAT THE VEHICLE WAS OPERATING AS IT WAS INTENDED TO. THE FAILURE OCCURRED WHENEVER THE VEHICLE WAS LOADED TO CAPACITY. THE VEHICLE HAD NOT BEEN REPAIRED. THE VIN WAS UNAVAILABLE. THE FAILURE MILEAGE WAS APPROXIMATELY 2,000 AND THE CURRENT MILEAGE WAS APPROXIMATELY 15,000.",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/19/2010",
        "dateOfIncident": "09/14/2010",
        "fire": false,
        "manufacturer": "Heartland Recreational Vehicles, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10356374,
        "products": [
            {
                "manufacturer": "Heartland Recreational Vehicles, LLC",
                "productMake": "HEARTLAND",
                "productModel": "CYCLONE",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "MARATHON",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "LEAVING WYOMING TRAVELING EAST. FOUND LEFT FRONT TIRE FLAT. CHECKED ALL AIR TWO DAYS EARLIER. TIRES WERE IN EXCELLENT SHAPE WHEN CHECKED. LOOKING AT FLAT ALL TREAD LOOKED NEW EXCEPT WHERE TREAD AND SIDEWALL MET. TREAD HAD WORN OFF CAUSING A FLAT. THIS TIRE LOOKED LIKE NEW TWO DAYS EARLIER. TWO WEEKS BEFORE I LEFT ON THIS TRIP I HAD TO REPLACE THE TIRE ON RIGHT FRONT BECAUSE OF BULGE AT THE SAME LOCATION ON THE TIRE. TREAD DEPTH ON BOTH TIRES WAS WITHIN 2/32S OF NEW.  PUT ON SPARE AND HEADED HOME. WITHIN ONE THOUSAND MILES RIGHT CENTER TIRE DELAMINATED AND BLEW TEARING UP THE WHEELWELL OF RV. ALL THREE TIRES WERE AT THE PROPER INFLATION CHECKED COLD. *TR",
        "vin": "5SFGF38368E"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/08/2010",
        "dateOfIncident": "06/08/2010",
        "fire": false,
        "manufacturer": "Heartland Recreational Vehicles, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10348010,
        "products": [
            {
                "manufacturer": "Heartland Recreational Vehicles, LLC",
                "productMake": "HEARTLAND",
                "productModel": "CYCLONE",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "TREDIT TIRE & WHEEL CO INC",
                "productMake": "TREDIT",
                "productModel": "TREDIT",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "FROM JUNE 8, 2010 TO AUG 4, 2010 I HAD 4 TREAD SEPARATIONS RESULTING IN 4 BLOWOUTS. MISSION TIRES. *TR",
        "vin": "5SFGF38348E"
    },
    {
        "components": "TIRES,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "06/22/2010",
        "dateOfIncident": "04/11/2007",
        "fire": false,
        "manufacturer": "Heartland Recreational Vehicles, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10339578,
        "products": [
            {
                "manufacturer": "Heartland Recreational Vehicles, LLC",
                "productMake": "HEARTLAND",
                "productModel": "CYCLONE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "APRIL 2007, TIRE BLOWOUT ON NEW 2008 HEARTLAND CYCLONE  5TH WHEEL TRAILER MDL 4012, FORCE OF THE BLOWOUT BENT FRONT AXLE. DISCOVERED AXLE RATING 5200 AND TIRES SIZE 225 75R15 D RATING 65PSI, TIRES INSUFFICIENT FOR WEIGHT OF TRAILER,  TRAILER NEEDS E RATED 80PSI TIRES.  CONSULTED WITH SAFETY EXPERT FROM RECREATIONAL VEHICLE SAFETY EDUCATION FOUNDATION WHO VERIFIED THE TIRES DID NOT MEET THE STANDARDS OF FEDERAL GUIDELINES AS TO THE WEIGHT IT COULD SUPPORT OF THE AXLES RATED AT 5200LBS.    CONFERENCE CALL WITH SAFETY EXPERT AND REPS FROM HEARTLAND WHO ARTICULATED THE SPECS OF THE TRAILER, AND AGAIN THE SAFETY EXPERT COMMUNICATED THE TIRES WERE UNSAFE AND INSUFFICIENT FOR THE WEIGHT OF THE TRAILER. HEARING WHAT THE  EXPERT HAD TO SAY HEARTLAND NOW CHANGED THEIR STORY TO A POSSIBLE TYPO AS TO THE WEIGHT OF THE AXLES THEY SHOULD BE RATED AT 5080 LBS.    END RESULT HEARTLAND AGREED TO REPLACE MY TIRES WITH 7 NEW TIRES AND WHEELS WITH A E RATING AND A 80 PSI ELEMENT TO MEET THE SAFETY REQUIREMENTS AS OUT LINED BY THE SAFETY EXPERT. HEARTLAND SHIPPED THE TIRES THE DEALER PUT THEM ON THE 5TH WHEEL.    NOV 23 ,2009  I WAS INFORMED BY A TIRE COMPANY THE VALVE STEMS ON MY TIRES WAS A DANGEROUS SITUATION THEY WERE FOR A 65 PSI TIRE NOT AN 80 PSI TIRE THAT THEY WERE INSTALLED IN.  THIS IS THE SECOND TIME I FEEL HEARTLAND IS PUSHING THE ENVELOPE PUTTING PEOPLES LIVES IN DANGER.    THEY HAVE NOT BEEN WILLING TO CORRECT THE VALVE STEM ISSUE, BECAUSE THEY SAY THEY HAVE NO RECORDS OF EVER SENDING THE REPLACEMENT TIRES OUT.  AND NOW I RECEIVED A REGISTERED LETTER WITH A NEW  FEDERAL STICKER TO PUT ON MY 5TH WHEEL WITH A NEW AXLE RATING DOWN TO 5080. I TRULY BELIEVE THEY KNEW THEY HAD A PROBLEM WITH THE TIRES AND INSTEAD OF UPGRADING THE TIRES THEY WORKED THE SYSTEM TO GET A NEW FEDERAL STICKER APPROVED INSTEAD OF REPLACING THE TIRES.     I ALSO JUST FOUND OUT THAT SAME COACH HAS BEEN RE-ENGINEERED TO USE 16 IN TIRES WHICH SHOULD HAVE BEEN ON IT IN THE FIRST PLACE. *TR",
        "vin": "5SFGF40338E"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "06/16/2010",
        "dateOfIncident": "07/07/2007",
        "fire": false,
        "manufacturer": "Heartland Recreational Vehicles, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10336634,
        "products": [
            {
                "manufacturer": "Heartland Recreational Vehicles, LLC",
                "productMake": "HEARTLAND",
                "productModel": "CYCLONE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 HEARTLAND CYCLONE RV. THE CONTACT  STATED THERE WAS A RECURRING FAILURE OF THE TIRES WEARING PREMATURELY. THE CONTACT ALSO STATED THAT HE RECEIVED THE RECALL NOTICE REGARDING NHTSA CAMPAIGN ID NUMBER 10V077000 (EQUIPMENT: OTHER: LABELS). THE CONTACT WAS NOT PLEASED WITH THE RECALL REMEDY. HE PURCHASED THE VEHICLE UNDER THE IMPRESSION IT COULD WITHHOLD A SPECIFIC AMOUNT OF WEIGHT. THE MANUFACTURER WAS NOTIFIED AND INFORMED THE CONTACT THEY COULD NOT SEND HIM TIRES TO SUPPORT A HEAVIER WEIGHT. THE FAILURE MILEAGE WAS 3,000 AND THE CURRENT MILEAGE WAS 20,000.",
        "vin": "5SFGF383X8E"
    },
    {
        "components": "SUSPENSION,TIRES",
        "crash": false,
        "dateComplaintFiled": "01/20/2010",
        "dateOfIncident": "11/10/2009",
        "fire": false,
        "manufacturer": "Heartland Recreational Vehicles, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10300463,
        "products": [
            {
                "manufacturer": "Heartland Recreational Vehicles, LLC",
                "productMake": "HEARTLAND",
                "productModel": "CYCLONE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "5TH WHEEL TRAILER GVWR STATED BY MFGR IS 18,000. THE 3 INDIVIDUAL AXLES ARE RATED AT 5200# EACH TOTALING 15,600# MAX..  TIRES ARE GOODYEAR MARATHON ST225/75R15 D-RATED MAX LOAD IS 2540 AT PSI 65 COLD TOTALING 15,240# MAX. UNIT HAS HAD TIRE SEPARATION AND BLOW OUTS.  REMAINING TIRES ON UNIT WERE INSPECTED BY GOODYEAR WINGFOOT COMMERCIAL TIRES AND 4 OF 6 ON THE GROUND WERE SUSPECTED OF SUFFERING BELT BREAKDOWN/SEPARATION AFTER LESS THAN 6,000 MILES. INITIAL INCIDENT RESULTED IN DAMAGE TO RV TRAILER IN THE AMOUNT OF APPROXIMATELY $2,800. ADDITIONALLY, REPLACING FAILING/SUSPECT TIRES COST $636.  AXLES PROVIDE 2,400# AND TIRES 2,760# UNDER THE MANUFACTURES STATED GVWR OF 18,000# . *TR",
        "vin": "5SFGF40338E"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/20/2008",
        "dateOfIncident": "07/04/2008",
        "fire": false,
        "manufacturer": "Heartland Recreational Vehicles, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10234953,
        "products": [
            {
                "manufacturer": "Heartland Recreational Vehicles, LLC",
                "productMake": "HEARTLAND",
                "productModel": "CYCLONE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DEAR REPRESENTATIVES OF THE NHTSA AND GOOD SAM CLUB,    1) ON 5/23/08 WHILE IN TRAVELING ON A CALIFORNIA HIGHWAY OUR CYCLONE'S SPARE TIRE WINCH FAILED, RELEASING THE SPARE TIRE WHILE IN TRANSIT. FORTUNATELY NO INNOCENT BYSTANDERS WERE INADVERTENTLY HARMED. ACCORDING TO RICHARDSON'S SERVICE CENTER MY ENSUING COMPLAINT WAS NOT THE FIRST OF THIS EXACT NATURE. HEARTLAND AUTHORIZED THE REPLACEMENT OF MY FAULTY WINCH AND THE REPLACEMENT OF MY SPARE TIRE ON 6/12/08; HOWEVER, AS OF THIS WRITING I AM STILL WAITING ON THESE PARTS, INCLUDING A SPARE TIRE. THOUGH HARTLAND ALLEGEDLY IS COVERING THIS MATTER UNDER WARRANTY, THEY HAVE NEVER EMPHASIZED ANY CONCERN OVER THE ACCIDENT OR ELUDED TO ANY IMPROVEMENTS IN THE SAKE OF SAFETY.     2) ON 7/4/08 WHILE IN TRANSIT ON A UTAH HIGHWAY MY CYCLONE'S DRIVER-SIDE FORWARD TIRE BLEW OUT, CONSEQUENTLY CAUSING SIGNIFICANT DAMAGE TO THE SIDE OF OUR TOY HAULER (SEE ATTACHED PHOTO). SOME OF THE SURROUNDING FACTS THAT HAVE CAUSED ALARM WITHIN VARIOUS TRANSPORTATION AUTHORITIES (NHTSA) AND MOTOR CARRIER SPECIALISTS (DOT/FMCSR), INCLUDING WITHIN FAMILY, IS AS FOLLOWS. THE ORIGINAL TIRES WERE GOODYEAR MARATHON ST225/75R15D (DATED 0107), RATED AT 2540 LBS. AT 65 PSI, WITH A COMBINE LOAD RATING OF 15,240 LBS. MY CYCLONE HAS A GVWR 18,000 LBS., WITH A DRY WEIGHT OF JUST UNDER 14,000 LBS, A (DRY) HITCH WEIGHT OF JUST UNDER 3,000 LBS (OR < 15% OF THE GVW), AND A GARAGE CARGO CAPACITY OF 2,500 LBS. CONSIDERING THIS WE WERE NOT ABLE TO LOAD 2,500 LBS. IN TO THE CARGO AREA (GARAGE) OF MY CYCLONE, WHILE NOT EXCEEDING THE TIRES COMBINED LOAD RATING OF 15,240 LBS., WITH THE TRAILER AT A LOGICAL LOAD (E.G. ENOUGH WATER/FOOD/CLOTHES FOR A WEEKEND FOR A FAMILY OF FOUR); NOT UNREASONABLY ABOVE ITS DRY WEIGHT. NOT TO MENTION THE ABSENCE OF ANY SAFETY FACTOR. FURTHERMORE, WE'VE ALSO REALIZED THAT HEARTLAND'S CURRENT CYCLONE SPECIFICATIONS NOTE FOR TIRES A ST225/75R16D, WHICH OBVIOUSLY HAVE A FAR MORE SUPERIOR LOAD RATING THAN DO THE 15\" TIRES.  *TR",
        "vin": "5SFGF403X8E"
    },
    {
        "components": "SUSPENSION,TIRES",
        "crash": false,
        "dateComplaintFiled": "02/18/2008",
        "dateOfIncident": "02/17/2008",
        "fire": false,
        "manufacturer": "Heartland Recreational Vehicles, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10218457,
        "products": [
            {
                "manufacturer": "Heartland Recreational Vehicles, LLC",
                "productMake": "HEARTLAND",
                "productModel": "CYCLONE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FOLLOWING IS CONCERNING A 2007 HEARTLAND, CYCLONE RV. THIS THREE AXLE UNIT HAS MISSION 225/75R15 TIRES .DEC. 2006 - UNIT PURCHASED. JAN. 2007 TRAVEL TN TO  CA. UPON RETURNING IT WAS FOUND THE TIRES ON THE UNIT WERE WEARING TO THE BELTS. FEB. 27 TO APRIL 05, 2007  UNIT AT TENNESSEE RV FOR REPAIR. REAR AXLE REPLACED ALONG WITH THE TIRES. AUG. 09, 2007. TRAVEL FLORIDA FROM TN. PASSENGER SIDE CENTER TIRE SUFFERS A BLOW OUT. ROADSIDE SERVICE CALLED AND THE SPARE MOUNTED. AUG, 2007 TRAVEL FLORIDA TO TN DRIVERS SIDE SUFFERED A BLOWOUT. SERVICE WAS CALLED AND A NEW TIRE OBTAINED. AUG 17, TO DEC. 04, 2007. UNIT AT TENNESSEE RV FOR REPAIR TIRES AND DAMAGE RESULTING FROM BLOWOUTS. REPAIRS MADE, FRONT & CENTER AXLES REPLACED. TIRES CHANGED DUE TO WEAR. SPEAKING WITH HEARTLAND RV'S THE UNIT WAS TAKEN TO A CERTIFIED SCALE AND THE TOTAL WEIGHT WAS 14,640. HEARTLAND ADVISED THAT AN ADDITIONAL 2000 POUNDS WAS AVAILABLE FOR EQUIPMENT. DEC. 31,2007 TRAVEL TN TO CA. UNIT TAKEN TO A SCALE AND CERTIFICATE 13,360 TRAILER AXLE WEIGHT. A TIRE PRESSURE SYSTEM  INSTALLED TO MONITOR TIRES. ARRIVAL IN CA, FOUND REAR AXLE AGAIN WEARING TIRES. JAN. 28, 2008 TRAVEL CA TO  AZ.,13,540 REAR AXLE WEIGHT. JAN. 31, 2008 EMAIL REQUEST SENT TO HEARTLAND RV'S STATING THE TIRES WERE AGAIN WEARING. HEARTLAND ADVISED REAR PASSENGER TIRE AT 50% LOSS, DRIVERS TIRE AT A 25% LOSS IN TREAD. HEARTLAND ASKED TO RESPOND WITH RECOMMENDATIONS. FEB. 06, 2008 A SECOND EMAIL SENT TO HEARTLAND AS NO RESPONSE WAS RECEIVED FROM FIRST REQUEST. FEB. 13, 2008 TRAVEL AZ TO TX.,13,840 REAR AXLE WEIGHT. FEB 17, 2008 TRAVEL TX TO GA., 14,020 REAR AXLE WEIGHT. IN KENTWOOD, LA DRIVERS SIDE REAR TIRE SUFFERED BLOWOUT WITH DAMAGE TO THE UNIT. ROADSIDE SERVICE CALLED. ALL TIRES WERE CHECKED FOR PRESSURE LEVELS. DRIVERS FRONT 69LBS, DRIVERS CENTER 67 LBS, PASS. FRONT 70LBS, PASS. CENTER 70LBS, PASS. REAR 69LBS. MEASUREMENT TAKEN AFTER THE BLOWOUT SO EACH TIRE WAS STILL HOT FROM 4 HOURS OF TRAVEL ON THE ROAD.  *TR",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/08/2007",
        "dateOfIncident": "06/21/2007",
        "fire": false,
        "manufacturer": "Heartland Recreational Vehicles, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10198837,
        "products": [
            {
                "manufacturer": "Heartland Recreational Vehicles, LLC",
                "productMake": "HEARTLAND",
                "productModel": "CYCLONE",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "NANKANG RUBBER & TIRE CORP.",
                "productMake": "NANKANG",
                "productModel": "MISSION",
                "productYear": "9999",
                "size": "ST 225/75 R15",
                "type": "Tire"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 HEARTLAND CYCLONE, MODEL 3795.  THE VEHICLE HAS MISSION TIRES, SIZE ST2257515 (NA).  WHILE DRIVING 60 MPH, A PASSENGER SEATED IN THE REAR NOTICED SMOKE AND RUBBER FLYING PAST THE WINDOW.  THE CONTACT DISCOVERED THAT THE PASSENGER SIDE REAR CENTER TIRE BLEW OUT.  THE VEHICLE WAS PULLED OVER AND THE CONTACT REPLACED THE FAILED TIRE WITH THE SPARE.  THE CONTACT DROVE SIX MILES TO THE NEAREST REPAIR SHOP.  WHEN HE ARRIVED, THE TIRES HAD BUBBLES AND WERE VERY SOFT.  ALL SIX TIRES WERE REPLACED.  THE DOT NUMBER WAS UNKNOWN.  NO VEHICLE INFORMATION WAS AVAILABLE.  UPDATED 02-01-08.  *KB  UPDATED 02/01/08  *TR",
        "vin": "5SFGF38328E"
    },
    {
        "components": "TIRES,TRAILER HITCHES",
        "crash": false,
        "dateComplaintFiled": "05/01/2007",
        "dateOfIncident": "04/06/2007",
        "fire": false,
        "manufacturer": "Heartland Recreational Vehicles, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10189409,
        "products": [
            {
                "manufacturer": "Heartland Recreational Vehicles, LLC",
                "productMake": "HEARTLAND",
                "productModel": "CYCLONE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 HEARTLAND CYCLONE MODEL # 4012.  THE CONTACT'S VEHICLE  WAS INVOLVED IN A CRASH WHICH CAUSED A TIRE TO BLOWOUT.  ACCORDING TO THE MANUFACTURER'S REPORT THE TIRES SHOULD BE  16 INCHES TO SUPPORT THE WEIGHT OF THE VEHICLE.  HOWEVER, THE CONTACT'S TIRES ARE  15 INCHES.  THE DRY WEIGHT OF THE COACH  WAS 13,696 LBS, UNLOADED.  THE TIRE ID NUMBER WAS  225/75/R15.  THE MANUFACTURER STATED THAT THE TIRES  WERE 400 LBS MORE THAN THE RECOMMENDED WEIGHT.  THE TOYHAULER CARGO'S CAPACITY WAS 2,500 LBS.  THE FUEL CAPACITY WAS 50 GALLONS WITH A WATER WEIGHT CAPACITY OF 100 GALLONS.  THE TIRES WERE UNDERRATED AND POSED A SAFETY CONCERN.  THE MANUFACTURER STATED THAT THE TIRES  WERE INSUFFICIENT FOR THE WEIGHT OF THE VEHICLE.  THE DEALER STATED THAT THE TIRES  WERE  UNACCEPTABLE TO OPERATE THE VEHICLE NORMALLY.  THE MANUFACTURER DID  NOT HAVE THE TIME TO REDESIGN AND REPOSITION THE AXLE ON THE TIRE.  ALSO, THE MANUFACTURER STATED THAT THERE HAVE BEEN OTHER BLOWOUT FAILURES.  THERE WAS PROPERTY DAMAGE.   THE ELECTRICAL WIRES WERE VISIBLE IN THE VEHICLE,  AND THE SHEET METAL WAS REPLACED.  THE REPAIRS COST $1,700.  THE FAILURE AND CURRENT MILEAGES WERE 300.  *AK",
        "vin": "5SFGF40338E"
    }
]