[
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/30/2019",
        "dateOfIncident": "03/29/2019",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11192584,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC SI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL. HONDA REFUSES TO COME TO MY CLIMATE CONTROLLED GARAGE AND REPLACE MY RECALLED PASSAGER SIDE AIR BAG ACTIVATOR-SEEMS MAYBE DISCRIMINATION- AGE RELATED. MAYBE- OR MAYBE JUST MEAN.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/08/2018",
        "dateOfIncident": "11/30/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11157000,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC SI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "COOLANT LEAK FROM THE RADIATOR. NEW HEAD GASKETS, NEW SEALS. MYSTERY COOLANT LEAK, COOLANT PUSHES FROM THE RADIATOR TO THE OVERFLOW, LEAVING RADIATOR LOW COOLANT. NEW SEALS AND NEW WATER PUMP, NO DRIPS OR INDICATION OF LEAKING",
        "vin": "2HGFA555X8H"
    },
    {
        "components": "UNKNOWN OR OTHER,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/06/2018",
        "dateOfIncident": "10/01/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11138831,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC SI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SUN VISOR WAS RCALLED AND FIXED BUT IT IS STILL DOING THE SAME THNG IT WAS RECALLED FOR.",
        "vin": "2HGFG21508H"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/19/2018",
        "dateOfIncident": "02/19/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11073579,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC SI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2008 HONDA CIVIC SI HAS BEEN LEAKING COOLANT FOR THE PAST COUPLE WEEKS. IT IS CURRENTLY AT AROUND 115,000 MILES. I NOTICED ALL OF THE EXTENDED WARRANTY INFORMATION ABOUT THE 06-09 HONDA CIVICS AND CONTACTED BOTH THE DEALERSHIP AND CORPORATE MYSELF. THEY TOLD ME THAT BECAUSE MY MODEL WAS NOT THE BASE MODELS BUT THE SI THAT IT WAS A DIFFERENT ENGINE AND THAT THEY COULD NOT HELP ME.  HOWEVER I AM GOING TO GET THE CAR BACK FROM MY MECHANIC TODAY WHO ESTIMATED THE REPAIRS WOULD BE $4500 TO COMPLETELY REPLACE THE ENGINE. HE ALSO BROUGHT UP THIS EXTENDED WARRANTY ISSUE AND SUGGESTED I CONTACT HONDA AGAIN BECAUSE THE PRESSURE FRACTURES ARE IN THE EXACT SAME PLACE AS THEY ARE ON THE BASE MODEL 06-09 ENGINE BLOCKS. FROM MY KNOWLEDGE AND THE MECHANICS THE ENGINES MAY NOT BE THE SAME BUT THE BLOCK IS MADE OF THE SAME MATERIAL IF NOT THE EXACT SAME BLOCK.    THIS IS COSTING ME MY CAR AS A WHOLE AND THE $4800 LOAN I STILL OWE ON IT. I AM NOW OUT OF A CAR UNLESS I DRIVE IT AND REFILL THE COOLANT WEEKLY UNTIL THE ENGINE COMPLETELY SEIZES AND STOPS WORKING. THIS WILL PUT A HUGE AFFECT ON MY JOB, FINANCIAL SITUATION, AND MY CREDIT SCORE AT THE AGE OF 19.    THIS IS INSANE AND SHOULD BE HONDA'S JOB TO TAKE CARE OF CONSIDERING THEY ARE ATTEMPTING TO KEEP THE ENTIRE ISSUE FOR THE OTHER MODELS ON THE LOWEST OF LOWS THEY CAN TO AVOID PAYING FOR ALL THE NEW ENGINES.  A COMPANY THIS LARGE SHOULD NOT BE ABLE TO PUT THIS MANY PEOPLE OUT OF VEHICLES AND AFFECT THEIR DAILY LIVES BECAUSE THEY THOUGHT THIS WAS A RELIABLE AND SENSIBLE BRAND.",
        "vin": ""
    },
    {
        "components": "STRUCTURE,WHEELS",
        "crash": false,
        "dateComplaintFiled": "11/06/2017",
        "dateOfIncident": "01/12/2017",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11043619,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC SI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MY 08 HONDA CIVIC SI IN FIJI BLUE PAINT, THE CLEAR COAT IS DETERATING ON THE ROOF AND NOW WHEELS ARE PEELING CLEAR..  MY CAR IS GARAGE KEPT AND WELL MAINTAINED.  I DID SEE WHERE HONDA WOULD REPAINT AFFECTED AREAS, SO ON MY LAST VISIT TO DEALER I ASK THE SERVICE LADY TO PLEASE PLEASE FIX. SHE INFORMED ME THAT SHE WOULD DOCUMENT  SAID AREAS AND E-MAIL ME WHAT TO DO NEXT.  IT HAS BEEN 3 MONTHS WITH NO SOLUTION.  I HAVE MET A COUPLE OF OTHER HONDA OWNERS THAT HAS HAD THE AREAS REPAINTED.  SO I DONT KNOW WHERE TO GO FROM HERE.  I DID SEE THAT THESE CERTAIN COLORS WERE IN A CAMPAIGN FOR THIS REASON. I WAS INFORMED THAT A DEADLINE WAS  PLACED, BUT IS THE DEALERS DISCRETIONON WHICH CARS TO RE PAINT AND SINCE MY CAR IS GARAGE KEPT THE SPOTS ARE NOT AS LARGE AS OTHER PHOTOS IVE SEEN.  BUT LATELY IVE NOTICED AREAS ARE GROWING.  SO I GUESS IM ALSO ASKING ANY ADVICE ON HOW TO GET THIS RESOLVED..I DO LIKE MY CAR.  THANKS IN ADVANCE FOR ANY HELP.",
        "vin": "2HGFA555X8H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/15/2017",
        "dateOfIncident": "05/23/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11015400,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC SI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A RECALL ON THE PASSENGER AIR BAG. KA5",
        "vin": "2HGFA55578H"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/22/2017",
        "dateOfIncident": "01/01/2015",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000735,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC SI",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE IS A 2008 CIVIC SI MUGEN PAINTED IN FIJI BLUE PEARL.  PAINT AND CLEAR-COAT ARE OXIDIZING, CHIPPING AND PEELING.  WHEN WE'VE COMPLAINED ABOUT THIS TO THE AUTHORIZED SERVICE DEPARTMENTS, THE EXISTENCE OF A KNOWN PROBLEM HAS BEEN DENIED AND IT'S BEEN STATED THIS ISSUE IS 'NORMAL WEAR & TEAR', WHICH IT CLEARLY IS NOT.  WE JUST FOUND OUT YESTERDAY THERE WAS ACTUALLY A TSB (TSB 14-034) PUT OUT ON THIS, ALONG WITH A WARRANTY EXTENSION THAT IS NOW EXPIRED.  ACCORDING TO THE TSB, OWNERS WERE BEING NOTIFIED OF THE WARRANTY EXTENSION.  WE HAVE NEVER RECEIVED NOTIFICATION AND AS STATED ABOVE, WHEN WE'VE COMPLAINED, WE'VE BEEN TOLD THERE WAS NO PROBLEM.  THE COST TO FIX THIS WILL BE SIGNIFICANT AND AS TIME GOES BY, THE PAINT ISSUE IS BECOMING WORSE.",
        "vin": "2HGFA55558H"
    }
]