[
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/24/2016",
        "dateOfIncident": "11/17/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10927758,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "VT750",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 HONDA SHADOW SPIRIT AFTER PURCHASING THE BIKE FROM A A HONDA DEALERSHIP AS NEW, I KEPT NOTICING A STRONG GAS SMELL IN THE GARAGE.BUT I WAS NEVER ABLE TO FIND THE SOURCE, I SUSPECTED THAT IT HAD SOMETHING TO DO WITH MY MOTORCYCLE BUT COULD NOT SEE ANYTHING SO I MADE SURE THAT THE PETCOCK VALVE WAS IN THE OFF POSITION AND THEN I WOULD NOTICE THAT AFTER TIME THE SMELL DISAPPEARED.  EVERY TIME I WOULD TAKE THE BIKE OUT FOR A RIDE I WOULD SMELL THIS SMELL WHEN I PARKED IT BUT AS LONG AS I KEPT THE PETCOCK VALVE CLOSED IN THE GARAGE THE SMELL WOULD DISIPATE. LAST WEEK AFTER STARTING THE BIKE AND CHANGING THE OIL I NOTICED A STAIN UNDER BIKE AND FOUND IT WAS GALOLINE. I THEN NOTICED GAS DRIPPING FROM PETCOCK  VALVE, WHEN I SHUT IT OFF THE DRIPPING STOPPED. AFTER ONLINE RESEARCH, I DISCOVERED IT WAS A COMMON PROBLEM AND THERE WAS A RELATED RECALL FOR THE EXACT ISSUE. WHEN I CONTACTED THE DEALER I WAS INFORMED THE RECALL HAD ALREADY BEEN PERFORMED ON THE BIKE, AND I WOULD HAVE TO PAY FOR THE REPAIR OUT OF POCKET.  HONDA BLAMED ME FOR THIS PROBLEM SAYING THAT I DO NOT RIDE THE MOTORCYCLE ENOUGH AND THAT THE GAS WAS TOO OLD IN THE BIKE. ONLINE I FIND DOZENS OF COMPLAINTS OF DRIPPING GAS FROM PETCOCK AFTER RECALL WAS PERFORMED. I PURCHASE THIS 2008 FROM DEALERSHIP IN 2012 AS NEW. THERE WAS GAS IN BIKE WHEN IT WAS PURCHASED SO THERE IS NO TELLING HOW OLD THE GAS WAS IN THE BIKE. THIS DRIPPING FUEL CAN IGNITE AND CAUSE SEVERE INJURY OR DEATH.",
        "vin": "JH2RC53018M"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/21/2016",
        "dateOfIncident": "11/21/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10927252,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "VT750",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 HONDA VT750 SHADOW MOTORCYCLE. THE CONTACT STATED THAT FUEL WAS LEAKING ONTO THE ENGINE. THE MANUFACTURER WAS NOTIFIED. THE DEALER STATED THAT IT WOULD COST $600 TO REPAIR THE VEHICLE. IT WAS DIAGNOSED THAT THE VALVE WAS LEAKING. THE FAILURE MILEAGE WAS 1,700.",
        "vin": "JH2RC53018M"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/15/2013",
        "dateOfIncident": "06/17/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10524422,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "VT750",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 HONDA SHADOW SPIRIT VT750.  CONSUMER WRITES IN REGARDS TO FUEL VALVE DIAPHRAGM RECALL NOTICE.  *SMD  THE CONSUMER STATED A MONTH AFTER PURCHASING THE BIKE FROM A PRIVATE PARTY, HE NOTICED A STRONG GAS SMELL IN THE GARAGE. AFTER LOOKING OVER THE BIKE, HE WAS ABLE TO LOCATE THE CAUSE OF THE SCENT. THE FUEL VALVE WAS DRIPPING FUEL ONTO THE PRIMARY COVER.  UPON DOING SOME ONLINE RESEARCH, HE DISCOVERED IT WAS A COMMON PROBLEM AND THERE WAS A RELATED RECALL FOR THE EXACT ISSUE. WHEN THE CONSUMER CONTACTED THE DEALER, TO INQUIRE MORE ABOUT THE RECALL, HE WAS INFORMED THE RECALL HAD ALREADY BEEN PERFORMED ON THE BIKE, AND HE WOULD HAVE TO PAY FOR THE REPAIR OUT OF POCKET.",
        "vin": "JH2RC53008K"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/15/2010",
        "dateOfIncident": "03/05/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10319989,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "VT750",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 HONDA VT750 MOTORCYCLE. THE CONTACT NOTICED A PUDDLE OF GASOLINE ON HIS GARAGE FLOOR WHICH HAD LEAKED FROM THE BOTTOM OF THE VEHICLE. THE DEALER INFORMED THE CONTACT THAT THE VALVE IN THE DIAPHRAGM WAS LEAKING AND REPLACED IT. THE CONTACT WAS ALSO INFORMED THAT NHTSA RECALL #08V141000 FUEL SYSTEM, GASOLINE DELIVERY DID NOT APPLY TO HIS VIN. THE FAILURE AND CURRENT MILEAGES WERE 1180               UPDATED 4/28/10 *CN  UPDATED 05/20/10",
        "vin": "JH2RC53498K"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/15/2009",
        "dateOfIncident": "06/20/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10276881,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "VT750",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 HONDA VT750 MOTORCYCLE.  WHENEVER THE CONTACT STARTED THE VEHICLE, THE IGNITION WOULD FAIL TO REMAIN STARTED.  WHEN SHE DEPRESSED THE BRAKE PEDAL, THE VEHICLE WOULD STALL AND SHUT OFF COMPLETELY.  THE FAILURES OCCURRED EVERY TIME SHE USED THE VEHICLE.  SHE TOOK THE VEHICLE TO THE DEALER, BUT DID NOT WANT TO USE THE PROCESS OF ELIMINATION TO LOCATE THE CAUSE OF THE FAILURES.  THE MANUFACTURER HAS NOT BEEN NOTIFIED.  THE CURRENT MILEAGE WAS 799 AND FAILURE MILEAGE WAS APPROXIMATELY 750.",
        "vin": "JH2RC504X8K"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/01/2009",
        "dateOfIncident": "07/20/2008",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10275450,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "VT750",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN HAVING PROBLEMS WITH MY 2008 HONDA SHADOW AERO AND THE PETCOCK LEAKS. EVEN THOUGH THIS IS A RECALL I HAVE HAD TO COMPLAIN TO THE BBB AGAINST NOT ONLY THE DEALERSHIP BUT THE HONDA CORP AS WELL AND STILL YET MY PETCOCK LEAKS. IT HAS BEEN SERVICED SEVERAL TIMES YET NO RESOLUTION. I TURNED THIS OVER TO A LEMON LAW FIRM BUT HONDA STILL DID NOTHING ABOUT THE ONGOING PROBLEM. THE LEMON LAW PEOPLE HAVE NO TURNED THIS OVER TO A LAWYER AND NOW THIS SITS IN A COURT OF LAW BECAUSE THE CUSTOMER SERVICE PORTION OF THIS IS JUST GOTTEN TOO FAR OUT OF LINE NOT TOO MENTION...IT STILL LEAKS  I AM STILL AWAITING A JUDGES DECISION AS TO WHAT MIGHT HAPPEN TO MY MOTORCYCLE AND ITS LEAKS AS WELL AS A STAIN CASE AS A RESULT OF THE GAS LEAKAGE.  ANY HELP THAT YOUR COMPANY CAN PROVIDE WOULD BE GREAT.  I HAVE TONS MORE INFO ON THIS IF YOU NEED MORE INFO. *TR",
        "vin": "JH2RC50458K"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/04/2008",
        "dateOfIncident": "08/02/2008",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10236913,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "VT750",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SOMETIME IN JUNE I BOUGHT A BRAND NEW 2008 HONDA SHADOW SPIRIT VT750C2 FROM DRYER HONDA SOUTH IN NEW WHITELAND, IN. AFTER ABOUT A WEEK I NOTICED THAT THERE WAS GAS LEAKING ONTO THE ENGINE AND A HOUSING THAT WAS NEXT TO THE ENGINE. I FOUND ONLINE A RECALL FOR THAT PARTICULAR BIKE THAT WAS FOR A GAS LEAK. I BROUGHT THE BIKE BACK TO DRYER AND SHOWED THEM THE SPOTS ON THE BIKE WHERE THE GAS WAS LEAKING. AFTER KEEPING THE BIKE FOR A COUPLE OF HOURS THEY TOLD ME THAT THEY COULD NOT FIND A LEAK. I MENTIONED TO THEM THAT I SAW A RECALL ONLINE FOR A GAS LEAK AND THEY ASSURED ME THAT THEY DID THE RECALL BEFORE I PURCHASED THE BIKE. THE NEXT TIME I RODE THE BIKE I NOTICED NEW SPOTS ON THE HOUSING, I KNEW THIS BECAUSE THEY WIPED OFF THE ORIGINAL SPOTS(WHICH BY THE WAY DID NOT COMPLETELY COME OFF AND HAD STAINED MY BRAND NEW BIKE). I HAD TO ONCE AGAIN BRING THE BIKE DOWN TO DRYER.  UPON KEEPING THE BIKE FOR A COUPLE OF DAYS THEY TOLD ME THAT THEY HAD FOUND THE LEAK AND TOLD ME THAT THEY REPLACED THE ENTIRE FUEL VALVE PETCOCK. AT LEAST I THINK THAT IS WHAT THEY TOLD ME THEY DID, FOR THEY WOULD NOT GIVE ME ANY PAPERWORK TO SHOW THE WORK THAT THEY HAD DONE. AFTER THEY KEPT MY BIKE FOR A WEEK THE PROBLEM WAS FINALLY FIXED, ALTHOUGH THERE ARE STILL SOME FAINT SPOTS ON MY ENGINE FROM WHERE THE GAS HAD LEAKED. MY ROOMMATE, WHOSE INFORMATION IS ATTACHED TO THIS COMPLAINT, HAS RECENTLY PURCHASED THE EXACT SAME BIKE BUT IN A DIFFERENT COLOR. THIS BIKE WAS PURCHASED AT DREYER HONDA IN INDIANAPOLIS, IN. THEY ALSO ASSURED US THAT THE RECALL HAD BEEN DONE ON THE BIKE BEFORE IT WAS PURCHASED. HOWEVER THIS BIKE HAS THE EXACT SAME GAS LEAK AS MY BIKE DID. IT WAS PURCHASED ON JULY 26TH AND AFTER FEW DAYS SOME SPOTS BEGAN TO APPEAR ON THE HOUSING AND ENGINE. IT SEEMS THAT EITHER BOTH DEALERS DID NOT CORRECTLY OR AT ALL DO THE RECALL ON THESE BIKES, OR THERE IS ANOTHER ISSUE THAT IS CAUSING THESE BIKES TO LEAK GAS. I'M SURE WE DIDN'T HAPPEN TO GET THE ONLY TWO BIKES THAT HAVE THIS MALFUNCTION.  *TR",
        "vin": "JH2RC53488K"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/15/2008",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10228417,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "VT750",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 VT7750C WITH AN EMISSIONS RECALL. CONSUMER STATES THAT THE DEALER STATED THAT THEY CAN ONLY TAKE HIM AS FIRST COME FIRST SERVE ON SATURDAY. HE WANTS TO KNOW WHAT TO DO TO LEAVE IT ONE WEEK DAY AND PICK IT UP.  *KB",
        "vin": ""
    }
]