[
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/06/2013",
        "dateOfIncident": "02/25/2009",
        "fire": false,
        "manufacturer": "Navistar, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10542324,
        "products": [
            {
                "manufacturer": "Navistar, Inc.",
                "productMake": "INTERNATIONAL",
                "productModel": "CE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE INTERNATIONAL DT 466 SCHOOL BUS ENGINE SUDDENLY EXPERIENCED EXTREME PERFORMANCE DEGRADATION WITHOUT ANY WARNING WHILE DRIVING.  THE ENGINE STARTED A POPPING NOISE AND SEVERELY LACKED POWER.  WE PURCHASED 75 SCHOOL BUSES IN 2008, AND 26 PERCENT OF THEM HAD ROLLER TAPPET GUIDES FAIL BY FEBRUARY 2013.  IN EVERY CASE, THIS FAILURE MODE RESULTED IN MAJOR DAMAGE TO ENGINE VALVE TRAIN COMPONENTS.  TWO ENGINES OUT OF 26 TOTAL FAILURES TO DATE WERE NOT REPAIRABLE AND REQUIRED REPLACEMENT.  THE CURRENT FAILURE HAS NOW GROWN TO 34 PERCENT.  IT IS A SAFETY HAZARD TO SCHOOL CHILDREN AND OTHER VEHICLES WHEN A SCHOOL BUS ENGINE SUDDENLY EXPERIENCES SEVERE ENGINE DEGRADATION ON THE ROAD.",
        "vin": "4DRBUAAN09B"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/02/2012",
        "dateOfIncident": "02/10/2009",
        "fire": false,
        "manufacturer": "Navistar, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10453752,
        "products": [
            {
                "manufacturer": "Navistar, Inc.",
                "productMake": "INTERNATIONAL",
                "productModel": "CE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER OF THIS SCHOOL BUS APPROACHED A STUDENTS DROP-OFF LOCATION AND ACTIVATED THE AMBER 8-WAYS.  AFTER COMING TO A COMPLETE STOP, THE DRIVER OPENED THE DOOR TO LET OFF THE STUDENTS.  DUE TO A FAULTY DOOR SWITCH (INTERNATIONAL PART #2207601C1) THE RED FLASHING 8-WAY LIGHTS AS WELL AS THE STOP ARM FAILED TO ACTIVATE.  THIS PROMPTED THE DRIVER OF ANOTHER VEHICLE TO GO PAST THE SCHOOL BUS WHILE IT WAS STOPPED AND THE STUDENTS WERE UNLOADING.  LUCKILY, NO ONE WAS INJURED IN THIS INCIDENT.  UNFORTUNATELY, IT'S NOT THE FIRST TIME THIS SWITCH HAS FAILED.  DELIVERY DATE OF THIS VEHICLE WAS AUG. 2007.  THE ORIGINAL SWITCH WAS REPLACED ON FEB. 2008 AT 31,000 MILES.  IT WAS ALSO REPLACED ON SEPT. 2010 AT 60,000 MILES, AND NOW IN APRIL, 2012 AT 92,000 MILES.  WE HAVE 12 OTHER BUSES WITH THIS SAME SWITCH AND ALL OF THEM HAVE HAD SIMILAR PROBLEMS.  *TR",
        "vin": "4DRBUAAP58B"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/06/2011",
        "dateOfIncident": "10/06/2011",
        "fire": false,
        "manufacturer": "Navistar, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10428931,
        "products": [
            {
                "manufacturer": "Navistar, Inc.",
                "productMake": "INTERNATIONAL",
                "productModel": "CE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "OWNER OPERATOR OF SCHOOL BUS STATES THAT FOUR (UPPER-LOWER-RIGHT-LEFT) DUAL PANE DOOR WINDOWS HAVE FOGGED DUE TO  WATER ENTRY BETWEEN THE PANES. OWNER HAS REMOVED THE PANES IN AN ATTEMPT TO CORRECT AND FOUND THAT (AT LEAST ONE OF)  THE PANES HAD COMPLETELY SEPARATED FROM THE PANE \"SANDWICH.\" OWNER WAS UNABLE TO REMOVE COATING FROM THE GLASS WITH  SOLVENTS, ETC. THIS OWNER IS PART OF A GROUP OF EIGHT PURCHASERS WHO PURCHASED A PORTION OF \"ON-SITE\" INVENTORY OF  BUSSES WHICH WERE ALL EQUIPPED WITH THE SAME GLASS  FEATURE (I.E. PURCHASERS DID NOT SPECIFY THIS OPTION). OWNER OF A RELATED VEHICLE PREVIOUSLY FILED VOQ 10416533.  *TR",
        "vin": "4DRBUAAN28B"
    },
    {
        "components": "STEERING,ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/19/2011",
        "dateOfIncident": "10/09/2007",
        "fire": false,
        "manufacturer": "Navistar, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10426286,
        "products": [
            {
                "manufacturer": "Navistar, Inc.",
                "productMake": "INTERNATIONAL",
                "productModel": "CE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE HAD NOTHING BUT PROBLEMS WITH THIS VEHICLE SINCE I PURCHASED IT 10/07. ELECTRICAL, WOULD NOT START IN COLD WEATHER, CONTINUAL DRAW ON BATTERIES REPLACED WITH NEW AND ALSO ADDED A THIRD. NUMEROUS EGR VALVES, EGR COOLERS, LOW PRESSURE FUEL PUMPS, FUEL SUPPLY CONNECTORS DPF'S, WILL NOT DO MANUAL REGEN WHEN INDICATORS ON DASHBOARD CALL FOR IT, THIS HAS NEVER WORKED PROPERLY, USES OIL AND ANTIFREEZE CONTINUALLY, STEERING COLUMN HAD TO BE REPLACED AT APPROX. 40,000 MILES, ALOT OF DIESEL FUEL HAS BEEN IN OIL, APRIL 2010,OIL AND AGAIN SEPT 2011. HAVE ALSO HAD TO REPLACE SERVICE DOOR MOTOR,CROSS GATE MOTOR(SEVERAL)THERMO PANE GLASS DOORS LEAKED, FORMED CONDENSATION AND DRIED LEAVING A CLOUDY RESIDUE  RESTRICTING VISIBILITY, HAD TO BE REPLACED. MANY OTHER REPAIRS HAVE BEEN DONE TO. THIS VEHICLE DEALER REPAIR SHOPS ALSO DO NOT GIVE RECEIPTS WHEN WARRANTY WORK IS DONE. WHEN ASKED THEY TELL ME IT NEEDS TO GO THROUGH INTERNATIONAL FIRST AND THEN COPY WILL BE GIVEN, BUT RARELY  HAPPENS. I SHOULD NOT HAVE TO KEEP ASKING. VEHICLE HAS BEEN IN DEALER REPAIR SHOPS AND MECHANICS HAVE DONE SERVICE CALLS MORE THAN 40 TIMES! THIS WAS MOST RECENTLY FROM THE END OF JUNE 2011 TO AUGUST 24,2011 AT TWO DIFFERENT FACILITIES WITH OUT ANY SATISFACTION, ONLY TO DRIVE IT AGAIN ON SEPT. 1,2011 TO HAVE MORE DIESEL IN THE OIL AND HARD TO START. ENGINE ALSO HAS A STUDDER, DEALER MODIFIED TRANI TO MAKE UP FOR THIS HESITATION WHICH HAS ONLY MADE IT WORSE. NOW DEALER HAS FINALLY AUTHORIZED INJECTORS TO BE REPLACED, MY CONCERN IS WHAT HAS ALREADY HAPPENED TO THE REST OF THE ENGINE? THE DEALER SHOULD PUT A NEW ENGINE IN WHILE THIS IS STILL UNDER WARRANTY OR LEMON LAW SHOULD ALSO BE ALLOWED FOR COMMERCIAL VEHICLES.  *KB",
        "vin": "4DRBUAAN08B"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "08/01/2011",
        "dateOfIncident": "05/20/2011",
        "fire": false,
        "manufacturer": "Navistar, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10416453,
        "products": [
            {
                "manufacturer": "Navistar, Inc.",
                "productMake": "INTERNATIONAL",
                "productModel": "CE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 INTERNATIONAL CE SCHOOL BUS. THE CONTACT STATED THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC FOR INSPECTION AND THEY DETECTED A CONDENSATION RESIDUE BUILDUP IN THE GLASS ON THE FOUR ENTRY DOOR PANELS. THE WHITE RESIDUE COMPLETELY OBSTRUCTED THE VISIBILITY. THE MANUFACTURER WAS NOTIFIED OF THE PROBLEM. THE APPROXIMATE FAILURE MILEAGE WAS 60,000. UPDATED 09/28/11*LJ  UPDATED",
        "vin": "4DRBUAAN08B"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "03/21/2011",
        "dateOfIncident": "05/17/2008",
        "fire": false,
        "manufacturer": "Navistar, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10392391,
        "products": [
            {
                "manufacturer": "Navistar, Inc.",
                "productMake": "INTERNATIONAL",
                "productModel": "CE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "HI, I WOULD LIKE TO REPORT DEFECTIVE FUEL LINES ON IHC BUSSES. THE YEARS RANGE FROM 2008 365 ENGINE TO 2011 MAXFORCE 7.  THE PROBLEM IS THEY HAVE ALUMIUM FUEL LINES AND HAVE STAINLESS KEEPERS FOR THE QUICK DISCONECT. THEY ARE RUBBING THROUGH AND CAUSING FUEL LEAKS. IT SPAYS UP ON MOTOR AND EXHAUST. I TOLD OUR LOCAL DEALER IN 2008 AND SEVERAL TIMES SINCE. IT IS GOING TO CAUSE FIRE AND OR DEATH. I AM SURE THIS COULD BE SOLVED BY USING STAINLEES LINES. THE CHILDEREN THAT RIDE MY BUSSES COME FIRST. PLEASE HELP BEFORE THEY KILL SOMEONE. THANK YOU  *TR",
        "vin": "4DRBUAFM88B"
    }
]