[
    {
        "components": "SUSPENSION,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/27/2015",
        "dateOfIncident": "01/02/2015",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10702166,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XJ",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2005 JAGUAR XJ. THE CONTACT STATED THAT THE ABS LIGHT ILLUMINATED ON THE INSTRUMENT PANEL AND THE FRONT END OF THE VEHICLE STARTED TO SHAKE. THE VEHICLE WAS TAKEN TO THE DEALER AND IT WAS DETERMINED THAT ALL OF THE CONTROL ARMS WERE RUSTED AND NEEDED TO BE REPLACED. THE DEALER STATED THAT THE CONTROL ARMS AND ABS BRAKE MODULE NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 83,000.    UPDATED 8/21/15*CN   UPDATED 10/3/2017*CN",
        "vin": "SAJWA79C455"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/27/2014",
        "dateOfIncident": "09/28/2014",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10650365,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XJ SEDAN",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WAS SITTING AT A STOP LIGHT WAITING ON THE LIGHT TO CHANGE TO GREEN TO GO. BEFORE THE LIGHT COULD CHANGE WE WAS STRUCK FROM BEHIND  BY ANOTHER VEHICLE WHICH WAS HIT BY A TRUCK GOING 45 MPH. I HIT MY HEAD ON THE DASH AND NO AIR BAG DEPLOYED NOT MINES OR MY PARTNER THE DRIVER. I ASKED JAGUAR OF HILTON HEAD TO TEST MY AIRBAGS HE SAID NO NEED TO TEST THEM IF WE WERE SITTING STILL THE AIRBAGS WILL NOT DEPLOY. I JUST GOT MY VEHICLE BACK AND THE AIR BAG LIGHT ON THE PASSENGER SIDE KEEPS COMING ON. SOMETHING IS NOT RIGHT WITH THIS AIRBAG.  *TR",
        "vin": "SAJWA79B38S"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/10/2011",
        "dateOfIncident": "04/05/2011",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10396302,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XJ",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS GOING DOWN A SLOPPING STREET AT APPROXIMATELY 30-35 MPH, I STEPPED ON THE BRAKES TO SLOW DECLINE BUT CAR SURGED FORWARD, IMMEDIATELY GAINING SPEED UP TO 58 MPH.  WHEN I LEVELED OUT AT THE BOTTOM OF THE HILL I WAS ABLE TO PULL OVER TO SIDE OF  ROAD BY TAPPING ON THE BRAKES UNTIL I CAME TO A COMPLETE STOP.  SECOND INCIDENT HAPPENED TWO DAYS LATER.  WHILE  STOPPED AT A STOP SIGN WAITING TO TURN LEFT, CAR ACCELERATED FORWARD GOING FROM 0 TO APPROXIMATELY 30 MPH BARELY MISSING CAR COMING AT ME FROM THE LEFT.  WAS IN MIDDLE OF THE ROAD BEFORE I KNEW IT.  STOPPED CAR AS BEFORE, LIGHT REPEATED TAPS ON BRAKES.   CAR IS AT JAGUAR DEALERSHIP FOR INSPECTION. *TR",
        "vin": "SAJWA79B18S"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/04/2010",
        "dateOfIncident": "07/01/2009",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10313204,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XJ",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 JAGUAR XJL CONSUMER STATED VEHICLE LOST CRUISE CONTROL.   *BF  THE CONSUMER STATED A WARNING THAT READ \"CRUISE UNAVAILABLE PARK BRAKE DEFAULT\" ILLUMINATED ON THE DASHBOARD. THE CONSUMER STATED HE PULLED OVER TO READ THE OWNERS MANUAL AND IT STATED THE PARK BRAKE DEFAULT COULD RESULT IN SERIOUS DAMAGE TO THE VEHICLE. ALSO LOOSING CRUISE CONTROL AT 70 MPH WITH SOMEONE  ON YOUR BUMPER COULD CAUSE A SERIOUS PROBLEM. WHEN THE CONSUMER TRIED TO PUT THE TRANSMISSION INTO DRIVE, IT WOULDN'T MOVE. IT WAS LOCKED IN PARK. THE CONSUMER TRIED AGAIN AND THE TRANSMISSION MOVED INTO DRIVE GEAR. THE CONSUMER TOOK THE VEHICLE TO THE DEALER, BUT THEY WERE UNABLE TO FIND ANYTHING WRONG. THEY REPLACED THE BRAKE LIGHT SWITCH AND THE CRUISE CONTROL SWITCH AND HOPED THAT WOULD TAKE CARE OF THE PROBLEM; BUT IT DIDN'T. THE CONSUMER WENT BACK TO THE DEALER, AND WAS TOLD HE WOULD HAVE TO DRIVE THE VEHICLE UNTIL THE WARNING LIGHT CAME BACK ON. THE WARNING LIGHT ALWAYS CAME ON DURING THE TIME THE DEALER WAS CLOSED. *JB",
        "vin": "SAJWA79B18S"
    },
    {
        "components": "VISIBILITY,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/01/2009",
        "dateOfIncident": "04/25/2009",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10272512,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XJ",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS A DESIGN FLAW.  MY JAGUAR XJ HAS ELECTROCHOMATIC MIRRORS AND THEY ARE SUPPOSED TO LIGHTEN AND DARKEN WITH THE REFLECTION OF LIGHTS. AT NIGHT IT IS VERY DIFFICULT TO SEE OUT OF MY MIRRORS.  ONCE WHEN I WAS DRIVING A CAR'S LIGHTS WERE SHINING IN MY REAR VIEW MIRROR AND IT DARKENED THE MIRROR SO MUCH THAT I ALMOST SWERVED INTO A BICYCLIST.  THIS IS A DANGER TO MYSELF AND OTHER PEOPLE. WHEN I REPORTED IT TO JAGUAR THEY SAID THEY WERE AWARE OF THIS, HAD OTHER PEOPLE COMPLAIN ABOUT IT AND COULD NOT DO ANYTHING ABOUT IT.  THEY TOLD ME TO SPEAK TO THE DEALERSHIP.  THE DEALERSHIPS RESPONSE WAS TO TURN IT OFF COMPLETELY.  THIS IS NOT AN OPTION BECAUSE IF SOMEONE'S LIGHT REFLECTS IN THE MIRROR THERE IS NO WAY TO ADJUST IT SO THE LIGHT WILL NOT SHINE IN MY EYES AND ALSO BE ABLE TO SEE THE ROAD IN THE MIRROR. *TR",
        "vin": "SAJWA71B78S"
    }
]