[
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/07/2015",
        "dateOfIncident": "04/11/2013",
        "fire": false,
        "manufacturer": "Jayco, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10780569,
        "products": [
            {
                "manufacturer": "Jayco, Inc.",
                "productMake": "JAYCO FIFTH WHEEL",
                "productModel": "EAGLE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 JAYCO EAGLE 320RLDS TRAVEL TRAILER (NA). WHILE DRIVING AT APPROXIMATELY 20 MPH, THE CONTACT ENCOUNTERED A BUMP AND THE REAR PASSENGER SIDE AXLE FRACTURED. THE VEHICLE WAS MANEUVERED TO THE SIDE OF THE ROAD AND AN INDEPENDENT MECHANIC WAS ABLE TO WELD THE FRACTURED AXLE AT THE LOCATION. THE CONTACT ALSO MENTIONED THAT THE REAR SUBFRAME EXHIBITED NUMEROUS CRACKS. THE VEHICLE WAS TAKEN TO THE DEALER FOR REPAIR WHICH CONSISTED OF WELDING THE AFFECTED SUB FRAME CRACKS. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THERE WAS NO FAILURE MILEAGE.",
        "vin": "1UJBJ02R081"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/09/2010",
        "dateOfIncident": "05/29/2010",
        "fire": false,
        "manufacturer": "Jayco, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10335397,
        "products": [
            {
                "manufacturer": "Jayco, Inc.",
                "productMake": "JAYCO FIFTH WHEEL",
                "productModel": "EAGLE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TWO TIRES ON OUR 5TH WHEEL RV LOST THEIR AIR. WE THOUGHT WE'D RUN OVER SOMETHING, BUT UPON INSPECTION IT WAS FOUND THAT THE RIMS HAD FAILED. A SPLIT IN ONE AND A HOLE IN THE OTHER. WE HAD ALL RIMS REPLACED AS WE WERE CONCERNED THAT IF 50% FAILED AT THE SAME TIME THE OTHERS MAY FAIL ALSO. WE HAVE KEPT ALL 5 OF THE ORIGINAL RIMS THAT CAME ON THIS TRAILER, IN CASE YOU NEED TO EXAMINE ANY/ALL OF THEM. APPROXIMATELY 5124 MILES HAVE BEEN DRIVEN ON THESE TIRES. NO DAMAGE OCCURRED FROM IMPACT OR OTHER CAUSES. THE EDGE OF THE RIMS APPEAR TO BE PERFECTLY ROUND WITH NO VISIBLE DAMAGE. *TR",
        "vin": "1UJCJ02R881"
    }
]