[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/20/2018",
        "dateOfIncident": "06/20/2016",
        "fire": false,
        "manufacturer": "Kawasaki Motors Corp., U.S.A.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11130342,
        "products": [
            {
                "manufacturer": "Kawasaki Motors Corp., U.S.A.",
                "productMake": "KAWASAKI",
                "productModel": "CONCOURS 14",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ON OR ABOUT JUNE 20, 2016 I NOTICED THAT MY REAR BRAKE PEDAL WAS BEGINNING TO GET HARDER TO PUSH TO APPLY BRAKE TO THE REAR ABS BRAKING SYSTEM. ON DECEMBER 20, 2017 I TOOK MY CONCOURS TO MY DEALER AND HAD 2 TIRES R&R AND ALSO REQUESTED THE DEALER TO CHECK THE BRAKING SYSTEM ON THE REAR. THERE WAS NO NOTICE FROM THE ABS SYSTEM THAT ALERTED ME TO ANY MALFUNCTIONING HARDWARE VIA THE IDIOT LIGHTS. (SEE ATTACHMENTS) I FEEL THE LIGHT NOT WORKING AND THE DEFECTIVE ABS CORE IS A KNOWN ISSUE WITH KAWASAKI AND THEY HAVE CHOSEN NOT TO ADDRESS THIS SAFETY ISSUE. ON MARCH 6, 2018 I WROTE THROUGH THE ONLINE KAWASAKI PRODUCT FEEDBACK TO KAWASAKI ABOUT THE LACK OF RESPONSE TO PRESSING THE BACK BRAKE PEDAL AND A NATE DEPAUW FROM KAWASAKI WROTE BACK TO KEEP WORKING WITH MY LOCAL DEALER FOR A RESOLVE. THERE HAS STILL BEEN NOTHING RESOLVED. I HAVE SCANNED IN AND ATTACHED THE INFORMATION I HAVE BEEN USING TO TRY TO GAIN SATISFACTION. -",
        "vin": "JKBZGNA118A"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/25/2016",
        "dateOfIncident": "03/16/2016",
        "fire": false,
        "manufacturer": "Kawasaki Motors Corp., U.S.A.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10851652,
        "products": [
            {
                "manufacturer": "Kawasaki Motors Corp., U.S.A.",
                "productMake": "KAWASAKI",
                "productModel": "CONCOURS 14",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR BRAKE ON MY MOTORCYCLE WILL INTERMITTENTLY GET STUCK IN THE UP POSITION.  IN ORDER FOR ME TO GET IT TO WORK AGAIN, I HAVE PRESS DOWN ON THE PEDAL WITH MORE THAN NORMAL OPERATING PRESSURE.  THE VEHICLE IS IN MOTION WHEN THIS HAPPENS.  I BELIEVE THIS IS A SAFETY ISSUE BECAUSE I AM NEVER SURE IF THE BRAKE IS GOING TO FUNCTION AS DESIGNED DUE TO IT GETTING STUCK.  IT COULD CAUSE A CRASH BECAUSE OF NOT BEING ABLE TO STOP IN TIME WITH ONLY THE FRONT BRAKES.  I AM NOT THE ONLY ONE TO HAVE THIS SAME ISSUE WITH THIS MODEL OF MOTORCYCLE",
        "vin": "JKBZGNA148A"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/19/2015",
        "dateOfIncident": "04/21/2015",
        "fire": false,
        "manufacturer": "Kawasaki Motors Corp., U.S.A.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10726273,
        "products": [
            {
                "manufacturer": "Kawasaki Motors Corp., U.S.A.",
                "productMake": "KAWASAKI",
                "productModel": "CONCOURS 14",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "GANS",
                "productMake": "PIRELLI",
                "productModel": "PIRELLI",
                "productYear": "1998",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KAWASAKI CONCOURS 14 EQUIPPED WITH PIRELLI ANGEL GT TIRES (NA), SIZE 120/70ZR/17 (NA). WHEN THE CONTACT DEPRESSED THE BRAKE PEDAL AFTER DRIVING 35 MPH, THE FRONT TIRE BECAME DISTORTED AND RESULTED IN A LOSS OF STABILITY. THE VEHICLE WAS TAKEN TO A DEALER FOR DIAGNOSTIC TESTING WHERE IT WAS CONFIRMED THAT THE TIRE DID NOT MEET THE SPECIFICATIONS OF THE BIKE WHICH CAUSED THE FAILURES. THE TIRE COULD NOT BE REPLACED BECAUSE THE SPEC MODELS WOULD NOT BE AVAILABLE UNTIL THE LATTER PART OF 2015. THE TIRE WAS RE-BALANCED. THE TIRES WERE NOT REPLACED. THE TIRES WERE REPLACEMENT TIRES. THE VEHICLE FAILURE MILEAGE WAS 21,922 AND THE TIRE FAILURE MILEAGE WAS 1,100.",
        "vin": "JKBZGNB1X8A"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/30/2014",
        "dateOfIncident": "09/09/2014",
        "fire": false,
        "manufacturer": "Kawasaki Motors Corp., U.S.A.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10640187,
        "products": [
            {
                "manufacturer": "Kawasaki Motors Corp., U.S.A.",
                "productMake": "KAWASAKI",
                "productModel": "CONCOURS 14",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR BRAKE CEASED TO FUNCTION. PEDAL TRAVEL TO FULL DEFLECTION BUT NO REAR BRAKE. DROPPED BIKE AT NAPLES KAWASAKI DEALERSHIP, AND A WEEK LATER THEY SAID IT WAS FIXED UNDER THE RECALL MC12-05 (BRAKE ROD END). I PICKED UP THE BIKE ONLY TO FIND THERE WAS STILL NO BRAKE. THIS RECALL DID NOT ADDRESS THE BRAKE FAILURE BUT PERTAINED TO PREVIOUS ISSUES. I THEN LEFT THE BIKE AT THE DEALER FOR CORRECTION OF THE BRAKE PROBLEM. THEY RAN TESTS AND COULD NOT FIND ANY ABS OR BRAKE RELATED READ OUTS IN THE INTERNAL DIAGNOSIS SYSTEM. I WAS TOLD THAT WHILE THEY DID NOT KNOW WHY THE BAKE BRAKE DID NOT WORK, THE ONLY \"FIX\" WAS TO REPLACE THE HYDRAULIC UNIT AND ALL RELATED LINES AT AN APPROXIMATE COST OF $2500.00 (EST). AFTER THE SERVICE MANAGER TALKED TO KAWASAKI SERVICE SUPPORT, KAWASAKI SAID A COMPLETE REBUILD OF MASTER CYLINDERS, BRAKE CALIPERS, AND ALL LINES AT A NEW ESTIMATE OF $4000.00. I CALLED KAWASAKI SUPPORT DIRECT AND THEY SAID THAT BECAUSE I COULD NOT PRODUCE DOCUMENTATION THAT BRAKE FLUID WAS CHANGED AT 20,000 MILES, THEY HAD NO RESPONSIBILITY.    THE FAILURE OF THIS ABS UNIT LEFT ME WITH NO BRAKE AT ALL. SINCE THE ABS IS ACTIVE ONLY DURING A WHEEL SKID STOP, IT IS HARD TO BELIEVE THAT TOTAL LOSS OF BRAKING SHOULD BE CONSIDERED \"NORMAL\" UNDER NON EMERGENCY STOPS. AGAIN, IT SHOULD BE NOTED THAT THE DEALER COULD FIND NOTHING IN THE ABS SELF DIAGNOSIS COMPUTER GIVING ANY INDICATION OF A HYDRAULIC UNIT FAILURE.     I HAVE COMPLETE FUNCTION OF THE FRONT BRAKE...THIS ONLY EFFECTED THE REAR BRAKE.  *TR",
        "vin": "JKBZGNA158A"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/23/2014",
        "dateOfIncident": "06/22/2012",
        "fire": false,
        "manufacturer": "Kawasaki Motors Corp., U.S.A.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10638408,
        "products": [
            {
                "manufacturer": "Kawasaki Motors Corp., U.S.A.",
                "productMake": "KAWASAKI",
                "productModel": "CONCOURS 14",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "OIL LEAKING FROM THE CAM POSITION SENSOR O-RING(S).  FLUID LEAKS ONTO HOT CYLINDER BLOCK AND EXHAUST.  I HAVE NOT HAD A FIRE YET, BUT THE POTENTIAL IS THERE IF ENOUGH FLUID ESCAPES ONTO THE EXHAUST.  THE MOTORCYCLE IS CURRENTLY IN FOR THE SAME REPAIR FOR A THIRD TIME (AS OF 22 SEPTEMBER 2014).  THE SECOND TIME WAS THE 14TH OF MAY 2014.  CONVERSATIONS WITH SHOP PERSONNEL INDICATE THIS IS A KNOWN PROBLEM AT KAWASAKI AND THE LEAK PROBLEM IS CURRENT AND ONGOING AMONG OWNERS OF THIS PARTICULAR MODEL MOTORCYCLE.  *TR",
        "vin": "JKBZGNA148A"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/30/2013",
        "dateOfIncident": "08/15/2009",
        "fire": false,
        "manufacturer": "Kawasaki Motors Corp., U.S.A.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10538158,
        "products": [
            {
                "manufacturer": "Kawasaki Motors Corp., U.S.A.",
                "productMake": "KAWASAKI",
                "productModel": "CONCOURS 14",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE ROTORS HAVE BEEN WARPING UNDER NORMAL RIDING CONDITIONS. PRESENTS UNSAFE, LESS THAN OPTIMAL BREAKING ABILITY. FRONT END LUNGES AT LOW SPEEDS AND VIBRATES AT HIGH SPEEDS, UNDER BREAKING. KAWASAKI REPLACED WARPED ROTORS TWICE AND I AM NOW IN NEED OF MY THIRD PAIR.",
        "vin": "JKBZGNB158A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/03/2013",
        "dateOfIncident": "06/18/2013",
        "fire": false,
        "manufacturer": "Kawasaki Motors Corp., U.S.A.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10523093,
        "products": [
            {
                "manufacturer": "Kawasaki Motors Corp., U.S.A.",
                "productMake": "KAWASAKI",
                "productModel": "CONCOURS 14",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KAWASAKI CONCOURS 14 MOTORCYCLE. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 30 MPH, HE HEARD A LOUD BANG. THE CONTACT LOST CONTROL OF THE VEHICLE AS THE REAR WHEEL SUDDENLY SEIZED. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSIS. THE TECHNICIAN STATED THAT ALL THE DRIVER GEAR CASES WOULD HAVE TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 57,000.  *TR",
        "vin": "JKBZGNA128A"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/06/2013",
        "dateOfIncident": "07/02/2012",
        "fire": false,
        "manufacturer": "Kawasaki Motors Corp., U.S.A.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10491597,
        "products": [
            {
                "manufacturer": "Kawasaki Motors Corp., U.S.A.",
                "productMake": "KAWASAKI",
                "productModel": "CONCOURS 14",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT BRAKE ROTORS HAVE WARPED UNDER NORMAL USE, CAUSING VERY NOTICEABLE STEERING VIBRATIONS.  WHICH MAY LEAD TO A LOSS OF CONTROL AND A POSSIBLE CRASH.  I FEEL THIS MATTER TO BE A SAFETY CONCERN TO THE OPERATORS OF THIS MOTORCYCLE.  *TR",
        "vin": "JKBZGNB108A"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/25/2012",
        "dateOfIncident": "06/17/2012",
        "fire": false,
        "manufacturer": "Kawasaki Motors Corp., U.S.A.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10463054,
        "products": [
            {
                "manufacturer": "Kawasaki Motors Corp., U.S.A.",
                "productMake": "KAWASAKI",
                "productModel": "CONCOURS 14",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KAWASAKI CONCOURS 14. THE CONTACT STATED THAT WHILE RIDING THE BIKE 40 MPH, HE HEARD A LOUD NOISE NEAR THE REAR OF THE BIKE BECAME UNSTABLE. THE CONTACT PULLED OVER AND NOTICED THAT THE REAR WHEEL BOLT HOLE WAS MELTED. THE MOTORCYCLE WAS TOWED TO A DEALER FOR AN INSPECTION AND THEY STATED THAT THE WHEEL BEARING WAS DAMAGED AND NEEDED TO BE REPLACED. THE BIKE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED AND STATED THAT THE DEALER HAD TO INSPECT THE BIKE AND GIVE THEM A CONCLUSION. THE FAILURE MILEAGE WAS 40,000.   UPDATED 8/9/12 *CN",
        "vin": "JKBZGNB188A"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/11/2011",
        "dateOfIncident": "09/01/2010",
        "fire": false,
        "manufacturer": "Kawasaki Motors Corp., U.S.A.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10399981,
        "products": [
            {
                "manufacturer": "Kawasaki Motors Corp., U.S.A.",
                "productMake": "KAWASAKI",
                "productModel": "CONCOURS 14",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 KAWASAKI CONCOURS 14. THE CONTACT STATED THE FRONT END OF THE VEHICLE WOULD VIOLENTLY SHAKE WHEN THE FRONT BRAKE WAS ENGAGED WHILE DRIVING APPROXIMATELY 60 MPH. THE FAILURE RECURRED WHENEVER THE FRONT BRAKES WERE ENGAGED WHILE DRIVING AT HIGHWAY SPEEDS. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHERE THE CONTACT WAS INFORMED THE VEHICLE WAS OPERATING AS INTENDED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 1,000 AND THE CURRENT MILEAGE WAS 2,400.",
        "vin": "JKBZGNB128A"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES,EQUIPMENT ADAPTIVE/MOBILITY",
        "crash": false,
        "dateComplaintFiled": "11/10/2010",
        "dateOfIncident": "11/05/2010",
        "fire": false,
        "manufacturer": "Kawasaki Motors Corp., U.S.A.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10365293,
        "products": [
            {
                "manufacturer": "Kawasaki Motors Corp., U.S.A.",
                "productMake": "KAWASAKI",
                "productModel": "CONCOURS 14",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "LEFT SADDLE BAG FELL OFF MOTORCYCLE AND WAS HIT BY FOLLOWING VEHICLES.  THANKFULLY NO ONE WAS INJURED BUT THE BAG WAS DESTROYED.  KAWASAKI REFUSED TO ACCEPT RESPONSIBILITY EVEN THOUGH THE BAG HAD LAST BEEN ATTACHED BY A TRAINED SERVICE TECH. *TR",
        "vin": "JKBZGNB128A"
    },
    {
        "components": "STRUCTURE,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "06/18/2010",
        "dateOfIncident": "05/15/2010",
        "fire": false,
        "manufacturer": "Kawasaki Motors Corp., U.S.A.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10339028,
        "products": [
            {
                "manufacturer": "Kawasaki Motors Corp., U.S.A.",
                "productMake": "KAWASAKI",
                "productModel": "CONCOURS 14",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I NOTICED THAT THE ORIGINAL LUGGAGE RACK ON MY 2008 KAWASAKI CONCOURS 14 HAD CRACKED AND THE TOP CASE WHICH ATTACHES TO IT WAS ABOUT TO BREAK LOOSE ON THE FREEWAY. THIS LUGGAGE RACK HAD BEEN RECALLED AND REPLACED BY KAWASAKI BEFORE I TOOK OWNERSHIP OF THE BIKE IN JUNE 2008. HOWEVER, THE NEW DESIGN, WHICH IS PART NUMBER 53029-0076, IS WHAT WAS ON MY BIKE, AND IT FAILED AFTER ONE AND A HALF YEAR OF USE. THE REAR CASE WHICH ATTACHES TO THIS RACK IS THE KAWASAKI OEM EQUIPMENT, AND IT'S LOAD HAS ALWAYS BEEN BETWEEN 5 AND 10 POUNDS, BELOW THE KAWASAKI MAXIMUM RATING OF 15 POUNDS.     THE CONSEQUENCES HAD I NOT NOTICED IT WHILE I STOPPED TO GET COFFEE, COULD HAVE BEEN SEVERE. THE REAR CASE WOULD HAVE BROKE LOOSE WHILE AT FREEWAY SPEEDS, POTENTIALLY HITTING ANY VEHICLE BEHIND ME, OR CAUSING SUCH VEHICLE TO CRASH WHILE TRYING TO AVOID IT.     THE BROKEN PART IS CURRENTLY AT THE KAWASAKI DEALERSHIP FOR A WARRANTY CLAIM. HOWEVER, A REPLACEMENT IS NOT ENOUGH. THE CURRENT DESIGN IS INAPPROPRIATE FOR THE INTENDED PURPOSE, AND A REINFORCED RACK SHOULD BE THE SOLUTION. *TR",
        "vin": "JKBZGNA158A"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/27/2009",
        "dateOfIncident": "10/13/2009",
        "fire": false,
        "manufacturer": "Kawasaki Motors Corp., U.S.A.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10290045,
        "products": [
            {
                "manufacturer": "Kawasaki Motors Corp., U.S.A.",
                "productMake": "KAWASAKI",
                "productModel": "CONCOURS 14",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT DISC ROTORS WARPED AS A RESULT OF RIDING THROUGH WATER DURING STORM.  CARE WAS BEING USED DUE TO CONDITIONS SO SPEED AND BRAKING EFFORT WAS LOW.  ROTOR WARPING CAUSED HEAVY PULSING DURING BRAKING REDUCING DIRECTIONAL STABILITY AND INCREASING STOPPING DISTANCE.  ODOMETER ONLY READ 8000 MILES.  ROTORS ARE BEING REPLACED BY DEALER UNDER WARRANTY BUT KAWASAKI HAS NOT ACKNOWLEDGED THIS IS AN ISSUE.  RESEARCH OF WEB FORUMS FOR THIS MOTORCYCLE REVEALED THIS IS A RECURRING ISSUE WITH KAWASAKI CONCOURS 14 WITH MULTIPLE REPLACEMENTS OF ROTORS BEING REPORTED BY SEVERAL INDIVIDUALS.  SUSPECTED CAUSE IS BRAKE ROTOR MATERIAL HAVING INSUFFICIENT HEAT RESISTANCE AND ROTOR SIZE FOR WEIGHT OF BIKE. *TR",
        "vin": "JKBZGNB1X8A"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/03/2009",
        "dateOfIncident": "06/02/2009",
        "fire": false,
        "manufacturer": "Kawasaki Motors Corp., U.S.A.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10282784,
        "products": [
            {
                "manufacturer": "Kawasaki Motors Corp., U.S.A.",
                "productMake": "KAWASAKI",
                "productModel": "CONCOURS 14",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 KAWASAKI CONCOURS 14 MOTORCYCLE. THE CONTACT STATED THAT THE FRONT BRAKE ROTORS WARP DURING APPLICATION, THUS REDUCING BREAKING CAPABILITY. BRAKE FAILURE CAN CAUSE AN INCREASE IN STOPPING DISTANCES, WHICH INCREASES THE RISK OF VEHICLE CRASH.  THE VEHICLE WAS TAKEN TO THE DEALER AND A TECHNICIAN STATED THAT THE COMPONENTS WOULD NOT BE REPLACED UNDER WARRANTY. AS OF CURRENT DATE THE VEHICLE HAS NOT BEEN REPAIRED.THE FAILURE MILEAGE WAS 12,000. THE CURRENT MILEAGE WAS UNKNOWN.   UPDATED 09/25/09  *BF",
        "vin": "JKBZGNA198A"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/26/2009",
        "dateOfIncident": "02/26/2009",
        "fire": false,
        "manufacturer": "Kawasaki Motors Corp., U.S.A.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10260068,
        "products": [
            {
                "manufacturer": "Kawasaki Motors Corp., U.S.A.",
                "productMake": "KAWASAKI",
                "productModel": "CONCOURS 14",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2009 KAWASAKI CONCOURS 14 WITH 3000 MILES ON THE OD.  WHILE RIDING AND MAKING A RIGHT HAND TURN, THE STEERING STOPPED AT ABOUT 1/3 THE NORMAL RANGE OF MOTION AND WOULD NOT GO ANY FARTHER.  I NARROWLY AVOIDED A CRASH BECAUSE I WAS ONLY TRAVELING AT APPROX 20 MPH AND HAD PLENTY OF SPACE TO MANEUVER AND REGAIN CONTROL.  I PARKED THE BIKE AND INSPECTED THE AREA AROUND THE STEERING STEM.  I DISCOVERED THE BOLT THAT HOLDS THE COWLING BRACKET (KAW PART # 92153-1877 )  HAD MOVED OUT OF PLACE TO THE LEFT DUE TO THE CAP NUT ( KAW PAR # 92210-0325 ) FALLING OFF.  HAD THIS HAPPENED AT A HIGHER SPEED OR WHERE THERE WAS NO ROOM TO RECOVER, IT COULD HAVE CAUSED A SERIOUS ACCIDENT. *TR",
        "vin": "JKBZGNA129A"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/09/2009",
        "dateOfIncident": "08/10/2008",
        "fire": false,
        "manufacturer": "Kawasaki Motors Corp., U.S.A.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10254412,
        "products": [
            {
                "manufacturer": "Kawasaki Motors Corp., U.S.A.",
                "productMake": "KAWASAKI",
                "productModel": "CONCOURS 14",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 KAWASAKI CONCOURS 14.  THE VEHICLE WAS A KYMCO, MODEL NUMBER PEOPLES250.  WHILE SLOWING DOWN THE VEHICLE, THE LEFT BRAKE FAILED.  THE BRAKE IS CALLED THE FORK, WHICH WAS CONNECTED TO THE HANDLE BAR.  THE CONTACT FELL OFF THE VEHICLE AND INJURED HIS ANKLE.  A POLICE REPORT WAS FILED.  THE VEHICLE WAS STILL ABLE TO BE DRIVEN TO THE DEALER AND WAS REPAIRED AT THE CONTACT'S EXPENSE.  THE FAILURE MILEAGE WAS 1,000.",
        "vin": "RFBD2K2179B"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/27/2008",
        "dateOfIncident": "08/01/2008",
        "fire": false,
        "manufacturer": "Kawasaki Motors Corp., U.S.A.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10246871,
        "products": [
            {
                "manufacturer": "Kawasaki Motors Corp., U.S.A.",
                "productMake": "KAWASAKI",
                "productModel": "CONCOURS 14",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 KAWASAKI CONCOURS MOTORCYCLE. THIS VEHICLE PRODUCES AN UNBEARABLE AMOUNT OF ENGINE HEAT WHICH BY MANUFACTURER DESIGN IN DIRECTED ONTO THE OPERATOR. THIS EXCESSIVE HEAT IS CAPABLE OF PRODUCING BLISTERS AND BURNS- ESPECIALLY IN THE SHIP AND KNEE AREA OF THE RIGHT LEG. I'M ALSO CONCERNED THAT THE HEAT WILL CAUSE THE OPERATOR TO PASS OUT OR BECOME EXTREMELY HEAT FATIGUED DURING HOT WEATHER. *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/16/2008",
        "dateOfIncident": "06/20/2008",
        "fire": false,
        "manufacturer": "Kawasaki Motors Corp., U.S.A.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10242517,
        "products": [
            {
                "manufacturer": "Kawasaki Motors Corp., U.S.A.",
                "productMake": "KAWASAKI",
                "productModel": "CONCOURS 14",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2008 KAWASAKI CONCOURS 14 MOTORCYCLE. I HAVE TWICE REPORTED A MALFUNCTION OF THE FRONT BRAKES TO THE DEALER, AND HAVE CALLED KAWASAKI MOTORS CORP IN IRVINE, CA TO NO AVAIL.    I REPORTED AT THE 8 THOUSAND MILE SERVICE THAT WHEN THE FRONT BRAKE IS APPLIED THE MOTORCYCLE VIBRATES AND SHUDDERS. THE DEALER DECLARED THIS \"NORMAL\" DUE TO THE \"RATCHETING\" OF THE FLOATING CALIPER/ROTOR ASSEMBLY.    I AGAIN REPORTED THE CONDITION AT THE 12 THOUSAND MILE SERVICE, ONLY NOW THE CONDITION HAS WORSENED FROM VIBRATION TO THE FRONT BRAKE \"GRABBING\" AT ALL SPEEDS AND IF THE BRAKES ARE APPLIED HEAVILY BETWEEN 45 TO 60 MPH THE MOTORCYCLE VIBRATES AND SHUDDERS VERY BADLY. THE FRONT BRAKE GRABS SO BADLY THAT AT SLOW SPEEDS DURING A LIGHT APPLICATION, WHEN THE BRAKE \"GRABS\", IT ACTUALLY COMPRESSES THE FRONT FORKS, CAUSING THE FRONT END TO \"DIP\". AN ACCIDENT WAITING TO HAPPEN.    THE KAWASAKI DEALER HAS STATED THAT THIS IS NORMAL, AND CAN'T CONFIRM OR VALIDATE MY COMPLAINT. WHEN KAWASAKI MOTORS CORPORATION WAS CONTACTED, THE CUSTOMER SERVICE REPRESENTATIVE STATED (AFTER I ASKED HIM TO CONTACT THE SERVICING DEALER TO PROVIDE TECHNICAL HELP) \"IF I CONTACT THEM IT WILL ONLY MAKE THEM MAD\". I THEN ASKED IF THERE WAS ANY TECHNICAL BULLETINS REGARDING THIS PROBLEM, AND I DID  NOT RECEIVE A REPLY. I HAVE TRIED TO GET KAWASAKI TO HELP ME WITH THIS SAFETY ISSUE TO NO AVAIL.     WHEN I SEARCHED ON-LINE FOR OTHER OWNERS WITH THE SAME PROBLEM, I FOUND THEM. THERE IS A KNOWN DEFECT IN THE FRONT ROTORS. THEY WARP ON THIS MOTORCYCLE, AS THE ROTORS THAT ARE USED ARE PRODUCED FOR A LIGHTER MOTORCYCLE, NOT A HEAVIER \"SPOT-TOURING\" MOTORCYCLE  MEANT TO BE RIDDEN WITH EXTRA LUGGAGE AND/OR AN EXTRA PASSENGER.    THE MOTORCYCLE IS UNSAFE TO RIDE IN THIS CONDITION, AND KAWASAKI NEEDS TO BE HELD RESPONSIBLE. *TR",
        "vin": "JKBZGNA178A"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,FUEL SYSTEM, GASOLINE,FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "09/06/2008",
        "dateOfIncident": "08/10/2008",
        "fire": false,
        "manufacturer": "Kawasaki Motors Corp., U.S.A.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10241182,
        "products": [
            {
                "manufacturer": "Kawasaki Motors Corp., U.S.A.",
                "productMake": "KAWASAKI",
                "productModel": "CONCOURS 14",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A NEW ROKETA 250CC SCOOTER IN JULY OF 2008. THERE HAVE BEEN VERY SERIOUS MECHANICAL FAILURES ON THIS BIKE. IF NOT BY THE GRACE OF GOD I COULD HAVE BEEN KILLED OR SERIOUSLY INJURED IN EACH INCIDENT. FIRST INCIDENT INVOLVES THE CYCLE STALLING OUT WHEN GOING PAST 50 MPH. THE BIKE IS ADVERTISED TO GO 70MPH. THIS HAPPENED TO ME AT LEAST 7 TO 10 TIMES. ONCE IT HAPPENED ON A BUSY 2 LANE RD. AND THE CAR BEHIND ME ALMOST HIT ME. THE DEALER TRACED THAT PROBLEM TO A VERY CHEAP FUEL PUMP. THAT PROBLEM WAS REMEDIED BY INSTALLING A BETTER GRADE FUEL PUMP. THIS IS A CHINESE BIKE AND HOW MANY THOUSANDS OF PEOPLE HAVE THAT CHEAP FUEL PUMP ON THEIR SCOOTER.  2ND MAJOR FAILURE WAS THE GASOLINE LINE ACTUALLY COMING OFF THE BOTTOM OF THE FUEL TANK! THIS HAPPENED WHEN I WAS GOING 65 MPH ON A 2 LANE ST. HWY WHILE A SEMI-TRUCK WAS BEHIND ME. LUCKILY I MANAGED TO GUIDE MY BIKE OVER TO THE SIDE OF THE ROAD WITHOUT BEING HIT. I LOST TOTAL POWER AND IT WAS A VERY FRIGHTENING EXPERIENCE TO HAVE TO PULL OVER THAT FAST AND SEE GAS POURING ALL OVER THE BOTTOM OF THE BIKE AND ONTO THE HOT MUFFLER. I THOUGHT THERE MIGHT BE AN EXPLOSION, THANK GOD THERE WASN'T. THE RUBBER HOSES ON THIS BIKE ARE PATHETIC. VERY THIN AND POOR QUALITY.  THE 3RD MAJOR FAILURE WAS WHEN I WAS COMMUTING HOME FROM WORK. I STOPPED AT A 4-WAY STOP BEHIND A SEMI-TRUCK. AS TRUCKS ACCELERATE SLOWLY, I DECIDED TO PASS ON THE LEFT. AS I DID THIS, THE BIKE WOULD NOT PICK UP IT'S USUAL SPEED AND I WAS BARELY BEING ABLE TO PASS THE SEMI. AN ONCOMING CAR WAS APPROACHING AND I WAS JUST ABLE TO GET AROUND THE SEMI JUST IN TIME. ANOTHER HAIR RAISING EXPERIENCE!  I PULLED OVER WHEN I COULD AND NOTICED THAT MY FRONT BRAKE PAD WAS STUCK UP AGAINST THE FRONT ROTOR SLOWING THE BIKE DOWN.  I STRONGLY BELIEVE THAT A RECALL BE INSTITUTED ON THIS BIKE. IT IS A DANGEROUS VEHICLE. *TR",
        "vin": "LJ4TDNPG28Y"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "08/11/2008",
        "dateOfIncident": "08/11/2008",
        "fire": false,
        "manufacturer": "Kawasaki Motors Corp., U.S.A.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10237662,
        "products": [
            {
                "manufacturer": "Kawasaki Motors Corp., U.S.A.",
                "productMake": "KAWASAKI",
                "productModel": "CONCOURS 14",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 KAWASAKI CONCOURS 14.  THE VEHICLE WAS REPAIRED ACCORDING TO NHTSA CAMPAIGN ID NUMBER 08V047000 (EQUIPMENT) ON AUGUST 11, 2008.  THE CONTACT STATED THAT ONE OF THE SADDLEBAGS DETACHED FROM THE SIDE OF THE VEHICLE.  THE CURRENT MILEAGE WAS 75 AND FAILURE MILEAGE WAS 70.",
        "vin": "JKBZGNA188A"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "01/16/2008",
        "dateOfIncident": "01/01/2008",
        "fire": false,
        "manufacturer": "Kawasaki Motors Corp., U.S.A.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10215089,
        "products": [
            {
                "manufacturer": "Kawasaki Motors Corp., U.S.A.",
                "productMake": "KAWASAKI",
                "productModel": "CONCOURS 14",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE \"HARD BAGS\" OR LUGGAGE HAVE FAULTY LATCHES THAT FAIL WHILE IN OPERATION RESULTING IN A DANGEROUS SITUATION TO MOTORISTS.  *TR",
        "vin": ""
    },
    {
        "components": "EQUIPMENT ADAPTIVE/MOBILITY",
        "crash": false,
        "dateComplaintFiled": "12/21/2007",
        "dateOfIncident": "12/06/2007",
        "fire": false,
        "manufacturer": "Kawasaki Motors Corp., U.S.A.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10212476,
        "products": [
            {
                "manufacturer": "Kawasaki Motors Corp., U.S.A.",
                "productMake": "KAWASAKI",
                "productModel": "CONCOURS 14",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER A VERY SLIGHT BUMP, THAT LEFT NO VISIBLE MARKS, THE SINGLE LATCH THAT RETAINS THE RIGHT SIDE SADDLEBAG FAILED. THESE BAGS SET INTO SOCKETS THAT CARRY THE LOAD, BUT ARE RETAINED BY A HOOK THAT HAS TWO SMALL PLASTIC PINS THAT BEAR THE STRESS OF THE LATCH. AFTER THE BUMP, I REMOVED THE SADDLEBAG AND INSPECTED THE HOOK. IT WOULD NOT STAY IN THE SECURED POSITION, AND WAS NO LONGER ABLE TO RETAIN SADDLEBAG SECURELY. I RETURNED LATCH TO DEALER, AND THE MANUFACTURER HAS REPLACED LATCH AS A WARRANTED REPAIR. FAULTY LATCH RETAINED BY DEALER.  *TR",
        "vin": "JKBZGNA188A"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "12/20/2007",
        "dateOfIncident": "12/19/2007",
        "fire": false,
        "manufacturer": "Kawasaki Motors Corp., U.S.A.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10212389,
        "products": [
            {
                "manufacturer": "Kawasaki Motors Corp., U.S.A.",
                "productMake": "KAWASAKI",
                "productModel": "CONCOURS 14",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2008 KAWASAKI CONCOURSE 14 HAD THE LEFT SADDLE BAG FALL OFF WHILE RIDING, LUCKILY IT WAS A  RURAL ROAD AND I DID NOT INJURE ANYONE BEHIND ME. HOWEVER, IT COULD HAVE BEEN VERY DANGEROUS HAD IT FALLEN OFF ON THE FREEWAY. I HAVE HEARD OTHER REPORTS OF THIS HAPPENING ON 2008 KAWASAKI C-14S  AND BELIEVE THE FACTORY SHOULD RECALL THIS DEFECTIVE LATCH MECHANISM.  *TR",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/07/2007",
        "dateOfIncident": "09/01/2007",
        "fire": false,
        "manufacturer": "Kawasaki Motors Corp., U.S.A.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10208181,
        "products": [
            {
                "manufacturer": "Kawasaki Motors Corp., U.S.A.",
                "productMake": "KAWASAKI",
                "productModel": "CONCOURS 14",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 KAWASAKI CONCOURS 14.  WHILE RIDING 60 MPH, THE LOCKING MECHANISM FAILED AND THE HARD BAG ON THE LEFT SIDE OF THE VEHICLE DETACHED AND FELL ON THE ROAD.  THE PLASTIC HOOK USED FOR THE VEHICLE HAS TWO WEAK PINS MOLDED INTO THE HOOKS.  THE PINS FAILED AND MADE THE LOCK HOOKS USELESS.  THE MANUFACTURER MADE A REPLACEMENT, BUT WITH THE SAME BAG.  THE CONTACT IS CONCERNED THAT THE BAG WILL FALL OFF AGAIN.  THE CURRENT MILEAGE WAS 2,600 AND FAILURE MILEAGE WAS 500.",
        "vin": "JKBZGNB118A"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "11/06/2007",
        "dateOfIncident": "11/04/2007",
        "fire": false,
        "manufacturer": "Kawasaki Motors Corp., U.S.A.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10208028,
        "products": [
            {
                "manufacturer": "Kawasaki Motors Corp., U.S.A.",
                "productMake": "KAWASAKI",
                "productModel": "CONCOURS 14",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2008 KAWASAKI CONCOURS14, AND THE LOCKING MECHANISMS ON ONE OF MY HARD BAGS HAS FAILED. THE MOTORCYCLE ONLY HAS 2,100 MILES AND THERE ARE MANY REPORTS ON THE INTERNET OF INDIVIDUALS HAVING THE SAME PROBLEM AND THE BAGS FALLING OFF AS THEY GO DOWN THE HIGHWAY.  *TR",
        "vin": "JKBZGNB108A"
    },
    {
        "components": "STRUCTURE,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "11/06/2007",
        "dateOfIncident": "11/04/2007",
        "fire": false,
        "manufacturer": "Kawasaki Motors Corp., U.S.A.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10208040,
        "products": [
            {
                "manufacturer": "Kawasaki Motors Corp., U.S.A.",
                "productMake": "KAWASAKI",
                "productModel": "CONCOURS 14",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "HARD SADDLE BAGS LOOSE ON MOTORCYCLE.  LATCH MECHANISM BINDS WHEN RETRACTING SADDLEBAG SECURING HOOK.  UPON INSPECTION OF LATCH, ONE OF THE PINS WITHIN THE LATCH WAS FOUND TO BE SHEARED OFF.  *TR",
        "vin": "JKBZGNA158A"
    },
    {
        "components": "STRUCTURE,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "08/31/2007",
        "dateOfIncident": "08/19/2007",
        "fire": false,
        "manufacturer": "Kawasaki Motors Corp., U.S.A.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10201612,
        "products": [
            {
                "manufacturer": "Kawasaki Motors Corp., U.S.A.",
                "productMake": "KAWASAKI",
                "productModel": "CONCOURS 14",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 KAWASAKI CONCOURS 14.  WHILE RIDING THE VEHICLE FOR 10 MINUTES, THE ENGINE COMPARTMENT BECAME AND GAVE THE CONTACT A FIRST DEGREE BURN ON HIS RIGHT CALF.  THE VEHICLE WAS TAKEN TO THE DEALER AND THEY ADMITTED THAT THEY WERE AWARE OF THE FAILURE AND REPOSITIONED THE INSULATION.  AFTER THE VEHICLE WAS REPAIRED, THE CONTACT RODE THE VEHICLE AND ONCE AGAIN SUSTAINED FIRST DEGREE BURNS TO HIS RIGHT AND LEFT CALVES AND BOTH INNER THIGHS.  THE SPEED WAS UNKNOWN.  THE CURRENT MILEAGE WAS 200 AND FAILURE MILEAGE WAS 5. UPDATED 01/11/08.  *LJ  THE MECHANIC RE-INSTALLED THE HEAT SHIELDS CORRECTLY. THE CONTROL KNOBS FOR THE HEADLIGHT ADJUSTMENT FELL OFF WHILE DRIVING. THE CONSUMER WAS UNABLE TO ADJUST THE HEADLIGHTS.  UPDATED *JB",
        "vin": "JKBZGNB198A"
    }
]