[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/08/2022",
        "dateOfIncident": "01/01/2022",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446721,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "Driver side sliding door will not close. Not powered. Multiple mechanic can not fix. Do not know why.",
        "vin": "Kndmb233086"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/29/2021",
        "dateOfIncident": "04/26/2021",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11438659,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "[XXX] owned a 2008 Kia Sedona minivan, VIN #[XXX]. This was his only vehicle at the time. On or about April 26, 2021, [XXX] heard a loud noise coming from the driveway and went outside to investigate. The van was engulfed in flames, mainly in the engine compartment. He attempted to put the fire out himself. His neighbor called the Pinellas Park fire department who responded and put out the fire. The vehicle was a total loss. The van had been parked for approximately five hours after he used it earlier that day to pick up children from school  The spontaneous vehicle fire was a serious safety risk, and he is fortunate to have not lost his home in the fire along with the vehicle. The day before the fire, the ABS indicator light on the dash came on. He made an appointment to have the van serviced on April 27, but the fire destroyed the vehicle before it could be looked at. Shortly after this happened, [XXX] learned of Manufacturer Recall Number SC186; NHTSA Recall Number 20V088. He was never notified by Kia North America, before or after the fire which destroyed the vehicle. [XXX] has opened case number [XXX] with and was assured that Kia would be providing reimbursement for the Kia Sedona vehicle he had to replace. Kia North America requested pictures of the fire damaged vehicle, which he sent to them. He offered to allow Kia to inspect the wreckage of the vehicle, but no action was ever taken despite assurances that Kia would send a representative to inspect the vehicle. In September 2021, Kia North America stopped responding to Mr. Brackett, and no longer returns his or my communication.  If the NHTSA requires any more information, please contact my office. /s [XXX] Florida Bar #[XXX] [XXX]  INFORMATION Redacted PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "KNDMB233486"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "10/13/2021",
        "dateOfIncident": "10/13/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11436588,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "On three occasions my vehicle's engine would stumble and refuse to accelerate when gas peddle was depressed to reach a lower gear to accelerate. I was forced to pull out of busy traffic to roadway shoulder, where engine continued to stumble or misfire. When I shut off the ignition and restarted my Kia Sedona, it retuned to normal operation.  A second mishap was the sudden opening of the engine compartment hood, which flew up and struck my windshield, completely blocking my view. Fortunately I was able to slow and stop the vehicle without further damage, beside a bent hood and broken hinges and hood struts. You have issued a recall for several states, but not for Florida where this happened.",
        "vin": "KNDMB233886"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/29/2021",
        "dateOfIncident": "09/13/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11434833,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2008 Kia Sedona. The contact stated that while driving at various speeds, the check engine warning light illuminated. The contact had taken the vehicle to an independent mechanic who informed him that the catalytic converter was defective. The contact was referred to NHTSA by the independent mechanic for assistance. The dealer nor the manufacturer had yet to be notified of the failure. The vehicle had yet to be repaired. The contact stated that the odometer had been rolled back. The failure mileage was unknown.",
        "vin": "kndmb233586"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/27/2021",
        "dateOfIncident": "08/23/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11430742,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I was driving on the freeway and my hood blew up and smashed my front windshield blocking out light. I could not see to drive and the rearview mirror flew off like a projectile",
        "vin": "KNDMB233486"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/16/2021",
        "dateOfIncident": "07/20/2021",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11429285,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "Vehicle was not drivable. Driver side front control arm was corroded and cracked/broken.",
        "vin": "KNDMB233186"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/25/2021",
        "dateOfIncident": "08/01/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11389807,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VAN'S SLIDING SIDE DOORS NO LONGER OPEN DUE TO PLASTIC CLIPS IN THE TRACKS BREAKING. THE DOORS CANNOT BE OPENED FROM THE INSIDE OR THE OUTSIDE. BOTH DOORS BROKE THE SAME DAY. MY SON IS IN A WHEELCHAIR AND WE USE THE SIDE SLIDING DOOR WITH A RAMP TO GET HIM IN HIS WHEELCHAIR INTO THE VEHICLE. HE IS FIVE AND WAS TRAPPED IN THE VEHICLE. WE HAD TO OPEN THE BACK HATCH AND FOLD DOWN THE REAR SEATS IN ORDER TO GET HIM IN HIS WHEELCHAIR OUT. THIS IS NOT A SAFE SITUATION. I CAN NO LONGER RIDE HIM OR ANY PASSENGERS IN THE REAR OF THE VEHICLE BECAUSE IT'S AN ENTRAPMENT ISSUE IF I WAS TO BE IN AN ACCIDENT. I NOTE THAT THIS SAME ISSUE HAS BEEN ADDRESSED WITH A RECALL ON LATER YEAR MODELS THAN MINE, BUT HAS YET TO BE RECALLED ON THE 2008.",
        "vin": "KNDMB233386"
    },
    {
        "components": "SUSPENSION",
        "crash": true,
        "dateComplaintFiled": "11/04/2020",
        "dateOfIncident": "09/24/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11372961,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SEDONA. THE CONTACT STATED THAT WHILE HER BOYFRIEND WAS DRIVING AROUND A CURVE, THE VEHICLE VEERED OFF THE HIGHWAY AT 55 MPH DOWN INTO AN INCLINE. THE VEHICLE CRASHED INTO A TREE IN A YARD. IT WAS DISCOVERED THAT THE CONTROL ARM ON THE DRIVER'S SIDE WAS RUSTED AND FRACTURED IN THREE PLACES. THERE WERE NO INJURIES THAT CAUSED ANYONE TO BE TRANSPORTED BY AMBULANCE. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO A STORAGE AREA. THE DEALER BERGSTROM KIA OF APPLETON (2445 W COLLEGE AVE, APPLETON, WI 54914 (920) 993-3000) TOLD THE CONTACT TO CALL THE MANUFACTURER. THE CONTACT WAS SENT TO THE RECALL SECTION AND SENT PICTURES OF THE CRASH. AFTER SEVERAL CALLS, THE MANUFACTURER CONCLUDED THAT THEY WOULD NOT OFFER ANY ASSISTANCE. VIN TOOL SEARCH CONFIRMED THE VEHICLE HAD A PENDING RECALL UNDER NHTSA CAMPAIGN NUMBER: 16V387000 (SUSPENSION).THE FAILURE MILEAGE WAS 171,000.",
        "vin": "KNDMB233886"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/03/2020",
        "dateOfIncident": "05/20/2019",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353008,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SEDONA. THE CONTACT STATED THAT WHILE DRIVING SEVERAL WARNING LIGHTS INCLUDING THE ABS WARNING LIGHT HAD ILLUMINATED. AFTER RESTARTING THE ENGINE, THE ODOR OF BURNING RUBBER WAS PRESENT AND SMOKE WAS SCENE COMING FROM UNDER THE HOOD. THE VEHICLE WAS TOWED TO THE LOCAL MECHANIC WHO DIAGNOSED THAT THE FAN MODULE WAS FAULTY. THE FAN MODULE WAS REPLACED BUT THE FAILURES CONTINUED TO OCCUR. THE VEHICLE WAS EXAMINED BY A SECOND INDEPENDENT MECHANIC WHO DIAGNOSED THAT THE WIRE HARNESS WAS FAULTY AND NEEDED TO BE REPLACED. NO FURTHER INFORMATION WAS AVAILABLE. THE VEHICLE WAS NOT REPAIRED. THE LOCAL DEALER AND THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 100,000.",
        "vin": "KNDMB233086"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/02/2020",
        "dateOfIncident": "06/05/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11352734,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SEDONA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V088000 (ELECTRICAL SYSTEM, SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE VEHICLE WAS TAKEN TO GREENWAY KIA OF RIVERGATE (1536 GALLATIN PIKE N, MADISON, TN 37115) AND WAS REJECTED TO BE SERVICED DUE TO PARTS NOT BEING AVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND INFORMED THE CONTACT PART WAS NOT YET AVAILABLE AND PROVIDED A CASE NUMBER. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "KNDMB233086"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/20/2020",
        "dateOfIncident": "08/04/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350575,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT 55MPH 2 LANE RUAL ROAD CHECK ENGINE LIGHT CAME ON THEN AFTER MIN LATER ESC OFF LIGHT CAME ON AND ALL THE SUDDEN I LOST ALL THROTTLE AND RPM  GAS PETAL TO FLOOR AND WOULD ONLY COST AT 20MPH AND LESS ON INCLINE ALMOST REAR ENDED DUE TO LOSS OF THROTTLE WITH NO NOTICE TO TRAFFIC BEHIND ME .. TURNED ON EMERGENCY FLASHERS FOUND A PLACE 10 MILES DOWN THE ROAD TO PULL OFF .. NO CELL SERVICE IN RUAL AREA CRANKED VEH BACK UP AND ALL LIGHTS WERE OFF STARTED AND THROTTLED RIGHT FOR ABOUT A MILE THEIR WAS NO RAIN SNOW JUST SUNNY DAY ..HAVE CALLED KIA THEY SAID THEY HAVE NEVER HEARD OF SUCH SINCE WE HAVE THE COVID .. I WENT ONLINE AND SEE ALOT OF COMPLAINTS ABOUT THIS ISSUE SO I HAVE NO FAITH THAT KIA WILL FIX IT SINCE ALL THE REVIEWS .. I HAD A THROTTLE POSITION SENSOR ORDERED IT THRU KIA WHICH AT FIRST THEY SAID THEY COULD NOT SELL THE SENSOR ONLY BUT THE WHOLE THROTTLE BODY.. I HAD TO REFER THEM TO A TSA BULLETIN AND GUESS WHAT THEY COULD ORDER ONE AT $40 COMPARED TO $350 .. I REPLACED THE PART AND IT IS STILL DOING THE SAME THING ..FRUSTRATED WITH THIS IT SHOULD BE A RECALL SINCE THIS IS A ONGOING ISSUE WITH KIA AND HUANDA VEH TILL DATE FROM WHAT I HAVE READ ONLINE .. IF YOU WISH TO LOOK AT MY VEH TO SEE THE PROBLEM YOU ARE WELCOME TO BECAUSE ITS UNSAFE FOR ME TO DRIVE 165,000 MILES",
        "vin": "KNDMB233486"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/13/2020",
        "dateOfIncident": "06/27/2020",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11339089,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SEDONA. THE CONTACT STATED SEVERAL MONTHS AGO, SMOKE WAS SEEN COMING FROM THE FRONT OF THE VEHICLE WHILE STOPPED AT A STOP SIGN.  THE CONTACT STATED THAT RECENTLY SHE PARKED, THE VEHICLE AND IT FAILED TO REVERSE, SHE CHECKED THE OIL LEVEL HOWEVER, THERE WAS NO OIL IN THE ENGINE.  THE CONTACT STATED THAT THE FAILURE RECURRED AS WHILE SHE WAS DRIVING SMOKE WAS SEEN IN THE VEHICLE AND THE BRAKE PEDAL FAILED TO ENGAGE WHILE DEPRESSED.  THE CONTACT STATED NO WARNING LIGHT WAS ILLUMINATED. THE CONTACT STATED ON THE FINAL FAILURE A FEW WEEKS LATER THE VEHICLE STALLED, WHILE DRIVING 55 MPH AND CAME. THE CONTACT WAS NOT ABLE TO MOVE THE VEHICLE, WHICH CAUSED THE VEHICLE ON FIRE ON ENGINE. THE CONTACT STATED THE FIRE WAS EXTINGUISHED BY THE FIRE DEPARTMENT AND A FIRE DEPARTMENT REPORT WAS FILED. THE FIRE DEPARTMENT INSPECTED THE VEHICLE AND STATED THE CAUSE OF THE FIRE WAS UNDETERMINED. THE CONTACT STATED THAT THE FAILURE WAS RELATED TO NHTSA CAMPAIGN NUMBER: 20V088000 (ELECTRICAL SYSTEM, SERVICE BRAKES, HYDRAULIC) HOWEVER THE CONTACT HAD NOT RECEIVED A NOTIFICATION ON THE RECALL. THE CONTACT STATED A LOCAL DEALER WAS CONTACTED HOWEVER, NO ASSISTANCE WAS OFFERED AND PROVIDED MANUFACTURER NUMBER. THE MANUFACTURER HAD BEEN INFORMED OF FAILURE AND A CASE WAS OPENED. THE CONTACT STATED SHE WAS AWAITING A CALL BACK FROM THE MANUFACTURER. THE FAILURE MILEAGE WAS APPROXIMATELY 198,000.",
        "vin": "KNDMB233086"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/15/2020",
        "dateOfIncident": "05/24/2020",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11329092,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR CAUGHT FIRE BECAUSE OF ELECTRICAL CONNECTION IN THE DIVER SIDE HEADLIGHT WIRING.  THIS OCCURRED WHILE DRIVING ON A CITY STREET WITH THE HEADLIGHTS OFF. CAR WAS TOTALED. INSURANCE AND MANUFACTURER HAVE BEEN INFORMED.  *TR",
        "vin": "KNDMB233586"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/13/2020",
        "dateOfIncident": "12/16/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11328700,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE WORKING ON MY 2008 KIA SEDONA, I DISCOVERED SEVERE PERFORATING CORROSION ON THE PASSENGER SIDE FRONT LOWER CONTROL ARM.  I DISCOVERED THAT KIA HAD INITIATED A VOLUNTARY RECALL UNDER NHTSA CAMPAIGN NUMBER: 16V387000.  I CONTACTED KIA AT 1-800-333-4542 TO SEE IF THEY WOULD APPLY RECALL SC133 TO MY CAR EVEN THOUGH IT IS NOT IN ONE OF THE IDENTIFIED STATES (ALTHOUGH VIRGINIA DOES USE ROAD SALT IN WINTER).  AFTER I CALLED THEM TWICE AND SENT THE ATTACHED PICTURES THEY TOLD ME THEY WOULDN'T COVER IT AND THAT I WOULD HAVE TO PAY FOR A DEALERSHIP TO DIAGNOSE IT AND SEND THEM THEIR OPINION FOR THEM TO RECONSIDER.      I DO NOT THINK THAT I SHOULD HAVE TO PAY ANYTHING OUT OF POCKET TO VERIFY WHAT THE PICTURES CLEARLY SHOW.  THIS CORROSION COULD RESULT A BROKEN CONTROL ARM AND RESULT IN THE LOSS OF CONTROL OF THE VEHICLE, INCREASING THE RISK OF A CRASH.    PLEASE CONTACT KIA FOR ME OR CHANGE THE CAMPAIGN TO MANDATORY AND EXPAND IT TO ALL STATES.  *TR",
        "vin": "KNDMB233686"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/11/2020",
        "dateOfIncident": "04/08/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11328368,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SEDONA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V088000 (ELECTRICAL SYSTEM, SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT CONTACTED ORLANDO KIA (8701 E COLONIAL DR ORLANDO, FL 32817, 407-678-17170) WHERE IT WAS CONFIRMED THAT THE PART WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND STATED THAT THE DEALERS HAVE PARTS TO DO THE  RECALL REPAIRS. THE CONTACT HAD NOT EXPERIENCE A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "KNDMB133586"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/30/2020",
        "dateOfIncident": "04/08/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322898,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SEDONA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 20V088000 (ELECTRICAL SYSTEM, SERVICE BRAKES, HYDRAULIC) HOWEVER, THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE MANUFACTURER WAS CONTACTED AND CONFIRMED THAT THE PART WAS NOT YET AVAILABLE. THE CONTACT WAS INFORMED THAT THE NOTIFICATION THAT WAS RECEIVED WAS AN INTERIM NOTIFICATION. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. A DEALER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "KNDMB233786"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/26/2020",
        "dateOfIncident": "04/09/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322286,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTICE FOR A RECALL FOR AN ELECTRICAL PART WAS SUBMITTED 4/9.  THERE HAS BEEN NO WORD FROM THE MANUFACTURER ABOUT A REPAIR OR IF WE ARE ABLE TO SAFELY DRIVE OUR VEHICLE.  THERE IS NO CLEAR HELP HOTLINE TO GIVE MORE GUIDANCE. CAN THE THE NHTSA ASK THEM TO POST A CLARIFICATION AND A DEADLINE FOR DECISIVE ACTION (EITHER A REPAIR OR REFUND)",
        "vin": "KNDMB233586"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "04/13/2020",
        "dateOfIncident": "04/05/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321022,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "GETTING ON FREEWAY I JUST LEFT THE ENTRANCE RAMP INCREASING MY SPEED IM AT AROUND 45 50 MPH. ALL OF SUDDEN WITH NO WARNING WHATSOEVER THE HOOD JUST FLIES UP AND CRUSHES MY WINDSHIELD. I SLAM ON MY BRAKES  TRYING TO SEE AROUND THE HOOD AND COASTED OVER TO THE BRIM OF THE ROAD MAKING SURE I WAS SAFELY OFF THE ROAD. I GET OUT OF THE CAR AND TRY TO PULL THE HOOD BACK DOWN . I TRIED WITH GREAT DIFFICULTY TO GET THE HOOD BACK DOWN AND SECURED. AND PROCEEDED TO GET OFF THE FREEWAY AND HEAD BACK HOME. PLEASE NOTE I HAVE ONLY OWNED THIS VEHICLE A COUPLE OF MONTHS PRIOR  TO THIS AND WAS NOT AWARE OF ANY SAFETY ISSUES",
        "vin": "KNDMB233586"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/09/2020",
        "dateOfIncident": "06/20/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11317164,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER REAR DOOR WILL NOT OPEN WITH THE KEY FOB, ONLY WITH STRENGTH.  HAVE BEEN TOLD THE MOTOR IS WORE OUT FOR THAT PARTICULAR DOOR.   IT WAS JUST PARKED, WITH THIS TROUBLE TO THIS DATE. AS STATED, I HAVE BEEN TOLD THAT THE MOTOR TO THIS DOOR IS WORE OUT.",
        "vin": "KNDMB233786"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/19/2020",
        "dateOfIncident": "09/01/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11310042,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SLIDING DOORS DO NOT PROPERLY LATCH. THE DOOR WILL CLOSE AND THEN RETRACT A LITTLE CAUSING THE DOOR LIGHT TO REMAIN ON. THIS OCCURS IN BOTH PASSENGER AND DRIVER SIDE SLIDING DOORS.",
        "vin": "KNDMB233X86"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/22/2020",
        "dateOfIncident": "01/20/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301163,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SEDONA. THE CONTACT STATED THAT ON SEVERAL OCCASIONS THE VEHICLE FAILED TO START. THE CONTACT STATED THAT THE FAILURE WAS INTERMITTENT. THE CONTACT STATED THAT PREVIOUSLY THE BATTERY, STARTER, AND STARTER RELAY WERE REPLACED HOWEVER, THE FAILURE PERSISTED. THE CONTACT STATED THAT ON FOUR SEPARATE OCCASIONS THE FUSE PANEL, THE ALTERNATOR, AND IGNITION WERE INSPECTED HOWEVER, THE MECHANICS WERE UNABLE TO PROVIDE A PROGNOSIS FOR THE FAILURE. MASTRIA KIA LOCATED AT 1555 NEW STATE HWY, RAYNHAM, MA 02767, (508) 802-6800, WAS CONTACTED BY PHONE AND INFORMED OF THE FAILURE. THE CONTACT WAS INFORMED THAT THE VEHICLE NEEDED TO BE DIAGNOSED HOWEVER, THERE WAS NO GUARANTEES AS TO WHETHER OR NOT THE MECHANIC WOULD BE ABLE TO RETRIEVE INFORMATION AS TO THE CAUSE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS CONTACTED AND INFORMED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 127,000.",
        "vin": "KNDMB133X86"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/17/2019",
        "dateOfIncident": "12/17/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11289774,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERMITTENT NO START NO CRANK ISSUE. THE RESEARCH I'VE DONE SHOWS IT IS A FAULTY JUNCTION BOX DUE TO ANTITHEFT SYSTEM NOT WORKING CORRECTLY.",
        "vin": "KNDMB233786"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/19/2019",
        "dateOfIncident": "10/31/2019",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11280986,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SEDONA. THREE HOURS AFTER THE VEHICLE WAS PARKED IN THE DRIVEWAY, FLAMES APPEARED FROM THE REAR OF THE VEHICLE. THE FIRE DEPARTMENT ARRIVED AND EXTINGUISHED THE FLAMES. A FIRE REPORT WAS FILED. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE LOCAL DEALER WAS NOT NOTIFIED. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 189,000.",
        "vin": ""
    },
    {
        "components": "SUSPENSION,EXTERIOR LIGHTING,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/14/2019",
        "dateOfIncident": "11/13/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11279961,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TODAY LOOKING MY CAR VALUE, FOUND THAT MY WAGON HAVE 4 RECALLS. I'M WORRY FOR THIS SITUATION.",
        "vin": "KNDMB233586"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/07/2019",
        "dateOfIncident": "08/04/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11242394,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING TRIED TO STOP FOR A LIGHT AND BRAKES FAILED, PEDAL WENT TO THE FLOOR ABS DID NOT ENGAGE AND FINALLY SLOWED.  THIS IS SECOND MASTER CYLINDER ON THE VEHICLE.  MY MECHANIC WHO DID THE REPLACEMENT SEVERAL YEARS AGO TRIED TWO MORE NEW MASTER CYLINDERS TODAY AND THEY ALSO FAILED TO HOLD PRESSURE. DEALER WAS NO HELP WITH POSSIBLE SOLUTION. I NEED TO TAP THE BRAKE PEDAL TO STOP THE VEHICLE.  WE CAN FIND NO RECALLS ON THE MASTER CYLINDER",
        "vin": "KNDMB233186"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/24/2019",
        "dateOfIncident": "07/24/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11234662,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SLIDING DOORS GET STUCK SHUT, AND UNABLE TO OPEN THEM EVEN UNLOCKING THEM MANUALLY DOES NOT HELP, HAVING TO PULL HANDLES SEVERAL TIMES TO GET THEM TO OPEN",
        "vin": "KNDMB233486"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/23/2019",
        "dateOfIncident": "07/11/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11234084,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE LIGHT WILL NOT TURN OFF, EVEN THE ENGINE IS OFF. IT IS DANGEROUS TO DRIVE THE CAR AS THE BRAKE LIGHT IS ALWAYS ON.   KIA HAD A RECALL ON THIS ISSUE (HTTPS://WWW.AUTOMOTIVE-FLEET.COM/143442/HYUNDAI-KIA-ISSUE-RECALLS-FOR-BRAKE-LIGHT-ISSUE) FOR MANY CARS. HOWEVER, I CONTACTED KIA AND WAS TOLD IT IS MY OWN PROBLEM. I CONTACTED LOCAL DEALER AND THEY WERE VERY KIND AT THE BEGINNING, HOWEVER, AFTER I DESCRIBED THE PROBLEM, THEY DID NOT REPLY MY EMAIL. I DO BELIEVE KIA IS TRYING TO CHEAT CUSTOMERS TO AVOID THEIR RESPONSIBILITY.",
        "vin": "KNDMB233886"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/18/2019",
        "dateOfIncident": "04/15/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11197152,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SIDE DOORS ON MY 2008 KIA SEDONA VAN OPEN UNEXPECTEDLY AS I AM DRIVING THE VAN ON THE HIGHWAY.  IT HAS DONE THIS MANY TIMES IN THE LAST 4 MONTHS.  I HAVE A 2 AND 3 YEAR OLD IN THE BACKSEAT IN CHILDSEATS.",
        "vin": "KNDMB233886"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/24/2019",
        "dateOfIncident": "07/27/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11171885,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "LOWER ARM NEEDS TO REPLACE DUE TO OLD.THE FRONT LOWER CONTROL ARMS MAY BREAK DUE TO CORROSION FROM SALT WATER EXPOSURE SUCH AS FROM ROAD SALT USE. HEAR A CRANKING SOUND WHEN DRIVING ON THE ROAD OR RUN OVER POTHOLES",
        "vin": "KNDMB233286"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/31/2018",
        "dateOfIncident": "07/26/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11114766,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ME AND MY 2 YEAR OLD DRIVING IN THE MIDDLE OF THE FREEWAY WHEN THE HOOD HIT THE WINDSHIELD AND THANK GOD THE DRIVERS ON MY RIGHT SIDE HELP US GET OVER OR WE PROBABLY BE DEAD.",
        "vin": "KNDM2333862"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/30/2018",
        "dateOfIncident": "01/01/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11113729,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 KIA SEDONA. CONSUMER WRITES IN REGARDS TO AIRBAG RECALL. *LD    THE CONSUMER STATED THE VEHICLE WAS OUT OF WARRANTY THEREFORE COULD THE COST WOULD NOT BE COVERED.*JS",
        "vin": "KNDMB233086"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/24/2018",
        "dateOfIncident": "07/22/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11113314,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG LIGHT CAME ON OUT OF NOWHERE. VEHICLE WAS JUST STARTED WHEN THE LIGHT CAME ON AND WAS STATIONARY.",
        "vin": "KNDMB233686"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/23/2018",
        "dateOfIncident": "05/01/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11113085,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SEDONA. WHILE STATIONARY AND DRIVING VARIOUS SPEEDS, BOTH SLIDING DOORS WOULD OPEN WITHOUT BEING PROMPTED, AND WOULD NOT CLOSE WHEN SIGNIFICANT PRESSURE WAS APPLIED. THE FAILURE BECAME INCREASINGLY WORSE OVER THE PAST TWO YEARS. AN INDEPENDENT MECHANIC GREASED THE INTERIOR PARTS OF BOTH SLIDING DOORS, BUT THE FAILURE RECURRED. A DEALER AND MANUFACTURER WERE NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 144,252.",
        "vin": "KNDMB233486"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/10/2018",
        "dateOfIncident": "07/08/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11110408,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A RECALL ON MY VEHICLE FOR THE CONTROL ARMS. I FOUND THIS OUT WHEN I DID A GOOGLE SEARCH BECAUSE MINE HAS BROKEN NEARLY COMPLETELY IN HALF AS I WAS DRIVING IT. I WAS ON A CITY STREET AND IT SNAPPED AS I WAS APPLYING THE BRAKES. AFTER THAT IT WAS GIVING ME ISSUES TURNING LEFT AND BRAKING. THE RECALL STATES THAT THE CONTROL ARMS WILL RUST AND BREAK WHICH IS EXACTLY WHAT HAPPENED. BUT APPARENTLY  MY VEHICLE HAS A CANADIAN VIN NUMBER AND BECAUSE OF THAT KIA WILL NOT HONOR THE RECALL AND I HAVE TO GET IT FIXED MYSELF. I CAN EVEN PUT MY VIN NUMBER INTO THE KIA CANADA WEBSITE AND THE RECALL PIPS UP. THEY GAVE ME THE TOLL FREE NUMBER TO KIA CANADA WHICH I TRIED TO CALL BUT CAN'T GET THROUGH BECAUSE IT IS 'NOT AVAILABLE FROM MY AREA' IN MY OPINION KIA IS KIA. NO MATTER WHERE I AM AND WHERE MY CAR IS FROM. I SHOULDN'T HAVE TO GO TO CANADA TO FIX THE RECALL!! THE COMPANY AS A WHOLE SHOULD BE MORE CONCERNED WITH THEIR CONSUMERS AND ENSURE OUR SAFETY AND THAT IS NOT WHAT THEY ARE DOING! I HAD MY BABY IN THE CAR AND A COUPLE OTHER PEOPLE  AND THIS COULD HAVE CAUSE GREAT INJURY TO ALL OF US",
        "vin": "KNDMB233886"
    },
    {
        "components": "STEERING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/18/2018",
        "dateOfIncident": "07/08/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11073470,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WE CAN  NOT TURN ON OUR VEHICLE.  EVERYTHING WORKS AS FAR AS THE AIR CONDITIONER AND RADIO HOWEVER, THE VEHICLE WILL NOT START.  AFTER YOU CHECK THE STEERING WHEEL AND IT'S POSITION AND TURN THE KEY ON TO CHANGE BETWEEN PARK AND NEUTRAL, SOMETIMES IT WILL START.  RIGHT NOW WE CAN NOT FIND A SOLUTION TO WHY IT WILL START AND THEN YOU CAN NOT PUT IT BACK IN PARK.  THIS IS ALL WHILE THE VEHICLE IS STATIONARY.",
        "vin": "KNDMB233786"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/08/2018",
        "dateOfIncident": "02/06/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11071724,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE WILL NOT CRANK/START INTERMITTENTLY WITHOUT RHYME OR REASON. TURN THE KEY TO START, THE LIGHTS COME ON , ALL INDICATOR LIGHTS TURN ON, ALL ELECTRICAL DEVICES SUCH AS LIGHTS AND RADIO AND HEATER ARE WORKING, BUT THE ENGINE DOES NOT CRANK. THE STARTER MAKES NO NOISE WHATSOEVER. THIS HAPPENS RANDOMLY AND CANNOT BE GIVEN TO A DEALER TO FIX AS HE MAY TRY IT 20 TIMES AND IT WILL START AND I WILL TRY IT THE NEXT DAY AND IT WON'T. I CAN TURN THE KEY BACK AND FORTH 20 TIMES AND IT WILL SUDDENLY START. I SOMETIMES EXIT THE CAR, WAIT 10 MINUTES, AND THEN IT WILL START. THIS CONDITION APPARENTLY AFFECTS 2004-2009 KIA'S OF ALL MODELS AS WELL AS HYUNDAI WHICH IS A SISTER BRAND. TENS OF THOUSANDS HAVE BEEN AFFECTED BY THIS BUT KIA REFUSES TO ACKNOWLEDGE THE PROBLEM OTHER THAN TO SAY TAKE IT TO A DEALER . BUT THE PROBLEM IS NOT EASILY DUPLICATED AT THE DEALER. KIA HAS A SERVICE BULLETIN OUT ON IT BUT IT IS INADEQUATE. CUSTOMERS HAVE REPORTED CHANGING STARTER, BATTERY, GROUNDING STRAP, FUSEBOX, INTERNAL COMPUTER, IPM MODULE, AND OTHER REMEDIES WITH MIXED RESULTS AND HUGE COSTS. I BYPASSED THE IPM MODULE, CHANGED STARTER RELAY AND OTHER REMEDIES WHICH WORK FOR A MONTH OR TWO AND THEN CONDITION REAPPEARS.  GOOGLE \"KIA SERVICE BULLETIN ON INTERMITTENT START CONDITION\" AND YOU WILL SEE ALL THE COMPLAINTS.  HTTPS://WWW.YOUTUBE.COM/WATCH?V=RKK4UBC5ZXK 60,000 VIEWS  HTTPS://WWW.YOUTUBE.COM/WATCH?V=QUYK4F35XBM  67000 VIEWS",
        "vin": "KNDMB233586"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/25/2017",
        "dateOfIncident": "09/24/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11025248,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WITHOUT WARNING GOES INTO LIMP MODE VERY LITTLE ACCELERATION ESP LIGHT ON AND CHECK ENGINE ON.  WILL RESTART AND DRIVE NORMALLY UNTIL NEXT EPISODE! CAR MOVING AT HIGHWAY SPEED WHEN THIS HAPPENS OR ON CITY STREET BUT ALWAYS MOVING.",
        "vin": "KMDMB233286"
    },
    {
        "components": "SUSPENSION,EXTERIOR LIGHTING,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "09/14/2017",
        "dateOfIncident": "09/14/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11023408,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SEDONA. THE CONTACT STATED THAT THE MANUFACTURER SENT TWO RECALL NOTICES FOR NHTSA CAMPAIGN NUMBERS: 16V387000 (SUSPENSION) AND 16V389000 (LATCHES/LOCKS/LINKAGES) AND WAS UNCERTAIN AS TO WHEN THE DEALER MAY BE ABLE TO SCHEDULE THE RECALL REPAIRS. IN ADDITION, THE HEAD LIGHTS FAILED TO FUNCTION FOR THE LOW BEAMS, DAY TIME RUNNING LIGHTS, AND HIGH BEAMS. THE DEALER (BIG A AUTO SALES, GREENWOOD, SC  (864) 388-7828 ) WAS NOTIFIED OF THE FAILURE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. PARTS DISTRIBUTION DISCONNECT. THE APPROXIMATE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": "KNDMB233X86"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "07/12/2017",
        "dateOfIncident": "06/30/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11004836,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SEDONA. WHILE DRIVING 35 MPH, THE CONTACT'S VEHICLE ACCELERATED WITHOUT WARNING AND CRASHED INTO THE REAR OF ANOTHER VEHICLE. THERE WERE NO INJURIES AND A POLICE REPORT WAS FILED. THE AIR BAGS DID NOT DEPLOY. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC. THE LOCAL DEALER WAS NOT CONTACTED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 128,000.",
        "vin": "KNDMB233186"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/15/2017",
        "dateOfIncident": "06/15/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10995421,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE FUEL TANK PLACE WHERE YOU PUMP THE GAS IS COMPLETELY RUSTED, I FEAR THIS RUST MIGHT ADD TO FUEL AND MIGHT DAMAGE THE ENGINE OR IT MIGHT CAUSE SOME SPARK.",
        "vin": "KNDMB233086"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/14/2017",
        "dateOfIncident": "05/27/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10995235,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SEDONA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V387000 (SUSPENSION); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. KIA STOCKTON IN STOCKTON, CALIFORNIA WAS MADE AWARE OF THE FAILURE AND STATED THAT THE PARTS WERE UNAVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HEARD A CLICKING NOISE AND THE FRONT END OF THE VEHICLE WOBBLED LEFT AND RIGHT. THE FAILURE MILEAGE WAS UNKNOWN. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "KNDMB233586"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/04/2017",
        "dateOfIncident": "04/04/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10970560,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AUTOMATIC DOORS KEEP OPENING SLIGHTLY WHILE DRIVING AND CAUSING THE DOOR ALARM TO GO OFF. THE DOORS TEND TO WORK WHEN THEY WANT TOO. THIS IS A VERY SERIOUS MATTER BECAUSE THEY ARE OPENING UP NEXT TO CHILDREN.",
        "vin": "KNDMB233086"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "03/22/2017",
        "dateOfIncident": "12/19/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10967832,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SEDONA. WHILE DRIVING APPROXIMATELY 65 MPH, THE HOOD OPENED AND SMASHED AGAINST THE WINDSHIELD AND ROOF. THE VEHICLE WAS DRIVEN TO THE NEAREST DEALER. THE MANUFACTURER STATED THAT THERE WAS NO FAILURE WITH THE HOOD LATCH. THE VEHICLE WAS REPAIRED AT THE OWNER'S EXPENSE. TWO YEARS LATER, THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 16V389000 (LATCHES/LOCKS/LINKAGES). THE MANUFACTURER REFUSED TO REPAIR THE DAMAGES CAUSED BY THE HOOD LATCH FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 50,000. UPDATED 08/09/17*LJ    *CN",
        "vin": "KNDMB233686"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "01/05/2017",
        "dateOfIncident": "12/31/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10939966,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SEDONA. WHILE DRIVING 65 MPH, THE HOOD OF THE VEHICLE BECAME UNLATCHED AND FRACTURED THE WINDSHIELD. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 108,323.",
        "vin": "KNDMB233X86"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/29/2016",
        "dateOfIncident": "06/13/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10928468,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SEDONA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V387000 (SUSPENSION) HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. THE VIN WAS NOT AVAILABLE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,LATCHES/LOCKS/LINKAGES,TRACTION CONTROL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/25/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10927879,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SEDONA. WHILE DRIVING, THE SLIDING DOORS ERRONEOUSLY UNLOCKED AND OPENED. THE FAILURE OCCURRED ON BOTH THE DRIVER AND PASSENGER SIDES. ALSO, WHILE OPERATING THE VEHICLE, THE TRACTION CONTROL SYSTEM WOULD ERRONEOUSLY ACTIVATE. AFTER INSERTING THE KEY INTO THE IGNITION SWITCH, THE VEHICLE WOULD ATTEMPT TO START BEFORE THE IGNITION KEY WAS TURNED. THE CAUSE OF THE FAILURES WAS NOT DIAGNOSED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURES. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 108,000.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/14/2016",
        "dateOfIncident": "11/12/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10925768,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TRAVELING AT 85 MPH, CRUISE CONTROL ON, \"ESC OFF\" LIGHT AND CHECK ENGINE LIGHT ILLUMINATED ON THE DASHBOARD AND THE VEHICLE DECELERATED RAPIDLY. LOST ABILITY TO ACCELERATE PAST 20 MPH. VEHICLE WAS STOPPED AND RESTARTED. ACCELERATOR RESUMED WORKING FOR HOWEVER THE CHECK ENGINE LIGHT ILLUMINATED AND CHECKED THE CODE IT WAS THROTTLE POSITION SENSOR. THIS MORNING THE CHECK ENGINE LIGHT REMAINED ON AND THE VEHICLE.",
        "vin": "KNDMB233486"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/10/2016",
        "dateOfIncident": "11/09/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10925299,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD A TIRE SIDEWALL SEPARATION. I BOUGHT FOUR NEW TIRES AND THIS IS THE SECOND ONE THAT CAME APART.",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/14/2016",
        "dateOfIncident": "09/13/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10906473,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SEDONA. WHILE DRIVING VARIOUS SPEEDS, THE CONTACT HEARD A RATTLING NOISE COMING FROM THE FRONT END OF THE VEHICLE. THE CONTACT WAS UNABLE TO TELL WHERE THE NOISE ORIGINATED. AN INDEPENDENT MECHANIC STATED THAT THE CONTROL ARM ON THE FRONT DRIVER SIDE OF THE VEHICLE WAS LOOSE AND SPRAY PAINTED AS IF IT WERE REPAIRED. THE FRONT WHEEL ON THE PASSENGER SIDE OF THE VEHICLE WAS LOOSE ALSO AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE VEHICLE WAS RECENTLY REPAIRED FOR A SAFETY RECALL ASSOCIATED WITH NHTSA CAMPAIGN NUMBER: 16V387000 (SUSPENSION); HOWEVER, THE VEHICLE WAS NOT PROPERLY REPAIRED AND WAS STILL EXPERIENCING FAILURES. THE FAILURE MILEAGE WAS 85,000.",
        "vin": "KNDMB233586"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/06/2016",
        "dateOfIncident": "02/05/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10903705,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SEDONA. THE CONTACT STATED THAT THE REAR PASSENGER DOOR HAD NOT CLOSED AND THE DRIVER SIDE DOOR HAD NOT OPENED. THE VEHICLE WAS DRIVEN TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE DOORS NEEDED GREASE AND THE INDOOR AND EXTERIOR DOOR HANDLES NEEDED TO BE REPLACED. THE INTERIOR DOOR HANDLE INSIDE THE PANEL WAS GREASED AND REPLACED; HOWEVER, THE ISSUE RECURRED. THE MANUFACTURER WAS NOTIFIED. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 30,000.",
        "vin": "KNDMB233X86"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/15/2016",
        "dateOfIncident": "08/01/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10896041,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SEDONA. WHEN THE VEHICLE WAS STARTED, THE AIR BAG WARNING LIGHT ILLUMINATED. WHILE THE VEHICLE WAS AT THE DEALER FOR ROUTINE MAINTENANCE, THE MECHANIC PERFORMED A DIAGNOSTIC TEST ON THE VEHICLE. THE CONTACT WAS INFORMED THAT THE OCCUPANT CLASSIFICATION SYSTEM (OCS) SEAT TRACK NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 98,558.",
        "vin": "KNDMB233586"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/20/2016",
        "dateOfIncident": "05/10/2016",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10875413,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 05-10-16 MY 2008 KIA SEDONA  WAS PARKED IN THE DRIVE WAY. IT WAS NOT ON. IT HAD NOT BEEN DRIVEN FOR MORE THAN 24 HOURS.THE KEY WAS NOT IN THE IGNITION.  WE WERE REMOVING ONE OF THE BACK PASSENGER SEATS ON THE DRIVER'S SIDE. THE SIDE DOOR HAD REMAINED OPEN. IN THE PAST WE HAD PROBLEMS WITH THE DRIVER'S SIDE SLIDING DOOR, IT WOULDN'T OPEN OR WOULDN'T CLOSE.  WHILE REMOVING THE SEAT THE OPEN DOOR INDICATOR (BUZZING) CAME ON.  DID NOT KNOW WHY IT CAME ON, THE CAR WAS IN PARK AND WAS OFF. A COUPLE OF MINUTES LATER THE SMELL OF SMOKE WAS COMING FROM THE CAR. DID NOT SEE WHERE IT WAS COMING FROM AT FIRST AND THEN SMOKE WAS COMING OUT OF THE ENGINE AREA. THE HOOD WAS OPENED AND THERE WERE  FLAMES ON THE DRIVER'S SIDE BEHIND THE STEERING WHEEL. THE FIRE DEPT. WAS CALLED BUT WE WERE ABLE TO PUT THE FLAMES OUT  BEFORE IT BECAME DANGEROUS AND CANCELLED THE CALL. THE BATTERY HAD TO BE DISCONNECTED TO AVOID HAVING THE FLAMES START UP AGAIN. THE VEHICLE WAS TOWED TO A KIA DEALER TO INVESTIGATE THE CAUSE. AFTER A FEW DAYS OF WAITING THE DEALER CONCLUDED THE ABS MAY HAVE CAUSED THE FIRE. THE FIRE HAD BURNED THE WIRING HARNESS AND FIRE WALL. THE CAR WAS TOTALED DUE TO NOT BEING ABLE TO CONFIRM THE ACTUAL CAUSE OF THE FIRE. TO DATE WE DO NOT KNOW WHAT ACTUALLY CAUSED THE FIRE BUT WE HAD TO BUY ANOTHER CAR.    I WANT TO POINT OUT IF YOU HAVE A PROBLEM WITH THE DOOR SYSTEM BE ALERT. IF YOUR CAR IS IN PARK WITH THE KEY OUT OF THE IGNITION AND YOU HAVE WARNING BUZZARDS GO OFF CHECK THE CURRENT STATUS OF THE VEHICLE, POSSIBLE RELAY OVER LOAD TO DOOR CONNECTION. NOT CONFIRMED, BUT WAS THE ONLY POWER OPERATING PART TO THE VEHICLE THAT WAS IN USE WHEN THE FIRE STARTED.",
        "vin": "KNDMB233786"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/29/2016",
        "dateOfIncident": "05/20/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10871400,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH EMERGENCY BRAKE THE VAN ROLLED AWAY.",
        "vin": "KNDMB233186"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/04/2016",
        "dateOfIncident": "05/03/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10862997,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VAN HAS THE EXACT SAME ISSUE WITH THE BRAKE SWITCH THAT ALL THE OTHERS HAD IN RECALL. SHIFTER IS STUCK IN PARK. ESC LIGHT IS ON AND BRAKE LIGHTS ARE NOT WORKING. THERE ARE NO OPEN RECALLS FOR THIS ISSUE ON THE VIN NUMBER. FURTHER, THE KIA DEALERSHIP REFUSES TO FIX IT FREE OF CHARGE.",
        "vin": "KNDMB233186"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/13/2016",
        "dateOfIncident": "03/12/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10846314,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ABOUT 40-50 MPH ON A ROUTE ROAD WHEN THE HOOD VERY SUDDENLY AND WITHOUT ANY WARNING FLIPPED BACK SMASHING THE WINDSHIELD, FORCING ME TO MOVE TO THE SIDE OF THE ROAD AS SOON AS POSSIBLE.",
        "vin": "KNDMB233486"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/10/2015",
        "dateOfIncident": "11/04/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10789709,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ESC LIGHT WOUYLD GO ON AND OFF SPORADICALLY ALONG WITH CRUISE CONTROL BECOMING UNRESPONSIVE. CONDITION WAS SPORADIC. BROUGHT VEHICLE TO NAPLES KIA ON 11-10-2015 FOR REPAIR. REPLACED STOP LAMP SWITCH AT COST TO ME. RESEARCH TODAY SHOWS WAS RECALL ON THE PART? I TOOK IT IN FOR RECALL IN THE PAST AND NOW BELIEVE THIS SAME PART WAS POSSIBLY ALREADY REPLACED. THIS WOULD MEAN THIS PART IS DEFECTIVE AGAIN.",
        "vin": "KNDMB233586"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/27/2015",
        "dateOfIncident": "10/27/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10786425,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE TO PUT BRAKES AND ROTATERS ON EVERY 6 MONTHS AND DON'T KNOW WHY",
        "vin": "KNDMB233686"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/08/2015",
        "dateOfIncident": "10/08/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10780867,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "NONE OF MY INTERIOR LIGHTS WORK, WITH DOORS OPENED OR CLOSED. NOW MY PARKING BRAKE LIGHTS STAY (REAR PASSENGER & 3RD BRAKE LIGHT)  ON EVEN WHEN THE IGNITION IS OFF AND LIGHTS ARE OFF",
        "vin": "KNDMB233786"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/31/2015",
        "dateOfIncident": "01/22/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10760368,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR THE FIRST INCIDENT, WHILE COMING TO A STOP SIGN, MY SON WAS DRIVING THE VEHICLE STALLED AND THE IGNITION POWERED OFF, POWER STEERING FAILED, BRAKE AND BATTERY LIGHTS CAME ON AND QUICKLY THE POWER CAME BACK ON THOUGH THE POWER STEERING STILL FAILED. VAN HAD TO BE SHUT OFF AND RESTARTED FOR POWER STEERING TO RESUME.  THIS WAS FIRST HAPPENING VERY INFREQUENTLY BUT IS NOW HAPPENING MORE, USUALLY WHEN COMING TO A STOP BUT HAS ALSO HAPPENED AT STEADY SPEEDS - 35MPH, 20 MPH, 5 MPH. IT USUALLY HAPPENS IN VERY HEAVY RAINS/WET CONDITIONS BUT HAS ALSO HAPPENED ONCE OR TWICE IN DRY CONDITIONS. IN ADDITION:     *PASSENGER BLINKER WILL STOP WORKING FOR A WEEK OR TWO THEN RANDOMLY START WORKING AGAIN (THIS PATTERN CONTINUES). THE BULB HAS BEEN REPLACED BUT IT CONTINUES TO HAPPEN.     *PASSENGER SIDE DOOR LOCKS DO NOT RESPOND TO KEY FAUB OR POWER LOCKS AND HAVE TO BE LOCKED/UNLOCKED MANUALLY.     *PASSENGER DOOR RANDOMLY WILL NOT OPEN FROM THE INSIDE OR OUT.     *ONE CIGARETTE LIGHTER NO LONGER WORKS.     I BELIEVE THIS IS ALL RELATED TO THE ELECTRICAL SYSTEM WITH THE BIGGEST OBVIOUS CONCERN OF THE VEHICLE'S POWER OUT AND LOSS OF STEERING. CLEARLY, THIS CAN CAUSE A MAJOR ACCIDENT. MECHANIC WAS UNABLE TO REPRODUCE THE ENGINE STALL ISSUE.",
        "vin": "KNDMB233586"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/17/2015",
        "dateOfIncident": "08/01/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10749044,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SEDONA. WHILE DRIVING 50 MPH, THE VEHICLE DECELERATED INDEPENDENTLY AND THE CHECK ENGINE WARNING LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC, WHERE IT WAS DIAGNOSED THAT THE THROTTLE SENSOR NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 45,000.",
        "vin": "KNDMB233686"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/29/2015",
        "dateOfIncident": "07/26/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10744559,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TROUBLE WITH BOTH SLIDING DOORS, REPLACED MOTOR TO PASSENGER SLIDING DOOR ABOUT 2 WEEKS AFTER PURCHASING THE VEHICLE, TAKEN THE CAR IN MULTIPLE TIMES SINCE DUE TO THE DOORS NOT OPENING MANUALLY OR WITH KEY FOB. THEY HAVE BEEN CHECKED OUT BY DEALERSHIP, BUT NOTHING HAS BEEN FOUND. I WOULD GET ALERTS PERIODICALLY THAT THE DOORS ARE OPENED WHILE DRIVING OR TURNING A CORNER, MANY TIMES WHEN THEY WONT OPEN AND WITH MY KIDS IN THE CAR, HAVE TO PULL OVER AND OPEN AND CLOSE THE DOORS AGAIN,  ITS LIKE THEY WONT LATCH ALL THE WAY. NOW THE DRIVER SIDE PASSENGER DOOR MOTOR NEEDS TO BE REPLACED, UNABLE TO OPEN OR CLOSE IT MANUALLY AT THIS TIME, I GET CONSTANT ALERTS THAT THE DOOR IS OPEN WHILE DRIVING, I FEAR THAT IT WILL FLY OPEN AND MY CHILD MIGHT FLY OUT. SINCE I HAVE AT LEAST 5 KIDS IN MY CAR AT ALL TIMES, 2 IN CAR SEATS, NOT MANY PLACES TO SIT THEM OTHER THEN NEXT TO THE DOORS.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/19/2015",
        "dateOfIncident": "06/12/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10726287,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD ISSUES WITH THE MANUAL SLIDING DOORS ON MY SEDONA.  MANY TIMES THE DOORS WILL NOT LATCH AND LOCK SO IT'S VERY FRUSTRATING.  I DO NOT FEEL SAFE WITH MY KIDS IN THE BACK BECAUSE I'M AFRAID THE DOORS ARE NOT LOCKED PROPERLY.  ALSO DURING THE WINTER THE MANUAL SLIDING DOORS ARE FROZEN SHUT AND IT'S BEEN LIKE THAT FROM THE DAY O PURCHASED THE VAN.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/26/2015",
        "dateOfIncident": "03/02/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10721404,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD NUMEROUS PROBLEMS WITH THE PASSENGER DOORS. RECENTLY IN MARCH THE LEFT PASSENGER DOOR CAME OPEN WHILE DRIVING WITH MY 7 YEAR OLD IN THAT SEAT. I HAD TO PULL OVER AND CLOSE THE DOOR BUT IT WOULDN'T STAY LATCHED AND ENDED UP TYING IT WITH A ROPE TO KEEP IT CLOSED. I TOOK IT TO THE DEALER AND CALLED KIA CUSTOMER SERVICE WHO FIXED THE CAR AND PAID FOR IT WITH THEIR GOOD WILL SERVICE. THIS WEEKEND THE SAME THING HAPPENED ON THE RIGHT SIDE PASSENGER DOOR. THIS MORNING I CALLED KIA CUSTOMER SERVICE AND THEY SAID THEY WOULD PAY FOR THE $93 PART BUT I HAD TO PAY FOR THE $300 LABOR CHARGE. I HAVE HAD NUMEROUS PROBLEMS WITH THE ELECTRICAL DOORS NOT SHUTTING IN THE PAST. I HAVE BEEN TOLD THE MOTOR IS TO SMALL FOR THE DOOR. I AM NOW CONCERNED BECAUSE THE DOORS ARE NOT LATCHING AND FLYING OPEN AT ANYTIME. MY CHILDREN'S SAFETY IS AT RISK. WHEN SPEAKING WITH STEVE AT KIA CUSTOMER SERVICE I ASKED TO BE CONTACTED WITH THE REGIONAL MANAGER AND WAS REFUSED. STEVE SPOKE TO THE REGIONAL MANAGER WHO SAID THEY WOULD PAY FOR THE PART BUT NOT THE LABOR AND COULDN'T GIVE ME ANY EXPLANATION AS TO WHY THE DOORS ARE NOT LATCHING AND HE WOULD NOT TAKE MY CALL. I DO NOT WANT TO HAVE TO WORRY ABOUT MY CHILDREN'S SAFETY AND THEY DO NOT FEEL SAFE RIDING IN THE CAR. I JUST WANT THE CAR TO OPERATE IN THE WAY IT IS INTENDED AND NOT HAVE THESE SAFETY ISSUES.",
        "vin": "KNDMB233886"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/05/2015",
        "dateOfIncident": "02/01/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10714618,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SEDONA. THE CONTACT STATED THAT THE DRIVER SIDE SLIDING DOOR DID NOT OPEN ELECTRONICALLY OR MANUALLY. THE VEHICLE WAS TAKEN TO THE DEALER NUMEROUS TIMES. THE DEALER REPLACED THE DOOR MOTOR AND THE SLIDING MECHANISM; HOWEVER, THE FAILURE WAS NOT CORRECTED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 20,800.  UPDATED 09/28/16*LJ    UPDATED 10/12/2017*CN",
        "vin": "KNDMB233586"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/22/2014",
        "dateOfIncident": "12/22/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10667722,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS APPROACHING AN INTERSECTION AND I STARTED TO APPLY THE BRAKES, THE VAN SUDDENLY ACCELERATED, WHEN I PRESSED HARD ON THE BRAKE STILL IT WOULDN'T STOP...CALL KIA SEDONA AUTHORIZED DEALER, THEY SAID THERE'S NO RECALL. AS I RESEARCHED THE INTERNET, I NOTICE THAT CAR GURUS(WHICH IS A CAR FORUM) OVER 33 PEOPLE HAD COMPLAINT WITH THE SAME PROBLEM. THERE WERE AN ACCIDENT WITH FATALITIES EVEN. I'M VERY CONCERN AS I DRIVE WITH ALL MY KIDS SPECIALLY MY GRANDSON OFTEN, AND IT SCARES THE CRAP OUT OF ME TO THINK THAT I WOULD GET INVOLVED IN AN ACCIDENT WITH THE LITTLE ONE ON BOARD. A LOT OF PEOPLE DID THE DIAGNOSTICS THAT THE DEALER SUGGESTED, AFTER PAYING OVER $110 PLUS TAXES, THE CAR IS STILL SHOWING THE SAME PROBLEM. I REALLY NEED SOMEBODY TO TELL ME WHAT AM I SUPPOSED TO DO? I'M STILL PAYING FOR THE VEHICLE, I'M SCARED TO DRIVE IT ANYWHERE SPECIALLY THE HIGHWAY...HELP PLEASE...  *TR",
        "vin": "KNDMB233086"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "12/02/2014",
        "dateOfIncident": "11/03/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10661842,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2008 KIA SEDONA LX AND JUST RECENTLY WE ARE EXPERIENCING ISSUES WITH OPENING THE MANUAL SLIDING DOORS ON BOTH SIDES, ALSO THE LOCKS FAIL TO OPEN MANUALLY AND WITH THE REMOTE CONTROL. THE CONCERN IS THAT IN CASE OF AN EMERGENCY WE MIGHT BE UNABLE TO REMOVE MY 3 DAUGHTERS FROM THE VEHICLE SINCE AGAIN IN MANY OCCASIONS THE DOORS DON'T WORK PROPERLY.   *JS",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/20/2014",
        "dateOfIncident": "10/30/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10659790,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS MINI-VAN HAS MANUAL SLIDING DOORS. SINCE NEWLY BOUGHT, THE SLIDING DOORS HAVE BEEN DIFFICULT TO OPEN AND CLOSE. ONE PROBLEM CORRECTED UNDER WARRANTY ELIMINATED THE WARNING DING WHEN UNDER SPEED INDICATING A SLIDING DOOR WAS AJAR. ANOTHER CORRECTED PROBLEM WAS THE LOOSE DOOR HANDLES CAUSED IN PART B THE AMOUNT OF FORCE PASSENGERS HAD TO USE TO OPEN THE SLIDING DOOR WHEN NOT LOCKED, LIKE IT WAS STUCK SHUT. THE CURRENT PROBLEM IS THE RIGHT (DRIVER) SIDE SLIDING DOOR WILL NOT UNLOCK AT ALL, EITHER THROUGH THE KEY FOB OR BY MANUALLY OPERATING THE INSIDE LEVER TO UNLOCK THE DOOR. AS IT WILL NOT OPEN, IT IS A SERIOUS SAFETY FLAW IN THAT NO ONE INSIDE DURING A CRASH CAN EXIT THROUGH THE DOOR, AND NO ONE OUTSIDE THE MINIVAN CAN OPEN THE DOOR TO FREE A TRAP CHILD ARE INFANT. KIA HAS REPLACED ONE PART WHICH DID NOT FIX THE PROBLEM, AND NOW IS REPLACING AN ELECTRICAL CONTROL BOX.  *TR",
        "vin": "KNDMB233986"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/18/2014",
        "dateOfIncident": "07/01/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10658977,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE PERIODICALLY WON'T START.  THIS IS A SAFETY ISSUE BECAUSE SHOULD THE VEHICLE STALL WHILE DRIVING OR PULLING INTO TRAFFIC AND VEHICLE WON'T RESTART IMMEDIATELY, IT COULD CAUSE A CRASH.  IT IS NOT A STARTER, BATTERY OR OTHER RELATED ISSUE AS FAR AS OUR MECHANIC  CAN DETERMINE.  THERE HAVE BEEN NUMEROUS REPORTS ON LINE BY SEDONA OWNERS AS IT IS APPARENTLY AN INHERENT PROBLEM WITH THE SEDONAS OF VARIOUS YEARS.  PEOPLE HAVE REPORTED THAT STARTERS HAVE BEEN REPLACED IN THEIR VEHICLE AND IT WILL RESOLVE THE PROBLEM FOR A SHORT PERIOD OF TIME ONLY TO RETURN A SHORT TIME LATER.  OTHERS STATE THAT THEIR MECHANICS THINK IT COULD BE RELATED TO THE ANTI-THEFT DEVICE IN THE VEHICLE.  NO ONE SEEMS TO HAVE A SURE FIX FOR THE PROBLEM AND KIA APPARENTLY IS NOT DOING ANYTHING ABOUT IT OR MAKING ANY RECALLS TO FIX THE PROBLEM.  VARIOUS THINGS WILL GET THE CAR TO START SUCH AS LOCKING AND UNLOCKING THE DOORS SEVERAL TIMES, JIGGLING THE GEAR SHIFT AND TURNING THE STEERING WHEEL OR OPENING AND CLOSING THE DOORS.  SOME DAYS IT WILL DO IT ONLY ONCE AND OTHER DAYS IT WILL DO IT SEVERAL TIMES.  *TR",
        "vin": "KNDMB233386"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/11/2014",
        "dateOfIncident": "07/14/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10654148,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2008 KIA SEDONA VAN AND HAVE BEEN HAVING PROBLEMS JUST RECENTLY WITH THE HEAD LIGHT BULBS BURNING OUT. I HAVE HAD TO REPLACE THE DRIVER FRONT HEAD LIGHT BULB TWICE IN THE LAST 4 MONTHS. AFTER JUST REPLACING THE LAST BULB JUST A LITTLE OVER A MONTH AGO, MY DRIVER SIDE BRAKE TAIL LIGHT BULB IS NOW OUT. IS THERE SOMETHING WRONG WITH A CONNECTION IN THE WIRING WITH THESE BULBS? I HAVE NOTICE SEVERAL KIA SEDONA'S ON THE ROAD THAT HAVE BLOWN HEAD LIGHT BULBS. THOSE BULBS ARE NOT CHEAP AND THEY ARE ALSO HARD TO FIND AS WELL. THIS IS A PROBLEM THAT KIA SHOULD BE ADDRESSING.  *TR",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/11/2014",
        "dateOfIncident": "06/15/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10654273,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER SLIDING DOOR REPEATEDLY FAILED TO LATCH CLOSED AND WOULD KEEP OPENING WHEN YOU CLOSED IT. ONCE WE DID GET IT CLOSED THE DOOR OPENED WHILE DRIVING. KIA IS AWARE OF THE DANGEROUS DEFECTIVE DESIGN AND HAS ISSUED A SERVICE BULLETIN AND HAS A REDESIGNED PART AVAILABLE. KIA HAS NOT NOTIFIED CUSTOMERS. KIA WILL REPLACE THE DEFECTIVE LATCH UNDER WARRANTY DURING THE WARRANTY PERIOD BUT CHARGES FOR THE 'REPAIR'  IF THE WARRANTY HAS RUN OUT. KIA REPLACES ONLY THE ONE LATCH THAT HAS ALREADY FAILED NOT BOTH DEFECTIVE LATCHES.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/23/2014",
        "dateOfIncident": "10/22/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10649510,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING IN CONSTRUCTION (55MPH) GOING TO WORK IN MORNING RUSH, THE ESC OFF LIGHT CAME ON AND THERE WAS LOSS OF ACCELERATION.   I TURNED THE EMERGENCY FLASHERS ON AND COASTED TO A STOP, BUT THERE WAS NOWHERE TO GET OFF THE ROAD.  CARS STARTED SWERVING AROUND ME AND ONE CAR ALMOST HIT A DIVIDER WALL.  I SHUT THE ENGINE OFF AND RESTARTED 3 TIMES BEFORE I COULD GET GOING AGAIN. IT HAPPENED TWICE AGAIN WITHIN A 2 MILE DISTANCE ALL IN THE CONSTRUCTION AREA.  RESEARCH SHOWED THE TPS IS DEFECTIVE AND NEEDS REPLACED AND REPROGRAMMED.  THIS IS A DANGEROUS PROBLEM.  SOMEBODY COULD BE KILLED.  *TR",
        "vin": "KNDMB233486"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/16/2014",
        "dateOfIncident": "08/07/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10648134,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING DOWN THE ROAD AND LOST ALL POWER.  WE HAD TO PULL OFF THE SIDE OF THE ROAD, TURN THE VAN OFF AND WAIT A FEW MINUTES.  WHEN WE STARTED IT BACK UP IT RAN OKAY BUT THIS HAPPENED SEVERAL TIMES (DATES UNKNOWN OTHER THEN AUG 7,2014) DRIVING DOWN A BUSY ROAD AND HAVING LOSS OF POWER COULD HAVE BEEN VERY DANGEROUS.  IT IS THE THROTTLE POSITION SENSOR THAT IS CAUSING THIS PROBLEM.  *TR",
        "vin": "KNDMB233286"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/11/2014",
        "dateOfIncident": "10/10/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10644006,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2008 KIA SEDONA.  THE SEDONA HAS/HAD A PROBLEM WITH THE AUTOMATIC OPEN/CLOSE DOOR ELECTRONICS BREAKING.  THE LEFT AUTOMATIC DOOR FUNCTION STOPPED WORKING AND I RECEIVED AN ESTIMATE OF NEARLY $1000 TO REPAIR.  I HAVE DONE RESEARCH AND FOUND THAT THE PROBLEM IS WELL DOCUMENTED.  I DID NOT WORRY ABOUT THE PROBLEM BECAUSE I CAN STILL OPEN THE RIGHT DOOR ELECTRONICALLY.  I HAVE SMALL CHILDREN AND IT IS VERY HARD FOR THEM TO OPEN THE SLIDING DOORS MANUALLY.  IT'S HARD FOR ME TO OPEN THE DOORS MANUALLY.  REGARDLESS, I AM CONCERNED ABOUT MY KIDS NOT BEING ABLE TO EXIT THE VAN FROM THE LEFT DOOR IF THE RIGHT DOOR, FOR WHATEVER REASON, IS NOT AN OPTION.  KIA SHOULD HAVE TAKEN CARE OF THIS SAFETY ISSUE A LONG TIME AGO.    *TR",
        "vin": "KNDMB233286"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/13/2014",
        "dateOfIncident": "10/15/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10632946,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD TO REPLACE HEADLIGHTS & TURN SIGNAL LIGHTS EVERY 3 MONTHS. I HAVE SPENT HUNDREDS OF DOLLARS ON THE LIGHT BULBS REPLACEMENTS ALONE. NOT TO MENTION ALL THE SENSORS I HAVE HAD TO REPLACE. I HAVE SPENT THOUSANDS OF DOLLARS ON THOSE ALONE.  *TR",
        "vin": "KNDMB233786"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/29/2014",
        "dateOfIncident": "07/25/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10617378,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SECOND FAILURE OF TURN SIGNALS ( LOOSE BULBS ) 1ST WAS LEFT, NOW RIGHT. I AM AN ELECTRICIAN SO I FIXED THE PROBLEM. IT WILL RETURN WITH TIME AS WEATHER CHANGES HOT/COLD EFFECT THE COPPER THAT HOLDS THE BULBS IN PLACE.     ALL OLDER CARS USED A SPRING IN THE BOTTOM OF THE SOCKET WHICH MADE CONTACT WITH TIP IN THE CENTER OF THE BULB. KIA HAS USED A FLAT PIECE OF COPPER BENT IN A U OR V SHAPE, THE TENSION WILL NOT KEEP THE BULB STABLE.  A TEMPORARY FIX IS TO BEND THE COPPER UPWARDS TO CREATE TENSION. MY FIX TODAY ON MY KIA WILL BE  TO REPLACE THE SOCKET WITH A NEW SPRING TYPE. 100K MAINTENANCE IS DUE, WE CAN'T WAIT UNTIL THEN BECAUSE WE ARE IN A HEAVY TRAFFIC SITUATION, IT IS JUST TOO DANGEROUS !!!!  [XXX] .       INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6)  *JS",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/17/2014",
        "dateOfIncident": "07/22/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10598971,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WITHIN 18 MONTHS OF OWNING OUR KIA SEDONA, THE AUTOMATIC SLIDING DOORS WERE NOT OPERATING CORRECTLY. THE DOORS WOULD NOT CLOSE, AND WOULD REMAIN OPEN AT ALL TIMES. INCLUDING THE ORIGINAL INCIDENT ON JULY 22, 2010, WE HAVE BROUGHT THE SAME VAN IN A TOTAL OF 6 TIMES FOR INOPERABLE DOORS (DOORS THAT WOULD NOT REMAIN IN THE CLOSED POSITION.) THE DATES ARE AS FOLLOWS: 7/22/10, 9/1/11, 8/1/12, 3/7/13, 8/27/13 AND 6/16/14. WE HAVE HAD LATCHES REPLACED, NEW CONTROL MODULES INSTALLED, NEW DRIVE MOTOR ASSEMBLIES INSTALLED, BUT FEEL THIS IS A VERY SERIOUS SAFETY HAZARD. I HAVE PERFORMED INTERNET SEARCHES FOR SIMILAR INSTANCES, AND I AM CLEARLY NOT ALONE IN THIS REGARD. I HAVE BEEN CHARGED FOR THESE VARIOUS REPAIRS, AND DO NOT BELIEVE THAT A POSSIBLE DEFECT IN ASSEMBLY OR PARTS, WHICH COMPROMISES MY FAMILY'S SAFETY, SHOULD BE MY RESPONSIBILITY.  *TR",
        "vin": "KNDMB233886"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/23/2014",
        "dateOfIncident": "05/23/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10593585,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SECOND TIME IN 3 YEARS I HAVE HAD TO REPLACE THE BRAKE SWITCH ON MY 2008 KIA SEDONA, WHY IS THE RECALL FOR THIS ISSUE ONLY FOR THE 2007 SEDONA?  *TR",
        "vin": "KNDMB233186"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/30/2014",
        "dateOfIncident": "04/30/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10585698,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL- THE CONTACT OWNS A 2008 KIA SEDONA. THE CONTACT STATED THE SPEEDOMETER DOES NOT ACCURATELY LOG MILES AND SPEED. THE VEHICLE REGISTERS 3 MILES HIGHER THEN NORMAL. THE VEHICLE DOOR'S ARE ALSO NOT PROPERLY OPENING AND CLOSING. INTERMITTENTLY THE CONTACT CAN HEAR A LOUD ELECTRICAL GRINDING NOISE COMING FROM BOTH REAR DRIVER AND PASSENGER DOORS. THE CONTACT TOOK HIS VEHICLE TO THE DEALERSHIP FOR DIAGNOSTIC TEST. THE DEALER WAS UNABLE TO PROPERLY REPAIR THE VEHICLE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED.  THE FAILURE MILEAGE WAS 4,000. AZ",
        "vin": "KNDMB233386"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/18/2014",
        "dateOfIncident": "02/01/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10583443,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SLIDING DOORS DO NOT OPEN WHEN CAR IS UNLOCKED, EITHER FROM OUTSIDE OR INSIDE. A RECALL WAS ISSUED AND VEHICLE TAKEN TO DEALER. PROBLEM STILL NOT CORRECTED.  *TR",
        "vin": ""
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "03/22/2014",
        "dateOfIncident": "03/10/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10574157,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AT LEAST 3 TIMES IN THE LAST 2 WEEKS THE DRIVERS SEAT BACK STARTED MOVING TO THE RECLINE POSITION WITH NOT INPUT ON SEAT ADJUSTMENT FROM THE DRIVER.    THIS IS A SCARY SITUATION AS IF YOU ARE LEANING INTO THE SEAT BACK YOU START MOVING TO THE RECLINED POSITION.   TRYING TO STOP THE RECLINE USING THE CONTROL WOULD STOP THE MOVEMENT UNTIL YOU LET UP ON THE SEAT BACK CONTROL.   WE FOUND IF YOU MOVE THE SEAT ADJUSTMENT FOR FORWARD AND BACK (BOTTOM OF SEAT) THE RECLINE STOPPED.  I AM PLANNING ON TAKING CAR TO DEALER BUT THIS IS NOT OCCUR VERY OFTEN.  *TR",
        "vin": "KNDMB233386"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/22/2014",
        "dateOfIncident": "02/20/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10574188,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD THE WIND SHIELD WIPER HEATER ON TO HELP DE-ICE THE WIND SHIELD. APPROXIMATELY 10 MINUTES INTO TRAVEL I SMELLED AN ELECTRICAL BURNING SMELL. I PULLED OVER INTO A GAS STATION AND STARTED TO INSPECT THE CAR, OPENED THE HOOD AND LOOKED AROUND AND THE INSTRUMENT PANELS, FUSES ETC. I DIDN'T FIND ANYTHING. I GOT BACK INTO THE CAR AND I HEARD WHAT SOUNDED LIKE GLASS CRACKING AND HEARD A POPPING NOISE. THERE WAS SMOKE COMING FROM THE LOWER WIND SHIELD. I GOT BACK OUT AND LOOKED AND IT APPEARED THAT THE WIPER HEATER MALFUNCTIONED IN THE WIND SHIELD AND POPPED A HOLE IN THE WIND SHIELD. THERE WAS SCORCHING AROUND THE HOLE THAT WAS BLOWN IN THE WIND SHIELD AND THE WINDSHIELD CONTINUED TO CRACK UP THROUGH THE DRIVERS LINE OF VISION AND ALSO ALL THE WAY ACROSS TO THE PASSENGER SIDE OF THE WINDOW. I CALLED KIA AND ASKED ABOUT WARRANTY BUT THEY SAID THEY WOULD NOT COVER IT EVEN THOUGH THEY HAVE HEARD OF IT HAPPENING BEFORE, I DID FIND OUT THAT ANOTHER MODEL OF THIS SAME MAKE WAS RECALLED FOR THIS SAME THING HAPPENING.  *TR",
        "vin": "KNDMB233086"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/13/2014",
        "dateOfIncident": "02/11/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10564171,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SEDONA. THE CONTACT STATED THAT HE ATTEMPTED TO HAVE THE VEHICLE REPAIRED UNDER NHTSA CAMPAIGN NUMBER: 13V550000 ( SUSPENSION ) BUT WAS INFORMED THAT THE PARTS WERE NOT AVAILABLE. THE CONTACT FELT THAT SINCE THE FAILURE WAS REPORTED NOVEMBER 2013, THERE SHOULD HAVE BEEN A REMEDY AVAILABLE BEFORE FEBRUARY 2014. THE CONTACT STATED THAT THE MANUFACTURER HAD EXCEEDED A REASONABLE TIME FOR REPAIRING A DEFECT.  THE CONTACT HAD NOT EXPERIENCED A FAILURE.   *TR",
        "vin": "KNDMB133676"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/01/2013",
        "dateOfIncident": "12/01/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10554230,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT SIGNAL LIGHT CONNECTORS FAIL TO HOLD BULB IN PLACE CAUSING FOR SIGNAL LIGHTS TO NOT WORK. IT HAS CAUSED SEVERAL CLOSE CALLS WITH MOTORISTS NOT BEING ABLE TO SEE I'M TURNING DUE TO THIS FAULT. TAKES ABOUT AND HOUR TO REMOVE BOTH HEADLIGHTS TO PUSH BULBS BACK TO PLACE AND UNFORTUNATELY, THIS WILL ONLY LAST A DAY TO A WEEK AND THEN REDO ALL THAT WORK. BESIDES THE WORK IT IS REALLY UNSAFE.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/29/2013",
        "dateOfIncident": "10/23/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10550028,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS COMPLAINT IS IN RELATION TO EXISTING COMPLAINT AT NHTSA. MY 2008 KIA SEDONA (STILL UNDER WARRANTY SINCE PURCHASED IN JANUARY 2009) CONTINUES TO HAVE AN ISSUE WITH THE DRIVER SIDE SLIDING DOOR OPENING AND CLOSING. KIA SERVICE DEPARTMENT HAS BEEN VERY DILIGENT IN ATTEMPTING TO FIX THE ISSUE ON THREE SEPARATE OCCASIONS. THE FIRST OCCASION, THE SERVICE DEPARTMENT COULD NOT REPLICATE THE ISSUE. I WENT TO PICK THE VEHICLE UP AND RIGHT AWAY WAS ABLE TO SHOW THE SERVICE CENTER THE ISSUE. THEY WITNESSED THE ISSUE AND ORDERED A REPLACEMENT PART OF WHICH KIA OF FREDERICKSBURG REPLACED. APPROXIMATELY 1 MONTH LATER, THE SAME ISSUE WITH THE SAME DOOR SURFACED AGAIN. THIS SECOND TIME THE DEALERSHIP KEPT THE VEHICLE FOR ONE WEEK  (MONDAY ' FRIDAY, 9/23-9/27/2013) AND REPLACED TWO MORE PARTS ON THE DOOR. THE ISSUE STILL REMAINS AFTER THREE COMPONENT REPLACEMENTS/REPAIRS.  APPROXIMATELY 1 MONTH AFTER THE SECOND VISIT, THE DRIVER SIDE SLIDING DOOR STARTED EXPERIENCING THE SAME OPENING/CLOSING ISSUE HOWEVER A NEW ISSUE SURFACED. THE DRIVER SIDE SLIDING DOOR CAME AJAR TWICE WHILE THE VEHICLE WAS IN MOTION (WITH PWR ON IN OVERHEAD CONSOLE) AND CAME AJAR ONCE WHILE THE VEHICLE WAS IN MOTION (WITHOUT PWR ON IN OVERHEAD CONSOLE). THIS IS A HUGE SAFETY ISSUE AS THE SLIDING DOOR SHOULD NOT OPEN AT ALL WHILE THE VEHICLE IS IN MOTION AND ESPECIALLY AFTER THE DOOR HAS LATCHED SUCCESSFULLY AFTER CLOSING. ALL THREE TIMES THE DOOR WAS MANUALLY SHUT AND ENGAGED. THE VEHICLE WAS LAST SEEN ON 10/29/13 AND THE SERVICE DEPARTMENT IS UNABLE TO REPLICATE THE ISSUE ALTHOUGH A MAJOR ISSUE STILL REMAINS AS THE DRIVER SIDE SLIDING DOOR OPENS WHILE IN MOTION AND HAS ISSUES OPENING AND CLOSING AFTER 3 REPAIRS. I CANNOT AFFORD TO CONTINUE BRINGING THE VEHICLE BACK AND FORTH FOR SEVERAL ECONOMICAL AND PERSONAL REASONS. SIMPLY PUT, THE DOOR NEEDS TO BE 100% OPERATIONAL AND SAFE. REQUEST KIA RESOLVE THE ISSUE.  *TR",
        "vin": "KNDMB233186"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/29/2013",
        "dateOfIncident": "07/23/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10550026,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2008 KIA SEDONA (STILL UNDER WARRANTY SINCE PURCHASED IN JANUARY 2009) CONTINUES TO HAVE AN ISSUE WITH THE DRIVER SIDE SLIDING DOOR OPENING AND CLOSING. SOMETIMES THE DOOR WOULD NOT OPEN/CLOSE ENTIRELY, WOULD STOP AS IT OPEN/CLOSES, OR WILL NOT OPEN AT ALL ELECTRONICALLY, ONLY MANUALLY. KIA SERVICE DEPARTMENT HAS BEEN VERY DILIGENT IN ATTEMPTING TO FIX THE ISSUE ON TWO SEPARATE OCCASIONS. THE FIRST OCCASION, THE SERVICE DEPARTMENT COULD NOT REPLICATE THE ISSUE. I WENT TO PICK THE VEHICLE UP AND RIGHT AWAY WAS ABLE TO SHOW THE SERVICE DEPARTMENT THE ISSUE. THEY WITNESSED THE ISSUE AND ORDERED A REPLACEMENT PART OF WHICH DEALERSHIP REPLACED. APPROXIMATELY 1 MONTH LATER, THE SAME ISSUE WITH THE SAME DOOR SURFACED AGAIN. THIS  SECOND TIME THE DEALERSHIP KEPT THE VEHICLE FOR ONE WEEK  (MONDAY ' FRIDAY, 9/23-9/27/2013) AND REPLACED TWO MORE PARTS ON THE DOOR. THE ISSUE STILL REMAINS AFTER THREE COMPONENT REPLACEMENTS/REPAIRS. FURTHERMORE, THE INSIDE WALL/CASING FROM PREVIOUS WORK ON THE DRIVER SLIDING DOOR IS NOW COMING APART AND NEEDS TO BE FIXED. ADDITIONALLY, THE PASSENGER SLIDING DOOR SHOWED ONE SYMPTOM OF THE SAME ISSUE AS THE DRIVER SLIDING DOOR WITH OPENING AND CLOSING AS WELL AS VERY DIFFICULT TO OPEN WHEN THE PWR IS TURNED OFF IN THE OVERHEAD CONSOLE (MORE DIFFICULT THAN USUAL). THEREFORE THERE IS CONCERN THE PASSENGER SLIDING DOOR IS GOING TO START EXPERIENCING THE SAME ISSUE AS THE DRIVER SLIDING DOOR. I HAVE CONTACTED KIA CUSTOMER ASSISTANCE CENTER REQUESTING KIA FIX THE ISSUE TO 100% OPERATIONAL AND WARRANTY THE WORK/PARTS PAST THE ORIGINAL VEHICLE WARRANTY PERIOD AT NO COST TO ME. THIS ISSUE IS NOT ISOLATED AS THE NATIONAL HIGHWAY TRAFFIC SAFETY ADMINISTRATION (NHTSA) ' HTTP://WWW.SAFERCAR.GOV HAS RECORD OF AT LEAST 7 CASES FOR KIA SEDONA 2008 VEHICLES EXPERIENCING IDENTICAL OR SIMILAR ISSUES WITH SLIDING DOORS JUST LIKE MY VEHICLE.  *TR",
        "vin": "KNDMB233186"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,EQUIPMENT ADAPTIVE/MOBILITY",
        "crash": false,
        "dateComplaintFiled": "10/19/2013",
        "dateOfIncident": "10/18/2013",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10548512,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I REPLACED A BLOWN 10 AMP FUSE ON A DEALER INSTALLED TRAILER WIRING HARNESS ADAPTER.  15-20 MINUTES LATER I  NOTICED A FIRE COMING FROM DRIVER'S SIDE REAR LIGHT ASSEMBLY.  REMOVED FUSE, REMOVED LIGHTING ASSEMBLY, PUT OUT FIRE. IN LOOKING AT DAMAGE, TRAILER HARNESS ADAPTER WAS MELTED ALONG WITH SEVERAL WIRES ATTACHED TO IT.  FOAM BUMPER PADDING CAUGHT FIRE AND WAS MELTED.  NO VISIBLE BODY DAMAGE.  *TR",
        "vin": "KNDMB233986"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/18/2013",
        "dateOfIncident": "10/08/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10548486,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE HOOD POPPED OPEN ON THE HIGHWAY (50MPH) CAUSING IT TO SWING BACK AND BREAK THE WINDSHIELD. DURING THIS TIME THE DRIVER'S VIEW (MY WIFE) WAS COMPLETELY OBSTRUCTED UNTIL SHE WAS ABLE TO BRING THE CAR TO A STOP ON THE MIDDLE LANE. I CANNOT UNDERSTAND WHY THE SECONDARY SAFETY HOOK DID NOT ENGAGE PREVENTING THE HOOD FROM VIOLENTLY FLYING OPEN. THE CAR IS 5 YEARS OLD WITH 29000 MILES AND HAS NEVER BEEN IN AN ACCIDENT. JUST 2 WEEKS BEFORE THE INCIDENT, IT HAD BEEN SERVICED BY KIA FOR A MANDATORY RECALL OF THE REAR DOOR. LUCKILY NO ONE WAS HURT.    ON A SIDE NOTE, IF ALL OTHER DOORS IN MOST OF TODAY'S CARS HAVE A WARNING LIGHT TO INDICATE THEY ARE OPEN, WHY NOT HAVE A SIMILAR LIGHT FOR THE HOOD?    THANKS  *TR",
        "vin": "KNDMB233686"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/13/2013",
        "dateOfIncident": "08/13/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10535089,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ESC LIGHT ON.  LOST ALL POWER AND CHECK ENGINE LIGHT CAME ON.  DROVE TO DEALERSHIP AT 8 MPH WITH HAZARDS ON.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/30/2013",
        "dateOfIncident": "01/27/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10532691,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT A NEW 2008 SEDONA. 2 YEARS LATER NOTICED RADIO, RIGHT FRONT TURN SIGNAL AND AC POWER OUTLET WERE NOT WORKING. TOOK IT INTO THE DEALERSHIP AND THEY REPLACED A BLOWN FUSE. 18 MONTHS LATER RIGHT FRONT TURN SIGNAL IS OUT AGAIN AND TOOK IT TO THE DEALERSHIP.THEY FIXED IT BY BENDING A METAL PIECE IN THE PLUG TO MAKE MORE CONTACT WITH THE BULB. 2 1/2  WEEKS LATER, I HAVE MY 3 KIDS IN THE CAR AND MY ACCELERATOR LOSES ALL POWER AND THE ESC LIGHT COMES ON AS WELL AS THE CHECK ENGINE LIGHT. I WAS ABLE TO COAST IT OVER TO THE SHOULDER, TURNED THE CAR OFF AND WAITED A FEW MINUTES. TURNED THE CAR BACK ON AND PRESSED THE ACCELERATOR AND WAS ABLE TO DRIVE IT HOME. THE CHECK ENGINE LIGHT IS STILL ON AND I CAN'T GET AN APPOINTMENT WITH THE DEALERSHIP FOR 2 WEEKS!!!   *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/20/2013",
        "dateOfIncident": "06/22/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10525911,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FIRST TIME THIS INCIDENT HAPPENED, I WAS DRIVING MY 2008 KIA SEDONA VAN ON A LEVEL STREET AT APPROXIMATELY 30MPH.  THE VAN STARTED ACCELERATING AT A FAST SPEED AND THE BRAKES WOULD NOT WORK.  FORTUNATELY, THERE WERE NO CARS COMING THE OTHER WAY AND NO PEOPLE OUT WALKING.  I WAS NOT ABLE TO STOP AT THE STOP SIGN AND I PUT ON MY EMERGENCY BRAKE AND TURNED OFF THE VAN.   THE SECOND INCIDENT OCCURRED WHILE I WAS DRIVING UP A HILL.  THE VAN STARTED ACCELERATING AND I WAS NOT ABLE TO USE MY BRAKES.  THIS TIME I PUT THE VAN IN NEUTRAL AND WAS ABLE TO REGAIN CONTROL OF THE VAN.  I TOOK THE VAN TO MY MECHANIC AND THEY DID NOT FIND ANY PROBLEM WITH THE BRAKES OR ANYTHING ELSE.  MY FRIEND ALSO EXPERIENCED A SIMILAR INCIDENT WITH HER NEWER MODEL KIA SEDONA AND USES MY SAME MECHANIC AND FOUND NOTHING WRONG.  HER INCIDENT HAPPENED BEFORE MY FIRST EPISODE IN JUNE.  TODAY, I WAS DRIVING MY DAUGHTER TO WORK AND THE SAME THING HAPPENED AS I WAS DRIVING UP A SLIGHT ELEVATED STREET.  I WAS NOT ABLE TO USE THE BRAKES AND SHIFTED INTO NEUTRAL.  I WAS ABLE TO SLOW THE ENGINE AND GET HER TO WORK.  I HAVE FIVE CHILDREN AND I HAVE HAD AT LEAST ONE OF THEM WITH ME WHEN EACH OF THESE INCIDENCES HAS OCCURRED.  I CALLED THE KIA DEALER TODAY AND THEY TOLD ME TO CALL MONDAY.  THIS IS A VERY SCARY SITUATION AND I FEAR SERIOUS INJURY MAY OCCUR.  I WAS ON RESIDENTIAL STREETS WHEN ALL THREE EPISODES OCCURRED AND DID NOT HAVE MY CRUISE CONTROL ON AS NOTED FROM OTHER KIA OWNERS WHO HAVE EXPERIENCED THIS ON THE HIGHWAY.  *TR",
        "vin": "KNDMB233686"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/15/2013",
        "dateOfIncident": "07/14/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10524799,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SEDONA. THAT CONTACT STATED  WHILE DRIVING THE DRIVERS SIDE SLIDING DOOR OPENED AND THE WARNING LIGHT ILLUMINATED. THE DOOR WOULD NOT CLOSE AFTER THE FAILURE OCCURRED. THE VEHICLE WAS NOT TAKEN TO THE DEALER FOR DIAGNOSTIC TESTING. THE VIN WAS NOT AVAILABLE. THE FAILURE AND CURRENT MILEAGE WAS 89,000.   *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/09/2013",
        "dateOfIncident": "05/05/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10523994,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "IT STARTED WITH THE FUSES FOR THE POWER PLUG IN THE FRONT BLEW SEVERAL TIMES AND HAD TO BE REPLACED. ABOUT 2 MONTHS AFTER THAT THE TURN SIGNAL BULB KEPT GOING OUT ON THE PASSENGER SIDE, WE THOUGHT AT FIRST THAT THE BULB KEPT BLOWING OUT. THIS KEPT HAPPENING EVERY COUPLE OF MONTHS UNTIL ABOUT 10 MONTHS AGO NOW EVERY COUPLE OF WEEKS THE BULB BLOWS AGAIN AND WE HAVE TO KEEP BUYING BULBS AND PAYING TO HAVE THEM REPLACED. ONE OF THE PEOPLE WHO INSPECTED OUR CAR THIS MONTH WAS GOING TO REPLACE ANOTHER BULB BUT HE TOLD US THAT AS SOON AS HE TOUCHED THE BULB IT STARTED WORKING AGAIN. THAT THERE MUST BE A SHORT OF SOME KIND BUT HE PASSED THE INSPECTION SINCE THE BULB WORKED NOW. AFTER THAT WE KEPT NOTICING THAT EVERY TIME WE WENT OUT AND IT STARTED TO GET DARK WE DIDN'T HAVE OUR HEADLIGHTS ON, WE DIDN'T THINK ANYTHING ABOUT IT THE FIRST TIME BECAUSE IT WAS RIGHT AFTER THE INSPECTION AND ASSUMED THE INSPECTOR HAD TURNED THEM OFF. BUT IT HAS KEPT HAPPENING IT HAS NOW HAPPENED AT LEAST 5 DIFFERENT TIMES AND I KNOW I DIDN'T CUT THEM OFF AND I AM THE ONLY ONE DRIVING THE CAR. I HAVE ALSO IN THE LAST 6 MONTHS HAD THE MOTOR TO THE FLUID DISPENSER FOR THE  WINDSHIELD WIPERS STOP WORKING IT WORKED ONE DAY AND THE NEXT I PUSHED THE BUTTON TO CLEAN THE WINDSHIELD AND NOTHING HAPPENED.  I HAVE SEEN DOZENS OF COMPLAINTS ONLINE ABOUT PEOPLE HAVING THE SAME PROBLEMS AND WORSE WITH THEIR KIA SEDONAS KIA NEEDS TO FIX ALL OF THESE PROBLEMS OR REPLACE THE CARS.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/08/2013",
        "dateOfIncident": "06/25/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10523654,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WENT WITH MY FAMILY TO DINNER AND VEHICLE WORKED FINE AS USUAL. WHEN WE GOT BACK INTO THE VEHICLE AFTER DINNER AND I STARTED IT, I NOTICED THE AIRBAG LIGHT ON, THE A/C WAS ON FULL BLAST AND INTERIOR LIGHTS STOPPED WORKING. TURNED VEHICLE OFF, WAITED A MINUTE AND TRIED AGAIN WITH SAME RESULTS. WENT HOME, DISCONNECTED THE BATTERY TERMINALS, WAITED A COUPLE OF MINUTES AND RECONNECTED THEM AND STILL THE PROBLEM. HAVE LOOKED ON THE INTERNET AND NOTICED OTHER OWNERS WITH SAME PROBLEM AND NO SOLUTION.  *TR",
        "vin": "KNDMB233X86"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/08/2013",
        "dateOfIncident": "07/06/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10523830,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Kumho Tire Co., Inc.",
                "productMake": "KUMHO",
                "productModel": "SOLUS KH16",
                "productYear": "9999",
                "size": "P225/70R16",
                "type": "Tire"
            }
        ],
        "summary": "REAR PASSENGER TIRE BLOW OUT.  REMAINING THREE TIRES FOUND TO HAVE BULGES AND AT RISK FOR BLOW OUT. ONLY 14000 MILES ON VEHICLE AND TIRES. TOOK VEHICLE TO KIA DEALER WHO SAID TIRES WERE BAD BECAUSE OF AGE AND NOT COVERED BY WARRANTY. HAD TO PURCHASE FOUR NEW REPLACEMENT TIRES.  *TR",
        "vin": "KNDMB233X86"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/25/2013",
        "dateOfIncident": "10/04/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10521769,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTOMATIC SLIDING DOORS ON BOTH THE DRIVER AND PASSENGER SIDE DO NOT WORK PROPERLY.  AT TIMES THEY DO NOT OPEN USING THE BACK SEAT BUTTON AND/OR USING THE CONSOLE BUTTON.  AT OTHER TIMES THE DOORS DO NOT LOCK INTO PLACE AND CAUSED THE OPEN DOOR ALARM TO SOUND.  IN ADDITION, THE PLASTIC CASING ON THE WIRES IN THE DOOR CRACKED AND THE WIRES WERE DAMAGED DURING NORMAL OPENING/CLOSING OF THE DOORS.  BOTH THE WIRING AND THE CASING HAD TO BE REPLACED ON BOTH DOORS WITH NO COVERAGE BY KIA.  *TR",
        "vin": "KNDMB233386"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/21/2013",
        "dateOfIncident": "04/21/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10521010,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SEDONA. THE CONTACT STATED WHILE DRIVING APPROXIMATELY 65 MPH THE VEHICLE WOULD NOT ACCELERATE. THE FAILURE OCCURRED INTERMITTENTLY AT DIFFERENT SPEEDS AND THE CHECK ENGINE LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC FOR DIAGNOSTIC TESTING. THE MECHANIC STATED THE ENGINE THROTTLE POSITION SENSOR HAD TO BE REPLACED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 75,000.   *TR",
        "vin": "KNDMB233386"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/09/2012",
        "dateOfIncident": "05/01/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10479382,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SEDONA. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, THE SLIDING DOORS WOULD OPEN INDEPENDENTLY. THE VEHICLE WAS TAKEN TO THE DEALER WHO DIAGNOSE THAT THE DOOR POWER MOTORS NEEDED TO BE REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE WHO DID NOT OFFER ANY ASSISTANCE. THE VEHICLE WAS NOT REPAIRED. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 68,000 AND THE CURRENT MILEAGE WAS 80,000.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/25/2012",
        "dateOfIncident": "07/15/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10467700,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE POWER SLIDING DOOR ON THIS VEHICLE HAS FAILED TO OPERATE, THUS SLAMMING SHUT AND ALMOST CRUSHING MY DAUGHTERS HAND IN THE DOOR. THIS CAR HAS BEEN BROUGHT TO THE DEALERSHIP TO BE FIXED AT LEAST 7 TIMES, AND IT STILL FAILS TO OPERATE AS IT SHOULD. THEY CLAIMED TO HAVE FIXED IT, BUT THE PROBLEM CONTINUES. NOW I AM OUT OF WARRANTY AND BASICALLY STUCK WITH THIS ISSUE.  *TR",
        "vin": "KNDMB233486"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "07/16/2012",
        "dateOfIncident": "07/02/2012",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10465810,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2008 KIA SEDONA. THE CONTACT STATED THAT THE DRIVER WAS DRIVING 30 MPH WHEN THE VEHICLE CAUGHT ON FIRE. THE VEHICLE WAS DESTROYED AND TOWED TO AN INSURANCE LOT. THE FIRE DEPARTMENT APPEARED ON THE SCENE AND STATED THAT THE FIRE ORIGINATED AT THE BLOWER MOTOR. THE CONTACT STATED THAT THE BLOWER WAS NOT ACTIVATED AT THE TIME OF THE FAILURE. THE MANUFACTURER WAS NOTIFIED AND THE CONTACT WAS AWAITING A RESPONSE. THE FAILURE MILEAGE WAS 70,050. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/19/2012",
        "dateOfIncident": "06/11/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10462231,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TRAVELING AT 70 MPH, CRUISE CONTROL ON, THE CAR DECELERATED RAPIDLY AND LOST ABILITY TO ACCELERATE.  CHECK ENGINE LIGHT ILLUMINATED. WAS ABLE TO PULL OFF TO SHOULDER. CAR WAS SHUT OFF AND RESTARTED, ACCELERATOR STARTED TO WORK BUT CHECK ENGINE LIGHT REMAINED ON.  AFTER DRIVING ANOTHER 50 MILES THE SAME THING HAPPENED. THIS IS NOT THE FIRST TIME IT HAS OCCURRED, ON THIS OCCASION WE WERE ABLE TO SAFELY PULL OVER.  ON ONE OCCASION WE WERE IN KANSAS CITY RUSH HOUR TRAFFIC IN THE CENTER LANE, CARS BEHIND US CAME TO A SCREECHING STOP TO AVOID HITTING US. VERY SCARY SITUATION!  AFTER THE CAR IS SHUT OFF AND SITS FOR A FEW HOURS THE CHECK ENGINE LIGHT TURNS OFF WHEN STARTED.  WITH NO CHECK ENGINE LIGHT THERE IS NO ERROR CODE TO DIAGNOSE THE PROBLEM.  THIS IS A PROBLEM THAT NEEDS TO BE ADDRESSED BY KIA.  I HAVE READ ARTICLES THAT STATE THIS WAS A PROBLEM ON PREVIOUS MODEL YEARS AND THEY WERE RECALLED.      *JS",
        "vin": ""
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "06/12/2012",
        "dateOfIncident": "06/01/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10461527,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 KIA SEDONA. CONSUMER STATES PASSENGER SLIDING DOOR OPENED WHILE DRIVING *TGW  THE CONSUMER STATED SHE WAS UNABLE TO CLOSE THE DOOR, SO THE DOOR HAD TO BE STRAPPED AND AN ADULT HELD ONTO THE DOOR TIGHTLY UNTIL THEY REACHED THEIR DESTINATION. THE DEALER INFORMED THE CONSUMER SHE WOULD BE RESPONSIBLE FOR THE REPAIR. LATER ON, THE DEALER INFORMED HER A SERVICE BULLETIN ON THE SLIDING DOOR AND LATCH HAD BEEN ISSUED AND THE VEHICLE WOULD BE REPAIRED FREE OF CHARGE. THE SERVICE BULLETIN IDENTIFIED THE CAUSE OF THE SLIDING DOOR PROBLEM AS IMPROPERLY MAINTAINED LATCHES.  ACCORDING TO KIA, ACCUMULATED ROAD DIRT MAY CAUSE THE LATCHES TO STICK BY IMPEDING ROTATION OF THE LATCH AROUND THE PIN. KIA OFFERED CONSUMERS WHO HAD EXPERIENCED THE PROBLEM A MODIFIED DOOR LATCH KIT THAT PERMITS ROAD DIRT TO READILY EXIT THE LATCH ASSEMBLY TO REMOVE THE CAUSE OF THE DOOR FAILURE. THE CONSUMER STATED SHE WAS NEVER NOTIFIED ABOUT THE PROBLEM. THE CONSUMER HAS SINCE LEARNED, THE TECHNICAL SERVICE BULLETIN SPECIFIED THAT THE SERVICE ACTION WAS A REPAIR PROGRAM, WITHOUT CUSTOMER NOTIFICATION, AND THE REPAIRS WERE TO BE PERFORMED FREE OF CHARGE DURING THE WARRANTY PERIOD.  *JB",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/10/2012",
        "dateOfIncident": "06/07/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10461139,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED A 2008 KIA SEDONA USED WITH A 3YR 36K EXTENDED WARRANTY.  ON THE WAY HOME I TESTED TO SEE IF THE CIG LIGHTER WORKED IN THE DASH.  THE AIR BAG LIGHT ILLUMINATED, AND THE INTERIOR LIGHTS NO LONGER WORK. ALSO THE A/C FAN IN THE CABIN IS NOW STUCK ON HIGH WHEN IN USE.  THIS IS AN ANNOYANCE HOWEVER THE MAJOR CONCERN IS THE AIR BAGS WILL NOW NOT FUNCTION.  AFTER EXTENSIVE ONLINE RESEARCH THIS IS MORE THAN A COMMON OCCURRENCE.  KIA SHOULD BE FORCED TO RECALL EVERY ELECTRICALLY FAULTY VEHICLE THEY PUT OUT.  THE ELECTRICAL PROBLEMS WHICH ARE NUMEROUS ALWAYS SEEM TO DISABLE THE AIR BAGS AND CAUSE OTHER ISSUES.  THIS IS NOT SAFE AND IS A HAZARD TO THE PUBLIC.  *TR",
        "vin": "KNDMB233886"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "06/06/2012",
        "dateOfIncident": "06/03/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10460773,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SEDONA. THE CONTACT STATED THAT THE SLIDING DOORS WOULD NOT LOCK PROPERLY AND WOULD POP OPEN WITHOUT WARNING WHETHER THE VEHICLE WAS IN MOTION OR NOT. THE VEHICLE WAS NOT TAKEN TO THE DEALER FOR INSPECTION OR REPAIR. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS UNKNOWN, BUT THE CURRENT MILEAGE WAS 47,000.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/29/2012",
        "dateOfIncident": "05/25/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10459962,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TRAVELING AT 70 MPH, CRUISE CONTROL ON, \"ESC OFF\" LIGHT AND CHECK ENGINE LIGHT ILLUMINATED ON THE DASHBOARD AND THE VEHICLE DECELERATED RAPIDLY.  LOST ABILITY TO ACCELERATE PAST 20 MPH.  VEHICLE WAS STOPPED AND RESTARTED.  ACCELERATOR RESUMED WORKING FOR ABOUT 50 MILES AND THE SAME THINGS HAPPENED AGAIN: ESC OFF LIGHT AND CHECK ENGINE LIGHT ILLUMINATED AND VEHICLE RAPIDLY DECELERATED AND LOST ALL ACCELERATION ABILITY THIS TIME.  STOPPED VEHICLE AGAIN AND RESTARTED AND ACCELERATOR RESUMED WORKING.  THIS HAPPENED AT AROUND 2AM.  IN THE MORNING THE CHECK ENGINE LIGHT REMAINED ON AND THE VEHICLE WAS TAKEN TO A KIA DEALER.  ON THE WAY TO THE DEALER THE \"ESC\" LIGHT BEGAN BLINKING (NOTE: THIS IS NOT THE SAME AS THE ESC OFF LIGHT), THE ACCELERATION SPUTTERED, BUT REMAINED WORKING.  THE DEALER STATED THAT THEY RETRIEVED THE THROTTLE POSITION SENSOR CODES, BUT THEY CLEARED THE COMPUTER HISTORY AND COULD NO LONGER DUPLICATE THE PROBLEM AND THEREFORE IT COULD NOT BE FIXED.  THEY RETRIEVED THE CODES, CLEARED THE MEMORY AND WANT TO SEND ME ON MY WAY.  THIS IS THE SECOND TIME A KIA DEALER HAS CLEARED THE COMPUTER MEMORY AND THE VEHICLE WAS NOT FIXED.  I WAS TOLD, BY MY LOCAL DEALER TO MAKE SURE THE DEALER DOES NOT CLEAR THE CODES/HISTORY OR IT CAN NOT BE FIXED.   I HAVE CALLED KIA CONSUMER AFFAIRS AND AM AWAITING A RESPONSE.  *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/16/2012",
        "dateOfIncident": "05/04/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10458721,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING ON THE OPEN HIGHWAY AT A HIGH RATE OF SPEED, THE VEHICLE RAPIDLY DECELERATED AND LOST ABILITY TO MAINTAIN ACCELERATION, AS IF IN IDLE BUT WITHOUT RPMS.  THE CRUISE CONTROL WAS ON AT THE TIME.  THE CHECK ENGINE LIGHT AND THE ESC OFF LIGHT ILLUMINATED ON THE DASHBOARD.  ONCE THE VEHICLE WAS STOPPED AND RESTARTED IT WAS DRIVABLE TO THE NEAREST KIA DEALER.  THE CHECK ENGINE LIGHT STAYED ON.  THE DEALER (WHO WAS CLOSING FOR THE WEEKEND AND 200 MILES AWAY FROM HOME) RAN A DIAGNOSTIC SCAN WHICH INDICATED THAT THE THROTTLE POSITION SENSOR NEEDED REPLACEMENT AND AN ECM SOFTWARE UPGRADE WAS NEEDED.  HE THEN CLEARED THE COMPUTER AND SENT US ON OUR WAY, TELLING US WE SHOULD BE ABLE TO MAKE IT HOME, BUT STATED IT WAS IMPERITIVE IT GET FIXED.  HE STATED THAT WHEN IT HAPPENED AGAIN TO STOP AND RESTART THE VEHICLE.      ONCE HOME, THE DEALER SAID HE COULD DO NOTHING TO REPAIR THE VEHICLE BECAUSE THE COMPUTER WAS NO LONGER REGISTERING A PROBLEM AND THE CHECK ENGINE LIGHT WAS NOT ON.  I CALLED BACK TO THE DEALER THAT ORIGINALLY DIAGNOSED THE VEHICLE AND HE CONCURRED THAT WITHOUT A CURRENT CODE/CHECK ENGINE LIGHT ON, THE VEHICLE COULD NOT BE FIXED (HE WAS THE MANAGER!).   SO NOW I AM TOLD TO WAIT FOR IT TO HAPPEN AGAIN AND COME IN IMMEDIATELY.  THIS IS THE SECOND TIME THE CHECK ENGINE LIGHT HAS COME ON AND THE DEALER WAS UNABLE TO DIAGNOSE THE PROBLEM BECAUSE IT WAS OFF WHEN TAKEN IN.    THE RAPID DECELERATION WAS A VERY DANGEROUS SITUATION AS THERE WERE MANY SEMI-TRUCKS ON THE OPEN HIGHWAY AND THEY CAN NOT STOP/SLOW DOWN QUICKLY.  ONE BLASTED HIS HORN AND WAS BARELY ABLE TO MOVE OVER IN TIME AS WE TRIED TO COAST TO A SAFE AREA ON THE SIDE OF THE ROAD!  SCARY, WITH 2 CHILDREN IN THE VEHICLE AND COMPLETELY HELPLESS TO DO ANYTHING TO QUCKLY GET TO SAFETY.",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "03/02/2012",
        "dateOfIncident": "01/31/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10450109,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SEDONA. WHILE TRAVELING 30 MPH, THE CONTACT ACTIVATED THE WINDSHIELD WIPERS AND RUINING FOR 15-30 SECONDS, THE WINDSHIELD WIPERS SUDDENLY STOPPED FUNCTIONING WITHOUT WARNING. THE VEHICLE WAS TAKEN TO THE DEALER TWICE WHERE THE WINDSHIELD WIPERS WERE REALIGNED HOWEVER, THE FAILURE CONTINUED TO RECUR. THE CURRENT MILEAGE WAS 53,000 AND THE FAILURE MILEAGE WAS 51,000.",
        "vin": "KNDMB233976"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/23/2011",
        "dateOfIncident": "12/21/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10441086,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAD TO REPLACE SOME SENSORS AROUND 40,000 MILES AND NOW AGAIN AT 60,000 MILES THE SAME PROBLEM,...THE ESC LIGHT COMES ON STAYS ON AND THE ENGINE LOSES POWER.....  *TR    THE NEXT TIME YOU START IT UP IT MAY BE FINE FOR THAT WHOLE TRIP...THE NEXT DAY THE PROBLEM IS BACK....",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "07/20/2011",
        "dateOfIncident": "07/19/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10413681,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING FROM THE BABYSITTER TO MY HOUSE ON 07/19/2011 MY CAR SHUT DOWN WHILE I WAS TURNING IN A BUSY INTERSECTION.  I WAS ALONE WITH MY KIDS IN THE MIDDLE OF THE ROAD WHILE CARS TRY TO GO AROUND ME AFTER 3 MINUTES MY CAR TURNED BACK ON WHEN I GOT HOME MY STEREO SHUT DOWN AND ENGINE STARTED MAKING NOSE. I CALLED THE DEALER SPOKE TO A SALES PERSON WHO WANTED ME TO COME IN FOR A TRADE IN, SPOKE TO JEFF FROM THE SERVICE DEPARTMENT AND HE WILL CALL ME BACK TO SCHEDULE AN APPOINTMENT TO COME IN.   THIS IS NOT THE FIST TIME I HAD A PROBLEM WITH THE VAN STEREO IT'S BEEN CHANGED BEFORE, DOOR HANDLES AND OTHER MISCELLANIES WORK HAVE BEEN DONE, THE GRIP FROM THE BACK DOOR IS COMING OFF.  *KB",
        "vin": "KNDMB233286"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "05/17/2011",
        "dateOfIncident": "05/02/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10401890,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 KIA SEDONA. CONSUMER REQUESTS REIMBURSEMENT FOR DAMAGES STATING WHILE DRIVING THE HOOD FLEW UP BLINDING THE DRIVER'S VIEW.  *TGW  THE HOOD LATCH WAS REPLACED. *JB",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/18/2011",
        "dateOfIncident": "04/09/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10396702,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SEDONA. THE CONTACT WAS DRIVING APPROXIMATELY 5-10 MPH AND EXITING A PARKING LOT WHEN THE VEHICLE FAILED TO RESPOND TO ACCELERATION ATTEMPTS.  THE ELECTRONIC STABILITY CONTROL WARNING LIGHT WAS ILLUMINATED AND THE VEHICLE WAS SHUT OFF. ONCE RESTARTED, THE CHECK ENGINE WARNING LIGHT WAS ILLUMINATED. THE FAILURE RECURRED FIVE TIMES AND THE VEHICLE WAS TAKEN TO THE DEALER BUT THE DEALER WAS UNABLE TO DUPLICATE THE FAILURE. THE MANUFACTURER WAS NOT CONTACTED AND THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 38,382 AND THE CURRENT MILEAGE WAS 38,482.",
        "vin": "KNDMB233886"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/16/2011",
        "dateOfIncident": "04/12/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10396082,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "GOING UPHILL TOWARD TRAFFIC LIGHT, ACCELERATING TO MAINTAIN SPEED FOR CROSSING INTERSECTION,  CHECK ENGINE LIGHT ON, ESC LIGHT ON, ENGINE SUDDENLY IDLING CAUSING TOTAL LOSS OF POWER NEAR THE INTERSECTION. HAD ENOUGH MOMENTUM TO PULL ON THE GRASS SHOULDER.  DIAGNOSTIC FROM GARAGE: THROTTLE SENSOR STUCK.  EXTREMELY DANGEROUS SITUATION.  *TR",
        "vin": "KNDMB233286"
    },
    {
        "components": "VEHICLE SPEED CONTROL,EQUIPMENT,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/11/2011",
        "dateOfIncident": "04/10/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10395535,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "AUTOMATIC EQUIP. MFG. CO.",
                "productMake": "UNKNOWN",
                "productModel": "AUTOMATIC",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "2 MONTHS WHILE DECELERATING AT RED LIGHT, ACCELERATION OCCURRED WHILE PRESSING BRAKE PEDAL, STOPPED WITHIN A FRACTION OF AN INCH FROM CAR IN FRONT OF ME. LAST NIGHT WHILE DRIVING 70MPH ON HWY ESC AND CHECK ENGINE LIGHTS CAME ON AND LOST ALL ACCELERATION FUNCTION. CAR STAYED IDLING BUT COULD NOT REGAIN ACCELERATION. HAD TO CROSS OVER 4 LANES OF TRAFFIC TO GET TO AN OFFRAMP EXIT. WAS ABLE TO PULL OVER TO SMALL SHOULDER AND HAD MYSELF AND 6 CHILDREN STANDING ON HIGHWAY WHILE WAITING FOR ROADSIDE ASSISTANCE. THE EXIT WAS FOR ANOTHER HWY SO WE HAD NO SAFE PLACE TO STAND BUT ALONG THE GUARDRAIL OF 2 HWYS. WAS TOLD TO CALL A TAXI AND WOULD BE REIMBURSED. NOW KIA MOTORS IS TELLING ME THAT SINCE I PURCHASED A FLEET VEHICLE I AM NOT COVERED UNDER A WARRANTY BECAUSE IT IS AT 70000. PURCHASED AS CERTIFIED REOWNED AND WAS TOLD IT WOULD BE COVERED FOR 10 YEARS 10,000 MILES. SAME PROBLEM WAS RECALLED ON THE 06 AND 07 MODELS BUT HAS NOT BEEN CORRECTED FOR 08 MODEL. WE ALL COULD HAVE BEEN KILLED!!! DEALER WAS NOT EVEN ABLE TO LOOK AT IT YET AND SAID THEY WON'T UNTIL TOMORROW SO HERE I AM ON THE SECOND DAY WITHOUT TRANSPORTATION AND DO NOT KNOW WHAT IT IS GOING TO TAKE TO BE FIXED. INTERNET SEARCHES AND COMPLAINT SEARCH ON THIS SITE REVEAL COMPLAINTS OF THE SAME NATURE TO NUMEROUS TO COUNT.  *TR",
        "vin": "KNDMB233086"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/01/2011",
        "dateOfIncident": "01/28/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10379869,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 KIA SEDONA HEADLIGHTS KEEP BURNING OUT EVERY 2-4 WEEKS.  I HAVE TRIED DIFFERENT RETAIL STORES TO PURCHASE FROM BUT DOES NOT MATTER. *LN",
        "vin": "KNDMB233186"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/19/2011",
        "dateOfIncident": "01/19/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10377139,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DOORS FREEZE SHUT. CAN NOT OPEN THEM WHEN IT IS COLD OUT SIDE. DEALER HAS NOT BEEN ABLE TO FIX THE PROBLEM. *TR",
        "vin": "KNDMB133886"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/29/2010",
        "dateOfIncident": "10/24/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10368835,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "1) FEW TIMES ON DIFFERENT OCCASIONS LOST ACCELERATION PEDAL (SORT) NO RPM RESPONSE, ONLY IDLES , . INCIDENTS RECORDED ON \"KIA BLACK BOX SO FAR FOUR (4) TIME .. NO ANY EXPLANATION,REPAIRS OR WHAT TO DO WITH REPEATABLE PROBLEMS FROM KIA SERVICE ..2) VERY LATELY WHILE DRIVING IN TRAFFIC AT SPEED APPROXIMATELY 40 MPH ALL SUDDENLY CAR COMPLETELY SHOT DOWN WITH LOOSING STEERING  POWER, BRAKES OTHERWISE CAR TOTALLY DISABLED .. ALL LIGHTS ON DASHBOARD \"ON\" .... AGAIN KIA SERVICE DIDN'T DETECT (PROBABLY BOX NOT  PROGRAMMED FOR THAT EVENT) .. PROBLEMS NOT DIAGNOSED, NO ANY REPAIRS, REPLACEMENTS (COMPUTER CHIPS?) .. CAR NOT SAFE FOR DRIVING ON PUBLIC ROADS CONSIDERING 1) MY SAFETY AND 2) PUBLIC SAFETY ON HIGHWAYS ... DESPITE PROMISES KIA..SERVICE IS CONTACTING ME OR PROVIDING EVALUATION .... I AM AFRAID TO USE THAT CAR SAFELY ... I WAS APPROACHED BY MAN WHO HAD SIMILAR PROBLEMS ON KIA OPTIMA AND ALSO WAS LEFT WITHOUT ANSWER ... UPDATED 01/20/11 *BF",
        "vin": "KNDMB233986"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "10/04/2010",
        "dateOfIncident": "11/07/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10359099,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SEDONA. THE CONTACT STATED THAT THE DRIVER AND PASSENGER SEATS WOULD MOVE BACK AND FORTH INDEPENDENTLY WHETHER THE VEHICLE WAS ACCELERATING OR AT A STOP. THE CONTACT STATED THAT THE SEATS WOULD NOT LOCK INTO PLACE AND THE VEHICLE WAS TAKEN TO THE DEALER FOR FURTHER INSPECTION. THE DEALER REPLACED THE LOCKING MECHANISM ON THE DRIVER SIDE SEAT, WHICH WORKED FOR ONE MONTH BUT THE PASSENGER SIDE SEAT WAS NOT REPAIRED. THE MANUFACTURER STATED THAT AN INSPECTOR TESTED THE VEHICLE AND DETERMINED THE SEATS SHOULD BE MOVING AND WAS NORMAL FOR THE VEHICLE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 19,000.",
        "vin": "KNDMB233086"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM,LATCHES/LOCKS/LINKAGES,TIRES",
        "crash": false,
        "dateComplaintFiled": "09/28/2010",
        "dateOfIncident": "09/28/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10358151,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "IN 18 MONTHS MY 2008 KIA SEDONA HAS  CONTINUOUS ELECTRICAL PROBLEMS, WITH THIS COMPLAINT FOCUSING ON THE FACT MY VEHICLE HAS BLOWN THE 200 AMP MAIN FUSE 4 TIMES IN 18 MONTHS, INCLUDING WHILE DRIVING THE VEHICLE 2 OF THE 4 TIMES, CAUSING COMPLETE LOSS OF POWER AND A SAFETY ISSUE AS BOTH TIMES IT HAPPEN WHILE HIGHWAY DRIVING, WITH THE DEALER NOT BEING TO DETERMINE THE CAUSE OF THE PROBLEM EACH AND EVERY TIME.  THEY REPLACE THE FUSE, RUN TESTS, AND GIVE THE CAR BACK, AT WHICH POINT ANYWHERE FROM 10 DAYS TO 6 MONTHS THE FUSE BLOWS AGAIN.  NOTE THIS SAME VEHICLE WAS IN AND OUT OF THE DEALER REPAIR FOR A CHECK ENGINE LIGHT THEY WERE UNABLE TO TURN OFF FOR MORE THAN 48 HOURS AT A TIME (COMPUTER RESET) FOR 9 MONTHS WHICH I SUED UNDER LEMON LAW FOR. *TR",
        "vin": "KNDMB233486"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/21/2010",
        "dateOfIncident": "02/18/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10356762,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 KIA SEDONA. THE CONTACT STATED WHILE DRIVING APPROXIMATELY 35 MPH, THE ENGINE STALLED. THE VEHICLE COULD NOT BE RESTARTED AND IT HAD TO BE TOWED TO THE DEALER WHO STATED THAT THE ENGINE REMOTE START DEVICE HAD A \"BAD CONNECTION\". THE VEHICLE WAS DIAGNOSED BY THE DEALER EIGHT TIMES FOR THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 18.  THE CURRENT MILEAGE WAS 19,100.",
        "vin": "KNDMB233586"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/20/2010",
        "dateOfIncident": "09/17/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10356559,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 KIA SEDONA 47000 MILES.  LOSS OF ACCELERATION AND CHECK ENGINE AND ESC LIGHT COME ON.  VAN COAST TO A STOP AND AFTER I SHUT OFF THE IGNITION IT CRANKS BACK UP AND IS FINE BUT IT DOES THIS ALOT. *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/03/2010",
        "dateOfIncident": "06/27/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10353801,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 KIA SEDONA. WHILE TRAVELING 55 MPH THE CONTACT NOTICED THAT THE VEHICLE HAD SUDDENLY ACCELERATED WITHOUT WARNING CAUSING THE CONTACT TO APPLY THE BRAKES IN ORDER TO STOP THE VEHICLE. THE VEHICLE HAS NOT BEEN DIAGNOSED AND THERE WERE NO PRIOR WARNINGS. THE CURRENT MILEAGE IS 18000 AND THE FAILURE MILEAGE WAS 17000. UPDATED 01/11/2011*LJ  UPDATED 12/22/10*JB  THE CONSUMER STATED THE VEHICLE SUDDENLY BEGAN TO ACCELERATE AND THE VEHICLE WOULD NOT STOP UNTIL THE BRAKES WERE FORCEFULLY APPLIED.  THE CRUISE CONTROL WAS NOT ACTIVATED.  ALSO, THE POWER DOORS STOPPED WORKING. UPDATED 04/12/11",
        "vin": "KNDMB233886"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/23/2010",
        "dateOfIncident": "08/21/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10351210,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 70 MPH DOWN FREEWAY KIA SUDDENLY LOST POWER AND WOULD NOT ACCELERATE HAD TO MANEUVER ACROSS 6 LANES OF TRAFFIC TO GET TO SHOULDER. ONCE I TURNED VAN OFF AND RESTARTED, I COULD ONCE AGAIN ACCELERATE. THE FAILURE OCCURRED 3 MORE TIMES WITHIN A 5 MILE STRETCH. FINALLY MADE IT TO A GAS STATION WHERE WE CALLED FOR ROADSIDE ASSISTANCE, I HAD 3 BABIES IN CARSEATS IN VAN AT TIME OF FAILURE THIS COULD HAVE BEEN A HUGE TRAGEDY IF TRAFFIC WAS ANY WORSE THAN IT WAS. VAN IS AT DEALER NOW WAITING FOR SERVICE. *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, OTHER,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/02/2010",
        "dateOfIncident": "06/13/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10346726,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ACCELERATION FAILURE GAS PEDAL UN-RESPONSIVE HAS OCCURRED ON MULTIPLE OCCASIONS OVER THE PAST FEW MONTHS.  MILEAGE AT ONSET APPROX. 28,000, CURRENT MILEAGE 37,000.   1- FIRST OCCURRENCE JUNE 13TH 2010 TRAVELING ON FREEWAY WHEN LOSS OF ACCELERATION CAUSED VEHICLE TO BECOME DANGEROUS AS NAVIGATION OFF THE HIGHWAY WAS RELIANT ON DRIFTING TO SHOULDER WITH NO POWER; ONCE OFF THE ROAD TURNING OFF AND RESTARTING THE ENGINE CAUSED THE GAS PEDAL TO REENGAGE - HOWEVER DURING THE 4 HOUR TRIP THE ISSUE REPEATED 7 TIMES WITH THE MOST DANGEROUS OCCURRENCE IN AN AREA OF CONSTRUCTION WHERE NO SHOULDER WAS AVAILABLE TO PULL OFF.  AS THIS ISSUE OCCURRED ON A SUNDAY, TAKING THE VEHICLE IN FOR SERVICE WAS NOT AN OPTION UNTIL MONDAY, AND DURING THE WAITING PERIOD THE CHECK ENGINE LIGHT WAS NO LONGER ILLUMINATED AND THEREFORE THE CODE FOR INVESTIGATION UNAVAILABLE.  2-ISSUE OCCURRED AGAIN ON SATURDAY, JULY 30, 2010 WHILE TRAVELING ON THE HIGHWAY AFTER ONE HOUR OF TRAVEL AND REPEATED EVERY 10-15 MILES; ON THIS DATE TURNING OFF AND RESTARTING THE ENGINE MULTIPLE TIMES WAS REQUIRED TO REGAIN GAS PEDAL CONTROL. SERIOUS SAFETY ISSUE WHEN THE LOSS OF POWER WAS EXPERIENCED WHILE PASSING TRAFFIC AND NAVIGATION OFF THE ROAD FROM THE PASSING LANE REQUIRED RETURNING TO THE RIGHT LANE IN HIGH TRAFFIC WITH NO ABILITY TO ADJUST SPEED.  ON THE 2.5 HOUR RETURN COMMUTE THE ISSUE DID NOT RESURFACE.    3- THE ISSUE AGAIN REPEATED ON SUNDAY, AUGUST 1, 2010 WHILE TRAVELING ON ARTERIAL ROADS, DURING THE 45 MINUTE COMMUTE THE ISSUE REPEATED 3 TIMES AT VARYING SPEEDS FROM 45 - 60 MPH.  YOUNG AUTOMOTIVE GROUP IN LANSING WAS CONTACTED FIRST THING THIS MORNING AND THE VEHICLE IS SCHEDULED FOR NEXT AVAILABLE SERVICE ON TUESDAY, AUGUST 3RD, 2010. *TR",
        "vin": "KNDMB233186"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/22/2010",
        "dateOfIncident": "04/01/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10340019,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "LTR FWD FM (VA) US NAVY PERSONNEL SERVING OVERSEAS IN ITALY HAVING DIFFICULTIES GETTING THE THROTTLE POSITION SENSOR ON A 2008 KIA SEDONA LX REPAIRED DUE TO THE SCREW HOLES AND PLUG OF REPLACEMENT NOT LINING UP, REPLY TO CHESAPEAKE , VA *TGW  THE CONSUMER STATED WHILE DRIVING, SHE WOULD LOOSE THROTTLE POWER.  SHE APPLIED THE ACCELERATOR, BUT NOTHING HAPPENED.  THE VEHICLE WOULD JUST CONTINUE TO SLOW DOWN, UNTIL SHE HAD NO CHOICE, BUT TO PULL OVER.  THE CONSUMER WAS INFORMED THE THROTTLE POSITION SENSOR WAS DEFECTIVE AND IT NEEDED TO BE REPLACED WITH AN UPGRADED MODEL.  THE PART WAS ORDERED, AND ARRIVED AT THE DEALER. HOWEVER, IT WAS SOON DISCOVERED THE SCREW HOLES AND PLUG TO THE ENGINE DID NOT LINE UP WITH THE PREVIOUS TPS. THERE WAS NO WAY TO ATTACH THE NEW PART TO THE VEHICLE. *JB",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/14/2010",
        "dateOfIncident": "06/14/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10336330,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON INTERSTATE W/ CRUISE CONTROL ON, DRIVER TAPPED \"ACCEL\" TO INCREASE SPEED BY A MILE OR TWO PER HOUR.  A SUDDEN ACCELERATION OCCURRED CAUSING PASSENGERS TO BE \"PUSHED\" BACKWARD IN SEATS.  BRAKING HARD ENDED THE INCIDENT.  CRUISE CONTROL WAS TURNED OFF AND NOT USED AGAIN.  *TR",
        "vin": "KNDMB233786"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/14/2010",
        "dateOfIncident": "06/14/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10336332,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "2ND OF 2 INCIDENTS IN 2 DAYS!  NEXT DAY WHILE TURNING SHARPLY TO PARK IN A PARKING SPOT (APPROX. 120-140 DEGREE ANGLE) THE CAR SUDDENLY ACCELERATED AS DRIVER STRAIGHTENED OUT WHEEL TO CONTINUE FORWARD INTO PARKING SPOT.  STRONG AND QUICK SLAMMING ON OF BRAKES STOPPED VEHICLE JUST BEFORE HITTING CAR IN SPACE IN FRONT OF THE ONE WHERE CAR WAS BEING PARKED.  KIA DEALER WAS CALLED, REFERRED TO ROADSIDE ASSISTANCE AND CAR TOWED TO DEALER TO INSPECT FOR PROBLEM.  DRIVER REFUSED TO DRIVE THE VEHICLE.  *TR",
        "vin": "KNDMB233786"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/13/2010",
        "dateOfIncident": "05/08/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10330245,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SEDONA. WHILE DRIVING AT 55 MPH, THE CHECK ENGINE LIGHT ILLUMINATED THE VEHICLE BEGAN TO LOSE POWER. THE ENGINE DID NOT SHUT OFF AND THE CONTACT WAS ABLE TO PULL OVER ON THE SIDE OF THE ROAD, SHUT THE VEHICLE OFF AND RE-START. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALERSHIP WHERE THE THROTTLE POSITION SENSOR WAS REPLACED. HOWEVER THE FAILURE CONTINUED. THE FAILURE AND THE CURRENT MILEAGES WERE APPROXIMATELY 28,000.",
        "vin": "KNDMB233286"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/25/2010",
        "dateOfIncident": "03/19/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10321917,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 KIA SEDONA. THE CONTACT WAS DRIVING 70 MPH ON THE HIGHWAY. WHEN THE ACCELERATOR PEDAL WAS ENGAGED THERE WAS NO RESPONSE. SINCE THE ENGINE REMAINED ON THE CONTACT WAS ABLE TO DRIVE THE VEHICLE TO THE EMERGENCY LANE. THE VEHICLE WAS ABLE TO RESUME IN OPERATION. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHO STATED THAT THE FAILURE WAS CONTRIBUTED TO THE ACCELERATOR PEDAL POSITION (AAP) SENSOR. THE VEHICLE WAS REPAIRED. THE FAILURE MILEAGE WAS 29,800. THE CURRENT MILEAGE WAS 31,000.  UPDATED 05/11/10> *LJ   UPDATED 06/03/10*BF  UPDATED 06/07/10*JB",
        "vin": "KNDMB133786"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/25/2010",
        "dateOfIncident": "08/14/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10322114,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WOULD LOSE POWER TO A CRAWL, THEN IF YOU LET IT SIT FOR 10 MINUTES IT WOULD REGAIN SOME POWER BY FLOORING IT TO A MAX SPEED OF 35-40 MPH",
        "vin": "KNDMB233886"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "03/23/2010",
        "dateOfIncident": "03/19/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10321509,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STALLLED WITH OUT WARNING AT 60 MPH, THROTTLE POSITION SENSOR FAILED. THIS IS THE SECOND ONE IN OUR FLEET OF 4 2008 KIA SEDONA'S. SEARCHING THE INTERNET, AND TALKING TO THE DEALER THIS IS A HUGE PROBLEM.  I REQUESTED KIA REPLACE THIS PART ON THE OTHER TWO 2008 SEDONA'S, THEY SAID NOT UNTIL IT THROWS A CODE.  WE ALSO HAVE 2 2010 SEDONA'S, I DO NOT KNOW IF THEY HAVE REDESIGNED THE PART.  FOR THE 2008, THIS IS A 50% FAILURE RATE AND A SAFETY HAZARD STALLING AT ANY SPEED IS A SAFETY HAZARD.",
        "vin": "KNDMB133086"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/17/2010",
        "dateOfIncident": "10/13/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10320529,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SEDONA. THE VEHICLE WOULD SPORADICALLY ACCELERATE WITHOUT DRIVER INTENT. WHEN THE FAILURE WOULD OCCUR, THE VEHICLE WOULD FEEL SIMILAR TO ACTIVATING THE CRUISE CONTROL MECHANISM BUT WOULD NOT RESPOND TO THE CONTACT ENGAGING THE BRAKES. THE VEHICLE WAS TAKEN TO THE DEALER ON THREE SEPARATE OCCASIONS; HOWEVER, THE DEALER COULD NOT DUPLICATE THE FAILURE. NO REPAIRS WERE MADE TO THE VEHICLE. THE FAILURE MILEAGE WAS 14,534 AND THE CURRENT MILEAGE WAS 15,000.  UPDATED 04/22/10  *BF  UPDATED 05/06/10",
        "vin": "KNDMB233886"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/12/2010",
        "dateOfIncident": "02/23/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10319288,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DEFECTIVE THROTTLE POSITION SENSOR CAUSES THE KIA SEDONA VAN TO SUDDENLY AND UNEXPECTEDLY STOP WITH NO THROTTLE CONTROL.  FAILURE RATE IN OUR FLEET HAS BEEN OVER 50%.    THAT IS RIGHT, 50%!!!   SEE PAST SAFETY COMPLAINTS, WITH VIN#'S TO EXPEDITE KIA VERIFICATION. *TR",
        "vin": "KNDMB233286"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/12/2010",
        "dateOfIncident": "03/01/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10319289,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DEFECTIVE THROTTLE POSITION SENSOR CAUSES THE KIA SEDONA VAN TO SUDDENLY AND UNEXPECTEDLY STOP WITH NO THROTTLE CONTROL.  FAILURE RATE IN OUR FLEET HAS BEEN OVER 50%.    THAT IS RIGHT, 50%!!!   SEE PAST SAFETY COMPLAINTS, WITH VIN#'S TO EXPEDITE KIA VERIFICATION. *TR",
        "vin": "KNDMB233486"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/12/2010",
        "dateOfIncident": "02/28/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10319292,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DEFECTIVE THROTTLE POSITION SENSOR CAUSES THE KIA SEDONA VAN TO SUDDENLY AND UNEXPECTEDLY STOP WITH NO THROTTLE CONTROL.  FAILURE RATE IN OUR FLEET HAS BEEN OVER 50%.    THAT IS RIGHT, 50%!!!   SEE PAST SAFETY COMPLAINTS, WITH VIN#'S TO EXPEDITE KIA VERIFICATION. *TR",
        "vin": "KNDMB233986"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/12/2010",
        "dateOfIncident": "03/09/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10319293,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DEFECTIVE THROTTLE POSITION SENSOR CAUSES THE KIA SEDONA VAN TO SUDDENLY AND UNEXPECTEDLY STOP WITH NO THROTTLE CONTROL.  FAILURE RATE IN OUR FLEET HAS BEEN OVER 50%.    THAT IS RIGHT, 50%!!!   SEE PAST SAFETY COMPLAINTS, WITH VIN#'S TO EXPEDITE KIA VERIFICATION.  NOTE: FAILED MULTIPLE TIMES W/ 5 MONTH OLD GRANDSON ON BOARD. *TR",
        "vin": "KNDMB233086"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,PARKING BRAKE",
        "crash": false,
        "dateComplaintFiled": "03/09/2010",
        "dateOfIncident": "04/15/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10318306,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "ON A 2008 KIA SEDONA MY FRONT BRAKE DISC HAVE BEEN REPLACED 2 TIMES IN LESS THAN 12 MONTHS DUE TO WARPING OF THE DISC. MY KIA NOW HAS 6,000 MILES ON IT WHICH IS ABOUT AVERAGE FOR MY DRIVING AS I AM RETIRED. IN ADDITION THE PARKING BRAKE HAS BEEN ADJUSTED 3 TIMES SINCE I HAVE HAD THE CAR. IT WILL NOT PREVENT THE MINIVAN FROM ROLLING BACKWARDS IN MY DRIVEWAY. *TR",
        "vin": "KNDMB233686"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/03/2010",
        "dateOfIncident": "10/19/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10316367,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2008 KIA SEDONA ACCELERATE UNEXPECTEDLY. IT HAS DONE THIS SEVERAL TIMES STARTING IN OCT 2009. I CAN BE DRIVING ALONG AND IT WILL SUDDENLY ACCELERATE ON ITS OWN. IF YOU APPLY THE BRAKE IT TAKES A GREAT DEAL OF FORCE TO GET THE VEHICLE STOPPED, IF YOU'RE LUCKY. THIS HAS HAPPENED SEVERAL TIMES. *TR",
        "vin": "KNDMB233886"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/22/2010",
        "dateOfIncident": "02/16/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10312615,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT HAS A 2008 KIA SEDONA. THE CONTACT STATED THAT THE SLIDING DOORS CONTINUE TO CLOSE EVEN IF PERSON IS IN THE WAY OR IF THEIR HAND IS IN THE WAY. THE CONTACT STATED THAT THE DOOR CONTINUED TO CLOSE AND SMASHED THE FINGER OF ONE OF THE PASSENGERS. THE VEHICLE WAS PARKED AT THE TIME. THE DEALER STATED THAT THERE IS NO STANDARD FEATURE FOR A SENSOR ON THE SLIDING DOOR OF THE KIA VEHICLES. THE FAILURE MILEAGE WAS38000 THE CURRENT MILEAGE WAS 38128. THE VIN NUMBER WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/10/2010",
        "dateOfIncident": "12/28/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10308483,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DEFECTIVE THROTTLE POSITION SENSOR.    SUDDENLY AND UNEXPECTEDLY THE VAN GOES TO IDLE AND THERE IS NO THROTTLE CONTROL.   DEALERSHIP WILL NOT REPAIR UNLESS IT GOES BAD, EVEN THOUGH THIS IS ONE OF MANY THAT HAVE ALREADY PROVEN TO BE DEFECTIVE.  WE HAVE 40 OF THESE MODELS IN OUR FLEET, WITH 20 OF THEM FAILED WHILE BEING DRIVEN.  THAT IS A 50% DEFECTIVE RATE!!  THESE VEHICLES SHOULD BE RECALLED TO PROTECT THE CUSTOMER FROM POSSIBLE LIFE THREADING SITUATION.   ESPECIALLY, SINCE THIS IS A SUDDEN UNEXPECTED OCCURRENCE THAT CAN ONLY HAPPEN WHILE DRIVING, AND THE MANUFACTURER HAS DENIED ACCOUNTABILITY TO PREEMPTIVELY FIX THESE VEHICLES. *TR",
        "vin": "KNDMB233286"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/10/2010",
        "dateOfIncident": "12/08/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10308469,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING DOWN THE FREEWAY.  2009 KIA SEDONA STOPS.  SOMEBODY IS GOING TO BE SERIOUSLY INJURED IF A SEDONA SUDDENLY STOPS ON THE FREEWAY AND IS HIT FROM BEHIND BY A VEHICLE TRAVELING 70 MPH!  THERE IS A SERIOUS SAFETY CONCERN WITH THESE VANS.  *TR",
        "vin": "KNDMB233686"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/10/2010",
        "dateOfIncident": "12/10/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10308479,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DEFECTIVE THROTTLE POSITION SENSOR.    SUDDENLY AND UNEXPECTEDLY THE VAN GOES TO IDLE AND THERE IS NO THROTTLE CONTROL.   DEALERSHIP WILL NOT REPAIR UNLESS IT GOES BAD, EVEN THOUGH THIS IS ONE OF MANY THAT HAVE ALREADY PROVEN TO BE DEFECTIVE.  WE HAVE 40 OF THESE MODELS IN OUR FLEET, WITH 20 OF THEM FAILED WHILE BEING DRIVEN.  THAT IS A 50% DEFECTIVE RATE!!  THESE VEHICLES SHOULD BE RECALLED TO PROTECT THE CUSTOMER FROM POSSIBLE LIFE THREADING SITUATION.   ESPECIALLY, SINCE THIS IS A SUDDEN UNEXPECTED OCCURRENCE THAT CAN ONLY HAPPEN WHILE DRIVING, AND THE MANUFACTURER HAS DENIED ACCOUNTABILITY TO PREEMPTIVELY FIX THESE VEHICLES. *TR",
        "vin": "KNDMB233386"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/10/2010",
        "dateOfIncident": "12/24/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10308486,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DEFECTIVE THROTTLE POSITION SENSOR.    SUDDENLY AND UNEXPECTEDLY THE VAN GOES TO IDLE AND THERE IS NO THROTTLE CONTROL.   DEALERSHIP WILL NOT REPAIR UNLESS IT GOES BAD, EVEN THOUGH THIS IS ONE OF MANY THAT HAVE ALREADY PROVEN TO BE DEFECTIVE.  WE HAVE 40 OF THESE MODELS IN OUR FLEET, WITH 20 OF THEM FAILED WHILE BEING DRIVEN.  THAT IS A 50% DEFECTIVE RATE!!  THESE VEHICLES SHOULD BE RECALLED TO PROTECT THE CUSTOMER FROM POSSIBLE LIFE THREADING SITUATION.   ESPECIALLY, SINCE THIS IS A SUDDEN UNEXPECTED OCCURRENCE THAT CAN ONLY HAPPEN WHILE DRIVING, AND THE MANUFACTURER HAS DENIED ACCOUNTABILITY TO PREEMPTIVELY FIX THESE VEHICLES. *TR",
        "vin": "KNDMB233486"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/10/2010",
        "dateOfIncident": "12/04/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10308488,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DEFECTIVE THROTTLE POSITION SENSOR.    SUDDENLY AND UNEXPECTEDLY THE VAN GOES TO IDLE AND THERE IS NO THROTTLE CONTROL.   DEALERSHIP WILL NOT REPAIR UNLESS IT GOES BAD, EVEN THOUGH THIS IS ONE OF MANY THAT HAVE ALREADY PROVEN TO BE DEFECTIVE.  WE HAVE 40 OF THESE MODELS IN OUR FLEET, WITH 20 OF THEM FAILED WHILE BEING DRIVEN.  THAT IS A 50% DEFECTIVE RATE!!  THESE VEHICLES SHOULD BE RECALLED TO PROTECT THE CUSTOMER FROM POSSIBLE LIFE THREADING SITUATION.   ESPECIALLY, SINCE THIS IS A SUDDEN UNEXPECTED OCCURRENCE THAT CAN ONLY HAPPEN WHILE DRIVING, AND THE MANUFACTURER HAS DENIED ACCOUNTABILITY TO PREEMPTIVELY FIX THESE VEHICLES. *TR",
        "vin": "KNDMB233186"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/10/2010",
        "dateOfIncident": "11/02/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10308491,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DEFECTIVE THROTTLE POSITION SENSOR.    SUDDENLY AND UNEXPECTEDLY THE VAN GOES TO IDLE AND THERE IS NO THROTTLE CONTROL.   DEALERSHIP WILL NOT REPAIR UNLESS IT GOES BAD, EVEN THOUGH THIS IS ONE OF MANY THAT HAVE ALREADY PROVEN TO BE DEFECTIVE.  WE HAVE 40 OF THESE MODELS IN OUR FLEET, WITH 20 OF THEM FAILED WHILE BEING DRIVEN.  THAT IS A 50% DEFECTIVE RATE!!  THESE VEHICLES SHOULD BE RECALLED TO PROTECT THE CUSTOMER FROM POSSIBLE LIFE THREADING SITUATION.   ESPECIALLY, SINCE THIS IS A SUDDEN UNEXPECTED OCCURRENCE THAT CAN ONLY HAPPEN WHILE DRIVING, AND THE MANUFACTURER HAS DENIED ACCOUNTABILITY TO PREEMPTIVELY FIX THESE VEHICLES. *TR",
        "vin": "KNDMB233086"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/10/2010",
        "dateOfIncident": "10/28/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10308492,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DEFECTIVE THROTTLE POSITION SENSOR.    SUDDENLY AND UNEXPECTEDLY THE VAN GOES TO IDLE AND THERE IS NO THROTTLE CONTROL.   DEALERSHIP WILL NOT REPAIR UNLESS IT GOES BAD, EVEN THOUGH THIS IS ONE OF MANY THAT HAVE ALREADY PROVEN TO BE DEFECTIVE.  WE HAVE 40 OF THESE MODELS IN OUR FLEET, WITH 20 OF THEM FAILED WHILE BEING DRIVEN.  THAT IS A 50% DEFECTIVE RATE!!  THESE VEHICLES SHOULD BE RECALLED TO PROTECT THE CUSTOMER FROM POSSIBLE LIFE THREADING SITUATION.   ESPECIALLY, SINCE THIS IS A SUDDEN UNEXPECTED OCCURRENCE THAT CAN ONLY HAPPEN WHILE DRIVING, AND THE MANUFACTURER HAS DENIED ACCOUNTABILITY TO PREEMPTIVELY FIX THESE VEHICLES. *TR",
        "vin": "KNDMB233286"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/10/2010",
        "dateOfIncident": "12/15/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10308554,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DEFECTIVE THROTTLE POSITION SENSOR CAUSES THE SEDONA VAN TO SUDDENLY AND UNEXPECTEDLY STOP WITH NO THROTTLE CONTROL.  THIS IS A KNOWN DEFECT WITH THE MANUFACTURER, HOWEVER, THEY WILL NOT REPAIR UNTIL THE SENSOR FAILS.  THIS IS UNACCEPTABLE, CONSIDERING THAT THERE IS NO WARNING SIGNS, AND THE CAR HAS TO BE IN MOTION AT TIME OF FAILURE.  THIS COULD RESULT IN DEATH OR SERIOUS INJURY SHOULD THE FAILURE OCCUR AT HIGH SPEEDS OR IF IN A DRIVING SITUATION THAT REQUIRE ACCELERATOR.  IF TOYOTA WAS FORCED TO RECALL CARS BECAUSE OF A SLOW, PROGRESSIVE, WEARING OF THE THROTTLE CONTROL, THEN THE NHTSA SHOULD CLASSIFIED THIS DEFECT AS AN EVEN MORE SERIOUS THREAT TO CUSTOMER SAFETY.  OUT OF 40 VEHICLES IN OUR FLEET, 20 HAVE FAILED.  THIS IS A 50% FAILURE RATE.  *TR",
        "vin": "KNDMB233686"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/10/2010",
        "dateOfIncident": "01/18/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10308557,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DEFECTIVE THROTTLE POSITION SENSOR CAUSES THE SEDONA VAN TO SUDDENLY AND UNEXPECTEDLY STOP WITH NO THROTTLE CONTROL.  THIS IS A KNOWN DEFECT WITH THE MANUFACTURER, HOWEVER, THEY WILL NOT REPAIR UNTIL THE SENSOR FAILS.  THIS IS UNACCEPTABLE, CONSIDERING THAT THERE IS NO WARNING SIGNS, AND THE CAR HAS TO BE IN MOTION AT TIME OF FAILURE.  THIS COULD RESULT IN DEATH OR SERIOUS INJURY SHOULD THE FAILURE OCCUR AT HIGH SPEEDS OR IF IN A DRIVING SITUATION THAT REQUIRE ACCELERATOR.  IF TOYOTA WAS FORCED TO RECALL CARS BECAUSE OF A SLOW, PROGRESSIVE, WEARING OF THE THROTTLE CONTROL, THEN THE NHTSA SHOULD CLASSIFIED THIS DEFECT AS AN EVEN MORE SERIOUS THREAT TO CUSTOMER SAFETY.  OUT OF 40 VEHICLES IN OUR FLEET, 20 HAVE FAILED.  THIS IS A 50% FAILURE RATE.  *TR",
        "vin": "KNDMB233486"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/10/2010",
        "dateOfIncident": "12/15/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10308552,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DEFECTIVE THROTTLE POSITION SENSOR CAUSES THE SEDONA VAN TO SUDDENLY AND UNEXPECTEDLY STOP WITH NO THROTTLE CONTROL.  THIS IS A KNOWN DEFECT WITH THE MANUFACTURER, HOWEVER, THEY WILL NOT REPAIR UNTIL THE SENSOR FAILS.  THIS IS UNACCEPTABLE, CONSIDERING THAT THERE IS NO WARNING SIGNS, AND THE CAR HAS TO BE IN MOTION AT TIME OF FAILURE.  THIS COULD RESULT IN DEATH OR SERIOUS INJURY SHOULD THE FAILURE OCCUR AT HIGH SPEEDS OR IF IN A DRIVING SITUATION THAT REQUIRE ACCELERATOR.  IF TOYOTA WAS FORCED TO RECALL CARS BECAUSE OF A SLOW, PROGRESSIVE, WEARING OF THE THROTTLE CONTROL, THEN THE NHTSA SHOULD CLASSIFIED THIS DEFECT AS AN EVEN MORE SERIOUS THREAT TO CUSTOMER SAFETY.  OUT OF 40 VEHICLES IN OUR FLEET, 20 HAVE FAILED.  THIS IS A 50% FAILURE RATE.  *TR",
        "vin": "KNDMB233686"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/10/2010",
        "dateOfIncident": "11/18/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10308548,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DEFECTIVE THROTTLE POSITION SENSOR CAUSES THE SEDONA VAN TO SUDDENLY AND UNEXPECTEDLY STOP WITH NO THROTTLE CONTROL.  THIS IS A KNOWN DEFECT WITH THE MANUFACTURER, HOWEVER, THEY WILL NOT REPAIR UNTIL THE SENSOR FAILS.  THIS IS UNACCEPTABLE, CONSIDERING THAT THERE IS NO WARNING SIGNS, AND THE CAR HAS TO BE IN MOTION AT TIME OF FAILURE.  THIS COULD RESULT IN DEATH OR SERIOUS INJURY SHOULD THE FAILURE OCCUR AT HIGH SPEEDS OR IF IN A DRIVING SITUATION THAT REQUIRE ACCELERATOR.  IF TOYOTA WAS FORCED TO RECALL CARS BECAUSE OF A SLOW, PROGRESSIVE, WEARING OF THE THROTTLE CONTROL, THEN THE NHTSA SHOULD CLASSIFIED THIS DEFECT AS AN EVEN MORE SERIOUS THREAT TO CUSTOMER SAFETY.  OUT OF 40 VEHICLES IN OUR FLEET, 20 HAVE FAILED.  THIS IS A 50% FAILURE RATE.  *TR",
        "vin": "KNDMB233186"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/10/2010",
        "dateOfIncident": "11/18/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10308550,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DEFECTIVE THROTTLE POSITION SENSOR CAUSES THE SEDONA VAN TO SUDDENLY AND UNEXPECTEDLY STOP WITH NO THROTTLE CONTROL.  THIS IS A KNOWN DEFECT WITH THE MANUFACTURER, HOWEVER, THEY WILL NOT REPAIR UNTIL THE SENSOR FAILS.  THIS IS UNACCEPTABLE, CONSIDERING THAT THERE IS NO WARNING SIGNS, AND THE CAR HAS TO BE IN MOTION AT TIME OF FAILURE.  THIS COULD RESULT IN DEATH OR SERIOUS INJURY SHOULD THE FAILURE OCCUR AT HIGH SPEEDS OR IF IN A DRIVING SITUATION THAT REQUIRE ACCELERATOR.  IF TOYOTA WAS FORCED TO RECALL CARS BECAUSE OF A SLOW, PROGRESSIVE, WEARING OF THE THROTTLE CONTROL, THEN THE NHTSA SHOULD CLASSIFIED THIS DEFECT AS AN EVEN MORE SERIOUS THREAT TO CUSTOMER SAFETY.  OUT OF 40 VEHICLES IN OUR FLEET, 20 HAVE FAILED.  THIS IS A 50% FAILURE RATE.  *TR",
        "vin": "KNDMB233X86"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/10/2010",
        "dateOfIncident": "09/02/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10308551,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DEFECTIVE THROTTLE POSITION SENSOR CAUSES THE SEDONA VAN TO SUDDENLY AND UNEXPECTEDLY STOP WITH NO THROTTLE CONTROL.  THIS IS A KNOWN DEFECT WITH THE MANUFACTURER, HOWEVER, THEY WILL NOT REPAIR UNTIL THE SENSOR FAILS.  THIS IS UNACCEPTABLE, CONSIDERING THAT THERE IS NO WARNING SIGNS, AND THE CAR HAS TO BE IN MOTION AT TIME OF FAILURE.  THIS COULD RESULT IN DEATH OR SERIOUS INJURY SHOULD THE FAILURE OCCUR AT HIGH SPEEDS OR IF IN A DRIVING SITUATION THAT REQUIRE ACCELERATOR.  IF TOYOTA WAS FORCED TO RECALL CARS BECAUSE OF A SLOW, PROGRESSIVE, WEARING OF THE THROTTLE CONTROL, THEN THE NHTSA SHOULD CLASSIFIED THIS DEFECT AS AN EVEN MORE SERIOUS THREAT TO CUSTOMER SAFETY.  OUT OF 40 VEHICLES IN OUR FLEET, 20 HAVE FAILED.  THIS IS A 50% FAILURE RATE.  *TR",
        "vin": "KNDMB233686"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/10/2010",
        "dateOfIncident": "12/17/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10308555,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "DEFECTIVE THROTTLE POSITION SENSOR CAUSES THE SEDONA VAN TO SUDDENLY AND UNEXPECTEDLY STOP WITH NO THROTTLE CONTROL.  THIS IS A KNOWN DEFECT WITH THE MANUFACTURER, HOWEVER, THEY WILL NOT REPAIR UNTIL THE SENSOR FAILS.  THIS IS UNACCEPTABLE, CONSIDERING THAT THERE IS NO WARNING SIGNS, AND THE CAR HAS TO BE IN MOTION AT TIME OF FAILURE.  THIS COULD RESULT IN DEATH OR SERIOUS INJURY SHOULD THE FAILURE OCCUR AT HIGH SPEEDS OR IF IN A DRIVING SITUATION THAT REQUIRE ACCELERATOR.  IF TOYOTA WAS FORCED TO RECALL CARS BECAUSE OF A SLOW, PROGRESSIVE, WEARING OF THE THROTTLE CONTROL, THEN THE NHTSA SHOULD CLASSIFIED THIS DEFECT AS AN EVEN MORE SERIOUS THREAT TO CUSTOMER SAFETY.  OUT OF 40 VEHICLES IN OUR FLEET, 20 HAVE FAILED.  THIS IS A 50% FAILURE RATE.  *TR",
        "vin": "KNDMB233186"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/29/2009",
        "dateOfIncident": "12/26/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10297422,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SEDONA. WHILE DRIVING 70 MPH WITH THE CRUISE CONTROL ENGAGED HE PRESSED ON THE ACCELERATOR PEDAL, AND THEN THE PEDAL FELL COMPLETELY TO THE FLOORBOARD. WHILE ATTEMPTING TO PULL TO THE SIDE OF THE ROAD , THE VEHICLE STALLED. HE WAS ABLE TO RESTART THE VEHICLE. A TECHNICIAN FROM THE DEALER REPAIRED THE TBS SENSOR AND UPDATED THE ECU. THE FAILURE MILEAGE WAS 59000. THE CURRENT MILEAGE WAS 59054.",
        "vin": "KNDMB233386"
    },
    {
        "components": "POWER TRAIN,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/02/2009",
        "dateOfIncident": "10/27/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10290742,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WE RENTED A 2008 KIA SEDONA VAN WITH THE 3.8L ENGINE AND IT LOST POWER IN THE MIDDLE OF THE HIGHWAY AT SPEEDS OF 65-70MPH.  THE ENGINE DID NOT DIE, BUT THE CHECK ENGINE AND ESC WARNING LIGHTS CAME ON AND THERE WAS NO POWER BEING TRANSFERRED TO THE TRANSAXLE.  ON THE FIRST VAN THE INCIDENT OCCURRED AFTER DRIVING ONLY 50 MILES, THE REPLACEMENT VAN  WAS DRIVEN 1,286 BEFORE IT TOO DID THE SAME THING.  WE INFORMED ADVANTAGE CAR RENTAL THAT IT APPEARS TO BE A SYSTEMATIC PROBLEM WITH THAT MAKE AND MODEL. *TR",
        "vin": "KNDMB233686"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/16/2009",
        "dateOfIncident": "09/14/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10284162,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2008 KIA SEDONA. THE CONTACT STATED THAT WHILE DRIVING 60 MPH SHE LOST POWER STEERING. SHE RESTARTED THE VEHICLE AND RESUMED NORMAL OPERATION. THE INABILITY TO STEER THE VEHICLE INCREASED THE RISK OF A VEHICLE CRASH. THE VEHICLE WAS TAKEN TO A DEALER FOR INSPECTION AND THE TECHNICIAN REPLACED THE THROTTLE POSITION SENSOR. THE FAILURE MILEAGE WAS 15,200 AND THE CURRENT MILEAGE WAS 15,900.",
        "vin": "KNDMB233886"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES, HYDRAULIC,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/04/2009",
        "dateOfIncident": "05/18/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10282894,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2008 KIA SEDONA. WHILE  DRIVING THE VEHICLE AT VARIOUS SPEEDS, THE BRAKES BEGAN PULSATING AND THERE WAS EXCESSIVE VIBRATION IN THE  STEERING WHEEL INCLUDING A BURNING ODOR. THE STATED THAT THE FAILURE COULD BE RELATED TO THE WAY SHE DROVE THE VEHICLE. A SECOND DEALER STATED THAT BRAKES OVER HEATED AND THE BRAKE PADS AND ROTORS NEEDED TO BE REPLACED. THE CONTACT STATED THAT THE BRAKES SHOULD HAVE FAILED AT 15,000 MILES. THE VEHICLE WILL BE REPAIRED; HOWEVER, SHE STATED THAT THE BRAKES WERE DEFECTIVE.  THE FAILURE MILEAGE WAS 7000 AND THE CURRENT MILEAGE WAS 15,300.UPDATED 10/26/09. *LJ  THE ROTORS OVERHEATED AND WERE WARPED. THE AIR BAG LIGHT WAS ON. THE CONSUMER WAS ALSO INFORMED TIRES WERE NEED ON THE VEHICLE DUE TO CUPPING. UPDATED 10/26/09",
        "vin": "KNDMB233886"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/22/2009",
        "dateOfIncident": "07/18/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10277694,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "LET ME START BY SAYING WE LOVED THE VAN UP UNTIL THIS INCIDENT.  I WAS DRIVING ON THE INTERSTATE WITH MY FAMILY IN OUR 2008 KIA SEDONA.  I HAD THE CRUISE CONTROL SET TO 75 MPH, I WENT TO PASS SOMEONE AND WHEN I PUSHED THE ACCELERATOR TO PASS THE CAR.  I TRIED TO DISENGAGE THE CRUISE CONTROL BY PRESSING THE BRAKE AS WELL AS DOING IT MANUALLY BY PRESSING THE CRUISE CONTROL BUTTON.  I COULD NOT GET THE VAN TO SLOW DOWN EVEN THOUGH I WAS PUSHING THE BRAKE TO THE FLOOR.  AT ONE POINT I WAS DOING BETWEEN 90 AND 100 MPH.  I FINALLY MANAGED TO GET THE VAN STOPPED AND MY BRAKES WERE SMOKING EXTREMELY BAD.  I TOOK IT TO THE DEALER AND THEY SAID IT WAS A BAD BRAKE SWITCH.  THE DEALER ACTED LIKE IT WAS NO BIG DEAL.  I EXPLAINED THAT WE COULD HAVE BEEN INJURED OR EVEN KILLED. *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,INTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/21/2009",
        "dateOfIncident": "07/12/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10277660,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "IT ALL STARTED WHEN MY WIFE PICKED UP THE VEHICLE IN QUESTION  FROM A RENTAL SALESMAN, HE TOLD HER THAT SHE SHOULD NOT PLUG OUR GPS UNIT INTO THE CIGARETTE LIGHTER OR IT WOULD COST $90.00 FOR US TO REPAIR THE LIGHT THAT WOULD COME ON FOR THE AIR BAGS. WE DID NOT PLUG THE UNIT INTO THE CIGARETTE LIGHTER BUT PLUGGED IT INTO THE ACCESSORY POWER OUTLET. ON SUNDAY 07/12/09 I ENCOUNTERED A PROBLEM. THE AIR BAG LIGHT CAME ON, THE AIR CONDITIONER ONLY CAME ON HIGH, AND THE INTERIOR LIGHTS WENT OUT. IT'S AN ELECTRICAL PROBLEM IN THE OUTLETS. *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/28/2008",
        "dateOfIncident": "11/20/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10252965,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "INITIAL OCCURRENCE WAS ON NOVEMBER 20, 2008 WHEN OUR 2008 SEDONA WAS LESS THAN SEVEN MONTHS OLD AND WITH ONLY 13000 KILOMETERS ON IT.  VEHICLE STALLED WHEN TRYING TO START UP AFTER A FOUR WAY STOP.  THOUGHT SOME TYPE OF FLUKE? NO FURTHER OCCURRENCES FOR TWO TO THREE HUNDRED KILOMETERS UNTIL NOVEMBER 23, 2008 WHEN STALLED WHILE TURNING AT A BUSY INTERSECTION.  STALLED AGAIN AFTER PUT IN PARK AND RESTARTED.  TOOK TO DEALERSHIP WHERE SERVICED ON NOVEMBER 24, 2008 -CORRECTION:  \"SCAN CODE P2106/P1295/P0638 AND PO236 RESET AND RE-PROGRAM  - ROAD TEST ALL OK\"    LESS THAN 24 HOURS LATER, DURING EVENING RUSH HOUR THE SEDONA STALLED AGAIN BOTH STARTING UP AFTER HAVING BEEN STOPPED AND THEN A SHORT TIME LATER IN THE MIDST OF DRIVING AT THE POSTED SPEED LIMIT.  KIA OF NEWMARKET SERVICE WAS IMMEDIATELY CONTACTED AND WE WERE ADVISED TO DRIVE THE VEHICLE OVER, IF POSSIBLE.  THE SEDONA WAS RETURNED TO THE DEALERSHIP ON TUESDAY NOVEMBER 25, 2008.  ON WEDNESDAY, NOVEMBER 26, 2008 KIA WAS ASKED FOR AND WAS GRANTED PERMISSION TO DRIVE OUR SEDONA HOME THAT EVENING IN AN EFFORT TO EXPERIENCE THE STALLING PROBLEM FIRSTHAND.  WE WERE SUBSEQUENTLY ADVISED THAT THE VEHICLE STALLED FOR THE ADVISOR FIVE DIFFERENT TIMES.  ON OR ABOUT DECEMBER 4, 2008 THE MAIN COMPUTER WAS REPORTEDLY REPLACED WITH A BRAND NEW MAIN COMPUTER TAKEN FROM A 2009 SEDONA ON THE LOT IN AN EFFORT TO RESOLVE THE PROBLEM.  THE SERVICE ADVISOR ONCE AGAIN TOOK OUR SEDONA HOME AND BACK AND IT WAS REPORTEDLY RUNNING \"BEAUTIFULLY\" FOLLOWING THE REPLACEMENT OF THE MAIN COMPUTER.  ON FRIDAY, DECEMBER 5, 2008 THE SEDONA WAS PICKED UP - THE PAPERWORK WAS NOT SIGNED AS THEY WANTED TO LEAVE IT OPEN UNTIL FOLLOW UP WAS MADE.  AGAIN LESS THAN 24 HOURS LATER AFTER PICKING UP THE SEDONA THE SEDONA STALLED WHILE WE WERE DRIVING ON A BUSY STREET WITH SIX PEOPLE IN THE VAN.   APPARENTLY THEY HAVE AT THE DIRECTION OF KIA CANADA TRIED SEVERAL CODES SINCE THEN.  PROBLEM HAS STILL NOT BEEN DIAGNOSED AND VAN STILL AT KIA OVER ONE MONTH LATER! *TR",
        "vin": "KNDMB233086"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/28/2008",
        "dateOfIncident": "09/24/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10243827,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH ONLY 700 MILES ON SEDONA MINIVAN I HAVE HAD AN AIR BAG SENSOR GO BAD, A DRIVERS SIDE SLIDING DOOR SENSOR GO BAD, A PASSENGER SIDE FRONT DOOR SENSOR  GO BAD, THE IP COMPUTER (FUSE BOX) INSIDE VEHICLE NEAR DRIVERS SIDE) BURN UP COMPLETELY.  *TR",
        "vin": "KNDMB233586"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "07/19/2008",
        "dateOfIncident": "06/22/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10234948,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "KIA SEDONA( A DOLLAR RENTAL VEHICLE) PARKED ON A SLIGHT INCLINE IN THE DRIVEWAY ROLLED BACKWARDS WHEN IGNITION WAS TURNED OFF AND KEY REMOVED  WHILE VEHICLE WAS IN PARK.  *TR",
        "vin": "KNDMB233886"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING,TIRES",
        "crash": false,
        "dateComplaintFiled": "04/25/2008",
        "dateOfIncident": "04/20/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10225762,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "BAD MISFIRE.  THIS MISFIRE STARTED AT 14,000 MILES. I TOOK IT INTO THE DEALER TO HAVE IT LOOK AT THEY COLD NOT GET IT TO MISFIRE.  AS TIME WENT ON AT 20,000 THE MISFIRE BECAME WORSE, WE LEFT THE VAN FOR PM SERVICE WITH THE FIRST DEALER FOR ONE WEEK,WE WEAR ON VACATION.  THEY CALLED AND SAID THAT THE VAN WAS READY,THAT WAS ON A FRIDAY,I WENT TO PICK UP THE VAN FROM THE DEALER. WHEN I STARTED IT AND PUT IT IN DRIVE IT STARTED TO MISS.  I HAD THE SERVICE WRITER COME OVER AND I HAD HIM FELL THE MISS AND YOU COULD HEAR IT IN THE MOTOR COMPARTMENT,THE SERVICE WRITER HAD THE MEC LOOK AT THE VAN,THE MEC SAID AND THE SERVICE WRITER SAID THE IT WAS THE NO 2 COIL AND THAT KIA HAD A PROBLEM WITH THAT MOTOR MISFIRING,I LEFT THE VAN AND PICK IT UP ON SATURDAY. THEY REPLACED NO 2 COIL AND ONE PLUG,THEY SAID THEY DID ?  THE NEXT DAY,SUNDAY WE WENT TO  WEST PALM BEACH FOR A CRAFT SHOW,THE VAN SAT FOR 5HR, COMING HOME IT MISFIRE.  WHEN IT MISFIRES AT HIGHWAY SPEEDS THE CRUISE WILL GO OFF,THE TRANS SHIFTS HARD OUT OF OVER DRIVE THEN BACK INTO OVER DRIVE, WE HAVE COME CLOSE TO GETTING HIT ON 95 WHEN THIS HAPPENS.  THE MISFIRE BECAME WORSE,WE TOOK IT TO A 2 DEALER OUT IN CORAL SPRINGS,THE VAN NOW HAS 53,000.  THEY HAD IT FOR 8 DAYS, RESET THE ECM,AND PUT NEW PLUGS IN IT.  GOT IT BACK, STILL MISFIRING.  THE FRONT BRAKES WORE OUT ST 21,000. REPLACE THE BRAKE PADS,TURN ROTORS, THEY LAST ONLY 27,000. VERY BAD ON BRAKES.  FIRST SET OF TIRES 24,000. REPLACE THEM WITH GOODYEAR 70,000. BE LUCKY TO GET 40,000. VERY BAD ON TIRES. FRONT END TO HEAVY,EATS BRAKES AND TIRES.  HAD RIGHT FRONT CV AXLE REPLACE DO TO BEARING&SEAL DEFECT.  RIGHT REAR BEARING HUB REPLACE DO TO DEFECT.  WE DON'T FELL SAFE IN THIS VAN!  *TR",
        "vin": "KNDUP131346"
    }
]